{"Disposition":"Unresolved","Summary":"began with silent lights appearing every 5 seconds from the same exact spot.","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around September 22nd 2008"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"09/22/2008 08:00 UTC","Region":"Massachusetts","Object Shape":"Cylinder","Country":"United States","City":"Boston","Latitude":"42.361571","Longitude":"-71.052603","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.361571,+-71.052603(29420)&iwloc=A&hl=en\"> mufon case (29420) map </A>","Weather Factors":"None","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29420.html.txt","/var/www/straped/mufon/org/29420.html"],"Date Submitted":"06/06/2011 12:42 UTC","Case Number":"29420","Log Number":"US-06062011-0001","divs":["Sighting DetailsThe night began watching tv i live on the third floor of an apartment building. I went out my deck to smoke a cigarette, I took notice to something i thoguht was unusual. I happen to look up in the sky and every 5 seconds i would see a light moving across the sky silently from the same exact spot every time. At firtst i thought there was something going on with the military because it seemed like there was too many \"planes\" in the sky, but it was just silent; so it couldn't have been. I called and reported apprehensivley and asked if they were aware of any military planes in the area. I had to hang up because she made me feel crazy. I then went back outside and now had a witness to confirm that was seeing it correctly. After this was confirmed, the lights seemed to scatter everywhere, around and in the distance of my building. Then for some reason i looked over my shoulder and up and saw two lights shining directly down. The object was about 50 feet above our heads and in a matter of seconds the lights turned upright and this is when i saw the shape of a capsule. Almost acorn like or the space shuttle capsule. There was no noise at all. My hair stood up and time seemed to stand still and slow down and my heart started to pound in disbelief. I watched this turn upright, and silently at a speed i cant fathom and watched as it went off into eternity. It was so fast that it felt surreal and I couldn't beleive it. I never believed but this has changed me and the person i was with. I took me a long time to come to terms with what i saw. If possible please do not make public my email address, if MUFON wants to ask me a question then thats no problem. I feel crazy even sending this."]}