{"Summary":"Looked like a star,got dimmer & brighter,moved in all directions","divs":["Sighting DetailsThis is not the first time I have seen these here. Like usual, I was outside, taking the trash out and smoking a cigarette. I looked up and noticed a star that appeared to be moving. I got my friend's attention and he saw it too, then I went inside and got my cousin and she saw it as well. It looked just like any regular star in the sky, but it would go from so dim that it disappeared to super bright. It would do this off and on and never stayed bright or dim, always changing. It would stop at some points and then start to move again, but always moved slow...sometimes it would be stopped and then all of a sudden move real quick in a jerky motion, then stop again or continue to move but super slow. It would go up, then at times it would zig zag real quick..like for only a second...other times it would move to the right real quick, jerky like then continue up...and then at times it would go left and then up, one time it went up..then right...then up..then left..then stopped..then disappeared for a few minutes, then reappeared super bright...then move slowly and get dimmer. About 15 minutes after we started watching it, some what appeared to be some type of military jets or something...usually always see them after I notice one of these things. First we noticed something (jets) moving super fast going straight up and to the left of the object we were watching, then we saw another jet or jets coming from the right and going left below the object we were watching. The object continued to appear and disappear, get dimmer and brighter, move in all directions, then about another 10 minutes later, more jets came in from the left and were going right. At this point we noticed that there was more than one object in the sky moving like the first one...but they did not get as bright and were not quite as noticable as the first object. My neck started hurting from looking up and watching all of this go on in the sky so I came inside. I am about to go back out right now and see if it or they are still up there. This whole time it stayed in the same general area, did not go across the sky like any plane,jet, shooting star, satelite, or anything of the sort does. I tried to get it on video but I do not have a good video camera and it just appeared all black on the screen."],"Longitude":"-119.139252","Country":"United States","Object Shape":"Star-like","City":"Exeter","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.305691,+-119.139252(29436)&iwloc=A&hl=en\"> mufon case (29436) map </A>","Region":"California","Log Number":"US-06072011-0004","Date Submitted":"06/07/2011 02:45 UTC","files":["/var/www/straped/mufon/html2text/29436.html.txt","/var/www/straped/mufon/org/29436.html"],"Object Features":"Unknown","Case Number":"29436","Weather Factors":"None","trends":["There have been 2 other sightings in Exeter","There were no other sightings in Exeter on or around June 6th 2011"],"Viewing Distance":"Over 1 Mile, Unknown","Latitude":"36.305691","Tags":"City","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"06/06/2011 10:30 UTC"}