{"Viewing Distance":"Over One Mile","Case Number":"29433","Object Flight Path":"Straight-line path","Disposition":"IFO","Object Features":"Unknown","Object Shape":"Circle, Sphere","Longitude":"-81.941164","City":"Lakeland","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around June 6th 2011"],"Date Submitted":"06/07/2011 12:45 UTC","Region":"Florida","Date of the Event":"06/06/2011 10:35 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/29433.html.txt","/var/www/straped/mufon/org/29433.html"],"Latitude":"28.045555","divs":["Sighting DetailsI was driving home from working out on the same route I've taken many, many times before. There is an small airport right near the area I was in when I saw the object however this object appeared to be far off in the distance to the West. I do not live in the area I saw the object either, but, I moved from there to a place about 20 minutes West just about 2 months (this specific area I lived in for about 4 years and it is in my hometown of 31 years so I feel fairly confident about saying this was not a normal occurrence for the area. I was heading west at about 10:30 at night and I happened to be looking up at the Moon when I saw it. The object was a circular shape and, from my vantage point, appeared flat. It was very brief, maybe 3 seconds, but in that time it flashed from a bright and pale blue to totally invisible to me two times before totally leaving my field of view. It may have been nothing but I know that no meteor I've ever seen flashes and the distance this thing seemed to travel, from my perspective, was very large. Also, I think I made out a darker circle within the larger, main one but it was such a short view and moved so quickly I can not be 100% certain about this fact. I'd love to know if anyone else happened to see this but I know the likelihood of that is very small. I was contacted by a MUFON investigator on another sighting I posted here in the past and would welcome talking with him, or another investigator, about this sighting as well."],"Weather Factors":"Unknown","Sighting Duration":"00:00:03","Summary":"Appeared as an extremely fast moving, bright pale blue, circle possibly with a trail.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=28.045555,+-81.941164(29433)&iwloc=A&hl=en\"> mufon case (29433) map </A>","Log Number":"US-06072011-0001","Source":"MUFON"}