{"City":"Funston","files":["/var/www/straped/mufon/html2text/29438.html.txt","/var/www/straped/mufon/org/29438.html"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","Region":"Texas","Case Number":"29438","Disposition":"Unknown","Country":"United States","trends":["There have been no other sightings in Funston","This sighting has never been favorited."],"Date Submitted":"08/09/2011 01:40 UTC","Summary":"Silent/Hovering Triangular-Formation of Lights Suddenly Took Off","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"32.751505","Log Number":"US-08092011-0082","Date of the Event":"06/06/2011 10:15 UTC","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=32.751505,+-99.800093(29438)&iwloc=A&hl=en\"> mufon case (29438) map </A>","Longitude":"-99.800093","divs":["sighting detailsmy mother and i were heading west down us 180 about 3 miles east of the small unincorporated community of funston, tx, in jones county around 10:15pm on the evening of june 6, 2011. while looking at the road, i noticed a low flying object, that i thought to be a plane. as it crossed over the road in front of us, we joked around about the possibility of it being a \"ufo.\" finally, the object stopped; and seemed to hover in midair. as we got closer, we could see the object had white\\green led like lights on the bottom, and there was also a flashing red light in the center. the lights were arranged in a triangular formation. as we got closer, we believed the object to be a radio tower. but as we pulled up to the point where we were about even with the object, we could tell it had more \"depth,\" than just a radio tower. this thing was big. the object was still hovering over what i believe is a field (probably hovering around 70-100'). i stopped the vehicle on the shoulder of the highway and my mother rolled the window down. instantly the object began to move slowly in an east-northeast direction. the object had absolutely no sound whatsoever as it began to move; it began to move faster and faster. i immediately turned the car around and headed east down us 180 as i tried to see where the object went. the lights got smaller and smaller and finally appeared as only one light that flashed. the object kept getting smaller and smaller and i decided to turn around. i felt very confused, yet excited about what i had just seen. later that night, the excitement turned to a slight amount of fear. i didn't know if this was some kind of plane, jet, helicopter, or et life...it was certainly a highlight of the night. we both discussed what we had just seen, and both questioned how it could be a plane\\jet since there was no sound. whatever it was, it did not like it when we stopped the vehicle. it took off immediately. never was there a sound. it was an extremely weird night...."],"Weather Factors":"Windy, Light"}