{"City":"Auburn","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Auburn","There were no other sightings in Auburn on or around June 6th 2011"],"Log Number":"US-06072011-0002","Latitude":"41.368644","files":["/var/www/straped/mufon/html2text/29434.html.txt","/var/www/straped/mufon/org/29434.html"],"Longitude":"-85.057758","Source":"MUFON","Date of the Event":"06/06/2011 12:00 UTC","Summary":"A star=like figure suddenly appeared in sky","Object Shape":"Star-like","divs":["Sighting DetailsI was sitting on my patio with my husband and happen to be looking to the northwest around 10PM and a star suddenly appeared in the sky, which surprised me. It was twinkling and emitting a red and white color. By judging, it was as far off as a airline jet would be in the sky. I thought it was a airplane, but then it didn't move. From where I was sitting, I could look up and see 4 electrical wires on poles and the object was above the wires, not moving. I went in the house for about 2 minutes, came out and sat down in the same chair and the object had moved below the first wire! This caught my attention, so I watched it more closely. I had my husband look it it also. Slowly it descended below the second wire, then slowly went back up, all along using the eletrical wires to judge where it was at. This all occured in a matter of minutes. Then it descended back down then moved northwest moving quite a distant. I suddenly saw a plane fly across the path it had been in...and I knew this was a plane. All a sudden I saw another very faint orb-like object appear to the southwest of the plane and the first star like object. Now I was watching the electric pole to judge the first object and it was just pass it. The second faint orb did nothing for several moments, then suddenly glowed for half a second I would guess. Then the first orb started to slowly move more northwest...and the second orb followed, emitting a glow every few minutes. I began to judge the second orb movements by the electrical wires...and it appeared to be following the first orb, although the kept the same distance from each other. I observed two more airplanes fly between the two orbs during this time. Finally I went in the house, but I could still see both orbs in the distant sky. I really have no idea what they were...but I do know they weren't planes. I did get my camcorder out to try and video tape them, but it was too dark."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.368644,+-85.057758(29434)&iwloc=A&hl=en\"> mufon case (29434) map </A>","Viewing Distance":"Over One Mile","Date Submitted":"06/07/2011 02:14 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Case Number":"29434","Disposition":"Unknown","Region":"Indiana","Object Features":"Unknown","Weather Factors":"None","Tags":"City"}