{"Disposition":"Unknown","Latitude":"41.884204","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around June 6th 2011"],"Date Submitted":"06/07/2011 04:47 UTC","Longitude":"-87.626548","files":["/var/www/straped/mufon/html2text/29439.html.txt","/var/www/straped/mufon/org/29439.html"],"Log Number":"US-06072011-0007","map":"<A HREF = \"http://maps.google.com/maps?q=41.884204,+-87.626548(29439)&iwloc=A&hl=en\"> mufon case (29439) map </A>","City":"Chicago","Source":"MUFON","divs":["Sighting DetailsI was trying to get internet connection on my girlfriends cellphone when i noticed it was very difficult to get any connection so i stepped outside to get better signal i moved the cellphone around to see if I could get better connection when I noticed an object in the sky first in the north moving in almost a straight south path above my house below the clouds it didn't have any recognizable airplane lights or noise it moved as if it was gliding forward without any loss of altitude the color of the object was grayish to white with what looked like a dim white led light on the bottom, its diameter was round with a flat bottom I immediately called my girlfriend to witness the object along with my neighbor whom i called out of his house. We watched the object move steadily n to s when my girlfriend noticed a few more dim orange yellow lights above the clouds following it a row moving at the same speed,direction and path until it was over my house about 600 ft behind my house then the object stopped in the sky and went up into the clouds and disappeared. During the event i felt chills and goosebumps because i was thinking to my self their back again also felling a little scared and anxious. This is not first time there has been an object float across the sky in front of my house. I have seen them move over my house moving in the same direction about two years ago that event was with a red pulsating sphere. Also seeing them off the waters edge of navy pier numerous yellow orange dots falling left to right only after to look up and notice all the stars shift in the sky then back again in place like a big object was moving above us"],"Object Shape":"Circle, Disc, Saturn-like","Case Number":"29439","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Country":"United States","Region":"Illinois","Object Flight Path":"Straight-line path,Path then hovering","Date of the Event":"06/06/2011 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"I noticed a almost dim white object in the sky above my house moving n to s at low altitude below the clouds"}