{"Viewing Distance":"Unknown","City":"West Harrison","Latitude":"39.269328","Case Number":"29435","trends":["There have been 3 other sightings in West Harrison","There were no other sightings in West Harrison on or around June 15th 1973"],"Disposition":"Insufficient Data","Region":"Indiana","Source":"MUFON","Tags":"City","Summary":"Saw a flying saucer fly over the road and zip away","Weather Factors":"Unknown","Log Number":"US-06072011-0003","Country":"United States","Date Submitted":"06/07/2011 02:33 UTC","Date of the Event":"06/15/1973 12:00 UTC","Sighting Duration":"00:00:10","Longitude":"-84.813815","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/29435.html.txt","/var/www/straped/mufon/org/29435.html"],"divs":["Sighting DetailsI was riding around with a friend one evening out in the country near our hometown on the Ohio-Indiana border. It was dark. On one stretch of road we came around a turn with trees on the left side and a field on the right. The road stretched out for maybe 400 feet in front of us. To our left I saw something bright through the trees moving towards the road in front of us maybe 200 feet down the road. It was low, no more than 50 feet above the trees. As it broke into the open I was shocked to see it was a flying saucer. It looked like two saucers put together like this <=>. It was brightly lit like it was glowing from within. It was red on the bottom and green on top. Maybe it was the other way around, it's been a long time. There were no lights or other cars around. As it flew over the road I leaned forward and put my hand on the dash. When it was just past the road it sped up until it was moving so fast it became a streak of light. It just zipped away. Nothing can move that fast. I stared after it for a second then looked over at my friend who was driving. It was then I noticed he had stopped and was staring after it as I had been. He looked at me and said \"Let's get the hell out of here!\" It really scared us and shook us up. We drove quickly back to town."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.269328,+-84.813815(29435)&iwloc=A&hl=en\"> mufon case (29435) map </A>","Object Shape":"Other","Object Flight Path":"Undisclosed"}