{"map":"<A HREF = \"http://maps.google.com/maps?q=37.132798,+-104.848884(29443)&iwloc=A&hl=en\"> mufon case (29443) map </A>","Source":"MUFON","Weather Factors":"None","Case Number":"29443","Latitude":"37.132798","Date of the Event":"05/18/2011 10:10 UTC","Region":"Colorado","Country":"United States","Date Submitted":"06/07/2011 02:35 UTC","Tags":"City","Viewing Distance":"Over One Mile","Log Number":"US-06072011-0010","Longitude":"-104.848884","divs":["sighting detailsweston, colorado is the closest major city i can conjure up that it was sighted over. it was late at night and completely dark except for a few stars and a waning moon. i was hiking back to an oil drill with some friends on a farm and when we came back to a clearing, we all noticed that basically every single animal living on the farm had followed us thru the woods and back to the clearing. 5 dogs and about the same number of cats. it was eerily still and quiet. we had also heard coyotes\\wolves howling about an hour before sighting for at least 30 minutes. i glanced up at the sky and my first reaction was \"wow, that is a really bright star\"\\\"wow that one individual star is brighter than all others and putting off a lot of light\". then i realized how much it was twinkling. i thought \"okay, i know stars do twinkle like the song but this thing is strobing\". still unconvinced it was potentially a ufo\\alien spacecraft, it then began to move. back and forth. and up and down a little but mostly back and forth. i summoned 2 of my friends i was with to coo-berate this with me and they couldn't believe their eyes either! it kept moving side to side, and then disappeared\\faded out. within seconds, it reappeared in the same exact spot, moved a little more, then disappeared\\faded out for good."],"Object Flight Path":"Path with directional change","Object Features":"Unknown","Disposition":"IFO","Summary":"Very Bright, Multi Colored, Twinkling Object moving randomly","Object Shape":"Star-like","City":"Weston","trends":["There have been no other sightings in Weston","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/29443.html.txt","/var/www/straped/mufon/org/29443.html"],"Sighting Duration":"Undisclosed"}