{"Object Flight Path":"Stationary","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"06/08/2011 01:12 UTC","trends":["There have been 24 other sightings in North Myrtle Beach","There was one other sighting in North Myrtle Beach on or around June 7th 2011"],"Object Shape":"Sphere","Date of the Event":"06/07/2011 10:15 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29447.html.txt","/var/www/straped/mufon/org/29447.html"],"Disposition":"Unknown","Country":"United States","City":"North Myrtle Beach","Summary":"6/7/2011 3 Red-Orange Points of light (Then 2) turning on and off in sequence over N. Myrtle Beach","Longitude":"-78.671686","Region":"South Carolina","Source":"MUFON","Latitude":"33.818006","Log Number":"US-06082011-0001","Object Features":"None","divs":["sighting detailsi was sitting at the beach staring out at the ocean when i saw a bright red orange light appear directly in front of me over the ocean at about a height of 40 degrees in the sky, within another second another light appeared to the right of it, and another second later a third light appeared beneath them creating a triangle that was upside down. after 1-2 more seconds the lights turned off in sequence in the same order they turned on with around a second passing between each light disappearing. knowing that this was no ship\\plane\\man-made\\natural object i decided to walk down the beach closer to where i was staying while still staring at the same point in the sky. around 5-10 minutes later another one of the points appeared in the same area and after another second a second point appeared directly next to it. they stayed on together for 1-2 seconds and then turned off in sequence as with the first event. at this point i went back to my room to investigate similar events. i was back at the beach from 10:45-12:00 and saw nothing else."],"Case Number":"29447","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.818006,+-78.671686(29447)&iwloc=A&hl=en\"> mufon case (29447) map </A>"}