{"Date of the Event":"06/08/2011 11:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.443648,+-82.90686(29451)&iwloc=A&hl=en\"> mufon case (29451) map </A>","Object Features":"Undisclosed","Object Shape":"Star-like","Date Submitted":"06/08/2011 03:14 UTC","Summary":"Star like lights flying over the Grosse Pointe Woods area in Michigan.","files":["/var/www/straped/mufon/html2text/29451.html.txt","/var/www/straped/mufon/org/29451.html"],"divs":["Sighting DetailsI was hanging out at a friends house and we decided to star gaze for the night since it was a beautiful day and clear night. It didnt take long for the first ufo to fly over. From my perspective I saw what first looked like a star moving slowly across the sky. I automatically knew that it couldnt be a plane because first, it was high enough to be thought as a star second, it didnt make any sound and it disappeared right after it cross over me. Man made object usually have flashing lights, this didnt, it was just a glowing light moving very swift through the night sky. After that first sighting, I didnt take my eye off the sky for a spit second. As minutes went by I began to see more of these star like objects crossing the night sky one by one about every 20 minutes. One in particular was crossing the sky in a swirl zig zag way, like the way a snake moves on the ground. After about a hour's past, I have seen a total of 6 unidentified objects. That really amazes me because this is my 3 ufo sighting in the past 3 weeks for me and I have never seen any before so. One that completely blew me away was a week ago when me and a buddy were laying on a trampoline star gazing and we both saw a object that looked like a moving star due to how far away it seemed. It was moving at a very slow rate to a complete stop when it then turned into a huge blue flash and it was gone. Something that gets me is that tonight, each time I lost sight of the ufo it was a few seconds each time one would pass. As if it was flying so fast in space, I only got quick glimpses of them. I dont know how to explain what I have me seeing in the night skies lately but I hope its a sign that change is coming somehow and they can finally reveal themselves to our planet with open arms. Thats all i have to say."],"trends":["There has been one other sighting in Grosse Pointe Woods","There were no other sightings in Grosse Pointe Woods on or around June 8th 2011"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Region":"Michigan","Source":"MUFON","Longitude":"-82.90686","City":"Grosse Pointe Woods","Tags":"City","Log Number":"US-06082011-0005","Disposition":"Unknown","Country":"United States","Case Number":"29451","Latitude":"42.443648","Weather Factors":"Unknown"}