{"Object Shape":"Triangle","divs":["Sighting DetailsI was sixteen at the time and living in a group home just outside of millbrook newyork, I was on van detail(cleaning the vans) with a friend that night after group. It was about 10:30 in the middle of november so it was pretty chilly. we just finished washing the last of three vans and I grabbed the hose and stepped back to begin rinsing, so I was standing maybe 6 or 7 feet from the van on the passenger side. At that point I noticed a group of lights some distance away. At first glance I took it for an airplane, (at first) because it was triangular shaped, and was moving too slow to be a plane. After watching for about thirty seconds another one appeared trailing behind it.(when i say appeared i mean suddenly it was there, like turning on a light switch) then a third appeared, in the same way. now we have three sets of lights, and each set had three lights, each one triangular in shape. the second and third craft followed the same path as the first, which was I guess you would call a serpentine flight path. I would have to say that they were at the height you would expect a passenger plane to fly. maybe about a mile from where we were standing. my friend greg didnt notice until he saw me just standing looking over the van, by this time the second one had appeared, asked me what it was, I said I didnt know.I wanted to say that they were planes, but I have never seen planes move the way they did, flying in the pattern they were flying and as slow as they were moving, back and forth in an \"s\" pattern. dropping below the mountain range then coming back up. so my next guess was helicopters. Now I'm sure that helicopters could probably match the manuvers that these craft were performing, but not as close as they were to each other, and there was no sound, none. so for the next maybe 25, 30 minutes this went on. And greg and I watched until they dropped below the horizon one last time and didnt reappear. now during this time I didnt experiance any strange sensations other than feeling compelled to watch. after standing outside for another few minutes trying to make sense of what we just watched, and neither of us not wanting to say what we were really thinking I reached to open the back door and thats when I noticed the two dogs that lived there were just on the other side, with their ears up, on alert. I opened the door Brutus,(a great dane) and Sarge,(a german shepperd) bolted out the door. and like a bat out of hell they took off into the woods. after about 10 to 15 seconds there was a huge commotion in the woods. what sounded like at least half a dozen dogs barking, snarling, and some howling. and something screaming.(i say something because it wasnt a dog. it was something I couldnt identify) now that scared me. withinin seconds our dogs came running back, I mean really fast and were uneasy and very nervous for most of the night. later on I would say around 1:30 the girls in the girls dorm started screaming and said they saw someone at the balcony door. I dont know if that was related to what greg and I saw or the incident with the dogs but needless to say it was a very strange night to say the least. I guess the reason I am telling this story is because I want to know if anyone else in the ducthess county area witnessed these craft around november of 1986"],"Sighting Duration":"Undisclosed","Log Number":"US-06082011-0015","Object Features":"Unknown","Object Flight Path":"Other","trends":["There has been one other sighting in Millbrook","There were no other sightings in Millbrook on or around October 31st 1986"],"Longitude":"-73.692648","Country":"United States","Disposition":"Unknown","Date Submitted":"06/08/2011 11:30 UTC","Latitude":"41.789914","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Region":"New York","Weather Factors":"None","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29462.html.txt","/var/www/straped/mufon/org/29462.html"],"Summary":"three seperate craft on manuvers in the night sky","Date of the Event":"10/31/1986 10:30 UTC","City":"Millbrook","Case Number":"29462","map":"<A HREF = \"http://maps.google.com/maps?q=41.789914,+-73.692648(29462)&iwloc=A&hl=en\"> mufon case (29462) map </A>"}