{"Log Number":"US-06092011-0002","trends":["There have been 39 other sightings in Wichita","There was one other sighting in Wichita on or around June 8th 2011","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Latitude":"37.696606","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/29464.html.txt","/var/www/straped/mufon/more/29464_submitter_file1__LightsInSkyOverWichita20110608-930pm.jpg","/var/www/straped/mufon/org/29464.html"],"Case Number":"29464","divs":["Sighting DetailsMy wife and I took our dog for a walk some time after 9pm. We had barely even begun our walk around Harvest Park when I noticed the lights in the sky. Two craft, closer than I've ever seen two craft together. They weren't air show close, but they were closer than I could imagine would be safe for civilian craft, with one slightly elevated above the other. They were identical, and had both solid and blinking lights, the color of which I would describe as a deep, saturated yellow. They were low, less than 20 degress above the horizon, traveling at a steady rate of speed without changing direction. The air speed wasn't out of range of terrestrial craft, but they were moving at a pretty good clip. I immediately regretted not taking my phone. I could have shot photos or even taken video. There was still a bit of light in the sky and they were close enough. I also wish I had done a better job of chiseling details into memory. I know they had more than 3 lights visible each, but I can't remember if it was 4 or 5. I can't recall the positioning of the lights relative to which were blinking and which were steady. I am attaching a mockup I made in Photoshop. Bear in mind my memory of the craft is somewhat sketchy, so it's not completely accurate. I stopped and watched the craft track from east to south as my wife walked on. I listened intently, but heard nothing but the wind. And the wind was coming from the direction of the craft. No jet engine roar. No propeller noise. No helicopter sound. They were so low, they actually disappeared behind trees on the horizon. I ran to catch up with my wife. No sooner did I reach her and the dog than we spotted another pair of identical craft to the north, heading west. These were a bit farther off and slightly higher up, but they were just as close to each other. It gets stranger. I wanted to rule out helicopters before making a final judgement, so I made a series of phone calls. First, I called Wesley Medical Center, Wichita Life Watch and Eagle Med to determine they didn't have any helicopters paired up and working over Wichita at the time. I called the local FAA who said they didn't know of anything. They pointed me to the Mid-Continent control tower. This is where my hunt for an answer took a turn. I had a very weird conversation with a woman named Peggy. I literally didn't even have my question out before she was answering it. No there wasn't anything going on. She was outside at that time and didn't see anything. But here's the deal - I hadn't even mentioned the time frame before she had begun answering my question, and confidently at that. My intuition was screaming. I have no proof, but I can tell you it seemed very much like she knew exactly what I was talking about before I was even done talking about it. She was outside at that time and didn't see anything? She started answering before I even mentioned the time! I quickly developed the impression I might be the first person she'd talked to about lights in the sky last night. Then Peggy suggested I talk to the TV news stations in town. If anything was going on, those people always knew about it, she said. She was almost confrontational at this point. But I wasn't looking for information on UFOs, and I hadn't even alluded to them. I was looking for info on aircraft in the sky at that time. Why did she go there? Why was the traffic control information person pawning me off to news stations about craft in the sky, anyway? Does. Not. Add. Up! Last night was warm and there were other people out and about. I figured if my wife and I saw something over a densely populated area, certainly someone else did. So I checked UFOstalker this morning. I do this almost daily anyway, and I can tell you it's rare to have a recent MUFON report from our region. Anything close is usually from Oklahoma or Kansas City (there has been a spate of sightings of multiple orange lights there recently). But lo and behold, there was a marker over Wichita, KS this morning - the first since May 23! Seems someone on the east side of town saw something, too. This sighting is similar in that there were two craft together, but these were described as orange lights. If you're from the area and are reading this because you're looking to see if someone else saw what you saw last night, please leave a comment on this blog post and tell us what you saw! Then, report it at MUFONdotcom. For the sake of Truth, please do it."],"Date Submitted":"06/09/2011 02:13 UTC","Object Features":"Unknown","Longitude":"-97.336525","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.696606,+-97.336525(29464)&iwloc=A&hl=en\"> mufon case (29464) map </A>","Object Flight Path":"Straight-line path","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Summary":"2 pairs of silent craft with multiple yellow lights","Date of the Event":"06/08/2011 09:30 UTC","City":"Wichita","Region":"Kansas","Tags":"City"}