{"Source":"MUFON","Region":"Ohio","Object Shape":"Flash, Star-like, Teardrop","Latitude":"40.54887","Country":"United States","Log Number":"US-08022011-0001","Date Submitted":"08/02/2011 12:10 UTC","Longitude":"-84.400414","files":["/var/www/straped/mufon/html2text/29463.html.txt","/var/www/straped/mufon/org/29463.html"],"City":"St. Marys","Date of the Event":"06/09/2011 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.54887,+-84.400414(29463)&iwloc=A&hl=en\"> mufon case (29463) map </A>","Summary":"Extremely Bright Light Zipped Across The Sky","Case Number":"29463","Disposition":"Insufficient Data","trends":["There has been one other sighting in St. Marys","There were no other sightings in St. Marys on or around June 9th 2011"],"divs":["Sighting DetailsI was sitting outside most of the night looking up at the sky. At approximately 11:00 pm to Midnight ( somewhere in that time frame ) i saw what appeared to be a meteor at first burning in the sky...But upon closer inspection this was not the case. An extremely bright light lit up above the house...Reminded me of a florescent bulb...started off kind of slow the zipped over the house extremely fast and extremely bright...went behind the trees and it was almost like it dimmed itself and was not visible around the other side of the tree. This light could not of been more than a couple hundred feet off the ground it was extremely close and fast. There was no noise what so ever. Ive seen meteorites fall before and this just couldn't of been one in my opinion. My grandmother also saw this as she was sitting right beside me. We both just kind of froze in place. My initial response to question myself if i really just saw that. It was that wierd of an occurrence. It was witnessed out in the country about a mile south east of grand lake. I think its ironic that we were talking about UFO when we saw it."],"Object Features":"Unknown"}