{"Latitude":"26.274452","Disposition":"Unknown","trends":["There have been 18 other sightings in Coral Springs","There were no other sightings in Coral Springs on or around January 31st 2011"],"Object Features":"Unknown","Date of the Event":"01/31/2011 08:15 UTC","Case Number":"29465","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"06/09/2011 02:29 UTC","Longitude":"-80.267674","Region":"Florida","divs":["sighting detailsi looked to the west at around 8-8:30 p.m. and saw what looked like a star, but it was moving. it had a redish-orangeish hue to it and there were no lights blinking, no sound. it moved zig-zig across the sky in a linear fashion, from north to south, south to north, then it would fly up straight and disappear, then reappear. then it would stop and just sit there and after a few seconds, it would start to move again across the sky...again, no flickering lights like a plane or jet, no lights\\search light from a helicopter (it was up rather too high to be a helicopter; however, couldn't tell you how high it was), no sound. at one point a small plane was heading toward its direction and as it do so, the object moved away from the plane in a linear fashion. after the plane was gone, it moved back toward the north without turning. it just moved back to position in that linear\\straight fashion. it moved, disappeared, reappeared...and then it turned to a bright, white light and took off at a high speed to the southwest - i said omg. it wasn't a plane, jet, or helicopter..that's all i know- definitely not normal. i have seen meteors and \"falling stars\" (which it wasn't), and this was not a plane, jet, or helicopter, or satellite (unless satellites are able to move back and forth across the sky in a linear fashion like that). it looked like a reddish light (as bright as a star; no blinking light, no sound), maneuvering back and forth from the north to south, south to north, and then would hover for several seconds (looked like it was over the everglades - that's how far west i live), and it was intelligently controlled, as when the small plane headed toward it, it moved to the south at a high speed to get away from the plane, so....like i said, it was a ufo in my opinion, and after my being on this planet for 52 years - have never seen anything like it - makes me wonder what or who is flying around in our skies at night and for what purpose (my roommate also witnessed it, as i called her outside to see it, too). it was there for approx 10 minutes, then took off at high speed to the sw."],"Country":"United States","Object Shape":"Egg, Oval, Sphere, Star-like","Log Number":"US-06092011-0003","files":["/var/www/straped/mufon/html2text/29465.html.txt","/var/www/straped/mufon/org/29465.html"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Tags":"City","City":"Coral Springs","Weather Factors":"Unknown","Source":"MUFON","Summary":"Look up towards the West and saw a UFO which first looked like a star, but it was moving back and forth from North to South, South to North.","map":"<A HREF = \"http://maps.google.com/maps?q=26.274452,+-80.267674(29465)&iwloc=A&hl=en\"> mufon case (29465) map </A>"}