{"divs":["Sighting DetailsLast night I saw 2 events on the beach in front of the resort I was staying at(Ocean Creek) [which I reported] Tonight my Dad and I decided walk walk don to the beach a little earlier to see what we could see. We reached the shoreline at 9:35 and immediately saw 3 red-orange flashes to our SE. Over the next hour we saw 7-9 grouping of the red-orange lights flashing with anywhere from 1-7 lights in each event usually flashing in a sequence, once with two flashing on and off moving in a line across the sky. After 40 minutes we saw what appeared to be 4 fighter jets (my dad saw 6) flying at a very high altitude to where the highest amount of activity had been over the ocean. They then returned from the direct that they came from. We saw 2 more events after this with the red-orange flares. The last occurring at 10:34pm. We never heard anything, but that is not unusual due to the high speed winds coming off the ocean. The total number of red-orange lights we saw was probably between 40-60 over the course of the hour"],"Object Flight Path":"Stationary,Straight-line path,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.817506,+-78.677506(29461)&iwloc=A&hl=en\"> mufon case (29461) map </A>","Tags":"City","Log Number":"US-06082011-0014","Region":"South Carolina","Object Features":"Unknown","Summary":"From 9:35-10:35 saw multiple Red-Orange spheres light up from N. Myrtle Beach","files":["/var/www/straped/mufon/html2text/29461.html.txt","/var/www/straped/mufon/org/29461.html"],"Longitude":"-78.677506","Disposition":"Unknown","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 24 other sightings in North Myrtle Beach","There was one other sighting in North Myrtle Beach on or around June 8th 2011"],"Date Submitted":"06/08/2011 11:26 UTC","Object Shape":"Fireball, Flash, Sphere, Star-like","Source":"MUFON","Case Number":"29461","Sighting Duration":"Undisclosed","Latitude":"33.817506","Weather Factors":"Unknown","Date of the Event":"06/08/2011 12:00 UTC","City":"North Myrtle Beach"}