{"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Holden Beach","There were no other sightings in Holden Beach on or around June 8th 2011"],"Object Shape":"Bullet, Missile, Circle, Flash","Disposition":"IFO","Summary":"Lights","Sighting Duration":"Undisclosed","Longitude":"-78.303889","Source":"MUFON","Tags":"City","Date Submitted":"06/08/2011 11:08 UTC","Case Number":"29460","map":"<A HREF = \"http://maps.google.com/maps?q=33.913506,+-78.303889(29460)&iwloc=A&hl=en\"> mufon case (29460) map </A>","City":"Holden Beach","Date of the Event":"06/08/2011 09:15 UTC","Region":"North Carolina","divs":["sighting detailsfirst saw the series of lights over the ocean (clear night, so no cloud to judge height) while sitting on the front porch of a beach house overlooking the beach. one light, then another to the right of it, and then another. each light would hold anywhere from a second to 15 seconds. they didn't turn on or off, but would flare up and back down, like the fire of an engine or something hot. the objects would appear, dissappear and fly off at different intervals. at one point there were 8+ lights in the sky. the way they would appear\\disappear reminded me of how starships would come out of hyperspace in star wars, except the brightness of the engines would only flare as it was stopping and then the light would fade as it moved away. we saw probably 50~60 lights in different spots over the course of 30 minutes, but i don't know if they were the same thing or different. about 20 minutes after seeing them, we started to see white (not orange) flashing lights from aircraft (about 5~8), likely military, come into the same area where the lights were. a few more of the orange flares came back in the area, but were soon gone and the flashing aircraft lights soon left after there were no lights left. there was no sound during the entire incident."],"files":["/var/www/straped/mufon/html2text/29460.html.txt","/var/www/straped/mufon/org/29460.html"],"Viewing Distance":"Unknown","Log Number":"US-06082011-0013","Country":"United States","Latitude":"33.913506","Weather Factors":"Unknown"}