{"Longitude":"-75.906786","City":"Watertown","Case Number":"29479","Summary":"Appeared to be a oval of what look like red fire, sent a beam of bright white light down thru window.Stopped just short of witness .","Tags":"City","divs":["Sighting DetailsWas in bed sleeping I went to bed about 9:30 pm, something woke me I don't know what woke me; I had only been in bed about 1 hour. I woke to see this bright white light sharp clean white light, it was about half the width of the window itself and was coming in the bedroom window at an angle from above the house. At first I thought a flashlight or lightening but as I watched it I realized a flashlight is not that bright and it would have shined into the room, and lightening would not stay on like that it would flash bright and would also come in the window and light the room not just one window. I got up and looked out that window (the white light was only coming in the one window in the room) I saw what looked like a fire in a roundish shape just sitting there not moving just above the pine trees, and I watched it for a few minutes maybe 6-7 and figured it was a star or something got back in bed. I did not feel afraid or anything it didn't bother me at the time, not until the next day did I wonder about it and think I should have went out side and took pictures of it. After I went back to bed I laid there trying to think of what it could have been when the beam of light came back in the window moved around the window and stopped. It did not come in the room, it seemed to be just a foot or so inside the pane of glass. So I got back up and the fire looking thing was gone. I went right back to bed and fell asleep. Both times when I got up the light stopped. The next morning I told my husband about it and asked him if maybe it was lightening out around that time he said no there was no lightening at all."],"Weather Factors":"None","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=43.983724,+-75.906786(29479)&iwloc=A&hl=en\"> mufon case (29479) map </A>","Object Features":"None","Date of the Event":"06/08/2011 09:30 UTC","Latitude":"43.983724","Object Shape":"Oval","Source":"MUFON","trends":["There have been 4 other sightings in Watertown","There were no other sightings in Watertown on or around June 8th 2011"],"Log Number":"US-06102011-0011","Sighting Duration":"Undisclosed","Date Submitted":"06/10/2011 07:24 UTC","Region":"New York","Country":"United States","files":["/var/www/straped/mufon/html2text/29479.html.txt","/var/www/straped/mufon/org/29479.html"]}