{"Summary":"took photo of object over my house","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Township of Radnor","There were no other sightings in Township of Radnor on or around April 20th 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/29475.html.txt","/var/www/straped/mufon/more/29475_submitter_file1__IMG_6714.JPG","/var/www/straped/mufon/more/29475_submitter_file2__IMG_6742.JPG","/var/www/straped/mufon/org/29475.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Unknown","Disposition":"Unknown","Case Number":"29475","divs":["Sighting Detailsi was taking pictures of airplane contrails ovr my house. The next morning I was looking over my pictures, when I noticed an unusual object in the photo. I saw nothing unusual in the sky at the time i took the picture. I would have noticed something, I think, as my attention was directed on the sky. I don't recall hearing any noise or unusual sound. I have no idea what this thing is, not a bird, or bug, it certainly isn't a airplane or helicopter. I showed the photo to my wife, who is VERY skeptical of any kind of \"paranormal\" stuff.She couldn't figure out what it was, or could be. I took the photo with my iphone's 12 megapixel camera. I don't think I was using the zoom. I have sent this picture, via email, to Mr. Robert Gardner, who is in charge of these things in my part of Pennsylvania. It was his request that i fill out this report,"],"Log Number":"US-06102011-0007","City":"Township of Radnor","Sighting Duration":"Undisclosed","Date Submitted":"06/10/2011 01:08 UTC","Latitude":"40.043998","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.043998,+-75.38769(29475)&iwloc=A&hl=en\"> mufon case (29475) map </A>","Country":"United States","Longitude":"-75.38769","Object Shape":"Disc, Unknown","Source":"MUFON","Date of the Event":"04/20/2011 04:00 UTC","Object Features":"Dome, Appendage(s), Unknown","Tags":"City"}