{"Summary":"I seen 7 or more solid red sheres in a line in the sky flying low on my way to work.","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29477.html.txt","/var/www/straped/mufon/org/29477.html"],"Object Flight Path":"Path with directional change","Tags":"City","Case Number":"29477","Source":"MUFON","Object Shape":"Sphere","City":"Winfield","Latitude":"37.245729","map":"<A HREF = \"http://maps.google.com/maps?q=37.245729,+-96.990032(29477)&iwloc=A&hl=en\"> mufon case (29477) map </A>","Date Submitted":"06/10/2011 04:51 UTC","Viewing Distance":"Over One Mile","Region":"Kansas","Log Number":"US-06102011-0009","trends":["There has been one other sighting in Winfield","There were no other sightings in Winfield on or around November 30th 1984"],"Date of the Event":"11/30/1984 10:00 UTC","Country":"United States","Longitude":"-96.990032","Weather Factors":"None","Object Features":"None","divs":["Sighting DetailsI was on my way to work the night shift at Winfield Hospital.I was alone in my car. Kansas is flat and I was out in the country where you could see a long way. I was used to seeing all kinds of planes. The air force base and airports were around the area. On the horizon over to the left right above the highway were aprox. 7 or more solid red spheres hovering above tree line. Immediately it scared me because I knew what I was looking at was not right. They were going too slow and too low. I got excited and speeded up as fast as I could. I looked for any landing lights or anything to make it make sense. They were solid red spheres of light without any other lights or anything on them. They were traveling along in a wavy line moving to the left and to the right in a rippeling movement. I had to drive fast to try and catch up to them. I wanted to see them closer. They followed each other in a line for the most part but once one of them went straight up at the same time the one next to him went down and then got back in line. They flew over the city of Winfield higher in the sky waving back and forth and then went up higher to the right real fast and disapeared. They didnt fly away like a plane would where you can watch them until you cant see them anymore, they disapeared. Ive never seen anything before or since then but my twin boys did and so did my girls. My boys were out in the field playing under the big oak tree in Kansas when they seen a triangle ufo above the tree hovering right over them. They got scared and came into the house and told me. I had them draw what they had seen (in seperate rooms) and show me and they both drew the same thing. Many years later in Oklahoma my two grown girls seen a triangle ufo above them just hovering and they ran into the apartment scared to death."],"Disposition":"Unknown"}