{"Country":"United Kingdom","Case Number":"29472","Sighting Duration":"Undisclosed","Latitude":"54.984662","Weather Factors":"Unknown","Viewing Distance":"Unknown","trends":["There have been 13 other sightings in Newcastle Upon Tyne","There were no other sightings in Newcastle Upon Tyne on or around April 3rd 2011","This sighting has never been favorited.",""],"City":"Newcastle Upon Tyne","Tags":"City","Summary":"Whilst out in my back yard I noticed two objects in the sky one stationary the other moving.","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=54.984662,+-1.60799(29472)&iwloc=A&hl=en\"> mufon case (29472) map </A>","Object Shape":"Bullet, Missile, Circle, Disc, Fireball, Star-like","Region":"England","files":["/var/www/straped/mufon/html2text/29472.html.txt","/var/www/straped/mufon/more/29472_submitter_file1__1.JPG","/var/www/straped/mufon/more/29472_submitter_file2__2.JPG","/var/www/straped/mufon/more/29472_submitter_file3__5.JPG","/var/www/straped/mufon/org/29472.html"],"Date Submitted":"06/10/2011 06:57 UTC","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Date of the Event":"04/03/2011 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsWhilst out having a cigarette in my back yard I noticed the sky was very clear and the only cloud was where the sun was setting. I noticed two strange objects, one which appeared stationary and the other had what looked like a vapour trail as it if was moving. At first glance the object with the trail could have been mistaken for a aeroplane however the object seemed too distant to be considered a plane in my opinion (ive seen many aeroplanes in the area). In a rush to find my camera I realised my batteries where dead and I had to replace them quickly accidently resetting the internal camera clock which explain why the date on the pictures is incorrect. The objects where there for approx 45min with the sunset taking them out of my view. During this time the object with the trail seemed to fade into obscurity whilst the stationary oject remained prominent. The incidint left me very excited as I have had earlier experiences before but never had a camera to hand! Obviously I remain skeptical about my pictures and what they could be but I have exhausted all avenues and now I turn to MUFON for help on this. Any light you can shine on these pics would be much appreciated! Thanks Wez Hall ps there are another three pictures available - I have picked the best three to submit to you as your system allows me to do so."],"Longitude":"-1.60799","Log Number":"GB-06102011-0004"}