{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving home from work at 0400 hrs and when I was about two miles from my home I noticed a bright light ahead of me and to the left. I initialy thought it to be an airplane but it wasn't really moving. As I continued driving and getting closer to it I rolled my window down to get a better look. I thought it might have been a helicopter because it seemed to just hover. It was moving very slow, and flying low, maybe 200 feet or so above the ground. As it approached I stuck my head out of the window to get a better look and as it flew over me I could tell that it was black, triangular in shape, and was silent. It made no noise. I turned on the street to my house and grabbed my cell phone to take a picture. I snapped two pics but the only thing it shows is two small white dots as it was flying away. The craft was flying south, about 40 miles north west of Houston. When I walked into my home I checked my watch and it was 0410 hrs. The object was large, maybe 200-300 feet long. I was impressed with how quiet it was and how low it was flying. It wasnt much higher than the pine trees that grow out here. If I didnt see the lights I never would have seen it. I don't know how many lights were on it. I only saw one light as it approached, as it flew over I saw lights underneath it, but they werent as bright as the initial light I saw. It was just bright enough to illuminate the underside of the craft. After it passed, I only saw two lights in the rear. I don't know anything about this kind of stuff so I began a Google search and found this web site."],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/29476.html.txt","/var/www/straped/mufon/org/29476.html"],"Summary":"black triangle flying low in southern direction, silent","Country":"United States","Weather Factors":"Unknown","Log Number":"US-06102011-0008","City":"Conroe","Longitude":"-95.452941","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.316177,+-95.452941(29476)&iwloc=A&hl=en\"> mufon case (29476) map </A>","Viewing Distance":"101-500 Feet","trends":["There have been 10 other sightings in Conroe","There were no other sightings in Conroe on or around June 10th 2011"],"Date Submitted":"06/10/2011 04:36 UTC","Object Shape":"Triangle","Region":"Texas","Case Number":"29476","Date of the Event":"06/10/2011 04:05 UTC","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON","Latitude":"30.316177"}