{"Weather Factors":"None","Region":"Arizona","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around June 10th 2011"],"Log Number":"US-06102011-0010","Disposition":"Unknown","Sighting Duration":"00:01:00","Case Number":"29478","Object Flight Path":"Stationary,Straight-line path","Object Features":"None","Summary":"Two squares near zenith of sky","Object Shape":"Square, Rectagular","Date Submitted":"06/10/2011 05:33 UTC","Source":"MUFON","Date of the Event":"06/10/2011 01:40 UTC","files":["/var/www/straped/mufon/html2text/29478.html.txt","/var/www/straped/mufon/org/29478.html"],"Viewing Distance":"Over 1 Mile, Unknown","City":"Tucson","Latitude":"32.225543","Country":"United States","Tags":"City","Longitude":"-110.918659","map":"<A HREF = \"http://maps.google.com/maps?q=32.225543,+-110.918659(29478)&iwloc=A&hl=en\"> mufon case (29478) map </A>","divs":["Sighting DetailsI was walking to the laundry room at my apartment complex when I heard a C-130 flying overhead. I usually will look up to see what direction the plane is flying when I hear them fly overhead. I live within blocks of Davis Monthan AFB, here in Tucson, AZ. When I looked up, seen the plane and it was north of the Sun, but near the plane and much further up in the sky, there was an object that caught my eye. I looked at it and it was not a normal shape for the type of aircraft that fly in the area. It seem to be made up of two squares together, with a small space between them. They were also, north of the Sun, but a little closer in direction of the sun, compared to the C-130. I used my left hand to block out the sun and I could see this object and the it did not move, I watched very closely to see if it the object would move, and it just stayed put, but the object seem to be blinking, like it was spinning. The right square seem to be spinning and the left square seem to not be moving as much as the right square. At first I thought it was maybe some type of balloon, but It did not move with the wind. I looked at it for about 20 to 30 seconds, and then I finished walking over to the laundry and finished my business there. When I came back to my apartment, I grabbed my binoculars, (7 x 35), and went back outside and scanned the sky around the Sun, looking for the object I had seen a few minutes earlier. I did not find the object while scanning the sky for it."]}