{"Date of the Event":"06/09/2011 08:20 UTC","Tags":"City","Object Features":"Dome, Appendage(s)","Weather Factors":"None","Longitude":"-120.842694","Viewing Distance":"21-100 Feet","Latitude":"37.772895","Object Flight Path":"Hovering then path","Region":"California","Country":"United States","Date Submitted":"06/10/2011 02:29 UTC","Object Shape":"Other","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/29471.html.txt","/var/www/straped/mufon/org/29471.html"],"trends":["There have been 7 other sightings in Oakdale","There were no other sightings in Oakdale on or around June 9th 2011"],"Case Number":"29471","Log Number":"US-06102011-0003","Summary":"Dark medium size like a car, looked like a jellyfish","map":"<A HREF = \"http://maps.google.com/maps?q=37.772895,+-120.842694(29471)&iwloc=A&hl=en\"> mufon case (29471) map </A>","divs":["Sighting DetailsI was coming back from a poker tournament with a friend and the sky was still bright. I saw something in the air about 60-100 ft. I kept looking and couldn't figure out what it was, it stayed in the same spot and as we were getting closer to it coming down the highway (Mariposa rd.) toward Stockton from Oakdale I kept looking at and saying Do YOU SEE THAT APRIL? DO YOU SEE THAT? It was NOT a balloon, or weather balloon, or a chinese lantern or a model airplane or a regular airplane or a helicopter, my mind couldn't wrap around it because I have NEVER seen anything like it. It looked like a large jellyfish with a round top, something around the middle and large wavy things that hung down as it hovered that came to a point at a wide angle. It did not have any lights, and it was a dark grey color, not shiny or bright or mult colored at all. We turned around to try to catch it on video on our phones, I don't think we were successful because we didn't see it again. Shortly after we turned around a jet flying very low passed by very near where we saw it, going very fast. I have never seen anything like this in my life! Oh, and we didn't hear it make any sound which was weird. We scanned the entire sky looking for it again, in the fields, on the side of the road, everywhere, and it was gone! POOF!! I was so scared I didn't know what to do, but thought I should report it. The crossroad where we turned around at was Wagner rd. We saw the object, THAT WAS DEFINITELY A UFO right above the road above a cow farm on our left. I can't think of anything else that I remember, but I drew a picture of it after we got back into town."],"City":"Oakdale","Source":"MUFON","Sighting Duration":"00:02:00"}