{"Summary":"The object was a metallic triangle shape with red and purple lights that were blinking on and off at a rapid rate.","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-104.606591","divs":["Sighting DetailsOn the date of June 8, 2011 around 7:40pm I was taking my friend Derek home. My friend lives out at a mobile home park on the far east side of Pueblo Colorado. While we were driving on Highway 96 my friend and I both noticed this rather large metallic triangular craft with red and purple lights passed over my car and it was traveling east bound along highway 96 at a rather fast speed. The craft was about 900 to 1000 feet in the air at a speed of 150 plus mile per hour. The red and purple lights were flashing on and off at a fast rate which my friend and I thought was very odd. This craft didn't act nor did it look like an airplane or helicopter. My friend lives really close to the Pueblo airport and he swore that was not an airplane. Since this craft was going in the same direction as we were, we decided to follow this craft. I turned down the radio to see if I could hear any type of noise from this craft which I couldn't. This craft was travel really fast and I had to do the best I could to keep up with it. I had to drive around 110mph to stay with this craft. My friend asked me to catch up to this object so that he could take a clear photo of it, so I sped up to 120mph and yet I still couldn't catch up with it. We were following this craft for about 15 minutes then this craft just shot straight up in the air. I slammed on the brakes and pulled over. My friend and I jumped out of the car to see where this craft flew off too. Sadly it was nowhere to be seen. I'm not sure if this was just some kind of airplane or if this was a UFO. I have never seen a UFO before. I wasn't even sure I should tell anyone about what my friend and I saw. My friend said we should file a report with you guys at MUFON. Maybe you could give us some insight to what we saw. It was just very and odd and my friend and I both just had this weird feeling while we were trying to chase down whatever that craft was. I've seen a lot of aircraft in my time, but I have never seen one just stop and shoot straight up in the air like that craft my friend and I saw. I'm not scared to admit it. But that thing really freaked me out. I just want to know what I saw. I never believed in UFO's or anything until now. I just have this really odd feeling in my gut after seeing that. I'm scared to tell anyone and so is my friend. We both are upset that we couldn't get close enough to take a picture with one our cell phones. We think without pictures that no one will believe us or that we are crazy. My friend and I know what we saw and it was not normal. Please help my friend and I figure out what we saw. Was it just some kind of experimental aircraft or was it something not from this world?"],"Case Number":"29486","City":"Pueblo","Object Features":"Unknown","Object Shape":"Triangle","Country":"United States","Sighting Duration":"Undisclosed","Region":"Colorado","Log Number":"US-06112011-0003","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=38.257997,+-104.606591(29486)&iwloc=A&hl=en\"> mufon case (29486) map </A>","Date Submitted":"06/11/2011 01:16 UTC","Latitude":"38.257997","Date of the Event":"06/08/2011 12:00 UTC","trends":["There have been 22 other sightings in Pueblo","There were no other sightings in Pueblo on or around June 8th 2011"],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/29486.html.txt","/var/www/straped/mufon/org/29486.html"],"Tags":"City","Disposition":"IFO"}