{"divs":["sighting detailsi had just turned off tv and lights and was going to bed, stopped for a moment to look out window. had i not been looking right at the place in the sky where it was i probably would never have noticed it otherwise. not sure about the size or speed or altitude having no reference points or preestablished concept of what i was looking at. it moved accross my field of vision which was small due to the parameters of the portion of sky that i could see through that window. i was certain i had seen a ufo...but the only question being was it some experimental aircraft being flown by a test pilot, or something else. it was bomerang shaped, defined by muted white lights. because it was so muted and the object itself was basically the color of its background....i would never have seen this thing had i not been looking right at it. there were lights around the perimeter which define the shape of it, which were symetrical, and then other lights inside of those lights seemed to be unsymetrical, or random in placement. no flashing lights or colored ones. so at the very least this craft was i believe, in violation of rules\\laws concerning lights on a comercial or general aviation craft. this initial sighting lasted about 10 seconds, where upon it went out of sight over the roof of the adjacent wing of my house. i ran to get my binoculars and then out into the driveway to see it as it moved away. looking through my binoculars, the object was a blurr. afterwards, i realized that in my paniced state i had simply forgotten to focus the binoculars."],"Longitude":"-91.13723","Object Shape":"Boomerang","Log Number":"US-06102011-0014","Region":"Louisiana","Summary":"saw through window, in the night sky, craft had many muted lights not flashing or colored, defining its shape","files":["/var/www/straped/mufon/html2text/29483.html.txt","/var/www/straped/mufon/org/29483.html"],"Tags":"City","Source":"MUFON","Disposition":"Unknown","City":"Baton Rouge","map":"<A HREF = \"http://maps.google.com/maps?q=30.461103,+-91.13723(29483)&iwloc=A&hl=en\"> mufon case (29483) map </A>","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date of the Event":"12/21/2010 11:25 UTC","Latitude":"30.461103","Sighting Duration":"00:00:28","Object Features":"None","Date Submitted":"06/10/2011 09:53 UTC","Case Number":"29483","Country":"United States","trends":["There have been 27 other sightings in Baton Rouge","There were no other sightings in Baton Rouge on or around December 21st 2010"]}