{"Object Shape":"Triangle","divs":["Sighting DetailsI went outside and happened to see an orange light approaching from the southeast. After a few seconds I could see that it was on the front of a triangle aircraft. The aircraft flew over the houses to my east and continued straight to the northeast at maybe 50 miles an hour. It seemed to be maybe 500 feet up and about 200 feet long on a side. It seemed to be gray metal, like an unpainted aircraft. There was absoluely no audible noise until it was at about 11 o'clock overhead when I heard a noise like a generator for a large bulding that was audible until about the 1 o'clock position. It was really, really close but if I had been 1 or 2 houses down, I think I would not have heard even the brief noise that I did hear. I really feel that it was a military aircraft, I had that feeling the whole time I was watching it and was surprised when I could not find the aircraft listed as some prototype or \"skunkworks\" aircraft . I have never been that close to a flying dirigible so I don't know if they are that silent. To travel that slowly I think it must have been filled with a lighter than air gas. I know people would be skeptical that they could fly this across country and not be seen by millions, but it was so silent, and flying so low that it was in view such a short time, I think it would only be noticed by people already looking up unless a person was within 200 feet either side of it. There is no way that someone in their house would know it was there even if it was right overhead. I had it in sight almost from the treeline of the houses behind me to the treeline of the houses across the street and other than the slowness and silence it did nothing bizarre. It was really remakable, but I have the feeling that it was a military aircraft that in 10 years or so we will see on the news in military operations over the middle east or Venezuela."],"Viewing Distance":"101-500 Feet","Longitude":"-96.625268","City":"Ennis","Log Number":"US-06112011-0001","trends":["There has been one other sighting in Ennis","There were no other sightings in Ennis on or around June 7th 2011"],"Tags":"City","Summary":"Triangle","Object Features":"Unknown","Sighting Duration":"Undisclosed","Latitude":"32.329311","Source":"MUFON","Region":"Texas","Date of the Event":"06/07/2011 11:20 UTC","Date Submitted":"06/11/2011 12:23 UTC","Object Flight Path":"Straight-line path","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/29484.html.txt","/var/www/straped/mufon/org/29484.html"],"Case Number":"29484","map":"<A HREF = \"http://maps.google.com/maps?q=32.329311,+-96.625268(29484)&iwloc=A&hl=en\"> mufon case (29484) map </A>","Country":"United States","Weather Factors":"Unknown"}