{"Log Number":"US-06112011-0004","map":"<A HREF = \"http://maps.google.com/maps?q=38.550932,+-81.023693(29487)&iwloc=A&hl=en\"> mufon case (29487) map </A>","Case Number":"29487","Tags":"City","Weather Factors":"None, Does Not Apply","Country":"United States","Region":"West Virginia","Source":"MUFON","City":"Big Otter Hwy","Date Submitted":"06/11/2011 01:54 UTC","files":["/var/www/straped/mufon/html2text/29487.html.txt","/var/www/straped/mufon/more/29487_submitter_file1__IMG_0159.JPG","/var/www/straped/mufon/more/29487_submitter_file2__IMG_0160.JPG","/var/www/straped/mufon/more/29487_submitter_file3__IMG_0159-Copy.JPG","/var/www/straped/mufon/org/29487.html"],"Sighting Duration":"00:01:00","Object Shape":"Cigar, Cylinder, Other","trends":["There have been no other sightings in Big Otter Hwy","This sighting has never been favorited."],"Latitude":"38.550932","divs":["Sighting DetailsMy family and I were visiting my Aunt on June 10, 2011 in Clay County West Virginia. It was a warm clear evening. I had just stepped outside to sit on the porch when the moon caught my attention, and just above it was what I thought to be an airplane. I decided to test out the zoom on my recently bought camera and I tried taking pictures of the \"airplane.\" I took two pictures. The first picture I caught the whole object. The second picture I only captured half plus a random tree branch from the tree in her front yard. I thought nothing more of the object being anything other than an airplane until right when I took the second photo. After I pushed the button to take the second photo I looked up and it disappeared. I felt puzzled and it struck me as odd that I didn't see how it disappeared. The tree line it was heading for was still a good distance off. On the car ride home I was going through the pictures and I zoomed in on the object. It had no wings or tail, it also had no trail behind it, as most planes do. It just looked like the cigar shaped UFOs I had heard about. It was a white silver, cylinder shaped object. Even when I showed the person next to me in the car, they couldn't see wings or anything either. They, like me, just saw a silver cylinder object. when we came home we took the picture's and expanded them on the computer. It looked like five orbs together, making the cylinder object. Then I started looking up cigar shaped UFOs. I came across this document \"Cigar UFO reported 'streaking' over West Virginia sunny sky\" by Roger Marsh. That led me to this website here precisely one month later after the reported incident in May."],"Summary":"I was outside testing a new camera and just happened to catch a white cigar shaped object in two pictures.","Disposition":"Unknown","Object Flight Path":"Straight-line path","Object Features":"None","Date of the Event":"06/10/2011 08:18 UTC","Viewing Distance":"Unknown","Longitude":"-81.023693"}