{"Date of the Event":"06/10/2011 11:50 UTC","divs":["Sighting DetailsI'm an outside smoker and watch our skies frquently while out there at night. It seems like every other night I spot one or more tiny white lights that look just like stars. These lights move though, and not like an airplane. They make abrupt course changes sometimes and seem to be moving too fast to be a plane or jet. They never have any flashing white, green,or red lights either, so I feel sure they are not airplanes or jets. But tonight when I happened to notice this star like light moving across the sky, it pulsed into a much larger and brighter light for a few seconds then went back to its original appearance. It shocked me because I am used to seeing the lights that look exactly like stars moving around sometimes. But never has anything like this happened. As soon as it became really bright and then back, I ran inside to get my girlfriend. We found it again but it never became brighter or pulsed again. I watched it until it disappeared. I live in Anderson and this light was towards my west moving north. I have seen jets way up high and no matter how far they are I can always see red or green flashing and I swear this was no jet! I 've never seen anything like it and wanted to keep watching, but it became cloudy and a small storm moved in. I just don't know what I think they may be, but I feel sure it was some sort of ufo!"],"City":"Anderson","Tags":"City","Region":"Indiana","Object Features":"Unknown","Latitude":"40.11318","Summary":"tiny white light was very high, then got much larger and brighter then back to original","Case Number":"29485","Weather Factors":"None, Does Not Apply","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.11318,+-85.671624(29485)&iwloc=A&hl=en\"> mufon case (29485) map </A>","Country":"United States","Disposition":"Insufficient Data","Date Submitted":"06/11/2011 12:38 UTC","files":["/var/www/straped/mufon/html2text/29485.html.txt","/var/www/straped/mufon/org/29485.html"],"Source":"MUFON","trends":["There have been 12 other sightings in Anderson","There were no other sightings in Anderson on or around June 10th 2011"],"Log Number":"US-06112011-0002","Longitude":"-85.671624","Viewing Distance":"Unknown","Object Shape":"Circle, Flash","Sighting Duration":"00:02:30"}