{"map":"<A HREF = \"http://maps.google.com/maps?q=42.34587,+-83.885615(29498)&iwloc=A&hl=en\"> mufon case (29498) map </A>","Disposition":"IFO","Latitude":"42.34587","divs":["Sighting DetailsWe were driving home on North Territorial Road when I noticed objects in the northwest sky that appeared to be stars - but too close. Kind of like a big dipper made of planes... Then we noticed that they were moving. At first there were seven, all flying in a line pattern, then more appeared on the horizon as the ones overhead disappeared from sight. This happened several times. Altogether there were probably about 20 \"ufo\"s. Several cars stopped by the side of the road to watch as these objects flew overhead. It reminded me of a UFO movie where aliens keep coming and coming... They had and orange=yellow luminescence to them. One person in the car stopped behind us was certain they were fire balloons. I looked up pictures of fire balloons when I got home - and I really don't think that that's what I saw. These really look larger than fire balloons, kind of like planes, but I've never seen so many planes flying together, and definitely not in a pattern like that. I have photographs - kind of crappy and handheld, but at least there's a clear pattern of lights. Anyway, if you have any info or ideas, I'd love to hear from you. I'll send photos later if you're interested."],"Longitude":"-83.885615","Country":"United States","Object Flight Path":"Undisclosed","Log Number":"US-06112011-0015","Case Number":"29498","files":["/var/www/straped/mufon/html2text/29498.html.txt","/var/www/straped/mufon/org/29498.html"],"Weather Factors":"Unknown","Tags":"City","City":"Dexter","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Dexter","There were no other sightings in Dexter on or around June 11th 2011"],"Summary":"Multiple star-like objects ascending over the horizon into the sky and flying overhead.","Viewing Distance":"Unknown","Source":"MUFON","Region":"Michigan","Object Shape":"Star-like","Object Features":"Undisclosed","Date of the Event":"06/11/2011 11:04 UTC","Date Submitted":"06/11/2011 11:53 UTC"}