{"divs":["Sighting DetailsMy brother and I just returned home from a movie at roughly 1:30am. We went inside and ate At 2:30am give or take a few minutes we went outside so hecould smoke a cigarette. Standing in the driveway I was star gazing while he smoked next to me and a single orange ball of light appeared out of nowhere as if it just poofed into existence. It was brighter than any star in the sky, much bigger than a star maybe two or three times as much and was brilliantly orange. The light remained constant the whole time and there were no other lights associated with the object. I told my brother to look up and he confirmed he could see the object asking me what the hell is it. The object remained stationary for roughly 20 seconds then moved north over Lake Erie at a great rate of speed. We could see it zipping across the sky sky for 10-15 seconds covering what seemed like alot of ground and then is just disappeared. It didn't travel out of our field of view it literally just disappeared. When it first appeared I was staring at some stars facing north and it just appeared in my field of view like magic. It sat in the same spot as I said earlier before moving. When I first saw it I thought maybe it was a sattelite but it didn't move at all for twenty seconds and then just took off. Also I've seen plenty of sattelites and none have ever had the brilliance of this object. When Ive seen sattelites the never just appeared they always came into view looking like a moving star the maintained the same speed and flight path. This object was not a sattelite in my opinion because of its size, color, and the fact it remained motionless before zipping off. We were both extremely excited by what we saw but also extremely confused. I live in tucsonfor the past four years near davis mothan air force base so ive see my fair share of militarty aircraft. This looked nothing like what either of us would describe as a military or civilian airplane or helicopter. It wasn't a meteor either, weve seen plenty of those and they just streak across the sky for a few seconds the disappear."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.470248,+-81.848205(29508)&iwloc=A&hl=en\"> mufon case (29508) map </A>","Viewing Distance":"Over One Mile","Latitude":"41.470248","Region":"Ohio","Disposition":"Unknown","Summary":"orange ball appears in sky over lake erie, remains stationary, then moves north very fast and disappears","Tags":"City","trends":["There have been no other sightings in Rocky River","This sighting has never been favorited."],"Object Shape":"Sphere","Object Features":"None","Source":"MUFON","Longitude":"-81.848205","Date of the Event":"06/12/2011 02:35 UTC","Log Number":"US-06122011-0010","Weather Factors":"Unknown","Sighting Duration":"00:01:00","Case Number":"29508","City":"Rocky River","Date Submitted":"06/12/2011 12:31 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/29508.html.txt","/var/www/straped/mufon/org/29508.html"],"Object Flight Path":"Stationary,Hovering then path"}