{"Source":"MUFON","Summary":"Cigar like, silver color, high altitude","Longitude":"-85.130971","City":"Fort Wayne","Object Flight Path":"Straight-line path","Disposition":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Region":"Indiana","Date of the Event":"06/12/2011 09:00 UTC","Latitude":"41.084323","Date Submitted":"06/12/2011 09:21 UTC","Log Number":"US-06122011-0014","Object Features":"Other","Case Number":"29513","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.084323,+-85.130971(29513)&iwloc=A&hl=en\"> mufon case (29513) map </A>","Country":"United States","divs":["Sighting DetailsWas taking garbage outside and checked the sky on my way back for you know... UFOs. To my surprise I saw what I thought for a few seconds was a plane, long bright silver object. It was unusually high because there is an airport in the city and I know the usual airplane pattern, in the night or day sky. There was no sound, and even when it was flying right over me,I did not see any wings. I stood there for about 15 sec and ran inside to get 2 cameras - just incase. I got a little nervous thinking it's going to disappear but it was gliding across the sky pretty steady. What's interesting is there was another smaller grey object that flew from the opposite side of the craft at a faster speed, and it disappeared after they crossed the paths. I'm not saying it flew inside the other craft, but I did not see it anymore. The silver craft had a little dark stripe across of it, like a belt. It was a little closer to the head, not in the dead center. Even though my camera was very close, I did not go back inside right away. It's such a rare event, I did not want to take my eyes off of it. No wonder there are so few pictures out there. I wasn't scared, rather had a peaceful feeling, but completely forgot about taking a picture for good 15 seconds."],"Sighting Duration":"00:00:30","trends":["There have been 41 other sightings in Fort Wayne","There was one other sighting in Fort Wayne on or around June 12th 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/29513.html.txt","/var/www/straped/mufon/more/29513_submitter_file1__IMG_0492.JPG","/var/www/straped/mufon/more/29513_submitter_file2__DSCF0139.JPG","/var/www/straped/mufon/org/29513.html"],"Object Shape":"Cigar","Weather Factors":"None"}