{"Object Features":"Unknown","Object Shape":"Circle","Weather Factors":"None","Sighting Duration":"00:00:05","Case Number":"29516","Latitude":"35.249457","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Insufficient Data","City":"Williams","files":["/var/www/straped/mufon/html2text/29516.html.txt","/var/www/straped/mufon/org/29516.html"],"Tags":"City","trends":["There have been no other sightings in Williams","This sighting has never been favorited."],"Region":"Arizona","Source":"MUFON","Date Submitted":"06/12/2011 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.249457,+-112.191003(29516)&iwloc=A&hl=en\"> mufon case (29516) map </A>","Longitude":"-112.191003","Date of the Event":"06/04/2011 03:20 UTC","Log Number":"US-06122011-0017","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was outside of my trailer at about 3:20AM. I often wake up in the middle of the night. I have a beautiful 360 degree view of the night sky. I was facing towards the southern sky when a meteor like object crossed the sky heading towards the west. The object stopped moving, hovered briefly, appeared to back up slightly and the accelerated towards the west again yet in a steeper trajectory. The object was a yellow light that appeared to be about five miles away. I felt elated as I had always wanted to see a UFO. I turned around to see if anything else was occurring. I did see meteor crossing the Big Dipper constellation but it's behavior appeared normal and it wasn't as bright as the first object. We often get meteor showers here in AZ so I thought this was a coincidence. In retrospect, I recalled seeing objects similar to the hovering object earlier this winter as I was driving back from Flagstaff on 180N. The area was near mile marker 241 about halfway between Flagstaff and where I live in Valle, AZ. At the time I thought the objects I had observed were meteors or flare guns being used by hunters. I observed them on the side of the road through the trees and low to the horizon."],"Summary":"a yellow light sped across the sky from east to west, stopped, hovered and then accelerated and disappeared in a different trajectory"}