{"Disposition":"Insufficient Data","Case Number":"29522","Log Number":"US-06132011-0004","Weather Factors":"Unknown","Object Shape":"Unknown","Viewing Distance":"Unknown","Summary":"On another date, in the mid 1970's I saw a UFO right above me..this report tho, is about direct contact with extraterrestrials...","Country":"United States","trends":["There have been 2 other sightings in Kings Park","There were no other sightings in Kings Park on or around September 30th 1994"],"divs":["Sighting DetailsIn the mid-1970's I was riding my mother-in-law's bike and a very large disc shaped, silvery space ship hovered over me...I started riding around noonish and suddenly 5 or so hours just vanished. It was getting dark..but I hadn't gone anywhere! But my sighting report is not so much about seeing this UFO...it is about my many encounters with extraterrestrial beings, mostly in my home. All together, there have been 9 encounters..the one that stands out in my mind the most: My daughter and I were coming home from a long day of work and school. She went directly to take her shower to get to bed quickly...I gathered up her things and walking from the kitchen to the living room...suddenly three beings..not human..appeared before me. I was stunned to say the least. They were each different in size and shape, but all had medium grey coloured skin, longish arms, fewer fingers than humans, a large head and prominent eyes..very big eyes with a seemingly second eye. The first one to the left was larger than the others...he looked directly at me as I was only a foot or so from him I could see him well. The one standing next to him was a bit smaller and the third was smaller yet, standing in the doorway of the bedroom. The larger one said telepathically to me: \"We're sorry you saw us; we're leaving now\"...The whole room became bathed in a glow of sparkley substance...they literally went up through the ceiling and dissapeared. All the time they were with me I sensed they were benevolent...almost kind. It was an amazing experience I could never, ever forget. I told my daughter immediately as she wrapped her towel around her...I was concerned that she was OK...did they see her too? I wondered. We stayed up a long while, hugging and wondering who they were....The next morning as we were in the kitchen, she asked me \"What are those red dots on your arm, Mama?\" I looked and saw them in a circle. I then checked to see if she had them and she did. I realized they had come to see her too! I have told a few select people..friends..family..but not many. It was a lot to \"wrap one's brain around\". Since that night (and prior to that encounter) both my daughter and I have had further encounters with them. I am glad to report they never caused us any physical pain and every time seemed to express a concern for our well-being. I am more curious now than afraid."],"Longitude":"-73.257337","Date Submitted":"06/13/2011 01:28 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/29522.html.txt","/var/www/straped/mufon/org/29522.html"],"Sighting Duration":"00:01:00","City":"Kings Park","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.886209,+-73.257337(29522)&iwloc=A&hl=en\"> mufon case (29522) map </A>","Date of the Event":"09/30/1994 10:20 UTC","Region":"New York","Latitude":"40.886209","Object Flight Path":"Undisclosed","Tags":"City"}