{"Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.706028,+-122.130234(29524)&iwloc=A&hl=en\"> mufon case (29524) map </A>","Weather Factors":"None","Tags":"City","Log Number":"US-06132011-0006","Object Flight Path":"Path with directional change","trends":["There have been 8 other sightings in San Leandro","There were no other sightings in San Leandro on or around June 12th 2011"],"Latitude":"37.706028","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/29524.html.txt","/var/www/straped/mufon/org/29524.html"],"Summary":"BRIGHT WHITE LIGHT, FIRST MULTICOLORED, THEN DISAPPEARED","Object Shape":"Flash, Sphere","Date Submitted":"06/13/2011 02:50 UTC","Sighting Duration":"Undisclosed","Case Number":"29524","divs":["sighting detailsi have seen this a few times before. no i am not crazy or totally psychotic. as i was outside on my porch smoking a cigarette (not a funny cigarette), i briefly saw a flashing light, just above the roof of another apartment. it flashed red for one moment. it then disappeared briefly. i then saw a brilliant white light flash across the sky. about a minute or two later, i saw a bright white\\yellow orb to the near-right of my vision. whatever it was, it must have been way up there, approx. at least 20,000 to 30,000 feet up. the object then moved slowly to the southeast. it was unlike an aircraft. aircraft in the area (from oak int'l and sfo) would have been only about 10,000 feet up. i have seen this kind of thing before, by the way, about two weeks ago, and previous to this. when i saw this, i was kind of freaked out. the hairs on my head, and upper head, had a strange sensation. it was as if something was \"pulling them up\" or some kind of device was tripped off by the ufo. this has also happened previously last summer while at the sea ranch, ca, south of gualala, ca. i had not thought about calling law enforcement at that time or this time. i lost sight of the ufos as they went to the southeast of my vision, and disappeared beyond the trees. about jan. or feb. of this year, i saw what appeared to be a large comet falling on the east bay area within 50 miles to the north of me. when i told others of this, they stated nothing was seen by them. and they looked oddly at me."],"Region":"California","Date of the Event":"06/12/2011 11:35 UTC","City":"San Leandro","Object Features":"Unknown","Viewing Distance":"Unknown","Longitude":"-122.130234"}