{"Tags":"City","Latitude":"39.256435","Region":"Illinois","Log Number":"US-06132011-0002","City":"Witt","Summary":"TRAPEZOID TOP BOTTOM BOX SHAPE CENTER UPSIDE DOWN MARTINI GLASS BASE","files":["/var/www/straped/mufon/html2text/29520.html.txt","/var/www/straped/mufon/org/29520.html"],"Date of the Event":"06/30/1961 12:00 UTC","Object Shape":"Other","Case Number":"29520","Longitude":"-89.348141","divs":["Sighting Details4 OF US WERE SITTING ON THE STEPS OF MY FRIENDS HOUSE IN WITT ILLINOIS FACING EAST BETWEEN THE HOURS OF 8PM AND 10PM THERE WAS NO MOON AND THE SKY WAS CLEAR. MY FRIEND AND I HAD BEEN CATCHING LIGHTNING BUG IN THE EMPTY LOT NEXT TO MY HOME. WE HAD SAT DOWN ON HIS FRONT PORCH WITH HIS MOTHER AND FATHER AND WERE TALKING WHEN WE SAW A BRIGHT ORANGE YELLOW OBJECT CROSSING THE SKY FROM SOUTH TO NORTH, WELL ABOVE THE TREES IT WAS STANDING UPRIGHT WITH A TRAPEZOID TOP AND BOTTOM AND A SQUARE SHAPED CENTER SECTION, OUT OF THE BOTTOM WAS WHAT LOOKED LIKE AN UPSIDE DOWN MARTINI GLASS THE WIDTH OF THE OBJECT. THE OBJECT TRAVELED IN A SIDEWAYS \"S\" PATTERN MOVING UP AND DOWN AS IT CROSSED THE SKY. IT MADE NO SOUND WE COULD HEAR AND LEFT A TRAIL AS TALL AS THE OBJECT AND FOLLOWING THE SAME SIDEWAYS \"S\" PATTERN THE TRAIL WAS A COUPLE OF WAVES BEHIND THE OBJECT AND FADED AWAY. tHE OBJECT VANISHED OUT OF LINE OF SIGHT. USING GOOGLE EARTH I PUT OUR LOCATION THAT NIGHT AT(Coordinates Deleted)fg ELEV 666FT. MY FRIEND AND I WERE YOUNG KIDS WHEN THIS HAPPENED AND I HAVE NEVER SEEN A CRAFT LIKE THIS DESCRIBED IN ANY OTHER SIGHTING, AND I AN CURIOUS IF THERE HAVE BEEN OTHER CRAFT LIKE THIS SEEN BEFORE. I GREW UP IN WITT AND LEFT IN 1989 AND MOVED TO ARIZONA AND I CAN STILL SEE THAT OBJECT MOVING ACROSS THE SKY WHEN I THINK BACK TO THAT NIGHT AND i AN SEEKING INFORMATION ON THE OBJECT WE SAW THAT NIGHT."],"Sighting Duration":"Undisclosed","Weather Factors":"None","Object Flight Path":"Straight-line path","Date Submitted":"06/13/2011 01:08 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","trends":["There have been no other sightings in Witt","This sighting has never been favorited."],"Object Features":"Other","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.256435,+-89.348141(29520)&iwloc=A&hl=en\"> mufon case (29520) map </A>","Source":"MUFON"}