{"Tags":"City","Source":"MUFON","Log Number":"","files":["/var/www/straped/mufon/html2text/2953.html.txt","/var/www/straped/mufon/org/2953.html"],"Date of the Event":"04/06/2004 11:15 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.04563,+-85.30968(2953)&iwloc=A&hl=en\"> mufon case (2953) map </A>","Object Features":"Undisclosed","Latitude":"35.04563","Object Shape":"Cylinder","Region":"Tennessee","Object Flight Path":"Unknown","Summary":"Balloon shaped object over Chattanooga, TN","Weather Factors":"Unknown","Country":"United States","Case Number":"2953","Viewing Distance":"Over One Mile","Date Submitted":"04/06/2004 11:15 UTC","City":"Chattanooga","Sighting Duration":"00:10:00","divs":["Sighting DetailsI am a commisioned law enforcement officer, on duty. I stopped at Taco Bell toget lunch. While placing order at drive thru there were two sharp, loud boomswhich shook my patrol unit. I then spoke with other units across the county whofelt and heard the same. There were several high altitude, 30,000 ft, militaryaircraft in the area, but no visible supersonic capable craft. I then stopped invacant parking lot next door to eat. This location is on a hill with no barriersto block view. I then looked up to the northwest and saw a small white objectthat appeared to be falling. I thought at first that it may have been apartially opened parachute. I got out my binoculars to see the object. What Isaw was like a long white tube with rounded ends. At first it kind of see-sawedback and forth like a leaf falling, but suddenly one end seemed to take controland it began to make loops with the whole object bending as it moved. It wouldgo vertical then horizontal, also as the object made turns it reflected thesunlight like a piece of metal even though the object was white. The objectnever lost any altitude or drifted. I estimate it was about 3,000 feet out and1200 - 1500 ft high, with the object being 50 - 60 ft in length.The last sighting I had of it, the object turned up vertical and began to climbhigher very fast and then disappeared completely."],"Longitude":"-85.30968","trends":["There have been 18 other sightings in Chattanooga","There were no other sightings in Chattanooga on or around April 6th 2004"]}