{"map":"<A HREF = \"http://maps.google.com/maps?q=38.42594,+-82.440854(29536)&iwloc=A&hl=en\"> mufon case (29536) map </A>","Longitude":"-82.440854","Object Shape":"Bullet, Missile, Cigar, Cylinder","Latitude":"38.42594","Region":"West Virginia","Source":"MUFON","Weather Factors":"Unknown","City":"Huntington","Date Submitted":"06/13/2011 09:12 UTC","trends":["There have been 15 other sightings in Huntington","There were no other sightings in Huntington on or around June 13th 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was sitting in my backyard around reading emails and checking web sites on my iPod (via wi-fi). I was occasionally glancing at the sky as the birds are very active right now and I'm always watching to see who is active in my backyard. The sky was bright with a few fluffy clouds...very clear light before the sun sets. I looked up and a shiny object caught my eye. It was moving from North to South quickly at a very high altitude...though not much faster than a jet at that altitude would move. I am convinced though that this was not a jet. It was cylindrical in shape but did not have any wings. It's shape was more ambiguous and less defined than that of an airplane. There was no sound or jet trail. It appeared to have a darker spot in the middle and the whole object was more shimmery and shiny than an airplane. I did hurry to take a video on my iPod, but it is very pixilated and useless for any kind of identification as there is no \"zoom\" feature on it. The object crossed the sky until it went beyond my field of vision, as there are many trees surrounding my property. I live near an airport, but I am sure this was not an airplane."],"Summary":"Silver bullet-shaped object crossing sky from North to South","Log Number":"US-06132011-0018","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29536.html.txt","/var/www/straped/mufon/org/29536.html"],"Country":"United States","Date of the Event":"06/13/2011 07:50 UTC","Tags":"City","Object Features":"Undisclosed","Viewing Distance":"Unknown","Case Number":"29536","Object Flight Path":"Undisclosed"}