{"files":["/var/www/straped/mufon/html2text/29532.html.txt","/var/www/straped/mufon/more/29532_submitter_file1__2011-06-0708.30.58.jpg","/var/www/straped/mufon/more/29532_submitter_file2__2011-06-0708.31.13.jpg","/var/www/straped/mufon/org/29532.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.001243,+-78.889129(29532)&iwloc=A&hl=en\"> mufon case (29532) map </A>","Tags":"City","Latitude":"36.001243","Summary":"I think I summoned a UFO","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","divs":["sighting detailsi saw this video online [link moved to additional evidence section\\cms\\tg] and tried it myself. i believe there are beings out there and this could be my second ufo encounter. i followed what that guy did in the video and then waited. i did see some strange streaks but nothing i could take a photo of. i waited about 10 minutes or so and saw a strange round cloud over the next office building adjacent to my job. this was after i said outloud....ok show up over that building and let me take a picture. i snapped two pictures using my samsung epic smartphone. the cloud looked odd but i can be explained i am sure. after reviewing the pictures, that is when i saw the strange object. i am not sure what that is to be honest. just a strange coincidence considering me trying what that guy did in that video. yea, i thought it was retarded at first...but i don't knock it until i try it. the photos are time stamped automatically by the phone. one photo shows the object to the upper left...the second photo was taken around 15 seconds after the initial one."],"Longitude":"-78.889129","Case Number":"29532","trends":["There have been 29 other sightings in Durham","There was one other sighting in Durham on or around June 7th 2011","This sighting has never been favorited.",""],"Log Number":"US-06132011-0014","Country":"United States","Date of the Event":"06/07/2011 08:30 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Durham","Disposition":"Unknown","Object Features":"Undisclosed","Date Submitted":"06/13/2011 03:09 UTC","Source":"MUFON","Region":"North Carolina","Object Shape":"Unknown"}