{"Tags":"City","Disposition":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","Date Submitted":"06/14/2011 02:26 UTC","Sighting Duration":"00:01:20","Date of the Event":"06/13/2011 11:40 UTC","Longitude":"-86.352666","divs":["Sighting Detailsi went outside to wait on my sister to come over after work, i brought my hi-8 out with me. my daughter my sis, and i were all sitting out front talking. and i noticed something that appeared Solid like a star but \"Much\" bigger it went over head of us, over the house (heading north), then it appeared to make a abrupt right turn from where it was going around the back of my house and start moving northeast.(heading northeast). we all watched it and followed behind the house to try to record more video of it. it was definatly something else.. 1.)sitting out front talking,i had been out on the porch using one of my other cameras to take shots of the moon. 2.)looking at the stars off and on. 3.) at first i thought it might be a satelite but it was much bigger 4.)it made a turn behind my house and started moving in another direction. 5.)i was excited, i yelled for my sister to look right now~ she was texting on her phone. after the sighting i felt it was something else.. 6.)i lost sight of the object after it went over the building behind my house, and became to far away to get anymore video of it. Unfortunatly this hi-8 video, i cannot convert, so i will need help with it."],"Summary":"Ball of light-Hi-8 video recorded of object.","Object Shape":"Sphere, Star-like, Other, Unknown","files":["/var/www/straped/mufon/html2text/29541.html.txt","/var/www/straped/mufon/org/29541.html"],"Weather Factors":"Unknown","City":"Logansport","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around June 13th 2011"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.756594,+-86.352666(29541)&iwloc=A&hl=en\"> mufon case (29541) map </A>","Latitude":"40.756594","Log Number":"US-06142011-0001","Region":"Indiana","Case Number":"29541","Object Flight Path":"Undisclosed"}