{"Date Submitted":"06/14/2011 04:49 UTC","Object Shape":"Cigar, Other","Summary":"weird thick low huge cigar cloud 30mins, poof gone in 5min re-check","Case Number":"29544","Viewing Distance":"Unknown","Longitude":"-79.938937","map":"<A HREF = \"http://maps.google.com/maps?q=37.27268,+-79.938937(29544)&iwloc=A&hl=en\"> mufon case (29544) map </A>","Date of the Event":"06/13/2011 10:15 UTC","Disposition":"Unresolved","trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around June 13th 2011"],"divs":["Sighting DetailsAt 10pm 3 persons exit rear of house to talk & check out stars on pretty clear night. When turning eastward toward full moon, we are all amazed to see a very large, dense, low, cigar shaped white cloud all by itself almost directly over us. There was a cloud bank way off to the east but this monster cloud just seemed soo out of place. The definite cigar shape, size and low altitude was eerie. With the bright full moon in the same direction but slightly below, we could see details. There was lots of swirling movement, especially on the cloud's edges but the cloud itself did not move. I used 3 stars to judge its position and for at least 30 minutes there was no change. There also appeared to be a halo of darker air around the cloud?? The size, shape, density and location did not change while we observed it. It was so eerie that we stepped inside to look up \"cigar clouds\" on the internet. As pics immediately came up that looked similar, my friend went back out to re-check but then hollered that it had disappeared!! We all ran outside and searched the now clear sky. This was under 5 minutes.. more like 2 or 3 minutes? How 30 minutes of no change and then in under 5 minutes be totally gone without a trace! Weird weird cloud???"],"Object Flight Path":"Undisclosed","City":"Roanoke","Log Number":"US-06142011-0004","Tags":"City","Latitude":"37.27268","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/29544.html.txt","/var/www/straped/mufon/org/29544.html"],"Region":"Virginia","Country":"United States","Weather Factors":"Unknown"}