{"divs":["Sighting DetailsFirst started at around 2pm CST, I was watching several planes spray chemtrails in the sky, theyn just kept bombarding the sky so I dashed for the camera and started recording for a good half hour or so as it countinued my mom came out and so did my son as we all were gazing the skies my mom quickly directed me to a specific spot in the sky I watch a cylinder craft and as I pointed my camera it zoomed and disapeared as I yedrevieed the video and the dispayed show that I caught what I believe is a split second of the craft, now I am a constant sky watcher and I have been watching planes spraying for years now so I am familar with them and flight patterns. This object I recorded zoomed just seconds after a plane i was recording flew by on its spraying. The object looked like a white missle with what i believe to be square black patterns at the back end. I have a older camera and im nneding help uploading this so if anybody can assist please contact me. Well I continued throught the day and evening along with the night and watch nomerous sprayings and star like crafts moving along the eastern skies. Trust me they blend in with the night stars but wernt stars I attempted to record these but were faint enough that the video camera couldnt detect em but myself along with a witness using binoculars have observed em. As the night continued I video tape a plane spraying the just from the front end came a unidetified craft heads on and continued following the exact trail the first plane left as it reached far west enough another craft followed the same chem-trail heading the opposite way. Alot of activity was happening last night and these are not my first sightings, I have been a constant night and day sky watcher to know what I am seeing...."],"Date Submitted":"06/14/2011 11:07 UTC","Case Number":"29545","City":"Addison","Latitude":"41.936386","Object Shape":"Bullet, Missile, Sphere, Star-like","Date of the Event":"06/13/2011 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.936386,+-87.982736(29545)&iwloc=A&hl=en\"> mufon case (29545) map </A>","Summary":"Multiple sightings all day and night while chemtrails were being sprayed","Longitude":"-87.982736","trends":["There have been 6 other sightings in Addison","There were no other sightings in Addison on or around June 13th 2011"],"Source":"MUFON","Country":"United States","Tags":"City","Region":"Illinois","Weather Factors":"None","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/29545.html.txt","/var/www/straped/mufon/org/29545.html"],"Object Features":"Undisclosed","Log Number":"US-06142011-0005"}