{"map":"<A HREF = \"http://maps.google.com/maps?q=41.963364,+-87.827284(2954)&iwloc=A&hl=en\"> mufon case (2954) map </A>","Weather Factors":"Unknown","Case Number":"2954","Object Flight Path":"Unknown","Source":"MUFON","Object Features":"Undisclosed","divs":["Sighting DetailsMy mom and I were driving from my place of work, past my grandparents house atabout 9-10pm en route to get supper. I just happened to look up in the sky andI saw an orb of light ahead of us, to the south, just behind some trees leavesdid obscure part of the view. The orb dipped in a semi-circular arc - just likea U as it moved to the left eastward. I alerted my mom, and she looked up intime to see it shoot off to the east. This all happened incredibly fast - onlya few seconds. When I first saw it, I had no idea what it was - I only saw itdipping. Nothing I know of moves like that. I was pretty excited to have seensomething so fascinating, but because of the trees obscuring the view, I didalways have some question as to whether my eyes were playing tricks on me. Still, there were no street lights that could have produced the effect, and Idont know of anything that would move in that manner or speed. It was verystrange. We lost sight of the object behind the leaves of the trees. Uponemerging, we searched the skies but could see nothing. It was a bit cloudy outthat night, so it may have disappeared behind a cloud. Its been close to 11years since the sighting, but I still remember it vividly, and there really isnothing I can come up with that might explain it."],"Date Submitted":"09/30/1993 12:00 UTC","Summary":"Fast-Moving Orb","Tags":"City","files":["/var/www/straped/mufon/html2text/2954.html.txt","/var/www/straped/mufon/org/2954.html"],"trends":["There have been no other sightings in Norridge","This sighting has never been favorited."],"Date of the Event":"09/30/1993 12:00 UTC","Sighting Duration":"00:00:59","Latitude":"41.963364","Disposition":"Unknown","Country":"United States","Object Shape":"Sphere","Region":"Illinois","Log Number":"","Longitude":"-87.827284","City":"Norridge","Viewing Distance":"501 Feet - 1 Mile"}