{"Source":"MUFON","Case Number":"29547","Date of the Event":"06/10/2011 12:00 UTC","Latitude":"34.056958","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.056958,+-111.089301(29547)&iwloc=A&hl=en\"> mufon case (29547) map </A>","Object Shape":"Fireball, Star-like","Longitude":"-111.089301","City":"LV towards Kingman, AZ","Disposition":"Unknown","Viewing Distance":"20 Feet or Less","Log Number":"US-06142011-0007","Tags":"City","Object Features":"None","Summary":"fireball bright light traveling alongside then in front of car 65 mph","Weather Factors":"Unknown","trends":["There have been no other sightings in LV towards Kingman, AZ","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/29547.html.txt","/var/www/straped/mufon/org/29547.html"],"Region":"Arizona","Sighting Duration":"Undisclosed","Object Flight Path":"Other","Date Submitted":"06/14/2011 01:55 UTC","divs":["Sighting DetailsLeft TJ Shepherd show in Los Vegas about 9:30 p.m. We usually spend the night in vegas but decided to drive home to Golden Valley 8 miles from Kingman, Arizona. Halfway home my husband pointed out a star like fireball following the car at window hight, It disappeared in about 2 minutes vanishing. I decided to try to catch up to the cars that were ahead of it that were going 65 MPH. I was the last car in line, They took off so fast that I was going 80 mph and I could no catch up with them. Now me and my husband were in the dark desert and the star-like fireball came right in front of the car. It was going the same speed as us. It was a little bit bigger than 3 feet across. It followed us for about 2 minutes then vanished. This all happened halfway between Las Vegas and Kingman. In the middle of this we were looking for power poles that might be arching. There were no things that might have caused the event. It was not military flares..I have observed these many times. It seemed to have intelligence. It stayed about 65 mph and about 20 even feet from the passengers winders. When the object was in front of the car it stayed about 15 feet even in front of the car. I had a good look at the star-like fireball. My husband said this object appeared as a white really bright object. When I first saw it I said to my husband \"I guess they really do exist.\" When the star like fireball right in front of the car was observed I said I don't wan to be a specimen. This all was observed at night so there are no pictures There is no military base. There are no houses at all. My husband was quiet and quietly observed. The next time we go to vegas we will come back the next day."]}