{"map":"<A HREF = \"http://maps.google.com/maps?q=36.329167,+-80.433333(29552)&iwloc=A&hl=en\"> mufon case (29552) map </A>","divs":["sighting detailsi and my g\\f had gotten home from a park and eating, and i happened to look up while getting out of the car. overhead moving roughly north east was a small, white starlike object going like a bat out of hell. it was moving well faster than any plane that has gone over (we're in a flight path for a local airport). it took the thing less than 5 seconds to go about thru a yard's worth of sky (relative to my observations). also- the flight path wasnt the usual one to the airport. there were no formation lights, no blinking lights of any kind. it's what happened after it had disappeared from view that got me (and made me snicker): 15 seconds after it had disappeared from view, the unmistakable, and far too loud sound of a prop plane was heard. exactly if a prop plane was breaking the sound barrier, but if it was in a cartoon. no sound distortion, no rumble, just cessna noise. the were no other planes in the sky- i looked, and looked hard. the sound 'followed' the object at any rate. my only comment to my g\\f was 'well, that was a pathetic attempt at a ufo covering it's butt.' whatever it was, it wasnt a plane."],"Object Features":"Undisclosed","Country":"United States","Weather Factors":"None","Object Shape":"Star-like","Object Flight Path":"Straight-line path","Longitude":"-80.433333","Tags":"City","Viewing Distance":"Over One Mile","Date of the Event":"06/13/2011 11:00 UTC","files":["/var/www/straped/mufon/html2text/29552.html.txt","/var/www/straped/mufon/org/29552.html"],"Latitude":"36.329167","Log Number":"US-06142011-0012","Date Submitted":"06/14/2011 06:57 UTC","City":"Pinnacle","Region":"North Carolina","Sighting Duration":"00:00:20","Case Number":"29552","Summary":"Small starlike object moving FAST","trends":["There has been one other sighting in Pinnacle","There were no other sightings in Pinnacle on or around June 13th 2011"],"Disposition":"IFO","Source":"MUFON"}