{"Source":"MUFON","Date Submitted":"06/14/2011 08:31 UTC","Longitude":"-117.910704","divs":["Sighting DetailsI went to the IHOP restaurant at night. After drinking some soda I went outside for a cigarette. First I saw a ball of fire over a main street about 200 yards away hovering. Then I saw an oval object about 42' long about 100 feet away. Because it was dark out I could barely see it. It flashed 3 squares of white light on its left side every 7 seconds. I watched it for a while before opening the restaurant door calling my friend who worked there to see. My friend was with customers, and when I looked again for it it was gone. 2 nights later I found my head off my pillow with my eyes more than half way closed sometime during the night. I saw a beings head looking at me with a tight face. He had wrap around thin eyes that protruded from his face, almost like goggles. He had a lower lip (human looking)and a small nose. He had no hair. His face around his nose looked kind of concave or angled in. Within 7 to 10 seconds his head flew straight backward, and his head and right arm flew up disappearing 2 feet away. He appeared to be a specie of Grey I never saw before. I saw his right arm fly up, as he traveled backward 2 feet apparently disappearing into another dimension. I fell right back to sleep. When I woke up in the morning I found 2 deep long scratch marks on my left thigh. Since then I was having psychological difficulties. But around day 4 after I got the feeling the being was and is my friend that the day after the night I seen him I was able to cope with things that were troubling me. Also, I feel he gave me confidence in dealing with my problems. No matter how much I rejected his influence he came across as my friend. Like 2 other encounter experiences I had the color black and shadows have an indescribable power."],"files":["/var/www/straped/mufon/html2text/29553.html.txt","/var/www/straped/mufon/org/29553.html"],"Tags":"City","City":"Anaheim","Object Features":"Undisclosed","Disposition":"Hoax","Latitude":"33.837023","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around June 5th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.837023,+-117.910704(29553)&iwloc=A&hl=en\"> mufon case (29553) map </A>","Country":"United States","Summary":"oval object barely seen at night","Log Number":"US-06142011-0013","Object Flight Path":"Undisclosed","Date of the Event":"06/05/2011 08:10 UTC","Sighting Duration":"00:01:04","Object Shape":"Oval","Weather Factors":"Unknown","Region":"California","Case Number":"29553","Viewing Distance":"Unknown"}