{"Date of the Event":"06/14/2011 09:30 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/29556.html.txt","/var/www/straped/mufon/org/29556.html"],"Date Submitted":"06/15/2011 01:08 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-121.64833","Summary":"very bright white light, similar to venus, passed overhead from west to east.","Tags":"City","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.134171,+-121.64833(29556)&iwloc=A&hl=en\"> mufon case (29556) map </A>","Case Number":"29556","City":"Morgan Hill","Sighting Duration":"Undisclosed","Log Number":"US-06152011-0002","divs":["Sighting DetailsI went outside to see how cool it was getting and was watching a jet airliner on its approach to san jose airport when I saw a very bright light. At first I thought it was just a bright star then realized it was moving at a steady speed from west to east. I figured it was a small (private) plane but it had no marker lights (blinking) and as it passed over the light never got dim as you would see landing lights dim as the front of the plane passes. It was a constant brightness. I would estimate it to be between 1000 to 2000 feet in elevation. What struck me was that this object made absolutely no noise whatsoever. I watched it as it flew over Coe Park then disappeared from site as I lost it behind the ridge. It is possible I might have seen a satellite. I have seen them many times before. As with what I saw they too do not have any marker lights, however I have never seen a satellite this bright before. It was as though Venus moved across the sky. I am wondering if anyone else saw it and if it was a plane, how could it be so quite."],"Object Flight Path":"Undisclosed","Latitude":"37.134171","Object Shape":"Star-like","Disposition":"IFO","Source":"MUFON","trends":["There have been 3 other sightings in Morgan Hill","There were no other sightings in Morgan Hill on or around June 14th 2011"],"Country":"United States"}