{"Date of the Event":"06/10/2011 12:00 UTC","Country":"United States","Disposition":"Unknown","Source":"MUFON","Case Number":"29554","Object Features":"Undisclosed","Region":"Ohio","Longitude":"-84.203277","City":"Troy","files":["/var/www/straped/mufon/html2text/29554.html.txt","/var/www/straped/mufon/more/29554_submitter_file1__Tstormpicsjune102011-whatislongthinginsky.jpg","/var/www/straped/mufon/more/29554_submitter_file2__6-10-11tintedversionofmysteryobject-tstormoverTroy.jpg","/var/www/straped/mufon/org/29554.html"],"Object Shape":"Square, Rectagular","Summary":"Caught picture of rectangular object during thunderstorm -- didn't see or heart it","trends":["There has been one other sighting in Troy","There were no other sightings in Troy on or around June 10th 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsA thunderstorm was moving in as I was driving home from Piqua, Ohio to Troy, Ohio (just north of Dayton on I-75)between 5:30 and 6:00 p.m. I was driving alone southbound on Troy-Sidney Rd., which is a very pretty alternative to I-75. It was about 90 and extremely humid. I only had my phone camera with me but I really wanted to get a shot of the lightning bolts that I was seeing ahead of me! The storm was coming in from the southwest over Troy. I pulled off the country road, put my flashers on and stood outside my car with my arms resting on the door to stabilize my hands. How lucky do you have to be to catch lighting--especially without a tripod? So, I took lots of pictures, probably about 20 with the hope of capturing some lightning bolts. When I finished taking pictures I had to drive into the storm and it was very scary. It was pouring rain so hard that I couldn't see and then there was hail! A few hours after I got home, I downloaded my pictures to my computer and saw something strange! It's a rectangular, flat looking UFO. I did not see it when I took the picture, and I did not hear anything other than thunder in the distance. We are about 10 or 15 miles north of Dayton airport but this was not a plane coming in for a landing. I would have heard and seen that. Unfortunately, I had my phone camera resolution set pretty low and so it's not a high-quality picture. I was standing outside my car, it was not taken through the windshield. Also, I checked the pictures before and after this one but no object! I tinted picture to see the object better, the original is a color photo. (I'll attach the original and two altered pictures to this report.) I remember seeing something on a UFO TV show once about UFOs being drawn to thunderstorms to get 'charged' up or powered up. That totally makes sense to me and this was a very powerful storm! I'm very curious to learn what this object may have been and if anyone else has seen something similar. Please let me know if you have any more information on it. I'd really appreciate it! Thanks for your time! Diana Brower"],"Latitude":"40.039498","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.039498,+-84.203277(29554)&iwloc=A&hl=en\"> mufon case (29554) map </A>","Date Submitted":"06/14/2011 11:22 UTC","Log Number":"US-06142011-0014","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}