{"Country":"United States","Object Flight Path":"Undisclosed","trends":["There have been 4 other sightings in Cupertino","There were no other sightings in Cupertino on or around June 14th 2011"],"Longitude":"-122.023302","Weather Factors":"None","Date of the Event":"06/14/2011 09:20 UTC","Source":"MUFON","Case Number":"29555","files":["/var/www/straped/mufon/html2text/29555.html.txt","/var/www/straped/mufon/org/29555.html"],"Region":"California","Tags":"City","divs":["Sighting DetailsSo it's so warm tonight that after the sun set I opened all the windows, blinds, and doors for fresh air. At about 1800 hrs (6pm) tonight I was walking by the dining room window where I have an AMAZING view of the Santa Cruz mountains where Saratoga and Cupertino are. At that time I had an overwhelming feeling all of a sudden that \"they\" were going to be back tonight. Just a bit ago, 2120 hrs (920pm) I was looking out the front door and saw a plane flying over the area. Now, planes don't just \"fly over\" unless there is a reason such as the strange light activity that happens here all the time. I went out the front door and looked up. There it was! An orb! Super bright white, about the size of 3 or 4 pin heads all put together. It was moving from SW to NNE (towards the Alum Rock area). I ran and got my camera and start4ed to take pictures. They all came out as a blurry line moving around. My husband Ron also saw this object. It was low, and fast. It changed it's trajectory also. It was as if it was going towards Morgan Hill following the 85, but then shifted almost directly overhead to go towards San Jose. I watched it until it vanished from my line of site. There is another person who lives in Campbell and is also keeping an eye on \"strange objects\" in the sky. I sent him a message to see if he saw it also (No response as yet). I noticed during the event about 4-5 planes and choppers in the area. At 2122 hrs, there was 10 planes and choppers flying over the area. After a few minutes, they slowly went on their way. I am kicking myself for NOT grabbing my video cam to film this as I have been keeping it on the living room table ready to go. It's okay because they WILL be back tonight. I will keep MUFON and Devlin posted when something happens again, and I WILL film it."],"Latitude":"37.330598","City":"Cupertino","Date Submitted":"06/15/2011 12:55 UTC","Object Shape":"Circle, Star-like","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Summary":"I knew a few hours ago it would be back tonight!!!","Log Number":"US-06152011-0001","Object Features":"Undisclosed","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=37.330598,+-122.023302(29555)&iwloc=A&hl=en\"> mufon case (29555) map </A>"}