{"divs":["sighting detailsi will try to recollect the event that occurred above the skies in athens, tx. this will be the thing i remembered about that never forgotten night. on tuesday, august 31, 2010 at 9:10 pm cst, my brother, \"b\" iv and myself witnessed an aircraft in the sky hovering above athens, texas. we were on our way to the trace in downtown athens, tx for karaoke night. it really took me by surprise in that i have never had an encounter of the first kind (ufo visual), when you actually see a aircraft in full view and there are no doubts in your mind that this is not a aircraft in the sky that you normally see like a private plane, commercial airline or a helicopter, that can hover. what we saw that night was an aircraft shaped like a crunched up cigar with red lights permeating from the underside of the aircraft. these lights actually show traveling toward the ground instead of just a bright shining red light. i hate to say it is almost like a ray you would see shooting out from the underside of the object, like portrayed in the old movie, war of the worlds. this object was seen approximately a quarter of a mile from us to the west on us highway 175 e., a little before turning off to get on the loop 7 towards the tyler exit off on highway 31. my brother wanted to go get some cigarillos at valero service station across from walmart, but by the time he had bought these smokes and gotten back to us 175 w,to nobody's surprise, the object had vanished.\" i don't know if i will ever be a witness like i was that tuesday night. i had always dream when growing up and even until that night witnessing something that cannot be explained in logical thinking. that next morning i called the local newspaper, athens daily review to see in fact if any other people had called into to let them know they had witness that phenomenon that night. i was told that my brother and i were the only two people that called the newspaper to inform them about this ufo incident. i am hoping that after this information, even though pictures could be taken, that this will be looked into, because another ufo incident occured this past thursday, june 9th of which i am not privy to the details, but the person that witnessed this gave that information to our local newspaper, the daily athens review. this is the best narrative that i can explain the strange occurence that my brother and i witnessed that night. i can be reached at this email address [email address removed\\cms\\tg] or at my personal cell telephone number [phone number removed\\cms\\tg]. a baffled now athensite, [name removed\\cms\\tg]"],"Object Shape":"Cigar","Date of the Event":"08/31/2010 09:10 UTC","Latitude":"32.208664","Log Number":"US-06152011-0004","files":["/var/www/straped/mufon/html2text/29558.html.txt","/var/www/straped/mufon/org/29558.html"],"Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-95.849101","Object Features":"Patterned Surface","Case Number":"29558","Tags":"City","Disposition":"Unknown","Date Submitted":"06/15/2011 01:45 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"UFO Sighting Over Athens, TX on Tuesday night, August 31st 2010 at 9:10 PM (CT)","map":"<A HREF = \"http://maps.google.com/maps?q=32.208664,+-95.849101(29558)&iwloc=A&hl=en\"> mufon case (29558) map </A>","trends":["There have been 2 other sightings in Athens","There were no other sightings in Athens on or around August 31st 2010"],"Object Flight Path":"Stationary","Region":"Texas","Weather Factors":"None","City":"Athens"}