{"Latitude":"37.38781","Region":"Andalucía","Case Number":"29570","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date Submitted":"06/15/2011 10:12 UTC","Date of the Event":"06/15/2011 11:25 UTC","trends":["There has been one other sighting in Sevilla","There were no other sightings in Sevilla on or around June 15th 2011","This sighting has never been favorited.",""],"Log Number":"ES-06152011-0015","files":["/var/www/straped/mufon/html2text/29570.html.txt","/var/www/straped/mufon/org/29570.html"],"Country":"Spain","Weather Factors":"Unknown","Longitude":"-5.986645","Source":"MUFON","Summary":"Bright sphere shape object, orange color, constant speed, straight movement","City":"Sevilla","Object Shape":"Fireball, Sphere","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsFrom the roof of a house in the historical center of Seville, some friends and I have seen and UFO while we were looking at the moon eclipse. One of my friends realised that a big and shiny yellow-orange light was coming from the opposite orientation of the moon. Especifically it was going straight with constant height from the north-west to south east (in that moment the direction was going almost the situation of the covered moon). Right after watch it we realise that it was not a plane (one of my friends in the roof is aeronautical engeneer and he corroborated that it wasn't a normal flying object). The intensity of the light, the color, the speed and the height were all constant. It was going faster than a plane considering the apparent height. When we saw it we were excited because of what we were seeing, but we did not feel anything strange. It wasn't doing any strange noise as we could heard. After 2 minutes watching it and going further, the perspective that we had in the roof of our building didn't allow us to see it anymore. I'm attaching one video that I could record, I didnt have enough time to record it when it was closer, so the only thing that you'll see in the video is an small orange light."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.38781,+-5.986645(29570)&iwloc=A&hl=en\"> mufon case (29570) map </A>","Disposition":"Unresolved","Object Features":"None","Tags":"City"}