{"Sighting Duration":"00:04:30","City":"Anderson","map":"<A HREF = \"http://maps.google.com/maps?q=40.10684,+-85.677044(29579)&iwloc=A&hl=en\"> mufon case (29579) map </A>","Object Features":"Undisclosed","trends":["There have been 12 other sightings in Anderson","There were no other sightings in Anderson on or around June 16th 2011"],"Disposition":"Insufficient Data","Source":"MUFON","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"06/16/2011 01:10 UTC","Object Shape":"Circle, Diamond","Date of the Event":"06/16/2011 04:35 UTC","Case Number":"29579","Country":"United States","Log Number":"US-06162011-0007","Region":"Indiana","files":["/var/www/straped/mufon/html2text/29579.html.txt","/var/www/straped/mufon/org/29579.html"],"Object Flight Path":"Undisclosed","divs":["Sighting DetailsI reported something similar not too long ago. This time though the light did not get brighter then go back tyo normal size....it remained the same size and seemed much lower. I was smoking outside this morning and was watching the stars when I caught sight of a meteor enter our atmosphere, burst into flames and disappear behind a tree line. This was the longest burning meteor I have ever seen and I wouldn't be surprised if this one hit the ground in peices because it was so long and just looked like it would of had to reach the ground. Anyway, after being amazed by this cool meteor, I looked back over towards the \"big dipper\" and noticed an extra star in the handle. But it was moving across the sky and was much brighter and bigger. This light never pulsed, never had any other color but white, seemed as low as a plane that had a propeller might fly, but I am sure this was no airplane. It was completely silent. Not one noise from it at all. But what tripped me out was that the light was heading right for the spot where that meteor disappeared behind the treeline. I never moved during all of this, that is why I know the light went to the exact same spot as the meteor did. I came in very fast to find my camera and it wasnt where it was supposed to be, so I grabbed my cell phone. I couldnt get anything but black to show up and never tried to use the phone's video option."],"Summary":"decent size solid bright white light move across the sky, with no noise at all","Weather Factors":"Unknown","Longitude":"-85.677044","Latitude":"40.10684"}