{"Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was about 10 years old & was outside playing in the dirt (with toy horses) and the air felt cool (like early spring or early fall) & I knew that it would be dusk sometime soon but it was still daylight. I felt like I was being watched & I stood up & instinctively looked above me. I was not afraid and just stood there looking. I observed a large disk space ship hoovering above me over our back yard. We lived in a place that used to be farmland, a new development still in the process of building townhouses (3 per building) & most were not complete yet & there were only a few young families who had moved in. The development was also next to a golf course. So it was kind of bare & isolated to some extent. Not many people around to notice a spaceship over someones yard. I just stood looking up at the craft. I noticed that it had 3 big lights... one was a dome light, 2 were underneath & were 2 different colored lights. Then all of a sudden I noticed that I could see through the craft ... it was a disk and the middle was similar to a car steering wheel shape (like 3 spokes with spaces between them) wherein you could see between the spokes & now I noticed that I could see the stars & sky between the spokes. I wondered how that could be. As it was leaving, moving to my right and angleing up I could see it had lighted windows along the inside spokes & outside rim. As the craft moved swiftly up & away (at first like slow motion & then it was gone in seconds) I ran into the back door of the house to tell my mother. The house was not well lit, my mom wasn't inside so I ran out the front door & immediately stopped in my tracks confused that it was dark outside. My mother said what I saw was not possible unless it had been the Sputnik. I am terrified of the movie \"Fire in the Sky\" & I have only seen brief parts of it... I feel like I am having a panic attack. I did not have any feelings like that at the time of sighting."],"Country":"United States","Region":"Maryland","trends":["There have been no other sightings in Hyattsville","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Date of the Event":"11/30/1961 12:00 UTC","Summary":"observed ufo hoovering above me... lost time.","Date Submitted":"06/15/2011 10:26 UTC","Longitude":"-76.880837","Viewing Distance":"Unknown","Source":"MUFON","City":"Hyattsville","map":"<A HREF = \"http://maps.google.com/maps?q=38.927263,+-76.880837(29571)&iwloc=A&hl=en\"> mufon case (29571) map </A>","Disposition":"Unresolved","Tags":"City","Latitude":"38.927263","Case Number":"29571","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/29571.html.txt","/var/www/straped/mufon/org/29571.html"],"Object Shape":"Disc","Log Number":"US-06152011-0016"}