{"Log Number":"US-06172011-0005","trends":["There have been 7 other sightings in Waynesboro","There were no other sightings in Waynesboro on or around June 30th 2000"],"Longitude":"-77.569669","Disposition":"Insufficient Data","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.761147,+-77.569669(29588)&iwloc=A&hl=en\"> mufon case (29588) map </A>","Latitude":"39.761147","Summary":"It was either 4 or 5 small glowing balls/discs in formation not moving, and no sound. Very high up. Then they disapeard after few minutes.","Object Features":"None, Unknown","Date Submitted":"06/17/2011 01:37 UTC","Object Flight Path":"Stationary,Hovering then path,Unknown","City":"Waynesboro","Tags":"City","files":["/var/www/straped/mufon/html2text/29588.html.txt","/var/www/straped/mufon/org/29588.html"],"Date of the Event":"06/30/2000 08:00 UTC","Object Shape":"Disc, Egg, Oval","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"29588","Viewing Distance":"Over One Mile","Region":"Pennsylvania","divs":["Sighting DetailsI was going to a small store during dusk at Waynesboro Pa(located near the Maryland border). It must have been in the late 1990's or early 2000's. I got out of the car. I looked up and saw either 4 or maybe 5 glowing balls of light in a line formation. They were silent, and looked like they were not moving. They were actually more of an oval shape, but the actual objects were glowing white. They were very high up. I do not know if anyone else saw them. I went inside for about 5 minutes and when I came out they were gone. It was very weird. I have heard of other people seeing strange objects near Waynesboro. We are located near a top secret facility that is located inside a mountain. It is known as Site R, and it is in the next county over. I do not want to disclose any information about Site R as it is an extremely sesitive place. Also,we are located near Site C(Maryland), Camp David(Maryland), and Fort Ritchie Md.(No longer an active base). Thank you."],"Source":"MUFON"}