{"Region":"Arizona","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around June 16th 2011"],"divs":["Sighting DetailsAs seen from North Phoenix at about 11:25 pm on June 16, 2011. I was sitting out back watching the sky for satellites and shooting stars. I routinely sky watch before going to sleep because it helps me clear my mind. I was facing north. I was looking in the direction of Cygnus. I had seen two fairly bright satellites traveling from the north to the south over the last half an hour that I was stargazing. I had finished my last cigarette and was taking a couple more moments to take a final look for anything in the sky. Below the constellation Cygnus but not as low as Lacerta, I saw movement. At first I thought it was a dim satellite but after about 1 second it looked more like a dim shooting star with a short trail. I almost always have my 8x binoculars with me. So, I looked at the object with the binoculars and was shocked to see it was clearly three dimly lit orangish lights. The lights looked slightly out of focus, as my binoculars were focused for seeing the stars. I re-focused and while shifting the focus, the lights looked as if there was a haze or solid craft around the lights. There was darker area surrounding the three round lights. With all three lights in a horizontal position they looked to be on an elongated oval. When I first viewed the object with my binoculars the lights looked larger than the bright star in Lyra and were of a dim or translucent luminosity. All three lights were first seen horizontal and spaced evenly apart and very close together. I perceived the three lights to be part of one object. I am familiar with what planes of different sizes look like from many different angles. I have seen meteors of many sorts as well as large birds at night and balloons of many types. This object had NO FAA required lighting at all and was traveling faster than any planes I have seen above my city. It was not traveling at such a great speed as to be shocking but definitely faster than an average jet. As the object headed NNE from it's point of first sighting it seemed to shift so that the lights were now vertically aligned. When it appeared vertically in the sky the lights had more of a brighter white quality than they had when they were in a horizontal position. As the object traveled further towards the horizon it shifted back to a more horizontal position and the lights were again more of a dim orange glow. I lost sight of the object at about 10 degrees above the horizon due to light pollution. This object looked very large in comparing it with my experience of viewing many planes with my binoculars. There were no viable airplanes that I could see but I could hear one south of me. The object that I saw did not seem to make any sound."],"Viewing Distance":"Unknown","Longitude":"-112.070007","Sighting Duration":"00:02:00","Weather Factors":"Windy, Light","files":["/var/www/straped/mufon/html2text/29596.html.txt","/var/www/straped/mufon/org/29596.html"],"Object Features":"Unknown","Object Shape":"Circle, Oval","Object Flight Path":"Straight-line path","Date of the Event":"06/16/2011 11:25 UTC","Tags":"City","Source":"MUFON","Date Submitted":"07/30/2011 12:24 UTC","Disposition":"Unknown","City":"Phoenix","Latitude":"33.450577","Country":"United States","Case Number":"29596","Log Number":"US-06172011-0013","map":"<A HREF = \"http://maps.google.com/maps?q=33.450577,+-112.070007(29596)&iwloc=A&hl=en\"> mufon case (29596) map </A>","Summary":"Three dim orange lights in a line."}