{"Sighting Duration":"Undisclosed","Latitude":"40.495945","Tags":"City","Log Number":"US-06172011-0016","Source":"MUFON","Date Submitted":"06/17/2011 10:34 UTC","divs":["Sighting DetailsI was heading from East Greenville to Emmaus on northbound route 29 at about 9:00 pm. It was suprisingly light out (dusk), I guess because the days are so long right now. There were wispy clouds in the sky. I noticed an odd red light low in the sky to my left, through the windshield, as I approached Shimerville. I believe this would have made it north-west of Shimerville, definitely west of Rt 29. I assumed it was an airplane, but I thought it was odd that I only saw a red light, no other color, and it wasn't blinking, it was shimmering. It almost looked like a stoplight hanging way up in the sky. It wasn't a clear well-defined light due to the clouds, which may have accounted for the shimmering. It looked stationary, but since I was moving it was hard to conclude whether the object was also moving or not. I still assumed it was an aircraft of some sort and that our movement relative to each other was what was making it seem like it was hovering. But after a while that seemed unlikely because enough time had passed that it should have displayed more movement than it did, in fact if it was moving at all it was certainly too slow to remain aloft. I started to wonder if it could be some celestial body that was particulary large right now, but there were no other objects visible whatsoever, and it would have been much, much larger than any object I've ever seen in the night sky except the moon, and it was glowing bright red. After a minute or two, it was overhead or behind me so I couldn't see it through the windshield anymore. I couldn't look back because there was a car close behind me, so I made a left into a parking lot, turned, and stopped facing south, where I could see it again. By now, it appeared to be east of route 29. I can't tell if it had actually moved east or if my few minutes of driving had just taken me to the west of it. I watched it for a few minutes, it seemed like it might have gotten slightly dimmer during that time. It may have been rising, and if it was moving at all I'd say it was heading southeast. If you pressed me for an everyday explanation, I'd say it might have been a road flare tied to a balloon or something. Whatever it was, it was very odd. When I gave up and turned north again, it was 9:17pm. I just wanted to be on the record in case anyone else reported it too."],"City":"Shimerville","Weather Factors":"None","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/29599.html.txt","/var/www/straped/mufon/org/29599.html"],"Case Number":"29599","Object Features":"None","trends":["There have been no other sightings in Shimerville","This sighting has never been favorited."],"Country":"United States","Disposition":"Insufficient Data","Summary":"Red Light Hovering Motionless Over Shimerville","Object Flight Path":"Stationary","Date of the Event":"06/17/2011 09:15 UTC","Longitude":"-75.528297","Viewing Distance":"Unknown","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.495945,+-75.528297(29599)&iwloc=A&hl=en\"> mufon case (29599) map </A>"}