{"Date of the Event":"07/22/1973 12:00 UTC","Case Number":"29591","Log Number":"US-06172011-0008","Date Submitted":"06/17/2011 06:21 UTC","divs":["Sighting Details In the early 1970s a friend and myself were walking home, we lived somewhat in the country, between developing Oklahoma City and Moore, The Airport is fairly close and it was common to see or hear airplanes as they approached the airport. That evening i noticed a tall dark object fairly close to us (appx 500ft. away) hovering in the air, was not able to make out much detail from this angle, but it appeared to be as tall as it was wide. My friend and I debated and he thought it was just an aircraft etc. but several minutes go by and it apparent this is too stationary, and there is no noise, albit the humming sound comming from the telephone line which was very near us.As we debated on what this was , slowly the craft began a very slow 90 degree turn, as it did so quickly it became apparent what it was, as soon as it began turning we noticed lights also, most striking was a very large triangular light in the dead center with a brilliant white light, it also had a series of colored lights on a lower rung of the craft, We could see it was about 500 ft away and very low flying no more than a hundred feet or so,. At this time i became noticably nervous. and had concerns as to what their intentions were, this is the era where cattle mutilations and abducties and experiments were common. My friend, however was ready to approach them and meet them, At this time i was lit up like a lightbulb with a very brilliant white light, it had no noticable heat, i looked at my friend and we were both shinning white, it was at this time i noticed that we were not casting any shaddow from the light, which struck me as peculiar, with the vehicle in front of us and at the angle the light should have cast a shadow of our bodies, it did not the light completely surrounded us, at the time i assumed, or thought the light was imminating from the large triangular light (which had very soft, rounded corners and was appx. 20-30 feet around) , but i do not remember seeing the light come from the triangular one. I was very apprehensive and its like my life passed before me and i did not feel good about the encounter, even though my friend did, and i took only about 2-3 steps back, and slowly convinced my friend to do the same, all this time the craft was still decending slowly directly towards us, my friend finally took a step or 2 back, the light was still shinning on us, remarkably, as if to read our minds the craft stopped when we backed off, several more minutes passed and it just hovered in front of us, shortly there after it made several very quick and non-uniform ascents upward, traveling at an unbeleivable speed, the pattern of flight showed no planning etc, just zig-zaged and finally away. Through the years i have wandered if the events i remember are all that happened, and to the best i can remember this was the extent of this encounter, i did feel a sense of ease in the fact that when we showed conscious thoughts of apprehention, the craft stopped, this was more than enough evidence to convince me that there was intelligent life guiding it and making decisions, and i admit i felt some respect at the time for not being carried away without my will. I have shared this story a few times over the years and as most people shrug it off and do not beleive it, however there is no doubt what the 2 of us saw was very real. Years ago i looked at a pamplet which identified all of the UFOs seen by people across the world, and sure enough one of the depicitions is indeed very close to what i saw that night, so that at least has given me some comfort."],"Disposition":"Unknown","Object Shape":"Disc","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around July 22nd 1973"],"City":"Moore","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/29591.html.txt","/var/www/straped/mufon/org/29591.html"],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=35.346808,+-97.484173(29591)&iwloc=A&hl=en\"> mufon case (29591) map </A>","Longitude":"-97.484173","Sighting Duration":"00:15:00","Latitude":"35.346808","Source":"MUFON","Object Flight Path":"Hovering then path","Country":"United States","Summary":"Witness a large object low flying turn around and shinning a white light.","Tags":"City","Object Features":"Other","Region":"Oklahoma"}