{"Date of the Event":"04/30/1992 06:00 UTC","Object Shape":"Other","Region":"Maine","Weather Factors":"Unknown","trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around April 30th 1992"],"Tags":"City","Case Number":"2960","Object Flight Path":"Straight-line path","Date Submitted":"04/30/1992 06:00 UTC","Source":"MUFON","Summary":"I saw 2 lights in the sky flying side by side","divs":["Sighting DetailsMy daughter and grandson who was only 3 yrs old at the time were going to theBangor Mall to shop. We left the house at about 800 pm. When we turned ontoroute 9 in Eddington I noticed 2 round lights in the sky about 2-3 miles awayand approx. 200 feet in the air. I watched the objects and they seemed totravel along beside us at the same distance until we were into Brewer. I toldmy daughter that we should go and sit someplace and watch these objects, becauseit is hard to tell what direction they are traveling when you are not in astationary position, so we went to Service Merchandise on the Bangor MallBoulevard and we sat and watched lights travel in a straight line, which lookedas if they were following I-95 towards Newport, Me. This was about the timethat a lot of sightings were reported in that area. The objects were travelingjust above the horizon so we could see them clearly. When they reached what Ithink was the Newport area, one of the objects decended and the other objectkept going South for about 2 minutes, and then it turned and started back, whenit started back the first object, which had decended, started back up to meetthe second object, and then they started back towards Bangor. Within a couple ofminutes we lost sight of them because of some trees that were in the way of ourview. We drove to Stillwater Ave. to see if we could spot them again but wecould not find them again."],"Disposition":"IFO","Sighting Duration":"01:00:00","City":"Bangor","Country":"United States","Longitude":"-68.772984","files":["/var/www/straped/mufon/html2text/2960.html.txt","/var/www/straped/mufon/org/2960.html"],"Object Features":"Undisclosed","Latitude":"44.807232","map":"<A HREF = \"http://maps.google.com/maps?q=44.807232,+-68.772984(2960)&iwloc=A&hl=en\"> mufon case (2960) map </A>","Log Number":"","Viewing Distance":"Over One Mile"}