{"Summary":"Two pulsing dots in the sky rotating, then stopping, then moving to the west.","Longitude":"-76.415448","Date Submitted":"06/18/2011 12:32 UTC","Disposition":"Insufficient Data","Region":"New York","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29604.html.txt","/var/www/straped/mufon/org/29604.html"],"Object Flight Path":"Hovering then path","Weather Factors":"None","Object Shape":"Star-like, Other","City":"Fulton","divs":["Sighting Details1. On the corner of Division st. and S 7th st, i was with my friend at a playground with minimal street lights for being inside the city. 2. Coincidentally, i brought my video camera on a thought of seeing a ufo. I looked up in the north west sky at the stars and see the two lights. 3+4. I did not know what to make of it. The two lights pulsed red,blue,red,blue, and rotated simultaneously in the form of a circle and also were getting closer and closer to each other. I yell, and suddenly the two lights glide away from each other horizontally and very swiftly. My friend looks up just after the right light vanishes and the left light 0freezes in place and blends with the stars around it. 30 seconds pass and the frozen lights begins gliding slowly toward the west. We follow but ends up blending in with the sky. 5. I had a video camera but it did not capture any stars. Strangely, the reason for bringing the camera was to look for ufo's and see just how common they were. That night changed my life because now I believe 100% 6. the pulsing star moved slowly and ended up blending into another star. I can't remember exactly how we llost it, because we followed it for at least 20 minutes and it just blended into the night sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.324496,+-76.415448(29604)&iwloc=A&hl=en\"> mufon case (29604) map </A>","trends":["There have been 6 other sightings in Fulton","There were no other sightings in Fulton on or around July 11th 2010"],"Source":"MUFON","Object Features":"None","Tags":"City","Country":"United States","Latitude":"43.324496","Log Number":"US-06182011-0005","Date of the Event":"07/11/2010 10:45 UTC","Case Number":"29604"}