{"Object Features":"Undisclosed","Date of the Event":"06/17/2011 10:01 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29608.html.txt","/var/www/straped/mufon/more/29608_submitter_file1__IMG_0308.JPG","/var/www/straped/mufon/more/29608_submitter_file2__IMG_0309.JPG","/var/www/straped/mufon/more/29608_submitter_file3__IMG_0311.JPG","/var/www/straped/mufon/org/29608.html"],"Log Number":"US-06182011-0009","City":"East Brunswick","map":"<A HREF = \"http://maps.google.com/maps?q=40.441506,+-74.397938(29608)&iwloc=A&hl=en\"> mufon case (29608) map </A>","Object Shape":"Triangle","Source":"MUFON","Latitude":"40.441506","Disposition":"Unresolved","Summary":"We were driving through NJ Turnpike when we witnessed this very bright and unusual object.","Tags":"City","Object Flight Path":"Undisclosed","Date Submitted":"06/18/2011 04:05 UTC","divs":["sighting detailswe were driving down the nj turnpike and we were between exits 9 and 10. it was exactly 10 pm at night because i checked. my mom,who was driving, told me to look ahead at the bright \"moon\". turns out it wasn't a moon but a very weird object in the sky. at first we thought it was a blimp that was flying but after we kept looking, it looked very weird. to both of us it seemed as if it were triangular or pyramid like in appearance. also of importance was a blinking red light it had on the bottom. it would blink every 6 seconds or around. also, it looked as if the craft was still but it was moving slowly to the right. after about 2 minutes, we lost sight of it because it the trees blocked it out. 30 seconds into it, we saw it again by the raritan river. it looked even further away and this was with turnpike being a straight away through all this. i took a video while this was happening. also, it seemed as if it was turning and going away from the turnpike because the red, blinking lights were turning until it wasn't visible. we eventually passed it and we couldn't see it anymore. my mom and i have never seen anything like that so that's why i waited till today to report it. if you guys could message us back with what you think we would greatly appreciate it. thank you, hope this helps your orangization p.s- i was searching the internet and another ufo was spotted in south kearny, new jersey. they look pretty similar i would say. you might want to check it out [link moved to additional evidence section\\cms\\tg]"],"trends":["There have been 4 other sightings in East Brunswick","There were no other sightings in East Brunswick on or around June 17th 2011","This sighting has never been favorited.",""],"Country":"United States","Case Number":"29608","Weather Factors":"Unknown","Region":"New Jersey","Longitude":"-74.397938"}