{"Case Number":"29609","Date of the Event":"06/14/2011 08:22 UTC","Weather Factors":"Unknown","Longitude":"-80.383521","Object Shape":"Flash, Sphere","Viewing Distance":"Over One Mile","Region":"Florida","Tags":"City","divs":["Sighting DetailsEVERYDAY I GO HOME DRIVING FROM MY OFFICE AND TAKING 41NW STREET GOING EAST TO GET INTO THE PALMETTO HIGHWAY,THAT NIGHT AS SOON I DID CROSS 97AVE I NOTICED A STRONG CIRCULAR LIGHT IN THE HORIZON IN FRONT OF ME AND ABOVE THE CITY LIGHTS AND TRAFIC LIGHTS, THE SPHERE WAS POSITIONED NORTH OF THE MIAMI AIRPORT AND STEADY ,I KEEP DRIVING AND THE SPHERE WAS MOVING VERY SLOW SOUTH CROSSING OVER THE AIRPORT, AT THAT MOMENT I REALIZED THAT CANNOT BE A PLANE IF THAT IS MOVING NORTH TO SOUTH AND THE PLANES LAND IN MIAMI EITHER FORM WEST TO EAST OR EAST TO WEST, I TOOK MY CELLULAR PHONE AND START RECORDING WHILE DRIVING, WHEN I DID CROSSED 87 AVE AND THEM 84TH Avenue I SAW THAT THE SPHERE HAD MOVE SOUTH OF THE AIPORT AT ABOUT 3 TO 5 MILES AND THE SPHERE WAS BIG AND SUPER BRIGHT,IT WAS EMITTING A VERY CONSTANT BRIGHT FLASHING LIGHTS, I KEEP RECORDING UNTIL I WAS UNDER THE HIGHTWAY BRIDGE AND TOOK THE ENTRANCE TO THE HIGHWAY AND I COULD RECORD ANYMORE SINCE I WAS TAKING A 350 DEGREE CURB, AT THAT RAMP GOING UP I KEEP SEEING THE SPHERE UNTIL I WAS FACING NORTH AND I LOST THE SIGHT OF IT.I WAS SURE THAT THE BIG SPHERE WAS NOT A PLANE AND THE ONLY THINK THAT COULB BE A BIG HELIPCOTER, BUT THERE WAS NOT ANY METALLIC FORMS AND i NEVER SAW A HELICOPTER PRODUCE SUCH OF INTENSE FLASHING LIGHTS AND HOW A HELICOPTER WILL BE TRAVELING FROM NORTH TO SOUTH OVER THE AIRPORT INTERFERING WITH THE AIR TRAFICC, SAW THAT NIGH I LOOK AT THE LOCAL NEWS AND I DID NOT HEAR ANY REPORTS OF AN STRANGE OBJECT."],"Latitude":"25.848128","City":"Doral","Sighting Duration":"00:05:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=25.848128,+-80.383521(29609)&iwloc=A&hl=en\"> mufon case (29609) map </A>","Log Number":"US-08012011-0035","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29609.html.txt","/var/www/straped/mufon/org/29609.html"],"Object Flight Path":"Stationary,Straight-line path","Source":"MUFON","Summary":"On June 14th I left my office going home and I saw a huge sphere of flashing lights standing on the clear sky.","Date Submitted":"08/01/2011 06:48 UTC","trends":["There have been 3 other sightings in Doral","There were no other sightings in Doral on or around June 14th 2011","This sighting has never been favorited.",""],"Disposition":"Insufficient Data"}