{"Date Submitted":"06/18/2011 10:13 UTC","Log Number":"US-06182011-0003","Viewing Distance":"101-500 Feet","City":"El Paso","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAs my husband and I traveled in separate vehicles we observed a massive rectangular object about the size of two football fields end to end travel over us and glide silently at about 150ft off the ground, bank left and then continue up and over the distant hills.. We observed a red glowing spear on one side that was from one end of the object to the other and could see the glow from the other side that also appeared to be red. There was no sound emitted from the object and we observed several massive spotlights on the front of the object. It was traveling so low that if we had a rock we could have hit it. There were several other vehicles on the road and we are curious whether others have reported this sighting as it lasted for an extended period of time. I found the sighting both terrifying and somewhat exciting. We were driving from L.A. to Florida and even ten years later discuss this brief encounter on a regular basis. Can't stop thinking about it..."],"Case Number":"29602","Object Features":"Other","Object Shape":"Cylinder, Square, Rectagular","Longitude":"-106.483441","Source":"MUFON","Region":"Texas","files":["/var/www/straped/mufon/html2text/29602.html.txt","/var/www/straped/mufon/org/29602.html"],"Date of the Event":"12/01/2001 09:00 UTC","Tags":"City","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Latitude":"31.76238","Disposition":"Unknown","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around December 1st 2001"],"Summary":"Driving in separate vehicles, my husband and I observed a massive rectangular object with glowing red spears that extended the length of the object on both sides travel over us at 150ft off the ground, bank left and move on over the hills","map":"<A HREF = \"http://maps.google.com/maps?q=31.76238,+-106.483441(29602)&iwloc=A&hl=en\"> mufon case (29602) map </A>"}