{"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["sighting detailsi was just leaving mc'donalds after the liquor store closed so it was just after 10pm. i was driving my car down a dark stretch of suburban neigbhorhood road. i saw a kid in the opposite lane, walking funny, looking up at the sky with his cell phone glowing in his face the darkness. i thought that was weird, so i looked behind me up into the sky, and i almost (deleted) my pants. way up in the sky there were two bright orange things almost swirling, but just kind of floating and carving around. i was driving about 30mph and headed toward a stop sign. i slowed my car down and actually came to a stop, a foot into the opposite lane. i just sat there in my stopped vehicle looking up at the sky saying holy (deleted) holy (deleted) i then whipped my car over to the side of the road, parked that thing and started running full speed back down the road. the \"fireballs\" were now much further away and looked very distant. my view was blocked by trees so i had to keep running. i got to the opening and the were gone. i stood there for a about 15 seconds and then from behind me! i saw two more \"fireballs\" float right over my head! they gained speed and flew up and kind of danced and then procedded to just fade and dissepear. i had run about 100 yards now and i saw the kid on the other side of the road right by mcdonalds, still with his cell phone recording. i yelled \"do you know what the hell those things were!\" and he replied \"no!\" so i ran over and we were both just flabergasted and tripping out. i actually noticed a plane with bright lights approaching and i was so excited i couldn't believe there were cars just driving around oblivious to what just happened. i watched the video on the kids cell phone and we exchanged phone #s and i went on my way back to my car. as i was walking back to my car i noticed that the large plane\\jet had actually done two circles over the spot just overhead! i called the kid and told him about the plane. and said i'd call him tomorrow. now i've got the videos to share."],"Object Features":"Undisclosed","Log Number":"US-06182011-0001","Object Shape":"Cigar, Other","map":"<A HREF = \"http://maps.google.com/maps?q=44.851492,+-93.037105(29600)&iwloc=A&hl=en\"> mufon case (29600) map </A>","files":["/var/www/straped/mufon/html2text/29600.html.txt","/var/www/straped/mufon/more/29600_submitter_file2__Photo0081.jpg","/var/www/straped/mufon/org/29600.html"],"Date Submitted":"06/18/2011 12:37 UTC","Date of the Event":"05/20/2011 10:15 UTC","Country":"United States","Viewing Distance":"Unknown","Longitude":"-93.037105","Summary":"Bright orange orbs float and dance in sky","Latitude":"44.851492","City":"Inver Grove Heights","Source":"MUFON","Disposition":"Unresolved","Region":"Minnesota","trends":["There have been 5 other sightings in Inver Grove Heights","There were no other sightings in Inver Grove Heights on or around May 20th 2011","This sighting has never been favorited.",""],"Case Number":"29600","Tags":"City"}