{"Sighting Duration":"00:00:55","divs":["sighting detailsi live on the space coast of fla, 'n i have seen a lot of strange objects in the sky, usually at night. one afternoon i was sitting in my back yard, taking pics of my tropical plants, when i heard a buzzing\\humming sound to the north. the sky was overcast, i looked up in the direction and saw a kind of a barrel shape floating. i took some pics w' my digital cam but they didn't seem to register. i also had a 110mm cam which i also shot a pic to the north. i followed the sound toward the east 'n snapped a pic as it went behind some trees. it then was heading south 'n came out into the clearing 'n i snapped another pic. it then kinda leaned forward 'n took off really fast heading west. when i came into my house i tried to download my digital cam but it was blank except for the flower pics. my 110mm had a 24 film roll 'n at this time there were 10 snaps. i used the cam over 5 yrs 'n when the roll was used up, i had it developed. i had thought maybe the pics didn't come out like the digital. i was surprised when they looked so clear. as i was watching this thing, i suddenly knew how they move, how they beat gravity. the pics i enclosed were scaned, i have original films."],"Country":"United States","Date Submitted":"08/01/2011 06:38 UTC","Weather Factors":"Unknown","trends":["There have been 9 other sightings in Titusville","There were no other sightings in Titusville on or around June 10th 2004","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=28.621009,+-80.803474(29601)&iwloc=A&hl=en\"> mufon case (29601) map </A>","Latitude":"28.621009","Disposition":"Insufficient Data","Object Features":"Undisclosed","Longitude":"-80.803474","Region":"Florida","Source":"MUFON","City":"Titusville","Object Shape":"Cylinder, Other","Tags":"City","Summary":"Humming/Buzzing Sound","Case Number":"29601","Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"06/10/2004 01:15 UTC","files":["/var/www/straped/mufon/html2text/29601.html.txt","/var/www/straped/mufon/more/29601_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/29601.html"],"Log Number":"US-08012011-0034","Viewing Distance":"Unknown"}