{"divs":["Sighting DetailsI was coming home after band practice recently and looked up to notice 2 green lights waving around in the sky very briefly, as if it were searching for something or emitting some sort of \"laser therapy\" to the atmosphere. I've never seen anything like it. I'm not sure if the other craft had its own green light or if it was only the reflection from the first craft, but as soon as I had depicted 2 crafts one had quickly disappeared. Then the craft in my primary focus seemed to change its lighting from the green spot lights to a variation of light pattern blinks of green and red as soon as it had distinctively changed its path, which really shocked me seeing as how it was definitely not an airplane. It would've had to have been making impossible maneuvers and changing its light scheme around, and the disappearence of these crafts happened in an instant. The main craft seemed to hover about for about a minute then completely changed its direction and disappeared into thin air. I literally had to pull over to watch this for about a minute or so. It was single handedly one of the most unexplainable events I've ever experienced to this day."],"Sighting Duration":"00:01:00","Region":"Arkansas","Object Features":"Unknown","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=36.33462,+-94.109577(29603)&iwloc=A&hl=en\"> mufon case (29603) map </A>","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/29603.html.txt","/var/www/straped/mufon/org/29603.html"],"Object Shape":"Saturn-like","Summary":"2 ufo's using green spot light and changing direction","Tags":"City","Longitude":"-94.109577","Date of the Event":"06/15/2011 10:30 UTC","Latitude":"36.33462","Weather Factors":"Unknown","Source":"MUFON","Case Number":"29603","Date Submitted":"06/18/2011 10:58 UTC","City":"Rogers","Log Number":"US-06182011-0004","trends":["There have been 16 other sightings in Rogers","There were no other sightings in Rogers on or around June 15th 2011"],"Object Flight Path":"Stationary,Path with directional change,Path then hovering","Country":"United States"}