{"Longitude":"-118.540786","Date Submitted":"04/10/2004 08:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.398674,+-118.540786(2961)&iwloc=A&hl=en\"> mufon case (2961) map </A>","Viewing Distance":"Over One Mile","Weather Factors":"None, Unknown","Sighting Duration":"00:00:59","Region":"California","City":"Santa Clarita","Case Number":"2961","Disposition":"Unknown","Log Number":"","Object Flight Path":"Unknown","Summary":"Sizable orange anomaly SE of Jupiter at 848PST 041","Object Features":"Unknown","Tags":"City","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around April 10th 2004"],"Latitude":"34.398674","Object Shape":"Sphere","Country":"United States","files":["/var/www/straped/mufon/html2text/2961.html.txt","/var/www/straped/mufon/org/2961.html"],"Date of the Event":"04/10/2004 08:48 UTC","divs":["Sighting DetailsAs I frequently do, I was undertaking astronomical observation. The night inquestion, I was doing some casual observation for nebulae with a small 80mmscope and a UHC filter on an AltAz mount. At the time of the incident, I waslooking at Mizar in Ursa Major.I looked away from the scope and turned eastward. Thats when I noticed thatthere was a star that had suddenly appeared. This star was approximately 1.7 to2.1 degrees SE of Jupiter and shined a steady orange with about the samemagnitude and apparent size as Jupiter. I thought to myself, Goodness, therestwo Jupiters This object was stationary for approximately two to four seconds. Ihad enough time to look at Jupiter, look over to Sirius in the south, and lookback just to verify that this object came out of no where. The AltAz location ofthe object at first sighting would have been approximately Alt 158.17 Az 58.40with a Right Ascension Declination of 1053 04.07 .The star began to move and hook down around and below Jupiter. Specifically,this object dropped approximately 14 degree eastward, changing directionnorthward as it hooked around. It traveled northward for approximately five tofive and one-half degrees. The object slowly faded from its steady orange colorto dark.If its of any interest, the dogs in the neighborhood were suddenly barkingexcitedly. I hadnt noticed this barking prior to this sighting.FYI - I have made one other MUFON report about a year ago re a cylindricalobject sighted over the same region during the day. At the time of beinginterviewed, I related an incident that occured in approximately 1977 when I wasa child in Westchester County, NY where I had observed a group of orange lights.To the best of my recollection, this orange light was similar - however, furtheraway - than the Westchester sighting.Being a rather serious amateur astronomer I have some real serious equipment andinterest, I am very attentive and rawther knowledgable with regard to the skies.I had not had anything to drink more than 24 hours prior to this sighting and Ido not take prescription drugs or any other drugs. I simply dont drink when Imobserving.I wear a -2.0 corrective lens, which I was wearing at the time of theobservation. I have very good eyesight when I am wearing my glasses. Forexample, with seeing that astronomers might regard as a 52"],"Source":"MUFON"}