{"Disposition":"Unresolved","Date Submitted":"06/19/2011 02:38 UTC","files":["/var/www/straped/mufon/html2text/29616.html.txt","/var/www/straped/mufon/org/29616.html"],"divs":["Sighting DetailsMy mother, my nephew and I were on our back deck,,we were watching the sky, as we always do looking for UFO's when my 2 year old nephew said \" Alien Spaceship\" and pointed to the sky south of us..we laughed and continued talking about how weird it was that he said that..he likes all types of sky vehicles and my mother said to him \"Look, here comes an airplane\", we all looked up to see a flash of light over the trees in front of us,,then a flash of light to the south then a few blinks and it was north then a blink to the east and it was gone..all of this without a sound. Since we live on the third floor, it took me a minute to get down to the parking lot, I watched the sky til my mother and nephew came down to look too..we saw nothing..we walked to an area with a bigger expanse of sky and watched for about half an hour to see if we could see it again, but there was no repeat sighting..the tiny ball of light zig zagged across the sky in the directional pattern I described above..the whole event lasted approximately 10 seconds.It was very exciting..my mother knew what it was as soon as it began zig zagging across the sky,this was mt moms third encounter..she was witness to the sighting in the Hudson Valley in 1984, ao ahe was thrilled, not afraid. The time of the event was 11:45 P.M."],"Tags":"City","Latitude":"41.211638","Date of the Event":"06/18/2011 11:45 UTC","Viewing Distance":"Unknown","Case Number":"29616","trends":["There has been one other sighting in Croton-on-Hudson","There were no other sightings in Croton-on-Hudson on or around June 18th 2011"],"Log Number":"US-06192011-0003","Region":"New York","Object Flight Path":"Path with directional change","Country":"United States","Weather Factors":"Unknown","Summary":"flashing light traveling west to east then south to north then east in less than 10 seconds","Source":"MUFON","City":"Croton-on-Hudson","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.211638,+-73.884638(29616)&iwloc=A&hl=en\"> mufon case (29616) map </A>","Object Shape":"Circle, Flash","Sighting Duration":"Undisclosed","Longitude":"-73.884638"}