{"Case Number":"29617","divs":["Sighting DetailsMe and my kids and my nieces were up tonight because we are having a bad thunderstorm, so we decided to look out my patio windows and look at the lightning, what we seen astounded us, we have never seen this ever... Well hovering down the street above some houses, behind some trees what a huge disc shaped object with bright spinning blue lights, it shot out like 3 or 4 bright beams of light, then the blue lights went out then reappeared bright blue spinning lights again, then all of a sudden it zipped up, and shot out another bright beam of light when it disappeared... A few minutes later we were all freaking out with what we just saw, so we were glued to the window to see where it went if it would pop up again, and it did, briefly above the complex in front of us, then disapeared again..since then we haven't seen it... But we want to know if anyone else witnessed this where we live. We are really afraid. When we first seen it we thought immediatly it was a ufo, it was hovering low to the ground, it was not a plane or helicoptor or nothing of that, we were having a really bad storm and neither one of those can hover and sit and fly that low, and shoot out beams and have large bright blue spinning lights. We are confused, afraid, want to know what it was and is, why it was there, what it was doing..we are terrified. Unfortunatly we didn't capture any photos, we were glued to the windows to even run for the camera."],"Summary":"Big disc shaped, bright blue lights spinning in a circular motion, with a white light in the center","Object Flight Path":"Stationary","City":"Kansas City","Sighting Duration":"Undisclosed","Object Features":"Dome","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around June 19th 2011"],"Longitude":"-94.571877","Country":"United States","Log Number":"US-06192011-0004","Viewing Distance":"21-100 Feet","Date of the Event":"06/19/2011 01:24 UTC","Weather Factors":"Windy, Lightning, Rain, Light","map":"<A HREF = \"http://maps.google.com/maps?q=39.104886,+-94.571877(29617)&iwloc=A&hl=en\"> mufon case (29617) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/29617.html.txt","/var/www/straped/mufon/org/29617.html"],"Date Submitted":"06/19/2011 03:15 UTC","Latitude":"39.104886","Disposition":"Unknown","Source":"MUFON","Object Shape":"Disc","Region":"Missouri"}