{"Date of the Event":"05/01/1983 12:00 UTC","trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around May 1st 1983"],"Longitude":"-118.779902","Object Features":"Patterned Surface","Region":"California","Disposition":"Insufficient Data","Log Number":"US-06182011-0013","Weather Factors":"None","Country":"United States","Object Shape":"Square, Rectagular","Summary":"flew low over house humming sound, lights, a lot of detail underneath","City":"Simi Valley","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29612.html.txt","/var/www/straped/mufon/org/29612.html"],"Case Number":"29612","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.277997,+-118.779902(29612)&iwloc=A&hl=en\"> mufon case (29612) map </A>","divs":["sighting detailsgetting ready for work, i felt a vibration and went outside to the back yard. the object was just gliding over the back of the house. very very slow.it was flying low just over the tree tops and power lines. it was very visable to me and not something seen from a distance. there were whitish\\yellow lights on side. also a lot of detail underneath such as the outline of passage ways, vents etc. i am not sure what to call it but the object was not smooth underneath. there was absolutely no sound, it was dark almost black. it glided over the house to the next street, then wham it sped away so fast i didn't see it in a matter of seconds. still silent. this event took place in simi valley ca. the street name was roldan. when i got to work at the telephone company one of the other women there said her husband told her a similar story. the next day i understand 2 police officers reported a story of having seen a ufo the night before. to this day (even though my husband and friends tease me) i know this was a real ufo. up until then i never really thought about ufos. but, i am a believer now. i know not every sighting can be real, but this one was! a few years ago, on a whim, we went to roswell while traveling. i reported my story at the museam. one of the staff members said to me \"oh, you saw a mother ship\"! i wonder if it's true."],"Object Flight Path":"Path with directional change","Date Submitted":"06/18/2011 07:29 UTC","Viewing Distance":"21-100 Feet","Source":"MUFON","Latitude":"34.277997"}