{"Country":"United States","Weather Factors":"Unknown","Tags":"City","Latitude":"40.730265","divs":["Sighting DetailsI was driving home, after dropping my girlfriend home. We had just come from a night out in Brooklyn and Manhattan. I was driving on the Grand Central Parkway heading east bound to the cross island parkway at 3:45 AM on Sunday June, 19 2011. When I noticed this bright star like object in the sky to my right. It looked like it was moving, but I'm not sure if it was to me being in motion or not. So I kept monitoring this bright lit thing in the sky. I was trying to distingiush if it was a star or a plane. When I merged onto the cross island parkway south bound, I decided to pull over on the side of the parkway at the Union Turnpike exit ramp besides the parkway. I put the car in park, and could see this bright lit thing to my left now. I observed it for about for about 2-3 minutes before driving off. I did notice, it wasn't moving. So I knew it wasn't a plane. Another thing, I took notice of, was that it wasn't pulsating like a star. It just seemed to stand out, because there was no other stars, or clouds in the sky. It also seemed bigger then a usual star, and maybe not as far as a star. I might be wrong, and it could possibly be a star. But, I decided to take a picture at 3:49 AM. To my surprise when I got home minutes later and looked at the picture, and zoomed in on my iphone. I noticed it had a shape to it. I thought, that was unusual. I do have a understanding of UFO's, as I've been intrigued in the subject for years. I've never had a sighting before, but I don't look up as often as some people do. But, I do know the difference, between planes, stars, and other things. I wish I had taken more pictures, and monitored it longer. Since, it didn't move, I decided to go home. I texted to my girlfriend at 3:59 AM. I also emailed it to a close friend at 4am."],"Longitude":"-73.744179","files":["/var/www/straped/mufon/html2text/29622.html.txt","/var/www/straped/mufon/more/29622_submitter_file1__photo.JPG","/var/www/straped/mufon/org/29622.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.730265,+-73.744179(29622)&iwloc=A&hl=en\"> mufon case (29622) map </A>","Summary":"Something I saw while driving home","Case Number":"29622","Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around June 19th 2011","This sighting has never been favorited.",""],"Object Features":"Unknown","Object Shape":"Star-like, Unknown","Date Submitted":"06/19/2011 03:39 UTC","Viewing Distance":"Over One Mile","Log Number":"US-06192011-0009","Date of the Event":"06/19/2011 03:49 UTC","Region":"New York","City":"New York","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Source":"MUFON"}