{"trends":["There have been 21 other sightings in Fayetteville","There was one other sighting in Fayetteville on or around June 18th 2011","This sighting has been favorited 1 time.",""],"Sighting Duration":"00:02:00","Case Number":"29626","City":"Fayetteville","Date Submitted":"06/19/2011 06:01 UTC","Longitude":"-94.154166","Disposition":"Unresolved","Object Shape":"Fireball","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-06192011-0013","divs":["Sighting Details At Aprox. 22:18 central (03:18 zulu time), 3 friends, and myself witnessed 10 -15, orange - yellow flying lights. The lights appeared to be flying from south to north in Fayetteville Arkansas, along interstate 540, in triangular like formations. The lights made no sound and no contrail. 3 or 4 lights seemed too turn west along Wedington road. Atleast 2 other lights disappeared from sight completely in an unknown direction , the rest of the lights continued north over interstate 540. The lights appeared to be under 10,000 feet (3,030.3 meters) and moving quite fast but at varying speeds. I witnessed what seemed to be 1 light dropping altitude, speeding up and passing another light in the same formation. The light that was passed then broke sharp to the west and a few other lights behind it followed along the same route west over wedington road. I can say with 100% assuredness that in my 6 yrs Launching rockets as a MLRS crew member in the US army national guard, and my time in Iraq watching night time take offs and bombing raids by US jets, multiple helicopter formation at night, and UAV flights, that it was nothing like anything i have ever seen while being in the military. I am also an avid stargazer and satellite watcher. Saturn was almost right over head (maybe 80 degrees above the horizon) and most of the lights seemd to be at least 3 to 4 times as bright as Saturn. The 2 pictures i took on my phone did not capture the full formations, or other relative objects. The pictures are a bad quality but I would provide the pictures to any one who wants to study further."],"files":["/var/www/straped/mufon/html2text/29626.html.txt","/var/www/straped/mufon/more/29626_submitter_file1__IMG_0485.JPG","/var/www/straped/mufon/more/29626_submitter_file2__IMG_0486.JPG","/var/www/straped/mufon/org/29626.html"],"Tags":"City","Latitude":"36.06605","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Summary":"Lights in the sky over Fayetteville","Region":"Arkansas","map":"<A HREF = \"http://maps.google.com/maps?q=36.06605,+-94.154166(29626)&iwloc=A&hl=en\"> mufon case (29626) map </A>","Country":"United States","Weather Factors":"None","Source":"MUFON","Date of the Event":"06/18/2011 10:18 UTC"}