{"Weather Factors":"Unknown","divs":["Sighting Detailsmy friend and I were standing outside my apartment smoking a ciggerette when I saw an object out of the corner of my eye. At first I just assumed it was a plane because we have military and civilian aircraft fly over alot. We both looked up at the same time and saw a low flying object that appeared to be a distict triangle shape. It had three bright lights on each corner of the triangle, as well as a blinking red light in the middle of the triangle. As it went over us and into the distance, I could see more lights straight accross the back of the object which confirmed to me the triangle shape I was seeing. The object did not make alot of noise and its approach was almost completly silent. After about 20-25 seconds after we first saw the object, it vanished in an instant. amazingly enough, taking a picture was the last thing on my mind. I was so drawn in and amazed at what we were seeing. I have never seen anything like it before. My friend and I didnt even know what to say after it vanished besides, what the #$%& was that thing?"],"Latitude":"39.855566","Country":"United States","Object Shape":"Triangle","Region":"Ohio","Longitude":"-82.808845","Object Features":"Undisclosed","Case Number":"29637","Tags":"City","Viewing Distance":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.855566,+-82.808845(29637)&iwloc=A&hl=en\"> mufon case (29637) map </A>","files":["/var/www/straped/mufon/html2text/29637.html.txt","/var/www/straped/mufon/org/29637.html"],"Log Number":"US-06202011-0006","Source":"MUFON","trends":["There have been 2 other sightings in Canal Winchester","There were no other sightings in Canal Winchester on or around June 19th 2011"],"Date of the Event":"06/19/2011 11:00 UTC","Sighting Duration":"00:00:25","City":"Canal Winchester","Date Submitted":"06/20/2011 11:26 UTC","Summary":"A triangle UFO flew low over my apartment complex at a slow speed then vanished after roughly 25 seconds","Object Flight Path":"Undisclosed"}