{"Date Submitted":"06/19/2011 10:33 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Longitude":"-87.624388","Tags":"City","Date of the Event":"06/18/2011 01:45 UTC","Log Number":"US-06192011-0017","Case Number":"29630","Latitude":"41.883614","map":"<A HREF = \"http://maps.google.com/maps?q=41.883614,+-87.624388(29630)&iwloc=A&hl=en\"> mufon case (29630) map </A>","Weather Factors":"Unknown","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around June 18th 2011"],"Source":"MUFON","Country":"United States","Summary":"bright organge light low flying and moving fast through sky","Object Shape":"Circle","Object Features":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"00:00:45","divs":["sighting detailsi was walking down the sidewalk with a four of my friends at about 2am after leaving a bar when one noticed a bright orange light traveling across the sky. it appeared to be flying low and was extremely fast. this was in chicago at clark and winnemac while we were walking north on clark street. it was very bright orange, and larger than anything i've seen before. we knew immediately it wasn't a plane because we could see two other planes flying in the sky and they were much higher and farther away in the sky. the planes were a different color- more yellowish\\whitish and were moving much slower relative to the orange light. we stared at it trying to determine if it was a helicopter or plane, but it didn't look like anything any of us had seen before. it was literally a round very bright orange light moving forward very fast. one of my friends even described it as looking like a planet moving fast across the sky. we were watching for about 45 seconds as it moved very rapidly across the sky in a straight line then the orange light dimmed, and completely disappeared. we watched for 5 minutes after the disappearance but it didn't become visible again. all we could see were the two planes that continued to fly. we were all pretty confused as to its disappearance because none of us have ever seen a plane that disappeared while flying across the sky."],"City":"Chicago","Region":"Illinois","files":["/var/www/straped/mufon/html2text/29630.html.txt","/var/www/straped/mufon/org/29630.html"]}