{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29634.html.txt","/var/www/straped/mufon/org/29634.html"],"Object Shape":"Star-like","Latitude":"44.059789","Country":"United States","City":"Eugene","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.059789,+-123.083754(29634)&iwloc=A&hl=en\"> mufon case (29634) map </A>","Weather Factors":"Unknown","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around June 17th 2011"],"Date of the Event":"06/17/2011 11:30 UTC","Disposition":"Unknown","Object Features":"Undisclosed","Tags":"City","Longitude":"-123.083754","Region":"Oregon","divs":["sighting detailson the evening of june 17th, 2011 around 23:30 while at an outdoor festival near mount pisgah, oregon i was gazing up at the stars when i noticed what appeared to be a very large, bright, white object in the western sky about a third of the way up from the ground towards the sky's zenith. when i first noticed it, it was stationary and i thought it might be a planet, though it appeared to me larger than i have ever known a planet to appear. as i watched, this object suddenly grew slightly larger with a flash of white light then immediately shrank down to the size of the surrounding stars. as i kept my eye on it the small light slowly begin moving upwards toward the zenith of the star field, faded away and was gone about 5 seconds after it started moving. about 10 minutes later i noticed two very large, bright white objects in the southern sky. they appeared exactly as the first object did in brightness and size and they appeared to be about a hands width distance apart if i stretched my arm out in front of me. the lights were rather high in the sky, about 2\\3 of the way up from the ground to sky's ceiling. they were positioned vertically to one another. i watched them in this stationary position for at about 10 seconds. at that time they shrank down to the size of stars and then begin moving together toward the west very slowly. they appeared to move together as one unit, keeping an equal distance apart as they moved. they grew dimmer and disappeared about 5 seconds after they started moving. i kept watching the sky for about 30 minutes after the last sighting but i never saw any other usual lights. i was very curious what these lights could have been and i spent a lot of time trying to think of a mundane explanation for what i saw."],"Sighting Duration":"Undisclosed","Summary":"I saw 3 bright lights in the sky near Eugene, Oregon that shrank in size, moved away and then disappeared.","Case Number":"29634","Date Submitted":"08/09/2011 06:48 UTC","Log Number":"US-08092011-0125"}