{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.807867,+-81.372267(29647)&iwloc=A&hl=en\"> mufon case (29647) map </A>","Longitude":"-81.372267","Latitude":"40.807867","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","City":"Canton","Region":"Ohio","Log Number":"US-06202011-0016","Date of the Event":"06/18/2011 10:15 UTC","Date Submitted":"06/20/2011 06:04 UTC","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"29647","files":["/var/www/straped/mufon/html2text/29647.html.txt","/var/www/straped/mufon/org/29647.html"],"trends":["There have been 13 other sightings in Canton","There were no other sightings in Canton on or around June 18th 2011"],"Weather Factors":"Unknown","Object Shape":"Sphere","divs":["Sighting DetailsI was running around the track at the Kent State Univ. Stark Campus on Sat. night, June 18th around 10:15 pm or so. My husband and daughter were also there standing on the hill and watching the Jackson Township fireworks at the park while I was running. About halfway throught he fireworks, I noticed an orange ball of light seemingly moving towards the fireworks in the sky. This is near the Akron Canton airport and at first I thought it was just a very near-by plane heading for the airport but getting very close to the fireworks. Then it suddenly disappeared. It struck me then that it had not looked like the ususal plane lights we always see when running up there and it also looked larger and very round and bright orange too, unlike all the other planes flying by. So then about 15 minutes later, I was still running around the track and they already had had the fireworks finale and then right after it we suddenly saw the same kind of orange balls of light again in the sky only this time there were three of them and they were in a crooked but vertical line in the sky and seemed to be closer now and almost moving towards us, this time quite a ways away from the fireworks area in the sky. I ran over to where my husband and daughter were sitting and said \"what are those things?\" and my husband said he didn't know but they were very strange! We have never seen anything like them before in our lives. So we watched them in the sky then. My husband and daughter remained sitting while I kept running while we all watched them and then suddenly they just disappeared behind some trees. I did call a friend of mine who is a Jackson cop and he was working at the festival that night. I aksed him if he saw them or if they had any reports of odd balls of orange lights in the sky but he said no. He then suggested I call the nearby airport and check with them but I have not yet had a chance to do that. Since I am a Certified UFO investigator for MUFON myself, I wanted to make this report mainly just in case someone else might report the same thing that we saw that night in the same area."],"Object Features":"Undisclosed","Summary":"Orange round balls seen in sky near community festival and fireworks event"}