{"files":["/var/www/straped/mufon/html2text/29641.html.txt","/var/www/straped/mufon/more/29641_submitter_file1__UFOsJune.jpg","/var/www/straped/mufon/more/29641_submitter_file2__Piedmontandufolocation.jpg","/var/www/straped/mufon/org/29641.html"],"Date Submitted":"06/20/2011 01:28 UTC","Log Number":"US-06202011-0010","Sighting Duration":"Undisclosed","Region":"Missouri","Summary":"Multiple UFOs and missing time in SE Missouri mountains","Latitude":"37.783335","Source":"MUFON","divs":["sighting detailsi am the assistant state director for missouri mufon, and a start team investigator. the person with me was a star team investigator for kansas mufon. we had a spectacular ufo sighting while on the last leg of our trip from kansas city to piedmont, mo, located in the se corner of missouri in wayne county. the duration of the trip should have been six hours according to my gps. with stops taken into consideration, we should have arrived at 9:30 p.m., but we arrived at our destination at 10:37 p.m., so we had over an hour of missing time. we cannot account for the missing time. as i was driving south on 67 highway past farmington at the very south edge of francious county, i noticed a bright object in the sky to the east. the object appeared to be three very bright lights in a triangular pattern. it was approximately the size of a large pea held at arm's length. the object was much brighter than any planet (5 x brighter than venus) and was bluish\\white in color. it was at approximately 50 degrees off the horizon and ene of our position. it appeared to get larger and clearer as i watched it. i also had an uneasy feeling, which started before i saw the object. i asked my passenger (the other mufon investigator) to take a look at the object, so he opened the sunroom of my suv and watched it. he said the object moved to the north, and when i looked it was gone. he watched several shooting objects without tails moving from west to northeast, but behaving like shooting stars. then three long white lights appeared, moving very fast from a ne to sw direction. the first triangular object appeared and disappeared three times. these objects moved around the sky for approximately fifteen minutes. the skies clouded over and we lost sight of the objects. we were both very uneasy about the entire sighting, and thought it was coincidental that this occurred while we were on our way to the piedmont ufo festival where i was speaking. while at the event, my computer, which contained the power point presentation on ufo sightings in missouri, was stolen from my locked vehicle. it has since reappeared in my house on my dining room table, minus the power point presentation i was going to use and another one on a different ufo case. the laptop was not there last night, but was this morning. i am absolutely positive it was in my vehicle, since we discussed taking it inside on the first day of the event (friday), but i said no since i didn't need it until saturday, and moved it to a different spot in the back seat. also notable: we had some paranormal events happen at the house we were staying at in piedmont, which consisted of scratching and banging noises on the outside of the house and a glass breaking sound inside the house, which two of us heard, as well as some objects moved to different locations. i had a strange dream about being abducted and restrained on a ufo, but that may be just a dream given the circumstances. attached are google earth pictures with the location of the first sighting noted and the location of our destination. note that east of our first position where the first ufo was spotted is the mississippi river."],"Case Number":"29641","map":"<A HREF = \"http://maps.google.com/maps?q=37.783335,+-90.41486(29641)&iwloc=A&hl=en\"> mufon case (29641) map </A>","Viewing Distance":"Unknown","trends":["There have been 6 other sightings in Farmington","There were no other sightings in Farmington on or around June 16th 2011","This sighting has never been favorited.",""],"Country":"United States","City":"Farmington","Disposition":"Unknown","Object Features":"Unknown","Object Shape":"Sphere, Star-like, Triangle","Longitude":"-90.41486","Date of the Event":"06/16/2011 10:10 UTC","Weather Factors":"None","Tags":"City","Object Flight Path":"Path with directional change"}