{"Log Number":"CA-06202011-0018","Object Shape":"Cigar","Date of the Event":"03/17/2011 08:07 UTC","divs":["Sighting DetailsLangley, BC Canada: I was travelling home from a late university project March 17, 2011 and I was waiting at a bus transfer stop in Langley when I noticed two low-flying aircraft. I initially ignored as regular air traffic until I realized that the light configuration was completely wrong. Both objects had the same configuration of a single red light on what I determined to be the nose of the craft and one white light on the rear a fair distance from, and positioned a bit lower to the ground than the nose light. The only difference between the crafts was the lead vessel's red light pulsed at about 2Hz while the second one's red light was more of a blink at about 1Hz. The fuselage was difficult to see due to the time of day and the bright lights on it, but it should have still been bright enough outside to see a conventional plane fairly well. Instead all I could see was a vaguely cigar shape lacking an upright tail fin, wings, or any sign of a cockpit, and seeming to be slightly fatter in the middle while still being aerodynamic. It also seemed to have some protruding instruments on the underside and a bulbous part on which the rear white light was attached. This was particularly difficult to see due to the colour of the craft which seemed to be blacker than the sky around the object and seemed very slick as it made my eye slip off it constantly and seemed to blur the outline so that it blended into the sky. Sort of like waving a magnifying glass in front of you while you're looking at the sky and it bends the light. The lights were the only reason it was easy to track. The lead object had come into view first followed by the second so they each moved independently; however once settling into a very close single-file formation [about 2 of these craft could fit end to end between them] they flew in perfect formation flying west at a relatively slow speed for the remainder of the sighting. They were only flying maybe a couple hundred feet in the air and not too far in the distance but throughout the whole pass there was complete silence from these things. No propeller noise, jet sound, or humming at all. But strangely this is the weirdest part. Just as the lead vessel was beginning to drop altitude and was approaching some trees which would obscure it from behind me in the opposite direction was the sound of what I feel was multiple jet engines. I've been to many airshows and this sounded exactly the same as a small number of jets doing maneuvers at a fairly high altitude. I couldn't see anything at all when I looked for them though, no beacon lights or commercial traffic at all. 20 seconds after first hearing the jets I looked back at the UFOs the lead vessel simply vanished before reaching the trees. It's lights went out and the dark fuselage was simply gone. The second UFO however was still there for about 10 seconds and I was watching it closely since I didn't know if the first UFO vanishing had been a trick of the eye. It maintained it's original course and speed and sure enough upon reaching approximately where the lead vessel had been it too vanished. [It is important to note that in the west there was still some light from the setting sun so it's not like the craft simply turned off it's light beacons and flew off.] The lights on the ship went dark immediately but watching the second UFO it's outline remained there for a tiny amount of time as well before just vanishing completely. After this I still heard the jets pass straight over me in the direction where the objects had vanished before coming about and circling a few times before heading south and fading away. Again I never had a visual contact on any of these jets, although several other people who were listening also agreed that it couldn't be a commercial jet. Immediately after this event while I was trying to figure out what happened was when I connected this with another strange thing I had seen in the same location a few weeks earlier when again, two UFO's of the same profile appeared at about the altitude but maybe a bit further away. However during this sighting they were flying at speeds far greater than what they displayed March 17 and to me seemed impressive speed at that distance for a military fighter to match. One came in from the West diving at about a 30 degree inclination, while the second came from the East diving at about a 45 degree inclination. They appeared to be at approximately the same distance from me and their flight paths crossed perfectly both of the crafts missing by what seemed like a couple meters. At the bottom of the dive one craft vanished still going very fast while the other made an 80 degree course correction and continued flying at the same speed. That's basically it, I haven't been back there for a while so I haven't seen them again but I'll definitely be looking."],"trends":["There have been 4 other sightings in Langley","There were no other sightings in Langley on or around March 17th 2011"],"Disposition":"Unresolved","Case Number":"29649","Summary":"Two UFO's in formation did a flyby then vanished without a trace over Langley British Columbia, March 2011","Source":"MUFON","Object Features":"Patterned Surface, Appendage(s)","Tags":"City","Country":"Canada","Latitude":"49.107255","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/29649.html.txt","/var/www/straped/mufon/org/29649.html"],"Region":"British Columbia","City":"Langley","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=49.107255,+-122.645114(29649)&iwloc=A&hl=en\"> mufon case (29649) map </A>","Object Flight Path":"Straight-line path,Path with directional change,Other","Date Submitted":"06/20/2011 08:28 UTC","Longitude":"-122.645114"}