{"Date Submitted":"06/21/2011 12:43 UTC","divs":["Sighting DetailsMy brother and I were on our back porch smoking (cigs) when we saw two star like objects flying very slow from (I think) a south westerly direction to an easterly (I think) direction, when I first saw them I thought they were big bright stars and that's how my mind registered them at 1st...a couple of seconds later I realized they were moving toward our direction. They were not moving the same direction as the stars. They were big,very bright white and silent one was behind another to its 5 o'clock position. My brother has binoculars and he got them and he says through them he couldn't make out anything but light. I ran inside to get my mother because I wanted her to see them (this took about 15 seconds maybe less) as we stepped out the door he said to our mom look right there and then they were gone, they hadn't been close to being overhead yet. He said in the split second he took the binoculars down and back up to keep looking they were gone, he didn't see how they left, at the speed they were going they still should have been there. He went around the front of the house to see if he could spot them and couldn't. About 10 minutes later we saw (it could have been a satelite but I dont think so) another bright white light heading (I think) south to north it seemed to change speed but also the brightness of it faded away and went from a large bright white dot to a very small one until we couldnt see it anymore. About another 10 minutes later I saw a very small white dot heading again south to north at a steady speed then it took a 90 degree turn north east and out of my viewing range. We saw over the next little while some other small white dots moving around in unregular patterns. I've never seen anything like this and I've seen UFOs before. This happened over about the period of an hour between 10:30 and 11:30 eastern daylight time in West Roxbury (Boston) Ma. June 20, 2011."],"Object Features":"None","Weather Factors":"None","Date of the Event":"06/20/2011 11:30 UTC","Longitude":"-71.055413","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29653.html.txt","/var/www/straped/mufon/org/29653.html"],"Log Number":"US-06212011-0002","Region":"Massachusetts","Source":"MUFON","Object Flight Path":"Straight-line path","Object Shape":"Star-like","Tags":"City","City":"Boston","Disposition":"Unresolved","Case Number":"29653","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around June 20th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.364991,+-71.055413(29653)&iwloc=A&hl=en\"> mufon case (29653) map </A>","Sighting Duration":"Undisclosed","Summary":"two star like objects moving slow","Latitude":"42.364991"}