{"map":"<A HREF = \"http://maps.google.com/maps?q=-33.917608,+18.427965(29657)&iwloc=A&hl=en\"> mufon case (29657) map </A>","Region":"Western Cape","Object Shape":"Disc","Tags":"City","Latitude":"-33.917608","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/29657.html.txt","/var/www/straped/mufon/org/29657.html"],"Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Cape Town","There were no other sightings in Cape Town on or around June 21st 2011"],"Viewing Distance":"101-500 Feet","Object Features":"None","Country":"South Africa","Summary":"3 UFO's viewed for more than an hour, one close enouugh to make out the shape","Case Number":"29657","Source":"MUFON","Longitude":"18.427965","Log Number":"ZA-06212011-0006","City":"Cape Town","Date of the Event":"06/21/2011 09:00 UTC","Date Submitted":"06/21/2011 04:12 UTC","Weather Factors":"Unknown","divs":["sighting details5 friends and myself all witnessed a star-like object far away from my house and viewed it for around an hour before we were unable to see it anymore (820pm until 915pm). the object was changing hues between yellow, red and blue and moved erratically, but generally away from us. we then decided to all drive to the nearest school rugby field (rondebosch boys' high school) to get a betterview. on the field that object mentioned continued further away from us, however it was definitely not in a regular way and also was definitely visible in an area of sky (low to the horizon) in which no other stars could be seen due to smoggy conditions. the object became more distant and on the way back to our vehicle we spotted a far closer yellow-orangey light moving, as well as an identical object to the one described to the north (opposite direction to the original one we had viewed for more than an hour). the yellow-orange light\\object immediately thought by us to be an aeroplane sudde then suddenly changed direction and came toward our direction. it became extremely clear that the object was a bright glowing disc (oval from where we were standing) that quickly disappeared in the direction to the north. after this close sighting of a definite object of superior technology we excitedly all jumped into my friend's car and drove to an even bigger open space around the corner called rondebosch common. when we arrived there at around 1030pm all 3 objects had disappeared."]}