{"Source":"MUFON","Date of the Event":"11/04/2010 02:51 UTC","Country":"United States","Log Number":"US-08042011-0003","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=39.654255,+-104.98118(29650)&iwloc=A&hl=en\"> mufon case (29650) map </A>","Viewing Distance":"Unknown","Region":"Colorado","Object Shape":"Cigar, Circle, Disc, Oval, Sphere","divs":["Sighting DetailsI was sitting outside on my patio when I saw two bright objects flying somewhat fast and slow down. I ran to grab my camera because I noticed these things flying in an odd formation and leaving a contrail, and not some sort of chemtrail. I never really looked at the film until now. It is in HD format. You can clearly see 1 orb materialize in the middle of the screen at 00:00:04 and start to spiral vertically. 00:00:05 a second orb is seen on the left side of the screen moving at a linear path to the right of the screen. 00:00:06 1 orb vanishes before it leaves the right of the screen. a few milliseconds later the vertical one disappears. 00:00:07 camera starts to blur out and the bright one on the bottom vanishes? I stopped filming, I get images everyday now, I woke up with my camera in IR mode and Sony says its not possible on that camera Sony DSC-W370, I don't know where the information came from but the next day I used my night vision goggles in the dark with the white balance one button push setting and figured it out. The day this happened I had the same feeling that I was meant to see it or told to."],"Case Number":"29650","City":"Englewood","Date Submitted":"08/04/2011 12:10 UTC","Summary":"Two discs flying and two orbs. One orb performs a spiral the other passes through the middle of it. Then they all vanish.","Longitude":"-104.98118","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 16 other sightings in Englewood","There were no other sightings in Englewood on or around November 4th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Latitude":"39.654255","files":["/var/www/straped/mufon/html2text/29650.html.txt","/var/www/straped/mufon/more/29650_submitter_file2__DSC00532.JPG","/var/www/straped/mufon/org/29650.html"]}