{"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Diamond, Disc, Oval, Sphere, Other, Unknown","divs":["sighting detailsi had just turned right from n byhalia rd onto white rd heading west. i was accelerating to 30mph and panned my eyes from the evening clouds east of me (where it was becoming dark) to the west where i was heading (no clouds). toward the west, south-west i noticed a distinct blue glow\\light with a white dot at the center. the object was stationary, and had the shape of a flattened diamond or flattened infinite shape. i knew it wasn't an airplane (i've grown up around a major airport and i have never seen anything like this and the apparent elevation and size of the object in relation to setting sun ruled out reflection) so i started thinking it was a star but the shape was really inconsistent with that as well. (i want to make record of this next part although it seems really strange.) i then had the thought, \"i wonder if it knows i see it.\" at which point it simply vanished. almost like if someone was shining a flashlight at you from across a field and then turned the light off without warning. it was just gone. there were no other objects in the sky. no silhouettes, shimmers, nothing. i continued scanning the area trying to come up with an explanation, the hair started standing up on the back of my neck as i realised i can't explain what i just saw. i then called my wife and told her \"i think i just saw an honest to god ufo.\" i'm writing this now to make record as i am trying to recall as much detail as possible and i am going to return to the site tomorrow and try and get some pictures and reference points to see if i can come up with an explanation for what i saw."],"Object Features":"None","Sighting Duration":"00:00:30","Date Submitted":"06/20/2011 11:13 UTC","Tags":"City","Case Number":"29651","Longitude":"-89.664527","files":["/var/www/straped/mufon/html2text/29651.html.txt","/var/www/straped/mufon/org/29651.html"],"Log Number":"US-06202011-0019","Region":"Tennessee","Disposition":"Insufficient Data","City":"Collierville","map":"<A HREF = \"http://maps.google.com/maps?q=35.042036,+-89.664527(29651)&iwloc=A&hl=en\"> mufon case (29651) map </A>","Source":"MUFON","Object Flight Path":"Stationary","trends":["There have been 3 other sightings in Collierville","There were no other sightings in Collierville on or around June 20th 2011"],"Date of the Event":"06/20/2011 08:39 UTC","Latitude":"35.042036","Country":"United States","Summary":"Blue stationary light with white point at center dissappeared suddenly"}