{"Date Submitted":"06/21/2011 03:58 UTC","Object Flight Path":"Hovering then path","Date of the Event":"06/20/2011 10:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29664.html.txt","/var/www/straped/mufon/org/29664.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.049872,+-76.138524(29664)&iwloc=A&hl=en\"> mufon case (29664) map </A>","Case Number":"29664","Object Features":"None","trends":["There have been 20 other sightings in Syracuse","There were no other sightings in Syracuse on or around June 20th 2011"],"Latitude":"43.049872","Country":"United States","Weather Factors":"None","Longitude":"-76.138524","Tags":"City","divs":["Sighting DetailsA friend and I were driving over to another friend's house in Liverpool to stay there for the night. It was just my friend and I in the car at the time. As we drove through my neighborhood, I noticed a large ball of light in the sky. It was very bright, which drew my attention. I am a long time believer in extraterrestrial activity, and have been visited before by UFOs. My friend was a skeptic and didn't really believe many of the stories I would tell. I pointed out the light to him, and he looked up at it along with me. We first believed it to be an airplane, but it didn't move like one and it definitely didn't look like one. There were not multiple lights visible on it, just one large ball of gold-ish light. As we watched the UFO, it seemed to sit still in the sky. The two of us began to have feelings of panic and disbelief. It then started to move once we noticed it, and it made somewhat of a U-Turn. The light grew larger, and as soon as we contemplated turning down a street to follow it, the light disappeared. I can only describe it as like a light switch turning off. There was no dimming of the light or anything. It just disappeared right in front of us. Come to find out, another friend of mine reported seeing the same exact light in Rome, NY up at a drive in movie theater."],"Summary":"Large ball of light","Disposition":"Unknown","Log Number":"US-06212011-0012","Sighting Duration":"Undisclosed","City":"Syracuse","Viewing Distance":"Unknown","Object Shape":"Star-like","Region":"New York"}