{"Region":"California","Case Number":"29661","Tags":"City","Date Submitted":"06/21/2011 02:09 UTC","Longitude":"-122.23055","Country":"United States","trends":["There have been 6 other sightings in Red Bluff","There were no other sightings in Red Bluff on or around June 20th 2011"],"Sighting Duration":"Undisclosed","Object Shape":"Other","divs":["sighting detailsmy daughter and i were watching a strange light on a mountaintop just beyond the foothills across the valley from us to the east. it's some reflective something that doesn't belong there, and we've watched it off and on since last year. while we were sitting on the porch, a big black smoking ball came into view from the north, just over the foothills but in front of the mountain where the light was--approximately 2-3 miles away. it trailed black smoke or vapor, stuttered up a bit and down a bit as it flew slowly across, the trail of smoke following it like a snake. it passed behind a tree just across the highway from here, and we fully expected to see it come out the other side above\\behind the hills, but it never did. so it must have gone down just beyond those hills. no sound. nada. if i were to guess its size at a 2-3 mile distance, i'd say it was easily 150-300ft in diameter, not including the tail of smoke. the light on the mountaintop beyond it disappeared while we were watching the black ball, though there was still enough sun to reflect. odd. really really odd."],"Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/29661.html.txt","/var/www/straped/mufon/org/29661.html"],"Date of the Event":"06/20/2011 08:13 UTC","Latitude":"40.179929","Object Features":"None","Source":"MUFON","City":"Red Bluff","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.179929,+-122.23055(29661)&iwloc=A&hl=en\"> mufon case (29661) map </A>","Log Number":"US-06212011-0010","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Summary":"BIG round black smoking ball traveling north to south in stuttered flight"}