{"Case Number":"29669","City":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"06/18/2011 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.640345,+-89.391528(29669)&iwloc=A&hl=en\"> mufon case (29669) map </A>","Longitude":"-89.391528","Latitude":"40.640345","Sighting Duration":"Undisclosed","Summary":"numerous spheres traveling in the same general direction at very high altitude within minutes","trends":[""],"Date Submitted":"06/21/2011 09:53 UTC","divs":["Sighting Detailswe were testing some new camera equipment and looking up in the sky and noticed the spheres traveling in a southwest direction directly overhead coming generally from the northeast to the southwest. In all we seen at least 6 and did film 4. Of all that we saw in the 20 minutes or so period only one traveled in a northernly direction. They all traveled consistantly and maintained regular flight path. None left contrails or had any flashing lights or strobes. Typical jet airliners were also observed and clearly displayed flashing lights and strobes and contrails on the higher altitude jets. I have filed other reports recently and was not going to file another but decided to do so, just for that fact that there is something going on up there and it needs to be documented. I can nearly walk outside any night that the skies are clear and see craft with no flashing lights or strobes. My location is about 70 -100 miles outside of Chicago in a rural setting. You can see in the video that 1 or 2 of the craft seen to flare up extra bright and then go dim. I dont believe these are satelites just becase four passed over in the same flight paths in a matter of minutes. Also satelite flare outs (Bright to dim) happens when the solar panel escape the setting sun. These flare ups went from bright to dim and back and some were dim to bright. Also some of the brighter craft could not be seen with the naked eye. In addition to the craft I filmed, one craft raced the entire horizon east to west in about 3-5 seconds, it moved so fast that I could not get the camera on it. It let 3 lights pulses out that were very very bright and intense. Its last bright pulse light the sky up briefly light a very bright lignting flash."],"Object Shape":"Disc, Oval, Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/29669.html.txt","/var/www/straped/mufon/org/29669.html"],"Region":"Illinois","Disposition":"Unresolved","Log Number":"US-06212011-0017","Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Object Flight Path":"Undisclosed"}