{"Summary":"Four star like lights seen in sky outside Centerville GA","Latitude":"32.630145","Source":"MUFON","Country":"United States","divs":["Sighting DetailsI was coming home after work, headed down Hightower Trail into Gwinnett Co. towards Centerville. We had thunderstorms that evening and the front was just pushing through so the sky was beginning to clear. I noticed to my right were two \"stars\" and I realized it was awfully early to start seeing stars. Trouble is, you couldn't see the sky yet, just the clouds but the \"stars\" were in or in front of the clouds. As I came around the corner where the landscape dips down giving you a view of the horizon for several miles, I noticed there were actually four \"stars\" forming a gentle arc. I quickly picked up my camera and snapped a picture of the objects. The lights did not move nor blink, they were white stationary points of light, exactly what a star in the night sky looks like. My camera info shows I snapped the picture about 8:18 pm but my clock in the car read 7:45pm or so. I watched the objects for about 5 minutes trying to match the objects to anything familiar but could not. I pulled back onto the road and continued towards home. By the time I reached the top of the next hill, the objects were gone. I can't say exactly how long the event lasted since I didn't see when it began but I watched the objects for 5 or 6 minutes. In that time, the \"stars\" never moved or blinked, not did they change position at all."],"Log Number":"US-06212011-0011","Date of the Event":"06/18/2011 08:18 UTC","City":"Centerville","Case Number":"29663","Date Submitted":"06/21/2011 03:49 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29663.html.txt","/var/www/straped/mufon/more/29663_submitter_file1__010.JPG","/var/www/straped/mufon/more/29663_submitter_file2__011.JPG","/var/www/straped/mufon/org/29663.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.630145,+-83.689628(29663)&iwloc=A&hl=en\"> mufon case (29663) map </A>","Object Shape":"Star-like, Unknown","trends":["There have been no other sightings in Centerville","This sighting has never been favorited."],"Disposition":"Unresolved","Tags":"City","Longitude":"-83.689628","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Region":"Georgia"}