{"Country":"United States","Object Shape":"Circle, Sphere","Log Number":"US-06212011-0016","files":["/var/www/straped/mufon/html2text/29668.html.txt","/var/www/straped/mufon/org/29668.html"],"Weather Factors":"None","Sighting Duration":"00:03:00","Disposition":"Unresolved","Summary":"close up video of dissapearing ufo","Viewing Distance":"501 Feet - 1 Mile","Region":"Indiana","Date Submitted":"06/21/2011 10:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.616158,+-86.102833(29668)&iwloc=A&hl=en\"> mufon case (29668) map </A>","City":"Greenwood","Case Number":"29668","Date of the Event":"06/20/2011 11:00 UTC","divs":["Sighting DetailsAround eleven oclock pm. I went into my back yard to have a smoke. I noticed a strange light comming from the south it was moving my direction (North) and a little east from me.It kept getting bigger and brighter and I couldnt really tell if it was orange ,yellow or white it kind of did a pulse and the shades of it changed a bit. I knew something was extremely odd then . I ran inside and got my camcorder.As I got back outside and started filming I zoomed in as close as I could go and then I realized this thing was not wright. it had what looked like circular swirl marks in or on it and they would change and then it just vanished . The object was over a farm field area. I filmed this with a sony handycam dcr-sr68. This was all odd in itself but,this isnt the first time I saw something strange over here.In your archives I reported another with video date 6-16-08. same kind of object I believe but 6-16-08 came from the north and not the south. they seem to be vanishing in the same area.The days I video taped them was 3 years and 4 days apart ."],"Object Features":"Patterned Surface, Other","Tags":"City","Object Flight Path":"Path then hovering","Source":"MUFON","Longitude":"-86.102833","Latitude":"39.616158","trends":["There have been 17 other sightings in Greenwood","There were no other sightings in Greenwood on or around June 20th 2011","This sighting has never been favorited.",""]}