{"Weather Factors":"None","Date of the Event":"06/21/2011 10:18 UTC","Case Number":"29671","City":"Redding","Longitude":"-122.387955","Date Submitted":"06/22/2011 02:09 UTC","divs":["Sighting DetailsWhile I was outside enjoying the solstice and as the light dimmed I scanned the sky for lights. There were three moving at once although I figure they were planes. AS I saw the forth one which actually was moving faster than the other \"planes\" A bright flash of light revealed what I perceived as a craft shaped like two V wings put together one smaller than the other, Like four points on the wing but distinct wings . . . like two triangles, or boomerangs put together. AS the flash got brighter it started to move into the Dipper of the Big Dipper. AS it moved in the flash diminished yet I could still see its faint movement as the light dies down. They always seem to enter that way or even when they leave just opposite. They enter with a bright flash and light and move to their flight pattern. cloaking or just powering down changes the intensity of the crafts . . . well, for lack of a better word, their light. They dim completely away and cannot see them after a bit but usually I can follow them as they dim. They slow down at that point. It was way up and the \"dipper\" was 88 to 90 degrees in the western sky. The tip of the handle being at 90 degrees, maybe 93 so that's where the flash was tonight. I believe that their activity will pick up again as it did last year June 27th. It's thereafter that I had 33 plus sightings ending around November 3rd."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.5953,+-122.387955(29671)&iwloc=A&hl=en\"> mufon case (29671) map </A>","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Region":"California","Latitude":"40.5953","Disposition":"Insufficient Data","Object Shape":"Boomerang, Flash, Star-like","files":["/var/www/straped/mufon/html2text/29671.html.txt","/var/www/straped/mufon/org/29671.html"],"Viewing Distance":"Over One Mile","Log Number":"US-06222011-0001","Tags":"City","trends":["There have been 39 other sightings in Redding","There were no other sightings in Redding on or around June 21st 2011"],"Summary":"A Flash of Star like light V shaped Ship moving through the Big Dipper","Country":"United States","Source":"MUFON","Object Features":"Wings"}