{"Country":"United States","Region":"Indiana","Viewing Distance":"21-100 Feet, 101-500 Feet","Disposition":"Unresolved","Weather Factors":"None","Date Submitted":"06/22/2011 12:22 UTC","trends":[],"Source":"MUFON","divs":["Sighting Details I was on my lunch hour about 2145 Bright Headlight Singular moving northwest which was straight towards me..it was cloudy and not dark out all the way yet. It startled me so i called me sister on the phone to see if she can go outside and veiw it, it turned more north and then appeared starlike almost disapeared then lit up brighter again THEN again turned once again west to east along the path of the river.it was one singular light but smaller so i hung up with my sis took a picture. then I called her back because more lights appeard on it. I cannot describe!!! what shape this object was all the lights i saw were white and there were No Red and no blue and no green one of the white lights sort of .. undulated? not a strobe and not flashing like a plane or jet would flash..the lights were all in a row and there were smaller white lights in the back. I pulled out of my parking spot while on the phone to follow it.. and just as i did the lights were dimming which creeped me out completely and it moved downward fairly quickly. I it looked like it it was treetop by the time it disappeared..out of veiw ..It should have landed on something.... I drove quickly around the curves at work to keep it in my sight, and it was gone.It was sooo eerie I kept my sis on the phone whiile i drove off grounds at work and down the river road and back and it was no where to be seen. I have 2 photos on my phone. I sent them to (name deleted)fg"],"Object Flight Path":"Path with directional change","Case Number":"29677","files":["/var/www/straped/mufon/html2text/29677.html.txt","/var/www/straped/mufon/org/29677.html"],"Object Shape":"Star-like, Other, Unknown","Log Number":"US-06222011-0007","Summary":"Bright singular Headlight,changing appearance as it changed directions","Tags":"City","Longitude":"-85.594704","Sighting Duration":"Undisclosed","Date of the Event":"06/21/0001 12:00 UTC","Latitude":"40.554466","City":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.554466,+-85.594704(29677)&iwloc=A&hl=en\"> mufon case (29677) map </A>"}