{"Longitude":"-84.188797","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"39.768308","Disposition":"Insufficient Data","trends":["There have been 40 other sightings in Dayton","There were no other sightings in Dayton on or around June 21st 2011"],"Summary":"orange globe with no sound, 4 to 5 thousand feet in less then 15 seconds then dissapeared","Weather Factors":"Windy, Light","Date of the Event":"06/21/2011 09:30 UTC","Log Number":"US-06212011-0018","divs":["Sighting DetailsSo it all started when my daughter and I were standing in the road talking to my mother. WE live right in the middle of Wilmington Ohio, when we my daughter spotted a yelowish orange sphere in the night sky about 3 to 4 thousand feet in the air. We watched as it crossed WIlmington thinking it may have been air care ,but it moved slower than a helicopter.As we waited for sound to come there was nuthing to be heard. It did not stay in one straight line, as it moved in an erratic motion. Againg with NO NOISE what so ever . we observed it for 10 to 15 seconds as it crossed clinton county. I kept trying to tell myself that this was nothing but somekind of air plane or helicopter ,but i think that all 3 of us really knew what this thing was it had no marker lights at all just a big orange sphere in the sky . Once it flew from one side of the sky to the other it mysteriously dissapeared in the sky as it shot itself forward toward Sabina, Ohio . Then i never saw the object reappear . I was in totally shock as i didn't know what to think about what i had just witnessed."],"Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.768308,+-84.188797(29670)&iwloc=A&hl=en\"> mufon case (29670) map </A>","City":"Dayton","Object Features":"Undisclosed","Region":"Ohio","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/29670.html.txt","/var/www/straped/mufon/org/29670.html"],"Sighting Duration":"Undisclosed","Case Number":"29670","Source":"MUFON","Tags":"City","Date Submitted":"06/21/2011 11:15 UTC"}