{"Date of the Event":"06/20/2011 10:35 UTC","Country":"United States","Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=37.647057,+-120.989118(29672)&iwloc=A&hl=en\"> mufon case (29672) map </A>","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around June 20th 2011"],"Disposition":"Unknown","Region":"California","Latitude":"37.647057","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/29672.html.txt","/var/www/straped/mufon/org/29672.html"],"Log Number":"US-06222011-0002","Source":"MUFON","divs":["Sighting DetailsI was in my back yard looking at the stars, at night I always have my flash light and would shine it stright up and just all about the sky. I looked to the West and saw 2 bright object side by side headed my way like they were going to go over my head and I flashed my flashlght at them and they kept coming no noise and not very high at all maybe 200 yards up, no blinking lights on any of them. Then they started to move to the North-East, and started to dim there lights so you could barley see them, and they were out of sight at a steady pace. When I looked at my time it was 10:37 pm, and they were gone. Where there came from there a big supermarket and hopefully someone else saw them. I thought they were flying saucer, because they made no noise and had no blinking lights. I could't belive, I thought I was going to get a real good look at them, and when they went the other way I felt empty I thought I was going to make contact for some reason."],"Object Features":"Unknown","Date Submitted":"06/22/2011 02:41 UTC","Case Number":"29672","Longitude":"-120.989118","Object Flight Path":"Straight-line path","Sighting Duration":"00:03:00","City":"Modesto","Summary":"2 objects coming from the West, and were side by side, and both were bright, as they kept moving East they started to dim there lights and went North-East and out of sight"}