{"City":"Pinnacle","Weather Factors":"None","divs":["sighting detailsmy g\\f, i and her dog were walking along oscar frye rd, somewhere around 1\\4 of a mile from rt.268. we stopped for a smooch, when suddenly, i see what from my perspective, giant headlights to my left. they were spaced far wider than a standard plane's lights. and then, it did almost nearly a 90 degree barrel roll- and held that position for something like 2 minutes. while we're (or at least i was) goggling this sight- it traveled out of our sight behind a tobacco barn, and- well, we didnt see it for well past 30 seconds. it should have popped out from behind it in less than 10- at the speed and altitude it was going. it just simply.... took too long to appear. i started up the road, intent on looking for it (i was 40 feet from the building), i was 3\\4 of the way back to it, when my g\\f says 'here it comes!'it went over us, and right on cue (it had been completely silent the entire time) i said 'uh, where's the engine noise?' whoosh! suddenly, engine noise! what happened next, i am not proud of, but it's sure to bring a chuckle... i was carrying a 9 iron, you know... just in case. as this thing got closer (noting the fact there were no formation lights, it had wings far too wide, and my g\\f swears up, down and sideways the cockpit was the size of a bay window- it was far wider and longer than a standard cockpit window- more on that later)... i ended up 100% *convinced* it was not of this planet. it was headed for us, far too slowly, and basically stayed less than 45-50 feet up. was i scared? oh, hell no! i jumped up and down in absolute, unmitigated, unrestrained insane glee, holding the putter. and then realized i had no camera, and swore like a sailor in port. needless to say, the thing flew on, and disappeared behind some trees, completely. *ahem*. anyways, even during this incredibly ridiculous display- i and my g\\f noted the following: no windows other than the cockpit. not even a lit 'the door is here' one.there's discussion as to it even *having* a standard door- it was the left side of the craft- where doors usually are... the cockpit window was 10% longer than a standard jet cockpit. also, it was a continuous piece of window, not broken up by anything holding it up. i also have been told, it was a lot taller as well. the 'cabin lights' were on, and unfortunately, all my g\\f could see was a shape. yes, it was that close. i noticed wings too far up on the body, just too wide for the amount of 'jet', the 'on cue' engine noise, and the fact there was no jet wash. none. not even a slight breeze. there were no formation lights, only something akin to spotlights on the 'wings'. the underside of the wings were white metal, but instead of smooth and wheel well markings- it was a v shape from cockpit back as far as i could see in the craft lighting. it was going hella slow for the altitude it was maintaining. what the hell took it so long to go behind, and then past the other side of a smallish, thin building? my theory is it stopped to hover. a nearly 90 degree smooth as silk roll? for 2 min?? also, i think it did do it for our benefit. as for the jet sound... there was something off about it, but i am just not sure what."],"files":["/var/www/straped/mufon/html2text/29695.html.txt","/var/www/straped/mufon/org/29695.html"],"Latitude":"36.337567","Log Number":"US-08052011-0049","Source":"MUFON","Date Submitted":"08/05/2011 12:34 UTC","Tags":"City","Object Flight Path":"Hovering then path,Path then hovering","trends":["There has been one other sighting in Pinnacle","There were no other sightings in Pinnacle on or around June 23rd 2011"],"Object Shape":"Chevron, Triangle","Viewing Distance":"21-100 Feet","Case Number":"29695","Date of the Event":"06/23/2011 11:30 UTC","Disposition":"Unknown","Object Features":"Window(s), Patterned Surface, Louvres, Wings","Longitude":"-80.427043","Summary":"It's (NOT) a Bird- it LOOKED like a plane! But.....","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.337567,+-80.427043(29695)&iwloc=A&hl=en\"> mufon case (29695) map </A>","Region":"North Carolina"}