{"map":"<A HREF = \"http://maps.google.com/maps?q=39.152991,+-77.20037(29706)&iwloc=A&hl=en\"> mufon case (29706) map </A>","Source":"MUFON","Tags":"City","Latitude":"39.152991","Viewing Distance":"Unknown","Date of the Event":"06/24/2011 08:30 UTC","Date Submitted":"06/24/2011 09:33 UTC","Case Number":"29706","City":"Gaithersburg","files":["/var/www/straped/mufon/html2text/29706.html.txt","/var/www/straped/mufon/org/29706.html"],"Log Number":"US-06242011-0014","Object Shape":"Triangle, Unknown","Object Flight Path":"Straight-line path","Longitude":"-77.20037","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Gaithersburg","There were no other sightings in Gaithersburg on or around June 24th 2011"],"Region":"Maryland","Disposition":"Unresolved","divs":["Sighting DetailsI went to the kitchen to place a plate in the sink and I looked out the kitchen window and a black object caught my eye. I watch it as it moved at a pretty slow speed. It was clearly not a plane, so I kept watching it. Eventually it got out of my sight from the window, so I ran outside to see it. It kept moving at steady pace across the sky. At about the height of a plane or lower. It looked almost triangular in shape. It was the only thing in the sky. I ran inside to put on my flip flops and ran back out to look. I was in the house about 15 seconds, but when I came back out suddenly there were 2 of them. I have no idea where the other one came from. The sky was pretty clear above my house, and at that speed, there is no way that second one could of caught up. It came out of nowhere. The second one was oddly shaped. Was not a triangular like the first. I have no idea what shape that was. They were getting further way, I wanted to follow them, so I ran back inside to grab a shirt. When I came back out they were both gone. I took a walk around the neighborhood to see if I could spot them again, but nothing. Both objects were black, no lights on it at all. I don't know what they were but I'm 1000% sure they were not planes or helicopters."],"Object Features":"Unknown","Summary":"I saw 2 black objects in the sky, no clear shape, but definitley not planes.","Country":"United States","Sighting Duration":"Undisclosed"}