{"Sighting Duration":"Undisclosed","trends":["There have been 24 other sightings in Flagstaff","There were no other sightings in Flagstaff on or around June 24th 2011"],"Disposition":"Unresolved","Viewing Distance":"20 Feet or Less, 101-500 Feet","Weather Factors":"None","Log Number":"US-08082011-0030","files":["/var/www/straped/mufon/html2text/29703.html.txt","/var/www/straped/mufon/org/29703.html"],"City":"Flagstaff","Region":"Arizona","Summary":"Red orb that changed to white, approx 8in diameter","Country":"United States","Object Shape":"Sphere","Case Number":"29703","Date Submitted":"08/08/2011 10:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.204792,+-111.636249(29703)&iwloc=A&hl=en\"> mufon case (29703) map </A>","divs":["Sighting DetailsWhile driving east bound from Flagstaff, AZ to Leupp, AZ, I noticed a red light in the sky. It was approx 800 feet in the air and at first I assumed it was a helicopter because of the low flying distance. I rolled the window down to see if I could hear any type of noise; no sound was present. The time was 1:21am; and as I drove onward, the light descended and flew about 4 feet above the ground. I was able to clearly see it light the ground up red. It flew parallel to my vehicle and just about kept the same speed as my vehicle (65mph). The orb itself, was red, and emitting a red glow - darker red in the center, brighter red around the edges. It was to the left of the vehicle, approx 50 yards away. At this point I was feeling panicked, afraid and curious. As the road turns, I broke sight of the light and while I was turning the bend, a bright light caught my attention in the corner of my eye. The orb, now bright white, and approx 8 inches in diameter, was now flying alongside my vehicle, no more than 8-12 inches above the road. It was flying on the shoulder of the on-coming lane and kept perfect speed with my vehicle (65mph). The time was now 1:24am. While viewing this object, I had no feelings of emotion and I was calm and collected. No noise, besides engine noise was noted, the only notable difference was the presence of cellphone signal (there usually is none). It followed my vehicle for a quarter mile, and it sped up 2 car lengths in front of me and abruptly made a 90 degree turn, upward into the sky, at which point, I leaned forward to see it shoot across the sky, like a shooting star toward the East. It was not as bright when I saw it disappear in the sky. I arrived at my destination at 1:36am. As I was pulling into the driveway, my headlights shone upon a rabbit, sitting where I was about to park. I stopped within 3 feet of the rabbit, which did not move, flinch, blink, of any sort. It was very large and from the ground to the top of the head (not including the ear length) about the height of my hood (approx 37 inches tall). It's width was approx 20 inches wide and it was brown and white mixed color with no distinct pattern or spots. It's eyes were black and it was sitting upright, like that of a cat. The ears were very stiff, long and together, and they were slanted back at an angle, like that of a jackrabbit. At this point, I began to panic, and I called a 2nd party to tell them of what I was seeing. The car remained running with the headlights on and I sat staring at this huge rabbit for about 5 minutes. After talking, I turned my engine and headlights off, and with the outside light from the house, I was able to keep eye contact with the rabbit as I exited the vehicle and proceeded to walk slowly around the rear of the vehicle and into the house, not breaking sight. The area seemed to be still and calm; I did not hear any usual night noises (bugs chirping, dogs barking, etc). Once inside, I remained on the phone until 2:12am."],"Object Flight Path":"Path with directional change","Tags":"City","Object Features":"None","Longitude":"-111.636249","Latitude":"35.204792","Date of the Event":"06/24/2011 01:21 UTC","Source":"MUFON"}