{"Log Number":"US-06252011-0010","Sighting Duration":"Undisclosed","Date of the Event":"11/15/1990 05:15 UTC","Object Features":"Patterned Surface, Appendage(s)","Country":"United States","Latitude":"41.534212","Disposition":"Unknown","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in North Liberty","There were no other sightings in North Liberty on or around November 15th 1990"],"Region":"Indiana","Case Number":"29718","Object Flight Path":"Straight-line path","Longitude":"-86.427234","files":["/var/www/straped/mufon/html2text/29718.html.txt","/var/www/straped/mufon/org/29718.html"],"Weather Factors":"None","Tags":"City","Object Shape":"Square, Rectagular","Date Submitted":"06/25/2011 08:26 UTC","Summary":"Large rectangle visible craft overhead flight within 500 yards.","divs":["Sighting DetailsI am filing this as a belated report since I have not found any other reports from this time and location. Incident of very clear overhead flight of rectangular craft in excess of 1,000 foot length having taken place in the Potato Creek State Park area east of North Liberty,Ind.During this time period there were several other sightings and Police agencies who actually followed similar craft in their vehicles.At 5:10 a.m. I entered my vehicle at state park campground, started it and then noticed the surrounding area of woods was beginning to show light like sunrise.In this area it was too early for sunrise and than I noticed a light shining down into my windshield. I than opened my driver door and stepped out onto my runningboard and looked above my vehicle.Above and slightly to the east was a very discernible and large craft emitting no noise and travelling maybe 2-3 m.p.h.I continued watching this craft travel west-northwest to a position over the reservoir,this taking about 5 minutes.The craft than entered the water in almost a direct downward movement.In a further note, that during the previous days to sighting, the reservoir water level had increased and a lot of people were talking as to how poor fishing had been lately. I than travelled into town where I had commented at a convenience store I had just seen this craft. Several local bus drivers who feared for their jobs than told me I should not speak to anybody about this as a couple of their fellow employees had lost their jobs for talking about seeing this same craft. Shortly after I learned their had been other local reports of these sightings and that the Ind. State police had logged over 100 miles on previous dates of following this craft.There was no fear of this vehicle but an overwhelming calm as to have been given the chance to see such an exquisite vehicle."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.534212,+-86.427234(29718)&iwloc=A&hl=en\"> mufon case (29718) map </A>","City":"North Liberty","Source":"MUFON"}