{"Object Flight Path":"Path with directional change","Longitude":"-122.324147","divs":["Sighting DetailsI work onsite all weekend as I am the weekend manager at a retirment community. I went out to our courtyard to have a cigarette, around 12:30am,and I noticed a large white light that was round and intense. At first I thought it was a helicopter with a spot light, as it appeared to drift a little side to side and seemed to slow down or speed up on it's trajectory. As the light was overhead, I could hear no noise and I expected the light to dim or go out as it passed over, but it did not. I could not make out any fuselage or such, only a bright round white light. It was just as bright going as it was coming. There were no strobe or colored lights blinking. The intensity of the light was, as I said before, was great. I watch it as long as I could, before the treeline obscured my view. It has left me stumped with what I saw, so I decided to report it to your site to see if anyone else may have seen the same thing that I did. This is not the first time I have seen strange objects at night in the Skagit valley. I have had three prior wierd sightings, with corroborating witnesses, however this sighting I was alone."],"Log Number":"US-06252011-0009","Source":"MUFON","Tags":"City","Date of the Event":"06/11/2011 12:00 UTC","Latitude":"48.422286","map":"<A HREF = \"http://maps.google.com/maps?q=48.422286,+-122.324147(29717)&iwloc=A&hl=en\"> mufon case (29717) map </A>","City":"Mt Vernon","Case Number":"29717","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Date Submitted":"06/25/2011 07:02 UTC","trends":["There have been 4 other sightings in Mt Vernon","There were no other sightings in Mt Vernon on or around June 11th 2011"],"files":["/var/www/straped/mufon/html2text/29717.html.txt","/var/www/straped/mufon/org/29717.html"],"Summary":"Saw a noiseless white light fly over Mount Vernon","Disposition":"Unresolved","Country":"United States","Viewing Distance":"Unknown","Object Features":"Unknown","Region":"Washington","Weather Factors":"Unknown"}