{"Log Number":"US-06262011-0002","Summary":"A small fleet of reddish glowing discs, silent for the most part.","Date Submitted":"06/26/2011 01:17 UTC","Date of the Event":"06/25/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/29725.html.txt","/var/www/straped/mufon/org/29725.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.874231,+-77.288038(29725)&iwloc=A&hl=en\"> mufon case (29725) map </A>","Longitude":"-77.288038","City":"Canandaigua","Object Shape":"Disc, Star-like","Weather Factors":"Unknown","Latitude":"42.874231","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Canandaigua","There were no other sightings in Canandaigua on or around June 25th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Case Number":"29725","Region":"New York","Country":"United States","Disposition":"Insufficient Data","divs":["Sighting DetailsMy wife and I were turning onto our block in a subdivision in Canandaigua NY that is located on a cul de sac. As we came around the corned my wife and I noticed several glowing reddish objects in the sky flying from the west (i believe) to the east. After a time the glowing would fade out except for 1 or 2 points on the blackish discs. There were also discs with no lights flying in between the other UAP's. They all seemed the same size. I have never seen a UFO before and I have never seen anything like this before! There was no sound except for when they first came over the horizon but it fades and at one point you can see in the video that it's pretty silent with all these glowing objects flying above. It resembles other videos I have seen over the years but usually out of Mexico or South America. I was able to grab my wife's iphone and shoot this video of them. I stayed outside and watched them all pass, there was about 12 in all. I watched them pretty close, they were all dark in color when not glowing, they made no sound and all flew in the same direction. I did not feel scared or threatened in any way, I was fascinated by what I saw. I watched them until they were all completely out of sight over the horizon. They were flying towards Rt. 332 over the Stablegate development in Canandaigua NY."],"Tags":"City","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON"}