{"Object Shape":"Circle, Triangle","City":"Lincoln","Summary":"Low floating object in strait line from SE to NW ascends over airport area.","Date of the Event":"06/25/2011 11:02 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.813632,+-96.674769(29727)&iwloc=A&hl=en\"> mufon case (29727) map </A>","Log Number":"US-06262011-0004","files":["/var/www/straped/mufon/html2text/29727.html.txt","/var/www/straped/mufon/org/29727.html"],"Longitude":"-96.674769","Disposition":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date Submitted":"06/26/2011 01:40 UTC","divs":["Sighting DetailsI was in my garage from around 10:30 to 11:00pm working with a computer and listening to the radio, which just happened to be the Coast To Coast AM program with Art Bell from his program of Sept. 29th of 1999. The show came to the break and I was heading from the garage to the house door a few feet away from the garage door. I happen to notice what I thought was a 4th of July firework that was seemingly moving slowly upward from above the tree line and neighbor's house. At that moment it had the same goldish color as would the type of firework that would go up over 100 feet and then burst into the typical firework display shell. I had heard some other small fireworks earlier in the evening and assumed this to be a larger one, typical of the college age residing a couple of blocks away. However as I kept waiting for the boom or the firework display, I realized that the \"upward\" direction that this object seemed to be traveling, was not upward as a firework at all, but instead was coming toward my direction. I thought it still to be something like a large size bag or firework on fire that did not burst correctly and was burning as it came my way. I realized as it became closer that there was no sound and it was continuing in a strait line which trajectory was about to go right over my house and neighborhood. I'm noticing that the altitude was constant at this point from the time of my first seeing it to present second. Since I am interested in any such item in the sky being a UFO sighting, I gave it a quick thought, yet would never imagine to see such a thing, I was still pondering that since it was not a firework floating, then maybe a small plane that was on fire trying to make it to the airport which was exactly ahead of the object by about 5 miles. I was seriously expecting to see the object explode or crash in thinking it now has to be a small plane. Now, at this time I was about 30 seconds into watching this object, and the total time was only 45 or so. I'm still trying to deduce it's speed as it seemed to be going slower as it was nearing the area directly over my head. I'm trying to figure out if it were to go slow enough I'd go inside and get my video camera. I'm thinking it could be a helicopter that had a problem. We have quite a few that head to the airport on that same line of travel. I heard no sounds at all, and it still appeared to be around 200 to 300 feet in altitude as I could tell that as it was now directly overhead and seemingly slightly slower in forward speed, that it seemed to be somewhat spherical and yet almost like the triangle shape with 3 circles lighted up under it. It still had that goldish and orangeish glow like burning newspaper, or the typical firework. I'm straining as hard as I can to see details, as I'm still thinking it's going to blow up and spew Darbee all over my area. I really wanted to get my camera, but the thing kept on moving slowly toward the same course headed N.E. to the airport. I quickly moved to the center of my front yard to I could see it \"land\" as it closed in on the airport. Note, there is a 4 lane highway behind my neighborhood area which runs north to south. As this object began to clear my area it seemed to be gaining in altitude at a slightly increasing angle as it continued forward. I thought it would be going on a descent path, but it was gaining height. I still expected it to blow up, but as it was finally getting over the area where the airport was, and seemed to be about 600 feet in altitude, just went mostly \"upward\" and totally out of sight. I'm thinking, did I see a UFO, because it didn't land or explode, it just vanished as it gained altitude rather quickly. All I can say is I would have loved to photograph it as it looked like a helicopter on fire, or something on fire and ready to blow up. I would like to know if anyone else has seen or heard of such occurrence on this eve of June 25 at 11:01 pm or anywhere near that time in the eve. Note, the sky was clear and stars and constellations clearly viable. Note, the forward speed was too fast for a helicopter but more closely that of a small plane, except when it appeared to be right over my head at it's altitude. I did look up at it and did not take my eyes off of it one time. I was actually hoping whatever it was could see me looking up at it, and it became a bit creepy as it did not seem to be moving away as fast as it had approached my area. I still thoughth it was something on fire as it had that type of movement of light as you would see fire at a distance, the light would have some degree of appearance of movement due to the atmosphere, even at a low altitude. When I moved to the center of my yard, I walked through the grass slowly and continued to stay fixed on the object. (I really wanted it to come back) - so I write about it to hope someone else saw a similar object in this time. When I say earlier as to when it vanished as it gained altitude rather quickly, the \"rather quickly\" was typical of UFO stories, as it really appeared to gain altitude so fast that I figured as I'm thinking it didn't land or blow up that it realized it's closeness to the airport and just accelerated upward. I just had a feeling it was going to pull a move like that when it got to that specific area, and it did. In my personal thoughts about it, I'd say, I hope the thing saw me and will plan a return flight, and I will keep a video camera in the garage, ready to use. Maybe this will coincide with some crop circle activity and so on during this evening. (my being anonymous is only for this current time period as I'd gladly give details to a known specific as needed. Thank you from Lincoln Nebraska Sorry I didn't take time to paragraph this."],"Case Number":"29727","Latitude":"40.813632","Source":"MUFON","Sighting Duration":"00:00:45","Viewing Distance":"101-500 Feet","Object Features":"Unknown","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around June 25th 2011"],"Region":"Nebraska"}