{"Object Flight Path":"Straight-line path","Object Shape":"Star-like","Case Number":"29733","Log Number":"US-08072011-0085","Longitude":"-105.098628","Tags":"City","City":"Longmont","Country":"United States","Disposition":"Unknown","trends":["There have been 30 other sightings in Longmont","There were no other sightings in Longmont on or around June 26th 2011"],"divs":["Sighting DetailsLast night between 12 and 1 am I was out walking my dog in Longmont CO. I am always looking up at the sky. There is an airport just a little ways away so I see a large amount of planes and see various light sequences when they are at different angles and landing. But last night it was very unusual. I scanned the sky and saw nothing but stars to the south and a few distant planes to the north. When I turned around back to the south I saw a VERY LARGE pulsating (never going out just bright to dim) red light pretty close and seemed to appear from no where as I just looked in that direction (Longmont is really flat). it appeared about 10x the size and brightness of a typical red blinking plane navigation light. Even when it was dim it was still brighter than regular planes. I saw no other lights and it was flying pretty low and slow heading west. I couldn't really tell how far away it was but I do know it was between the mountains and I. I lost sight of it behind some houses and then saw it again and then lost it for the last time as it disappeared below the roof lines. The entire siting lasted about a minute. All I know is it was very unusual and extremely bright I see a lot of planes and I have never seen this before."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/29733.html.txt","/var/www/straped/mufon/org/29733.html"],"Summary":"Large Bright Pulsating Red Light, silent","Sighting Duration":"Undisclosed","Region":"Colorado","Date Submitted":"08/07/2011 05:31 UTC","Latitude":"40.169367","Object Features":"Unknown","Date of the Event":"06/26/2011 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.169367,+-105.098628(29733)&iwloc=A&hl=en\"> mufon case (29733) map </A>"}