{"Log Number":"US-06262011-0007","Latitude":"41.500865","Weather Factors":"Unknown","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around June 24th 2011"],"Longitude":"-81.685469","map":"<A HREF = \"http://maps.google.com/maps?q=41.500865,+-81.685469(29730)&iwloc=A&hl=en\"> mufon case (29730) map </A>","Date of the Event":"06/24/2011 09:30 UTC","Region":"Ohio","Country":"United States","Object Flight Path":"Undisclosed","City":"Cleveland","Date Submitted":"06/26/2011 08:21 UTC","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/29730.html.txt","/var/www/straped/mufon/org/29730.html"],"Object Shape":"Fireball, Star-like, Other","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsHi, I was sitting in my back yard facing south east. I live near Cleveland Hopkins airport. I can see planes takeoff and land from my chair. At around 9:30pm I noticed a bright light heading my way from south to north. It moved in a straight line until it reached the southwest end of the airport, then went east -north east over the airport. I watched it until it was just a dot. At first I thought it was a plane until it got closer and looked at it clear as day to be engulfed in light, or ablaze. It looked as though it was checking out the airport. After getting up to look at this thing, I didn't know what think about what I just saw. About ten minutes later, here it comes again, from the same direction and flight path,except this time there happened to be a plane just taking off from CLE. The pilot had to have seen this. The object then followed the same flight path as the first time. That evening there was a lower cloud deck. It also seemed the object was flying just under that cloud deck. I was purely amazed to see this and for it to happen twice within ten minutes really kind of shook me up. Whether it was the same craft or another one the second time around, I'll never know. Thanks, (Name deleted)fg"],"Summary":"object engulfed in light moving in a direct manner","Case Number":"29730"}