{"Summary":"bright sweeping illumination.","Date Submitted":"06/26/2011 03:12 UTC","trends":["There have been no other sightings in San Saba","This sighting has never been favorited."],"Weather Factors":"Unknown","Log Number":"US-06262011-0012","Object Features":"Undisclosed","Disposition":"IFO","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date of the Event":"06/21/2011 11:28 UTC","Viewing Distance":"Unknown","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=31.195723,+-98.718098(29735)&iwloc=A&hl=en\"> mufon case (29735) map </A>","divs":["Sighting DetailsI was sitting on the back porch steps of my friends house with his wife. as we talked we both were engulphed with a very intense white light. It swept across the ground and illuminated everything like daylight, except it was to white of a light. It seemed artificial. like stadium lighting. I completely expected to see a helicoper with spotlights on it. But when I looked up there was nothing. I ran around the house and looking all around there was nothing. There were some people sitting at a picknick area a few hundred yards away and they didn't seem to react at all. Like they were un aware of anything happening. When my friend got home from hunting before I could say what we saw HE told me a story of what they saw. He said while hunting they saw a big purple star like fireball with blue tail. Meteor like flying throu the sky twards town(us). they said it light everything up like daylight. and he also said it extinguished before hitting the ground, or before it left sight. He didnt say it was falling but going across the sky. Ive seen shooting stars, but never when they illuminate the night with an artificail daylight. My friend was hunting aprox 10 miles from where we were. I just would like to know if anyone else saw this or what it was????"],"Source":"MUFON","Case Number":"29735","Country":"United States","Latitude":"31.195723","Object Shape":"Fireball, Unknown","Longitude":"-98.718098","files":["/var/www/straped/mufon/html2text/29735.html.txt","/var/www/straped/mufon/org/29735.html"],"City":"San Saba"}