{"Object Shape":"Sphere, Star-like","Log Number":"US-06272011-0007","Date of the Event":"06/25/2011 12:00 UTC","Source":"MUFON","Longitude":"-82.992734","Summary":"Bright light around the Killing Station for the last two nights","Latitude":"38.734353","Case Number":"29748","Disposition":"IFO","Viewing Distance":"Over One Mile","Tags":"City","Region":"Ohio","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","City":"Portsmouth","map":"<A HREF = \"http://maps.google.com/maps?q=38.734353,+-82.992734(29748)&iwloc=A&hl=en\"> mufon case (29748) map </A>","divs":["Sighting DetailsMy boys and I were standing outside infront of our house around 10pm,to 11pm when we notice a star like object around the powerplant called the killing station that sets on the ohio river around mile post 15 on state rt 52, we could see the object for about one or two minutes then it faded away or went behind a cloud that we couldnt see, whats weird is that I asked my boys what they saw and the oldest one said it was red the youngest said it was yellow and what I saw was a bright white, it didnt flash to me or the boys. we have live here for about 13 years, we see planes and jets like that all the time, and this was different. it was moving south to west,following the river but on the Kentucky side maybe over a mile distance from us or more, size cant say for sure. the next night I seen the light one more time, it came on out of know where then went back off kinda fade off for about two or three seconds I knock on the house for the boys to come out but it was gone and never came back that we could see, thanks for your time."],"trends":["There have been 6 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around June 25th 2011"],"Object Features":"Unknown","Date Submitted":"06/27/2011 03:45 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/29748.html.txt","/var/www/straped/mufon/org/29748.html"],"Weather Factors":"Unknown"}