{"Object Flight Path":"Undisclosed","Latitude":"31.880626","files":["/var/www/straped/mufon/html2text/29740.html.txt","/var/www/straped/mufon/org/29740.html"],"Tags":"City","Date of the Event":"06/20/1995 12:00 UTC","divs":["Sighting DetailsI was going to work one early morning. I noticed an object flying in the sky at the same pace and in the same direction as I was going. I thought it was a plane at first on fire. I was in shock as I was driving. It followed me for a few miles then took a sharp right and then nose dive down and then vanished. I ask coworkers if they saw anything they said no. I then watched the news next morning I did not hear anything. I called the police to asked if a plane crashed they said they did not know of one. I know I saw what I saw and have told my husband and one other person what I saw. They make fun of me and say no such thing. I say I saw it and it happend. I always wondered if it did go down into the lake and would think they are hideing down there and then laugh. Until I saw on the History Channel that they were seeing UFO's in the water. Just thought it was time to tell someone like MUFON what happened and see if anyone elese might of seen the same. I'm not sure of the date or year I do know it was in the early 90's 91,92, or 93. Thank You"],"City":"El Paso","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around June 20th 1995"],"Weather Factors":"Unknown","Log Number":"US-06262011-0017","map":"<A HREF = \"http://maps.google.com/maps?q=31.880626,+-106.412615(29740)&iwloc=A&hl=en\"> mufon case (29740) map </A>","Object Features":"Undisclosed","Longitude":"-106.412615","Region":"Texas","Sighting Duration":"Undisclosed","Summary":"Cigar Shaped fire coming out the end of it following on Freeway took a sharp right and nose dived down and then vanished.","Country":"United States","Case Number":"29740","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Date Submitted":"06/26/2011 09:31 UTC","Source":"MUFON","Object Shape":"Cigar"}