{"Viewing Distance":"Unknown","Object Features":"None","Date of the Event":"06/26/2011 08:31 UTC","Country":"United States","Summary":"4 rod shaped bright objects at differing distances but following same flight path","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around June 26th 2011"],"Longitude":"-82.452998","Date Submitted":"06/26/2011 10:55 UTC","Log Number":"US-06262011-0018","Case Number":"29741","files":["/var/www/straped/mufon/html2text/29741.html.txt","/var/www/straped/mufon/org/29741.html"],"Object Shape":"Other","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"None","Disposition":"Unknown","City":"Tampa","divs":["Sighting DetailsI saw 2 bright yellow white rod shaped objects that looked like the capital letter I. They were below broken up cloud cover coming from the West. I estmate the length @ about 1 inch. I thought they were planes that were going to crash because 1 was stationary & the second was head straight toward it. When the second got very close the first moved slightly East and vanished then the second did the same. At the exact same I saw another object just like the first 2 approaching from the West at a higher rate of speed and it disappeared where the other 2 had gone. A few seconds later another one came from the West and even faster vanished. I was in my backyard. I have lived here27 years @ go outside often @ night to take my dog outside. I was awe struck, couldn't believe what I'd seen, called my friends, the sheriff's dept, emailed the local news snd now you. I am fristrated and want to know what I saw was real. Was it an explainable phenomenon? I don't care if anyone believes me because I know what I saw. Please let me know what you think."],"Latitude":"27.956825","Object Flight Path":"Hovering then path,Straight-line path","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=27.956825,+-82.452998(29741)&iwloc=A&hl=en\"> mufon case (29741) map </A>","Tags":"City"}