{"Source":"MUFON","Case Number":"29749","Log Number":"US-06272011-0008","Disposition":"Unknown","Region":"New York","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"43.363926","Longitude":"-76.150916","Weather Factors":"None","Object Features":"None","divs":["Sighting DetailsI stood outside for atleast 45 min called my girlfriend to come out and search the skies with meand about 15 min latr we saw a strobing diamon shaped object. And a propeller aircraft. The aircraft as coming from the south west while th trobing diamond came from the east. Heading west eventualy the diamond shaped object crosed paths with the private aircraft it had to have passed within feet of the aircraft the plane stayed its course while the stobing diamond shaped object chaned couse and headed back from the direction it came south east. About 15 20 min later an object with no regulation faa lighting was sighted coming from the west behind the house girlfriend notedit was wobbeling and at a verry low altitude for an aircraft in this area observed through binoculars it was indeed wobbleling. And as it continued it would become dimmer untill it passed directly overhead and was completely opaque object was still vissiable thbough binoclars and appeared to have a disk or oval shap from my knowlege it must have been only 10 feet in diamiter the fist object was much smaler but also much brighter and stayedd lit the entire time while the second object maintaned a glow but eventualy fadded as I saw bolth objects I felt awe. As if I wernt alone even though I don't know if they were terrestrial or extra terrestrial"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Path with directional change","Tags":"City","Summary":"went outsie to veiw stars and meteors","map":"<A HREF = \"http://maps.google.com/maps?q=43.363926,+-76.150916(29749)&iwloc=A&hl=en\"> mufon case (29749) map </A>","Date of the Event":"06/25/2011 11:32 UTC","trends":["There have been 20 other sightings in Syracuse","There were no other sightings in Syracuse on or around June 25th 2011"],"files":["/var/www/straped/mufon/html2text/29749.html.txt","/var/www/straped/mufon/org/29749.html"],"Object Shape":"Diamond, Oval","Date Submitted":"06/27/2011 03:48 UTC","City":"Syracuse"}