{"Object Shape":"Star-like","City":"Flint","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.019687,+-83.683396(29758)&iwloc=A&hl=en\"> mufon case (29758) map </A>","Longitude":"-83.683396","Case Number":"29758","divs":["Sighting DetailsA friend and I were sitting outside at night on the deck talking and looking at the sky. We noticed a dim yellow-orange light that was coming out from behind the treeline by the railroad tracks in back of my house. It was gaining altitude slowly but sunk back behind the trees. You could still see the light shining through them and it had gotten brighter than when we had first saw it. As time passed it got even brighter and appeared to be a white light. It stayed in one spot for a while (about a minute and a half). At this point we ruled out the possibility of it being an airplane. I told my friend to go inside and get her digital camera before it went away, so she ran inside. I stayed out on the deck to watch it closely because I felt that it might be gone before she could get outside. The whole time I'm yelling for her to hurry up and get outside because it had started to get dimmer. The object would sometimes appear to vanish because the lights would dim to the point where it was not visible. But it would become bright once again right after, almost like it was pulsating slowly. She came back with the camera, but the object would not show up on the camera when she took pictures of it (probably because it was too dark outside). After a while of the object being stationary, it started to move slowly to the right where it would pause for a breif period of time before moving slowly to the left. It appeared to be very low in the sky, almost as if it were landing. It came back above the treeline (still bright white) then dimmed and turned red-orange. It climbed higher into the sky (but still not too far above the trees) and appeared to be two flashing red lights (similar to a plane, but only red lights.) It slowly moved from the south west to the west. There was a blue flash and then a few seconds later it was gone."],"Source":"MUFON","Date of the Event":"06/28/2011 12:00 UTC","Date Submitted":"06/28/2011 01:42 UTC","Summary":"Bright light came from behind treeline.","Region":"Michigan","Disposition":"Unknown","Object Features":"Unknown","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around June 28th 2011"],"Sighting Duration":"00:03:00","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Weather Factors":"Fog, Light","Country":"United States","Log Number":"US-06282011-0003","Latitude":"43.019687","files":["/var/www/straped/mufon/html2text/29758.html.txt","/var/www/straped/mufon/org/29758.html"],"Viewing Distance":"Over 1 Mile, Unknown"}