{"Object Shape":"Fireball, Star-like","Case Number":"29755","Disposition":"Unknown","trends":["There have been 39 other sightings in Wichita","There were no other sightings in Wichita on or around June 27th 2011","This sighting has never been favorited.",""],"Date of the Event":"06/27/2011 10:12 UTC","Tags":"City","City":"Wichita","Summary":"Fireball appeared to shoot up through the big dipper and into space","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29755.html.txt","/var/www/straped/mufon/more/29755_submitter_file1__Big-Dipper-UFO.jpg","/var/www/straped/mufon/org/29755.html"],"Longitude":"-97.335055","Latitude":"37.694836","divs":["Sighting DetailsMy wife and I just returned home. She sat down to smoke a cigarette before going inside and I took to checking out the stars. When I turned my attention to the Big Dipper in the northwest, I noticed a bright yellow flowing orb underneath and moving upwards toward the constellation. Almost as soon as I spotted it, it picked up momentum and seemed to decrease in luminosity by about a third. The color changed from a deep yellow to more of a white. I called my wife to come quickly, even though she hurt her foot yesterday. She quickly hobbled over and spotted it with me. As we watched, the object zipped through the cup of the Big Dipper and seemed to be heading out of the atmosphere. It continued on until it completely faded from view. I immediately came inside and started this report. Over the course of the sighting, the object fluctuated in acceleration, brightness, color and direction. I've attached a graphic to better communicate what I perceived."],"Country":"United States","Viewing Distance":"Over One Mile","Date Submitted":"06/27/2011 11:58 UTC","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.694836,+-97.335055(29755)&iwloc=A&hl=en\"> mufon case (29755) map </A>","Region":"Kansas","Log Number":"US-06272011-0014","Object Flight Path":"Path with directional change"}