{"map":"<A HREF = \"http://maps.google.com/maps?q=41.704961,+-71.516312(29754)&iwloc=A&hl=en\"> mufon case (29754) map </A>","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Case Number":"29754","City":"West Warwick","divs":["Sighting DetailsMy name is Andrew, I live in West warwick rhode island, tonight i was standing out in my back yard with a few friends, when i looked up into the clear night sky i saw a bright light, i thought it was a plane with a really bright spot light, but it seemed too high to be that bright and was too big of an orb to be a spot light, the light was oval in shape and the light was so bright you could see an aura around the light, it was pure white light not even the slightest of a yellow color, it was the whitest light i have ever seen coming from a plane, if that's what it was. The light moved forward for about 10 seconds and then seemed to ascend upward as it did the light began to dim slowly until we couldn't see it anymore. My only explanation i can think of, is that if it was a spot light, they turned it off and as the light cooled it dimmed slowly making it appear the light was leaving the atmosphere, because the object was then \"shrinking\" from sight. but why would they turn the spot light on in the first place if they were going to turn it off anyway. there were no clouds its a clear night, no need for lights besides the marker lights which this had none. This object was oval in shape it was not blinking whatsoever it was the brightest, vibrant white ive ever seen coming from a flying object. there were no red or blue lights or even white lights blinking. Just a bright oval shape that seemed to ascend and vanish, if they turned a spot light off, i would then be able to see the red and or blue signal lights, this did not have those whatsoever. I'm just wondering if anyone else has seen this."],"Viewing Distance":"Over One Mile","Log Number":"US-06272011-0013","Source":"MUFON","Tags":"City","Object Shape":"Oval, Sphere","Date Submitted":"06/27/2011 11:53 UTC","Date of the Event":"06/27/2011 11:00 UTC","Longitude":"-71.516312","Weather Factors":"Unknown","Disposition":"IFO","Summary":"Bright Orb leaving atmosphere quickly","Region":"Rhode Island","Latitude":"41.704961","trends":["There have been 2 other sightings in West Warwick","There were no other sightings in West Warwick on or around June 27th 2011"],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/29754.html.txt","/var/www/straped/mufon/org/29754.html"],"Country":"United States"}