{"map":"<A HREF = \"http://maps.google.com/maps?q=46.1431,+-60.191354(29756)&iwloc=A&hl=en\"> mufon case (29756) map </A>","Viewing Distance":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"Unknown","Source":"MUFON","Country":"Canada","City":"Sydney","Case Number":"29756","Summary":"star like object moves quickly and fades out over 5-10 seconds. Saw 3 in ~1 hour.","Longitude":"-60.191354","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Sydney","There were no other sightings in Sydney on or around June 28th 2011"],"Weather Factors":"Unknown","Date of the Event":"06/28/2011 12:00 UTC","Object Shape":"Star-like","Region":"Nova Scotia","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/29756.html.txt","/var/www/straped/mufon/org/29756.html"],"Latitude":"46.1431","Log Number":"CA-06282011-0001","Date Submitted":"06/28/2011 12:47 UTC","divs":["Sighting DetailsThis happened in Sydney, Nova Scotia, Canada around the very early hours of June 28. I saw this exact same event happen three times in about 2 hours. I was star gazing as I often do. (aside - I noticed for the first time tonight that one of the stars in the handle of the big dipper is actually two stars that are very close to each other. Cool stuff) Anyway, I saw a ball of white light similar to a star appear and move at something similar to aircraft speed, but over 5 or 10 seconds the light slowly faded out until I couldnt see it anymore. I never actually was staring exactly where it appeared, but it was the motion out of nowhere that caught my eye. I have no idea what it could have been, but I am sure that it was not a star or a planet, because it was moving. It was not like any aircraft I have seen before because it did not have flashing lights(was steady light) and did not appear to make any sound. I do not think it was a sateillite because it was much brighter than any sateillite that I have seen before, and the light faded out slowly and unexpectantly. It travelled in a straight line, but faded out as if it was travelling further away. It happened high in the sky so it is not as if it faded as it headed towards the horizon. The first one I saw was travelling mainly south to north. The second one I saw was only about 60 seconds after the first, and this one was travelling mainly north to south. I came inside to tell my friend about what I saw, and a short while later I went back outside and after about 20 minutes I saw another one do the exact same thing, although this one was much further east in the sky, and was travelling mainly north to south. I was not scared, maybe just a little bit excited at what it could have been. I will be looking for more of these in the future!"]}