{"City":"Holden Beach","divs":["Sighting DetailsWe were sitting on the outside deck and noticed four lights in a square or rectangular pattern. The lights hovered for several seconds and then they disappeared one by one. This happened several times for approximately one hour. I was speaking to a friend facing the house as he was talking to me facing the ocean, and he noticed the lights. I turned around to see three of the lights as one had all ready faded away. My friend saw all four on the first sighting. We thought it may actually be a UFO. My friend is an airline pilot and former f-16 pilot and I have some book knowledge of the UFO enigma. I was also a member of MUFON for several years. The second time the object appeared the lights were in line parallel to the ground and appeared to have been rotating counterclockwise looking at it from the ground. We believe it was about 3-5 miles out from the beach, but that is very hard to judge. The object was about two inches square from where we were looking. It also appeared to be around three inches off the water. We were very curious about the event so I decided to post it on your site. We were wondering if anybody else has posted anything about it?"],"Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","trends":["There have been 2 other sightings in Holden Beach","There were no other sightings in Holden Beach on or around June 27th 2011"],"Disposition":"IFO","Summary":"There were four lights that were white and orange/red. They were holding over the water at Holden Beach, NC.","Object Shape":"Square, Rectagular","Date of the Event":"06/27/2011 09:15 UTC","Weather Factors":"None, Light","Object Flight Path":"Undisclosed","Longitude":"-78.294909","files":["/var/www/straped/mufon/html2text/29761.html.txt","/var/www/straped/mufon/org/29761.html"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.920506,+-78.294909(29761)&iwloc=A&hl=en\"> mufon case (29761) map </A>","Viewing Distance":"Unknown","Case Number":"29761","Latitude":"33.920506","Date Submitted":"06/28/2011 11:24 UTC","Log Number":"US-06282011-0006","Region":"North Carolina","Country":"United States"}