{"Date of the Event":"06/27/2011 12:00 UTC","Summary":"Was sleeping saw a bright light","Object Shape":"Unknown","Longitude":"-72.775392","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29768.html.txt","/var/www/straped/mufon/org/29768.html"],"Latitude":"41.66861","map":"<A HREF = \"http://maps.google.com/maps?q=41.66861,+-72.775392(29768)&iwloc=A&hl=en\"> mufon case (29768) map </A>","divs":["Sighting Detailsi was getting ready for bed it was about 11 something at night i had just shut off the tv was watching cake boss. went to turn on the bed facing the window the blinds and window were shut i saw this bright red light and i got up and peeked into the blinds and saw something flying very low over my house into the yard behind me near the trees it was dark and we have big trees near me we also live near woods. i saw this object that looked like a airplane or something because it was dark i could not tell if it had wings. i do know that it had bright red lights on the bottom of whatever it was it was. it was flying very slow but not that slow. i was stunned and was in shock to move and find my camera phone to take a picture. i ran upstairs to see if i could see if the thing was still there but it was gone. my brother was up and didnt see anything or hear anything out of the ordinary. i came back to the window and was to afraid to peak but then like a minute later i saw the bright light again. but it was coming back towards my house. i figured if it was a plane it wouldn't come back over my house as the original direction it was going was towards the nearest airport about 40 minutes away i looked like it had a plane like shape but beacuse it was dark i couldnt get a clear picture i only saw these bright red lights everywhere on it."],"Weather Factors":"Unknown","Region":"Connecticut","Log Number":"US-06282011-0013","Case Number":"29768","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","City":"New Britain","Date Submitted":"06/28/2011 08:56 UTC","Viewing Distance":"Unknown","Disposition":"IFO","trends":["There have been 3 other sightings in New Britain","There were no other sightings in New Britain on or around June 27th 2011"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed"}