{"Latitude":"43.850035","Date Submitted":"06/29/2011 09:58 UTC","Weather Factors":"Unknown","Object Shape":"Diamond","Date of the Event":"06/29/2011 06:02 UTC","Case Number":"29777","files":["/var/www/straped/mufon/html2text/29777.html.txt","/var/www/straped/mufon/more/29777_submitter_file1__6ufos.JPG","/var/www/straped/mufon/more/29777_submitter_file2__img003.jpg","/var/www/straped/mufon/org/29777.html"],"Summary":"Didnt see them until looking at picture","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-06292011-0005","City":"Ripon","Viewing Distance":"Unknown","trends":["There have been 11 other sightings in Ripon","There were no other sightings in Ripon on or around June 29th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=43.850035,+-88.829315(29777)&iwloc=A&hl=en\"> mufon case (29777) map </A>","divs":["sighting detailsi ufo hunt. and sometimes i take pictures instead of video-quicker to review. this is one i happened upon, if i can find the drawing i made that i saw through 10x50 binoculars ill attatch it as well as i believe them to be of the same family. the scanner didnt do justice on the drawing, but u get the hint. the one in the drawing i was watching pop up and sit for a few seconds then shift positions and was actually looking through the binoculars when it appeared the last time, ironically over a cow lot two properties over. i saw a weird pinkish\\orangish\\violet colored cylindrical cloud cocked at about 45-50 degrees in a gap in the trees in back, as i looked at it the object in the drawing sort of materialized after the cloud disappeared. the red ball was not attached by solid object, sort of floated. the material looked very flat, charcoal color with straight facets and the direction it moved wasnt inline with the machine, like it was free instead of driving like a car, but when i saw it the big end was the leading side"],"Region":"Wisconsin","Source":"MUFON","Longitude":"-88.829315"}