{"Log Number":"US-06282011-0015","Sighting Duration":"00:03:00","Weather Factors":"None","Source":"MUFON","trends":["There have been 17 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around June 23rd 2011"],"Date Submitted":"06/28/2011 10:18 UTC","Disposition":"Unknown","Viewing Distance":"101-500 Feet","City":"Fredericksburg","Latitude":"38.308684","Country":"United States","Region":"Virginia","Tags":"City","Date of the Event":"06/23/2011 09:59 UTC","Case Number":"29770","map":"<A HREF = \"http://maps.google.com/maps?q=38.308684,+-77.45813(29770)&iwloc=A&hl=en\"> mufon case (29770) map </A>","Object Features":"Unknown","divs":["sighting detailsi was driving in my car just ahead of my wife who was following me home. i looked up in the sky and saw three bright lights in a triangle formation. i thought for certain that a commercial aircraft was crashing\\landing. i pointed out the window to make sure my wife was looking at it too. i had the windows down and i didn't hear any noises. she called me and said that she too had no idea what it was. it hovered slowly over rt 1 and almost went right over the top of my car. when it turned it banked a bit and i could see a fourth bright red light underneath the craft. i could tell it was a solid object because i couldn't see stars between the lights. i never grabbed for my iphone to record it because i thought that i'd eventually figure out what it was. i was not worried of anything like that. the three white lights were non-blinking and were extremely bright. it was odd because the light did not illuminate the craft. it was as if the material was designed to absorb light. we eventually made a left turn to head towards our house and could still see the object between the tree line. however by the time we turned the object was too far in front of us to see and eventually we lost sight of it. when the object hovered over the highway it was slow, noiseless, and seemed to be very low to the ground. i was dark and i found it very difficulty to just size and distance. i've seen f-117s before and it was not that. it was the strangest thing i have ever seen. i was never worried, only very curious. it wasn't until after the incident did i realize what i had seen. it flew way too low and slow to be an aircraft."],"Summary":"Black triangle with three bright lights in Fredericksburg, VA","Longitude":"-77.45813","files":["/var/www/straped/mufon/html2text/29770.html.txt","/var/www/straped/mufon/org/29770.html"],"Object Shape":"Triangle","Object Flight Path":"Path with directional change"}