{"Summary":"Multiple objects giving off multicolor light","Latitude":"39.913864","Object Features":"Undisclosed","Region":"Alabama","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date Submitted":"06/29/2011 05:23 UTC","files":["/var/www/straped/mufon/html2text/29774.html.txt","/var/www/straped/mufon/org/29774.html"],"Date of the Event":"06/28/2011 12:00 UTC","Case Number":"29774","Country":"China","Source":"MUFON","divs":["Sighting DetailsWalking from Lei Garden restaurant in Beijing back to the Crowne Plaza hotel I had taken a moment to look up and see if I could see stars in the sky. During the stay so far, I have not been able to see a blue sky or a darkness to the night sky, most likely because of the gaseous pollution. Anyway, upon looking up towards the south, I noticed a bright object emitting a redish color. A moment or more later, I noticed more objects to the further south. Each had a stationary appearance and then upon a few moments more observation, they began changing color and flickering and some in the far distance began swaying and in my words \"dancing\" in a slight side to side movement. At first I wasn't able to really tell if these were advertisement balloons or something else in the sky until they really started to do special movements and changes in color etc. After a long period of just observing and such, the farther ones kind of faded away off to some other part beyond vision, while the closer one seemed to stick around with me for awhile. Eventually I had to go inside, and the close one also gradually went away. Hopefully there were others that observed them also. Cheers"],"Longitude":"116.414633","Log Number":"CN-06292011-0002","map":"<A HREF = \"http://maps.google.com/maps?q=39.913864,+116.414633(29774)&iwloc=A&hl=en\"> mufon case (29774) map </A>","City":"Beijing","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Unknown","trends":["There have been no other sightings in Beijing","This sighting has never been favorited."],"Weather Factors":"Unknown","Tags":"City"}