{"files":["/var/www/straped/mufon/html2text/29778.html.txt","/var/www/straped/mufon/org/29778.html"],"Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.043564,+-84.501626(29778)&iwloc=A&hl=en\"> mufon case (29778) map </A>","Longitude":"-84.501626","Source":"MUFON","Country":"United States","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around June 28th 2011"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"29778","Date Submitted":"06/29/2011 11:09 UTC","Region":"Kentucky","Date of the Event":"06/28/2011 11:50 UTC","Disposition":"Unknown","Summary":"Four orange orbes flying in formation. Three in a line and fourth behind no more than 500 ft and no sound. Traveling slowly across sky over my home. Visibility very good.","divs":["Sighting DetailsI was in bed but not asleep in one upstairs bedroom. My partner was downstairs watching eleven oclock late news. At 11:50pm on June 28, 2011 he came upstairs to go to bed in room on opposite side of house. He heard a truck sound and since we live across from a park we have had some vandalism and so he got up and opened the blinds to look at the street which is visible from the bedroom window. He looked up and over the rooftop of the house beside us three orange balls in a straight line with one trailing behind (created a triangle look) were approching our home at a very low altitude..around 500 ft or so...a height that our police helicopters fly often. He yelled at me and I rushed to the room and saw the objects. I said lets go outside to see if there is any noise. We rushed downstairs and ran outside. He said to me this can't be a plane the back ball is too far back, could it be helicopters flying together? I didn't think so, because they were orange balls. I said lets get outside to see if there is any sound. The formation turned slightly to the right as they went over the neighbors home and we watched from the patio as they moved by. There was absolutely no sound and they did not vary from the formation as they slowly moved across the back yard area and over the homes that surround my back yard and slowly we lost sight of them as they moved on. We were so shocked that as I had gone back into the house and gotten my camera and tried to take a picture I had the flash on and all you could see was the umbrella in the foreground of the shot. Unbelievable. Just unbelievable. We were so amazed and really somewhat frightened we could not sleep for hours. I called the police department, airport tower and a television station to see if anyone else had seen this unbelievable sight since it was flying so slow and so low, but at that time which was around 12:30am on June 29, 2011 no one had apparently called them."],"City":"Lexington","Sighting Duration":"Undisclosed","Latitude":"38.043564","Object Flight Path":"Path with directional change","Log Number":"US-06292011-0006","Tags":"City","Object Shape":"Sphere"}