{"Region":"Arizona","Date of the Event":"04/16/2006 12:00 UTC","City":"Apache Junction","divs":["Sighting DetailsMy little brother Brian took this picture while we were at the Goldfields Goldmine in Apache Junction. This is the second time this object has appeared close to me which I have the visual proof event, the 1st time was in las vegas march of 1993 Spring Mtn and Decator rd 10:00am hovering over las vegas. Two other friends and I viewed the Phoenix, along with a few other gas station customers, from the Terrible Herbst gas station at that intersection. It hovered facing our direction we were west of and we watch it slowly do a 180 turn and go back into the clouds. The whole event lasted 5mins. Incidentally, the sky was complete overcast with the exception of a perfect circle cut in the clouds revealing the only blue in the sky behind the craft. Two years later I unintentionally bought a book UFO sightings which shows a picture of this craft on fire in the night sky taken in Siberia 1974. The part I am hesitant of discussing is I think I was abducted as a child in Mesa where I grew up when I was about 6 or 7 and when i lived in Las Vegas in 1993 when I was 23, I was residing close to Tropicana and Buffalo Roads which was considered the outskirts of town then. That's when the last abduction event i can recall took place. That story is a bit long so I will stick with this sighting.(But it all connects and seems relevant) How I came up with the name of the craft was from a series of events. I named the craft the Phoenix after attending the phoenix lights convention in 1998 and after viewing the craft up close and buying the book with the image of it. It was the phoenix emblem projected on the wall at the convention center at the conference that gave me that Idea. On another note, I think i have been on this craft and I have met the personnel and aliens that fly the craft, but again that is a different story which to this day i still believe. This Craft is extremely impressive and is light stealth brown. TO VIEW CRAFT MUST RE-SIZE IMAGE LARGER. The craft is to the right of the water tower."],"Longitude":"-111.540078","Sighting Duration":"Undisclosed","Latitude":"33.418128","Log Number":"US-06292011-0012","Source":"MUFON","Country":"United States","Date Submitted":"06/29/2011 08:56 UTC","Weather Factors":"None","Tags":"City","Object Shape":"Other","Object Features":"Window(s), Patterned Surface, Wings, Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.418128,+-111.540078(29784)&iwloc=A&hl=en\"> mufon case (29784) map </A>","trends":["There have been 16 other sightings in Apache Junction","There were no other sightings in Apache Junction on or around April 16th 2006","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/29784.html.txt","/var/www/straped/mufon/more/29784_submitter_file1__easter2006.jpg","/var/www/straped/mufon/org/29784.html"],"Case Number":"29784","Disposition":"IFO","Summary":"Phoenix","Viewing Distance":"501 Feet - 1 Mile"}