{"Summary":"My sister and I saw an object hovering silently in the sky that was unique in shape and features","Region":"New Jersey","City":"Mt Holly","Sighting Duration":"Undisclosed","Disposition":"Unknown","divs":["Sighting DetailsI should have reported this a long time ago. The details of what my sister and I witnessed is not as clear today as it was about 5-6 years ago, when it occurred. But it continues to baffle me. From time to time I search for ufo sighting reports that sound similar to what I saw, and I never find anything even remotely like it reported. Here's what we saw: It was winter of either 2005 or 2006, I can't quite remember what year it was now. We were driving home from a friend's house a few miles away, probably a little past 2 in the morning. As we were driving down Garden Street in Mt. Holly, we came to the stop sign at Monmouth Rd. I looked both ways for a moment when my sister exclaimed, \"Oh my god! Look!\" and to the right was this thing in the sky. It wasn't moving at all and we heard no noise as it hovered. It's hard to tell how far it was above the ground without knowing how large the object was. If I had to guess I would say it was very large and about 3 or 4 football fields above the ground. This is an area with a lot of houses and trees. But I saw no trees moving, no breeze or anything. There is also a lake in that area (in the vicinity of Upper Lake), and it looked like it was right around that spot. The object, as I remember it, was metallic, bulky and irregular shaped, like a crumples piece of metal or something. It's very hard to describe. The metal itself had a jigsaw puzzle type of design to it, as if it was a bunch of patchwork metal piecing the whole thing together. And the bottom looked like it had lights on it that shined up at its underbelly, lighting the up bottom. But there were also shadows on the underbelly because of the irregular shaping of it. It was definitely illuminated, but not very bright. Just bright enough to be able to distinguish the jigsaw-like appearance of it. The top was more or less in shadows. We sat at the stop sign staring at it in shock or awe or something for what I would guess to be around 3-5 minutes, before my sister said, \"go! go! go!\" and I sped off back to our house. My house is only maybe 1 or 2 miles tops (bird's eye view) from that spot. We looked around in the direction we had seen it in when we got home but saw nothing. Either it vanished or the treetops covered it (which would mean it was very low to the ground), or I don't know, we couldn't see it from our front door for whatever reason, I don't know. I never saw it again, although I always hoped I would, and still do hope. My house was a few towns over from both Fort Dix and Maguire Air Force Bases--about a 25 minute drive away. I looked for newspaper reports of a ufo sighting the following days but didn't find anything. Whatever we saw was unreported as far as I could find out. I'm hoping someone will be able to shed some light on what it was that we saw. I didn't have a camera on my phone at that time, and I regret not having any photos of it--although I'm not sure I would have thought (or had the nerve) to take a picture in that exact moment. I always felt I had seen something incredible, and unique. I've tried sketching it, but I have a very hard time trying to put on paper what I see in my mind's eye, and I'm an artist by profession. I will keep on trying so I have something to show that maybe someone will one day recognize.... And if I'm fortunate enough to see that, or anything like it again, I will report it right away and do my best to have a visual to go along with it."],"Date Submitted":"08/07/2011 01:57 UTC","Object Features":"Patterned Surface","Viewing Distance":"Over One Mile","Latitude":"40.001773","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/29780.html.txt","/var/www/straped/mufon/org/29780.html"],"Date of the Event":"01/20/2005 02:30 UTC","trends":["There has been one other sighting in Mt Holly","There were no other sightings in Mt Holly on or around January 20th 2005"],"Weather Factors":"None","Country":"United States","Longitude":"-74.778484","map":"<A HREF = \"http://maps.google.com/maps?q=40.001773,+-74.778484(29780)&iwloc=A&hl=en\"> mufon case (29780) map </A>","Source":"MUFON","Object Flight Path":"Stationary","Tags":"City","Case Number":"29780","Log Number":"US-08072011-0058"}