{"trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around June 30th 2011"],"Object Features":"Unknown","Case Number":"29798","files":["/var/www/straped/mufon/html2text/29798.html.txt","/var/www/straped/mufon/org/29798.html"],"Longitude":"-79.782915","City":"Greensboro","Latitude":"36.080985","Log Number":"US-06302011-0007","Country":"United States","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"06/30/2011 03:45 UTC","Date Submitted":"06/30/2011 06:35 UTC","divs":["Sighting DetailsMy wife let our 3 dogs out at 3:30am. At 3:45am she went to let them back in and noticed bright flashing colorful object in NE sky and woke me up to see it. I got up and grabbed the binoculars and my cigarretes and went outside to see. It was very low and bright flashing red & blue&green and white. It kept jumping or spining up and down and side to side slightly. Truly a beautiful sight to behold, the closest I've ever seen. It stayed in the same area moving slightly for a hour and a half. Then it started moving higher and further away till it just looked like a colorful bright star in the distance.I sat in a lawn chair drinking coffee and smoking for two hours till the sun was rising and lit the sky so I could'nt see it any longer. Around 5:30 am or so I was scaning the SE sky behind me and saw a bright light scream across the sky at a very fast rate of speed. I sat outside watching with amazement and goosebumps all over for two hours. My wife went back to bed after watching the first object for a hour or so. I've been watching the sky since I was a kid. I'm 47 this year and this is the first time I've been able to see one this close. I feel like a kid on Christmas morning. I'm up for the day now, I could'nt go back to sleep if I tried. I feel truly blessed to have had this experience!"],"Region":"North Carolina","Disposition":"Unknown","Summary":"first one was hovering low colorful twinkling lights/second streaked across sky very fast","Object Shape":"Diamond, Fireball, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.080985,+-79.782915(29798)&iwloc=A&hl=en\"> mufon case (29798) map </A>","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","Weather Factors":"None"}