{"Longitude":"-121.943327","trends":["There have been 7 other sightings in Campbell","There were no other sightings in Campbell on or around June 29th 2011"],"Object Shape":"Circle, Star-like","Log Number":"US-06302011-0004","Source":"MUFON","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.294295,+-121.943327(29795)&iwloc=A&hl=en\"> mufon case (29795) map </A>","Latitude":"37.294295","Date Submitted":"06/30/2011 02:04 UTC","Sighting Duration":"00:00:30","Disposition":"Unknown","Case Number":"29795","Summary":"Green Orb Chased by the Military","Weather Factors":"None","Tags":"City","divs":["Sighting DetailsI was in the bedroom straightening out he blankets on the bed wit the window open for fresh air. All of a sudden I heard loud military chopper passing over soto see a low flying military chopper chasing a green orb. It was roughly about 1000 feet above (maybe a bit less than that). I yelled for my husband to look and as he ran down the hall, I pushed him out of the way to make it to the living room to grab the video cam and go outside. (moved to evidence section)fg I grabbed the video cam and went out the front door just in time to see it still flying towards my complex then overhead. I did get it on film so I have about 30 seconds of film. I have not reviewed it yet because I wanted to fill out this report. My husband experienced this event with e as well. The speed of the chopper and orb was maybe about 10-15 mph if it were cars on the road. They were low enough to rattle things on the shelves and walls. I have been keeping all of my footage and photos to myself and sharing it with alternate researchers (Not Mufon), but I felt that just maybe someone else will report in this time and report the same thing tha my husband and I experienced."],"Object Features":"Unknown","Region":"California","Object Flight Path":"Straight-line path","City":"Campbell","files":["/var/www/straped/mufon/html2text/29795.html.txt","/var/www/straped/mufon/org/29795.html"],"Date of the Event":"06/29/2011 10:43 UTC"}