{"Region":"Maryland","Tags":"City","files":["/var/www/straped/mufon/html2text/29793.html.txt","/var/www/straped/mufon/more/29793_submitter_file1__ufopath.jpg","/var/www/straped/mufon/more/29793_submitter_file2__UFOSIZE.JPG","/var/www/straped/mufon/org/29793.html"],"Sighting Duration":"Undisclosed","Log Number":"US-06302011-0002","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Disposition":"Unresolved","Date Submitted":"06/30/2011 12:59 UTC","Weather Factors":"Unknown","Latitude":"39.656325","Object Shape":"Unknown","divs":["Sighting DetailsMy girlfriend M. and I sat down to relax on my parents patio. We had just eaten dinner and decided to light a fire. We were facing southeast towards Haystack Mountain, seated next to each other talking, and I had just opened a beer (my first one of the night, alcohol played no factor in the sighting). I remembered looking up and noting how clear the sky was as the sun was setting, and glanced straight up above our heads and saw a light like a star, only much much brighter, like 10 or 20 stars worth of bright. I thought it was a plane with a reflection, but the sun had set long ago. It was moving, but kinda gliding along, it didnt seem propelled, and initially in a southeast direction. I nudged M. and pointed up at the light. She stopped mid-sentence and stared. so did I. I said something about it being totally silent. Thinking it was gone over the mountain and behind the trees, i said jokingly \"I hope they come for us!\" and took a drink from my bottle. If nothing happened after this point I would have still thought the light was out of place, it just seemed like it wasnt supposed to be there. i glanced up again to where i saw the object last, and it was just moving through the same space in the trees as it had just moved. I know that sounds insane, but the only way I can describe it is: Glitch in the Matrix. Like in the movie The Matrix when the cat walks in front of the door twice, like its on a loop. Only it seemed brighter and bigger than before. My girlfriend saw the same thing. I just cant make sense of what happened there. It was moving fast enough that it should have kept going over the mountain and out of sight, it was like magic. All of this happened in about 15 - 30 seconds. Hard to tell really my jaw was hanging open. I had to get a better look so I ran out to the alley behind the house for a better look, about 30 feet east of where we first saw it, and it wasn't in the part of the sky i expected it to be, it was further down the mountain towards Cumberland. It seemed to be moving faster as I was yelling for M. to come look. From the time she walked from one end of the driveway to the other it had changed from a solid bright white light, like a star much bigger than any in the sky maybe 10 or 20 times, down to the shape and size of a dim red star on a clear night, and vanished. It looked like light that just faded out smoothly to a single point, then gone. I cant give you a distance from us to the craft with any accuracy, but it was maybe 50 - 200 feet above Haystack Mountain when it faded out, so maybe 250 - 500 feet directly above us at first sight. I was excited, and M. was just saying \"what was that? what was that?\". And to make it creepier, there was not a sound to be heard, my parents live in a fairly quiet and secluded place. there was no sound. that was not an airplane, blimp, or helicopter. I am still trying to wrap my brain around this one. I wish i had a photo, but honestly it would look like a photo of stars, one being much brighter than the others. Feel free to ask any questions, i will give as much information as I can. Thanks for your time."],"Date of the Event":"06/29/2011 10:16 UTC","trends":["There have been 8 other sightings in Cumberland","There were no other sightings in Cumberland on or around June 29th 2011","This sighting has never been favorited.",""],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.656325,+-78.753258(29793)&iwloc=A&hl=en\"> mufon case (29793) map </A>","Object Flight Path":"Path with directional change,Path then hovering,Other","City":"Cumberland","Source":"MUFON","Country":"United States","Summary":"Very bright light/object passed overhead, moved strangely behind trees, gained better view to watch it disappear above mountain","Longitude":"-78.753258","Case Number":"29793"}