{"Weather Factors":"Unknown","Date Submitted":"06/30/2011 12:54 UTC","Case Number":"29792","Longitude":"-82.560059","Tags":"City","divs":["Sighting DetailsI currently live back home with my parents in West Carters Valley in Kingsport TN... we are near the Hawkins County line and the Holston River. It is very rural out here. On June 25th 2011 I saw what I thought to be a UFO while out star gazing in my parents back yard. My mother had been standing in the front yard and I walked to the front to talk to her but she had gone inside... all of the sudden over a tree line to the west I saw a very bright LED type light traveling oddly in the sky with a smaller light dot traveling behind it looked like toward the North. The movement lasted for about under a minute... I called my mother outside and as she exited the house it was gone... so I let it go as I told her what I saw she thought I was a little silly. This happened at approximately 11:30-11:45 pm EST. The sky was completely clear that night. Tonight at approximately 11:15 pm EST I was sitting out on the front porch talking to my Father who was watering the flowers in the front of the house and wouldn't you know! It was the light again! I was not seeking it out because I had ruled it out before as a possible satellite...etc....the light was traveling alone this time... and my father saw it this time as well! I checked on a few satellite trackers and star maps.. and ISS app that I have available on my phone device to rule out any space junk etc. and there was nothing at that moment. This time the light appeared a little lower... but was also to the west moving North.. seemed to be moving quicker this time. on the 25th the light was brighter. Thinking about the location both nights it could be a possibility that it is following the Holston River up in to Southwest Virginia...maybe the Yuma area... I know that this was not an aircraft... and I did not hear any noise. I will be checking the skies every night now between the 11 and midnight hour in hopes the sky is clear where I can possibly catch this on camera. Anyone from the East TN MUFON can feel free to contact me. I do prefer email... I think it would be interesting to try and seek out what the source of this light is. It has me a little nervous to be honest.. but I feel I would like to seek it out....... even if I have to seek it out myself by automobile."],"Region":"Tennessee","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.551084,+-82.560059(29792)&iwloc=A&hl=en\"> mufon case (29792) map </A>","trends":["There have been 10 other sightings in Kingsport","There were no other sightings in Kingsport on or around June 28th 2011"],"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"36.551084","Country":"United States","Log Number":"US-06302011-0001","Object Shape":"Circle, Star-like","files":["/var/www/straped/mufon/html2text/29792.html.txt","/var/www/straped/mufon/org/29792.html"],"Summary":"2nd sighting this week.","Object Flight Path":"Straight-line path","Object Features":"Unknown","Source":"MUFON","City":"Kingsport","Date of the Event":"06/28/2011 11:15 UTC"}