{"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Log Number":"US-06302011-0008","Date of the Event":"06/29/2011 10:20 UTC","Source":"MUFON","Region":"Virginia","Object Features":"None","Summary":"slow moving bright ball of light","Tags":"City","Object Shape":"Star-like","Country":"United States","City":"Fredericksburg","Longitude":"-77.45191","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/29799.html.txt","/var/www/straped/mufon/org/29799.html"],"Date Submitted":"06/30/2011 10:28 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was around 10:20 (maybe a little after...could have been about 10:25) or so last night and I was watching tv in my room. I was staying up to see if I could view the rocket launch from VA beach that was going to happen at 11:10. For some reason, I had the feeling to look out of my bedroom window (which faces the NW - the rocket was to be seen SE). It was a very clear night and I noticed that up in the sky, there was a large bright (brighter than the stars) ball of light. It definitely was not a star, it was much larger than all the stars, it was not as high up in the sky as the stars. There wasn't a color, it was almost like a lightbulb compared to the stars. The light did not flicker, blink, or anything like that. It was just a ball of bright light. It moved very smoothly and very slowly across the sky in a straight line. I've never seen anything like that before and I was really thinking that it might turn out to be a plane or something, so I kept watching it get closer and closer. The object never changed or moved away from the straight line path it was on. There were no lights blinking or any other lights around just the one ball of light. It was starting to get out of my sight from my view in my room and I wanted my husband to see this, so I went down 2 flights of stairs to the basement, tried to wake him up (was unsuccessful), went back up to the 1st floor and out the back door so I could keep watching this light. I was still able to continue watching it pass over a large area across the sky for another 2 minutes or so. The light then all of a sudden just dimmed right out (took just a moment) and then it was gone. I would say that the entire viewing of this light lasted about 7 minutes. I was able to see the rocket launch at 11:10 and the rocket was actually seen at the exact spot that light dimmed out. I thought that was ironic. All in all, I have never seen anything that made me think I saw a UFO until last night and I am intrigued to keep my eye on the sky now!"],"Latitude":"38.311714","Case Number":"29799","trends":["There have been 17 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around June 29th 2011"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=38.311714,+-77.45191(29799)&iwloc=A&hl=en\"> mufon case (29799) map </A>"}