{"Summary":"my husband and i saw a bright glowing orange/amber ball cross the sky from south to north almost from horizon to horizon","Region":"Kansas","Source":"MUFON","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-94.70496","Object Shape":"Circle, Sphere","Disposition":"IFO","Sighting Duration":"00:01:00","Country":"United States","Log Number":"US-06302011-0017","map":"<A HREF = \"http://maps.google.com/maps?q=37.410884,+-94.70496(29808)&iwloc=A&hl=en\"> mufon case (29808) map </A>","Latitude":"37.410884","trends":["There have been 2 other sightings in Pittsburg","There were no other sightings in Pittsburg on or around June 29th 2011"],"Date of the Event":"06/29/2011 09:40 UTC","City":"Pittsburg","Object Features":"Undisclosed","Weather Factors":"Unknown","Case Number":"29808","files":["/var/www/straped/mufon/html2text/29808.html.txt","/var/www/straped/mufon/org/29808.html"],"Tags":"City","divs":["sighting detailsmy husband and i were in the back yard playing with our dogs. some people were shooting fireworks nearby. my husband brought to my attention a large glowing orange ball rising in the sky to the south. i assumed it was a firecracker. it looked like one of the flare type firecrackers, although it seemed to be moving too slowly. it seemed brighter in the middle, and more orange toward the edges, like a flare or a flame looks. it continued, and it became clear it wasn't a firecracker. it crossed over our heads and continued until it was out of sight near the northern horizon. as it travelled across the sky we talked about what it could be and quickly ruled out any kind of meteor. possibly a sattelite reflecting the sun? my husband thought it went out of view behind the trees, and to me it appeared to dim and go out, but it could have been seeing it through the trees that gave it that appearance. i can't really say how long it took, but my husband says less than a minute. it stayed at a constant speed and at a constant brightness. there was no noise. a few minutes later we saw a plane fly over high enough that we couldn't hear the plane. i would say the the oragne\\amber light appeared 2 to 3 times larger than this plane appeared in the sky and traveled slightly faster. we remain puzzled by this experience."],"Date Submitted":"06/30/2011 07:05 UTC"}