{"Weather Factors":"None","Latitude":"41.372852","Source":"MUFON","Object Flight Path":"Straight-line path","Longitude":"-82.290711","Object Shape":"Sphere, Unknown","Country":"United States","City":"BROWNHELM TWSP","Case Number":"29802","trends":["There have been no other sightings in BROWNHELM TWSP","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Disposition":"IFO","Summary":"THIS IS WHAT I SAW","Log Number":"US-06302011-0011","divs":["Sighting DetailsTWO REDISH ROUND OBJECTS HEADING SOUTHWEST. ESTIMATE ON ALTITUDE WAS APPROX 1500 -2000 FT . PERHAPS 3000 FT. HARD TO TELL. MY ESTIMATE ON THE SIZE WOULD BE MAYBE THE SIZE OF TWO HOUSES EACH. THE OBJECT HAD A SLIGHT HAZE AROUND IT. PERHAPS LIKE MOISTURE IN THE AIR. THEY WERE MOVING SLOWLY. ONE OBJECT BEHIND THE OTHER BUT OFF TO ONE SIDE. NOT DIRECTLY BEHIND ONE ANOTHER. I SHUT THE LIGHTS OFF AFTER PULLING TO THE SIDE OF THE ROAD.I GOT OUT OF THE TRUCK TO GET A BETTER LOOK. I THEN SHUT MY ENGINE OFF TO LISTEN FOR A TYPE OF NOISE. I HEARD NOTHING. I THOUGHT PERHAPS HELICOPTERS, NOPE, NO NOISE. I THOUGHT MAYBE SMALL PROP PLANE. NOPE, NO NOISE. I PROCEEDED TO WATCH AS THEY SLOWLY MOVED SOUTH WEST. I THEN GOT IN MY TRUCK AND BACK IT DOWN THE ROAD TO GO TELL MY FRIEND TO COME OUT AND LOOK. BY THEN THEY WERE BEHIND THE TREES SO NEITHER OF US COULD SEE THEM. I WALKED BACK UP THE ROAD TO SEE IF I COULD SEE BEHIND THE TREES, BUT THEY WERE GONE. THE NIGHT WAS CRYSTAL CLEAR. MANY STARS WERE VISIBLE. I COULD SEE A PLANE OR TWO IN THE DISTANT HIGH ALTITUDE SKY. QUITE INTERESTING. I WAS DRIVING SLOWLY FROM MY FRIENDS HOUSE. WHY I NOTICED IT. NICE CLEAR SKY NOT SURE WHAT OBJECT WAS. REDDISH COLOR LIKE A FLARE, BUT NOT DROPPING. MOTION WAS STEADY & CONSISTANT. MY FEELING WERE, THAT I WANTED TO SHARE WHAT I SAW. LOST SIGHT WHEN IT GOT BEHIND TREES."],"Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.372852,+-82.290711(29802)&iwloc=A&hl=en\"> mufon case (29802) map </A>","Date of the Event":"06/29/2011 10:30 UTC","Tags":"City","Object Features":"None","files":["/var/www/straped/mufon/html2text/29802.html.txt","/var/www/straped/mufon/org/29802.html"],"Date Submitted":"06/30/2011 02:29 UTC"}