{"Log Number":"US-06302011-0015","Tags":"City","Case Number":"29806","Date of the Event":"06/29/2011 10:10 UTC","divs":["sighting detailsi was walking around my apartment complex shortly after 10 pm...not sure of exact time but it was before 10:30 pm on june 29, 2011. i live just off route 981 right near downtown mount pleasant (westmoreland county), pa., south east of pittsburgh about an hour travel time. while outside i was watching the many airplanes moving about in all different directions..some i could see the underbellies of them and the twinkling lights so those ones were either taking off from or landing in pittsburgh. others were higher but still i could tell they were airplanes due to the red and white twinkling lights under the wings. i could distinguish the stars in the sky as well and knew that the north star is the brightest, however, when looking in the southeast segment of the sky i saw two different phenomenons going on: one looked like a supernova star just twinkling away...big bright white flaring spurts of light. while just off the side of it was a steady bright white light just hovering and not really twinkling but in a slow turn and hovering in place. i grabbed my bifocals to zoom in better and discovered it was more triangular when looking through my bifocal readers. i was certain then that it was a ufo. i watched it for at least another 10 minutes and it just stayed put in this location. i did not wait to see if it would zoom off as others have reported seeing in many other reports i've read in the past on this site. i am convinced that whoever they are and where ever they are from they seem to love hovering around southwestern pennsylvania during the month of june\\july. i saw a triangular ufo in everson, pa (which is only 7 miles south of mt. pleasant.) this same general months time frame in 2010."],"Source":"MUFON","Object Features":"None","City":"Mt Pleasant","files":["/var/www/straped/mufon/html2text/29806.html.txt","/var/www/straped/mufon/org/29806.html"],"Object Flight Path":"Stationary","Summary":"star like hovering object above line of visible airplanes traveling","Region":"Pennsylvania","trends":["There have been 6 other sightings in Mt Pleasant","There were no other sightings in Mt Pleasant on or around June 29th 2011"],"Country":"United States","Longitude":"-79.53288","Weather Factors":"None","Latitude":"40.156331","Disposition":"IFO","Date Submitted":"06/30/2011 04:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.156331,+-79.53288(29806)&iwloc=A&hl=en\"> mufon case (29806) map </A>","Sighting Duration":"00:10:00","Object Shape":"Star-like","Viewing Distance":"Over One Mile"}