{"Object Flight Path":"Straight-line path","Source":"MUFON","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.658991,+-74.347372(29804)&iwloc=A&hl=en\"> mufon case (29804) map </A>","Tags":"City","Region":"New Jersey","Log Number":"US-06302011-0013","trends":["There have been no other sightings in Westfield","This sighting has never been favorited."],"Date Submitted":"06/30/2011 03:10 UTC","Sighting Duration":"Undisclosed","City":"Westfield","Case Number":"29804","divs":["Sighting DetailsI was relaxing on my back stoop, and spotted a ball of light rising in front of me from the west, and tracking nearly straight up. I live in the traffic lanes of Newark Liberty Airport, and have seen and photographed many planes going overhead... frankly, I'm a skeptic, and use this process to show how easy it is to mistake common, explainable things as exotic, unearthly things. I had my cellphone nearby, and started videotaping the white ball, about the size of Jupiter, all the way across the sky and down behind the tree. I later confirmed this to be a flyover of the ISS, at a very bright magnitude -3.7. Anyway, I reviewed the footage and sat back, then glanced back at the area where the ISS had emerged from. There, at roof level to the home across the street, was what I can only describe as an oval, canted, glowing jellyfish, about half the width of my outstretched index finger, slowly drifting silently from right to left on the western horizon. My first reaction was that my eyes had unfocused, and I rubbed them to rest them, but the object remained. I was elated! I had seen meteorites and bolides, but never something so unusual. It was like a bubble of soap, white top and bottom of the ellipse, with red pulsing light on the bottom tip that changed colors, and a few other greens and blues in the opposite (top) end. I reset my video camera and caught a few seconds of video before the object brightened, then moved out of sight behind the neighbors roof. I ran to my front lawn, caught sight of it again, and snapped as many pics as I could before it disappeared. I returned to my porch, and thought that I should get my better camera a from inside, at which point the object reappeared on the opposite side of the house, in a brief hole between two trees. I ran inside and got my SLR, but the object was gone. I thought about chasing it down with my car, but didn't want to alarm my sleeping family. I shared the pics and video with my wife, who aptly called the object a blob. I have since watched the video on a larger monitor, and tweaked the pics a bit. I posted this to Facebook, and almost immediately got confirmation from another witness in a nearby town that swears she heard engines on the thing, and says it's an advertising blimp. That was my first thought as well, but why at such an hour? I have since heard from a second witness in the same town as the first, who saw the same object at 3AM the following morning."],"Longitude":"-74.347372","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/29804.html.txt","/var/www/straped/mufon/more/29804_submitter_file2__2011-06-29_22-20-32_609MYENHANCE2.jpg","/var/www/straped/mufon/more/29804_submitter_file3__2011-06-29_22-20-26_658MYENHANCE3.jpg","/var/www/straped/mufon/org/29804.html"],"Country":"United States","Date of the Event":"06/29/2011 10:19 UTC","Latitude":"40.658991","Object Features":"None","Summary":"Following what turned out to be a flyover of the ISS at 10:16PM, I saw this in the western sky.","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Egg"}