{"Summary":"Triangle object, huge..on light on each triangle shape, Thin Line of flashing colored lights directly underneaths its bellys as it passed over, It made a Rushing wind like sound as it passed over, no loud roaring","Date Submitted":"06/30/2011 11:28 UTC","Source":"MUFON","Object Shape":"Triangle","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/29818.html.txt","/var/www/straped/mufon/more/29818_submitter_file1__101_1739.jpg","/var/www/straped/mufon/more/29818_submitter_file2__101_1761.jpg","/var/www/straped/mufon/more/29818_submitter_file3__101_1748.jpg","/var/www/straped/mufon/org/29818.html"],"Object Features":"Other","Longitude":"-84.288444","trends":["There have been 10 other sightings in Richmond","There were no other sightings in Richmond on or around June 30th 2011","This sighting has never been favorited.",""],"Date of the Event":"06/30/2011 08:30 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Disposition":"Unknown","Log Number":"US-06302011-0027","Weather Factors":"None","Viewing Distance":"Unknown","Tags":"City","Country":"United States","Latitude":"37.751597","divs":["Sighting DetailsI was sitting at my home office window, when my dog started barking as i looked out i saw a huge object headed North right over our home..coming from the South east.it was low, as i watchted it, I seen three bright lights..one at the front two at the back..shaped like a triangle..then as it passed directly over me, I see underneaths its belly..it had a straight thin line of colored lights flashing from the front of it all way down the 2 ends of it...underneath only..as i jumped up to grab my camcorder an run to the front porch, it was passing past the big trees in the field..so i filmed it from there..it still did not make a roaring sound like a low jet or anything like a low flying plane, the air was still an all i could hear was a rushing wind pass by..my dogs have been acting strange tonight.iam sorta scared, cause my friend an I i seen a firey pillow like huge egg shaped object in 1994, that flew over our home in Lexington ky, on Eastland parkway, an it hoovered over us, for about a minute.an just like this one, it moved away slowly unto it became a distant star..i filmed these on 8mm film then I took still photos of each still frame of film of the object, on a 27 in tv screen. I have alot more still images of it."],"Case Number":"29818","map":"<A HREF = \"http://maps.google.com/maps?q=37.751597,+-84.288444(29818)&iwloc=A&hl=en\"> mufon case (29818) map </A>","City":"Richmond"}