{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29811.html.txt","/var/www/straped/mufon/more/29811_submitter_file1__P1030874.JPG","/var/www/straped/mufon/org/29811.html"],"Object Shape":"Sphere, Other, Unknown","Disposition":"Unknown","Tags":"City","Date Submitted":"06/30/2011 09:06 UTC","trends":["There have been 3 other sightings in Wentzville","There were no other sightings in Wentzville on or around June 27th 2011","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Dome, Appendage(s)","Case Number":"29811","Summary":"Witnessed a bell or domed shaped object.","Longitude":"-90.846181","Latitude":"38.81955","Log Number":"US-06302011-0020","Country":"United States","divs":["Sighting DetailsAround 7:24pm to 7:40pm on June 27, 2011 I was on phone talking to a classmate and looking towards the S.W. direction when I noticed what appeared to be a round black dot in the sky. The object performed linear maneuvers, up, down and left to right. Seemed very controlled and deliberate. Clouds that evening were moving in what seemed to be a west to east direction. Based on cloud movement which were few and the static location of trees in the surrounding area, I was able to determine that the object was truly moving independently. I explained to my classmate what I was seeing as it occurred. Object drew closer. My classmate told be to get off the phone a take a picture. My cell phone camera was unable to do so as it kept wanting to focus on the fence in the near foreground. That is when I went inside and grabbed my digital camera and snapped a photo. I really didn't think I got the shot. Seconds later, the object made a backwards letter J swoop and shot outward in a direction away from my position and disappeared beyond the horizon. I called my classmate back and described to her everything I saw. Today (June 30, 2001), I was downloading photos of my birthday that were taken on June 25, 2001 from the same camera I used to try and take pictures of the unknown object. All photos were downloaded to my computer. I decided to view the unknown object photo before deleting it when I noticed that I actually did catch something. The object appeared as I recalled. Round and black. I decided to use the computers zoom-in function and was able to determine that the object is solid, possesses detail such as a domed top, maybe a flat bottom, circular in shape, two projections from beneath of one side and maybe some markings or definition on its side. I'll be willing aid in your investigation and to talk to your third-party affiliates but only after I am made aware as to who they are."],"Region":"Missouri","Sighting Duration":"03:00:00","Date of the Event":"06/27/2011 08:24 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.81955,+-90.846181(29811)&iwloc=A&hl=en\"> mufon case (29811) map </A>","City":"Wentzville","Weather Factors":"None, Does Not Apply"}