{"Source":"MUFON","Summary":"Starl-like UFO moved very dramatically","Region":"Virginia","Log Number":"US-07012011-0003","Weather Factors":"Light","Object Features":"Unknown","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=36.604715,+-82.186507(29822)&iwloc=A&hl=en\"> mufon case (29822) map </A>","Disposition":"Unresolved","Date of the Event":"06/30/2011 10:50 UTC","Viewing Distance":"Over One Mile","Longitude":"-82.186507","Sighting Duration":"Undisclosed","Case Number":"29822","trends":["There have been 5 other sightings in Bristol","There were no other sightings in Bristol on or around June 30th 2011"],"Latitude":"36.604715","Tags":"City","files":["/var/www/straped/mufon/html2text/29822.html.txt","/var/www/straped/mufon/org/29822.html"],"Object Flight Path":"Path with directional change","Date Submitted":"07/01/2011 12:46 UTC","City":"Bristol","Country":"United States","divs":["Sighting DetailsOk, so I was driving home on June 30 at about 1045, and as I drove down the country road that I reside on I saw very faintly a large spotlight waving back and forth across the sky. I got to my house and went outside to investigate so I called my brother (another UFO researcher)whom lives not a half mile away to see if he was playing with his powerful laser or had at least heard of anything going on that would warrant a spotlight flying across the sky. He had not heard of anything so we ended the phone call. As I was bemused by the spotlight, I spotted a tiny spec relative in size to a far away star start to slowly move across the sky at about 25`-30` above the horizon. As I watched the object I was reminded of an experience a few weeks before where my sister-in-law saw, for all intents and purposes, the same object move in a similar fashion. She called out my brother who then called me down to witness the object. All three persons were in a coherent and sober mindset the night of both sightings. We all saw the same movements and would even laugh independently when we saw it start to move. However, on this night (June 30th), I watched seemingly the same object at about the same height above the horizon move what looked to be many, many miles (50-100?) across the sky, and very specifically stop, and move up maybe my out stretched thumb's length straight up. The object then made a direct 180` turn and went back across the sky in the same fashion as before, but only a thumbs length above the first flight path. By this time (approx 10:50pm) my brother and his wife were watching the same object, and had immediately spotted it as soon as they stepped outside. Maybe 30 seconds later the object just faded out behind some thin clouds and was no longer visible. Keep in mind though that throughout these few minutes an enormous spotlight was waving back and forth in the same basic direction as the object. However, not 90 seconds after the craft was no longer visible a definite human directed craft (airplane, as was visible from normal flashing airplane lights) flew straight down the flight path of the unidentified object, except it was traveling the opposite way. The airplane was then visible a few seconds later down the exact same flight path coming from its original bearings. I'm not sure if this was a second plane, or if it was the same plane after it had turned around. The first time we saw this phenomena it was an exalting experience, as we spotted and viewed the object moving in respect to a green laser we had setup. However, the second time around was quite a bit more foreboding in the respect that at the same time as I witnessed this \"craft\" (as it was definitely not a star as stars don't move, and it was not a civilian or military aircraft as there were no light beacons flashing, and lastly it was not a satellite as I see them quite often, and have even seen the ISS and Spaceshuttle darting across the sky in low Earth orbit.) there were a spotlight waving back and forth toward the area where the craft flew, and then subsequently either 2 planes separated or one plane by itself followed the exact same flight path as the object, except in reverse. This is absolutely one of the top 3 most quizzical experiences of my life. I am a rational person and have viewed the world through a scientist's eye since I can remember. I have also spent many years being taught the various sciences, and even took the time to take physics and both chemistry 2 and 3 in the same year of High School . Science is my life and I am pretty good at it. 99% of the time I will be able to come up with some kind of an explanation for an idea, event or occurrence, however on this night (june 30th) the only explanation I have is that the object I saw was not piloted by humans. It was most definitely a UFO, but its not so hard to not definitively identify something. So, we must look at other attributes and qualities of the incident to make some kind of determination; for example the movements of the craft across the sky into a 180` turn. That is not normal. Unfortunately I did not have time to get our good camera and was not able to spot the object through my terrible phone camera. Thank you for allowing me a credible place to post my story. This is one experience I will never forget, and will continue to look for answers for the rest of my life. I would also like to add that I live in a region of the Appalachian mountains where there is much less light pollution than in many other places, and with my natural inclination for science, have subsequently spent my entire life looking at the night sky when possible. I am well aware of the visible planets and major constellations, and this object was very abnormal for this area of the sky and time of year. Sincerely, J"]}