{"Date of the Event":"06/30/2011 12:00 UTC","Summary":"Very large bright object, low on horizon","Log Number":"US-07012011-0008","Case Number":"29827","Latitude":"40.27688","Date Submitted":"07/01/2011 02:04 UTC","files":["/var/www/straped/mufon/html2text/29827.html.txt","/var/www/straped/mufon/org/29827.html"],"Object Flight Path":"Undisclosed","trends":["There have been 26 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around June 30th 2011"],"Object Features":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","City":"Harrisburg","Weather Factors":"Unknown","Object Shape":"Oval, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.27688,+-76.875908(29827)&iwloc=A&hl=en\"> mufon case (29827) map </A>","Tags":"City","divs":["Sighting DetailsI usually go out on my porch every night before I go to bed to just get some from fresh air and look at the stars. I never see anything except for a few passing by planes but last night I saw something very strange. I hadnt really been paying attention to the horizon, as I had been looking up most of the time. I then saw two planes flying at the same exact speed, very close in altitude. They were moving very fast too. After seeing those planes flying so close together I thought that was very strange and I looked down and skimmed the horizon. Not too far from the direction that these planes came from I saw a very large light that at first I thought might have been a planet, but I had never seen it before. It was very bright and very low on the horizon, but definitely above the mountains. It sat stationary for about 5 minutes while I was on the porch and I then went to get my brother and grab a camera. When I got back it was gone. It looked very much like what a planet looks like, except 3-4 times larger in perspective. Whatever this was, it was in the atmosphere. I'm very disappointed that I didn't get photos or video, but I find the two planes that I saw before seeing the object to be very strange. Almost as if they were buzzed to go check this thing out."],"Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-76.875908","Region":"Pennsylvania","Disposition":"Insufficient Data"}