{"Source":"MUFON","Date Submitted":"07/01/2011 12:08 UTC","Summary":"Object flew at very high altitudes, and did connected figure eight loops. It had one constant flashing white light, then a second sequential flashing light periodically.","Longitude":"-98.154343","Object Features":"None, Unknown","Disposition":"Unknown","trends":["There have been 2 other sightings in Edinburg","There were no other sightings in Edinburg on or around June 15th 2011"],"Country":"United States","Log Number":"US-07012011-0001","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/29820.html.txt","/var/www/straped/mufon/org/29820.html"],"divs":["Sighting DetailsI got a message from a friend at around 1:30am about the light. I saw the message 15 minutes later and immediately went out to see if it was still there. It was a strange white blinking light that didn't seem to be any kind of normal aircraft. It was noticeable as I looked off to the east, a bright but distant blinking orb of light. It would blink one light a few times, then it would blink a second light sequentially 3 times then go back to a single blinking light. It seemed to stay rather stationary for a while and then randomly change directions heading north east to south east and back again due east. After a few minutes it was doing connected circles in the eastern sky. It would do a counter clockwise circle connected into a clockwise circle headed in a south east direction. I called the neighbor out to have someone else to see what they thought of it. She just asked what it was and I told her I didn't know. A few moments later another light appeared out of nowhere and flew north to south very fast just in front of the first object. It was the same size, color, distance, and brightness as the first object. It was not a meteor, it left no trail and neither faded in or out as it passed. It came into sight and I immediately began to shout, \"Look!\" I didn't believe my eyes. I was very excited now. We watched the object for almost two hours and spoke to neighbors who were also out at the time. They had seen it since 11pm, and had spoke to relatives that had seen it as far as 80 miles from our location. It stopped doing the figure eights and moved far off to the southwest. Then a few seconds later a low flying airplane passed by. After the plane was gone it continued back to its previous location and continued the same flight pattern all the way off to the east until it vanished from sight."],"Latitude":"26.311157","Sighting Duration":"Undisclosed","Region":"Texas","City":"Edinburg","map":"<A HREF = \"http://maps.google.com/maps?q=26.311157,+-98.154343(29820)&iwloc=A&hl=en\"> mufon case (29820) map </A>","Case Number":"29820","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date of the Event":"06/15/2011 01:44 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Tags":"City"}