{"Disposition":"Unknown","Region":"Ohio","Summary":"Chevron shape moving 50 mph SW over US125 made right angle turn stood on end and shot up at very fast speed","trends":["There has been one other sighting in Amelia","There were no other sightings in Amelia on or around June 28th 2011"],"Object Features":"Wings","Longitude":"-84.210564","divs":["sighting detailsthe object was chevron shaped, with a gray\\transluance color, like heat waves coming off the road. it was about 1500 ft up following us-125 sw toward interstate i-275. i followed the object for about 3 miles, when it made a right turn and turned the point of the chevron up. the object then shot upward at a very fast speed and went into the clouds and i never saw it again. the next day june 29, 2011, at 12:30 pm. i was going to lowe's down us-125 in the same direction as the object the day before, and there was 2 doe vans with dark out windows and flashing yellow lights on top. they were going about 25 mph in the same direction as the object yesterday, and the lead van had a long bar across top of it just behind the driver and passenger doors. on the top side of the bar at each end was a small white ball about the size of a softball with a flat bottom. there was a metal plate under the bar and there must have been a lot of equipment in the vans due to the way there tires were looking. the drivers of both van had green coveralls on and some kind of blue vest like you would see an x-ray tech use. i followed the vans for a mile and had a white doe car pull in front and stop me. the driver got out and told me to stop following them or i could be arrested and to go about my business. i don't know if all this is connected, maybe you guys have seen this before."],"Case Number":"29834","Latitude":"39.037797","Sighting Duration":"00:03:00","Object Shape":"Chevron","files":["/var/www/straped/mufon/html2text/29834.html.txt","/var/www/straped/mufon/org/29834.html"],"Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"06/28/2011 12:17 UTC","City":"Amelia","Country":"United States","Object Flight Path":"Path with directional change","Log Number":"US-07012011-0015","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.037797,+-84.210564(29834)&iwloc=A&hl=en\"> mufon case (29834) map </A>","Viewing Distance":"Unknown","Date Submitted":"07/01/2011 07:26 UTC"}