{"Summary":"Orange Ball of Light","City":"Pomona","Object Flight Path":"Stationary,Path with directional change","Log Number":"US-07012011-0017","Sighting Duration":"Undisclosed","Date of the Event":"10/31/2010 11:00 UTC","files":["/var/www/straped/mufon/html2text/29836.html.txt","/var/www/straped/mufon/org/29836.html"],"Weather Factors":"None","Source":"MUFON","Disposition":"IFO","Country":"United States","Date Submitted":"07/01/2011 09:08 UTC","Object Features":"Dome","Object Shape":"Fireball, Sphere, Other","divs":["Sighting DetailsMy friends and I were driving down Valley Blvd back to Cal Poly Pomona from having a late night dinner. I randomly looked out the window and up (for some strange reason) and saw this strange orange ball of light, not too far up from us. I stared at it for a good 15 seconds, trying to cancel out all the possibilities. At first I thought, \"Oh, maybe it's one of those Chinese lanterns or a blimp.\" I kept looking at it, trying to figure it out. I told my friends, \"You guys, look, it's a UFO.\" No one believed me. We stopped at a red light on the intersection of Valley and Temple when I told my friends just to look at it. They both looked up at it. We were all baffled. None of us knew what it was. My friend made the left turn at the intersection and I quickly turned around to stare at it through the back window. I kept trying to determine what it could possibly be. My eyes were glued to it. All of a sudden, I'm looking at it, and it slowly begins to hover toward the direction we were going. The further we would drive down Temple, the closer (in distance, not altitude) it would come towards us. When I told my friends that I had a feeling \"it\" knew I was watching and that it was following us, they began to freak out. We made a right onto Kellogg and ended up at another red light where a police officer happened to be in the lane next to us. We yelled at him, asking him to pull over with us and ask him what it was. We all pulled over and watched it over. It was about 1,000 feet up and a quarter mile away, not too far at all. The bright orange fire ball stayed in that spot, motionless for about a minute as we all stared up at it. After, it began hovering in a figure 8 motion for a minute. It then started dimming and brightening in intervals of about 2 seconds. All of a sudden, it completely darkened. We couldn't see anything--but in the spot where it was, tiny little \"fire balls\" began falling from the sky. It then appeared a little lighter than the sky, so it was barely visible, continued to drop these little orange fireballs (which also disappeared after dropping about 20 feet). The police officer then called his partner to come check it out since he had no clue what it was. We all sat watching it in awe. At first, I felt protected, it was strange. I felt like it was trying to tell me something. I didn't become fearful until I felt like it was following us. I had no clue what was going to happen. We lost sight of it when it moved behind some tree. We were able to see it for another 30 seconds then disappeared. We haven't seen it since."],"Latitude":"34.063657","trends":["There have been 16 other sightings in Pomona","There were no other sightings in Pomona on or around October 31st 2010"],"Case Number":"29836","Region":"California","Longitude":"-117.745035","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.063657,+-117.745035(29836)&iwloc=A&hl=en\"> mufon case (29836) map </A>","Tags":"City"}