{"Weather Factors":"Lightning, Light","Region":"Minnesota","Longitude":"-93.259347","trends":["There have been 3 other sightings in Faribault","There were no other sightings in Faribault on or around July 1st 2011"],"Date Submitted":"07/01/2011 10:42 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.296534,+-93.259347(29837)&iwloc=A&hl=en\"> mufon case (29837) map </A>","files":["/var/www/straped/mufon/html2text/29837.html.txt","/var/www/straped/mufon/org/29837.html"],"City":"Faribault","Source":"MUFON","Country":"United States","Summary":"Pulsating object above tree line","Viewing Distance":"Unknown","Log Number":"US-07012011-0018","divs":["sighting detailsi was near circle lake in minnesota when i saw the object. i was looking north and, unknown distance away, saw a pulsating fireball stationary just above the horizon. it looked kind of like emergency lights would look from a distance, if they could hover above horizon. the light was mostly white with a pulsating red tint. it looked quite different than an airplane, and was far lower in the sky than most aircraft fly. the object disappeared behind the trees and traveled a few degrees to the east, looking like it was above interstate 35. same pulsating fireball \\ sparking look. no sound. this was just after a thunderstorm passed and the air was still and quiet. the sun was not out, so i don't think it would have been reflections off metal. i thought it might be fireworks, but it had just poured rain with strong winds so i doubt anyone was out. and i never heard any crackles or booms. plus, the object hung in the sky for a few minutes motionless before it, i guess, apparently moved or reappeared some distance away to the east. it disappeared after a minute or two. it didn't move like fireworks move, either. it was much more deliberate and steady in its motion. i don't know why i noticed it. i just happened to glance between the trees and saw an object in the sky where there usually isn't anything at all. my wife saw it too. she was standing next to me."],"Case Number":"29837","Date of the Event":"07/01/2011 12:00 UTC","Tags":"City","Object Features":"Unknown","Disposition":"IFO","Object Shape":"Fireball, Flash, Oval","Object Flight Path":"Hovering then path","Latitude":"44.296534"}