{"Disposition":"Unknown","Object Shape":"Circle","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.355007,+-79.855115(29842)&iwloc=A&hl=en\"> mufon case (29842) map </A>","Source":"MUFON","Longitude":"-79.855115","Date Submitted":"07/02/2011 01:47 UTC","Log Number":"US-07022011-0003","Date of the Event":"07/01/2011 11:35 UTC","divs":["Sighting DetailsAt about 11:35 I put the dog out. I happened to look at the sky, and observed a bright reddish-orange light crossing the sky in a straight line, approximately SE to NW. I initially took it to be the landing light of an airliner, due to its size and the fact that this is a common flight path for planes arriving at Pittsburgh International Airport. However, the color was wrong for a landing light. In addition, there were no blinking lights anywhere in the vicinity of this light, as would be found on a plane's tail and wingtips. I also did not hear any noise at all, as I would have expected from a jet flying overhead. The light progressed across the sky at a fairly slow pace. It passed overhead perhaps 30-45 seconds after I first noticed it. As it did so, the light faded out. There was a faint dark shape that continued in the trajectory of the light until the glare from Pittsburgh hid it. The impression was similar to a vehicle with a headlight and no taillights passing by. The shape was faint enough that I cannot describe it with certainty - perhaps triangular or rectangular? In the sky it was perhaps the size of my thumbnail when held at arm's length. A check of NASA's SkySearch found no satellites passing over the McKeesport area between 11:00 and 12:00 this evening. After retrieving my camcorder, I sat outside and observed the sky until 12:30, but did not see anything besides the usual jets passing overhead. I am a pastor in my mid-thirties, with a bachelor's and master's degree. This is the first time I have observed an object in the sky that I could not explain. My primary emotional response was one of curiosity - I wonder whether anyone else will report this."],"Country":"United States","Sighting Duration":"00:01:00","Case Number":"29842","Tags":"City","Latitude":"40.355007","trends":["There have been 7 other sightings in McKeesport","There were no other sightings in McKeesport on or around July 1st 2011"],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29842.html.txt","/var/www/straped/mufon/org/29842.html"],"Viewing Distance":"Unknown","Weather Factors":"None","Region":"Pennsylvania","Summary":"Bright reddish-orange light moving from SE to NW toward Pittsburgh","City":"McKeesport"}