{"Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Latitude":"39.955125","Log Number":"US-07022011-0002","Case Number":"29841","Region":"Pennsylvania","Tags":"City","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around June 29th 2011"],"Longitude":"-75.153889","Date of the Event":"06/29/2011 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.955125,+-75.153889(29841)&iwloc=A&hl=en\"> mufon case (29841) map </A>","City":"Philadelphia","files":["/var/www/straped/mufon/html2text/29841.html.txt","/var/www/straped/mufon/org/29841.html"],"Source":"MUFON","divs":["sighting detailswed evening, 06\\29\\11, i went out back of my house to have a cigarette around 10pm. as i live approx 15 miles from phila intl airport, i scanned the sky to see what was moving. i immediately saw a plane heading west, obviously just departing as it was rather low & loud. it passed over my property & the sound diminished, then i saw another plane at very high altitude heading ene. no sound could be heard it clearly had blinking strobes. at that time i saw another light come from behind me, moving south. it caught my attention because there were no strobes at all. i'm not good at judging altitudes, but i would guess 2500ft. i watched it as it headed south, waiting to see if i could hear any sound as it progressed. i live in a very quiet, rural suburb and if this object had made a noise i would definitely have heard it at the altitude it was, but there was no noise from it that i could hear. i watched it moving rather slowly across the sky until all of a sudden it just blinked out. i was surprised and thought that maybe it had gone behind a cloud (even though i was pretty sure it was well beneath any clouds), but i watched for another 5 minutes and i never saw it again. the object was a low, glowing object. i couldn't see if there was any shape to it. it moved smoothly and slowly from north to south, towards nj, south of phila intl. the object did not fade away into the distance but rather just turned off in mid flight. the whole event took maybe 2 minutes from first sight to whenit disappeared."],"Disposition":"Insufficient Data","Summary":"Slow & steady, white light moving north to south. No blinking, no sound.","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"07/02/2011 12:18 UTC","Country":"United States"}