{"Log Number":"US-07022011-0007","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","City":"Houston","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around June 28th 2011"],"Summary":"Bright, glowing dot in the sky moving to the NNW. Zoomed in with a fairly powerful lens. Captured several shots.","Country":"United States","Region":"Texas","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/29846.html.txt","/var/www/straped/mufon/org/29846.html"],"Date Submitted":"07/02/2011 01:02 UTC","Object Shape":"Circle","Date of the Event":"06/28/2011 08:30 UTC","Latitude":"29.761793","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-95.36422","divs":["sighting detailswalking the cypress creek hike & bike trail - birdwatching. noticed a bright, glowing object moving at a very high altitude, going the wrong direction to be in the jet stream. moving fast. i had a long zoom lens on the camera i was carrying and got several photos of the object. i posted it on facebook and flickr with a remark and then one of my flickr contacts said something about the london sightings during the week. i watched a couple of the youtube videos and the one of the closeup is remarkably like my still of the round side of the object. mind you, i would've jokingly called this a ufo until i saw those 2 videos of the london sighting. here's a link to my photo on flickr. [link moved to additional evidence section\\cms\\tg] here's a link to the youtube video and if the center isn't remarably similar then tell me why it's not. [link moved to additional evidence section\\cms\\tg] what did i think... husband was there too. we were fascinated. in this day and age no one really cares. it's interesting. we lost sight of it when it moved out of range of sight. it couldn't have lasted much more than a minute or two at the most. wouldn't we all like to think it's possible that intelligent life exists somewhere? i can be contacted through my email"],"Case Number":"29846","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.761793,+-95.36422(29846)&iwloc=A&hl=en\"> mufon case (29846) map </A>"}