{"divs":["Sighting DetailsI was sitting down beneath an event canopy. The temperature was in the high 80's and lighting conditions were very sunny. I had a view of the sky from the horizon to about 120 feet high before the canopy blocked my view. Once or twice I noticed commercial airliners on their way to or from the international airport in SJ. But later and saw an object that I at first that might be a weather balloon. It ascended above the canopy so I had to stand up and get a better look. The sun was directly above me and behind me head so I had to make a sun shade with my hands to get a clear view. It was so small that it took my maybe 10 seconds to find it again. At this point it was much higher in the sky. It seemed to move very slowly. The size of the object relative to my perspective would be about the size of a tack if held up in my hand and pointed at the sky. There was another person with my who was not able to see it even though I pointed directly at it. I kept watching it to see if I could rule out whether it was a plane or other kind of aircraft. One of the difficulties of examining it's outline were occasional reflections from what I at the time assumed was the sun. I had to really focus on it to try and make out what it was. For example, if the object was above 30,000 feet, than that could explain it's slow movement relative to the ground. The color of the object was a dull brown to red. No metallic composition as far as I could see. Since it was not metallic, I didn't understand how it could reflect the sun. I figured what I was seeing was it's nearest edge wobbling up and down towards me as it moved. Then this edge must be reflective. I thought. But then I noticed an usual behavior which in my opinion is against the law of physics. It reflected very bright sunlight several times even though the angle of the object did not suggest this was possible. For instance, if you move a mirror back and forth, it will reflect sunlight. This object was reflecting sunlight without moving back and forth. After watching it for some time I must conclude it's real altitude was somewhere between 500 and 2000 feet. Dimension perhaps 20 feet in diameter. It's trajectory was continually south to south-west even though position in the sky and altitude varied during the encounter. It was so small I gave up watching after about 4 minutes. No one else believed that it was there."],"Source":"MUFON","Object Shape":"Circle, Sphere, Unknown","Longitude":"-121.886856","Log Number":"US-07022011-0009","Region":"California","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Tags":"City","Case Number":"29848","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around July 1st 2011"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.340546,+-121.886856(29848)&iwloc=A&hl=en\"> mufon case (29848) map </A>","files":["/var/www/straped/mufon/html2text/29848.html.txt","/var/www/straped/mufon/org/29848.html"],"Date Submitted":"07/02/2011 04:15 UTC","Country":"United States","Summary":"Unidentified Flying Object displaying unusual properties.","Weather Factors":"Unknown","Date of the Event":"07/01/2011 12:00 UTC","Disposition":"Unresolved","Latitude":"37.340546","City":"San Jose"}