{"Disposition":"IFO","Object Features":"Other","divs":["Sighting DetailsMY HUSBAND CALLED ME OUTSIDE AROUND 8:10 TO LOOK AT AN OBJECT THAT WAS VERY BRIGHT OUTSIDE OF OUR HOUSE, DIRECTLY ON THE MOUNTAINSIDE IN FRONT OF US. I GRABBED MY VIDEO CAMERA AND STARTED TAPING IT AND ZOOMING IN AND OUT COULD NOT MAKE OUT WHAT IT WAS. I KEPT TAPING IT AND HE AND I AND A FRIEND KEPT TRYING TO GET A REALLY GOOD LOOK AT IT. OUR FRIEND HAD BINOCULARS AND ONE SECOND HE WOULD SAY IT WAS TWO LIGHTS BUT IN MY VIDEO ITS ONLY ONE. IT LOOKED ALMOST LIKE A FLARE, OR GAVE OFF LIGHT AND COLORS LIKE A WELDER (MINUS SPARKS)BUT IT WAS ALL GLOWING LIKE THE SUN. OCCASIONALLY IT WOULD GO OUT BUT I COULD SEE AN OUTLINE OF SOMETHING THAT LOOKED LIKE TWO DARK CIRCLES IN A RECTANGLE BOX, WHICH WOULD GIVE OFF A DIM GLOW THEN GROW BRIGHT ORANGE AGAIN WHERE THE TWO DARK CIRCLES WERE AND MAKE THE BIG ORANGE BALL AGAIN. YOU CAN SEE ENERGY ALL AROUND IT, TOO. MIND YOU, THIS IS ON A MOUNTAIN, NOT WHERE A ROAD GOES(THERE ARE TRAILS) BUT THERE NO HOUSES CLOSE BY AND THERE ARE ONLY GROVES AROUND IT. YOU CAN SEE TREES BEHIND IT IN THE VIDEO, IT WAS STILL DAYLIGHT WHEN I STARTED TAPING IT, JUST STARTING TO GET DARK OUTSIDE. EVENTUALLY IT DISAPPEARED, THEN REAPPEARED, THEN WHAT I THOUGHT HAD DISAPPEARED FOR GOOD. ON PART OF THE VIDEO YOU CAN SEE IT REAPPEAR, THEN DIM OUT TO WHERE YOU SEE THE OUTLINE WITH THE LITTLE BLACK CIRCULARS IN A RECTANGLE AND THEN \"POOF\" DISAPPEARED,OR RATHER JUST VANISHED. I WENT INSIDE AND WAS GOING TO LOOK AT IT ON THE TV AND MY HUSBAND CALLED ME BACK OUT AND IT WAS A SHAPE OF A DIAMOND NOW, SORT OF TWINKLING LIKE A STAR, AND LIFTING OFF THE GROUND. NO BLINKING, NO NOISE, BUT THEN IT TURNED INTO DIFFERENT LIGHTS, WHICH IS HARD TO DESCRIBE WHAT THEY ARE. I WONDER WHAT IT WAS, AND ANYBODY I'VE SHOWED DOESN'T KNOW AND THEY'RE JUST AS CURIOUS AS ME.I WASN'T AFRAID OF IT AND NEITHER WAS MY HUSBAND AND OUR FRIEND. I WANTED TO REPORT IT TO SEE IF ANYBODY ELSE SAW WHAT I DID."],"Date of the Event":"07/01/2011 08:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.501139,+-117.145525(29856)&iwloc=A&hl=en\"> mufon case (29856) map </A>","Object Flight Path":"Stationary,Path with directional change","Object Shape":"Circle, Diamond, Fireball, Sphere, Square, Rectagular","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Log Number":"US-07022011-0017","trends":["There have been 13 other sightings in Temecula","There were no other sightings in Temecula on or around July 1st 2011"],"Date Submitted":"07/02/2011 10:34 UTC","Source":"MUFON","Region":"California","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29856.html.txt","/var/www/straped/mufon/org/29856.html"],"Longitude":"-117.145525","Case Number":"29856","Country":"United States","City":"Temecula","Latitude":"33.501139","Summary":"ORANGE COLORED BALL ON MOUNTAINSIDE","Weather Factors":"None"}