{"Summary":"on a bus","City":"Panama City","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","trends":["There have been 19 other sightings in Panama City","There were no other sightings in Panama City on or around November 30th 1988"],"Longitude":"-85.652216","Weather Factors":"None","Case Number":"29854","Source":"MUFON","Region":"Florida","divs":["Sighting DetailsIt was either late November or early December 1988, and I was 16 years old. I was riding on a school bus back from Panama City, Fl around 10:00-10:30 pm. We had just defeated one of the best teams in the state at the time. I was feeling very well and happy about my performance and continued to replay the game in my mind. About 30 minutes into our return trip home to Tallahassee, our bus was crossing over open water on a bridge. I looked around the bus and noticed that all of the players, coaches and cheerleaders seemed to be asleep. The only person I could tell who was awake was the guy sitting next to me \"Dave\". Even though we played on the same team, \"Dave\" and I rarely spoke because we were two different people internally. So we sat next to each other quietly. I looked out of the window out of sheer boredom and noticed a very bright, white light. I turned to \"Dave\", as I was the one seated by the window, and asked \"Dave is that Venus or the North star.\" He replied that he wasn't sure. So I turned and looked back and thought to myself this star sure is bright. All of a sudden without realizing it my eyes were set and transfixed on this star. It was pulsing like a heartbeat. I thought to myself that the stars must look different on this side of the state. After staring at this light for 1-2 minutes my brain went into an unconscous thought mode and all of a sudden a true grip of terror and primal fear ran all over my body right down to my bones. And I tell you I had never been that scared in my entire life. My thought was \"Jesus, if these guys wanted to take us out they could.\" And then the light moved. The light moved straight up, quickly about eight inches and stopped for 15-20 seconds. It then moved diagonally southeast (45 degree angle)around six inches and again stopped for 15-20 seconds. It moved again straight across over to the left around 12 inches and again stopped. Southest again it moved around six inches and it stopped. It was just floating in the air, almost hovering a little up and down almost right on top of the water. Finally the pulsing light just shot straight backwards and was gone. It reminded me of turning the television set off. The little white light that remains at the end and then just disappears. I turned back to my left at \"Dave\" and asked \"Did you see that?\" Dave's eyes were widely openned, like a deer in headlights, mouth closed and his head turning in a \"no\" mannerism back and forth. He was in shock. We just looked at each other, rolled opposite ways and went to sleep. Until that night I had never even thought about UFO's. The very next morning as I was getting ready for school I had the radio turned on as usual listening to music. Then the morning news was being reported in-between songs. And I heard it with my own ears; \"76 people over in Gulf County, Florida reported seeing an unidentified flying object last night.\" \"Thank God\" was all I thought to myself. Somebody else, somewhere else, saw the exact same pulsing light as I did. Later that day we had practice and before practice I approached \"Dave\" and asked if he remembered what he saw that night before. He said \"Yeah, I do, but I don't want to talk about it anymore.\" Thirteen years later \"Dave\" and I crossed paths again in our professions. I was a basketball coach and he was a referee. When we looked at each other there was not a drop of basketball in our eyes. I asked him \"Do you remember?\" And he just nodded his head up and down in a yes-ward motion.\" We never spoke about that evening since. Even today I don't know if there are aliens or martians, but I am absolutely sure that there are Unidentified Flying Objects."],"Log Number":"US-08092011-0051","Date Submitted":"08/09/2011 11:04 UTC","Country":"United States","Tags":"City","Object Shape":"Star-like","Disposition":"Insufficient Data","Latitude":"30.166013","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.166013,+-85.652216(29854)&iwloc=A&hl=en\"> mufon case (29854) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/29854.html.txt","/var/www/straped/mufon/org/29854.html"],"Date of the Event":"11/30/1988 10:30 UTC"}