{"Log Number":"US-07022011-0020","Latitude":"38.007273","Tags":"City","Date of the Event":"07/02/2011 09:45 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Object Shape":"Diamond","Summary":"orange, fiery object rising from horizon, then moving across the night sky at a moderate rate of speed, then disappearing","City":"Steeleville","Case Number":"29859","Date Submitted":"07/02/2011 11:39 UTC","Object Features":"Unknown","Region":"Illinois","trends":["There have been no other sightings in Steeleville","This sighting has never been favorited."],"Source":"MUFON","divs":["Sighting DetailsMy son and I were in town getting a bag of ice from an ice vending machine in downtown Steeleville. As I was collecting the bag of ice from the machine, my son opened the truck door and said, \"Mom, Mom what's that?\" Traveling across the sky was an orange colored object. It continued in a straight line across the sky over our heads at a moderate rate of speed. At first, I thought it may have been a firework of some sort since it is the Fourth of July weekend, but when the object was directly overhead, I realized it could not be a firework. It looked like it was on fire as it flew over, but it did not burn out. It also was not an airplane. There was also an airplane flying over in the eastern sky and the colors of the lights were totally different. (Plane emitted a white light) My son(10) said he was watching the sky over some houses in front of him for fireworks when the object appeared from the horizon. This is when he alerted me to the object. After traveling in a straight line, as the object neared the opposite horizon from it's origin, it disappeared. We drove to the area where we saw it disappear, but saw no evidence of it at all. I have never seen anything like this in my life. It defied all my logical thinking of what it could be."],"files":["/var/www/straped/mufon/html2text/29859.html.txt","/var/www/straped/mufon/org/29859.html"],"Sighting Duration":"Undisclosed","Longitude":"-89.658433","Country":"United States","Disposition":"Unresolved","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.007273,+-89.658433(29859)&iwloc=A&hl=en\"> mufon case (29859) map </A>"}