{"Country":"United States","divs":["sighting detailswhile at a cookout\\party in portsmouth,ri, close to midnight th enight of july 1st, a little while (around a half hour) after a late plane flight out of the airport there flew overhead, i noticed a reddish orange flickering light similar to that given off by a road flare moving across the northwest quadrant of the sky from west to north just above the treeline, climbing slightly. it was moving slowly, taking perhaps a minute to cross a 45 degree arc of sky. it then seemed to shift course, coming closer to where we were gathered outdoors near the greendale vinyards. i called my friends attention to it at that point, trying to figure out what it was. all observed it as it seemed to come closer, then rise almost vertically out of sight. during the apparent ascent, it moved slightly further across the sky in a northeast direction. it was quiet; there were no sounds discernible over the crickets and the crackle of our cookfire, nor did those sounds nor other animal noises appear to stop during the event. noone present had a plausible guess although we did make several ufo jokes afterwards. i think overall the feeling was curiousity."],"Case Number":"29853","Object Shape":"Fireball","Weather Factors":"None","Summary":"reddish-orange flare moving slowly, several direction changes","Date Submitted":"08/09/2011 12:30 UTC","City":"Portsmouth","files":["/var/www/straped/mufon/html2text/29853.html.txt","/var/www/straped/mufon/org/29853.html"],"Date of the Event":"07/01/2011 12:00 UTC","Disposition":"IFO","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around July 1st 2011"],"Source":"MUFON","Object Flight Path":"Path with directional change","Region":"Rhode Island","Latitude":"41.606764","Tags":"City","Log Number":"US-08092011-0066","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.606764,+-71.245996(29853)&iwloc=A&hl=en\"> mufon case (29853) map </A>","Viewing Distance":"Unknown","Longitude":"-71.245996"}