{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.032315,+-91.944921(29866)&iwloc=A&hl=en\"> mufon case (29866) map </A>","files":["/var/www/straped/mufon/html2text/29866.html.txt","/var/www/straped/mufon/org/29866.html"],"Region":"Arkansas","Date Submitted":"07/03/2011 12:50 UTC","Case Number":"29866","Longitude":"-91.944921","Object Shape":"Triangle","Object Flight Path":"Undisclosed","Summary":"Two pair of what appeared to be triangle shaped objects with orange lights","Viewing Distance":"Unknown","City":"Ward","Weather Factors":"Unknown","Tags":"City","Latitude":"35.032315","divs":["Sighting DetailsWhile at a early 4th of July cookout with my family, we observed one pair of low flying craft maybe 500 to a 1000 feet up traveling South to North. The objects had a very bright orange-red light on the bottom. The color looked like the color of a flare. After they both passed a certain point the lights went out but you could still see the objects which looked like they were somewhat like a three dimensional triangle. We watched them for several minutes until they were out of our sight. Just a couple minutes after the first pair went out of sight, a second pair appeared traveling the same path as the first, and with the same bright orange-red light which went off at the exact same point as the first two. We set realativly close to an Air Force base that uses C-130's and having been in the military and around different types of aircraft, both in the military and in my job as a police officer, I am sure that this was not a plane or helicopter of any type. There was absolutley no sound of any type with these craft. The craft were not flares or fireworks as they continued to travel on a straight and level path. There were no navigation or marker lights on the craft."],"Date of the Event":"07/02/2011 09:05 UTC","trends":["There have been 2 other sightings in Ward","There were no other sightings in Ward on or around July 2nd 2011"],"Log Number":"US-07032011-0004","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON"}