{"Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-89.389478","Object Flight Path":"Undisclosed","Log Number":"US-07022011-0021","Object Features":"Undisclosed","Date Submitted":"07/02/2011 11:43 UTC","files":["/var/www/straped/mufon/html2text/29860.html.txt","/var/www/straped/mufon/org/29860.html"],"Case Number":"29860","Latitude":"40.635925","City":"Undisclosed","trends":[],"Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.635925,+-89.389478(29860)&iwloc=A&hl=en\"> mufon case (29860) map </A>","Date of the Event":"07/02/2011 10:15 UTC","Disposition":"Unresolved","Object Shape":"Star-like","Summary":"Star like object moving at high speed across the night sky","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy friend and I were going on a motorcycle ride. I pull up to my friends house and look. I saw a very bright star that resembled the brightness of Venus. I was facing east south east. It continued on a north, north west trajectory. It was covering a huge portion of night sky very quickly. The speed was like nothing I have ever seen before. I know something at the altitude cannot cover a whole hemisphere of night sky that quckickly unless it's a meteror comet or a hypersonic aircraft. As passed above my head it slowed down buy was still moving very quickly. A cloud was in the northern part of the sky. It passed behind the cloud and never cane out the othe side. If I had to guesstimate the speed I would assume at that altitiude the craft must of been traveling at least Mach 6 or 7. But I have never seen a craft move that fast so have no basis for comparison. I was thought it was just a meteor at first but when I saw slow down and doses ear behind a cloud I knew what it was. Also I thought it might of been a firework but the altitude of this object was far beyond even commercial fireworks in altitude. It really was that altitude the got my attention. A craft That resembles a star. Must be high up. I 20 miles away from ohare international airport. I have seen a lot of high moving jets. I have never mistook a jet for a star. For it to be that high, bright, and moving at that speed was nothing short of amazing."],"Region":"Illinois"}