{"map":"<A HREF = \"http://maps.google.com/maps?q=41.887114,+-87.621698(29867)&iwloc=A&hl=en\"> mufon case (29867) map </A>","Case Number":"29867","Sighting Duration":"00:03:30","Disposition":"Unresolved","Country":"United States","divs":["sighting detailsi was downloading the escalation map pack for call of duty: black ops. to my surprise, it wouldn't download while i played. needless to say, i was a little disappointed. looking for something to do, i decided i would water the herbs on our window sill that we recently got at our wedding shower. when i looked up, out the window, i saw two orange pulsating lights in the northern sky. they didn't look like plane lights, and the light pollution is too great to see any stars. after watching them for a bit, i realized that they were shifting slightly, so i grabbed my girlfriends camera. as i started to video tape them, they started to fade, but three more showed up. they appeared to be in like a v formation, but my perspective was from the front. i set the camera down, got my fiance, and started to video tape them again. they moved slowly, never really getting bigger or smaller. they eventually shifted upwards slowly until they disappeared after about two and a half minutes. to answer question five, i am quite blown away. i have always had my eye to sky for a number of reasons. first, i am an amateur astro-photographer. i love taking pictures of stars and the night sky. in doing so, i have learned the differences between satellites, meteors, planes, and planets. i know whats what in the sky. secondly, i must admit that i am a bit of a ufo enthusiast. that being said, i am also a skeptic. i'm not going to believe anything out there. i know that what i saw tonight wasn't a plane, a meteor, a firework, or a star. thank you for your time. this is the link to the video on youtube, [link moved to additional evidence section\\cms\\tg]"],"Object Shape":"Star-like","Viewing Distance":"Unknown","City":"Chicago","Weather Factors":"Unknown","Summary":"Five Star Like Objects Flying Over Humboldt Park Chicago","Latitude":"41.887114","Date of the Event":"07/02/2011 11:05 UTC","Log Number":"US-07032011-0005","files":["/var/www/straped/mufon/html2text/29867.html.txt","/var/www/straped/mufon/org/29867.html"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Region":"Illinois","Tags":"City","Source":"MUFON","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around July 2nd 2011"],"Longitude":"-87.621698","Date Submitted":"07/03/2011 12:55 UTC"}