{"Log Number":"US-07022011-0022","map":"<A HREF = \"http://maps.google.com/maps?q=37.491388,+-119.961254(29861)&iwloc=A&hl=en\"> mufon case (29861) map </A>","files":["/var/www/straped/mufon/html2text/29861.html.txt","/var/www/straped/mufon/org/29861.html"],"Date Submitted":"07/02/2011 11:55 UTC","Object Flight Path":"Undisclosed","Object Shape":"Star-like","Tags":"City","Date of the Event":"07/02/2011 03:30 UTC","Region":"California","Sighting Duration":"Undisclosed","Latitude":"37.491388","Object Features":"Undisclosed","Summary":"Star like object with red and white and blue lights.","Weather Factors":"Unknown","Disposition":"Insufficient Data","Longitude":"-119.961254","Case Number":"29861","Country":"United States","Viewing Distance":"Unknown","divs":["sighting detailsat 3:30am pacific time my husband went to go smoke a cig. he then came hauling butt into the house and told me that i had to come see this. i got dressed and went outside to the back porch. he then showed me where it was. it was due west just above the tree line. there were lights on this that were red, blue and white. this looked like a star or planet. the lights werent flashing like an airplane. we watched it for about 3 mins and it was moving left and right up and down it then moved in a diagnal \\ just like this icon up and down. it then moved in a full circle 4 times. we tried to get video and couldn't get any i did get audio of us watching this object. this went on for about 35 mins and then it decended behind the trees shot straight up and dropped like a brick in 30 seconds time. i have never seen an object move like this, and the star location was in between the first and second star of the start of the scropion's tail, from the butt about 100 yards from the tree line. no known object that i know of can move like this did. wishing we can see this again, with video or photos."],"trends":["There have been 5 other sightings in Mariposa","There were no other sightings in Mariposa on or around July 2nd 2011"],"City":"Mariposa","Source":"MUFON"}