{"map":"<A HREF = \"http://maps.google.com/maps?q=32.967027,+-97.673788(29869)&iwloc=A&hl=en\"> mufon case (29869) map </A>","Viewing Distance":"101-500 Feet","Longitude":"-97.673788","Weather Factors":"None","Disposition":"Unknown","Tags":"City","City":"Springtown","Latitude":"32.967027","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29869.html.txt","/var/www/straped/mufon/org/29869.html"],"Date of the Event":"07/02/2011 09:30 UTC","Case Number":"29869","Object Shape":"Unknown","divs":["Sighting DetailsI walked out on my front porch to look at the stars but it was still too light to see them. The sun had gone down but it wasn't dark enough to see the stars. I looked straight in front of me towards a house across the pasture from my house and saw a red light. The house I was looking at had its lights on and I thought there was a car or truck in front of it and the red light was a tail light. Then the red light took off at an angle, kind of like a roman candle. I thought it was fireworks due to it being so close to the 4th. We have a ban on fireworks due to the drought, but I still have seen some. The red light kept going up and got larger until it was an orangish-red, large shape. It didn't have a definite shape, just large and orange. Now it has hit me that this is not fireworks. I yelled for my husband and when he came out it was up in the air and he ran back in the house to get the camera. It moved slowly up and the higher it got, the smaller it got. It turned west and flew away, turning into more of a white light. We watched it until we couldn't see it anymore. I am still in shock. The pictures my husband got look like white lights, small and indescript. I watched this thing go from ground level to very high in the sky and out of sight in under 2 minutes. It has blown my mind."],"Date Submitted":"07/03/2011 01:18 UTC","Region":"Texas","Country":"United States","Source":"MUFON","trends":["There have been 5 other sightings in Springtown","There were no other sightings in Springtown on or around July 2nd 2011"],"Log Number":"US-07032011-0006","Object Flight Path":"Path with directional change","Sighting Duration":"00:02:00","Summary":"It lifted off the ground and flew away"}