{"Object Flight Path":"Straight-line path","Summary":"UFOs Over Albany, CA","City":"Albany","Date Submitted":"04/22/2004 08:45 UTC","Case Number":"2986","Object Shape":"Triangle","Country":"United States","files":["/var/www/straped/mufon/html2text/2986.html.txt","/var/www/straped/mufon/org/2986.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.88687,+-122.297748(2986)&iwloc=A&hl=en\"> mufon case (2986) map </A>","Region":"California","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"01:00:00","Longitude":"-122.297748","Log Number":"","Date of the Event":"04/22/2004 08:45 UTC","trends":["There have been no other sightings in Albany","This sighting has never been favorited."],"Object Features":"Undisclosed","Weather Factors":"Unknown","Disposition":"Insufficient Data","Source":"MUFON","Tags":"City","divs":["Sighting DetailsAt 845 p.m. me and a friend were in the backyard looking at the moon and Venusas they were aligned tonight. We first saw the object moving very quickly acrossthe sky heading north. It looked like 4 very dim slightly pink steady lightsarranged in a triangular formation with one light in the middle. It passedoverhead and then disappeared as if the lights just turned off. About 2 minuteslater we saw a V shaped arrangement of lights, also very dim, fly low and veryquickly overhead. About 5 minutes later another V shaped craft flew quicklyoverhead and then disappeared. About 5 minutes after that a large dimly lit grayball quickly bounced across the sky and then vanished. About 3-5 minutes afterthat a solid straight line of 3 dim lights went racing overhead while spinningon it60s axis. All these lights were heading in the same direction which was north.But about 5 minutes later 3 dim lights in a triangular formation went flyingoverhead at an amazing speed and then proceeded to break apartspread out andseperate but then quickly regroup into a triangle and then disappear from sight.In all 6 cases the lights were clearly visible as there was no cloudcoverfogwind or light pollution the stars were very clear and plentiful which israre around the Bay Areaeven though the all the lights on each craft were verydim. They all blended in with the stars and did not flash or blink. In each casethere was no sound at all. The Oakland airport is close by and airplane noise isvery familiar. All the craft observed moved about as 34 the speed of ameteorite. All of the objects observed seemed to just disappear from view asthey passed overhead.I and several other witnesses saw 6 different craft displaying completelyunusual behavior within one hours time. Each craft was different except for 2were V shaped. The first craft was triangular shaped with a light in the middle,the next 2 were V shaped, the 4th one was straight like a stick and the 6thcraft was in a triangle formation but broke apart and then regrouped quickly."],"Latitude":"37.88687"}