{"Summary":"Flashing lights above 29 Palms Mountain","Region":"California","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Latitude":"34.135715","map":"<A HREF = \"http://maps.google.com/maps?q=34.135715,+-115.943673(29871)&iwloc=A&hl=en\"> mufon case (29871) map </A>","trends":["There have been 6 other sightings in Twentynine Palms","There were no other sightings in Twentynine Palms on or around July 2nd 2011"],"Date of the Event":"07/02/2011 10:17 UTC","Disposition":"IFO","divs":["sighting detailsat this moment, there are odd flashing lights above 29 palms mountain to the east of my home. i can see them from the driveway. this is a recurring event. there is a distinct short line of flashing lights that look as if there is an antenna array at the peak of the mountain. no such antenna array exists. the last time this occurred, about 2 months ago, i could see them acting in the same way even as i drove across our small town. after i went to the circle k at the end of town to buy some smokes, the lights were still visible. i drove up utah trail toward baseline road and the lights ceased. when i drove back home, they were no longer visible from the driveway. now they are back. they do not move, they are not an aircraft. the lights are not helos hovering there. this is a local oddity, that no one can explain. pretty simple and straight forward. the only other odd thing was that last night there was much helicopter activity from the marine base. they never fly over town since there is so much open desert here, but at least 4 helos flew over town. probably not connected, but odd none the less. at this moment, 10:27 pm, the lights are now gone. they were there when i checked between the 2nd and 3rd paragraphs here. 1. just walked out to the driveway and saw them again. 2. the out of place flashing light that was not moving. 3. an antenna array possibly for aircraft, but there are no red lights visible. 4. blinking\\flashing 5. mental thought: there it is again. 6. by coming into the garage here to make this report. sorry, no pics. will try better next time if my little camera can zoom in on them from here. by the way: this was not over the marine base but south of hwy 62 in 29 palms proper. called my wife outside to show her."],"Viewing Distance":"Over One Mile","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29871.html.txt","/var/www/straped/mufon/org/29871.html"],"Weather Factors":"None","Object Shape":"Flash, Star-like","Tags":"City","City":"Twentynine Palms","Country":"United States","Date Submitted":"07/03/2011 01:35 UTC","Longitude":"-115.943673","Source":"MUFON","Case Number":"29871","Log Number":"US-07032011-0008"}