{"Country":"United States","Longitude":"-89.979724","Summary":"Very bright, very large, Orange Ball of light moving horiziontally across the sky until it it shrank to the size of a star and dissapeared.","Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Fireball, Sphere, Star-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.52435,+-89.979724(29872)&iwloc=A&hl=en\"> mufon case (29872) map </A>","Date Submitted":"07/03/2011 03:07 UTC","Date of the Event":"07/02/2011 11:15 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/29872.html.txt","/var/www/straped/mufon/more/29872_submitter_file1__2011-07-0223.14.00.jpg","/var/www/straped/mufon/org/29872.html"],"City":"Belleville","trends":["There have been 15 other sightings in Belleville","There was one other sighting in Belleville on or around July 2nd 2011","This sighting has never been favorited.",""],"Region":"Illinois","divs":["Sighting Details I was on the on the phone parking the car when all of the sudden directly in front of me, traveling horizontally from South to North along the treeline, I saw a bright orange ball about the size of a tangerine held at arms length. My first thought was, \"oh look at the gorgeous firework\". Then I realized that it was moving far to slow and steady to be a firework and way to level to be a Chinese lantern. I exited the vehicle quickly realizing that this was not something I had seen before, and was both alarmed an in awe. I am surrounded by farmland and it's a clear night on the Fourth of July....I am used to seeing all kinds of stuff this time of year...but this was different. This could only be described as nothing other than a bright orange fireball. It made NO noise whatsoever. I hung up the phone and quickly tried to take a picture with my camera phone. But try as I might the photos weren't clear at all, and I was now running to keep up with it as it continued along the horizon gradually getting only slightly smaller. I then proceeded to try and get a video of the object from my phone...however the camera only saw black sky on the viewfinder. Now I was confused, alarmed and increasingly agitated . In the video all that can be heard are crickets and me saying \"what is that?! and why is not visible on the camera? \" (That's right I am the stereotypical guy that could not get video of the blasted thing in a day when EVERYONE has a camera on them. I wont waste your time by posting the video its 20 seconds of me yelling at myself ) I put the camera away as I came up on the end of the dead end street I live on and met the edge of a large farmers field. It was at this point that the object had slightly curved ahead of me, and was now directly due north. It was then without warning or sound that it moved straight up in the sky at a high rate of speed until within milliseconds it went from the size of now a ping pong ball held at arms length, to a the size of a large star, only to shrink to match the size of any other star within the night sky. It dissipated into the sky like a star just fading out. I kept repeating to my self now, \"no one will believe me, I couldn't get it on film... I maybe have on VERY blurry picture of it. I cant tell anyone... who will believe me??\" I stared waiting to see if I would see anything else for only a minute or two...perhaps firework or a plane or anything, and it was just silent. Nothing. I turned to walk back to my home and proceeded to call my parents who I was on the phone with when this whole thing started, to explain to them why I had hung up so abruptly. As I began to explain, from the corner of the sky where the object originated, came three helicopters, flying in formation moving in from south to north following the direction the object went. I watched them until they disappeared from site...they took much longer, and they made noise. I have NO explanation for what I saw... it was huge, it was glowing bright orange and looked almost like it was on fire....it moved slowly and completely parallel to the ground until it shot off into the sky. It just defies explanation. I am attaching the one phone photo that actually came out. Its a really lousy picture, with no frames of reference and would never hold up in court... but its all I have. I just don't know what to think."],"Case Number":"29872","Log Number":"US-07032011-0009","Disposition":"Unresolved","Latitude":"38.52435","Tags":"City"}