{"divs":["Sighting DetailsHello, Ill tell what happened as best as I can rememberIve forgotten somethings,incredible but true. The events ocurred in 1994,I believe. I dontremember the days but it was around 7 something or 8 something pmat night. I wasin my houses terrace lifting some weights when I saw the saucer. I live near LosPaseos in Cupey, Puerto Rico. I was about 17 years old at the time.When I saw the saucer from my terrace, the saucer was above the shoppingmalllittle shopping mall of Los Paseos. It was about 150 feet above in the air.I immediately identified the object as a saucer because of the extreme lowaltitude, it was so close, so low. The object at that time was hovering, quietin the sky. It was gorgeous, the exact colorYellow Goldlike 24 karat gold, therewere windows with colored lights, one different light per window, in all like arainbow.The saucer had a dome. Some feets above and around the dome,the sky was orange,almost like a painting. I dont know if that was radiation or some light orwhatever it was, but was like that. I dont think it was a hologram. In thebottom of the craft I saw two louversblackones from my viewpoint so I dont knowif there were more. I looked at the saucer for about 1 to 2 minutes, then Iwalked some steps back toward the house to call my mom, to tell her to come tothe terrace to watch the saucer, but she didnt hear me so I came back to look atthe saucer again but it was gone.P.S3E In those days in that area I saw 3 ufos. One very high in the sky that cametwo or three consecutive days around 515 pm or something like that, hovered, ithide itself between the clouds, made backward movements like it knew that wemyfather,mother,and me were watching him, like playing with us.Some days or weeks later I was again in the terrace and looked at the horizonand saw a saucer ascent from the ground I think and move to the right. Thedistant I would say some miles my house is in hills, so I have a good view.The color of the saucer from that distance was orange, or a reddish-orange.And my third and last view of a saucer those days was the first one that Idescribed already at the beginni"],"Log Number":"","Sighting Duration":"00:05:00","Date Submitted":"11/30/1993 12:00 UTC","Object Flight Path":"Straight-line path","Disposition":"Unknown","Longitude":"-99.891943","Viewing Distance":"501 Feet - 1 Mile","Case Number":"2988","Country":"United States","Tags":"City","Source":"MUFON","Summary":"UFOS OVER SAN JUAN, PUERTO RICO NEARLY AT GROUND L","Date of the Event":"11/30/1993 12:00 UTC","Latitude":"31.974439","trends":["There have been no other sightings in Rio Piedras Cupey","This sighting has never been favorited."],"Region":"Texas","City":"Rio Piedras Cupey","Object Features":"Dome, Window(s), Louvres","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.974439,+-99.891943(2988)&iwloc=A&hl=en\"> mufon case (2988) map </A>","files":["/var/www/straped/mufon/html2text/2988.html.txt","/var/www/straped/mufon/org/2988.html"],"Weather Factors":"Unknown"}