{"Summary":"2 objects-exactly the same","Weather Factors":"Light","files":["/var/www/straped/mufon/html2text/29889.html.txt","/var/www/straped/mufon/org/29889.html"],"Case Number":"29889","map":"<A HREF = \"http://maps.google.com/maps?q=40.044126,+-76.298914(29889)&iwloc=A&hl=en\"> mufon case (29889) map </A>","Date Submitted":"07/03/2011 09:19 UTC","Longitude":"-76.298914","Sighting Duration":"00:04:00","trends":["There have been 22 other sightings in Lancaster","There were no other sightings in Lancaster on or around May 10th 2011"],"Country":"United States","Latitude":"40.044126","Log Number":"US-07032011-0025","Viewing Distance":"Over One Mile","Object Shape":"Oval","Date of the Event":"05/10/2011 10:30 UTC","Tags":"City","divs":["Sighting Detailsthis is the third event i have witnessed in the past 6 months. i am a u,s, navy vet from korean conflict. aircraft carrier,u.s.s. oriskany,cva-34 ,1950-54.on deck catapult with many night operations. i am now a courier and have never noticed anything unusual in the sky until last 6 months. i was traveling north on pa-222,at about 10:30 p.m. when i noticed thru the car window an object directly in front of my car at an elevation of about 60 degrees and then another about 20 miles past 1st object .it was a clear sky and the two objects seemed to be stationary directly overhead as i passed under them .they were exceptionally clear and seemed to be lit on the undercarriage as a daylight sky-blue with a protruding super-structure directly in the center of the objects which was a fire -engine red.the red light was pulsating,lighter and darker. not a strobe like effect but a pulsating,throbbing light.these were extremely clear and are the most unusual objects i have ever witnessed.the objects seemed to be oval shaped ,perhaps the size of a jumbo jet with the superstructure about 20% of the width."],"Object Features":"Dome","Source":"MUFON","Disposition":"Insufficient Data","Region":"Pennsylvania","Object Flight Path":"Path then hovering","City":"Lancaster"}