{"Log Number":"AU-07032011-0016","divs":["Sighting DetailsWe were at a mates 21st bday party on the gold coast suburb of Talai. I had come out of the house around 4:30am and noticed an incredibly bright light in the sky. I thought it unusual because we had constant cloud cover all night, and this object appeared to be under the clouds and moving. At first i thought it couldve been a satelite, but realised the movement of it, which went from left to right, and up and down. I was quite intoxicated, so i had to further analyze the situation and what i was looking at for about 10 minutes before i called my friends out to see. One friend brought a video camera out and we filmed it until it was no longer visible. Video link is below. I am a very amateur astronomer, but i DO know the difference between a celestial body and an object that is a few hundred meters above me. Seeing this gave me a great feeling of honour. Im SURE it was an intelligently controlled craft, not of human origin. It gave me the feeling that it was aware of our presence. By the end of the sighting, a group of dark storm clouds had seemed to have been drawn to the object, which was then engulfed by them, followed by a brief 5-10 min electrical storm with very light rain. It was an amazing experience and i hope to see more like it. I was actually on a popular morning talk show on Australian TV to talk about the video and sighting. It was quite the story here in Queensland for a couple weeks, and is STILL yet to be officially debunked. I have no doubt this object was real!"],"Date of the Event":"02/12/2011 04:30 UTC","Tags":"City","Object Flight Path":"Stationary,Other","Object Shape":"Square, Rectagular, Star-like, Other","Disposition":"Unresolved","City":"Surfers Paradise","Date Submitted":"07/03/2011 03:39 UTC","Region":"Queensland","Summary":"Filmed our sighting during a birthday party","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-27.994271,+153.435127(29880)&iwloc=A&hl=en\"> mufon case (29880) map </A>","Weather Factors":"Unknown","Sighting Duration":"00:20:00","files":["/var/www/straped/mufon/html2text/29880.html.txt","/var/www/straped/mufon/org/29880.html"],"trends":["There has been one other sighting in Surfers Paradise","There were no other sightings in Surfers Paradise on or around February 12th 2011","This sighting has never been favorited.",""],"Latitude":"-27.994271","Case Number":"29880","Viewing Distance":"101-500 Feet","Country":"Australia","Object Features":"Other","Longitude":"153.435127"}