{"Country":"United States","Region":"California","Date Submitted":"07/03/2011 04:41 UTC","Tags":"City","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/29882.html.txt","/var/www/straped/mufon/org/29882.html"],"Case Number":"29882","Longitude":"-118.284749","Latitude":"34.07536","Disposition":"Unknown","City":"Los Angeles","divs":["Sighting DetailsI had just read a very recent (late June, 2011) report of a \"building-sized\" ufo witnessed in Koreatown. As I read the description and then saw the witness' drawings, I couldn't believe that - with the exception of the reported size of the object - I had seen something incredibly similar on three separate occasions in Koreatown in early January, 2011. The following is a description of that last sighting, as I had a witness and it was more eventful than the previous two sightings. At 10 am, March, 2011 I went outside for a smoke break at my job in the Koreatown area of Los Angeles. As I always do, I looked up and there in the sky, for the third time in two weeks, was a hovering, off-white object just hanging almost directly overhead of my building. It was the only thing in a gigantic blue sky and, while I have no evidential basis for saying this, it seemed to be there on purpose. My very first impression was that it was a surveillance device of some kind. Ridiculous, I know, but that was my first irrational thought. After all, this is Los Angeles, so who knows what kind of surveillance is in use... Even at this height (about a mile, I think - not good at estimating distance), I could see that it had a rounded surface, that it was reflecting sunlight, it was a solid and completely motionless object. Because I had seen this object twice before in this same area, I had brought a small pair of binoculars to work with me in case of another sighting. I ran in to get them and also called out a co-worker to see this with me. She came out and we watched it, both noticing (prior to using binoculars) that it seemed to be changing shape. I hadn't noticed this characteristic the first two times I'd seen it. It gave the impression of being mechanical in a way that I can't quite describe. Through the binoculars, we were both shocked to see that it seemed to be made of several moving, rotating parts that were constantly changing position. As impossible as it seems, the parts seemed to be moving out and around each other, settling in position and then other parts would do the same. This constant morphing reminded me very much of the evil box in the Hellraiser movies, or - and I'm reluctant to say this but it is accurate - the Transformers. The object which had at first seemed to have a rounded surface suddenly seemed to be made of many rectangular and sharply angled moving parts. Also, there seemed to now be a shimmery haze around the object itself - like when you see a mirage over the road or above the hood of your car on a hot day. This was happening all around as it began to change shape and I did not see that effect prior to the apparent shape-changing. Perhaps it could only be seen with the aid of binoculars. We watched this for about 10 minutes as it slowly began to move west towards Santa Monica and finally disappeared out of sight. It did not move upwards, only west - away from where we were. The other Koreatown sighting that I read about in late June, 2011 reported the size of the object to be building-sized. What I saw was not nearly that large, although the distance (perhaps a mile in the sky) made actual size difficult to estimate. Maybe the size of an army tank would be my guess. I was reluctant to report this because of the bizarre shape-changing properties of the object until I read the June, 2011 report that was so similar to what I'd seen. This was definitely a physical object, I saw it clearly enough to state that with certainty. It was absolutely in the sky on three separate occasions over a two week period and it hovered in the same general area all three times for about ten - fifteen minutes each time. After remaining stationary, it slowly moved away and out of sight all three times. Throughout the sighting, it was too far away to take a picture or video of with my phone. I did attempt to do so, but all that could be seen in the picture was a white dot in the sky. Frustrating but not surprising, considering the distance."],"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around December 31st 2010"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Summary":"Hovering, Whitish in color, many strange angles constantly changing shape","Date of the Event":"12/31/2010 10:00 UTC","Log Number":"US-07032011-0018","Object Features":"Other","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.07536,+-118.284749(29882)&iwloc=A&hl=en\"> mufon case (29882) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path"}