{"Date Submitted":"07/03/2011 05:32 UTC","Weather Factors":"Fog","Object Features":"Undisclosed","Case Number":"29883","Tags":"City","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around July 3rd 2011"],"Source":"MUFON","Summary":"about 2 dozen unusual orange lights","City":"Charlotte","Country":"United States","files":["/var/www/straped/mufon/html2text/29883.html.txt","/var/www/straped/mufon/org/29883.html"],"Date of the Event":"07/03/2011 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.235997,+-80.836857(29883)&iwloc=A&hl=en\"> mufon case (29883) map </A>","Sighting Duration":"Undisclosed","Longitude":"-80.836857","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Latitude":"35.235997","divs":["Sighting DetailsAround 3 am Eastern time I happened to notice 3 orange circular lights traveling North by Northwest. I was looking South when I saw them and the speed and trajectory they were traveling was consistent with a commercial jet. These lights were not blinking or fading and they were roughly 4 or 5 times the size and brightness as the largest visible planet. They were close to being in a straight line, made no noise whatsoever, and left no trail. Had they left a trail, I would have guessed they were meteors. At the time I was with 2 friends who also saw the objects and thought them to be odd enough to quickly call their wives outside to check them out before they disappeared over the horizon. It was then that one of the wives exclaimed there were more coming, and sure enough 3 or 4 more appeared from behind the treeline and followed the same path at the same speed. More kept coming in random intervals for the next couple minutes, sometimes only 2 at a time, sometimes up to 5. There were no patterns I could discern except for a couple groups seemingly forming a perfect triangle. There were about a couple dozen total over the course of 3 or 4 minutes. We managed to get videos on cell phone cameras, but they are what you would expect from filming with such a device against a dark sky. We were amazed and baffled to the point that we called 911. While we admitted to the officer who came out that we felt a little silly calling and that we had been drinking all night, we felt a burning need to let authorities know what we had seen. I checked wind direction for that time frame, and it was blowing South at 5 mph which pretty much discounts the possibility of chinese lanterns or flares. I have absolutely no clue what these things could have been, and I feel very fortunate that I had friends with me to witness this. We are all in our 30s and have careers in retail, insurance and teaching. I am sharing this experience in the hopes that someone else saw these and can possibly explain what they were. The random formations discount (to me) the possiblility of military aircraft, the wind direction rules out lanterns or flares, it was a clear night so they weren't reflections, and no trails tell me they weren't meteors. Absolutely unexplainable, and the quantity made it somewhat of a scary experience. For a brief time I wasn't sure if they would stop coming."],"Object Shape":"Sphere","Object Flight Path":"Undisclosed","Region":"North Carolina","Log Number":"US-07032011-0019"}