{"Case Number":"29888","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29888.html.txt","/var/www/straped/mufon/org/29888.html"],"City":"Cedar Rapids","Summary":"I observed a reddish-orange light in the sky that remained stationary for several minutes and then it accelerated away until it disappeared.","Country":"United States","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"00:05:00","Object Shape":"Oval","Tags":"City","Date Submitted":"07/03/2011 08:57 UTC","trends":["There have been 17 other sightings in Cedar Rapids","There were no other sightings in Cedar Rapids on or around July 2nd 2011"],"Log Number":"US-07032011-0024","divs":["Sighting Details I was visiting a friend in Stanwood, Iowa. We were outside at around 10:00 p.m on a clear night playing with the kids when I noticed a white light moving across the sky from the southwest. I asked my friend if he could identify the object as it didn't look like a plane or any other object I had ever seen. Then the object stopped and remained stationary for about five minutes as we both watched in awe. I noticed that it was oval shaped and by now was a deep orange color in the center and darker red toward the outside. It appeared that the object was surrounded by a red halo as it emitted rays of red light. Then in a blink of an eye it accelerated into the southern sky as it got smaller and then vanished into the distance. We were both stunned and amazed at what we had seen and we talked about it until my friend finally went to bed at around 1:30 a.m. I stayed up another hour scanning the sky in hopes of seeing the object again, but it never reappeared."],"Region":"Iowa","Longitude":"-91.659903","Weather Factors":"None","Disposition":"Unknown","Latitude":"41.98608","Date of the Event":"07/02/2011 10:00 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.98608,+-91.659903(29888)&iwloc=A&hl=en\"> mufon case (29888) map </A>"}