{"Tags":"City","Date Submitted":"07/04/2011 12:33 UTC","files":["/var/www/straped/mufon/html2text/29899.html.txt","/var/www/straped/mufon/org/29899.html"],"Country":"United States","Summary":"8 to 12 glowing lights lined up in sky","City":"Undisclosed","Object Features":"Undisclosed","Longitude":"-89.393788","Case Number":"29899","Viewing Distance":"Unknown","Object Shape":"Sphere","Object Flight Path":"Undisclosed","Source":"MUFON","Log Number":"US-07042011-0002","trends":[""],"divs":["Sighting Detailsjuly 3rd, fireworks going off in the neighborhood, had steaks on the grill and went out to pull them off, i looked northeast low on the horizon and could not believe what I saw, I opened the sliding glass door and called for my wife, we both stood on the deck and witnessed I say 12 she says 8 glowing objects way off in the distance, I mentioned to her that they were all way too close together to EVER be man flown aircraft, we sat watching them slightly move about, sometimes their light would completely turn off, othertimes it would cycle thru red, white, blue and green. after about 2 minutes ALL of them were gone. these in no way could have been aircraft or fireworks, a firework at somepoint would HAVE to give in to gravity and descend, these continued to rise out of view, slowly but steady. Much to my surprise one appeared to be right over my neighbors roofline, I grabed the video camera for this one! it traveled northwest over the house, another neighbor who was shooting roman candles into the nightsky appeared to \"want\" to hit the object, his aim seemed pretty good but never reached it's height. I don't know if he was 4 or 5 houses down from me, tomorrow I'm gonna knock on some doors untill I find who it was and interview him of what he saw and thought."],"Weather Factors":"Unknown","Region":"Illinois","Latitude":"40.634915","Date of the Event":"07/03/2011 10:15 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.634915,+-89.393788(29899)&iwloc=A&hl=en\"> mufon case (29899) map </A>"}