{"Disposition":"Hoax","Region":"Nevada","files":["/var/www/straped/mufon/html2text/2989.html.txt","/var/www/straped/mufon/org/2989.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.123996,+-115.165956(2989)&iwloc=A&hl=en\"> mufon case (2989) map </A>","Date of the Event":"04/23/2004 11:28 UTC","Sighting Duration":"01:59:00","Latitude":"36.123996","Longitude":"-115.165956","Source":"MUFON","Summary":"My Name Is SK and Im Witnessing UFOs Daily in Las","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc","Date Submitted":"04/23/2004 11:28 UTC","Weather Factors":"Unknown","Log Number":"","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around April 23rd 2004"],"Country":"United States","City":"Las Vegas","Object Features":"Dome","Object Flight Path":"Unknown","divs":["Sighting DetailsThis is going to be slightly difficult because its been an ongoing thing foralmost 4 months now. It began in February of 2004. A friend of mine kepttelling me about a planet in the night sky that would appear after hours afterthe sun set and would disappear around 1000 P.M. I started to take numerousphotographs and from that point on I have seen so many sightings that I canteven remember all the craft and different scenarios Ive seen. My occurrence isdaily. I feel like since I have seen these craft and have some spectacularphotographs I have either gotten their attention or have irriteted them or both. Either way I am considering myself on the surveillance list of whoever pilotthese craft I have observed. To date there have been no abductions or contact. They do follow me everywhere I go and even have followed me out of the state ofNevada. I have photographs of what should be an airplane but when the photocomes back its a disc projecting a hologram. Since I have photos like this I amwondering if they feel threatened that in some way I have blown their cover. The only thing is that when I go to film them they for some reason do not havethe ability to cloak like they would like which leaves them vulnerable tophotographs. I have aquired quite an arsenal of photos and information based onwhat I have observed. I have photos I have enhanced to see what is there butthey are also in original form so they can be analyzed."],"Case Number":"2989"}