{"files":["/var/www/straped/mufon/html2text/29906.html.txt","/var/www/straped/mufon/org/29906.html"],"Weather Factors":"None","Log Number":"US-07042011-0009","trends":["There have been 52 other sightings in Lee's Summit","There were no other sightings in Lee's Summit on or around July 3rd 2011"],"Object Shape":"Fireball, Other, Unknown","Object Features":"Window(s), Appendage(s)","Country":"United States","Region":"Missouri","Latitude":"38.922703","Case Number":"29906","Disposition":"Unknown","City":"Lee's Summit","Tags":"City","Date Submitted":"07/04/2011 01:31 UTC","Longitude":"-94.377236","map":"<A HREF = \"http://maps.google.com/maps?q=38.922703,+-94.377236(29906)&iwloc=A&hl=en\"> mufon case (29906) map </A>","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Summary":"Bright orange light","divs":["Sighting DetailsI was out in my front yard at about 10 p.m. this evening watching the neighborhood fireworks going off. As I turned to go back in the house, I spotted a bright orange light moving slowly across the sky coming from the northwest. At first I thought it might be an airplane, but the light was too big, and the object was moving much too slowly to be a plane, and there was no sound. It came to a dead stop, and I must admit, chills ran all through me, I couldn't believe what I was seeing. It hovered for a few minutes, then it moved off to the east and went behind some clouds. As it hovered I noticed that on each side of the orange light there was dimly lit rectangular windows. I did not have my camera with me, so I did not get any pictures. Did anyone else see this object around 10 p.m. on July 3, 2011 over the Kansas City area? I can't believe I am the only one who saw it, since there were so many fireworks going off and people would be looking upwards in the sky. The object would have passed over I-70 and Noland Road and would have been plainly visable from the ball park (although I don't think there was a game tonight)"],"Viewing Distance":"101-500 Feet","Date of the Event":"07/03/2011 10:00 UTC","Source":"MUFON"}