{"Latitude":"29.729953","Date of the Event":"07/03/2011 10:10 UTC","Summary":"Very bright triangular object on which lights turned off but still seen before fading out.","Disposition":"Unresolved","Weather Factors":"Unknown","City":"Bandera","Longitude":"-99.066716","Object Shape":"Triangle","Object Features":"Undisclosed","divs":["sighting detailsit was about 10 after 10 pm this evening, july 3, 2011 when i stepped outside to look at the sky. it was a beautiful, clear sky filled with stars. a few seconds after looking up i saw a very bright object moving from north to south. it was moving steady and as it passed overhead, it appeared to have a triangular shape. there appeared to be two, bright lights shining side by side and there were no other lights. lights were steady with no blinking. there was no sound whatsoever. the object moved at a steady clip but there was no way to know how high it was. at arms length it appeared to be about 1\\2 the size of my little fingernail. the entire sighting lasted maybe 15 to 20 seconds. as it reached about 40 degs. above the southern horizon the lights went out. it was as though a switch was turned off. i could still see a faint object of the same size but it quickly moved off and disappeared. i found out when i came in that my wife, who was in the backyard walking the dog, saw it also but thought it was a plane. i was in the air force for 4 years and i've seen many things in the sky over the past 70 yrs including a broken up satellite re-interring the atmosphere overhead in hawaii, but i've never seen anything like this. from now on when i go out, i'll take the camera."],"files":["/var/www/straped/mufon/html2text/29905.html.txt","/var/www/straped/mufon/org/29905.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.729953,+-99.066716(29905)&iwloc=A&hl=en\"> mufon case (29905) map </A>","Object Flight Path":"Undisclosed","Country":"United States","Case Number":"29905","Viewing Distance":"Unknown","Log Number":"US-07042011-0008","Sighting Duration":"00:00:20","trends":["There have been 3 other sightings in Bandera","There were no other sightings in Bandera on or around July 3rd 2011"],"Source":"MUFON","Date Submitted":"07/04/2011 01:31 UTC","Tags":"City","Region":"Texas"}