{"Disposition":"Unresolved","Case Number":"29909","Source":"MUFON","Latitude":"42.153914","Date Submitted":"07/04/2011 01:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.153914,+-88.136189(29909)&iwloc=A&hl=en\"> mufon case (29909) map </A>","Log Number":"US-07042011-0012","Object Shape":"Triangle","Region":"Illinois","Country":"United States","City":"Barrington","files":["/var/www/straped/mufon/html2text/29909.html.txt","/var/www/straped/mufon/more/29909_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/29909.html"],"Longitude":"-88.136189","Date of the Event":"07/03/2011 09:30 UTC","Weather Factors":"None","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Summary":"Eight Triangular Bright Orange Lights Over Barrington, IL","trends":["There has been one other sighting in Barrington","There were no other sightings in Barrington on or around July 3rd 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsJust before a July 3rd fireworks display in Barrington IL there were 8 triangular shaped bright orange lights up in the sky. They moved slowly across the sky and lasted about 8-10 minutes until they started to fade away. It was an unbelievable sight! At first we all throught they were airplanes in the distance flying together to see fireworks but as they grew closer we realized that they were just bright orange lights. It was kind of creepy.. looked as if they were a scene out of \"Independece Day\" as if they were getting ready to come say Hi from Outerspace!!! It was AWESOME!!! Upon our arrival home from the fireworks (approx 10:40pm)and the complete opposite direction where we first saw the 8 lights.. we saw 2 additional orange lights that where right behind one another and faded out together. It was quite the sight!!!! I did happen to get a picture but I have an old iphone and the pic is a little blurry but at least we have one!!!"]}