{"trends":["There have been 12 other sightings in Woodstock","There were no other sightings in Woodstock on or around March 27th 2004"],"City":"Woodstock","Object Features":"Undisclosed","Date of the Event":"03/27/2004 04:25 UTC","Weather Factors":"Unknown","Sighting Duration":"01:00:00","Latitude":"34.101487","Disposition":"IFO","Longitude":"-84.519375","Country":"United States","files":["/var/www/straped/mufon/html2text/2991.html.txt","/var/www/straped/mufon/org/2991.html"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=34.101487,+-84.519375(2991)&iwloc=A&hl=en\"> mufon case (2991) map </A>","Region":"Georgia","Source":"MUFON","Case Number":"2991","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Tags":"City","Summary":"Observed two, silent, metallic spheres","Log Number":"","Date Submitted":"03/27/2004 04:25 UTC","divs":["Sighting DetailsI would not like my name to be published, but I would like to be contacted if itis helpful to your investigation, or if you can shed some light on what Iobserved. It is easiest to reach me by email at the email address above.This observation took place on Saturday March 27, 2004 at approx. 4.25pm, andcontinued for about 30- 40 minutes. The sky was partly cloudy w scatteredcumulus clouds and it was an otherwise bright and sunny Spring day. I had takena tire to be fixed at the Wood and Fullerton Goodyear Tire store at 2465 TownLake Parkway in Woodstock Ga. This is near my home and is in an area with lotsof businesses. As they worked on my tire, I went outside to enjoy the Springweather. I was looking up at the sky and happened to see the object. What Iobserved, to the north and east, was a slient, metallic, spherical objecthovering, seemingly at an altitude slightly above the cloud tops in the distant.It is difficult to estimate its distance and size as there were no easyreference points. The object was silent and motionless. I observed it forseveral minutes and it may have drifted slightly. It was finally covered by alarge cloud. As I tried to observe it again, and after about 5-10 minutes sinceit had disapppeared behind the cloud, I observed another, identical object tothe east but still nearby to where I had seen the first object. It took had thesame characteristics as the first object, and might even have been the firstobject. I observed it too for several minutes with clouds occasionally andtemporarily covering it as they passed. This entire observation was a half houror more. The objects were metallic and silent. The closest conventional objectI could relate them to would be a ballon. Unlike ballons Ive seen, theseobjects seemed to be almost motionless, possibly drifting very slightly. Thefact that clouds drifted by made it difficult for me to discern if the objectsever really moved very much. This motionlessness seemed odd to me. No othersseemed to notice the objects, though in fairness, to do so one would have tohave looked at that particular part of the sky to see the objects. I haveexcellent distant vision and happened to first notice the first object when Iwas looking up at the beautiful Spring sky. During the observation I noticed 3-4jet aircraft at much higher altitudes than the object, and one small privateplan travelling to the East at about the same apparent altitude as the secondobject, but not near the object. After about 30-40 mins. I went inside the storeas my tire was ready. I was struck by this event enough to mention to the storemanager that there was some interesting arial"]}