{"Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.767096,+-97.792894(29912)&iwloc=A&hl=en\"> mufon case (29912) map </A>","Latitude":"32.767096","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"1-2 lights, orange/white, no strobes, totally silent, too fast for a balloon!","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","divs":["Sighting DetailsI saw it coming from the west, heading northeast. It was way out, but I thought I kept seeing one light, then two. I even closed one eye to make sure my eyes were not playing tricks on me. I still couldn't tell ya if it was one light or two. I see jets and planes pass every night as I watch the stars before bed, but this one caught my eye. I have never reported anything. Ever. I was smoking a cigarette as that is my usual routine before bed. I usually smoke about 3. I live near of Bethel Road and Interstate 20. It's plenty dark out here at night. Every few months I get to see a satellite when the conditions are right. I thought this was a satellite at first, then noticed it was not taking an orbit course. So I kept watching. It started a direct eastward path. It must have passed me at about 5 to 10K feet up, and 3-5 miles to the north. TOTALLY SILENT. I can hear cars on the road for miles out here for miles, no exaggeration. It was moving at roughly 100-150 mph. I am judging this by the speeds I see Cessnas go by. It was way too fast for a balloon, and too silent for a plane or jet. I kept watching in awe, but it just kept going, silently. I looked down at my cigarette and it was about a puff away from being out. That is how I judged the time. It passed the house a few miles to the north and I kept trying to get a focus on it with one eye. It passed on silently head almost due east with a slight northward aim. No strobes, no noise. Could it be Carswell JRB with something interesting. Unsure, but I can tell you the Fourth of July would be no time to be playing with something like that. Everyone is looking up and out and about."],"Longitude":"-97.792894","Date of the Event":"07/04/2011 01:19 UTC","Object Flight Path":"Path with directional change","Case Number":"29912","City":"Weatherford","files":["/var/www/straped/mufon/html2text/29912.html.txt","/var/www/straped/mufon/more/29912_submitter_file1__WhatIsaw.png","/var/www/straped/mufon/org/29912.html"],"Object Shape":"Boomerang","Date Submitted":"07/04/2011 03:53 UTC","Viewing Distance":"Over One Mile","Log Number":"US-07042011-0014","trends":["There have been 9 other sightings in Weatherford","There were no other sightings in Weatherford on or around July 4th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Country":"United States","Tags":"City"}