{"trends":["There have been 2 other sightings in Lumberton","There were no other sightings in Lumberton on or around June 29th 2011"],"files":["/var/www/straped/mufon/html2text/29911.html.txt","/var/www/straped/mufon/org/29911.html"],"City":"Lumberton","Country":"United States","Log Number":"US-07042011-0013","Region":"Texas","Longitude":"-94.199629","Disposition":"IFO","Tags":"City","Source":"MUFON","Summary":"I saw a light move at a extreme speed and stop suddenly","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Shape":"Circle, Star-like","Viewing Distance":"Over One Mile","Sighting Duration":"00:00:02","Date of the Event":"06/29/2011 10:30 UTC","Object Features":"Unknown","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=30.265766,+-94.199629(29911)&iwloc=A&hl=en\"> mufon case (29911) map </A>","Case Number":"29911","divs":["Sighting DetailsI was in Lumberton,Texas listening to a friend of mine's new band. I decided to go outside and have a smoke. Another friend followed me outside also. We were talking about the band and other BS when she ask me which way was north. So I decided to show her the North star. After showing her the star I looked toward the west horizon and was looking up up at about a 60 degree angle. This is when a bright light suddenly appeared out of nowhere. It was about 25 percent larger than most the stars in the sky. It was really quite bright, almost like a full moon but brighter. It stayed in one spot for a fraction of a second then moved to the right. It moved in a northeastern direction, at a speed I have never experience. It suddenly stopped and just hovered for a second, then its light went out. When it moved it left a trail of light as wide as the object also. I searched for it for about another half hour but never say it again. The reason I mentioned the speed was because I worked with F14 Tomcats and other fighter jets when I was in the Navy. I have never seen something with this kind of speed. It was like something out of Star Trek. It happened so fast I wasn't able to get any pictures. It still boogles my mind about this experience, I was always a little skeptical about these things but not anymore."],"Latitude":"30.265766","Date Submitted":"07/29/2011 02:46 UTC"}