{"Latitude":"41.581507","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"07/04/2011 10:46 UTC","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"US-07042011-0020","Case Number":"29919","City":"Tinley Park","Longitude":"-87.780554","files":["/var/www/straped/mufon/html2text/29919.html.txt","/var/www/straped/mufon/org/29919.html"],"Object Flight Path":"Undisclosed","Summary":"To our west we saw 3 glowing red objects forming a triangular shape in the sky below the clouds","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband, 2 children and I were walking home from getting ice cream on July 3,2011.There were fireworks going off around us so as we walked we observed them. We turned onto 84th Avenue and walked about a block up the street. My daughter then said to us, \"Look at the 3 airplanes.\" We looked to the west and saw just below cloud level, 3 illuminated red objects in a triangular pattern. (1 above,2 below) They were stationary and they seemed to be equidistant from each other. My family froze and watched in amazement trying to figure out what it was. I threw my water bottle to my husband and quickly took out my Iphone to take a picture. I took a picture. The objects were too far away for the picture to be visible. After about 2 minutes, the top illuminated light appeared to be moving to the left of the other 2 and disappeared from sight--possibly into the cloud cover. The remaining 2 stayed illuminated for about another minute then slowly dimmed and faded out at the same exact time. We waited a moment to see if they would return. As we continued walking home, we kept our eye on the sky and saw nothing more. When we got home, my husband and I both went online to see if anyting had been reported. Neither one of us knew the other was looking up this information. What we saw clearly \"freaked\" us out!"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.581507,+-87.780554(29919)&iwloc=A&hl=en\"> mufon case (29919) map </A>","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around July 3rd 2011"],"Disposition":"Unresolved","Object Shape":"Circle, Sphere, Triangle","Date of the Event":"07/03/2011 09:35 UTC","Country":"United States","Region":"Illinois"}