{"divs":["sighting detailsi had just gotten home and was taking stuff inside making trips, when i was drawn to a bright unblinking star somewhat north if me in the sky, heading east, probably in the skies over northern palm beach or orlando. it had a white color light and was moving at the speed of an aircraft...however, aircraft all have blinking lights on the wings, fuselage etc. i used to be in the airline industry so i know this. the thing that made this highly, highly unusual was while i was watching, the light turned dim as if it was turned down, for around three seconds...then it completely extinguished. i never panicked nor nothing, i just watched, wondering what it was. my camera really does not do very well in night time sky shots so i never bothered to get it. aircraft do not do behave like that. satellites do not do this because the lights reflected from them would be basically constant especially since it is heading east. it would have picked up the sun's reflection that high up and remain lit. i think i always knew that i might see a strange sky object\\occurrence in my lifetime, i just thought it might have been more dramatic than this, nevertheless, this was unusual."],"Country":"United States","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","City":"West Palm Beach","Date of the Event":"07/03/2011 09:36 UTC","Latitude":"26.720942","files":["/var/www/straped/mufon/html2text/29913.html.txt","/var/www/straped/mufon/org/29913.html"],"Date Submitted":"07/04/2011 04:33 UTC","Summary":"Bright unblinking star heading east then extinguished","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around July 3rd 2011"],"Viewing Distance":"Over One Mile","Weather Factors":"None","Log Number":"US-07042011-0015","Tags":"City","Object Features":"Unknown","Object Shape":"Star-like","Source":"MUFON","Longitude":"-80.045185","Case Number":"29913","map":"<A HREF = \"http://maps.google.com/maps?q=26.720942,+-80.045185(29913)&iwloc=A&hl=en\"> mufon case (29913) map </A>","Region":"Florida","Disposition":"IFO"}