{"Date of the Event":"07/03/2011 11:00 UTC","Source":"MUFON","Date Submitted":"07/04/2011 10:30 UTC","trends":["There have been 10 other sightings in Rochester Hills","There were no other sightings in Rochester Hills on or around July 3rd 2011"],"Sighting Duration":"00:15:00","files":["/var/www/straped/mufon/html2text/29918.html.txt","/var/www/straped/mufon/org/29918.html"],"Viewing Distance":"Over One Mile","Weather Factors":"None","Country":"United States","Object Features":"Unknown","Latitude":"42.667796","Object Shape":"Circle, Star-like","Disposition":"Unknown","Object Flight Path":"Path with directional change","divs":["sighting detailswe live in a suburban area. i went outside just before 11:00pm sunday night. it was a calm, clear night. i locked my shed, went and turned on the garden hose so i could water the tomato plants, when i saw an orange red bright light moving slowly above the tree line. because it was july 3rd and people were lighting fireworks, i thought maybe it was some kind of lantern or something. then i saw another one following behind it. i watched them move slowly across the sky when 3 more appeared single file moving on the same route. the first 2 turned, single file, and started moving up & away from my vantage point. i ran inside and got my wife to come out to see them. see made it out in time to watch the first 2 slowly disappear from sight and the next 3 make the same turn and start to go up and away from us. she said \"are they planes or helicopters\"? i said \"they have no flashing lights & no sound \". all this time i was trying to get my cel phone's camera\\video to work but i couldnt see anything in the viewer(stupid phone!) i then called my daughter in iowa to tell her what we saw. i let her talk to her mother so she would't think her old man had flipped out. as my wife was telling her what we saw, 2 more appeared, traveling the same route. the last of the 7 was larger & brighter the the preceding 6. i ran into the house and got my hunting rifle with a 9x scope to look at the last 2 ufo's and all i could see were larger brighter orange red lights. my wife proceded to described the sighting to my daughter until the last 2 disappeared. i would estimate this sighting took a good 12-15 minutes in duration. i know with all the people out lighting fireworks, other people had to see these and hopefully they know how to operate there cell camera\\video! i looked at my phone & the call to my daughter lists 11:01 pm and it lasted 8m 43sec. then i remembered i had turned on the garden hose & proceded to water the plants & freak-out!"],"Region":"Michigan","City":"Rochester Hills","Summary":"7 UFO's moving single file July 3, 2011 11:00PM in Rochester Hills Michigan","Longitude":"-83.144932","Tags":"City","Case Number":"29918","Log Number":"US-07042011-0019","map":"<A HREF = \"http://maps.google.com/maps?q=42.667796,+-83.144932(29918)&iwloc=A&hl=en\"> mufon case (29918) map </A>"}