{"files":["/var/www/straped/mufon/html2text/29923.html.txt","/var/www/straped/mufon/org/29923.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"CA-07042011-0025","Date of the Event":"07/01/2011 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.064797,+-77.848941(29923)&iwloc=A&hl=en\"> mufon case (29923) map </A>","divs":["Sighting DetailsWhile waiting for fireworks to begin to celebrate Canada Day celebrations, I was recording with my digital still camera the location of the expected fireworks, when my children noticed 3 floating spheres approx 50 feet ?? in the sky to the right of us. They were floating silently and slowly. They were lit with an orange glow, so that I could not actually see the objects, just the light. I looked closely at them to discern if they were balloons etc, but they did not look like anything I have ever seen. I filmed the second set of 3 objects. I did not film the first set as I was trying to figure out what they were, and I was trying to conserve my SD card memory space for the fireworks. When I noticed the 2nd set, I filmed it, as they were quite unusual. Both sets of objects were \"floating\" to the right and behind us. Both sets were in the same configuration, and maintained the configuration throughout the sighting. Balloons would not float together, especially 2 sets. I stopped filming due to the fact that the fireworks were beginning, and the objects floated away. I'm not sure what these were, but they were unlike anything I have seen. Near the end of the video, the black vertical line is a wooden telephone post. I have included the video for your evaluation. Please let me know via email what you think of this. Best Regards"],"Summary":"2 sets of 3 floating spheres","City":"Bancroft","Country":"Canada","Tags":"City","Disposition":"Unresolved","trends":["There has been one other sighting in Bancroft","There were no other sightings in Bancroft on or around July 1st 2011","This sighting has never been favorited.",""],"Source":"MUFON","Viewing Distance":"21-100 Feet","Object Shape":"Sphere","Object Features":"None","Latitude":"45.064797","Longitude":"-77.848941","Object Flight Path":"Straight-line path","Case Number":"29923","Region":"Ontario","Date Submitted":"07/04/2011 11:43 UTC"}