{"City":"Central Islip","Sighting Duration":"Undisclosed","Case Number":"29929","Summary":"2 Star like objects appeared over the South Western Horizon above a fireworks show at the little Ducks baseball stadium","Weather Factors":"Light","map":"<A HREF = \"http://maps.google.com/maps?q=40.790654,+-73.201781(29929)&iwloc=A&hl=en\"> mufon case (29929) map </A>","Object Features":"Unknown","Object Shape":"Circle, Cross, Flash, Star-like","Longitude":"-73.201781","Date of the Event":"07/03/2011 11:30 UTC","divs":["Sighting DetailsAt about 11.30 pm on Sat, July 3rd 2011.My 16 year old son and I was sitting on our front steps facing south west looking at the Fireworks display about a half mile away at the Long Island, NY. Ducks baseball stadium, at about 5 minutes after the show the smoke began clearing. I saw 2 White lights appearing at a (4)magnitude, they were about a hand fist appart of each other and then began glowing brighter and not moving, I told my 16 year old son that was sitting next to me to look up and see the 2 lighted objects glowing brighter and it stayed at it's brightest at about a (-1) mag.and Twinkling for about a minute and then slowly fading away into noting for about 10 seconds, The Time of the 2 White lights appearing in the sky and then fading away lasted for about 3 minutes.My son and I discussed the sitting and agreed that it was not two Stars, because there were other stars visible in that area.It appeared together, and then disappeared together into noting without moving left or right, nor up or down.I have seen other strange lighted objects moving along the sky before, but this was assuring of my first close up UFO, Being amazed at this siteing I forgot to take a picture with my cellphone, but I will be ready in the future.I hope that someone else saw something in my area and contact MUFON to confirm this siteing."],"trends":["There have been no other sightings in Central Islip","This sighting has never been favorited."],"Disposition":"Unknown","Country":"United States","Date Submitted":"08/08/2011 06:34 UTC","Region":"New York","Log Number":"US-08082011-0011","Tags":"City","Source":"MUFON","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Straight-line path","Latitude":"40.790654","files":["/var/www/straped/mufon/html2text/29929.html.txt","/var/www/straped/mufon/org/29929.html"]}