{"Disposition":"Unknown","Object Shape":"Circle, Flash, Oval","Case Number":"29934","Date Submitted":"07/04/2011 04:50 UTC","Summary":"Bright White Light Orb Seen over Myrtle Beach, SC","Sighting Duration":"Undisclosed","divs":["sighting detailsi was sitting on the beach at north myrtle beach, sc around 9:54pm looking south east. i looked towards the sky to my left which is (east) and noticed a bright light in the sky. i thought it was a plane as there are usually planes coming into the airport with their lights on. i then looked back about 3 seconds later and focused more attention on the light, but i did not see any blinking lights so it could have not been a plane. i grabbed my camera and tried to take some video. sorry the video is so shaky but it was the first time i had used a video camera at night and as you probably already know its not easy to focus and remain still without a tripod. the camera is a sony hdr cx160. it has a 30x optical zoom and a 350x digital zoom. i was using the 30 frames per sec setting on hd 1080i. as you can see from the video when i get the darn thing into view the orb or light is very bright. it's actually better to view the entire video in slow motion frame by frame. once i finally got the light into view it appeared to accelerate away from me very fast so i zoomed in. it appeared on the screen to come back into view (from the zoom) and then started to disappear again further away from me. i then used the digital zoom at this time but the image got blurry as you can see from the video and then disappeared. not sure what it was but i did not see any blinking lights on it as a plane would have. any ideas? i also have a video that's about 50 meg. where do i send it to? [link moved to additional evidence section\\cms\\tg]"],"Longitude":"-78.877704","City":"Myrtle Beach","Tags":"City","Weather Factors":"Unknown","Country":"United States","Date of the Event":"07/01/2011 12:00 UTC","Object Features":"Other","Source":"MUFON","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around July 1st 2011","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.69225","files":["/var/www/straped/mufon/html2text/29934.html.txt","/var/www/straped/mufon/more/29934_submitter_file1__20110701215438(46).jpg","/var/www/straped/mufon/org/29934.html"],"Log Number":"US-07042011-0035","Region":"South Carolina","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.69225,+-78.877704(29934)&iwloc=A&hl=en\"> mufon case (29934) map </A>"}