{"map":"<A HREF = \"http://maps.google.com/maps?q=38.563118,+-85.539683(29940)&iwloc=A&hl=en\"> mufon case (29940) map </A>","Date Submitted":"07/04/2011 10:21 UTC","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Case Number":"29940","Longitude":"-85.539683","Tags":"City","Object Shape":"Circle","Summary":"Bright orange light","Weather Factors":"Unknown","Region":"Indiana","Disposition":"Unknown","trends":["There have been 5 other sightings in New Washington","There was one other sighting in New Washington on or around July 4th 2011"],"Source":"MUFON","Log Number":"US-07042011-0041","Viewing Distance":"Unknown","Latitude":"38.563118","files":["/var/www/straped/mufon/html2text/29940.html.txt","/var/www/straped/mufon/org/29940.html"],"divs":["sighting detailsi went out on my back porch to smoke( faces east) when my neighbor across the street set off an arial firework. i got up to see if he would set off somemore when i turned to the east and saw a bright orange object in the sky in a east north east direction ( toward madison). i thought that it might be a hospital helicopter since that is the path they take when going to the louisville, ky. hospitals. after a minute, i noticed that it wasn't moving very fast, so i went inside and grabbed my binoculars(10x50) to look at it. i noticedthat there was no flashing white lights, nor was there any green and red lights as required by faa. i opened the door and yelled at my wife to grab the camera and come outside. she just came outside and ask what and i said get the camera. by the time she grabbed the camera and came back outside, the object disappeared. i asked her what time it was (she had a cell phone) and it was 9:50pm. i know it wasn,t fireworks for i was also watching my neighbor across the field (approx. 1\\2 mile away) and his fireworks were not making it over the trees in my yard. according to my eastimates it was approx. 35 - 45 degrees (when i first saw it to the time it disappeared) in the sky. i could hold up a pea and it would cover it at arms length. thanks name deleted fg"],"Country":"United States","City":"New Washington","Object Features":"Unknown","Date of the Event":"07/04/2011 09:46 UTC"}