{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.351691,+-96.545659(29944)&iwloc=A&hl=en\"> mufon case (29944) map </A>","Case Number":"29944","Sighting Duration":"00:01:30","City":"Anna","Longitude":"-96.545659","Object Shape":"Triangle","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","Summary":"it was in a clear blue sky,no clouds,shiny triangle","Object Features":"None","Tags":"City","Latitude":"33.351691","divs":["Sighting DetailsI was heading on 419, easterly direction (?), not good with that. Came to the intersection of 419 & 455 when I turned my head to look at the road and to see the bend up a ways to see if anyone was coming. When a silver object caught my eye, at first I thought it was a plane, coming towards me,then it stopped,no movement- at all. It would be hard not to see it if you looked up,it was overly shiny silver, triangular shaped with the front tip pointed the direction I just came from. It seemed to be about 1000ft up, visibility was clear, no clouds anywhere. I sat there and watched,I was thinking, with amazement, another flying saucer in less than 5 years? It felt like a minute to a minute and a half, when all of a sudden, before my eyes, it banked up and was gone. I got out of my car to see if it or a plane was anywhere near, I had the only craft within eyesight. This was 10:31-10:33 a.m. on a saturday morning. I picked up my phone and put in a call to Rory Roach,he is the man I sent my last sighting to, but he was not available & no message could be left. Whatever happened to the flying saucers of the 1950's, that look like their namesake? Do those kind still exist or are they like us and get new crafts all the time?"],"files":["/var/www/straped/mufon/html2text/29944.html.txt","/var/www/straped/mufon/org/29944.html"],"Date of the Event":"07/02/2011 10:31 UTC","Region":"Texas","Disposition":"IFO","Weather Factors":"None","Date Submitted":"07/04/2011 11:23 UTC","trends":["There has been one other sighting in Anna","There were no other sightings in Anna on or around July 2nd 2011"],"Log Number":"US-07042011-0044","Source":"MUFON"}