{"Date Submitted":"07/04/2011 10:47 UTC","Summary":"Bright UFO Flying over Crowley, TX","Date of the Event":"07/04/2011 09:15 UTC","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.585055,+-97.353307(29942)&iwloc=A&hl=en\"> mufon case (29942) map </A>","Object Flight Path":"Undisclosed","Longitude":"-97.353307","Log Number":"US-07042011-0042","Case Number":"29942","trends":["There have been 3 other sightings in Crowley","There were no other sightings in Crowley on or around July 4th 2011"],"Latitude":"32.585055","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Tags":"City","City":"Crowley","Disposition":"IFO","Object Shape":"Circle, Disc, Fireball, Oval, Sphere, Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn July 4th 2011 at approximately 9:15pm CST I was standing out on the stairs videotaping the fireworks with my young daughter when all of the sudden I see this bright object appear out of nowhere. It was really bright and shaped like a big circle or disc maybe and appeared to be glowing. I immediately called my husband out to witness the event because I knew that this was no plane craft or any firework debris...this was a UFO! The ufo was moving southeast across the sky, had no sound at all, and not once did the ufo flash or change colors, it was like this great ball of light. In addition the ufo did not move in a straight line it was like it was descending as it was moving across but it appeared to be swaying! I was recording at the time so I managed to get film of this event although I have looked at the playback yet, it lasted about 5 min until it finally dimmed then dissapeared in the distance. Im sure I cant be the only one to witness this event being that everyone looks to the skies on July 4th!!! If not a ufo, then was it a missle or something??? Someone please explain!!!"],"files":["/var/www/straped/mufon/html2text/29942.html.txt","/var/www/straped/mufon/org/29942.html"]}