{"Case Number":"2994","Summary":"black rectangle in the air","files":["/var/www/straped/mufon/html2text/2994.html.txt","/var/www/straped/mufon/org/2994.html"],"Sighting Duration":"00:00:59","Disposition":"Unknown","Longitude":"-91.830693","Object Shape":"Square, Rectagular","City":"dillards ferry","Date of the Event":"04/25/2004 03:27 UTC","Object Features":"Unknown","trends":["There have been no other sightings in dillards ferry","This sighting has never been favorited."],"Region":"Arkansas","Object Flight Path":"Stationary","Log Number":"","Date Submitted":"04/25/2004 03:27 UTC","Viewing Distance":"Over One Mile","divs":["Sighting DetailsOn April 25, 2004 me and my mom went to the river to take pics of it since it was flooded. We walked under the bridge toward the other part of the river where the restrooms are. I then took a few pics of the river. It was a very clear day, wind was blowing but not that hard. I walked up to the restrooms and saw a small field, and in the background, the mountain hills. I love the outdoors, so I took a picture. Well, then I noticed I had gotten the cement in the pic, so I stepped to my right side and took another pic. After I took that pic we decide to head back to the car. Well, I took some more pics, then we left. I got home and started to download them to my computer. When I got to the field pictures, I noticed a black rectangle in the picture under the one cloud in the sky. That was the first picture I had taken of the field, so I was like - ok, a spot on my camera lens. Well, I then opened the second picture of the field, and it was clear as a bell - no spot on the picture from what I could tell. I then showed my parents and asked them what they thought, and they didn't know what it could be, so here I am writing to you about it. I do hope you can help me. Thank you for your time."],"Weather Factors":"Windy","Country":"United States","Latitude":"35.2067","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.2067,+-91.830693(2994)&iwloc=A&hl=en\"> mufon case (2994) map </A>"}