{"Country":"United States","Sighting Duration":"Undisclosed","Summary":"Hazy orange circular floating light","Weather Factors":"None","Latitude":"38.255605","Case Number":"29948","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around July 4th 2011"],"Object Features":"Unknown","Object Flight Path":"Path then hovering","City":"Louisville","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29948.html.txt","/var/www/straped/mufon/org/29948.html"],"Region":"Kentucky","Log Number":"US-07042011-0048","map":"<A HREF = \"http://maps.google.com/maps?q=38.255605,+-85.755796(29948)&iwloc=A&hl=en\"> mufon case (29948) map </A>","divs":["Sighting DetailsWe were setting off fireworks and they were going off all around us in the neighborhood so we were looking in all directions. One of us noticed a light in the sky that appeared larger than a star (3-4 times larger in diameter than an average star). It was circular in shape and was the orangish color of a street lamp. The light it emitted seemed to emanate from the object in an orangish hazy glow. While we were looking at it we initially thought it was an airplane, but there were no flashing lights on it and it's movement was not that of a plane. It looked to be heading towards us and then suddenly moved left and then right, left and then right. While it was doing this it was moving side to side in a way that I've never seen ANY aircratft do. It appeared to float. After it stopped moving from side to side, it continued moving towards us, slightly to the right. Once we pulled out our camera to video it, it slowly (about 10 seconds) dimmed out. It is without a doubt the weirdest I have ever seen. We all contemplated airplanes, fireworks, burning ambers from fireworks but there is no way it could have been that. For one, it was too high in the sky to be fireworks or firework debris (not to mention it didn't move like a firework or debris.) And number two, it certainly didn't move like a plane. Whatever we saw was certainly unidentifiable. There were plenty of other planes in the sky tonight, none looked or moved like this object and all of them had their flashing navigation lights which were easily visible."],"Longitude":"-85.755796","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Disposition":"IFO","Date Submitted":"07/04/2011 11:53 UTC","Tags":"City","Date of the Event":"07/04/2011 11:14 UTC"}