{"Tags":"City","Summary":"steady red light, moving slowly","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Santee","There were no other sightings in Santee on or around July 4th 2011"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.842093,+-116.970007(29959)&iwloc=A&hl=en\"> mufon case (29959) map </A>","Case Number":"29959","Date Submitted":"07/05/2011 01:37 UTC","files":["/var/www/straped/mufon/html2text/29959.html.txt","/var/www/straped/mufon/org/29959.html"],"Disposition":"Unknown","Longitude":"-116.970007","Latitude":"32.842093","Date of the Event":"07/04/2011 09:30 UTC","Object Features":"Unknown","divs":["Sighting DetailsWatching Santee Lakes fireworks from balcony. Reached for my drink, and noticed steady red light hovering to the east. At first I thought it was fireworks, but noticed it was not on an ascending or descending trajectory. Oblect seemed to be motionless at first, then noticed it slowly moving WSW, coming closer to my location extremely slow. Grabbed binoculars and seen that it was a steady red light, pulsating slightly. When viewed with naked eye, it seemed to pulsate every so often. My fiance got my camera and I took a few pictures. The objest was not an aircraft- I am retired military, and I know what aircraft navigation lights look like. The object did not strobe, it was a bright, steady red, seeming to pulse about every minute or so. It was also too stationary to have been either a fixed or rotary wing aircraft. As we were watching, it suddenly just blinked out or disappeared. May have been a balloon with a bright red light on it, but the light appeared pretty good size, so I doubt it was a balloon, unless it was a very good sized balloon. As far as I know, balloons have to have a strobe type nav light attached, and this was NOT strobing. Also, as I was trying to take a picture, my fiance said \"Look, another one\". As I turned, I seen a steady red light, very low, disappear behind the trees to the north,, northeast almost like it was on approach to Gillespie Field. Neither object seemed to emit any type of noise associated with either regular aircraft or jet propulsion. I will send pictures after I download them."],"Viewing Distance":"501 Feet - 1 Mile","Region":"California","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Shape":"Sphere","Log Number":"US-07052011-0011","Country":"United States","Weather Factors":"Does Not Apply","City":"Santee"}