{"files":["/var/www/straped/mufon/html2text/29950.html.txt","/var/www/straped/mufon/org/29950.html"],"Region":"Pennsylvania","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"Undisclosed","Date of the Event":"07/04/2011 09:30 UTC","Date Submitted":"07/05/2011 12:11 UTC","Tags":"City","Disposition":"Insufficient Data","Longitude":"-75.874208","Case Number":"29950","Log Number":"US-07052011-0002","Source":"MUFON","Country":"United States","Latitude":"41.251025","divs":["sighting details2 years ago exactly on july 4th and 5th, i was on my front porch looking southeast and this red light appeared coming over the mountains over our light towers. this is directly in the flight path of the wilkes-barre\\scranton international airport. so i've seen thousands of planes, helicopters, etc and i've never seen anything like this. then a couple weeks ago, i was on my back deck and at first i thought it was a plane far away coming in for a landing but as i watched it this red light it moved left, then stayed stationary for a few seconds then went straight up, the moved away from me westward and disappeared. a few minutes later i was putting out my cigarette butt and looked up and their is 2 red balls of light. they were stationary for a moment. then they went away from one another, then back towards one another, then the red ball on the right went quickly to the right, which would be north while the other stayed stationary, then it moved up rapidly, then to the left back towards the other red light then it went west and disappeared. then the other red light that was still stationary, went diagonally upwards and disappeared. then tonight, july 4 2011, i was outside about 9:30 waiting for our local fireworks display towards the west of my house and i was looking east toward our mountain and this red light starts coming from the east, then stops for a few moments then goes back towards the east. this happened 5 times in the next 2 1\\2 hours. when i saw it again, i went and got my neighbor next door, who just got home and she said she and her friend saw it before too. now i'm outside, this time with my binoculars and this was coming from the southeast over our local radio\\tv light towers and with the binoculars i could see 5 red lights underneath and it looked triangular in shape and it took a big arcing turn towards the east and disappeared. 2years ago, the same kind of object took a 45 degree turn and disappeared. not moving fast but just one second it was there and the next it was gone. i'm always looking up in the sky and we did have fireworks all over tonight but they're all done now and i saw it again. i'm looking for these red balls of lights now. with the naked eye you just see a red light, but tonight you could see more than one and they were not blinking like all aircraft do. i just know they are not any aircraft i have ever seen before."],"Object Flight Path":"Undisclosed","Summary":"2 weeks ago 2 red balls seen west of Wilkes-Barre, tonight 5 separate sightings","Sighting Duration":"Undisclosed","Object Shape":"Triangle","trends":["There have been 14 other sightings in Wilkes-Barre","There were no other sightings in Wilkes-Barre on or around July 4th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.251025,+-75.874208(29950)&iwloc=A&hl=en\"> mufon case (29950) map </A>","City":"Wilkes-Barre"}