{"Weather Factors":"None","Latitude":"46.49679","Date of the Event":"07/04/2011 11:15 UTC","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2011 12:46 UTC","divs":["Sighting Detailsfourth of July fireworks are winding down in the community--we live in town. I was outside letting the dog have a pee before bed and still heard the occasional pop or crackle...then a ring of orange lights passed over the top of my neighbors house across the street and came over my house--Ithought it was some piece of a firework or a chinese lantern or something. It was wierd the way it flew so quickly. I watched to see if it would flicker and burn out or if it would start to arc toward the earth---it just kept a steady cruising speed until it went out of sight over the houses behind us. No noise--I didnt have my glasses on so I couldnt tell if the ring of lights were surrounding a craft or if the thing was just an energy deal like the orbs are. I do know that it was wierd that the thing was cruising so steadily and there was really no breeze to speak of. I looked on the weather channel and the breeze is 6 km per hour south west. this thing was going straight East. I just said--oh...there's one! I have waited since I was 15 to see another UFO...the first one I saw was similar in that it cruised so deliberately. that was in California a lifetime ago lol!! I hope someone else saw what I saw tonight and writes in--let me know ok?"],"Source":"MUFON","City":"Sault Ste. Marie","map":"<A HREF = \"http://maps.google.com/maps?q=46.49679,+-84.337707(29951)&iwloc=A&hl=en\"> mufon case (29951) map </A>","Object Shape":"Circle, Star-like","Case Number":"29951","Tags":"City","Summary":"orange in color looked like it was made up of 5 or 6 lites in a circle like maybe a chinese lantern but it was going against the breeze--it was low -about 200 feet over the houses and cruised on by.","Object Features":"Unknown","Region":"Michigan","Viewing Distance":"101-500 Feet","Country":"United States","trends":["There have been 6 other sightings in Sault Ste. Marie","There were no other sightings in Sault Ste. Marie on or around July 4th 2011"],"Log Number":"US-07052011-0003","Disposition":"IFO","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/29951.html.txt","/var/www/straped/mufon/org/29951.html"],"Longitude":"-84.337707"}