{"Latitude":"28.540286","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=28.540286,+-81.371166(29954)&iwloc=A&hl=en\"> mufon case (29954) map </A>","Summary":"Fireball flying silently, then appeared stationary phasing in and out over the horizon.","trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around July 4th 2011"],"Sighting Duration":"Undisclosed","Object Shape":"Fireball, Star-like","Date Submitted":"07/05/2011 01:08 UTC","Region":"Florida","Longitude":"-81.371166","Case Number":"29954","files":["/var/www/straped/mufon/html2text/29954.html.txt","/var/www/straped/mufon/org/29954.html"],"Date of the Event":"07/04/2011 10:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Orlando","Log Number":"US-07052011-0006","Disposition":"Insufficient Data","Weather Factors":"Unknown","divs":["Sighting DetailsI just wrote a detailed description but when I tried to submit it an error occurred and it's now gone. I'm too frustrated now to re type it. So I will be very brief. I was in front of my building watching my neighbors fireworks, they had some awesome pyro so I kept my eye on the sky. It looked like a firework but it was flying over head on a northern course. It was a firey flame, yellow to orange in color. It traveled straight at air craft speed and was silent 500\"-25,000\" altitude. Later a similar light appeared above the tree line to the north... I went in side for an optic and went I got back outside it was gone. I saw it again at around the same spot. Appearing stationary it flickered and phased in and out until it disappeared. I was googling and found out this type of sighting was common on this holiday. I went back out side and saw another stationary light above the tree line this time to the north east. It was brighter and appeared to be closer, it too began to phase in and out until it vanished."],"Object Features":"None","Source":"MUFON"}