{"Country":"United States","Sighting Duration":"00:35:00","divs":["Sighting Details1. My neighbor and I were sitting outside watching fireworks. 2. I was watching the sky in addition to watching the fireworks. At 10PM we saw a steady round glow, which appeared to be yellowish in the center and surrounded by a red or orangish glow, larger than a star, steadily moving across the sky from east to southwest, to the south of us. Then we lost sight of it, as it got further away, whether it was too high up or too far west, we don't know. 3. It was odd, definitely did not have two or more lights which appear on planes. AT first we just thought maybe we couldn't see the other lights, because of the angle and that maybe it was just a small 2 passenger plane and that it was too far off to see good. We were fascinated with the sighting and discussing it, wondering what it might be. 4. At a distance, it appeared round and was continuously lit the whole time it was in view. We continued watching the fireworks, then almost exactly 15 minutes later, @ 10:15PM, another object identical to the first, appeared, traveling from the east (it appeared to come from the same exact direction as the first) traveling to the west, this time not as far to the south of us as the first object. Once again, it disappeared as it got further away. Then fifteen minutes later (10:30PM), another identical object appeared, this time going right over us. Then two more objects appeared one at a time within the next 5 minutes, each one traveling further to the northwest of us than the last. 10:30PM was the last sighting. We continued watching until about 11:10PM and did not see any other objects. On each occasion, the one preceding it would disappear before the next one would appear. 5. We were calm and curious. I mentioned the possibility of weather balloons, then UFOs because they seemed to be traveling with a purpose in mind. She was wondering at first if it was a search party for something, because they were all 5 traveling at different angles. 6. We lost sight of the objects because of distance."],"Date Submitted":"07/05/2011 01:56 UTC","Case Number":"29961","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=38.978209,+-95.23398(29961)&iwloc=A&hl=en\"> mufon case (29961) map </A>","City":"Lawrence","Object Shape":"Circle","trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around July 4th 2011"],"files":["/var/www/straped/mufon/html2text/29961.html.txt","/var/www/straped/mufon/org/29961.html"],"Log Number":"US-07052011-0013","Region":"Kansas","Source":"MUFON","Latitude":"38.978209","Summary":"5 glowing objects, yellowish glow in center surrounded by reddish or orangish color, individually traveling east to west","Tags":"City","Object Features":"Unknown","Weather Factors":"None","Disposition":"IFO","Viewing Distance":"Unknown","Longitude":"-95.23398","Date of the Event":"07/04/2011 10:00 UTC"}