{"Object Shape":"Cone, Square, Rectagular, Triangle","trends":["There have been 7 other sightings in Chino","There was one other sighting in Chino on or around July 4th 2011","This sighting has never been favorited.",""],"Sighting Duration":"00:10:00","Tags":"City","Weather Factors":"Unknown","Longitude":"-117.683124","Viewing Distance":"Unknown","City":"Chino","Disposition":"IFO","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"07/05/2011 01:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.019935,+-117.683124(29962)&iwloc=A&hl=en\"> mufon case (29962) map </A>","Source":"MUFON","Date of the Event":"07/04/2011 09:00 UTC","files":["/var/www/straped/mufon/html2text/29962.html.txt","/var/www/straped/mufon/org/29962.html"],"Case Number":"29962","Country":"United States","Region":"California","Latitude":"34.019935","Log Number":"US-07052011-0014","Object Features":"Other","divs":["Sighting DetailsI was in the living room and my mother yelled for me to \"come here!\". She was looking out her bedroom window, and asked me \"What is that?!?\" I saw what looked like a squat pyramid shape, and thought it might just be a balloon, but then I saw it slowly moving and realized it was quite large. My next thought was maybe a blimp, but this was very strangely shaped for a blimp. I was in shock and just watched it for a bit, then yelled for my brother to come see and show the rest of the family. We noticed some red lights on the bottom, slowly flashing on and off. I ran to the balcony and continued to watch it for about 30 seconds before running to find my sisters camera and record video of it. I then proceeded to record video from the balcony and later from the parking lot outside. The object very slowly drifted from west to east while gaining altitude, very much like what I imagine a large balloon would do. We noticed some slow clockwise rotation that didn't seem consistent. We were watching the object with binoculars, as well as trying to get video. The object eventually climbed up near the cloud layer and we lost sight of it behind the apartment building. I was very excited as I had always hoped to see a UFO, but also disappointed as I have a feeling this was probably just a 4th of July prank."],"Summary":"Pyramid shaped, slow-floating, dark, apparently solid object with 6+ flashing lights on the bottom"}