{"Region":"Arizona","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Object Flight Path":"Hovering then path","divs":["Sighting DetailsWe were in an open desert lot, near 14th street and Cherry St. waiting for the 4th of July 2011 Fireworks to begin. Looked like Fireworks were warming up to start, as a few tester fireworks had gone off. Thought at first it was one of the roundish globe fireworks. But it moved up, then out and then forward. Then I thought a piece of the Firework was going to land in the field and catch on fire, as another one had just gone over and landed nearby us. But no fire, as it had just rained. Today was the start of a slight Monsoon rain, black clouds, thunder and lightening. Then I realized it wasn't part of the Firework and said OMG it's a huge FIREBALL! We thought it was going to land in the field we were in. Then I said, OMG, no I bet it's a huge meteor!!! Then I noticed the outer red light looked less fireball like, and started to pan left and right. Then it slightly turned and started to come in our direction! At this point I was still disoriented thinking a meteor was getting ready to smash down and was wondering if there was more and, when it came in our direction I was concerned it was going to hit us. I was just trying to figure out which way we should move to be safe. My boyfriend got out of his chair at that point, as he wasn't sure either. After it turned in our direction, and we moved, then it straightened back up and flew right over head. It was low... slow... and gradual moving...with NO SOUND!!! We both mentioned there was no sound. It passed over head and then just faded into the distance. We never saw something like that!!! Was VERY DIFFERENT! Hope others noticed it too! Good luck on your quest and if you know anything please feel free to share! :) I knew I should have brought a camera! :("],"Summary":"White glowing inner light, Bright glowing Red outer light. Slow moving no sound.","map":"<A HREF = \"http://maps.google.com/maps?q=34.051798,+-111.088731(29967)&iwloc=A&hl=en\"> mufon case (29967) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/29967.html.txt","/var/www/straped/mufon/org/29967.html"],"Log Number":"US-07052011-0019","Disposition":"Unknown","Weather Factors":"Windy, Lightning, Rain, Medium, Light","City":"Cottonwood,Jerome & Sedon","Longitude":"-111.088731","Object Shape":"Circle, Fireball","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/04/2011 08:30 UTC","Object Features":"Unknown","Latitude":"34.051798","Case Number":"29967","trends":["There have been no other sightings in Cottonwood,Jerome & Sedon","This sighting has never been favorited."],"Date Submitted":"07/05/2011 03:54 UTC"}