{"Region":"Washington","Tags":"City","Longitude":"-122.896005","Weather Factors":"Unknown","divs":["Sighting DetailsWe were watching fireworks--my six-year-old son, and our adult friend. After one burst of fireworks, a light came flying just above it. At first, it looked like fragments of the explosion, but it didn't fade, or drop. It kept coming. We noticed it was large at that time, and seemingly under control. It approached from the northwest, and flew eastward after coming over our house. It was fairly low to the ground. As low as the small planes that were flying in the area at the time. It glowed dull orange, and my friend asked, \"Is it behind the clouds?\" But the sky was absolutely clear. The glow was odd, though. Not all that bright. Like burning paper. As the object came over our house, it faded to a blue color. I could tell that it looked like a triangle. I watched it fly over, silently. It continued on, over the horizon, going behind a tree on its way. It went very quickly. My friend couldn't see it anymore after it flew over our house. She complained about not having her glasses. About five minutes later, three more appeared. They approached from the same direction, flying in a triangle pattern. They split apart as they came closer, and one of them disappeared from our view faster than the others. Two remained in our sights, and went behind a tree in front of us. Both came out on the other side of the tree, but one shot off in a northern direction, while the other slowly flew over us, changing direction slightly, and as it flew eastward, disappeared from our view. Having seen the other one change color, and fade nearly completely into the sky, I'm pretty sure the same thing happened with the others. The whole event lasted fifteen minutes or so. I took photos, but they're shaky, and the lights look distant. I did get video of them, too."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29970.html.txt","/var/www/straped/mufon/more/29970_submitter_file2__IMAG1085.jpg","/var/www/straped/mufon/more/29970_submitter_file3__IMAG1087.jpg","/var/www/straped/mufon/org/29970.html"],"trends":["There have been 22 other sightings in Olympia","There was one other sighting in Olympia on or around July 4th 2011","This sighting has never been favorited.",""],"City":"Olympia","Case Number":"29970","map":"<A HREF = \"http://maps.google.com/maps?q=47.041304,+-122.896005(29970)&iwloc=A&hl=en\"> mufon case (29970) map </A>","Viewing Distance":"101-500 Feet","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-07052011-0022","Disposition":"Unresolved","Object Shape":"Triangle","Date of the Event":"07/04/2011 10:15 UTC","Latitude":"47.041304","Summary":"Four glowing triangular lights flew over the fireworks. One that passed directly overhead changed to blue.","Date Submitted":"07/05/2011 04:44 UTC","Object Flight Path":"Path with directional change"}