{"files":["/var/www/straped/mufon/html2text/29978.html.txt","/var/www/straped/mufon/org/29978.html"],"Object Flight Path":"Path with directional change","Longitude":"-82.491268","Tags":"City","divs":["Sighting DetailsMy girlfriend and I were out on my back deck talking and our attention was brought to a light that sudddenly appeared out of nowhere. It was very bright and we could even see the beam of light through the sky similar to landing lights on a plane going through fog or cloud cover. The light was heading in a southwest direction at first then changed to a south only direction. the light dimmed out as if it was going behind a cloud and it went away. There were no clouds around it that we could see and there were visible stars in the same location as the light. It is possible that it climbed to a higher elevation but it looked as iff the light was slowly dimming as if caused by cloud cover. We watched for probably 20 minutes and it never reappeared. I would estmate the altitude at 25000 ft. It lasted a total duration of approx 15 seconds before it was gone. There were numerous aircraft in the area being as I live in the flight path to Port Columbus airport but this was no aircraft. The light was not going in any direction that we usually see aircraft fly in this area. I have reported one other similar sighting a number of years ago but this one was different. I never saw an actual beam of light on my first experience like we did this time. The light just prior to seeing the beam was very bright as if aimed right at us. then it moved slightly causing us to see the visible beam until it dimmed away. There was an aircraft inbound to the airport to the south of the lights original location and it appeared to be below the light when we saw it. The aircraft made no changes in its flight path as if to avoid any collision."],"Log Number":"US-07052011-0030","Object Features":"Unknown","Date of the Event":"07/03/2011 11:30 UTC","trends":["There has been one other sighting in Hebron","There were no other sightings in Hebron on or around July 3rd 2011"],"City":"Hebron","Region":"Ohio","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2011 11:48 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Disposition":"IFO","Object Shape":"Circle","Source":"MUFON","Latitude":"39.96173","map":"<A HREF = \"http://maps.google.com/maps?q=39.96173,+-82.491268(29978)&iwloc=A&hl=en\"> mufon case (29978) map </A>","Case Number":"29978","Country":"United States","Summary":"Light in the Sky"}