{"Weather Factors":"Unknown","divs":["Sighting DetailsOn July 4, 2011 around 9:30PM, I stepped outside onto my porch to take a look around at the sky. In the direction towards Phoenix from Mesa, AZ, I noticed rain clouds in the distant. While looking at the clouds, I noticed the clouds producing lightning which mainly just lights up the clouds. Occasionally I would see a streak of small, crooked lighting bolts being produced and branching across the cloud cell, but none of the lightning bolt went to the ground. While observing what seems like a constant cloud lightning, I saw in one of the cloud lightning occurrence produced a pure ball of white light at the end of a lightning bolt and occurrence which the ball of light was by itself for at least 2 or 3seconds. The size of the pure white ball would be about the same size of a jet or plane for that distant or just a white dot in the sky. I'm reporting this because I have never seen after lightning has been made and the bolt gone, leave behind after the lighting flash just a pure, white ball of light just hovering for about 2 or 3 seconds. From my perspective, it almost seemed like there was a round object that might had been in front of the clouds which lightning may had hit a ball object and lit it up for 2 or 3 seconds. When I continued to watch the cloud produce more cloud lightning in the same general area, I never did see that pure white ball of light again. I went into the house to get my video camera, then I went back outside and started filming some of the cloud lightning. I haven't review the video tape yet; however, if I happen to see that ball of light on that video, I will notify Mufon and reference this report."],"Case Number":"29971","Log Number":"US-07052011-0023","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around July 4th 2011"],"Date of the Event":"07/04/2011 09:30 UTC","Object Shape":"Sphere","Country":"United States","City":"Phoenix","Summary":"Hovering white ball of light by a cloud after lightning stroke.","Date Submitted":"07/05/2011 05:41 UTC","Disposition":"IFO","Object Flight Path":"Stationary","Sighting Duration":"00:00:03","Object Features":"None","Latitude":"33.452827","map":"<A HREF = \"http://maps.google.com/maps?q=33.452827,+-112.070757(29971)&iwloc=A&hl=en\"> mufon case (29971) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-112.070757","Tags":"City","files":["/var/www/straped/mufon/html2text/29971.html.txt","/var/www/straped/mufon/org/29971.html"],"Region":"Arizona"}