{"files":["/var/www/straped/mufon/html2text/29976.html.txt","/var/www/straped/mufon/org/29976.html"],"Log Number":"US-07052011-0028","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been 221 other sightings in Chicago","There were 2 other sightings in Chicago on or around July 5th 2011"],"Date Submitted":"07/05/2011 10:40 UTC","Country":"United States","Summary":"Now I believe.","Latitude":"41.886764","map":"<A HREF = \"http://maps.google.com/maps?q=41.886764,+-87.624388(29976)&iwloc=A&hl=en\"> mufon case (29976) map </A>","divs":["Sighting DetailsI was about to fall asleep, when I heard a couple of thumps come from my wall and ceiling. I thought it was nothing, but something urged me to look out my window. I saw a very bright star in a place that it had never been before. I grabbed my glasses to see the star a bit more clearly. It sure was a very bright star, and not only that but I could manage to see a faint diagonal cross(X) behind it. The more I looked at it the more it started moving. At first I thought it was just a star, but after seeing it move I thought it was and airplane or a helicopter, but it couldn't have been either because of the way it was hovering at first. First it got bigger so I assumed it was getting closer. I got scared and turned around, but my curiosity got the better of me and I looked out the window again. It ended up moving slightly up and down then left and right. It slowly started moving behind a tree, but was still visible. I went to another room to see if it would still be there, but it wasn't. I went back to my room to notice that it got closer to hiding behind the tree. I went to grab my camera to record what else would happen (it only took me 5 seconds to get it), but it was gone when I got back. When this happened I was upset because I didn't get it on camera and then I ran out of my room, scared, because I had a feeling that they knew that I was looking."],"Longitude":"-87.624388","City":"Chicago","Region":"Illinois","Weather Factors":"Unknown","Tags":"City","Object Shape":"Cross, Star-like","Case Number":"29976","Object Features":"Wings","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Date of the Event":"07/05/2011 12:00 UTC"}