{"Source":"MUFON","Object Shape":"Star-like","Disposition":"Unknown","Object Features":"Other, Unknown","Country":"United States","Latitude":"35.376622","Weather Factors":"Windy","Longitude":"-119.010222","divs":["Sighting DetailsI hope we did not leave anything out on this form that would diswade yourorginization from investigating our sighting.I have proof I was out on my patioto smoke a cigarette and was looking up at the night sky as I always do and atfirst I thought I was experiencing auto-kenesis of a star. Then the movementbecame SO obvious that there was no doubt about what I was seeing. I opened thedoor and screamed for my girlfriend to come out immediately and witness thesighting with me. For years I had been telling her about a sighting I had tenyears ago with another witness at the time and out of love she always wanted tobelieve me but, you know how it goes. . .if you havent seen it for yourself,live, then you can never truely, truely 100 per cent believe. Lets see, adescription of how the UFO behaved last night - You know how the bugs you seethat hover over your lawn and are lit up in the summer sunlight move The UFOflew in a more lazy version of that.Zipping, speeding up and slowing down whilemoving in any one direction. Long, sudden, shallowdownward arc movements to theright heading North seemed to be a favorite with this object and did it at least5 different times.Both sharper and smoother abrupt turns. Dips and ascensions,etc. Yet all was liquid smooth flight - TOTALLY defying the laws of gravity -Very exciting So exciting that we both got tension headaches from experiencingthe event. Bakersfield was very windy from early evening on and picked up somefarm dust into the atmosphere. The sighting lasted so long that the only reasonwe went in was becasue the UFO eventually made its way further and further fromus and the dusty atmosphere eventually blocked most of the object and it becamea dim pin point. But when we went back inside the end of a 45 minute duration,you could still barely see it and it was STILL doing its thing. I went backoutside a half hour later and both the UFO and oddly enough the mighty winds wewere having were gone. Please, dont take my word for it. If you decide to sendsomeone to investigat our sighting report they can come out onto my balcony andwith my compass get exact sighting info. And after that they can sit down andwatch the sighting on my large screen TV as I recorded about 15 minutes of iton"],"Tags":"City","Case Number":"2997","map":"<A HREF = \"http://maps.google.com/maps?q=35.376622,+-119.010222(2997)&iwloc=A&hl=en\"> mufon case (2997) map </A>","Sighting Duration":"01:00:00","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"","Viewing Distance":"Over One Mile","Date of the Event":"04/28/2004 09:15 UTC","Date Submitted":"04/28/2004 09:15 UTC","City":"Bakersfield","Region":"California","Summary":"Flying, darting, zipping, floating purplish-bluewh","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around April 28th 2004"],"files":["/var/www/straped/mufon/html2text/2997.html.txt","/var/www/straped/mufon/org/2997.html"]}