{"Date Submitted":"04/17/2004 08:30 UTC","Latitude":"40.493807","Longitude":"-86.128903","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around April 17th 2004"],"divs":["Sighting DetailsMy husband and I were driving home on a Friday evening at approximately 8:30 p.m. I believe it was April 16, 2004, but I cannot be positive that it was not the Friday before. We live in Howard County, Indiana and are very close to Cass County, Indiana. We were on County Road 425 North, when almost at the same time, we both said, \"What is that?\" We observed 3-4 red lights equal distance apart in the form of a triangle or diamond shape. We could only see the lights. We could not see the object, in fact, it was just very dark in what would be the center of the lights. The lights suddenly disappeared as if someone had turned off a switch. It was very low. It appeared to only be hovering, not really moving. Once the lights went out, we could not see it. We continued driving and approximately a half-mile down the road, we saw it again hovering in a cornfield. Very low and close to us. Again, after a few seconds, the lights turned off again and we could not see anything. We were both in awe. I was scared. My husband, a former police officer and pilot, said he had never seen anything like it. We both believe it was a UFO. We told our family and a few close friends. I just learned through the Pharos-Tribune that there were sightings in Rochester, Indiana also in April."],"Region":"Indiana","Country":"United States","Summary":"Saw lights hovering low which turned off -- two lo","map":"<A HREF = \"http://maps.google.com/maps?q=40.493807,+-86.128903(2998)&iwloc=A&hl=en\"> mufon case (2998) map </A>","City":"Kokomo","Disposition":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/2998.html.txt","/var/www/straped/mufon/org/2998.html"],"Date of the Event":"04/17/2004 08:30 UTC","Object Features":"Unknown","Weather Factors":"None, Unknown","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Source":"MUFON","Case Number":"2998","Tags":"City","Object Flight Path":"Stationary,Other","Log Number":""}