{"trends":["There have been 2 other sightings in Flint Township","There were no other sightings in Flint Township on or around July 4th 2011"],"City":"Flint Township","Object Flight Path":"Path with directional change","Country":"United States","Date of the Event":"07/04/2011 10:15 UTC","Case Number":"29993","Latitude":"43.004322","Disposition":"Unknown","Source":"MUFON","Tags":"City","Weather Factors":"None","Date Submitted":"07/05/2011 05:17 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsOn july 4, 2011 approximatley 22:15, I was walk down the street and i seen an object in the sky i belive it to be a ufo. It looked like a big ball of fire, about half the size of a baby, small but large to see something like i did in this night sky. The object moved towards me from a far distantance, it made sort of a circular motion and they back and forth very fast. I then grabed my phone to take a picture, the picture on my phone did not look like what i seen in the sky when i took the picture, thats what got to me, it then stood there like something was watching me for about 3 mins, and then quickly went away it just vanished into the east sky. i then called authority to seek answers they told me i was crazy, i personally dont belive i am, and knowone belived me, and that scares me! I as a U.S. citizen personally did not belive in these type of things untill i came face to face i am petrified, worried , and i need answers, is it what i thik it was? what did i see was it a ufo, it was fourth of july could it have been fire works? I dont know, but it didnt look noramal to me!!"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.004322,+-83.760807(29993)&iwloc=A&hl=en\"> mufon case (29993) map </A>","Object Features":"Undisclosed","Log Number":"US-07052011-0044","files":["/var/www/straped/mufon/html2text/29993.html.txt","/var/www/straped/mufon/org/29993.html"],"Object Shape":"Fireball","Longitude":"-83.760807","Summary":"firey object in the night sky, looks to a UFO","Sighting Duration":"00:05:10","Region":"Michigan"}