{"Sighting Duration":"Undisclosed","Summary":"Videoed 12 plus over the course of 2 hours Orange in colour","map":"<A HREF = \"http://maps.google.com/maps?q=28.545806,+-81.370116(29992)&iwloc=A&hl=en\"> mufon case (29992) map </A>","Case Number":"29992","Disposition":"IFO","Tags":"City","Object Shape":"Sphere","Source":"MUFON","Date Submitted":"08/09/2011 10:15 UTC","files":["/var/www/straped/mufon/html2text/29992.html.txt","/var/www/straped/mufon/org/29992.html"],"Longitude":"-81.370116","Country":"United States","Date of the Event":"07/04/2011 10:17 UTC","Object Flight Path":"Straight-line path","Region":"Florida","trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around July 4th 2011"],"Weather Factors":"Unknown","Log Number":"US-08092011-0042","City":"Orlando","divs":["Sighting DetailsMy husband and I went out to watch fireworks and saw the first orange object track across the sky, a few minutes later there was a second object. We finally realised that we could record on our Olympus digital camera. We continued to film everytime we saw another object show up. At one point there were 4 objects in the sky and an airplane passed by them heading the other direction. Caught on tape, some of our neighbors saw them as well. Finally I climbed onto the roof top to try to get the tree line out of the camera shot. Cloudy night, no wind, and no visiable stars. The objects did not seem to flash, later when we viewed the video they seemed to pulse. No blinking lights like an airplane, we even took video of a plane to show that, and there was no sound like in the video of the plane video. On video, also,we show one object with a plane near by. All objects travelled almost the same path. South east to North west. We are not saying that they were extraterrestial but definitely unexplained. All this occured roughly from 930pm to 11pm in Orlando Florida on July 4th 2011. We at first thought it was a firework but when it travelled across miles of sky we realised it was not a firework or a flare. Plus there were too many of them. They disappeared into the night sky. I have already posted the film on youtube and facebook. I do have it copied to a flash drive for MUFON and have not deleted it for the camera."],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","Latitude":"28.545806"}