{"Longitude":"-91.662623","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.98778,+-91.662623(29990)&iwloc=A&hl=en\"> mufon case (29990) map </A>","Latitude":"41.98778","Case Number":"29990","Tags":"City","trends":["There have been 17 other sightings in Cedar Rapids","There was one other sighting in Cedar Rapids on or around July 4th 2011"],"Disposition":"Hoax","Date Submitted":"07/05/2011 03:08 UTC","files":["/var/www/straped/mufon/html2text/29990.html.txt","/var/www/straped/mufon/org/29990.html"],"City":"Cedar Rapids","Summary":"two flickering orange objects track se to nw a few minutes apart","Sighting Duration":"00:02:00","Weather Factors":"None","Date of the Event":"07/04/2011 10:50 UTC","Viewing Distance":"Unknown","Region":"Iowa","Country":"United States","Object Shape":"Unknown","Log Number":"US-07052011-0042","Object Features":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting DetailsTwo orange flickering objects passed overhead within a few minutes of each other. They almost looked like hot air balloons but they were quiet and moved too fast. About 2 minutes (not timed) to pass from SE sky to NW. Neighbor thought there was a turn in the path, but I thought it looked more like a straight path. The latter seemed slightly more westward. No blinking lights as would be on a plane. Also orange light did not resemble any landing lights. Light really appeared flamelike. No noise as would be expected from a plane. It was maybe 30-50 minutes after sunset, so I'm now thinking these \"may\" have been satellites passing overhead with sun reflactions. Although this explanation does not sit well, as the objects appeared larger than any satellite passover I've ever seen. Makes me wondering if this is the same object mentioned in the Hannibal report. Also wondered if this was the shuttle meeting up with the ISS, but don't know what paths the ISS and shuttle are taking. Oh well, maybe you guys can figure out what it was. Would like to find out."]}