{"files":["/var/www/straped/mufon/html2text/29999.html.txt","/var/www/straped/mufon/org/29999.html"],"Tags":"City","Date Submitted":"07/05/2011 08:00 UTC","Region":"Missouri","Date of the Event":"07/04/2011 10:00 UTC","Object Shape":"Circle","Object Features":"Unknown","Sighting Duration":"Undisclosed","Summary":"10 Orange Orbs Fly to Same Location from Different Directions","Case Number":"29999","trends":["There have been 134 other sightings in Kansas City","There were 3 other sightings in Kansas City on or around July 4th 2011"],"Source":"MUFON","Longitude":"-94.575987","map":"<A HREF = \"http://maps.google.com/maps?q=39.105976,+-94.575987(29999)&iwloc=A&hl=en\"> mufon case (29999) map </A>","Weather Factors":"None","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","Country":"United States","Latitude":"39.105976","Log Number":"US-07052011-0049","divs":["Sighting DetailsAs reported via e-mail to ASD in their exact words: I'm not sure what we saw, but I wanted to report this to someone who might be tracking this information closely. My husband and I live on the southeast edge of Pleasant Hill, Missouri which is about a 10-15 minute drive southeast of Lee's Summit, Missouri. We had just gotten back from watching the City firework show yesterday night (July 4, 2011), and my son and I were sitting on our back porch which faces to the southeast watching neighbors fireworks. My husband was in the front of the house which faces to the northwest. It was about 10:00 p.m. when my son asked what something was in the sky. I looked and I saw a bright orange glow in the shape of a circle that was moving from the northeast to the southwest. To me, it looked to be at about the height of our 2-story home and was moving very evenly on a linear track. There was absolutely no sound. At first I had thought it was a piece of firework debris that was on fire. I watched it closely thinking that I didn't want it to land on the roof and catch our house on fire. But then I realized that it was not bobbing up and down, or moving erratically like you would expect a piece of paper to do in the wind. It was also not dying down, which you would expect a piece of paper on fire to do. I began to think it was pretty odd, but didn't even think that it could be a UFO. About a minute later, my husband ran from the front of the house saying \"Do you see that!\". He does not believe in anything other-worldly, and believes that there is a very reasonable explanation to everything. This had him stumped. It continued to climb higher for about a minute and then it faded away. It was hard to tell if it had just faded away or just got higher and we couldn't see it anymore. One reason why I had initially thought it was a piece of paper on fire was that the glow was only on one side of the object. Not like a solid orb. I felt that I had a pretty up close look at it, but then my husband thought that it was at an elevation similar to an airplane coming in for a landing. We live in a somewhat rural area. Our property is about 2-acres, which is long and narrow and backs up to a tree line. There would be no airplanes coming in for a landing there, nor are there any crops on the adjacent properties for crop dusters. We live in a subdivision where everyone has about 2 to 4 acres of land, but it is only residentia After that, we stood on our driveway facing to the west. Then we started to see about 8 or 9 of these same orange \"orbs\" on the western horizon. This is when I realized something was very different. They moved in the same manner, in a long steady, linear track but gradually got higher and higher. The kind of flickered like balls that were on fire. We saw about 5 or 6 that initially began in the northwest horizon (we were guessing over Greenwood, MO or Lee's Summit, MO, but they could have been closer) and then tracked to the south. We saw about 3 that initially began from the southwest and tracked to the north. What was weird is that they all tracked to the exact location on the western horizon before they dissapated, including the first one that flew overhead. It couldn't have been chinese lanterns because they flew in three different trajectories, some opposite of the wind last night which was from the east-southeast during that time. The one that I saw up close was definitely not a chinese lantern. Also, they could not have been airplanes because of the first one that flew overhead did not make any noise, nor were there any noise lagging behind it like you would expect in a jet plane. One last thing, these must have been moving very, very fast based on the rate of where they moved on the horizon. I've never seen anything like this before, and neither has my husband. We are stumped and cannot believe what we saw. We did some research online last night and found that these same orange orbs are being documented around the country, including several last night during firework shows. Their videos look exactly like what we saw. We were able to catch some video of it. But I'm not sure how good of quality it is. (Note from FI: I am obtaining this video) I hope this helps you in your research! I hope to some day understand what happened last night. Thanks for listening! FI NOTE: I spoke to the husband by phone today. Their 2-year old son saw a orb first and pointed it out to his mother. The father thought it might be a plane on fire at first. He noted that there were 10 objects coming from different directions and speeds and that they all ended up at the exact same spot."],"City":"Kansas City","Disposition":"Unknown"}