{"Disposition":"Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","Country":"United States","Sighting Duration":"00:01:00","divs":["Sighting DetailsOn July 4, 2011, I was going out my backdoor around 1030pm and noticed toward the north a small orange light, about the size and look of a very big star but with a vivid bright orange hue. I watched and it never moved, never blinked. I could not even guess at what it could have been since it looked like nothing I had ever seen. I turned and went inside to call my boyfriend and son outside to see it and by the time I came back outside it was gone. It took me no longer than 20 seconds to go inside and come back out. I dismissed it then. I continued getting ready to start a fire in our fire pit, my boyfriend and son had went back inside. Then I happened to look toward the south and there it was again, this time brighter, but it still seemed to not move at all. I watched as it simply faded away, slowly. I called for my boyfriend and son again but only my son came outside, after it was gone though. So, once again, me and my son continued with the fire and doing some things on the deck when this time it appeared again (I didnt actually see it appear, I just happened to look up again and there it was). It had moved slightly closer from the south and this time was moving from what appeared to be southwest to northeast. The orange light was like no other I have ever seen in the sky. This time my son was seeing it too. He is only seven but this time I had a witness! As it moved it slowly faded to where you could not see it anymore. We stayed outside looking for it for about an hour and never saw it again. Our line of sight is not that good from our deck so it could have appeared and we just could not see it. Another note, there was absolutely no noise associated with it. The entire duration from the first time I saw it until the last was maybe 30 minutes and each time it never lasted more than a minute, if that. I have seen many things in the sky in my life but never anything that could come close to this. The one thing that I will never forget is the orange color, I cannot think of anything to compare it to. The worst part is I never expected to keep seeing it so I never got photos, the events happened so fast that i was afraid if i tried to run inside after the camera I would loose it altogether. That about sums it up. Thanks."],"Date Submitted":"07/05/2011 07:47 UTC","Latitude":"38.614253","Object Flight Path":"Undisclosed","Log Number":"US-07052011-0048","Date of the Event":"07/04/2011 10:30 UTC","Region":"Indiana","trends":["There have been 5 other sightings in Salem","There were no other sightings in Salem on or around July 4th 2011"],"Longitude":"-86.092109","files":["/var/www/straped/mufon/html2text/29997.html.txt","/var/www/straped/mufon/org/29997.html"],"City":"Salem","Object Features":"Undisclosed","Summary":"Round with bright orange glow","Case Number":"29997","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=38.614253,+-86.092109(29997)&iwloc=A&hl=en\"> mufon case (29997) map </A>","Source":"MUFON"}