{"map":"<A HREF = \"http://maps.google.com/maps?q=42.531184,+-75.523515(29994)&iwloc=A&hl=en\"> mufon case (29994) map </A>","Date Submitted":"07/05/2011 05:47 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsI went to the fireworks and while waiting for the fireworks to start I heard a man and his wife arguing over weather or not the thing they were looking at was a star. The wife said its not a star its moving! And the husband said it is so a star! I then focused on my own kids who were asking me when the fireworks were going to start. I forgot all about what they had said and never got up to see what they were looking at (there were trees between us ) That was around 10 minutes after 9pm I believe. After the fireworks which dint start until like 930 we went to our car. I got in and looked up to see the stars as I have a million times before. I then saw a bright orange light that looked like a flame. I squinted my eyes thinking I was seeing things. It was hovering in one spot and looked like it was on fire. It was at least twice as big as the stars around it and hard to describe the shape because it was like round with a flame. I was describing it to my fiance who could not look at it because he was in the drivers side trying to wait for a chance to pull out into traffic. Then it started moving east about the speed of an airplane and faded from the big Orange flame into a tiny white star looking light all in a matter of a few seconds. I couldn't see it after that because we pulled out into traffic and drove away and I was stuck in the car."],"Log Number":"US-07052011-0045","Latitude":"42.531184","Tags":"City","files":["/var/www/straped/mufon/html2text/29994.html.txt","/var/www/straped/mufon/org/29994.html"],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-75.523515","Source":"MUFON","trends":["There have been no other sightings in Norwich","This sighting has never been favorited."],"Weather Factors":"None","Region":"New York","Summary":"Flame like orange ufo seen before and after fireworks hovering and then left moving east and faded","Case Number":"29994","Object Flight Path":"Undisclosed","City":"Norwich","Disposition":"Unknown","Country":"United States","Date of the Event":"07/04/2011 09:50 UTC","Object Shape":"Fireball"}