{"Log Number":"US-08022011-0044","trends":["There have been 15 other sightings in Belleville","There was one other sighting in Belleville on or around July 4th 2011"],"Sighting Duration":"Undisclosed","Object Shape":"Circle, Cross, Disc, Star-like","Longitude":"-89.977384","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.52733,+-89.977384(30009)&iwloc=A&hl=en\"> mufon case (30009) map </A>","City":"Belleville","Latitude":"38.52733","Region":"Illinois","Country":"United States","Disposition":"Unresolved","Date of the Event":"07/04/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/30009.html.txt","/var/www/straped/mufon/org/30009.html"],"Date Submitted":"08/02/2011 08:16 UTC","Summary":"Colored balls","Weather Factors":"Unknown","Case Number":"30009","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Flight Path":"Hovering then path,Straight-line path","Object Features":"Undisclosed","divs":["Sighting DetailsI was standing in my backyard looking at my neighbors shooting off fireworks. It was fairly bright out still. I noticed that this one bright, orange light didn't diminish after a volley of firework projectiles. It was in the South-Eastern sky and hovered there for a minute. It was quite far off, though very bright. It appeared to be disc shaped, though with something on the top and bottom. It was too far off for me to capture it on my camera phone. Throughout this time (~30 secs) and until the end, there were no fireworks going off in the sky. As it moved from East to West (against the prevailing wind currents) I noticed another, identical object moving into my field of vision through the trees, following the other light. A moment later, I saw another object move into my field of vision, except it was red. They slowly passed through what I could see of the sky through the trees. Some friends that were coming over from the West end of town saw just one of the orange lights, but said it looked like some sort of flying saucer that was tilted. My neighbor, along with her elderly mother saw essentially the same scene that I described, except they said they saw that at one point the lights disappeared. At first I thought the lights were balloons or fireworks but they persisted and stayed constant. They were also going against the prevailing wind and emitting far too much light to be a small, unmanned hot air balloon. I lost sight of the objects when they went through the trees and I could no longer find them."]}