{"Case Number":"30006","Tags":"City","Viewing Distance":"Over One Mile","Date of the Event":"07/04/2011 09:05 UTC","Weather Factors":"None","Disposition":"IFO","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.42104,+-118.504007(30006)&iwloc=A&hl=en\"> mufon case (30006) map </A>","City":"Santa Clarita","files":["/var/www/straped/mufon/html2text/30006.html.txt","/var/www/straped/mufon/org/30006.html"],"Object Shape":"Circle, Fireball, Sphere, Star-like","Latitude":"34.42104","Longitude":"-118.504007","Date Submitted":"07/06/2011 12:04 UTC","divs":["Sighting DetailsMy fiancee, a friend and I were sitting on top of a hill at Valencia Blvd and McBean Pkwy waiting for 4th of July fireworks to start. At 9:05pm were scanning the sky looking for fireworks when I noticed 4 orange orbs in the sky flying over a mountain range belonging to the west end of the Angeles National Forest. At first I thought they were planes because of their speed, but then realized they were an odd color and had no flashing lights at all. They were flying north in a lopsided \"V\" formation with one in the front center, one on the left, and 2 on the right. After about a minute they slowly changed to a trapezoid formation, similar to the shape of the \"Big Dipper\" constellation but without the handle. As they continued flying north towards us, we noticed that the bottom-right orb in the formation started to dim, until it was so dim that it was not visible at all anymore. A few seconds later, the lower right orb began to fade until it was not longer visible as well. The last 2 orbs faded out one at a time as well, until nothing could be seen anymore. We were all very curious and interested, and baffled by what they could be. I can confidently rule out them being any form of commercial aircraft due to the lack of appropriate lights (and the fact that the lights went completely out). I cannot completely rule out the possibility that they were Chinese Lanterns, though the speed and seemingly deliberate formations give some evidence against the Chinese Lantern theory."],"Log Number":"US-07062011-0001","Object Features":"None, Unknown","Country":"United States","Region":"California","Sighting Duration":"00:03:00","Summary":"4 Orange Orbs Near Santa Clarita","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around July 4th 2011"],"Source":"MUFON"}