{"City":"Huber Heights","Longitude":"-84.119141","Source":"MUFON","Country":"United States","Latitude":"39.850947","map":"<A HREF = \"http://maps.google.com/maps?q=39.850947,+-84.119141(30002)&iwloc=A&hl=en\"> mufon case (30002) map </A>","Weather Factors":"Unknown","trends":["There have been 7 other sightings in Huber Heights","There were no other sightings in Huber Heights on or around October 24th 1974"],"Region":"Ohio","Date of the Event":"10/24/1974 11:20 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy wife and I were driving down Shall Rd we pulled up to the stop sign to take a right onto Brandt Pk. when we seen a low flying craft flying at tree top level about 400 yrds. Flashing green red clearence lights.We turned right onto Brandt and were going about 15 mph we pull up across from a Texaco station I turned off the engine and we watched it.Then there were 2 very bright lights they looked so bright it looked like they were coming up the highway I was confused for a minite I thought they were truck lights or somethimg.There was a Texaco highway sign about 50ft. in the air next to the highway the craft flew over that sign and stoped over the bridge about level with that sign. The craft pulled up and stoped as it stoped it rocked once then it was motionles.The craft was about 50yds.from us.The lights were facing down the highway west the craft turned and the lights was faceing at us we could not see anything I held my hands in frount of my face the hole area was as day light the craft turned again and the lights was faceing east It stayed ther for about 30 sec.Then turned floresent green I was very impressed and had good feeling and thought that is so impressive then it turned floresent red that was so scary.I though how big is this It covered the width of the bridge I looked over at the station and it it as big as that no sound just hung there in complete control.The event lasted about maby about 5 min.Then it flew off flaching green red green red. I said to my wife I just seen a ufo she said I did too We drove down turnened around and came down Brandt again here it comes again. We pulled up to the same place again turn off the engine like befor its coming to us again there is a car is comeing down the road behind us.It just went away."],"files":["/var/www/straped/mufon/html2text/30002.html.txt","/var/www/straped/mufon/org/30002.html"],"Date Submitted":"07/05/2011 10:01 UTC","Tags":"City","Object Shape":"Square, Rectagular","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Case Number":"30002","Log Number":"US-07052011-0052","Summary":"As big as a gas station it changed colors from dark black to green then red","Disposition":"Unknown"}