{"map":"<A HREF = \"http://maps.google.com/maps?q=39.102506,+-94.571357(30000)&iwloc=A&hl=en\"> mufon case (30000) map </A>","Longitude":"-94.571357","Object Shape":"Sphere","Object Flight Path":"Undisclosed","divs":["Sighting DetailsE-mail received by ASD today in exact wording: Hello, Last night about 10:30 pm two orange orbs were seen in my neighborhood (actually hovering approx. 200 feet above where we were shooting fireworks). They were approx. 300 feet near my property. There were several witnesses of the bright orbs. I am a very spiritual person and I was not scarred at all. The two orbs came from the east and hovered for approximately a minute and then drifted west and disappeared The speed of the orbs was approx. like a small single engine plane. ------------------------ Note from ASD: I interviewed the witness today and his further description is that the objects were white in the center with an orange glow, it would take two hands put together to cover the second orb at arm's length, and a large frisbee to cover the first orb at arm's length. Both objects started out moving faster, then slowed down. They seemed to move in a straight-line path unaffected by the wind and did not bob up and down. The wife was also a witness and she was talking in the background while I was on the phone and is in agreement. There were four neighbors who saw the objects as well. They have all seen chinese lanterns and believe that these objects did not behave in the same manner. The KCI airport is just West of their location and the flight path for planes is North to South. There is a farm to their West"],"Source":"MUFON","Log Number":"US-07052011-0050","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Summary":"Two large orange orbs joined together","City":"Kansas City","Region":"Missouri","Date of the Event":"07/04/2011 10:30 UTC","Weather Factors":"None","Tags":"City","Object Features":"Undisclosed","Case Number":"30000","Disposition":"IFO","Latitude":"39.102506","files":["/var/www/straped/mufon/html2text/30000.html.txt","/var/www/straped/mufon/org/30000.html"],"trends":["There have been 134 other sightings in Kansas City","There were 3 other sightings in Kansas City on or around July 4th 2011"],"Date Submitted":"07/05/2011 08:28 UTC"}