{"Log Number":"US-07062011-0005","Country":"United States","Date of the Event":"07/05/2011 09:37 UTC","Summary":"Star like craft viewed flying in between two airliners or planes.","Weather Factors":"None, Does Not Apply","divs":["Sighting Details My wife and I were taking our evening walk when we noticed an airliner taking off from Harlingen International airport. The plane was already flying over North 77 Sunshine Strip and was directly over us heading west. We walk the industrial park across the street from our house for exercise. As we made our way across the street and into the park. We noticed another plane or airliner taking off and also heading west in the same direction as the previous one. From our viewpoint the first plane was to the right of the \"star\" and the one that just took off was to the left of the \"star\". I say \"star\" because that is what it appeared to be at first glance. After staring at the \"star\" for a few seconds we noticed it was moving heading towards us in an eastern direction towards the airport. Assuming that the \"star\" was an incoming aircraft. I turned to my wife and said that seems dangerous because I have never seen them group planes this close before in our area. After both planes heading west were in the clear we observed the star or white light coming toward us and almost over us. We Looked for the FAA required lights or some blinking lights but there were none on the object. As it approached us I noticed it seemed to waiver or sway back and forth a bit erratic. We also observed that the object made no sound. At this point the object began to change direction and head south. It took a slight curve to the south and in a matter of three seconds it sped up and disappeared. It's speed could be compared to that of letting the air out of a balloon. That is how fast the light shrunk and disappeared. No FAA lights and no sound got me thinking on what this object was but when it took off like that and went out of sight. I knew my wife and I had just seen a UFO. I thought about calling the airport to see if they had any close calls involving aircraft or any odd hits on their radar but the only number listed is for customer service and not the tower. I decided to submit this report because about two months ago around dusk. My wife and I were getting ready for our usual walk and she saw a white light in the sky with no FAA lights either. Which also was heading east and then erratically changed it's course and flew south. The way it changed it's course all of a sudden convinced my wife that she has just seen a UFO. I don't know the proper channels in contacting the pilots in those two aircraft heading west out of H.I.A. but they had to had seen something. The sky was clear and there was no clouds."],"Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"07/06/2011 12:44 UTC","Object Shape":"Circle, Star-like","Viewing Distance":"Over One Mile","City":"Harlingen","Tags":"City","Longitude":"-97.691083","Region":"Texas","files":["/var/www/straped/mufon/html2text/30010.html.txt","/var/www/straped/mufon/org/30010.html"],"Latitude":"26.198931","Disposition":"Unknown","trends":["There have been 6 other sightings in Harlingen","There were no other sightings in Harlingen on or around July 5th 2011"],"Case Number":"30010","Object Flight Path":"Path with directional change","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.198931,+-97.691083(30010)&iwloc=A&hl=en\"> mufon case (30010) map </A>"}