{"Viewing Distance":"Unknown","Latitude":"-33.868131","Date of the Event":"07/06/2011 07:53 UTC","divs":["Sighting DetailsSitting on the balcony enjoying a cigarette on a chill but clear night with a friend. Above the tree line heading W > E a bright and VERY red singular light spotted moving slowly North from us. About as bright and the same size as a burning cigarette held at arms length. First thought it was the ISS which we regularly observe. Realised that A, it was much redder than usual and B. moving a LOT slower in the sky than usually seen. Appeared to be much lower in altitude than other satellites also regularly observed. Just after losing sight behind our roof we checked the real-time ISS tracker which indicated it was just off the Chilean coast, so discount the ISS. It was moving slowly enough to allow time to get a good view through binoculars by two people. No distinct shape, but bright. Twice as bright as any other celestial object we are familiar with. Also NO other light sources, no aviation lights, beacons, etc. Slow and steady movement. We have a good elevated view from the western horizon to just past directly overhead. This red light source took AT LEAST one minute to pass our viewable area and it wasn't initially spotted till it was 20deg or so above the horizon, so it took just over a min to pass through approx 70deg. We are LOGICAL ufo believers and sit out nightly observing anything in the sky and this was the most anomalous sighting we've had. We are close to flight paths to Sydney airport and easily can see approaches from the south and west. This was not an aircraft. Unusual indeed!"],"Summary":"Bright RED light, slow moving.","Longitude":"151.21166","Country":"Australia","files":["/var/www/straped/mufon/html2text/30019.html.txt","/var/www/straped/mufon/org/30019.html"],"trends":["There have been 17 other sightings in Sydney","There were no other sightings in Sydney on or around July 6th 2011"],"Tags":"City","Log Number":"AU-07062011-0014","Weather Factors":"Unknown","Date Submitted":"07/06/2011 06:51 UTC","City":"Sydney","Case Number":"30019","Sighting Duration":"00:01:10","Disposition":"Unresolved","Object Shape":"Star-like, Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=-33.868131,+151.21166(30019)&iwloc=A&hl=en\"> mufon case (30019) map </A>","Region":"New South Wales","Object Features":"Unknown"}