{"City":"Howell","Latitude":"42.622554","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/30013.html.txt","/var/www/straped/mufon/more/30013_submitter_file1__UFO-july5-2011.jpg","/var/www/straped/mufon/org/30013.html"],"Country":"United States","Date of the Event":"07/05/2011 09:00 UTC","Object Flight Path":"Straight-line path","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.622554,+-83.836022(30013)&iwloc=A&hl=en\"> mufon case (30013) map </A>","Date Submitted":"08/06/2011 04:32 UTC","Case Number":"30013","Summary":"White cigar shaped object without wings moving silently in Southerly direction","divs":["Sighting Details1. I was in my swimming pool with my two children at about 9 PM. 2. My 6 year old daughter pointed it out to me and said 'look its a space shuttle'. 3. I was not wearing my glasses so I grabbed them and was able to see the object clearly for about half the time. It was curious because I could see no wings and there was no noise. 4. It was a white cigar shaped object from my perspective. My 7 year old son, who has much better vision than I do, said it had three windows. I had him draw a picture of the object. His picture was similar to my recollection but a bit more saucer shaped. The object was clearly visible but not flying low, I would guess it to be 500 ft in the air but I have no perspective to quantify that, there were no clouds in the sky to give perspective. It was a very bright white color but the sun was setting so it may have been reflecting the last rays of the sun. It reminded me of a blimp but it appeared to be going much faster than that. It was travelling from the North to the South. The object was to the East of us so it would have been in the right perspective to reflect the suns last rays at that particular moment. 5. My daughter was just getting out of the pool and I did not want to startle her but after she was out of earshot, I told my son that it was very curious what we saw. We both thought it was very cool, we were definitely more curious than scared. My son asked me who could be piloting it, I told him I don't know. He surmised that it was 'aliens' and wondered what they were doing. I did not coach him on his response but thought it was an appropriate response. 6. It flew over the trees and out of sight."],"Tags":"City","Sighting Duration":"00:05:00","Source":"MUFON","Log Number":"US-08062011-0060","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cigar","trends":["There have been 20 other sightings in Howell","There was one other sighting in Howell on or around July 5th 2011","This sighting has never been favorited.",""],"Longitude":"-83.836022","Region":"Michigan","Weather Factors":"None"}