{"files":["/var/www/straped/mufon/html2text/30015.html.txt","/var/www/straped/mufon/org/30015.html"],"Disposition":"Insufficient Data","Object Features":"Patterned Surface, Appendage(s), Other","Source":"MUFON","Date of the Event":"07/05/2011 10:25 UTC","Tags":"City","divs":["Sighting DetailsAt first I sensed movement north of Ursa Major. As I off focused a bit the faint \"star\" that was motionless began movement and became brighter moving through the northernmost part of the constellation. The time was 10:25pm when it began. But right before the event there were two flashes of light that at first I thought were meteors but their pattern were too close in shape and brightness. Plus they moved parallel from each other. Anyway, back to the event . . . even if this is part of it too... As it moved through the the \"kettle\" of the dipper the star craft changed direction but not as in linear movement. It was more like it went with the curve of the sky as opposed to a jet in our atmosphere moving linearly. The star appeared bright with a center of blue but it was high in altitude. It appeared to completely change direction but perhaps in star movement it really isn't. At 10:47pm this same star like craft with blue in the center moved from south to north bright at first but then it faded but at 10:53 the same celestial moved across from the direction I last saw it in the north moving south. It was brighter than before but made slow movements. I believe that possibly it may be the same craft doing sweeps because right around 10:57pm . . . The BRIGHTEST STAR came into view. The brightness star lights were in the shape of the TWO quick lights that illuminated a HUGE SAUCER SHAPED DOMED craft. I say it must have been huge because where it was in the sky must have been far up in the atmosphere. But as I saw the craft, it did what it always does and that is cloak themselves or they transform somehow . . . these are my observations . . . after the bright craft the star light, blue centered one appeared and generally moved in the direction of the large one. I sense that something is happening tonight July 5th either here in the west or they are moving south south east . . . perhaps towards Arizona, Nevada maybe . . . something is up. I will observe more and report them."],"Object Flight Path":"Path with directional change,Other","Sighting Duration":"Undisclosed","Log Number":"US-07062011-0010","Case Number":"30015","Longitude":"-119.416232","trends":[],"Weather Factors":"None","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.780761,+-119.416232(30015)&iwloc=A&hl=en\"> mufon case (30015) map </A>","Latitude":"36.780761","Summary":"Five or just one? . . . Stars moving in ALL directions","City":"Undisclosed","Country":"United States","Date Submitted":"07/06/2011 02:56 UTC","Object Shape":"Disc, Fireball, Star-like, Other","Viewing Distance":"Over One Mile"}