{"Object Features":"Unknown","City":"Greensburg","Country":"United States","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/30025.html.txt","/var/www/straped/mufon/org/30025.html"],"Source":"MUFON","Weather Factors":"Unknown","Summary":"Observed a total of 7 Sphere like objects (with halo around them) at 4th July Event","Longitude":"-85.474941","Date Submitted":"08/08/2011 11:29 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Log Number":"US-08082011-0045","Region":"Indiana","Date of the Event":"07/02/2011 10:10 UTC","Sighting Duration":"00:40:00","Case Number":"30025","divs":["Sighting DetailsBeginning the end of the month of July of 2010, my wife & I were sitting on our front porch at approximately 10:00pm. Approaching from the South and moving in a northerly direction was a bright yellowish orange light surrounded by a bright orange halo, undetermined speed and altitude. We stepped to the front yard and watched it approach. It passed directly overhead and began to slowly fade in intensity until it vanished from sight directly overhead. There was no sound or any other disturbance. Then comes July the 2nd of this year. While watching the annual lake fireworks display again the same object approached from the south heading due north at a relatively slow speed (fireworks were booming all over the place) but impossible to determine velocity and altitude. Position hard to determine but appeared to be approximately 1.5 to 2 miles due east of the fireworks display. Continued north and began to slowly fade until it disappeared. The seven which were sighted came through on the same heading and apparent altitude, velocity and position relative to the fireworks display at approximately 5 to 7 minute intervals. The first four headed due north and disappeared (the first of these faded out)The fifth object stopped and remained stationary for a period of approx. 2 to 3 minutes, then changed course to a heading of due east and continued on that course until out of sight. Two more objects appeared under the same conditions both of which again changed course from a northerly heading to due east. Both of those objects continued until out of sight. July the 3rd at 10:30PM my wife and I were sitting on our front porch watching a large fire works display put on by a group of neighbors when in ten minute intervals 3 objects appeared on the same course heading, apparent attitude and velocity. I observed them through binoculars and noted bright orange core surrounded by an orange aura again with no sound. These three objects then changed course from due north to due east and continued in sight for approximately 5 min until out of sight. I am a retired engineer and have been a pilot for 34 years."],"Latitude":"39.341792","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 13 other sightings in Greensburg","There were no other sightings in Greensburg on or around July 2nd 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.341792,+-85.474941(30025)&iwloc=A&hl=en\"> mufon case (30025) map </A>","Tags":"City"}