{"Summary":"Oval shaped fire like object came in slowly from the West, then hovered over Hudson Lake for a minute, before turning 45 degrees & heading South.","Latitude":"41.700323","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Longitude":"-86.509462","Date of the Event":"07/03/2011 10:30 UTC","Object Shape":"Circle, Cylinder, Fireball, Oval, Sphere, Square, Rectagular, Other, Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Other","Region":"Indiana","divs":["Sighting DetailsMy Mother's friend Marsha and I were sitting on my family's pontoon boat that was docked on our pier in front of our cottage on Hudson Lake, which is located in northwest Indiana. We were sitting out there for about 15 minutes watching the fireworks, as it was July 3rd and fireworks of all shapes & sizes were going off around the lake & in nearby towns - all of which are visible from the water. Then out of the corner of my eye I spotted a very odd looking object coming in slowly from the West. I noticed it because even from far away it looked like a ball of fire floating in the sky. Marsha completely agreed that it was not fireworks (and no, we were not drinking). We just sat there and watched it slowly move closer and closer, until finally it was hovering directly over the middle of Hudson Lake. It hovered there for about a minute. As it got closer, it appeared to be more rectangle in shape and the inside of it gave off a brilliant red flame-like glow, while the outer edge appeared to be grey. It had no propellers & no wings, in fact, it had no appendages at all. After the object hovered for a minute, it made a complete right turn and headed South...slowly at first, but then after about 30 seconds it sped way up, and poof it was gone. Both Marsha & I knew without question that it was a UFO. I knew it from the second I laid eyes on it...I mean, I look at the sky all the time & in my 38 years had NEVER seen anything even remotely close to it. Marsha is much older me, and she too said that she'd never seen anything like it & completely agreed with me in my assessment. The whole time we were watching it, we just kept saying to each other, can you believe what we are seeing?!?! My Mother then came down to the boat & we explained to her that we had just seen a UFO. She brushed us off, said we were CRAZY...that it had to have been fireworks. I assured her that fireworks don't travel horizontally slowly for miles & then hover in one spot & then make 45 degree turns & continue traveling in another direction. Strange thing though, about an hour later - when both Marsha & I were no longer around - my Mother and Aunt Donna said they saw the exact same thing from our deck (which overlooks our pier & Hudson Lake). However, they said the object came in from the South (which is the last direction Marsha and I saw it traveling). They said it came in slowly, and that it then hovered over the middle of the lake. However, this time it appeared to be a green ball of fire, not red. They said that after about a minute of hovering, a smaller oval looking ball of green fire descended from it, and when it did, there appeared to be yellow rope-like strings attached to it from the main object. They said the smaller object hovered for a moment below the larger one, and then plunged very fast into the lake & disappeared. The main larger green fire-like object then turned left and headed back out West towards LaPorte, IN. Both said they have absolutely no idea what it is that they saw...nor are they able to explain it or make any sense of it. And I told them, \"Hence the term UFO.\" Also, I asked our lawn boy (John K.) when he came by this morning if he happened to see anything strange in the sky the night of July 3rd. He said, yes, in fact he did. He was watching the fireworks with a friend that night from Hudson Lake's public beach, and he said they both noticed what looked to be a bright moving fireball in the sky...but then they lost sight of it, and just started watching the fireworks again. He said they weren't sure what it was."],"Tags":"City","Date Submitted":"07/06/2011 06:15 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30027.html.txt","/var/www/straped/mufon/org/30027.html"],"City":"New Carlisle","Log Number":"US-07062011-0020","Case Number":"30027","map":"<A HREF = \"http://maps.google.com/maps?q=41.700323,+-86.509462(30027)&iwloc=A&hl=en\"> mufon case (30027) map </A>","Disposition":"Unknown","Country":"United States","Weather Factors":"None, Medium, Does Not Apply","Source":"MUFON","trends":["There have been no other sightings in New Carlisle","This sighting has never been favorited."]}