{"City":"Lancaster","Object Shape":"Blimp, Egg, Sphere","divs":["Sighting DetailsMe and my mother was at the firework show in lancaster ohio. About 30 minutes before the fire works start (around 9:30ish) Me and my mom saw this floating orange ball in the sky, the glowing of the orange ball was pulsating, we spotted it from a distance as it moved closer to us, still with the orange glow pulsating. we knew it had to have been moderately high in the air because the object kept going behind clouds that appeared to be very high in the sky, and you could still see the glow (Faintly) behind the clouds. It was moving in and out of the clouds. Witnesses beside us said it was a candle tied to a balloon, or a japanese lantern, which i started to think \"oh yeah that makes sense\" but, the orange ball continued to pulsate and then the orange ball started slowly dimming, which i thought was the candle going out due to lack of oxygen. The weird thing was though that as soon as the orange glow went out there was a bright blue flash immediately followed by a bright white flash, (and the flashes werent like the flash of a firework) the object disappeared for a minute, then the orange glow reappeared and continued to pulsate again for a few minutes. as it was approaching above our heads, the object stopped glowing, but you could see the silhouette of the object in front of the blue sky. It looked like an oddly shaped blimp or something, still hovering above us. Then it floated out of sight. I thought maybe i was crazy or hallucinating but my mom saw the exact same thing i saw, we thought there was another explanation until the blue and white flashes. We would have recorded a video but my moms phones battery was dead. There may have been more witnesses due to the large crowd of people at the fairgrounds for the fireworks, and people all over lancaster watching fireworks."],"trends":["There have been 8 other sightings in Lancaster","There were no other sightings in Lancaster on or around July 4th 2011"],"Viewing Distance":"Unknown","Date of the Event":"07/04/2011 09:30 UTC","Country":"United States","Disposition":"IFO","Weather Factors":"None","Summary":"Floating orb that glowed pulsating orange, stoped glowing, emitted white/blue flash, glowing reappeared, then went out.","Tags":"City","files":["/var/www/straped/mufon/html2text/30024.html.txt","/var/www/straped/mufon/org/30024.html"],"Case Number":"30024","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.718545,+-82.596259(30024)&iwloc=A&hl=en\"> mufon case (30024) map </A>","Region":"Ohio","Latitude":"39.718545","Object Flight Path":"Hovering then path","Sighting Duration":"00:15:00","Longitude":"-82.596259","Date Submitted":"07/06/2011 03:13 UTC","Log Number":"US-07062011-0018","Source":"MUFON"}