{"Tags":"City","Longitude":"-78.872279","Weather Factors":"Unknown","Case Number":"30029","Object Shape":"Fireball, Saturn-like, Star-like","Summary":"Reddish/Orange Stationary Light Balls","Object Flight Path":"Stationary","Latitude":"42.889477","files":["/var/www/straped/mufon/html2text/30029.html.txt","/var/www/straped/mufon/org/30029.html"],"divs":["sighting detailsmy husband and i just returned after watching fireworks, and was admiring the neighbor's display when a bright orange\\red fireball caught my eye. it was due east in the sky above the tree line. it looked like 5 of the brightest stars you would see in the sky combined. we really didn't know what to think. it remained stationary and got brighter, the began to slowly fade, like it was slowly turning around (180) while stationary. my husband joked (who has never seen any lights before while i have) and said \"there's your ufo\" and began heading toward the door which is west. he then froze and said \"would you look at that!\" in the nw sky were four more orange lights exactly like the one due east. the four were the same brightness and color, but momentarily got bigger as if they were getting closer. my husband went into the house (i think he was scared) and i continued to watch...they stopped getting bigger and began fading. but as i noticed they were fading not because of turning around like the due east on but the were ascending straight up and were getting dimmer because of their ascent. everything took about a minute."],"Region":"New York","Source":"MUFON","Date of the Event":"07/04/2011 09:45 UTC","Object Features":"Unknown","City":"Buffalo","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around July 4th 2011"],"Log Number":"US-07062011-0023","map":"<A HREF = \"http://maps.google.com/maps?q=42.889477,+-78.872279(30029)&iwloc=A&hl=en\"> mufon case (30029) map </A>","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Date Submitted":"07/06/2011 10:11 UTC","Country":"United States","Disposition":"IFO"}