{"Latitude":"37.47715","Object Shape":"Other","Country":"United States","Object Features":"Undisclosed","Source":"MUFON","divs":["Sighting Details20 or so glowing golden orb-like lights traveling from west to east turning south and fading in the distance. Local fireworks were winding down. I was in the front yard by the street talking to a neighbor. I saw these very bright lights coming from the west through the trees. They were even brighter than say the ISS when it is coming up over the horizon. The lights(orbs?), were randomly spaced apart it would seem,(see video). They would continue heading east for a couple of minutes, traveling very slowly, and then they would seem to turn and head south till they faded from view. The video is pretty poor, the turning and heading south is not picked up on the video. Someone in Southern Cal., also posted a very similar event that occurred at the exact time, 350 miles away. The objects I saw were approx. 8-10 degrees above the horizon only. If the objects that I saw are the same objects videoed in Carson Cal., I believe that would mean that they were \"very\" high. But I don't know."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date of the Event":"07/04/2011 10:30 UTC","Log Number":"US-07072011-0002","Longitude":"-121.126306","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/30032.html.txt","/var/www/straped/mufon/org/30032.html"],"trends":["There has been one other sighting in Patterson","There were no other sightings in Patterson on or around July 4th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=37.47715,+-121.126306(30032)&iwloc=A&hl=en\"> mufon case (30032) map </A>","Summary":"20 or so glowing golden orb-like lights traveling from west to east turning south and fading in the distance.","City":"Patterson","Tags":"City","Case Number":"30032","Viewing Distance":"Unknown","Date Submitted":"07/07/2011 12:39 UTC","Region":"California"}