{"Latitude":"41.938774","files":["/var/www/straped/mufon/html2text/30034.html.txt","/var/www/straped/mufon/org/30034.html"],"Tags":"City","City":"DeKalb","Country":"United States","Summary":"A fast moving object was seen from an amateur astronomy observing site. It covered about 25 degrees of arc horizontally in 5 seconds.","Case Number":"30034","Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:05","Date Submitted":"07/07/2011 03:35 UTC","divs":["sighting detailsthe object was observed from a forest preserve at (location removed placed below) with an elevation of 836 feet above sea level as indicated by the google earth program. [please do not call the forest preserve district as they might end the observing privileges of the amateur astronomy club that was there that evening] the object was visible in the ne sky about 15 degrees above the horizon (+\\- 5 deg.) and was first noticed at an azimuth of about 20 degrees (nne). it disappeared into haze at an azimuth of about 45 degrees (ne). no noise came from the object and it appeared to be self illuminated. direction of travel was from west to east at a constant height above ground. additional information: - steady point light source; brightness about same for entire event; not a firefly. same brightness as bright satellite but not quite as bright as international space station (iss) or an iridium flare. - no meteor tail or streak - angular size estimated at less than 0.5 degrees of arc. - no airplane navigation or landing lights - distance to object not known, but could have been near i-88 or state route 38 (lincoln highway). - international space station tracking and location was checked. this object was not the iss. - brightness was too steady to be an iridium flare my reaction to this sighting is that it could have been a probe device (no occupant) which have been seen in the area before, such as near marengo, il. common objects fitting the above description must be fairly limited in number. if the object was near the above mentioned highways at a distance of something like 6 miles its speed could have been in excess of 2000 miles per hour. no photos were taken. other individuals present did not notice the object and were preoccupied with hobby concerns."],"Date of the Event":"07/03/2011 01:00 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Longitude":"-88.743065","trends":["There has been one other sighting in DeKalb","There were no other sightings in DeKalb on or around July 3rd 2011"],"Object Features":"Unknown","Region":"Illinois","Log Number":"US-07072011-0004","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.938774,+-88.743065(30034)&iwloc=A&hl=en\"> mufon case (30034) map </A>","Object Shape":"Star-like"}