{"map":"<A HREF = \"http://maps.google.com/maps?q=36.232636,+-80.708121(3003)&iwloc=A&hl=en\"> mufon case (3003) map </A>","Case Number":"3003","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","trends":["There have been 2 other sightings in Boonville","There were no other sightings in Boonville on or around June 15th 1962"],"files":["/var/www/straped/mufon/html2text/3003.html.txt","/var/www/straped/mufon/org/3003.html"],"City":"Boonville","Tags":"City","Summary":"Close up, detailed, long viewing time","divs":["Sighting DetailsMy father and Uncle took me along on an evening fishing trip. I have clearmemories of this evening...even to the clothes I was wearing. I remember I satin the ashes of a previous campfire and my father told me that my mom was goingto spank me for ruining my clothes.We were sitting on the river bank with my father on my right side and my Uncleon my left. My Uncle had a clear space on his left, but my father had a largetree oak on his right. It was leaning out over the water as river-bank trees arewont to do. As a result of this every so often, my fathers line would snag inthe overhanging tree branches. He would curse and reel the line back in.Although there were trees to the sides of our spot, there were none directlyover head.My father had just cast his line and it must have snagged a tree branch, becausesomething made him look up. I felt him go very still. He nudged me and said K.,look up. I looked up and directly over our heads was a very large flying saucer.It looked as big as a house....bigger. I could see that it was bigger than therelative size of the large tree beside my father...even at the height it was at.Which seemed to be not much higher than the tree top.The sky was black and there was no moon that I recall or could see, but I couldsee this object very clearly. Obviously it was round. It had 6 round whitelights on the bottom. 5 surrounding one, all the same size, and the 5 rotatedcounter-clockwise. It was dead silent. It was a silvery pewter color. Not shiny,and as I recall with....seams in the metal. In other words, it was not aperfectly smooth skin. I knew I was seeing something extrodinary, but I wasntthe least bit frightened. We watched it as it crossed the river. As it got abouthalf way across, I saw that it was a shallow dome, like a lens. But instead of asmooth top, it had a little bump on top. A true dome that sat in the center ofthe ship. One the right upper side of the dome was a white light. The color ofan incandescent light bulb. in contrast to the lights on the bottom which lookedmore bluish and did not shine like a light.It crossed the river slowly and moved on a little further. Then it hovered forjust a moment. Then it just dropped slowly into the woods. I looked at myfather. He was still looking across the river. I guess they figured that theywere far enough away, because as I recall"],"Source":"MUFON","Date of the Event":"06/15/1962 08:00 UTC","Object Shape":"Unknown","Latitude":"36.232636","Log Number":"","Region":"North Carolina","Date Submitted":"06/15/1962 08:00 UTC","Viewing Distance":"21-100 Feet","Object Features":"Dome, Window(s)","Longitude":"-80.708121","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"00:10:00"}