{"Source":"MUFON","Longitude":"-84.406178","Object Features":"Undisclosed","City":"Forest Park","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Summary":"I taped this object going over my place","Date of the Event":"09/06/2010 05:30 UTC","divs":["Sighting DetailsI was outside, and saw this object. I grabbed my camcorder and taped it. I have a Sony DVD Camcorder that uses a 3 inch disc. all the time I leaned against a door frame to tape this object. I used the zoom, it is 24 power. I live near the Atlanta Air Port. I see jets all day and night long. There is a flight path that goes over my place. The time of duration was about 2 minutes. I watched the object go out of sight. It went from west to east. The weather condition was clear, there were no obstructions preventing me from taping the thing. I see planes all the time, some are high altitude and have a trail. It is not too difficult to see a plane ahead of the trail. But as you will see, this object had no plane ahead of its contrail. I knew as soon as I saw this thing that it was not normal. It made no sudden turns, or anything, it just went over and out of sight.The event is in two segments. I stopped temporarily to get my tripod, but elected to simply lean against a door frame for steady footage. I sent this report to a friend who has a UFO Investigation Group, but the investigation was very lacking. I had to wait months to get back my disc of the event. This was due to the administrator's unprofessional demeanor."],"Latitude":"33.621281","Disposition":"IFO","trends":["There have been 2 other sightings in Forest Park","There were no other sightings in Forest Park on or around September 6th 2010","This sighting has never been favorited.",""],"Country":"United States","Tags":"City","Case Number":"30037","Date Submitted":"07/07/2011 07:28 UTC","Weather Factors":"Unknown","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.621281,+-84.406178(30037)&iwloc=A&hl=en\"> mufon case (30037) map </A>","Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/30037.html.txt","/var/www/straped/mufon/org/30037.html"],"Log Number":"US-07072011-0007","Region":"Georgia"}