{"Weather Factors":"Unknown","Summary":"UFO sighting over Colorado Springs July 4th 2011","Log Number":"US-07072011-0001","Viewing Distance":"Unknown","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around July 4th 2011","This sighting has never been favorited.",""],"Country":"United States","Source":"MUFON","Latitude":"38.843132","Tags":"City","Date Submitted":"07/07/2011 12:41 UTC","files":["/var/www/straped/mufon/html2text/30031.html.txt","/var/www/straped/mufon/more/30031_submitter_file1__UFOs1.jpg","/var/www/straped/mufon/more/30031_submitter_file2__UFOs3.jpg","/var/www/straped/mufon/more/30031_submitter_file3__UFOJuly42011C3.jpg","/var/www/straped/mufon/org/30031.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.843132,+-104.811593(30031)&iwloc=A&hl=en\"> mufon case (30031) map </A>","City":"Colorado Springs","Object Flight Path":"Hovering then path","Disposition":"IFO","Region":"Colorado","Longitude":"-104.811593","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","divs":["sighting detailshere are two photo collages and photos my husband took on july 4th from the balkony of our home . i asked him to take some pics of the fireworks (since he likes astronomy he is skilled at taking photos of the sky) and when he did so he forgot to change it to 100 sensitivity (which would have made the fire works come out nicer and clear, but washed out the ufos) and instead took them at 800 (which allowed the ufos to show up, we did not see them directly, with our naked eyes). we think that they could not be remnants of the fireworks, or some kind of military aircraft etc and this is because of the way they behaved. one time they hovered (no movement) for over 30 seconds) they also seemed to appear and disappear in and out of some kind of vortex\\hole\\opening, which can be faintly seen on the photos. the reason we know they did not move but hovered at some point is due to no change between photos (one minute inbetween shudder and camera was fixed in same spot on balcony rail) and you can (faintly though) see an airplane passing by below (which in comparison of course did move. 0 the ufos appeared and disappeared within about 5 minutes. blessings!"],"Case Number":"30031","Object Shape":"Egg","Date of the Event":"07/04/2011 09:30 UTC"}