{"Longitude":"-123.076884","City":"Eugene","Country":"United States","divs":["Sighting DetailsLate in the evening during the annual 4th of July holiday fireworks I was standing in my back yard when I noticed a bright orange ball moving through the night sky. This caught my attention immediately because it matched another UFO sighting I had just a few months earlier. The object moved quickly and silently. It appeared beyond the diminishing fireworks going off around the city and had two noticeable features - the orange glow grew and decreased in brightness in a way that made it appear to flicker, and its movement was non-ballistic in that it seemed to jerk forward sometimes pausing and then continuing on. The night sky was perfectly clear. It was easy to discern that the orange ball had no red or green conventional aircraft lights. Also, the bright orange light which at first seemed to be coming toward my general location was equally bright when it gradually turned to the south and eventually first faded and then vanished from sight as it appeared to move south roughly following the path of Interstate 5. The luminosity of the orange glow was far brighter than any star or planet visible at that hour. The magnitude of the object was perhaps 7 to 10 times larger than any other object in the night sky. Several minutes after the object had disappeared, my girl friend came outside and I mentioned the sighting to her just minutes before another bright orange UFO appeared to the east of Eugene. We watched it approach from the east and then like the fist object, it eventually turned to the south with a similar jerky and sometimes brighter, sometimes dimmer appearance. Over the next 30 minutes we watched as another three individual orange UFOs appeared in the east and made their way one by one curving eventually to the south and fading strangely from sight. I mentioned that late in 2010 I had seen another orange UFO from my back yard in Eugene. That sighting lasted only about 30 seconds but the object appeared to be directly over head and at much closer range. I was able to get a good look at the orange ball through moderately powerful binoculars which I had been using to star gaze with. It was moving from north to south silently and appeared to be about as large as the full moon, so it was quite large. I could not determine the altitude, but it seemed to be several hundred yards above me. My magnified look at the orange ball revealed it seemed to be a translucent glowing ball which may have contained an object inside. The surface of the orange sphere seemed to flow with a liquid consistency and was very dynamic. I speculated it might be some kind of high energy plasma field surrounding another object. The object disappeared abruptly by fading from sight. I was in the U.S. Air Force and am accustomed to working flight lines in many parts of the world observing all kinds of sophisticated air craft at night, but seeing these orange UFOs from different perspectives, flight paths, dates, times, and with another witness convinced me that I should report the event. I did not notice other reports about the July 4th sighting in the media, but at that late hour and after so many other holiday fireworks, this did not surprise me."],"Tags":"City","Object Features":"None","Case Number":"30048","Source":"MUFON","Object Flight Path":"Path with directional change","Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/30048.html.txt","/var/www/straped/mufon/org/30048.html"],"Region":"Oregon","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around July 4th 2011"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=44.060619,+-123.076884(30048)&iwloc=A&hl=en\"> mufon case (30048) map </A>","Date of the Event":"07/04/2011 10:30 UTC","Date Submitted":"07/07/2011 07:13 UTC","Weather Factors":"None","Latitude":"44.060619","Summary":"Multiple Bright Orange UFO's appear and follow similar path to the south of Eugene","Log Number":"US-07072011-0018"}