{"Summary":"At 10:15 PM moving from direct north to southeast (lower than planes) a large yellow orange ball moved silently across the sky.","Object Shape":"Cylinder, Sphere","Date Submitted":"07/07/2011 11:17 UTC","Object Features":"Undisclosed","Latitude":"36.939133","Case Number":"30042","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-82.623346","trends":["There have been 4 other sightings in Norton","There were no other sightings in Norton on or around June 29th 2011"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.939133,+-82.623346(30042)&iwloc=A&hl=en\"> mufon case (30042) map </A>","Date of the Event":"06/29/2011 10:15 UTC","Tags":"City","Viewing Distance":"101-500 Feet","Log Number":"US-07072011-0012","Object Flight Path":"Straight-line path","Country":"United States","Region":"Virginia","Weather Factors":"None","divs":["Sighting DetailsFirst event: The night was very clear with no wind. My area was very dark and allowed for excellent visibility. A sphere orange in color (glowing) moved directly from the north across the sky to disappear behind the mt due southeast. It was very low and dropped down behind trees on the southern mt. it was between 200 - 500 ft above my house. Everything was completely silent and moved at a slow steady pace. It was so quiet that i did not hear dogs, frogs or any other sounds. The entire event could have lasted between 5-7 minutes. (possibly a few minutes longer) Within a few moments possibly (10 minutes)a large cylindrical shape moved low over the sky from east to direct west. The shape was orange but we could see underneath there were red glowing lights (3 or 4) in a straight line on the belly of the craft. The lights were steady and glowing. It also appeared to have an angular shape when we watched it disappear...possibly triangular. The event only lasted a few moments (2-4 Minutes) because there is a hill directly west and the object disappeared behind it. Again there was complete silence no craft noise, and no noises at all."],"files":["/var/www/straped/mufon/html2text/30042.html.txt","/var/www/straped/mufon/org/30042.html"],"City":"Norton"}