{"Viewing Distance":"Unknown","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/30041.html.txt","/var/www/straped/mufon/more/30041_submitter_file1__IMG_0579.JPG","/var/www/straped/mufon/more/30041_submitter_file2__IMG_0580.JPG","/var/www/straped/mufon/org/30041.html"],"Object Flight Path":"Undisclosed","Tags":"City","trends":["There have been 4 other sightings in Elizabeth City","There were no other sightings in Elizabeth City on or around July 1st 2011","This sighting has never been favorited.",""],"Date of the Event":"07/01/2011 12:17 UTC","Summary":"White cigar-shaped with bulges near ends object, taller than trees & 4-5 times longer, maybe 250' X 1000'","Object Features":"Undisclosed","Longitude":"-76.243086","map":"<A HREF = \"http://maps.google.com/maps?q=36.297271,+-76.243086(30041)&iwloc=A&hl=en\"> mufon case (30041) map </A>","Case Number":"30041","Country":"United States","Object Shape":"Blimp, Cigar","Disposition":"IFO","Date Submitted":"07/07/2011 09:49 UTC","Latitude":"36.297271","Sighting Duration":"Undisclosed","Log Number":"US-07072011-0011","Source":"MUFON","Weather Factors":"None, Unknown","City":"Elizabeth City","divs":["sighting detailsthree of us were on a sailboat in the albemarle sound (north carolina) in route from manteo (departed near 9:45 a.m.) to coinjock (nnw). we were motoring at 7.5 nautical miles per hour & had passed kitty hawk to the east at 10:50 a.m. on july 1, 2011. i believe that we were southeast of the mouth of the pasquotank river. we were constantly scanning the water watching for crab pots, debris, sailing markers, etc and hoping to see dolphins. around noon i saw in the distance (nnw, 3-5 miles) a very large white shape, rectangular with rounded ends. it was so pale it blended with the skies & water but was distinct from the nearby trees. there was some smoke from the peat fires to the east so the view was not the best. i studied the sight with binoculars & didn't have a clue about what i was seeing. i pointed it out to the other sailors who also looked and had a similar reaction. we could not determine if the object was hovering, floating, teetered or otherwise secured. it did not seem to move. i took two pictures though it was very hard to see the object in the lens. i zoomed out (shutter speed 1\\1250; focal length 60.0 mm) in the direction i was looking & clicked twice. remember, we were on a boat so holding a camera steady is a challenge! the first picture shows the complete object that we estimated was over 200 feet tall and 1000 feet long. the second picture shows the object partially hidden by trees. (the object was not moving; our boat was taking us out of sight of it as we continued our trip.) look closely in the trees to the right & see a house to get perspective of the size. we wondered if it was a blimp since we had seen a blimp and blimp hangar on june 21 when we were leaving elizabeth city. but, it was much larger and a different shape from any blimp we could recall. the bulges on either end of the object and the lack of \"fins\" plus the sheer size of it made us doubt that possibility. also, there were dark squares that appeared to be windows near the mid-line along the right side of the object. at the time we were wondering what it was, trying to figure it out, knowing we had never seen anything like it. we were curious but assumed there was a logical explanation. we chose not to investigate further as we were meeting friends and wanted to get to port before any afternoon showers might appear."]}