{"Summary":"4+ lights lingering in sky","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.755269,+-117.240675(30059)&iwloc=A&hl=en\"> mufon case (30059) map </A>","Object Features":"Unknown","Source":"MUFON","Date of the Event":"07/04/2011 08:00 UTC","files":["/var/www/straped/mufon/html2text/30059.html.txt","/var/www/straped/mufon/org/30059.html"],"Country":"United States","Object Shape":"Star-like","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around July 4th 2011"],"Tags":"City","Region":"California","Object Flight Path":"Other,Unknown","City":"San Diego","Latitude":"32.755269","Log Number":"US-07082011-0006","Case Number":"30059","Weather Factors":"None","Longitude":"-117.240675","Date Submitted":"07/08/2011 12:33 UTC","divs":["Sighting DetailsIt was fourth of July, and my gf and I went to the beach to relax and watch the fireworks later that night. A couple of my friends joined up with us later in the afternoon. As nighttime came about, I first noticed 3 lights coming from the north. They were aligned to each other and looked like lights from a cellphone tower, and the only reason why I took notice was because they weren't flashing like they usually do, but were consistently on. I mentioned them to my friend, who dismissed them as probably airplanes. As the night progressed, about half an hour later, I looked back to them, and they were slowly moving in different directions. This was when I knew it was something strange. It couldn't have been airplanes because they would've been gone by that time. About another half an hour passed and I noticed another light in the same area. I started to check up on them more often, and started seeing their lights slowly fade in and out, which made me wonder how many there actually were. I remember joking to myself, \"They picked a bad night to come. The fireworks are about to start, and they might get hit or think we're attacking them.\" Soon after, the fireworks started, and I completely forgot about the lights until after the celebrations were over. I looked back about an hour later and they were gone. Unfortunately, no video or photos were taken, because my cell phone camera wouldn't have picked them up."]}