{"divs":["sighting detailsat sunset i was in an open area near my house taking pictures of the crescent moon against the setting sun to test my camera settings. the fireworks were to the north, 3 spherical orange\\pink objects suddenly appeared in the western horizon at approx 35 degrees and i thought it was fireworks but they didn't explode but continued to travel east while ascending until they were directly overhead of me and grew further apart with several others following in primarily a straight line, too stunned to get a picture, i ran home to get my daughter and nephew as i couldn't believe what i was seeing. we watched as they grew fainter as they reached the 90 degree point and disappeared. my daughter was able to get 2 pictures after they had started to separate and more glowing white rather than in the original color so perhaps the setting sun influenced their initial color. of course my camera battery died. we all got very little sleep that night and i'm still stunned. there were so many of them i don't understand why there wasn't some sort of media coverage. and no, it wasn't chinese lanterns, they moved too rapidly and in formation."],"Country":"United States","City":"Rochester","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/30052.html.txt","/var/www/straped/mufon/org/30052.html"],"Date Submitted":"07/07/2011 08:44 UTC","Case Number":"30052","Log Number":"US-07072011-0022","Disposition":"Unknown","Tags":"City","Latitude":"43.16617","Object Shape":"Sphere","Object Flight Path":"Straight-line path,Path with directional change","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=43.16617,+-77.605642(30052)&iwloc=A&hl=en\"> mufon case (30052) map </A>","Longitude":"-77.605642","trends":["There have been 53 other sightings in Rochester","There was one other sighting in Rochester on or around July 4th 2011"],"Summary":"3 in triangle at first then spread others about a dozen followed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"07/04/2011 12:00 UTC","Sighting Duration":"Undisclosed"}