{"Latitude":"24.661336","Date Submitted":"08/08/2011 07:55 UTC","Sighting Duration":"Undisclosed","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=24.661336,+-81.44485(30063)&iwloc=A&hl=en\"> mufon case (30063) map </A>","Region":"Florida","City":"Summerland Key","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","divs":["Sighting DetailsMy friend and I had just (within 15 minutes) driven home from Key West. We did not see anything at all in the sky, and ever since I saw something bizarre last year, I don't take my eyes off the sky. When we arrived home, I commented on the lack of light pollution in the area, and said I would come back outside after putting my things down. There was nothing in the sky at this time. A few minutes later, I walked outside, into the drive way, and looked around. I saw two red lights blinking in a one-two one-two pattern. I assumed that it was a tower of some sort. Then they moved to the right, and the flashing began to happen simultaneously. I then text-messaged my friend that rode with me to come outside. She came out and watched the lights with me and it began to become apparent that this was a rather unusual light show. The lights began to flash a third light, randomly it seems, slightly lower than the other two. The patterns of the blinks began to vary, without pattern. Sometimes simultaneous, sometimes with a second of no lights in between, sometimes one right after the other, sometimes with a third. At this point, after discussing the possible options of what it could be, we decided to walk closer. We walked maybe 4 houses down, only to become frightened and turned around. It looked like it was coming closer. As I turned to head towards the house, I saw a white orb flash brightly in the sky opposite the object, and when I turned back, a faint beam of light flashed beside the red. I tried to take video but the lights would not show up on the phone, so it's a recording of my friend and myself muttering profanities as we realized this was not manmade. I ran inside to get binoculars and looked through them. It was a very dark and solid object, but I couldn't make out more than that. I watched for over a half hour and now I must be trying to sleep. I feel like I should still be outside watching."],"Country":"United States","Source":"MUFON","Longitude":"-81.44485","Case Number":"30063","Log Number":"US-08082011-0117","files":["/var/www/straped/mufon/html2text/30063.html.txt","/var/www/straped/mufon/org/30063.html"],"Weather Factors":"Unknown","Object Flight Path":"Stationary,Other","Object Shape":"Triangle, Other","Object Features":"Undisclosed","Tags":"City","trends":["There have been no other sightings in Summerland Key","This sighting has never been favorited."],"Summary":"near-stationary red lights with erratic patterns and flashes of white nearby","Date of the Event":"07/09/2011 02:03 UTC"}