{"divs":["Sighting DetailsI Went in to my garden around 8-20pm as i do every night,it was late September a still quiet clear night in 2008. i was looking around and noticed a small round bright light it seemed high in sky moving in a circular movment not fast .my house roof blocked my view.I kept seeing it coming around.It kept same speed and it was moving in a circle but i could only see a bit of circle as house blocked view. I moved around to side of house.i now seen at least two thirds of the circle shape it was moving in and it was not one light.but 4 all same size all bright white moving in a big circle they never changed colour or flashed or strobed and they kept moving around in a big circle moving anti-clockwise they kept equally apart like points on a compass N.E.S.W. I watched for a few minutes and tried to video them on my phone but did not work.I PHONED my brother to tell him what was going on. after another 10 minutes or so the lights started to speed up still in same circle then they stopped and almost immediatly they all flew fast in to middle of circle and a very bright explosion like flash as they collided. pure white no colour. and no noise ,they never made any noise. and then the 4 lights were together and they shot straight out to origanal positions and went fast around again like before and again all flew in to centre and bright white flash and 4 lights together before moving out to circle again this reapeted about 8 or 10 times and then nothing at all in sky? It was between 30 and 40 minutes in total.the lights were about size of my thumb nail.I have no idea what height in sky i felt they were quiet high up 500 feet at a guess!what it was not is a helicopter or a plane i see them all the time and hear them. airport is a few miles away.or chinese lanterns see a lot around here moving on the wind.i went out the next night and was amazed it was same again for about same length of time again between 8pm and 9pm another still quiet clear night and a man and women and a dog walked past my garden fence talking and i could not see them for fence but they seen lights and were bemused as i was . have looked every night but nothing!"],"Latitude":"54.983132","Date of the Event":"09/27/2008 08:18 UTC","Sighting Duration":"Undisclosed","Object Shape":"Circle, Flash","Tags":"City","Log Number":"GB-07092011-0013","Object Flight Path":"Other","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/30075.html.txt","/var/www/straped/mufon/org/30075.html"],"Summary":"4 round white lights moving in a circle then flying in to centre and exploding reforming moving out to circle again reapeted several times 2 nights at same time","Object Features":"None","Country":"United Kingdom","Case Number":"30075","Longitude":"-1.60937","City":"Newcastle Upon Tyne","Date Submitted":"07/09/2011 05:43 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=54.983132,+-1.60937(30075)&iwloc=A&hl=en\"> mufon case (30075) map </A>","Region":"England","trends":["There have been 13 other sightings in Newcastle Upon Tyne","There were no other sightings in Newcastle Upon Tyne on or around September 27th 2008"]}