{"Disposition":"IFO","City":"Wellington","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband and I were driving home from visiting my grandparents in Lake Worth. We were driving North on Seminole Pratt and Whitney Rd. It was probably anywhere between 8-9:30PM, I was riding in the passenger seat watching the fireworks when I noticed 2 large glowing orbs floating in the sky out my side of the window. Unlike the fireworks going off around these were large, did not \"burn out\" like a spark from the fireworks, did not descend, and I couldn't take my eyes off them. I've lived in the area for about 20yrs since I was a toddler and never seen anything like this before. They seemed to fly up and from side to side, they changed shape, dimmed and brightened between colors of orange, yellow and red. I told my husband and he got scared over the way I was reacting. We reached my parents house and I got out of the car and continued to watch them. After about a minute or two they seemed to go higher in the sky, they both went brighter at different times, they finally crisscrossed in the sky, then one seemed to shrink and vanish followed by the other. There didn't seem to be any sounds being made by them. I was shocked and amazed. I wanted to grab my cell phone to get a picture but I was afraid to take my eyes of them they were so amazing. I felt so excited to see them. I've never seen a UFO or anything like this before. We do see a lot of air traffic in our area. Palm Beach International airport is nearby, so is a private country club of private aircraft owners called Aero Club. We see helicopters pretty frequently from the Sheriffs office or Wildlife people or the occasional private helicopter. We live in a rural area so at night you see the sky pretty clearly along with air traffic. From just living out here nearly all my life I can tell you this was no typical airplane or a helicopter. I don't know what it was but I know it shocked me. I was a little afraid to report it but it was so big I figured others must have saw it as well. I thought to report it to MUFON after I did a YouTube search for \"4TH OF JULY UFOs\" and found that other people in other states say they saw similar UFOs in the sky."],"Log Number":"US-08012011-0030","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.622568,+-80.305326(30072)&iwloc=A&hl=en\"> mufon case (30072) map </A>","Country":"United States","Object Shape":"Sphere","Longitude":"-80.305326","Date of the Event":"07/04/2011 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"30072","Source":"MUFON","trends":["There have been 5 other sightings in Wellington","There were no other sightings in Wellington on or around July 4th 2011"],"Latitude":"26.622568","Object Flight Path":"Stationary,Path with directional change,Other","Object Features":"Unknown","Date Submitted":"08/01/2011 05:55 UTC","Region":"Florida","files":["/var/www/straped/mufon/html2text/30072.html.txt","/var/www/straped/mufon/org/30072.html"],"Summary":"2 Bright Orbs 4th of July, 2011"}