{"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Date Submitted":"07/10/2011 12:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.083495,+-122.04903(30095)&iwloc=A&hl=en\"> mufon case (30095) map </A>","files":["/var/www/straped/mufon/html2text/30095.html.txt","/var/www/straped/mufon/org/30095.html"],"Object Shape":"Sphere","Longitude":"-122.04903","Log Number":"US-07102011-0012","Tags":"City","Date of the Event":"07/04/2011 10:17 UTC","Case Number":"30095","Weather Factors":"Unknown","Region":"Washington","Sighting Duration":"Undisclosed","Summary":"Reddish/Orange Sphere in Night Sky and White Object Travelling at High Rate of Speed, stops then sudden course alteration and disappears.","Viewing Distance":"Unknown","Disposition":"Unresolved","Country":"United States","Object Features":"Unknown","trends":["There have been 2 other sightings in Carbonado","There was one other sighting in Carbonado on or around July 4th 2011"],"City":"Carbonado","divs":["sighting detailsfourth of july night and my daughters ages(16-12) were lighting off fireworks out in the street in front of our house. my wife and i had just finished watching a portion of our paychecks go up in a sparkling shower of disappointment. i had walked out into the street to pick up the spent firework and deposit it into our quickly amassing pile of trash. as i stood back up and turned i noticed an object off in the distance glowing reddish orange and white. hovering and moving extremely slowly in a downward and westerly line. i monitored the objects movements using a tree and power line as a source of reference, to make sure that what i was witnessing wasn't just a passenger jet on approach to sea-tac airport. my observations were confirmed when the object got to a certain altitude and then stopped changed direction from downward westerly to 90 degrees and moving in an easterly direction. that is when i called the attention of my two daughters and wife to witness the event with me. i marked the time as 22:21 and then subtracted 5 minutes. now for something interesting during all of this---my family and i were facing north watching the reddish\\orange\\white sphere. i just happened to turn around a full 180 degrees (due south), and happened to notice a white object in the sky travelling from west to east at a high rate of speed. i called everyones attention to what i was witnessing and we all watched as it shot across the sky for approximately 15-20 seconds. the object was at a much higher altitude and i thought maybe it was a satellite or the international space station, asteroid. it definitely was not an aircraft of conventional means. this secondary event happened at 22:27 as i had marked the time of this event and duration. what was interesting was that the object could not have been the space station, because when i checked the nasa and another website, they confirmed the station in orbit over the southern pacific approaching the western coast of chile. another interesting point, the object suddenly appeared travelling at a constant rate of speed then stopped and then just disappeared. careful further deduction also reduces the possibility of an asteroid or space junk as there was no debris tail. i checked with a couple of websites that also track most known satellites and at that current moment there were none in our area or due to be in our area for another 23 minutes. besides the object was to bright to be a satellite to low in the atmosphere and moving to slow. as i was performing the preliminary information search and eliminating possibilities, my daughters and wife were continuing to monitor the first object which had now shifted to a position low in the horizon and staying stationary then moving westerly stopping raising in altitude dropping back down then moving slowly easterly. this activity continued for approximately six minutes longer till 22:49 when the object just disappeared. we tried to video tape the object but it was just to far and too dark."],"Latitude":"47.083495"}