{"Region":"Indiana","Viewing Distance":"Unknown","Date of the Event":"07/04/2011 11:40 UTC","Object Shape":"Circle","Object Features":"Undisclosed","Weather Factors":"Unknown","Tags":"City","trends":["There have been 3 other sightings in Wabash","There was one other sighting in Wabash on or around July 4th 2011"],"divs":["Sighting DetailsI was sitting outside our house with my family, while my dad, brother, and brother's friend were shooting off some fireworks in our backyard. Looking up to see the fireworks, I noticed a ball of orange light moving across the sky, but at first I simply passed it off as an ember falling from the fireworks. A minute or so later, I looked behind me and there it was again, but this time I noticed it was moving sideways, not down, like an ember would do. So I said something to my mom and sister. My brother's friend overheard and commented that it was just some type of balloon, and everyone else seemed to agree. But I wanted to watch it, because I wasn't so sure they were right, and I was curious, especially because of the bright orange color. It would dim occasionally, but not by much, and the way it was moving seemed a little odd. I went through the house into the front yard, because it had moved behind a tree. I stood out front, on the sidewalk, and as I watched, the object slowed down and then came to a stop for a moment. After about ten seconds, it began to move again, but this time very slowly. The flight path of the object was in a semi-circle, beginning in the North and moving to the South. I finally lost sight of it behind another tree. After this, I went back to watch more fireworks, but I was stilling wondering what it was."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.805901,+-85.816471(30099)&iwloc=A&hl=en\"> mufon case (30099) map </A>","Longitude":"-85.816471","Disposition":"Insufficient Data","Summary":"Orange ball of light moving across the sky in a semi-circle","Source":"MUFON","Country":"United States","Object Flight Path":"Path then hovering","Date Submitted":"07/10/2011 03:14 UTC","Case Number":"30099","Latitude":"40.805901","files":["/var/www/straped/mufon/html2text/30099.html.txt","/var/www/straped/mufon/org/30099.html"],"Log Number":"US-07102011-0016","City":"Wabash","Sighting Duration":"Undisclosed"}