{"Source":"MUFON","divs":["Sighting Details My friend Steve and I were waiting for one of our friend, Jacqui to come over. We decided to go out and sit on the deck as it was a great evening, and we are stargazers by nature so this wasn't out of the ordinary. We had been sitting out there for some time when Jacqui had arrived, and we all moved out to the deck. It was a pretty typical night just discussing the days events, and so on, and Jacqui and I went inside for no more than a minute when Steve was urgently calling me back outside. He kept saying \"Its a UFO, its a real UFO, hurry hurry hurry\". I got very excited and rushed outside, to see a very bright low flying object. I'm assuming it was low flying because of the size of it, looking up into the night sky it was as big around as my index finger meeting my thumb at full stretch. It had the qualities of a star when you looked at it, it didn't really have a definite color to it, it just sort of twinkled. It moved very silently, which we both thought was odd considering how low it seemed to be flying. We watched it for almost 2 minutes trying to figure out what it was, and I had serious chills running down my back. It both frightened me because I didn't know what it was, all the meanwhile finally seeing what I'd always hoped to see. After about 2 minutes, it literally seemed to dissipate into the stars, the large object gradually got smaller, but at an astonishingly quick rate, still remaining silent. When I saw that happen I literally had to sit down because my eyes couldn't believe what they saw. It was absolutely incredible and frankly I couldn't be happier to have seen it. I only wish I had more time to get out a camera."],"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"44.57695","Case Number":"30094","Date Submitted":"07/28/2011 09:27 UTC","Date of the Event":"06/27/2011 12:00 UTC","Object Shape":"Oval, Star-like","trends":["There has been one other sighting in Fife Lake","There were no other sightings in Fife Lake on or around June 27th 2011"],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/30094.html.txt","/var/www/straped/mufon/org/30094.html"],"Sighting Duration":"Undisclosed","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.57695,+-85.350614(30094)&iwloc=A&hl=en\"> mufon case (30094) map </A>","Summary":"Bright Starlike Object Passes By and Zooms Into the Stars","Log Number":"US-07102011-0010","Country":"United States","Region":"Michigan","City":"Fife Lake","Longitude":"-85.350614","Disposition":"Unknown","Tags":"City"}