{"Date of the Event":"07/04/2011 10:27 UTC","Object Features":"Unknown","Summary":"Fast moving object in night sky moving West to East Stops then disappears","Weather Factors":"None","Log Number":"US-07102011-0014","Source":"MUFON","Tags":"City","divs":["Sighting DetailsThis a report on a second unidentified object witnessed by my wife two daughters and myself while monitoring an object in the Northern Sky. At 22:27 PST. My family and I were monitoring the actions of another object in the Northern sky when I just happened to turn around and notice another white object suddenly appear and move across the sky from West to East. The object was high in altitude not orbital altitude perhaps 60 to 100 thousand feet. Too high to be a plane and moving to fast. I thought perhaps it was the space station but it still didn't appear to be bright enough for that yet moving about the same speed. It was easy to determine the object was not an asteroid or space junk as it had no trail and no debris and this object was viewable across the sky far longer than something burning in the atmosphere. I quickly called the attention of my family and pointed out the object, marked the time and duration. We watched the object move across the sky then suddenly disappear. After the event transpired (20 seconds later), we returned to monitor our first object. I instructed my daughters to continue to watch the first object as I then proceeded to my laptop to see what the location of the Space station was (South Pacific-Western Chile), I then checked a couple websites that monitor most if not all satellites (even govt.) nothing along that trajectory reported. Besides I thought it was too low in altitude to be a satellite and to bright."],"Case Number":"30097","Date Submitted":"07/10/2011 01:32 UTC","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-122.0487","trends":["There have been 2 other sightings in Carbonado","There was one other sighting in Carbonado on or around July 4th 2011"],"Disposition":"Unresolved","Latitude":"47.084825","Object Shape":"Sphere, Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=47.084825,+-122.0487(30097)&iwloc=A&hl=en\"> mufon case (30097) map </A>","Region":"Washington","City":"Carbonado","files":["/var/www/straped/mufon/html2text/30097.html.txt","/var/www/straped/mufon/org/30097.html"],"Country":"United States"}