{"Date Submitted":"07/10/2011 01:29 UTC","Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-119.645645","Date of the Event":"07/15/2009 09:20 UTC","divs":["Sighting DetailsI was in my front yard with a friend with binoculars watching the stars. She had the binoculars and saw a UFO. She freaked out and gave the binoculars to me. I saw an object the was shaped like the head of a shovel only rounded in the back. It was like a pale light in color not metallic. It was moving from north to south from the Yosemite National Park area heading toward the ocean. It really didn't appear to be going that fast at first. All of the sudden, it shot straight up on a right angle. It then appeared to stop like it was hiding among the stars, like it was trying to blend in with them. It was 5 times faster than anything I've ever seen before. It moved in like a second. Unbelievable! The weird thing is, I got the sense that it knew we saw it! We where both blow away and excited by this. I'm not one of these people that think everything in the sky is a UFO! I grew up in Tustin CA next to a Marine base (El Toro) a Marine Helicopter base (MCAS Tustin) and John Wayne Airport. I know what military, commerical, and private aircraft look like. This was none to the above! I've had several other sighting but this was the most dramatic."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.33158,+-119.645645(30096)&iwloc=A&hl=en\"> mufon case (30096) map </A>","Region":"California","Object Features":"Undisclosed","Case Number":"30096","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/30096.html.txt","/var/www/straped/mufon/org/30096.html"],"Country":"United States","Summary":"Very strange UFO sighting over Mariposa, CA","Weather Factors":"Unknown","Source":"MUFON","City":"Oakhurst","Tags":"City","Log Number":"US-07102011-0013","trends":["There have been 3 other sightings in Oakhurst","There were no other sightings in Oakhurst on or around July 15th 2009"],"Latitude":"37.33158","Object Flight Path":"Undisclosed","Object Shape":"Other"}