{"Latitude":"51.24195","divs":["Sighting DetailsI had just put our car in the garage and, as I was walking back towards the house, I spotted two orange lights moving at speed through the sky. They were closer than a plane would have been, were much faster and were silent. Also there were no flashing lights, so they were definitely not planes or helicopters. They were heading a north-westerly direction and I saw them to the south of my house, they ended up being obscured by the trees. I ran into the house to grab my camcorder (which was upstairs) and told my fiancee what I had just seen. We looked out of the window and another single light orange flew past, before I had the chance to turn on my camera. This was also flying in the same direction and got obscured by the trees. I went outside with my camcorder and saw another orange light to the north of my house (quite some distance from where the other ones originiated), it was also heading the same direction. I managed to get some brief footage of it, which gives a sense of the speed it was travelling. I tried to zoom in on it but lost focus, got it back in focus again then it was obscured by the roof of our house. At first I thought they were UFO's; then I thought they may have been meteorites - but there wasn't a tail at all. I looked online and saw stories of chinese lanterns however these 4 lights were moving rapidly and the final one came from a totally different direction than the others. I stayed outside for another 30 minutes or so scanning the sky but didn't see any other lights. From the other descriptions I have seen online it seems that people in the USA saw exactly the same lights within about 20 minutes of me seeing them in the UK."],"Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/30090.html.txt","/var/www/straped/mufon/more/30090_submitter_file3__20110709220556(1).jpg","/var/www/straped/mufon/org/30090.html"],"Tags":"City","Source":"MUFON","Case Number":"30090","Region":"England","Longitude":"-0.562259","Country":"United Kingdom","Sighting Duration":"00:05:00","Date Submitted":"07/10/2011 03:21 UTC","Disposition":"Unresolved","City":"Guildford","trends":["There have been 3 other sightings in Guildford","There were no other sightings in Guildford on or around July 7th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=51.24195,+-0.562259(30090)&iwloc=A&hl=en\"> mufon case (30090) map </A>","Log Number":"GB-07102011-0006","Object Shape":"Circle","Summary":"Orange lights moving through the sky at speed","Date of the Event":"07/07/2011 11:00 UTC"}