{"City":"Mt Shasta","Latitude":"41.407677","files":["/var/www/straped/mufon/html2text/30113.html.txt","/var/www/straped/mufon/more/30113_submitter_file1__shasta006.jpg","/var/www/straped/mufon/more/30113_submitter_file2__shasta007.jpg","/var/www/straped/mufon/more/30113_submitter_file3__shasta012.jpg","/var/www/straped/mufon/org/30113.html"],"Longitude":"-122.28511","Region":"California","Viewing Distance":"Over One Mile","Case Number":"30113","Object Features":"Unknown","Weather Factors":"None","Object Flight Path":"Unknown","Country":"United States","Date Submitted":"07/11/2011 12:57 UTC","Log Number":"US-07112011-0002","trends":["There have been 6 other sightings in Mt Shasta","There were no other sightings in Mt Shasta on or around July 10th 2011","This sighting has never been favorited.",""],"Disposition":"Unknown","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Summary":"UFOs spotted with digital camera at Mt. Shasta volcano AGAIN!!!","divs":["Sighting DetailsYesterday (July 9th 2011) I posted on here that I had realized that photographs I had taken on June 27th 2011 of the volcanic Mt. Shasta contained many UFOs. My boyfriend and I decided to head back to Mt. Shasta today (July 10th 2011) to try and spot UFOs either by camera or by naked eye or both. Neither of us saw any UFOs while present at the base of Mt. Shasta. However I was able to get many photos while there. When I came home I zoomed into the photos taken today and ONCE AGAIN there are UFOs present in many of the photos!! I am extremely surprised and I feel compelled to share this again on this site because it is quite amazing. When looking at certain photos, one after another, a few black balls seems to be moving in a semi-consistent direction although I do not have any video.It is almost as if I cannot see whatever the things are with my naked eye. I tried to look hard while I was there to see if I could spot anything out of the ordinary but my eyes saw absolutely nothing."],"Date of the Event":"07/10/2011 01:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.407677,+-122.28511(30113)&iwloc=A&hl=en\"> mufon case (30113) map </A>","Source":"MUFON"}