{"Case Number":"30111","Log Number":"US-07102011-0028","Longitude":"-80.08693","Disposition":"Insufficient Data","Source":"MUFON","Viewing Distance":"Unknown","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/30111.html.txt","/var/www/straped/mufon/org/30111.html"],"Tags":"City","City":"Grove City","Object Features":"Unknown","divs":["Sighting DetailsDuring the night shift, the observer went around to the back side of his workplace to stretch his legs. He went about his usual scan of the sky around the airfield past the stand of trees at the building's rear, starting with the eastern sky, picking out the various blinking traffic lights along the horizon's edge, moving up to the prominent planet further up in the eastern sky, and then turning west where the airfield's beacon sweeps the sky. It was noticed then, that an object was moving with a north to south trajectory. The object had a brightness similar to the planet seen earlier, but its movement was much more noticeable than a planet's would be. At first, it appeared to be a low-flying plane with its landing lights on--perhaps just taking off or preparing to land at the nearby local airport. However, the object did not have the usual red and green running lights illuminated. After a brief moment (2 to 3 seconds) of observation, the object's white light increased in luminosity, increasing over a period of approximately 5 seconds, approaching the brightness of a full moon. It seemed similar to what might occur if a plane, as mentioned above with its landing lights were on, changed trajectory towards the observer. The object remained bright for a brief moment (about a second) then quickly faded to being dimmer than the background stars. At that time, the observer lost track of the object. During this event, the velocity and trajectory of the object both appeared constant, and no engine noise could be heard. It should be noted that the observer has witnessed small planes land at the nearby airfield during the night, and engine noise was always noticeable as the plane neared or departed."],"Summary":"Meteor-like with relatively slow velocity and straight trajectory","Date Submitted":"07/10/2011 11:21 UTC","Object Shape":"Flash, Sphere, Star-like","trends":["There have been 5 other sightings in Grove City","There were no other sightings in Grove City on or around July 10th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.167408,+-80.08693(30111)&iwloc=A&hl=en\"> mufon case (30111) map </A>","Sighting Duration":"00:00:20","Country":"United States","Date of the Event":"07/10/2011 04:10 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Latitude":"41.167408"}