{"Viewing Distance":"Unknown","Date of the Event":"07/10/2011 10:50 UTC","Object Shape":"Star-like","Latitude":"38.759634","Longitude":"-121.286466","Region":"California","Case Number":"30115","Summary":"Four star-like dots, flying in V formation, last seen as one of them dropped straight down like a shooting star","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around July 10th 2011"],"Disposition":"Unknown","divs":["sighting detailswas in my pool, looking at the sky for satellites and noticed the object(s). four star-like dots flying in v formation east to west in the northern sky. were very close together, moving too fast for an airplane (appeared to be much higher than a plane would be anyway) and too fast for satellites. i only saw it for 4, maybe 5 seconds. as it disappeared, i saw what i first thought was a shooting star going straight down from where the object was, almost a 90 degree angle from the direction the objects were going. my attention shifted to that single object as it fell and then disappeared behind the neighbors house. when it did, i tried to find the other objects and they were gone. after thinking about it, i realized that there was no trail on the shooting star, just a bright dot of light falling. the first four objects weren't very bright, maybe \"medium brightness star-like\". the object that fell downward was much brighter, more \"planet-like\". at first thought i believed i was looking at an owl (bright moon out tonight and i thought it was simply reflecting on a bird). but after a second i realized it wasn't a bird and that's when i realized it was much higher than a plane would be, almost like they were in orbit. i stayed in the pool another 10 minutes to see the objects would appear again. after that, i really got nervous\\scared over what i had seen and went inside. it's 2:00am and i'm wide awake. i don't think i'm going to get much sleep tonight. i've always hoped to see something like this, but now that i have, i'm a little freaked out."],"Log Number":"US-07112011-0004","Sighting Duration":"00:00:05","City":"Roseville","files":["/var/www/straped/mufon/html2text/30115.html.txt","/var/www/straped/mufon/org/30115.html"],"Weather Factors":"None","Tags":"City","Date Submitted":"07/11/2011 05:10 UTC","Object Features":"Unknown","Country":"United States","Source":"MUFON","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=38.759634,+-121.286466(30115)&iwloc=A&hl=en\"> mufon case (30115) map </A>"}