{"Weather Factors":"None","Longitude":"-89.066749","Case Number":"30120","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.215868,+-89.066749(30120)&iwloc=A&hl=en\"> mufon case (30120) map </A>","Object Shape":"Square, Rectagular, Unknown","City":"Tonica","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsWe were traveling north on I39 as we approached the Tonica exit, we noticed several objects, black against the evening sky, to the western horizon, presumed them to be helicopters, as we've seen a helicopter convoy through that area once before. A few miles further on I had been watching this current convoy as far as we could before the terrain blocked them out. As we got off at the first LaSalle exit, heading north, I looked to the skies towards where the convoy would have been, and then an odd lighted object; higher, slightly closer, I had my camera, and took a picture (picture 1) before loosing sight of it as we descended into the valley. Did not see it anytime beyond that point in the daylight. A couple hours later we are heading south on I39 heading home, as we approached the Tonica exit, I looked to the west and the activity was still in progress, I took a photo of the object, even closer at this point, still a couple miles out. The \"helicopters\" if that is what they were, were much closer, half mile or less, and seemed to be lifting off from the fields. surrounding the object in the sky, the object had a large whitish rhomboid light, (looks rather greenish on film), with depth to it, like a large chamber, and a red light to either side and slightly behind, the whitish light. It was slowely weaving back and forth so sometimes both red lights were visible other times only the one. I took a few pictures, would check the picture and delete it if it was too blurry I only had a few spots left on the SD card. I got one good nighttime close up (picture 2), and then its lights went out. I had my wife stop the car, and I got out; on the interstate to take a couple of pictures of the lifting off \"helicopters\". I took two more pictures, a still photo (not sent), and a 30 second time lapse of the area (picture 3), I set the camera on the hood of the car, it was still running, so the picture is a bit jumpy but not as jumpy as it would seem please note by looking at the centered ascending lights, then note how much smoother the plane trajectory is in the upper left of the timelapse, this compared to the wild movements of the closer two lights. Once they got to their altitude they moved off in near opposite directions. The other \"helicopters\" are further away to the far right of the picture and did not get on film, they were further away and behind the main object. Note I never really heard the helicopters, it was still busy on the interstate, only 7pm or a slight bit later, but they were close enough I should have heard something, but I didn't. they moved off for awhile,the light intensities remained constant, then as one, they shut off their lights as well. No strobes on any of the \"helicopters\" anywhere, anytime. The whitish light with the red light which has gone black in picture 3, would have been to the right (north) of the near objects lower than the gray horizontal squiggly (center right), and an entire squiggly length behind the horizontal sqiggly."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Other","Latitude":"41.215868","Object Flight Path":"Stationary,Hovering then path","Region":"Illinois","Country":"United States","files":["/var/www/straped/mufon/html2text/30120.html.txt","/var/www/straped/mufon/more/30120_submitter_file1__052.JPG","/var/www/straped/mufon/more/30120_submitter_file2__091.JPG","/var/www/straped/mufon/more/30120_submitter_file3__088.JPG","/var/www/straped/mufon/org/30120.html"],"trends":["There have been no other sightings in Tonica","This sighting has never been favorited."],"Tags":"City","Date of the Event":"11/01/2010 05:00 UTC","Summary":"Unknown object sighted along with heavy \"helicopter\" activity I39 S of LaSalle","Date Submitted":"07/11/2011 01:27 UTC","Log Number":"US-07112011-0009"}