{"Object Features":"Undisclosed","divs":["sighting detailsi was outside around 4 to 430 a.m. on 7\\11\\11. i am new to writing this stuff down so i am not quite sure of the exact time. i went out for a cigar. i looked up in the sky directly above me and noticed a very faint yellowish light high in the sky. i was really studying it because i was in the air force and have a base near by and this light did not seem to be any plane i had been familiar with. it was going faster than i thought it should. it was really high so i was also trying to tell if i could see if this yellowish white orb light was pulsating like a strobe light or if there was a red and green light near for the wings. there was not. then the light vanished completely and suddenly while i was watching it. now there was no clouds in the sky and i had visible stars in the vicinity of the disappearance. for reference i was staring at the northeast sky. then out of the corner of my eye to the east i see a flash and turn to see if i can see it clearly but it is not there. within 10 seconds a very bright light in a sort of orb shape lights up it jumps a short distance very fast and disappears. this orb like light is way bigger than the one i first saw but it is also lower in the sky. it also appears white whereas the first looked dim and yellow. i stayed outside for about 10 minutes then went inside and told my wife to come and watch with me. she thought i was crazy but went out for about 2 minutes. i stayed outside a good 45 minutes without anymore events. i went out last night too with out anything happening."],"Object Shape":"Flash, Sphere, Other","Viewing Distance":"Unknown","Source":"MUFON","Case Number":"30122","Date of the Event":"07/10/2011 04:30 UTC","Summary":"Watched a small dim orb light then two bright flash orbs.","Disposition":"Unresolved","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-92.014394","Date Submitted":"07/11/2011 02:51 UTC","City":"Cabot","Object Flight Path":"Undisclosed","Tags":"City","Latitude":"34.976722","Region":"Arkansas","files":["/var/www/straped/mufon/html2text/30122.html.txt","/var/www/straped/mufon/org/30122.html"],"Log Number":"US-07112011-0011","trends":["There have been 3 other sightings in Cabot","There were no other sightings in Cabot on or around July 10th 2011"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.976722,+-92.014394(30122)&iwloc=A&hl=en\"> mufon case (30122) map </A>"}