{"Log Number":"US-07122011-0004","City":"Auburn","Date of the Event":"10/31/2010 08:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/30135.html.txt","/var/www/straped/mufon/org/30135.html"],"Source":"MUFON","Object Features":"None","Sighting Duration":"Undisclosed","divs":["Sighting DetailsHalloween night, 2010. Was out walking with friends who were escorting their children while out trick-or-treating. Clear sky. Happened to look up and noticed Venus high in the sky. Then something else caught my eye. It was a pill-capsule shaped, luminous object that was moving from South to North. Estimated altitude about 2000-3000 feet (best guess). The UFO was \"staggering\" across the sky as it traveled. It was traveling at maybe about 100 knots (estimated, based on the rates of travel of some light aircraft I also observed in the viscinity), and it was changing course as it moved. It did not appear to change altitude, only course. The changes appeared random, and did not seem to involve changes to airspeed. The best way I can think of to describe its motion was that it was flying as if it was drunk -- following the same general path, but with many course corrections. I was able to track it for a few minutes before it passed beyond the horizon. One other witness also saw it, and in fact asked, seriously, \"Are you watching the UFO?\" At first, I thought it might have been something else until I realized that it looked EXACTLY like one I had previously reported to MUFON a couple years ago that I saw in August of 1976 over Henry Country, Georgia. It was reported via this same form (although the other form had more options), under the same name and email, so it should be in the records, although I do not know the case number."],"Case Number":"30135","Weather Factors":"None","trends":["There have been no other sightings in Auburn","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Date Submitted":"07/12/2011 01:07 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Longitude":"-83.827676","map":"<A HREF = \"http://maps.google.com/maps?q=34.013718,+-83.827676(30135)&iwloc=A&hl=en\"> mufon case (30135) map </A>","Latitude":"34.013718","Summary":"Pill-capsule shaped luminous UFO meandering across sky.","Object Shape":"Oval","Disposition":"Unresolved","Region":"Georgia"}