{"City":"Casper","Case Number":"30142","Country":"United States","Log Number":"US-08082011-0074","files":["/var/www/straped/mufon/html2text/30142.html.txt","/var/www/straped/mufon/more/30142_submitter_file1__IMG_0025.JPG","/var/www/straped/mufon/more/30142_submitter_file2__IMG_0015.JPG","/var/www/straped/mufon/more/30142_submitter_file3__IMG_0012.JPG","/var/www/straped/mufon/org/30142.html"],"Latitude":"42.872422","Tags":"City","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","Summary":"Object not visibly seen , moved through series of photos taken on a walk in the park.","Sighting Duration":"Undisclosed","Date Submitted":"08/08/2011 01:44 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.872422,+-106.305501(30142)&iwloc=A&hl=en\"> mufon case (30142) map </A>","Disposition":"IFO","Object Shape":"Unknown","divs":["sighting detailswe were walking through the park, taking pictures as we always do of nature, trees, clouds and sun shining through trees and sometimes animals as well. towards the end of our walk i wanted to take a few more pictures of the sun because on our last walk i had done this and the sun shone through the trees very dinstinctly and made really neat pictures. we had not noticed that the camera captured an image (octagon type) until we downloaded the pictures onto the computer, then looking at them closer, we noticed that the object also seemed to be moving. we decided to zoom into the object and in one of them, noticed that there seems to also be an image inside the octogonal shape. upon checking the camera, we found that it was not on any special image setting\\feature. all the other pictures were normal from what we could tell. none of the pictures have been digitally enhanced or messed with in any way."],"Date of the Event":"07/09/2011 12:00 UTC","trends":["There have been 10 other sightings in Casper","There were no other sightings in Casper on or around July 9th 2011","This sighting has never been favorited.",""],"Region":"Wyoming","Longitude":"-106.305501","Viewing Distance":"Unknown"}