{"Viewing Distance":"Unknown","Object Shape":"Triangle, Other","Log Number":"CA-07122011-0012","Tags":"City","Region":"British Columbia","Case Number":"30148","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=49.100335,+-122.650094(30148)&iwloc=A&hl=en\"> mufon case (30148) map </A>","Country":"Canada","Sighting Duration":"Undisclosed","Date Submitted":"07/12/2011 10:08 UTC","files":["/var/www/straped/mufon/html2text/30148.html.txt","/var/www/straped/mufon/org/30148.html"],"Longitude":"-122.650094","Source":"MUFON","Object Flight Path":"Undisclosed","divs":["Sighting DetailsYesterday, I was on my way home from a friends house when I spotted something odd. I was driving east down 40th avenue and I spotted a light. This was like no man made light, it did not give off any sort of glow and was very bright. As I turned onto 240th street heading north I tried to get a better look at the light, but I kept losing it in the trees and houses to the east. But then came a clearing to the east where I could truly see this was not man made. I made a right onto Robertson Crescent heading east again. That's when it really hit me, this..thing..was much closer than I expected. As I neared it, I could really see all the lights that were a part of this object. I'm not saying this object was a triangle shape, but the lights on the bottom made it look like a triangle. A very bright light on each corner. As I neared even closer I realized it wasn't moving what-so-ever and was completely silent. This was no helicopter. I was about to go directly underneath the object. When I did, I decreased my speed to a crawl, looked up and seen a flurry in the middle of the craft. A flurry which consisted of about 6 very bright different colored lights. As I passed it, and came to the stop sign at Robertson & 248th street, I looked behind me and did not see it. I thought it was gone and would not see it again. As I headed north up 248th, I looked to the west and seen it about a kilometer away moving decently slow heading north. I couldn't take my eyes off of it. Then it really spooked me, it started making very erratic movements. Dashing from spot to spot in the sky. As I continued up 248th, I tried looking, but there was way too many trees to see. I stopped looking and headed home. I was in too much shock to go on. It was hard even to think about it. It was unlike anything I have ever experienced. The experience gave me a very gross feeling, like nothing matters in this world. We know nothing of the world out there. Our planet is a very small peice of the puzzle we call existence."],"Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Triangle shaped flying object(by the light formation) in Langley, BC","Date of the Event":"07/11/2011 10:40 UTC","trends":["There have been 4 other sightings in Langley","There were no other sightings in Langley on or around July 11th 2011"],"Latitude":"49.100335","City":"Langley"}