{"divs":["Sighting Detailssaw a light in the sky that was far off,as I was traveling home about 14 miles from home at that time,and as I was going it was moving it was low from my viewpoint,and on my way we were getting closer to each other. at one point I was maybe 4 miles from it and thought it was a single light but getting closer I could see two lights side by side and by then I had driven probably 11 or 12 miles and was going around a bend in the road and there was a hill on my left,and there were trees blocking my view,I knew I was going to turn left at the next turn coming up,but as I was getting ready to turn I started to scan the sky and looked out and up,and by this time it was about dusk dark,and seen something that had ab absolutely no busyness being there,against the sky I could see all it's features,it was enormous and had to have weighed a million tons triangular in shape,it was as high off the ground as it was long,I guess it was about 375 to 400 feet long by about 275 to 350 wide. it had what I would say was a portal in the middle,surrounded by clear domes seven or eight and looked like they were about nine or ten inches thick,the portal was big enough to accept a 1600 sq,ft,brick rancher style house with a carport on the end. I knocked the three speed on the tree,out of gear and locked on the emergency brake,and was on the ground on my feet in a second or two,it was parallel to my truck and going in the opposite direction about one hundred and twenty or one hundred and fifty feet from my side. I tried to pop my ears,by opening my mouth,like going over a mountain or like on a plane to try to hear any sound and all I could hear was the noise from my truck ,muffled exhaust,fan,and a loose hydrolic lifter. from the 1971 ford,300 straight six cylinder motor,pretty quite. even went ten or twelve feet away from the truck,to better distinguish the the noise level,no difference. this thing owned the sky, it went about as fast as a bicycle,and didn't seem to care if anyone saw it or not,I thought it was the end of the world. my brain was racing,what about my family,was this the only one,were there more,what should I do,it was getting away,I took off after it,I wanted for any one else to see it,Blowing my horn and flashing my lights.and it was gone. next thing I know,I am Sliding into my driveway. Ran into the house,I was babbling like a fool,I was going to show my Wife. Yeah Right,There was nothing to show her except the heat gauge on my truck and some long weeds hanging from my back bumper. it's been a long while back,but everything Looks different from then till now,and I know I will never be the same."],"Viewing Distance":"101-500 Feet","City":"jefferson","Log Number":"US-07122011-0007","Weather Factors":"Unknown","Object Features":"Dome, Other","Disposition":"Unknown","Date of the Event":"06/06/1988 06:40 UTC","Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"07/12/2011 06:38 UTC","Summary":"on my way home from work","files":["/var/www/straped/mufon/html2text/30141.html.txt","/var/www/straped/mufon/org/30141.html"],"Source":"MUFON","Case Number":"30141","Latitude":"36.041782","Tags":"City","Longitude":"-83.464355","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=36.041782,+-83.464355(30141)&iwloc=A&hl=en\"> mufon case (30141) map </A>","trends":["There have been no other sightings in jefferson","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Region":"Tennessee","Country":"United States"}