{"Disposition":"Unknown","Case Number":"30159","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.541362,+-75.49076(30159)&iwloc=A&hl=en\"> mufon case (30159) map </A>","Date of the Event":"07/03/2011 11:00 UTC","Date Submitted":"07/13/2011 10:17 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30159.html.txt","/var/www/straped/mufon/org/30159.html"],"divs":["Sighting DetailsBeing the eve of the 4th of July, and getting closer to midnight, I started hearing fireworks going on around town. I was on the second floor of my home and looked out my bathroom window toward South Mountain and saw fireworks going off in the distance, as I do every year. I watched the fireworks for a few minutes and then noticed two red lights in the sky advancing from the Southeast(?)from over the mountain. I thought it was odd that two planes would be flying so close to each other. They came closer and then there were four red lights in a straight line, one perfectly behind the other advancing in my direction. I thought there might be a reflection from the double pane glass in my window, so I went outside and stood on the sidewalk at the street and watched the four lights. They stopped and then the front two lights again went side-by-side. They did not keep advancing....they remained statationary in the sky for a short time and then reverted back to their position in a straight line of four red lights. They even seemed to retreat for a short distance. They again advanced in my direction and the first light changed direction and went to it's left (my right facing it) toward the south. It then just disappeared. It did not just disappear from sight because I lost sight of it due to distance....it just wasn't there anymore. The other three red lights were also gone. I waited but they did not appear again and I went back inside my home. This is the first time I had seen something that I considered to be an UFO. I was fascinated watching the lights and wondered if anyone else was seeing them. I thought that all the fireworks going off all over the U.S. had probably attracted them."],"Weather Factors":"None","Log Number":"US-07132011-0009","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Summary":"4 round red lights in the sky switching positions and directions","City":"Emmaus","Viewing Distance":"Over One Mile","Latitude":"40.541362","Object Shape":"Sphere","trends":["There have been 9 other sightings in Emmaus","There were no other sightings in Emmaus on or around July 3rd 2011"],"Longitude":"-75.49076","Object Features":"Unknown","Region":"Pennsylvania","Sighting Duration":"Undisclosed"}