{"Case Number":"30154","Object Flight Path":"Undisclosed","Latitude":"35.235437","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around November 15th 2008"],"Log Number":"US-07132011-0004","divs":["Sighting DetailsThere were similar events that took place in my life, but this one tops them all IMO - This was about a couple of years ago, 2-3 months after we came back from the hospital after my son was born... It was about 11:20ish 11:30 at night and my wife and 2 month old son were fast asleep - I was done doing some things on the computer and went to go to bed. Coming out of the room where the computer was located, you crossed a small area before going into the bedroom. It was there that I felt a little something in the air (best way to describe it) I was very familiar with this feeling and kinda knew what the deal was... I felt threatened... I knew something was up, or something was outside, so I walked out to the kitchen area and kinda talked to myself or it - saying \"alright - you better bounce.... I'm not going for this tonight.\" I felt like there was something outside waiting for me to go to sleep. So I was getting tired and thought it was just the feeling. So I go to bed, my wife had a little night light on for the baby just in case she had to get up. Now my son really didn't wake us up much, which was good. So I'm laying there - I look at the clock - it was 11:50ish - I start the fade to sleep and the whole room seems to dim a bit. I could remember feeling a paralyzed feeling over my body. and was scared STRAIGHT. I felt as though someone walked in from behind me through the door. So I'm laying there and felt this feeling - I moved my fingers a little and was surprised that I could move them - I've been paralyzed in bed before, but it noticed I could move my arm a little. I reach behind my back slowly and grabbed what felt like a skinny, long-fingered, child's hand. NO JOKE! As soon as I grabbed it - It started pulling away like a child would - I LET GO OF THAT HAND SO FAST!!! MAN! I couldn't move. The lights dimmed and lit back to normal. (if that makes sense) I got up it was 12:10 or so. So that's when I got really scared - I know I didn't fall asleep in 20 mins and dream!! - Prayed HARD - and went to sleep after an hour or so - I can post more similar stories."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.235437,+-80.840347(30154)&iwloc=A&hl=en\"> mufon case (30154) map </A>","Weather Factors":"Rain, Light","Object Shape":"Sphere, Unknown","Date Submitted":"07/13/2011 02:01 UTC","Source":"MUFON","City":"Charlotte","Tags":"City","Longitude":"-80.840347","Region":"North Carolina","Viewing Distance":"N/A","Date of the Event":"11/15/2008 12:00 UTC","Summary":"Actual encounter","Country":"United States","files":["/var/www/straped/mufon/html2text/30154.html.txt","/var/www/straped/mufon/org/30154.html"],"Object Features":"Unknown","Disposition":"Unknown","Sighting Duration":"00:20:00"}