{"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=47.988555,+-122.199779(30168)&iwloc=A&hl=en\"> mufon case (30168) map </A>","Case Number":"30168","files":["/var/www/straped/mufon/html2text/30168.html.txt","/var/www/straped/mufon/org/30168.html"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Summary":"Very bright, slow moving sphere","Longitude":"-122.199779","Disposition":"Unresolved","Source":"MUFON","Latitude":"47.988555","Object Shape":"Sphere","City":"Everett","Date Submitted":"07/14/2011 06:11 UTC","divs":["sighting detailslast evening we had an odd weather evening with 1\\2 the sky in very dark cloud base and rain and 1\\2 clear and sunny. the rain was moving to the east from my home. just after 6:00 pm, i noticed a very, very bright light moving slowly from south to north, approximately 1 mile from me. it stood out due to the dark cloud backdrop. the cloud ceiling was low and this was moving just under them. i watched it for a full 20 minutes from my garage and when it went behind a tree, i went out onto the deck and watched it for a little more. it then stopped, then disappeared. i've been in aerospace\\aircraft manufacturing for 37 years and am familiar with just about every type of craft. a quick estimate of the distance across the field, from first sight to last is about 300 feet. so, no fixed wing craft can travel that slow and if it were a helicopter, it would have had to hover and side slip with a powerful light on the nose. all being pointless of course. no noise was heard. i guess the object was about 3 to 4 feet in diameter. imagine venus at it's closest point on a clear night for a measure of brightness. about 10 minutes after it blinked out, 2 navy jets from whidbey flew over, so \"someone\" else knew it was there!"],"Date of the Event":"07/13/2011 06:10 UTC","Region":"Washington","trends":["There have been 30 other sightings in Everett","There were no other sightings in Everett on or around July 13th 2011"],"Country":"United States","Log Number":"US-07142011-0009","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Unknown"}