{"Region":"Alabama","Date Submitted":"07/14/2011 05:24 UTC","Date of the Event":"08/15/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/30166.html.txt","/var/www/straped/mufon/org/30166.html"],"Summary":"small trialgle ufo with 3 round (really bright) lights underneath it","trends":["There have been 17 other sightings in Huntsville","There were no other sightings in Huntsville on or around August 15th 2009"],"Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["sighting detailsi have not reported this incident so as to not mar the memory of it. i stop in downtown huntsville, al at what is called the big spring every night on my bicycle. it's a park that i rest at 1\\2 way back to where i live. i was sitting on the ground and looked up to see one round bright, white light moving slowly from the left heading right. as i watched, 2 more identical round tubes of light appeared forming a triangle. this thing moved slowly (30 mph)and had no sound whatsoever & was very close, about 50 ft up. i looked around for someone with one of those remote controllers, for i thought it was some sort of remote controlled toy. there was nobody with one & this craft was a little too big for that. i estimate it was 15ft from tail to front (the tip of the triangle). i have never looked for ufos & was not looking for one that night: i just looked up & there it was. another person witnessed this down to my far right & i heard her exclaim \"oh my god!\"...& something else i could'nt make out. it blinked out after about 20 seconds of flight time. i'm 40 & never imagined i'd see something like this & it has messed with my mind a little. my curiosity is killing me. i don't believe this was a secret government craft from the redstone arsenal or anything...i believe i got to see an alien visitor. thank you, (name deleted.)fg"],"Tags":"City","Sighting Duration":"00:00:20","Case Number":"30166","Object Flight Path":"Undisclosed","Longitude":"-86.577494","Disposition":"Unresolved","City":"Huntsville","Country":"United States","Log Number":"US-07142011-0007","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=34.738119,+-86.577494(30166)&iwloc=A&hl=en\"> mufon case (30166) map </A>","Viewing Distance":"Unknown","Latitude":"34.738119","Source":"MUFON"}