{"Object Features":"Undisclosed","Sighting Duration":"00:01:30","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/30161.html.txt","/var/www/straped/mufon/org/30161.html"],"Date Submitted":"08/02/2011 02:51 UTC","divs":["sighting detailsi know there are going to be some who immediately dismiss this sighting as conventional aircraft. this night the skies were full of air traffic but this one caught my eye due to the strange & unconventional light formation. in this video you will see an object pass directly above me. pay close attention to the two lights off to the right side. the bottom one will get a little tricky, get brighter and move itself out to the right and further away as it passes over. not something expected to see on airplanes. as the video goes on it gets even better as more lights appear on this object. i sit and skywatch as often as i can.i have been doing so since 1998. your gut feeling tells you when you are seeing something \"different\". alot of others are reporting seeing these craft in the night sky that change their light formations. maybe we should stop dismissing the truth hiding in plain sight. the video can be found on yt titled watch a ufo turn into an airplane july 13 2011 sighting under the alien agenda 2012 channel sighting in youngstown ohio july 13, 11:50pm est. object moving east to west. to the know it all skeptics or self appointed \"experts\\debunkers\" please do not insult my intelligence by informing me i live near vienna airforce reserve base or youngstown warren regional airport. i have lived here my whole life. i am well aware of my own surroundings and the lay of the land. thanks for watching and please keep your eyes to the skies :))"],"Case Number":"30161","trends":[],"City":"Undisclosed","Summary":"WATCH A UFO TURN INTO AN AIRPLANE July 13 2011 Sighting","Source":"MUFON","Latitude":"40.420357","Region":"Ohio","Object Shape":"Triangle, Unknown","Viewing Distance":"Unknown","Longitude":"-82.900803","Log Number":"US-08022011-0031","map":"<A HREF = \"http://maps.google.com/maps?q=40.420357,+-82.900803(30161)&iwloc=A&hl=en\"> mufon case (30161) map </A>","Weather Factors":"Unknown","Tags":"City","Country":"United States","Disposition":"Hoax","Date of the Event":"07/13/2011 11:50 UTC"}