{"City":"Chapel Hill","Disposition":"Insufficient Data","Latitude":"35.91512","Date of the Event":"01/01/1982 12:00 UTC","Weather Factors":"Unknown","Tags":"City","Log Number":"US-07142011-0005","Sighting Duration":"Undisclosed","Case Number":"30164","Source":"MUFON","Longitude":"-79.049344","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Chapel Hill","There were no other sightings in Chapel Hill on or around January 1st 1982"],"Date Submitted":"07/14/2011 11:20 UTC","divs":["Sighting Detailsit was about 8 pm i think on january 1, 1982, my girlfriend at the time and i drove along state highway 54 outside of chapel hill. we were on a hill top going down the hill and heading back up the next hill when we saw a round lighted object sort of hovering across the road. it was about 60 feet in diameter and just sort of hung over the road it made no sound at all. as we approached it rose up into the air only about 50 feet or so. as we passed under it the inside the car turned blue and my girlfriend freaked out on me....i slowed to 10 mph...as we moved the object stayed right over us...the whoile inside of the car lite up....i rolled down my window and looked up...it was round and had bright lights...the lights seemed to change some how...as i calmed down my girlfriend and assured her we were not going to die, i got her to grab my camera and snap off a few shots of the object. as i continued to drive the cars behind me all stopped...the object stayed right on top of us as we drove along. when i turned it turned...i noticed that the on coming traffic did not move either...traffic was light at this time....after about 15 minutes the object shot straight up at a high speed and then just went off at an angle into the darkness......we drove back to cary and went to see my girlfriends next door neighbor....he had worked on project blue book...so he seemed like the right person to talk to...he wanted my film bad...but i would not give it to him.....he left the room and i could hear him make a few calls....we left....i took the film to the drug store for processing...when i got it back...all the negatives of the object where gone...the pictures i took before the encounter and after all came out fine, but i was short by 5 negatives..not even blanks were in the pack...i went home after leaving my girlfriends and told my dad about it...he thought i was nuts....but i he was in the air force too...and i am not sure...but i do think he worked on blue book also....i did not tell him about the pictures i had taken.....a few years ago around 2000, when i was home for a visit, my dad made a point of telling me that my experience had been report a few weeks ago in the local paper as a squad of helicopters...now mind you...this is some 18 years after the actual event.....i know that at the time there was a small article in the paper...and some 300 people reported the sighting.....well...that is my story...i dont tell people about it."],"Country":"United States","Summary":"orange county encounter","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/30164.html.txt","/var/www/straped/mufon/org/30164.html"],"Region":"North Carolina","Object Flight Path":"Undisclosed","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=35.91512,+-79.049344(30164)&iwloc=A&hl=en\"> mufon case (30164) map </A>"}