{"Log Number":"US-08092011-0047","Tags":"City","Region":"Florida","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/30176.html.txt","/var/www/straped/mufon/more/30176_submitter_file1__2020.jpg","/var/www/straped/mufon/org/30176.html"],"Source":"MUFON","Summary":"Picture taken along route shows disc like object in sky.","Object Flight Path":"Stationary","Date of the Event":"06/17/2011 08:28 UTC","Case Number":"30176","Latitude":"26.275051","divs":["Sighting Details Several friends and I took a trip out west to northwest Montana. We all live in Florida. We were carrying rifles and handguns in the vehicle for recreational shooting out west. Due to this fact we wanted to spend as little time in IL. as possible due to their arcane and rediculous laws on weapons. We left I-24 and proceeded across Wickliffe Rd. to get to Cairo to cross the river then go northwest. I OFTEN take route pictures.. it is a bit of a throwback to my days as a LRRP (Long range recon patrol) member in the 82nd Airborne Div. It is just a habit that I have.. route pictures. As we were traveling along the road I snapped some photos of the terrain, road etc. Once again, it is just an old habit I have. I spent Two weeks in Montana, Idaho and southern Canada.. after returning and reviewing my images with my wife, she pointed out the \"UFO\" that I had caught along the way, when the picture showed on my computer screen she immediately pointed it out. I had no idea it was there at the time and only saw it AFTER reviewing the images. I have used a photo processing application to rule out anything close, as under magnification the image pixels are quite distinct and clean.. not something close and blurred. Looking closely you can see the angle of the shadow of the oncoming vehicle matches that of the \"disc\". As for its actions and motions... I never saw it. Feelings.. none, I was taking a route pic. I never saw the object to lose sight of it. So.. there it is. I will attach a copy of the image and you can tear it apart any way you would like."],"Longitude":"-81.765398","Object Features":"Undisclosed","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around June 17th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=26.275051,+-81.765398(30176)&iwloc=A&hl=en\"> mufon case (30176) map </A>","Date Submitted":"08/09/2011 10:49 UTC","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Shape":"Disc","City":"Naples"}