{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"38.207626","Region":"Kentucky","City":"Frankfort","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.207626,+-84.866664(30171)&iwloc=A&hl=en\"> mufon case (30171) map </A>","Date of the Event":"07/13/2011 08:30 UTC","Object Shape":"Bullet, Missile, Cigar","Longitude":"-84.866664","trends":["There have been 3 other sightings in Frankfort","There were no other sightings in Frankfort on or around July 13th 2011"],"Case Number":"30171","Object Flight Path":"Straight-line path","Date Submitted":"07/14/2011 07:19 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/30171.html.txt","/var/www/straped/mufon/org/30171.html"],"Disposition":"Unknown","divs":["Sighting DetailsI was walking in a residential neighborhood last night, July 13, 2011, around 8:30 pm. I looked up and saw a silvery object in the sky. It looked like a bullet or a missle, but was more rounded in the front. It was moving as quickly as an airplane would and was flying about as high as a helicopter would fly. I kept staring at it, trying to figure out what it could be. Of course, I didn't have my iphone, so I didn't get a photo. The object was coming from the west, I was walking toward it. It was heading east or southeast. I walked about half a block, watching it. There was no one else around on the street at that moment. I didn't feel any fear, just curiosity. There were no wings on this craft. There was no trail behind it. There was no noise. There was no lights on it. After a couple of minutes, a large tree obstructed my view of the craft. I waited for the object to clear the tree, but it did not. I walked around the tree, looking up in the sky, trying to find the object, but it was gone. I stood there for a few minutes, to see if it would reappear, but it never did. I can not imagine what happened to it. It just disappeared. I checked the NASA website to see if it was the space station. According to the schedule, the space station wasn't visible here in Frankfort, Ky on that day, and won't be for several days, when it will be visible in the early morning. I have never seen a UFO before. I don't know if that was a UFO, but I have no explanation for it. Thanks!"],"Log Number":"US-07142011-0012","Source":"MUFON","Summary":"I saw a silver object, like a bullet but rounder in front, coming from the west. There were no wings, no lights, no chem trail from behind it. It was moving towards the east, or south east. It disappeared from my view, due to a large tree, then disappe"}