{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/30189.html.txt","/var/www/straped/mufon/more/30189_submitter_file1__July_12_2011_ufo.jpg","/var/www/straped/mufon/more/30189_submitter_file2__July_13_2011_ufo.jpg","/var/www/straped/mufon/org/30189.html"],"Longitude":"-80.925768","Source":"MUFON","City":"New Smyrna Beach","Country":"United States","trends":["There have been 9 other sightings in New Smyrna Beach","There were no other sightings in New Smyrna Beach on or around July 12th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Stationary","Date of the Event":"07/12/2011 09:25 UTC","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Over One Mile","Date Submitted":"08/01/2011 03:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.033099,+-80.925768(30189)&iwloc=A&hl=en\"> mufon case (30189) map </A>","Case Number":"30189","Region":"Florida","Summary":"Photos Boomerang-type color changing in Florida","divs":["Sighting DetailsWe are vacationing in Florida and we've seen the same object in the sky three nights in a row. my wife was the first to notice it and remarked to me that it looks like one of those UFO photos I'd been looking at. As it appeared to our eyesight, it was extremely high up, at least 10-15,000 feet. It was, from our vantage point in New Smyrna Beach, south-southwest and possibly near or over Kennedy Space Center. Our impression was simply an object which was changing colors rapidly, same as our 2 daughters whose description was much more defined: an object which has something solid behind it which was obscured by a large light which changed from green to bright white to a reddish color. It was the camera however that got the best look. Keep in mind we're amateur at best and the object was incredibly high up. However the Camera managed to catch 2 great shots, one from each night. it remained completely stationary the entire time before dissapprearing behind clouds the entirely gone. In particular the second photo from July 13th is amazing when zoomed in! Anyhow this experience has made 4 believers more for the world."],"Latitude":"29.033099","Object Shape":"Boomerang","Object Features":"Unknown","Log Number":"US-08012011-0024","Weather Factors":"Unknown"}