{"Region":"Minnesota","Disposition":"Insufficient Data","Object Shape":"Triangle","Case Number":"3018","Source":"MUFON","Log Number":"","Date Submitted":"04/26/2004 02:36 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/3018.html.txt","/var/www/straped/mufon/org/3018.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was talking on a cell phone in the garage outside and was about to go in,Istopped on the back step to look at the stars and it came from behind me from aSoutheasterly direction over me at about 500 feet off the ground. I was not surewhat I was looking at and after about 5 second I realized that it was not makingany sound at all,it was a triangle shape with three round circles on the bottomand was moving about 20-30 m.p.h. in a Northwest direction over my head it wentabout 2city blocks past me then stopped and hovered in place for about 5 secondsthen went straight north towards the highway as it got over towards the highway494 in Mpls. it stopped then went straihgt backwards stopped againthen slowly went North out of my sight,I couldnt see it anymore because my sightwas blocked by some big trees in the neighbors backyard,it did not have anysound,as I could still hear the tires on the Semi trucks on the highway duringthe whole event,the whole thing lasted about 45 seconds....I wish I would havechased it in my car to get a better look at it....I was still on the cellphonethe whole time talking long-distance to my girlfriend who was in Louisianna atthe time....... ."],"Date of the Event":"04/26/2004 02:36 UTC","Summary":"saw a triangle shaped ufo above my house","Object Features":"Undisclosed","Object Flight Path":"Unknown","Latitude":"44.849698","Country":"United States","City":"Bloomington","trends":["There have been 9 other sightings in Bloomington","There were no other sightings in Bloomington on or around April 26th 2004"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.849698,+-93.29657(3018)&iwloc=A&hl=en\"> mufon case (3018) map </A>","Sighting Duration":"00:00:59","Longitude":"-93.29657","Viewing Distance":"101-500 Feet"}