{"Disposition":"Insufficient Data","Weather Factors":"Unknown","Date Submitted":"07/15/2011 11:32 UTC","files":["/var/www/straped/mufon/html2text/30195.html.txt","/var/www/straped/mufon/org/30195.html"],"Date of the Event":"07/15/2011 09:48 UTC","Object Flight Path":"Undisclosed","City":"Union Township","map":"<A HREF = \"http://maps.google.com/maps?q=40.678679,+-74.264075(30195)&iwloc=A&hl=en\"> mufon case (30195) map </A>","trends":["There have been 6 other sightings in Union Township","There were 6 other sightings in Union Township on or around July 15th 2011","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Summary":"WOW Many UFOS & USOS Caught On WEB CAM NYC BABY !!!!","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"40.678679","divs":["Sighting DetailsHi My Names Mark I live in New Jersey...I submit alot of pictures to MUFON via the \"Wired NY Web Cams\" page. Lately there hasn't been alot of great activate that i've seen, BUT TONIGHT THAT HAS CHANGED... I Have Captured UFO's & USO's or ufos that are on the River You can see the water making a circular motion in some shots and the USO's Morffing changing shapes, Not to mention the Large UFOs in the sky that appear in all these shots...This page refreshes every 30 seconds. So what I wanna know is how alot of my skeptics are gonna say that there Planes and Helicopters And Boats... I Say B.S. Why? I'll Tell YOU..How do planes & Helicopters Appear over NYC in crazy patterns every 30 seconds??? How do Boats Change Shape & Colors every 30 seconds??? Well, They dont,There technology is just so advanced that they let these Web Cams capture there image, But I guess they dont wanna be seen by the naked eye..If that was the case every one who was in NY city tonight looking toward which ever way the NYC WEB CAM #3 is pointing would have seen ONE HELL OF A SHOW...LOOK At My Pictures !!!! They ARE TRUE...They ARE REAL... Dont Be Fooled....WE Are NOT ALONE My FRIENDS...!!!!!!!!"],"Log Number":"US-07152011-0020","Source":"MUFON","Longitude":"-74.264075","Case Number":"30195","Object Shape":"Blimp, Bullet, Missile, Cigar, Circle, Cylinder, Diamond, Disc, Oval, Sphere, Square, Rectagular, Other","Object Features":"Undisclosed","Region":"New Jersey","Country":"United States"}