{"Log Number":"US-08022011-0034","Case Number":"30194","Sighting Duration":"Undisclosed","Summary":"Orange Lights","Date Submitted":"08/02/2011 03:19 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-84.441217","trends":["There have been 82 other sightings in Cincinnati","There was one other sighting in Cincinnati on or around July 15th 2011"],"City":"Cincinnati","Latitude":"39.109814","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/30194.html.txt","/var/www/straped/mufon/org/30194.html"],"divs":["Sighting DetailsThe sky was just becoming dark, I went to the window to pull down the shade for the evening. I saw a bright orange light rise up into the sky from the tree line in the distance. As I watched it rise up and then level off and begin traveling, I waited for it to become evident to me that it was an airplane. As I waited for this to happen, another light appeared, then another, then a fourth, and finally a fifth light came into view. All of them seemed to be floating upward from below the tree line, or traveling vertically, before they moved horizontally. At no point did the objects appear to be airplanes as they moved across the sky in toward the northwest. The first light moved rather steadily, the second light caught up with the first light, so was going faster at times. The third light was going slower, and was surpassed by the fourth light which even appeared to \"leapfrog\" over the third light. The fifth light lagged behind the first four by quite a distance and was crossing the landscape near my home after the first light was a faint light in the distance."],"Country":"United States","Region":"Ohio","Object Features":"None","Date of the Event":"07/15/2011 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.109814,+-84.441217(30194)&iwloc=A&hl=en\"> mufon case (30194) map </A>","Object Shape":"Circle","Source":"MUFON","Tags":"City","Weather Factors":"Unknown"}