{"Date of the Event":"07/15/2011 09:40 UTC","trends":["There have been 5 other sightings in West Chester","There were no other sightings in West Chester on or around July 15th 2011"],"Longitude":"-84.407828","Date Submitted":"08/07/2011 06:39 UTC","Region":"Ohio","Object Features":"None","divs":["sighting detailsi am writing you in response to a strange phenomenon that my fiance and i witnessed at approximately 9:40 pm on july 15th 2011. my fiance and i were driving home from work on the evening of june 15th 2011. at approximately 9:40 pm we noticed what appeared to be a trail of fireworks falling from the sky above i-75 north in the direction of dayton ohio. there were three trails of falling debris that appeared to be a firework falling out of the sky or a meteor. as we watched this for 10 seconds the fiery trails suspended in air as little burning, orange balls of light that began to dance around each other wildly. the three lights then began to \"blink\" on and off and then formed a formation in a diagonal line. we attempted to chase the lights but they were extremely fast heading in a northwest direction. we quickly lost sight of the lights and i have never seen anything in my life like this and i recently read an article that roger marsh published online at examiner.com from a similar incident that was witnessed by several people in the exact same location we saw the lights exactly one year ago. the mufon case # for the incident is 24571 from what was witnessed one year ago. this seems to be more than a coincidence and i would like to share this information with any investigator that may help explain or look further into this matter. thank you and i hope to hear from you soon. [name and email removed\\cms\\tg]"],"Object Flight Path":"Hovering then path,Straight-line path","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.349532,+-84.407828(30209)&iwloc=A&hl=en\"> mufon case (30209) map </A>","Summary":"Three fiery trails followed by dancing balls of light that formed a diagonal formation. The lights blinked on and off then quickly headed in a northwest direction.","City":"West Chester","Viewing Distance":"Over One Mile","Latitude":"39.349532","Source":"MUFON","Object Shape":"Fireball, Star-like","Case Number":"30209","Sighting Duration":"Undisclosed","Log Number":"US-08072011-0089","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/30209.html.txt","/var/www/straped/mufon/org/30209.html"],"Tags":"City","Weather Factors":"Does Not Apply"}