{"Country":"United States","Weather Factors":"Unknown","Region":"Delaware","map":"<A HREF = \"http://maps.google.com/maps?q=38.913942,+-75.52495(30217)&iwloc=A&hl=en\"> mufon case (30217) map </A>","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc","trends":[],"Object Features":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy wife and I and daughter watched fireworks from a shopping plaza in northern new castle county - just after dropping off my mother after taking her out for ice cream on a Saturday evening. We noticed fireworks in the distance, and made a guess they were being launched from Hagley Museum, a notable duPont family estate and attraction. Upon greater inspection, we both noticed lights - disc shaped - bright and discernible - moving in formation - at least four of them hovering a great distance ABOVE the fireworks. After the show, the illuminated objects stayed and moved around in the evening sky for a significant period of time. At this point, other people exiting the restaurants in the shopping plaza began looking up and pointing to the sky. We discussed that they may have been \"lanterns\" however, they moved in a synchronized fashion - almost military - and were way above the fireworks. In addition, while we are not aviation experts, we reside in an extremely busy airport traffic area just south of the Philadelphia International Airport and we have never made a call yet alone, filed a case of record. This was something different in the night sky. I do have a photo of the lights."],"Log Number":"US-08062011-0022","Date Submitted":"08/06/2011 08:19 UTC","Summary":"Unknown lights that appeared to move in formation on evening of fireworks.","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/30217.html.txt","/var/www/straped/mufon/org/30217.html"],"Case Number":"30217","Source":"MUFON","Date of the Event":"07/16/2011 09:35 UTC","Latitude":"38.913942","Longitude":"-75.52495","City":"Undisclosed"}