{"Longitude":"-75.205468","divs":["Sighting DetailsThis is what I can remember: About 7 years old, in a neighbors basement. Home owner comes down the steps, husband right behind her. \"When did you come in here?\" Questions just kept coming. \"How did you get in here?\" \"Everyone is looking for you!\" I look up at basement window. Dark out. Panic! I'm supposed to be home before dark! \"Go right home, your mother's very worried!\" I never said a word to these people. I just run home as fast as I can. And I'm terrified of the dark! Upon arriving home, I am confronted by my Mom. She is beyond upset. Starts hitting me with a yard stick. Mostly I remember her words: \"We've been looking for you for hours!\" I was sent straight to bed. A 7 year old little girl, in complete confusion about what had just happened. I don't remember any follow up questions. The events of that evening tucked away in my memory. And life just went on. However, unexplainable experiences and sightings of UFO's continue to this day. Finally needed to get this out. Just telling it now makes me feel shaken inside. I've known they are real since childhood. My question now is \"What are their intentions?\" You don't need to contact me. Proof dosen't matter anymore. That they have always been in some of our lives is a given. It isn't easy to live with though."],"Date Submitted":"08/01/2011 11:13 UTC","Weather Factors":"Unknown","Latitude":"40.871292","files":["/var/www/straped/mufon/html2text/30210.html.txt","/var/www/straped/mufon/org/30210.html"],"Object Flight Path":"Undisclosed","Region":"Pennsylvania","Object Shape":"Unknown","Country":"United States","City":"Bangor","Tags":"City","trends":["There have been 13 other sightings in Bangor","There were no other sightings in Bangor on or around November 30th 1967"],"Object Features":"Undisclosed","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.871292,+-75.205468(30210)&iwloc=A&hl=en\"> mufon case (30210) map </A>","Viewing Distance":"Unknown","Summary":"They put me back in the wrong house!","Date of the Event":"11/30/1967 12:00 UTC","Log Number":"US-08012011-0052","Case Number":"30210"}