{"Weather Factors":"Unknown","Case Number":"30225","Object Shape":"Circle","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around July 16th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/30225.html.txt","/var/www/straped/mufon/more/30225_submitter_file1__Sun1July162011.jpg","/var/www/straped/mufon/more/30225_submitter_file2__Sun8July162011.jpg","/var/www/straped/mufon/more/30225_submitter_file3__Sun9July162011.jpg","/var/www/straped/mufon/org/30225.html"],"Object Features":"Unknown","Summary":"While taking pictures of the Sun, I captured the UFO","Region":"Virginia","divs":["Sighting DetailsI have a profile on facebook that connects over 3000 people from around the world in regards to UFO information, Virginia Beach Ufo Quest. This profile mainly talks about ancient aliens, other theories, past and current sightings from around the world. Everyone is welcome to share information and I generally check out the photos and videos. This one man in particular had several videos and pictures that he thought were something unique of the Sun, in particular. So on July 16, 2011 around 1:15 pm, I went outside in our yard to take my own pictures of the Sun. I shot some video and took a few pictures consecutively, but on different settings, within 30 seconds of each other or less. I then uploaded the pictures and video into my camera. The majority of what I got was the same as the man's in question... light reflections from my camera lens around the Sun in pentagon and hexagon shapes, various colors, beautiful but nothing unusual. After taking a second look at my own pictures, I noticed something out of the normal, something to the middle left of the Sun. It was (compared to the Sun) small, but in reality was the size of our moon at least, maybe the size of the Earth. It was gray, round very noticeable. I then went back into my camera, cropped the photo as much as possible to give me a closer image and then uploaded them. The reflections in the first set of pictures were very distinguishable and had no mass, however the \"ufo\" in question had solid mass. I fully understand the term \"ufo\" unidentified flying object. This could be anything from a craft to a planet... it is unknown, but something."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.860296,+-75.975595(30225)&iwloc=A&hl=en\"> mufon case (30225) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"07/16/2011 01:15 UTC","Date Submitted":"07/17/2011 11:41 UTC","Disposition":"IFO","Source":"MUFON","Tags":"City","Log Number":"US-07172011-0005","City":"Virginia Beach","Viewing Distance":"Unknown","Country":"United States","Longitude":"-75.975595","Latitude":"36.860296"}