{"Case Number":"30232","City":"Lafayette","Date Submitted":"07/17/2011 05:38 UTC","Tags":"City","Object Flight Path":"Straight-line path","Object Shape":"Oval","Longitude":"-105.080086","Summary":"While taking photos of clouds, I noticed an object flying across sky. The back end glistened, and the front looked round.","Country":"United States","files":["/var/www/straped/mufon/html2text/30232.html.txt","/var/www/straped/mufon/more/30232_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/30232.html"],"divs":["Sighting DetailsAround 6 to 7 p.m. on June 20, 2011, I was taking photos of the pretty cloud formations on the deck of my cousin's home. Suddenly, I became aware of an object flying from west to east in front of me, about a mile or so away. It was above tree level. The bottom of the left side of the object seemed to be reflecting light, (which made me notice it). I thought the reflection was from sunlight, but the top part didn't seem to have the same reflection. My first thought was that the object was a plane, but the front right end of it was round, so I was unsure of what I was seeing. My far vision isn't as clear as my close up sight. I took a photo with my Canon digital camera, and continued to watch it fly to the east until it was out of sight. It never occurred to me that I might be seeing a UFO. Even though I have watched many UFO programs, my mind set was not on that thought, or I would have taken many photos. Rather, I was simply taking photos of the clouds for the purpose of doing a painting, since I am an artist. The object did not change its direction or move up, down or diagonally. It just flew straight across the sky, horizontally, till out of sight. It flew at the normal rate of speed of one of our airplanes. I did not see any additional lights flashing or reflecting, once I had taken the photo. It showed no reflection as it flew east, away from me. It was only when I finally had time to look at my photos from my trip, that I came across the picture I had taken and was shocked at what I saw. When I had first seen the object it, there were lighter clouds behind it, which made it more difficult to be seen. In my photo, by the time I had raised my camera to take the picture, the object had moved to an area with a darker cloud behind it, so it could be seen well. From what I recall, as the object continued to move east, the sky behind it was a light shade of blue; I did not see its total shape at all. I don't know whether the object moved somewhat higher or lower to make that occur, or whether the clouds shifted. As I went back into the house, I felt uncomfortable. I think I realized that I had seen something that was unusual and didn't know how to process that thought. No one was in the room for a while when I entered it, so I didn't discuss the incident, and just forgot about it."],"Region":"Colorado","trends":["There have been 6 other sightings in Lafayette","There were no other sightings in Lafayette on or around June 20th 2011","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-07172011-0011","Date of the Event":"06/20/2011 07:15 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.995406,+-105.080086(30232)&iwloc=A&hl=en\"> mufon case (30232) map </A>","Disposition":"IFO","Latitude":"39.995406","Object Features":"Unknown","Sighting Duration":"Undisclosed"}