{"Region":"Ohio","Viewing Distance":"Over One Mile","Case Number":"30231","Log Number":"US-08072011-0091","Date Submitted":"08/07/2011 06:50 UTC","City":"Franklin","Object Flight Path":"Hovering then path","Source":"MUFON","Summary":"triangular shaped object with red lights on the corners","trends":["There have been 4 other sightings in Franklin","There was one other sighting in Franklin on or around July 15th 2011"],"Country":"United States","Sighting Duration":"00:05:00","Object Features":"None","files":["/var/www/straped/mufon/html2text/30231.html.txt","/var/www/straped/mufon/org/30231.html"],"divs":["Sighting DetailsOn Friday July 15th, at 9;40pm, I was using the south highway access onto I-675 at exit two heading for exit 38 on I-75 south, and out ahead of me I spotted a rather large craft with red lights on each corner, which I believe were actually on the botton and it was turning to the right and when it leveled off, all you could see was a thin red line of light that encased the shape of the vehicle, which belive was triangular. I lost sight of it for about 15 seconds as I was on the exit ramp for I-75 south and trees in the landscaped blocked my view, until I got to the top of the rise, past the trees, and there it was again, farther south than just a few seconds ago, and it was headed west or to my right and I could see a white light in the center. As I was getting close to exit 38, I looked through my passenger window and saw a very bright white light, that didn't appear to be moving I'd guess it was about 3500' in the air and the light itself was shining down at about a 45 degree angle like a beam, toward the highway. As I was coming down the exit ramp at exit 38, as soon as I stopped at the bottom of the hill, behind a large dump truck, I exited my car and looked toward the area where I saw the light, just seconds before and this light shot from west to east in a flash, and was gone."],"Latitude":"40.023064","map":"<A HREF = \"http://maps.google.com/maps?q=40.023064,+-82.987801(30231)&iwloc=A&hl=en\"> mufon case (30231) map </A>","Weather Factors":"None","Object Shape":"Triangle","Tags":"City","Disposition":"IFO","Date of the Event":"07/15/2011 09:45 UTC","Longitude":"-82.987801"}