{"trends":["There have been no other sightings in South Euclid","This sighting has never been favorited."],"City":"South Euclid","Log Number":"US-08072011-0058","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.523108,+-81.518455(30233)&iwloc=A&hl=en\"> mufon case (30233) map </A>","Weather Factors":"Unknown","Case Number":"30233","files":["/var/www/straped/mufon/html2text/30233.html.txt","/var/www/straped/mufon/org/30233.html"],"Country":"United States","Object Shape":"Sphere","Tags":"City","Latitude":"41.523108","Date of the Event":"07/16/2010 10:30 UTC","Summary":"9 Brilliant Fiery Orbs Float Across the Sky followed by 4 More","Longitude":"-81.518455","Object Flight Path":"Straight-line path,Other","Object Features":"None","Region":"Ohio","Disposition":"IFO","divs":["sighting detailsat 10:30pm on july 16, 2011 my husband and i were outside in our pool in the backyard. i looked up and noticed three brilliant fiery orange orbs in the sky above the tree line and rooftops. the three orbs were in a straight line and moving from southeast to northwest across the sky. i yelled to my husband to come look at what i was seeing. as he got over to my vantage point, four more orbs followed the orignal three in a straight line. then two more appeared in the line. as each of the orbs reached the same point in the sky the orange light dimmed (as if the orb moved straight up\\further away from us and out of sight distance.) when the last of the initial 9 orbs disappeared, another four appeared in the same origination point in the sky. however, they were not in a straight line across the horizon. they were in a scrambled pattern. three of them followed the same route as the first 9 and the last disipated into the sky before the point where the others vanished. none of the orbs made a single sound and none of them left a tail\\trail through the sky. we often have planes and ems helicopters fly over our house. we are 100% sure that these orbs were not planes or helicopters. we tried to catch them on film but did not have any luck. all we ended up with is an audio recording of the last four orbs that we witnessed."],"Date Submitted":"08/07/2011 02:11 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile"}