{"Case Number":"30249","divs":["Sighting DetailsOn July 5, 2011 around 5:15 pm. I was calibrating my carburetor from my car and my wife was helping me by putting it in gear and holding the brakes. While my wife was in the car she was looking at the sky and started to see a black sphere and called me to come from in front of the car and to look up, when I looked up I see a black sphere and I'm telling my son to go and get his binoculars and when he came back he said he can't find them so he brought his sister's I-pod touch and I started to take pictures. I then started to take video but I was having trouble seeing the sphere on the I-pod so I pointed the I-pod to were it was the last time I saw it and started to record. We saw the black sphere for about seven to nine minutes it moved sideways, up, down, and would also stay in place for a minute and take off. After it disappeared we heard in the back round military jets going to were the black sphere were. I came inside my house and started to see the pictures and the videos put the screen was to small to see anything so I downloaded it to my computer and started to darken the color of the pictures to see it better and I started to see white spheres on the pictures so I started to see the videos that I took and the same thing the white spheres were there too. Then I converted the three minute video to one hour and twenty minutes and also adjusted the lighting and when I played it back it shocked me and scared me because the white spheres where going in and out of the clouds and some even left a trail when they came out from the clouds. they are different sizes and they are more than thirty or forty spheres and they move so fast and if you go frame by frame you can see them going in and out and some stop and you can see that they are white round spheres. I was in shock how many they are and how fast they move and also how they used the cloud to hide and to me they manipulated the clouds shape so they could move to another place. since that day I feel confused and also have a hard time concentrating or focusing on things I feel lost and the more I see the videos the more start to wonder why so many of them? and what were they doing or looking for? I wish I could talk to some one about it but I'm scared I don't want to talk to just anyone. If you would be interested on the videos I have it on my computer and still have the originals on the I-pod and if you would like to get a hold of me write me an E-mail and give me a number were I can call, because I really want to talk to some one who has experience on this type of sightings. I sent you the original video and the one in slow motion. This happened in San Jacinto California."],"Tags":"City","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile, Unknown","Log Number":"US-07182011-0014","Summary":"one black sphere and 30 or 40 white spheres","Object Features":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/30249.html.txt","/var/www/straped/mufon/more/30249_submitter_file2__VICTOR098.JPG","/var/www/straped/mufon/org/30249.html"],"trends":["There have been 11 other sightings in Hemet","There was one other sighting in Hemet on or around July 5th 2011","This sighting has never been favorited.",""],"Date Submitted":"07/18/2011 05:08 UTC","Longitude":"-116.967268","Sighting Duration":"00:09:00","Date of the Event":"07/05/2011 05:15 UTC","Country":"United States","Latitude":"33.7574","Disposition":"IFO","Object Shape":"Sphere, Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.7574,+-116.967268(30249)&iwloc=A&hl=en\"> mufon case (30249) map </A>","City":"Hemet","Object Flight Path":"Hovering then path,Path with directional change,Unknown","Source":"MUFON"}