{"Object Flight Path":"Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Latitude":"39.109106","Region":"Missouri","Date Submitted":"07/18/2011 03:46 UTC","Object Features":"None","Longitude":"-94.572597","Country":"United States","Weather Factors":"Unknown","Tags":"City","Log Number":"US-07182011-0012","Date of the Event":"07/16/2011 11:15 UTC","divs":["Sighting DetailsAs called in to ASD on 7-18-2011 by one of the witnesses: I was with five other adults visiting the Liberty Memorialin Kansas City, Missouri on Saturday night July 16. As we were walking down the steps to leave, I noticed a strange gold ball of light flying N.W. to S.E. The size of it was smaller than the full moon. It was a bright gold color and was perfectly round. The light did not pulse or waver, and there were no blinking lights on it like you would expect from a conventional aircraft. The helicopter made circles around the object it as it moved along. The object moved at different hights and inconsistent speeds, and we thought it was going to crash due to the angle it was headed down (45 degrees) but it did not. It changed size, probably based on moving further away and closer to us. It turned completely white then just dissapeared in front of our eyes. We heard the helicopter noise but nothing else, as if there was no other craft in the area. After the object dissapeared a plane came in the area, but we did not pay much attention to it so I don't know what type of plane it was. One of the men with us got some pictures of the object and helicopter. I would like to know if anyone else saw this object. Note from FI: I am attempting to get a copy of the photos."],"Source":"MUFON","Viewing Distance":"Unknown","City":"Kansas City","files":["/var/www/straped/mufon/html2text/30247.html.txt","/var/www/straped/mufon/org/30247.html"],"trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around July 16th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.109106,+-94.572597(30247)&iwloc=A&hl=en\"> mufon case (30247) map </A>","Case Number":"30247","Disposition":"Unknown","Summary":"Gold UFO chased by helicopter near Liberty Memorial in Kansas City","Object Shape":"Circle"}