{"Case Number":"30257","Date of the Event":"07/02/2011 09:25 UTC","Disposition":"IFO","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Longitude":"-85.351275","Viewing Distance":"Unknown","trends":["There have been 9 other sightings in Cadillac","There were no other sightings in Cadillac on or around July 2nd 2011","This sighting has never been favorited.",""],"Latitude":"44.385373","divs":["Sighting DetailsI was up just north of Cadilac MI. on a friends property. That morning I noticed that the sun had a pair of \"sun dogs\" (partial rainbow that appear on either side of the sun) and a slight halo around it. Both are natural occurances. I took three pictures one right after another trying to capture the sun dogs. You can see one of the sun dogs in the left hand side of the pictures, and a hint of the halo around the sun. I took the pictures with my phone. Once I took them I exited out of the camera part of the phone and put it away not noticing anything in two of the pictures. I did not see anything in the sky other than the sun dogs and halo caused by the type of clouds. The third picture is just the sun, so if you look at all three in sucesion you'll notice that the object has moved across the sky relative to the sun. According to the time stamp on my phone the object moved from left (east) to right (west)and the photo without the object is the final of the three. I got home later that day and downloaded the pictures I took. That was when I noticed the sphere shaped object in two of the pictures. This sphere is surounded by a redish looking plasma type shape. First thing I would like to state: is I DO NOT think nor believe this is the mothership, or a spacecraft of alien nature. I really do not know what it is which is why I'm contacting you. They are very interesting pictures whatever it is. If you figure out what it is I would be grateful if you would contact me with an answer. Or if you need more information about it you can contact me."],"Weather Factors":"None, Does Not Apply","Object Flight Path":"Straight-line path","Tags":"City","Date Submitted":"08/04/2011 11:14 UTC","Country":"United States","Log Number":"US-08042011-0073","Region":"Michigan","Object Features":"None","files":["/var/www/straped/mufon/html2text/30257.html.txt","/var/www/straped/mufon/more/30257_submitter_file1__014.jpg","/var/www/straped/mufon/more/30257_submitter_file2__015.jpg","/var/www/straped/mufon/more/30257_submitter_file3__016.jpg","/var/www/straped/mufon/org/30257.html"],"Summary":"something wierd under the sun","map":"<A HREF = \"http://maps.google.com/maps?q=44.385373,+-85.351275(30257)&iwloc=A&hl=en\"> mufon case (30257) map </A>","Source":"MUFON","City":"Cadillac"}