{"Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Date of the Event":"11/30/2002 12:00 UTC","Latitude":"31.977999","Object Shape":"Cigar, Star-like","City":"n tx","Disposition":"Insufficient Data","trends":["There have been no other sightings in n tx","This sighting has never been favorited."],"Summary":"i've been watching these since 1993 and still seeing them to todays date","Log Number":"US-07182011-0017","Country":"United States","files":["/var/www/straped/mufon/html2text/30252.html.txt","/var/www/straped/mufon/org/30252.html"],"Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsWell I've contacted MUFON about this before and one man was very rude to me and I talked to a older couple through skype and they said my story was the kind they like to investigate and was told they would contact me but I never heard back from them,starting to think MUFON is a joke. If you are interested in seeing these unidenified objects that are not aircraft of earth. i can show them to you any clear night. I have seen them that looked like they are in space and I have seen them as low as 800-1000 feet above the ground. they give off no sound and are hard to spot if you don't know what to look for,even if you do spot them,most just figure them to be airplanes but if you watch them for as long as I have you will see some strange things happen. I do not beleive them to be satalites or aircraft of known orgin. I have watched them in n west tx,florida,east tx, oklahoma where I am at this time. I call them my friends as I know they know I am seeing them. I took a maglight flashlight one night and I flashed the light at them in a fast flash. I believe one night they acknoledged me as it flashed back at me with approx. 8-10 flashes and it was moving away from me when it flashed back at me. I know in my heart these are not from earth. you have my contact info so if interested in investigating them contact me. I have showed them to a few friends and they were at awwww. this is not a joke. Thank you."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=31.977999,+-99.900703(30252)&iwloc=A&hl=en\"> mufon case (30252) map </A>","Longitude":"-99.900703","Tags":"City","Date Submitted":"07/18/2011 11:23 UTC","Sighting Duration":"Undisclosed","Region":"Texas","Case Number":"30252"}