{"Region":"California","Country":"United States","Case Number":"30256","Object Features":"Undisclosed","Date of the Event":"07/18/2011 09:05 UTC","trends":["There have been 41 other sightings in El Cajon","There was one other sighting in El Cajon on or around July 18th 2011"],"Tags":"City","Object Shape":"Star-like","Disposition":"Unknown","divs":["Sighting DetailsIt was about 9:05 p.m. on Monday , July 18th ,2011. I was getting ready to leave my house to go to the gym and workout. I have a membership at the local 24hr fitness center. As I locked my front door and walked to my car, which was parked on the street and not in my drive way this day, a object in the sky caught my attention. It was, in the best way to describe it, looked like an ordinary star at first glance. There were a lot of stars out in the night sky this night, but the thing that stood out was that this star like object was moving across the sky and made no noise. Then, that's when i noticed the second star like object, which was exactly the same size as the first object, same brightness and made no sound , but moving in a South- east direction. The first object that I saw was moving towards me in a Northeast direction. I got the feeling that these two objects must have been flying close together and then split into different flight directions.Now I do want to point out that there are many commericial craft, private planes, and military craft that fly across the sky over my city. The thing is that, when they do, you can see a fixed wing object flying across the sky with sound following behind it. At night, when you see these man made craft, all their lights are visible. Not to mention that I worked at an airport for a period of 4 years and have seen just about every plane, helicopter and experimental aircraft out there. Also, living in San Diego all my life, which has the Navy, Marines and National Guard based in our city, you see F-16 and F-18 and just about every known military aircraft out there flying across the sky on a daily basis. Going back to the two objects that I saw. These star like objects were moving at a steady speed, but not very fast. They were not shooting across the sky, but rather like coasting across the sky. I would say that they were about 5,000 to 8,000 ft in the sky. I tried to stay watching both of these objects, but the one moving southeast was getting to far away for me to stay watching it, so I focused on the first one that I saw. It was directly above me for about a few seconds. This might sound weird, but I got the feeling as if what or whoever was flying this craft, knew I was watching it. Then, the object slowed down, almost like it was not moving and begun to flicker. It got bright and then dim. it did this for about 3 or 4 seconds, then stopped flickering and begun to speed up again. It kept moving in a Northeast direction. I tried to glance at the second object to see if it was still visible in the sky, but it was long gone or just faded out of view. By the time I looked back in the first objects direction, it was gone and I could not see it anymore. This is not the first time I have seen similar objects. I have seen these same star like objects about 5 times in the last 8-9 months. I have never see two of these objects at once though. I am not a person that is trying to get attention. I am just an average 28 year old man who likes his sports and hanging out with my friends. I believe what I am seeing is not any know man made aircraft in the sky. Again, the best way to describe these objects, is to go outside and pick one of the brightness stars in the sky. Same size as a star would look, and the same altitude a star would appear to be to the naked eye, and picture that star moving across the sky at a steady speed. This is the best description I can give about what I am seeing. I observed these two star like objects for about 50 to 70 seconds."],"Summary":"I saw two star like objects in the night sky. One was moving NE in the sky, the other SE in the sky.","Longitude":"-116.959587","map":"<A HREF = \"http://maps.google.com/maps?q=32.796413,+-116.959587(30256)&iwloc=A&hl=en\"> mufon case (30256) map </A>","Latitude":"32.796413","Viewing Distance":"Unknown","Sighting Duration":"00:01:10","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/30256.html.txt","/var/www/straped/mufon/org/30256.html"],"City":"El Cajon","Date Submitted":"07/19/2011 03:41 UTC","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-07192011-0004"}