{"Date of the Event":"07/19/2011 01:30 UTC","Date Submitted":"08/08/2011 06:49 UTC","Region":"Florida","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Latitude":"29.794237","trends":["There have been 3 other sightings in Keystone Heights","There were no other sightings in Keystone Heights on or around July 19th 2011"],"Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/30255.html.txt","/var/www/straped/mufon/org/30255.html"],"Summary":"star-like circle that was stationary for at least 45 mins while flashing red, green, and white.","Weather Factors":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.794237,+-82.027869(30255)&iwloc=A&hl=en\"> mufon case (30255) map </A>","divs":["Sighting Detailsi was standing on my porch in melrose fl and as i looked to the left of me (252 west cardinal direction) i could see a stationary star but realized it was flashing colors of red, green and white at no paticular pattern. i called my brother out who is an expert in anything military or aircraft based. we discussed the facts that no earth aircraft in our region could be stationary like it was for as long as it was. we figured maybe it could be a reflection on something, so we returned inside dissapointed. after around 45 mins, i looked back outside and it had moved lower and towards the north, so now we knew it wasnt any stationary object being reflected upon. i was so extatic to finally and officialy notice a ufo. after a few moments, it slowing dissappeard below the treeline of our sight. it wasnt above us or very close, but was very bright which is why we thought it could be a star until it moved. for the distance, the brightness of the lights could not have been any earth aircraft. after the sighting i immediately wrote this report."],"Longitude":"-82.027869","Source":"MUFON","Log Number":"US-08082011-0108","City":"Keystone Heights","Case Number":"30255","Country":"United States","Object Features":"Unknown","Object Shape":"Circle, Flash, Star-like"}