{"Date of the Event":"07/18/2011 09:01 UTC","divs":["Sighting DetailsI keep my dining room curtains open full from the point where the sun starts to set, until I go to bed so I can keep an eye on the night sky. I was walking past the window at 2101 (I had just looked at the clock), and saw a black helicopter chasing what appeared to be a red-orange orb. The orb was moving fast and erratically. It appeared to me moving in a somewhat straight direct path with some maneuvers mixed in such as moving quickly up, down, and around. (Like if a bouncy ball was trapped in a box) There was still enough day light to make out all the objects, and the mountain ranges. It looked to me as if it was playing \"cat & mouse\" with the chopper. As the chopper moved erratically (trying to chase it), they moved out of sight and that's when I noticed a HUGE black plane pacing the chopper. The whole event only lasted about 10 seconds. I grabbed my video camera as I ran out the front door, but by then, it was already in the tree line and I could not capture it on film. There was no wind, no clouds, or anything (except the trees) to interfere with this sighting. This is exactly what happened a couple weeks ago above my place but in that instance, the orb was green."],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.332398,+-122.029552(30261)&iwloc=A&hl=en\"> mufon case (30261) map </A>","Log Number":"US-07192011-0009","Summary":"Another Orb Being Chased By Helicopter","Object Shape":"Circle, Star-like","City":"Cupertino","trends":["There have been 4 other sightings in Cupertino","There were no other sightings in Cupertino on or around July 18th 2011"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Case Number":"30261","Date Submitted":"07/19/2011 12:17 UTC","Longitude":"-122.029552","Latitude":"37.332398","Region":"California","Disposition":"Unknown","Viewing Distance":"Over One Mile","Object Features":"Unknown","Country":"United States","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30261.html.txt","/var/www/straped/mufon/org/30261.html"],"Sighting Duration":"00:00:10"}