{"trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around August 31st 1994"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.76717,+-106.478771(30264)&iwloc=A&hl=en\"> mufon case (30264) map </A>","City":"El Paso","Longitude":"-106.478771","Viewing Distance":"21-100 Feet","Object Features":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/30264.html.txt","/var/www/straped/mufon/org/30264.html"],"Latitude":"31.76717","Tags":"City","Object Shape":"Triangle","Log Number":"US-07192011-0012","Object Flight Path":"Straight-line path","Case Number":"30264","Country":"United States","Date of the Event":"08/31/1994 12:00 UTC","Date Submitted":"07/19/2011 05:49 UTC","Summary":"Two different stories. See below please.","divs":["Sighting DetailsOn a similar matter, as long as I'm writing anyway, I may as well report that I also saw (personally) a UFO. I never reported it because I was the only one in my group who saw it, as they were all looking elsewhere. But it wasn't a case of mistaking it for \"bright lights in the sky.\" In my case the gigantic, triangular craft gently, quietly floated over our car while we were driving on I-10. And it wasn't super high in the sky either -- maybe 100 yards (although I'm bad at estimating distances). My husband was driving West on I-10, naturally looking straight ahead. I had turned my body around sideways facing him so I could speak to him and also speak with the two people in the back seat. Then I saw a huge triangular UFO slowly glide over the car, and when I turned to look out my side window I saw it glide down behind a small hill on my side of the car. It had a light on each of it's three points. It was such an amazing experience that I never even mentioned it to anyone in the car until 3 months later, as I felt that it was meant for me alone to see. Also, since no one else saw it and there would be no proof, I didn't see the point in reporting it. This took place in, I think, September of 1994. I guess it made me feel special to have witnessed the craft when no one else did, so I didn't say anything for awhile. In any event, now is as good a time as any to mention it to MUFON, since I'm writing to you anyway about the Travel Channel program. Thank you for your time."],"Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Texas"}