{"Sighting Duration":"Undisclosed","Source":"MUFON","City":"Tucumcari","Tags":"City","Date of the Event":"07/12/2011 09:15 UTC","Weather Factors":"Unknown","Summary":"Unidentified lights","Object Features":"Undisclosed","trends":["There have been 3 other sightings in Tucumcari","There was one other sighting in Tucumcari on or around July 12th 2011"],"files":["/var/www/straped/mufon/html2text/30276.html.txt","/var/www/straped/mufon/org/30276.html"],"Viewing Distance":"Unknown","Longitude":"-103.719336","Object Flight Path":"Undisclosed","Latitude":"35.173483","Country":"United States","Object Shape":"Flash, Star-like, Other","Region":"New Mexico","Disposition":"Insufficient Data","Log Number":"US-07212011-0002","map":"<A HREF = \"http://maps.google.com/maps?q=35.173483,+-103.719336(30276)&iwloc=A&hl=en\"> mufon case (30276) map </A>","divs":["Sighting DetailsAbout 9:15 pm (Mountian time) I was sitting on the front porch of our house which is on a hill. I was looking east over town of Tucumcari,NM. There was a bright flash of light and when I looked up about 35 degrees from the horizon there were two lights, exactly like the bright headlights of a car. They seemed to be shining directly toward me. There was no sound. They did not move at all for about 15-20 seconds. Then they seemed to turn EVER so slightly to their right and then just disappeared. I mean vanished or turned off. They were not seen again. Our house is directly west of a very small airport, about 7 miles. We see the small planes all the time as they land and take off coming directly over our house. These planes are usually at about 2 to 4 thousand feet high. My first thought was that it had to be one of the planes that had taken off, for whatever reason had landing lights, on and must have gone behind a cloud. It was headed away from the airport not toward it.. Also,these small planes do not have TWO landing lights. Looking carefully I could see no clouds. Not understanding what I had seen I called to my husband to come out and told him what had happened. We looked for any sign of clouds and saw none. There were many stars. After thinking about this for some time we are still mystified. Any thoughts?"],"Date Submitted":"07/21/2011 01:10 UTC","Case Number":"30276"}