{"trends":["There has been one other sighting in French Island","There were no other sightings in French Island on or around July 19th 2011"],"Source":"MUFON","Case Number":"30270","Latitude":"43.866699","divs":["Sighting DetailsWas leaving a friends house around 10:30pmCST, and before I got into my vehicle, I noticed some flashing lights in the sky. Not bright by any means, but if you were looking at the approaching lightning, you could notice them easily. Didn't really think too much of them and began my drive home. Upon turning onto my street, I slowed down and looked out my window to the east. I saw that there were now three lights in total. They were not blinking in unison. As I watched the lights, they began to move together into the shape of a triangle. They kept moving at each other until it appears as though they met and spun around as one unit then dashed away from the point of rotation. I called the friend, whose house I had just left to see if he could see said objects. After describing where they were he could see the two that I could also see. One went off to the east and I lost sight of it in a minute or two. The second two were off to the west well over Minnesota (extremely close to the boarder), and one was towards the south end of town. I watched them until they dipped behind my neighbors house and could no longer see them. The total duration of my sighing was approx. 5 min. From the point of initially turning down my street and seeing them, to calling the friend, to watching them drift off. The trip home took around 7-10 min, and I believe that they were over the area the entire time."],"Tags":"City","Date Submitted":"07/20/2011 12:13 UTC","Disposition":"Unresolved","Object Shape":"Flash, Unknown","Date of the Event":"07/19/2011 10:45 UTC","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"Saw 3 flashing lights come together and form a trangle, then shoot apart.","Country":"United States","Longitude":"-91.254317","City":"French Island","files":["/var/www/straped/mufon/html2text/30270.html.txt","/var/www/straped/mufon/org/30270.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.866699,+-91.254317(30270)&iwloc=A&hl=en\"> mufon case (30270) map </A>","Weather Factors":"Unknown","Region":"Wisconsin","Log Number":"US-07202011-0001"}