{"Viewing Distance":"Unknown","Log Number":"US-07212011-0004","Summary":"very loud roaring object about the size of a commercial airliner with three dull red lights in a triangular formation no blinking lights of any kind, westbound, high altitude, fairly high speed","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.547851,+-87.551963(30278)&iwloc=A&hl=en\"> mufon case (30278) map </A>","trends":["There have been no other sightings in Hohenwald","This sighting has never been favorited."],"Region":"Tennessee","Date Submitted":"07/21/2011 02:47 UTC","Case Number":"30278","Date of the Event":"07/21/2011 12:00 UTC","Object Flight Path":"Undisclosed","Longitude":"-87.551963","Tags":"City","City":"Hohenwald","files":["/var/www/straped/mufon/html2text/30278.html.txt","/var/www/straped/mufon/org/30278.html"],"Object Features":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsJuly 21, 2011 between 12:00am-12:10am lightly scattered clouds little or no wind. I was sitting on my porch smoking a cigarette. I heard a very loud roaring noise that had me confused at first. I began to hear what sounded like prop noise from a large turbo-prop transport. I have seen military transports fly over in the middle of the night at low altitude before. Considering how loud it was, I was certain this was what I was hearing. Everytime I see these planes they come from the Southwest and fly directly over my house heading North-Northeast towards Ft. Campbell. I looked to that direction but couldn't see anything in the sky. As it started getting louder the \"prop noise\" disappeared and I could only hear the loud jet-like roar. It was then that I started to scan the sky and when I finally spotted the source of the noise, it was directly overhead. It was heading almost due West. I often see commercial aircraft flying in the same area of the sky on about the same heading. But this aircraft was slightly faster than what I usually see and was at a lower, but still fairly high, altitude. Even when you consider the lower altitude it was still proportionately faster than what I usually see in the sky. It had three dully lit red lights in a tight triangle formation. No blinking lights of any kind. Only the three continuously lit red lights. I watched it for about 10 long seconds. At first I thought maybe it was a fighter jet. But judging by the lights, it was a long slender craft. My next guess was maybe it was one of those supersonic jets which are notorious for their noise and are long and slender, but there were no blinking lights and I dont even think any of them are in commission anymore because of their noise emissions. It was then that I realized this was no normal aircraft. Military maybe, but definitely out of the ordinary. I constantly watch the sky at night studying the blinking lights that cross the sky but this is a first for me. It flew straight and at a constant speed and continued to do so until I lost sight of it in the tree tops. The roar dissipated as I lost sight of the aircraft."],"Latitude":"35.547851","Weather Factors":"Unknown","Disposition":"Unknown","Object Shape":"Triangle"}