{"Disposition":"Insufficient Data","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.084528,+-76.863852(30289)&iwloc=A&hl=en\"> mufon case (30289) map </A>","Longitude":"-76.863852","Region":"Pennsylvania","Date Submitted":"08/01/2011 11:21 UTC","Object Features":"Unknown","City":"Watsontown","Weather Factors":"Unknown","trends":["There have been no other sightings in Watsontown","This sighting has never been favorited."],"Date of the Event":"07/15/1994 12:00 UTC","Source":"MUFON","Object Shape":"Oval","Log Number":"US-08012011-0055","Object Flight Path":"Hovering then path","Summary":"My parents saw a u.f.o. and it was in a lot of newspapers at that time also","Case Number":"30289","Latitude":"41.084528","Viewing Distance":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/30289.html.txt","/var/www/straped/mufon/org/30289.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy mother said they were watching tv in the middle of a sunny day when all of a sudden it became very dark outside. My mom went to the door to see if a storm was there and she said when she looked up she saw a gray object hovering over the house. The object made a low humming noise, it was very large my father said a football field at least or more. Mom said it hovered for a long time then just sped away very fast. It was also documented in various newspapers across a wide area (Williamsport down towards Harrisburg?)(been awhile memory of details are fading to be honest but I am trying to describe details best I can)and she showed me the clippings. Its amazing that no-one ever followed up on what this was. I want to know..I saw something in the skies in Texas while sitting outside at night with my son (1993-1995?)he saw it and I looked up when he asked me what it was. I thought I could explain it away until I saw it. I never saw a ball of light that bright of a white ovulating? back and forth up and down such as it was wobbling? and it moved fairly slow until it shot up into space. WTF? I can't believe no-one has an answer I am not a sceptic anymore since I saw things with my own eyes. I also saw an object just race across the horizon after the light had been just blinking about every 20 seconds. I didn't really watch the skies in Texas until the neighbors said they saw stuff a lot. I was sceptic until my son noticed that white ball of light that night then I watched a lot. I reported these things awhile ago on this sight but no-one had an answer for it."]}