{"Log Number":"US-08062011-0037","Object Shape":"Circle, Sphere, Star-like","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.691691,+-86.241947(30287)&iwloc=A&hl=en\"> mufon case (30287) map </A>","Country":"United States","Date of the Event":"07/21/2011 10:12 UTC","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around July 21st 2011"],"Object Features":"Undisclosed","Region":"Indiana","Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Longitude":"-86.241947","Case Number":"30287","Date Submitted":"08/06/2011 12:03 UTC","Summary":"Flash from a Bright Orb like Star","files":["/var/www/straped/mufon/html2text/30287.html.txt","/var/www/straped/mufon/org/30287.html"],"Source":"MUFON","Latitude":"41.691691","City":"South Bend","divs":["Sighting DetailsOut at night walking my dog along the river. I looked up which I do all the time, happen to see a bright star like object thought it could be a plane way to high to be a helicopter no lights flashing. At first I thought I was seeing a satellite then I notice the object moving across the night sky rapidly in a straight North West direction I was reaching for my phone to take a pix I knew it would be way to far to take a good photo but I was going to try anyways it was now like over my head when I notice a flash come from it. It was a bluish white ring that flash from it, if it was a craft of any sort it would be on the bottom of it. Since it was so high up all I can describe it as a brite star like orb. Let me tell you the second it did that it sent goose bumps down me and now my lower side has sharp dull pains even while im typing this. I felt whatever it was knew I was staring at it beacuse I kept my eye on it to see if it flashed again so that I knew it was a plane but it didn't it kept flying past me in that North West direction and it just disappered like some one turned off the lights"],"Sighting Duration":"Undisclosed"}