{"Object Shape":"Sphere, Star-like","Weather Factors":"None","Latitude":"34.311878","City":"Los Angeles","Source":"MUFON","Region":"California","Disposition":"IFO","Date Submitted":"07/22/2011 02:48 UTC","Tags":"City","Viewing Distance":"Over One Mile","Date of the Event":"05/01/2011 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.311878,+-118.447547(30293)&iwloc=A&hl=en\"> mufon case (30293) map </A>","Object Features":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Country":"United States","Longitude":"-118.447547","files":["/var/www/straped/mufon/html2text/30293.html.txt","/var/www/straped/mufon/org/30293.html"],"divs":["Sighting DetailsOkay. So basically I had gone out to feed and water my dogs in the back yard.. it was about dusk and the sky was that pretty orangey pink and muted blue. I had looked up just to take it in before I went back inside and just as I was about to turn to do so.. it caught my eye.. it was a little.. out of place shimmer that I honestly thought was a star.. which is why I turned.. I thought it was funny that a star would be popping up so early. When I finally caught sight of it again though.. I noticed that the reason it was so difficult for me to find again was because it wasn't stationary. I kept my eyes fixed on it and started to pick out the few details that I could. The object was completely lit up.. white and some hints of a brilliant electric blue that would filter off and on. It was spherical from what I could tell. What made me realize for certain that this was no star or satellite was the movements that it would make.. it would move forward then hover.. rise or fall in altitude.. then move backwads. It repeated these movements as if it were observing. When it made one of its passes underneath a large cloud.. I noticed another craft (a bit smaller in size but about the same otherwise) hovering just above the same cloud. Then the other object became visible again and both objects were in my field of view for five or so more minutes while they moved in the strangest ways. The smaller light almost tagging along with the bigger light. I felt anxious watching it (anxious but not particularly afraid).. even my dogs were acting strange.. though there was no sound that I could pick up on. (Maybe they were picking up my anxiety?) I watched these objects for over 20 minutes when they both finally gained massive altitude.. and from what I could tell were also heading north-west and then both disappeared quickly in the distance and altitude. I wasn't able to get photo or video.. as the objects were very small looking from where I was."],"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around May 1st 2011"],"Sighting Duration":"Undisclosed","Log Number":"US-07222011-0005","Summary":"Standing in our back yard I sa what I thought to be a star/satellite.","Case Number":"30293"}