{"City":"Kansas City","trends":["There have been 27 other sightings in Kansas City","There was one other sighting in Kansas City on or around July 6th 2011"],"Object Shape":"Square, Rectagular","Viewing Distance":"Unknown","Country":"United States","Date of the Event":"07/06/2011 11:50 UTC","Latitude":"39.16634","Region":"Kansas","files":["/var/www/straped/mufon/html2text/30292.html.txt","/var/www/straped/mufon/org/30292.html"],"Sighting Duration":"Undisclosed","Log Number":"US-08022011-0042","Longitude":"-94.607214","Summary":"bright orange, first in 3 sections, then in 2 sections, then 1","Disposition":"Unknown","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.16634,+-94.607214(30292)&iwloc=A&hl=en\"> mufon case (30292) map </A>","Case Number":"30292","Object Flight Path":"Path with directional change","divs":["Sighting DetailsDriving from Independence to Olathe on 4-35 West in (Kansas City). Had friends in car with me. We all saw it. I was the driver and looked up and said \"That is the strangest moon I have ever seen\". Of course it really did not look like the moon but I had no other explanation. It was in 3 sections and I thought the clouds were covering the moon in two places, thus making it appear as 3 parts. It was so Orange and was so bright. My rational mind could not make sense of what I was seeing. We were silent as we continued to stare at this. It separated into 2 separate squares or rectangles. Then only 1 was visible and was in a rectangular shape. It was large and I could not figure out what it was. First time for me ever seeing a UFO. Then it just disappeared, just like that which really made no sense. There all big and orange one second and then vanished the next.I told several people about this and I knew without a doubt that it was a UFO. I never thought I would ever see such a thing as I am not really big on UFO stuff. It wasnt until last night that I was informed that Kansas City has been a hot place for sightings lately. I got on the internet and began reading and was amazed that so many people are seeing the orange glow in the sky. I was not scared but transfixed as once I saw it, I could not take my eyes off of it even though I was driving down the highway. It was late and very little traffic."],"Object Features":"Unknown","Date Submitted":"08/02/2011 06:17 UTC"}