{"Case Number":"30296","Date Submitted":"08/07/2011 10:44 UTC","Date of the Event":"03/06/2010 01:00 UTC","Source":"MUFON","divs":["Sighting DetailsUntil Jan of 2011 we lived in Lyndhurst, Va. Around Mar of 2010 (I do not remember the exact date)I was on my front porch and looking eastward (Clear weather, no light pollution there) I and my wife saw this bright glow that remained stationery for about 35 minutes. Around 20 min into this, the glow flickered for a moment, almost appeared as dim blue, then went to bright whitish again. So I managed to grab the closest camera, a kodak c-310 model, had to quickly install batteries, and managed to grab these 2 photos. I am not much on photography, mostly my wife took family photos and events. Although I am disabled, I worked as a contract airline refueler and certified contract trainer for several major airlines and also provided military contract services, and am familiar with most military aircraft also. I am comfortable with my knowledge and experience of how objects appear in the night sky. I also have dabbled with backyard astronomy over the years. Even from Lyndhurst I could spot a satellite in orbit with the naked eye on occasion, and the wisp band of the Milky way. Am also famaliar with aircraft routes as viewed from ground. Well we had other things going on at the time, and this event faded. In Jan of 2011 we had to move to Williamsburg, and just in the last week I found the camera I thought was lost. I uploaded all the photos and discovered these two were still on the card. Now my curiosity is building. This object or whatever it is did not appear to move in the least bit, seemed positioned with the stars. I do not claim this is a UFO or anything, but it was a fascinating event. These images (1 full shot, 1 zoomed) are all I have. The light faded out, and I waited another hour or so, it never reappeared. Mabye your staff can test these out, and I would greatly appreciate a reply with your opinion of what this may be. I know this was not the Moon, Venus, any aircraft I can identify, or swamp gas.Thank You."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.029304,+-78.945024(30296)&iwloc=A&hl=en\"> mufon case (30296) map </A>","Log Number":"US-08072011-0029","Summary":"Unknown object photographed","Object Flight Path":"Stationary","Longitude":"-78.945024","Viewing Distance":"Over One Mile","Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30296.html.txt","/var/www/straped/mufon/more/30296_submitter_file1__100_2368.JPG","/var/www/straped/mufon/more/30296_submitter_file2__100_2369.JPG","/var/www/straped/mufon/org/30296.html"],"Disposition":"Unknown","Object Shape":"Sphere","Region":"Virginia","trends":["There have been no other sightings in Lyndhurst","This sighting has never been favorited."],"Tags":"City","Object Features":"None","Latitude":"38.029304","Country":"United States","City":"Lyndhurst"}