{"Tags":"City","Latitude":"41.880894","Longitude":"-87.624998","files":["/var/www/straped/mufon/html2text/30306.html.txt","/var/www/straped/mufon/org/30306.html"],"Country":"United States","Sighting Duration":"Undisclosed","Region":"Illinois","City":"Chicago","map":"<A HREF = \"http://maps.google.com/maps?q=41.880894,+-87.624998(30306)&iwloc=A&hl=en\"> mufon case (30306) map </A>","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around July 15th 2011"],"Date Submitted":"07/23/2011 12:00 UTC","Object Shape":"Triangle","Log Number":"US-07232011-0001","Disposition":"Unresolved","Weather Factors":"Unknown","Object Features":"Unknown","Summary":"Driving on the skyway heading towards Gary Indiana my wife notice a triangle shaped object flying over head.","Object Flight Path":"Path with directional change","Case Number":"30306","divs":["Sighting DetailsMy wife, daughter, and myself were driving on the Chicago skyway heading towards Gary, Indiana. While I was driving, my wife told me to look up, because there was a triangle shaped object about a half mile away, and flying in our direction. I looked up and saw the object heading in our direction. The object had many lights on it which were evenly spaced apart encompassing the entire bottom of the object. The object appeared to be a couple hundred ft across, and the lights were flashing red from front to back of each individual light. The traffic was heavy, and we were unable to stop and take pictures. We lost sight of the object soon after it passed over head, since we were headed in the opposite direction. I did not here any noise coming from the object, and as it passed over I was able to look up and notice that I could look through the object between the flashing lights. It did not appear to be a solid object, but possibly a formation of bright red flashing lights. The sun was beginning to set, and I could not tell if the formation of lights were planes or something else. I have not seen planes flying in such a tight formation with these types of lights. The formation of lights stayed consistent and we did not see any of the individual lights move outside of the formation. It was as if the lights were connected and moving in unison, yet there seemed to be gaps between the lights that you could see the sky above. We are unsure what we saw, and it was probably nothing, but it looked very odd. I am in the military, and worked as a corrections officer, and my wife is an attorney. We had never seen anything that looked like that, and was curious if anyone else had seen this."],"Date of the Event":"07/15/2011 08:20 UTC"}