{"Source":"MUFON","Country":"United States","Disposition":"Unknown","Longitude":"-93.599939","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.596934,+-93.599939(30303)&iwloc=A&hl=en\"> mufon case (30303) map </A>","Latitude":"41.596934","Object Flight Path":"Hovering then path,Path with directional change","Region":"Iowa","Case Number":"30303","Summary":"round glowing orange object that flickered like a candle flame","Date of the Event":"07/05/2011 09:30 UTC","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around July 5th 2011"],"Object Shape":"Fireball, Sphere, Teardrop","City":"Des Moines","Sighting Duration":"Undisclosed","Log Number":"US-07222011-0014","divs":["Sighting DetailsDriving west on I235 through downtown Des Moines when I noticed a light too orange to be a plane. So I asked another passenger in the car if he thought it was a plane and at first he said it was a helicopter but immediately changed his mind and said it couldn't be because it was on fire. The other two people in the car then took notice to it too. On the eastern bend of the road in the neighborhood to the north of us was a fiery object very clearly NOT falling. It made a few movements that implied thinking and not physics to its movement (It moved back and fourth a little bit as if it were searching for something). We weren't going to stop, and so I'm not sure how long the actual event was, but I saw it for more than five consecutive minutes hovering maybe a hundred feet or so above an east-side residential neighborhood, and it was aprox. the size of a person. We ran through all possibilities (fireworks, space-junk, falling aircraft... you name it) but then realize the only rational conclusion was that it was unidentified, flying and an object. We were late and weren't going to stop, despite how cool it was and the event ended (for us) minutes later. Anyone else see or hear 'bout this? I've got three witnesses to the event on this end"],"Viewing Distance":"101-500 Feet","Date Submitted":"07/29/2011 06:43 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/30303.html.txt","/var/www/straped/mufon/org/30303.html"],"Object Features":"None"}