{"divs":["Sighting Details I was driving down marigold avenue going home and I saw smoke,it was raining and lightning and my fiance called me and told me that a tree was hit by lightning in our backyard. So as I was comming home I saw smoke comming from the trees and I thought that maybee the lightning had started a fire somewhere,as I continued to look at what I thought was fire,I noticed six bright orange lights. At first I thought they were towers with lights on the tops, but then I relized I have never seen those there before,then I noticed that they were moving and I wondered if anyone else was seeing the lights then I pulled to the side of the road to film it. I started to follow the lights. I tried to call my fiance and my daughter to tell them to look outside,but they didn't answer the phones. I was almost home so I tried to hurry and show them,but when I pulled up they were already looking at them. The lights were very close but they seem further away in the picture. My fiance,daughter,and my son saw them and said that they flew directly over the neighbors house. When i was following the objects in the sky they were behind a lot of trees and houses and when they got higher in the sky they faded away into the clouds."],"Region":"Florida","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.301566,+-81.400541(30308)&iwloc=A&hl=en\"> mufon case (30308) map </A>","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/30308.html.txt","/var/www/straped/mufon/org/30308.html"],"Summary":"six orange balls,orbs,flying low, very bright and appear to be spinning. they appear to be comming from behind trees and flew over the house","Date Submitted":"07/28/2011 10:45 UTC","Object Features":"Undisclosed","Case Number":"30308","City":"Kissimmee","trends":["There have been 18 other sightings in Kissimmee","There was one other sighting in Kissimmee on or around July 22nd 2011","This sighting has never been favorited.",""],"Log Number":"US-07232011-0003","Date of the Event":"07/22/2011 09:30 UTC","Country":"United States","Latitude":"28.301566","Object Flight Path":"Undisclosed","Object Shape":"Fireball","Source":"MUFON","Disposition":"Insufficient Data","Longitude":"-81.400541"}