{"Date of the Event":"01/04/2011 12:00 UTC","Viewing Distance":"Unknown","Sighting Duration":"12:28:25","Object Flight Path":"Undisclosed","Longitude":"-78.636244","files":["/var/www/straped/mufon/html2text/30312.html.txt","/var/www/straped/mufon/org/30312.html"],"Date Submitted":"07/29/2011 02:05 UTC","Latitude":"35.778866","City":"Raleigh","divs":["sighting details[link moved to additional evidence section\\cms\\tg] this is the site of the only photo's in this durham area that have been buzzing the area...i have come up with an hypothesis..to the matter...they are getting ready for invasion and using the government to do it...they are being used bigtime...they don't have the experiance i do in flying a ufo...i distinctly remember flying in a simulator..because who would give an unexperianced person a 300 million dollar spacesaucer..? with mean's to have an alternate power source ellimant 115..which can't be duplicated...because we don't have this ellement on earth..i am an industrial wiring tecnition in high voltage lead's and wiring up power of 600 amperes and up..i have been dropped into the bed 6 inches one morning and knew i was abducted because when i landed on the bed , i woke up..and my child angel broke a wing after being on my headboard for year's with out an incident ever...and after i was dropped into my bed...i could hear a humming sound like cintrifical force of some kind..and maybe metal whisleing..slight weezing..and it wasn't snoring..i was awake when i heard it...i blog my photo's and will blog them untill other's know that the government has agreed to assist the alien grey's..and other's..there are several other alien's here..but all humanoid ofcourse...seem's that all \"intelligent life\", have two arm's and leg's..a mind and a soul..not just us on earth..i have seen 12-14 ufo's here in durham,nc. near 85hwy and duke st. near the mall area..i have even seen a ufo abducting a person or scanning that person...i noticed it after watching the ufo for an hour..move across the sky slowly..all the edges were or had a star like light that they could manipulate and make smaller and larger....i believe they ahve light's that,******************************************************************************************************************************************************************************************************************************** and could make there own energy based on elecreon's and photon's instead of reguar electricity..my prefessor is mr.keith. which is in the government branch of the american electrical safety inspector for the rntire usa..i am proud to be taught by the best and study on my own know enventing alternate power sources...i have tried all kind's but photon's converted into energy is the most effecient and the least cost werthy...i will be studying and trying to perfect this are of protese. and will keep other's and you updated...i would have told you how it work's but it would start to be a case of national security and i would rather come up with it myself instead of having it stollen or torched.i have to look out for the ones that are here with me..other's ...they are smaller and more dense than us...and they are all collor's according to where in the universe you are in ..blue,red,white, sun's depect what kind of skin you end up with..and how your pigment react's to this kind of sun...? we could go to a planet with a blue sun and it could mess with our skin and eye's and maybe even our mind..the government has to take step's and don't want to have to explain there selfes..because it isn't effecient..for us to do so...and it is very secure that way..i want to let other's know that this is real and that these thing's are not fake and the government can't stop them becasue they can't let other's know that they have such a devise or saucer ship flying in our sollar system..these thing's are real and not in 2012...they are here and now !!! if you don't believe me then take a digital camera outside at night and look for any star's that seem to twinkle and glitter, while moving slowly..usually mean's that is a ufo studying you..they are all over the world and if you don't believe in ufo's .you will after this experiment...and they usually apear after 1:00am and untill 6:00am. planes don't count..and it is back to work after saying a few word's....then go and see the movie about a ship comming to earth and trying to get us to change our way of thinking..? to save us..mr.k. reaves is in it and you see that they are more advanced than us..they have taken out of us the abillity to read each other's mind's...they are stealing it from us...so they can prolong their lives..the grey's...they are taking our soul...or a part of it..since we don't need psycic power's the grey's take it from us to keep us from evolving...they have taken our abillities out of us..somehow they have a way of bringing the psycic power to the surface..and harvesting that"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.778866,+-78.636244(30312)&iwloc=A&hl=en\"> mufon case (30312) map </A>","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around January 4th 2011","This sighting has never been favorited.",""],"Object Shape":"Cigar, Chevron, Circle, Disc, Oval","Weather Factors":"Unknown","Summary":"Alien spotted and verified Alien. NOT OF OUR SPECIES> NOT Earth orented=Alien visiting [name removed/cms/tg]","Object Features":"Undisclosed","Source":"MUFON","Case Number":"30312","Disposition":"Hoax","Tags":"City","Country":"United States","Log Number":"US-07232011-0007","Region":"North Carolina"}