{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.963366,+-70.660712(30317)&iwloc=A&hl=en\"> mufon case (30317) map </A>","Object Shape":"Fireball","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date of the Event":"07/23/2011 08:30 UTC","Longitude":"-70.660712","Summary":"Orange Lights Flying in Succession","City":"Plymouth","files":["/var/www/straped/mufon/html2text/30317.html.txt","/var/www/straped/mufon/org/30317.html"],"Latitude":"41.963366","Date Submitted":"07/23/2011 09:49 UTC","Case Number":"30317","Source":"MUFON","Log Number":"US-07232011-0011","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Tags":"City","trends":["There have been 15 other sightings in Plymouth","There were no other sightings in Plymouth on or around July 23rd 2011"],"Region":"Massachusetts","divs":["Sighting DetailsLong line of bright orange lights moving in succession over the southern horizon, just above the treeline. Appeared to be approximately 30 degrees above the horizon. They appeared to be a bit smaller than a pea. Objects were circular and did not flash. All objects followed the same path across the sky. My brother-in-law called me across the street to look at them, he indicated that he had seen about 15 of them already.His wife, and our two neighbors also witnessed the objects. In the twenty minutes that I watched, another dozen or so followed. They appeared to be below the cloud cover. We live in the flight paths of both Logan Airport in Boston, and TF Green Airport in Providence, as well as multiple smaller private airports. The lights did not appear to be airplanes. They did not have green and red wing lights, nor the amber tail and head lights. They did not flash at all. Multiple planes flew over head during the event. These planes produced the only sound. The orange objects observed did not create any sound. The orange objects also did not fly in any of the observed flight paths. Planes bound for Logan tend to travel over head from the west and to east, and then turn north. These objects were moving from the west towards the east. The objects were observed through binoculars. They appeared to be from a single object, and with the binoculars, no flashing was apparent. The were only visible as they passed from the west behind tree cover, and then sight was lost as they neared the easterly horizon and were obscured by trees."],"Weather Factors":"Unknown"}