{"Sighting Duration":"Undisclosed","Summary":"i stepped out on the deck to get some fresh air and look at the stars. i saw an orange/amber light heading south.","Object Flight Path":"Path with directional change","Case Number":"30321","Latitude":"47.181966","Disposition":"Unresolved","Date of the Event":"07/23/2011 11:30 UTC","Log Number":"US-07242011-0003","Tags":"City","trends":["There have been 4 other sightings in Bonney Lake","There were no other sightings in Bonney Lake on or around July 23rd 2011"],"Region":"Washington","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.181966,+-122.182616(30321)&iwloc=A&hl=en\"> mufon case (30321) map </A>","Viewing Distance":"20 Feet or Less","Longitude":"-122.182616","City":"Bonney Lake","Country":"United States","Object Shape":"Star-like","divs":["Sighting DetailsTonight at 1130 pm I steppeod out on the deck to get some fresh air. As I was looking at the stars I noticed an orange to amber looking light heading towards me. This would be from north to south in direction. I first noticed it glowing through the trees, I kept watching it and thinking that it is a strange color of light on an airplane. I was waiting for the landing lights to turn off and and just leave the red and blue or green wing tip lights on. This never happened. I called for my wife to come out and look at it also. She came out and saw it. I ran back in to grab my phone to take some sort of picture. As soon as I turned the camera on and pointed it up the light veered left, started to gained altitude very quickly and also started to dim. As soon as it dimmed I thought I saw a streak of very faint light go towards the object from the south. It almost seemed like it was being shot at by something. My wife did not see this because she ran back in our room to get her glasses on.. We are very familiar with the airplanes flying around here. Sometimes the flight path for seatac airport is right over our home. Also joint base lewis McChord flight path goes overhead. So we know it was definitely not an airplane. I would say when I first saw the object it was 4-5000 feet. By the time I lost it, it looked like it was from 100000 ft to even in orbit. We also did not hear any noise coming from the object but a few minutes later we had a small airplane further away go by and we could hear it."],"Date Submitted":"07/24/2011 03:28 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30321.html.txt","/var/www/straped/mufon/org/30321.html"]}