{"map":"<A HREF = \"http://maps.google.com/maps?q=30.216026,+-97.652244(30322)&iwloc=A&hl=en\"> mufon case (30322) map </A>","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around July 24th 2011"],"Source":"MUFON","Tags":"City","Disposition":"Unknown","Longitude":"-97.652244","Object Features":"Unknown","Log Number":"US-07242011-0004","Case Number":"30322","City":"Austin","Latitude":"30.216026","Date of the Event":"07/24/2011 02:30 UTC","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Summary":"two lights hovering and then shot off","files":["/var/www/straped/mufon/html2text/30322.html.txt","/var/www/straped/mufon/org/30322.html"],"Object Shape":"Flash, Other, Unknown","Region":"Texas","divs":["sighting detailsi was on my way home from work at around 2:30am on highway 71. i was traveling at about 65-70mph going north(towards del valle). two blue-ish lights appeared from under the slight cloud cover. the lights hovered for maybe a second or two and abruptly shot off in the distance and the lights went out. i live pretty close to the austin airport, but the planes they use don't normally perform such intense moves. i thought it may have been a meteor or a shooting star perhaps but was quick to reject the ideas since the lights were under the cloud cover and shooting stars and meteors fall. these lights shot in a straight line. the two lights may have been attached to one single object since they did not move apart\\away from each other, they were constantly perpindicular with each other throughout my brief sighting. i suspect that the object\\craft may have been a boomerang shape with a rather sharp angle in the middle, something like > i can not be exact on this idea since it was dark and the angle in which i had witnessed the event. there are a lot of variables but i haven't seen anything like it."],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Date Submitted":"07/24/2011 04:33 UTC","Sighting Duration":"Undisclosed"}