{"divs":["Sighting Detailsi live in a moblie home park aproximate location 114th and ida at aprox 940 pm i was sitting on my porch watching fire works--Wind sw to Ne. off to to the east a bright RED object caught my eye I figured some type of fire works. But it didnt go out. I watchet the object contine west against the wind.as it passed over my location higher than all fire works it apeared to be a round object with a light pulsitaning in side of like a light inside a jar. It contined for aproximatel 24 of of a mile and disappeared. Over the nex 34 of an hour or an hour 3 mre of thes objects appeared on the same course and same higth Thes objects admitte no sound of any kind and in my judgement continue west and all disapeared at the same place. There altitude is unknow The apeared to be a sphere of about 5 inches in diamater. For 30 years i was a police officer and a trained observer. at night altutide id difficutl to determine. I know what i saw sa not avation lights. i have no idea waht they were but have learnde on 2 july and 4 july very similar objects were filmed over the Omah area. I just know thes object are nothing i have ever seen before"],"Tags":"City","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Country":"United States","Date Submitted":"07/24/2011 01:24 UTC","Date of the Event":"07/03/2011 09:30 UTC","Weather Factors":"Unknown","Latitude":"41.253373","Disposition":"Unknown","Case Number":"30327","Source":"MUFON","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around July 3rd 2011"],"Region":"Nebraska","City":"Omaha","Object Features":"None","Longitude":"-95.995768","Object Shape":"Circle, Sphere","Log Number":"US-07242011-0009","files":["/var/www/straped/mufon/html2text/30327.html.txt","/var/www/straped/mufon/org/30327.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.253373,+-95.995768(30327)&iwloc=A&hl=en\"> mufon case (30327) map </A>","Summary":"ared roud object flue over not air craft"}