{"Date of the Event":"07/28/2006 07:00 UTC","Object Flight Path":"Straight-line path","Latitude":"34.426129","Log Number":"US-07242011-0016","files":["/var/www/straped/mufon/html2text/30334.html.txt","/var/www/straped/mufon/org/30334.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.426129,+-118.467488(30334)&iwloc=A&hl=en\"> mufon case (30334) map </A>","Object Features":"Undisclosed","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around July 28th 2006"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Region":"California","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"30334","City":"Santa Clarita","Tags":"City","Longitude":"-118.467488","divs":["sighting detailsmy name is [name removed\\cms\\tg]. i am a 38 year old male and have the need to share with you this sighting, for it has troubled my mind for the last few years. through much prayer,i decided to have a record of this experience and the significance of this event be formally recorded. on the night of this event, i felt compelled to go outside and observe the sky, for reasons only god knows the answer to. on or around the the 28th of july, 2006 at 7:00pm....i was witness to a craft which was traversing the sky, at around or above 18,000 feet. i observed it from on our balcony facing due south, in the direction of its flight path. in southern california, if you know where the i-5 and 14 freeways intersect, this is the general area it was heading from my vantage point. the location was over the santa clarita valley,(canyon country is where i lived specifically) and was headed in a southwest direction toward the san fernando valley...(both are in the los angeles county area respectively). this craft was a boomerang or chevron configuration. it closely resembled a letter v. it emitted no sound and had red lights running laterally down the trailing edges of the body. these light did not blink, but rather faded one after another before cycling again down the craft's wing structure. i would with 100% confidence estimate this v shaped vehicle to be in excess of 1,000 feet...or nearly a 1\\4 mile in width wing tip to wing tip! the speed of this vehicle defied aerodynamic law for a vehicle that would have been under conventional propulsion means as we know them to be, with regard to aircraft such as fixed wing prop, or jets. it moved so damned slow. how can it be there?! the time of length of my sighting was roughly 5-7 minutes, before disappearing beyond mountains that obscured further observation. i can estimate the altitude of flight because it was higher than the cirrus clouds. enough light was present from the still fading sun to observe cloud cover and the black coloration of the craft, and was coming back into view from behind (or above) clouds at times that were in the sky. the clouds were sparse and not very many were present. i think you will love to know, that 2 others were able to observe this ufo with me. my mother and father. when i initially saw this thing, i ran into the house and alerted my parents to the presence of this craft. they followed me to the balcony and stood in utter shock as we observed it together. my mother noticed something that gave her a point of reference to the scale of this thing. she pointed out that a passenger aircraft was flying literally under it! we all watched it pass under the triangle because the jet was visible with the triangle behind or above it in the background. this was possibly a 747 jet aircraft (we saw the jet had 4 wing mounted engines). it was massive. \"holy cow!...that jet could land on it mom!\", i exclaimed. the size of the jet was like that of a tic-tac in the sky, the v shaped craft was bigger than her fist when she held her hand in front of her and tried to cover it. my father later made the comment, \"i was on a big ship in the navy. that thing was bigger than an aircraft carrier, and it was in the damned sky\"! seeing this thing has changed us. we now know that there are things in this world that are not of this world. i seriously question that this vehicle was of our own design. whether it be that of extra-terrestrials would be in itself a miracle! our family is mormon. we have not been negatively affected in our belief in christ and our heavenly father by this event. it actually strengthens our faith if anything, that god in his infinite wisdom, saw fit to create other worlds and give life to them among the stars."],"Summary":"MASSIVE V - shaped craft, black, silent, red lights cycling on to off along edges.","Disposition":"Unknown","Date Submitted":"07/24/2011 10:05 UTC","Object Shape":"Chevron"}