{"Longitude":"-122.795","Object Shape":"Unknown","Tags":"City","Country":"United States","Date Submitted":"07/24/2011 07:13 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.496012,+-122.795(30333)&iwloc=A&hl=en\"> mufon case (30333) map </A>","divs":["Sighting DetailsMe and my friend were sitting in a field over by her house, when we heard a strange, high-pitch, whirring noise. We didn't know where it came from and started looking around. I looked up in the sky and almost immediately, a blue beam of light appeared to emanate from a point in the sky. The beam was at a 45 degree angle to the horizon, curved upward near the top, and slightly widened toward the lower end. The bottom end of the beam initially reached the ground so it couldn't have been far away. My first thoughts immediately were that it was a UFO. I pointed it out to my friend, and once she saw it, she wouldn't look at it again because she was so scared. We panicked and ran to her house. About 4 minutes later, I looked at the light again, and it seemed to be more vertical, and the end of the beam was gradually moving higher and higher into the sky. I called my other friend to go outside, look, and see if she could see it, but she couldn't. even though I could still see it, while she was looking as well. She just laughed at me, but I was so scared. It made me think it was pulling something up into the sky. We went into the garage, and sat there for a few minutes. About 5 minutes later, when I went outside, the light was gone. Later that night, I couldn't sleep and I was up until 5 in the morning because I was scared of what I had seen."],"Case Number":"30333","Summary":"Me and my friend heard a high-pitched whirring sound, followed by the appearance of a blue beam of light emaneting from a point in the sky.","City":"Beaverton","files":["/var/www/straped/mufon/html2text/30333.html.txt","/var/www/straped/mufon/more/30333_submitter_file1__Photoon2011-07-24at16.11.jpg","/var/www/straped/mufon/org/30333.html"],"Date of the Event":"06/26/2011 10:27 UTC","Source":"MUFON","Region":"Oregon","Latitude":"45.496012","Viewing Distance":"Over One Mile","trends":["There have been 23 other sightings in Beaverton","There were no other sightings in Beaverton on or around June 26th 2011","This sighting has never been favorited.",""],"Disposition":"Unresolved","Log Number":"US-07242011-0015","Weather Factors":"None","Object Flight Path":"Other"}