{"Source":"MUFON","Case Number":"30335","Date Submitted":"07/24/2011 10:09 UTC","Longitude":"-87.620628","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around November 7th 2006"],"Region":"Illinois","Disposition":"Unresolved","Object Features":"Undisclosed","Date of the Event":"11/07/2006 04:30 UTC","Latitude":"41.881444","Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsSome years ago, I do not remember exactly when, I had this very strong and intense \"day dream\" about a UFO hovering over an airport gate.....I did not think any more of it.... Then last year while just casually surfing he web for info on UFOs, i do that just for fun sometimes, i bumped into the O'hare airport UFO story. It perked my attention for 2 reasons, first, was the strong day-dream i had before....second, was the fact that the O'Hare UFO was over United's gate \"17\". For some reason the number 17 has had huge significance in my life....All of the events that I will mention next here occurred \"before\" I thought that the number 17 had any significance in my life, so it's not like I planned any of these events that could have been planned by me with the number 17 in mind, some obviously could not have been planned by me. (I first realized the number 17 was significant around 2001 when i first saw in my baby book, that i was born at 1:17 PM, on October, 17th.) So thats the first event of the number 17, i as born at exactly 1:17 PM on October, 17th, 1957. Also, my mom was born in the town of Ligonier, PA outside of Pittsburgh, a town that was founded in the year 1817. I got engaged on March, 17, 1984. We got our marriage license in the Allegheny County City Hall building in Pittsburgh, a building that opened in the year 1917. My BA college diploma from the University of Pittsburgh is dated December, 17th, 1980. I was in a bad car crash this year, and the ambulance arrived at the scene of the crash at exactly 9:17 PM. (I saw the printed record of the ambulance report from waning to get blood sugar info from the report etc). So, there you have it....I day dreamed about something almost exactly like the O'hare UFO incident, and the number 17 has huge meaning in my life, and the Chicago UFO hovered over United's Gate 17. just wanted to share these strange events and coincidences with you. Roy Scott"],"Object Flight Path":"Undisclosed","Summary":"I had a strong day dream with great significance to the Chicago airport 2006 event, details below.","Sighting Duration":"Undisclosed","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=41.881444,+-87.620628(30335)&iwloc=A&hl=en\"> mufon case (30335) map </A>","City":"Chicago","Tags":"City","Log Number":"US-07242011-0016","files":["/var/www/straped/mufon/html2text/30335.html.txt","/var/www/straped/mufon/org/30335.html"]}