{"Region":"Minnesota","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around July 18th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Disposition":"IFO","Latitude":"44.984825","Country":"United States","Longitude":"-93.256386","Sighting Duration":"11:46:30","Date of the Event":"07/18/2011 12:00 UTC","Date Submitted":"07/24/2011 06:12 UTC","Tags":"City","Viewing Distance":"Unknown","Summary":"Meteor-like","map":"<A HREF = \"http://maps.google.com/maps?q=44.984825,+-93.256386(30331)&iwloc=A&hl=en\"> mufon case (30331) map </A>","Case Number":"30331","City":"Minneapolis","Object Flight Path":"Straight-line path","divs":["Sighting DetailsWe were getting hit by the biggest storm this Summer, I stepped outside to get some pictures. It wasn't until later, after looking at the photos, that I realized that I had captured something strange. I have 2 images, that were taken 4 seconds apart. Both from the same place. The first shows clouds looking threatening. Time stamp: 22:46:26 The second shows numerous \"Orbs\", I only mention this because the first shot has none visible. It also clearly show an object moving fast from left to right. The object is bright at the tip and tapers off to a dark tail in the rear. Time stamp: 22:46:30 These images are still in my camera. I have included 3 images in this report, the first and second shot, as well as a close up (100%) scale, no resizing. No editing other than cropping on one so that the two are better comparable. Not sure what it was, but if it had been a meteor, it was very close, as it is this side of the clouds. We live in the city, so a meteor would have had to burn out before it hit the ground, or it would have hit a house and made the news."],"Log Number":"US-07242011-0013","Object Shape":"Fireball, Other","files":["/var/www/straped/mufon/html2text/30331.html.txt","/var/www/straped/mufon/more/30331_submitter_file1__7-18UFO01.jpg","/var/www/straped/mufon/more/30331_submitter_file2__7-18UFO02.jpg","/var/www/straped/mufon/more/30331_submitter_file3__7-18UFO03.jpg","/var/www/straped/mufon/org/30331.html"],"Object Features":"None","Source":"MUFON"}