{"Log Number":"","files":["/var/www/straped/mufon/html2text/3033.html.txt","/var/www/straped/mufon/org/3033.html"],"Country":"United States","trends":["There have been 4 other sightings in New Iberia","There were no other sightings in New Iberia on or around March 24th 1988"],"Source":"MUFON","Summary":"CE 4 in Louisiana","Weather Factors":"Unknown","City":"New Iberia","map":"<A HREF = \"http://maps.google.com/maps?q=30.003536,+-91.818728(3033)&iwloc=A&hl=en\"> mufon case (3033) map </A>","Date Submitted":"03/24/1988 12:00 UTC","Longitude":"-91.818728","Object Features":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","Object Shape":"Unknown","divs":["Sighting DetailsIncident occurred at midnight or shortly thereafter, 24 Mar 88. I was drivingwith a friend who was my passenger. We were going home after visiting friends,and were heading SE on Bull Island Road. We had travelled only a mile or less,when my car left the road and flipped over. I was pinned beneath the wheel,with my hand between the wheel and the dash, with three broken ribs and a brokencollar bone found this out at the hospital later. My friend Michelle, cantremember her last name suffered a broken nose. I am not including her as awitness, since she was unconscious and had no knowledge of the encounter.Some time between 2 and 3 hours after the wreck, two passersby came and kickedout the window on my side and got me out. They also pulled Michelle out of theright side. They then called an ambulance, which took us to the hospital.It was events that occurred during the interval from the wreck until our rescue,that I recalled later. I was somehow taken from my car and into a UFO, and thenlater placed back into the front seat of my car.My hand had been pinned between the steering wheel and the dash. I had on mymothers ring, with a childs birthstone in it. A six foot tall alien man came,got me out of the car, got me aboard his craft by what mechanism I dont know,and cut the ring off my hand. I never got it back.Description of alien Between 510 and 6 tall, well shaped, with shoulder lengthgolden brown hair. Wore white outfit, with formal Japanese-looking top smallcollar, long sleeves. I dont know if the bottom of the outfit was tight orloose fitting.Impression of craft I have the strong impression that the craft which I neversaw from the outside was on the ground right beside my car. Interior of craftis described below.Events on board I underwent surgeries which I dont remember, that removed somemuscle tissue from my right upper arm, from shoulder to beginning of forearm. The cut was only two inches, healed without stitches, and left a very lightscar. On the inside of the arm, other tissue samples were taken. The marksresulting from this were three dots in a line. Finally, a one inch cut was madeunder the chin, which healed with a very light almost invisible scar. Pic"],"Object Flight Path":"Stationary","Latitude":"30.003536","Date of the Event":"03/24/1988 12:00 UTC","Sighting Duration":"01:59:00","Viewing Distance":"20 Feet or Less","Case Number":"3033","Region":"Louisiana"}