{"Log Number":"US-07262011-0002","Object Flight Path":"Straight-line path","Tags":"City","trends":[],"Object Features":"None","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/30345.html.txt","/var/www/straped/mufon/org/30345.html"],"Region":"Kentucky","Date Submitted":"07/26/2011 01:32 UTC","Date of the Event":"07/26/2011 01:03 UTC","Case Number":"30345","Object Shape":"Sphere, Other, Unknown","Country":"United States","Latitude":"37.840583","City":"Undisclosed","Longitude":"-84.263338","Source":"MUFON","divs":["Sighting Details Just about 1 am I was walking out to my car to get something. As I was walking down the drive I looked up in the sky. I like to check the stars and see how many I can see so I always look up. I got about half way down the drive I saw a bright red light. It was not flashing but moving in the exact direction I was walking above me. I did not hear anyting and the in the direction it was moving it was going rather quickly. It did not appear to be an airplane, but could of been, and as it moved , from north to south, i lost view of it through some trees. Normal navigation lights on most aircraft can be seen as blinking. Some blue and some red or both. This red light was seemingly the entire craft and it was very bright red.With smaller aircraft you can hear them and with larger ones , the sound seems to follow shortly after you see them as they are so high up that it takes time for the sound to catch up.There was no sound with this. This is what prompted me to make this post.It was super quiet and fast. Prior to going out to my car I was inside watching a film. Not doing anything else. I went to retrieve a bag of chips . I have seen strange things before and have even made a post here before. As it turned out the post I made prior , others had seen a similar object in the state to the north and south of me. Both had similar discriptions of what I also saw. I do see the importance of making such posts as it can validate others possible sightings as well."],"Disposition":"Unknown","Weather Factors":"None","Sighting Duration":"Undisclosed","Summary":"I just saw a bright red light streak across the sky.No sound and too fast for a normal aircraft.","map":"<A HREF = \"http://maps.google.com/maps?q=37.840583,+-84.263338(30345)&iwloc=A&hl=en\"> mufon case (30345) map </A>"}