{"map":"<A HREF = \"http://maps.google.com/maps?q=37.498257,+-120.844954(30349)&iwloc=A&hl=en\"> mufon case (30349) map </A>","Case Number":"30349","Summary":"2 objects coming from the South moving to the East, there was a gap between the 2 objects the 2nd object was at the same height but about , if you stick your hand out 4 inches away from the first one,","Longitude":"-120.844954","Disposition":"Insufficient Data","Object Shape":"Other","Source":"MUFON","Object Features":"None","divs":["Sighting DetailsI was in my backyard looking at the stars, as I try to do every night, and to the East coming up from the South I saw 2 objects moving at a slow speed one in front of the other they seem to be at the same height, not to bright (both), and were about 4 inches apart if you stick your hand out, then there came a plane from the North, and I was just waiting to see what was going to happend, the plane seem to fly under the first object and nothing happend the plane didn't make any funny moves it just keep on it's course, and the 2 objects didn't change color or become dimmer or brighter and keep moving North West, I would have to say towards Turlock CA. I could hear the plane it was very loud and the 2 objects I couldn't hear anything. The plane had all it's lights on blinking but the 2 objects didn't have any blinking lights and again looked like rice, white. I was pretty sure I had just seen 2 UFO's and with the time of the plane going under the first object 10:38, maybe you could find out if they saw the 2 objects. the plane didn't go under the second object, and just kept on it's course, due South just as the 2 object keep on there course And the 2 objects just moved out and I lost sight of them. Thank you for your time; Carlos"],"City":"Turlock","Sighting Duration":"Undisclosed","Date Submitted":"07/26/2011 01:06 UTC","Viewing Distance":"501 Feet - 1 Mile","Latitude":"37.498257","Weather Factors":"None","Object Flight Path":"Straight-line path","Country":"United States","Log Number":"US-07262011-0005","Region":"California","Date of the Event":"07/25/2011 09:36 UTC","files":["/var/www/straped/mufon/html2text/30349.html.txt","/var/www/straped/mufon/org/30349.html"],"Tags":"City","trends":["There have been 8 other sightings in Turlock","There were no other sightings in Turlock on or around July 25th 2011"]}