{"Disposition":"IFO","Date of the Event":"07/25/2011 04:20 UTC","Source":"MUFON","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.261118,+-116.84503(30346)&iwloc=A&hl=en\"> mufon case (30346) map </A>","Weather Factors":"None","City":"Big Bear City","Summary":"Saw white and black orbs while photographing Military Osprey planes, jet stream trails and small plane.","Viewing Distance":"N/A","Case Number":"30346","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30346.html.txt","/var/www/straped/mufon/more/30346_submitter_file1__BlackWhiteOrbs.jpg","/var/www/straped/mufon/more/30346_submitter_file2__ospreyorbs3.jpg","/var/www/straped/mufon/more/30346_submitter_file3__BlackWhiteOrbs.jpg","/var/www/straped/mufon/org/30346.html"],"Object Shape":"Sphere","Latitude":"34.261118","Tags":"City","divs":["Sighting DetailsI was out in my yard around 4ish pm taking pics of some military Osprey planes (2) that kept flying over all day back and forth. They were cool looking and took pics for my hubby. At one point I noticed a black thing moving in the sky. So, I took a pic of it. Then about 5 minutes later I was taking a pic of trails from a jet just to see what it would look like on film. And then a few minutes later the planes came back and both flew very low down my street. I went inside after that to develop pics in my computer program and noticed black and white orbs in all the pics. Not sure what they were. You may have to put these pics in your own computer programs and sharpen to see the white orbs. The black ones were obvious. One of the pics came out dark, but I lightened it up as it was a pic of one of the Osprey planes coming over and I really saw a lot of white orbs in the pic. That's it. I will attach pics. I would like to send more pics, but there is only room for 3. Contact me if you want to see more."],"Date Submitted":"07/26/2011 02:25 UTC","Object Flight Path":"Undisclosed","Log Number":"US-07262011-0003","trends":["There have been 5 other sightings in Big Bear City","There were no other sightings in Big Bear City on or around July 25th 2011","This sighting has never been favorited.",""],"Country":"United States","Object Features":"Unknown","Longitude":"-116.84503"}