{"Latitude":"38.957065","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=38.957065,+-92.325392(30342)&iwloc=A&hl=en\"> mufon case (30342) map </A>","Date of the Event":"07/25/2011 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-92.325392","files":["/var/www/straped/mufon/html2text/30342.html.txt","/var/www/straped/mufon/org/30342.html"],"Object Shape":"Boomerang, Cigar","Object Features":"None","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around July 25th 2011"],"Viewing Distance":"Unknown","Case Number":"30342","Tags":"City","Summary":"White capsule shaped object with black boomerang shaped object in the northeastern sky","Weather Factors":"Unknown","Date Submitted":"08/08/2011 03:39 UTC","Disposition":"Unknown","divs":["Sighting DetailsMy wife and son were in the pool in our backyard. I was in the house at the time. My son looked up and said \"what's that?\" causing my wife to look up. She saw a white capsule shaped (cigar-shaped) object in the southeastern sky and noted that there were no wings and it traversed the sky in a steady pace until it passed beyond our house out of view. There was no noise as it flew. A few minutes later she heard jet(s) flying but could not determine where they were at. Fifteen minutes later, I came out to the pool and my wife told me about what she saw so I kept a steady eye out in the section of sky that she had found it. Ten minutes later, I spied another white object sans wings in the same section of sky and watched it until it was completely out of view to the south. I noted what appeared to be an exhaust trail before it disappeared but my eyes could have been playing tricks on me, having been staring into the sky for so long. Fifteen minutes later, we got out of the pool and were on our deck when I saw the white capsule object again but, directly below it, there appeared to be a separate black boomerang shaped craft (almost reminiscent of a flying wing in shape). We lost track of the white object as we focused all of our attention on the black wing. It headed north and was making a quick turn to the left and then almost made a figure eight type movement until it was beyond our view. It appeared to be traveling at high speeds (much faster than the white capsule). A moment later we saw what appeared to be a plane or jet coming out of the eastern sky heading toward the west. We were unsure if it was a jet that was scrambled to intercept or if it was just a coincidence."],"Log Number":"US-08082011-0090","Region":"Missouri","City":"Columbia","Source":"MUFON"}