{"Longitude":"-122.225783","Country":"United States","Region":"Washington","Viewing Distance":"Unknown","City":"Auburn","Object Flight Path":"Undisclosed","Tags":"City","Case Number":"30341","files":["/var/www/straped/mufon/html2text/30341.html.txt","/var/www/straped/mufon/org/30341.html"],"Date Submitted":"07/25/2011 05:41 UTC","Log Number":"US-07252011-0006","map":"<A HREF = \"http://maps.google.com/maps?q=47.311893,+-122.225783(30341)&iwloc=A&hl=en\"> mufon case (30341) map </A>","Weather Factors":"Unknown","divs":["sighting detailsall commercial a\\c's were traveling crosswind to final over our lakeland location until this event. a\\c's when event began started to a far ne point to enter patern for seatac, running far south of us. 3 disc formation, center disc slightly higher elevation in formation. three bright white discs appeared at about 2000 ft. slowly crossing valey heading west. just before or at federal way disc on left peeled off at a faster rate to the south...center disc rotated(inverted) over right disc and headed nw follwed by the 3rd and last disc. size deminished as they were moving away. appeared that the center asset and the 3rd asset sped up as they went south to about 100 plus mph...no sound was noticed. .......................................................................... my wife first noticed it and called up to me ...i took a couple pictures but i cannot say they are anything to brag about. the camera is new to me and i funbled for the first shot. i was getting ready for bed, my wife was enjoying the puffy clouded sunset. the objects were bright white, judging where they were, clearly not normal a\\c lights and had a shallow diamon \\ disc appearance >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> will have to send off pictures later"],"Date of the Event":"07/24/2010 08:40 UTC","Disposition":"Unresolved","Object Shape":"Diamond, Disc","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"3 discs, 5 mi. range, 1/4 mi. appart, S of Super Mall, heading west 50 MPH","Latitude":"47.311893","Source":"MUFON","trends":["There have been 12 other sightings in Auburn","There were no other sightings in Auburn on or around July 24th 2010"]}