{"Object Features":"None","Sighting Duration":"00:00:03","Viewing Distance":"Unknown","Log Number":"US-08082011-0076","Disposition":"Unresolved","Object Shape":"Other","divs":["Sighting DetailsMy wife and I were camping in Evanston, WY. The Moon was not visible so this would be a good night to view the stars. Just after Sunset I was killing time by looking for familiar constellations and stars - I was lucky enough to see a satellite in a South to North orbit. The North Star was clearly visible and the Big Dipper was setting while Cassiopeia was rising. My wife and I had set out some lawn chairs to watch stars before going to bed. The temperature was cool enough wear a light jacket. About 10pm we were located in an area of trees that did limit our view somewhat but the view to the North was open so we placed our chairs in that direction. After talking about the possibility of UFOs for a while we were greeted by a flying star. A few minutes later we both saw something very unusual. Four faint objects moving in a straight line appeared. We both agreed that there was four faint objects - very much like faint stars flying in formation from East to West. The formation was a line where three were exactly spaced while the forth was some distance away as if it was the fifth and the forth not visible (*space*space*spacespace*). The formation appeared as I was scanning the sky - that is to say I did not see it move from the East but my eyes just noticed the movement about due North as I was scanning. My wife saw the same objects at the same time - we both watched them move from East to West for several seconds - we lost sight of the objects the same way we found them. The speed of the objects was much faster than the satellite I saw earlier in the evening - maybe three or four time as fast. The speed and direction was very deliberate, consistent and did not waiver. I did not notice any deviation of the background star field as the objects flew thought the night sky. I heard no sonic booms or any other sound that could be attributed to the objects. I could not calculate the size of any object nor if they were connected. But, I can say, they fly formation better than anything else I have ever seen! They were headed somewhere for reason. That night I expected dreams of UFOs and aliens but I did no have any. I felt no concern about the objects at any time. I have a degree in astronomy and a former military pilot with extensive night experience. I would have dismissed this occurrence as 'day dreaming' if I was the only one to see the objects. But, my wife saw the exact same objects at the exact same time. The objects that my wife and I saw have no corresponding relevance to anything we have ever seen - either man, bird or beast."],"Date of the Event":"07/24/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.273279,+-110.961147(30356)&iwloc=A&hl=en\"> mufon case (30356) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Evanston","There were no other sightings in Evanston on or around July 24th 2011"],"Longitude":"-110.961147","City":"Evanston","Summary":"String of very small lights in formation moving rapidly","Source":"MUFON","Region":"Wyoming","Date Submitted":"08/08/2011 01:46 UTC","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/30356.html.txt","/var/www/straped/mufon/org/30356.html"],"Case Number":"30356","Latitude":"41.273279","Tags":"City"}