{"Summary":"Four bright, flashing lights in a diagonal pattern over the ocean in Santa Monica","Region":"California","Date Submitted":"07/26/2011 10:45 UTC","Case Number":"30358","Sighting Duration":"Undisclosed","Object Shape":"Diamond, Other","trends":["There have been 20 other sightings in Santa Monica","There were no other sightings in Santa Monica on or around July 26th 2011","This sighting has never been favorited.",""],"City":"Santa Monica","Object Flight Path":"Hovering then path","Disposition":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/30358.html.txt","/var/www/straped/mufon/more/30358_submitter_file1__Fourlightsinthesky7-26-11.jpg","/var/www/straped/mufon/org/30358.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.020474,+-118.488601(30358)&iwloc=A&hl=en\"> mufon case (30358) map </A>","divs":["Sighting DetailsOn Monday, July 25th around 4:45 AM, I left my apartment building which has an entrance on the beach next to the Santa Monica pier. I looked up and saw two bright lights over the ocean, just south of the pier. One light was very bright, sparkly and seemed to have color. the other one, to the left, was a bit fainter. I thought they were planets but then the fainter one quickly faded, as if it went further towards the ocean. Then on Tuesday, July 26th at around 4:30 AM, as I again was leaving my building to ride my bike to the gym, I saw four bright lights to the left of the pier in a perfect vertical line. I stopped and stared because I had never seen four lights like this before. The brighter one was at the right corner and the other lights got progressively dimer. They other three lights started to fade so I took off on my bike on the road above the beach heading south. But I kept looking towards the lights and they seemed to be getting brighter. It was so early and no one was around to witness what I saw so I dismissed it as something I was seeing because it was so early and perhaps I was just tired. I had to get to the gym, so I didn't stick around to find a witness at this early hour. I took a picture with my iPhone but it doesn't do it justice. Tomorrow I will shoot a video if I see these lights again."],"Date of the Event":"07/26/2011 04:30 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-07262011-0014","Country":"United States","Latitude":"34.020474","Object Features":"None","Longitude":"-118.488601"}