{"Region":"Ohio","Country":"United States","Object Shape":"Fireball","divs":["Sighting DetailsOn July 4th, 2011 at around 10:00 p.m. my wife and I witnessed these orange balls flying over our house as we were observing fireworks in the front yard. We live in north east Ohio. There were two. The first appeared before the second. The second appeared about 15 seconds after the first. They were moving south east and made abrupt turn south west. They were silent, and flying very low. They followed the same flight pattern. They were visible for three minutes. My mother witnessed the same objects flying over her house at the same time. She lives three miles away. She reported to me that when she saw them they were at about the same altitude and moving in the same direction as when my wife and I saw them. I have never seen anything like what I saw until today July 26th, 2011. Again I saw the same orange ball flying over my house at the same time 10:00 p.m. Only one this time. It followed the same flight pattern as those that I witnessed on July 4th. This one was flying much higher however. It was visible for about 30 seconds. I have never believed in UFOs. I can't believe that I am reporting this. When I witnessed what I did,I immediately knew they were UFOs."],"Date Submitted":"07/27/2011 12:32 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.052559,+-80.607851(30361)&iwloc=A&hl=en\"> mufon case (30361) map </A>","Latitude":"41.052559","Log Number":"US-07272011-0002","Disposition":"Unknown","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/30361.html.txt","/var/www/straped/mufon/org/30361.html"],"Case Number":"30361","Object Features":"Unknown","Weather Factors":"None, Does Not Apply","trends":["There have been no other sightings in Struthers","This sighting has never been favorited."],"Summary":"Orange Flaming Spheres (3 sightings)","Tags":"City","Date of the Event":"07/04/2011 10:00 UTC","City":"Struthers","Object Flight Path":"Path with directional change","Longitude":"-80.607851","Viewing Distance":"101-500 Feet"}