{"Object Flight Path":"Undisclosed","Country":"United States","Tags":"City","Latitude":"29.218375","Summary":"Indescribable","Longitude":"-81.014933","Region":"Florida","Case Number":"30363","Weather Factors":"Unknown","trends":["There have been 13 other sightings in Daytona Beach","There were no other sightings in Daytona Beach on or around July 25th 2011","This sighting has never been favorited.",""],"Disposition":"Unknown","Log Number":"US-08042011-0069","map":"<A HREF = \"http://maps.google.com/maps?q=29.218375,+-81.014933(30363)&iwloc=A&hl=en\"> mufon case (30363) map </A>","City":"Daytona Beach","Viewing Distance":"Unknown","Object Shape":"Circle, Fireball, Star-like, Other","Date of the Event":"07/25/2011 03:00 UTC","files":["/var/www/straped/mufon/html2text/30363.html.txt","/var/www/straped/mufon/org/30363.html"],"Sighting Duration":"00:10:00","Date Submitted":"08/04/2011 10:43 UTC","divs":["Sighting DetailsI was vacationing in Daytona Beach sitting on the shore of the ocean July 24th 2011 at 3 in the morning. I started getting a creepy feeling about being in the ocean with sharks and stuff at night and was trying to figure out if they would be more active at night. After a lot of deliberation I decided to get out and go sit with the other people I went to the beach with. I was with my sister Rachel, her friend Kenley, and someone that was a friend of a friend named Jess who lived an hour from this spot. All of us saw this. After I sat down with them, my sister started freaking out because a huge roach was running all over her legs. We were all laughing at here and I looked out over the ocean as we had been doing prior to that and noticed what at first appeared to be a lantern. It was a distant bright orange light that was pretty far off in the distance over the ocean. I thought it was some boat that was coming up closer to shore because a storm had just went through. I said out loud to everyone else, \"What the hell is that?\" and everyone just sat there staring at it. It slowly moved across the ocean and lined up straight with us which would have made this thing if floating on the ocean go against the current. It wasn't bobbing so it would had to have been a massive boat. But someone said something about how bright it was and almost as if on cue it seemed to get brighter. It started getting bigger and by the end of this part of the sighting it almost looked like the moon fell and started floating on the ocean. It was crescent shaped and had another piece right above it and looked like something was in front of it but it was fairly bright outside for it to be as late as it was and I didn't see anything near this thing. I attempted to take a picture of it but this thing wasn't picking up on my camera. It sat in front of us for quite some time before it started to lift in the air very slowly. When it lifted (about an inch from my perspective) off the water line it started shrinking rapidly and ended up the size of a star that you would normally see on a clear night. Then in the blink of an eye it shot up into the sky. By the end of all this I was so overwhelmed that my eyes started watering and I couldn't say anything but, \"What the hell was that!\". All the ladies I was with started screaming and were as excited as me."],"Source":"MUFON","Object Features":"Undisclosed"}