{"Date Submitted":"07/28/2011 05:48 UTC","files":["/var/www/straped/mufon/html2text/30368.html.txt","/var/www/straped/mufon/org/30368.html"],"Weather Factors":"Unknown","Tags":"City","divs":["Sighting Detailsi was driving and my friend was in the passenger seat. she asked me what the bright light in the sky was and i said probably a light on top of a building (because it was just a big speck of light way off) and she said no, i suggested a plane (at this point i could see the row of lights getting bigger)because we live near an airport, but when i looked at it i realized it wasnt a plane. ive seen a lot of planes coming in at night and this didnt resemble any kind of landing lights or gear. it goes over us and she freaks out and tells me to look out my window. i do and just know this is not a plane or blimp or anything. it was way too quiet. i see there is and upper deck with a light and a horizontal row of 4 or 5 super bright lights on the front. with a red blinking light on the bottom or back. she said when she looked up at it it had 3 lights, one on each corner and loose S shaped arms going from the center with those lights on each end. in the center there was a circle of lights and she said it was so low to the ground she could she the lights moving across the ground towards us. and at one point the center lit up and moved around like a dimmer hazy blue version of a spot light. we were going to stop to get a better look at it, but when we turned around to track it in the sky it had disappeared. it was very fast moving towards us, slow when moving over us and fast again when it passed us. there was no sound indicating engines or anything similar. it was silent and smoothly going through the sky not even like there was wind resistance. we both felt such a strange feeling when it was near us. and were both itchy and had nausea after."],"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Summary":"black triangle","Log Number":"US-07272011-0009","map":"<A HREF = \"http://maps.google.com/maps?q=41.673788,+-83.551352(30368)&iwloc=A&hl=en\"> mufon case (30368) map </A>","Longitude":"-83.551352","City":"Toledo","Viewing Distance":"Unknown","trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around July 26th 2011"],"Case Number":"30368","Object Flight Path":"Straight-line path,Path then hovering","Date of the Event":"07/26/2011 12:00 UTC","Disposition":"IFO","Region":"Ohio","Object Features":"Dome, Appendage(s)","Source":"MUFON","Country":"United States","Latitude":"41.673788"}