{"Disposition":"Unresolved","Region":"Indiana","Date of the Event":"07/26/2011 10:25 UTC","Longitude":"-85.438861","map":"<A HREF = \"http://maps.google.com/maps?q=39.838379,+-85.438861(30374)&iwloc=A&hl=en\"> mufon case (30374) map </A>","Viewing Distance":"Unknown","Case Number":"30374","Sighting Duration":"00:00:15","files":["/var/www/straped/mufon/html2text/30374.html.txt","/var/www/straped/mufon/org/30374.html"],"Object Features":"None","Tags":"City","Object Shape":"Star-like, Teardrop, Other","Date Submitted":"07/29/2011 04:04 UTC","Country":"United States","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Spiceland","This sighting has never been favorited."],"Log Number":"US-07272011-0014","Latitude":"39.838379","City":"Spiceland","Weather Factors":"Unknown","divs":["Sighting DetailsAt approximately 10:25pm Tuesday, July 26th I exited the front door of my home which is located in east-central Indiana; the front door of which faces north. Immediately as I exited my home I saw a bright light which was of a single color in appearance (Yellow), this light was larger in relation to the background stars and fell from the sky in what I would personally and possibly naively speculate to be a normal rate of descension. Upon falling the object made no sound and appeared eliptical in its descent... I believe that the object itself was spherical or circular, but that in it's descending motion appeared eliptical to me. This lasted just 15 or 20 seconds... the object from what I could tell continued to fall to Earth, but my view was obstructed by the house accross the street, I walked to my driveway after I lost sight of this to try and find a better vantage point, but by that time the object was gone... I heard no sounds in relation to it and could see no visual reminance of the object by looking to the horizon. I wonder if anyone else has seen this or anything similar in the area recently... I live in a pretty small community which is always pretty quiet at night, however in the past 2 days upon sitting on the front porch at night I have heard a lot of air traffic ( helicopters to be specific ) which is odd.... I wonder if there is any correlation between that and what I saw."],"Summary":"Unknown object fell from sky","Source":"MUFON"}