{"files":["/var/www/straped/mufon/html2text/30372.html.txt","/var/www/straped/mufon/org/30372.html"],"trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around July 27th 2011"],"Date of the Event":"07/27/2011 04:00 UTC","Latitude":"38.141164","Object Features":"Other","Region":"Kentucky","Country":"United States","Tags":"City","City":"Louisville","map":"<A HREF = \"http://maps.google.com/maps?q=38.141164,+-85.60113(30372)&iwloc=A&hl=en\"> mufon case (30372) map </A>","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Object Flight Path":"Hovering then path,Path then hovering,Other","Date Submitted":"08/09/2011 12:14 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Circle, Other","Case Number":"30372","Longitude":"-85.60113","divs":["Sighting DetailsI was sitting in the car in my driveway with one of my friends at around 3:30 or 4:00 am. i just looked into the skay and there was a red light that caught my attention coming up from behind the trees in my yard,it was like a round light hovering and moving more my way, i told my friend and he started looking, i watched it and looked like it dropped something little? and then started moving again it almost looked like it was shaking, the lights around got dim then i asked my friend if he seen something drop and he didnt but he seen the light, i got scared and couldent keep my eyes off of it and knew what it was. As we were recording it would stop.... nd hover it hid behind the tree a lil but still were i could see it sitting there. After about 15 mins of watching it move around back and fourth, it turned white and was blinking brighter, the light got bigger and turned orange and dropped to the ground the light got smaller as it went down, it was gone. I couldent beleive what i just saw, im scared still. I feel i need to talk to someone about it. I never knew... and i wanna know what happend and what was it really?"],"Log Number":"US-08092011-0062","Summary":"red light that was big, turned white and dropped to the ground (fern creek)","Weather Factors":"None"}