{"Case Number":"30387","Viewing Distance":"21-100 Feet","Latitude":"34.532594","Tags":"City","trends":["There has been one other sighting in Dahlonega","There were no other sightings in Dahlonega on or around October 25th 1989"],"files":["/var/www/straped/mufon/html2text/30387.html.txt","/var/www/straped/mufon/org/30387.html"],"Log Number":"US-08072011-0102","Source":"MUFON","City":"Dahlonega","Disposition":"Unresolved","Date of the Event":"10/25/1989 10:00 UTC","divs":["Sighting DetailsWe had moved from the Atlanta area to the Georgia mountains, about 5 miles from Dahlonega. My son joined the local Boy Scouts and I went into Dahlonega to pick him up, about 10 pm. We left town down a long straight road. We saw a round light just above the tree line at the end of the road (it was a dead end). When we turned right, the light began to follow us, matching our speed and every turn. We lived on a dirt road, which we had to take a left turn to reach. I stopped before our road, pulled off the side of the asphalt road and stopped. My son and I (he was 14) got out of the car to look at the light. It stopped when we did. It stayed stationary for about 30 seconds, then very slowly, seemed to 'float', directly over my car, about 30 feet above us. It made no noise, and all we could see was the round light, about 6 feet across. We watched it go over us into a field behind where we were stopped. The light disappeared, and I had the distinct feeling that it had gone behind a mountain. I don't know why, because this was a cow pasture which I had seen many times. We got back into the car and pulled into our dirt road. As I had been drinking coffee for several hours, I drove into a short pull-off and we got out of the car to relieve ourselves. At the same time, we both felt the need to look up. The light was hovering directly above us, again just above the tree line. After about 30 seconds, it again 'floated' the 20 feet over to our dirt road. It then accelerated down the road, from a stopped position to moving so quickly that it left a light 'trail'. I've never before or since seen anything move like that. For some reason, my son and I looked at each other and said 'MOM'. My wife was at home by her self. I drove down the dirt road as quickly as I ever have. When we pulled into our driveway, we could see nothing. We decided we wouldn't tell my wife about this. When we went inside the house my wife was sitting in a corner of the kitchen, holding our Chihuahua and my shotgun. We calmed her down and she told us that just before we came in, she and the dog had been out own our back deck. She said the dog had started barking, and then the whole yard was 'lit up' by something she couldn't see. She went into the house, and hid. About two months later, we heard odd noises in the back, I went out and saw a large owl. Related? I only told one person at work, I thought a friend. He looked at me like I was crazy, and didn't want to be around me anymore. I didn't tell anyone else. What I still wonder is: was it waiting for the first car to come by, was it waiting for me or my son, or my wife. I read UFO books a lot, but have never seen anyone else telling a similar story. I would love to hear from someone with that story, and maybe determine if there was a reason for this."],"Weather Factors":"None","Date Submitted":"08/07/2011 08:06 UTC","Summary":"A round light followed me home, just above tree level. I pulled off the road and it stopped when I did., 'floated' over us and disappeared. We stopped a short distance away and it was directly above us. It accelerated away leaving a light trail.","Object Shape":"Circle","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=34.532594,+-83.98491(30387)&iwloc=A&hl=en\"> mufon case (30387) map </A>","Sighting Duration":"01:00:00","Object Features":"Unknown","Longitude":"-83.98491","Region":"Georgia"}