{"City":"Richmond/Lexington","Summary":"Orange/ white Egg shaped Object..sailing slowly an Low ..no sound","Object Features":"Unknown","divs":["Sighting DetailsI was in the house when my dogs started barking an acting funny, so I grabed my camcorder an went out on front porch, I didnt see anything out there, about that time the phone rang it was my niece, we were talking, about ufos, she asked me what my dogs were barking at, I told her i didnt know, an just right out of the blue, I looked westward, an here came this slow moving Egg shaped object sailing by in front of me..it moved slowly, it was low,an it made no noise, i was telling my niece over speaker phone what i was seeing..i filmed it till i couldnt see it no more because of the huge trees,when it passed by the trees.this object changed it form to two round objects, then 3 objects to 2 straight side by side objects. I lost sight of it..this object was not above the trees..it passed below the high tree lines out there in the Cattle field..theres a huge road sign that it was slightly above It..It came from the west, an Headed Northward up along the west side.these are the actual photos from the film i shot..some are close ups others are distant..the film is on a sony 8 steady shot digital video Handycamcorder 990 X digital Zoom. I have more photos of this object"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Date Submitted":"08/07/2011 03:16 UTC","Date of the Event":"07/27/2011 11:15 UTC","Case Number":"30384","Longitude":"-84.322428","map":"<A HREF = \"http://maps.google.com/maps?q=37.85189,+-84.322428(30384)&iwloc=A&hl=en\"> mufon case (30384) map </A>","Disposition":"Unknown","trends":["there have been no other sightings in richmond\\lexington","This sighting has never been favorited."],"Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/30384.html.txt","/var/www/straped/mufon/more/30384_submitter_file1__101_2010.jpg","/var/www/straped/mufon/more/30384_submitter_file2__101_2015.jpg","/var/www/straped/mufon/more/30384_submitter_file3__101_1990.jpg","/var/www/straped/mufon/org/30384.html"],"Latitude":"37.85189","Object Flight Path":"Straight-line path","Region":"Kentucky","Weather Factors":"Unknown","Country":"United States","Log Number":"US-08072011-0067","Object Shape":"Cylinder, Egg, Flash"}