{"Log Number":"","Longitude":"-96.633913","Date Submitted":"08/31/1966 01:00 UTC","Object Shape":"Oval","Object Features":"Undisclosed","Source":"MUFON","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/3038.html.txt","/var/www/straped/mufon/org/3038.html"],"Case Number":"3038","Region":"Texas","divs":["Sighting DetailsI had just entered Bussey Junior High School in September of 1966.. I do notknow the exact date. I was asleep when my mother woke me in my bedroom. She wasawakened by a pulsating light and thouhgt it was a police carambulancefiretrucketc. She was scaredexcited about something in our backyard. It was in the earlymorning hours. I readily jumped out of bed and ran to my mother and fathersbedroom. My Mom told me to open the blind and look in the backyard. I lifted onevenitian blind and looked out of my moms rear window. I was shockedscared atwhat I saw. I was looking at an egg-shaped object with a pulsating light. Atfirst I thought it was hovering later I found out it was not. The object wasemitting a white light kind of glowingsuch as a light bulb. I couldnt have seenthe object more than 5-10 seconds max. Then I was blinded by a bright light. Itwas much like a flash bulb going off into my eyes. I was blinded for a fewseconds seeing the dots before my eyes. I remember my Mom saying it was gone.She also saw the bright flash but wasnt looking at the object as I was.We then awoke my Dad, telling him what happened. He went and turned on ourfloodlight to the backyardseeing nothing, he told my Mom and I to go back to bed. I did have difficultysleeping that night, but he did wake me early the next morning. I rememberhurriedly putting on my clothes. I went out of the glass sliding door to ourbackyard. My dad was standing by our pecan tree. The branches were broken on thewestern side and dangling from the tree. It was as if something came down by thetree from above breaking the tree limbs. There was an area of grass burned onthe ground, and there was three tripod indentions in the ground as if somethingheavy had pressed into the yard. My Dad was truly puzzeled. We did ask ourclosest neighbors Babe and Lola if they had seen anything unusual during thenight. They said no but their poodle Pompee had barked loudly inside their homefor a few awhile during the night around 100 am.it was a house pet. Other thanthat, nothing.I cannot tell you the color of the pulsating light above the object because I amcolor-blind.The pecan tree died"],"trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around August 31st 1966"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.918194,+-96.633913(3038)&iwloc=A&hl=en\"> mufon case (3038) map </A>","Viewing Distance":"20 Feet or Less","Latitude":"32.918194","Weather Factors":"Unknown","City":"Garland","Date of the Event":"08/31/1966 01:00 UTC","Sighting Duration":"00:00:59","Object Flight Path":"Stationary","Summary":"Backyard 1966","Country":"United States","Tags":"City"}