{"Object Flight Path":"Path with directional change","trends":["There have been 39 other sightings in Burbank","There were no other sightings in Burbank on or around July 26th 2011","This sighting has never been favorited.",""],"Date of the Event":"07/26/2011 11:30 UTC","Latitude":"34.171535","Object Features":"None","Region":"California","City":"Burbank","Country":"United States","Source":"MUFON","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/30382.html.txt","/var/www/straped/mufon/more/30382_submitter_file1__caufo072611.jpg","/var/www/straped/mufon/org/30382.html"],"Tags":"City","divs":["Sighting DetailsMy husband and I were sitting in our backyard in a covered cabana when off in the distance we saw a strange formation of lights. My husband was the first to see it and it interrupted his talking when he looked at it and said \"that looks like a really weird plane\". I looked at it and it appeared to have 4 or 5 VERY bright lights in a straight row and we couldn't hear anything. It seemed to be headed directly for us and I stood up and walked out of the cabana to get a more unobstructed view. When I walked out it was coming much closer, then slowed down in speed, passed right over me and then banked off to it's right, my left and that is when I saw the bottom of it. and realized that there was no way it was a plane because it was circular in shape and the lights were much brighter than I've ever seen on a plane in addition to how low it was flying which appeared to be only 100 feet or less. As it got closer to me I started hearing a hum with some vibration but no engine, propellers or the chopping sound a helicopter makes. Since we live fairly close to an airport and used to live near a military airbase we are pretty familiar with what personal, commercial and military crafts look like, even at night and this was NOTHING we've ever seen before. As I saw the bottom of the craft I felt excited because I was pretty certain what I had seen. It was too late for me to call my contact who is a pilot and was in the military for decades. When I talked to him this evening and described the event he explained to me that even if it were a plane the light formation, number of lights and altitude were all against FAA regulations and wouldn't have been allowed. So to clarify, the lights went all the way around the edge in almost an octagonal or circular pattern and then a cross of 9 lights with one in the center and then two going each direction (up, down, right and left respectively). I turned to my husband as it was passing over me and said that is NOT a plane and he looked shocked and confused. But afterwards when it went away and we were both just sort of stunned, I guess I could only say that we accepted it and then went on with our night since this isn't our first sighting. Unfortunately, neither of us had our cell phones or a camera outside with us and it happened so fast we wouldn't have had time to get them and turn them on, etc. anyway but I've included a picture (I'm not an artist but it's a fair representation) of what I remember seeing which is pretty clear in my memory because it was so exciting and so different than anything I've ever seen before."],"Log Number":"US-08062011-0046","Disposition":"IFO","Longitude":"-118.344813","Summary":"Strange object with lights flew right over our heads","Weather Factors":"Unknown","Date Submitted":"08/06/2011 01:53 UTC","Case Number":"30382","map":"<A HREF = \"http://maps.google.com/maps?q=34.171535,+-118.344813(30382)&iwloc=A&hl=en\"> mufon case (30382) map </A>","Object Shape":"Circle, Disc","Sighting Duration":"00:02:00"}