{"Date Submitted":"08/07/2011 10:20 UTC","files":["/var/www/straped/mufon/html2text/30396.html.txt","/var/www/straped/mufon/org/30396.html"],"Source":"MUFON","Latitude":"42.107623","map":"<A HREF = \"http://maps.google.com/maps?q=42.107623,+-70.75201(30396)&iwloc=A&hl=en\"> mufon case (30396) map </A>","divs":["Sighting DetailsOn tue, july 26th at 11:30 pm est, I was outside my house smoking a cigarette before bed. I began stargazing like I do every night I'm outside. Looking directly upward, I noticed a very faint star moving eastward very slowly. Thought it could be an airplane or satalite, but noticed its path was \"swervy\" and not straight. From over head to being lost within the tree line east, took about 3 minutes. Once gone, I looked straight upwards again to see anything else. Out of the corner of my eye, I caught a glimpse of a large burst of light. I then focused my eyes and saw another faint star-like object moving overhead. This object did not move straight, but rather in curves and swerves overhead. It then created bursts of light that were 3-5 times brighter than the brightest star that night. It did this 7-8 times in all. The bursts came in all different times with no real pattern like a plane would do. At one point the lights seem to strobe a bit and then the star object simply faded away. The second event took about 4-5 minutes. I was very excited at what I was witnessing because I knew this was not a natural or man made event."],"Object Features":"Unknown","City":"Marshfield","Weather Factors":"Unknown","Date of the Event":"07/26/2011 11:30 UTC","Log Number":"US-08072011-0019","Summary":"1st one, star like path had directional changes, 2nd moved randomly above, flashed and pulsed 8-10 times randomly","Sighting Duration":"00:15:00","trends":["There have been 3 other sightings in Marshfield","There were no other sightings in Marshfield on or around July 26th 2011"],"Country":"United States","Tags":"City","Longitude":"-70.75201","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Region":"Massachusetts","Case Number":"30396","Object Shape":"Star-like"}