{"Object Shape":"Sphere, Star-like","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Over One Mile","Log Number":"US-08082011-0025","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=26.1943,+-81.792896(30398)&iwloc=A&hl=en\"> mufon case (30398) map </A>","Latitude":"26.1943","Weather Factors":"None","Longitude":"-81.792896","Date Submitted":"08/08/2011 10:01 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30398.html.txt","/var/www/straped/mufon/org/30398.html"],"Summary":"4-5 orbs moved across sky sqeuntially in varying directions from same general point","Country":"United States","Region":"Florida","divs":["sighting detailsafter an event that could have ended the relationship between my girlfriend and i, we went outside to have a cigarette. as i always do, i watched the sky for unusual objects and to my, and her amazement, a bright orb was moving across the sky toward the moon. there was a very bright star near the moon that night, and this orb was brighter and a sort of greyish\\blue color. it moved east across the sky directly towards the moon, where it seemed to curve around and eventually head eastsoutheast. the object began to grow dim then flicker slightly, and i lost sight though possibly behind a tree. thinking it was some government craft, we looked back to the sky seconds later to find another orb exactly similar moving in a different patter yet south, and from the same general area. this happened twice more, with the last one being very bright and moving due south. it also had the most apparent \"hyper-flash\" while being very angry with me seconds before, and the two of us probably set to split for the night, the experience was very calming and brought us together like nothing else could, very corny, but we had the sense they knew we were out and watching and were happy to be acknowledged and revered by us. sort of like a before dawn set of cupids.....sure would like to know if anyone else saw"],"Object Flight Path":"Path with directional change,Path then hovering","Case Number":"30398","Object Features":"None","City":"Naples","Date of the Event":"07/26/2011 05:30 UTC","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around July 26th 2011"]}