{"Object Features":"Window(s)","divs":["Sighting DetailsI was sitting in my back yard having a beer when a bright light was coming toward my house,I thought it was a plane but the light from it started growing until it was the size of a large blimp you could not see the ship itself, it was like looking at a light bulb,the light was intense it felt like someone was watching me, the hair on the back of my neck stood up. the space ship then hovered above my neighbors house for about 5 minutes then the light shrunk down, and now I can see the ship it has a bunch of red and blue lights on its under side the red lights form a triangle and the blue lights form another triangle and the middle has a pulsating light blue light and the windows in the middle with the light pulsating in the windows looks like an old style movie. the blue lights at the bottom of the ship looks like the blue light that comes from your furnace and the faster they go the bigger the flames get. The ship now takes off towards the local air force base still at about 500 feet as its taking off it turns yellowish then faster now its turning dark orange now its going thousands of miles an hour now it turns red and it starts angling up at about a 45 degree angle and the ship remains flat now it starts turning dark red until its now going millions of miles an hour and i can not see the ship in my binoculars hardly anymore but I can still see a little dot leaving our world. I then see the same thing again the next night,and even now when I hang out in the back yard I will look with my binoculars and I will see some things I really dont have time to tell you about. thanks for listening. jay"],"Date Submitted":"08/07/2011 10:24 UTC","Case Number":"30394","Log Number":"US-08072011-0020","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Blimp, Fireball, Star-like","trends":["There have been 10 other sightings in Napa","There were no other sightings in Napa on or around July 18th 2009"],"Latitude":"38.312173","Date of the Event":"07/18/2009 09:00 UTC","Country":"United States","Disposition":"Unknown","Longitude":"-122.269196","City":"Napa","Tags":"City","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=38.312173,+-122.269196(30394)&iwloc=A&hl=en\"> mufon case (30394) map </A>","Weather Factors":"None","Region":"California","Summary":"slow moving blimp , which turned yellowish then orange as it went faster then finally a red then red black.","files":["/var/www/straped/mufon/html2text/30394.html.txt","/var/www/straped/mufon/org/30394.html"],"Object Flight Path":"Hovering then path"}