{"Source":"MUFON","Object Flight Path":"Straight-line path","Object Features":"Unknown","Date Submitted":"04/09/2004 10:00 UTC","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.727069,+-97.31728(3039)&iwloc=A&hl=en\"> mufon case (3039) map </A>","Object Shape":"Oval","Summary":"Eleven round lighted and silent fast moving objects sighted at night","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around April 9th 2004"],"Tags":"City","City":"Fort Worth","files":["/var/www/straped/mufon/html2text/3039.html.txt","/var/www/straped/mufon/org/3039.html"],"Latitude":"32.727069","Weather Factors":"None, Unknown","Case Number":"3039","divs":["Sighting DetailsLadiesGentlemenMy name is Melvin C. Starks. I graduated from the University of Texas atArlington in December of 2000 with a MA Degree in Sociology. I am a Senior ChiefPetty Officer in the U.S. Navy Reserve, and I work as a Screening Managersecurity for the Transportation Security Administration at DFW InternationalAirport. I would like to tell you about a recent UFO sighting that I observed.On April 9, 2004 at approximately 10 PM I was lying in my back yard deck swing.I like to do this because it is relaxing, and I enjoy observing the universe andits falling stars. It was a completely clear night so I was able to see starsall across the sky.Suddenly, as I was looking West, I was baffled by the sight of what I figured tobe about 9 to 12 bright round lights bearing down on me from the sky. At first Ithought, what kind of birds are those, because I was use to seeing flocks ofbirds flying overhead during the day.At first these lights appeared to be moving slow. Then it became an incrediblesight because I realized that these lights were coming directly at me as theyswept down from the sky. Suddenly I realized that these were not birds becausebirds do not give off light at night and because the lights started acceleratingat a high speed - much faster than any bird could fly. The lights passed directly over my head. I noted that these flying objects didnot have any blinking colored wing tip lights or landing lights as required bythe FAA. Due to the high speed at which they passed over and my visualobservation, I estimated that the lights were flying at a very low altitude.The lights were traveling in a left to right formation. Three of the lights onthe left seemed to be slightly separated from the others. Below is a drawing ofwhat the formation looked like0 0 0 0 0 0 0 0 0 0 0 0 0I duly noted that the formation was flying in perfect harmony - the exact samespeed with no updown or leftright variations. But the most amazing thing that Iobserved as the formation of lights passed overhead was the FACT that they DIDNOT MAKE THE SLIGHTEST NOISE OR VIBRATION. They were not producing any force orthrust. These objects were cutting through the air with the greatest of ease asif they were not subject to any of our aerodynamic laws.I was not able to observe the lights after they passed overhead because of hightrees directly behind my deck. I immediately concluded that I had observed UFOs.The route that the UFOs was flyi"],"Country":"United States","Log Number":"","Longitude":"-97.31728","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:00:59","Date of the Event":"04/09/2004 10:00 UTC","Disposition":"Unknown"}