{"Case Number":"30393","Date Submitted":"08/07/2011 10:28 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/30393.html.txt","/var/www/straped/mufon/org/30393.html"],"Tags":"City","Summary":"Single glowing object breaking off into two and hovering for three plus minutes; then one object moving straight up and latter second object.","City":"Bartlett","Source":"MUFON","Object Shape":"Circle, Flash, Sphere, Other","divs":["Sighting DetailsMy family and I were camping at Glen Elis campground in New Hampshire; my wife went into the shower facilities around 8:50 pm and I was waiting for her in my suv. When she came out of the shower she was looking a the south western sky over the grassy field and mountain range; I thought she was looking at the stars when I rolled my window down and she said\" Come here, what is that light!\". I got out of my truck and grabed my Sony digital camera and started filming; one of the owners of the campground was observing this phenomum as well. I herd her radio go off and one of the other owners asked her, \" what is that bright orange light over the river\", she said I do not know? My wife and the owner said that just before I got out of the truck the single orange ball with a halo ring around it; split into two bright orange balls. I did not see this transformation but they did. I caught the two objects on camera maintaing distance and the rapidly moving towards each other then away. One object on the visual left, moved upwards till it was not visible anymore; the other lingered for a while and then repeated what the first one did. Afterwards, about fifteen minutes, we were now back at our campsite on the river; my daughter observed a spinning red,blue, orange, green lint hovering some three miles away to the south west of our campsite. I have footage of this and will have to Waite to up load it."],"Longitude":"-71.192692","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.105319,+-71.192692(30393)&iwloc=A&hl=en\"> mufon case (30393) map </A>","Region":"New Hampshire","Object Flight Path":"Stationary,Path then hovering","Country":"United States","Log Number":"US-08072011-0022","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Bartlett","There were no other sightings in Bartlett on or around July 27th 2011"],"Latitude":"44.105319","Object Features":"Unknown","Date of the Event":"07/27/2011 12:00 UTC","Disposition":"Unresolved"}