{"Tags":"City","Longitude":"-88.95512","Region":"Illinois","Date of the Event":"07/28/2011 10:45 UTC","Disposition":"Unresolved","trends":["There has been one other sighting in Maroa","There were no other sightings in Maroa on or around July 28th 2011"],"divs":["Sighting DetailsOn this date, (07-28-2011) my girlfriend and myself were sitting in my drive way looking at the night sky. This is not uncommon for us to do. We were facing the eastern sky. We were counting the solid white lights flying high over. Never blinking, we think they may be satellites flying over. As we were looking at the sky, I saw a white light flying from the north to the south. I pointed to it and said that there was another white light. My girlfriend looked and said yes, she saw it too. As we were going to just chalk it up to another unknown light, As it traveled across the sky, it suddenly became very bright, and as it continued to move to the south it was only very bright for a couple seconds, then the light began to dim. It went from bright to dim, then it went black. We listened, and looked. We never heard any noise like the planes that fly over make. We also looked for the next 30 minutes, and never saw any blinking lights like those we see on airplanes. After the object went black we saw nothing else in the area. We are both perplexed by what we saw. Neither one of us can explain what it was. We are very familiar with planes, as we see them flying over all the time. This object was not an airplane. I dont have an explanation."],"Object Features":"None","Object Flight Path":"Straight-line path","City":"Maroa","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.044387,+-88.95512(30406)&iwloc=A&hl=en\"> mufon case (30406) map </A>","Country":"United States","Date Submitted":"07/29/2011 12:47 UTC","Sighting Duration":"Undisclosed","Case Number":"30406","Summary":"saw light in the sky, the light got MUCH brighter then dimmed and then went out.","Log Number":"","Latitude":"40.044387","files":["/var/www/straped/mufon/html2text/30406.html.txt","/var/www/straped/mufon/org/30406.html"],"Object Shape":"Sphere","Weather Factors":"Unknown"}