{"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Summary":"Multi rectangular oblong sections all interconnected","Longitude":"-122.478365","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30404.html.txt","/var/www/straped/mufon/org/30404.html"],"City":"Bellingham","Object Shape":"Square, Rectagular, Other","Date Submitted":"08/08/2011 05:34 UTC","Date of the Event":"08/10/1995 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=48.789656,+-122.478365(30404)&iwloc=A&hl=en\"> mufon case (30404) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsReporting this for my father, who gave me this accounting with my brother as another secondary witness to the event.. My Father was unloading folding chairs at his church and came back out to get another load, when he saw a huge object travelling very fast beginning low from the west horizon.. Within seconds the object was already passing directly over his position, and he reports that it appeared quite huge, at least 20 acres in size, covering most of his field of view as it passed over. My brother then came outside the building and saw the object and stopped and watched it with my dad until it was over the east horizon and out of sight, all of which only took a few minutes from when it was first spotted. They both report that it has multiple light sources, and appeared to be made of many long rectangular sections of a dark colored material all linked together, and parallel, but offset from each other. The entire craft as a whole gave off a bright glow of amber light, but they could see many other colors from the stationary lights attached. After the object passed and went out of sight, they looked at each other and shrugged their shoulders and went home. They experienced a very long period of disinterest (since event date) in the event as if it was nothing special or important, and only recently are remembering that the attitude they had finally seems unreasonable..They feel now that the object may have affected their minds in a very subtle way to disinterest them from their sighting. My Dad says the object moved so fast, that it seemed to be travelling a few or more thousand miles per hour. No one can remember the actual date of event, but it was close to 1995 in the summer."],"Object Features":"Undisclosed","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around August 10th 1995"],"Tags":"City","Country":"United States","Case Number":"30404","Region":"Washington","Log Number":"US-08082011-0101","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Latitude":"48.789656"}