{"Disposition":"IFO","trends":["There have been 4 other sightings in Croswell","There were no other sightings in Croswell on or around July 26th 2011"],"Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","Log Number":"US-08062011-0039","Longitude":"-82.617592","Case Number":"30401","Summary":"Glowing yellowish goldish redish orb at about airplane height (?) moved in an unaturally straight line at speed faster than airplane. Vanished suddenly as if going behind a wall or curtain.","City":"Croswell","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/30401.html.txt","/var/www/straped/mufon/org/30401.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.277456,+-82.617592(30401)&iwloc=A&hl=en\"> mufon case (30401) map </A>","Weather Factors":"None","Latitude":"43.277456","Source":"MUFON","Region":"Michigan","Date of the Event":"07/26/2011 12:00 UTC","divs":["Sighting DetailsOn July 25th, at about 1 a.m. I saw 3 shooting stars, in succession, that definately looked like regular shooting stars. On July 26th about 1 a.m. I was sitting alone on my side porch with a view of the trees and the clear starry sky. I live in a small town with no traffic noise, etc. I was focusing intently on nature, on the earth, the trees, and sky, and I was praying very hard, which I don't do very often. I looked straight up suddenly, and when I did I was startled to see what I thought at first was another shooting star but quickly realized it was bigger than a star, about the size of an aspirin from my point of view. It also seemed to be much closer than a star, at approximately airplane height. It was glowing brightly and a sphere shape, yellow orangeish in color, moving in a VERY straight line, too straight to be an airplane or shooting star. It moved faster than an airplane and I followed it with my eye for 20 seconds to a minute (not sure), before it abrubtly vanished. It didnt fade out and get dim, or dissolve, it was just gone. It didnt stop moving or slow down at any point. It vanished as if going behing a wall or a curtain that I couldnt see. I like to think it entered a blackhole or wormhole, that makes sense to me. I felt happy after seeing it, and I am still happy about seeing it. I have not been able to stop thinking about it."],"Date Submitted":"08/06/2011 12:32 UTC","Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","Object Features":"None"}