{"Log Number":"US-08082011-0117","Weather Factors":"None","Disposition":"Unknown","Object Shape":"Oval","Date of the Event":"10/31/2007 08:20 UTC","Viewing Distance":"21-100 Feet","Country":"United States","Summary":"It appeared out of a portal above the neighborhood nextdoor.","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsI met with Mr.Burns(Ufo hunters)at a Mufon meeting in Bucks County College in PA. around 2009 and gave him a picture of an object that was identical to the one my dauaghter and I witnessed. It appeared out of a portal above the neighborhood nextdoor. Directly above the stop sign in that new neighborhood about 100 ft. off the ground and 1500 hundred ft. away in distance, it came straight to me following the path of the sidewalk about 10 mph. My daughter was afraid. I was standing on the sidewalk. As it approached it had the most beautiful white light. I tried to debunk it. I looked at my house, the street, My neighbor's house and the light did not luminate anything but itself. It was oval white 30ft. by 60 ft. and no sound it just passed over a tree that was atleast 100ft. tall and I was underneith the object and next to the tree. It was so close to the treetop, I thought it was going to scrape it. It didn't touch it. As it passed over me, I was directly under the center of it. I had to turn around underneith it to watch go away. It crossed the street, then I went to get my wife and son to also witness it. While knocking on the door I took my eyes off it. But my daughter, said she was still watching and it turned left shot off like a streak. In the direction of a miltary base near by. Mr.Burns has all the details and my phone number."],"Case Number":"30400","Object Features":"None","Latitude":"39.770437","Date Submitted":"08/08/2011 07:43 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.770437,+-74.901531(30400)&iwloc=A&hl=en\"> mufon case (30400) map </A>","files":["/var/www/straped/mufon/html2text/30400.html.txt","/var/www/straped/mufon/more/30400_submitter_file1__ipialesa.jpg","/var/www/straped/mufon/org/30400.html"],"trends":["There have been no other sightings in Atco","This sighting has never been favorited."],"Tags":"City","Region":"New Jersey","Longitude":"-74.901531","City":"Atco"}