{"Sighting Duration":"Undisclosed","Longitude":"-116.416696","Date of the Event":"06/18/2011 10:52 UTC","Log Number":"CA-08082011-0032","Case Number":"30410","Date Submitted":"08/08/2011 10:24 UTC","Country":"Canada","Summary":"Shape Shifting object with No wings caught flying over Montreal region","trends":["There has been one other sighting in Edson","There were no other sightings in Edson on or around June 18th 2011"],"Viewing Distance":"Over One Mile","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=53.587661,+-116.416696(30410)&iwloc=A&hl=en\"> mufon case (30410) map </A>","Latitude":"53.587661","divs":["sighting detailsthis object moves silently across the night sky heading east direction. although having similar navigation lights as airplanes, the object has no wings and pulses its light irregularly, all the while changing the shape of the flashes and varying in magnitude and sequential rhythm. contrarily to an airplane who uses electric lights to produces its navigation lights, this object seems to produce its navigation lights with its own body which makes it look organic and unartificial. the object also shows a purple color light\\flash that isn't faa related. with an overall imprecise and constantly changing aspect, the object seems to be \"alive\". paranormal ufo researcher william roehling names this type of object a \"shape shifting entity\". looking at the object closer when editing has revealed the complexity of this rare phenomenon and the confirmation that it is something out of this world.... lastly, the object seems to be from the same group that was captured on my video \"ufo ovni montreal - amazing creatures - part 1 - june 10, 2011\\ object #1\" http:\\\\www.youtube.com\\watch?v=mhg9ijgsirg link to the video: ufo - \"flying entity\" june 18, 2011 - montreal http:\\\\www.youtube.com\\watch?v=gq1qcl6mixm"],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Region":"Alberta","City":"Edson","Object Shape":"Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30410.html.txt","/var/www/straped/mufon/org/30410.html"]}