{"Region":"Arizona","files":["/var/www/straped/mufon/html2text/30415.html.txt","/var/www/straped/mufon/org/30415.html"],"City":"Bouse","Date Submitted":"08/06/2011 06:49 UTC","Object Shape":"Fireball, Sphere","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-113.998395","Disposition":"Insufficient Data","Object Features":"Unknown","Case Number":"30415","Latitude":"33.938624","Summary":"numerous light turning off and on at different spots in sky","divs":["Sighting Detailswent outside and noticed some lights flashing over the butler valley east of here. not to unusual because i see alot of military flying over this area all the time. military jets are always flying over almost daily. at first i thought it was flares that they shoot. i have seen flares shot on a regular basis and know them when i see them. there was a lighting storm moving from the southwest to the northeast last night over the butler valley. the lighting was fair sense i got phx lighting the clouds up. the ceiling was very high last night. these lights were well below the clouds. as i sat there and watched i noticed how the lights would turn on then off in a instant. when they turned back on they were in a different spot. i watched for 5 minutes about then they stopped. the lights were there for the whole 5 minutes. butler valley gets all sorts of military activity because no one hardly is out there. it is also the sight of the old camp bouse used during ww2. i've spotted a-10,c-130 black heli's and numerous figher jets in that area as i explore it. it is got a aura to it out there where i never feel alone. i just wonder if it was a ufo, if it was trying to get power from the storm or if the military is crazy enough to fly billion dollar planes into a massive lightning storm like that? 1. i was in bouse az 2. bouse is very dark lights catch the eye 3. 3. military flares 4.round orangeish red balls in one spot then gone. when reappeared it was in a different spot 5. wow 6. it was just gone all of a sudden"],"Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"07/28/2011 10:17 UTC","trends":["There has been one other sighting in Bouse","There were no other sightings in Bouse on or around July 28th 2011"],"Country":"United States","Source":"MUFON","Tags":"City","Log Number":"US-08062011-0080","map":"<A HREF = \"http://maps.google.com/maps?q=33.938624,+-113.998395(30415)&iwloc=A&hl=en\"> mufon case (30415) map </A>"}