{"Summary":"Black triangular craft hovering over neighbors house","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsI was taking polaroid photos of a Night blooming Cerus cactus that was on my patio. I had a kidney shaped pool in the back yard with the pool lights on. I snapped a photo of the flower opening up. The yard was about a quarter acre. Each home surrounding mine was a ranch style. From the west, over the house behind mine, their backyard facing mine. For some reason I turned around facing the pool and neighbors back yard and watched this totally black craft fly over my neighbor house and veer to the right. It stopped between the two houses on the right side of mine. I was stunned. It appeared bigger than 3 football fields. The reflection from the pool lit the underside of the craft. There was a circular dome at each corner and one in the center. I could see what appeared to be hydraulic gears or something to that effect near the circles. The moon was rising to the east barely over the house across the street. Next thing I knew I was taking pictures of a cactus. The object began to move towards the east. I looked at my watch. It was aroound 11:00pm. I yelled for my roomate to come see it. By the time he got out the back door, it was so small and had travelled such a grest distance that all you could see is a black horizontal line in the night sky. Added note. The craft was not much higher than the pine trees whcih grow in that part of the state. Maybe a little more than 50 ft above th tree line. The points of the craft appeared to be rounded."],"files":["/var/www/straped/mufon/html2text/30412.html.txt","/var/www/straped/mufon/org/30412.html"],"Sighting Duration":"Undisclosed","Longitude":"-78.651944","Viewing Distance":"21-100 Feet","Latitude":"37.440343","Case Number":"30412","Source":"MUFON","Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=37.440343,+-78.651944(30412)&iwloc=A&hl=en\"> mufon case (30412) map </A>","trends":["There have been no other sightings in Jacksonville","This sighting has never been favorited."],"City":"Jacksonville","Disposition":"Unresolved","Object Shape":"Triangle","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Country":"United States","Date Submitted":"08/09/2011 08:57 UTC","Log Number":"US-08092011-0033","Date of the Event":"06/30/1974 09:30 UTC","Object Features":"Dome, Other, Unknown"}