{"Tags":"City","Object Features":"Unknown","City":"Cherokee","Weather Factors":"None","Country":"United States","Log Number":"US-08062011-0088","Summary":"Three large red-orange orbs that hovered in triangle shape and then slowly ascended into the sky away from us.","files":["/var/www/straped/mufon/html2text/30426.html.txt","/var/www/straped/mufon/org/30426.html"],"Viewing Distance":"101-500 Feet","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=35.446838,+-83.305514(30426)&iwloc=A&hl=en\"> mufon case (30426) map </A>","Object Shape":"Sphere, Triangle","Object Flight Path":"Hovering then path","Date of the Event":"07/29/2011 09:30 UTC","divs":["Sighting DetailsWe were driving home from Cherokee heading back to Sylva. We were driving on highway 441, when we came to the intersection of Camp Creek Road. I noticed three large red-orange orbs hovering over the field in a triangle shape. I pointed in out to the person in the car with me and she saw them too. She said they were probably attached to a powerline, but being comfortable with the area I was fairly sure that there are no powerlines that run through the area. I turned around on the highway and turned down Camp Creek Road. We could see two of the orbs that were slowly moving up into the sky away from us until they became so small that we could not see them anymore. We were unable to see the third one. I drove back down to the highway, drove back towards Cherokee, turned around at the Bel-Air Motel and drove back towards Camp Creek Road. This time we could see the third orb. We turned down Camp Creek Road and drove out towards the orb as it slowly moved in the same direction as the other two did. Eventually we could no longer see the last orb. I drove around the area trying to find something that would explain what we had witnessed, but was unable to find anything. The lights did not flash like I have seen on planes and choppers. There was not sound either."],"Date Submitted":"08/06/2011 09:35 UTC","Region":"North Carolina","Longitude":"-83.305514","Latitude":"35.446838","Case Number":"30426","Source":"MUFON","trends":["There have been no other sightings in Cherokee","This sighting has been favorited 1 time."],"Disposition":"Unknown"}