{"Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Date of the Event":"05/15/2006 02:00 UTC","files":["/var/www/straped/mufon/html2text/30423.html.txt","/var/www/straped/mufon/org/30423.html"],"Disposition":"Unknown","Object Shape":"Bullet, Missile, Circle, Flash, Sphere, Star-like","Tags":"City","Longitude":"-95.973098","Date Submitted":"08/08/2011 05:49 UTC","Case Number":"30423","Summary":"*18 flashing white orbs in bowling pin array (reflected) high speed same rate of flashing though no pattern.","map":"<A HREF = \"http://maps.google.com/maps?q=36.753151,+-95.973098(30423)&iwloc=A&hl=en\"> mufon case (30423) map </A>","City":"Bartlesville","Latitude":"36.753151","Region":"Oklahoma","divs":["Sighting Details1. Driving North on a residential street in Bartlesville, Oklahoma. 2. I was already looking up and North, a collection of white flashes came into view 3. To answer the question I thought it to be a UFO. 4. Above me and extremely high I saw 15-18 flashing white orbs never breaking formation race due North. They flashed at the same rate but independantly. When they were \"on\" it was white and brightly lit. When \"off\" there was nothing to see. I could tell it was higher than one would be able to say a passenger airplane flies. The formation occupied most of the view of the sky and the orbs themselves were extremely in size. The array was diamond shaped but really in one row there was one orb; the next row had two orbs; the next row had three; the next row five; 7; 5; 3; 2. 5. I was thrilled and called everyone I knew, to this day I talk about it. 6. The sight lasted 10-20 seconds, it disappeared beyond the treeline horizon. 7. There are two other witnesses and we were not together. 8. I would be happy to sketch it or have it animated."],"Object Features":"Other","Sighting Duration":"00:00:20","trends":["There have been 4 other sightings in Bartlesville","There were no other sightings in Bartlesville on or around May 15th 2006"],"Log Number":"US-08082011-0104","Source":"MUFON","Object Flight Path":"Straight-line path"}