{"Weather Factors":"Unknown","Case Number":"30437","Region":"British Columbia","map":"<A HREF = \"http://maps.google.com/maps?q=49.226953,+-124.797894(30437)&iwloc=A&hl=en\"> mufon case (30437) map </A>","Date of the Event":"05/01/1998 12:00 UTC","Object Shape":"Circle, Sphere","divs":["Sighting DetailsI went to meet my friend at his house after a soccer game at about noon on a Sunday. It was a nice clear and warm day so I went out on his patio at the back of the house to wait for him. The patio looks over the canal and the mountains on the other side of the water. I noticed what I thought was a flock of birds over the water but then quickly realized they were too far away to be birds. I thought maybe they were planes but they didn't look like planes or make any sound. Their were about 15 objects that were against the green mountains and then they went in front of the snow caps on the mountains and I could tell they weren't planes or helicopters or birds, they were just solid objects that made no sound. I watched them for as long as I could and then they were out of my site. They would have been travelling North towards Mt Klitsa. I've attached a photo of what I saw looking against the snow cap mountains."],"Object Flight Path":"Straight-line path","Latitude":"49.226953","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Over One Mile","Country":"Canada","Tags":"City","Date Submitted":"08/08/2011 11:00 UTC","Disposition":"Unresolved","Object Features":"None","City":"Port Alberni","Summary":"Saw what appeared to be a flock of birds over the water but realized was too far away","trends":["There have been 7 other sightings in Port Alberni","There was one other sighting in Port Alberni on or around May 1st 1998","This sighting has never been favorited.",""],"Log Number":"CA-08082011-0039","Longitude":"-124.797894","files":["/var/www/straped/mufon/html2text/30437.html.txt","/var/www/straped/mufon/more/30437_submitter_file1__albernivalley.jpg","/var/www/straped/mufon/org/30437.html"]}