{"Country":"United States","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.058856,+-118.086907(30449)&iwloc=A&hl=en\"> mufon case (30449) map </A>","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/30449.html.txt","/var/www/straped/mufon/org/30449.html"],"Disposition":"IFO","City":"Monterey Park","Case Number":"30449","Weather Factors":"Unknown","Object Features":"Other","divs":["Sighting DetailsOn October 9, 2010 at about 12 am, I was viewing the stars with binoculars in the direction of Cassiopeia and Andromeda; I was trying to find the galaxy (very hard in Los Angeles). As I was searching for Andromeda, the object came into view. It was oval and it reflected the street light below. The color is unknown but it was light because it reflected the street light. There was a black line on it's trailing edge which was broad, not narrow. There were no aviation marker lights. I tracked it for a few seconds. It was traveling from northwest to southeast. I don't think that it was a novelty balloon because it would have bounced around. I don't think that it was a weather balloon, aren't they round? I was thinking that it could be an errant advertising balloon. How likely would they get loose? Besides, I didn't see any ropes hanging from it, since I was using binoculars. To the west is LAX. Planes flyover my house when the airport is fogged over, and on clear days from afar I can see the planes looping around to land. To the east is El Monte Airport and Ontario Airport. From Ontario, I can see planes leaving at night. To the north is the San Gabriel Mountains and the San Gabriel Valley. When I am on the sun deck which is the gargage, I can see the whole valley below. I tried to report this sighting in October, but your site didn't respond correctly."],"trends":["There have been 6 other sightings in Monterey Park","There were no other sightings in Monterey Park on or around October 9th 2010"],"Longitude":"-118.086907","Date Submitted":"08/07/2011 03:01 UTC","Viewing Distance":"Unknown","Latitude":"34.058856","Region":"California","Source":"MUFON","Tags":"City","Summary":"Oval object reflecting street light which was observed by binoculars","Sighting Duration":"Undisclosed","Log Number":"US-08072011-0062","Date of the Event":"10/09/2010 12:00 UTC"}