{"Latitude":"42.590194","Longitude":"-72.21422","Sighting Duration":"Undisclosed","Region":"Massachusetts","Summary":"A friend and I a craft at a distance then it flew very fast and hovered over my house then took off towards the Quabbin Reservoir.","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/30441.html.txt","/var/www/straped/mufon/org/30441.html"],"Case Number":"30441","map":"<A HREF = \"http://maps.google.com/maps?q=42.590194,+-72.21422(30441)&iwloc=A&hl=en\"> mufon case (30441) map </A>","Viewing Distance":"Unknown","Tags":"City","trends":["There have been no other sightings in Athol","This sighting has never been favorited."],"Log Number":"","City":"Athol","Weather Factors":"Unknown","Date of the Event":"04/15/2011 12:00 UTC","Date Submitted":"07/30/2011 10:19 UTC","Source":"MUFON","Object Shape":"Triangle","divs":["Sighting DetailsIn the Spring of this year (2011, My friend and I were traveling up Main Street in Athol when we witnessed what we thought was a helocopter hovering above Adams Farm. We were in the area of Athol Historical Society, heading up Main Street. By the time we reached the old Steak House (some 110 yards away), this craft was hovering over my house on Grove Street, like 100 to 200 feet above the house. I rolled down my window to get a better look and to listen to it. It was completely silent. While above my house, it slowly turned to the left and slowly followed the line of houses up Grove Street, paused at the turn, turned right onto Summer Street, continued to follow the house line to Main Street, where it paused again, turned slight right to point at the Quabbin Reservoir, then took off at a high rate of speed in that direction. Both my friend and I were in awe. It did not resemble any aircraft known to me. The craft was black or dark in color, triangular in shape, and had white lights around it's perimeter."],"Object Flight Path":"Hovering then path,Path with directional change,Other","Object Features":"Undisclosed","Country":"United States"}