{"files":["/var/www/straped/mufon/html2text/30447.html.txt","/var/www/straped/mufon/org/30447.html"],"Date of the Event":"07/15/2011 01:35 UTC","Country":"United States","Object Shape":"Star-like, Other","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Troutdale","There were no other sightings in Troutdale on or around July 15th 2011"],"Log Number":"US-08052011-0103","Sighting Duration":"Undisclosed","Case Number":"30447","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=45.508532,+-122.42033(30447)&iwloc=A&hl=en\"> mufon case (30447) map </A>","Disposition":"IFO","City":"Troutdale","Object Features":"Undisclosed","Tags":"City","Latitude":"45.508532","divs":["Sighting Details Ok so on this particular night my fiance had called me onto our balcony to look at a light that was to the east. it looked like it was toward the gorge and maybe NE of mt hood. i stood on my balcony for a half an hour watching the light and it did not move- it did not get closer, it did not get farther- and it did not move in any direction- it just sat there. it looked like a star and just pulsated lights that sometimes changed colors from a purplish to a white and sometimes it even dimmed to a real dim pin dot light before illuminating again in to a pulsating hanging star... while watching the light i saw many airplanes come over the horizon and their lights would noticably move as they came closer- they would pass over head and then proceed west to the airport. During this time the light over the east horizon did not move or appear to be getting closer at any time- for almost 2 hours i watched the light and it stayed the same. Also- I actually took a video of the object- and as i was doing so my fiance was telling me from inside the house to just leave it alone and don't take any pictures- when i rewatched the video immediately after the incident i noticed three lights appear in the video which were not visible with the naked eye during the incident- the three lights appeared in the left side of the camera view and did not appear to come from any source at the time- as the location of these lights was on the side of the building where there are no lighting or way for these lights to appear. They were in ascending order and appeared to get closer to the location of where i was standing with each light.- almost like if i was being tracked or pinpointed. The next day when I was going to upload the video i found that the charging port on my phone had been burned out and the phone is inoperable ( though i still have it) I have continued to see the light and have seen it on a few additional occasions to the east of Troutdale apparently over the gorge- always in the same location- always stationary- always with planes coming and going in the night sky...this is not an airplane... Perplexed..."],"Source":"MUFON","Region":"Oregon","Date Submitted":"08/05/2011 09:54 UTC","Summary":"we watched light hover horizon for a long time and watched many planes come and go...light did not move and i took video.","Viewing Distance":"Unknown","Longitude":"-122.42033"}