{"Object Features":"Other","Case Number":"30450","Date of the Event":"07/17/2011 09:30 UTC","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Region":"Colorado","Latitude":"40.432232","divs":["sighting detailsi received a call from mufon international director on 7\\25\\11, 9:20 a.m. to follow up on a ufo sighting report from a witness. first contact: called witness on 7\\25\\11. left message on answering machine. second contact: witness called 7\\26\\11, 7 pm, but investigator was not available at time of call. investigator returned call to witness on 7\\26\\11 and scheduled a time to meet to pursue an investigation of sighting. time and date of investigation was set for 7\\30\\11 at 10:30 a.m. third contact: investigation with witness was conducted. witness' information (map and detailed description of his sighting) was gathered along with completion of mufon's general sighting case report form #1. investigation took approx 40 minutes to complete witness. during investigation, witness reported that he went to his front door on the evening of july 17, 2011, approx. 9:30 p.m. he witnessed a very bright light slowly coming from the east towards his direction. witness stated the object's altitude was around 1,000-2,000 feet above the ground and came to about 300-400 feet towards him then turned slowly to the southeast and continued until he lost sight of it behind from trees. witness stated the whole incident took approx 4-6 minutes. witness called his wife who also observed object. witness stated that as the bright light approached him, he could see a cylinder-shaped object with what seemed like transparent ribbed-shaped panels on the outside of the object with a flat bottom. witness stated there was no sound coming from the craft, but as the craft approached it emitted what looked like \"sparkles\" coming from the craft. after sighting, witness called mufon's international director to report the sighting. after interviewing the witness, this investigator completed a sighting report on mufon's cms data base 7\\30\\11, 2:15 p.m."],"Log Number":"US-08082011-0022","Object Shape":"Cylinder","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.432232,+-104.795007(30450)&iwloc=A&hl=en\"> mufon case (30450) map </A>","trends":["There have been 19 other sightings in Greeley","There were no other sightings in Greeley on or around July 17th 2011"],"Source":"MUFON","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/30450.html.txt","/var/www/straped/mufon/org/30450.html"],"Tags":"City","Summary":"Witness observed bright white cylinder craft w/ribbs in sky coming from the East of his house then turn and slowly change direction to South East.","City":"Greeley","Longitude":"-104.795007","Date Submitted":"08/08/2011 08:43 UTC"}