{"Log Number":"US-08052011-0047","trends":["There has been one other sighting in Catskill","There were no other sightings in Catskill on or around July 30th 2011"],"Disposition":"Hoax","Sighting Duration":"Undisclosed","City":"Catskill","map":"<A HREF = \"http://maps.google.com/maps?q=42.21731,+-73.864573(30459)&iwloc=A&hl=en\"> mufon case (30459) map </A>","divs":["Sighting Detailsi was standing on my porch around 9:45 pm, i was playing music in my complex, while others were playing cards. i notice what i thought was a large bright glowing object pulsating slowly coming like towards me and then with out no sound desecened slowly from my view. i was puzzle so i call a friend of mine nearby ( hank ),i holler at him to look up quickly but by the time he was able to the object had gone behind some trees to my far left. as we was walking back to my porch, to my far right this glowing pulsating object slowy began to rise above the trees there.several other people saw the same thing at this time, then it got bright and slowly move like over the hudson river to my left and just speeded away from us at unbeliveable speed towards southeast. as it move away it got smaller very quickly, i just stood stun at what i just witness, it made no sound what so ever. i call my cousin who lived a couple of rows over and she and others saw the same thing. i've seen many types of aircrafts in the military, never seen anything like this."],"Viewing Distance":"101-500 Feet","Tags":"City","files":["/var/www/straped/mufon/html2text/30459.html.txt","/var/www/straped/mufon/org/30459.html"],"Latitude":"42.21731","Summary":"thought it was an airplane going down around 9:45 pm very bright and glowing it went down around the hudson then a couple of minutes later it ascended up and slwy move then speend very fast.","Date of the Event":"07/30/2011 09:45 UTC","Object Shape":"Sphere","Country":"United States","Region":"New York","Object Flight Path":"Hovering then path,Path then hovering,Other","Longitude":"-73.864573","Object Features":"None","Date Submitted":"08/05/2011 10:40 UTC","Weather Factors":"None","Source":"MUFON","Case Number":"30459"}