{"Region":"Washington","Longitude":"-77.035066","Viewing Distance":"Over One Mile","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around July 7th 2011"],"Summary":"large sphere traveling very fast over head","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.899602,+-77.035066(30461)&iwloc=A&hl=en\"> mufon case (30461) map </A>","Disposition":"Unresolved","Log Number":"US-08082011-0100","Object Shape":"Sphere","City":"Washington","Object Features":"Undisclosed","Latitude":"38.899602","Tags":"City","Date Submitted":"08/08/2011 05:28 UTC","Date of the Event":"07/07/2011 11:30 UTC","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30461.html.txt","/var/www/straped/mufon/org/30461.html"],"Case Number":"30461","divs":["Sighting DetailsI live in the casecade foot hills. I went outside to star gaze one clear night this last July 2011 and I noticed a huge translucent white sphere with white twisted shaped wings at the base that might be propulsion or maybe just friction......this was very high up, I could not tell how high.........I have seen the space station fly over my home before, but this was bigger and faster and held a steady course.........My first impression of this object was \" this is no jet or plane \" I was transfixed.........I tried to reason through what I seeing for the minute plus it took to leave my sight.................It is hard to judge things high up in the sky, and I am not one to jump to conclusions, but this was clearly something like I have never seen before.......size, speed and shape.............After it was out of view I got on the computer to find out where the space station was. It was on the other side of the world from my Pacific N.W. home.........I have tried to find any similar sightings on web pages...........no luck so far........What ever I saw, it was wonderful to witness."],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed"}