{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"*Object changing colors comes down from sky then hovers and moves slowly.","map":"<A HREF = \"http://maps.google.com/maps?q=36.259195,+-95.705048(30465)&iwloc=A&hl=en\"> mufon case (30465) map </A>","Source":"MUFON","Latitude":"36.259195","divs":["Sighting DetailsI've recently seen several unexplainable objects in the sky when walking my dogs at night so I've been periodically checking out the sky. About an hour ago I watched as what appeared to be a twinkling star slowly descended over about 30 minutes time. The object got close enough for me to see it changing colors red, blue, white, yellow, & green.The lights appeared to reflect off of something above them but I couldn't see a definate structure. At first I thought it was a star but I've never seen star get this big or change colors like this. I originally seen the object to the west, then it started slowly moving north. The object is still out there RIGHT NOW! I've been seeing objects like this for about a month now in between 10 p.m. and 5 a.m. They don't show up every night but have been around 4-5 nights a week! It may be explainable but I've never seen any kind of aircraft move this slow and stay airborne as well as change colors like it is. Conventional aircraft blink a red and green light but these aren't blinking, they change from one to the other without stopping or dimming. Unfortunately the digital camera I own won't pick up the lights in the sky nor will my cellphone."],"Log Number":"","Longitude":"-95.705048","trends":["There have been 5 other sightings in Claremore","There was one other sighting in Claremore on or around July 31st 2011"],"Date of the Event":"07/31/2011 01:00 UTC","City":"Claremore","Region":"Oklahoma","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"IFO","Date Submitted":"07/31/2011 02:54 UTC","Case Number":"30465","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/30465.html.txt","/var/www/straped/mufon/org/30465.html"],"Object Shape":"Circle, Sphere, Star-like","Tags":"City"}