{"divs":["Sighting DetailsI was outside on my patio, at around 1 15 am, having a cigarrette, lookng up at the sky, all the stars, facing north. Looking at the constellation draco and Cepheus, i witnessed an orange light appear suddenly, orange white center, move at a moderate speed from a west to east direction. It lat abuot a good 8-9 seconds, then simply disappeard. their was NO noise. usually, with airplanes, thiers 3 lights, and the engine aferburn..this orange ball had none of that. being an ex professional amateur astronomer, it appeared to be in our atmoshere. i have seen PLENTY of metoers streak across the sy, sicne i was a kid to my 36 years of age now..and their always either green, blue or white. i have never ever seen an airplane, with one solid light moving at a moderate speed that far north, from where i live..ever. it simply disappeared into the darkness. had a VERY good view of the skyk, no tree obstruction. so im here reporting it! it wasnt an earth-manmade satellite either..seen many of those with my 4.5 inch reflector as a kid. saw the international space station appear as a ghost image moving south to north last year, much fast than this organge ball. SO ide DEF rule out a manmade satellite."],"Viewing Distance":"Unknown","Case Number":"30467","Object Features":"None","Date Submitted":"08/06/2011 07:52 UTC","Latitude":"41.08958","Region":"Connecticut","Disposition":"IFO","Summary":"semi bright orange ball simply disappeared, no noise","Weather Factors":"Unknown","City":"Stamford","trends":["There have been 10 other sightings in Stamford","There were no other sightings in Stamford on or around July 31st 2011"],"Log Number":"US-08062011-0018","Object Shape":"Star-like","Country":"United States","Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30467.html.txt","/var/www/straped/mufon/org/30467.html"],"Date of the Event":"07/31/2011 01:15 UTC","Sighting Duration":"Undisclosed","Longitude":"-73.521399","map":"<A HREF = \"http://maps.google.com/maps?q=41.08958,+-73.521399(30467)&iwloc=A&hl=en\"> mufon case (30467) map </A>","Tags":"City"}