{"files":["/var/www/straped/mufon/html2text/30471.html.txt","/var/www/straped/mufon/more/30471_submitter_file2__brentwoodlights.png","/var/www/straped/mufon/more/30471_submitter_file3__brentwoodlights-Map.png","/var/www/straped/mufon/org/30471.html"],"divs":["Sighting DetailsThis incident took place about 9:15 PM on Saturday 7.30.2011. I was driving down Interstate 65 near exit 71 concord lane going toward Nashville. First we saw approximately 25 to 30 cars pulled over on the side of the interstate. They were in groups as if in a caravan that was stopped. It was at this time my wife saw the lights on my side of the car in the sky. We live in this area so we knew there should not be any lights there. We were planning on getting off exit 71 anyway to go home however this time I took the opposite way heading toward the lights that appeared to be over the Brentwood Baptist Church . The sky was relatively cloud free in this area. As we got closer to the church the lights started to disappear. They then vanished completely from view and was replaced by an odd cloud formation. On the way to the church parking lot after getting off the interstate numerous other vehicles were stopped and people were going in and turning around in the parking lot. Numerous people were stopped in the parking lot and outside of their vehicles. We talked to at least 3 different people who said they also saw the lights. I saw about 4 or 5 lights and my wife said she saw about 8 or 9. She reported that the formation looked like an arrow. I saw more of a triangle shape. To make it clear I was driving so it was hard for me to focus to get a good steady view. The best view I got was sitting at the stop light waiting to turn into the church parking lot and that was more of it going away. My wife said that the arrow shape appeared more as we got closer and that her first view was in the tree line from the interstate. The lights were yellowish orange and looked uniform in size and color to me."],"Tags":"City","Log Number":"","Viewing Distance":"Unknown","Summary":"shaped lights in sky","Weather Factors":"Unknown","Case Number":"30471","Date Submitted":"07/31/2011 10:17 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.035076,+-86.775807(30471)&iwloc=A&hl=en\"> mufon case (30471) map </A>","Object Features":"None","trends":["There have been 2 other sightings in Brentwood","There were no other sightings in Brentwood on or around July 30th 2011","This sighting has never been favorited.",""],"Object Shape":"Triangle, Other","Longitude":"-86.775807","City":"Brentwood","Object Flight Path":"Stationary","Region":"Tennessee","Latitude":"36.035076","Sighting Duration":"Undisclosed","Date of the Event":"07/30/2011 09:15 UTC","Source":"MUFON","Disposition":"Hoax"}