{"Object Shape":"Oval, Square, Rectagular","trends":["There have been 2 other sightings in Lone Pine","There were no other sightings in Lone Pine on or around June 28th 2008"],"Case Number":"30474","Longitude":"-118.063229","Date Submitted":"08/07/2011 03:57 UTC","Region":"California","divs":["Sighting DetailsWe saw a flat, elongated, dark greyish, rectangular (with curved corners), object with three lights on the underside, gliding silently in the air between Mt. Wilson and the mountains to the east of Lone Pine, California, USA (to the east of Death Valley, California). It was moving southbound, over US-395 (N. Main St.) near the intersection with Whitney Portal Rd. My friend and I were out of our car on Whitney Portal Rd., looking at stars with a telescope. While I was looking through the telescope, my friend spotted the object to the east (toward US-395 (Main St)) about 200 feet from where we were on Whitney Portal Rd. It was dark, but our eyes had become accustomed to the darkness. He said he saw it materialize out of thin air. He was shocked and quietly but urgently told me to look. I pulled away from the telescoope, and saw the object which looked solid, dark grey and with three barely glowing round lights on the bottom. It was silently gliding southbound, not moving very quickly and appeared to be about 150-200 feet above the ground, and approximately 50-60 ft in length, 20-30 ft deep and about 10-15 ft thick (all estimates). It actually had the shape of a large tuna can. Though my friend says he saw it materialize, it appeared to be solid during the entire time I saw it. It also appeared very very dim, and was probably only visible because of the dim glowing lights on the bottom. It slowly glided behind some trees, and when we went to the other side of the trees, it was no longer there. (This whole thing was an incredible experience for us and was originally posted at the nuforc.org website a few days after we witnessed it. We went back to Lone Pine the following night, and the following weekend, to see if we could see it again -- but we never saw it again.)"],"files":["/var/www/straped/mufon/html2text/30474.html.txt","/var/www/straped/mufon/org/30474.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.605329,+-118.063229(30474)&iwloc=A&hl=en\"> mufon case (30474) map </A>","Summary":"Two of us saw an elongated, rectangular, grayish object with curved corners and three lights on the bottom gliding silently east of Death Valley, CA.","Weather Factors":"Unknown","City":"Lone Pine","Country":"United States","Object Features":"Other","Date of the Event":"06/28/2008 10:30 UTC","Object Flight Path":"Hovering then path,Straight-line path","Sighting Duration":"Undisclosed","Log Number":"US-08072011-0074","Latitude":"36.605329","Viewing Distance":"101-500 Feet, Unknown","Source":"MUFON","Tags":"City"}