{"map":"<A HREF = \"http://maps.google.com/maps?q=39.297885,+-76.605249(30486)&iwloc=A&hl=en\"> mufon case (30486) map </A>","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Object Shape":"Circle","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around January 28th 2011"],"Region":"Maryland","Country":"United States","Case Number":"30486","divs":["Sighting DetailsMe and my wife was flying a Kite at the Roosevelt Park in the field by the track with my kid after a hour or so a object appears in the sky that looked like it was spinning but the main thing I know was it was metallic I might try to capture it again the thing is I kind believed but did not until I seen it in the sky and screamed to my girl to look and she also seen it then I was look around for other people to call attention to it but no one was around I started even scream look at some people who was a little far away across the street from the park I wanted other people to see it! As I kept looking at it it shinned at me I'm not sure if it was the surface or what not it also then started moving slowly and then just disappeared in front of my eye! This is no shit hook me and people have taken pictures of the same exact kind I have seen they are round and metallic looking and at night they glow I thought I seen on high in the sky along time ago but I had to look straight up in the air to see it. But this was their! I started saying what the hell was that we just seen a UFO it was wierd I just got done arguing with people who said they where snatched by aliens, I even apologized. I was part believer but a skeptic on alien abductions I now say nothing against believes as I now fully believe Well let me stop here because this did not end their I seen a lady in the park who just walk up just a few after it disappeared in thin air! She said she did not see it but she has seen them allot and she said she believed me I told her to keep a look out I wished I had a camera so bad! Anyways I said maybe it was bag but I know what not a bag I know what they look like and it was real plus bags don't reappear. So how did it disappear for about 35 mins I did not see the lady but the object reappeared in the air and I was like hollyshit its back screaming at my girl to look and I looked for the lady but she was just gone I did not see her so she could have seen it if she was some where else else in the parkhell we joked it was as if she disappeared but hell some one else besides me had to see it, it was reflective when the sun hit it or it was flashing at me one of the two. This time it start to glide a little quicker and approaching our area a little and then it disappeared in front of my eyes again a few minutes later. I have a feeling That thing is still around this are and I want to know more its frustrating I wish I knew this site when it first happened but I can tell you it was not from this world nothing made of metal and that large can disappeared! Matter of fact I don't know anything shinny that can disappeared entirely! I just Needed to tell you guys so maby some one could use the info, I told my whole family the day I seen it they all knew I was 100% for real, especially how existed I was about it. You Know I would have never thought I see something like that so it was like me finding a treasure but I have no way to prove it and now I'm like people there is some crazy shit going on this was in a city! Thanks for reading and I'm sorry for those I did not keep a open mind to, because normally I do I just dont know why they would just choose one person out just to do test, I wonder if their from with in our own planet! That missile footage I think most people know about where the ship moves makes me think their are multiple and they don't get quite along with each other just an idea! Thanks for letting me tell story finaly and I can release it! I don't care what anyone says I know what I seen I and I will take a polygraph to prove it so did my fiance!"],"files":["/var/www/straped/mufon/html2text/30486.html.txt","/var/www/straped/mufon/org/30486.html"],"Viewing Distance":"Over One Mile","Date Submitted":"07/31/2011 07:29 UTC","City":"Baltimore","Latitude":"39.297885","Tags":"City","Date of the Event":"01/28/2011 12:30 UTC","Log Number":"","Object Features":"None","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-76.605249","Summary":"A circle silver type craft I have also seen the exact thing on tv!"}