{"trends":["There has been one other sighting in Perry","There were no other sightings in Perry on or around October 15th 1977"],"divs":["sighting detailsi was playing guitar with a friend in the place i rented on leon st in perry fl, he took off and i jumped in my car to head out and look for some friends. as i made a right off leon headed north toward julia drive i noticed a light in the sky. i stopped and got out of my car and began to look at the object. it was probably 2000\\3000\\up there ft in the sky and was moving very slowly toward the west. it was orange\\yellowish in color and very bright. it would hover and then move a little. it looked kind of like a halogen light on the interstate, that size that far off. i jumped in my car blasted to julia drive and made a left and was headed west toward us 19\\27 when i passed the creek and curve i stopped just before the hwy and got on top of my car and watched the object. i looked like is was above and following hwy 98 to the west real slow. all of a sudden it took off and went completely out of site in a straight line to west in like a 1001 1000 count. it did not loose altitude, it was a clear cool night and it was very fast. to this day i get goose bumps when i think about it. we dont have anything then or now that can move that fast. it made no sound. i would be willing to take a lie detector test. i have never seen anything like that again. there are other folks that have had encounters in this area. mr leonard and his wife and two friends were chased down the aucilla river by a ufo along the same time period they were in a boat. he's dead now but his wife and their friends are still alive. give me a hollar i would love for you guys to make an animation for me based on location and all. sorry no photos but it happenned!1"],"Region":"Florida","Sighting Duration":"00:02:20","Country":"United States","City":"Perry","Object Flight Path":"Hovering then path","Log Number":"US-08082011-0091","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=30.117435,+-83.581815(30484)&iwloc=A&hl=en\"> mufon case (30484) map </A>","Object Features":"Unknown","Disposition":"Hoax","Tags":"City","Latitude":"30.117435","Longitude":"-83.581815","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30484.html.txt","/var/www/straped/mufon/org/30484.html"],"Weather Factors":"None","Summary":"Bright light in the sky that hovered and moved at incredable speed","Case Number":"30484","Object Shape":"Circle, Oval","Date Submitted":"08/08/2011 04:10 UTC","Date of the Event":"10/15/1977 06:28 UTC"}