{"Object Features":"None","Disposition":"Unknown","Source":"MUFON","Date Submitted":"08/10/2011 07:07 UTC","divs":["sighting detailsi was out walking in my neighborhood, about 7:30 in the evening, but there was still plenty of daylight. a flock of birds caught my attention, and in the distance behind the flock of birds i saw what i thought was an airplane. i watched it, not because it was doing anything interesting, but because it was in my line of sight. i couldn't see any wings, and so continued to watch it, waiting to see if it was jet plane, or a propeller plane, whatever... just idle curiosity. so i watch this thing get closer to me, which remained completely silent by the way, and notice that there's no wings, no tail, no nothing. it looked like a long white tylenol gelcap, complete with a black seam around the middle of it. i stop walking completely by this time, this thing has my full attention. it moved at a slight diagonal, passing in front of me, coming from my left to my right, moving from east-by-southeast to north-by-northwest, moving at a pretty good clip, not making any turns...steady course, speed and altitude...and completely silent. it finally disappeared behind some trees. somewhere within that 4-5 minutes while i was watching it, and the perspective changed as it moved, i should have seen wings or a tail, or a cockpit or windows, if it were, in fact, a plane. i saw the front of it as it was heading towards me, the side of it as it passed in front of me and the back end of it as it continued on. i would have been able to see wings or a tail from at least one of the perspectives. but there weren't any to see. it was a solid white capsule with a black ring around the middle of it. a flying headache capsule! i realize i should have taken a picture with my cell phone, but i kept thinking it was a plane. by the time my brain kicked in, telling me, okay kiddo, this is no airplane, it was already over the trees to my west and it was too late. after thinking about it for a few days, and not being able to come up with any logical conclusion, i googled \"capsule ufo\" to see if maybe it was some new aircraft. i found, on google images, the exact thing i saw. this is it, exactly. http:\\\\lightsinthetexassky.blogspot.com\\2010\\07\\navy-veteran-witnesses-cylinder-shaped.html."],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Weather Factors":"None","Log Number":"US-08102011-0033","Object Shape":"Cigar, Cylinder","Country":"United States","Summary":"Silent white capsule-like object over Lawrenceville, GA","Object Flight Path":"Straight-line path","Region":"Georgia","Date of the Event":"07/23/2011 07:30 UTC","Case Number":"30493","map":"<A HREF = \"http://maps.google.com/maps?q=34.038674,+-84.003468(30493)&iwloc=A&hl=en\"> mufon case (30493) map </A>","City":"Lawrenceville","files":["/var/www/straped/mufon/html2text/30493.html.txt","/var/www/straped/mufon/org/30493.html"],"Latitude":"34.038674","trends":["There have been 14 other sightings in Lawrenceville","There were no other sightings in Lawrenceville on or around July 23rd 2011","This sighting has never been favorited.",""],"Tags":"City","Sighting Duration":"00:05:00","Longitude":"-84.003468"}