{"Country":"United States","Log Number":"US-08092011-0013","Longitude":"-87.340337","Sighting Duration":"Undisclosed","Summary":"Appeared as a comet at first","Date of the Event":"07/15/2011 12:00 UTC","divs":["Sighting DetailsMy family & I were driving West bound on Interstate 90, West of Gary, Indiana at approx. 8:30 pm on a clear night, when my cousin pointed out a light in the sky that appeared to be a comet heading towards the Earth. As we observed the light it appeared to have a tail like a comet when all of the sudden the light split into 3 white orbs continuing in the same direction. Next, the 3 orbs split into 6 orbs and formed a circle for what seemed like a few seconds. All the time we were still driving when the 6 orbs changed shape and formed a what appeared to be a 3 dimentional cube shape. Within a few seconds of that the lights disappeared and were no longer seen as we continued on the Interstate. My cousin was able to capture one of the lights on her cell phone although the picture was not a clear picture as we were still moving on the Interstate. My cousin & husband looked on their smart phones for any reports of what we witnessed to no avail. Today I decided to look on line to see if anyone else had reported an incident on this day. I believe there was only one report in the general area. We were baffled and in disbelief over the lights and what we had witnessed."],"Disposition":"IFO","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/30504.html.txt","/var/www/straped/mufon/org/30504.html"],"Weather Factors":"Unknown","Region":"Indiana","Case Number":"30504","trends":["There have been 8 other sightings in Gary","There were no other sightings in Gary on or around July 15th 2011"],"Source":"MUFON","City":"Gary","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.59813,+-87.340337(30504)&iwloc=A&hl=en\"> mufon case (30504) map </A>","Latitude":"41.59813","Object Shape":"Fireball","Tags":"City","Date Submitted":"08/09/2011 07:17 UTC"}