{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/30503.html.txt","/var/www/straped/mufon/org/30503.html"],"Longitude":"-81.921313","Date Submitted":"08/08/2011 09:18 UTC","trends":["There have been 2 other sightings in North Olmsted","There were no other sightings in North Olmsted on or around July 30th 2011"],"Object Features":"None","Viewing Distance":"101-500 Feet, Unknown","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.418322,+-81.921313(30503)&iwloc=A&hl=en\"> mufon case (30503) map </A>","Date of the Event":"07/30/2011 09:02 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","divs":["Sighting DetailsIt was about 9 P.M in the Metroparks off 252 columbia road, North Olmstead Ohio. My boyfriend and I were about to enter the forest path when he pointed to a bright object in the sky asking what is was. It appeared a reddish orange and kind of star shaped fireball, it just hovered in one spot in the sky and we could see it moving very slightly from right to left. It lasted only a few moments and the light dimmed and it seemed to just fade out of existence. It was hard to tell how high it was but to me it didn't look very high at all as the sky seemed further away then it was. There was no sound and it was somewhere off above the trees. I thought it was really cool to see, as we're both very into the paranormal. This area is right by an airport btw but the planes that come in around there are extremely close up as they come in for landing and departing. The object we saw wasn't flying and as I said moved in a left to right motion back and forth for a moment before it faded away. Moments later another plane flew by. Im thinking it could have vanished so not to be seen by the plane? I've looked this up and have seen a lot of these 'fireball' UFO's reported recently and thought reporting it might be helpful to your research on what these could possibly be. Feel free to send me an e-mail if you have any comments or ideas about this."],"Latitude":"41.418322","Summary":"Hovering Fireball like UFO Sighting.","Log Number":"US-08082011-0124","City":"North Olmsted","Weather Factors":"Unknown","Case Number":"30503","Object Shape":"Fireball, Star-like","Country":"United States","Tags":"City","Disposition":"IFO"}