{"City":"Surrey","Object Features":"Unknown","Tags":"City","Country":"Canada","Source":"MUFON","Date of the Event":"07/29/2011 12:00 UTC","Object Flight Path":"Path with directional change","Object Shape":"Star-like","Date Submitted":"08/08/2011 12:28 UTC","files":["/var/www/straped/mufon/html2text/30506.html.txt","/var/www/straped/mufon/org/30506.html"],"Case Number":"30506","Sighting Duration":"Undisclosed","Log Number":"CA-08082011-0054","Region":"British Columbia","Summary":"anomalous starlike objects accelerating, slowing, stopping turns etc. in night sky","Disposition":"Unresolved","divs":["sighting detailsjuly 29 2011, myself and two others were observing the night sky from our backyard in surrey british columbia, 30 km south west of vancouver in hopes of viewing delta aquarid meteor shower. between midnight and 1am after having seen several relatively faint meteors and a handful of satellites we noticed an object similar in size and brightness to that of a 'medium' bright star traveling roughly twice the speed of a satellite stop dead for several seconds, then accelerate zig zag and large sweeping high speed maneuvers. from the time we noticed it to when it became invisible behind the houses\\ horizon roughly 15-30 seconds had passed. we continued to star\\ ufo gaze and approximately 10 minutes later noticed another object identical to the first flying across the sky, stopping, starting, turning and performing otherwise seemingly impossible maneuvers. it then appeared to 'split' into two. the second sighting was within our field of vision for about 10-15 seconds before disappearing among the light wash of the city\\horizon. no sound whatsoever was detected while the objects were overhead. the speed at which they traveled was maybe 12 inches held at arm's length for every second. needless to say we were completely astonished and also excited for having witnessed something that remarkable."],"map":"<A HREF = \"http://maps.google.com/maps?q=49.113637,+-122.825966(30506)&iwloc=A&hl=en\"> mufon case (30506) map </A>","Latitude":"49.113637","trends":["There have been 11 other sightings in Surrey","There were no other sightings in Surrey on or around July 29th 2011"],"Viewing Distance":"Unknown","Longitude":"-122.825966","Weather Factors":"Unknown"}