{"Object Flight Path":"Straight-line path","Latitude":"35.302759","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.302759,+-78.5772(30511)&iwloc=A&hl=en\"> mufon case (30511) map </A>","Summary":"Triangular shaped","Disposition":"IFO","divs":["sighting detailsi was home, friday night, and letting the dogs out before going to bed. i opened the front door and saw the object flying just over the tree tops in a straight, but very slow, flight path. i listened for any sound from the object; there was total silence. when the object went behind the pine tree-tops, i lost sight of it, so went to look out of my kitchen window so as to have a better vantage point. i didn't see it. went back to the front door to let the dogs back in and didn't see it again. the craft was triangular and had red\\green\\or white lights at the apex of each angle, with an amber light in the center. (i knew it was a ufo as 1. we are in the flight path of many types of aircraft flying in and out of ft. bragg so i am familiar with the different types 2. i have seen several ufo's, as a teen in the late 60's early 70's; and had a witness during the first sighting.) the next morning my husband and i went to the grocery store where we overheard the bag boy telling the cashier about the sighting he and his father had also had the night before. he said they saw 3 of the craft; i only saw one. they, also. made no noise at all. i can see i-95 from my front window so i know there had to be plenty of other people who saw this, too."],"Country":"United States","Region":"North Carolina","trends":["There have been 4 other sightings in Dunn","There were no other sightings in Dunn on or around July 29th 2011"],"Date of the Event":"07/29/2011 12:00 UTC","Weather Factors":"None","Case Number":"30511","files":["/var/www/straped/mufon/html2text/30511.html.txt","/var/www/straped/mufon/org/30511.html"],"Longitude":"-78.5772","Source":"MUFON","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","City":"Dunn","Date Submitted":"08/08/2011 08:43 UTC","Log Number":"US-08082011-0118","Tags":"City"}