{"map":"<A HREF = \"http://maps.google.com/maps?q=39.476959,+-83.638169(30514)&iwloc=A&hl=en\"> mufon case (30514) map </A>","Region":"Ohio","Date of the Event":"07/30/2011 01:00 UTC","Source":"MUFON","Case Number":"30514","Object Flight Path":"Hovering then path","Tags":"City","Object Features":"None","Summary":"small wire like probe hovering under street light","Disposition":"Unknown","Date Submitted":"08/05/2011 09:24 UTC","divs":["Sighting DetailsI went outside to smoke and notice object under street light. I thought it was a bat eating insects. The flight was odd and shape to big. I got my son to come outside and look. He went toward object and it went toward him and lowerd down toward him. He went back toward our yard and the object went back to what it was doing. I went back to house and got shoes on and flash lights. I went toward object using a board to block the street light to see it better. It came toward me and above me going up and down. When flashlight shined on it it would move fast back and forth. It looked like a bare cut metal object the size of a foot wood ruler. It had a wire tail with a light from tip going toward head every so often. When looking streight up at it it looked distorted and would get thiner or wider. I would get an uneasy felling when above me. I went back to the house and found some binoculers to look at it. It just looked like a hoovering wire through binoculars. Me and my 2 sons watched it from around 1:00 a.m. untill about 4:00 a.m. then my son and wife said it was there at 5:00 a.m. but when I went out at 5:30 a.m. it was gone and have not seen it since."],"Log Number":"US-08052011-0095","Longitude":"-83.638169","Viewing Distance":"20 Feet or Less","trends":["There have been no other sightings in Sabina","This sighting has never been favorited."],"Country":"United States","City":"Sabina","files":["/var/www/straped/mufon/html2text/30514.html.txt","/var/www/straped/mufon/org/30514.html"],"Object Shape":"Other","Weather Factors":"Unknown","Sighting Duration":"04:30:00","Latitude":"39.476959"}