{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","Latitude":"42.14351","Date Submitted":"08/09/2011 03:31 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.14351,+-88.272302(30519)&iwloc=A&hl=en\"> mufon case (30519) map </A>","Case Number":"30519","Object Features":"Undisclosed","Longitude":"-88.272302","Source":"MUFON","Log Number":"US-08092011-0092","divs":["Sighting DetailsMy husband and I were sitting on our deck with 2 friends about 11pm. One of our friends noticed a bright orange ball of light coming over the trees to the side our house, moving in a straight path like a airplane would but higher and no blinking or flashing lights. We watched it go across the sky heading in a northeast direction. At first I thought it might be a satelite, but was going slow and on a very even path. As it neared the farthest point away from us, it appeared to dim a little bit and then just disappeared, as if someone had turned off a light. Approximately 20 minutes later another orange ball came from the same area and repeated the above...disappearing in the same area as the first. I work for an airline and it was not a airplane. The ball of light looked solid with defined edges. It appeared to just glide across the sky, did not change altitude during the entire time we saw either of them. Did anyone else report this?"],"Summary":"Observed bright orange ball of light travel across the sky in a straight path then appear to slow and shink in size, then disappeared as if someone just turned of the light.","Disposition":"Unresolved","Date of the Event":"07/31/2011 12:00 UTC","Viewing Distance":"N/A","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30519.html.txt","/var/www/straped/mufon/org/30519.html"],"City":"Algonquin","Region":"Illinois","Country":"United States","Object Shape":"Circle, Sphere","trends":["There have been 6 other sightings in Algonquin","There were no other sightings in Algonquin on or around July 31st 2011"]}