{"Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/30513.html.txt","/var/www/straped/mufon/org/30513.html"],"Date Submitted":"08/07/2011 09:54 UTC","Object Shape":"Star-like","Object Features":"None","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Zumbrota","This sighting has never been favorited."],"Weather Factors":"Unknown","Date of the Event":"08/01/2011 09:40 UTC","Disposition":"IFO","Latitude":"44.294132","Region":"Minnesota","Object Flight Path":"Straight-line path","divs":["Sighting DetailsOn August 1st, 2011, at approx. 9:40pm, I was Driving South on Hwy 52 on Minnesota and approx. close to 10 miles North of Zumbrota, MN. I witnessed a Bright object appear in the sky and went almost strait down. It fell Thousands of feet in about 5 seconds. It did not streak, but appeared to fall or descend quickly. I noticed the object about 25-30 degrees to my left, starting from maybe 40 degrees above the horizon and fell below the tree-line. Although I assume this was probably a meteorite, which could have been dozens of miles away, I felt I should report it anyway in case it wasn't. Judging its motion while driving was a little difficult, besides the obvious nearly strait down descent. It appeared to possibly decelerate slightly, and may have maneuvered slightly as well, but this could have been due to my movement on the highway going 70mph. The object was star-like, about as bright as a very bright star. I just felt it was odd when I noticed its rapid descent, yet slow enough that it didn't streak like a common meteor. I've seen something like it once before around Fort Dodge, Iowa about 6 years ago, but this one was much higher or closer. Because of the tree-line, I was unable to see if it made contact with the ground, but it appeared it would have. The tree-line was quite some distance away, on the other side of a farm-field. Thanks!"],"Case Number":"30513","Country":"United States","Summary":"Bright Object Fell from the sky near Zumbrota, MN","City":"Zumbrota","map":"<A HREF = \"http://maps.google.com/maps?q=44.294132,+-92.669081(30513)&iwloc=A&hl=en\"> mufon case (30513) map </A>","Tags":"City","Log Number":"US-08072011-0112","Longitude":"-92.669081","Source":"MUFON"}