{"Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=35.413993,+-119.10112(30510)&iwloc=A&hl=en\"> mufon case (30510) map </A>","Region":"California","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/30510.html.txt","/var/www/straped/mufon/org/30510.html"],"Sighting Duration":"Undisclosed","Case Number":"30510","Country":"United States","Source":"MUFON","Date of the Event":"07/31/2011 08:45 UTC","City":"Bakersfield","Weather Factors":"None","divs":["Sighting DetailsMy wife and I were in our swimming pool and saw what appeared to be a very faint satelite, a starlike object moving at a steady speed from NE to SE direction at about 10 oclock from out position, looking to the NE. In the middle of the sky a bright becon of light appered to shine with a prtty good sized glow around the object. The beacon appeared to be pretty bright and flased from side to side for a few moments with the glow or aura around it getting brighter. It almost looked like it might be falling to earth. After about 30 seconds the light dimed and the starlike object continued moving in a Southern direction in the eastern sky. The sighting took place at 8:45 pm we were looking up at the sky and observed what we thought was a satelite. It was obviously very high in the sky and generally planed have blinking lights, this did not. I was so bright were pretty sure someone else must have seen this and maybe reported it. The object continues at a very slow and steady speed intil it was out of sight toward the horizon."],"Disposition":"IFO","Latitude":"35.413993","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 32 other sightings in Bakersfield","There was one other sighting in Bakersfield on or around July 31st 2011"],"Log Number":"US-08072011-0081","Date Submitted":"08/07/2011 04:21 UTC","Tags":"City","Summary":"My wife and I observed a starlike object that appered to be a satelite, flash a bright becon with an aura then continue in the same path.","Object Features":"Undisclosed","Longitude":"-119.10112"}