{"Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","Object Flight Path":"Path with directional change","Object Shape":"Sphere","Case Number":"30526","map":"<A HREF = \"http://maps.google.com/maps?q=33.583254,+-112.205031(30526)&iwloc=A&hl=en\"> mufon case (30526) map </A>","City":"Glendale","divs":["sighting detailson july 29th 2011 at around 6pm i was in my backyard smoking. it was a partially cloudy day and i was looking at the thuderstorms aroud my house to try to photograph the lightning. when i looked up to the west i saw three(3)of what looked like black\\greyish spheres flying to the south. as i observed these spheres flying slowly more and more came into view 2-3 at a time from the north, 11 in total. at first i thought they were a flock of birds or balloons in the wind. that quickly changed when i saw two of the initial objects begin to fly in a way that was completely different from the others. they seemed to weave in and out of the clouds above and to the west of them. as they all moved south, the ones that followed did the same at about the same place in the sky. i was amazed as to the speed and ability in which these objects move in such a manner. at this time my mother came outside and i imediately called her to see what i was seeing. i finally lost sight of the objects after about 5 minutes from the time i first saw them due to how far from me they were and the cloud cover that got thicker and darker further south of my house."],"Date of the Event":"07/29/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/30526.html.txt","/var/www/straped/mufon/org/30526.html"],"trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around July 29th 2011"],"Region":"Arizona","Summary":"11 spheres flying north to south some with erratic flight paths.","Longitude":"-112.205031","Latitude":"33.583254","Weather Factors":"Unknown","Log Number":"US-08062011-0074","Country":"United States","Source":"MUFON","Tags":"City","Object Features":"None","Sighting Duration":"Undisclosed","Date Submitted":"08/06/2011 06:38 UTC"}