{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.323426,+-120.486541(30523)&iwloc=A&hl=en\"> mufon case (30523) map </A>","Object Shape":"Sphere, Star-like","divs":["Sighting DetailsI work late at home, so, after work tonight, I decided to go out and get a soda. I always look up at the stars when I go out, but I have never seen anything truly strange. I know a planet from an airplane when I look up, though I am no pilot or other 'official'. Sorry to report, I am just a normal girl going to the corner market for a sugar fix in the wee hours of the night. This time, when I walked out and looked up, I saw a very bright, what I thought was, star. Brighter than anything in the night, I thought maybe it could be Vega, or another planet visible in the summer sky. Just when I wrote a mental note to go look up 'planets visible in the summer sky', this 'star' became brighter, at least twice as bright as when I first saw it... as if it were coming closer to me. \"Great, I've got a brain tumor and this is my 'Phonomenon' moment,\" I thought. Time and space completely stopped as this star grew brighter and brighter. It was so bright, I started to look around to see if anyone else was out, surely they would see this, you could not miss it! Only the guy working at the store was sweeping inside the glass doors. I looked back up, as it never really left my peripheral, the brightness had stabilized somewhat. It dimmed, and began to move around, not quite a figure-eight, and not quite a double-circle, but unmistakeable movement. As it moved, a meteor shot past, under it as it danced. I am sure my jaw was on the sidewalk along with all reason I may have had before I went outside. It's light began to fluctuate, dim, and disappear. It was gone. \"That was wierd, I wonder wha..\" I never took my eyes off the spot in the sky, because maybe a microsecond passed, and to my astonishment, it RE-appeared. Became bright as before, moving in the same pattern, and I felt... I still can't articulate that. (As I write this the morning dawns on my shock, & I'm doing my very best to document this. I can say I felt a definite contact, a connection with something I do not know. I must say also how very far away it was, I really thought it was a star way up there, until it moved.) I watched it dance, return to it's original position, brighten, dim, and disappear 4 times. The 4th, and final time it disappeared, it did not return. For a moment at least. My rational mind cannot explain this thing I saw. So, I looked around again, and felt like my feet had softly landed back on terra firma. A strange feeling, and my heart pounding fast, I went into the store... because now I really needed a soda... maybe two. The guy remarked that I was wandering a bit around the store, and I couldn't help but tell him, \"Sorry, but I think I just saw a real UFO out there.\" He giggled, and asked me where. I showed him where I saw it, paid, and left. When I went back outside, it was solid bright, pulsing, stationary in the sky, and very obvious to anyone who could look, though no one was out. I realized it probably wasn't a good idea for a girl to be outside at 4am, unarmed, alone, looking at the sky with a bag of goodies in hand. I also realized I couldn't explain this, and couldn't look at it anymore. Stars and planets brighten and flicker, but they don't dance around like that. Planes go in straight lines across the sky. I do not know what this was, but it must have been huge to be seen from such a distance. I am descending into a daze, and I feel a little nauseous. Maybe alot nauseous. My brain tries to make sense of it, and ties in a knot. But I felt... intelligence! I felt conciousness from that 'star'. That's what it was! I have never looked for such things, and never even thought they were real since all my life I have looked at the night sky for so many hours, watching the stars, and they have never moved before. There's got to be some high-powered telescope out there that saw this as well, it was unmistakeably something huge moving among the stars. It's light was substantial. This has changed me now forever. Thank you for reading my report."],"Date Submitted":"08/09/2011 04:27 UTC","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Latitude":"37.323426","Object Features":"Unknown","Source":"MUFON","City":"Merced","trends":["There have been 10 other sightings in Merced","There were no other sightings in Merced on or around August 1st 2011"],"Tags":"City","Disposition":"Unresolved","Log Number":"US-08092011-0111","Object Flight Path":"Stationary,Path with directional change,Other","Summary":"The First Real UFO I have Ever Seen With My Own Eyes","Case Number":"30523","Region":"California","files":["/var/www/straped/mufon/html2text/30523.html.txt","/var/www/straped/mufon/org/30523.html"],"Longitude":"-120.486541","Date of the Event":"08/01/2011 04:02 UTC"}