{"Object Shape":"Cigar, Circle, Disc, Fireball, Oval, Sphere, Other","Date Submitted":"08/09/2011 04:33 UTC","Longitude":"-119.413422","Case Number":"30536","Summary":"Bright Fireball object in the sky over highway 101N","Disposition":"Unknown","Log Number":"US-08092011-0114","Tags":"City","Object Features":"None, Other, Unknown","City":"Freemont","Date of the Event":"07/31/2011 02:45 UTC","Country":"United States","Object Flight Path":"Stationary","divs":["Sighting DetailsI had just dropped off my son at his Dad's house in Freemont around 2:30 pm yesterday, headed home on the 101N Oakland, High above in the very clear blue sky was what looked like a very bright fireball which at first I thought was a blimp so I watched it...I remember the freeway at this point was clear the car in front of me was about 100 ft in front of me and another just ahead of that, the highway was pretty much straight and I was able to get a really good look at this object which was the apparent size of an aspirin in perspective of distance..it was pretty high up around the same altitude as a plane or blimp would be, which is why I kept looking to see if there were any airplane lights or a slow moving blimp, it seemed to be totally stationary neither coming or going just hovering and then what looked to me to change shape from cigar to perfect circle, then cigar, blimp, and some other shape I can't describe other than an arm reaching out of an oval, all this time it was very bright and looked to be very hot in temperature, a lot like molten lava, I was asking myself over and over of course \"what is that\" it's gotta be a blimp, a plane right? then it seemed to warble like a planet then it looked like it started to dim away or fade out. then I thought I could see through it, when It appeared transparent there was no color visable, the object seemed to look like a cloud or water vapor, at this time I still could dismiss it as a blimp but not an airplane as there were no other lights blinking or flashing, there also at the time seemed to be no other planes in the sky possibly only because I wouldnt have even noticed due to how bright this object was, it continued to appear to fad out only showing just the tiniest wispy, white, cloudy, semi circle, then it seemed to turn and get bright again, and then it just dissapeared, like someone turned off a light switch, no fade, but more like a flickering candle going out. I was scratching my head and just kept saying \"where did it go\" I looked around on the freeway again to see if I was close enough to other cars to see if maybe they were as flabbergasted as I was, I also was thinking...those people ahead of me HAD to see that!!! I really seemed to be the only thing in the sky at that time...the bright fireball against a bright blue sky is hard to miss, I'm feeling very strange processing the emotional questions that keep coming up like \"Am I crazy?\" Did I see that? who do I tell,how do I report it, how do I find out if it was a weather balloon or a laser beam, I'm feeling like I'm in shock and having a hard time focusing on mundane chores. I noted the time to be between 2:45 to 2:55pm pacific standard, I'm really interested to know if someone else saw this too and if it was a blimp....How could it disappear? I just don't get it. would be nice to put my head to rest one way or the other though. Thank you for your time."],"Viewing Distance":"Over One Mile","Latitude":"36.781361","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.781361,+-119.413422(30536)&iwloc=A&hl=en\"> mufon case (30536) map </A>","Region":"California","files":["/var/www/straped/mufon/html2text/30536.html.txt","/var/www/straped/mufon/org/30536.html"],"Weather Factors":"Windy","trends":["There have been no other sightings in Freemont","This sighting has never been favorited."]}