{"Object Shape":"Circle, Cross, Diamond, Flash, Star-like","Date of the Event":"07/28/2011 11:15 UTC","Object Features":"None","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Source":"MUFON","Case Number":"30535","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30535.html.txt","/var/www/straped/mufon/org/30535.html"],"Region":"California","Date Submitted":"08/07/2011 05:00 UTC","Country":"United States","Tags":"City","Longitude":"-118.1078","divs":["Sighting DetailsI was on the sundeck above my garage at about 11:15 PM on July 28, 2011 when I saw a bright light. What made me report it was because it was odd. Normally, from my sundeck I can see aircraft making maneuvers for landings at LAX. Usually they head east towards my house an turn south; I can see their landing an marker lights. Occasionally, when the airport is fogged in, they fly over my house. On this night, I see this bright light in the west slightly below Arcturus? in Bootes. It moves slightly to the northwest and then brightens up and enlarges to a four-point diamond shape and then simply blinks out. No aviation marker lights were seen after the light went out; I couldn't tell what if any direction it continued to fly. I didn't hear any sound from the light. The attitude of the light was higher the planes that I see heading from LAX except when they come very close to my house; then the planes would be about the same attitude as the light. But, when they are that close, I can see that they are planes, not this light. I don't think that it was a police helicopter with its search light on; I should have seen aviation light still when the light went out; and I should have heard it."],"City":"South San Gabriel","Object Flight Path":"Stationary","Latitude":"34.048539","trends":["There have been no other sightings in South San Gabriel","This sighting has never been favorited."],"Log Number":"US-08072011-0084","map":"<A HREF = \"http://maps.google.com/maps?q=34.048539,+-118.1078(30535)&iwloc=A&hl=en\"> mufon case (30535) map </A>","Disposition":"IFO","Summary":"Just an odd light which brighten up and grew before blinking out"}