{"Longitude":"-97.353658","Date Submitted":"08/07/2011 01:59 UTC","Object Flight Path":"Other,Unknown","Date of the Event":"04/15/1995 02:11 UTC","Tags":"City","Source":"MUFON","divs":["Sighting DetailsI was asleep in my bed when a beam of light came through my window, this beam took me up into the air through the window and into the ship. Once onboard I was in a room with three \"greys\" and although they spoke to me they had no mouths but I heard every word. They told me they wanted a blood sample and meant me no harm they also explained to me why they wanted the blood sample. They were very friendly and I felt very calm and was not scared. I agreed to the sample and they told me a lot of different things, I awoke after the event and was very startled even to the point i threw my pillows off the bed at my recliner, i thought it was one of them at first. For many years i dismissed this event as a dream but it always stayed with me. Recently things they told me have come to be true and after this event I believe they or other alien beings continued to abduct me for some time after this event. The interior of the object was metallic in appearance and the control panels to fly the vessel was just a solid metallic panel, when you put your hand on this panel it molds to your hand and your movements work to control the ship. I never saw the outside of the ship but they did explain it was a small ship with bigger ships in the area that they dock with. I was also told other things that I would be willing to talk in depth about."],"Country":"United States","Viewing Distance":"20 Feet or Less","trends":["There have been 10 other sightings in Temple","There were no other sightings in Temple on or around April 15th 1995"],"Region":"Texas","files":["/var/www/straped/mufon/html2text/30531.html.txt","/var/www/straped/mufon/org/30531.html"],"Case Number":"30531","Object Shape":"Unknown","Disposition":"IFO","Summary":"A beam of light took me into ship[","Log Number":"US-08072011-0005","Sighting Duration":"Undisclosed","City":"Temple","Weather Factors":"Windy, Medium","Object Features":"Unknown","Latitude":"31.112582","map":"<A HREF = \"http://maps.google.com/maps?q=31.112582,+-97.353658(30531)&iwloc=A&hl=en\"> mufon case (30531) map </A>"}