{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.898333,+-95.671389(30542)&iwloc=A&hl=en\"> mufon case (30542) map </A>","Case Number":"30542","divs":["Sighting DetailsMy husband and I went to his hometown to visit. Around 10:15pm, we sat with family around the firepit to talk. The night was clear and full of stars; we were far from any major city. After watching planes coming in from the East, I saw a tiny white light flying along the path of the Milky Way, which was horizontal. Myself and about three other family members were facing East. I said, \"Oh, look at the tiny white star dot going across the sky\". I thought it looked odd, but thought maybe somebody else who grew up here might have an explanation. The tiny dot didn't blink and seemed very far away. Someone said it could be a satellite. I watched it go from the Northeast to the Southeast. Then, it veered slightly up and disappeared. I said a small silent prayer and continued to enjoy the beautiful night sky. Then, I saw another one traveling the same similar direction and it, too, veered and disappeared. Then shortly afterward another went Southeast going Northeast. Since I didn't grow up in the area, I thought maybe these were all satellites and they must orbit going opposite directions. Then, out of nowhere, we all saw a flash of light about pennysize in comparison to the other stars, which were like sharpened pencil dots. It flashed out of nowhere into this white circle of light, stayed large, then shrunk to a smaller size and...well...flew away as if into the night. In other words, the light got small and disappeared as if it was flying away from earth. I don't know how else to explain it. A couple of us said, \"Whoa! What was that?\" The next day, on Sunday, my husband heard a helicopter in our area around 11am. Might have been a regular helicopter."],"Tags":"City","Log Number":"US-08022011-0027","Object Shape":"Circle, Flash, Star-like","Source":"MUFON","Longitude":"-95.671389","Region":"Iowa","Latitude":"40.898333","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Hovering then path","Summary":"Tiny Lights; Bright Flash","trends":["There have been no other sightings in Tabor","This sighting has never been favorited."],"City":"Tabor","Date Submitted":"08/02/2011 11:41 UTC","files":["/var/www/straped/mufon/html2text/30542.html.txt","/var/www/straped/mufon/org/30542.html"],"Sighting Duration":"Undisclosed","Date of the Event":"07/30/2011 12:00 UTC","Object Features":"Unknown","Disposition":"IFO","Weather Factors":"None"}