{"map":"<A HREF = \"http://maps.google.com/maps?q=40.426417,+-82.904713(30548)&iwloc=A&hl=en\"> mufon case (30548) map </A>","Log Number":"US-08022011-0040","Case Number":"30548","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/30548.html.txt","/var/www/straped/mufon/org/30548.html"],"Object Flight Path":"Path with directional change","Summary":"Star quickly moved and stopped and moved again, and again in a triangle shape and stopped, then gradually shifted and stayed stationary.","divs":["Sighting DetailsMy 9yr old son and I were laying on our trampoline,(in the country) at night because I wanted to see if he could locate the big dipper. As I knew where it was, we were scanning the sky directly above us. One of the brighter stars suddenly moved quickly from one point to another and stopped(moved about four fingers distance at arms length). Then after about 15 or 20 seconds, it changed direction again, quickly moved snd stopped again in a second direction. After a short time it changed direction again to form a path of somewhat of a triangle. Then it seemed to gradually drift(no more than that four finger length), and stayed stationary for as long as we kept our eyes on it. I pondered with my son what that could have been, and we came to the conclusion that there was nothing on earth that we know of that could have moved like that.(even though it looked the same as any other star, only a little brighter) Coincidently, during the same timeframe we did see a shooting star going from the east to the west (superfast) that left a trail, not related to what we were looking at. The star or object we observed did not move again. It did not leave a trail and did not move as quickly as a shooting star. It did distinctly quickly change direction each time after stopping all three times. It seemed as if once we were pointing at it stopped moving completely as if it saw we had seen it and it wanted to blend in. We decided to go inside to call a family member to see if maybe we we should call somebody about our sighting. They suggested the police but we felt a little silly. Then we came across this website when trying to find somebody to report to. My son was a little worried because we both did witness this together and his imagination was working overtime. Myself, now I have no doubt that there are things going on out there where I was always skeptial before. When we went back outside, I thought I had a refrence point as to where it was at, but we could not locate it again."],"trends":["There has been one other sighting in Warren(Youngstown Air Bas","There was one other sighting in Warren(Youngstown Air Bas on or around August 1st 2011"],"Tags":"City","Date of the Event":"08/01/2011 10:37 UTC","Source":"MUFON","City":"Warren(Youngstown Air Bas","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"Ohio","Object Features":"None","Longitude":"-82.904713","Weather Factors":"Unknown","Date Submitted":"08/02/2011 05:50 UTC","Object Shape":"Star-like","Country":"United States","Latitude":"40.426417"}