{"Country":"United States","Object Shape":"Cigar, Cylinder","Log Number":"US-08092011-0125","Source":"MUFON","City":"Lexington","Longitude":"-84.571453","Date of the Event":"08/02/2011 04:20 UTC","Summary":"White or Silver Cigar Shaped object - reversed direction","files":["/var/www/straped/mufon/html2text/30567.html.txt","/var/www/straped/mufon/org/30567.html"],"Latitude":"37.983094","Case Number":"30567","Weather Factors":"Windy, Light","map":"<A HREF = \"http://maps.google.com/maps?q=37.983094,+-84.571453(30567)&iwloc=A&hl=en\"> mufon case (30567) map </A>","divs":["sighting detailson 08\\02\\11, at approx 1620 hrs ( clear sky , sun light ), i was outside walking my small dog. i just happened to look up in the sky, and saw a white or silver cigar shaped object, which looked to be atleast 100+ feet long, at an altitude of atleast 30,000 ft , heading from the north towards the south , on what would be the eastern edge of lexington, ky. this object was quite high up in the air , and i saw no wings, no smoke or vapor emission trail behind it, and no lights blinking, and no noise. i watched this object, until i lost sight of it, after about a minute of observation. then, about 30 seconds later, i looked back up at the area of the sky where i last saw the object, and this same shaped object had turned around, and was now heading back in the direction it came from ( now going south to north ). at one point, the sunlight reflected very brightly off of the object, for just a few seconds. the object then left my line of sight again, heading north, towards or over the downtown lexington area, but at the altitude the object was flying at, this could have been miles away from lexington. that type of altitude and distance is a bit hard to visually estimate. the object seemed to travel on a level course, and did appear to me, to travel a slight bit faster, than the usual high flying jet planes that i observe, from time to time. i have to admit that this is the very first object that i have ever seen in the sky, that i had no answer for. i do live near an airport, and we have planes fly over all the time ( both low and very high ). but, even when the planes fly over real high, i have always been able to either see wings, a vapor trail, and\\or a delayed engine noise, etc. this object had absolutely none of these things at all. and, i have seen meteors, comets, even the space station fly over, and this object was definately not any of those objects. * maybe someone who has connnections with norad or a radar station near the lexington, ky area, can check with them, and see if they can advise if anything showed up on their radar around the time of day i have indicated, altitude, direction of travel, etc. tuesday, august 2 , 2011, at approx 1620 hrs ( 4:20 pm ). thank you, karl hiten ."],"Date Submitted":"08/09/2011 06:04 UTC","Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"Over One Mile","Tags":"City","Sighting Duration":"00:03:00","Region":"Kentucky","Object Features":"None","Disposition":"Unknown","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around August 2nd 2011"]}