{"Object Features":"None","files":["/var/www/straped/mufon/html2text/30561.html.txt","/var/www/straped/mufon/org/30561.html"],"Region":"Kentucky","Object Flight Path":"Straight-line path","Date of the Event":"07/25/2011 03:30 UTC","City":"Radcliff","Log Number":"US-08032011-0048","Object Shape":"Circle, Fireball, Sphere, Star-like","trends":["There have been 3 other sightings in Radcliff","There were no other sightings in Radcliff on or around July 25th 2011"],"Date Submitted":"08/03/2011 07:23 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"37.78755","Country":"United States","divs":["Sighting DetailsI was at work outside on my 30 minute lunch break talking to a co-worker and smoking a cigarette at around 3:30am. I was taking a puff off my cigarette and happened to glance up for a split sec to see an orangish colored light moving east. At first it appeared to be an airplane but was to low and moving to slow. I watched as it got closer and then it turned a redish color. I could not see any detail on it as it looked like a glowing sphere kind of like a fire ball but without the fire if that makes any sense. It was probably 700ft in the air moving in a straight line right over me. It did not have any sound to it at all which really grabbed my attention. Before I lost sight of it over the tree line it turned a whitish silver and started moving north. I don't know what to think of it nor have I mentioned it to anyone. I know for a fact it was not an airplane. It did not have any blinking lights on it, was flying to low and to slow. Besides.. it was spherical in shape. To be honest I didn't even want to write this. Well thats what I saw. Thanks for taking the time to read."],"Summary":"Sitting outside smoking on break. Happened to glance up to see something odd.","Weather Factors":"None","Case Number":"30561","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Longitude":"-85.911966","map":"<A HREF = \"http://maps.google.com/maps?q=37.78755,+-85.911966(30561)&iwloc=A&hl=en\"> mufon case (30561) map </A>","Disposition":"Unknown"}