{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI let my dog outside a little after 1pm Aug. 2, 2011, Tues. I happened to notice to the left of my home an object moving slowly across the sky. It was approximately 50 to 75ft. up and it looked, almost, like a rectangular bird cage of some sort and it was dark gray or black. It was too far away to get an accurate size on it but with the size of the trees, I thought maybe it was 50 or 60 feet long. I'd never heard of a UFO with this shape so I watched it for a moment. It moved behind a stand of trees just outside our subdivision and was heading toward the east. It moved behind one group of trees still moving slowly in the same direction. I ran just inside the door to get my cell phone for a picture but it never came out of behind those trees. I don't know what happened to it. We live about 30 miles S. of Fort Knox and I wondered at first if it had anything to do with it. I can't explain where it went. I'm 64 year old grandmother of 8 and I don't drink, smoke or do drugs. I've never reported one before and am very interested if anyone else saw this thing the same day."],"Case Number":"30570","Object Shape":"Square, Rectagular","Date Submitted":"08/09/2011 12:36 UTC","City":"Cecilia","Source":"MUFON","trends":["There have been no other sightings in Cecilia","This sighting has never been favorited."],"Tags":"City","Country":"United States","Disposition":"Unknown","Region":"Kentucky","Object Features":"Patterned Surface","Object Flight Path":"Straight-line path,Unknown","files":["/var/www/straped/mufon/html2text/30570.html.txt","/var/www/straped/mufon/org/30570.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.665833,+-85.956667(30570)&iwloc=A&hl=en\"> mufon case (30570) map </A>","Log Number":"US-08092011-0068","Weather Factors":"None","Longitude":"-85.956667","Latitude":"37.665833","Viewing Distance":"501 Feet - 1 Mile","Summary":"let my dog out and just happed to notice it in the sky a stange shaped ufo","Date of the Event":"08/02/2011 01:20 UTC"}