{"Date of the Event":"08/02/2011 09:25 UTC","Log Number":"US-08052011-0044","Case Number":"30573","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface","Source":"MUFON","Longitude":"-76.234466","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.098258,+-76.234466(30573)&iwloc=A&hl=en\"> mufon case (30573) map </A>","Country":"United States","Disposition":"Unresolved","Object Shape":"Triangle","Region":"New York","City":"Owego","divs":["Sighting DetailsTriangular in shape and the whole bottom lit up, hovered then took off.....Hovered over the Lockheed Martin site on Rte 17c in Owego, NY. Funny part is it didnt show up on cell phone camera when Val tried to take a picture of it (I was driving) Was triangle, with three white lights one on each corner that and a solid red light in center of bottom I will do my best to draw it up. After hovering it moved slowly toward Hickory Park in Owego, then took off very fast moving south toward Pennsylvania . Both the wife and I saw it, she first noticed it as I was driving, when we first seen it the entire bottom was lit up in white light.It was high up, but when I got out of the car, I could see it was triangle shape on bottom, due to the light pattern that gave some dimension, the color appeared to be a charcoal brown, but as far as size. If I had to guess with distance and size in our view, I would guess it to be at-least 500 foot from one light to the other to the next, It was much closer than the 747's fly in the area, and I could see more detail on it than the planes that fly around here too, even with it being dark. At first it was just a bright line of light (viewed from Rte 434 in front of NYS Police barracks in Owego, then as we moved north (toward the light) the dimensions became more apparent. Also made no sound."],"Object Flight Path":"Hovering then path","Date Submitted":"08/05/2011 10:06 UTC","files":["/var/www/straped/mufon/html2text/30573.html.txt","/var/www/straped/mufon/org/30573.html"],"trends":["There have been 3 other sightings in Owego","There were no other sightings in Owego on or around August 2nd 2011"],"Tags":"City","Latitude":"42.098258","Viewing Distance":"Unknown","Summary":"Triangular shape craft hovered then moved south"}