{"Source":"MUFON","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=38.635992,+-90.192954(30578)&iwloc=A&hl=en\"> mufon case (30578) map </A>","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/30578.html.txt","/var/www/straped/mufon/org/30578.html"],"Date Submitted":"08/09/2011 09:18 UTC","Country":"United States","Case Number":"30578","Longitude":"-90.192954","Tags":"City","Date of the Event":"08/31/2008 12:00 UTC","City":"St Louis","Object Features":"Dome, Window(s)","trends":["There have been 74 other sightings in St Louis","There was one other sighting in St Louis on or around August 31st 2008"],"Weather Factors":"Unknown","Region":"Missouri","Sighting Duration":"Undisclosed","Latitude":"38.635992","Log Number":"US-08092011-0039","Summary":"grey circle,flat on bottom, slight dome shape on top,round dim head light type lights all around the edge of the circle.","divs":["Sighting DetailsI was driving from Ohio to Colorado one night,with my teenage daughter riding in the front passenger seat.I was focused on my car because it was running poorly, and I was afraid I would break down.My eyes were looking straight ahead,and we were in the middle of a conversation, when my eyes looked ahead but to the left .There were building close to the road,so at first I thought I was looking at a building,but wondered why only the top lights were all on, and none at the bottom .I wondered if they were having a party up there or something.Then I realized there was no bottom half to this \"building\".I was looking under the \"building.\"I asked my daughter to look at it, and tell me what that is.She screamed and almost started to cry when she looked at it.I needed her to calm down, plus I never believed in UFO's, but I was looking right at one.I could not understand why cars and semi's were not pulling over, they had to see it too. It was as close to the building before it, as it could be, and the top of it was about as high as the building next to it.I called my husband in Colorado on my cell phone.When he answered, I said \"I am looking at a UFO right now.\" I described it to him. It was grey,shinny like metal, it was flat on bottom,and slight dome shape on top,it had low beam lights all around the bottom edges.It had small windows ,close to the bottom edge.I could see clearly one whole side,bottom and top side. I thought to myself, when it lands, how does it keep from landing on those lights and breaking them.It hovered ,it stayed right beside that building,at the edge of the highway.I thought about calling 911, but they would think I was crazy.I thought\" Let some one else call\". I thought if cars start to pull over, then I will too, but I could not understand why cars were just going by as usual.Then I thought Oprah doesn't live that far away, maybe she has some luxury hover craft to take her sight seeing at night,but why so close to a building, and I have never heard of such a thing.My mind tried everything it could to find logic.My husband got on the Internet while we were still on the phone.He said there is a Air Force Base near where I was at, he said they have a new hover craft. I said OK, I feel stupid now, and I am glad I did not call 911, and make a fool of myself, and that must be why people are just driving on,because they are used to it.I am from the country, and figured I must have a lot to learn about life in the city.I hung up the phone, and continued driving. I noticed that it seemed to stay up ahead on my left for several minutes, which did not make sense.Then I passed it on the highway, getting a good look.I thought about pulling over again,and getting a better look, but with my car acting up, and 2 females along the road at night,I figured I should just keep going, I like to make good time, and get there in 24 hours.When I noticed it was now behind me,it seemed like now it was not on the side of the road,it was hovering right over top the road, and I was afraid it was following me.I was getting paranoid.I now questioned the Air Force Hover Craft idea.And remembered old UFO movies, where if you pull over or stop, they take you with them.I did not want that to happen, I did not want us to become missing persons.Every time I looked in my rear view mirror,it was the same distance behind me. I needed my daughter to stay calm,so I decided to stop looking back and drive.Besides this could not be happening, it could not be real.My husband had told me it was the Air Force, and that was that. Until last year. Last year I was watching TV , and something came on about UFO's. I was back home at Ohio.The program said the Air Force says they do not have hover crafts! I then knew I had seen a real UFO, and up close.Most the the pictures they were showing on the program of UFO sightings , were small specks way up in the sky.I could have counted the lights if I would of pulled over that night.There was no squinting of eyes , or trying to make something out of a cloud, it was as real and as close as the buildings on the road. It makes no sense to me that it was that low, that close to a building, in a city, and right near a busy 4 lane. It makes no sense cars did not pull over, or go off the road to look at it.But I knew at that moment that UFO's are real,unless we have hover crafts the size of a building, and it is kept secret.I tell people now, that I saw a UFO once.They smile , or turn their head and laugh. Nobody asks what I saw, or where I saw it , or when or anything.But I saw it, just as plain as I saw the Arch, and any other building, or vehicle.I just could not believe what I was seeing at the time."],"Disposition":"Unknown"}