{"Weather Factors":"Unknown","Source":"MUFON","City":"Fort Campbell North","divs":["Sighting DetailsFt. Campbell, KentuckyI WAS AT HOME WAITING FOR SON TO GET BACK FROM HIGH SCHOOL BASEBALL GAME. I WENTOUTSIDE AND SAW A STAR TWINKLING THROUGH THE TREETOPS. I THOUGHT IT WAS A STARAND THEN A HELICOPTER. CURIOUSITY, THEN BREATHLESSNESS, DISBELIEF. AT FIRSTCOULD NOT MOVE. THEN WE WENT INTO THE HOUSE AND I TOLD SECOND WITNESS TO DRAWWHAT SHE HAD SEEN. I WENT INTO ANOTHER ROOM TO DO THE SAME. WE DID NOT SPEAKAFTER OBJECT DISAPPEARED, NOT UNTIL DRAWINGS WERE FINISHED AND THEN NOT MUCHAFTER THAT. IM NOT SURE. THE OBJECT APPEARED TO BE ROUND AND IT HAD BIG GREENAND RED LIGHTS ON THE BOTTOM, ABOUT SIX OF THEM AND THEY ROTATED IN A CLOCKWISEPOSITION. IT WAS TOTALLY SILENT. THE SKY WAS OVERCAST THAT NIGHT AND I MAY NOTHAVE BEEN ABLE TO SEE THE ENTIRE OBJECT. WHAT I DID SEE DID NOT APPEAR THATLARGE BECAUSE I COULD TAKE ALL THE PART THAT I DID SEE JUST BY LOOKING OVER MYHEAD. IT DID PASS RIGHT OVER THE SPOT WE WERE STANDING. IT WAS NOT HIGH IN THESKY. COULD HAVE BEEN JUST A COUPLE OF HUNDRED FEET ABOVE ME. THE POINT ISEVERYTHING I DID SEE WAS CLEAR AS CRYSTAL. IT KEPT THE SAME MOMENTUM. IT SEEMEDTO BE GLIDING AND JUST KEPT ON GOING OVER OUR HEADS TIL IT DISAPPEARED IN THENIGHT SKY. NOTATION- AM NOT GOOD WITH DIRECTIONS.2COMCAST.NET"],"Sighting Duration":"00:10:00","Latitude":"36.649999","Tags":"City","Disposition":"IFO","Object Shape":"Blimp","Log Number":"","Longitude":"-87.466734","map":"<A HREF = \"http://maps.google.com/maps?q=36.649999,+-87.466734(3057)&iwloc=A&hl=en\"> mufon case (3057) map </A>","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Fort Campbell North","There were no other sightings in Fort Campbell North on or around March 31st 1979"],"Country":"United States","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/3057.html.txt","/var/www/straped/mufon/org/3057.html"],"Date Submitted":"03/31/1979 06:00 UTC","Date of the Event":"03/31/1979 06:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"SOMETHING IN THE SKY","Object Flight Path":"Straight-line path,Unknown","Case Number":"3057"}