{"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Log Number":"US-08032011-0009","Object Features":"Patterned Surface","Case Number":"30584","Disposition":"IFO","Summary":"Could have mistaken it for a helicopter! Very close encounter","Tags":"City","Source":"MUFON","Country":"United States","divs":["Sighting DetailsAbout 2:00 am, the morning of Tuesday, August 2, 2011 I heard what sounded like a helicopter circling our building outside. I am used to the helicopters flying to the hospital, but this one was very close and seemed to be around for a very long time. I turned off the air conditioner so I could hear it better and it sounded like it was coming back around again, so I got up, opened the balcony door, and saw an object with no clear shape with a red light, a green light, and a spotlight on the front, and maybe a few other lights. I still thought it may have been a helicopter and my eyes were playing tricks on me, but no, this object was a clear outline, even though the object itself was dark, of a perfect cylinder. I screamed for my girlfriend to get up out of bed and look at what I was seeing! She came over and looked, and here it came around again. It must have circled over us towards Bellevue, to Autumn, to one of the side streets off Overton Park, then headed back West towards us again. My girlfriend saw it, but was too tired to stand and watch with me so she went back to bed (unbelievably). Well, I was on fire and needed someone to talk to immediately! I was losing it seeing this. It flew that exact same flight pattern several times. The 3rd or 4th time I saw it, I grabbed a notebook and a pen and began trying to draw what I had seen. About that time, it came back around and this time began flying directly towards me. I had the balcony door open and was looking directly up at it as it was flying over the 3-story house right next door. This object was VERY low and VERY close. It was probably no more than 15 feet above me. Seeing it from this angle though, it looked fatter around than it had from the side, like a canister or soda can. Cylindrical. I drew pictures. This object sounded like a helicopter. I have to also mention how we were sort of expecting or looking out for something this evening: last night around 1:20am or so, we were watching TV and there was a sudden BANG! boom boom, then steady rumble for a few seconds. It was not lightning. It sounded like it was right outside our window. It scared the living daylights out of us, but more so my girlfriend because last week, she was sleeping and I was up watching TV around 1 am and there was a loud BANG! like something exploded, busted, or went off like a shotgun (but not a shotgun, as I am familiar with guns) and I also noticed a flash of light through the window. It scared me so bad, I jumped and my heart sank. I didn't know how to explain that sound. The light is unexplainable. The sound is unexplainable. I described it to my girlfriend the next day so when it happened last night again, it scared the crap out of her, but she knew immediately what I was talking about from before. Since then, we looked outside and there is no explanation whatsoever for that sound, but also there was a rumble afterwards, but it wasn't like it was coming from the sky. It was like it was coming from right outside our window. So, this evening I was sort of anticipating that sound may be occurring again so maybe we could come up with an explanation for it and well, this is what happened instead... the unknown object that sounds similiar to a helicopter in volume and feeling, but the chopping sound of the helicopter blades isn't there and is more of a working-motor sound, like buzzing. Imagine a weedeater at the volume of a helicopter. That's what it sounded like. One could have easily mistaken it for a helicopter."],"Date of the Event":"08/02/2011 12:00 UTC","Longitude":"-90.020062","files":["/var/www/straped/mufon/html2text/30584.html.txt","/var/www/straped/mufon/more/30584_submitter_file1__object8-2-11_sideview.jpg","/var/www/straped/mufon/more/30584_submitter_file2__object8-2-11_aboveme.jpg","/var/www/straped/mufon/org/30584.html"],"Object Shape":"Cylinder","Weather Factors":"Unknown","Date Submitted":"08/03/2011 04:02 UTC","Latitude":"35.14998","City":"Memphis","Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=35.14998,+-90.020062(30584)&iwloc=A&hl=en\"> mufon case (30584) map </A>","Viewing Distance":"20 Feet or Less","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around August 2nd 2011","This sighting has never been favorited.",""]}