{"Object Features":"Unknown","City":"Cedartown","Summary":"My boyfriend and I saw a triangular shaped craft in the air above a pasture. It had a red, green, and white light at each point of the triangular shape.","Region":"Georgia","Date Submitted":"08/09/2011 01:35 UTC","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","divs":["Sighting DetailsMy boyfriend was taking me home around 11 pm at night on August 2, 2011. We always travel on back roads, and it is very country and rural with just a few houses. We were traveling on Bellview Road going towards Cedartown from Rockmart. I wasn't paying much attention at the time and he asked me if I had seen a bright light in the air pass in front of us while we were on the road, and i hadn't seen it at the time. He said it was too low to the ground to be an airplane and it had different color bright lights. Well, I thought he was just joking around with me so i kind of blew it off, but I could tell he kept looking up in the sky looking for something. About 5 minutes down the road something caught my eye to the left of the car, and we both saw it this time. To the left of the car on the driver's side there was an empty pasture, I dont know if it was part of someone's property or just a random pasture, but there was a triangular shaped craft hovering just a few feet above the treeline. It was dark so we couldn't see the whole craft, but it had one light at each point of the triangle, so there were three different color lights. The lights were red, green, and yellowish-white. We could see the outline of the craft and we could tell it was a triangular shape, but we couldn't see details of the craft besides the lights and the shape. It was angled in a position as if the triangle was lying down, like it was horizontal instead of vertical. It wasn't very big but it wasn't small, maybe the size of a short school bus. It was a few feet above the treeline in the air and it was hovering over the pasture slightly moving forward and backwards. All we could do was sit there and stare at it. We were afraid to look away from it because we were afraid it would disappear. I pulled out my camera to get a picture and video tape of it, and my boyfriend was turning the car around. We started heading back towards the craft, but for a split second the trees blocked our view and when we got back out in the open it was gone. Just in about 3 seconds it was gone, disappeared. We looked everywhere in the sky for it, but it was nowhere. I don't know of any aircraft that is that fast to disappear in just a few seconds. It left no reflection or no shadow. It was just gone. We didn't get out of the car to investigate because we were a little frightened. We didn't hear the craft make a noise, and it didn't leave any trace of being there, that we know of, because like I said we were a little too frightened to investigate it. I didn't get a chance to take a picture of it which is unfortunate because without proof not many people will believe us. My boyfriend and I both saw it so it wasn't just our imagination. We weren't drunk or high. We were completely sober. We know what we saw.."],"Object Flight Path":"Hovering then path","Country":"United States","Date of the Event":"08/02/2011 11:00 UTC","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.016645,+-85.132223(30583)&iwloc=A&hl=en\"> mufon case (30583) map </A>","Latitude":"34.016645","Source":"MUFON","Case Number":"30583","Sighting Duration":"00:00:03","Longitude":"-85.132223","files":["/var/www/straped/mufon/html2text/30583.html.txt","/var/www/straped/mufon/org/30583.html"],"Log Number":"US-08092011-0081","trends":["There has been one other sighting in Cedartown","There were no other sightings in Cedartown on or around August 2nd 2011"],"Object Shape":"Triangle"}