{"Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Appendage(s)","City":"Fort Collins","Log Number":"US-08052011-0048","Tags":"City","Date of the Event":"07/29/2011 03:30 UTC","trends":["There have been 65 other sightings in Fort Collins","There was one other sighting in Fort Collins on or around July 29th 2011"],"files":["/var/www/straped/mufon/html2text/30590.html.txt","/var/www/straped/mufon/org/30590.html"],"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Region":"Colorado","Object Shape":"Bullet, Missile, Cigar, Chevron, Circle, Cylinder, Diamond, Oval, Sphere, Square, Rectagular, Star-like, Teardrop","Summary":"Ft.Collins, CO object in sky","Longitude":"-105.077423","divs":["Sighting Details****PLEASE FORWARD TO DOUG WILSON*******I have spoken to him regarding this event. Thank you On July 29, 2011 at approximately 3:00am, I let my dog out. While I was outside I noticed how clear the sky was and how easy it was to see the stars when most of the neighborhood lights were out. I noticed an exceptionally bright star in the east, however, it seemed closer than the other stars. While I wathced it, there seemed to be tentacles coming from the object and it became brighter. I could not believe what I was seeing and while I watched it longer, it began to change shape and color includings grrens, blues and reds. The object also changed from a solid object to a type of mist then back to a solid abject. Interestingly I did not feel scared or the need to react defensively. I did not think I needed to wake up my family to see the object. I felt the object was interacting with me and our experience was similar to a child playing with a pet. This viewing happened four days ago and I am still very tired."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.58806,+-105.077423(30590)&iwloc=A&hl=en\"> mufon case (30590) map </A>","Date Submitted":"08/05/2011 11:59 UTC","Case Number":"30590","Weather Factors":"Unknown","Country":"United States","Latitude":"40.58806"}