{"Object Flight Path":"Undisclosed","Latitude":"42.104487","Date Submitted":"08/09/2011 08:42 UTC","Log Number":"US-08092011-0128","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Disc","Region":"New York","files":["/var/www/straped/mufon/html2text/30607.html.txt","/var/www/straped/mufon/more/30607_submitter_file1__BrianTitusUFO1.jpg","/var/www/straped/mufon/more/30607_submitter_file2__BrianTitusUFO2.jpg","/var/www/straped/mufon/org/30607.html"],"Country":"United States","Tags":"City","Date of the Event":"08/01/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.104487,+-75.913914(30607)&iwloc=A&hl=en\"> mufon case (30607) map </A>","Longitude":"-75.913914","Source":"MUFON","Disposition":"Hoax","Viewing Distance":"501 Feet - 1 Mile","Summary":"UFO spotted in Binghamton","Object Features":"Undisclosed","divs":["sighting detailsi am filing this report for the witness, with his permission, after our phone interview. i initially contacted witness after his pictures appeared on the wbng-tv website. l. behr asd\\fi witness was in the parking lot of lourdes hospital on riverside drive in binghamton ny. he observed object over the hill, across the river in what would be vestal ny. the object appeared huge at this point, \"as large as a football stadium\". object was stationary and then shot up and vanished. this upset the witness who called his mother. he then finished his business at the hostial and was on his way home, approximately 20-30 minutes after the initial sighting. he was traveling on riverside drive toward his home in johnson city when he observed the object again to his right, this time much higher in the sky. witness pulled onto a side street and took 2 pictures. he observed the object for approximately 2 mintues before it again shot straight upward and away. witness stated that there were other people in the hospital parking lot who observed the object but, he did not know who they were. he also stated that people have posted on the wbng web site that they also saw the object. i will follow up on this. l behr"],"trends":["There have been 14 other sightings in Binghamton","There was one other sighting in Binghamton on or around August 1st 2011","This sighting has never been favorited.",""],"City":"Binghamton","Case Number":"30607"}