{"Tags":"City","files":["/var/www/straped/mufon/html2text/30601.html.txt","/var/www/straped/mufon/org/30601.html"],"City":"Holdenville","Region":"Oklahoma","Latitude":"35.080362","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","Date of the Event":"08/10/1966 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.080362,+-96.399176(30601)&iwloc=A&hl=en\"> mufon case (30601) map </A>","Date Submitted":"08/03/2011 06:15 UTC","Source":"MUFON","Country":"United States","Longitude":"-96.399176","Sighting Duration":"00:20:00","Log Number":"US-08032011-0043","trends":["There has been one other sighting in Holdenville","There was one other sighting in Holdenville on or around August 10th 1966"],"Object Shape":"Circle, Sphere","Disposition":"Unknown","Case Number":"30601","Weather Factors":"Unknown","Object Features":"None","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","divs":["Sighting DetailsIt was during the summer of 1966. A friend of mine and myself decided to go fishing for catfish on Wewoka Creek, which is about 5 miles N. of Holdenville,Oklahoma. At around one in the morning we both noticed what appeared to be two bright stars moving strangely in the sky NE of us. We climbed up the creek bank so we could see the lights better. I would guess these light to be about a half mile away at this time, but they were coming our way. The movement of the lights was what had our attention the most. One light would move horizontally and stop then the other one would move near it. They also did this in a vertical manner. The movement was very fast and they did not slow down to stop, they just stopped in the sky. They made absolutely no noise. We were a little shaken by this activity so we got to the vehicle and headed S. towards Holdenville. We had gone about a mile and a half when I looked out the rear window and saw one of the lights move, what I would guess to 40 to 50 yards,above us. We stopped the vehicle in the middle of the gravel road and both of us exited the vehicle. The object, bright light, lit up everything around us for about two or three seconds. I remember seeing cattle standing in the pasture and feeling like something had just taken a picture of me with a giant flashbulb. After the bright light went out, the object sped up into the sky, at what appeared to be somewhere around the speed of light, and disappeared into the star lit sky. There was no sound and we never spotted the other bright light again. We reported this to the local police in Holdenville and asked them if they had had any other reports. They thought we were either drunk or crazy so we just kept it to ourselves for years. I must admits that I spent several sleepless nights trying to rationize what I had seen. Today, I am just thinkful that I was there to have this experience."],"Summary":"*Fishing with friend late at night, spotted two bright star like objects moving oddly in night sky, as objects got nearer we decided to leave, one of the objects hovered over us as we were driving, we exited the vehicle and everything around us lit up"}