{"Tags":"City","City":"Albany","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path then hovering,Other","Case Number":"30613","Date Submitted":"08/03/2011 11:07 UTC","trends":["There has been one other sighting in Albany","There were no other sightings in Albany on or around August 15th 1974"],"Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.961301,+-71.178586(30613)&iwloc=A&hl=en\"> mufon case (30613) map </A>","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date of the Event":"08/15/1974 10:30 UTC","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/30613.html.txt","/var/www/straped/mufon/org/30613.html"],"Region":"New Hampshire","Longitude":"-71.178586","Country":"United States","Object Features":"Unknown","Summary":"Very bright disc about 3-5 miles away flew across valley - stopped a moment in mid-air and then aruptly flew off - very fast - at an angle into the sky & disappeared","Latitude":"43.961301","divs":["sighting detailsi had hiked up mt. chocorua in the white mountains of new hampshire near the town of albany. the had planned on staying over night at an a.m.c. hut (for hikers) near the summit. after dinner myslf & two other hikers were outside looking at the view of the valley below and the night sky. suddenly i noticed a very bright disc shape that started to move very quickly from the mountains (or ridge) - moving left to right - from one side of the valley over to the other side over the town. it then stopped and hovered for a moment (as if to say \"do you see me?\"); and then very fast and sudden like shot off into the sky at about a 45 degree angle. so it moved in a straight line from right to left, stopped and then suddenly changed angle and seemingly went right into outer space at an incredible rate of speed. this all happened very quickly i think in less than 1\\2 a minute total time. i'd say about 3 -5 miles away and a bit higher in the air than the mountain top but straight out or squarely out in front of us. i just simply turned to my fellow hikers and said, \"hey did you guys see that?!\" \"yeah\" was the answer. and i followed with, \"we don't have anything like that - do we?\" \"no, or not that we've ever heard of anyway\""],"Log Number":"US-08032011-0059"}