{"Region":"Texas","Sighting Duration":"Undisclosed","divs":["Sighting DetailsPlease stick with till the very end. Now, this is the story all about how My life got flipped-turned upside down And I'd like to take a minute Just sit right there I'll tell you how I became the prince of a town called Bel Air In west Philadelphia born and raised On the playground was where I spent most of my days Chillin' out maxin' relaxin' all cool And all shootin some b-ball outside of school When a couple of guys Who were up to no good Startin making trouble in my neighborhood I got in one little fight and my mom got scared She said 'You're movin' with your auntie and uncle in Bel Air' I begged and pleaded with her day after day But she packed my suite case and sent me on my way She gave me a kiss and then she gave me my ticket. I put my walkman on and said, 'I might as well kick it'. First class, yo this is bad Drinking orange juice out of a champagne glass. Is this what the people of Bel-Air living like? Hmmmmm this might be alright. But wait, I hear the prissy, booze, whine, all that Is this the type of place that they should send this cool cat? I don't think so I'll see when I get there I hope they're prepared for the prince of Bel-Air Well uh, the plane landed and when I came out There was a dude who looked like a cop standing there with my name out I ain't trying to get arrested yet. I just got here! I sprang with the quickness, like lightening disappeared I whistled for a cab and when it came near The license plate said fresh and it had dice in the mirror If anything I can say is that this cab was rare But I thought 'Man forget it' - 'Yo home to Bel Air' I pulled up to the house about seven or eight And I yelled to the cabbie 'Yo homes smell ya later' I looked to my kingdom I was finally there To sit on my throne as the Prince of Bel Air No no in all seriousness, Here how it really happened... My friend and I were at my house swimming in my swimming pool, and I was just floating around looking up at the stars when all of the sudden i realized two of the so called \"stars\" were moving vertically across the sky, at first i thought they were airplanes, but they didn't have airplane lights, then i thought they were shooting stars but the moved slower than shooting stars and faster than airplanes. I was really, like, surprised at what I was seeing so i hollered at my friend and she got excited too. So we followed the \"stars\" with our eyes until they disappeared behind some pine trees. That is all, thank you for sticking with my story till the end."],"Latitude":"33.175586","Tags":"City","City":"Mt Vernon","Viewing Distance":"Unknown","Log Number":"US-08032011-0059","Date of the Event":"07/29/2011 10:10 UTC","trends":["There have been no other sightings in Mt Vernon","This sighting has never been favorited."],"Case Number":"30612","files":["/var/www/straped/mufon/html2text/30612.html.txt","/var/www/straped/mufon/org/30612.html"],"Disposition":"Insufficient Data","Summary":"A light was moving vertically across the sky!","Object Shape":"Star-like","Weather Factors":"Unknown","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.175586,+-95.233411(30612)&iwloc=A&hl=en\"> mufon case (30612) map </A>","Source":"MUFON","Date Submitted":"08/03/2011 11:00 UTC","Country":"United States","Longitude":"-95.233411","Object Flight Path":"Straight-line path"}