{"Case Number":"30611","Country":"United States","Object Shape":"Square, Rectagular, Triangle","trends":["There have been 5 other sightings in Great Falls","There were no other sightings in Great Falls on or around May 10th 1972"],"Weather Factors":"Unknown","Region":"Montana","Latitude":"47.504805","divs":["Sighting DetailsAlthough the actual time period is vague, I believe it was about 3p.m.(high sun)in May of 1972. I was stationed at Malmstrom AFB, Montana as an A1C in Security Police and working as Security Escort on a Targeting Mission with 1 Lieutenant, 1 Captain, 1 TSgt., 1 SSgt., and myself. We had just finished our mission at Echo-4 and were heading home and in good spirits as the mission was successful. We were about 18 miles from base and the weather was sunny, with blue skies and clouds all around. Everything appeared normal. All of a sudden, the engine of our truck(an AF 6 pack Targeting Vehicle), began to sputter and then stop in the middle of the highway. The driver, a SSgt in maintenance, tried to restart the engine with no success. The driver then noticed that we had no power; when he turned the key, there was no turning of the engine, no crackle, no whirrring , no clicking. He then tried the vehicle's radio to notify Base that we were having problems and to contact vehicle maintenance for help. But the radio was not working, not even squelch...The Capt. asked me to use my walkie talkie and contact CSC(Central Security Control)which I attempted; but also could not raise anyone. I checked my watch and noticed it was about 3 p.m in the afternoon and the sun was very high in the sky. We all decided to get out of the vehicle and check the engine to see what could be done.. Once out of the vehicle I went to the rear to set up a security zone for us. I tried my radio once again with no success. As I attempted to check the squelch, I happened to look toward the East and tilted my head upward to what appeared to be a very thick white cloud, approx. 100-150 feet above me, that seemed to come out of nowhere. I wouldn't have taken a second look if it wasn't for the very bright silvery craft that came out of the cloud. It made no noise except for a slight humming sound. I stood there staring, and called out to my team to come to me. As they approached me, they saw me staring and looked up and saw what I was seeing. The craft was huge! It was approx. 30 to 40 feet high and was the size of 2-3 football fields! It was triangular and square in shape. Bright silver, almost as bright as the sun! We all had to shield our eyes as it hovered and moved slowly toward the North. It moved very slowly(about 1 mph) to come out of the clouds; and when it finally did; it took off toward the Northern Sky in a flash! As it hovered over us, I had the feeling that it was observing us, and so did the Captain. He reminded me to not take any offensive posture with my weapon. I agreed. Once the vehicle disappeared, we looked at each other and wondered what we had just seen. We had all agreed to report this as soon as we got back to base. It was then that I heard my radio Squelch and asked the Captain if he wanted me to report on the air. He said no, just to make a security check with CSC. The driver got back into the cab of the truck and turned the key..it immediately started as if nothing had happened. We all got in the vehicle and started for Base. When we arrived on Base, the Capt. and Lt. had to go to their Targeting Hqtrs in order for them to relinquish their targeting codes. Once there, we all started getting out of the truck to got with him to brief on what happened. The Capt. told us no. That he and the Lt. would do the reporting and if we were needed, he would come and get us. About an hour later, the Captain returned and told us the following quote..\"If you value your careers, you will not talk about this incident ever again. That is an order\" I have kept my silence for over 38 years. I wish I had more to tell you as I do not remember their names. Hopefully. They have spoken and told their stories and we may get to the bottom of this. I see this incident almost every day in my mind's eye and wonder to this day what it was. Perhaps someday I will know... Daniel J. Harvey"],"Date Submitted":"08/03/2011 09:05 UTC","files":["/var/www/straped/mufon/html2text/30611.html.txt","/var/www/straped/mufon/org/30611.html"],"Date of the Event":"05/10/1972 12:00 UTC","Longitude":"-111.299408","Disposition":"Unknown","Object Features":"Patterned Surface","Source":"MUFON","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Tags":"City","Sighting Duration":"Undisclosed","City":"Great Falls","Summary":"Craft appeared from East in Clouds, approx. 30 ft. high, length=2-3 football fields, bright silver.","map":"<A HREF = \"http://maps.google.com/maps?q=47.504805,+-111.299408(30611)&iwloc=A&hl=en\"> mufon case (30611) map </A>","Log Number":"US-08032011-0056"}