{"Object Shape":"Fireball, Star-like","Source":"MUFON","Date Submitted":"08/05/2011 02:43 UTC","Sighting Duration":"00:00:08","trends":["There have been 4 other sightings in West Plains","There were no other sightings in West Plains on or around July 30th 2011"],"Object Features":"Unknown","divs":["Sighting DetailsI was sitting in my parked car in the driveway talking on my cell phone to a close friend. My car was facing due south and I was looking ahead through the front windshield while having my conversation. At around 1:45am, approximately, I saw what I initially thought to be a bright meteor pass by low on the horizon, just below the treetops in the foreground at the edge of my yard from my viewpoint. At first I assumed the object had burnt up in the same second that I noticed it, because my view of it was obstructed by the thick woods. There is however a break in the woods where the privite road that I live on comes down to my driveway from 17 highway, which provides a clear due south view placing the apparent horizon from where I was sitting at least a mile away, on the other side of highway 17. After noticing and losing sight of the object behind the foreground trees the first time, it re-emerged a couple of seconds later as it passed through this clearing over the private road. I was able to track the object with my eyes as it continued moving from west to east, and I lost it behind the other patch of woods on the far side of the private road, continuing to catch glimpses of it between the folliage. The object was unusual because it moved with the speed of a meteor and looked like one, but did not lose altidude or burn up for the whole 5-8 seconds that it took for it to pass accross my field of view. I would compare the exact look and apparent size of this object to that of a bright star or planet on an exceptionally clear night. I have no way of telling how far away the object was but I assume it passed over Arkansas somewhere, because my residence is only a few miles from the Arkansas-Missouri border. Another note: This may be unrelated, but a large jet with three lights on the bottom (I assume a commercial jet) passed directly over me within a couple of minutes of my sighting, and it was headed southeast, so I know the pilots had to have seen what I saw. Also, highway 17 has a four or five mile straight stretch facing directly south with open fields on both sides before you get to my house, so if anyone was traveling south on that highway around that time, they had to have seen the object. I was unable to find any other reports of this from anyone else, so I decided to be the first to file it."],"Weather Factors":"Unknown","Summary":"Basically looked like a meteor that did not burn up, slow down, or lose altitude.","Object Flight Path":"Straight-line path","Latitude":"36.656468","files":["/var/www/straped/mufon/html2text/30623.html.txt","/var/www/straped/mufon/org/30623.html"],"Date of the Event":"07/30/2011 01:45 UTC","Country":"United States","Longitude":"-91.933757","map":"<A HREF = \"http://maps.google.com/maps?q=36.656468,+-91.933757(30623)&iwloc=A&hl=en\"> mufon case (30623) map </A>","Disposition":"IFO","Viewing Distance":"Unknown","Region":"Missouri","Log Number":"US-08052011-0019","Tags":"City","City":"West Plains","Case Number":"30623"}