{"Source":"MUFON","Log Number":"US-08092011-0064","Weather Factors":"Unknown","City":"Fall River","Disposition":"IFO","Object Features":"Unknown","Case Number":"30629","Object Shape":"Oval, Star-like","divs":["Sighting Details(JANUARY 28, 1977) UFO EXPERIENCE (PHENOMENA) TUESDAY JANUARY 18, 1977 AT 5:45 P.M. I LEFT MY PARENTS HOME LOCATED IN EAST PROVIDENCE DESTINATION 195 EAST TO TIVERTON, R.I. FOR THE COACHMAN RESTAURANT, 1143 MAIN ROAD. ALSO HAD AN APPOINTMENT AT 8:45 P.M. IN THE AREA. WHILE DRIVING ON 195 EAST & BEING A UFO ENTHUSIAST, I AUTOMATICALLY SCAN THE SKY SEARCHING FOR THE BRIGHTEST STARS. I SPOTTED TWO THAT WERE UNUSUALLY BRIGHT AND CONCENTRATED ON THEM FOR A WHILE. ONE OF THE STARS WAS LOCATED ABOVE THE FALL RIVER AREA & THE OTHER IN NORTH TIVERTON ON THE OPPOSITE SIDE OF THE EXPRESSWAY OR IN RELATION TO THE BRAGA BRIDGE ON THE RIGHT. ALL OF A SUDDEN, AS I WAS PASSING THROUGH SOMERSET, THE STAR SPURTED DIRECTLY OVER TO THE NORTHERN SECTION OF FALL RIVER WITH ACCELERATION FASTER THAN ANY JET IV'E EVER SEEN. NEXT I THOUGHT MAYBE I AM HALLUCINATING. TO MYSELF, I INDICATED, IF THE OBJECT SHOOTS BACK ACROSS THE HIGHWAY AGAIN ITS GOT TO BE A UFO! SURE ENOUGH TWO OR THREE SECONDS LATER IT WENT TO THE OPPOSITE SIDE. I WAS ABSOLUTELY OVERWHELMED! THEN I NOTICED THE SPACECRAFT, GLOWING LIKE A STAR, CONTINUE IN A NORTH EAST DIRECTION OVER THE BRAGA BRIDGE. I PREPARED TO EXIT 14S HEADING FOR TIVERTON ON ROUTE 24, LOOKED UP AND COULD SEE THE UFO ON MY LEFT HEADING FOR TIVERTON. THEN I NOTICED IT CROSS OVER ROUTE 24 TO THE OPPOSITE SIDE OF THE HIGHWAY ON MY RIGHT, IT SEEM TO HOVER THERE FOR A SHORT TIME. AFTER ABOUT 5 MINUTES I COULD SEE THE CRAFT ON MY LEFT JUST BEFORE EXITING ROUTE 24 AND ON TO ROUTE 138 MAIN ROAD. UPON ENTERING THE PARKING LOT AT THE COACHMAN I DECIDED TO PARK AS CLOSE AS POSSIBLE TO THE ENTRACE DUE TO THE EXTREMELY INCLEMENT WEATHER. I PARKED ABOUT 25 FEET FROM THE ENTRANCE IN THE DIRECTION OF THE RESTAURANT. I OPENED THE DOOR, LOOKED AT MY WATCH WHICH INDICATED 6:20 P.M. STEPT OUT AND LOOKED UP-TO MY ASTONISHMENT THERE BEFORE MY EYES AT A DISTANCE OF I HAD THIS TREMENDOUS FEELING OF BEING AT PEACE WITH MYSELF FOR SOME UNKNOWN REASON. A COUPLE OF MINUTES LATER MY GUEST DROVE INTO THE PARKING LOT. I RAN TO HER DOOR, OPENED IT AND TOLD HER TO LOOK UP AND SHE SAID, WHAT A BRIGHT STAR! I SAID, THIS IS A UFO. WE WATCHED FOR ANOTHER MINUTE BUT BECAUSE IT WAS SO COLD OUTSIDE WE RAN TO THE ENTRANCE. OUR TABLE WAS SITUATED IN THE BACK OF THE DINING ROOM FACING THE BAY WITH A DIRECT VIEW OF BRISTOL, LOOKING SOUTHWEST I COULD SEE THE LIGHTED MT. HOPE BRIDGE. WE LOOKED UP AND WE COULD SEE THE OBJECT, IT WAS IN CONSTANT OBSERVATION THROUGHOUT THE DINER MEAL. AT APPROXIMATELY 7:45 P.M. THE CRAFT MOVED ABOUT 100 FEET, BOTH OF US WITNESSED THIS ACTIVITY AND AND OF COURSE I STATED, DO YOU BELIEVE IN UFO'S NOW? SHE ANSWERED RATHER ABRUPTLY, I ALWAYS THOUGHT THIS WAS POSSIBLE BUT FIRMLY BELIEVE NOW. AT ABOUT 8:10 P.M. THE UFO MANEUVERED ITSELF STRAIGHT ACROSS TO BRISTOL, DISAPEARED, REAPPEARED AND STOPPED IN THE CENTER OF THE BAY FOR TEN MINUTES, THEN FINALLY LEFT OUR VIEW AT 8:20 P.M. IN THE DIRECTION OF BRISTOL. WE DEPARTED FROM THE COACHMAN AT 8:45 P.M., MY GUEST LEFT IN THE OPPOSITE DIRECTION AND I PROCEEDED TO AN APPOINTMENT ON THE MAIN ROAD. UFO EXPERIENCE (PHENOMENA) WEDNESDAY JANUARY 19, 1977 DECIDED WEDNESDAY NIGHT I WOULD ATTEMPT A REPEAT PERFORMANCE OF TUESDAY NIGHT BY DRIVING TO TIVERTON THEN TO MY SISTER'S HOME IN PORTSMOUTH. WITH CAMERA & BINOCULARS I LEFT MY PARENTS HOME FOR TIVERTON AT 6:40 P.M. WHILE DRIVING ON 195 EAST TO ROUTE 24 SOUTH AT APPROXIMATELY 7:00 P.M., THE UFO WAS NOW TRAVELLING ON MY LEFT AND TRAVERSING BACK & FORTH OVER THE HIGHWAY. I DID NOT EXIT THE COACHMAN ROUTE 138 BUT INSTEAD CONTINUED TO PORTSMOUTH AND LOST ALL ACTIVITY AT THIS POINT. THURSDAY JANUARY 20, 1977 AT 8:15 A.M. WHILE WAITING FOR A BUS TO PROVIDENCE I FELT A SHARP PAIN ON THE RIGHT SIDE OF MY FOREHEAD. THIS CONDITION CONTINUED UNTIL LUNCHTIME AT 12:00 P.M. WHEN I FELT NAUSEATED AND DELAYED MY LUNCH FOR FORTY MINUTES UNTIL IT SUBSIDED. WENT TO LUNCH AT 12:40 FEELING A LITTLE DIZZY, THIS PERSISTED UNTIL 2:30 P.M. THAT DAY. I UNDERSTAND AFTER CLOSE CONTACT OR EXPOSURE THIS REACTION CAN OCCUR. FRIDAY JANUARY 21, 1977 IT WAS A VERY CLOUDY NIGHT AND AT 6:25 P.M. ON ROUTE 24 SOUTH TO PORTSMOUTH, I NOTICED IN NORTH TIVERTON, ON MY RIGHT ABOVE THE CLOUDS, THIS BRIGHT LIGHT MOVING ACROSS THE HIGHWAY TO THE OPPOSITE SIDE AND HOVERED THERE. I CONTINUED TO PORTSMOUTH. TUESDAY JANUARY 25, 1977 THIS WAS A CLEAR NIGHT AT 7:35 P.M. ON ROUTE 24 SOUTH TO MAIN ROAD TIVERTON FOR AN APPOINTMENT, MY FATHER & I NOTICED AT A DISTANCE OF ABOUT 1500 FEET IN THE SKY, A BRIGHT STAR (UFO) HOVERING FOR A FEW SECONDS THEN IT COMPLETELY VANISHED. THIS SUMMERIZES MY UFO EXPERIENCES FOR THE PAST TWO WEEKS. IN EVERY SIGHTING INDICATED WITHIN THIS REPORT I NEVER SAW THE METALLIC PORTION OF THE UFO, THE CRAFT WAS ALWAYS ENGULFED COMPLETELY WITH A WHITE GLOW I MUST SAY THAT IT HAS BEEN A FANTASTIC EXPERIENCE AND OF COURSE I LOOK FOWARD TO THE FUTURE WITH GREAT ANTICIPATION. SINCERELY YOURS,"],"Sighting Duration":"Undisclosed","Latitude":"41.659854","trends":["There have been 2 other sightings in Fall River","There were no other sightings in Fall River on or around January 17th 1977","This sighting has never been favorited.",""],"Date of the Event":"01/17/1977 05:45 UTC","Summary":"ABOUT 150 FEET IN THE SKY GLOWING WHITE OVAL SHAPED OBJECT BRIGHTER THAN A FLUORESCENT LIGHT, IT HOVERED WITHOUT MOVING OR MAKING A SOUND.","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Tags":"City","Region":"Rhode Island","Longitude":"-71.191333","map":"<A HREF = \"http://maps.google.com/maps?q=41.659854,+-71.191333(30629)&iwloc=A&hl=en\"> mufon case (30629) map </A>","files":["/var/www/straped/mufon/html2text/30629.html.txt","/var/www/straped/mufon/org/30629.html"],"Viewing Distance":"21-100 Feet, Over 1 Mile","Date Submitted":"08/09/2011 12:23 UTC","Country":"United States"}