{"Summary":"just like the film, close encounter mush the same.","Sighting Duration":"00:04:00","Region":"","Log Number":"IE-08082011-0070","Source":"MUFON","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/30624.html.txt","/var/www/straped/mufon/org/30624.html"],"Tags":"City","Latitude":"54.612711","Longitude":"-5.931883","trends":["There have been 11 other sightings in Belfast","There were no other sightings in Belfast on or around November 24th 1973"],"Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=54.612711,+-5.931883(30624)&iwloc=A&hl=en\"> mufon case (30624) map </A>","Case Number":"30624","City":"Belfast","Weather Factors":"Unknown","Object Features":"Dome","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI live in Belfast on the east coast of Ireland,i live in a street of terrace homes the street is about half mile long,on my way home one night in late november 1973,as i got near my home my neighbour was standing at her door,she said,to me what is that in the sky above the houses,well my GOD,the sight of this thing in the sky,it was unreal massive it was beautiful,i only seen the back quarter of it witch was massive it cover a good part of the street,cant understand how i did not see it walking home.It was a good clear night & the sight of it just sitting there hanging in the sky.It was kind of hollow underbelly with dim lite lights & the same around the out side like portholes,i seen a small bit of it so what size was it.After about five minutes it shot of north wards in the blink of the eye.It was like that spacecraft in close encounters. PS,from that time,i have seen cigar shape,,& the flashing lights matter of fact the lights followed me for a few days it put on a display of shooting up & down growing larger then shrinking,i was driveing a school bus at the time and all the kids saw this to."],"Object Flight Path":"Stationary","Date of the Event":"11/24/1973 10:20 UTC","Disposition":"Unresolved","Date Submitted":"08/08/2011 01:38 UTC"}