{"map":"<A HREF = \"http://maps.google.com/maps?q=35.140922,+-106.517593(30621)&iwloc=A&hl=en\"> mufon case (30621) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/04/2011 08:26 UTC","Country":"United States","Longitude":"-106.517593","Disposition":"Insufficient Data","divs":["Sighting DetailsWow..I wish I would have known about this site over a year ago.I was flying home from California having returned my disabled son home to the Bay Area and his mother.Return flight flew over ?Albaquercie? New Mexico (Northwest airlines...maybe southwest airlines from Oakland CA to Hobby Airport in Houston TX). I know this because the pilot announced the altitude and location moments before the sighting.The girls (2) in the seats in front of me were napping having \"partied\" in California.And the flight was not a full flight.I had tried to sleep....but usually cant sleep well on flights.After the pilot made his announcement , I raised up from a laying position having taken up at least 2 seats....more than likely 3..........and I was now sitting in the window seat and looking out of the window (window faced north). It was very pretty and it was before sunset........as the plane flew.......minutes passed......when I observed in detail a large silver sphere hovering stationary at about 35 thousand feet approximately. Well....obviously lower because we flew at 35k feet.Id say it was the size of a small office building. Maybe a ten story building.....in diameter if one can describe a sphere in that fashion.I witnessed this thru my window and the window in the seat behind me as I instinctively jumped up to follow it in my line of sight.It was not a plane. Not a balloon.Not any publically know aircraft. It was very large though. After seeing this....I questioned my sanity for a brief moment. I thought about questioning the pilot upon departing the plane....but I knew better.(There is no way they could have not seen it on a radar......or thru their main window....it was too large to miss.) Knowing the truth will come out eventually.I distinctly observed \"panelling\" on the surface of the sphere. Large panels.....not like those on a plane, etc.We had to be flying at several hundred miles an hour......but I did see it for enough of a time to discern details.Um...what was it? I have no damn idea.But.....it was not something one sees in a typical lifetime. This I know for sure.Hope it helps and sorry I couldnt spell the name of the city.However, I think you can decipher the name.Thanks for your time.True story.No deception.Not misleading."],"Date of the Event":"01/31/2010 12:00 UTC","Object Shape":"Sphere","Sighting Duration":"Undisclosed","trends":["There have been 129 other sightings in Albuquerque","There was one other sighting in Albuquerque on or around January 31st 2010"],"Case Number":"30621","Latitude":"35.140922","files":["/var/www/straped/mufon/html2text/30621.html.txt","/var/www/straped/mufon/org/30621.html"],"Object Flight Path":"Stationary","Tags":"City","Weather Factors":"Unknown","City":"Albuquerque","Region":"New Mexico","Object Features":"Patterned Surface","Summary":"silver globe hovering over new mexico observed from flight to texas 35000 ft approx.","Log Number":"US-08042011-0049","Source":"MUFON"}