{"divs":["Sighting DetailsI was in Key Largo with my son shark fishing from a dock at the hotel we were staying at around 11:00pm, the Seafarer Hotel in Key Largo. There were 2 adult women and 2 other children there as well. We had just put some dog food into the Gulf of Mexico water for chum, and placed 2 fishing baits into the water. After getting all set up, he and I laid down on the dock and were staring at the sky looking for satellites. We spotted one almost immediately crossing the sky directly over head. A few minutes later my son hooked a 4+ foot Lemon shark and successfully got it up the dock. We released it, reset the bait and cast the rod out into the water. Again, I lay down on the dock to see if I could spot another satellite for my son and spent probably 30 minutes starring at the Zenith of the sky with no success. It was very clear with a cloud now and again floating by. Suddenly from my left (the west south west) I saw a large, quick moving object shaped like a Chevron, making absolutely no sound, fly right across my direct vision, blocking the star light as it passed, and having what I think were maybe 5 or 6 white lights that were not blinking and ran along the bottom of the object. I immediately jumped to my feet, pointed at it and started to yell to everybody to take notice... It moved quickly, steadily not changing speed or direction and completely soundless, and it was out of my view in probably 5 to 7 seconds -- but it was as real as anything I have ever seen. I was in total amazement. One of the other children there said he had seen it and my son said he caught view of it as it disappeared to what would have been the far right or the north easterly sky."],"City":"Key Largo","Date Submitted":"08/08/2011 02:59 UTC","Log Number":"US-08082011-0088","Region":"Florida","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=25.08554,+-80.439164(30638)&iwloc=A&hl=en\"> mufon case (30638) map </A>","files":["/var/www/straped/mufon/html2text/30638.html.txt","/var/www/straped/mufon/org/30638.html"],"Source":"MUFON","Disposition":"Unresolved","Date of the Event":"08/03/2011 12:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Chevron","Object Features":"None","Case Number":"30638","Country":"United States","Viewing Distance":"Unknown","Longitude":"-80.439164","Object Flight Path":"Straight-line path","Summary":"Boomerang Chevron shape not rounded but straight edges and sharp corners","Latitude":"25.08554","trends":["There have been 4 other sightings in Key Largo","There were no other sightings in Key Largo on or around August 3rd 2011"],"Weather Factors":"Unknown"}