{"Source":"MUFON","Country":"United States","divs":["Sighting DetailsThis was a long time ago but I have never forgotten it. I was coming home from work, I left work at approximately 3am. I was nearing my house begining to go up a very steep hill when I saw what I thought was the moon in my rear view mirror. As I started up the hill the object became larger I felt very afraid for some reason and I thought it was chasing me so I went faster, the last thing I remember was approaching the middle of the hill. The next thing I remember, I was at the top of the hill and my car was stopped but still running. There were about 6 or 7 small children standing in front of my car laughing at me then they ran off into the woods, I could see they were naked. I remember thinking it was odd that a group of children would be in the middle of the street naked at 4am. When I arrived home the sun was up I am not sure what time it was but the entire drive should have taken 20 mins and it was summer the sun doesn't come up till after 5 am. The beings I saw only came to about a head over my cars hood I thought they were 5 or 6 years old. I still shake when I think about this experience and I still don't know why."],"Viewing Distance":"Unknown","Summary":"little child like beings standing in fron of my car","Case Number":"30636","Latitude":"41.142783","Disposition":"Unknown","Date of the Event":"06/01/1973 04:00 UTC","Object Shape":"Sphere","Tags":"City","Sighting Duration":"01:00:00","City":"Fairlawn","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Fairlawn","There were no other sightings in Fairlawn on or around June 1st 1973"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.142783,+-81.62113(30636)&iwloc=A&hl=en\"> mufon case (30636) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/30636.html.txt","/var/www/straped/mufon/org/30636.html"],"Region":"Ohio","Log Number":"US-08042011-0063","Weather Factors":"Unknown","Date Submitted":"08/04/2011 10:06 UTC","Longitude":"-81.62113"}