{"map":"<A HREF = \"http://maps.google.com/maps?q=28.146538,+-81.435415(30639)&iwloc=A&hl=en\"> mufon case (30639) map </A>","Object Flight Path":"Stationary","Longitude":"-81.435415","Object Features":"Unknown","Object Shape":"Unknown","divs":["Sighting DetailsWhile sitting on my back screened in portch with my wife and adult son, we all at 9:35 p.m. saw in an instant approximately a mile or more away at approximately one o'clock position saw a very bright round self illuminated object which was very bright amber in color with a single large red light clearly visable on top. It appeared with no movement hovered and simply blinked out. My wife and son and I all then looked at each other and said, what the hell was that?, I have seen many airplanes from Orlando International in the past and an aviation buff, flight simulator etc. and know that this was not an airplane. My son to confirm this thought that may be it was an airplane that cut through the clouds, he went out in the yard and there were no clouds, I have seen thousands of flights incoming over many years and know of all the required FAA lights that are required, this object had no blinking lights and they were to bright and of the wrong color to match any conventional lights as I stated I have ever seen. In addition, you can easily hear cessna 172 type airplanes that I have seen from here from further distances. The sighting was due west between Poinciana and Haines City, Florida. I believe it was over the Lake Marion area next to much rural wild life management areas. I am an active sky watcher and am 51 years old have seen many meteorites and many fireballs, three last year in fact that were spectacular, this matches nothing I have ever seen in my life. The sighting as stated, lasted for about 6-10 seconds, enough time for all of us to notice it and look at each other and then look back and it did not appear to accelerate it simply appeared to implode into itself and simply blink out without a sound, no trail etc."],"Case Number":"30639","Latitude":"28.146538","Source":"MUFON","Weather Factors":"None","Viewing Distance":"Over One Mile","Date Submitted":"08/06/2011 01:33 UTC","Summary":"intense amber round orb or craft with very bright red light on top witnessed by my wife, my son, I.","Log Number":"US-08062011-0046","trends":["There have been 18 other sightings in Kissimmee","There were no other sightings in Kissimmee on or around August 3rd 2011"],"Region":"Florida","Sighting Duration":"00:00:10","Date of the Event":"08/03/2011 09:35 UTC","City":"Kissimmee","Country":"United States","Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/30639.html.txt","/var/www/straped/mufon/org/30639.html"]}