{"Object Flight Path":"Stationary,Other","Viewing Distance":"21-100 Feet, 101-500 Feet","Country":"United States","Object Shape":"Flash, Star-like, Unknown","Region":"Texas","Summary":"UFO hotspot? 2nd UFO sighted in Wimberley, TX LESS THAN ONE MILE AWAY FROM THE LAST ONE SPOTTED HERE","Disposition":"IFO","Longitude":"-98.09567","files":["/var/www/straped/mufon/html2text/30633.html.txt","/var/www/straped/mufon/org/30633.html"],"Date Submitted":"08/04/2011 04:43 UTC","Case Number":"30633","Sighting Duration":"Undisclosed","Log Number":"US-08042011-0038","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.002126,+-98.09567(30633)&iwloc=A&hl=en\"> mufon case (30633) map </A>","divs":["Sighting DetailsThis is my follow up to another report I just submitted. In my first report I was standing on a property line when I was watching a UFO, well, about a week and a half later I was standing 15 yards from that property line facing the other direction when me and my friend, a wall sitting skeptic, saw a star, slightly lower and brighter than other the other stars, that was flickering and changing colors dramatically in the tree line, we could see it between the green of some trees but it's background was still the night sky. I had recently downloaded SkyView, the app that let's you hold up your phone and look up specific stars, planets, and satellites, but it wouldn't calibrate and I couldn't use it. The light on the \"thing\" was flickering, seemingly randomly, in different colors; white, red, and a blueish-green-turquoise color. I took the case off of my iphone and tried SkyView again and it worked perfectly. It was sitting right where Scorpio's head is, but I couldn't see any other star of Scorpio and I was still suspicious. It was blinking so fast it was hard to tell anything about it. After a little bit of time it started to move calmly but violently in different directions (up, down, slinging from point to point very quickly in a small area, but kept a base in the spot). My friend and I got into his car, which we were standing very close to already, and drove up the street about 80 yards (towards the light, though, it was out of sight) where the road turns right. We went up the road about another 30 yards and took a left. Went another 20 yards or so and pulled into a public parking lot. We got out and tried to find but couldn't at first. I walked around in the lot trying to get a glimpse when I spotted it way closer to the ground than either of us had thought. It was over a clearing with a few small houses and a close to dried up creek, probably 20 yards from that first right turn we made. We drove back to my house and had to stand further back than we did earlier to see it, as it had either dropped or moved away. We lost track of it soon after, we couldn't see it at all. I submit these reports because I've had 2 different experiences VERY close to me in less than 2 weeks. I've had 2 other instances in the last last 7-8 months, but neither of those was this close to me."],"Latitude":"30.002126","Object Features":"Unknown","Tags":"City","Date of the Event":"08/01/2011 11:30 UTC","City":"Wimberley","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Wimberley","There were no other sightings in Wimberley on or around August 1st 2011"]}