{"Log Number":"US-08052011-0049","Weather Factors":"Unknown","Region":"Washington","Object Shape":"Circle, Fireball","Case Number":"30645","Disposition":"IFO","Object Features":"None","City":"Mill Creek","Longitude":"-122.185331","Date Submitted":"08/05/2011 12:23 UTC","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Mill Creek","There were no other sightings in Mill Creek on or around July 31st 2011","This sighting has never been favorited.",""],"Summary":"2 sets of 3 glowing orange circular objects---- 2 VIDEOS!!!","Date of the Event":"07/31/2011 09:43 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/30645.html.txt","/var/www/straped/mufon/org/30645.html"],"Source":"MUFON","divs":["sighting detailswe were driving home from a friends wedding in snohomish wa. it was about 9:40pm 07\\31\\2011, when i noticed some lights through some trees. we were driving west on 132nd towards mill creek, wa just past 35th. as we passed the trees the view was then clear. we saw 3 orangeish redish pulsating circular objects. we pulled the car over and got out our digital camera and took some viedo. the ojects seemed to be made of light. then light would surge from time to time. they were not flying perfetly in sync, they would alternatly speed up and slow down but maintain elevation. their movements were very fluid and smooth. there was no noise what so ever. then one at a time they zoomed off and disappeared. we stopped recording and started discussing what we had just saw. very frusterated that all these cars were just driving right past, no one was stopping to watch. then to our surprise we looked back to the nw wherethe objects had come from and there were 3 more of the same objects heading in the same direction. we fumbled around trying to find the camera in the car and when i started the second video i was recording from behind the wind sheild i handed off the camera to my boyfriend who then record from outside the car. right after he gets focused on the lights you can see one of them move very quickly away from the other and then move slightly back towards it. unfortunately we were not able to catch most of the second wave on camera. it was a very strange event espesially because we were lucky enough to have some daylight left so it was clear that these lights were not attached to any sort of aircraft."],"Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Latitude":"47.877969","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.877969,+-122.185331(30645)&iwloc=A&hl=en\"> mufon case (30645) map </A>"}