{"Object Flight Path":"Path with directional change","Region":"Florida","Longitude":"-82.2674","Date Submitted":"08/06/2011 07:10 UTC","Viewing Distance":"Unknown","Latitude":"29.432261","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/30642.html.txt","/var/www/straped/mufon/org/30642.html"],"Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.432261,+-82.2674(30642)&iwloc=A&hl=en\"> mufon case (30642) map </A>","Log Number":"US-08062011-0082","Object Shape":"Boomerang, Triangle","City":"Micanopy","Weather Factors":"Unknown","trends":["There has been one other sighting in Micanopy","There were no other sightings in Micanopy on or around August 2nd 2011"],"Tags":"City","Case Number":"30642","Summary":"Noticed amber light in sky, thought was plane, but light pattern was very different, ship seemed very large, triangular. Moved sideways, then forwards over our farm and house and disappeared.","Date of the Event":"08/02/2011 04:00 UTC","divs":["sighting detailsit was 4 am and i was laying awake in the front room of our house. i noticed an amber light in sky, first thinking it was the moon, then when i saw it moving, a plane. stepped outside to get a better look. from what i could make out, object looked very large, triangular in shape,with two amber colored lights with two beams stretching away from them with two beams stretching away from each of them on each side. the lights were all the same amber\\golden color. the object made a slight \"hum\" sound. i witnessed the object move sideways, then forwards. it flew realitively slowly over our horse farm and over our house. light pattern remained the same. once object was past our house. light pattern changed to only 3 solid amber lights and then the object disappeared from sight. i am a pilot and can identify planes flying at night. there was no indication that this was a plane of any kind, nor was it a helicopter. there was hardly any sound at all. i kept thinking that if i watched it long enough i'd figure out what it was, so did not run in to get camera. this was unlike anything i have ever seen."],"Object Features":"Unknown","Sighting Duration":"Undisclosed"}