{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.858414,+-116.943935(30652)&iwloc=A&hl=en\"> mufon case (30652) map </A>","Date of the Event":"05/20/1994 12:00 UTC","Latitude":"32.858414","Sighting Duration":"Undisclosed","Date Submitted":"08/05/2011 01:20 UTC","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30652.html.txt","/var/www/straped/mufon/org/30652.html"],"Disposition":"Unknown","Tags":"City","Object Flight Path":"Path with directional change","Case Number":"30652","Longitude":"-116.943935","Summary":"Craft descended/hovered/ascended/no noise. Was spherical/ball shaped. Looked like windows&hanger bay.","Object Features":"Window(s), Other","Log Number":"US-08052011-0057","Object Shape":"Oval, Sphere","Viewing Distance":"Unknown","divs":["sighting detailsi was at that time a police officer of 6 years, had a commercial\\instrument pilots license with approx. 400 hours\\majority of time flying southern ca, and was a 10 year navy veteran whom had seen all navy aircraft and majority of air force planes. i went outside my motorhome at approx. 7 am to walk my dog. it was overcast with very fine mist. i always looked at el cajon mountain. i could see the approx. lower two thirds of the mountain. while i was looking at the mountain i saw an unknown craft descending through the overcast. from what i could see, it looked like i could see approx. one fifth of a spherical object. it was tannish brown in color. i could see what looked two levels of what looked two windows and a hanger deck off set from each other. the part of the craft i could see blocked out one third of el cajon mountain. i could see a partial shadow of the craft. the craft hovered for approx. two minutes. it then slowly ascended. throughout the sighting i could hear no sound from the craft. the craft looked like no flying object i had ever seen and behaved like no plane or hot air balloon. i lost sight of the craft when ascended above the overcast level. i was awe struck at the sight and size of the craft. i could not believe that a craft of that size could move so gracefully and quietly."],"Region":"California","trends":["There have been 5 other sightings in Lakeside","There were no other sightings in Lakeside on or around May 20th 1994"],"City":"Lakeside"}