{"Weather Factors":"Unknown","City":"Baker","Longitude":"-91.168163","Summary":"I've been seeing Orb-UFO's do strange things over my home ever since I purchased this laser.","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","Object Features":"Unknown","divs":["sighting detailsi've been seeing orb-like ufo's nearly every night ever since i purchased a 200mw green laser from an online source. it started about one year ago when i received my laser in the mail. i was showing the kids how to play with the cats and how it looks like a star wars light saber. we went outside to shine it in the sky at around 8:00 pm. the moon was out and my older son asked me if the laser would shine to the moon which was towards the west, so i shined it to the moon. then he asked me to shine it at a star so i shined it at a star which was towards the east. then i began to playfully shine it at the ground studying the effect of the beam because it was new to me and i never used a laser before. then out of nowhere my son (who is 8 years old) yells out \"dad! what is that\"?! i turned to look up to see what he was looking at. there in the sky, was a very slow moving extremely bright white light just above the tree line. it was moving from north to south and crossed exactly over the path of where i had just directed a laser beam at the moon. when i realized this i turned to see if something might be in the path of the other beam that i directed towards the star and behold, there was another one moving the same direction, parallel, and at the same rate of speed (very slow, almost a hover). well, i became so frightened that i yelled to the kids to get in the house. my two sons and i ran swiftly to the door, and as i got the kids in the house i turned and watched the two craft join up\\ meet together just above the tree line and wink off as if they had their hands on a dimmer switch or something. gone! ever since that night, nearly every night, i have been seeing, with the unaided-eye, bright balls\\ orbs of light at all altitudes, intensity, speeds and quantity ranging from tree-line to edge of the atmosphere coming and going in every direction. on several occasion the \"craft\" appeared or materialized precisely where i aimed my laser beam. it stopped\\ hovered and gradually got so bright that i thought it was shooting straight at me, then suddenly disappeared. on other occasions i witnessed unusual, inconsistent, extremely bright, bi-location strobing of two \"craft\" perfectly synchronized. i'v seen twice now \"unusual\" meteor-like objects that do not fall, but rise at a gradual angle and zip by at a perfectly parallel trajectory with the ground. one of these incidences originated from the strobe-like \"craft\". finally, i have been experiencing episodes of sleep paralysis which is quite terrifying. when i'm outside, i seem to be able to \"feel\" when one of these \"craft\" are near and\\ or visible. until this past year, i was never afraid of anything except for maybe nuclear war. since i was a young boy i would always go camping, biking and hiking alone until last year. now i only go within arms reach of the front door to see the very thing that frightens me the most. ufo's"],"Disposition":"Insufficient Data","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.588243,+-91.168163(30666)&iwloc=A&hl=en\"> mufon case (30666) map </A>","files":["/var/www/straped/mufon/html2text/30666.html.txt","/var/www/straped/mufon/org/30666.html"],"Log Number":"US-08052011-0076","trends":["There have been 5 other sightings in Baker","There were 2 other sightings in Baker on or around November 30th 2009"],"Date of the Event":"11/30/2009 12:00 UTC","Latitude":"30.588243","Case Number":"30666","Sighting Duration":"Undisclosed","Date Submitted":"08/05/2011 05:45 UTC","Object Shape":"Bullet, Missile, Circle, Flash, Sphere, Star-like","Region":"Louisiana","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Tags":"City"}