{"Longitude":"-88.420657","Tags":"City","Weather Factors":"Unknown","Date Submitted":"08/05/2011 05:22 UTC","Sighting Duration":"00:00:10","Latitude":"33.494908","Log Number":"US-08052011-0074","Viewing Distance":"101-500 Feet","Region":"Mississippi","files":["/var/www/straped/mufon/html2text/30669.html.txt","/var/www/straped/mufon/org/30669.html"],"Object Features":"Unknown","Country":"United States","Summary":"Strange Light Flashing in Sky","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.494908,+-88.420657(30669)&iwloc=A&hl=en\"> mufon case (30669) map </A>","City":"Columbus","trends":["There have been 2 other sightings in Columbus","There were no other sightings in Columbus on or around July 31st 2010"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsA fire alarm had just gone off in the dorm. All the people in the dorm had to go outside, for a fire drill. I was groggy, having just been woken up. I was standing in a parking lot, looking up at the sky, waiting for the dorm staff to give us the o.k. to go back in. While looking up, I saw this quick flash of light, going up. It was pink and green and white. It was traveling in a straight line, going up, almost like it was leaving. The light looked like a tail of something, like of a moving object. It was really quick, but really bright and visible against the night sky. I had no idea what the strange light was, other than a possible UFO. Several other students saw it as well, and they were just as confused as I was as to what it was. No one really talked about it the next day, but I remember thinking that it was pretty and mysterious and weird when I saw it. There was no noise with the lights, so it wasn't fireworks. We were near train tracks, but those lights are solely red, and make a lot of noise. Every possible explanation as to what it was hasn't explained it."],"Date of the Event":"07/31/2010 12:00 UTC","Case Number":"30669","Source":"MUFON","Object Shape":"Bullet, Missile"}