{"Latitude":"34.898966","Object Flight Path":"Stationary","Date Submitted":"08/06/2011 01:42 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/30664.html.txt","/var/www/straped/mufon/more/30664_submitter_file1__IMG_7569.jpg","/var/www/straped/mufon/more/30664_submitter_file2__IMG_7570.jpg","/var/www/straped/mufon/more/30664_submitter_file3__Screen.jpg","/var/www/straped/mufon/org/30664.html"],"Region":"California","Summary":"Cigar-shaped UFO in the desert","Date of the Event":"05/24/2011 09:33 UTC","divs":["Sighting DetailsMy girlfriend and I were staying in a Hotel in Barstow overnight as we made our way along Route 66 to Needles. We were in the back of the parking lot of the hotel watching the sunset and talking when I noticed this dark cigar shaped object sitting motionless in the sky. Fortunately I had a camera with me and the lens was a 70-200 mm zoom that allowed me to look at the object closer . I also shot a few frames of the object. At first the object was pretty large but seemed to be slowing getting smaller. I did shoot 3 frames of the object over a 1-2 min period and you can see the object has changed shape in a short length of time. Additionally I noticed that there seemed to be many small objects directly above the large object. These smaller objects seemed to be moving in a excited state like boiling water. They are very faint and are very close to the primary object. You can just make them out in the enlarged sections I have pasted on the main photo. Very interesting to watch them. I just wish I had shot more photos. My girlfriend and I did observe the object slowly dissipate to nothing but it did keep the general shape of a cigar to the end. Later I got to thinking about the object and the proximity of the object to Edwards AFB in California. I have included a map that will show you my approximation based on the sunset and the location of the hotel I was staying. I guess I have triangulated the possible position of the object based on my location and the sunset and the position of the object in relation to the sunset. Needless to say this observation contributed greatly to our the adventure of traveling in the desert on Rt 66."],"Viewing Distance":"Over One Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.898966,+-117.008453(30664)&iwloc=A&hl=en\"> mufon case (30664) map </A>","Weather Factors":"Unknown","Country":"United States","City":"Barstow","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Other","Log Number":"US-08062011-0046","Disposition":"IFO","Case Number":"30664","Object Features":"None","trends":["There have been 11 other sightings in Barstow","There were no other sightings in Barstow on or around May 24th 2011","This sighting has never been favorited.",""],"Longitude":"-117.008453"}