{"map":"<A HREF = \"http://maps.google.com/maps?q=32.275608,+-107.75537(30663)&iwloc=A&hl=en\"> mufon case (30663) map </A>","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Oval","Log Number":"US-08052011-0071","Latitude":"32.275608","Case Number":"30663","Longitude":"-107.75537","Country":"United States","Object Flight Path":"Unknown","Region":"New Mexico","Date of the Event":"04/21/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/30663.html.txt","/var/www/straped/mufon/more/30663_submitter_file1__100_2133.JPG","/var/www/straped/mufon/org/30663.html"],"Sighting Duration":"Undisclosed","Summary":"Deming NM realtor takes photos of property for sale and later observes an anomoly while reviewing photos.","Date Submitted":"08/05/2011 05:06 UTC","Weather Factors":"Unknown","Object Features":"Unknown","trends":["There have been 17 other sightings in Deming","There were no other sightings in Deming on or around April 21st 2011","This sighting has never been favorited.",""],"Disposition":"Unknown","divs":["Sighting DetailsOn April 21, 2011 I met with a realtor in Deming, New Mexico for the purpose of listing 1.5 acres for sale in the Florida mountains. The property is approximately 10 miles southwest of Deming, NM on Coyote road and the coordinates are as follows: N32◦10.505' W107◦38.523'. I visited the realtor in her office on the morning of April 21 and she then traveled to the property that afternoon for the purpose of taking photographs. The photos are used in promotional material for property sales. After returning to the Deming office, the realtor downloaded the photos and then went home to fix dinner. Following dinner she reviewed the photos, saving some and rejecting others. This is when she discovered the photo containing the anomaly. She saved that photo, but did not use it in any of the sales material. She did not see the see the anomaly while taking photos of my property and only saw it when reviewing the photos later at home. She tells me that she heard no noise while taking the photos. Yesterday, August 5, 2011, I visited the realtor in her office for an update regarding the sale of my property. It was during this meeting with her that she showed me the photo, saying that she did not include it in the sales material. I then asked that she email the photo to me and I asked that she not share it with anyone. She told me that she has not given the photo to anyone. I asked if I may use her name in the event someone wanted to speak with her about the photo and she agreed. The details of the photo included with this statement is as follows: The photo is looking due south at the Florida mountains (BLM land). The fence runs along Coyote road, which is not seen in the photo. My property is just north of the fence. The object may be seen in the photo just to the right of center and directly above the eroded peaks of the Florida's. The object appears to be oval with a shaded underbelly and a silver or light colored top that may be reflecting the sun. One must zoom in in order to see the object more clearly. Over zooming, however, will pixelate the object and washout any resolution. The photo is untouched and is in precisely the same state as it was given to me by the realtor."],"Source":"MUFON","City":"Deming"}