{"Log Number":"US-08072011-0046","Longitude":"-105.022784","divs":["Sighting DetailsMe and my gilrfriend were parked on a mesa we were looking at the sandia mountains. We noticed some very strange lights at the base of the mountains. The lights were moving right then left up, and down. We sat there for a couple of hours just watching.I then decided to drive to the base of the mountains witch took about 30min from were we were. By the time we got to where we thought we saw the lights the sun was coming up. We drove through the streets in that area and noticed that parts of the streets looked like they had been melted and the shruds on the side of the streets were smushed down in a circlar shape.The green city electrical boxes you see on the side of streets were blown apart but had no sign of a fire or explosion. As we were driving we noticed every 5 or 6 houses people were packing there cars with luggage and seemed to be very worried about something. I then took my girlfriend home. So at 2:00am we took a drive back to the same place and parked the car on the side of the road at the base of the mountains. Not but10min little orbes of light would blink on and off through out the feildes of shrub we were parked by. There was an energy that i have never felt before it was if every hair on my body was sticking straight up and i felt so alive. I continued to go to the base of the mountains for several week every night and saw the same thing. Government vehicales (vans) would be parked at the top of my street. The local news stated if you see anything weird in the sky the military is testing weather bollons.If you need more information e-mail me. Thank you."],"Date of the Event":"09/10/1997 03:00 UTC","Sighting Duration":"03:00:00","Object Shape":"Circle","Latitude":"34.98032","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.98032,+-105.022784(30676)&iwloc=A&hl=en\"> mufon case (30676) map </A>","Source":"MUFON","Object Features":"Unknown","Region":"New Mexico","Disposition":"Insufficient Data","Case Number":"30676","files":["/var/www/straped/mufon/html2text/30676.html.txt","/var/www/straped/mufon/org/30676.html"],"Viewing Distance":"21-100 Feet","Summary":"Orbes of light surrounded my car. City elictrical boxes in that neigbor hood were destroyed the streets were melted in stops mail boxes were torn apart. After a few weeks of this governmet vehicles would follow me and park down my street.","Weather Factors":"Unknown","trends":[],"City":"Undisclosed","Tags":"City","Object Flight Path":"Path then hovering","Date Submitted":"08/07/2011 01:13 UTC"}