{"Date Submitted":"08/06/2011 10:53 UTC","Latitude":"29.146248","trends":["There have been 2 other sightings in Cedar Key","There were no other sightings in Cedar Key on or around July 15th 2011"],"Case Number":"30671","Longitude":"-83.031881","map":"<A HREF = \"http://maps.google.com/maps?q=29.146248,+-83.031881(30671)&iwloc=A&hl=en\"> mufon case (30671) map </A>","Object Shape":"Flash, Sphere, Star-like","City":"Cedar Key","Tags":"City","Disposition":"Unresolved","Weather Factors":"None","Sighting Duration":"00:00:20","Source":"MUFON","Country":"United States","Region":"Florida","divs":["Sighting DetailsWe were out on our nightly walk in the tiny Gulf town of Cedar Key, Florida. We were both looking out over the Gulf of Mexico when we saw two very bright flashing lights appear. They seemed to be a couple of miles away, over the water, and moving fast toward each other. I should note that these lights were low over the water, maybe 100 to 200 feet, and much brighter than any airplane lights I've seen. They seemed to be moving at a steady speed, and when they approached each other, the one moving West didn't seem to slow or change coarse. The one moving East however, immediately reversed it's direction without slowing down, and joined the other, moving West right beside it until we could no longer see them (because of trees and a building between us and the water). After taking a few minutes of excited talk about what in the world they could have been, and wondering how anything could move that fast and just change direction, we had no choice but to accept the possibility that they may have not been from \"around here\". We now look for them every time we walk, with anticipation of another encounter!"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Date of the Event":"07/15/2011 12:00 UTC","Summary":"Two bright flashing lights moving quickly , from opposite directions, maybe a mile or two away. When they met, the one moving east quickly changed direction.","Object Flight Path":"Path with directional change","Object Features":"Unknown","Log Number":"US-08062011-0035","files":["/var/www/straped/mufon/html2text/30671.html.txt","/var/www/straped/mufon/org/30671.html"]}