{"Object Features":"Unknown","Summary":"Small basketball sized object moving quickly 40 or so ft from the ground.","Region":"Massachusetts","City":"Ashland","Country":"United States","Longitude":"-71.474571","Weather Factors":"Unknown","divs":["Sighting DetailsI was outside on my deck (2 stories up), and noticed an object moving perfectly straight (West), rather quickly. Upon observation I realized it clearly wasn't a bird. I ran inside and grabbed my camera just to zoom in on it for a closer look. In less than 15 seconds (I'm an amateur photographer so my camera was close by), I came back out and got 1 pic before running out onto my front lawn to try to get another one. I watched it disappear into a cloud before I could do so. Within 5 mins the sky was extremely darkened by very odd and dark clouds. I noticed 2 small flashes of light which I took to be the coming of a thunderstorm, though it never materialized. I thought perhaps the object was a balloon, but it wasn't very windy out, and in my experience balloons generally move rather erratically, following the direction of the wind,not perfectly straight at the same speed. I think perhaps it was some sort of environmental monitor (I live within a mile of an EPA Superfund site), but I thought I would share regardless since I've never seen anything even remotely resembling it. After the sun set there were several helicopters in the general area which may be unrelated, I see those often near the EPA site, but usually just one."],"Object Shape":"Cone","Latitude":"42.26187","Log Number":"US-08052011-0086","trends":["There has been one other sighting in Ashland","There were no other sightings in Ashland on or around August 2nd 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=42.26187,+-71.474571(30675)&iwloc=A&hl=en\"> mufon case (30675) map </A>","Source":"MUFON","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Case Number":"30675","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Date of the Event":"08/02/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/30675.html.txt","/var/www/straped/mufon/more/30675_submitter_file1__ashlandforest626.jpg","/var/www/straped/mufon/org/30675.html"],"Date Submitted":"08/05/2011 08:22 UTC"}