{"Case Number":"30683","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.27716,+-119.224345(30683)&iwloc=A&hl=en\"> mufon case (30683) map </A>","Tags":"City","divs":["sighting detailsmy wife and had just arrived home and were getting out of the car when i noticed out of tahe preverbal conner of my eye,a light streaking towards the hillside approximate ly 1\\4 mile away from our homes location it appeared to glow and move in avery steady motion toward the hill side and just before what appeared to be a collision it abruptly changed direction , upward and kind of followed the contour of the hillside until it reached about what i estimate to be approx. 50 feet above the hill and the just seemed to go straight away from that same proximity and my location i continued to watch for another few min. and decided no wononewould believe me anyway so i just put it in the back of my mind ,until i was watching a ufo show on tv and a person decried almost identical experience at some other location that i didn't catch. was today 8\\5 \\2011 about 6:00 pm on chanel planet green .the object drifted into the distant sky at about 45 degrees from my location .my wife did see the same object (ball of light), however she thought that it was some home boys messing around and did not give it the same interest that i apparently was impressed with .this truly was an unusual experience to say the least.i guess i would conceder myself a believing sceptic but i hesitate to exclude anything from possibility .however aim really freaking out about this incident ."],"trends":["There have been 17 other sightings in Ventura","There were no other sightings in Ventura on or around May 15th 2011"],"Summary":"bright nite didn't remember seeing moon or other Heavenly bodies just this object vision","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/30683.html.txt","/var/www/straped/mufon/org/30683.html"],"Longitude":"-119.224345","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Fireball, Sphere, Star-like","City":"Ventura","Object Flight Path":"Path with directional change","Object Features":"None","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"08/07/2011 05:05 UTC","Latitude":"34.27716","Log Number":"US-08072011-0085","Sighting Duration":"Undisclosed","Date of the Event":"05/15/2011 12:00 UTC"}