{"Log Number":"US-08092011-0101","Summary":"A bright orange ball of light much bigger than a star or planet hovering and wiggling in the sky","map":"<A HREF = \"http://maps.google.com/maps?q=37.563992,+-122.322995(30687)&iwloc=A&hl=en\"> mufon case (30687) map </A>","Object Flight Path":"Hovering then path","Case Number":"30687","files":["/var/www/straped/mufon/html2text/30687.html.txt","/var/www/straped/mufon/org/30687.html"],"Disposition":"Unknown","Longitude":"-122.322995","Country":"United States","Sighting Duration":"00:10:00","divs":["Sighting DetailsHere in San Mateo, California: Last Saturday around 7 p.m., I was in my living room and through the front window (eastern side), I saw a light in the sky that was out of the area of the traffic of airplanes that travel from South to North to SFO. I immediately went outside and saw a large ball of orange light in the sky in the east towards 101 Freeway direction. It was at a 40 degree angle because I began to use my fist to measure. I am very familiar with the sky since my hobby is Astronomy. The Orange bright object was hoving there and wiggling. It was a bright orange ball of light. The neighbors began looking at it and I yelled for my brother to come. He started to walk outside like he didn't not care, but as soon as he looked up in the sky, his reaction changed to \"OH SHIT!\" OHHHH MY GOD!\" We were watching it as it was hovering in the same spot, wiggled up and down and I was saying, \"It is not an airplane, it is not a star, it is not a meteor, it can't be a flare since flares slowly descend. Plus this object was bigger than a flare and much bigger than any star. It was still kind of light outside since it was 7 p.m. We were shocked! It was there for around 10 minutes then it began to like go up deeper into the sky and disappeared. I then tried to look up to see if it came out in the news. In yahoo I looked up \"Orange UFO\" and found that there were quiet a lot of sightings of orange UFO's in California. This was very strange!"],"trends":["There have been 6 other sightings in San Mateo","There were no other sightings in San Mateo on or around July 31st 2011"],"Date of the Event":"07/31/2011 07:10 UTC","Date Submitted":"08/09/2011 03:59 UTC","Object Shape":"Sphere, Star-like","Object Features":"Unknown","City":"San Mateo","Region":"California","Latitude":"37.563992","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown"}