{"Case Number":"30689","Region":"Connecticut","trends":["There have been 10 other sightings in Stratford","There were no other sightings in Stratford on or around August 5th 2011"],"Tags":"City","Log Number":"US-08072011-0058","files":["/var/www/straped/mufon/html2text/30689.html.txt","/var/www/straped/mufon/org/30689.html"],"Latitude":"41.191372","Summary":"Reddish orange lights, a central triangle of lights and then 2-4","Country":"United States","Disposition":"Unresolved","Object Shape":"Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Stratford","Source":"MUFON","divs":["Sighting DetailsWe were driving down I- 95 N, the evening of August 5, headed for Cape Cod when I ( The driver) noticed the red lights in triangle formation with a couple of lights above and below out my window. At first I thought it was a plane but the triangle of lights made me look twice. I asked my husband if he could see it too, partly to check the viability of what I was seeing and partly to see if he found the sight unusual. We were both intrigued and so to satisfy our curiosity I pulled over on the shoulder as soon as I was able to, allowing us to safely watch them. They were a goldy, red-orange in color, and seemed to be moving paralell to us at first and then stopped to hover. They made a paralellagram with a small triangle in the center. The light on the leading point of the paralellegram was clearly the brightest. The lights began to flicker a bit like candles about to go out and then they faded paler and smaller. The central triangle disappeared first and then top lights and last the bottom lights, ending with light which had been brightest, at the bottom and front of the formation. We tried to videotape the ncident using my husband's cell phone camera but it was too dark and the highway traffic too disruptive to get any footage to speak of. We were pretty excited by the sighting (our first UFO experience) and talked about it for a while afterwards."],"Object Features":"Undisclosed","Date of the Event":"08/05/2011 07:50 UTC","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Longitude":"-73.127305","Date Submitted":"08/07/2011 02:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.191372,+-73.127305(30689)&iwloc=A&hl=en\"> mufon case (30689) map </A>"}