{"Disposition":"Hoax","Viewing Distance":"Over One Mile","Object Features":"Unknown","City":"St Petersburg","Summary":"Three mostly orange balls in sky moving in every direction and hover","Source":"MUFON","Weather Factors":"None","Case Number":"30697","Region":"Florida","Object Shape":"Circle, Sphere","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Longitude":"-82.63056","Tags":"City","Date of the Event":"12/31/2010 06:00 UTC","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around December 31st 2010"],"Log Number":"US-08072011-0086","Country":"United States","divs":["sighting details2010 new years eve about 6:00- 7:00 pm. i'm joe this was witnessed by my wife, daughter, mother, and me. my mother spend the day over our house. were not \"big\" new year party people just a bbq that day. my mother was leaving our home around 6:00pm. all of us walked my mom outside to her car as we always do to say good bye. my youngest son was running around the frontyard, as my wife, daughter, and i stood in driveway to wave bye to \"grandma\".as my mother was ready to get in her car my wife noticed three orange balls of light and said look at that. what is that? we all were staring at these balls of light for a while. at first they all stayed very still (as if it was a flares) then they all were moving back and forth, up and down. they were pretty far away but they all moved fast in a sporatic way. they seemed round and orangeish red color. it was strange cause we all thought it was not a ballon someone let go or anything eles but a big round ball. they would move jump around and then stop and hover a while. after about what seemed 5-10 mins two of them disappeared and the other shot up on a 45 degree path extreamly fast what looked tobe a half mile behind a large cloud. we knew we seen something unsure what it was......... here's the neat thing that happened. its been exactly 8 months later now. we watch the ufo stories when ever we catch them on tv. we watched yours and seen a similar story. i have aways been intrested in sightings since 12 yrs of age in my other report on this mufon site. i thought why not research what we seen and found other people the same night seen the exact same objects right here in st.pete that night\\day. they have video of what they seen. i've shown the videos to my wife, mom, and daughter we all were very amazed and i felt compelled to get a hold of these people to tell them our sighting. we have not contacted these people yet. below is what i found on youtube (links removed from statment and place in report field) 08\\06\\11 13:39 cms flg"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.776076,+-82.63056(30697)&iwloc=A&hl=en\"> mufon case (30697) map </A>","files":["/var/www/straped/mufon/html2text/30697.html.txt","/var/www/straped/mufon/org/30697.html"],"Sighting Duration":"00:05:00","Latitude":"27.776076","Date Submitted":"08/07/2011 05:10 UTC"}