{"Log Number":"US-08062011-0056","Case Number":"30690","files":["/var/www/straped/mufon/html2text/30690.html.txt","/var/www/straped/mufon/org/30690.html"],"Object Shape":"Blimp, Cigar, Cylinder, Oval","Object Features":"Undisclosed","Latitude":"40.61415","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around September 17th 2009"],"Summary":"The night I realized all my wildest dreams could be true and most likey are.","Source":"MUFON","divs":["sighting details9\\17\\2009 at 720-25pm was out on balcony. it was dark outside. with two airports in view. from where i am. no clouds in the sky. completely clear. no aircraft in sight. have counted up to ten, at one time before. lit my cigarette. dropped my lighter. when bending down from sitting. to pick it up. there was something in my field of view seen. from the corner of my eye. on the way down. looked up. and seen what would be one of the most memorable moments of my life. i am on the fourth floor, when viewing this. it was hovering over, and back from, a very large school, in the city. it was huge. also very close. within a half mile. it did not move or make a sound. it was shaped like a long cylinder. with a bow at top. curving down along sides. a bright blue solid light running the length of the craft. blinding the rest of the craft with shadowed colors. although it seemed reflective. shiny and maybe metallic. a light shown down to the ground, from the craft. paused. then slowly moved across the top of the buildings towards my direction. it passes all the buildings. the light climbing up the side of my building. it eventually hit me in the face. at the same time disappearing. completely, silently, instantaneously. never heard any reports. never reported it myself. still can easily recall the date time and story. was wearing blue jeans and a haynes white t-shirt that night."],"Object Flight Path":"Stationary,Other","Longitude":"-75.485393","City":"Allentown","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.61415,+-75.485393(30690)&iwloc=A&hl=en\"> mufon case (30690) map </A>","Date of the Event":"09/17/2009 07:22 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"08/06/2011 03:09 UTC","Region":"Pennsylvania","Country":"United States"}