{"divs":["sighting detailsi'll never forget this event when i was 12 yrs old. i was visting my cousin she lived a block away. my aunt would let me vist with my cousin and play in front yard often. this usauly happened in the evening as my mother worked late. it was 1979 around 8:30 pm and just after dusk. my cousin and i were playing tag in her front yard. we were tired from playing and layed down on her driveway. i noticed first and then pointed it out to my cousin. i had to point it out because it made no noise (none at all) and you had to stare\\focus a while then the shape was very visible. we seen a huge boomarang shape. i said, do you see that shape in the dark sky and after a short pause she seen it too.it was not a jet this was weird.it was big, quiet, it should have been loud for its size. it was scary to us (we just realy seen something strange) her mom, my aunt, was inside the house. both of us did not want to leave in case it would disappear.we were both frozen in a type of shock staring at it. it did not last long. it seemed as dark as the sky and had very small lights in no pattern. was very close match for the night sky behind it. it blended very well. it moved east to west at a very low rate of speed and stayed the same height the whole time. we ran inside after we could no longer see it and told my aunt. i remember very clear we were very excided and just about hyperventilating explained what we both just seen.i was just about crying and said to my aunt we just seen a ufo. we really really seen something very strange. my aunt was very supportive and suggested to draw out what we seen. we made many drawings. i still have contact with my cousin and we both remember that night very clear. i've always been amazed when i see a program on tv and they show exactly what we seen that night. some of the reported sightings tell about a boomarang shape. my family today knows my story and the drawing i made of what i've seen in 1979 and its errie."],"City":"St Petersburg","Longitude":"-82.688946","Latitude":"27.807746","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around September 1st 1979","This sighting has never been favorited.",""],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Insufficient Data","Summary":"seen in sky from house driveway with another person","Sighting Duration":"00:05:00","Object Shape":"Boomerang, Other","Region":"Florida","Weather Factors":"None","Case Number":"30696","Date Submitted":"08/07/2011 05:23 UTC","files":["/var/www/straped/mufon/html2text/30696.html.txt","/var/www/straped/mufon/more/30696_submitter_file1__img007.jpg","/var/www/straped/mufon/org/30696.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.807746,+-82.688946(30696)&iwloc=A&hl=en\"> mufon case (30696) map </A>","Country":"United States","Log Number":"US-08072011-0086","Object Flight Path":"Straight-line path","Tags":"City","Date of the Event":"09/01/1979 08:30 UTC"}