{"files":["/var/www/straped/mufon/html2text/30709.html.txt","/var/www/straped/mufon/more/30709_submitter_file1__img002.jpg","/var/www/straped/mufon/more/30709_submitter_file2__img003.jpg","/var/www/straped/mufon/org/30709.html"],"Object Flight Path":"Stationary,Straight-line path","City":"Tucson","Summary":"This is my third encounter with these crafts. I have always been affraid that I would not be taken serious. I know what I saw and would take a lie detector test to prove it.","Sighting Duration":"Undisclosed","Region":"Arizona","divs":["Sighting DetailsI took my dog out to do his business, when I looked up and noticed a bright light, (I thought it was just a very bright star that I had never seen before). As I watched it changed from the one bright light to several oblong shaped outer lights. It then proceeded to move due east toward the mountains. As it got close to the Rincon mountains it turned 90 degrees (from flat to sideways is the only way I can explain it). It paused for a few seconds and then took off straight up. What was odd is that it only moved maybe a quarter mile up and disappeared, like turning on a cloking device. I know that sounds funny, but that's what it looked like. I would have loved to take a photo of the object, but I was just standing there frozen and could not move to get the camera. You may call me if you like. I would like to discuss two other events that occured in April 08, and one in August 09 which I have attached a note."],"Object Features":"Window(s)","Date of the Event":"03/06/2008 08:36 UTC","Disposition":"Unknown","Date Submitted":"08/09/2011 06:52 UTC","Case Number":"30709","Source":"MUFON","Weather Factors":"None","Longitude":"-111.024415","Tags":"City","Object Shape":"Circle","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.386197,+-111.024415(30709)&iwloc=A&hl=en\"> mufon case (30709) map </A>","Latitude":"32.386197","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around March 6th 2008","This sighting has never been favorited.",""],"Log Number":"US-08092011-0012","Country":"United States"}