{"Date of the Event":"08/05/2011 01:25 UTC","Longitude":"-73.893747","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"101-500 Feet","Object Shape":"Sphere, Star-like","Log Number":"US-08062011-0068","Date Submitted":"08/06/2011 05:19 UTC","trends":["There have been 6 other sightings in Yonkers","There were no other sightings in Yonkers on or around August 5th 2011"],"Latitude":"40.93768","map":"<A HREF = \"http://maps.google.com/maps?q=40.93768,+-73.893747(30703)&iwloc=A&hl=en\"> mufon case (30703) map </A>","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Stationary","Case Number":"30703","divs":["Sighting DetailsMe and a friend were at White Castle in Yonkers,Ny about 1am in our vehicle at the drive thru. I noticed in front of me about mid point in the sky at first one large very bright stationary light in the sky. The light seemed to get brighter and at times dim out during our observation. Approximately 10 minutes into the event we noticed a second object appear adjacent to the first one but to the left side stationary also and geting brighter while it hooverd in the sky like the first object. From where we were at looking forward a few hundred feet the hudson river would be approxiametly the area about which these objects may have been near. We noticed a helicopter in the immediate area with its lights on traveling directly towards the 2 objects that we were observing. As the helicopter drew near the objects began to dim or fade out but we could still see that they were still there. We were next up at the drive thru window and got our food then proceeded to make a left turn down South broadway were we then lost visual contact with the objects. My freind said that the first object we saw seemed to be perpindicular as if it were slightly elongated vertically in the sky. We got onto the saw mill river parkway and headed towards tarrytown ny but never saw the objects again that night."],"Object Features":"None","City":"Yonkers","Summary":"2 very bright stationary lights in sky","files":["/var/www/straped/mufon/html2text/30703.html.txt","/var/www/straped/mufon/org/30703.html"],"Country":"United States","Region":"New York","Disposition":"Unresolved"}