{"Object Flight Path":"Straight-line path,Other,Unknown","Log Number":"US-08092011-0099","Date of the Event":"05/25/2011 10:30 UTC","Date Submitted":"08/09/2011 03:53 UTC","files":["/var/www/straped/mufon/html2text/30707.html.txt","/var/www/straped/mufon/org/30707.html"],"Case Number":"30707","Region":"California","Sighting Duration":"00:00:05","Viewing Distance":"21-100 Feet","Latitude":"38.728255","Longitude":"-121.332116","Tags":"City","Object Shape":"Circle, Disc, Sphere, Other","Weather Factors":"Unknown","Country":"United States","Summary":"a teal not blue or green but TEAL disc that appeared to be like a donut came from behind a wall and went lightspeed","Disposition":"IFO","Object Features":"Other","City":"Antelope","divs":["Sighting DetailsIts may 25th 2011, my schools graduation im a senior in highschool and i have just graduated my last year as a highschool student, im excited for our sober grad night and i am waiting in our schools cafeteria. the people in the cafeteria had told me i didnt need to be back for the bus for sober grad night until 10:45 so i decided to call my mom to pick me up as im walking out to meet her at the front gate my cousin,(anonymous) sees me ands like hey dude congrats wanna go get a starbucks or something? i said sure man lets go lemme just go tell my mom, so my mom gets here and i go tell her hey sorry for making you drive here(we live around the corner from the schoolish area) and i say im going with lets call him JIM, i said me and jim are gonna go get coffee, she said alright and i get in the car with Jim and his friend shes a girl well call her michelle, michelle is driving id say about a 2000 camry with a sunroof, nothing special just a typical average car, we start driving to starbucks which is about a half mile away from the school walking distance easily. as we pull out of the parking lot and get on the main road which is located directly next to the side of the school thats when me and JIM see it, michelle driving and paying attention to the road and singing to the radio did not see the ufo unfortunately, but anyways so were on the road and what i see next has affected me to this day, i see this teal donut disc shaped object about id say 200-300feet in the air and about 50-100 feet infront of us, i was sitting in the back seat and i happened to lean forward and when i leaned forward i looked through the sunroof and it was at the EXACT instant that i looked up that i saw the object come from what appeared to be a wall in the middle of the sky, meaning it had a 90degree straight edge behind it, i dunno how to explain it but it looked as if it just came from behind a black sheet or from what i still fail to admit but another dimension is what it looked like, the object came into full view about id say a half second later it appeared like it came from behind whatever a lil slower than shot out like a speeding bullet traveling as fast as the black jets i see everywhere, its going at a slightly diagonal angle and is moving extremely fast next thing i know its gets to the tops of these houses on the other side of the road and than it picks up speed astonishingly fast, and i mean it was to a point that the whole thing had brought tears to my eyes about how unreal it was, i couldnt believe what i had just witnissed me and JIM were both shaking and yelling what in the FUCK was that? over nd over again, when it had picked up speed however to what i swear on my life had to be lightspeed, because it had left a 15-20 foot lightstreak behind it that was very bright and disipated out of the air rather quickly, all i know is that the fact that it came from behind the wall has affected me greatly since, i remember feeling as if when i was staring at it in the beginning when it was coming from the wall that it was communicating with me, because since that day ive gotten this strange VERYYYY strange deja vu that baffles me to a point of depression,you know how normal deja vu hits ya and its like woah deja vu, mine was like woah deja vu at first but than it stayed, and would last up to a an hour and i felt like in a way i had seen all of what was goin on already or before i guess, its hard to say that with out sounding crazy i know but i mean im a health 18 year old kid who played football for to years, taken photography classes my whole life and extremely passionate about not lying, its the worse thing anyone can do especially about a subject like this is lie about an experience, so when i tell you this deja vu is still occurring on a daily basis, its by far the weirdest thing ive ever experienced, on another note id also like to say that before this i was skeptical but open minded about ufos i was in the mindset of yeh they prolly exist but all the youtube videos of ufos are basically all the same sketchy footage blurry shaky and bad quality, than i thought after months of trying to look up anything similar to what i saw with no luck that 90% of the videos are FAKEs, cause at this point after researching so many videos and information about it, its to a point where if i would have gotten this on tape it would be on world news right now. end of story. i know for a fact that this object a lone on film would have had to make the president make a public adress about some bullshit about what it is or to just tell the truth cause what i saw, there is not a single possibility it was from this earth. period i will stick to that statement until i die, i can account for strange happenings besides the deja vu as well after the incident has occured i have no idea if it indeed has any relation to the ufo but 3 days after the event me and a couple friends decide to go see hangover 2 this is the first time i can account for the deja vu,during the movie i got a weird stomach ache and kept telling them i wanted to leave because i had felt like i had already seen it, all the scenes playing were like i had already seen them heard the lines everything it was paranormal in a way , i tough it out and sit through the movie emotionless because i cant even enjoy the movie the deja vu is so bad, when we leave im sitting in the back seat and its my friend and his brother up front, were driving back to his house and we go under this underpass sorta deal its like a railroad bridge and abut 40 feet after that theres a sign, as were approaching the sign i see this white figure flying on the ground like 1-2 ft off the ground it goes across the road and lands on top of the sign and right as it lands we get next to the sign i look to the side and its a white owl staring directly at me and i mean it wasnt just facing my direction its head was looking at me, and as were driving past it i turn fast to look out the back and its head is following like me i guess thats what it felt like, so weird and so hard to explain this i dunno how open minded people are on this website, but its almost as if something has changed in me i see the world completely differently than i used to, its a very negative feeling and i have this anxious feeling that im waiting for something, i remember getting the same creepy feeling from the owl as i did from the teal disc. i know this is long but its cause this is the only time ive been able to express this to the public in a way that i actually feel can shed some light, the second part to this and the second ufo is not seen by me at all but by my cousin JIMs sister on the same night that we saw ours about 10 minutes after we see ours i called my sister to tell her about what i just witnissed and he called his when he calls his he starts freaking out and im like what? what??? and hes like she saw a fuckin ufo too and im like no she saw the disc thing? ask her and she said no but what she did see was what she thought was a shooting star but when she looked closer she said it wasnt going away and than she said thats not a star shape at all thats a triangle she said it kinda looked like the end of the pointer on the computer mouse thing just fly by than do the same type of dissapearing thing speeding up and just fading away into a wall type thing, i hadnt spoken with her for about a month and she posted something on facebook she said i cant shake this feeling i dunno what it is but i hate it, and i commented saying hey you alright? she replied saying yeh just have this anxious feeling and i said really? thats weird ive been feeling that too i said what do you think its from and she said i dunno i dont wanna say. and i said we need to talk now. so i called her up and said hey you home she said no ill be home in 10 come over tho so i came to her house, btw she's 20 and going to law school,ill call her jamie, i go to her house and she in her room with her brother and i come in and i havent told anyone about the deja vu ive been having yet except for my two friends i went to the hangover with, so were in her room and i said so like you got this feeling too? nd she said yeh its weird its like that feeling when your waiting for something in the mail and i said OMG YEHHHHHHHHHH me too like i m waiting for something special and she says yeh exactly and than i was like why didnt you wanna say nd shes like cause i dont want to buy in to believing it and actually thinking thats why, and i was like trust me you can tell me i need to know cause some weird shit has been happening to me lately, nd she says okay so she starts off and right away i get chills down my spine when shes says \" so i keep getting this weird deja vu feeling\" i stop her nd say wtf, explain it nowwwwww im gettin demanding now and she and i both can tell that we are now realizing that something weird is happening to us, it was like a connection nd she says yeh like i was with my friends the other night and they said something and i was all like WOAH DEJA VU hahah and she laughed and they laughed and than she looked with like a puzzled face and was like and than i was like wait stop talking and her friends got serious and was like what? why? she said its still happening. and there like what? the deja vu? and she said yes stop omg stop talking cause she was feeling that everything everyone said was just like it happened before than i told her what i just explained and she told me that she just basically have explained her life for the past month, i didnt talk about my lucid dreaming yet but i feel like this is getting to long and maybe to unbelievable now. i dunno know how this website works but id love to keep in contact with people cause something very strange is happening to me and im just trying to cope it cause this deja vu hurts my brain i dunno i cant keep having it happen its effecting me in a extremely negative manner. i will attach what i tryed to recreate of the ufo its not even close to exactly what i saw especially the light streak but hey i mean it at least puts a picture to it the \"craft\" in the video and colors are pretty close but like i said its not exact and the street its on is the actual street it occured on at 10:30 pm may 25th 2011 graduation night with no only one other vehicle on the road going in the opposite direction. thank you."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.728255,+-121.332116(30707)&iwloc=A&hl=en\"> mufon case (30707) map </A>","Source":"MUFON","trends":["There have been 5 other sightings in Antelope","There were no other sightings in Antelope on or around May 25th 2011","This sighting has never been favorited.",""]}