{"Summary":"Very large disc UFO over Kansas City, Missouri in daylight","Source":"MUFON","Tags":"City","Log Number":"US-08072011-0015","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=39.108296,+-94.573977(30711)&iwloc=A&hl=en\"> mufon case (30711) map </A>","Disposition":"Unknown","Date Submitted":"08/07/2011 09:53 UTC","Object Shape":"Disc","Latitude":"39.108296","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Features":"Dome, Patterned Surface","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around August 6th 2011"],"Longitude":"-94.573977","Case Number":"30711","Date of the Event":"08/06/2011 12:10 UTC","Object Flight Path":"Hovering then path,Path with directional change","City":"Kansas City","files":["/var/www/straped/mufon/html2text/30711.html.txt","/var/www/straped/mufon/org/30711.html"],"Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsAs called into ASD at 12:46 pm today by the witness who wishes to remain anonymous. He would not provide contact information due to his job in KC government. \"My wife and I were getting in the car on our way to lunch today when my neighbor pointed to the sky to our north and said \"Look at that!\" We looked in that direction and all three of us saw a large gray metallic disc-shaped object with low dome on it. It was hoovering at first, then started moving slowly in a north direction. It disspeared for a couple of seconds, then reapeared further away. We saw no lights or windows and heard absolutely no sound. There was a small private airplane in the area and he must have seen this object because he flew right over the spot where it was as it moved away! I don't know what the altitude was but I'd guess 1,000 - 2,000 feet - it was pretty low. My best guess for the size of the thing is 3 - 5 miles across! None of us could believe what we saw. This is the first time my wife and I have seen a UFO and we are stunned. We decided to call someone but don't want any publicity or anyone else to know who we are. My job is too sensitive and I can't risk putting my name out there. I called to see if anyone else saw this - someone else must have seen it! We watched it for about three minutes total time, then lost sight of it behind the trees."]}