{"Region":"California","Source":"MUFON","Longitude":"-122.397813","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/30717.html.txt","/var/www/straped/mufon/org/30717.html"],"Latitude":"37.793501","Summary":"Downtown Los Angeles disk shaped UFO with lights seen off 110 Freeway","map":"<A HREF = \"http://maps.google.com/maps?q=37.793501,+-122.397813(30717)&iwloc=A&hl=en\"> mufon case (30717) map </A>","trends":["There have been 127 other sightings in San Francisco","There was one other sighting in San Francisco on or around August 6th 2011"],"Object Features":"Other","Case Number":"30717","Country":"United States","divs":["sighting detailstonight at about 9:20 pm i was driving home from my job in downtown la on the 110 freeway heading north. while driving i saw bright lights behind a large building and half of an object hovering. intrigued, i watched it while trying to drive safe until i drove far enough to see the entire ufo. it was disk shaped with white lights circling a disk shaped object and a light in the top, center of it. it could not have been a plane or blimp because it was extremely low and close to one of the large downtown buildings and it made no noise. i was able to keep an eye on and follow the object for about a full minute or 2 (it's hard to recall time during such a shocking experence but i had a good clear look for a well amount of time). i think it was approximately the size of a massive airplane, the kind that can hold hundreds of passengers. as i drove along it flew in a pretty solid path into the distance, away from the downtown area. unfortunately, i lost sight of it while going under tunnels merging onto the 5 n freeway. by the time i lost sight of it by changing freeways, it had made its way pretty far off into the distance in a short amount of time, basically it had to have been moving really fast. this was a pretty intense experience. i was in shock, questioning my sanity and sight, trying to rule out what it could have been, shaking like a leaf, sweaty, and pretty much in pure shock\\excitement while trying not to crash on such a hectic freeway. i'm sure hundreds of other people had to have witnessed it and i can not wait to hear of another witnesses experience that validates mine. i'm still pretty shaken up and keep replaying the experience in my head. because i had a great view of it for so long i kept thinking about trying to take a picture, but because i was driving, scrambling through my purse in a shocked state did not seem like a good idea."],"Viewing Distance":"101-500 Feet, Unknown","Object Shape":"Disc","Date Submitted":"08/07/2011 02:34 UTC","City":"San Francisco","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"IFO","Date of the Event":"08/06/2011 09:20 UTC","Log Number":"US-08072011-0060"}