{"Disposition":"Insufficient Data","Date Submitted":"08/09/2011 02:52 UTC","Country":"United States","trends":["There has been one other sighting in Bernville","There were no other sightings in Bernville on or around November 30th 2010"],"Object Flight Path":"Other","Case Number":"30712","Date of the Event":"11/30/2010 12:00 UTC","Object Features":"None","Latitude":"40.433426","Tags":"City","Viewing Distance":"20 Feet or Less","Summary":"looked like heat mirage, spinning fast, misty, FAST","Source":"MUFON","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/30712.html.txt","/var/www/straped/mufon/org/30712.html"],"Region":"Pennsylvania","Longitude":"-76.112165","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.433426,+-76.112165(30712)&iwloc=A&hl=en\"> mufon case (30712) map </A>","Sighting Duration":"Undisclosed","divs":["sighting detailsdriving along country road near christmas village in pennsylvania (not far from bernville, pa). saw a spinning, swirling, mirage-like anomaly (like when you see heat coming off a grill, or heat shimmering above the road when it's hot outside). it was off to the side of the road at the edge of a field, spinning very fast and suddenly just shot out of sight at a very high rate of speed. it looked to be about the height of a person and was a few feet off the ground. people who saw it were inside their car with closed windows so if it made any noise they didn't hear it. at first no one said anything and then after it went away and they were driving along, the driver and passenger said to each other, \"what the heck was that?\". there was no explanation for it it wasn't raining, snowing, windy or anything else; the object\\anomaly simple appeared there off to the side of the road and then spun away into the sky at a very high rate of speed, and the driver of the car said she will not drive there anymore because she was scared by something that couldn't be explained. the two people who saw it said they have never seen anything like it and it was completely outside their frame of reference as a normal occurrence."],"Log Number":"US-08092011-0085","City":"Bernville"}