{"Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"03/31/1960 07:00 UTC","Latitude":"40.218451","Viewing Distance":"Over One Mile","Object Shape":"Oval, Sphere","trends":["There have been 6 other sightings in Red Bluff","There were no other sightings in Red Bluff on or around March 31st 1960"],"Region":"California","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.218451,+-122.212074(30710)&iwloc=A&hl=en\"> mufon case (30710) map </A>","Case Number":"30710","City":"Red Bluff","Longitude":"-122.212074","Date Submitted":"08/06/2011 07:01 UTC","divs":["Sighting DetailsThe following event happened when we lived on Kaer Avenue, Red Bluff, CA and I was just leaving grade school for high school. This occurred about 1960. I was around 15 years old (I am now 66)and my mother and I were in the house. Mom was probably fixing supper and I was more than likely watching TV. My father came into the house and told my mother and I to come outside and look at something unusual in the western sky. We followed Dad out the front door and into the street on the south side of the house. We observed a basketball size object (reddish orange) hovering in the western sky. (Note: It was not the moon, as the moon was in the eastern sky just where it should be, with its man in the moon shape, etc.) I had no idea what is was, and my father who was a WWII veteran was completely stumped. This is where it gets weird. The object did not move up or down, left or right, but hovered in exactly the same spot. Then it just disappeared about 7:30pm. We talked about it the rest of the night. The next day my Dad came in and said it was back. Sure enough, at just after 7:00pm it was exactly where it had been the evening before. Same exact place. My Dad called a several neighbors who came over and I remember them getting into all kinds of theories as to what is was. Then they observed that if you walked down the street, (heading south) about 50 yards, it disappeared and when you backed up a couple steps is came back into view. The same thing happened if you walked up the street (heading north). We found this out because some of our neighbors could not see it as they walked toward our house, and then it appeared suddenly and if they backed up it would disappear. There was only about a 100 to 150 foot area (window) that it could be seen. This event took place for 5 nights, and then stopped. The time for each event turned out to be from 7:00pm to 7:30pm. I do remember that on the last night, our driveway was full of law enforcement vehicles and even a couple of national guard rigs, and a ton of people from around the neighborhood and from town (Red Bluff, CA). Our neighbor across the street, Mr. McKay the Red Bluff High School Science Teacher was completely stumped. On the third night he called some of his colleagues from a University in California and they were there on the fourth and fifth nights of the sighting. Some had gadgets to measure light, and heat, and size. Other gadgets I do not know their purpose. I do recall them being very confused as to why the object would disappear when walking north and south and even when walking away from and toward it. This was truely an unusual event. Extra notes: SIZE: The size and shape was the same as a basketball that was only about 10 feet from you. Very large. And if looking at a basketball only 10 feet away it appeared to be about 8 to 9 feet off the ground. That will give you an idea of the angle from my view point as I was only 5'6 back then. DISTANCE: Unknown. It did not get any larger even when looking through binoculars. It stayed the same size, and no other features were visible either. The color always stayed the same. DURATION: Only 30 minutes of viewing each night. From 7pm to 730pm each evening for 5 nights. Was it there the night before my father noticed it the first time. We do not know, it could have been. It never came back again, and I spent days, months, and even years looking west from our house for its return. I know that it's been many years since the event, but I have to know if others have seen a similar thing hovering in the evening sky. (Remember, it was not the moon, a star, street light, car headlights, house light, flashlight, lantern, jack-o-lantern, etc. They could not tell us what is was then, maybe you can now. I am sorry there are no photos. I recall (or think I recall) someone saying that none of the photos would come out or develop. There was just nothing there, only the western evening sky would show. PS: It was your television show that made me write this. OK, MUFON, tell me what it was, or was not as the case my be. DO YOU CONTACT US (OR ME)OR DO I STAY IN LIMBO FOR ANOTHER 66 YEARS. Thank you James Please call me...... This is driving me nuts."],"Log Number":"US-08062011-0081","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/30710.html.txt","/var/www/straped/mufon/org/30710.html"],"Summary":"Object appeared 4 evenings in a row, just hovered in place, and could not be seen from different view points.","Country":"United States","Object Features":"None","Disposition":"Unknown","Object Flight Path":"Stationary"}