{"Source":"MUFON","Weather Factors":"Unknown","Longitude":"-87.741105","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","City":"Chicago","Tags":"City","trends":["There have been 221 other sightings in Chicago","There were 3 other sightings in Chicago on or around July 4th 2011","This sighting has never been favorited.",""],"Case Number":"30729","Summary":"Flaming lights fly in paths with directional changes above Chicago two nights in July 2011.","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailson july 4th as fireworks went off around my block i witnessed 3 fire-like lights cross the sky from my backyard. they looked like flames that might come from hot-air balloons, but there appeared to be nothing above the visible flames. the flames were constant, and i thought perhaps i could hear a hot air balloon-like roar at times. i imagine they could have been larger and higher than i at first believed. if they were some kind of balloon hybrid, like perhaps a flame engine that was thrusting a steerable craft, they were surely flying in an illegal manner, no lights, just flame. i felt i should have been able to see whatever the frame or body of these crafts was, but there was nothing to see but flame. they crossed my wide visible horizon in about 3 minutes. i shot video of this event on my camera phone. on 7\\29\\11, 25 days later at 9:34 pm also in chicago, i was exiting a menards store at 2601 n. clybourn ave. 60614 and i witnessed the same fire in the sky. this time there were 3-4 witnesses and 6 flames in the sky. they seemed to be maneuvering more this time speeds seemed to change and they disappeared before they left the horizon ... perhaps behind clouds but it didn't seem there were any clouds. one witness was a menards worker collecting carts who saw our interest and stated \"there was like 10 of them before\" referring to earlier in the night. i am in contact with one of the other witnesses who may have details which differ from mine. all witnesses in the parking lot agreed that this was very strange, and that it looked like flames with nothing attached or any visible structure."],"Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=41.963203,+-87.741105(30729)&iwloc=A&hl=en\"> mufon case (30729) map </A>","Latitude":"41.963203","Country":"United States","Date Submitted":"08/08/2011 08:08 UTC","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/30729.html.txt","/var/www/straped/mufon/org/30729.html"],"Date of the Event":"07/04/2011 09:52 UTC","Object Features":"None","Log Number":"US-08082011-0016"}