{"Disposition":"Unknown","Tags":"City","City":"Lakehurst","Sighting Duration":"00:00:03","Object Features":"None","Case Number":"30723","Country":"United States","Viewing Distance":"20 Feet or Less","Region":"New Jersey","Date Submitted":"08/10/2011 04:39 UTC","files":["/var/www/straped/mufon/html2text/30723.html.txt","/var/www/straped/mufon/org/30723.html"],"Summary":"paper half gallon milk carton that was completely lit","Log Number":"US-08102011-0027","Weather Factors":"None","divs":["Sighting DetailsI'm a UH-60 pilot for the New Jersey Army National Guard and on the night of August 2nd, 2011 at approximately 2200hrs I saw something streak across the night sky that I cannot explain. There were two pilots flying in the front, one crew chief in the right door gunner position and I was sitting at the left door gunner position. The aircraft was facing east. Our crew chief saw a bright flash of light that dimmed his night vision goggles on the horizon toward the south. At the same time I saw a lighted object pass over from the right to the left side of the aircraft at about 20 to 30 thousand feet level. The object was rectangle in shape with squared off corners. It was fully lit. It streaked across the sky in about 2-3 seconds. Much slower then shooting star but much faster then a jetliner. It faded off just short of the horizon toward the north due to low cloud coverage that was at 5 thousand feet. Since I was under night vision goggles I saw no vapor trail which is very common with shooting stars. This looked nothing like any shooting start I had ever seen. A shooting star is usually just a single pin point of light, streaks across the sky in a blink of an eye and always leaves a vapor trail behind it. This object looked like a paper half gallon milk carton that was completely lit."],"Date of the Event":"08/02/2011 10:00 UTC","Source":"MUFON","Object Shape":"Square, Rectagular","Latitude":"40.014561","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Lakehurst","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.014561,+-74.311257(30723)&iwloc=A&hl=en\"> mufon case (30723) map </A>","Longitude":"-74.311257"}