{"Latitude":"38.956414","Region":"Nevada","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=38.956414,+-119.760193(30722)&iwloc=A&hl=en\"> mufon case (30722) map </A>","Object Features":"None","trends":["There have been 5 other sightings in Minden","There were no other sightings in Minden on or around February 23rd 2011"],"Longitude":"-119.760193","Object Shape":"Triangle","Case Number":"30722","Object Flight Path":"Straight-line path","Country":"United States","City":"Minden","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"02/23/2011 12:00 UTC","Log Number":"US-08072011-0102","Weather Factors":"Unknown","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/30722.html.txt","/var/www/straped/mufon/org/30722.html"],"Date Submitted":"08/07/2011 08:00 UTC","Source":"MUFON","divs":["Sighting DetailsI had stepped outside to check the weather, it was 3:00 a.m. the sky was clear and warm for February. I walked out to the curb and noticed a large well lit object coming across the sky. I decided to watch it to see what it was. I have a large pine tree in my front yard with a wide umbrella of branches. I thought it wise to stay in the shadows of the branches as the object approached. It flew directly over my house. It was not moving fast, like an airplane would. As it crossed above me I stepped out from under the branches to get a better look at it, the sky was very dark, I could barely make out the shape against the stars. I heard a humming sound as if it had fans running. The object had eight very bright lights, which made it obvious that it was not an airplane, it was not flying in the direction an airplane would. Reno is to the North of where I live, that is the only airport in my area that would accommodate an aircraft of that size. It appeared to be about 100' above the trees. It was flying from East to West towards Lake Tahoe across the Carson Valley. There were no lights on the rear of the object. I was wearing black pajamas and felt reasonably certain I would not be seen. I did not feel I was in any danger, I was curious as to what the object was. Later I had seen a clip on the news of two young fellows who had video taped with their cell phone an object that looked exactly like the object that I had seen. It took several minutes for it to cross the sky. Also, I did not have on any exterior lighting."],"Summary":"Viewed object flying across sky"}