{"Object Features":"Undisclosed","Country":"United States","Tags":"City","Summary":"strange craft flew directly over my house","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.017214,+-94.356401(30720)&iwloc=A&hl=en\"> mufon case (30720) map </A>","Disposition":"Hoax","Case Number":"30720","Longitude":"-94.356401","trends":["There has been one other sighting in Linden","There were no other sightings in Linden on or around January 31st 2006"],"files":["/var/www/straped/mufon/html2text/30720.html.txt","/var/www/straped/mufon/org/30720.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was outside having a cigarette on the west side of my home when i noticed a strange, bright light to the west. At first i thought it may be just an airplane with landing lights on, but then why would an airplane have landing lights nowhere near an airport? as this thought crossed my mind, i noticed that the lights started getting brighter and closer. Once i really, truly knew this wasn't a plane or helicopter (or anything else ive ever seen) the lights started coming towards me even faster. After just a few seconds the bright white lights were directly next to my house and i could then see the object itself. It abruptly slowed to a crawl almost and flew silently DIRECTLY over my head and house. It was shaped almost like a chevron. Triangular in the front,with another section in the back, instead of 2 points it was a straight line across the back...kind of like a child would draw a house. the lights were not on the front of the craft but towards the center of it. i believe there were 4 lights across the middle, and they seemed to be housed in some sort of...cockpit, i guess i would call it. The craft looked metallic, dark gray or black and very solid. I didn't notice any seams in the metal...just a solid sheet of something. As it flew right over my head, i could see the entire craft from front to back. Once it was nearly past my head, it started speeding up and i had to run to the front (north) of the house to see it. In the few seconds it took for me to run under the carport, it had sped up & started heading south. I watched as it zoomed away, faster than anything i've ever seen. I was simply curious when i first noticed the lights, but as it was directly over my head & it seemed as if i could almost reach up & touch it I did feel quite anxious and nervous...my heart was racing and i think i stopped breathing! After it was out of site and I realized what had really just happened, i was still excited and shaking but had to tell everyone in the house about it!"],"Sighting Duration":"Undisclosed","Latitude":"33.017214","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Chevron","Viewing Distance":"101-500 Feet","City":"Linden","Log Number":"US-08072011-0062","Date Submitted":"08/07/2011 02:54 UTC","Date of the Event":"01/31/2006 12:00 UTC","Region":"Texas"}