{"City":"rome","Date of the Event":"08/08/2011 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/30733.html.txt","/var/www/straped/mufon/more/30733_submitter_file1__u.f.o.sighting.jpg","/var/www/straped/mufon/org/30733.html"],"Log Number":"US-08082011-0016","Object Flight Path":"Hovering then path","Longitude":"-89.803972","Case Number":"30733","trends":["There has been one other sighting in rome","There were no other sightings in rome on or around August 8th 2011","This sighting has never been favorited.",""],"Summary":"hovered just south of my home, could only see it with night vision !","Date Submitted":"08/08/2011 07:54 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"IFO","divs":["Sighting Detailswent outside like I have for the last few months. It was about 12:23 am. and i turned on my night vision and looked up over the trees in the back yard. Just over lake sherwood. and a disk shaped object was hovering up and down and left to right. I could see it as it tilted and it would reflect a round shape. then it would be vertical as too see it directly the side side veiw which then it appeared very clear with the night vision. i thought I could stand to see it but it would become invisible. so i sat back down. then i could watch it as it hovered, shifting around but only moving witht the scope just a few inches from side to side and up and down. it was mostly visible as it seemed to try and vanish. but it couldnt. I couldnt beleive what i was seeing only throught the night vision so I had my girlfriend look from where I was sitting. she said she could see it as she watched it for about a min. she was very frieghtned and wanted to go inside. you could not see this with your own eyes at all. As i stayed and watched it for a bit longer. I thought it could be a reflection from some where. but after staying and watching it , it finnally moved to the west ins a sudden movement about 6 or 7 inches to the right.then stopped. it hovered then slowly moved behind the east tree. it came back out horizontally and hovered went back behind tree came back out same way . went back in and came back out vertical and side veiw so it was clear to me and took off and dissapeared in one second. I would not have been able to wittness this event if it wasnt for night vision. a week ago we both had an event of a 70's vw wagon sive floresant looking light about 1,000 feet in the air pass over our home very steady and slow. about 20 mph with no noise to it. maybe a slight electrical like humming, very faint sound. I feel like they know I am looking at them. I am a bit scared now, but i have seen many things over the years. as if i know when they are around. but these 2 events have really shakin me up ! God Bless ! I am not making it up as God as my wittness, So Help Me god we both wittnessed this."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.208687,+-89.803972(30733)&iwloc=A&hl=en\"> mufon case (30733) map </A>","Latitude":"44.208687","Object Shape":"Circle, Disc","Tags":"City","Region":"Wisconsin","Weather Factors":"Unknown"}