{"Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/30735.html.txt","/var/www/straped/mufon/org/30735.html"],"divs":["Sighting Details My husband and myself were sitting watching TV and we both heard some very loud booms that seemed to be hitting the front of our house. This was a series of several extremely loud booms similar to sonic booms, but slightly dfferent. They seemed louder and closer to the ground but at a distance possibly to the southwest of our home. We called the police and the dispatcher told us that they had gotten several calls about it and that they thought it was the wind. We know it was not the wind! We do not feel that the police treated this appropriately for whatever reason. They blew us off as they must have done to all of the other callers. How could they have had that answer so quickly? We are not totally sure of the date of this event but we had seen a TV show about the Kokomo event and we both thought that it could have been that same night. We do know it was around 10:30 PM. My husband went outside to check out everything with our house and did not see anything in the sky at all. This was one of the loudest noises we have ever heard."],"Country":"United States","Object Features":"Undisclosed","Tags":"City","City":"Dyer","Case Number":"30735","Object Flight Path":"Unknown","Date Submitted":"08/08/2011 11:44 UTC","Date of the Event":"04/16/2008 10:30 UTC","Latitude":"41.482973","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=41.482973,+-87.52719(30735)&iwloc=A&hl=en\"> mufon case (30735) map </A>","Longitude":"-87.52719","Summary":"We believe we may have heard the Kokomo Boom or booms or something like it.","Log Number":"US-08082011-0050","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Dyer","There were no other sightings in Dyer on or around April 16th 2008"],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Unknown","Source":"MUFON","Disposition":"Insufficient Data"}