{"Longitude":"101.690845","Case Number":"30732","Date of the Event":"08/07/2011 07:15 UTC","Object Shape":"Triangle","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=3.143713,+101.690845(30732)&iwloc=A&hl=en\"> mufon case (30732) map </A>","Object Flight Path":"Other","Date Submitted":"08/09/2011 03:39 UTC","trends":["There have been 4 other sightings in Kuala Lumpur","There were no other sightings in Kuala Lumpur on or around August 7th 2011"],"files":["/var/www/straped/mufon/html2text/30732.html.txt","/var/www/straped/mufon/org/30732.html"],"Country":"Malaysia","Log Number":"MY-08092011-0096","Source":"MUFON","City":"Kuala Lumpur","Latitude":"3.143713","Tags":"City","Disposition":"Unresolved","Summary":"A very bright golden triangular flying object","Sighting Duration":"00:00:10","divs":["Sighting DetailsI was swimming in my own pool around 0715pm on August 7th in the evening. The sun hasn't set yet and the sky was still very bright. There was no cloud at all and nothing in the sky except the moon they just came out. I was a very bright, glowing golden triangle in the sky. It was very clear, and I have 2.0 eyesight. I saw it flying and at first I thought it was a plane, but it didn't flash like a plane would. It suddenly moved towards right, then suddenly moved left. It just moved, not turned, unlike an airplane would turn with its head in the direction of where it's going, the triagnle didn't turn, just shifted from left to right and then out of my sight (because my rooftop blocked my vision). It was a sunday, and I'm pretty sure Malaysians do not have fighter jets or would fly anything on a sunday especially during fasting month. I live in an area where there is no building taller than my house in about more than 15KM radius, and there are only trees and jungle around my house. No airplane fly acorss my house, not that I have known of."],"Object Features":"Unknown","Viewing Distance":"Unknown","Region":"Federal Territory of Kuala Lumpur"}