{"City":"New York","Latitude":"40.767462","Longitude":"-73.925404","Viewing Distance":"20 Feet or Less","Sighting Duration":"00:07:05","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around May 18th 2008"],"divs":["Sighting DetailsThe first time I was with my ex girlfriend hanging out on her roof. We had a few beers but were sober for the most part. Then I realized that there where three glowing lights across from us about a mile away, aprox. It was ascending in a 45 degree angle. It was a weird angle because if you ask me a baloon would go straigt up. The red was glowiing off it as if there were red lights on the inside of the object. The one at the top would vanish first then the second and then the third. I also knew it was not a baloon at this point because how could they all vanish in the same spot basicly. 1)I was in Astoria, Queens. It was about 10pm to 12midnight. 2)The red light it was aluminating, 3 objects were seen flying on a weird 45 degree angle 3)Some sort of baloon, then again I didn't reall know because of the light it was illuminating 4)The 3 red round objects were ascending, they had a red light illuminating, they ascended in a 45 degree angle, the red objects were maybe 10feet from each other 5)It was very intresting to me because of the red light it was illuminating, after I saw them dissapearing in order from the top to the bottom object I was quite freaked out, felt better after I got off the roof and kept my mind off it 6)The ascending and the red object in the top dissapeared from the top one to the bottom one in the same area aprox The second time I saw something similar was on the 4th of July and I was in a different area from the first incident. I was with a friend and instead of 3 red objects I only saw 2 but they were the same! They were red objects that also ascended and dissapeared.***** In fact I urge you to search on youtube UFO IN HAMILTON BEACH that is 5 mins from my house. I'm in Howard Beach, NY. I'm 26 and I know I'm not crazy."],"Log Number":"US-08092011-0016","Tags":"City","files":["/var/www/straped/mufon/html2text/30746.html.txt","/var/www/straped/mufon/org/30746.html"],"Source":"MUFON","Date Submitted":"08/09/2011 07:26 UTC","Summary":"three red lights seemed like baloons ascended in a 45 degree angle the dissapeared in order from the top to the last","Date of the Event":"05/18/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.767462,+-73.925404(30746)&iwloc=A&hl=en\"> mufon case (30746) map </A>","Weather Factors":"Unknown","Object Shape":"Circle","Case Number":"30746","Country":"United States","Object Features":"Unknown","Disposition":"Unresolved","Region":"New York","Object Flight Path":"Straight-line path"}