{"Latitude":"34.141869","divs":["sighting detailsi was at the azusa foothill drive-in theater for my 16th birthday on 8\\12\\69. i remember almost every detail because it made such an impression on me; i even remember the movies we were seeing: how the west was won and the war wagon (double feature). it was during intermission after my mother and i came back with snacks from the snack bar. (time was between 9:30 and 10:10 pm estimate) we were sitting in the car and my mother saw it first and said \"what is that?!...pointing. i looked and saw a typical saucer shaped metalic craft with rotating lights. i was very clear and very solid, no mistaking what it was. i think that the rotating lights were blue, this i cannot recolect as well. it was not a blimp. i was familiar with a blimp shape. we saw it above the drive-in screen but further south (away from our position). it was traveling slow speed...slow as a standard airplane from the east towards west (our left to right). when the ufo reached our 2 oclock position, it sudden banked and i saw its underside... it took off instantaneously upward (but slightly toward the 11 oclock position). the speed of excelleration was so incredibly fast. no known airplane or jet could accellerate that fast. it was a blink of an eye. we looked out of the car to see if anyone might have seen the same thing. there was no indication that anyone within our sight was pointing toward the sky. but we could not see anyone behind us and there was perhaps 40 to 50 cars there. my mother would not talk about it afterwards, she seemed visably shaken. i will never forget, it changed my life. i can provide a drawing if requested."],"Object Features":"Other","Viewing Distance":"501 Feet - 1 Mile","Region":"California","trends":["There have been 9 other sightings in Azusa","There were no other sightings in Azusa on or around August 12th 1969"],"Tags":"City","Date Submitted":"08/09/2011 01:46 UTC","Country":"United States","Disposition":"Insufficient Data","Object Shape":"Disc","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","City":"Azusa","Summary":"Estmate 1000 feet up, standard saucer shape, rotating lights on saucer edge, slow east to west traveling then abrupt banking and rapid accelleration up at 11 oclock position. Speed more rapid than anything in existance.","files":["/var/www/straped/mufon/html2text/30741.html.txt","/var/www/straped/mufon/org/30741.html"],"Longitude":"-117.900863","Case Number":"30741","Date of the Event":"08/12/1969 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.141869,+-117.900863(30741)&iwloc=A&hl=en\"> mufon case (30741) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-08092011-0083"}