{"Tags":"City","Viewing Distance":"20 Feet or Less","Date of the Event":"11/30/2001 12:00 UTC","Country":"United States","Summary":"Low flying Jet. like object wing span tip to tip 15ft","Longitude":"-122.318198","Object Shape":"Other","Region":"Washington","divs":["Sighting DetailsAround midnight my freind and I witnessed a UFO flying surprisingly close to the house. We were inside the second story of the house looking out the window at the stars. We were able to get a excellent view of the object as it passed the large window, 15 yards away and right above a 30ft cherry tree. A extremely low flying object resembling a grey jet with an almost flat underside, passing through the back yard. Travling in a straight path, no signs of slowing or exeleration staying at a medium slow pace. This object didn't act, sound, or look like an ordinary jet but in no way was a model. 3-4 lights undearneath glowing one solid color red or green, approximatley 3-4ft in diameter. The object had a wingspan of approximately 15-20ft. I was stunned and excited about what we had just witnessed. If I was older at the time this happend I would have pursued it. Somthing odd is that it didn't produce any sound for how big it is. I did some research afterwards to see if this could have been a model, but didn't come up with anything that resembled it. The size could probably be mached. If anyone was controlling it they would have had one hell of a time trying to land it in the neightborhood yet alone trying to keep there eyes on the craft. The only point of visbility of the craft at the time was from the back yard, until the craft went over more trees, higher into the sky, and going over houses."],"files":["/var/www/straped/mufon/html2text/30742.html.txt","/var/www/straped/mufon/org/30742.html"],"Weather Factors":"Unknown","Date Submitted":"08/08/2011 05:38 UTC","Log Number":"US-08082011-0103","City":"Burlington","Case Number":"30742","Latitude":"48.483462","map":"<A HREF = \"http://maps.google.com/maps?q=48.483462,+-122.318198(30742)&iwloc=A&hl=en\"> mufon case (30742) map </A>","Object Features":"Wings","trends":["There have been 8 other sightings in Burlington","There were no other sightings in Burlington on or around November 30th 2001"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Source":"MUFON"}