{"Longitude":"-116.8563","Object Features":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.449009,+-116.8563(30743)&iwloc=A&hl=en\"> mufon case (30743) map </A>","Region":"California","Latitude":"33.449009","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-08092011-0088","Object Shape":"Oval","Case Number":"30743","Weather Factors":"None","divs":["sighting detailsmy husband and i were sitting outside looking at the stars at approximately 9:00 pm. we live in a rural area so it is very dark, great for stargazing. we were complaining about the noise of a neighbor, when we heard a helicopter approaching and i laughed and said that i was also tired of the sounds of the many military helicopters that fly over at all hours of the night. so we were waiting for the helicopter to pass over, when we saw 2 blue balls of light flying in tandem with the helicopter flying slightly below the blue balls of light. it appeared like the helicopter was trying to follow the blue balls of light, but the lights were much faster than the helicopter. within a matter of a few seconds, the balls of light had zipped across the sky and out of our view. you couldn't see an actual aircraft, the entire aircraft appeared as a blue light. the blue balls of light were close to the same size as the helicopter, but definitely not the same shape. they were oval\\disc shaped. the only sound was that of the helicopter. i'd say that the lights were within 1000 ft distance from where we were sitting. my husband and i were both dumbfounded, even though both of us had witnessed a ufo in december of 2010. we talked about what we saw, and both of us had the same description of the event. we both agreed that it was like something out of a movie, in fact it best reminded me of the scene in close encounters where the lights are flying over the spectators on the highway. we stayed outside for a while afterwards, hoping to see it again. we saw planes and noticed the difference between planes and what we saw. planes are much slower, you can distinctly hear them, and they have flashing blue\\red lights."],"Date Submitted":"08/09/2011 03:09 UTC","Date of the Event":"07/28/2011 09:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30743.html.txt","/var/www/straped/mufon/org/30743.html"],"Disposition":"IFO","Country":"United States","Summary":"Two Blue Balls of Light near Temecula","City":"Aguanga","Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There has been one other sighting in Aguanga","There were no other sightings in Aguanga on or around July 28th 2011"]}