{"map":"<A HREF = \"http://maps.google.com/maps?q=52.912524,+-0.643582(3076)&iwloc=A&hl=en\"> mufon case (3076) map </A>","trends":["There have been no other sightings in Grantham","This sighting has never been favorited."],"Source":"MUFON","Summary":"orange oval","Sighting Duration":"00:30:00","Case Number":"3076","City":"Grantham","divs":["Sighting Details1. i was delivering milk driving along the A52 from Grantham to Bottesford2. i noticed a street lamp that seemed to be out of place as i was travellingdown the road3. i thought it was a street lamp that had been hit4. as i got nearer to where the street lamp should have been, it kept alomst thesame distance away from my line of vision. as i still could see the object itried to keep it in sight until i lost sight of it as i entered the village ofBottesford in Nottinghamshire and wondered why a plane or helicopter would beflying that low. after i went through the village to my first delivery point, inoticed the object hovering above a field.5. when i saw the object, i stopped my engine and watched an orange ovalhovering underneath a bank of fog which i thought was strange as i could seestreet lights on the horizon which would have come from either Bingham orNottingham as there were no clouds visible. there was no defined outline to theoval as it seemed to be fuzzy but there were black markings on the oval as itspun from bottom to top.6. after watching the object for about 5 minutes, it slowly moved up into themist and vanishedi then went to make my first delivery and when i returned about 5-7 minuteslater, nothing was visible over the field, no mist or light."],"Viewing Distance":"21-100 Feet","Date Submitted":"11/30/1990 01:30 UTC","Country":"United Kingdom","Weather Factors":"Unknown","Longitude":"-0.643582","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/3076.html.txt","/var/www/straped/mufon/org/3076.html"],"Disposition":"IFO","Date of the Event":"11/30/1990 01:30 UTC","Latitude":"52.912524","Object Features":"Patterned Surface","Tags":"City","Region":"England","Log Number":"","Object Flight Path":"Straight-line path"}