{"Log Number":"US-08092011-0108","City":"Redstone","Date Submitted":"08/09/2011 04:20 UTC","Weather Factors":"Unknown","Date of the Event":"08/04/2011 10:10 UTC","Longitude":"-105.025474","map":"<A HREF = \"http://maps.google.com/maps?q=34.97888,+-105.025474(30765)&iwloc=A&hl=en\"> mufon case (30765) map </A>","Summary":"Object seen from horizon rushing towards our vehicle tremendous speed","Country":"United States","Object Shape":"Disc","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/30765.html.txt","/var/www/straped/mufon/org/30765.html"],"Latitude":"34.97888","Sighting Duration":"00:00:30","Tags":"City","Region":"New Mexico","trends":["There have been no other sightings in Redstone","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Object Features":"Unknown","Disposition":"Unknown","divs":["Sighting DetailsWe were traveling from Flagstaff Arizona to Silver City New Mexico on August 4th. A few miles before we got to Redstone, NM in the Gila National Forest headed south on Highway 15, I was looking out the rear left passenger window around 10:10 pm trying to identify the constellations I was seeing when suddenly a lighted object came flying towards our car at tremendous speed, i tried to alert the other people in the car but could not speak - they said i exhaled roughly and made an UFF! sound. They turned down the audio book we were listening to and asked what was wrong and I told them about seeing the UFO. No one else was looking out at the sky at the time. My first thought was that is not an airplane or anything we could make it flew way too fast. It was saucer shaped - entire bottom was lit - but the top was dark. From the direction we were travelling it would have come from the Southeast headed Northwest. At first it looked to me like it was headed straight for the car and it passed relatively low - much less than the height of a regular airplane - from far away it was just a very bright light but it grew bigger as it approached - by the time it crossed out of my sight over the car it was the size of just larger than a golf ball. The sight of it took my breath away and that's why i couldn't yell - hey - its a ufo - besides - it was flying so fast - u would only see it if u were looking right at it at the time. Afterwards, everyone else was staring out the window to see if it would come back - while i was praying in the back seat that it would not - i was afraid. We had no cell service and we were in the middle of nowhere..."],"Source":"MUFON","Case Number":"30765"}