{"Log Number":"US-08092011-0086","Weather Factors":"Unknown","Latitude":"42.586174","Date of the Event":"07/04/2008 09:40 UTC","Date Submitted":"08/09/2011 02:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.586174,+-83.845087(30767)&iwloc=A&hl=en\"> mufon case (30767) map </A>","Region":"Michigan","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Howell","files":["/var/www/straped/mufon/html2text/30767.html.txt","/var/www/straped/mufon/org/30767.html"],"Disposition":"Unknown","Case Number":"30767","divs":["sighting detailsi was standing in the street with five other adults between the ages of 35-45, all sober. we were talking about the fireworks that i had purchased and was about to light when out of the corner of my eye i saw a very fast moving object that caught my attention as well as the other 5 people. as we watched it with pure amazement, i coudnt believe what i saw. by the time i picked up on the ufo, it was right over the top of us flying from east to west at over mach 8 or greater. by the it reached the western horizon the object split into to two and then re emerged as one before dissapearing over the horizon. it took about 7-10 seconds to fly from over top of us to the horizon and so, anyone that flies conventional aircraft would know that it would take much longer to fly that distance than that of our modern day aircraft. in summary, i have over 8000 hours of flight time as a cfii, atp, and have been flying private jets for over 14 years. i have seen many things while flying at fl410 and greater to know that this sighting was not an aircraft. all of us standing there saw the same thing.....it was not fireworks either. only four of us wanted to talk about it, the other two i think either did not know enough about aviation or had enough common sense or, simple were in denial about the sighting. one of the guys is a radio disc jockey for a big station in detroit so i think that he felt that he talked about it that he would be compelled to anounce it on his next radio session. anyway, call it what you will but i\\we know what we saw. please feel free to drop me a message if you have any comments or questions. regards"],"Longitude":"-83.845087","Object Flight Path":"Path with directional change","Object Shape":"Diamond","Tags":"City","Viewing Distance":"Over One Mile","Summary":"This object flew from East to West at over Mach 8 and changed directions 2 times very smoothly. I am a ATP with 8000 hours, this was not created by earthbound engineering.","Object Features":"None","trends":["There have been 20 other sightings in Howell","There were no other sightings in Howell on or around July 4th 2008"],"Country":"United States"}