{"Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"US-08092011-0088","Viewing Distance":"Unknown","Summary":"3 to 5 HUNDRED points of light(like stars in the sky)in no particular formation. moving together at","map":"<A HREF = \"http://maps.google.com/maps?q=44.664432,+-93.187773(30761)&iwloc=A&hl=en\"> mufon case (30761) map </A>","Disposition":"Unknown","divs":["Sighting DetailsI went outside to have a cigarette(10:50 p.m.) I was standing in the drive way. I looked up at the sky and noticed a point of light moving thru the sky. I thought\"A Satelite\" or something like that. I laid myself down on the front step to watch it.There was \"some\" cloud cover moving slowly over head (west to east). I was watching this point of light moving South to North, when I noticed what looked like maybe 10 or 15 points of light, moving together from south to north. I then realized that it wasn't just 10...it was 30, then 50, then a 100. I realized I was looking at hundreds...like maybe 3 to 5 HUNDRED points of light. I STOOD UP. I couldn't believe what I was seeing. It was as if the stars were all moving!!!!! I watched the event for maybe 3 minutes or so. Then they were gone. Out of sight. But Wait,...Now there are more of them. Only, this group is going east to west. I thought maybe this was some kind of illusion created by the cloud cover moving overhead. So,...I held my cigarette pack up against the sky..to provide a \"Stationary Object\" to use as a Guideline. Yes, they were indeed moving past my cigarette pack...rather quickly!!! I Still didn't believe it. So,...I got a pole out of the garage, and steadied it on the driveway. Yes,..they were moving. All of them at the same speed(no particular formation) It took about five to seven minutes for this east to west group to go from horizon to horizon(That's FAST). They had the appearance of \"stars in the sky\".Very high up in the air,...Maybe outside the earths atmosphere...I don't know,... because i don't know how big they actually are. I've seen alot of weird stuff in the night sky,...NEVER anything like this !!!!! I still feel like it just couldn't be so. But I also know what I saw!!! It's Kinda Scary !!! I THINK MAYBE WE SHOULD START PAYING MORE ATTENTION TO WHAT'S GOING ON IN THE SKY AT NIGHT. I seem to be \"seeing a steadily increasing amount of activity\" in our night sky. Particularly in the North, and West, and straight up overhead."],"Latitude":"44.664432","Longitude":"-93.187773","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Date Submitted":"08/09/2011 03:08 UTC","Region":"Minnesota","trends":["There have been 3 other sightings in Farmington","There were no other sightings in Farmington on or around August 8th 2011"],"Object Shape":"Star-like","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30761.html.txt","/var/www/straped/mufon/org/30761.html"],"City":"Farmington","Date of the Event":"08/08/2011 10:55 UTC","Tags":"City","Case Number":"30761"}