{"Date Submitted":"08/10/2011 05:29 UTC","Sighting Duration":"00:00:10","divs":["Sighting DetailsOn Sunday August 7th, 2011, myself and my husband were at a light going North on Ft. Harrods Dr., crossing Harrodsburg Rd. (Lexington, KY) It was approximately 6:30 PM and the sun was still very bright in the sky. It was a cloudy day with large billowing clouds. Temperature was warm to hot. While sitting at the stop light I looked to my left (I was the driver of vehicle) and I noticed an amazingly beautiful cloud formation. It looked almost like a hand holding a ball of energy... which of course, was the sun. There were beams of light beaming all across the sky. I immediately grabbed my iphone and told my husband to look at the clouds. He glanced at it, but I told him... \"No, seriously, LOOK! Its gorgeous!\" At that moment, I started saying out loud to myself, \"Please dont turn green. Please don't turn green. (Speaking of the stoplight.)\" I grabbed my iphone and I took a series of 9 photographs of the cloud from out of the rolled down window of the car. These photographs were taken very fast. I believe all were taken in a matter of seconds because the camera on the iphone is rather fast. This proves to be very important since the photos show the object in question moving in different directions. Something I believe may be worth mentioning is that we believe the light skipped us... in other words, it did not turn green for us when it should have. My husband made mention of this because he was frustrated and making a joke that if I hadn't \"begged\" for the light to NOT turn green, that we could have already made it across the street. This is ironic, simply because if the light had turned green when it should have, I never would have captured the picture, and I especially would not have had those extra seconds to take more than one photo of the cloud. So, not another thing was said or remembered about the cloud until I went to bed that night about 2 hours later. I laid down and remembered the photos and I wanted to pick the best one I took and post it on facebook. When I went to look through the photos, I did not immediately notice the object in the picture. Then suddenly, I saw it. I thought, oh, thats probably just a cloud, moon, speck, whatever. But then it was in the next picture, then the next, then the next. And if you flip though the photos very fast, it appears to be moving at a very high rate of speed in different directions. And since I took the photos in under 8-10 seconds, I know there is nothing I know of that looks like that or can fly that fast. The object appears to be an orb or sphere. It is glowing white with dark shadows within the orb. It appears in the second photo suddenly. Seeming to move toward the camera. Then it glows with a aura of pink surrounding it almost in a saucer shape. This could be a glare from the bright sun though. It then shoots straight up very fast. Im definately not a scientist, but I don't know of anything that could move that fast. Also, in one photo, after close observation, not only does the orb appear in the photo, another 3 \"white dots\" appear to the center right. My guess is it is another orb that I caught in the photo that was moving so very fast that it left tracers behind it. Again, I did not see this with my naked eye. Neither did my husband. This ALL appeared in the photos. After realizing what we had possibly photographed. I had no clue what to do. After internet searches I was able to find the Mufon site and the name and number of the former KY Mufon director. I called him and spoke with him for a good hour or so. I emailed him the photos and he said he would forward it to the new director. I have not heard back as of yet. As far as my opinion goes, I may not be an educated researcher on things like this, but common sense and deduction and research go a long way. The biggest top 2 possibilities in my mind were that the image could be the moon. Except its moving and after finding out where the moon was located, which was in the EAST, I ruled that out, since the photo is taken toward the West and we were facing North. The other thought was that it could have been a planet, but the size and the fact that it was broad daylight eliminates that. As well as the fact that it moved very fast. In retrospect, and to this moment, I am forever changed. I truly believe that what I saw was a true UFO. No question in my mind, yet I am anxious and willing to do whatever it takes to investigate this occurance, Nothing like this has ever happened to me, and although I have always been very openminded to the possibility, I never truly had faith in something like this until now. I have this feeling that no one will believe me. But frankly, I could care less. I know myself, my friends and family know me, and I know that I'm not lying or pulling a prank or trying to gain recognition etc. These photos are as real as they come and I encourage and truly plead with those in the position to investigate and who have researched these events, to PLEASE call me, contact me, etc., and I will do anything and everything to help you. I want to know what I saw. Please please contact me or send me info on someone else I can contact. I don't want a huge amount of time to go by before this is researched and analyzed. Mainly because I want to be of the greatest assistance, and I'd like everything to be fresh in my mind as well as the photos. PLEASE NOTE, I have 9 pictures in sequence, and I could not upload them all. In the first picture you will see the pink glow around the orb, this was taken a few pictures into the series. The next photo shows the orb moving a great distance upward. Also, on the center right hand side, there are the 3 bright dots. It may not come across as clear uploaded from my computer as it does on my iphone. And the third shows it even higher in the sky."],"Log Number":"US-08102011-0030","Latitude":"38.009259","Case Number":"30770","Viewing Distance":"Unknown","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/30770.html.txt","/var/www/straped/mufon/more/30770_submitter_file1__photo-6.jpg","/var/www/straped/mufon/more/30770_submitter_file2__photo-11.jpg","/var/www/straped/mufon/more/30770_submitter_file3__photo-10.jpg","/var/www/straped/mufon/org/30770.html"],"Summary":"I photographed a beautiful cloud formation with the sun shining through it, and when I got home to check the photos, a fast moving orb appeared in 7 out of nine of the photos.","map":"<A HREF = \"http://maps.google.com/maps?q=38.009259,+-84.561741(30770)&iwloc=A&hl=en\"> mufon case (30770) map </A>","Object Features":"Other","Date of the Event":"08/07/2011 06:30 UTC","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around August 7th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Tags":"City","Region":"Kentucky","Object Flight Path":"Path with directional change","City":"Lexington","Longitude":"-84.561741","Object Shape":"Circle, Sphere","Disposition":"Unknown"}