{"Country":"United States","Longitude":"-92.374889","Region":"Minnesota","Date of the Event":"08/04/2011 02:30 UTC","Sighting Duration":"Undisclosed","Object Features":"Other","trends":["There have been 13 other sightings in Rochester","There were no other sightings in Rochester on or around August 4th 2011"],"Viewing Distance":"20 Feet or Less","Object Flight Path":"Other","City":"Rochester","Tags":"City","Log Number":"US-08092011-0127","Case Number":"30774","map":"<A HREF = \"http://maps.google.com/maps?q=44.00107,+-92.374889(30774)&iwloc=A&hl=en\"> mufon case (30774) map </A>","divs":["Sighting DetailsI recently installed an inferred outdoor security camera that I can view from a TV in my bedroom thru the vcr player. Unfortunately I didnt have a tape inserted. The camera is located approximatively 10 feet east from my bedroom window. The camera is partially hidden by a tomato plant that I have planted in a pot on the edge of my driveway. At 2:30am I was sitting in bed surfing the web on my home pc. I glanced up at the TV which is attached to my wireless inferred security camera. I saw an object hovering directly in front of my camera. The object was rectangular with a definite outline all the way around. There were 2 diamond shaped in the middle of this rectangular bar. The diamonds were spaced evenly apart and evenly from each edge on all sides. It was directly in front of the camera and appeared to be investigating the small red inferred lights that make a circle around the lens. These lights are fairly bright and can be seen from a distance away. The object would hover towards the lights directly in-front of them than back up aways. It moved sided to side, up and down, towards the inferred lights and than away from the lights. Each time coming back and looking directly into the lens as trying to figure out what it was. The movements were fast and sometimes appeared jerky. The further away it went each time the fuzzier the object became. When it was directly in front of the lights hovering, the object had perfect shape and the diamonds were very visible and each diamond the same size. The further the object darted outward the less the diamonds were visible. The further out it went the fuzzier it became. I could see there was something dark in the center of the rectangle but couldn't make out the diamonds until it zoomed closer to the red inferred circle of lights as if almost touching it but never doing so. When I noticed this object on my TV I immediately stood up between my bed and the window that the object was at. I than dropped to the floor fearing the unknown. I slowly stood back up and turned off all lites to the room. I peaked out the side of the curtain and saw my camera but nothing else. I looked back into the TV and the object was still there and very visible. Darting up and down, back and forth, and side to side. Fast movements. I turned on the outside light that is approximatively 15 feet from my camera and the object. I returned to my bedroom with the outside light still on. The object was the same with no change from the light being on. I couldnt see anything thru my window only on my TV. The outside light glowed on my camera to give me some vision. I still saw nothing thru my window. After 40 from first seeing this object it disappeard. Poof...Gone! This same scenario happened 2 nights in a row at the exact time of night. On the third nite I noticed a limb from the tomato plant was broken and blocking any vision in front of the camera. The broken limb of the plant is directly above the camera about 1 inch. That third nite I turned off the camera being the broken limb was obstructing all vision in front of the camera. It was late and very dark so I didnt venture outside to move the limb. I live in a small community outside the City Rochester Minnesota a fairly large city. There is lots of wooded area where I live. My car was parked inside the garage and there is no street lights where I live. There was nothing in the driveway but my camera and tomato plant...and this object. I have a new pc and for some reason it wont allow me to use my scanner, download or upload. I cant seem to take over ownership from Microsoft. Which leaves me with read and write privileges only. Im sorry I cant include a sketch of this object."],"files":["/var/www/straped/mufon/html2text/30774.html.txt","/var/www/straped/mufon/org/30774.html"],"Latitude":"44.00107","Summary":"a small white rectangular bar with 2 diamond shapes equally spaced apart.","Object Shape":"Square, Rectagular","Date Submitted":"08/09/2011 07:44 UTC","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unknown"}