{"divs":["Sighting DetailsMy husband and I were surf-fishing off Cocoa Beach, FL around 1 o'clock in the morning. We had separated from one another by about 25 yards...far enough that we couldn't hear each other over the waves. I was just about to cast into the surf when I saw something flying slowly above over my right shoulder. It was a bright green, fuzzy ball of light flying overhead from the land towards the water. It flew above and between my husband and I keeping the same height and speed...about 10-20mph. It just kept flying out over the water until it disappeared into the distance. I started walking back towards our bait bucket thinking about what the hell I just saw. By the time I reached the bait bucket on the beach I had convinced myself I was seeing things. But I knew I HAD seen something because this sighting lasted long enough to question myself about what it was I saw. My husband had walked back too and the first thing out of his mouth was \"Did you see that bright green fuzzy light?!?\" I was so relieved he had seen it too, although it would have been impossible for him not to see it because it was close, flying slow and it was the middle of the night and was the brightest thing in the sky. We have no idea what it was and we still talk about it to this day."],"files":["/var/www/straped/mufon/html2text/30783.html.txt","/var/www/straped/mufon/org/30783.html"],"Tags":"City","City":"Cocoa Beach","Object Features":"None","trends":["There have been 10 other sightings in Cocoa Beach","There were no other sightings in Cocoa Beach on or around April 30th 2005"],"Case Number":"30783","Date of the Event":"04/30/2005 01:00 UTC","Date Submitted":"08/10/2011 01:46 UTC","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Summary":"Fishing off Cocoa Beach, FL and a bright, fuzzy, bright green object flew above us to out over the water.","Source":"MUFON","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.324497,+-80.600851(30783)&iwloc=A&hl=en\"> mufon case (30783) map </A>","Log Number":"US-08102011-0005","Weather Factors":"None","Object Shape":"Circle","Region":"Florida","Longitude":"-80.600851","Object Flight Path":"Straight-line path","Latitude":"28.324497"}