{"Viewing Distance":"101-500 Feet","City":"Leechburg","Weather Factors":"Unknown","Latitude":"40.63582","Object Shape":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.63582,+-79.603711(30787)&iwloc=A&hl=en\"> mufon case (30787) map </A>","files":["/var/www/straped/mufon/html2text/30787.html.txt","/var/www/straped/mufon/org/30787.html"],"trends":["There has been one other sighting in Leechburg","There were no other sightings in Leechburg on or around August 10th 2011"],"Date Submitted":"08/10/2011 06:32 UTC","divs":["Sighting DetailsI was sitting in my car eating the food i just got when an orange glowing sphere appeared about 300-500ft away from me. It moved slowly towards where i was sitting and was about 1000ft in the air. It was at least 100ft in diameter and after about 30sec it disappeared. I have seen at least 7 disc's, sphere's, and cigar shaped ufo's in my area over 3 months. Some in the daytime, some at night. I'm 29yrs old and am sick of government and military entities keeping alien life from us. Whether it's religious beliefs or the fact that us, the people, are treated like slaves and piggy banks and the government doesn't want it's money makers to leave the earth, these people need to tell the truth finally cause its long overdue. This is the last time i'm reporting what i have seen because it's not helping. Mabey you, mufon, is also playing a part in this giant cover up of the greatest thing any of us humans could ever see and be a part of. Theres so much undeniable proof and testimony from credible witnesses that this should be common knowledge by now. I hope that there are peace loving non superficial alien entities out there that would welcome other peaceful humans to join their society because i am sick of the lies, deceit, and deception of this government and agencies helping stupify its people and keeping them in the dark. I would give my life to have the world finally see its alien brothers. If it takes a mob of people storming into area 51, then so be it. Disclosure will happen sooner than later if you like it or not. Get ready evil war mongering gov't and military, cause the people are p**** and sick of your evil twisted ways."],"Object Features":"Undisclosed","Longitude":"-79.603711","Disposition":"Unknown","Date of the Event":"08/10/2011 11:30 UTC","Summary":"Sitting in car eating, object came into view, moved slowly, dissapeared.","Sighting Duration":"00:00:30","Log Number":"US-08102011-0008","Tags":"City","Case Number":"30787","Country":"United States","Region":"Pennsylvania","Source":"MUFON"}