{"Latitude":"20.08756","files":["/var/www/straped/mufon/html2text/30786.html.txt","/var/www/straped/mufon/org/30786.html"],"Summary":"appeared from no where, Shot through the sky like a bright missle/oval shape then expanded and radiated light then dissappeared","Date Submitted":"08/10/2011 06:38 UTC","Region":"Hawaii","City":"Honokaa","Object Shape":"Blimp, Bullet, Missile, Egg, Fireball, Flash, Oval, Sphere, Teardrop","Object Flight Path":"Straight-line path","Log Number":"US-08102011-0032","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=20.08756,+-155.46047(30786)&iwloc=A&hl=en\"> mufon case (30786) map </A>","divs":["sighting detailsi was in honokaa, big island of hawaii at 10:40 pm. after dinner my uncle, his friend and myself were on the front porch when i see an object which my first thought was a shooting star. the area i am in when this event took place has many shooting stars every night and immediately realize it wasn't. i point and say oh s*** and the two people im with turn and look the whole time my focus remains on the object. i noticed it because i was staring right where it seems to appear out of thin air. it was a ball of light that resembled an egg\\oval\\missile leaving a pretty large trail that glowed just as bright behind it. we watched it cross the sky for about 3-5 seconds when it accelerated and the object itself expanded or glowed brighter and disappeared. the way i felt during the sighting was complete shock and awe because i thought i was witnessing an awesome shooting star and instantly realized it wasn't at the point i knew it wasn't a shooting star i knew immediately it was a ufo not a doubt in my mind. after the sighting my adrenaline was rushing and was also a little bit freaked out. to be honest i believe in et, aliens, other intelligent life but when i witnessed this event it put to rest any doubt there may have been. and niether myself nor the two other persons i was with were under the influence of any type of drugs or alcohol which would be further proof that what we saw was really there. after the whole even i did notice a plane flying in the area the object was seen, but there is a flight path to hilo international and may have been a commercial flight. to add to the previous sentance the object seen was flying across the flight path and did not resemble anything close to an airplane-at least not one that exists on this planet that i know of. also there was a cruise ship clearly visible at sea with all its lights on-im assuming it was a cruise ship but am more then certain since i have seen them pass by before."],"Tags":"City","Source":"MUFON","Country":"United States","Disposition":"Unresolved","Longitude":"-155.46047","Weather Factors":"Unknown","Case Number":"30786","Object Features":"Unknown","trends":["There have been 2 other sightings in Honokaa","There were no other sightings in Honokaa on or around August 9th 2011"],"Viewing Distance":"20 Feet or Less","Date of the Event":"08/09/2011 10:40 UTC"}