{"Case Number":"30794","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=53.137799,+0.339945(30794)&iwloc=A&hl=en\"> mufon case (30794) map </A>","Date Submitted":"08/10/2011 01:52 UTC","Longitude":"0.339945","Tags":"City","Country":"United Kingdom","Weather Factors":"Unknown","Region":"","Summary":"UFO seen following a plane at very high speeds. It glowed a reddy/orange colour. Very surreal.","Log Number":"GB-08102011-0013","Date of the Event":"08/09/2011 09:50 UTC","Object Shape":"Triangle","trends":["There have been no other sightings in Skegness","This sighting has never been favorited."],"City":"Skegness","divs":["sighting detailson the 9th of august 2011, at roughly 21:50, i observed what seemed to be a ufo. i was in my bedroom looking out of the window into the sky and i noticed a plane fly by at regular altitude and speed. just as it escaped from my line of sight, a red\\orange, pulsating\\blinking object appeared out of nowhere at roughly the same altitude but it's speed was nearly unbelieveable. it must have been travelling atleast 4 or 5 times quicker than the plane that just flew by. 2000-2500 mph would be a rough estimate of it's speed. it looked as if it followed the exact same flight path of the plane (south east). it flew in a straight line as if it was chasing the plane for some reason. it flew in a way that seemed too perfect. it felt like a dream or like i was imagining it. i dismissed it like it meant nothing but earlier on today (10th of august 2011) my friend informed me that he also saw a ufo at the same time on the same day. i told him to describe everything about it and from what i gathered from him, it must have been the same light i saw the previous night. i realised i had to report it to clear my mind but i know i'll probably never know the truth..."],"Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Unknown","Latitude":"53.137799","files":["/var/www/straped/mufon/html2text/30794.html.txt","/var/www/straped/mufon/org/30794.html"]}