{"City":"Philadelphia","Log Number":"US-08102011-0038","Date Submitted":"08/10/2011 10:53 UTC","Tags":"City","Latitude":"39.955505","Object Shape":"Circle","Country":"United States","files":["/var/www/straped/mufon/html2text/30799.html.txt","/var/www/straped/mufon/more/30799_submitter_file1__UFOorbsseenonjuly30th.png","/var/www/straped/mufon/org/30799.html"],"Object Flight Path":"Stationary","Disposition":"Unresolved","Longitude":"-75.161069","Viewing Distance":"21-100 Feet","divs":["Sighting Detailsgoing to work on Paletown Rd in Richland Town PA. Noticed brite orbs hovering in the sky in a dark field to my right. Had a staircase pattern to them - sitting in the sky - pattern like they were on a staircase. No noise, no movement at all. White roundish colored orbs with a redish, orange, outline around the orbs. Had to go to work could not stop to investigate. But it is an area I know very well. I drive down this road every night and I never saw anything like this. Had a car driving behind me as I was looking at these objects - could not stop my car - had a tailgatter behind me. If I were not going to work and did not get points for being late or absent I would have pulled over and gotten a much better view of these things. I had a previous sighting back in 1977. A saucer was sitting over my house in Doylestown pa. I have already reported the story many years ago so I won't go into it again. I am surprised to witness another ufo event but after you see what I have seen close up. I already know that ufo's are real and coming here for an unknown reason. Probably just investigating like we do on unknown planets."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.955505,+-75.161069(30799)&iwloc=A&hl=en\"> mufon case (30799) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around July 30th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Features":"Undisclosed","Summary":"brite orbs hovering in a staircase pattern up into the sky","Case Number":"30799","Region":"Pennsylvania","Source":"MUFON","Date of the Event":"07/30/2011 09:50 UTC"}