{"Summary":"Hockey Puck like object with five bright lights over Kansas City","Country":"United States","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around August 9th 2011","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Object Shape":"Other","Tags":"City","Region":"Missouri","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/30796.html.txt","/var/www/straped/mufon/more/30796_submitter_file1__hockeypuckufo08092011001.jpg","/var/www/straped/mufon/org/30796.html"],"City":"Kansas City","divs":["sighting detailsas reported to asd by phone today by the witness who wishes to remain anonymous: \"i was driving to pick up a late dinner at gates barbeque on 40 highway in independence, missouri when i noticed a strange black or dark color object in the sky to the west of me headed in a southeast to northwest direction. it looked like the shape of a hockey puck with a slightly raised top and bottom. it had five very bright round white lights on the side of it, and that is what really caught my eye since you don't normally see planes or helicopters with lights like that. the lights did not pulsate or move. the object moved along the same flight path the entire time i watched it while driving to gates, but once i got to my destination the trees blocked my view and i could no longer see it. the object was at 50-60 degrees up from the horizon and it would take 1\\3 or more of a thumb to cover it up. there was no sound or emissions, and it moved at about the same rate of speed as a commercial aircraft would, except it was flying pretty low-- lower than commercial aircraft fly around here. the airports are not close to this area so we don't see low-flying aircraft except for the occasional helicopter. i just thought this was really odd and decided to call someone to tell them about it. i'm sending a drawing.\""],"Date Submitted":"08/10/2011 06:12 UTC","Log Number":"US-08102011-0032","Date of the Event":"08/09/2011 10:30 UTC","Weather Factors":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.108586,+-94.573967(30796)&iwloc=A&hl=en\"> mufon case (30796) map </A>","Longitude":"-94.573967","Case Number":"30796","Disposition":"Unknown","Latitude":"39.108586","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown"}