{"Source":"MUFON","Summary":"Many(15)/Black/Some large and some small","Region":"Walloon Region","Sighting Duration":"Undisclosed","Longitude":"3.912043","files":["/var/www/straped/mufon/html2text/30791.html.txt","/var/www/straped/mufon/more/30791_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/30791.html"],"Date of the Event":"08/10/2011 04:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=50.49979,+3.912043(30791)&iwloc=A&hl=en\"> mufon case (30791) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"30791","Country":"Belgium","divs":["Sighting DetailsI was outside my house in the middle of the day, next to a friend of mine outside trying to get the last of the summer weather. Then out of nowhere he points out black objects. At first I thought that it was just ballons , and later they start to pop out one by one really fast and it happened in a matter of seconds.So without looking back I ran in the house to get a camera. As I was running back I said I do not want to lose site of the black objects. What made me first notice the objects was a large black dot which then as I fousced the camera I shot the picture then ten seconds later it was gone. As I zoomed in I noticed next to the black object there were smaller ones. My friend pionted out that there was also a glowing object behind the clouds. As if you view it on the camera the clouds were a lot whiter before I took the picture. Then as I took the picture I could see that the glow was next to the big black dot and that the cloud was a lot clearer. And afterwards the cloud then become all white again. But, what got me the most was the number of objects that appeared. The black dots just disappeared out of nowhere. I also noticed after I went in thinking of what the objects were I tired to turn on the tv but it would not turn on, but as 5 minutes went by it turned back on."],"City":"Mons","Log Number":"BE-08102011-0010","Tags":"City","Date Submitted":"08/10/2011 10:53 UTC","Object Flight Path":"Stationary","Object Features":"Other","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in Mons","There was one other sighting in Mons on or around August 10th 2011","This sighting has never been favorited.",""],"Latitude":"50.49979","Object Shape":"Egg, Oval, Sphere"}