{"divs":["Sighting DetailsMy daughter and I were driving home from Walgreens and were approaching a stop sign on Moss Hollow at Hwy M. We both noticed something orange in the air and could see glimpses through the trees as we drove. When we got to the stop sign, we had an unobstructed view on our left side of what appeared to be an airborne object on fire hanging in the sky. I pulled my car over at the stop sign and we both watched this smokeless \"fire\" hover over Hwy M. The object seemed to be no more than 200 feet from the ground and was about 300 feet southwest of my vehicle. It sat absolutely motionless and was not producing any noise whatsoever. After about 10 seconds of my daughter and I staring in scary amazement, the red & orange ball of fire began rising straight up and then shot off to the east. It flew east very, very quickly, faded in the sky and then disappeared completely. When we arrived home, I got on my laptop and started searching for \"flying fire\", which to my amazement, is a fairly common UFO sighting. I've heard of silver saucers and triangular shapes in the sky, but FIRE?! Truly an amazing, crazy, make-you-feel-small experience."],"Object Flight Path":"Hovering then path","trends":["There have been no other sightings in Barnhart","This sighting has never been favorited."],"Source":"MUFON","Region":"Missouri","Log Number":"US-08112011-0003","files":["/var/www/straped/mufon/html2text/30805.html.txt","/var/www/straped/mufon/org/30805.html"],"Viewing Distance":"101-500 Feet","Country":"United States","Date of the Event":"08/09/2011 08:50 UTC","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.344221,+-90.393453(30805)&iwloc=A&hl=en\"> mufon case (30805) map </A>","Date Submitted":"08/11/2011 04:17 UTC","Object Features":"Unknown","Object Shape":"Fireball","Summary":"Ball of Fire Hovering in the Air","City":"Barnhart","Case Number":"30805","Longitude":"-90.393453","Disposition":"Unknown","Latitude":"38.344221","Sighting Duration":"00:00:15"}