{"City":"Hakalau","Case Number":"30803","Object Shape":"Other","Longitude":"-155.129167","Date Submitted":"08/11/2011 01:15 UTC","files":["/var/www/straped/mufon/html2text/30803.html.txt","/var/www/straped/mufon/org/30803.html"],"Country":"United States","Object Flight Path":"Stationary","Disposition":"Unresolved","trends":["There have been no other sightings in Hakalau","This sighting has never been favorited."],"Date of the Event":"08/04/2011 01:50 UTC","Weather Factors":"Unknown","Region":"Hawaii","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=19.899722,+-155.129167(30803)&iwloc=A&hl=en\"> mufon case (30803) map </A>","Sighting Duration":"00:00:02","divs":["sighting detailselectrical flash of energy light (lightening like) no sounds, completely over water at the horizon, 1\\2 dome shape, reddish-pinkish glowing misty light in the distance @ the horizon, the entire length. same instant complete electrical outage in the town where: hilo, hawaii date: thursday, august 4, 2011 time: 1:50 a.m. i was getting ready to go to sleep. i was looking directly out of the window toward the ocean and horizon when the flash of light caught my eye's attention, i thought what the heck, and then i saw the 1\\2 dome shape completely over top the ocean's water at the horizon, behind hale moano condominiums, kalanianaole avenue. the electrical flash of light made me think it was lightening, which is rare? in hawaii, there was no thunder to accompany the flash of light. but a huge reddish orangish light dome was clearly visible above the water. i thought it was lightening, and a dome light. the dome was stationary. i did not know what it was. i was tired and all the electrical power was out, throughout the neighborhood and perhaps the town, for many hours afterwards. no motion, just light. other than the 'lightening flash' i was tired and went to sleep, in the dark of night. i am writing you this report now, because i think it is was something important. i closed my eyes and did not think any more about it. just that, it was pretty cool and i wonder what happened to the electrical power throughout the neighborhood. my impression was haarp."],"Summary":"Electrical Flash of Energy Light (Lightening Like) no sounds, completely over water at the horizon, 1/2 dome shape, reddish-pinkish glowing misty light in the distance @ the horizon, the entire length. Same instant Complete Electrical Outage in the town","Object Features":"Other","Log Number":"US-08112011-0001","Source":"MUFON","Latitude":"19.899722","Viewing Distance":"Over One Mile"}