{"map":"<A HREF = \"http://maps.google.com/maps?q=33.859493,+-117.806157(30804)&iwloc=A&hl=en\"> mufon case (30804) map </A>","Tags":"City","Log Number":"US-08112011-0002","Object Features":"Other","Source":"MUFON","Date of the Event":"07/23/2011 11:06 UTC","Weather Factors":"Unknown","divs":["sighting detailswhile we were fishing as a local private lake my husband notices an odd dimly light triangle shape object coming out direction traveling in a south\\west direction. he turned to me and told me to look at it to make sure he was really seeing what we both believe to be a ufo. it was traveling at a steady pace at about 70-80 miles per hour at about 1\\4 to 1\\2 mile up. it was very clearly a triangle shape and had very define points to it. we were both very baffled as to how something that shape could be flying in the night sky. the sky was free from and clouds and it was very clear out. as it passed by it blocked the view of the stars so we knew we were looking as a solid object. it was a very surreal feeling to be looking at this object. it kind of scared me a bit as well. being a very logical person i was going through things it might be in my head as i was analyzing it as it flew over. there was nothing that i could logically say it resembled that i have ever seen and i have seen many tv programs in military aircrafts and prototypes and this looked nothing like anything i have ever seen in my life. i would say the size would be in proportion with a 747 jet. it had 3 very dim square light at each triangle point. the lights were a white glow similar to a florescent bulb and they were casting a glow in between each light showing the triangle shape. as it flew over we noticed that there was no sound what so ever and as it passed us we could see the back of it as it glided over us. it was perfectly flying it a straight line and parallel to the sky. it never pivoted of veered off course. after it passed by we got a very good view of the back of the craft. it was a flat dark surface about 15 to 20 ft high. we continued to watch it until it was out of sight. i have to say that was a very eerie feeling and i will never forget what i saw that night."],"City":"Anaheim","Case Number":"30804","files":["/var/www/straped/mufon/html2text/30804.html.txt","/var/www/straped/mufon/more/30804_submitter_file1__UFOoverAnaheimJuly232011.png","/var/www/straped/mufon/org/30804.html"],"Summary":"We saw a UFO of triangle shape with square white lights flying overhead on July 23, 2011 at 11:06 pm while fishing in Anaheim, CA","Latitude":"33.859493","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Object Shape":"Triangle","Region":"California","Sighting Duration":"00:00:45","Disposition":"Unknown","Country":"United States","Date Submitted":"08/11/2011 02:09 UTC","trends":["There have been 55 other sightings in Anaheim","There was one other sighting in Anaheim on or around July 23rd 2011","This sighting has never been favorited.",""],"Longitude":"-117.806157"}