{"Date of the Event":"05/30/2011 09:45 UTC","Object Features":"Patterned Surface, Unknown","Object Flight Path":"Path with directional change","Date Submitted":"08/11/2011 10:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.962933,+-83.826104(30809)&iwloc=A&hl=en\"> mufon case (30809) map </A>","Tags":"City","Case Number":"30809","Summary":"orange / fireballs","Sighting Duration":"Undisclosed","Longitude":"-83.826104","Viewing Distance":"Unknown","trends":["There have been 10 other sightings in Swartz Creek","There were no other sightings in Swartz Creek on or around May 30th 2011"],"Country":"United States","Disposition":"IFO","City":"Swartz Creek","Region":"Michigan","Log Number":"US-08112011-0007","files":["/var/www/straped/mufon/html2text/30809.html.txt","/var/www/straped/mufon/org/30809.html"],"divs":["sighting details5 glowing orange fireballs\\orbs approx. 15 degrees apart in arc. following each other and moving from s-sw to n-ne about 10 degrees off true n. very high in altitude, planes on the landing trajectory to the nearest airport fly very low. these were up in the 20-30 thousand feet range if not higher. followed, by the same distance, by a pair of 2 orange globes perpendicular\\side by side, to the path the first 5 were following. the original 5 slowly faded, but the 2 following behind split into different directions, separating by about 45 degrees and stayed until the others had disappeared. checked 'heavens-above' and the nasa web site for orbital satellite info, because that was our first tought. they were probably com satellites in a procession. no information about satellites in our region at that time. this is the second time we've seen these over this area. the previous time, september 15, 2010, they were much lower, around 10k feet, and there were only 3 fireballs. we could make out an actual globe as the middle one, which seemingly was on fire on the front edge. i thought it was a re-entering piece of space junk. again, i checked the orbital plots of junk re-entering. nothing was posted on my online searches. is there a good website to check when these things are seen to see if it is a flare from a known satellite or re-entering space junk? and i don't know about affecting me psychologically but my husband sat up all night. it was really disturbing and not easily explained. i know there have been a rash of these \"orange fireballs\" lately, but they aren't planes. no landing lights (my husband used to work at an airline and can identify a plane from miles away.) now every time i see a plane coming into bishop airport i go \"is that?\" and i get a \"yes, it's a plane\" lol. thanks."],"Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Fireball, Sphere","Latitude":"42.962933"}