{"Country":"United States","Log Number":"US-08112011-0014","Case Number":"30816","Region":"Illinois","divs":["sighting detailsmy wife and i parked near home when i looked up and saw a dozen or more strange orange lights \"floating\". we got out of the car and watched them, and at that time the went, almost evenly spaced, in a nearly straight line, from where they were south\\southwest, then took a 90 degree turn west then slowly dissipated, one by one. what was strange was the speed of the lights, which only a helicopter or balloon would travel at, combined with the flickering orange-ish glow, and the sequential path of each one in a straight line, then dissipation completely from sight. floating candle lanterns don't have as bright or consistent of light displayed, nor are they as orange\\reddish as these, nor do they float in a straight line for roughly a mile or more. i've attached a camera phone video my wife took, which is unfortunately sideways, then upside-down. it shows 3 or more of the orange lights for a few seconds."],"Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/30816.html.txt","/var/www/straped/mufon/org/30816.html"],"Date of the Event":"07/29/2011 10:25 UTC","Object Shape":"Fireball, Sphere, Star-like, Other, Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"41.795771","Tags":"City","Date Submitted":"08/11/2011 06:24 UTC","Object Features":"None","Disposition":"Unresolved","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around July 29th 2011","This sighting has never been favorited.",""],"Longitude":"-87.674343","Summary":"Dozen or more orange lights traveled slowly in nearly straight line then dissipated","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.795771,+-87.674343(30816)&iwloc=A&hl=en\"> mufon case (30816) map </A>","City":"Chicago","Weather Factors":"Unknown"}