{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"A small drop of white-out very far away.","files":["/var/www/straped/mufon/html2text/30818.html.txt","/var/www/straped/mufon/org/30818.html"],"Log Number":"US-08112011-0016","Longitude":"-104.886175","Tags":"City","Date Submitted":"08/11/2011 07:24 UTC","Object Features":"Undisclosed","Disposition":"Unresolved","trends":["There have been 185 other sightings in Denver","There were 2 other sightings in Denver on or around August 9th 2011"],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Object Shape":"Circle, Sphere","Case Number":"30818","map":"<A HREF = \"http://maps.google.com/maps?q=39.660222,+-104.886175(30818)&iwloc=A&hl=en\"> mufon case (30818) map </A>","City":"Denver","divs":["sighting detailsi made basically this same observation the day before at the exact same time though this time there were 3 other witnesses. the object was closer to my location than the day before or a little north and a little closer west. there were a few more clouds on tuesday but passed in front of the object. again it was very high up. since then i've seen airplanes flying very high and from my perspective, they looked to be about 1\\4\" in length whereas this object was even much higher than the highest flying planes i've seen and both objects appeared very similar in size and compared to the high flying planes was only half the size of them. i had to go back into work at 5:15pm and the object was still stationary as i walked through the door. this makes 2 days in a row, in slightly different locations but at the exact same times. i obviously had my eyes to the sky yesterday, but didn't see a thing and watched at 5, then again at 7 for half an hour and again at 9:30pm for 15 minutes and didn't see anything. i'm not there tonight but i damn sure will be tomorrow night. again this sighting included 4 of us and i don't think any of the other witnesses would mind giving their personal info if necessary. i would have thought if it were a planet or star, the object would be visible for a few days in a row but not being an astronomer, it would only be speculation. tell you what though, i haven't been this excited in a long time and hope i have many more reports to make to you."],"Country":"United States","Date of the Event":"08/09/2011 05:07 UTC","Latitude":"39.660222","Region":"Colorado"}