{"Date of the Event":"08/11/2011 01:30 UTC","trends":["There have been 27 other sightings in Providence","There were no other sightings in Providence on or around August 11th 2011"],"Case Number":"30829","Weather Factors":"Unknown","divs":["sighting details1. where were you and what were you doing at the time? 2. what made you first notice the object? 3. what did you think the object was when you first noticed it? 4. describe the object and its actions and motions in detail. 5. describe your feelings, reactions and actions, during and after sighting the object. 6. how did you lose sight of the object? 1. smoking on break 2. watching the horizon\\sky\\clouds 3. thought it was a plane\\ both 4. one reflective line\\cigar\\cylinder in sky ahead of the other. the one closest to me sped up ahead quickly, thats how i knew it wasnt plane. a star like light descended not far from the 2nd cigar\\line and disappeard & about a minute\\ 2 minutes later another star like light descended, got really bright and then faded\\disappeared. both star like lights were near the rear of the 2nd object. both cigar\\reflective lines disappeared rather quickly, once they were off in the distance. 5. amazed, but the only time ive seen a cigar in the area. once seen one in a back parking lot area on a windy day. clouds were moving, had to fix my eyes on object and building siding slats to see if the object were moving & it wasnt. then finally it moved on. tried to call another witness to look, but they were busy on the job. 6. they both disappeared into the distance."],"files":["/var/www/straped/mufon/html2text/30829.html.txt","/var/www/straped/mufon/org/30829.html"],"Object Shape":"Cigar, Star-like","Object Features":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","Region":"Rhode Island","Object Flight Path":"Straight-line path,Unknown","Viewing Distance":"501 Feet - 1 Mile, Unknown","City":"Providence","Latitude":"41.815796","Longitude":"-71.440907","Tags":"City","Country":"United States","Log Number":"US-08122011-0004","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.815796,+-71.440907(30829)&iwloc=A&hl=en\"> mufon case (30829) map </A>","Summary":"2 cigars/cylinders & 2 descending star like lights above & at end of 1 cigar/cylinder @ diff times","Date Submitted":"08/12/2011 02:08 UTC"}