{"Object Shape":"Triangle","Source":"MUFON","City":"West Pensacola","Date of the Event":"01/31/2008 12:00 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"triange of lights on the edges flashing with a huge rocket plume in the middle lights flashing back and forth as the rocket plume spun all around but the lights always followed the plume on the edges. it was loud","map":"<A HREF = \"http://maps.google.com/maps?q=30.39668,+-87.285454(30823)&iwloc=A&hl=en\"> mufon case (30823) map </A>","Longitude":"-87.285454","Region":"Florida","Log Number":"US-08112011-0019","trends":["There have been no other sightings in West Pensacola","This sighting has never been favorited."],"Latitude":"30.39668","Country":"United States","Date Submitted":"08/11/2011 11:35 UTC","Tags":"City","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/30823.html.txt","/var/www/straped/mufon/org/30823.html"],"Object Flight Path":"Hovering then path","Case Number":"30823","divs":["Sighting Detailswalked out back of resturant heard loud hum looked out saw a triange of lights big hundreds of feet long the lights at the edges flashed and a huge rocket plume was in the middle burning off but not rising or falling like you think a roket would \"shoot off\" just spinning around and the lights at the end would blink but always kept the plume in the middle as it spun around the lights would move up and down and always kept the plume in the middle. the actual body of the triange was not visable only the lights and the rocket plume it lasted for a while i tried to call people in the kitchen to come see but my eyes were glued to this thing and i didnt want to go get somone and miss it i have a flip book i drew but sadly i cannot put it into the computer eventually the rocket plume went out and it dissapeared. although i could not see the structure the lights always keeping the plume in the middle and no matter where it spun the lights blinking and always being the at the edge keeping it centered i felt it was a huge solid triangle even though nothing was there to see of the body"],"Disposition":"Unknown"}