{"Date Submitted":"08/11/2011 11:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.762661,+-80.336344(30825)&iwloc=A&hl=en\"> mufon case (30825) map </A>","Date of the Event":"11/30/2000 04:00 UTC","Log Number":"US-08112011-0021","Viewing Distance":"501 Feet - 1 Mile","Summary":"Walked out of house to go to work and noticed triangle pattern lights in sky","City":"Loxahatchee","files":["/var/www/straped/mufon/html2text/30825.html.txt","/var/www/straped/mufon/org/30825.html"],"Latitude":"26.762661","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Tags":"City","Source":"MUFON","divs":["Sighting DetailsAround the year 2000 to 2002 very early in the morning around 04:00 I walked out of my house to go to work and noticed 3 lights in a triangle pattern in the sky. They didn't seem very high in the sky, maybe 200 ft or so. They kinda hovered and moved slowly and changed direction a couple of times but when it did it was slow in doing so. At the time I really didn't think too much of it but watched it for approx 4 to 5 minutes because I thought it was odd with absolutely no sound at all and no airports anywhere near the area I lived in. I did not think at all to document it since I at the time I just wrote it off that it had to be something that would be explained easily, I did live approx 15 miles from Pratt & Whitney in Palm Beach Gardens. I lost sight of it when I got in my car to go to work. It was still moving slowly hovering kind of but now moving away from me. I am reporting it now for documentation purposes to see if maybe someone else may have seen it as well. I was watching a program about a year ago and saw what I saw and realized I should have watched it longer and tried to at least shine my light on it. I had a very powerful flood light in my car but obviously didn't want to get in trouble for shining it at an aircraft."],"Case Number":"30825","Longitude":"-80.336344","Region":"Florida","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Insufficient Data","trends":["There have been no other sightings in Loxahatchee","This sighting has never been favorited."],"Object Features":"Unknown"}