{"Object Shape":"Circle","Region":"California","Longitude":"-117.911504","Source":"MUFON","Weather Factors":"None","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around August 4th 2011"],"Object Features":"Unknown","Date of the Event":"08/04/2011 06:00 UTC","City":"Anaheim","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Disposition":"Unknown","Summary":"relaxing at work looking at sky. Saw some thing. The more I looked it got weird. Moved to continue my observation and it was gone","files":["/var/www/straped/mufon/html2text/30821.html.txt","/var/www/straped/mufon/org/30821.html"],"Sighting Duration":"00:08:00","divs":["Sighting DetailsI was laying down at work relaxing until it was time to get back to work. Saw a object VERY high in the sky. It looked like a star but it was the middle of day and no other stars around. It seem to be moving slow( that's how it caught my attention). Then was stationary for a min or so. The started to move. I still watched for a min or so and saw 2 smaller objects go to the object VERY QUICKLY. the smaller objects didn't come out the other side or appear again at all. The larger object kept moving at same \"slow\" rate. Then it was out of view. That took about 5 or 6 min. I sat there wondering then decide to change my location. It took about 2 min. The object was gone. I went to a huge open area and at the rate it was mo ing before it's NO WAY it would've been gone that fast. I thought it was a loose ballon maybe at first but the none motion to the movement seemed to controlled. It thought I was crazy for a moment and blamed it on the fact that once I seriously noticed and paid attention I started seeing \"stars\" but I shook it of and the object was still there. This is the 2nd and most convincing time this has happened to me at this job.....or ever for that matter."],"Country":"United States","Date Submitted":"08/11/2011 09:31 UTC","Case Number":"30821","map":"<A HREF = \"http://maps.google.com/maps?q=33.840303,+-117.911504(30821)&iwloc=A&hl=en\"> mufon case (30821) map </A>","Latitude":"33.840303","Log Number":"US-08112011-0017"}