{"Region":"Colorado","City":"Boulder","Log Number":"US-08122011-0010","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsIt was sometime in 2002, in the fall or early winter since it was mostly dark around 5:30-6pm mountain time. I was walking my bike home from work, did not own a car at the time, it was uphill on a bike path in Boulder, Colorado. It was fairly dark or just after dusk. I like to stargaze, so when I was walking I was looking up every now and then. I have done this since childhood. I noticed a really dark spot against the sky moving from north to south. I know it was N to S because I was facing the mountains, they are to the west. At first I looked away, I don't know why. I didn't really think it was anything I guess. I looked back up and at this point it was almost directly above me. I could definitely make out a triangle shape with very defined edges. There were no lights. There was no sound. No detail could be seen, just a plain very black triangle shape. It moved quickly at a constant rate of speed, but not that much faster than a normal airplane I guess. It seemed like it was only a few thousand feet above me, but I really couldn't determine the distance. It kept going in a straight line and I lost sight as it continued to the South, behind tress, houses, etc. I felt nothing when I saw it or right after the \"event\". I almost convinced myself I didn't see anything and I didn't tell anyone for a few weeks. It seemed like a non-event to me at first, like it was just supposed to be flying by, like there's nothing unusual about it at all. It was flying over Boulder, a decent size city in Colorado, so I figured it might be military. Also, I was in a dark area on the bike path looking up at the sky. If I was in a normally well-lit area there's almost no way I could've seen it. Under a street light you can't see very far into the night sky and wouldn't have been able to see the stars either, and especially not a black object passing in front of them. That's it. No idea what it was, not convinced it wasn't military since it didn't do anything weird. Who knows."],"Date of the Event":"11/15/2002 06:00 UTC","Date Submitted":"08/12/2011 02:06 UTC","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"30837","Summary":"Dusk sky, very dark triangle, no lights, went in a straight line.","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","Latitude":"39.986138","map":"<A HREF = \"http://maps.google.com/maps?q=39.986138,+-105.250245(30837)&iwloc=A&hl=en\"> mufon case (30837) map </A>","Longitude":"-105.250245","trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around November 15th 2002"],"files":["/var/www/straped/mufon/html2text/30837.html.txt","/var/www/straped/mufon/org/30837.html"],"Object Features":"None","Sighting Duration":"00:00:30"}