{"Viewing Distance":"501 Feet - 1 Mile","Case Number":"30840","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/30840.html.txt","/var/www/straped/mufon/more/30840_submitter_file1__022.JPG","/var/www/straped/mufon/org/30840.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.770263,+-75.198337(30840)&iwloc=A&hl=en\"> mufon case (30840) map </A>","trends":["There have been 3 other sightings in Mantua Township","There were no other sightings in Mantua Township on or around June 21st 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsMe and my boyfriend were floating in the pool and he noticed something in the sky...It 1st looked like something on fire..it decended very slowly, which is when I got out of pool to grab my camera....when I came back out it had changed direction and was slowly ascending away....At the closest point to me it appeared to be three balls of light. My picture only shows two of the balls of light. After seeing this and having no clue as to what it was, my boyfriend called the news in philadelphia who had not had any reports of anything that we described...The only thing that they were aware of was a helicopter in Thorofare NJ looking fo a suspet...This WAS NOT a helicopter and the direction was not towards thorofare nj. When viewing the attached pic begin to zoom in and its in the bottom left..I have 2 or 3 other pics but I can not find it in the pic...I have no clue how to crop it while enlarged so that you can see it better..PLease feel free to contact me if you need more info"],"Disposition":"Unknown","Weather Factors":"None","Date of the Event":"06/21/2010 03:53 UTC","Object Features":"None","Longitude":"-75.198337","Object Shape":"Sphere","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Path with directional change","Log Number":"US-08122011-0013","City":"Mantua Township","Tags":"City","Date Submitted":"08/12/2011 03:24 UTC","Latitude":"39.770263","Summary":"Observed 3 ball of light descend and then ascend in the sky"}