{"Tags":"City","Region":"Indiana","Longitude":"-87.26724","trends":["There has been one other sighting in Seelyville","There were no other sightings in Seelyville on or around April 20th 2004"],"Disposition":"Insufficient Data","Country":"United States","Date of the Event":"04/20/2004 10:00 UTC","Object Features":"Undisclosed","Object Shape":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.491983,+-87.26724(3084)&iwloc=A&hl=en\"> mufon case (3084) map </A>","Summary":"It looked like a really bright star or planet.","Source":"MUFON","Sighting Duration":"00:05:00","divs":["Sighting DetailsI was walking with my co-worker down a country road. I was telling her aboutstars and space. And trying to find the dipper.She pointed out a planet that wasbrighter than the stars.I thought I saw a second planet. But we noticed it wasmoving slowly.I asked her if she noticed it.The planet she pointed out was inthe south.What we were seeing moved was in the north. At first it looked still,But was moving barlely. Then started to move fast like a burning out star. Butinstead of burning out. It became closer like in the atmosphere.It stillresembled a star. But was flying quick and then stopped in the middle of thesky. It was traveling east to west. After it stopped we were amazed of what itcould be. Lyndsay was a little scared. It flew up towards space until itdisapeared and then came back. It was lower this time lower than a jetliner. Itshined a bright like reflection so bright it almost seemed like it was spottingus out with this shining light.But not a spot light.The shine didnt last morethan 2 seconds.It was still moving back and forth in the sky and doing circlesor ovals, until it flew straight up again. And we couldnt see it. We waited agood 10 minutes. To see if it would come back. I wanted to stay all night. Imfrom terre haute and dont drive. I will get photographs And video tape it again.Im positive it will come back. Because when we talked about it. We werent thefirst.And it has been spotted on different days by other people.The sky wasclear. But light clouds started covering up the sky slowly.And partly.And thedate was a guess it could have been around that week."],"Object Flight Path":"Unknown","Case Number":"3084","Log Number":"","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/3084.html.txt","/var/www/straped/mufon/org/3084.html"],"City":"Seelyville","Date Submitted":"04/20/2004 10:00 UTC","Viewing Distance":"Over One Mile","Latitude":"39.491983"}