{"City":"Pierpont","Log Number":"US-08122011-0014","trends":["There have been no other sightings in Pierpont","This sighting has never been favorited."],"Object Shape":"Flash","Summary":"A red and flashing light over a tree. As I stared at it, it came within 15 feet of me, and about 20 feet off the ground.","map":"<A HREF = \"http://maps.google.com/maps?q=41.729965,+-80.542103(30841)&iwloc=A&hl=en\"> mufon case (30841) map </A>","Longitude":"-80.542103","divs":["Sighting DetailsAt around 1:30 a.m. on August 5, 2011, I was letting my dogs out one last time before I went to bed. I was looking at the sky (out in rural Ohio, you can see every star) to see if there were any meteor showers. In the corner of my eye, a small red and white flashing light caught my attention. It appeared to be small, so I thought it could have been a helicopter. As I stared at it, I noticed it was hovering slightly, so I discounted it as a helicopter. I then continued to look at. Then, my dogs began barking for no apparent reason, and I noticed the flashing light was actually moving towards my house. I hid on the side of the house, out of the object's view. When I looked again, the light was hovering about ten feet away from over the driveway, and about 20 feet in the air. I was paralyzed with adrenaline and fear as it started slowly ascending back into the sky to the position it began in. I did not want to try and take a picture with my cell phone, fearing it would light up my face and the object would see me. I went inside to retrieve my sister so she could see the object in its original position. We brought the binoculars, and looked at the object. It appeared blurry, but still flashing. Then we noticed there were two other small and white flashing lights located in a line formation across the street from us in a field. Those too were also hovering and appeared high up in the sky. We have seen these three blinking lights in the summertime for the past 5 years, but never has one come over to our house. The next night we went out to see them, and they were not present. On August 10, 2011, we were able to see the flashing lights over the field again."],"Source":"MUFON","Weather Factors":"Unknown","Region":"Ohio","Object Flight Path":"Hovering then path","Date Submitted":"08/12/2011 03:26 UTC","Object Features":"None","Tags":"City","Latitude":"41.729965","Date of the Event":"08/05/2011 12:00 UTC","Disposition":"Unknown","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/30841.html.txt","/var/www/straped/mufon/org/30841.html"],"Case Number":"30841","Sighting Duration":"Undisclosed","Country":"United States"}