{"Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Unknown","Longitude":"-92.372799","Object Features":"Other","files":["/var/www/straped/mufon/html2text/30843.html.txt","/var/www/straped/mufon/org/30843.html"],"Object Flight Path":"Stationary","Log Number":"US-08122011-0016","Disposition":"Unknown","Latitude":"38.946652","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.946652,+-92.372799(30843)&iwloc=A&hl=en\"> mufon case (30843) map </A>","Tags":"City","Date Submitted":"08/12/2011 04:30 UTC","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around June 30th 1988"],"City":"Columbia","Source":"MUFON","Date of the Event":"06/30/1988 12:00 UTC","divs":["Sighting DetailsI was staying at my grandma's house in the summer of 1988 in Columbia, MO. The bed was by the window and I had a great view of the night sky and could see the stars. One night three lights in a triangular formation appeared in my view. They stayed in the same spot in the sky, however the lights would rotate and switch positions while in this spot in the sky. The lights were larger than the stars, but I could see the night sky through and around the lights. The fact that there was no structure to be seen was really curious. The lights never blinked and did not move across the sky like the stars do. The most remarkable aspect of this was seeing the lights rotate and switch positions so fast and high up in the sky. I witnessed this for three nights in a row, and then one night they were not there. However they returned the night after. I called my mom in to take a look. I remember it scared her and she closed the blind to my window, but she does not recall this memory. What is even more curious, is that nearly 20 years later a friend of mine I had met while living in Delaware told of a sky anomaly she had seen back in the late eighties. She described the SAME thing I had seen in Missouri, only she remembers the year as 1989 and she saw them near Newark, DE during the summer. I saw the lights a year earlier in Missouri. I haven't seen these lights since and have tried to research what it could have been. I'm sure there are others who have seen the same thing as my friend and I did over 20 years ago and half a continent away from each other. If you have any information on this, I would love to know!"],"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Summary":"3 lights in triangle formation, larger and closer than stars. Lights would rotate and switch positions while staying in triangular formation. Night sky was seen through and around the triangle. Happened for several nights in a row.","Case Number":"30843","Weather Factors":"Unknown"}