{"Latitude":"32.894442","Case Number":"30847","divs":["Sighting Details2:35 a.m. July 29th, 2011, Dallas County, Texas. My brother, a friend and myself were on the front porch when I looked to the east and noticed something that seemed completely out of place. It was brighter than a star or a planet and it seemed to be pulsating and hovering. Commercial aircraft flies overhead regularly and it was much larger and higher altitude. I brought it to my brother and friend's attention and we began watching it closely. It seemed to drift and then hover and then pulse. When it was obvious that it wasn't a plane or a planet(I used my Skyview iPhone application to debunk any planets around or visible... there weren't any visible in that area) we went and got our binoculars and realized it had a specific shape. A triangular shape with at least 3-5 distinct circular orb like shapes at each point with what looked like electrical current running between all the points. I began taking zoomed in pictures with my iPhone and then grabbed my expensive zoom lens Canon camera and rapidly took about 302 photographs. For some reason my cell phone battery went from 88% to 18% within a matter of 15 minutes. This also affected my friend's cell phone battery power as well. It increased in size and rapidly pulsed and while I was watching it thru the binoculars it seemed like 3 other craft split from the center leaving the original object less pulsating and only white light... the other three objects had the spectrum of light in a pattern and were darting to various points and hovering with the colored lights pulsating in a pattered around each craft. The shape of the original object seemed to change as well and become more of a disk like shape. The other 3 objects with colored lights were boomerang shaped. We drove at least 20 miles east to Rockwall, Texas's Lake Ray Hubbard. We parked and continued to watch the objects but they decreased in size and weren't pulsating as much as before. By5:30am they seemed to be gone."],"Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30847.html.txt","/var/www/straped/mufon/more/30847_submitter_file1__IMG_0422.JPG","/var/www/straped/mufon/more/30847_submitter_file2__IMG_0424.JPG","/var/www/straped/mufon/more/30847_submitter_file3__IMG_0441.JPG","/var/www/straped/mufon/org/30847.html"],"Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.894442,+-96.703218(30847)&iwloc=A&hl=en\"> mufon case (30847) map </A>","City":"Dallas","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around July 29th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Features":"Dome, Other","Date Submitted":"08/12/2011 05:35 UTC","Disposition":"IFO","Longitude":"-96.703218","Log Number":"US-08122011-0020","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Summary":"Bright luminous light brighter than a star/planet objects splitting from core with various colored lights rainbow spectrum random patterns pulsating hovering drifting","Region":"Texas","Date of the Event":"07/29/2011 02:35 UTC","Sighting Duration":"02:16:00","Object Shape":"Circle, Fireball, Triangle"}