{"Object Features":"Unknown","Longitude":"-86.67413","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around April 1st 1968"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.611267,+-86.67413(30854)&iwloc=A&hl=en\"> mufon case (30854) map </A>","Case Number":"30854","Latitude":"33.611267","Source":"MUFON","Date Submitted":"08/12/2011 06:28 UTC","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unknown","City":"Birmingham","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Shape":"Blimp, Cigar","Tags":"City","Country":"United States","Log Number":"US-08122011-0027","files":["/var/www/straped/mufon/html2text/30854.html.txt","/var/www/straped/mufon/org/30854.html"],"Region":"Alabama","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsIn the spring of 1968 I was assembling a car engine on the patio behind the house. Small house and no garage.It was around midnight and under two 150 watt floodlights. I had that odd feeling of being watched and looked toward my neighbors homes. I assumed that they were not happy with me making noise outside at midnight. Understandable of course. I looked at the one story building across the ditch at the end of my backyard and something caught my eye. An object seemed to be over the building about 200 feet above it. A moon-less night made the glare of the flood lights rather intense so I walked up the steps and turned off the lights in no hurry. I turned the lights off to appease my neighbors and not because I really thought that something was hovering over a building behind my house at midnight. That idea seemed pretty unlikely to me. But it was there. It remained motionless long enough for my eyes to adjust to the dark and to see it reasonably well from the lights in the parking lot of the G.E.S.store. The object was approximately 65 feet long and 15 feet thick and shaped like a pressed medicine capsule with a flat ridge around the circumferance. After about a minute of observation the object rose vertically to an altitude of 500 feet and made a random series of right angle turns. Imagine a school bus that is 700 feet from you, going 100 miles per hour and making right angle turns. I am not a physicist but I do know that making right angle turns at 100 mph(several turns were much faster and 180 degrees) is not possible. It was as surreal as watching a Disney cartoon. At that point I had that strange taste in my mouth of being utterly helpless. The object left at an oblique angle and rapidly disappeared into the night sky. My outlook of what is and is not was forever changed. I saw an object, in the air, executing directional changes that are absolutely impossible. The vehicle would fly apart and any occupants would immediately be crushed. The instantaneous G loads would be beyond astronomical. I was then, and remain, very skeptical. Impossible- but I saw it."],"Summary":"Object made several physicaly impossible right angle turns and rapidly flew away.","Date of the Event":"04/01/1968 12:00 UTC"}