{"Case Number":"30853","Object Shape":"Oval","divs":["Sighting DetailsThis happened a long time ago so my recollection of specific details is a little fuzzy. I was walking home traveling northbound on 26th Ave. West between 12th and 13th St. I looked at my watch, it was exactly 12:25 am then something made me look up at the sky like I could sense a presence. I saw a white oval shaped craft. It appeared to be hovering over me until I looked right at it and it took off at what I would say was light speed. It was traveling the same direction that I was walking then specked out. What I though was interesting was the fact that as it took off, a skunk walked out of the bushes on the side of the road and walked along side of me all the way to my house and kept going. Like it was more afraid of the object in the sky than it was of me. I've never been so happy to see a skunk. I saw the object again when I arrived at my house, now at 12:35am. It seemed to be following me and hovering then it took off again when I looked up at it. The second time I saw it I was traveling south bound and it was also traveling south bound. It was startling. I didn't tell anyone about it for several years. I saw your case file about (name removed) this afternoon and the polygraph was a technical disappointment but I believe that due to the trauma of his experience, he may have wanted to block it out of his mind and that is why his answers seemed to fail the test. It was just too much. His life was simple and happy before the experience. It tore him up. My experience was nothing in comparison to his and it still bothers me sometimes."],"Tags":"City","Latitude":"46.770634","Date Submitted":"08/12/2011 05:42 UTC","Log Number":"US-08122011-0026","Country":"United States","Summary":"I looked up and saw it, then it warped out.","files":["/var/www/straped/mufon/html2text/30853.html.txt","/var/www/straped/mufon/org/30853.html"],"Region":"Minnesota","Weather Factors":"Unknown","City":"Duluth","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.770634,+-92.144986(30853)&iwloc=A&hl=en\"> mufon case (30853) map </A>","Disposition":"Unknown","trends":["There have been 16 other sightings in Duluth","There were no other sightings in Duluth on or around July 19th 1971"],"Date of the Event":"07/19/1971 12:00 UTC","Viewing Distance":"101-500 Feet","Source":"MUFON","Longitude":"-92.144986"}