{"Latitude":"33.593517","Region":"Arizona","files":["/var/www/straped/mufon/html2text/30857.html.txt","/var/www/straped/mufon/org/30857.html"],"Log Number":"US-08122011-0030","Date of the Event":"11/30/2008 12:00 UTC","Object Flight Path":"Hovering then path","City":"Phoenix","Object Features":"Unknown","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 30th 2008"],"Case Number":"30857","Summary":"alien abduction in arizona","Longitude":"-111.979647","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.593517,+-111.979647(30857)&iwloc=A&hl=en\"> mufon case (30857) map </A>","Tags":"City","Object Shape":"Star-like","divs":["Sighting DetailsI was taken to some other galaxy in this whirlwind that I was initially afraid of. I then was in this examining room where these embryo like creatures in suits were examining me. i had some ectoplasm thing attached to my mouth and they asked me if I smoked. I said yes, and they made me smoke a cigarrette through this ectoplasm like thing attached to my mouth. They then seemed to concentrate on my right foot. Now, the only thing I have in my right foot is this infection in my great toenail after having slammed my foot in a door quite a few years back, Then I was taken to this open area where there were hundreds of people all walking around. I thought I was dead and it was quite cold and my body felt very heavy. I was also greeted by one of the creatures by a hand signal that i could not imitate. I saw housing installations but they had a sort of flexibility to them that i can not explain. I was again taken back to the exam rom and was given some liquid to drink, but i drank too much and they had to keep me longer for observation because of it. Next thing I know, i am back in bed and I felt as though I had just awoken from anesthesia. My face and body felt all tingly and weird and I couldn't stop touching my face for quite a while afterwards. Dn't know what happened here, but i have seen many things in the sky in Arizona before with missing time and migraines after sightings."],"Source":"MUFON","Disposition":"Insufficient Data","Date Submitted":"08/12/2011 07:24 UTC","Weather Factors":"Unknown","Country":"United States"}