{"Object Flight Path":"Path with directional change","Log Number":"US-08132011-0002","Source":"MUFON","Tags":"City","Latitude":"44.37696","trends":["There have been 2 other sightings in Whitefield","There were no other sightings in Whitefield on or around August 12th 2011"],"Region":"New Hampshire","Disposition":"Unresolved","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/30865.html.txt","/var/www/straped/mufon/org/30865.html"],"Date of the Event":"08/12/2011 12:00 UTC","Sighting Duration":"00:02:00","divs":["Sighting DetailsMy husband and 2 friends were on our back porch; my husand called me out to witness a bright orb that was moving across the sky, with a smaller bright light following it exactly. The lights disappeared beyand the trees. Approx. 15 minutes later, I heard a very loud engine-sort of sound; I went back out onto the porch behind the house and saw a massive, octagonal shaped barge with bright lights on every side, moving across the sky slowly over the house. Our friends came out, and we all witnessed the object move in a straight path, but low enough to see the shape, and certainly loud enough to realize it was not anything we could equate with anything we had ever seen before. It continued in a solid, straight path west, without question within our atmosphere, low enough to make out a shape of the vehicle. we were all astounded by the realization that this was something that was NOT remotely ordinary. I am still baffled, and trying to decipher the event. What I do know it simply that this was an object that was like NOTHING I have ever seen, and the noise it made was as much of a bewilderment as the actual sighting."],"Country":"United States","Date Submitted":"08/13/2011 02:16 UTC","Longitude":"-71.602771","Case Number":"30865","Summary":"Huge barge, distinct lights, massive noise","City":"Whitefield","map":"<A HREF = \"http://maps.google.com/maps?q=44.37696,+-71.602771(30865)&iwloc=A&hl=en\"> mufon case (30865) map </A>","Object Shape":"Chevron","Viewing Distance":"Unknown","Weather Factors":"Unknown"}