{"Longitude":"-106.394814","Date Submitted":"08/13/2011 04:57 UTC","City":"Mazatlan","Viewing Distance":"20 Feet or Less, 21-100 Feet","Object Shape":"Circle, Sphere","divs":["Sighting DetailsThis event took place in clear sky night in Granada, Nicaragua in the year '94. I was in my junior year of high school. It was late at night around 11-12pm, because I never went to bed before midnight. The house was dark because everyone had gone to bed, but it was a clear sky night with some moon light ( I cant remember if it was full, or new, etc).As It is typical for houses in this city to have a spanish architectural style. Therefore the house had four corridors around a center courtyard, So, you could observe a perfect beautiful clear sky night from the conform from one of the corridors, where I was sitting talking to one of my girlfriends on the phone. There I was sitting in a rocking chair facing the sky and watching the stars, as my friend and I where talking just trivial stuff. All of the sudden this light comes out from the left side of the roof as it came from the east, in a random zig zag flying movement. My friend was telling me some story while I cant believe my eyes, all i remember is a frozen momentum, i couldn't hear anything, I all my senses where concentrated in what i was looking at, it was so surreal!!. After I was out of breath for a long second, I started saying my friends name, over and over, and over....with a bit of pauses in between. while I go out of breath and call her name, this light comes out flying from the east into my courtyard and makes a quick stop under the rooftop of the corridor where I'm sitting. Yeah, that makes the distance of this strange object to where I was about 20 feet away.!!! This light was white and very bright, you couldn't see a edge, just light. This light was the size of a softball, and it seem as if was light in weight, but gave the impression that it had some type of a dense texture, even though you couldn't see it because it was so bright. Thing strange light made a pause right in front of me, as if it had been cruising and when saw me flew faster towards me and made an abrupt stop, 20 feet away, for a few seconds and took off so fast that all i saw was the flash of the light it left behind. My friend by this time was asking me what, what's going on, and calling me name, while I just said her name. As I was coming out of shock, my thoughts came back to me, as I had gone blank during this time, I told her very quick what happened but I think she though i was joking around, I didn't give it much importance either if she believed me or not at the moment, because I all wanted was to hang up the phone and go to my room.!! It didn't even give me time to panic, after or before, I was just to shocked to believe what had just happened. I think if my friend hadn't confirmed with me next day that I talked to her and I kept calling her name and told her some crazy story about a ball of light. I probably would be thinking It was a dream so real, i though it was real."],"Region":"Sinaloa","trends":["There has been one other sighting in Mazatlan","There were no other sightings in Mazatlan on or around October 11th 2004"],"Log Number":"NI-08132011-0006","Country":"Mexico","Tags":"City","Object Flight Path":"Path with directional change,Other","Weather Factors":"Unknown","Summary":"a round ball of bright light flying very low on house roof, came towards me, stopped and fly off very fast.","Date of the Event":"10/11/2004 12:00 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/30869.html.txt","/var/www/straped/mufon/org/30869.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=23.251492,+-106.394814(30869)&iwloc=A&hl=en\"> mufon case (30869) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"23.251492","Case Number":"30869"}