{"Disposition":"Insufficient Data","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around August 11th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.418684,+-111.826172(30864)&iwloc=A&hl=en\"> mufon case (30864) map </A>","Latitude":"33.418684","Date Submitted":"08/13/2011 01:46 UTC","Longitude":"-111.826172","City":"Mesa","Case Number":"30864","Weather Factors":"Unknown","Log Number":"US-08132011-0001","Object Shape":"Fireball, Sphere","Sighting Duration":"00:05:00","Country":"United States","Viewing Distance":"Over One Mile","divs":["sighting detailsat about 9pm on august 11th 2011, i was sitting on the porch with my father talking. they live in a house in mesa, az about 10 miles west of the superstition mountains. the porch has a clear view of those mountains. a lightning storm was occurring beyond the mountains, a little ways south of them. i was watching the sky light up when i noticed a more orange than red light above the highest point of the superstitions. the light just seemed odd, somehow out of place. there are often planes that fly through that general area on the way to\\from sky harbor international, but this appeared to be the wrong color and brightness. the light was stationary, but as i watched it another light appeared to the left (that would be to the north) of it. i would say hold a sharpie marker at arms length and that would be about the distance separating them. the two lights remained as they were for maybe a whole second, and then the first one disappeared. about the same amount of time, one second, the 2nd light remained alone, and then another light appeared to the left again. this activity repeated perhaps six or seven times and then they seemed to disappear. before they went away, i had called out for my mother and my aunt to come out and look. my aunt came outside when they were gone and then she spotted them some distance to the left they repeated the pattern again perhaps three times and then disappeared for good."],"files":["/var/www/straped/mufon/html2text/30864.html.txt","/var/www/straped/mufon/org/30864.html"],"Date of the Event":"08/11/2011 09:00 UTC","Summary":"Orange light appears. 2nd orange light appears. 1st disappears. Repeats.","Region":"Arizona","Source":"MUFON","Object Features":"Unknown","Tags":"City","Object Flight Path":"Straight-line path"}