{"divs":["Sighting DetailsMy family and I just got back from the movies and I was sitting on my deck and my 7 yr old daughter was sitting on my lap and she said \"look daddy a shooting star.\" I looked up in the sky facing the north west and I seen a low flying approximately 40-50 feet above tree top level. A solid white ball a little bigger than a basket ball. I turned my radio off to hear if it was making any sound I did not hear a sound. I watched it come straight at my house for about a 30 seconds and then I went into the house and got my camera a shot a short video of it. It flew right over the house and continued south east. I watched it until it went out of view of my camera I lost visual on it. About a week and a half or two weeks later I was on my deck with a friend and we were talking and I noticed a small light move in my left peripheral vision. I said to my friend that I thought I seen something and we looked but did not seen any thing. There were allot of clouds that night. Then about ten seconds later we seen it. It was a small light that turned really bright it was almost a intense spot light. Then it turned into what I call a \"disco ball\" This went on for about five to ten seconds then it disappeared. I have no idea what it was but it has been bothering me every since I seen it."],"Latitude":"43.123137","Country":"United States","Summary":"Solid soft white ball","Weather Factors":"Unknown","Object Features":"None","files":["/var/www/straped/mufon/html2text/30863.html.txt","/var/www/straped/mufon/org/30863.html"],"Case Number":"30863","Longitude":"-95.093145","Log Number":"US-08122011-0029","Sighting Duration":"00:05:00","Object Flight Path":"Straight-line path","Region":"Iowa","City":"Spencer","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.123137,+-95.093145(30863)&iwloc=A&hl=en\"> mufon case (30863) map </A>","Disposition":"Unknown","Object Shape":"Circle, Sphere, Star-like","Source":"MUFON","Date Submitted":"08/12/2011 11:12 UTC","trends":["There have been 4 other sightings in Spencer","There were no other sightings in Spencer on or around July 10th 2010","This sighting has never been favorited.",""],"Viewing Distance":"21-100 Feet","Date of the Event":"07/10/2010 12:00 UTC"}