{"Region":"Michigan","Log Number":"US-08132011-0004","Date of the Event":"05/10/2010 12:00 UTC","Case Number":"30867","divs":["Sighting DetailsI was taking my sons to there moms. I looked out to the bar and seen bluish lights and a golden light in the middle. The blue ones extending out from the gold. I pulled over and asked the boys if they were seeing this a d they were flipping out asking me to take them home . Instead I watched. It just hovered there for like 3 minutes. I remember a white or tan car driving by. Then the lights , without even a sound or turning headed toward the Sturgis airport. I pursued . But was low on gas. We headed to there moms. We agreed we would not talk of it to anyone. I lost sight of it At the corner of big hill and Lafayette . When I first seen it I thought it was new lights, then realized how big it was, and how high. I was not scared or anything. More excited . I explained if it were bad aliens they could of already possibly done something already. When I first seen it I looked at the clock in my car expecting power failure or disruption. By time I got home a half hour passed. No time was lost. I was semi skeptic before, but am open minded enough to except things I am un aware of goes on. If you would like I will allow. You to ask my children. Although I have only brought up that night a couple times to them.they may talk to someone if I told them its ok."],"trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=44.316314,+-85.593964(30867)&iwloc=A&hl=en\"> mufon case (30867) map </A>","Country":"United States","Sighting Duration":"Undisclosed","City":"Undisclosed","Object Shape":"Circle","Summary":"driving down us12, seen a disc shaped series of long bluish lights with a gold color light in the middle","Latitude":"44.316314","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Longitude":"-85.593964","files":["/var/www/straped/mufon/html2text/30867.html.txt","/var/www/straped/mufon/org/30867.html"],"Viewing Distance":"101-500 Feet","Disposition":"Unknown","Date Submitted":"08/13/2011 04:21 UTC","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Undisclosed"}