{"City":"Aptos","map":"<A HREF = \"http://maps.google.com/maps?q=36.977173,+-121.899402(30861)&iwloc=A&hl=en\"> mufon case (30861) map </A>","Tags":"City","Date Submitted":"08/12/2011 09:54 UTC","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","trends":["There have been 2 other sightings in Aptos","There were no other sightings in Aptos on or around July 3rd 2011"],"divs":["Sighting DetailsWe were sitting in our backyard on July 3rd. It was a very clear sky. At around 9:50 Some fireworks went off in the distance and my husband and I saw something fly by out of the corner of our eye and I said it was probably a seagull scared of the fireworks. About 15 or so minutes later I saw a delta shaped craft with 3 lights on the bottom fly overhead between our house and the neighbors house. I told my husband to look up. He saw it just as it crossed over our house and we could see as it flew over our yard and out of sight because of a tall hedge behind our house. It came from the west flying due east at a very constant speed. It flew towards Nisene Marks Park in the Santa Cruz Mountains and came from the direction of the Monterey Bay. It was flying faster than a Cesna plane would fly and it was completely silent. When I first saw it I knew it was nothing I had seen before. It wasn't a plane, a kite or a remote control type thing. It was flying fast and very direct and made no sound. The 3 lights on each corner where big and glowed. We could also see that it was a solid object. We felt perplexed as to what we just saw. We knew we had just seen something very out of the norm. We'd love to know what exactly it was. We've gone outside a few nights since but haven't seen anything. It also been foggy at night a lot since then."],"Case Number":"30861","files":["/var/www/straped/mufon/html2text/30861.html.txt","/var/www/straped/mufon/org/30861.html"],"Object Shape":"Triangle","Longitude":"-121.899402","Log Number":"US-08122011-0028","Latitude":"36.977173","Disposition":"Unknown","Summary":"While sitting in our backyard we saw a delta shaped craft with 3 lights fly over our house. It came from the west and flew towards the east.","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Object Features":"None","Date of the Event":"07/03/2011 09:50 UTC","Region":"California","Sighting Duration":"Undisclosed"}