{"Disposition":"Unknown","trends":["There have been 5 other sightings in Mechanicsburg","There were no other sightings in Mechanicsburg on or around August 12th 2011"],"Object Flight Path":"Hovering then path","Object Features":"Undisclosed","Region":"Pennsylvania","City":"Mechanicsburg","Weather Factors":"Unknown","Date Submitted":"08/13/2011 12:42 UTC","Tags":"City","Country":"United States","Date of the Event":"08/12/2011 12:00 UTC","Object Shape":"Circle, Disc","Log Number":"US-08132011-0012","Latitude":"40.219156","divs":["Sighting DetailsAt about 10p.m. on august 12th 2011 I stepped outside to walk my dog and noticed a plane extremely high and moving very slow from southwest to northeast. I told my father to look at this plane he came out and me and him were discussing the weird vibrating motion it appeared to have and then I noticed another one not far behind it and as my sight became obstructed by a tree I noticed what i first thought to be a blueish white star to the southwest of me, to be changing from a blue to white to red several times in a random sequence. After about 1-2 minutes passed i noticed it was moving up and down and side to side as if it were hovering. The more I watched, it became apparent to me that the lights were going around an object of an undetermined size. I could see that the lights would go to the right and left because of the dimming effect it would have compared to the lights flashing directly towards me. Me and my father watched this for about 10-15 minutes. My father was very skeptical of what he was seeing so he went back into the apartment. I followed shortly after to let the dog back inside. I walked upstairs to look out of my window to see if the object was still there, it was and was a little better view for me as it appeared to be a bit higher in the sky. I continued to watch and I began to realize that I had not seen any commercial airplanes flying overhead the entire time. which is unusual because a lot of air traffic passes over head going to the Harrisburg International Airport and a lot of helicopters fly overhead going to and from the naval depot which is very close to my apartment. I decided to go back out front to continue observing the object. I watched it for a while it seemed to be continue the same movements and light changes. Then it stopped changing lights and was only red with a hint of purple to blue on the edges. For the first time I could see a dark almost flat black shape of the object I could only see above the lights could not see and shape to it below the lights. It began to change lights again and I could not see the flat black shape anymore. I started to wonder if my eyes were playing tricks on me from focusing on it for such a long time so I went inside and had a glass of juice and sat down for a few minutes. After I finished my juice I grabbed the garbage to take out with me when I heard a helicopter flying and could tell it was moving faster and lower than the normal helicopters I see and hear on a regular basis. When I got outside the object was gone and I could hear the chopper but could not see it what so ever. As I was scanning the skys to see if the object had moved I noticed several jets flying very fast and high all from the northwest to the southeast where the object previously was. I knew these were not commercial because they were going to fast, they were to small, and their red and blue wing lights were flashing different from any thing that I had seen before. They did not have any lights on in the front of the aircraft. It was a very clear sky and a full moon so I could actually see the flat grey paint on the belly of a few of the jets, which pretty much confirmed to me that they were u.s. military fighter jets. I then heard a very loud noise from the north and it was a very big plane which looked like a C-130 gunship to me. It was very low and very loud. I then started to hear a very strange fast grinding noise and was unsure of the cause. This noise happened several times each lasting a few seconds. Shortly after those noises I heard what sounded like an explosion from the northwest. I also began hearing at least one maybe more helicopters from the same direction which had became very hazey almost like smoke across the sky to the northwest. I seen a few more jets coming from the southeast and once they got to cloudy area I did not see any jets for quite some time. I could hear a helicopter going back and fourth from north to south with a jet which was flying much lower than the other jets because I could actually hear its engines much clearer. They seemed to be doing a grid type search pattern or there might have been 2 sets of them circling around something. I could not see them because of this cloud which by this time I started to beleave was a smoke cloud because of the strong gunpowder smell that was coming with it. I heard multiple police sirens heading their direction. It seemed to be hours of the jet and chopper back and fourth from north to south. Around 1a.m. my mother came outside because she had to pick my brother up from work. She asked me to ride with which I did because the activity had really died down. She also immediately noticed the gunpowder smell. The smell also had a pungent odor which i had never smelled before. The smell was much different from the smell of fireworks which I find to be a good smell this was overpowering at times and very strange to me. I am sure i am forgeting a few details but this pretty much what I experienced last night into early this morning."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30876.html.txt","/var/www/straped/mufon/org/30876.html"],"Case Number":"30876","Longitude":"-77.002238","Viewing Distance":"Unknown","Summary":"Round but slightly wider than tall with red white blue lights in a random sequence","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.219156,+-77.002238(30876)&iwloc=A&hl=en\"> mufon case (30876) map </A>"}