{"files":["/var/www/straped/mufon/html2text/30871.html.txt","/var/www/straped/mufon/org/30871.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.671807,+-81.514074(30871)&iwloc=A&hl=en\"> mufon case (30871) map </A>","Case Number":"30871","Tags":"City","Date Submitted":"08/13/2011 06:46 UTC","trends":["there have been no other sightings in live oak\\dowling park are","This sighting has never been favorited."],"City":"Live Oak/Dowling Park are","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Date of the Event":"08/13/2011 06:12 UTC","Weather Factors":"Unknown","Object Shape":"Circle, Star-like","Latitude":"27.671807","Sighting Duration":"Undisclosed","Summary":"Big Star like UFO with no sound","divs":["Sighting DetailsThe object was first thought to be a really bright star until I relized it was moving. It was coming from the north over the pine tree tops. From my back porch if I am looking directly north, it would be have been about 10 o'clock when it was first sighted traveling south. It then changed course and came toward us heading in a south-east direction. It was not traveling at exceptional speed, but even being right above our heads made no noise at all. There were NO flashing lights to indicate it was a plane. It was like the brightest \"star\" in the sky and was moving roughly the speed of a normal plane. My dad and I seen this during the course of smoking a cigarette, before it flew across the field in front of our house and out of sight (because of the tree line). We sen it for about5 minutes, no longer then 10 at the most. I felt a flash of fear as it neared (my dad did not experience this) and our 2 dogs seemed to be unusually on edge and frightened. Both dogs are guard dogs and have rarely ever shown fear like this. The did not bark, but were clearly eyeing the same object we were looking at. This is not the first sighting of a UFO I have seen here, just the first time reporting."],"Object Features":"Unknown","Source":"MUFON","Country":"United States","Log Number":"US-08132011-0007","Longitude":"-81.514074","Region":"Florida"}