{"trends":["There have been 3 other sightings in Elizabethtown","There were no other sightings in Elizabethtown on or around August 12th 2011"],"Object Shape":"Disc","Case Number":"30873","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/30873.html.txt","/var/www/straped/mufon/org/30873.html"],"Latitude":"40.154547","Date Submitted":"08/13/2011 11:59 UTC","Log Number":"US-08132011-0009","Country":"United States","Region":"Pennsylvania","Object Features":"Dome, Window(s)","Weather Factors":"Unknown","Disposition":"Insufficient Data","City":"Elizabethtown","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsWhile letting the dog out my girlfriend screamed for me, upon getting to her she asked me what a Metor Shower looked like as tonight was the annual shower and I told her she should be looking out for them. She then asked what it looked like and I described it as stars falling from the sky. She then said to me she saw a UFO. I asked where? She stated she observed it coming towards her from the West and began to travel North approximatley 200 yards from our house. I asked What it looked like. She described the UFO as a disk shaped object with a dome on top. At the bottom of the dome there were windows where she noticed a white light. She then described the disk portion. She said the lower half was spinning slowly and had large bright Blue,Red,White lights emanating from it. She stated that UFO was traveling slowly and just above the trees. The lights were actually reflecting off of the tops of the trees which are approximately 80-100ft off of the ground. The UFO was not making any noise what so ever. This occurred at 9pm and there was still a bit of light out as sun was setting and the moon was almost full. We had clear skies last night during that time. We live on the path for MDT and are use to seeing very low flying Helecoptors and Airplains, my girlfriend said this was neither. You should add interior colors to your choices."],"Summary":"observed a disk like object with a dome on top with red/blue/ white lights, had windows with white light inside. Came from West over the tree line and turned North.","Viewing Distance":"101-500 Feet","Longitude":"-76.605213","Date of the Event":"08/12/2011 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.154547,+-76.605213(30873)&iwloc=A&hl=en\"> mufon case (30873) map </A>"}