{"Case Number":"30870","Country":"United States","City":"Kill Devil Hills","Date of the Event":"03/09/2011 06:04 UTC","Region":"North Carolina","Viewing Distance":"21-100 Feet","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other","Sighting Duration":"00:08:00","Date Submitted":"08/13/2011 06:14 UTC","Longitude":"-75.67378","trends":["There have been 3 other sightings in Kill Devil Hills","There were no other sightings in Kill Devil Hills on or around March 9th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Summary":"TRIANGULAR INTERDEMENSIONAL CRAFT","Tags":"City","files":["/var/www/straped/mufon/html2text/30870.html.txt","/var/www/straped/mufon/more/30870_submitter_file1__belgium_triangle_ufo.jpg","/var/www/straped/mufon/org/30870.html"],"Weather Factors":"None","Object Shape":"Triangle","Log Number":"US-08132011-0006","divs":["sighting detailsi was with my two friends(name removed)and (name removed) 08\\13\\11 20:06 cst flg. we were not on any drugs and just so happen to step outside and smoke a ciggarette while waiting on our friend jenna bryant. while looking over at the beach(standing on coral st. in front of the yellow apartments near landing st.) this three pointed craft was seen physically jolting out of the water noticeablly coming out of the ocean (the water was disturbed) there were three bright lights on each of the three corners of the craft. there was deffinately light from the sun reflecting off of each side making the appearance of a single triangular tetrahedron. both lauren and corey were seeing the same thing in awe, one of my first wake up calls. this happened around 2008. it came hovering very slowly out of the water going from the east coast to the middle of the 158 highway. the craft then did a 360% turn facing the 1 pointed side directly north and beamed off making no sound, only a ringing in the ears type of frequency as if someone had just turned the television on. i am very aware of the esoteric knowlage that the american people pushover to be a hoax. not everyone will see these beings and learn things we learn. i have also seen giant orange orbs come out of the ocean and sound some times just 1 or 2 but in many cases 15 or more at a time comming out of deep water and off into space untill they become invisible to the naked eye. wake up!!!!"],"Object Features":"Unknown","Latitude":"36.038283","map":"<A HREF = \"http://maps.google.com/maps?q=36.038283,+-75.67378(30870)&iwloc=A&hl=en\"> mufon case (30870) map </A>"}