{"Source":"MUFON","City":"Edison","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.525085,+-74.406955(30878)&iwloc=A&hl=en\"> mufon case (30878) map </A>","Date Submitted":"08/13/2011 06:14 UTC","Case Number":"30878","Disposition":"Insufficient Data","Weather Factors":"Unknown","Latitude":"40.525085","divs":["Sighting DetailsWhile driving so. on Rt. 287 on clear day, I aproached an accident which stopped all traffic. As I looked ahead I noticed what I thought was a helicopter over the accident scene. It appeared dark and hovering at first, but as I came closer, I saw it start to tumble in place which really got my attention. Traffic moved bumper to bumper and I really wanted to see this object and record it on my handycam.As I came closer I could see the object was many oval shaped things close together,reflective -orange-Bronze- mettalic looking.Looked like those reflective party balloons all strung together,but they stayed equally separated and would rotate and tumble in place for about 30 sec. at a clip. This was about 500 ft. over the hwy. at rt. 1 so. exit. I passed the accident and pulled over to the shoulder to record the object.( right before turnpike entrance.) Took out handycam and tracked object floating upward and away toward Woodbridge, and due to the excitement, I never hit the record button on cam! This was strange sighting , could be elaborate hoax or kids toy, could find nothing on internet that resembled what I saw.Wondering if any other reports of this. I may have the date wrong, but it was a monday at 10:30 am. The size of this thing was about 10 ft. wide."],"trends":["There have been 6 other sightings in Edison","There was one other sighting in Edison on or around July 18th 2011"],"files":["/var/www/straped/mufon/html2text/30878.html.txt","/var/www/straped/mufon/org/30878.html"],"Date of the Event":"07/18/2011 10:30 UTC","Region":"New Jersey","Object Shape":"Other","Log Number":"US-08132011-0014","Summary":"Object hovering over Hwy 287 then slowly drifted up and away.","Longitude":"-74.406955","Tags":"City","Object Flight Path":"Hovering then path","Country":"United States","Object Features":"Appendage(s)","Viewing Distance":"101-500 Feet"}