{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Date Submitted":"08/13/2011 08:03 UTC","City":"Charlestown","Case Number":"30887","Weather Factors":"Unknown","Region":"Indiana","Disposition":"Insufficient Data","Log Number":"US-08132011-0020","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Sighting Duration":"00:00:07","Country":"United States","Object Features":"Unknown","Summary":"clouds moving left across sky, and the object moves slightly faster, visible only in clear sky. Eventually its covered by a massive cloud.","Source":"MUFON","Tags":"City","Longitude":"-85.661441","map":"<A HREF = \"http://maps.google.com/maps?q=38.46255,+-85.661441(30887)&iwloc=A&hl=en\"> mufon case (30887) map </A>","Latitude":"38.46255","trends":["There have been 3 other sightings in Charlestown","There were no other sightings in Charlestown on or around August 13th 2011"],"files":["/var/www/straped/mufon/html2text/30887.html.txt","/var/www/straped/mufon/org/30887.html"],"Date of the Event":"08/13/2011 07:20 UTC","divs":["Sighting DetailsI was at my friend's house in charlestown, in a neighboorhood off of 403. there was three of us sitting watching the clouds and making out shapes and noticing how they would get distorted over aperiod of time because they were moving from the right side of the sky and reach the left. Eventually we didbt see anymore shapes and was just talking. I was kinda still looking here and there. It was about 715am-7:20am at this point. slightly to the right of my vision I saw what I first thought was the moon. I realized it wasnt the moon because it was too small. So I said, \"whats that, thats not the moon?\"my friend found what I saw briefly before it moved behind the clouds. he thought it was a star. But stars dont move. My other friend didnt see it in time. Wasnt a meteorite because it was in the sky for 6-8 seconds. It didnt give the appearance of burning or anything.there was big clouds in the sky that were covering it before it appeared In sight. As it moved to the left, it eventually wasnt visble because more clouds covered it. It may have been a mile in the sky or more. But it was behind the view of the clouds, wasnt in them. So it had to be a couple miles out maybe. So we tried to weigh out the possibilities. At first I thought it could have been a star and the clouds gave an illusion it was moving. But it was impossible because of the clouds speed, and direction. In ordet for the clouds to give illusion it was moving to the left, they would have to move fastly to the right. But they were moving very slowly to the left as we previously notice while watching for shapes in tge clouds. We werent frightened or anything, just amazed. My only explaination is, wheather balloon. But i believe it was too big to be a wheather balloon. We saw an aiplane on the far left side earlier that was lower and was kind of a point of reference."]}