{"Region":"Oklahoma","trends":["There have been 4 other sightings in Ponca City","There were no other sightings in Ponca City on or around August 13th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.710631,+-97.084595(30889)&iwloc=A&hl=en\"> mufon case (30889) map </A>","Date Submitted":"08/13/2011 11:53 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30889.html.txt","/var/www/straped/mufon/org/30889.html"],"Country":"United States","City":"Ponca City","Object Features":"Unknown","Log Number":"US-08132011-0022","Tags":"City","Summary":"*Spotted the light in the sky. Light appeared larger and brighter than stars. Watched it move across the sky overhead from southwest to northeast.","Longitude":"-97.084595","Object Flight Path":"Straight-line path","Date of the Event":"08/13/2011 09:30 UTC","Latitude":"36.710631","Disposition":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Star-like","Case Number":"30889","divs":["Sighting DetailsThere was a full moon tonight. Arriving home around 9:30, I glanced up to see if the stars were coming out. As is my norm, I then scanned the sky for movement. I spotted a small light moving across the sky from west to east. This light was high and moving fast. Looking around I spotted what appeared to be a plane; colored lights and flashing white lights, moving across the sky in a west-northwesterly direction. I was talking to my wife as I spotted these lights in the sky, joking as I often do about UFO sightings--if you can't identify it... it's a UFO. As my wife was entering the house, I spotted another light in the southwest. It caught my eye as it appeared starlike, but was larger than any star in the sky. As I watched, I slowly became aware that it was moving toward the northeast; basically coming right toward me. I called to my wife, but she was already halfway in the house and did not hear me. I checked to see if the light was still there; really moving. It was and for a moment it appeared there was a smaller light along side the first light moving with it... I cannot confirm this was not a trick of the light with my glasses. As the light was still moving toward me, I pulled out my phone and texted my wife and my dsughter (who was also in the house). My wife came out about the time the light had traveled to nearly, directly overhead, traveling at a steady pace. My granddaughter also came out to see the light and then my daughter and her boyfriend. All witnessed the light, none had any idea what it was. The light, as it traveled overhead, appeared lower than the airplane that had passed previously, yet there was no sound. The light, once again, was larger in the night sky than any star, appeared to be less than a mile high (guesstimation), and was simply a non-changing, starlike light. I do not completely rule out the possibility of this being a satelite of some kind, although it appeared to be much lower than any satelite I have witnessed in the past; there were not flashing lights, and the path (southwest to northeast) did not seem right for a satelite. The light was visible until its path took it behind the tree line. This was an exciting event as I often look to the skies to see what might be up there, but this is the first absolute sighting of a UFO (I could not identify it) since I was a youngster and a friend and I sighted a cigar shaped craft in the sky one afternoon that simply disappeared in time."]}