{"map":"<A HREF = \"http://maps.google.com/maps?q=39.223941,+-121.051181(30896)&iwloc=A&hl=en\"> mufon case (30896) map </A>","City":"Grass Valley","Object Features":"Undisclosed","Viewing Distance":"101-500 Feet","Object Shape":"Triangle","Country":"United States","trends":["There have been 10 other sightings in Grass Valley","There were no other sightings in Grass Valley on or around November 30th 1996"],"Date Submitted":"08/14/2011 02:27 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/30896.html.txt","/var/www/straped/mufon/org/30896.html"],"Summary":"my friend and i got outa the car and watched it right above us for about 5 min. no noise, and it was huge. the ship was shimmery is the only way i can explain. please call me, its a 5 min story.","Object Flight Path":"Hovering then path","Tags":"City","Latitude":"39.223941","Region":"California","Source":"MUFON","Case Number":"30896","Date of the Event":"11/30/1996 12:00 UTC","Longitude":"-121.051181","Weather Factors":"Unknown","divs":["Sighting DetailsIn early 1997, my friend and I got off work around 2am. We ate dinner at a 24 hr dennys and started driving home. His car had a sun roof and I saw a weird, huge thing in the sky, almost directly above us. I told him to stop and we got out of the car. We were standing right in the middel of one of the main roads in grass valley. We stood there watching it move very slowly for 5 minuits untill it finally went over some big trees and we lost sight. We chased after the ship, but roads are few and far between there ande we never cought up with it. It was a huge triangle shaped ship with 3 redish, circleular lights on the bottom. I haven't seen my friend since 1998, but I'm sure he will tell you the same thing. This has bothered me for 14 years now. I have seen other simalur storys on diffrend shows. My sighting seems to have been longer and more close up than any other I've seen. People please belive me! I have no reason to lie. What I saw was real and not from earth!!!!!!!!"],"Log Number":"US-08142011-0007","Sighting Duration":"Undisclosed"}