{"Disposition":"Unresolved","Longitude":"-87.803743","Case Number":"30890","Latitude":"41.870234","Log Number":"US-08142011-0001","Object Shape":"Other","Viewing Distance":"Unknown","Source":"MUFON","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around August 13th 2011"],"City":"Forest Park","Date of the Event":"08/13/2011 09:30 UTC","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"08/14/2011 02:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.870234,+-87.803743(30890)&iwloc=A&hl=en\"> mufon case (30890) map </A>","Summary":"Black rotating object with what seems like a rudder traveling at night. No lights or sound.","Tags":"City","Region":"Illinois","divs":["sighting detailsi was on my balcony facing east with my so and she saw the object first. \"is that a black bag?\" i looked at it and realized it was not. she agreed it was definitely not a bag because it didn't float, dip or dive and the shape was wrong. what we saw was black moving with intent in a straight line, from northwest to southeast. this was 9:30 pm on saturday evening. the object had no lights and made no sound at all. the closest way to describe it is almost like a helicopter but with no blades (no wings), but it seemed to have a rudder than was moving in an opposite direction of the body. rotating, clockwise v. counter-clockwise. sometimes it seemed like the body of the object changed shape but it moved so quickly and it was matte-black - i can't say it changed shaped with 100% certainty. it had weird edges. we could see the rudder-like part when the object went past the moon. the moon this evening was partially obscured by clouds from scattered thunderstorms this afternoon, and the object traveled beneath the cloud cover. i thought the object was smaller than a helicopter, but i'm not sure. it seems like it was the size of an ultra-light aircraft. it may have been traveling slightly under the normal altitude for helicopters in this area, which travel by frequently because of my proximity to o'hare. a jet was leaving o'hare going southeast far behind the object, and a helicopter was later visible over the city, which is very normal. what is not normal is the fact that there were no lights and no sound and it was moving somewhat faster than a jet. it was very eerie. i searched google's image cache and i found something here: (url moved to report body) 08\\14\\11 05:53 cst flg this image is similar in shape but the object we saw was matte-black."],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/30890.html.txt","/var/www/straped/mufon/org/30890.html"]}