{"Disposition":"Insufficient Data","Date Submitted":"08/14/2011 02:40 UTC","Region":"Iowa","Latitude":"42.467061","Summary":"Facing east below the full moon with the same brightness it moved NE for 30-35 seconds No sound. Then I called local police dispatch to report it. No flashing lights or normal aircraft running lights.","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-96.358511","City":"Sioux City","Object Flight Path":"Undisclosed","Tags":"City","Log Number":"US-08142011-0002","Object Features":"None, Unknown","Viewing Distance":"Unknown","Date of the Event":"08/13/2011 10:24 UTC","Source":"MUFON","Object Shape":"Sphere, Other","trends":["There have been 12 other sightings in Sioux City","There were no other sightings in Sioux City on or around August 13th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.467061,+-96.358511(30891)&iwloc=A&hl=en\"> mufon case (30891) map </A>","Case Number":"30891","Country":"United States","files":["/var/www/straped/mufon/html2text/30891.html.txt","/var/www/straped/mufon/org/30891.html"],"divs":["Sighting Detailsmy girlfriend, her 11 yr old granddaughter and myself were siting around our firepit at 9:40pm to 9:47pm time frame watching the full moon when in the blink of an eye the bright light appeared below the moon. It was a solid bright light with no visible structure due to the emence brightness. It slowly moved over the treeline and disappeared out of our sight. It maintained the approximate same altitude as it moved away at a gradual pace turning in a more Easterly direction. I do not think it was any typical military or commercial vehicle. I Beleive it to be a very odd and unnatural. It was totally unexplainable to me, for I have NEVEREVER seen anything remotely similiar, I was very excited, in awe and my girlfriend was mystified at first and then scared and her and our grandaughter went inside. After they left I just had this driving force to report it so I called (phone number removed)flg. For local dispatch and told the female on the line what I saw and suggested she contact the airport and see if There was anything in the airspace. I think she thought I was nutZ. Then in the general direction where it disappear over the treeline then I heard a huge explosion and firetrucks and ambulance siren for 20 minutes. At about 1140-1150 it reappeared were I first saw it and then it flashed and was gone. No end trails during either sighting. Our granddaughter was also outside when it happened the second time. She is very frightened by it all. For the past 8 day I been noticing either alot of strange shooting stars or meteors or something I am unfamiliar with."]}