{"Log Number":"CA-08152011-0001","Disposition":"Unresolved","Region":"Nova Scotia","Case Number":"30905","Summary":"Star like light descended flew overhead then asended","Sighting Duration":"00:01:30","Latitude":"44.032967","Date Submitted":"08/15/2011 12:13 UTC","files":["/var/www/straped/mufon/html2text/30905.html.txt","/var/www/straped/mufon/org/30905.html"],"Longitude":"-64.717656","Date of the Event":"08/13/2011 10:21 UTC","trends":["There have been no other sightings in Liverpool","This sighting has never been favorited."],"Object Features":"Unknown","Tags":"City","Source":"MUFON","City":"Liverpool","Object Shape":"Boomerang, Star-like","Object Flight Path":"Straight-line path","divs":["Sighting DetailsWhile having a family campfire at a family cottage near the ocean I observed a flash of light on the edge of a cloud and a star like white light appear and fly in an easterly direction. This happened at approx 22:00 it flew out of site and was around the size of a star; it was around 1000-2000 ft up in the sky and at a constant speed, 400-500 mph. At 22:21 I noticed a light in the westerly sky a little bigger than Venus and much brighter, the light was ball shaped and has arcs of light coming horizontally from the center, similar to the diamond ring during an eclipse. The light headed straight at us and didn't seem very high in the sky, may be 1500 ft up. It kept a constant speed and slowly desended to 750-1000 ft and was traveling may be 100 mph. There was no sound from the object and when it was overhead it looked like there was a central light and the arcs were reflections on a silvery surface. It kept a constant speed and headed south east and seemed to gain height an flew.into mist. There was a full moon and clouds in the sky, stars were visible. There was alot of air traffic going to Halifax airport and they flew over head all night. The object came from a different direction, was much lower, had no navigation lights and made no sound. It was to slow to be a meteorite, to big to be a satellite and way to low. I like astronomy and have a telescope so I know it wasn't a star or a planet. I would like to find out what it was. My wife and uncle saw it too."],"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=44.032967,+-64.717656(30905)&iwloc=A&hl=en\"> mufon case (30905) map </A>","Weather Factors":"Unknown","Country":"Canada"}