{"Viewing Distance":"Over One Mile","Case Number":"30907","Country":"United States","Summary":"Bright Orb Golden light from SW to NE slight flutterring","Object Flight Path":"Straight-line path,Other","Tags":"City","divs":["Sighting DetailsWalking facing SW watching some meteor shower activity with a few visible high jets in the surrounding night sky. Suddenly noticed a VERY bright golden light heading straight for me from due SW on the horizon approaching steady but fast. I initially thought it was the ISS since I know it would be in the area. I immediately noted the time, 947pm west coast. THe object flew directly towards me then overhead. I stopped to watch it very carefully, thinking I was going to see the outline of the ISS. As it approached I noticed its path was not entirely straight as it fluttered side to side slightly. Thinking this odd for the ISS I continued to watch now more intently. The object became much brighter and I was sure this was sunlight reflecting. IT seemed to slow and headed out more or less on the same trajectory due NE from Eugene Oregon. I noted the time and as soon as I got home one hour later I looked up the ISS realtime path online and noted it was indeed flying over Oregon at sometime, however, the ISS path is going the opposite way, From NW to SE. So, I either saw the brightest reflection from an orbiting body that I have ever seen, ( And I have seen 100's) or it was the ISS and the data online is wrong... or I saw something reportable and worthy of reporting on this forum in case someone else has seen the like tonight. The object seemed to slow considerably as it headed due NE and blacked out when the reflecting light was lost off it. Clearly higher than the 2 high flying jets beneath it in the area as I watched it go away. Nothing would be worthy of noting here ACCEPT the fluttering, side to side movements."],"Sighting Duration":"Undisclosed","City":"Eugene","Latitude":"44.078214","Log Number":"US-08152011-0003","Disposition":"IFO","Object Features":"Unknown","Longitude":"-123.188276","files":["/var/www/straped/mufon/html2text/30907.html.txt","/var/www/straped/mufon/org/30907.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.078214,+-123.188276(30907)&iwloc=A&hl=en\"> mufon case (30907) map </A>","Weather Factors":"Unknown","Date Submitted":"08/15/2011 02:21 UTC","Region":"Oregon","Date of the Event":"08/14/2011 09:48 UTC","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around August 14th 2011"],"Source":"MUFON","Object Shape":"Sphere"}