{"Disposition":"Unknown","Source":"MUFON","Tags":"City","City":"between marathon and alpi","Longitude":"-99.893703","Object Features":"Undisclosed","divs":["Sighting DetailsI was driving home from a friends house at about 2am on my motorcycle. I was watching some lights in the sky thinking it was a plane. As it drew closer I could see a bluish white light, a reddish light, and a greenish light in a triangle formation. With a light at each tip. As it came closer, I stopped my motorcycle to watch it more, so i wouldn't crash. As I was sitting there it got closer and I realized it wasn't a plane because it was far too low in the sky to be one. As it came towards me, it hovered over me about 600 ft in the air above me. What freaked me out so bad was that there was NO movement of the air around me, NO sound at all, NO vibration, just nothing, like the entire earth stood still. I am a very level headed person, and don't believe anything I hear. i have to see before I believe. What i saw, made me piss myself. Driving a motorcycle with wet pants is never fun. it hovered over me for about 5 minutes, the whole time I was just praying for it to go away, move away from me. By the time I got home, I was a crying, stinking mess. Last year, i was watching a show on tv, and I saw on that show, exactly what I saw over me. There were mass sightings in arizona about the same time mine happened. and they described the same thing, and the video looked exactly the same."],"Date of the Event":"05/12/2006 02:00 UTC","Latitude":"31.970349","Viewing Distance":"101-500 Feet","Object Flight Path":"Path then hovering","Date Submitted":"08/14/2011 09:10 UTC","Case Number":"30901","Log Number":"US-08142011-0012","map":"<A HREF = \"http://maps.google.com/maps?q=31.970349,+-99.893703(30901)&iwloc=A&hl=en\"> mufon case (30901) map </A>","Weather Factors":"None","Region":"Texas","files":["/var/www/straped/mufon/html2text/30901.html.txt","/var/www/straped/mufon/org/30901.html"],"Object Shape":"Triangle","Country":"United States","trends":["There have been no other sightings in between marathon and alpi","This sighting has never been favorited."],"Summary":"flew straight then hovered above me","Sighting Duration":"Undisclosed"}