{"files":["/var/www/straped/mufon/html2text/30909.html.txt","/var/www/straped/mufon/org/30909.html"],"Object Shape":"Circle, Diamond, Disc, Egg, Oval, Sphere, Star-like, Teardrop","City":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/15/2011 04:00 UTC","Date of the Event":"08/14/2011 12:00 UTC","Case Number":"30909","Object Features":"None","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-119.413442","Summary":"UFO next to the sun. It seemed to go down then up then shot across the sky.","divs":["sighting detailsi just got out of the movie theater and was walking to the car with my g\\f. i happened to look up and noticed the sun was blocked by a belltower decorating the top of the buildings, and j could see a halo\\corona around the sun. i suddenly noticed there was a bright star like object to the right of where the sun was covered and it was hovering. i pointed it out to my girlfriend, who noticed it as well. it suddenly started to rise, then dipped and rose again. it started to ascend. when it got to the blue part of the sky, my girlfriend lost sight of it, but it was still clearly visible to me. it looked like a white orb, and it started moving very quickly in my direction. even though i tried pointing it out to her again she couldn't see it. it moved very quickly, seemingly gaijin acceleration, and as it got closer it got smaller. when it passed overhead it appeared grey in color, but te edges were indistinct (it almost looked fuzzy). i had a very long sighting in 2008, where i saw a purple orb that changed into a trapezoidal shape, however this orb looked very different. my g\\f asked me again where it was, and i looked away for a second and it was gone. no sound, could not have been a balloon or an airplane, and was travelling at a very high rate of speed. we both agreed it was unidentified, flying and an object."],"Latitude":"36.781161","map":"<A HREF = \"http://maps.google.com/maps?q=36.781161,+-119.413442(30909)&iwloc=A&hl=en\"> mufon case (30909) map </A>","trends":[],"Region":"California","Source":"MUFON","Log Number":"US-08152011-0005","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change"}