{"Object Shape":"Star-like","Summary":"Star like light greenish white traveling from various directions at a high altitude and high rate of speed.","Source":"MUFON","Date Submitted":"08/14/2011 09:49 UTC","Disposition":"Unknown","City":"St Ignace","Date of the Event":"08/12/2011 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"30902","files":["/var/www/straped/mufon/html2text/30902.html.txt","/var/www/straped/mufon/org/30902.html"],"Tags":"City","divs":["Sighting DetailsMyself and a friend where sitting outside on my deck by a small campfire talking. It was very clear and there was a full moon. I looked up into the sky and noticed a greenish white light, starlike moving from the Northeast at a high rate of speed. The big dipper was in the Northwest sky and the UFO travled in what appeared to be across it. The light was constant and did not pulse or change but it did fade out as it got further to the West Southwest. Then the same light appeared again moving from the South to the East at the same rate of speed and then faded out again. No variation in the light or pulsating. We continued to watch the sky for a couple of minutes and the same light appeared again moving in the same direction as it did when we first spotted it (from the Northeast) At the same time there was a jet liner coming across the sky from the south with the typical blinking red light and we could see the contrail and hear the jet, but at no time did we hear any noise from the UFO. The jet liner crossed the path of the UFO but seemed to be at a lower altitude than the UFO. The UFO was moving at a high rate of speed, faster then the jet liner. Again the ligt faded out and we did not see it again after this. Approx. 15 mins. later a bright metorite came across the sky from north to south."],"Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-08142011-0013","Region":"Michigan","trends":["There have been 2 other sightings in St Ignace","There were no other sightings in St Ignace on or around August 12th 2011"],"Longitude":"-84.723138","Latitude":"45.871954","Object Features":"Unknown","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.871954,+-84.723138(30902)&iwloc=A&hl=en\"> mufon case (30902) map </A>"}