{"Country":"United States","Summary":"Very bright glowing white UFO in sky.","Date of the Event":"06/15/2008 09:20 UTC","Latitude":"32.797275","Tags":"City","Weather Factors":"Unknown","trends":["There has been one other sighting in Mt Pleasant","There were no other sightings in Mt Pleasant on or around June 15th 2008"],"Source":"MUFON","Disposition":"Unknown","Log Number":"US-08152011-0009","divs":["Sighting DetailsOne night during the summer, me and my dad were playing basketball outside on the driveway of our house on our lighted basketball net, when, out of nowhere, we saw a huge, but silent, UFO. It was very bright white and no more than 5 miles away. It was so bright it was hard to look at. It was DEFINITELY NOT A MAN-MADE CRAFT!!! Me and my dad were both stunned and stood there for many moments after the UFO had passed by, trying to figure out what we had just seen. There were no helicopters, airplanes, searchlights, or anything like that in the sky the whole time we were out there playing basketball. The UFO looked like it was descending at a diagonal angle away from us and after about 8 to ten seconds, it vanished behind the trees where we could no longer see it. My dad was never a UFO believer, but after that night, he was convinced that we had witnessed an alien UFO sighting. From some research I have conducted, it seems like the type of craft that the alien Grays would fly, but I cant be sure. To this day, me and my dad are still very surprised from what we saw, and will never forget that night. Sadly, Me and my dad did not have a any camera or video device outside with us and it would have been to late if we ran inside to get one, for the UFO moved VERY fast! P.S. These past few years I have had many sleep problems and have been waking up consistently every night for reasons unknown. I am currently investigating this problem. The strange thing is, I never ever had sleep problems until AFTER this UFO sighting. Thank you."],"Viewing Distance":"Over One Mile","Object Flight Path":"Other","Region":"South Carolina","Date Submitted":"08/15/2011 11:27 UTC","Case Number":"30913","Object Features":"Unknown","City":"Mt Pleasant","files":["/var/www/straped/mufon/html2text/30913.html.txt","/var/www/straped/mufon/org/30913.html"],"Object Shape":"Bullet, Missile","map":"<A HREF = \"http://maps.google.com/maps?q=32.797275,+-79.858905(30913)&iwloc=A&hl=en\"> mufon case (30913) map </A>","Sighting Duration":"00:00:08","Longitude":"-79.858905"}