{"Object Shape":"Sphere, Triangle","Object Flight Path":"Path with directional change","divs":["Sighting DetailsHusband was outside on the patio, he started knocking on the door for me to hurry up and come outside, and that there was something in the sky that he didnt know what it was. I stepped outside on the porch and he pointed up to what he was seeing and I looked in the direction and the only way to say what it looked like is that it was round shaped, glowing red, moving in a North direction than turning slightly to the East for a North East direction, moving at a steady pace then going up higher till it was out of site. Later on that same evening, about an hour and ahalf later, directly above us a bright glowing triangle shaped object apeared out of know where. It was visualy closer then the red object, it really scared me, because I could make out the outline of it and it was so bright, Ive never seen anything like it, it also was moving in a North East direction and seemed to go up and disapear, we saw one more just like it later on and it also was moveing North East and went up and dipapeared. After that last one I went inside, I had decided Id seen enough. These things that we saw were not airplanes, helicopters, balloons ect.. Very strange."],"trends":["There have been 14 other sightings in Decatur","There were no other sightings in Decatur on or around August 13th 2011"],"Region":"Illinois","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.798656,+-88.928352(30917)&iwloc=A&hl=en\"> mufon case (30917) map </A>","Sighting Duration":"Undisclosed","Object Features":"None","Date Submitted":"08/15/2011 02:58 UTC","Date of the Event":"08/13/2011 08:57 UTC","City":"Decatur","Country":"United States","Tags":"City","Longitude":"-88.928352","Log Number":"US-08152011-0013","Case Number":"30917","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/30917.html.txt","/var/www/straped/mufon/org/30917.html"],"Viewing Distance":"Over One Mile","Summary":"Saw 2 triangle white glowing UFOs and 1 red round glowing UFO in the same night.","Latitude":"39.798656"}