{"Case Number":"30921","Longitude":"-111.991049","Object Shape":"Oval, Sphere, Star-like","Region":"Arizona","Object Flight Path":"Path then hovering","Latitude":"33.502364","Sighting Duration":"Undisclosed","Date of the Event":"08/14/2011 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Weather Factors":"None","Log Number":"US-08152011-0016","Source":"MUFON","Country":"United States","Date Submitted":"08/15/2011 04:14 UTC","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around August 14th 2011"],"Disposition":"IFO","divs":["Sighting DetailsAt 9:15 PM I was walking my dogs at a park on 42nd St and Campbell. My friend Margaret joined me at about 9:45 PM we were standing on the South West corner of Campbell and 42nd street, I was facing West and Margaret was facing East with my dogs between us. What made this siting extremely weird for me, was that I was telling Margaret about a blue orb my friend Jim recorded on his phone on August 5th and again on August 14th at around 9:00PM (7:00PM PST) in Fort Worth Texas (I have the videos, he isn't very tech savvy so I will be helping him file a report). Margaret asked me something to the effect of, \"What do you mean by a dancing blue light? You mean like on a plane?\" At that moment, I noticed what appeared to be an aircraft with a bright light out of the corner of peripheral vision to the south west. I turned to get a better look at the light, and as I did, I noticed it was a bright, pulsating baby blue light, making erratic maneuvers in between two large trees. It seemed to hug the tree line as it danced. It was hovering, darting down and up at high rates of speed. I exclaimed, \"It looked just like that!\" Margaret turned around to see what I was screaming about. She said, \"Oh, that's a,\" and as she was trying to explain it for me, it started darting up then down, then made a circle motion parallel to the ground. I reached for my phone to take a video, but as quickly as it appeared, it disappeared behind the trees. We stood on the corner trying to rationalize what we saw. At about 9:50, the object returned, Margaret said it had to be a bug under a street light, but that theory was quickly abandoned when we noticed that this light was higher than all the surrounding telephone poles and trees. As the orb danced it started to pulsate on, off, on, bright, dim, then it darted to the East, away from our field of view."],"files":["/var/www/straped/mufon/html2text/30921.html.txt","/var/www/straped/mufon/org/30921.html"],"Summary":"Blue light pulsating between tree line. Made fast maneuvers, disappeared and reappeared, only to vanish behind tree line. 10 minutes later, flash from within trees closer to my location.","City":"Phoenix","map":"<A HREF = \"http://maps.google.com/maps?q=33.502364,+-111.991049(30921)&iwloc=A&hl=en\"> mufon case (30921) map </A>","Object Features":"Unknown"}