{"divs":["Sighting DetailsOne morning on the way to the school where she works, my grandmother, uponpulling onto a main road took notice of a conspicuous, unnatural white sphere inthe sky. Living in a largely sparse and unpopulated area, she proceeded to takethe normal route every morning around 500 A.M. to work. The object, she noticed,was following her. It followed her for 8 SOLID MILES She knew it was noconventional aircraft, as it followed her at approximately 100 feet and againshe emphasises the feeling of uneasiness. She never concluded that it was anyform of a conventional aircraft, as no effects concerning them applied to thisevent. She kept looking over her shoulder during the drive, waiting in unusualanticipation for something to happen. The object was entirely silent - it madeno mechanical sounds whatsoever. Nothing was emitted from the object, the hazemight have been emitted from the craft, but from the time she first noticed itthe mist accompanied the object. My grandmother describes the object as abrilliantly bright white sphere. She observed a haze or mist surrounding theobject - and kept looking over her shoulder in fear and anticipation. She knewand felt that this was most certainly not commonplace, and it was not supposedto be there. After finally making it to work on time which I must point outthere was no case of missing time she got out of her car and glimpsed at theobject that now stopped and hovered in position. She entered the building andafter work it was gone. She is still uneasy about the event. She is anhonourable lady and does not take the matter lightly. She is no liar. There areonly so many possible explanations."],"Object Features":"Undisclosed","City":"Geneva-on-the-Lake","Longitude":"-80.953983","Latitude":"41.859497","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=41.859497,+-80.953983(3092)&iwloc=A&hl=en\"> mufon case (3092) map </A>","Sighting Duration":"00:30:00","Weather Factors":"Unknown","Case Number":"3092","Tags":"City","Date of the Event":"04/01/2002 05:15 UTC","trends":["There has been one other sighting in Geneva-on-the-Lake","There were no other sightings in Geneva-on-the-Lake on or around April 1st 2002"],"Source":"MUFON","Date Submitted":"04/01/2002 05:15 UTC","Object Shape":"Undisclosed","Viewing Distance":"21-100 Feet","Object Flight Path":"Straight-line path","Disposition":"IFO","Summary":"unnatural light follows car for 8 miles","files":["/var/www/straped/mufon/html2text/3092.html.txt","/var/www/straped/mufon/org/3092.html"],"Country":"United States","Region":"Ohio"}