{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30930.html.txt","/var/www/straped/mufon/more/30930_submitter_file1__ufo.JPG","/var/www/straped/mufon/org/30930.html"],"Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","Log Number":"US-08152011-0022","City":"Croswell","Object Shape":"Cigar","trends":["There have been 4 other sightings in Croswell","There were 2 other sightings in Croswell on or around August 15th 2011","This sighting has never been favorited.",""],"Region":"Michigan","Disposition":"Unresolved","Country":"United States","Longitude":"-82.614292","Object Features":"Other","Date of the Event":"08/15/2011 08:20 UTC","divs":["Sighting Details7:20 p.m. Croswell, Michigan. Clear blue sky, daylight. I was sitting on my side porch with my husband, looked up and saw strange cigar shaped, Ibuprofen shaped object, bright white with dark spot in the middle, at about airplane height. Moved at about the same speed an airplane would. No wings. It was not an airplane. It moved in straight path and seemed to be moving farther away (growing slightly smaller). My husband grabbed binoculars and through them we saw flames coming out of one end, as if it was propelled by fire. It looked like, perhaps, a missile, although I have never seen a missile. It also looked like what I would imagine a thruster that falls off a space shuttle might look like. I saw this object in the same area, and moving in the same direction of sky where I have seen the orange yellow orbs, which I have made past reports on. We lost sight of object when it moved past the tree line. I included a photo of sketch I made of what we saw through binoculars."],"Summary":"From side porch of my home, saw airplane heighth cigar shaped, Ibuprofen shaped object, Bright white, either reflecting sun or glowing. Black spot in center. Through binoculars could see fire coming out of one end. Others also witnessed.","Date Submitted":"08/15/2011 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.278616,+-82.614292(30930)&iwloc=A&hl=en\"> mufon case (30930) map </A>","Latitude":"43.278616","Weather Factors":"Unknown","Case Number":"30930"}