{"Case Number":"30933","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Beloit","There were no other sightings in Beloit on or around August 15th 2011"],"Object Features":"None","City":"Beloit","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/30933.html.txt","/var/www/straped/mufon/org/30933.html"],"Source":"MUFON","Latitude":"42.498237","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.498237,+-89.049429(30933)&iwloc=A&hl=en\"> mufon case (30933) map </A>","Longitude":"-89.049429","Sighting Duration":"Undisclosed","Date Submitted":"08/15/2011 11:26 UTC","Date of the Event":"08/15/2011 09:15 UTC","Log Number":"US-08152011-0025","divs":["Sighting Details On 8-14-2011 I walked outside to check on my 2 oldest boys and a friend that were playing across the street at the park. As I almost always do as a sky watcher I happened to look up as I started walking south down my driveway, just to check it out. AS I did I instantly noticed a singular, extremely bright, almost auraish, white light moving across the sky in a north, northeasterly direction. NOT A SATELLITE!!!!! I have seen many, many, of these over the years and this was at airplane level. Not anything that I have ever seen bfore. Especially considering the brightness, the abrupt flight path change to the east, northeast, absolutely no sound, and the fact that the light did not lose brightness or change as it moved off to the east out of sight. I almost did this last night just because it`s something I have never seen before, and the boys witnessed it. So again tonight on 8-15-2011 I walked outside to the driveway to have smoke about the same time just to witness the same thing, but a little farther north this time. I did call the same son outside to witness it but he thinks i`m just over reacting to an airplane with landing-gear lights on. Landing-gear lights tend to disappear as they move away from you though. Anyone else see this and report similar? Or any radar reports available for the area that you could check out? I have never seen this flight path in the area ether; I`ve lived here my entire life!!!!!!!!!!!!!!! Searching for answers!!!!!!!!!!!!!!! thanks! Or how about letting me know what type of craft flies at cesna level and doesn`t have blinking lights or make sound of any kind?"],"Disposition":"IFO","Summary":"extremely bright, solid, white light, abrupt flight path change, no sound, no blinking lights, strange flight path!","Region":"Wisconsin","Object Shape":"Unknown"}