{"Country":"United States","Summary":"Large bright starlike object completely stationary then vanished without a trace.","City":"Sacramento","divs":["Sighting DetailsI came out from the building where I work to smoke a cigarette. i heard some loud birds overhead. My work is in the Natomas area where there are a lot of open fields and the variety of birds are very diverse. There were two hawks flying due north overhead singing to each other when their path crossed with another hawk. (I had never seen that many hawks in one place before). They began to dive and sing. It almost looked like they were fighting. As i watched this event, out of the corner of my field of vision i noticed a bright light in the sky. It was very small, like a large, bright star. It was 11:25am so it was warm and bright outside. it was fairly high up, probably about 75 degrees to 80 degrees off the horizon. Using the hawks as a measuring point it looked like it was very far off in the distance compared to the birds who were flying at about 100 ft above me and about 50 to sixty feet from my position on the ground. I could not gage its size but it was big enough for me to see it from that apparent great distance. It was bright and shone in the sky like a star, completely silent and white. As the birds continued to fly away towards the north the object stayed completely stationary. I kept watching it and pulled out my iphone to take a picture. The object did not turn up in the photo. I was watching for about 5 minutes or so while smoking my cigarette. During this time I didn't let it out of my sight. After my cigarette had burned down it remained for a minute or two. Then suddenly the star simply vanished. it didn't shoot out into space, it didn't burn out or turn off. it just simply vanished into thin air. I was excited to see it. I looked for it every chance i got to come outside all day, but alas, it was gone for good it seemed. When i walked back inside the building after the incident, I looked at my picture i had taken and it was just of the sky, that was it. Nothing. I did see something. I know i saw it. why the camera couldn't see it i don't know. Maybe the camera wasn't powerful enough, i had the zoom all the way up and the iPhone 3GS has bad resolution at full zoom. i was excited to have seen it, but very disappointed no one else was there to see it as well, and that the picture came out horribly."],"Object Shape":"Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.617032,+-121.504022(30932)&iwloc=A&hl=en\"> mufon case (30932) map </A>","Date of the Event":"08/15/2011 11:25 UTC","Date Submitted":"08/15/2011 10:25 UTC","Longitude":"-121.504022","Object Features":"None","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/30932.html.txt","/var/www/straped/mufon/org/30932.html"],"Weather Factors":"Unknown","Log Number":"US-08152011-0024","Region":"California","Latitude":"38.617032","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around August 15th 2011"],"Object Flight Path":"Stationary","Case Number":"30932","Viewing Distance":"Over One Mile","Tags":"City","Sighting Duration":"Undisclosed"}