{"map":"<A HREF = \"http://maps.google.com/maps?q=33.77469,+-117.835831(30949)&iwloc=A&hl=en\"> mufon case (30949) map </A>","files":["/var/www/straped/mufon/html2text/30949.html.txt","/var/www/straped/mufon/org/30949.html"],"Country":"United States","Region":"California","Case Number":"30949","City":"Orange","Date of the Event":"08/16/2011 12:00 UTC","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"08/16/2011 09:30 UTC","Log Number":"US-08162011-0015","trends":["There have been 23 other sightings in Orange","There were no other sightings in Orange on or around August 16th 2011"],"Sighting Duration":"Undisclosed","Summary":"Metallic like cigar shape traveled south of orange ca at a constant speed for 15 seconds then disappeared","Longitude":"-117.835831","Source":"MUFON","divs":["Sighting DetailsMetallic like cigar object what appears to have some shining metallic look to it. Object traveled south of orange ca at a constant speed for 15 seconds or so and then disappeared from sight. Object was moving in a straight line. 1. Where were you and what were you doing at the time? Saw a Metallic like cigar shape object from my car (front window) while I was traveling south on Tustin Ave in Orange CA. 2. What made you first notice the object? Noticed the object in the sky while I was at a stop light off of Tustin Ave because it has a shining or has glittering metallic look to it. Seemed a bit odd since it look like a stick or cigar shape object that was moving at a constant speed but quite fast considering how far away it was. It left no smoke trail and doesn't appear to have any wings. The object looks out of place. I usually see airplanes flying across the sky in this area since we're near John Wayne airport, so I can tell this object looks different. I also know it's not a jet since I know what jets look like because I used to see them all the time because I grew up in San Diego near the Mira Mar air base. 3. What did you think the object was when you first noticed it? I didn't think much, just thought it was weird since it has a shiny look to it. I guess I wondering how come it traveled pretty fast for it being far away. 4. Describe the object and its actions and motions in detail. Object appears to be moving at a constant speed traveling in a straight line. It appears to have a shiny metallic look, but I can tell the shape looks like a cigar. 5. Describe your feelings, reactions and actions, during and after sighting the object. Thought it was a weird looking object, it seemed very long for being an airplane. I kept staring at it just cause it looked out of place. Object then vanished after about 15 seconds that I noticed it traveling at a constant speed and in a straight line. 6. How did you lose sight of the object? It disappeared from sight, I stuck my head out of the car to make sure where it go and could not see it anymore."],"Object Shape":"Cigar, Cylinder","Object Features":"None","Disposition":"Insufficient Data","Latitude":"33.77469","Viewing Distance":"Over One Mile"}