{"Region":"California","City":"San Bernardino","Date of the Event":"07/04/2011 12:00 UTC","Tags":"City","Source":"MUFON","Summary":"Could see outline of ufo, it was huge. Looked transparent like, had many lights, Amazing to acually see the entire ufo up close, unreal!,, yeah, but who will believe me","Case Number":"30940","Disposition":"Insufficient Data","Object Features":"Patterned Surface, Unknown","Weather Factors":"Unknown","Longitude":"-117.24499","divs":["Sighting DetailsMy family and i just returned home from a 4th of july bbq.As my family went inside, my son and i we're gettig the rest of our things out of the car when something in the night sky caught my attention, i glanced up at the mountains and saw lights in the sky that look unusual.I thought at first it was a blimp or maybe a laser light show or something, but how could they accomplish what i was about to see when i focused in on the UFO. I was astonished what i was looking at, it was the most amazing thing i ever saw. To acually see a UFO sighting so close to view, i was just in aw! The UFO look somewhat transparent with small white lights in the center of the UFO that made a circular pattern which looked like one big light and we're the biggest of the lights on the UFO and had many other smaller lights on each side that ran parallel to the UFO, but not in sequence. Some white, blue ,orange, green and perhaps other colors i could not determan since i am somewhat color blind. The UfO stayed in one position for quite some time huvering over the San Bernardino mountains. I spent about 20 minutes looking at it until i decided to go inside the house,who would believe me anyways? I asked my son if he remembered that night but does not remember, since he was somewhat intoxicated that night and told me he somewhat recalls seeing something but really to his knowlege he does not remember. Unfortunately i did not have my video camera on hand, since it was not charged. I could see the entire UFO in plain sight, i never thought in my whole life i would see something so amazing as that. So the real question is was it a UFO or was it militry or what? But i tell you one thing, i know what i saw and it looked as real as can be and i would be willing to take a lie detector test, Because i know for fact it was real and was truely amazing and unexplainable. I only have the memory of what the UFO looked like, i wish i had more evidence but i don't i'm afraid.Do i believe in UFO's YES, but my friends and family think that i am just crazy when i bring the subject up. No i'm not crazy,i do believe they are out there. I'm hoping to see another sighting over the mountains and hopfully i will have my camera in hand next time!"],"Latitude":"34.168161","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.168161,+-117.24499(30940)&iwloc=A&hl=en\"> mufon case (30940) map </A>","Object Flight Path":"Unknown,N/A","Date Submitted":"08/16/2011 03:35 UTC","trends":["There have been 17 other sightings in San Bernardino","There were no other sightings in San Bernardino on or around July 4th 2011"],"Object Shape":"Blimp, Square, Rectagular, Unknown","Country":"United States","Log Number":"US-08162011-0006","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/30940.html.txt","/var/www/straped/mufon/org/30940.html"]}