{"Case Number":"30955","City":"Adelanto","Summary":"Orange/Red lights moving over George Airforce Base","trends":["There has been one other sighting in Adelanto","There were no other sightings in Adelanto on or around August 16th 2011"],"Weather Factors":"None","Object Flight Path":"Other","Tags":"City","Date of the Event":"08/16/2011 10:30 UTC","Log Number":"US-08172011-0001","Latitude":"34.58277","Sighting Duration":"Undisclosed","Longitude":"-117.409215","Source":"MUFON","Viewing Distance":"Over One Mile","Region":"California","Disposition":"IFO","Object Features":"Unknown","Object Shape":"Circle","Date Submitted":"08/17/2011 12:58 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.58277,+-117.409215(30955)&iwloc=A&hl=en\"> mufon case (30955) map </A>","divs":["Sighting DetailsMy husband and I were standing on the porch when we noticed an orange light appear over the George Airforce Base, Adelanto. The light then winked out. A few minutes later 2 lights appeared for a few seconds and then winked out. Shortly thereafter, 3 lights appeared and then disappeared. The 3 lights then reappeared and we noticed all the lights at the Airbase switch on and a helicopter take off toward the lights. As the helicopter approached, the lights winked out and the helicopter returned to the base. The lights returned and another 2 lights appeared a short distance to the left of the original 3. An aircraft then took off from the airbase and headed toward the lights. The lights again disappeared as the aircraft approached. We watched the aircraft fly around the area and then noticed the lights appear over the other side of the airbase which could be several miles from where they first appeared. The period of time was about 10 to 15 minutes from when they disappeared to when the reappeared a few miles away. The aircraft turned and headed towards the 3 lights. The 3 lights then all of a sudden became 6 and were in a Z formation with 1 light on the left, 4 in a diagonal line and 1 on the bottom right. They kept this formation for about 5 minutes and then disappeared as the aircraft approached. When the Aircraft had gone passed, the lights appeared again in a triangle formation with 6 or more lights. They kept this formation for approximately another 5 minutes. Some of the lights were fading in and out. The aircraft returned to the area and the lights again disappeared. Once the aircraft had gone passed again, the lights appeared in a pentagon shape and stayed that way for about 5 minutes. Another helicopter arrived in the area as did another plane. The lights then disappeared. The aircraft continued to fly around the area and the lights would re appear once the aircraft had gone passed. At one stage one of the lights left the group and followed the plane for a short distance, then returned and they disappeared again. We continued to watch as aircraft kept flying around the area but the lights did not return. The whole event happened over a period of about an hour. Unfortunately we had no video camera as we had just moved house, the cameras were still in boxes and in need of recharging."],"files":["/var/www/straped/mufon/html2text/30955.html.txt","/var/www/straped/mufon/org/30955.html"]}