{"Object Features":"Undisclosed","Disposition":"IFO","City":"San Jose","divs":["Sighting DetailsI arrived home from work around 11:45 p.m. on Saturday, August 13, 2011. As I walked toward my house from my detached garage, I looked up and noticed a meteor streaking brightly across the northwest part of the horizon. I decided to grab my digital camera and tripod and went back outside to take some timed exposures to see if I could capture a meteor or two. My exposures ranged 6 and 8 seconds and the camera was aimed toward the northwest, angled about 45 degrees above the horizon. I made several exposures and then rotated the camera more directly upward closer to 90 degrees above the horizon. The photos were taken from about 12:20 a.m. until around 12:45 a.m. Sunday, August 14, 2011, from my driveway in the east San Jose foothills. The camera was mounted to a small tripod to avoid shaking. While I observed many meteors with my eyes, I did not see anything unusual in the sky. That is until I reviewed the photos later Sunday morning about 9 a.m. I was astonished to see the object shown in the photos I have submitted. I didn't hear any aircraft or other noises, nor did I observe any unusual lights or objects in the sky while I was photographing meteors. I am convinced that this a craft of non-terestrial origin, and that it was hovering in different positions in the sky near my home. I have no idea what it is. I will be attempting to capture further images of this object, hopefully a little clearer."],"Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Summary":"Trying to photo meteors, subsequent review of photos showed object in photos that was not observed when taking the photos.","Region":"California","Object Flight Path":"Stationary","Latitude":"37.348191","files":["/var/www/straped/mufon/html2text/30956.html.txt","/var/www/straped/mufon/more/30956_submitter_file1__100_8072.JPG","/var/www/straped/mufon/more/30956_submitter_file2__100_8074.JPG","/var/www/straped/mufon/more/30956_submitter_file3__100_8073.JPG","/var/www/straped/mufon/org/30956.html"],"Longitude":"-121.776767","Date of the Event":"08/14/2011 12:00 UTC","Log Number":"US-08172011-0002","Source":"MUFON","Object Shape":"Square, Rectagular","Tags":"City","Case Number":"30956","map":"<A HREF = \"http://maps.google.com/maps?q=37.348191,+-121.776767(30956)&iwloc=A&hl=en\"> mufon case (30956) map </A>","trends":["There have been 106 other sightings in San Jose","There was one other sighting in San Jose on or around August 14th 2011","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Date Submitted":"08/17/2011 01:13 UTC"}