{"Longitude":"-105.508332","Date of the Event":"08/11/2011 11:15 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/30962.html.txt","/var/www/straped/mufon/org/30962.html"],"Object Shape":"Sphere","Log Number":"US-08172011-0008","Latitude":"40.072208","divs":["Sighting Detailsi was driving south on hwy 72 in between ward, co and nederland, co. at about 11:15 pm. on august 11th, 2011. i noticed light outside vehicle, and thought it was either reflection from sunglasses hanging from rearview mirror, or nearly full moon light through the trees. as i continued driving, the lights stayed with me. it seemed to be in pieces that were rotating around me. it became clear that the source of the light was real but nothing i could explain. i felt a surge of fear. i looked in the mirrors, and out the windows, but could see nothing. i couldn't see above me, but it seemed that the lights were coming from above the vehicle. finally, i turned my head around to look directly out the back window. i saw a bright neon green ball of light. it seemed to be a couple hundred yards behind me, but i can not be sure. i turned my attention back to the road; a car passed. when i turned back around the light was gone. i thought that perhaps someone was harassing the vehicle with a green lazar light. the following day, i checked with the local PD, and there were no reports of anything similar to my experience. the most impressive part of this incredible experience was the sense of fear i felt, which i can not explain any more than the lights i saw."],"trends":["There have been no other sightings in Ward","This sighting has never been favorited."],"Date Submitted":"08/17/2011 12:37 UTC","Source":"MUFON","Case Number":"30962","Object Flight Path":"Stationary","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, Unknown","Country":"United States","Tags":"City","Summary":"swirling bluish lights followed vehicle for a couple miles; saw green light behind vehicle","map":"<A HREF = \"http://maps.google.com/maps?q=40.072208,+-105.508332(30962)&iwloc=A&hl=en\"> mufon case (30962) map </A>","Disposition":"Unresolved","Region":"Colorado","Sighting Duration":"Undisclosed","City":"Ward"}