{"divs":["Sighting DetailsWhen I was 14 years old my family and I lived in NC just outside Willmington,near Rockypoint we camehome late one night in June around midnight we had a couple of horses so I went to check on them and feed them. I was at the barn about 30.in as I walked back towards the house I noticed some lights approaching! They appeared to be landing lights like on an airplane, but I had never seen any aircraft approach from that direction before. I thought that was odd so I stopped about 30 feet from the house and watched as the craft approached as it grew near it got larger and larger until I could tell it was no ordinary aircraft as it made no noise at all. As it came closer I could see details and I realized this was no plane or jet of any known types of the times. The craft came within a quarter mile of me and stopped in mid air hovering in place quietly. The craft was so large I could see it very clear I could see windows here and there as some were lit from within It looked like something straight out of star wars. It was approximately 250 ft from nose to tail, 500 ft wide, about 30ft thick at wingtips and the nose But at center rear it was maybe 100 ft thick on each rear of each wing it had three large rectangular shaped protrusions that glowed red. I figured that must be exhaust ports Maybe fusion powered. The red rectangles looked to be about the size of a single mobile home, and as I said it made no noise at all. I observed the craft for maybe 4 or 5mins then it turned as if you grabbed a pole and swung around. At which time it headed away from me just as quietly as it had came and in the direction from which it came. Now the approach was N,Nw to S,Sw.Now where we were was about 17 miles from the air port at Willmington.I have always wonderd if any one else ever reported this or saw it aswell? I can't think of much else to say at the moment but I remember the incident well I can still see it in my mind clearly to this day I will never forget that night ever.My only regret is that we had no camera to get a picture I asked my mother for one she asked why I wanted it and I told her never mind you wouldn't believe me any way fearing she would freak and make me come in the house. Not wanting to miss the sighting I didn't tell my parents what I was looking at until it was gone.I am sorry I didn't report this then but I'm sure you understand. I know what I saw.I can rough draw it too show what it looked like."],"Object Shape":"Chevron, Other","City":"Rocky Point","files":["/var/www/straped/mufon/html2text/30966.html.txt","/var/www/straped/mufon/org/30966.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.435096,+-77.88773(30966)&iwloc=A&hl=en\"> mufon case (30966) map </A>","Summary":"Large chevron or wing shaped object about 500 feet across and 250 feet long approximately 500 feet above ground with 3 large red rectangular engine ports on each side of rear.","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"08/17/2011 07:50 UTC","Latitude":"34.435096","Country":"United States","Region":"North Carolina","Source":"MUFON","Tags":"City","trends":["There have been no other sightings in Rocky Point","This sighting has never been favorited."],"Case Number":"30966","Date of the Event":"05/31/1978 12:00 UTC","Object Features":"Window(s), Patterned Surface","Log Number":"US-08172011-0012","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-77.88773","Disposition":"Insufficient Data","Weather Factors":"Unknown"}