{"City":"Hampshire","Case Number":"30973","Tags":"City","Summary":"Bright light and object fling what seems to be shapes or writing in sky.","Weather Factors":"None","Disposition":"Unknown","Log Number":"US-08182011-0002","Source":"MUFON","Date Submitted":"08/18/2011 12:40 UTC","Region":"Tennessee","Latitude":"35.596667","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","trends":["There have been no other sightings in Hampshire","This sighting has never been favorited."],"Country":"United States","Object Features":"Unknown","Object Shape":"Disc, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=35.596667,+-87.293056(30973)&iwloc=A&hl=en\"> mufon case (30973) map </A>","Date of the Event":"08/16/2011 10:00 UTC","Longitude":"-87.293056","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/30973.html.txt","/var/www/straped/mufon/org/30973.html"],"divs":["Sighting DetailsMY girl and I were observing the sky when I witnessed a bright light zap into the sky from the south to the west. I then began to notice what I first thought was a star, start moving flying what seems to be shapes and writing into the sky. It will move at a speed that I know for a fact a jet can not accomplish in such a small amount of time and then turn nearly 90 and hover, as jets go by it, it will begin to hover and as soon as it gets parrel it zooms off and away from the jet. It was still in the sky to the west of my house looking to be above Hamspire, TN. This was witnessed by my father, my mother, my fiance, her brother, and step brother, a neighbor, and myself. My father a strict church of christ christian who didn't believe me when i drug him outstide to see it even admitted himself while looking threw the telescope that it was no jet and that he didn't know what it was. he's in awe still. he thought maybe a Sat, untill the object moved far to the north and then cut back what appeared to be straight up and then back south. It was still outside when I came in."],"Viewing Distance":"Unknown"}