{"files":["/var/www/straped/mufon/html2text/30971.html.txt","/var/www/straped/mufon/org/30971.html"],"Region":"Pennsylvania","Date Submitted":"08/17/2011 11:10 UTC","Object Flight Path":"Other","Log Number":"US-08172011-0017","Object Features":"Unknown","City":"Wexford","divs":["Sighting DetailsI was leaning up against my car in a parking lot. Two of my friends were facing me and another friend was sitting or leaning on my trunk facing about the same direction as me. I saw something out of the corner of my eye and looked in that direction. I observed a blue ball of light that appeared to be pretty small.(maybe between 5-10 feet diameter) Then I notice that it was moving in a floating motion very slowly and instantly realized this was something highly out of the ordinary. I muttered UFO and pointed in the direction of what I was seeing to my friends. It was like the Ball understood what I was doing and sped up very quickly and disappeared. It did not fly off, instead it appeared as if the Ball had slipped into a hole or something. I knew my friends had turned around too lately. I was bummed they didn't see it because I knew they could not believe what I had just witnessed, but I still went on and told them anyways, with lots of excitement. Then the friend who was sitting on my trunk (or leaning against it anyways) said he saw it. The whole event of my witnessing it couldn't have been anymore than a few seconds. We were in the parking lot of a church and the object was very close to the church. The Ball couldn't have been more than 50-75 yards away from us, but made no noise whatsoever. About ten minutes later a helicopter flew over us and the church very lowly. It seemed like there were more planes flying in the area too. I had a very peaceful and spiritual type feeling when driving home that night. I talked with my one friend who said he saw the light too and he agreed it was something completely out of the ordinary. It's hard to put into words how this light appeared at the time of seeing it, it was like it didn't belong in this world. It wasn't like any other normal light I've seen before. I think my other two friends were convinced we saw something too."],"Weather Factors":"Does Not Apply","Source":"MUFON","Date of the Event":"08/20/2009 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.627189,+-80.091692(30971)&iwloc=A&hl=en\"> mufon case (30971) map </A>","Sighting Duration":"00:00:05","Longitude":"-80.091692","trends":["There have been no other sightings in Wexford","This sighting has never been favorited."],"Summary":"Saw blue hovering ball, called to friends, ball sped sped up quickly, disappeared into nothingness","Case Number":"30971","Object Shape":"Sphere","Disposition":"Unknown","Country":"United States","Latitude":"40.627189","Tags":"City","Viewing Distance":"101-500 Feet"}