{"Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-08182011-0004","Latitude":"39.969786","Date of the Event":"08/18/2011 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.969786,+-82.989484(30975)&iwloc=A&hl=en\"> mufon case (30975) map </A>","Case Number":"30975","Summary":"whatever this thing is it happened for the second time i am reporting, it seems to be in the ne sky which woukd be over columbus oh","City":"Columbus","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","divs":["sighting detailsmy friend and i are currently sitting on the deck of my house and he noticed a weird object in the sky. while i was inside he yelled come here, i came outside and witnessed this myself. i sat down on the chair facing the ne sky and at that time i had marked it thru the tree limbs, this object has changed shapes, moved directions, and is def something not of military experience. once again i reiterate the fact that if anyone is near the great lakes to always look into the sky on a clear night. it is still plain as day to us and lights up\\ it is hard to explain other than it almost now looks like a butterfly lit up, by the way i live i findlay ohio. this thing is odd it is not a star it is to low and i have tried to get a pic but cant. this thing judging by the diff inaltitude is way closer thanany star would ever be. amamazed i am that it is still hoverring. it seems to have taken a diff form almost scary.. this is not a joke at all, my friend is a farmer and he swears he has never in his life witnessed anything like this. has anyone witnessed this?"],"Date Submitted":"08/18/2011 02:35 UTC","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around August 18th 2011"],"Region":"Ohio","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/30975.html.txt","/var/www/straped/mufon/org/30975.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Boomerang, Star-like, Triangle","Longitude":"-82.989484"}