{"Summary":"Three","Object Shape":"Other","Date of the Event":"07/09/2011 09:30 UTC","Disposition":"Unknown","Tags":"City","Date Submitted":"08/17/2011 10:57 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Log Number":"US-08172011-0016","Latitude":"38.976293","Longitude":"-94.612981","trends":["There have been 8 other sightings in Leawood","There were no other sightings in Leawood on or around July 9th 2011"],"Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.976293,+-94.612981(30970)&iwloc=A&hl=en\"> mufon case (30970) map </A>","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/30970.html.txt","/var/www/straped/mufon/org/30970.html"],"Region":"Kansas","divs":["Sighting DetailsWitness was traveling on I-435 from Raytown to Olathe when she noticed three glowing objects appear from the western horizon. These objects were shaped like \"elongated jelly beans\" and they were flying slowly over I-435 from west to east. The witness was trying to pay attention to the objects and when the witness returned their attention to the highway there was a traffic jam on I-435. The drivers in the 'traffic jam' were also paying attention to the 3 'elongated jelly bean' shaped objects flying over the highway. At this moment the witness noticed that there were police vehicles from the local municipality who arrived at the scene of the 'traffic jam' with lights and sirens on, and the officers in those cars were also watching the objects flying over the highway. The witness returned their attention to the 3 objects and according to the witness, the 3 'jelly bean' shaped objects increased in speed and disappeared over the eastern horizon. This witness is extremely disturbed over the fact that there have been no reports in any of the local media outlets or newspapers. The witness is very hesitant about coming forward with this event. The witness wants to know if there have been any reports to any organizations concerning this event. The witness contacted me via phone and this report was entered into the CMS by Stan Seba, Field Investigator for MUFON- I.D. # 17928."],"Case Number":"30970","City":"Leawood","Source":"MUFON"}