{"Date of the Event":"08/18/2011 02:15 UTC","Log Number":"US-08182011-0005","Object Features":"Undisclosed","Latitude":"41.004965","Weather Factors":"Unknown","Case Number":"30976","Source":"MUFON","Longitude":"-92.416102","files":["/var/www/straped/mufon/html2text/30976.html.txt","/var/www/straped/mufon/org/30976.html"],"Date Submitted":"08/18/2011 04:44 UTC","Object Shape":"Triangle","Region":"Iowa","Viewing Distance":"Over One Mile","Tags":"City","City":"Ottumwa","Summary":"Had dog outside and when started back to house noticed large triangular shape craft with seven redish orange solid lights,no sound.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.004965,+-92.416102(30976)&iwloc=A&hl=en\"> mufon case (30976) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Disposition":"Hoax","trends":["There have been 8 other sightings in Ottumwa","There were no other sightings in Ottumwa on or around August 18th 2011"],"divs":["Sighting DetailsMy wife had our dog out to do her business a little passed 2 a.m. (cst) I was in our kitchen when she threw the door open screaming for me,very shaken. I ran out in my shorts thinking someone was in our yard..She was trembling and told me she had witnessed a large triangular craft pass over our house. It was solid black triangle with seven soft, redish orange unwavering lights one at the tip and three down each side. There was no sound what so ever and appeared to be gliding very slow on a northwesterly heading. I was out the door in a matter of 3 to 5 seconds and this thing was gone that quick. I've been a member of MUFON for quite sometime and have always told her when she's out at night always look up and tonight she found out first hand why. She was trembling and got sick to her stomach immediatley after witnessing this. Our dog is very vigilant and never noticed a thing when this occured. I grabbed our camera and spent 30 minutes outside watching,hoping for a glimpse of this again but to no avail. Her sighting was between 215-220 a.m.(cst)"]}