{"Object Flight Path":"Stationary","Object Shape":"Other","Disposition":"IFO","Region":"California","Tags":"City","Viewing Distance":"21-100 Feet","Sighting Duration":"12:59:59","Country":"United States","divs":["Sighting Detailsiv been seeing orbs stationed in the foothills of ojai i scope out the rock formations for anything out of the ordenary then i see one or two orbs standing out blending in to the other rocks. this is north of ojai to the southern foot hill of ojai on black mountian on the north side there is a opening a tunnall that iv seen ships flying in and out then it like a brush moves over the tunnal then its like its never there. in matellijia canyon there is a whole bunch of ufos on the ground in the mountians in tunnals and hideing under brush witch i can see part of them.as i get closer to them they make sounds or fluttering sounds the kind that make you stop dead in your tracks. when i come upon them i feel that i should not go to close to them i feel that they are frighten of being seen that they want to be alone but why am i able to see them in the first plase why are they letting me see them all i can do is to keep serching for them and keep in touch with mufon thanks mark mellein.i took 3 pictures of the orb that was there then is gone"],"Summary":"a realy big wight glowing orb was stationed in betwine two realy big rocks at top of a ridge four days latter it was gone a week latter its gone","trends":["There have been 20 other sightings in Ojai","There were no other sightings in Ojai on or around August 12th 2011"],"Log Number":"US-08182011-0016","files":["/var/www/straped/mufon/html2text/30987.html.txt","/var/www/straped/mufon/org/30987.html"],"Weather Factors":"Unknown","Latitude":"34.433188","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.433188,+-119.259681(30987)&iwloc=A&hl=en\"> mufon case (30987) map </A>","City":"Ojai","Case Number":"30987","Longitude":"-119.259681","Date Submitted":"08/18/2011 02:15 UTC","Date of the Event":"08/12/2011 12:00 UTC","Source":"MUFON"}