{"Date of the Event":"11/30/1962 12:00 UTC","Summary":"At six years of age I called them stick people. This night, five or six where at the foot of my bed and the first one moved very fast to the side of me in bed and raised a sliver rod that glowed up to my nose or face. I passed out.","Date Submitted":"08/18/2011 08:48 UTC","Country":"United States","Longitude":"-121.813754","Object Shape":"Cigar, Cylinder, Disc","Sighting Duration":"Undisclosed","Log Number":"US-08182011-0010","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path","Tags":"City","Region":"California","Latitude":"39.713749","trends":["There have been 24 other sightings in Chico","There were no other sightings in Chico on or around November 30th 1962"],"divs":["Sighting DetailsAs a child, I kept telling my father that the stick people were hiding in my closet and like all fathers he laughed and said everything is ok...over active mind etc... However, after he put me to bed, a short time later, I saw the stick people at the end of the bed. This time there were a lot of them four or five. They were very short with like a blue gray skin. AT six years old they seemed ugle and I was afraid. As I lay there looking at them...I couldn't seem to yell out to my father to come see them, all I could do was watch...I couldn't move..the one that seemed to be in control moved very fast to the side of my bed next to me and raised a silver rod that glowed bringing it up to my nose or face. What happened after that I don't know because I passed out. Then in 1973-74 I was just about 18 living in Rockford Ill. It was some where after 10 pm I had just gotten into bed, when I hurd a light hum and a very bright light showed through the window of my room. I asked my sister what the bleep is this? She said I don't know. I said should we look? She said no and went slient...again I couldn't move..I wanted to see it but I couldn't move. The hum it made was not like anything I've ever experanced before. The next day a friend of my mothers said she and a friend saw a ufo over our house. In 1975 I moved back to Burbank California. My husband and I were going to the store, as we came to the under pass a large silver shape disc appered in the sky,(we had just gone under the pass when I said to him) Did you see that? He said no. I said hurry as I glued myself to the front window,as we came out from under the pass...the bottom of the ship mirrored us looking up at it, I could see us looking up at it...then it changed to a night sky with stars, it was beautiful...as I was looking at it and as the stars faded I could see like...well it was wird on the inside...anyway as we continued on; it shimmered becomming transparent and seemed to be sucked out of the sky. It was not propelled like our airplanes...it was sucked out of the sky and gone. My question is, why didn't my husband see it...why didn't everyone in Burbank see it..this thing was as big as a foot ball feild. Is it possable for one person to see them and others don't? Do these things or beings have such an ability. I know what I saw and it was real, and nothing we have on earth could do what it did. Years later a government program was showing pictures of UFO and I saw the one that I saw in 1975, I called to my husband, \"see that's what I saw\"..happy that I could prove myself to him and then the gov man said None of these are real...funny how something that is not real, is what I saw that day....How does that happen. How can they have a picture of what I saw and it's not real. How do I feel after seeing something like this? Well, how would you feel if what you saw in day light not one other soul saw. How would you feel if everyone you knew thought you were crazy. How would you feel if these things have followed you for your whole life and how would you feel if you didn't understand what was happening to you. My father told me years later that he also had seen a long shape silver object as a boy in Washington state where he grew up. It made me feel a bit better, but...well what can I say this has been my experance with UFO."],"Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=39.713749,+-121.813754(30981)&iwloc=A&hl=en\"> mufon case (30981) map </A>","City":"Chico","Case Number":"30981","files":["/var/www/straped/mufon/html2text/30981.html.txt","/var/www/straped/mufon/org/30981.html"],"Disposition":"Unknown","Object Features":"Window(s)"}