{"Latitude":"38.444357","Date Submitted":"08/18/2011 02:00 UTC","Object Features":"None","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around June 30th 1995"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.444357,+-122.713431(30986)&iwloc=A&hl=en\"> mufon case (30986) map </A>","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/30986.html.txt","/var/www/straped/mufon/org/30986.html"],"Object Flight Path":"Path with directional change","Longitude":"-122.713431","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Sphere","divs":["Sighting DetailsLocation; Santa Rosa, California Time; Dusk (sun had just gone below the horizon) Date; 1995 Myself and two friends were standing in his driveway, engaged in casual conversation. One of my friends had a new flashlight that used hi intensity white LED's and was showing us how bright it was. At that time, a small passenger airplane similar to a piper cub had just taken off from the sonoma county airport a few miles away and was headed in a south easterly direction at an altitude of approximatly 1000 feet ABS. He then pointed the flashlight at the airplane and jokingly said, \"Hey, look, a UFO.\" At that moment, a large very bright orb seemed to exit the tail of the plane or appear from behind it. It then seemed to float lazily behind the plane, but not actually following it. It then began to gain altitude rapidly and finally disappeared out of sight. From the time it appeared to the time it was no longer visible was about 3 minutes. All the time we remained silent as we watched it. When it was gone, we all looked at each other and each asked the same question and each replied with the same answer. \"Did you see that?\" \"Yes.\" Nothing was said after that by any of us as we all three just walked away, shaking our heads. I, or either of the other two have any idea what this was, and was never spoke of again. By no means was the flashlight in question powerfull enough to place an orb of light in the sky, as it was powered by three triple a batteries. This is the first time I have told anyone about this."],"Region":"California","Case Number":"30986","Summary":"orb of light","Country":"United States","Date of the Event":"06/30/1995 12:00 UTC","Sighting Duration":"Undisclosed","City":"Santa Rosa","Log Number":"US-08182011-0015","Tags":"City"}