{"Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.195409,+-123.191804(31007)&iwloc=A&hl=en\"> mufon case (31007) map </A>","Longitude":"-123.191804","Object Features":"Unknown","Summary":"camera through a telescope and found ufo's then after on hovered across above us with a beam","Date of the Event":"03/12/2010 09:20 UTC","divs":["Sighting Details1. in my 2 little brothers back yard with a camera and a telescope,looking for ufo's. 2. we were looking at the moon, and we turned the telescope to the lef alot and found ufo's. after that we were just about to go back inside, but then a large light went over their house and drained our camera when it shined a huge beam over us when it stopped the left. so we were so excited so we went back inside, my brothers were kinda scared. we put it on the computer and made a video of it, check it out, first go to youtube, then search trifle6films and it will say real U.F.O pictures, sadly, we didnt get the ufo above us. 3. we knew instantly it was a ufo because it looked exactly like a ufo and nothing else, just disk like. and at the last pic on the video it transformed into 4 missile looking things. 4. it was disk like, then transformed into 4 missle looking things, an it turned around istantly when it was going to the right, to the left, withough even turning. 5. i was really excited and wanted to look more but my 2 little brothers were scared, so i went in with them so they wouldnt be freaked out. 6. i lost sight of it when it zoomed across the sky."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","Case Number":"31007","trends":["There have been 4 other sightings in McMinnville","There were no other sightings in McMinnville on or around March 12th 2010"],"Region":"Oregon","Latitude":"45.195409","Tags":"City","Date Submitted":"08/18/2011 09:19 UTC","Sighting Duration":"00:09:10","Source":"MUFON","Disposition":"Insufficient Data","Object Shape":"Bullet, Missile, Disc, Fireball","City":"McMinnville","files":["/var/www/straped/mufon/html2text/31007.html.txt","/var/www/straped/mufon/org/31007.html"],"Log Number":"US-08182011-0035"}