{"Sighting Duration":"00:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=28.393223,+-80.598191(31005)&iwloc=A&hl=en\"> mufon case (31005) map </A>","Weather Factors":"Unknown","Summary":"Took pictures at Kennedy Space Center. After downloading to my computer, I noticed and object in the sky that my camera had captured but I did not notice at the time. This visitation was just prior to the last shuttle launch.","Tags":"City","Date Submitted":"08/18/2011 08:40 UTC","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-08182011-0033","Date of the Event":"07/02/2011 11:30 UTC","Latitude":"28.393223","Longitude":"-80.598191","Case Number":"31005","trends":["There have been 7 other sightings in Cape Canaveral","There was one other sighting in Cape Canaveral on or around July 2nd 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/31005.html.txt","/var/www/straped/mufon/more/31005_submitter_file1__P1010032.JPG","/var/www/straped/mufon/more/31005_submitter_file2__P1010033.1.jpg","/var/www/straped/mufon/more/31005_submitter_file3__P1010033.JPG","/var/www/straped/mufon/org/31005.html"],"City":"Cape Canaveral","Object Shape":"Other","Region":"Florida","Object Flight Path":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsWhile waiting in line to enter the Kennedy Space Center in Cape Canaveral with my family, I decided to take photos of them and the crowd. While taking the pictures, I saw the astronaut atop the entrance and decided that it would make a great shot(Attach. #1). the exact time was 11:30:38:00 AM according to the time on my camera. It was several days before I downloaded the photos to my computer to make a CD for my grandson. I enlarged the photograph and cropped it to just get the astronaut and make a second photo (Attach. #2). It was at this time while scanning across the picture that I saw the glowing dot. When I looked at the original photo, the gold dot was visible to the naked eye. At this time, I decided to enlarge the section with the gold dot and thought it might be an airplane or the space station (Attach. #3). I have never seen an airplane that high glow with such brilliance. The three photographs are attached as I enlarged and cropped them to make more pictures. If you take the original picture and divide it into quarters, the gold dot is in the upper right quadrant, three quarters from the right edge. It is near the cloud. I have no idea if I took something interesting or just plain ordinary but felt very excited. What I would like to know is if there were any flights over the area on that day at that exact time, or if the space station happened to be visible on that day at that time. If so, then I have a great shot of it. My husband is just as curious. We were very excited to get a shot like this."]}