{"map":"<A HREF = \"http://maps.google.com/maps?q=45.483384,+-122.774838(31019)&iwloc=A&hl=en\"> mufon case (31019) map </A>","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/31019.html.txt","/var/www/straped/mufon/org/31019.html"],"Date Submitted":"08/19/2011 03:01 UTC","Latitude":"45.483384","Longitude":"-122.774838","divs":["Sighting DetailsSunday, 4pm, March 1996, Canyon Road, Portland OR. Friend and I are walking a three-acre parcel that is about to be clear cut for housing. We are hugging each tree good-bye. Something makes us stop and turn to the west -- it's a humming and a presence. Time stops cold. We are out of normal reality. Suddenly, out of nowhere, a giant pulsing, humming, beeping, shape-shifting blue orb races towards us. It looks like it traveled right through my house, three stories from the ground, and the orb is bigger than the house. It's headed straight for us. I'm dumbstruck, but I face it square, unafraid. It's like it has a message for us about the trees and what we're doing. In a weird way, the appearance of the orb somehow doesn't surprise me, once the pause in time-space takes place. It zooms right at us, goes right through us and disappears into the trees. We're just sort of stunned. \"What was that?\" \"Did you see that?\" \"I'm so glad I had a witness.\" We never noticed any objects in the sky before or after."],"Summary":"house-size pulsing blue orb appeared from nowhere and went right through me and witness","Log Number":"US-08192011-0008","Source":"MUFON","Object Features":"Other","Date of the Event":"02/29/1996 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Region":"Oregon","Object Shape":"Circle, Fireball","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Country":"United States","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around February 29th 1996"],"Case Number":"31019","City":"Portland","Disposition":"Unresolved"}