{"Longitude":"-86.351905","Viewing Distance":"501 Feet - 1 Mile","Latitude":"41.722475","Object Shape":"Circle, Sphere","Region":"Indiana","Case Number":"31025","Summary":"A dark sphere or circle several hundred feet up moving east.","divs":["Sighting DetailsThis sighting took place on Friday, August 19th, 2011 at about 10:20am. The weather was sunny and cloudless. The moon was visible in the western sky. I was driving west on Cleveland Road in South Bend looking up at the moon when I noticed a strange, dark circular or spherical object at least several hundred feet up in the air, moving east. The object moved parallel with the road at a steady speed with no erratic motion. It was definitely not an airplane, helicopter, or a bird. It was also way too small to be a blimp. The motion was too steady and regular for a balloon. It could possibly have been a satellite of some sort, but the object seemed to change its shape subtly as I observed it, especially toward the end of the sighting, which lasted about 30 seconds. The object reflected sunlight and appeared metallic. I just got off the phone with a guy at the National UFO Reporting Hotline (nuforc.org) and he told me that it could not possibly have been any kind of satellite. As soon as the object passed from view, I did a sharp U-turn and parked in a nearby driveway, got out of my car, and looked east to try to see the object again, but I couldn't spot it. I had just been talking to my 4 year old son about the moon and how mysterious it is. Just a minute before the sighting he had craned his head down below his belt to peek out the windshield in order to see the moon. He did not see the ufo. I was very excited the entire time of the sighting and for about an hour afterward. I knew it had to be something unknown. I'm a student of the UFO literature and have had one previous sighting."],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/31025.html.txt","/var/www/straped/mufon/org/31025.html"],"Log Number":"US-08192011-0013","Weather Factors":"Unknown","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around August 19th 2011"],"Country":"United States","Date of the Event":"08/19/2011 10:20 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.722475,+-86.351905(31025)&iwloc=A&hl=en\"> mufon case (31025) map </A>","Sighting Duration":"00:00:30","City":"South Bend","Object Flight Path":"Straight-line path","Date Submitted":"08/19/2011 04:48 UTC","Tags":"City","Object Features":"None"}