{"files":["/var/www/straped/mufon/html2text/31021.html.txt","/var/www/straped/mufon/org/31021.html"],"trends":["There have been 14 other sightings in Annapolis","There were no other sightings in Annapolis on or around June 12th 2004"],"Date Submitted":"08/19/2011 11:24 UTC","Weather Factors":"Unknown","Latitude":"38.985745","Log Number":"US-08192011-0009","Tags":"City","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=38.985745,+-76.482493(31021)&iwloc=A&hl=en\"> mufon case (31021) map </A>","Country":"United States","Case Number":"31021","Sighting Duration":"Undisclosed","Summary":"a pulsing chrome like sphere, that appeared to be rotating and hovering. i","Disposition":"Unknown","divs":["Sighting DetailsI was a maintenance worker for the state of maryland. we got a call to the maryland archive building, there was a bathroom exaust fan not working. i went to the roof of the building, and was working on the fan. my partner, we will call him tom, had a work radio like i did. I was in a prone position while working on this exaust fan. when i rolled over to reach a tool, and to give my aching neck muscles a break, i happened to look up, and, there in the distance, was a chrome, shiney object. annapolis is in the flight vector for alot of air traffic, so i was used to airplane and the like being in the sky. so when i looked up, and saw this sphere, it caught my interest. it looked to be several miles away, due to the haze. it was plainly rotating at a high rate of speed, and, strangest of all, it would periodically dissapear! i timed it on my watch, and it would be visible, and spinning, then, dissapear for 1minute. then reappear for a minute. i called tom up there, saying i needed some help, and i had him check it out. he said \"I dont believe it. i'm lookin right at it, and i still dont believe it.\" at this point, we both observed airplanes in its vicinity, so we could kinda place where it was. it was directly above the flight vector for all the planes, bute BELOW some of the really high flyers. seeing the planes really helped us out, because it kinda showed us its position and size, as close as we could guess. it looked to be comprable size to a 747, give or take. thats about all i can remember. thanks for listening."],"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Region":"Maryland","Object Shape":"Sphere","Date of the Event":"06/12/2004 03:27 UTC","Source":"MUFON","City":"Annapolis","Longitude":"-76.482493"}