{"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Circle","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=44.439955,+-86.131482(31026)&iwloc=A&hl=en\"> mufon case (31026) map </A>","trends":["There have been no other sightings in Bear Lake","This sighting has never been favorited."],"City":"Bear Lake","Summary":"Fireball","Object Flight Path":"Straight-line path","divs":["Sighting DetailsAttended a Fireworks display at Bear Lake Michigan on July 9th about 9:50pm with video camera canon xha1. It was dusk -still somewhat light. I was facing south-southeasr. I spotted a small but bright yellow-orange light slightly above horizon traveling toward the lake. It seemed flying at a low trajectory and I thought at first that it was a balloon with a light, or a remote controlled airplane with a light. The object was traveling NorthWest -West and I next thought that the object was reflecting light from the sun which had already set. I grabbed my camera but I could not locate it in the viewfinder and failed to record it. Within a minute, another object appeared in about the same area and seemed to be flying the same path. I did capture it on video tape and it appeared at first as a round yellow-red fireball moving slowly. As I continued to track it, I noticed a black spot behind the light. As it continued, the light seemed diminish but the black object seemed to emerge I believe it was rising and became more illuminated from the sun. Finally there was no yellow-red light but a circular round object. My video camera has autofocus - but the object kept going in and out of focus. Finally it dissappeared from view. Within a minute there was still another yellow-red object originating from about the same area and traveling in the same path. The same thing happened - the object appeared as a yellow-red color firball, then a black object behind the fireball became larger, the yellow-red color rotated and the circular object was apparent. The object eventually disappeared. It was now dark and I anticipated the fireworks were about to happen when still another firball appeared in the same spot. It seemed to travel upward and never crossed the lake but rather continued moving up and disappeared as a small pinpoint of light. There were hundreds of people on the lake that night all watching for the fireworks. My neighboprs saw the fireball but only saw the yellow orange light which faded -they never observed the circular object. I captured this on videotape and I am hoping that with better equipment the image can be enhanced and more details can be seen. The digital video clip is too large to email."],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/31026.html.txt","/var/www/straped/mufon/more/31026_submitter_file1__Image1.jpg","/var/www/straped/mufon/more/31026_submitter_file2__Image4.jpg","/var/www/straped/mufon/more/31026_submitter_file3__Image8.jpg","/var/www/straped/mufon/org/31026.html"],"Case Number":"31026","Date of the Event":"07/09/2011 09:50 UTC","Log Number":"US-08192011-0014","Tags":"City","Country":"United States","Date Submitted":"08/19/2011 05:56 UTC","Sighting Duration":"Undisclosed","Longitude":"-86.131482","Latitude":"44.439955","Object Features":"Unknown","Source":"MUFON"}