{"Viewing Distance":"101-500 Feet","Latitude":"30.495101","Date Submitted":"08/19/2011 07:10 UTC","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around August 12th 2011"],"Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","City":"Tallahassee","divs":["Sighting DetailsI was returning from the movies heading north on hwy 319 between Killearn and Bradfordville Rd. in north Tallahassee. I was sober and I had my top down and was cruising about 45 miles per hour. I am 60 years old and retired from the US Postal Service. I have worked on air force bases and am familiar with all types of flying vehicles. It was dark and partly cloudy. I looked up a noticed in front of me to my right a huge triangle in the sky just above the trees. There are a lot of trees along this stretch of road with a few clearings here and there. At first I thought it was a triangular cell tower because they have three white lights and a red light above them in the middle. As I drove a little futher it was in a clearing and I could clearly see it wans't a tower. The lights on the ends appeared to be triangular to form the ends and lighted from the inside. What I don't understand is the huge slowly pulsating red domed light in the bottom middle of the craft. It was slowly heading in a southerly direction away from me. After I saw it I tried to turn into a street to take a picture if I could but some jerk was right behind me and I couldn't turn in. As I went to the next block I knew it was of no avail for me to try to turn because too much distance between the object and me. A couple of days later I inspected my route in the daytime and again at night. I never saw any tower except a radio tower a few miles north. This object was to my immediate right and heading behind me. No sound, no props, no jets, and no descending, just slow and steady movement. I was bewildered because I have never seen such a thing. I have heard of these sightings and always dismissed them as experimental aircraft. Now that I have seen this and how it moved I know I was wrong in that judgement. This craft was impressive in size and spooky to me!"],"Region":"Florida","files":["/var/www/straped/mufon/html2text/31027.html.txt","/var/www/straped/mufon/org/31027.html"],"Date of the Event":"08/12/2011 12:00 UTC","Object Features":"None, Other","Longitude":"-84.245443","Case Number":"31027","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.495101,+-84.245443(31027)&iwloc=A&hl=en\"> mufon case (31027) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-08192011-0015","Summary":"triangle with bright red underdome in middle, each point lighted","Tags":"City","Object Shape":"Triangle"}