{"Object Flight Path":"Straight-line path,Other","Summary":"In our back yard and saw the object slowly fly over our house and disappear","files":["/var/www/straped/mufon/html2text/31020.html.txt","/var/www/straped/mufon/org/31020.html"],"trends":["There have been 43 other sightings in Winnipeg","There were no other sightings in Winnipeg on or around August 17th 2011"],"Latitude":"49.958008","Sighting Duration":"00:05:00","Object Shape":"Diamond, Sphere","Object Features":"Unknown","divs":["Sighting DetailsMy common-law wife went outside for a cigarette in our backyard around 11 pm Wednesday night August 17,2011. Within 2 mins of her being outside she called for me very excitedly to come outside quickly. I went outside, looked up and saw an extremely bright object slowly traveling Eastward over our house. She thought it was simply a satellite until it brightened like the full moon and called me out. The way the light shined was periodically in a diamond shape or cross shape. It was completely silent. I ran inside the house to get my binoculars. I came out and pointed my binoculars and could see the object was a sphere. Oddly, it did not have wings or have any flashing lights. The light appeared to emit from within the object. I decided to run back in for my android phone to record it (all the while my wife was outside the entire time observing). I came back out and saw the object start wobbling or zigzaging but remaining in it's original path (the object was moving in a relatively constant, slow speed). I held up my phone to start recording but the object began to dim. I pointed my binoculars to view the object and could see the light dimming within. Seconds before it disappeared it turned a reddish colour. I could see the outline much better but the object seemed to get smaller. I could still see the object but then it disappeared as I had it viewed in my binoculars. We went through all possibilities of what it could of been and it was not an asteroid, shooting star, plane, helicopter, balloon, latern, lightning, space debris, etc(I have an extensive aviation and astronomy background). The feeling we felt was anxiety and excitedness. We did not want it to go for some reason as we watched it. We had an awstruck emotion toward it. It felt as if the object was purposeful in it's movements and was deliberate in it's actions. We could not stop thinking about it for a long while after."],"Date of the Event":"08/17/2011 11:00 UTC","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","City":"Winnipeg","Case Number":"31020","map":"<A HREF = \"http://maps.google.com/maps?q=49.958008,+-97.19116(31020)&iwloc=A&hl=en\"> mufon case (31020) map </A>","Longitude":"-97.19116","Source":"MUFON","Log Number":"CA-08192011-0008","Tags":"City","Weather Factors":"Unknown","Country":"Canada","Date Submitted":"08/19/2011 11:22 UTC","Region":"Manitoba"}