{"City":"Manhattan?","Tags":"City","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Manhattan?","This sighting has never been favorited."],"Case Number":"31023","Object Flight Path":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.699472,+-74.03956(31023)&iwloc=A&hl=en\"> mufon case (31023) map </A>","Longitude":"-74.03956","Country":"United States","Date of the Event":"06/02/2011 08:00 UTC","Region":"New York","Log Number":"US-08192011-0011","Latitude":"40.699472","Summary":"Strange object in picture not noticed when taken","Date Submitted":"08/19/2011 01:29 UTC","Object Features":"None, Unknown","Weather Factors":"Unknown","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/31023.html.txt","/var/www/straped/mufon/more/31023_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/31023.html"],"divs":["Sighting DetailsI was at a work function on the night this picture was taken with my iPhone. We were on a boat cruise that included dinner, drinks and a close circle of the statue of liberty. The trip began I believe around 7pm and continued until 10 or so. After dinner everyone congregated to the open deck on the top of the boat to admire the sights of the NYC skyline. As the sun was setting many pictures were being taken and I snapped the attached photo. At the time no one witnessed anything out of the ordinary, but when I e-mailed the pic to friends we noticed an object on the right hand side between the 2 tallest buildings and above the glow of the sunset. We have tried to identify it, but anything we come up with seems to have just as easy of an excuse for why it could not be that explanation. Airplane? When zoomed in it does not have any characteristics of an airplane Comet? I know of none in the area, no one saw it at the time and it seems to be ascending, not descending Not making any claims, but would be interested if anyone has any ideas of what the object could have been. It is hard to judge distance as it seems to be closer to the camera than the sun, but somehow it is not backlit but instead seems to either reflect light or emit it. Also the fact that it has a \"tail\" seems to contradict any ideas that it could be a plane or anything reflecting the sun. Just seems to be an object that no one has been able to identify for me yet."],"Disposition":"IFO"}