{"Case Number":"31037","Country":"United States","files":["/var/www/straped/mufon/html2text/31037.html.txt","/var/www/straped/mufon/more/31037_submitter_file1__2011-08-19_21-46-43_66.jpg","/var/www/straped/mufon/org/31037.html"],"Object Features":"Unknown","Weather Factors":"Unknown","Log Number":"US-08202011-0009","Object Flight Path":"Path with directional change","Object Shape":"Boomerang","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.100126,+-94.408087(31037)&iwloc=A&hl=en\"> mufon case (31037) map </A>","Tags":"City","Longitude":"-94.408087","divs":["Sighting DetailsI was getting gas at 9:45pm and as I was finishing up I heard a loud humming buzz sound, I wasn't sure what it was at first, I looked up as I got into car and seen a very large shaped object with 4 whitish yellow lights flying east. I was shocked to see it. The object would have been at least a half mile long. I got my phone out as I pulled up to the stop light and had taken a picture before it was too far to take. My picture came out a bit unfocused but I got it. I tried to follow it as it made a turn to the south and you could tell it was an extremely large object making it's turn, I couldn't keep up and it disappeared from sight as I couldn't keep up in a vehicle and had to obey traffic laws, but even then it was impossible to track. I knew I had just witnessed a UFO and went home and told my girlfriend and called my friend and told them what I had just seen. Well I was laughed at me until the next morning my girlfriend found a news report about the exact sighting by other witnesses, she want laughing then!"],"Viewing Distance":"101-500 Feet","Disposition":"Unknown","Summary":"Flying east then turned south. Emitted a humming buzz sound that was loud.","Date Submitted":"08/20/2011 11:36 UTC","Region":"Missouri","Latitude":"39.100126","Source":"MUFON","trends":["There have been 67 other sightings in Independence","There were 6 other sightings in Independence on or around August 19th 2011","This sighting has never been favorited.",""],"Date of the Event":"08/19/2011 09:45 UTC","City":"Independence"}