{"Viewing Distance":"Unknown","divs":["Sighting DetailsI was out walking at about 920-930pm. and was looking up at the sky trying toidentify the planets when I saw a sphere-shaped white light traveling in astraight line across the sky from the SE heading toward the NW. It seemed to bevery high as it was above the light cloud coverhowever, it was bright enough to see through the light cloud cover. Thebrilliance of the light was equal to that of a bright star but it was unlike astar in that it was steady and unblinkinguntwinkling more like a planet. Itseemed too bright to be a satellite and I was wondering if the InternationalSpace Station was that bright. I dont know if the ISS was over this area at thetime though. It took about a minute to cross the sky. I looked for strobinglights or redwhite flashing lights that are usually noticed on a plane but I didnot see any. I lost sight of the object when it flew over denser cloud cover andI finished my walk. I did not hear any jet airplaneengine sounds while viewingthis object.Psych duringafter event I checked other, this only means I was terribly curiousbut Im always curious. So this is not unusual for me. I was also calm but again,this is not unusual for me.Cloud cover the clouds were high by my estimation but you woud have to contactthe local airport to get the altitude."],"Case Number":"3103","trends":["There have been 4 other sightings in Bartlesville","There were no other sightings in Bartlesville on or around July 4th 2004"],"Longitude":"-95.977118","Tags":"City","Object Shape":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"07/04/2004 09:30 UTC","Object Flight Path":"Straight-line path","Summary":"White light traveling NW no blinking or strobing","Date Submitted":"07/04/2004 09:30 UTC","Log Number":"","Object Features":"Undisclosed","City":"Bartlesville","Latitude":"36.750741","Region":"Oklahoma","files":["/var/www/straped/mufon/html2text/3103.html.txt","/var/www/straped/mufon/org/3103.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.750741,+-95.977118(3103)&iwloc=A&hl=en\"> mufon case (3103) map </A>","Country":"United States","Disposition":"Unknown","Sighting Duration":"00:05:00"}