{"Case Number":"31036","Disposition":"Unresolved","divs":["sighting detailsthis isn't about an object, this is about when i was a youngster and this happened over a period of several years. i don't know who to talk to, this has been a secret of mine for 40 years. not looking for publicity, just want to know what happened to me? it happened at night when i was in bed. the house would be dark and there would be any where from a couple of lights appearing to maybe around 6 lights depending on how many would show up. at times i would see a light outside my 3rd floor window and knew they were coming. i would scream and tried to talk to them but no sound came out. they would look at me and somehow i got the impression they knew what was i was trying to say\\yell. everyday i woke up, i felt disoriented and lost. i have some memories i'm not sure about. i felt like it was friendly like they were checking on me in whatever they were looking for. no one has heard me speak about this, no family. i'm looking for someone that i can talk to, not a shrink but someone that might show some insight. please someone show me some help. i haven't sketched anything, but i can."],"Region":"Florida","files":["/var/www/straped/mufon/html2text/31036.html.txt","/var/www/straped/mufon/org/31036.html"],"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"11/30/1970 12:00 UTC","Viewing Distance":"20 Feet or Less","Country":"United States","Latitude":"30.276168","map":"<A HREF = \"http://maps.google.com/maps?q=30.276168,+-82.163048(31036)&iwloc=A&hl=en\"> mufon case (31036) map </A>","trends":["There have been no other sightings in Glen St Mary","This sighting has been favorited 1 time."],"City":"Glen St Mary","Date Submitted":"08/20/2011 10:39 UTC","Longitude":"-82.163048","Tags":"City","Object Shape":"Unknown","Weather Factors":"Unknown","Log Number":"US-08202011-0008","Summary":"This is about being visited, your the only place i feel comfortable about contacting","Sighting Duration":"Undisclosed","Source":"MUFON"}