{"Sighting Duration":"Undisclosed","City":"Barstow","files":["/var/www/straped/mufon/html2text/31047.html.txt","/var/www/straped/mufon/more/31047_submitter_file1__UFphoto.JPG","/var/www/straped/mufon/org/31047.html"],"Region":"California","Country":"United States","Object Shape":"Triangle, Other","Tags":"City","Object Features":"None","Date of the Event":"08/16/2011 08:20 UTC","Source":"MUFON","Weather Factors":"None","Case Number":"31047","Disposition":"IFO","Summary":"Cluster than a sequence of patterns","trends":["There have been 11 other sightings in Barstow","There were no other sightings in Barstow on or around August 16th 2011","This sighting has never been favorited.",""],"Latitude":"34.901596","divs":["Sighting DetailsApprox. 8:20 pm, i was traveling north bound on the i15 cruise control at 70mph, between Barstow and Halloran Springs right before Baker. And to my left is saw a cluster of lights which i assumed was a low flying helicopter and didn't pay much attention, when i looked back to see what kind of helicopter, a split second the lights had diapered. The sky was still light a dusky pink orange, so there was no way i could not see the helicopter if it just turned off its lights. Before i could think where did it go? A triangle pattern of three lights appeared for about 3 seconds and flashed of at the same time, and then before i could absorb what just happened one bright light appeared and separated into 2 lights coming apart in a straight line. This pattern of 3 and 2 lights repeated and seemed to follow my drive for about 8mins the last pattern i saw was a straight line of lights that turned off one by one. NOT FLARES!! No SMOKE and No SOUND!! I wish I could have videoed the event but there was no great vantage point, and even thought i could see them clear as day, there was not enough light for my camera phone. Hopefully my drawing helps."],"Object Flight Path":"Hovering then path,Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08202011-0017","Longitude":"-117.013763","Date Submitted":"08/20/2011 07:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.901596,+-117.013763(31047)&iwloc=A&hl=en\"> mufon case (31047) map </A>"}