{"Latitude":"37.842885","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/20/2011 09:38 UTC","Country":"Italy","Date of the Event":"08/19/2011 10:55 UTC","divs":["Sighting DetailsVenerdi sera eravamo davanti un bancomat a fare prelievo, nella via principale di santa maria degli angeli (Assisi). Mentre aspettavamo in macchina un mio amico ha gridato di guardare dal finestrino, su in alto. Io mi sono affacciato e non ci credevo... (fino a ieri ero uno scettico di ufo). C'erano 3 luci rosse che volavano troppo vicine fra di loro per essere aerei, la luce pulsava lentamente, da rosso accesso a nessuna luce nel giro di qualche secondo. I \"velivoli\" continuavano il loro cammino nel cielo lentamente, ad un certo punto uno di questi scompare, gli altri due salgono in alto verso il cielo, verticalmente e prima uno, poi l'altro spariscono entrambi... siamo rimasti sbalorditi Friday night we were in front of an ATM to make withdrawal, the main street of Santa Maria degli Angeli (Assisi). While we waited in the car my friend shouted to look out the window on top. I looked out and could not believe it ... (until yesterday I was a skeptic of UFOs). There were 3 red lights that flew too close together for air, the light slowly pulsated from red no access to light in a few seconds. The \"aircraft\" continued their journey in the sky slowly, at some point one of them disappears, the other two climb up towards the sky, a first vertically and then the other two disappear ... we were amazed"],"Source":"MUFON","Region":"Sicily","Log Number":"IT-08202011-0020","map":"<A HREF = \"http://maps.google.com/maps?q=37.842885,+13.762294(31050)&iwloc=A&hl=en\"> mufon case (31050) map </A>","Case Number":"31050","Sighting Duration":"00:06:00","City":"Montemaggiore Belsito","Object Flight Path":"Path with directional change","Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","Object Features":"Unknown","trends":["There have been no other sightings in Montemaggiore Belsito","This sighting has never been favorited."],"Longitude":"13.762294","files":["/var/www/straped/mufon/html2text/31050.html.txt","/var/www/straped/mufon/org/31050.html"],"Object Shape":"Unknown","Summary":"3 luci che viaggiano troppo vicine per essere aerei. Le luci pulsavano lentamente, si accendevano di rosso e si spegnevano. All'improssivo volano verso l'altro e spariscono"}