{"Object Shape":"Star-like, Other","Date of the Event":"08/19/2011 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.533103,+-122.947737(31051)&iwloc=A&hl=en\"> mufon case (31051) map </A>","divs":["Sighting DetailsMy sister and I were at the airport waiting for a fireworks display to begin after an airshow. There was a considerable delay (30-40 minutes) between the end of the airshow and the begining of the fireworks. We were looking at stars and someone noticed what appeared to be a satellite traveling from roughly south west to north east. My sister had never seen a satellite go over before and commented about how fast it appeared to be moving. I am a pilot, I have seen many of them and was explaining how objects need to travel in order to remain in low earth orbit. The object suddenly started to change its direction of travel in what appeared to be very controlled but impossible maneuvers. I couldn't believe what I was seeing and at almost the same moment my sister said \"do you see that?!\" I was saying \"My God I can't believe it!\" For the next minute or two we watched this thing stop its forward motion, move in several complete circles, move forward again making \"S\" turns and finally return to its original direction of travel and eventually out of sight. I'm a pilot, I have been a follower of space flight since it began and a back yard astronomer. I can tell the difference between a satellite, an airplane and a meteor. What we clearly saw did not fit any of them."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31051.html.txt","/var/www/straped/mufon/org/31051.html"],"Disposition":"Unresolved","Case Number":"31051","Source":"MUFON","Date Submitted":"08/20/2011 10:11 UTC","Tags":"City","Log Number":"US-08202011-0021","Object Features":"Undisclosed","Latitude":"45.533103","Longitude":"-122.947737","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","City":"Hillsboro","Viewing Distance":"Over 1 Mile, Unknown","Region":"Oregon","Summary":"We observed a lighted object very high in the clear nite sky that went from straight line of travel to very eratic changes in direstion, brief color change, back to original direction and eventually out of sight.","trends":["There have been 8 other sightings in Hillsboro","There were no other sightings in Hillsboro on or around August 19th 2011"],"Country":"United States"}