{"Object Shape":"Sphere","Latitude":"32.94288","files":["/var/www/straped/mufon/html2text/31065.html.txt","/var/www/straped/mufon/org/31065.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.94288,+-96.774926(31065)&iwloc=A&hl=en\"> mufon case (31065) map </A>","Summary":"Silent Red light moving swiftly in a straight line north north west over North Dallas","Object Flight Path":"Straight-line path","Case Number":"31065","Weather Factors":"Unknown","Log Number":"US-08212011-0010","Object Features":"Unknown","Date of the Event":"08/20/2011 11:27 UTC","Viewing Distance":"Unknown","trends":["There have been 116 other sightings in Dallas","There was one other sighting in Dallas on or around August 20th 2011"],"divs":["sighting detailswe were in north dallas and about 11:26 on 8\\20\\11 (saturday night) saw a ufo heading north northwest, and it seemed to be just under the cloud deck (unless it was much smaller then it might have been lower), we had it in our range of vision for about a minute and our field of vision was about forty or fifty yards. (from the roof line of the house on one side of the street to the treeline on the opposite side.) it was not a plane, silent as far as we can tell. passing near over head with a single slightly flickering light (i thought it was more flickery, lit from within, and fire colored.) and there were no running lights. it moved in a steady straight line. at first i thought it was a plane on fire or a balloon because it looked like the center of the light was on fire... but it was dead calm.. my husband is a amateur astronomer and aviation buff. i have logged almost 75 flight hours in small aircraft so we are familiar with the sound levels a small aircraft produce. he was sure there was no visible silhouette of anything like a blimp. (he also said it was going too fast for a blimp.) he said when he first saw it, it was more shaped like a hour glass. to him it looked like the light was filling something with the brightest point being near the top of the hourglass. i just saw a blob.(but i have vision issues. we were near preston rd and beltline rd in north dallas. my husband noticed it as he was buckling our child into the car and looked up as it came over the roof-line of his mother's house. we lost sight of it when it passed the treeline to the north. my husband was confused (like i've never heard him be). i was pretty sure while watching it that it was a hot air balloon until he pointed out there was no wind, and there wasnt. i was calm but excited, and remembered to tell him to get his phone and video it. my best guess would be a chinese prayer lamp, but it was dead calm and too damn hot, and the clouds were stationary as well. colors. (mrs thomas) gold\\copper surrounded by white and red, mostly red. (mr thomas) red."],"Country":"United States","City":"Dallas","Date Submitted":"08/21/2011 05:09 UTC","Region":"Texas","Source":"MUFON","Disposition":"Insufficient Data","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-96.774926"}