{"Log Number":"US-08212011-0012","divs":["Sighting DetailsMy family was celebrating my granddaughters birthday on August 20, 2011, when her father, called us outside to witness a sphere shaped object in the sky, flying south to north over Shirley, New York. My daughter also saw this object that changed dircetions and went east over the calabro airport then disappeared. It was gone by the time the rest of us got out there. At first we thought it might have been an airplane that was on fire, but it just disappeared. It didn't crash. We guessed it might have been a hot air balloon, or a chinese latern, but my children kept saying no. About 5 minutes later, we were again called outside and 10 of us observed a sphere shaped object, looking to us about the size of a tennis ball flying south to north. It is impossible to say how big this sphere really was, but an airplane had flown over head, after the first sighting and that appeared to be the size of a toy airplane, this object was closer then that plane was. It appeared to be on fire, changing shape from round to oval, it looked to be almost spinning. No other shapes were noted around it. No strings or balloons were attached. It continued to fly south to north for about 2 minutes then changed directions to east heading over the airport then 20 seconds later it just disappeared. We were all very excited and confused as to what it could have been. We tried to record it on two cell phones the first only recorded blank sky and the other kept shutting off and would not work at all until after the object disappeared, then it worked fine. There were plenty of stars in the sky that night and this object was larger and brighter then all of them. It really appeared to be on fire."],"Disposition":"Insufficient Data","Latitude":"40.799906","Object Shape":"Fireball, Flash, Sphere","Source":"MUFON","trends":["There have been 3 other sightings in Shirley","There were no other sightings in Shirley on or around August 20th 2011"],"Longitude":"-72.882501","map":"<A HREF = \"http://maps.google.com/maps?q=40.799906,+-72.882501(31068)&iwloc=A&hl=en\"> mufon case (31068) map </A>","Weather Factors":"Unknown","Tags":"City","City":"Shirley","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"08/20/2011 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/31068.html.txt","/var/www/straped/mufon/org/31068.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Summary":"at about 8:30 on 8-20-2011, my son observed a shere in the sky flying south to north over shirley new york. He called 10 of my family members outside to see it. It disappeares then another shere came about 5 minutes later and did the same pattern.","Date Submitted":"08/21/2011 12:37 UTC","Case Number":"31068","Region":"New York"}