{"files":["/var/www/straped/mufon/html2text/31067.html.txt","/var/www/straped/mufon/org/31067.html"],"Viewing Distance":"20 Feet or Less, 21-100 Feet","Summary":"Less than 100 ft away, huge craft hovering next to the Veterans Express Way in Tampa! Tons of cars witnessed this!","Disposition":"Insufficient Data","Sighting Duration":"00:02:00","Log Number":"US-08212011-0011","Case Number":"31067","Country":"United States","Weather Factors":"Rain, Light","Source":"MUFON","Date Submitted":"08/21/2011 11:29 UTC","City":"Tampa","Region":"Florida","divs":["sighting detailsmy boyfriend and i were heading north on the veterans express way. the international airport was close by. we passed exit 4 or so before the toll both. we saw a light up in the skye that was heading along the interstate in our direction. it was bright white light that looked pretty low to be flying where it was. (the airport was a few miles back). as we got closer, it descended lower along the highway. we were both very curious as to what it was. once we got closer, to my disbelief it was literally right next the highway. we were going about 60mph and it didn't move! it was just hovering to the right. there was no sound and it was suspended in the air. the only way i could describe it, was shaped similar to a normal airplane but had a long almost crane like appendage coming off the right side of it with a flashing blue light at the tip. the main lights were yellow and white. it had a bright light on the front. it was metal, silver-ish\\gray\\black (it was dark outside). it was the wildest thing we have ever seen. even though it was \"disk\" shaped, and it looked man-made... i've never scene such a large object hover like that, with no noise. almost like it was frozen in time!! i'd like to know if anyone else saw this or reported this. there were plenty of cars on the highway. we headed back on the other side of the highway a half hour later and it was gone."],"Object Shape":"Blimp, Cigar, Disc, Sphere, Triangle, Other","Latitude":"27.956395","map":"<A HREF = \"http://maps.google.com/maps?q=27.956395,+-82.450138(31067)&iwloc=A&hl=en\"> mufon case (31067) map </A>","Longitude":"-82.450138","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around August 20th 2011"],"Object Features":"Window(s), Appendage(s), Wings","Tags":"City","Date of the Event":"08/20/2011 08:40 UTC","Object Flight Path":"Path then hovering"}