{"Latitude":"46.789752","Longitude":"-92.091465","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Object Features":"None","divs":["Sighting DetailsI live in Duluth and have a view of the Duluth Harbor where I can watch the shipping vessels come into and out of. I know the difference in the boat sizes and we often have 1000 foot ships. I am on the hillside about 300 ft above Lake Superior and two hundred feet under the famous Skyline road in which the tourists love to drive and take in the sights of the lake. I live in an old school and have giant windows in my old class room turned into living space. We had one window open and were smoking cigarettes with our feet out the window looking over the harbor. It was me and my lady friend. A little under eye level a giant dark rectangle appeared from the left side of the harbor view and at about thirty to forty miles per hour we watched it go in a straight line from the left of our view all the way till it went out of sight on the right side of our view. The object was well over one thousand feet from side to side and at least one hundred feet top to bottom. We saw it from just about eye level from a distance of about four hundred feet. It was a solid rectangle. The color was silver or metallic and there were no lights. It was flying at a height of two to three hundred feet in the air which is about half way up the Duluth Hillside. The next two days I searched You tube for Rectangular UFOs and came across one that was very similar filmed the day before. It was filmed in daylight from a car window while driving. The passenger was filming from his window and the rectangle object was going with traffic to the side about 500 feet or so high. It remained a rectangle until it changed its path and came in front of the car and went to the drivers side of the car. Now they were filming from the front window looking up to the left. At this point from under the UFO it was no longer rectangular, it was a tear drop shape from the bottom view. I believe this to be what I seen in Duluth. A rectangular shape from the sides and a tear drop shape from the underneath and above."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.789752,+-92.091465(31069)&iwloc=A&hl=en\"> mufon case (31069) map </A>","Summary":"1000FT+ Tear drop Ufo","Date of the Event":"04/14/2011 12:00 UTC","Log Number":"US-08212011-0013","Object Shape":"Square, Rectagular, Teardrop, Other","Weather Factors":"Unknown","Source":"MUFON","Case Number":"31069","City":"Duluth","files":["/var/www/straped/mufon/html2text/31069.html.txt","/var/www/straped/mufon/org/31069.html"],"Tags":"City","Region":"Minnesota","Date Submitted":"08/21/2011 02:10 UTC","Disposition":"Unknown","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 16 other sightings in Duluth","There were no other sightings in Duluth on or around April 14th 2011"]}