{"Country":"United States","Region":"Maryland","files":["/var/www/straped/mufon/html2text/3106.html.txt","/var/www/straped/mufon/org/3106.html"],"City":"Aberdeen Proving Ground","Log Number":"","Date Submitted":"02/29/1976 03:00 UTC","Sighting Duration":"00:05:00","Object Shape":"Disc","Latitude":"39.472467","Case Number":"3106","trends":["There have been no other sightings in Aberdeen Proving Ground","This sighting has never been favorited."],"Longitude":"-76.129966","divs":["Sighting DetailsWe were driving back to Baltimore from the Aberdeen Provng Grounds Credit Unionwhere we had gone to apply for another car loan. I was driving and the objectwas ahead of me in the direction I was facing, but slightly to my left... highin the air, but close enough to distinguish. I noticed it first. It washanging in the air hovering... initially I thought it was a weather balloonbecause we were still in the Army Proving Ground area. When I saw it dart fromleft to right in a manner a conventional plane or other aircraft we know couldnot, we pulled the car over to the shoulder and watched. It was a dull gray...maybe like brushed aluminum... windows were not evident, though it seemed quitea distance away so it would be difficult to honestly say. Not a cloud in thesky, a bright, early spring day. The object maneuvered back and forth inseberal directions, then sped forward and upward, disappearing in just seconds. We were flabbergasted... disbelieving what we knew we saw. We did a realitycheck with one another... Do you see what Im seeing... YES And I cant believe it Since that time, I have only spoken about this with people I was assured werereceptive to such a story for fear of being labeled crazy. I am now a believer. I know this information is quite old and lacking specifics such as day in themonth... But I thought you may be able to correlate it with another sitingduring that time and area Hope this can be helpful."],"Summary":"Aberdeen Proving Ground UFO","Tags":"City","Object Flight Path":"Stationary,Other","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.472467,+-76.129966(3106)&iwloc=A&hl=en\"> mufon case (3106) map </A>","Disposition":"IFO","Date of the Event":"02/29/1976 03:00 UTC","Source":"MUFON","Object Features":"Undisclosed"}