{"trends":["There have been 3 other sightings in Discovery Bay","There were no other sightings in Discovery Bay on or around August 21st 2011","This sighting has been favorited 1 time.",""],"Region":"California","Source":"MUFON","Object Features":"Unknown","Summary":"Two sets of 3 triangle lights of a halogen blue-whte color that trailed each other turning in an arcing motion then seperated, one dissapeared then the other disappeared . they were at about the height at which a large airplane flies.","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.908536,+-121.600229(31078)&iwloc=A&hl=en\"> mufon case (31078) map </A>","Log Number":"US-08222011-0001","Sighting Duration":"Undisclosed","City":"Discovery Bay","Latitude":"37.908536","divs":["sighting detailsi was returning from fishing in the discovery bay, ca area and received a call from my cousing at 8:34 pm. i was driving my truck when my cousing who was also driving called on the cell phone and told me to look at the sky to the north. i looked at the sky and was stunned because of the unusual shapes, brightness and speed of the lights in the sky. i pulled the truck over and stopped to get a better look. i took out my phone too get pictures. i took several pictures but the resolution was poor and i was not satisfied with the shots. we observed two sets of three triangle shaped lights that were in the shape of a triangle for 2 1\\2 minutes before one group of three seperated and disappeared , then the other group of three followed and dissappeared. i have never witnessed anything like this before and decided to call 911. i gave them my report. i called my famliy to tell them what i saw because i was so impacted and excited about what i witnessed."],"Date of the Event":"08/21/2011 08:34 UTC","Viewing Distance":"Unknown","Longitude":"-121.600229","files":["/var/www/straped/mufon/html2text/31078.html.txt","/var/www/straped/mufon/org/31078.html"],"Country":"United States","Disposition":"Unknown","Case Number":"31078","Tags":"City","Date Submitted":"08/22/2011 01:12 UTC","Object Shape":"Triangle","Object Flight Path":"Path with directional change"}