{"trends":["There have been 16 other sightings in Duluth","There were no other sightings in Duluth on or around February 6th 2011"],"Longitude":"-92.093745","Object Features":"None","Summary":"Reddish Opb Blinking then Milatary Planes show up.","City":"Duluth","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Disposition":"Unknown","Region":"Minnesota","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date of the Event":"02/06/2011 12:00 UTC","Latitude":"46.792272","divs":["Sighting Details I was parked on a observation lookout spot on Skyline road in Duluth, Mn to check out the view at night. It overlooks lake superior and Duluth. There was one car in front of me doing the same thing. Under five minutes of being there I noticed a solid reddish colored light in front and above eye level. It was gone after 20 seconds of viewing it. I thought it was a plane. The clouds were puffy so I thought it disappeared behind one. About five minutes later, the light was in the same spot. Now I thought for sure this was a plane on it's way to land. It disappeared again. I started thinking it could be a Ufo and the people in front of me were watching too. Well, they left right about then and I remained looking in the same spot. Within another five minutes it appeared in the same spot and disappeared. I knew that something was up but I still was thinking airplane landing. At about twenty minutes in, it flashed for the fourth time. Just after the light vanished I seen a small blue light at eye level come from the left side of my vision. Behind the blue light, two more blue lights followed on the same path. At this point I thought I was seeing a mother ship so I got out of my car and was calling my friend on the phone. I soon realized they were military fighter jets heading towards where the light was flashing when one of the jets rose above the level of the other two. They went directly towards where the object was and then turned the opposite way, back towards me and then followed the same route back towards the Military base. The light never came back. The next day my friend told me that his friends heard the Jets fly over Duluth at a strange hour in the night. This was my first UFO experience."],"Log Number":"US-08212011-0015","Object Flight Path":"Stationary","Date Submitted":"08/21/2011 02:39 UTC","Case Number":"31071","files":["/var/www/straped/mufon/html2text/31071.html.txt","/var/www/straped/mufon/org/31071.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.792272,+-92.093745(31071)&iwloc=A&hl=en\"> mufon case (31071) map </A>","Source":"MUFON"}