{"Summary":"Large chevron cluster of bright lights moving over Independence","Object Flight Path":"Straight-line path","Region":"Missouri","files":["/var/www/straped/mufon/html2text/31072.html.txt","/var/www/straped/mufon/org/31072.html"],"Sighting Duration":"Undisclosed","Longitude":"-94.433839","Weather Factors":"Unknown","Country":"United States","Object Features":"Unknown","Viewing Distance":"Unknown","Object Shape":"Chevron","Case Number":"31072","Disposition":"Unknown","Tags":"City","Latitude":"39.066963","divs":["sighting details8\\18\\2011 as reported to asd by phone on 8\\21\\2011: the witness and her husband and two children arrived home at 10:00 pm and noticed a strange humming sound. they got out of the car to investigate the source and saw a group of bright white\\orange lights in a v or chevron shape coming into view over their neighbor's tree headed in a north to south direction. they stated that they could only see bright lights, and no structure or craft. the lights were mostly a very bright white with a slight orange glow to them. there were at least four lights on each side of the \"v\" shape and the lights were directed down, with none facing forward. there were no flashing lights, and no red, green, or other color lights visible. the lights moved along in a straight-line path slowly until they went out of sight behind trees. the humming noise got lower and lower until they could no longer hear it. the total time the object was in view was approximately 2 minutes. they couple thought that the lights were flying very low in the sky. the sound was not like that of a plane engine or anything else they have heard before. they also stated that the object moved more slowly than a plane would."],"Date Submitted":"08/21/2011 02:40 UTC","Log Number":"US-08212011-0016","Date of the Event":"08/18/2011 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.066963,+-94.433839(31072)&iwloc=A&hl=en\"> mufon case (31072) map </A>","trends":["There have been 67 other sightings in Independence","There were 3 other sightings in Independence on or around August 18th 2011"],"City":"Independence","Source":"MUFON"}