{"Country":"United States","Tags":"City","Log Number":"","Sighting Duration":"00:30:00","Longitude":"-84.083265","divs":["Sighting DetailsNear London, KentuckyI first noticed the object when my husband and I were leaving my mothers house.I saw very bright multi-colored lights. I live just next door so I watched theobject until I got to my house. My husband went on into the house and I ran toget the the phone to call my mothers house and went back outside to watch as Italked. At this point, my brother and mother stepped onto the porch and alsoagreed that the object was unusual. They soon called my father onto the porch aswell. My brother ran to get his video camera and I drove back over to my mothershouse. We soon called my husband as well. We could all clealry see a row ofmulti-colored lights randomly. My mother had binnoculars and had a very clearpicture of the object. She described it as an upside down bowl with a row ofbright lights at the bottom. The lights flashed randomly in blue, green, red,and white. The luminous section was made of white light. The object satmotionless except for the constant flashing of the bright multi-colored lightsfor around 30-40 mins. Finally, it faded into the horizon. We did see otheraircraft in the sky at that same time. We watched the videotape after wereturned inside, but the video showed nothing like the object we had seen, itonly picked up a colored flashing glow against the darkness.Later on May 15, my brother and his girlfriend were outside at around 1100 PMwhen my brother came running into the house saying that there was something inthe sky again. He and his girlfriend witnesses a very large luminous objectmoving across the sky. By the time I ran outside , I could see an object thatresembled a star in the place that my brothers girlfriend pointed out,at thattime it was moving very slowly and and soon faded away. After my brothersgirlfriend had gone home, he and I stayed outside. He had taken his camera backinto the house assuming the event was over, but again we saw a white lightmoving across the sky coming from the direction that the previous object hadfaded away. As he ran back in, I watched as the what seemed to be a star-likewhite light grow very rapidly into a large, luminous light and then dimcompletely out before my brother even returned with the camera."],"Disposition":"Unresolved","Summary":"Witnessed object with a row of multi-colored light","Date of the Event":"06/10/2004 10:00 UTC","Viewing Distance":"Unknown","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=37.128977,+-84.083265(3107)&iwloc=A&hl=en\"> mufon case (3107) map </A>","City":"London","Case Number":"3107","Latitude":"37.128977","Source":"MUFON","Object Shape":"Oval","Region":"Kentucky","trends":["There have been 4 other sightings in London","There were no other sightings in London on or around June 10th 2004"],"Object Features":"Unknown","Date Submitted":"06/10/2004 10:00 UTC","files":["/var/www/straped/mufon/html2text/3107.html.txt","/var/www/straped/mufon/org/3107.html"],"Weather Factors":"Unknown"}