{"Weather Factors":"Unknown","divs":["Sighting DetailsOn the night of Friday Aug,20,2011, as i was going to get something to eat at 9:00 at night. I left my house and drove east over the F.M.1960 bridge crossing over Lake Houston. As i entered the bridge i could see an object moving very slowly almost stationary over the east side of the bride. As i approached the object i could see (thru my sun roof)a triangular shaped craft illuminated by its 5 bright white lights. The object was almost directly over me at an altitude of around 500 feet. I could make out the outline of the craft by its lights illuminating the object. It seemed to be almost drifting towards the Northwest had no sound and was around 150 feet in diameter. After crossing the bridge and wanting another look at this strange object i did a u-turn and crossed the bridge again heading west. The object was moving North at this point and was around a mile away. I know other people must have seen the object as there were others crossing the bridge as well. Ive lived here for 3 years and seen thousands of planes fly over the Lake. This was not ur typical airplane and unlike anything i have ever seen."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.999611,+-95.251925(31087)&iwloc=A&hl=en\"> mufon case (31087) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Object Shape":"Triangle","Latitude":"29.999611","Tags":"City","Object Features":"None","Summary":"Saw an Unidentified Object over Lake Houston 8/20/11.","Log Number":"US-08222011-0009","Disposition":"Unknown","Region":"Texas","City":"Humble","Date of the Event":"08/20/2011 09:03 UTC","Country":"United States","trends":["There have been 7 other sightings in Humble","There were no other sightings in Humble on or around August 20th 2011"],"Longitude":"-95.251925","Case Number":"31087","files":["/var/www/straped/mufon/html2text/31087.html.txt","/var/www/straped/mufon/org/31087.html"],"Viewing Distance":"101-500 Feet","Date Submitted":"08/22/2011 02:27 UTC"}