{"Case Number":"31080","files":["/var/www/straped/mufon/html2text/31080.html.txt","/var/www/straped/mufon/more/31080_submitter_file3__oct13.3.jpg","/var/www/straped/mufon/org/31080.html"],"Region":"New York","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"Unknown","trends":["There have been no other sightings in New York City","This sighting has never been favorited."],"Disposition":"IFO","Date Submitted":"08/22/2011 02:22 UTC","Object Shape":"Oval, Sphere, Star-like","Latitude":"40.560286","map":"<A HREF = \"http://maps.google.com/maps?q=40.560286,+-73.891731(31080)&iwloc=A&hl=en\"> mufon case (31080) map </A>","Longitude":"-73.891731","Sighting Duration":"01:00:00","Tags":"City","Weather Factors":"Unknown","Object Features":"Unknown","Log Number":"US-08222011-0003","divs":["Sighting DetailsFirst of all, I apologize for making this report so late. I just found out of the existence of this website. I was made aware to the whole \"October 13th\" theory through multiple web source, and obviously, I was skeptical. To keep things short, October 13th came and I realized it would all blow over. However, as I got on 4chan's paranormal board, I was greeted to thread upon thread of people talking about this streams. So I found a link and hopped in. At first, they seemed like planes, but soon I realized that planes simply wouldn't act like this. Planes don't break apart from each other and fly in straight upwards. Planes don't stop in mid-flight and drop down 50 feet. So, I started snapping screenshots. The ones attached are the best available ones I have. The long picture shows a VERY bright light we saw at one point move to the left in the frame, then down slightly, then right back out in a matter of 10 minutes. Simply unbelievable. Soon, all the lights disappeared into the night, and all we were left with was a still-lively New York City. I was watching this cam along at least 40-50 other people."],"Source":"MUFON","City":"New York City","Summary":"Watched a cam stream of the NYC skyline, noticed extremely unusual and unnatural light behavior.","Date of the Event":"10/13/2010 09:00 UTC","Country":"United States"}