{"Latitude":"33.399856","map":"<A HREF = \"http://maps.google.com/maps?q=33.399856,+-104.519034(31082)&iwloc=A&hl=en\"> mufon case (31082) map </A>","Summary":"Nightly for past six months 3 to 12 mysterious lights in NW, SW, and SE sky","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around January 1st 2011","This sighting has never been favorited.",""],"Source":"MUFON","Object Flight Path":"Stationary,Other,Unknown","Disposition":"Unknown","Object Shape":"Circle, Fireball, Sphere, Star-like, Unknown","files":["/var/www/straped/mufon/html2text/31082.html.txt","/var/www/straped/mufon/more/31082_submitter_file1__UFODrawings.JPG","/var/www/straped/mufon/org/31082.html"],"Region":"New Mexico","Tags":"City","Log Number":"US-08222011-0005","Object Features":"Unknown","Date Submitted":"08/22/2011 04:01 UTC","divs":["sighting detailsfor the past six months or so, i have watched mysterious lights above my house in various formations and locations. the first time i saw them, i was looking out my kitchen window to the northwest of roswell. i did not go outside to see at that time but several days later, stood outside my home and counted 12 of them in various locations along the north and west side of town. i did not have a digital camera or binoculars at the time but have since purchased both. my camera is not strong enough to get a good picture, but through the binoculars they each appear similar, but with different features. with the naked eye, they appear as very bright star shaped lights; much brighter than stars. through the binoculars, the biggest and brightest one in the east appears as a circle with a white outer rim that looks like sparkling lights, with green beams forming a prism and blue lights in the center. the ones in the south and west appear as circular, red-orange objects with blue centers that look like electrical circuit going around inside the circle; they are spinning and flashing. i have seen one or two of these project beams toward the others. there was one time that i saw one of the objects move very close to another as though they were communicating, then move back to its original position rapidly. oftentimes, there are only three in the sky in triangle formation - two in the north directly above my house and one in the south over roswell. i do not hear any noise and in fact, it is eerily quiet when out at night and there is a magnetic feel to the air. i have become obsessed and had difficulty sleeping since i began watching them, though i don't know if that is related to the actual objects. i am out several times each night between 12 am and 4 am to see changes and many times, they are gone after seeing them earlier the same night. sometimes there are only two or three, other times there are at least 12. what are these things???? they rarely, if ever move while i am watching them and are almost always stationed in the same spot. they are not satellites because there are too many and there are none listed in orbit over roswell. i am dying to know if anyone else has seen them and\\or taken photos of them. during cloudy nights it is difficult to see them but occasional clearing exposes one or two. the frequency and ability to see them in the sky makes me think that i am not the only one seeing these lights, though i have followed sightings here and on the national ufo sighting website and the only thing close was in january from rio rancho, nm."],"Weather Factors":"Unknown","Date of the Event":"01/01/2011 12:00 UTC","City":"Roswell","Sighting Duration":"Undisclosed","Case Number":"31082","Viewing Distance":"Over One Mile","Longitude":"-104.519034","Country":"United States"}