{"Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-08222011-0014","Object Flight Path":"Straight-line path","Date of the Event":"08/21/2011 10:15 UTC","divs":["Sighting DetailsI was leaving work with 2 other witnesses and I saw in the East, a very bright large orange light moving in a North to South direction. My first reaction was that this was a meteor or space junk burning up in the atmosphere. After a few moments, I discounted that idea due to the slow progress of the light. The speed of the light seemed relative to a small propeller plane traveling at 10-15,000 feet. There was no noise and the light was bright and steady with no sign of any smoke or ejection of any burning matter. All that was visible was the orange glow. the shape of the light was something between rectangular to elliptical. As this object was passing from view, another orange light, that appeared identical to the first one, came into view. This one seemed closer, more like a small plane at 5-10,000 feet. I would estimate the apparent size of the second light as one quarter of a lunar diameter. I live near a small airport and always keep an eye to the sky. These lights are like no aircraft I've ever seen. These were not satellites. This bore no resemblance to the photos of the shuttle Columbia re-entry."],"Region":"New York","Summary":"2 slow moving orange lights moving silently north to south in upstate NY","map":"<A HREF = \"http://maps.google.com/maps?q=43.492731,+-73.780523(31092)&iwloc=A&hl=en\"> mufon case (31092) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/31092.html.txt","/var/www/straped/mufon/org/31092.html"],"Weather Factors":"Unknown","trends":["There have been 3 other sightings in Warrensburg","There were no other sightings in Warrensburg on or around August 21st 2011"],"Date Submitted":"08/22/2011 03:35 UTC","Object Shape":"Cigar","Viewing Distance":"Over One Mile","City":"Warrensburg","Disposition":"Unresolved","Tags":"City","Longitude":"-73.780523","Case Number":"31092","Latitude":"43.492731"}