{"Country":"United States","Date Submitted":"08/22/2011 03:26 UTC","Log Number":"US-08222011-0013","files":["/var/www/straped/mufon/html2text/31091.html.txt","/var/www/straped/mufon/more/31091_submitter_file1__2011-08-2101-00-36.824.jpg","/var/www/straped/mufon/more/31091_submitter_file2__2011-08-2101-00-41.705.jpg","/var/www/straped/mufon/more/31091_submitter_file3__2011-08-2101-00-48.801.jpg","/var/www/straped/mufon/org/31091.html"],"Case Number":"31091","Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in New Bedford","There were no other sightings in New Bedford on or around August 11th 2011","This sighting has never been favorited.",""],"Latitude":"41.641685","Longitude":"-70.932855","Weather Factors":"Unknown","Object Features":"Undisclosed","Tags":"City","Date of the Event":"08/11/2011 09:24 UTC","Object Shape":"Sphere, Star-like","Region":"Massachusetts","Source":"MUFON","Disposition":"Unresolved","City":"New Bedford","divs":["Sighting DetailsI was coming home from visiting my mother and when i pulled into my drive way and got out of my truck and started walking to my front door I NOTICED a BRIGHT light over my woods behind my house.At first i thought IT was a helicopter with its search light on pointing in my direction maybe looking for marijuana grows or escaping criminal suspects but that was CLEARLY NOT the case as IT approched my backyard I did NOT hear ANY sound what so ever except the occasional bullfrog cherping. NOW IT was VERY slowly moving towards the roof of my house not to mention IT had seem to be about anywhere between 50-80 ft above my roof and between 30-60ft diameter.AS IT hovered over my directly over my head at that EXACT moment a 747-777 was flying from the right of the object to the left from my point of view and the plane was with out a DOUBT anywhere between 13,000-26,000ft with the normal NAV lights blinking. but when the plane crossed OVER IT the plane dissapeared behind IT for a few moments and reemerged on the other side! after a moment or two the object started to move foward again and then abruptly turned to the left and flew off like a bat out of hell! If i had blinked I would have missed IT! NOW as for what IT looked like the best way i can describe IT is that IT looked like a PERFECTLY round BLACK AND GREYISH marble that had a VERY bright light surrounding IT like a aura around IT! I also had time to notice and realize that for as HUGE,BRIGHT and CLOSE as IT was IT did NOT reflect ANY light on the ground or tree tops like the moon does when it is out! aslo like to mention even though I think i could be crazy for saying this but when IT hovered over me SOMETHING was telepathically talking to ME Telling ME something will happen VERY SOON and IT has been watching ME for awhile now and the rest THE MESSAGE is \"CLASSIFIED\"! I'm sorry but I feel to AFRAID to talk about the rest of the message in fear that \"THEY\" will stiffle ME under the \"PATRIOT ACT\" IF \"THEY\" were to track this Email to my address! ALSO the pictures I SUBMITED TO MUFON SHOW THE OBJECT taking off in great haste if you know where to look on the pictures!"],"Summary":"I was in awe from what i was witnessing","map":"<A HREF = \"http://maps.google.com/maps?q=41.641685,+-70.932855(31091)&iwloc=A&hl=en\"> mufon case (31091) map </A>"}