{"Country":"United States","Object Flight Path":"Straight-line path","Weather Factors":"None","Viewing Distance":"Over One Mile","Case Number":"31097","divs":["Sighting DetailsOn August 12th, 2011, I made a trip to Knoxville, Tennessee to see a friend. I had decided to stay the night because we would be going shopping and golfing the next day. At 10:05 pm that evening my friend went out to his car to grab a few items so i decided to go out and have a cigarette while he was outside. The moon was fairly low and bright so i looked up at the sky to stargaze for a bit. When i looked to my right (NW direction) I saw a very bright white star-like light that was moving very slowly across the sky directly towards me. I told my friend to take a look and he said he thought it was a plane. I told him i didn't think so, because it appeared to be flying very low and almost too slow to be an airplane. The light was nearly as bright as the moon and was steadily burning, with no pulses or flashing of any kind. The object continued to move towards us and passed almost directly over our position and continued past in at a southeast heading. There was no sound that i could hear before or after the object passed over us. After passing overhead i noticed a plane flying at an intersecting angle toward the object, and after their paths crossed, the plane began to turn back toward the object. Two more planes appeared in my peripheral vision, following the path of the object and traveling at a much faster speed, as if they were trying to catch up to it. As the object moved further away i noticed it began to dim and eventually disappeared in the night sky. I found this very peculiar as there were no clouds or fog that night and the planes that were following it were still visible at that distance. After returning to the house i felt very excited because i had never seen something this strange before, and UFO's and extra-terrestrials had always peaked my curiosity. I didn't know what to do about it until i watched a program about UFO's and heard about MUFON, so i decided to share my experience."],"Sighting Duration":"00:03:00","Object Features":"Unknown","Object Shape":"Star-like","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.969626,+-83.884256(31097)&iwloc=A&hl=en\"> mufon case (31097) map </A>","Log Number":"US-08222011-0019","Longitude":"-83.884256","Disposition":"IFO","Source":"MUFON","Latitude":"35.969626","Date Submitted":"08/22/2011 09:58 UTC","Date of the Event":"08/12/2011 10:05 UTC","files":["/var/www/straped/mufon/html2text/31097.html.txt","/var/www/straped/mufon/org/31097.html"],"City":"Knoxville","Summary":"Bright light moving slowly over Knoxville, TN","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around August 12th 2011"],"Region":"Tennessee"}