{"Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Cicero","There were no other sightings in Cicero on or around"],"Sighting Duration":"Undisclosed","City":"Cicero","map":"<A HREF = \"http://maps.google.com/maps?q=40.130106,+-86.006528(31090)&iwloc=A&hl=en\"> mufon case (31090) map </A>","Region":"Indiana","Country":"United States","Log Number":"US-08222011-0012","Date of the Event":"Unknown","Summary":"Fouth of July weekend comming form north east heading shouth east then west all of a sudden. Viewed from Mores lake in Cicero","Longitude":"-86.006528","Object Shape":"Diamond","Weather Factors":"Unknown","divs":["Sighting DetailsMy friend and I were getting set for the fire workds to start as we sat observing the sky. I had brought along a pair of binoculars and I always carry them in my car. We sat facing north east with a good view not only from across the lake but in the distance as well. I noticed an abject with an amber to a dull yellow color flying in our direction at an altitude that most planes do. I kept watching it as it seem to get closer and then starting using my binoculars and followed it for a good long time trying to see if there were flashing lights or looken for the normal things we see thousands of times when ever we see the planes and comercial jets flying over our homes cities and country sides...of course they always make noise even when viewing them from a long distances but this one was silent and kept it's color and made no noise. I asked my friend to take a look which she did and of course she had no idea what it was either. This thing kept crusing at a steady pase then suddenly dissapeared like a light bulb had shut off. I search for a few more moments then the fire works began. But after the fire works I spotted it again but this time it was comming from another direction south west at the same pase...It was closer and the shape was more obvious to me with out having to us the binoculars. Unfortunately I didn't have as much time to observe it as before because it had dissapperaed behind some trees in a distance. I met a new friend here recently and we got on the subject of UFO's and when she told me of her sighting that sametime and area I was surprised because we had shared the same observation but she was in a different location of course of Hamilton county."],"Disposition":"Insufficient Data","Tags":"City","Object Flight Path":"Path with directional change","Object Features":"None, Patterned Surface","Case Number":"31090","Source":"MUFON","Latitude":"40.130106","Date Submitted":"08/22/2011 03:26 UTC","files":["/var/www/straped/mufon/html2text/31090.html.txt","/var/www/straped/mufon/org/31090.html"]}