{"Date Submitted":"08/22/2011 03:39 UTC","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=30.574628,+-81.54002(31093)&iwloc=A&hl=en\"> mufon case (31093) map </A>","divs":["Sighting DetailsI was asleep around 6.15am my son woke me up saying there was a UFO outside. He was lying in his bed and he has a big window besides his bed he told me he was looking outside when he noticed a bright light due east out over the ocean. He was fascinated by the beautiful colors that were emitting from it. Then suddenly it split into two objects then he jumped up and woke me up and we both went out on our back porch and that's when I saw it he was describing to me about how it split in two halves then went back together. I thought he may have just mistakenly thought that part. I got my binoculars so I could get a better look at it. When I looked at it I just saw multiple colors flashing at a rapid rate. It was the most beautiful thing I've ever seen. I have spent 40 plus years as being a boat captain and spending many hours out there and have seen all kinds of unexplained crafts over the years but this one really got my attention because of the unusually bright colors coming from it. As we watched in awe it split apart again and we started hollering loud because we knew it was something serious. I called my nephew to see if he could see it. He was out on a shrimpboat working and he answered. I asked to look to the east and see if he could see it. I was telling him We were seeing an object out that way. He instantly started shouting god look at all those colors. He got the crew on board to look too. I could hear them shouting in the background. They saw it and we all were having an adrenaline rush. My son stayed as long as he could before he had to leave for work. He was about to get in his vehicle and started singing a verse from an old stix song. We thought that they were angels but much to my surprise. We climed aboard that spaceship,and headed for the skies. I sat there for a few more minuates and it finally just disappeared in thin air. Words can't explain the excitement we felt and it was like we all saw something very unique and I know it was a special event and it doesn't matter if people are gonna blow it off and say we saw a planet or a star or swamp gas. We saw it and that's a fact. The moon was overhead and Venus was close to the moon and was clear as a bell. What we saw wasn't any of that. I'm sure! It was so brilliant and the bright colors around the outer edge were flashing beautiful colors so fast it was unbelievable. After that I came back inside and just thought wow! That wasn't the first time we've seen ufos and we all know that there's more life in the cosmos than our minds can comprehend. People need to accept that and move on. I wish we could have had all of the skeptics with us this morning and let them tell us it was a weather balloon. Haha what we saw would of sent them to a mental institution. Especially when it jumped apart and turned into two objects."],"Viewing Distance":"Over One Mile","Summary":"My son was about to go to work and woke me up We saw the craft split in half then went back together it was awesome it was so bright and the outer edges were flashing beautiful colors","Latitude":"30.574628","Object Features":"Other","trends":["There have been 8 other sightings in Fernandina Beach","There were no other sightings in Fernandina Beach on or around August 22nd 2011"],"City":"Fernandina Beach","files":["/var/www/straped/mufon/html2text/31093.html.txt","/var/www/straped/mufon/org/31093.html"],"Object Flight Path":"Stationary,Other","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-81.54002","Disposition":"Insufficient Data","Source":"MUFON","Tags":"City","Case Number":"31093","Weather Factors":"Unknown","Object Shape":"Flash, Sphere, Other","Date of the Event":"08/22/2011 06:15 UTC","Log Number":"US-08222011-0015"}