{"trends":["There have been 3 other sightings in Peyton","There were no other sightings in Peyton on or around August 18th 2011"],"Disposition":"Unknown","Summary":"Stepped out of my semi-trailer that I was un-loading, my eye caught an extremely bright pulsating light moving very slowly directly above the town of Falcon, Co. and moving in a","Date Submitted":"08/23/2011 08:11 UTC","Viewing Distance":"Over One Mile","Sighting Duration":"00:20:00","Object Shape":"Oval, Sphere","Tags":"City","Log Number":"US-08232011-0010","divs":["Sighting DetailsOn August 18th, 2011, at 8:40p.m., while loading supplies in my semi-trailer at a friends shop in Falcon, Colorado, A large, bright sphere of light caught my eye. When I looked over at the light, I saw what appeared to be a very large, white glowing light that was moving slowly and what seemed to be, very low altitude. I also noticed a higher flying airplane that clearly had it's aircraft light blinking and it was headed right for the sphere type light. At one point, the airplane flew directly over-top of the sphere. I thought they were going to hit each other, they did not, but I could see that the plane was clearly flying, \"above\" the object. As time went on, I watched the object move slowly ina north-east direction, as it appeared to be following the Hyw 24 path out of Falcon and headed for the town of Calhand, Co. The object would move very slow, then seem to speed up, only to slow down again. It appeared to make slight turns to the right and left but I can not be sure of this because of the distance I was fron the object. About 20 minutes passed until when it finally faded from my sight and disappeared. I have seem a number of objects flying in this part of the county, this is the first object I felt needed to be reported and had some credibility to it. Falcon Colorado, seems to be a very active area for UFO sightings. If I'm seeing them, there surely are others that are seeing them too."],"Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/31108.html.txt","/var/www/straped/mufon/org/31108.html"],"Case Number":"31108","City":"Peyton","Date of the Event":"08/18/2011 09:40 UTC","Longitude":"-104.595407","Object Features":"None","Source":"MUFON","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=38.905952,+-104.595407(31108)&iwloc=A&hl=en\"> mufon case (31108) map </A>","Latitude":"38.905952","Weather Factors":"Unknown","Country":"United States"}