{"Sighting Duration":"00:01:00","trends":["There have been 2 other sightings in Stoneham","There were no other sightings in Stoneham on or around August 22nd 2011"],"City":"Stoneham","Tags":"City","files":["/var/www/straped/mufon/html2text/31115.html.txt","/var/www/straped/mufon/org/31115.html"],"Object Flight Path":"Path with directional change","Date of the Event":"08/22/2011 09:45 UTC","Region":"Massachusetts","Weather Factors":"Unknown","divs":["sighting detailsi was taking my dog out for her evening walk around 9:45pm, as i do every night. as i was putting her leash and harness on her i noticed that she was far more excitable than is normal for her. as i walked outside on my back stairs, it sounded as if all dogs in the neighborhood were yelping and howling at the same time. i looked up, and out in front of me, moving over several houses and trees was a jumble of extremely bright, white lights, which appears to be flashing in a sequence. the lights were approximately 500-600 feet above ground and moving in a straight flight path away from my house (difficult to determine exact altitude, as the object\\lights was above and moving away from me). as they passed over a far tree line, the lights\\object banked to the left and then to the right, revealing what appeared to be a disc shape to the object to which they were presumably attached (based on the alignment of the lights; i could see the same lights curving around each side towards the front of the object as it banked in each direction). as the object banked, i could not see a solid shape per se, but the space between the lights was solid black. the object cleared the tree line and disappeared from my sight. the object made no apparent noise. i live under several approach\\take-off routes to boston's logan airport, so i am used to seeing several airplanes per night on my walks with my dog. this did not appear to be within one of those normal flight paths, nor did the lights appear to be aircraft warning lights, as all were very bright white and flashed in sequence around the object. further, the banking maneuvers to both the left and then the right did not appear to be typical of fixed wing aircraft that i normally observe. when the object passed from sight, the dogs in the area ceased barking\\yelping and my own dog calmed down. i did not see the object again that night."],"Disposition":"Unresolved","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.482995,+-71.091428(31115)&iwloc=A&hl=en\"> mufon case (31115) map </A>","Source":"MUFON","Summary":"A multitude of extremely bright, white, flashing lights. Dogs flipping out","Country":"United States","Date Submitted":"08/23/2011 06:36 UTC","Viewing Distance":"101-500 Feet","Latitude":"42.482995","Longitude":"-71.091428","Object Shape":"Disc","Case Number":"31115","Log Number":"US-08232011-0013"}