{"Object Flight Path":"Hovering then path","Longitude":"-86.096839","Region":"Indiana","Object Shape":"Sphere, Star-like","Latitude":"38.613983","Summary":"Light in sky at night thought it was a star, began to move then just disapeered","City":"Salem","Disposition":"Insufficient Data","Country":"United States","trends":["There have been 5 other sightings in Salem","There were no other sightings in Salem on or around August 19th 2011"],"Viewing Distance":"Unknown","Log Number":"US-08232011-0010","map":"<A HREF = \"http://maps.google.com/maps?q=38.613983,+-86.096839(31112)&iwloc=A&hl=en\"> mufon case (31112) map </A>","Date of the Event":"08/19/2011 10:00 UTC","Sighting Duration":"Undisclosed","Case Number":"31112","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/31112.html.txt","/var/www/straped/mufon/org/31112.html"],"Date Submitted":"08/23/2011 04:04 UTC","divs":["Sighting DetailsA friend and I were setting on my front porch in Salem, Indiana discussing war events in history. When a jet WAY off in the sky started into our field of view. I noticed the jet and watched it for a few minutes as we were talking. There were 2 stars in the sky in it's region and had been there all night. I watch the stars as I set on the porch usually and when the jet passed one something seemed different like when your setting still next to a train and it begins to move. You don't know whether your moving or the train. The jet seemed to set still until I realized the \"star\" that had been there for the last hour since it got dark was actually moving also. I told my friend to look and it had already caught his eye also. I cant give an accurate distance it traveled but it was moving about the same pace as the jet was moving. Then it just disappeared after 30 seconds or so of travel and didn't return. I dont know if this was a ufo or not. But whatever it was it stayed still for at least an hour before it moved only to disappear."],"Object Features":"Unknown","Weather Factors":"Unknown"}