{"Date Submitted":"08/24/2011 02:31 UTC","Country":"United States","Longitude":"-122.533431","City":"Battle Ground","Log Number":"US-08242011-0003","Viewing Distance":"Unknown","Date of the Event":"08/23/2011 09:20 UTC","Latitude":"45.780949","Case Number":"31125","Region":"Washington","Sighting Duration":"00:03:00","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31125.html.txt","/var/www/straped/mufon/org/31125.html"],"Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.780949,+-122.533431(31125)&iwloc=A&hl=en\"> mufon case (31125) map </A>","Object Shape":"Boomerang, Circle","divs":["Sighting DetailsMy mom, younger brother, and I were driving east on Battle Ground Highway around 9:20 PM Pacific Standard Time on August 23, 2011 to take my brother to his friend's house. I was sitting in the front passenger seat, my mom was driving, and my brother was sitting in the back, directly behind me. As we were driving he asked if there were always three stars \"over there,\" as he pointed south into the trees. My mom and I ignored him and told him he was probably just seeing parts of the Big Dipper. Then suddenly he said, \"There it is again!\" Shortly followed by, \"Now the trees are in the way!\" I turned to look and see what he was freaking out about and just seconds later we passed a break in the trees and there were four bright, circular lights almost in the formation of a boomerang. They were just hovering above the trees. The lights were almost a white-yellow color. Nothing like the lights on your typical airplane, they were much brighter and a different color. My mom told us they were probably just jets or helicopters, so she rolled down the windows, but we heard nothing but the wind. As quickly as we saw the lights, the trees were in the way again. My brother and I convinced my mom to turn left at the light near O' Brady's in Dollars Corner, so maybe we could get a glimpse of the lights again. When we turned, there were only two lights visible. Then just seconds later there was only one. When we turned back to head east again, my brother and I watched out the back window only to see the last light completely vanish. When the lights disappeared, we couldn't see anything visibly leaving, the lights were just simply gone. When my mom and I were driving home, heading west on Battle Ground Highway, I kept my eye on the trees the whole time to make sure we hadn't just seen some sort of street lights or something, but there was no sign of the lights."],"Summary":"Four bright, circular lights in formation of boomerang seen hoovering just above the trees, then disappeared.","Object Flight Path":"Unknown","Disposition":"Unknown","trends":["There have been 5 other sightings in Battle Ground","There were no other sightings in Battle Ground on or around August 23rd 2011"]}