{"Source":"MUFON","Date of the Event":"08/23/2011 09:35 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31122.html.txt","/var/www/straped/mufon/org/31122.html"],"divs":["Sighting DetailsThe weekly meeting of the local Civil Air Patrol squadron, ND031, had just ended, and several cadets were being driven home in the squadron van, which was heading west on I-94 just west of Jamestown, ND. The object was seen by 4 of the 5 Civil Air Patrol members in the van just east of exit 248, a bright glowing object with bright \"vapor trail\". Both the object and the trail were bright blue green in color. The object's apparent size was that of a softball, with an apparent velocity roughly equal to or slightly greater than the vehicle, which was moving at freeway speed (75 mph). The flight path was roughtly 10 degrees descending, i.e., not quite horizontal, and appeared parallel with the interstate, east to west. After being observed for 20-30 seconds, the object disappeared with a flash, reportedly making a couple of \"popping\" sounds which were audible in the vehicle while driving. The intensity of the light was such that the inside of the van was lit, described as similar to the light of an arc welder. The sky at the time was dark, and relatively clear with no moon and no opposing traffic to interfere with observation. This is not a first-person account; I am compiling this account from the descriptions given by the people in the van. I am the squadron commander, but was not at the meeting; my wife, the deputy commander for cadets, was driving. Based on the descriptions, I asked if this object could have been a meteor, but most felt that it looked more like a man-made object, burning with the color of magnesium on fire. We have speculated on the possibility of a satellite reentry, but the flight angle is not conducive to that conclusion. Also, the trail apparently did not contain debris as would be expected. Reports have been made to the local sherriff's office. Thank You, John Nyberg Captain CAP"],"Date Submitted":"08/23/2011 11:37 UTC","Case Number":"31122","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=46.863449,+-98.93432(31122)&iwloc=A&hl=en\"> mufon case (31122) map </A>","Longitude":"-98.93432","Region":"North Dakota","Object Features":"Unknown","Weather Factors":"Unknown","Tags":"City","Country":"United States","trends":["There have been 5 other sightings in Jamestown","There were no other sightings in Jamestown on or around August 23rd 2011"],"Log Number":"US-08232011-0019","Latitude":"46.863449","Summary":"bright glowing object slightly descending path westward parallel to I-94","Viewing Distance":"Unknown","City":"Jamestown","Object Flight Path":"Straight-line path","Disposition":"IFO"}