{"Date Submitted":"08/24/2011 11:24 UTC","Longitude":"-74.935897","Summary":"Light moving rapidly across night sky","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Disposition":"Insufficient Data","divs":["Sighting DetailsThis account is a compilation of my experience and my 9 year old son's experience. I am an educated adult woman who has an open mind about the world around me with a heavy dose of skepticism. It was 9:30 at night, Aug 23, 2011, my son and I were reading books in my bedroom. My husband left to take our dog for a walk. He returned after a couple of minutes stating that he had just witnessed a UFO. Knowing my husband, I knew he meant that he saw something he couldn't explain. I listened to his account and then told him to go back outside with my son and see if they would see it again. I joined them after a couple of minutes on our back deck. My husband pointed out over toward the power lines in the field behind our house saying that was where he saw the lights. I stood with them for just a minute watching the sky when I saw a light appear. It was white then turned into a bright green light. It was stationary and had just \"switched on\" in the sky. I asked my husband, \"is that It?\". \"Yes\", he said and as he said that, the light went out and reappeared to the left of where it had been. It disappeared again, reappearing four more times in a clockwise arc pattern in the night sky. As I watched it appear, disappear (always a bright green light), I tried to make sense of what I was seeing. It behaved like a RC airplane as it arced and darted. The color of the light looked like a laser color, but I couldn't see any clouds or smoke that would show a laser. I saw stars in the sky. My son said he saw it darting back and forth and he could see small bits of electricity shooting from behind it. Its \"movement\" was only assumed because the light would turn off and reappear somewhere else again and again in a darting pattern. At one point it looked as if the light stretched out, again like a laser lighting a wire (my mind was thinking one of the power lines was being illuminated by a laser light). The whole experience lasted only 20 seconds or so. We didn't hear any sound. No engines or motors, no people out in the field. I then got my phone and started to record. Even though the video is dark and nothing was seen after that, our first recount and discussion of what we saw was captured on the video. My husband's account has been submitted independently on this site."],"Object Shape":"Circle, Unknown","Object Flight Path":"Path with directional change,Other","City":"Newtown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Latitude":"40.248941","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31134.html.txt","/var/www/straped/mufon/org/31134.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.248941,+-74.935897(31134)&iwloc=A&hl=en\"> mufon case (31134) map </A>","trends":["There have been 13 other sightings in Newtown","There was one other sighting in Newtown on or around August 23rd 2011"],"Log Number":"US-08242011-0012","Region":"Pennsylvania","Source":"MUFON","Case Number":"31134","Tags":"City","Date of the Event":"08/23/2011 09:34 UTC"}