{"Case Number":"31139","Source":"MUFON","Disposition":"Unresolved","Summary":"Object was fuzzy, bright , (Glowing?) and silent","City":"Idaho Falls","Object Flight Path":"Stationary,Hovering then path","Country":"United States","Longitude":"-112.024284","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31139.html.txt","/var/www/straped/mufon/org/31139.html"],"Date Submitted":"08/24/2011 02:32 UTC","Object Shape":"Disc","trends":["There have been 8 other sightings in Idaho Falls","There were no other sightings in Idaho Falls on or around August 2nd 1957"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.499241,+-112.024284(31139)&iwloc=A&hl=en\"> mufon case (31139) map </A>","divs":["Sighting DetailsIt was Aug.2nd,1957, my 18th birthday and my brother, cousin and I were celebrating it, by doing what we love. fishing. We were about 45-50 miles from Idaho Falls,Id. and we had planned to camp and fish all week. In the early morning of August 2nd, I was awakened by my brother. He was shaking me and telling me to come outside. There was something I had to see. My brother was the type of person who very seldom got excited, so I knew it had to be something of importance. As I exited the tent, my brother was pointing across the small bay we were camped on.There, across the bay, was the strangest object that I had ever seen. The bay we were camped on was about 50 yards wide and app. thirty yards beyond that was a fuzzy, silvery, object, hovering about five feet above the ground. It appeared to be completely stationary, except for a slight wobble from side to side. About ten feet in in front of the object, on the ground, was what appeared to be a much smaller object which gave me the impression that it was moving, though I really don't remember seeing it move. I wanted to get my binoculars and get a better look and they were in the truck. I slowly made my way to the truck, hoping to get a better look.As I opened the door of the truck the dome light came on, and the object across the bay, suddenly \"turned off.\" and then became very bright, and started moving slowly in our direction. My cousin had joined us, though I don't remember when. As the object slowly \"drifted\" towards us, I crawled under the truck. My brother and cousin dashed for the truck and the three of us crawled underneath it. Although it was partially obscured, because we were under the truck, we could see the object coming our way.I remember glancing in the direction I first saw the object and the smaller object was no longer there. I was never so scared in my life. in about 2 minutes or so, the object passed directly overhead. I could feel it more than see it, because it didn't cast a reflection of light; I could feel the hair on my head and arms start to tingle, and then stand straight up, but I thought it was because I really was that scared. As soon as it passed over the truck the object went straight up and in about ten seconds or less it was gone. My brother and cousin later told me, they felt the same sensations as I. We decided to cut our camping trip short and head for home.We haphazardly broke camp and headed for home. We told no-one about that night, How do you tell someone, specially when you're a teen-ager, that you were so scared that you wet your pants? So, we told no-one. My brother and cousin are both gone now,My brother killed in an auto accident and my cousin committed suicide and I am 72 and the last living witness. From what i have been told by more than 1 person, that is a very active area for ufo's This area, though not far from civilization, is very secluded and the nearest house is about 20 miles away. It's a wild area, but accessible by dirt road."],"Date of the Event":"08/02/1957 12:00 UTC","Region":"Idaho","Latitude":"43.499241","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"101-500 Feet","Object Features":"None","Log Number":"US-08242011-0016"}