{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/31137.html.txt","/var/www/straped/mufon/org/31137.html"],"Sighting Duration":"00:01:00","Tags":"City","Latitude":"52.13877","trends":["There have been 16 other sightings in Saskatoon","There were no other sightings in Saskatoon on or around August 23rd 2011"],"Case Number":"31137","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path,Other","Country":"Canada","Object Features":"None","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=52.13877,+-106.646176(31137)&iwloc=A&hl=en\"> mufon case (31137) map </A>","Summary":"star-like object blinks out to nothing over saskatoon","Date Submitted":"08/24/2011 01:41 UTC","City":"Saskatoon","Longitude":"-106.646176","Log Number":"CA-08242011-0015","Region":"Saskatchewan","Date of the Event":"08/23/2011 10:30 UTC","divs":["sighting detailsit was between 10:30pm-11:00pm august 23rd. this was viewed from the east side of the city. i was inside taking care of a few chores before bed and my boyfriend was outside having a smoke. suddenly i hear him yelling for me to run outside. he points to the sky and asks, \"what is that?\" and together we look up. there is a light, about the same size\\brightness\\color as the surrounding stars, moving very slowly. i brushed it off as an airplane, albeit a very strange looking one. it was almost over head, a little south, and moving eastward. it was moving in a straight line but then got a little shaky and sporadic, although still running a straight course. he runs out to the street to try and get a better look and he lost view of it in the process. i watched the entire time and suddenly the light started to shrink, it changed color to a darker orange, and then blinked out to nothing. in the same area appeared 4 more star-like things, the same darker orange as the original light had turned before it blinked out. they didn't move. they simple blinked on in a diamond shape, lasted about 5 seconds, then blinked out. the last 4 lights were very, very faint. he didn't catch those, only i did. the whole thing happened so quickly i didn't even have time to think about grabbing a camera to record what was happening. it was the first time i've witnessed anything of the sort."],"Object Shape":"Diamond, Star-like"}