{"Latitude":"30.313157","Object Flight Path":"Path with directional change","Case Number":"31138","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-95.448231","map":"<A HREF = \"http://maps.google.com/maps?q=30.313157,+-95.448231(31138)&iwloc=A&hl=en\"> mufon case (31138) map </A>","files":["/var/www/straped/mufon/html2text/31138.html.txt","/var/www/straped/mufon/org/31138.html"],"Summary":"The Stars Were Moving","Object Shape":"Circle, Star-like","Date of the Event":"08/23/2011 09:45 UTC","trends":["There have been 10 other sightings in Conroe","There were no other sightings in Conroe on or around August 23rd 2011"],"Tags":"City","Region":"Texas","Country":"United States","Weather Factors":"Unknown","Disposition":"IFO","divs":["Sighting DetailsI was sitting outside my patio as i usually do and gazing up into the stars. I see many planes pass by every night although last night was a different story. As one small white star like object caught my eye, I followed it in what I thought was going to be a typical straight path into the distance.. It turned. I stood up in a cold sweat as I noticed it had 3 \"friends\". I put it like this because these 4 objects were.. playing. I watched at what appeared to be over a mile away from me as these star like objects zipped through the sky at very high speeds. There were no clouds in the sky for some sort of laser to be reflecting on to it and these things roamed so far as to go directly above my home. I nearly went straight through my glass sliding door trying to get my video camera. I taped these events for around 2 hours, as they would not let up. The footage is so dark you can't even see anything. At exactly 11:50, opposite the events i was watching, the brightest meteor i have ever seen illuminated then fizzled out in to sparks. That put the shakes on me. I don't how i removed my self from the patio, but something inside of me told me to get inside. As I was picking up my scattered camera equipment at 12:30, the strange lights were still there roaming the sky. Some one please tell me these were birds in the moon light or something. I have been studying and looking at ufo footage for years and I have never seen objects move like this before in my life. They darted so fast that they seemed to blur, it was very strange. This sighting was over Montgomery County in Texas. If i enhance this video to see what i was seeing, MUFON will be the first to know."],"Object Features":"Other","Sighting Duration":"Undisclosed","City":"Conroe","Log Number":"US-08242011-0015","Date Submitted":"08/24/2011 02:20 UTC"}