{"Object Shape":"Other, Unknown","Viewing Distance":"101-500 Feet","Case Number":"31131","Longitude":"-119.818816","map":"<A HREF = \"http://maps.google.com/maps?q=36.742858,+-119.818816(31131)&iwloc=A&hl=en\"> mufon case (31131) map </A>","divs":["sighting detailson aug 23rd evening 10:17 pm i was walking to the corner store.i like to look up at the stars all the time. i figure that, not alot of people ever do.anyways, i looked to the nw direction ,the sky was partly cloudy and a slight cool breeze the temp was about 70 degrees. i thought the craft that i'd seen was a huge plane at first, but it had no sound what so ever and the city lights you could see that it had a non shiny surface the strange thing is..it looked like a square not a box, but a messuring construction square. the lights looked so way wierd like the size basket balls 500 ft in the sky, and had another outter ring around the lights slowly getting brighter then slowly getting dim. i stopped to look at it to see if it was going to move in some other direction but didn't. it stayed on a nw direction..like it was flying towards castle afb. which is a federal prison now..about 3 minutes later..i think these jets came from lemoore naval air station, because they were 2 qf-a18's hornets \\ the nationl guard base near me..nothing was flying out of their..and the only planes that they have are qf-16's and these jets were hot on it's tail..i waited near the store for over 15 minutes to see if maybe the craft would come back..but never did..."],"City":"Fresno","Weather Factors":"Unknown","Source":"MUFON","Region":"California","Tags":"City","Sighting Duration":"00:22:11","Object Flight Path":"Path then hovering","Date of the Event":"08/23/2011 10:17 UTC","Summary":"Walking to the corner store. Looked up and had seen strange object in night time sky.","Log Number":"US-08242011-0009","Latitude":"36.742858","Date Submitted":"08/24/2011 10:29 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/31131.html.txt","/var/www/straped/mufon/org/31131.html"],"Object Features":"Other","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around August 23rd 2011"],"Country":"United States"}