{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI recently seen something on the history channel and the discription of a UFO that was given was identical to one I witnessed back in o7 or 08 not quite sure. It was between 8 or 9 and dark already. I was going out to turn the water off in the garden and close the shed door. I just looked up there it was. It came from the N-E (the direction of our local airport) and continued on to the s-w. Once it was right over head you could tell the thing was F^%#@*g massive. I guess like holding a opened up newspaper at arms lenghth while looking up. It was big!!! The triangle had 5 red lights and then there was a single red light following like flying wing. this one had no body or nothing just a red light.I ran to the patio to get my grandfather \"Papa Papa come check this out\" he walked out with me looked up and said \"yep\" then went back in. I laughed my ass off. It moved around the same speed as a blimp. no sound at all until it was a ways off then just a low hum. I never reported it just told friends. If I was to call the police here there so narrow minded to them it would be gang related. LOL. Any way thats it. it was visable round 5 mins or so then it got out of my sight due to trees and houses. I would like to to know were there any reportings of this around the dates of my sighting? I would be interested to know if any one else seen it too."],"Longitude":"-119.752638","Country":"United States","Log Number":"US-08242011-0010","Disposition":"Unknown","Source":"MUFON","Object Shape":"Triangle, Other","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around August 14th 2008"],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/31132.html.txt","/var/www/straped/mufon/org/31132.html"],"Latitude":"36.726083","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Case Number":"31132","City":"Fresno","Date of the Event":"08/14/2008 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.726083,+-119.752638(31132)&iwloc=A&hl=en\"> mufon case (31132) map </A>","Region":"California","Date Submitted":"08/24/2011 10:43 UTC","Object Flight Path":"Straight-line path","Tags":"City","Object Features":"Unknown","Summary":"Large triangle w/ 5 red lights and single red light following"}