{"Disposition":"IFO","Viewing Distance":"Unknown","Region":"Idaho","Date of the Event":"08/23/2011 09:40 UTC","Weather Factors":"Unknown","Case Number":"31148","Object Features":"None","Object Flight Path":"Hovering then path","Log Number":"US-08252011-0003","Date Submitted":"08/25/2011 04:21 UTC","Object Shape":"Unknown","trends":["There have been 19 other sightings in Coeur d'Alene","There were no other sightings in Coeur d'Alene on or around August 23rd 2011"],"files":["/var/www/straped/mufon/html2text/31148.html.txt","/var/www/straped/mufon/org/31148.html"],"Latitude":"47.732407","Source":"MUFON","Tags":"City","Summary":"Two unknown objects observed in North Idaho sky.","Longitude":"-116.82593","map":"<A HREF = \"http://maps.google.com/maps?q=47.732407,+-116.82593(31148)&iwloc=A&hl=en\"> mufon case (31148) map </A>","divs":["Sighting DetailsWhile I was sitting watching TV in my room my daughter was looking out my bedroom window and saw something that caught her attention. It was an extremely clear night and the sky was sparkling with stars. There were two objects high in the sky that were glowing white, but clearly were not stars. I got up to see the same objects that, I observed, to turn an orange-red. They could be described as having lights like that of an airplane, but these objects were much too high to have been an airplane and if they were a jet we would have heard the noise as we frequently hear the jets from the air force base in Spokane, Washington. These two objects hovered in a parallel position for a few minutes, long enough for me to also call my son in to look, as well. He also observed the objects, but as he was watching them, the one to the left quickly took off to the north and literally disappeared in an instant. My daughter stated that the other object shot off towards the west, back up over our house and out of view. When we went to the front of the house there was nothing to be seen in the sky. In checking the internet we found that there have been several sightings in the North Idaho area and nearby Washington, spaced about a month apart. Most seemed to take place sometime between 9 and 10 PM. Also there were repeated sightings of the orange-red objects sometimes in a formation of five that head off towards the west. Coincidentally, we have an air force base to the west and a small naval facility to the north that they use for nuclear submarine research and testing. We were all pretty excited about the prospects of what we were seeing, but the kids also were a little scared that whoever was in them might have known we were watching them or that someone from the government would find out and lock us up?! Of course, I hope none of this is a real worry."],"City":"Coeur d'Alene","Country":"United States","Sighting Duration":"00:05:00"}