{"Latitude":"34.890516","Viewing Distance":"101-500 Feet","Date Submitted":"08/25/2011 01:59 UTC","Sighting Duration":"00:06:00","City":"Chatsworth","Summary":"Observed stationary object, as I moved closer it arose, hovered then silently and slowely moved away and just disappeared.","Weather Factors":"Unknown","Tags":"City","Case Number":"31154","Log Number":"US-08252011-0009","map":"<A HREF = \"http://maps.google.com/maps?q=34.890516,+-84.795304(31154)&iwloc=A&hl=en\"> mufon case (31154) map </A>","Object Flight Path":"Stationary,Hovering then path,Path with directional change","divs":["Sighting DetailsHappened in 1951 or 1952 while riding my bike. I was approximately 6 years old at the time. I approached a terraced pasture from a wooded area where I had stopped. Upon the highest terrace I observed an object that I thought to be some kind of airplane sitting stationary in the tall grass. As I approached the object, and before I was able to get within approximately 100 hundred feet, the object arose, hovered briefly then moved away from me.. slowly at first then when it had gotten maybe 500 yards away it just disappeared. I was unable to tell anyone exactly what shape it was, but best guess it was oval. Also, it had what appeared to be windows, however all I remember seeing were probably just darker portions of the body of the craft. I remembering that I couldn't understand why I wasn't hearing any sound of an airplane. When I went up to the landing place all the tall grass was very flat and seemed to be swirled around in a circle. I remember riding my bike around inside that circle before I rode home to tell my dad and grandmother. And, later excitedly told my mom when she got home from work."],"Region":"Georgia","Source":"MUFON","Longitude":"-84.795304","Country":"United States","files":["/var/www/straped/mufon/html2text/31154.html.txt","/var/www/straped/mufon/org/31154.html"],"Object Features":"Window(s), Other","Disposition":"Unresolved","trends":["There have been 6 other sightings in Chatsworth","There were no other sightings in Chatsworth on or around June 10th 1952"],"Date of the Event":"06/10/1952 01:00 UTC","Object Shape":"Egg, Oval, Other"}