{"Case Number":"31150","trends":["There have been 3 other sightings in Willmar","There were no other sightings in Willmar on or around August 24th 2011","This sighting has never been favorited.",""],"Longitude":"-95.039531","Viewing Distance":"Over One Mile","City":"Willmar","Date Submitted":"08/25/2011 10:28 UTC","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=45.131548,+-95.039531(31150)&iwloc=A&hl=en\"> mufon case (31150) map </A>","Tags":"City","Latitude":"45.131548","Object Shape":"Cigar","divs":["Sighting DetailsMy girlfriend and I were loading our purchases into my vehicle in the parking lot of the Willmar Wal-Mart at approximately 3:30 in the afternoon on Wednesday, August 24th, 2011. She spotted the object first and asked me what it was. We observed a craft that was a shiny chrome, cigar shape cruising slowly in a straight line, traveling from the East to the West. During this time, the sky was clear blue with no clouds in the immediate area. We could see that there were no wings or other structures on the craft. The only other detail was that there were 2 black colored circles on the bottom middle of the craft. I would look at the object, look away, then look at it again to make sure it was actually what it appeared to be. I did that a couple of times. I watched it maintain a slow straight path. At first, I was awestruck at how a craft that big with no wings could cruise that slowly. There was no sound coming from the craft as you would hear from a normal aircraft. As we were watching the craft, we kept asking each other if we were seeing the exact same thing. We were. Then, as we were watching it, it just simply vanished. It did not zoom off anywhere, it just disappeared. Afterwards, I was rather happy that I had seen the craft because I had seen 3 other UFO's within the last 10 years. This sighting yesterday, was the closest I have ever witnessed."],"Country":"United States","Object Features":"None","Object Flight Path":"Straight-line path","Weather Factors":"None","Sighting Duration":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/31150.html.txt","/var/www/straped/mufon/org/31150.html"],"Source":"MUFON","Date of the Event":"08/24/2011 03:30 UTC","Summary":"It was a bright chrome cigar shaped object cruising much slower than a normal aircraft of that size could do.","Log Number":"US-08252011-0005"}