{"Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Object Shape":"Sphere","Case Number":"31152","Country":"Canada","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=53.734028,+-127.641221(31152)&iwloc=A&hl=en\"> mufon case (31152) map </A>","Date of the Event":"05/24/2001 12:00 UTC","Region":"British Columbia","Object Features":"None","Source":"MUFON","Date Submitted":"08/25/2011 01:03 UTC","Latitude":"53.734028","files":["/var/www/straped/mufon/html2text/31152.html.txt","/var/www/straped/mufon/org/31152.html"],"City":"Vancouver suburbs","Summary":"circular silver ball approx 8ft in diameter","trends":["There have been no other sightings in Vancouver suburbs","This sighting has never been favorited."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"CA-08252011-0007","Tags":"City","Longitude":"-127.641221","divs":["Sighting DetailsIt was a sunny afternoon and myself and passenger were driving home from a dog show. We noticed a huge silver ball sitting at the edge of a farmers field. My initial thought is that it was a ball that they put on high lines for airplace safety, but then realized there were no such high lines in that area. We stopped to take a look and walked up to it about 10 ft away. It made no noise, it looked solid, it had no seams, it was not a balloon, it was approx 8ft in diameter. I then felt uncomfortable because It just didn't feel right. We left and told the family when we got home what a strange anomoly we saw. We passed by the next day and it was gone. I never thought about it again until the local Vancouver UFO society mentioned that there was a multiple sightings of silver balls in the sky over Vancouver around that same time in 2000 or 2001. Now, the other strange anomily I have seen in my lifetime was in England, when I was 12 yrs old. I went to Timperely village, in Cheshire, with my girlfriend and stopped along with all the other folk to see 5 silver balls falling from the sky, all attached by silver rods. When they got to a certain height, they dettached from the rods and fell to the earth. No noise. We ran home all excited and told my parents, who dismissed it as imagination. Strange coincidences:"]}