{"trends":["There has been one other sighting in Gray","There were no other sightings in Gray on or around February 20th 2004"],"Latitude":"33.050096","files":["/var/www/straped/mufon/html2text/31153.html.txt","/var/www/straped/mufon/org/31153.html"],"Case Number":"31153","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08252011-0008","Region":"Georgia","Country":"United States","Object Shape":"Square, Rectagular, Other","divs":["Sighting DetailsMy information is second hand. My mother, the largest skeptic in the world, was coming home from work. She lives approx two miles from work. She informed that as she reached the driveway to her home, she saw something hovering above the trees. The object was described as having a shape of a rectangle, but one side curved downward to the bottom. She also stated that numerous extremely bright lights were in various locations about the craft. In disbelief, she turned the car off after rolling the driver's side and passenger's side windows completely down. She began to panic because she could not hear anything. Also, while looking at this thing, she began to think that if she can see \"them\" they could certainly see her. She started her vehicle, flew down the driveway (about 120 feet)ran into the home and tried to wake my father, he got up and they ran to the front door of their home - of course, the object was gone. My Mom and Dad live on a small farm. They do not have many neighbors. The object was hovering above a beaver-dam pond. She recently told me her story and I wish I knew what was going on. My mother is very skeptical as is my dad. My Mom, is a Registered Nurse and a Sunday School teacher. She never believed our \"ghost\" stories and thought that all of that stuff was just mumbo-junbo. Ask her now, and she will tell you different!"],"City":"Gray","Date of the Event":"02/20/2004 12:00 UTC","Tags":"City","Summary":"Size of a football field, not completely square (looked like a bread box)","Disposition":"Unresolved","Object Flight Path":"Stationary","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.050096,+-83.534975(31153)&iwloc=A&hl=en\"> mufon case (31153) map </A>","Longitude":"-83.534975","Weather Factors":"Unknown","Object Features":"Other","Date Submitted":"08/25/2011 01:57 UTC"}