{"map":"<A HREF = \"http://maps.google.com/maps?q=45.599793,+-122.784327(31168)&iwloc=A&hl=en\"> mufon case (31168) map </A>","Sighting Duration":"Undisclosed","Longitude":"-122.784327","City":"Portland","Object Features":"Wings","Disposition":"Unknown","Summary":"T-shaped gray frame with 3 white lights in triangle arrangement","Country":"United States","Tags":"City","Date of the Event":"08/24/2011 09:05 UTC","divs":["Sighting DetailsAround 9AM on August 24, 2011, I was headed SE on Highway 30. Before I reached the Sauvie Island bridge, I saw what looked like a plane in the sky -- white, glimmering, about the right size. I watched and waited to see its wings. Instead it remained sort of roundish and it seemed to be turning, since the light reflection looked like its changing. So I started to wonder if it was a helicopter but very high up. As it turned, it got darker -- and suddenly it was gone. Since I was driving, I really couldn't scan the sky much to find it. I kind of smiled to myself and thought that it was sort of like a UFO sighting. As I got closer to Linnton, however, I saw the thing again! The experience was the similar only it took place over about 10 seconds instead of 30 or so. It started out glimmering, then \"turned\", went dark, and was gone. At this point, I started to be curious. Did I just lose track of it before? Because I was driving slower this time, I was able to search the sky a bit. Nothing. I got my first stop of the drive at Kittridge and 30. I looked up again curious if I could spot it one more time. Sure enough, I saw the thing a third time. I had better chance to watch it while the streetlight was red. There were clearly 3 lights and a Y- or T-shaped frame that looks like a plane without its nose. So I thought that was pretty weird. All of a sudden, the lights on it go out one by one, briefly revealing a gray color. At first, it seemed like it has disappeared again. But I squinted and realized that I could it flying away SE -- a little more east than I'm facing. It quickly faded away into the sky's haze. I' would say it was fast like a jet, but the haze gave me the impression it was moving higher and faster than jets I've seen. I eventually lost sight of it in the distance. And that's it! I'm still mildly spooked about it and am saddened that I've yet to find any other sightings of it on the Internet. I really don't know what I saw but it was definitely unlike anything I've ever seen. So I felt it best to share my sighting since others might be doing the same."],"Log Number":"US-08252011-0022","Viewing Distance":"Unknown","Case Number":"31168","Region":"Oregon","Object Flight Path":"Hovering then path","Source":"MUFON","Date Submitted":"08/25/2011 11:07 UTC","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around August 24th 2011"],"Object Shape":"Other","files":["/var/www/straped/mufon/html2text/31168.html.txt","/var/www/straped/mufon/org/31168.html"],"Weather Factors":"None","Latitude":"45.599793"}