{"Case Number":"31169","Object Features":"Unknown","City":"Rochester","Object Flight Path":"Stationary","Region":"New York","Tags":"City","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around August 25th 2011"],"Date Submitted":"08/25/2011 11:26 UTC","Weather Factors":"None","Country":"United States","Source":"MUFON","Longitude":"-77.601823","divs":["sighting details this is 2nd night in a row. last night approx 9pm taking dog for a walk and watching storm clouds from the west approach, we noticed a large star in the western sky of rochester, ny, just after sunset, too large and low for a real star - realized it was actually moving. it seemed to oscillate and wobble. 3 people walking by stopped to witness this also. we are near the airport and aircraft traveled on their normal flight path (higher and away from the object)so it couldn't have been a star. it shimmered shades of white\\blue and a faint shade of red\\pink. we were not afraid but fascinated. at that point we also noticed to the right of it, were 3 smaller star-like objects in the form of a triangle that were also \"wobbly.\" i went home to get my camcorder but upon return, they all had faded at that point to tiny grey spots. this is going on again right now as i type this with 2 other witnesses that were walking home from work at the hospital. i just used binoculars and made out a large white glowing spherical shape but it was so bright and wobbling, hard to tell so i used our telescope (not state of the art). it had the appearance of more than one glowing sphere either attached to one object or just clustered together. again it was moving and hard to focus but the triangle cluster of \"stars\" next to it appeared again but too dark to get a good picture. of note, this was an area where i had posted a sighting on the 4th of july with pictures of the original sighting of glowing spheres rapidly rising from the western horizon with approx 14 in all that flew above us and disappeared overhead. the \"zoom in\" feature will show the \"x\" shaped object with 4 firey spheres on each end. again, we weren't in fear but fascinated. thank you for allowing me to share this, it was a life changing event."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.112293,+-77.601823(31169)&iwloc=A&hl=en\"> mufon case (31169) map </A>","Object Shape":"Star-like","Latitude":"43.112293","Summary":"For 2nd night in a row, a jittery star object like seen in MA, wobbling and hovering","Date of the Event":"08/25/2011 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/31169.html.txt","/var/www/straped/mufon/org/31169.html"],"Log Number":"US-08252011-0022","Sighting Duration":"Undisclosed"}