{"Longitude":"-86.122827","Latitude":"41.682209","Date of the Event":"08/25/2011 11:20 UTC","Country":"United States","Case Number":"31171","Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"Indiana","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.682209,+-86.122827(31171)&iwloc=A&hl=en\"> mufon case (31171) map </A>","files":["/var/www/straped/mufon/html2text/31171.html.txt","/var/www/straped/mufon/org/31171.html"],"City":"Mishawaka","Object Flight Path":"Path then hovering","Log Number":"US-08262011-0001","trends":["There have been 11 other sightings in Mishawaka","There were no other sightings in Mishawaka on or around August 25th 2011"],"Tags":"City","Source":"MUFON","Disposition":"Unknown","Summary":"Saw flashing light in the sky that was moving side to side, and changing altitude slightly.","divs":["Sighting DetailsWhile standing outside at work I noticed a star like object that flashed different colors randomly. I have seen this same object in the sky before and often wondered what it could be, because of the noticeable flashing and changing of colors it does. It always seemed to stay in one place though. Tonight I stepped out of the building with another guy, and had seen the same flashing light. Only this time it was also moving from side to side, and up and down. I asked Wayne if he was seeing the same thing I was, and he asked me what it could be. I let him know I have no idea, but have seen the flashing light often, but this is the first time I have seen it move in such a way. Then another guy from my work came out also, we asked if we were crazy or if he was seeing it move also? He watched for a couple seconds and asked the same question, \"what is that thing?\". He of course got the same answer, which is, \"I wish I knew\". I have tried to investigate online, and I have seen videos people have taken that look like the same object in other parts of the world. Anybody know what this is? Dale"],"Sighting Duration":"Undisclosed","Date Submitted":"08/26/2011 12:05 UTC","Object Features":"Unknown"}