{"Tags":"City","divs":["Sighting DetailsLabor day 2010, while traveling up I-85 from Atlanta to Charlotte I was in the passenger seat of a friends car. I observed a bright yellow \"star\" which I soon realized was changing in orientation to the surrounding stars. My entire family in aviation, I naturally attempted to identify the make of aircraft I assumed it would be. While nearing us I began to notice various neon spectrum colors emanating in sequence from the craft that didn't seem to coincide with and commercial airliner lights I had seen to date. Very rapidly the craft approached and descended to a very low altitude, roughly 60 feet, just above the tree tops lining the highway. The craft, whose primary hull was ovalian, with a structure resembling and iron cross cross section through the axis of the vehicle. One of the squared edges of the cross section was wider than the other three with 4 small yet intense yellow lights running parallel to it's edge. Each of the other three squared sections had a large intense yellow light. There was a row of 8 multicolored lights flashing along the central axis of the cross section, each light would flash a different color nearly every time it illuminate, it did this in constant and rapid succession. The wider section appeared to be the rear at first, but as it approached us and descended just about the trees it halted and reversed course almost instantaneously. We immediately pull off the highway at the Cowpens exit and stopped at a closed fireworks shop just off the highway and walked out into the adjacent field. The craft slowly moved over us the shot at a dramatic angle towards the mountains and again halted. It was then approached by an identical craft. Both flashed their sequential lights under theirs frames directly towards each other then both simultaneously made 3-4 clockwise rotations around each other then broke away from one another. These first 2 craft traveled silently in opposing directions with dramatic right angle movements towards 2 additional craft which had just appeared from behind the mountains. The first 2 repeated the \"communication dance\" with the 2 new craft. The 4 then began to rapidly comb the area silently covering great distances with erratic and jerky movements. One of the came back over to our area of the field and flew directly over us, lowering as it approached the ascending after passing us. This time it did not move in a straight line but side to side as it moved forward as if traveling on some sort of wave form. Moments later they re congregated briefly the shot off in 4 different directions all disappearing quickly and silently."],"Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Longitude":"-81.802742","Date of the Event":"09/06/2010 11:00 UTC","files":["/var/www/straped/mufon/html2text/31178.html.txt","/var/www/straped/mufon/org/31178.html"],"Log Number":"US-08262011-0008","Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.021752,+-81.802742(31178)&iwloc=A&hl=en\"> mufon case (31178) map </A>","Latitude":"35.021752","trends":["There have been 2 other sightings in Cowpens","There were no other sightings in Cowpens on or around September 6th 2010"],"Object Features":"Patterned Surface, Appendage(s), Other","Case Number":"31178","Weather Factors":"None","Disposition":"Unknown","City":"Cowpens","Summary":"Craft approached our vehicle, halted just above trees lining the highway and reversed course to follow. we stopped in a field to observe object the raced up and away toward several other objects.","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"08/26/2011 03:56 UTC","Object Shape":"Cross, Oval, Sphere"}