{"Source":"MUFON","City":"Vancouver","Date of the Event":"08/20/2011 01:30 UTC","Viewing Distance":"Unknown","Longitude":"-122.559785","Disposition":"IFO","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Object Flight Path":"Path then hovering","Tags":"City","Date Submitted":"08/26/2011 03:29 UTC","Log Number":"US-08262011-0007","Region":"Washington","Latitude":"45.654724","Summary":"Blue green red white lights flashing star-like objects","Weather Factors":"Unknown","Case Number":"31177","divs":["sighting detailson 8\\20 at 1:30am i went outside to have a cigarette. to the east over my fence i saw a star-like object with flashing colors. i thought it was an airplane, and watched it for awhile. it wasn't moving very far or fast as a plane would. after observing it for 1 hour it ascended slowly and moved south over my neighbors house. at that point it stopped and proceeded to move across the sky with the rest of the stars. two hours and fifteen minutes later a second object appeared where i originally saw the first one. it was fainter and more green and blue than red like the first one. it followed the exact trajectory as the first one, and stopped exactly in the same place. by this time the first one had moved some distance with the stars but both were still visible. i observed them through binoculars and the lights were plainly visible pulsing in reds greens yellows and blues. i kept watching them fascinated, and sometime later moving lights appeared near the first one. they moved like satellites, but two of them disappeared after a very short distance. one light appeared by the second one later, appearing and disappearing 3 times. i have gone out every night since and witnessed the same phenomenon every night, and seen as many as three at one time (one in straight line flight). oddly, they appear where normal stars appear (big dipper etc) and the next night they are usually somewhere else."],"trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around August 20th 2011"],"files":["/var/www/straped/mufon/html2text/31177.html.txt","/var/www/straped/mufon/org/31177.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.654724,+-122.559785(31177)&iwloc=A&hl=en\"> mufon case (31177) map </A>"}