{"Object Flight Path":"Undisclosed","Country":"United States","Log Number":"US-08262011-0004","Object Features":"Unknown","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/31174.html.txt","/var/www/straped/mufon/org/31174.html"],"City":"Los Angeles","Viewing Distance":"Unknown","Date Submitted":"08/26/2011 01:16 UTC","Longitude":"-118.445657","Tags":"City","Case Number":"31174","Disposition":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"01/17/1994 10:00 UTC","Summary":"I observed a group of lights, in formation, that took off, together at a sharp angle and disappeared in an instant.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.154912,+-118.445657(31174)&iwloc=A&hl=en\"> mufon case (31174) map </A>","divs":["Sighting DetailsThe event took place on the evening following the Northridge earthquake, January 17, 1994 -- approximately 10PM, but it was so long ago, I cannot remember the exact time. Our home was damaged and we (my husband, my mother, myself, and our dog)were in our car, parked across from our home in Sherman Oaks. We were on the west side of the street. My mother (in the back seat) and my husband (front seat -- driver's side) were asleep. I was sitting in the front passenger seat, with my dog (small poodle) sitting on my lap. I was facing south. I saw a group of lights in the sky. They were not sacttered, but in formation. They were at a southwest direction from where I was. There was no sound or apparent movement until they took off, in an instant, at a sharp angle, and disappeared. Until that occurred, they remained in formation. My sense was that they were observing the devastation below -- the aftermath of the earthquake. They were not helicopters, as far as I could tell. And helicopters could not take off at the angle that they did and all at once, as this happened."],"Weather Factors":"Unknown","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around January 17th 1994"],"Latitude":"34.154912","Region":"California"}