{"Case Number":"31186","City":"Brentwood","Disposition":"Unknown","Object Shape":"Boomerang","Region":"California","divs":["sighting detailsriding bikes through neighborhood down breakwater way to minnesota avenue\\carmel parkway intersection at approximately 8:35 - 8:37 pm on 8\\21\\11. in glancing up to the north\\east, two unusual objects were clearly visible resting in the night sky. each object was about a half a hand outstretched and a hand apart. the formation on the left had two large white lights - which looked almost like a car headlights to an invisible car. the object to the right looked something like the pleiades but upon standing stationary and staring, there were white dots of lights grouped in a boomerang shape. both objects seemed to have a shape blending with the dark night sky to which the lights were attached. the two-light object on the left had brighter lights than the one on the right. the lights were white or whitish blue. the lights did not blink. the objects made no detectible sound. both objects appeared to be still but upon closer observation were moving in tandem off to the north\\east. while trying to follow the trajectory of the objects on bike and upon crossing the intersection, the objects were suddenly no longer visible. if the objects were aircraft they would have still been quite visible from a farther distance but it appears as though they vanished from the night sky. there was a lot of air traffic during this evening but these objects looked absolutely nothing like air traffic and appeared quite large. no air traffic appeared to be nearby these objects."],"Tags":"City","files":["/var/www/straped/mufon/html2text/31186.html.txt","/var/www/straped/mufon/more/31186_submitter_file1__UFOBrentwood8.21.11835pm.png","/var/www/straped/mufon/org/31186.html"],"Date Submitted":"08/26/2011 01:22 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.942725,+-121.717485(31186)&iwloc=A&hl=en\"> mufon case (31186) map </A>","Summary":"Two objects in tandem over Brentwood, Contra Costa, CA - Aug 21 8:35 pm PST","Date of the Event":"08/21/2011 08:35 UTC","Object Flight Path":"Hovering then path","Object Features":"Unknown","trends":["There have been 5 other sightings in Brentwood","There were no other sightings in Brentwood on or around August 21st 2011","This sighting has been favorited 1 time.",""],"Sighting Duration":"00:03:00","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Latitude":"37.942725","Log Number":"US-08262011-0013","Source":"MUFON","Longitude":"-121.717485"}