{"map":"<A HREF = \"http://maps.google.com/maps?q=44.844506,+-69.408406(31198)&iwloc=A&hl=en\"> mufon case (31198) map </A>","Sighting Duration":"00:15:00","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31198.html.txt","/var/www/straped/mufon/org/31198.html"],"City":"Palmyra","Country":"United States","Weather Factors":"Unknown","Log Number":"US-08262011-0025","Date of the Event":"08/26/2011 09:15 UTC","Longitude":"-69.408406","Viewing Distance":"Over One Mile","trends":["There have been 3 other sightings in Palmyra","There were no other sightings in Palmyra on or around August 26th 2011"],"Date Submitted":"08/26/2011 10:08 UTC","Object Features":"Unknown","Disposition":"Unresolved","Latitude":"44.844506","Tags":"City","Case Number":"31198","Summary":"I am still seeing more objects in my back yard.","divs":["Sighting DetailsTonight we saw more of the star like objects, two were flying south, and one was flying north. But this time was a little more unusual, after the last object went out of sight this rotating craft just appeared out in the eastern part of the sky. We would say it was rotating by the light sequence, it was blinking with out a pattern. There was one solid red light on the craft and you could tell it was rotating around the craft. The other light colors were white and blue. This rotating craft was chasing the star like objects we would say by the way it was moving. It appeared out of no where and made no noise what so ever. Also while I was writing this to you my nephew was out looking in the sky and saw two more rotating crafts and he also saw a very large bright light appear right above the trees and zoom across the sky at a rapid rate of speed. He said that the light appeared right above the trees and just take off. Like I said before why are they picking my back yard to play around in? We are starting to get alarmed. Not knowing what something is, is a very un easy feeling. It seems like every night something more seems to happen. We have tried a digital camera to capture these events and nothing would show up. But they do sometimes respond to my flash light. I know this sounds crazy but I took my mag light and flashed it up in the sky 3 quick times and more star like objects took off. Almost like they responded to my flashes. We just do not know what to do."],"Object Shape":"Sphere, Star-like","Object Flight Path":"Hovering then path","Region":"Maine"}