{"map":"<A HREF = \"http://maps.google.com/maps?q=36.16976,+-86.780543(31192)&iwloc=A&hl=en\"> mufon case (31192) map </A>","Summary":"Digital pic taken from moving car= teardrop shape over power lines & that night about 40 miles away 2nd pic of possible same object.","Region":"Tennessee","Source":"MUFON","divs":["sighting detailsjune 23, 2011 -while visiting relatives in nashville, tn, we went to the parthenon replica in centennial park. after leaving the parthenon, i shot a digital photo from the passenger's seat. i did not notice anything unusual until i looked at the photo on my laptop. to the right, over the power lines, there is a grayish\\blackish teardrop shaped object, that fades out on one end. that same night, about 40 miles away, in portland, tn, i was shooting digital photos outside, at night. (i had been taking photos every night, trying to capture anything paranormal, as the area has a lot of civil war history. incidentally, i did get a lot of orbs on camera and possibly 2 apparitions, as well as a video of a chair moving, inside the octagon hall civil war museum.) anyway, again i didn't notice anything unusual with my eyes. when i looked at the photos on the laptop, i saw an object that could possibly be the same object photographed earlier, from a different angle. i am uploading both photos and am very interested in what you think they could be. thanks."],"City":"Nashville","Object Shape":"Other","Longitude":"-86.780543","Log Number":"US-08262011-0019","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around June 23rd 2011","This sighting has never been favorited.",""],"Case Number":"31192","Date Submitted":"08/26/2011 03:31 UTC","Country":"United States","Disposition":"Insufficient Data","Object Flight Path":"Unknown","Latitude":"36.16976","Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/31192.html.txt","/var/www/straped/mufon/more/31192_submitter_file1__100_4707.JPG","/var/www/straped/mufon/more/31192_submitter_file2__100_4710.JPG","/var/www/straped/mufon/org/31192.html"],"Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"06/23/2011 12:00 UTC"}