{"Object Features":"Unknown","Latitude":"41.02046","Country":"United States","divs":["Sighting DetailsI was sitting with my girlfriend in my front yard overlooking the largest corn field on the edge of Ottumwa. We were facing the east and the night was clear with no moon. We were stargazing and noticed a light seem to appear out of nowhere and it was moving right at a slow pace. It was bright like an orb of light. About 3 times brighter than Jupiter which was also in our field of view. It seemed more like a spotlight at first. When it was moving the light was dimming until we could barely see it until it was gone. This lasted about 12 seconds and it moved about 10 inches in the sky before it was gone. As soon as it wasn't visible, another one appeared in the exact same spot that the first one appeared. It was like an exact replay of the first event. Very bright at first and faded the same way on the same path. EXACTLY the same as the first. No sound and no colors of light except bright white. This isn't the first time we have viewed white orbs of light in the sky in our area. This summer we have witnessed over 20 in our area. This was the most convincing one. With my girlfriend included I have I have 6 witnesses to these spheres of bright white light. Alot of them fade out when directly overhead or when I signal them with a bright flashlight."],"Longitude":"-92.406763","Summary":"2 bright lights forming from nowhere and fading out in exact same path one after the other.","Case Number":"31191","Disposition":"IFO","Log Number":"US-08262011-0018","Tags":"City","Date Submitted":"08/26/2011 03:17 UTC","files":["/var/www/straped/mufon/html2text/31191.html.txt","/var/www/straped/mufon/org/31191.html"],"Object Shape":"Sphere","Date of the Event":"08/21/2011 11:20 UTC","Region":"Iowa","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.02046,+-92.406763(31191)&iwloc=A&hl=en\"> mufon case (31191) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Ottumwa","trends":["There have been 8 other sightings in Ottumwa","There were no other sightings in Ottumwa on or around August 21st 2011"],"Object Flight Path":"Straight-line path","Viewing Distance":"Unknown"}