{"Source":"MUFON","Country":"United States","Object Features":"Unknown","divs":["Sighting Detailsstanding on the patio I notice a large triangular formation of lights traveling from 110 degrees east to 270 degrees west at an alarmingly slow rate of speed. over the coarse of one minute I watched the vehicle travel across my back yard at at impossibly slow speed for a typical aircraft. The vehicle was silent as it passed by under the clouds until it was nearly out of site. At that time i could hear a faint roar. A plane this size flying this low would have been extremely loud and most likely would have been heard coming and going. The object had three distinct sets of lights which seemed to be on three corners of the craft. All three sets of lights were in pattern as such below and flashed in a back and forth pattern with a slight curve to them as if the traced around a rounded corner. .............. .............. I would say the lights would resemble the red lights on the front of the Night Rider Firebird a.k.a Kit. However these light were much longer and and as mentioned above white and red. I know this was not a conventional airplane. It just didn't add up. I can assure you my husband and I are very curious as to what this was and would loved to know if there were any other sightings in the area on the date in question. We have found some evidence of a UFO around the same time in Laredo Texas."],"Log Number":"US-08262011-0020","Case Number":"31193","Disposition":"Unknown","Viewing Distance":"Unknown","Longitude":"-97.55039","City":"Manor","Object Flight Path":"Straight-line path","Summary":"triangle three sets of light all sets red and white","Date Submitted":"08/26/2011 03:49 UTC","Tags":"City","Latitude":"30.353618","files":["/var/www/straped/mufon/html2text/31193.html.txt","/var/www/straped/mufon/org/31193.html"],"Weather Factors":"Unknown","Object Shape":"Boomerang, Triangle","Sighting Duration":"00:01:00","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.353618,+-97.55039(31193)&iwloc=A&hl=en\"> mufon case (31193) map </A>","trends":["There has been one other sighting in Manor","There were no other sightings in Manor on or around August 25th 2011"],"Date of the Event":"08/25/2011 09:00 UTC"}