{"files":["/var/www/straped/mufon/html2text/31206.html.txt","/var/www/straped/mufon/org/31206.html"],"Viewing Distance":"Unknown","Date Submitted":"08/27/2011 03:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.555973,+-97.1429(31206)&iwloc=A&hl=en\"> mufon case (31206) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-08272011-0003","City":"Waco","Disposition":"Unknown","Longitude":"-97.1429","Tags":"City","Weather Factors":"Does Not Apply","Region":"Texas","Latitude":"31.555973","trends":["There have been 16 other sightings in Waco","There were no other sightings in Waco on or around August 26th 2011"],"Country":"United States","Object Shape":"Unknown","Source":"MUFON","Object Features":"Unknown","Case Number":"31206","Object Flight Path":"Path with directional change","Date of the Event":"08/26/2011 11:30 UTC","divs":["Sighting DetailsApproximately 11:30pm, while sitting in reclining lounger on porch, at home, surfing on iPhone while occasionally glancing up for periods hoping to catch a meteor, I looked up to see a normal aircraft about 70 degrees eastward, heading from a NE to S direction. I then noticed a large (perhaps twice, maybe three times size of passing original aircraft),totally silent object \"floating\" to the right of the plane. The distance from the aircraft was maybe two outward held \"fist- lengths\" from the plane. Initially I thought \"Whoa, really large bright satellite pass!\", but immediately realizing that it was too late in evening to view any passes. And it was larger than the ISS. Object path was, for lack of better word, \" meandering\". I then tried to justify object being an airplane, and again, quickly dismissed the thought due to the following: it had absolutely no sound. There were no airplane lights - the white illumination was steady, no fluctuation at all. And even if one considered that my view could have been from odd angle, the largeness of object dictated that I would have had to see the airplane strobe. It was floating uncannily slow, in no particular flight path and was not blimp-shaped. In fact. would be hesitant to actually assign a shape. While watching it wander so impossibly slow and while trying to make up my mind what I was looking at, I saw some faint led-like red flashes randomly coming from object. These faint red strobes occurred several random times, as I watched. While I watched it move in a slow, irregular flight path, in a northerly direction, I turned on the iPhone camera but was unable to capture image. I thought, \"well heck, it's moving so slow, I'll run in the house and grab the binoculars\", which were just a few feet from the back door. However, returning back to the porch, the object was absolutely gone. This was not possible, given rate of speed and direction heading, it absolutely could not have travelled from my field of view. I am very confident of this fact. I thouroughly scanned the sky, then ran to thru the house out the front door, in order to view the eastern and northern horizon ( central Texas horizon - no obstructed horizon view) the night was clear, no haze. On this kind of evening I'm able to easily view up to 2.6 mag. and a bit fainter satellites. However after scrutinizing every inch of sky, even looking through binoculars, even veiwing whar i knew to be stars & planets; I kept thinking that I would see it fading to a faint point into the distance. Illogically, the object had completely vanished from the sky. Lest the investigator thinks otherwise, I spend countless hours viewing sattilite passes, studying the night sky, and watching for meteors. So, I am not quick to jump to conclusions concerning objects that I see: I am not going to mistake Jupiter ( it had not even risen yet), or a sattilite flare for a \" flying saucer\". This object was impressive and may well have been a new military creation, but it certainly was not following any of the rules with which I am familiar."],"Summary":"Exceedingly slow large object. Lit white, and faint slow and random led-like red blinks"}