{"Object Features":"None","Country":"United States","Latitude":"45.530722","City":"Portland","Weather Factors":"Unknown","Summary":"i went to take dogs outside and saw beautiful lights in sky! ufo?","files":["/var/www/straped/mufon/html2text/31207.html.txt","/var/www/straped/mufon/org/31207.html"],"Object Flight Path":"Straight-line path","Disposition":"IFO","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around August 26th 2011"],"divs":["Sighting DetailsSo I went to let my dogs outside, it was at 11:10 pm on friday august 26 th. The temperature was 77 degrees. I had a flashlight looking to make sure there were no raccoons in back yard before I let dogs out. The sky was perfectly clear you could see tons of stars. Just as I stepped outside a brilliant bright light shot over head. The only way I could think to describe it is a rainbow colored fireworks being shot sideways. Then it kind of shot from west to east and I dont know, kind of fizzled out? But made a popping sound when it did. Maybe 5 minutes or so later there was a plane around not sure they saw it. So thinking somehow it was a firework I decided to search twitter to see if anyone was talking about it. I found 2 people who also saw it at same time in different locations than me. Im in Portland oregon and one was in Gresham and the other in Eugene. Either of those areas are close. So fireworks theory gone. Maybe weather related? But like I said perfectly clear skies 77 degrees with humidity of like 50% I think it said? Anyway it was beautiful light show no matter what?"],"Longitude":"-122.670707","Case Number":"31207","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Source":"MUFON","Date of the Event":"08/26/2011 11:10 UTC","Date Submitted":"08/27/2011 03:35 UTC","Region":"Oregon","Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=45.530722,+-122.670707(31207)&iwloc=A&hl=en\"> mufon case (31207) map </A>","Log Number":"US-08272011-0004","Tags":"City"}