{"trends":["There have been no other sightings in João Monlevade","This sighting has never been favorited."],"Date Submitted":"08/27/2011 11:29 UTC","Log Number":"BR-08272011-0011","Summary":"peacefull, astonishing, very shy, control over fog / mist","map":"<A HREF = \"http://maps.google.com/maps?q=-19.811872,+-43.187787(31218)&iwloc=A&hl=en\"> mufon case (31218) map </A>","Case Number":"31218","Object Flight Path":"Stationary","Disposition":"Unresolved","Region":"Minas Gerais","Source":"MUFON","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/31218.html.txt","/var/www/straped/mufon/org/31218.html"],"divs":["Sighting DetailsDear Sirs, As the daylight ended, I heard several noises from different directions around my home, in the area struck by unforeseen rainfall in Teresopolis on January 12th, 2011, thus the sighting ocurred a bit more than a month after the climatic event. I was scared to death as I though there was a group of looters preparing an attack, and I was alone. I shouted out that there was nothing valuable to be taken. Later on I came to know there were military. They obviously knew about the event and were preparing the site for what seemed to me to be a \"party\"!! I prayed and accepted my death was soon coming by the hands of looters. But as the full moon rose, they, the visitors, became more visible. It was the most beatiful sighting I ever had. I could not count them, maybe more than one hundred beings were playing and swinging on the pine trees on my land. I felt extremely honoured to host an \"alien party\" on my plot of land. There were beings of different sizes and forms, but most were of human-like forms. At a certain moment, one of them descended in a bright ball of light at something between 10 and 20 meters of my kitchen window, and stood upright in front of two men dressed in military uniforms. I guess the were communicating (or trying to) by telepathy. They stood there for something between 30 to 60 mins. The whole district was still out of electric power, added to this, the event itself makes a human being distort the notion of time. There were soldiers very well disguised in a bush in front of my kitchen window, I asked them if I could go outside, if that would affect my physical integrity or disturn the ongoing event... not a sound ... I then dared to go outside and sit on a rock 5 meters from my kitchen door, I noticed they became shy and froze their swinging in the trees. I chanted the mantra OM, which was told to me as being the sound of the Universe and one of God's names, they bacame a little less shy and resumed their swinging in the trees. I felt I should go back in, as I did not want to disturb the \"party\", which carried on for several hours. I felt safe, and extremely honoured to host this event, I just didn't like it that the military did not contact me, but this seems to be their normal procedure... The following morning there were a few (about 4 or 5) military trying to wipe away any possible trace the visitors might have left, but one cannot glue a broken tree... The event (\"party\") repeated the next night, just as beatifull as the previous night... Yours sincerely, P."],"Latitude":"-19.811872","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet","Sighting Duration":"Undisclosed","Longitude":"-43.187787","Date of the Event":"02/18/2011 12:00 UTC","Tags":"City","Weather Factors":"Unknown","City":"JoÃƒÂ£o Monlevade","Object Features":"Undisclosed","Country":"Brazil"}