{"Weather Factors":"None","Latitude":"32.974847","City":"Haslet","Source":"MUFON","Case Number":"31211","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date Submitted":"08/27/2011 05:29 UTC","Region":"Texas","files":["/var/www/straped/mufon/html2text/31211.html.txt","/var/www/straped/mufon/org/31211.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.974847,+-97.347796(31211)&iwloc=A&hl=en\"> mufon case (31211) map </A>","Disposition":"Unknown","trends":["There has been one other sighting in Haslet","There were no other sightings in Haslet on or around August 27th 2011"],"Tags":"City","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","divs":["Sighting DetailsI'm at home staying up late as usual when I look through the open shutters of my living room to notice a flying red light about half a mile away. It was hovering over a neighbors farm. They have dozens of cows in my small Texas city and my home is surrounded by them from the west, NW, N, and NE. For about two seconds I thought it was a plane or a helicopter but I quickly noticed that it was silent. I live near many small airports so I know exactly what a plane, helicopter, even chinooks sound like. My neighborhood is very quiet. It is not fully developed and we have tons of empty lots so we're not a big group. I instantly go into a mode that I've never been in before and I document the time to 2am. It is extremely dark in my town at night. We are away from the big cities so it was very hard for me to see the shape of the object. I could only make out the lights. There were a few colors flashing but sometimes there would only be a red light, not flashing, just still and in the shape of a line. I watched this object for 10 minutes before I grabbed my binoculars and then for 35 more minutes. Sometimes a house would be in the way, but it would always rise back up. It flew pretty low. If I saw a plane flying that low I'd expect it to crash. I was just very freaked out by the flight pattern. It would sometimes fly straight up or straight down or stay still or fly away or fly straight towards my way, but it would change patterns quickly. For the most part, it was circling in the air about 2-3 miles away, very near the local airport. I wish I was good at figuring out how large it was or how high it was and I also wish that I could've gotten a better look at the shape of the object. Even with my binoculars, it was difficult to see. I could only make out its lights because they were so easily noticed. The object did not disappear or give off any light explosions when it went away. It just simply went away. It started moving East till I could no longer see it. About 20 minutes later I hear a helicopter fly over and I saw a plane flying at the appropriate altitude and the usual flight pattern. So, that really confirmed that I did not see an airplane or helicopter and I'm definitely considering buying night vision binoculars."],"Object Shape":"Unknown","Country":"United States","Longitude":"-97.347796","Summary":"I noticed a stationary light, maybe 1/2 mile from home, in the sky above one of the local farms.","Log Number":"US-08272011-0008","Sighting Duration":"Undisclosed","Date of the Event":"08/27/2011 02:00 UTC"}