{"Case Number":"31216","Longitude":"-107.323616","City":"Glenwood Springs","files":["/var/www/straped/mufon/html2text/31216.html.txt","/var/www/straped/mufon/org/31216.html"],"Object Features":"Dome","Region":"Colorado","Date Submitted":"08/27/2011 08:17 UTC","Date of the Event":"08/24/2011 12:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.556868,+-107.323616(31216)&iwloc=A&hl=en\"> mufon case (31216) map </A>","divs":["Sighting DetailsAugust 24th 2011 saw a strange cloud in the sky when looking at other surrounding clouds, this strange cloud formation resembled that of a streak (much like a jet trail) but was not dissipating merely hanging in the sky. I kept my eye on the cloud as i was heading to work this was aprox. 12:35 pm. when out from the corner of a larger cloud formation i saw a white object move very rapidly behind a cliff obstructing my view. my first thoughts were \"possibly a plane or big bird\" but no bird could be that big and no plane could be that small. i kept my eyes on the sky hoping to catch a second glance when i rounded the cliff, to my suprise the object made an abrupt U turn and headed back the way it came. I could make out much of the shape and details, it is as follows. partially white, partially metallic ( it was reflecting in the sun) no wings, no props, no emission and no sound. the object was somewhat of a circle maybe egg shaped but not quite as drastic. it made very straight flight patters save for the U turn, it was moving at a very considerable pace, but was easy to track. i followed the object in the sky, all the while driving which was reckless but i couldn't take my eyes off of it. the object seemed to wax and wane almost disappearing in broad daylight then it quickly went behind the cloud it emerged from and did not resurface on the other side, it was gone. I later talked with a friend of mine who was tell me about his job as a grounds keeper in aspen glen (a gated community near carbondale). he said while he was working, the lightning alarm sensors (used to alert the avid golfers to move from the course due to lighting strikes) were all triggered at aprox. 12:30. he made the remark that not a cloud in the sky looked even dark and it was a beautiful day. I then shared my sighting with him and he was astonished."],"trends":["There have been 4 other sightings in Glenwood Springs","There were no other sightings in Glenwood Springs on or around August 24th 2011"],"Log Number":"US-08272011-0013","Disposition":"Insufficient Data","Country":"United States","Source":"MUFON","Latitude":"39.556868","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Tags":"City","Summary":"A small white/sliver object glided from behind a strange cloud formation, before pulling a U turn and gliding back to the cloud it came from behind. Object was a spherical almost oval shape, with no wings, propellers, rutters, no emission, and no sound","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Oval, Sphere","Viewing Distance":"101-500 Feet"}