{"Log Number":"US-08272011-0021","Weather Factors":"Unknown","Latitude":"43.498428","Date of the Event":"08/26/2011 11:05 UTC","City":"Idaho Falls","Region":"Idaho","map":"<A HREF = \"http://maps.google.com/maps?q=43.498428,+-111.991812(31229)&iwloc=A&hl=en\"> mufon case (31229) map </A>","Tags":"City","trends":["There have been 8 other sightings in Idaho Falls","There was one other sighting in Idaho Falls on or around August 26th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change","Case Number":"31229","Country":"United States","Summary":"Clearly saw unusual, unbelieveable night sky objects","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Longitude":"-111.991812","Source":"MUFON","Object Features":"Unknown","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/31229.html.txt","/var/www/straped/mufon/more/31229_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/31229.html"],"Date Submitted":"08/27/2011 10:18 UTC","divs":["Sighting DetailsLast night (aug 26, about 11pm Idaho Falls, Idaho) I was outside on the chaise lounge trying to cool off, and enjoying stargazing, when a movement caught eye almost directly above my head, I did a double take and tried to wrap my brain around what I was seeing. At first I thought it was some huge, grey bird, then realized that unless it was a Jurassic Park resident it wasn't a bird. It was silently gliding in a straight line from north to south, completely silent, and I had no way of judging how high it was, how large it was, or what it was. It was a pale grey, triangle shaped something, that slightly blending into the sky but had obvious hard outlines, and was moving at at amazing speed. I followed it until it just disappeared after a few seconds. I still didn't have a clue what I'd seen, but knew it was something that was not from our airport,(that shuts down at 7pm) or a lost flock of birds or early migrating geese, (all of which I am familiar with. )It was almost like a mirage that was blending (but not succeeding) into the sky. It had no undulations, just a line along the wings like a straight edge.I didn't waver, or move up and down, or jerk. It was like it had faded in, glided silently and very quickly above me, then faded out or moved out of sight. I ran into the house and called for my adult son to some outside, I'd just seen a UFO (by that time in my mind, I HAD) He laughed and I almost had to pull him out. He followed me out (with a remark about senility) and we stood and looked up for a few minutes. I was pretty sure it was gone. Suddenly I heard him say, \"what the f**k is that!) and he was pointing up and in the same direction I had seen it. It was coming back about the same direction (a bit different trajectile) and was as clear as when I'd seen it before. He was freaking out and repeating what he'd said before. My son and I saw others (or the same one, circling) about 6 more times over the space of about 45 minutes. I finally went in the house because I thought they were gone. My son went back outside later and saw it once more. I didn't see it again and went to bed. He came in later and said that he thought it was birds because he'd seen some birds flying above the streetlight and they were close and he thought that might have been what we saw, only flying higher. That is absolutely NOT what we saw. It was surreal,strange, beautiful, and not anything I could identify with as anything else. It wasn't airplanes or birds, or weather balloons or atmospheric anomalies ! I've seen all those things in all conditions for 65 years and I know when I see what I see. In my mind it was either one craft coming back several times or several crafts following each other. The first ones I saw were smaller (or higher) than the next ones. The 6th and last one I saw was larger than the others, it veered sharply to the right and out of sight, but on that one I saw very clearly several large, round, but dim lights under each wing. The 'whatever they were's' blocked the stars as they passed in front of them. What did I see? I have no idea. I'd like to believe they were Alien in origin, but have no idea. Could there be a simple,worldly explaination? Of course, but whatever they were, it was breathtaking, frightening, and awsomely wonderful. I truly think I saw something special, and alien. We are a few miles from INEL, so maybe they keep an eye on it? Government stuff? Who knows. I made a picture of the best way I can remember it looked. Still so frazzled by it I probably have forgotten details that I wish I could remember better. I just talked to my daughter who lives about a mile from me, and she and her entire family saw it, almost identical story (it was too late to call me she thought, and was afraid I'd think she was crazy)Now we are all freakin'out!"]}