{"Date Submitted":"08/27/2011 06:30 UTC","divs":["Sighting DetailsAugust 27th, 2011 at 11:40 pm I went outside to smoke a cigarette and looked up at stars. A movement caught my eye and I saw a flying object pass over my house it was moving quite fast but i could clearly see a grey boomerang shaped craft with dim lights along the \"wings\". I called for my husband (the window was open)he came running outside, along with both my teenage daughters. I was really freaked and they did not believe me... then another one passed by and they almost peed there pants! They all saw! We were all stupefied, we kept watching and we saw 3 more in a half hours time. It was like a fleet, they were all going in the same direction. They were Very big and 3 to 4 hundred feet up in the sky, they made no sound, they were all greyish- not transparent but not dark solid either, they had dim lights along the edges and they moved in a flat straight path, they moved very fast,we could only see them for about 30 seconds once they appeared (out of nowhere)then they were out of sight. We all KNEW what we were seeing we talked about birds, but My husband is a life long bird watcher and hunter- he dispatched that notion quick. Birds don't fly that high and be seen,especially at night. they don't have lights and visible solid space between them, they fly with the wind current and you can see them moving up and down and their wings flapping. These crafts were all flying steady and straight- no fluctuating. No way they were a planes or helicopters- no flashing lights- no sounds and they just did not even slightly resemble planes or helicopters! If you were to witness what we saw, there would be NO doubt in your minds that we witnessed a UFO..."],"Object Features":"Other","City":"Idaho Falls","Summary":"It was like there were a fleet of them, i saw 5 go directly over my house about 5 min apart. they were grey almost translucent with dim lights. wedge shaped almost like bird formation but you could see that they were solid between the lights. big","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/31224.html.txt","/var/www/straped/mufon/org/31224.html"],"Longitude":"-112.014604","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Case Number":"31224","Latitude":"43.522605","Disposition":"IFO","Date of the Event":"08/27/2011 11:40 UTC","Region":"Idaho","trends":["There have been 8 other sightings in Idaho Falls","There was one other sighting in Idaho Falls on or around August 27th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.522605,+-112.014604(31224)&iwloc=A&hl=en\"> mufon case (31224) map </A>","Viewing Distance":"101-500 Feet","Tags":"City","Object Shape":"Boomerang","Source":"MUFON","Log Number":"US-08272011-0016"}