{"Weather Factors":"Unknown","Region":"Michigan","Sighting Duration":"Undisclosed","Object Shape":"Cylinder, Oval","Tags":"City","Date of the Event":"08/20/2011 09:00 UTC","Case Number":"31226","divs":["Sighting DetailsWe were driving home from a friends cottage near Otisville, Mi around 9:00pm on Aug. 20, 2011. It was dark outside since we were in the country driving home. We looked up in the sky and noticed a group of lights up in the sky which were reddish orange in color. There were about 12-15 of these objects all in a staight line and then the line started to descend. At first we thought they were a group of balloons up there tethered to a wire, but they were all so straight and then they descended downward. They were not moving. They were steady. We continued driving toward them and trying to figure out what they were. We opened up the window and listened, but heard nothing. We kept observing them, but there was no change. We were not sure what they were up in the sky. Another couple were following us in their car and later on we followed them home and asked them if they noticed the objects in the sky and they said that they did. We all remarked \"what were they?\" None of us had any idea of what they could have been. We all said that they must have been UFO's. It was the strangest sight any of us had ever seen."],"Disposition":"IFO","Latitude":"43.172367","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.172367,+-83.515398(31226)&iwloc=A&hl=en\"> mufon case (31226) map </A>","Longitude":"-83.515398","Object Flight Path":"Stationary,Path with directional change","Log Number":"US-08272011-0018","files":["/var/www/straped/mufon/html2text/31226.html.txt","/var/www/straped/mufon/org/31226.html"],"trends":["There has been one other sighting in Otisville","There were no other sightings in Otisville on or around August 20th 2011"],"Country":"United States","Summary":"They were round in shape and were reddish-orange in color.","Date Submitted":"08/27/2011 09:25 UTC","City":"Otisville","Viewing Distance":"101-500 Feet"}