{"Source":"MUFON","Weather Factors":"None","Tags":"City","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/31221.html.txt","/var/www/straped/mufon/org/31221.html"],"Case Number":"31221","Date Submitted":"08/27/2011 04:20 UTC","Date of the Event":"08/17/2011 04:30 UTC","City":"Undisclosed","Longitude":"-74.402531","Latitude":"40.062774","Viewing Distance":"21-100 Feet, 101-500 Feet","Log Number":"US-08272011-0013","Object Shape":"Triangle","Disposition":"Unknown","Object Features":"Other, Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWe were pulling a horse trailer west bound on I80. Saw what I thought was an airplane with it's lights on flying very low and headed directly toward us. WE were comming up a hill and the lights were about 1-2 miles in the distance and just above the hill we were climbing, it almost looked like a very bright street light right on top of the hill we were driving except it was too bright and a little to high to be a street light. As we got closer it became apparent that it was moving too slowly to be an airplane. As we got closer we saw that is was large triangular shaped craft drifting over the road way from southwest toward northeast. It made no noise and it had 2 green pulsating lights on either side that did not appear to be attached to the craft. The lights looked to be about 10 feet off to each side. It had bright lights pointing forward attached to the forward point of the triangle and lights along the back line of the triangle. I slowed down to about 5-10 MPH and passed directly under the craft as it drifted over the road, I then pulled to the shoulder and watched it disappear behind the tree tops. It looked to be 200-300 feet high and became out of sight when it passed over the trees along the edge of the roadway. There were other vehicles on the road that had to see it but we were the only ones to slow down and pull over to the side to get a better look."],"trends":[],"Object Flight Path":"Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.062774,+-74.402531(31221)&iwloc=A&hl=en\"> mufon case (31221) map </A>","Country":"United States","Summary":"saw lights pointing east above I80 northern NJ. large hovering triganle over road as we drove under it."}