{"Object Flight Path":"Path with directional change","Country":"Germany","trends":["There have been 5 other sightings in Berlin","There were no other sightings in Berlin on or around August 27th 2011"],"Weather Factors":"Unknown","Longitude":"13.32241","Source":"MUFON","Viewing Distance":"101-500 Feet","Date of the Event":"08/27/2011 12:00 UTC","Object Shape":"Circle, Disc","Date Submitted":"08/27/2011 02:21 UTC","Object Features":"Louvres","Disposition":"Unresolved","Tags":"City","divs":["Sighting DetailsRiverside parkway in non-residential area in western district, unobstructed skies with relatively low treeline, complete panoramic view from open field. Multiple (5) witnesses, not acquaintances, also seen object. We two watching stars & meteors and also spotting satelites too. Completely clear, warm night and absolutely no wind, even breeze on the river. Spotted object as emerged from treeline on the east, keeping level altitude low, only few hundred feet and travelling to dead west in straight line. Object flew slowly almost rotating until directly in front of us in center of view but acelerating ever faster and changing direction toward NW again in straight line and again to dead north. Object became blurry over horizon after 20-25 seconds and began to rise and fade. No noise at all, no lights. Looked almost white but in the dark. Seemed like changing shape from below but clearly disc shape from side with small central tip underside. All five witnesses nervous and some nervously laugh but we two saw immediately and could not explain what we saw and so watched as much as possible. Not balloon! No wind tongiht, very warm and still summer night, object accelerated and kept low from one horizon to another."],"Sighting Duration":"00:00:30","Case Number":"31220","Latitude":"52.524385","Log Number":"DE-08272011-0013","Summary":"Dark disc-like object completely silent, flying low changing course & acelerating","map":"<A HREF = \"http://maps.google.com/maps?q=52.524385,+13.32241(31220)&iwloc=A&hl=en\"> mufon case (31220) map </A>","City":"Berlin","files":["/var/www/straped/mufon/html2text/31220.html.txt","/var/www/straped/mufon/org/31220.html"],"Region":"Berlin"}