{"Log Number":"US-08282011-0005","Country":"United States","Date Submitted":"08/28/2011 02:29 UTC","Longitude":"-83.229873","City":"Auburn Hills","Date of the Event":"06/30/1988 10:30 UTC","trends":["There have been 3 other sightings in Auburn Hills","There were no other sightings in Auburn Hills on or around June 30th 1988","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=42.694932,+-83.229873(31239)&iwloc=A&hl=en\"> mufon case (31239) map </A>","Object Shape":"Star-like","Sighting Duration":"00:00:30","Region":"Michigan","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Summary":"Satellite does u-turn, then shoots off at angle and disappears","Object Features":"None","Disposition":"Unknown","divs":["sighting detailsa friend and i were watching the detroit freedom festival fireworks in 1988. this took place on june 30th and lasted about 35minutes, starting at 10:06pm ( link removed to investgator field cms 08\\28\\11 05:13 cst flg). we were parked on a stretch of road in auburn hills that offers a view of downtown detroit approx 20-25 miles in the distance. there were maybe a dozen other cars parked there to watch. unfortunately it was just too far to really enjoy it. my friend got bored and started looking skyward at the cloudless, starry sky. he pointed out a satellite passing by from west to east. the satellite was directly overhead and unmistakable - no flashing, solid white point moving across the sky at an altitude that could have been a low earth orbit. after watching it only a few seconds, it did a u-turn without any change in velocity, and started heading back west. after only a couple of seconds heading back west it shot off in a se direction (aprox a 120 degree change of direction) and disappeared in an instant. my friend and i looked at each other and confirmed that we just saw the same thing. we were both very knowledgable in science (i was studying physics at the time) and we knew what we saw was not within the realm of possibility as we were familiar with it. we were both calm, and we didn't draw any attention to ourselves. as far as we knew, nobody else saw it as they were fixated on downtown detroit. about 15-20 minutes later i brought it up to my friend. by that time his rational, scientific mind had convinced him that he did not see what we thought we saw. mine probably would have too, had my friend not seen what i had just seen and confirmed it at the time of the sighting."],"Tags":"City","files":["/var/www/straped/mufon/html2text/31239.html.txt","/var/www/straped/mufon/more/31239_submitter_file1__path.jpg","/var/www/straped/mufon/org/31239.html"],"Source":"MUFON","Latitude":"42.694932","Case Number":"31239"}