{"Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.348059","Tags":"City","Longitude":"-80.156062","Date Submitted":"08/27/2011 11:30 UTC","City":"Bridgeville","map":"<A HREF = \"http://maps.google.com/maps?q=40.348059,+-80.156062(31232)&iwloc=A&hl=en\"> mufon case (31232) map </A>","Log Number":"US-08272011-0024","trends":["There have been no other sightings in Bridgeville","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Region":"Pennsylvania","Weather Factors":"Unknown","Date of the Event":"08/27/2011 10:30 UTC","Summary":"2 Erratic Red lights","Case Number":"31232","Object Shape":"Sphere","Object Flight Path":"Straight-line path,Other","files":["/var/www/straped/mufon/html2text/31232.html.txt","/var/www/straped/mufon/org/31232.html"],"Disposition":"Unknown","divs":["Sighting DetailsWife went out back for a cigarette, seconds later called me outside. Was a bright red light light in the sky moving slowly in a southerly direction. The light was quite brilliant initially, looked diffused - fuzzy around the edges. The luminosity faded as it move across the horizon, so I am assuming it was moving away from us. The path remained a fairly straight line, however the key thing that was unusual was it appeared to be stuttering up and down quite alot as it moved along. At this point it was viewable to us for about a minute until the light passed beyond view behind a large oak, after atleast a minute it appears on the other side. Looked smaller, still travelling the same general speed. About half-way through the viewable space between the tree and the neighboring set of townhouses, it simply vanished. As we were starting our, \"that was weird\" conversation - another similar light appeared back over to the far left - completely out of nowhere - perhaps a bit higher on the horizon as the other - and began to move in the same direction, with the same behavior. I jumped into the house to grab my phone to take some video. I was able to follow the object with my camera for about 30-45 seconds before it again moved behind the tree. I went out on the walk to walk around the tree to try to spot it and follow with the camera, but this time it was already gone. The video is very poor, it was simply too dark. The most you can see is a very small light from the object moving slowly across the sky. We hung around for another 10-15 minutes or so, but nothing else showed. We've lived here for a number of years and have become accustomed to seeing alot of lights in the sky - landings at PIT. This was moving in completely wrong direction, for either an arrival or departure. The light was totally different from anything we've ever seen. There is occasional helicopter traffic in the area, usually during the day, however for the size of the light and relative proximity - we would've heard the rotors if it was one."],"Source":"MUFON","Object Features":"Unknown","Country":"United States"}