{"Date of the Event":"08/27/2011 08:30 UTC","Object Flight Path":"Unknown","Tags":"City","Sighting Duration":"00:09:09","trends":["There have been no other sightings in Ferry Pass","This sighting has never been favorited."],"Log Number":"US-08272011-0022","Object Features":"Unknown","Disposition":"Hoax","divs":["Sighting DetailsMy friend called me, I did not witness this myself. She said she and her husband saw 3 yellow orange fiery glowing orbs near the Davis Highway Interstate 10 exchange in Pensacola. She said one looked like it was over my house Which is Near Olive Road and Davis Highway. They were driving Towards downtown. I do not know what street they were on when they saw this. They were both shocked. She wonders if it was hot air balloons, but I think that at that time of night, it's doubtful. I don't think she or her husband want to be public themselves with any official reports, for good reason. Anyway, they said they saw thm, and were trying to get a better look but had to stop watching and concentrate on driving. She called me shortly thereafter, about 8:36 pm and I ran out and didnt ' see anything, and I walked my neighborhood to get better views of the horizons and sky. All I saw was a shooting star. So whatever the orbs were, they were gone. My friend and her husband are not given to flights of fancy and do not believe in UFO's. SO they think it was a hot air balloons or something like that. They would not invent this, neither are that type. They are serious minded, well grounded, and not into the ufo stuff at all. So if they said they saw it? They did! I hope someone can explain what it was, like maybe there actually were some type of fiery yellow orange balloons floating around then."],"Source":"MUFON","Longitude":"-87.207715","Viewing Distance":"Unknown","Object Shape":"Circle, Sphere","Region":"Florida","files":["/var/www/straped/mufon/html2text/31230.html.txt","/var/www/straped/mufon/org/31230.html"],"Country":"United States","Latitude":"30.532763","map":"<A HREF = \"http://maps.google.com/maps?q=30.532763,+-87.207715(31230)&iwloc=A&hl=en\"> mufon case (31230) map </A>","Weather Factors":"Unknown","Summary":"3 yellow orange fiery orbs.","City":"Ferry Pass","Case Number":"31230","Date Submitted":"08/27/2011 10:59 UTC"}