{"Disposition":"IFO","Date of the Event":"08/27/2011 08:40 UTC","Tags":"City","Source":"MUFON","divs":["Sighting DetailsI was driving home with my wife. We were southbound at the intersection of 244th street and 400th ave in Enumclaw Wa. To the east I saw the lights of two commercial airliners and I looked in their direction. As I looked I saw several UFO lights in the sky at about the same elevation as the airliners but appearing much smaller and closer. I stopped to watch them. I thought that they were very much out of place for the time of day. I was 8:40 at night and was about 75% dark. I thought if they were ultralight aircraft in a club they were flying too late because it was too dark. They had the appearance of being balloons with lights of some type attached to them. I thought that they must be floating on the prevailing local air currents. They were much dimmer than the airplane lights. Five or six of the lights were at 30 degrees at that time and they were in a random pattern. As I watched five more ascended in an arc pattern. Meanwhile the lights which had first appeared had risen higher and faded out. The lights in the arc ascended more. Then I saw, against a nearby mountain, three more lights ascend below the ones in the arc. These lights were between myself and the nearby mountain which I judge to be no more than five miles away. All the lights continued to ascend and travel southwest, and they all faded out when they got to about the 80 degree point. While we watched I telephoned a friend who lives close to where we were. She watched them for awhile from her window."],"Sighting Duration":"00:30:00","Summary":"13 lights seperately ascended from 10 degrees against nearby mountainside and all faded out when they reachedI 80 degrees","Latitude":"47.212938","Date Submitted":"08/28/2011 01:07 UTC","Object Shape":"Star-like","Country":"United States","Case Number":"31236","files":["/var/www/straped/mufon/html2text/31236.html.txt","/var/www/straped/mufon/org/31236.html"],"Object Flight Path":"Straight-line path","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.212938,+-121.9841(31236)&iwloc=A&hl=en\"> mufon case (31236) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-08282011-0002","Weather Factors":"Unknown","Longitude":"-121.9841","Region":"Washington","trends":["There have been 4 other sightings in Enumclaw","There were no other sightings in Enumclaw on or around August 27th 2011","This sighting has never been favorited.",""],"City":"Enumclaw"}