{"Viewing Distance":"101-500 Feet","Tags":"City","divs":["Sighting DetailsI have been observing for approximately the last month, and half, Triangular objects that I have seen ascend, follow straight flight, and descend then appear to change to circular glow that continued to ascend below line of sight. I have observed these triangular objects with binoculars, but I cannot make out a appearance except for the triangular position of the lights, the object at times appear to be transparent in nature, while observing these objects there is a humming, or buzzing like sound in the vicinity. Over the last month, and half of observation of these objects I have felt as if there is a presence in the area, the light is white, blue in nature and at times appear to pulsate randomly, and at other times seem to keep timing perfectly. When these triangular lights are moving they seem to glide along, but they move as if you were watching someone accelerate, and decelerate in sync power surges, I have noticed a pattern of activity with these objects as well, during the beginning of week(Sunday, Monday, Tuesday, Wednesday) They are much more active, and I have observed the objects much more during these nights, with a decline in the remaining days in the week(Thursday, Friday, Saturday). I also went online during these sighting having wireless internet sitting outside observing, and have brought up live radar in the area showing all commercial airliners in the area that is in real time, and during these sightings there are nothing within 100 miles. These objects leave no contrail, I also attempted to record the objects on one occasion with electronic camera, and just prior to the sighting that I was going to record approximately nine thirty pm central time I had approximately twenty minutes prior placed new batteries in the camera, and proceeded with a test run with the camera showing full charge. At the time of the sighting of this object I tried to record only finding my batteries had no power upon trying to record the object in question. A family member was witness to this event, and other family, friends, and local law enforcement have witnessed these objects as I had pointed them out to several people in parking lot of local store. These objects fly appear to be 50-100ft in size, and appear about size of golf ball. I have noticed on several occasions on nights that these objects are more active, I physically feel drained, and have noticed almost feeling of warmth when observing these objects at times. As for the cylinder shaped white glowing object I have only seen these three times in the area, but these have made me nervous at the time due to them appearing to be standing on end in the air with a diameter of approximately 5 ft, and height of approximately 12 ft, these objects I have seen appear in the horizon with my field of vision at approximately 25 degrees out of thin air, then ascend, and then begin to follow at flight path above the area only to disappear after slowly moving across the sky at approximately 20mph these cylinder object have been approximately within 150 ft of a family member, and I at one sighting, the other two sightings within 500-1000ft. I had followed them only to watch them just slowly fade out of sight, as if you were turning the burner down on the stove. I felt the most impacted as these came within a zone of comfort, my family member on the other hand did not feel bothered by the event but more interested than anything. Since the start of witnessing the triangular lighted objects, and cylinder shaped objects, I have noticed while just observing the areas sky at angle of horizon to approximately 45 degrees line of sight I keep witnessing what appears to be just quick streaks or flashes of light that last fractions of a second. Also just to note one of the local law enforcement officers in the area tried to record lights around the same time last year on his dash camera, but when he went to play back what he had recorded at the station it was complete static, with no apparent reason. I also have trouble with cell phone wanting to function properly when observing these objects, I continue to see these objects everynight, and will continue to update, and I will eventually get hold of high resolution recorder, and submit video. Ive tried to take video on cell phone several times but my phone will not even pick up bright stars"],"Source":"MUFON","Log Number":"US-08282011-0010","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"08/28/2011 04:41 UTC","Date of the Event":"08/28/2011 02:10 UTC","trends":["There have been no other sightings in Akron","This sighting has been favorited 1 time."],"Country":"United States","Case Number":"31244","files":["/var/www/straped/mufon/html2text/31244.html.txt","/var/www/straped/mufon/org/31244.html"],"Region":"Iowa","Longitude":"-96.551128","Weather Factors":"Unknown","City":"Akron","Disposition":"Insufficient Data","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=42.830414,+-96.551128(31244)&iwloc=A&hl=en\"> mufon case (31244) map </A>","Object Shape":"Cylinder, Flash, Triangle","Latitude":"42.830414","Summary":"four different descripstions: Triangular lights, cylinder glowing object, circular glow dissapearing, flashes of light"}