{"Country":"United States","Case Number":"31245","Longitude":"-122.763516","Log Number":"US-08282011-0011","Latitude":"45.437309","Source":"MUFON","divs":["Sighting DetailsMyself, my girlfriend and an Iraqi Veteran (who has seen stealth bombers in action) were together at night under some trees when I first noticed something flying over us slightly to our right (we were facing east, so it came from NE....possibly Hillsboro airport?). This was shortly after the airshow so it could have been a stealth bomber with some new mode that our neighbor didn't know about, but he said it wasn't a stealth bomber or fighter. It had almost a cloudy effect to it, but this could be due to the only illumination was from the ambient light below. It seemed to bank to go SSE as it crossed the little road we were on and it continued straight in a very fluid motion until it faded out of sight. It was a clear night and as it banked I could clearly see it looked like a boomerang with 2 side winglets, like if you could imagine a boomerang with the front flattened, so it's main width was flat and then it had side portions angling back. I shone a very narrow beam powerful flashlight at it and it didn't hit it (normally has about a 100 yard range), so it was higher than the treetops but was probably under 1000 feet. We all agree on that, due to the ambient light hitting it. It was huge!!! was the other conclusion. We couldn't be accurate as there was nothing to compare it against. Also we don't know if that was it's accurate shape as it could have had a portion that didn't reflect ambient light and it was too short a time period to notice how any stars were blocked. What was odd is that my girlfriend and I had seen another UFO a week before (orange circular shape around 9PM with no sound) in the same spot. We found others have seen this one and a photo exists on another website....so we weren't the only ones to see that one. We thought the orange one could have been a hoax, but this flying wing was definitely not a hoax. I suspect it was a military stealth experiment. The strange part was the lack of any sound whatsoever."],"Object Features":"Wings","Disposition":"Unknown","Summary":"Looked like some kind of military flying wing but it had no sound.","Sighting Duration":"00:00:30","map":"<A HREF = \"http://maps.google.com/maps?q=45.437309,+-122.763516(31245)&iwloc=A&hl=en\"> mufon case (31245) map </A>","Date of the Event":"08/23/2011 10:45 UTC","City":"Tigard","Object Shape":"Boomerang","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Date Submitted":"08/28/2011 05:14 UTC","Region":"Oregon","files":["/var/www/straped/mufon/html2text/31245.html.txt","/var/www/straped/mufon/org/31245.html"],"trends":["There have been 11 other sightings in Tigard","There were no other sightings in Tigard on or around August 23rd 2011"]}