{"Summary":"This object appeared after uploading a video of the strange ruble noise that we have been hearing in St. Pete Fl.","Viewing Distance":"Unknown","Log Number":"US-08282011-0013","Case Number":"31248","map":"<A HREF = \"http://maps.google.com/maps?q=27.800552,+-82.657484(31248)&iwloc=A&hl=en\"> mufon case (31248) map </A>","Object Features":"None","Tags":"City","Object Flight Path":"Undisclosed","Latitude":"27.800552","Object Shape":"Unknown","divs":["Sighting DetailsBeginning on August 23,2011, my family and I (among many other people) have been hearing that same loud rumble in the sky that is being reported all over the globe. It is an incredibly loud rumble in the sky that roars for about 2 minutes in duration and eventually fades away. On August 23,2011, we were sitting in our living room, watching tv when we heard it again. We heard it between 7 or 8 times beginning around 7:30 pm(approx.) After not being able to figure out what the noise was, I did some online research. The exact same noise was heard at the Rays baseball game, here in St. Pete the night before. (The video of this incident is available online). This noise continued again on Wednesday, August 24,2011. My husband, 12 year-old son and I stepped outside in the hope that we could capture the sound on his cell phone. After uploading the video to my computer, I then noticed the orb or light that appears from behind the trees to the left. This light darts in and out of the clouds and behind the tree which lead me to believe that this is NOT part of the camera-along with the fact that it does not appear until the phone is pointed toward the sky. Pleas note that we were not searching for unusual lights in the sky but simply trying to capture the sound of the very strange rumbling that we had been hearing,therefore,I did not see this with my own eyes as I was looking all around me, but only noticed on the video afterward. As far as the rumbling goes, I heard it one last time on Thursday August 25,2011 and an hour after that, I heard what can only be described as a very loud,vibrating hum (which was also about 1-2 mins in duration). I have heard nothing since."],"trends":["There have been 35 other sightings in St Petersburg","There was one other sighting in St Petersburg on or around August 24th 2011","This sighting has never been favorited.",""],"Country":"United States","Disposition":"Unknown","Weather Factors":"None","Date Submitted":"08/28/2011 01:09 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31248.html.txt","/var/www/straped/mufon/org/31248.html"],"Longitude":"-82.657484","Region":"Florida","City":"St Petersburg","Sighting Duration":"00:01:00","Date of the Event":"08/24/2011 07:45 UTC"}