{"Weather Factors":"Unknown","Object Shape":"Other","Source":"MUFON","Date Submitted":"08/28/2011 06:22 UTC","Object Features":"None","Case Number":"31253","Region":"California","Date of the Event":"08/27/2011 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Atwater","There was one other sighting in Atwater on or around August 27th 2011","This sighting has never been favorited.",""],"Country":"United States","Log Number":"US-08282011-0018","Summary":"Appeared to be only light, changing colors fluidly between red, gold, green, amber, and also changing shape constantly while moving erratically. Completely silent.","divs":["sighting detailsi was sitting in my cousin's back yard, speaking with a friend of mine when i noticed what appeared to be a bright red firework descending in the sky just above the edge of a fence. i immediately interrupted myself and asked my friend what it was. he stood, turned around and looked to where i had motioned. about this time, the falling red light diverted course drastically and began ascending and descending back and forth in rapid succession, all the while continuously changing color and shape. the colors varied, first red, then gold and green and possibly even blue. the object transitioned from one color to another with absolute fluidity. it went from falling and looking like it had a tail, to taking the form of a sphere before changing shape several more times to various shapes that are hard to describe. it then took a much more conventional and deliberate path west over the ca-99 freeway. the entire sighting lasted approximately 15 seconds. the object began to leave my field of vision due to obstruction. at this time i ran around the front of his house where i saw neighbors gathered outside who had also just witnessed the event. at this point i tried to regain sight of the object, but did not see it again. i have never seen anything like it before and it was completely inaudible. i could not make out a definite shape for the object, which seemed to be.....simply light. the lights did not seem to be placed on a craft, the light seemed to be the craft itself. just after pointing out the object to my friend and noticing it's erratic behavior, i pulled out my cell phone to record the object. i was only able to get mere seconds of the object, which was traveling west and away from us and had stopped changing shape\\color by the time i began filming. i have no idea what it was and my friend and i are absolutely certain it was not a conventional aircraft."],"Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/31253.html.txt","/var/www/straped/mufon/org/31253.html"],"City":"Atwater","Disposition":"Unresolved","Longitude":"-120.610958","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Latitude":"37.360425","map":"<A HREF = \"http://maps.google.com/maps?q=37.360425,+-120.610958(31253)&iwloc=A&hl=en\"> mufon case (31253) map </A>"}