{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.178763,+-78.68211(31257)&iwloc=A&hl=en\"> mufon case (31257) map </A>","Disposition":"Unresolved","Object Shape":"Circle, Disc, Fireball, Sphere, Star-like, Unknown","files":["/var/www/straped/mufon/html2text/31257.html.txt","/var/www/straped/mufon/org/31257.html"],"Region":"New York","Source":"MUFON","Object Flight Path":"Path with directional change","Tags":"City","trends":["There have been 13 other sightings in Lockport","There was one other sighting in Lockport on or around August 27th 2011"],"Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-08282011-0022","Latitude":"43.178763","City":"Lockport","Longitude":"-78.68211","Date Submitted":"08/28/2011 07:59 UTC","Date of the Event":"08/27/2011 08:50 UTC","divs":["Sighting DetailsI was in the backyard near Lockport, NY at about 8:50 P.M. on Saturday August 27, 2011 when someone drew my attention to a single bright, yellow, unwavering light in the sky, to the north, that was larger than the background stars and was traveling east to west. The sky was cloud free and the weather was calm. It was then followed by up to 20 or 25 more items of the same type, all of which appeared to travel together in a line from east to west where they seemed to vanish in the distance. They were extremely interesting in the way they looked and the way they traveled. They did not travel in a distinct formation, but appeared to be in a loose traveling group moving along fairly quickly. They appeared to hover, slow down, speed up, and change direction at will, all while traveling in an east to west line. The event lasted about 5 to 10 minutes. They are unlike anything I've ever seen in the sky, night or day, at any previous time. They did not appear to be a group of airplanes or a meteor shower. I felt amazed then, and do now, and I can't wait to hear the explanation of the event because I'm sure I'll learn something new and interesting, whether the explanation involves the weather, the military, or whatever."],"Object Features":"Unknown","Summary":"20 to 25 bright, yellow, unwavering lights traveled together in a line in the sky to the north from east to west at about 8:50 pm 08-27-11.","Sighting Duration":"Undisclosed","Case Number":"31257","Country":"United States"}