{"Tags":"City","Viewing Distance":"101-500 Feet","Region":"New York","Log Number":"US-08292011-0005","Disposition":"IFO","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Other","City":"Pelham Manor","Source":"MUFON","Object Features":"Patterned Surface, Wings","Longitude":"-73.809213","Latitude":"40.894655","trends":["There have been 2 other sightings in Pelham Manor","There were no other sightings in Pelham Manor on or around May 15th 2011"],"Summary":"Faux-airplane- Hovered, disappeared, reappeared","Sighting Duration":"00:10:00","Object Shape":"Triangle","Date Submitted":"08/29/2011 03:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.894655,+-73.809213(31268)&iwloc=A&hl=en\"> mufon case (31268) map </A>","files":["/var/www/straped/mufon/html2text/31268.html.txt","/var/www/straped/mufon/org/31268.html"],"Case Number":"31268","divs":["Sighting DetailsI always observe the skies. On this night there was a perfectly clear sky. I saw a object hovering in the sky and thought it must be a traffic helicopter. I forgot about it, I was enroute to a dunkin donuts a short ride away. So there on my way at a red light here and again, I kept seeing this object in the sky? And I wondered how I was able to keep seeing it thinking I had changed direction in driving.. Yet there it was. So at one particular area in Pelham Manor, NY facing the Bronx- I was a traffic light and it was interestingly a very, very long red light. So at this light you could see out and over to the Bronx.. and now I could see 2 hovering objects and thought.. okay there must be an accident on one of the highways or parkways? So, I thought to myself again 'eh no big deal' but then it happened. One hovering object (both were 'white' lighted) was on my left, the other one was straight ahead and I was looking at it waiting for the red light to turn.. This is the crazy part and I laugh when I think about it.. This object that I had convinced myself was a helicopter.. \"jumped\" forward in the sky.. like a 'leap' and it had lept about half the distance between where the object was and where I was so it was much closer now.. So I leaned my head forward and said a few curse words like 'wtf' did I just see? I put my car in park, opened the door and stood up then the lights went off.. but I could see its shape still in the sky but its lights were off and it passed directly over my head.. lights off and I looked directly up at it.. Here is the description.. It was a trinagle and it had shapes and designs on it.. it looked like a plane (which shocked me because that meant something like a plane was hovering?) Much later on I wondered if the object was able to change shapes ie., helicpoter, airplane? sounds crazy.. anyway one of the triangle's tips was where the cockpit of a plane would be and the other two tips came out like the wings.. then there was a long extension coming out of the back of the trinagle as if to mimic the shape of a long plane with a tail like an airplane had.. As it went over my head I saw it put the lights back on.. It was the craziest and weirdest thing I have ever seen with my own two eyes in my whole life! Don't know what to think of it at all. And I just continued on to get my coffee. If interested I will draw a sketch... I didn't have my cellphone on this night.. of course?"],"Date of the Event":"05/15/2011 12:00 UTC","Country":"United States"}