{"City":"Darrington","Tags":"City","Longitude":"-121.628409","Viewing Distance":"Over One Mile","Object Features":"Unknown","Latitude":"48.279101","Sighting Duration":"Undisclosed","Country":"United States","Region":"Washington","Source":"MUFON","Date of the Event":"08/28/2011 09:11 UTC","Log Number":"US-08292011-0006","Object Flight Path":"Straight-line path,Other","trends":["There has been one other sighting in Darrington","There were no other sightings in Darrington on or around August 28th 2011"],"Object Shape":"Circle, Star-like","Weather Factors":"Unknown","divs":["sighting detailswe have seen this same light 3 times in the last 2 weeks. all three times we have seen this light it came up from the same place to the west of us, the first two times the light came straight up and then took off moving north east, then tonight it came up and traveled south east. the light is an orange\\white color and is very bright and solid, there are no flashing lights on it just a solid bright the entire time. it will move from side to side quickly while it is moving. i finally got my video camera out this time and we got it on tape for a few seconds, but i don't have any way to put the video on my computer. the first two times we saw it there were about 8 or 9 people here and tonight there were 4 of us that saw it. we see planes and jets fly over all the time, but this is nothing like any of us have seen, also it has never made any noise. tonight there looked like an airplane was flying above it moving in the opposite direction, but the plane must have been flying higher than the object because the plane kept going and then right after that the light just went out like it always does."],"Case Number":"31269","files":["/var/www/straped/mufon/html2text/31269.html.txt","/var/www/straped/mufon/org/31269.html"],"Summary":"Bright Moving Light","map":"<A HREF = \"http://maps.google.com/maps?q=48.279101,+-121.628409(31269)&iwloc=A&hl=en\"> mufon case (31269) map </A>","Date Submitted":"08/29/2011 05:01 UTC","Disposition":"Unknown"}