{"files":["/var/www/straped/mufon/html2text/31261.html.txt","/var/www/straped/mufon/org/31261.html"],"Weather Factors":"Unknown","Date Submitted":"08/28/2011 10:40 UTC","City":"Leland","divs":["Sighting DetailsI was walking my dog in the field across the street from my home. I always take my night vision goggles with me to look at the stars when it's a clear night. I'm looking up maybe 80*, when I see what I think is a satellite, you can see them sometimes when sun light reflects off them. They appear to be a star, but moving, NOT a meteor, NOT a plane. Just moving high up, in their orbit. This was VERY High, I didn't hear anything, it was moving from North to South, stopped, This was when it really got my attention, since satellites do not stop!!! It turned right 90* then moved a little, then did another 90* turn almost in an instant!! It was then moving in a South to North heading. It began picking up speed, then accelerated so fast, It had to be going thousands of MPH, NO plane could have done this, that fast. I could not see this with the naked eye, only with the night vision goggles. This happened at 10:10pm EST. Over East North Carolina. Wilmington area. WAS NOT A PLANE, NOT A SATELLITE, NOT A METEOR. I was in the ARMY, a SCOUT, I've never seen something like this before. It was an object, under control, stopped, turned 90*, twice, then put on speed like something in the movies. When I first noticed it, I thought it was a satellite, like I see often, then when it stopped, turned, turned again, in such a way, 90*, then pick up speed like a rocket engine, even more, soooo fast, then it was out of sight."],"Object Shape":"Unknown","Longitude":"-78.074356","Sighting Duration":"00:00:20","Latitude":"34.265657","Object Flight Path":"Path with directional change","Region":"North Carolina","Date of the Event":"08/28/2011 10:10 UTC","Country":"United States","Log Number":"US-08282011-0026","Summary":"Light, path, stop quickly, turned 90*, turned another 90*, picked up speed, then accelerated to probably thousands of MPH, like nothing I've ever seen,","Viewing Distance":"Over One Mile","Source":"MUFON","Disposition":"Unknown","Case Number":"31261","map":"<A HREF = \"http://maps.google.com/maps?q=34.265657,+-78.074356(31261)&iwloc=A&hl=en\"> mufon case (31261) map </A>","Tags":"City","Object Features":"Unknown","trends":["There have been no other sightings in Leland","This sighting has never been favorited."]}