{"Log Number":"US-08292011-0008","Summary":"four large red lights travelling east and silent. banked north while dropping elevation passed through mountain range followed by military jets.","Disposition":"Unknown","Viewing Distance":"Over One Mile","City":"Las Vegas","divs":["Sighting DetailsOn the night of March 13 2011 at approximately 11:30 pm at my house in northwest Las Vegas Nevada I opened my back door which faces due north to smoke a cigarette. I stood in my doorway as I usually do and lit my cigarette. After I lit it I took a drag and immediately saw four very large red lights to my left in the western sky. They were approximately 1-2 miles away, 500 feet high (about 40 degrees), pill size, slightly pulsating, completely silent and travelling west (from left to right). The four lights seemed to be seperate objects travelling like a snake, perfectly spaced apart, following one another, taking as much space in the sky as if you held up two pencils in your hands with your arms extended out. I immediately realized that ive never seen anything as big or as fast. I believed I was looking at four possible UFO's. They were moving so fast I knew I didnt have time to grab my phone to record it so I decided to just watch this amazing event. The objects banked left while dropping elevation and began heading north, passing through a small gap in a mountain range that is about 5 miles away that also goes from west to east. Immediately after the last red light was out of my sight, military jets came from the east and west, travelling side by side in pairs. About a dozen total. They were travelling very fast and were very loud flying back and forth as if they were looking for these objects. I saw the lights for about 10 seconds or so and the jets were in the sky for about 3 minutes and then flew off. I didnt notice any other aircraft while the lights were visible. I truely believe I saw four unidentified flying objects that were bigger and faster than any man made objects that were followed by many military jets that were looking for these objects. I believe the entire event took about 4 minutes."],"Case Number":"31271","Region":"Nevada","Latitude":"36.262985","Longitude":"-115.264967","Object Features":"Unknown","Object Flight Path":"Path with directional change","Object Shape":"Sphere","Sighting Duration":"00:04:00","Date Submitted":"08/29/2011 05:47 UTC","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around March 13th 2011"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.262985,+-115.264967(31271)&iwloc=A&hl=en\"> mufon case (31271) map </A>","Tags":"City","Date of the Event":"03/13/2011 11:30 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31271.html.txt","/var/www/straped/mufon/org/31271.html"],"Weather Factors":"Unknown"}