{"Case Number":"31273","Country":"Australia","Region":"Western Australia","Disposition":"Unresolved","trends":["There have been no other sightings in Kallaroo","This sighting has never been favorited."],"Summary":"two star like objects travelling together in formation at high speed","Log Number":"AU-08292011-0010","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/31273.html.txt","/var/www/straped/mufon/org/31273.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Latitude":"-31.789232","Weather Factors":"Unknown","Longitude":"115.741346","Sighting Duration":"00:05:10","Date of the Event":"08/29/2011 09:01 UTC","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=-31.789232,+115.741346(31273)&iwloc=A&hl=en\"> mufon case (31273) map </A>","Date Submitted":"08/29/2011 10:49 UTC","divs":["Sighting DetailsI was watching videos with my partner and my sister and decided to take a break and go outside for a cigarette. First noticed things were strange that there was no sound or wind at all outside, no bird noise or car noise. Then I look up to the sky towards the ocean (1.5 Kms from house) when I notice two bright lights travelling at high speed together in a northerly direction. This is when my heart started racing because the lights were brighter than any plane an the speed was faster than any plane as well. It was at this point after 5 seconds of viewing when the two objects suddenly did 180 degree turns at the same constant speed they had been travelling at before. The strange thing is that they seemed to make the turns in opposite directions, one up and one down. They disappeared behind some trees and thats when I yelled for my partner and sister to come out and have a look. My sister came out and we couldn't see anything, so I jumped up on my brick fence to get a view of the sky line from a higher elevation. This is probably 1 minute later after the first sighting. I then spotted them much closer together travelling really low in the same direction I had previously seen them travelling north. This means that they must have turned yet again while I was trying to track them again. This time they were travelling even faster and then they joined into one bright light and blinked out of existence. Whether they actually disappeared or just went behind some houses on the skyline that obscured my vision, I'm not sure. But after that I could not see them again."],"City":"Kallaroo","Tags":"City"}