{"Object Flight Path":"Straight-line path","Country":"United States","Date Submitted":"08/29/2011 09:21 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.114552,+-84.334861(31272)&iwloc=A&hl=en\"> mufon case (31272) map </A>","Region":"Florida","Longitude":"-84.334861","files":["/var/www/straped/mufon/html2text/31272.html.txt","/var/www/straped/mufon/org/31272.html"],"divs":["Sighting DetailsWas in the yard with the dog; rural area, good dark sky conditions. The sky was cloudless. Saw a very bright (est. -8 magnitude) light almost over-head in eastern sky. The light disappeared and then re-appeared 4 to 5 seconds later further north. It disappeared a second time for 8 to 10 seconds, and re-appeared again further north. It did not re-appear over the next five minutes. There were no noticeable airplanes in the area and no blinking lights, no sound. The light did not appear to be aircraft landing lights being turned on and off. It really appeared most like an iridium flare. I am quite familiar with them and have observed \"double flares\" on several occasions. The first light was easily a -8 magnitude, the second perhaps a -6, and the 3rd maybe a -3. I check Heavens-Above daily for satellite traffic and did not recall an iridium flare forecast for the date and time I observed this. I went back in the house and rechecked Heavens-Above. There were no iridium flares projected to occur here last evening at that time--and certainly no doubles. (I have not heard of any triples?) I further checked the web site for any other satellite traffic projected for that time last night and found nothing? Please note: this sighting is quite similar to 31265 from Georgia."],"Object Shape":"Unknown","Log Number":"US-08292011-0009","Object Features":"Undisclosed","Summary":"Very bright light similar to iridium flare; went out and came back on twice.","Latitude":"30.114552","Viewing Distance":"Unknown","Case Number":"31272","trends":["There have been no other sightings in Crawfordville","This sighting has never been favorited."],"City":"Crawfordville","Date of the Event":"08/28/2011 08:46 UTC","Disposition":"Hoax","Weather Factors":"Unknown","Tags":"City"}