{"Region":"Colorado","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Date of the Event":"08/28/2011 11:11 UTC","Summary":"object at high velocity changing directions rapidly","trends":["There have been 2 other sightings in Telluride","There were no other sightings in Telluride on or around August 28th 2011"],"Longitude":"-107.807165","map":"<A HREF = \"http://maps.google.com/maps?q=37.946474,+-107.807165(31281)&iwloc=A&hl=en\"> mufon case (31281) map </A>","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Disposition":"IFO","divs":["Sighting DetailsThere were 6 of us at the Masons building in Telluride Colorado at around 10:30 pm, August 28th 2011. We were looking up at the stars, waiting for shooting stars, and watching a lightening storm coming in from the west. We did see a few shooting stars and sheet lightening. We were sitting in a circle, and I was facing north. I saw what looked like a bright shooting star traverse the northern ridge of town. I mentioned it to the others, and we resumed staring at the sky. Then, suddenly, I saw what looked at first like a bright shooting star emerge over the same northern ridge. It was traveling at extremely high velocity. It then changed direction at almost 180 degrees, and flew over town, changing directions several times in its flight path. It then disappeared over the north eastern ridge. I couldn't articulate anything than \"Holy fuck\" over and over and over, whilst pointing and tracing its flight path. The others witnessed it too, but I was the only one who saw the rapidity of its change in direction. The distance the object covered and its pattern of flight matched nothing I have ever seen in my life. I was overcome with a sense that I have never felt before. The other people I was with saw the tail end of its flight, but not the entirety of the occurrence. There were 3 males and 3 females, including myself, who witnessed this event. 2 of 3 of the females began laughing. Directly after, I was shaking uncontrollably. My friends seemed less affected, but were still at a loss to explain what we had all seen. I couldn't sleep afterward. My world has been altered. The only way to describe this is that I asked (silently, mentally) to see something, and something was shown to me with others present to witness it too. Please contact me for any further details. Thank you."],"Country":"United States","files":["/var/www/straped/mufon/html2text/31281.html.txt","/var/www/straped/mufon/org/31281.html"],"Source":"MUFON","Log Number":"US-08292011-0018","Tags":"City","Case Number":"31281","City":"Telluride","Viewing Distance":"501 Feet - 1 Mile","Latitude":"37.946474","Object Features":"Unknown","Date Submitted":"08/29/2011 01:50 UTC"}