{"Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31282.html.txt","/var/www/straped/mufon/org/31282.html"],"Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Date of the Event":"02/28/2011 12:00 UTC","Tags":"City","Latitude":"33.166153","divs":["Sighting DetailsMy friend and I were driving back from Lubbock to Dallas. I took a wrong turn in Aspermont, Tx and went to Stamford, TX. When I realized my mistake we went north on highway 277 towards Haskell. About 1-2 miles south of Haskell my friend in the passenger seat said, \"Look!\". He was leaning forward looking upwards, overhead from my car. I looked up and saw a large aerial UFO going right over my vehicle from right to left (east to west). It was over the top of my car and I rolled down my window and slowed down to see what it was. It was then I realized there was no noise. The UFO was low enough to be coming in for a landing at a major airport above the end of the runway - less than 500 ft. it appeared. It was odd shaped, diamond generally with the points in front and back being longated. There were several lights as I recall - more like orbs - no flickering and they were greenish. The UFO continued on without hesitating and I continued to slow down and just watch as it got further and further away until it look like a dot, or star in the sky. There was nothing but farmland on both sides of us. We had not been drinking, smoking or anything else. We are businessmen making a business trip. Both of us are 55 years old. What shocked me the most was the silence. There is no way any type of craft that large, that close to the ground doesn't make noise and there was none. The craft didn't appear interested in us and even though the area is very remote it didn't seem to be concerned about being seen - it was very dark, craft and the night so we didn't see it until it was upon us."],"Longitude":"-99.729571","Case Number":"31282","Object Features":"Unknown","Date Submitted":"08/29/2011 02:17 UTC","City":"Haskell","Log Number":"US-08292011-0019","trends":["There has been one other sighting in Haskell","There were no other sightings in Haskell on or around February 28th 2011"],"Disposition":"Unknown","Weather Factors":"Unknown","Region":"Texas","Source":"MUFON","Object Shape":"Diamond","map":"<A HREF = \"http://maps.google.com/maps?q=33.166153,+-99.729571(31282)&iwloc=A&hl=en\"> mufon case (31282) map </A>","Summary":"Strange craft, no noise flew over us - size of passenger plane"}