{"Date of the Event":"08/24/2011 10:30 UTC","Longitude":"-93.618206","Log Number":"US-08292011-0026","Region":"Louisiana","Source":"MUFON","City":"Haughton","Tags":"City","Disposition":"Insufficient Data","Sighting Duration":"00:10:00","Object Shape":"Triangle","Latitude":"32.543175","trends":["There have been 5 other sightings in Haughton","There were no other sightings in Haughton on or around August 24th 2011"],"Weather Factors":"Unknown","Summary":"black triangle craft with bright points of light on each corner.","Case Number":"31289","map":"<A HREF = \"http://maps.google.com/maps?q=32.543175,+-93.618206(31289)&iwloc=A&hl=en\"> mufon case (31289) map </A>","Object Features":"Other","files":["/var/www/straped/mufon/html2text/31289.html.txt","/var/www/straped/mufon/org/31289.html"],"Object Flight Path":"Path with directional change,Path then hovering,Other","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Detailsmy wife an i had stepped outside to smoke a cigarette ,we were looking up as it was a clear night with a few high level clouds grey in color as we had been in a extended amount of 100 plus degree weather days we commented to each other it was cooler and the stars were clear tonight. just as I looked straight up asked my wife if she was seeing a triangular shaped craft , and she stated yes with lights on each corner and I said yep. the craft was what seemed to be around 5,000 feet up was moving south at a fairly low speed ,my wife turned off the porch light and we got a fantastic view of it,but waas soon blocked by the neighbors tree so we stepped out past our garage to better see it i told her to run get the oldest boy cause nobody is gonna belive what we were seeing she ran inside and i stayed out to keep a eye on it she soon returned and had a flashlight as its pitch dark outside our garage...so i grabbed the flashlight and aimed it at the craft and flashed it a few times real quick.....wow this thing spun around bout 45degrees and made a bright white flash, the wife commented to me dont do that again,I asked why cause she said I didnt know what i was messing with and i agreed as the craft started comming back the opposite way in our direction and i could tell my wife was upset and i said it would be fine,the craft seemed to lose some altitude during this event and its direction of travel was now north we continued to watch it and as it got past us made another turn and headed off in a westerly direction untill we could no longer see it.we both commented to each other seen it as no one would proabably belive us ."],"Country":"United States","Date Submitted":"08/29/2011 05:13 UTC"}