{"trends":["There have been no other sightings in McFarland","This sighting has never been favorited."],"divs":["Sighting Details My husband and I were night sky watching from the pavement of Famoso Raceway at 10:30pm, August 27th, 2011. The camp area was very dim and very quiet. Out of my peripheral view I caught a glimpse of movement up to my right. My 1st thought, geese... V-shaped, point in front, traveling straight at the speed of ,(my second thought) those strobe lights for events... However it was not connected to a ray of light nor did it have a tail. I distinctly recall the \"surface\" or the viewable mass to have \"v's\" almost like shoe treads, which I couldn't honestly say if it was surfaceS (plural) of many UFOs in formation or if it was a detailed pattern surface of a singular object. There were absolutely NO lights. It appeared to glow, or reflect soft, dull light, from its distinct v patterns, assumingly from the ground below it as it passed. It was quick, maybe 5-10 seconds and seen almost better peripherally. As it headed straight out in front of us, we quickly got adjusted to see the shape better defined hopefully...and it was just gone! We dont know if it turned directionally or just disappeared. Almost as if we looked at it dead on! and it was no longer viewable! The notion that We just saw something we weren't suppose to see. We stayed up discussing it a while and waiting for it's return...But had to sleep by 12:30am and nothing report worthy was noted."],"Log Number":"US-08292011-0027","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Case Number":"31290","Region":"California","Longitude":"-119.229275","Object Features":"Patterned Surface","City":"McFarland","map":"<A HREF = \"http://maps.google.com/maps?q=35.67801,+-119.229275(31290)&iwloc=A&hl=en\"> mufon case (31290) map </A>","files":["/var/www/straped/mufon/html2text/31290.html.txt","/var/www/straped/mufon/org/31290.html"],"Weather Factors":"None","Tags":"City","Object Flight Path":"Straight-line path","Date of the Event":"08/27/2011 10:30 UTC","Country":"United States","Viewing Distance":"101-500 Feet","Latitude":"35.67801","Date Submitted":"08/29/2011 06:26 UTC","Summary":"Caught in my peripheral appeared to be geese,no sound, no lights. then appeared to be a strobe light with no light rays..? almost translucent with a dull reflective surface.","Object Shape":"Triangle"}