{"Log Number":"US-08292011-0031","Summary":"driving home from work, saw something that shocked me","Source":"MUFON","Latitude":"38.881778","Tags":"City","Object Features":"Undisclosed","Object Shape":"Other","Country":"United States","Longitude":"-78.505843","trends":["There have been no other sightings in Woodstock","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.881778,+-78.505843(31297)&iwloc=A&hl=en\"> mufon case (31297) map </A>","City":"Woodstock","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"31297","Object Flight Path":"Undisclosed","Disposition":"Unresolved","Date Submitted":"08/29/2011 09:50 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/31297.html.txt","/var/www/straped/mufon/more/31297_submitter_file1__thing.png","/var/www/straped/mufon/org/31297.html"],"Date of the Event":"10/31/0001 12:00 UTC","Region":"Virginia","divs":["Sighting DetailsI can remember very clearly what I saw. Unfortunately, it has been a number of years since it happened and I cannot remember the exact date. I do know it was around Christmas or Thanksgiving of 2005, and may have been in January of 2006. It was a very cold night, I had finished work late, as always, and was driving home around midnight. The place I worked was in Woodstock, VA. On that particular night I decided to drive down Route 11 rather than take I-81 to Toms Brook where I lived at the time. As I was driving I noticed an extremely bright pulsating light in the sky. Somehow it was different from anything I had seen before, I almost went off the road while staring at it. I then pulled off the road so I could watch. It was then that I noticed another pulsating light moving with the first that I had seen. I realized then that it was not two objects that I was seeing, but one. The pulsating lights seemed to be at the ends of something very long. I noticed that it was extremely large. It would turn in the sky, and then move closer. It was very long and thin, I have no idea as to the actual dimensions of the object, all I know is that it was very large. The lights were red and blue, and they pulsed very fast. I finally managed to get back into the truck and continue driving home, but never stopped watching the thing out the window of the truck. When I got home I rushed inside and got my brother to come out on the deck and see it as well. There we observed several of them in the sky. Since that night I find that I am constantly looking up in the night sky looking for what I saw. I have seen airplane lights and I know it is not the same. They were so bright and pulsed very fast. I just want to know if someone else saw it, and if there has ever been an explanation. I have not spoken to many people about it, but I hope someone out there knows what it is."]}