{"Longitude":"-87.520487","trends":["There have been 4 other sightings in Dyer","There were no other sightings in Dyer on or around August 28th 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsFirst of all, I am the biggest UFO skeptic. I was driving north on St. John Road in Dyer Indiana at exactly 8:43 PM on August 28. I happened to just look at the sky (which was clear and without cloud cover) and looked around (south) and saw 8 huge orange balls floating in the sky. I stopped the car in disbelief and looked at them. I had the mindset to snap a few pictures. The orange balls seemed to be in a very constellation (with some distance between them) and move together west to east very slowly. I kept on snapping pictures. After 5 minutes or so of moving east, they faded out. I'm not sure if they were moving southeast and the fade was actually just the distance growing or actually faded out. I didn't have any idea what the balls could have been when I saw them. They were in a zig zag constellation and moving in the same pattern across the sky. The orange balls looked like halloween jack o lanterns in the sky. Thinking back my reaction is that they were balloons with candles attached, but these were huge, and moving in a precise movement together. Wind was not a factor for the globes. As you can see in the picture, there was a good deal of distance between the globes, so I ruled out a blimp, airplane, etc. They were NOT blinking. Solid orange until a fade out at the end that took about 5 seconds. Please email me, and let me know what you think."],"City":"Dyer","Log Number":"US-08292011-0032","Latitude":"41.500322","map":"<A HREF = \"http://maps.google.com/maps?q=41.500322,+-87.520487(31298)&iwloc=A&hl=en\"> mufon case (31298) map </A>","Country":"United States","Source":"MUFON","Region":"Indiana","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Case Number":"31298","Date Submitted":"08/29/2011 09:58 UTC","Object Shape":"Fireball, Sphere","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/31298.html.txt","/var/www/straped/mufon/more/31298_submitter_file1__photo.jpg","/var/www/straped/mufon/org/31298.html"],"Weather Factors":"Unknown","Tags":"City","Disposition":"Insufficient Data","Date of the Event":"08/28/2011 08:43 UTC","Summary":"8 orange balls over Dyer, Indiana"}