{"Disposition":"IFO","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"40.773635","Source":"MUFON","Country":"United States","Tags":"City","Region":"New York","Sighting Duration":"00:04:14","Date Submitted":"08/30/2011 01:48 UTC","Log Number":"US-08302011-0003","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/31307.html.txt","/var/www/straped/mufon/org/31307.html"],"City":"astoria","Date of the Event":"08/30/2011 01:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.773635,+-73.917233(31307)&iwloc=A&hl=en\"> mufon case (31307) map </A>","Longitude":"-73.917233","Summary":"LOOK UP NYC!!!!!!!!!","divs":["Sighting DetailsIf you guys want to film ufos you need to come to new york now. I have seen an increase of ufo activity in my area for the past three months. They are flying really low. There is a huge star like object in the sky that doesnt move but every since it started appearing so did the ufos. I have never in my entire life seen so many ufos my wife didnt believe and now she is a believer after only one sighting. I saw another one tonight it was flying really low and fast. It had a brown glow to it. It glowed in the dark but it wasnt like a star or anything i have ever seen. This thing was really low and in the shape of a sphere with a brown almost reddish glow but it was a really dark glow. Please come to nyc i will show you were to put the cameras to record. You are missing a lifetime oppertunity. I have checked on the nasa website the closet planet was mercury and it was not suppose to be visible by the naked eye. So what is this star that is about 15 percent the size of the moon. this thing is huge and no one is talking about it. it shows up in the sky after 1 am. please call me for any questions and you are more than welcome to come and record at my house. i will show you were i see them every night. My camera sucks i have tried recording but you cant see nothing. I have seen two ufos obsorb each other and then split moving up and down. Even glowing really bright like the size of a basketball in the sky. I can go on and on about how many sighting im seeing every night. please contact. I am very concerned for the safety of this country. These ufos are flying really low at high speeds. Ther are flying about 400 ft above the building and the building in queens are not high they are very low."],"Viewing Distance":"21-100 Feet, 101-500 Feet","trends":["There have been 2 other sightings in astoria","There were no other sightings in astoria on or around August 30th 2011"],"Case Number":"31307","Weather Factors":"Unknown","Object Shape":"Cylinder, Disc, Sphere, Star-like, Teardrop"}