{"map":"<A HREF = \"http://maps.google.com/maps?q=35.205693,+-97.447884(31309)&iwloc=A&hl=en\"> mufon case (31309) map </A>","trends":["There have been 22 other sightings in Norman","There were no other sightings in Norman on or around August 29th 2011"],"Sighting Duration":"Undisclosed","Date Submitted":"08/30/2011 05:17 UTC","Log Number":"US-08302011-0005","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-97.447884","Weather Factors":"Unknown","Latitude":"35.205693","Case Number":"31309","Tags":"City","Object Features":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/31309.html.txt","/var/www/straped/mufon/org/31309.html"],"Date of the Event":"08/29/2011 05:20 UTC","Viewing Distance":"Unknown","Summary":"UFOs disguised as stars and satellites abundant","Object Shape":"Disc, Star-like","divs":["Sighting DetailsI one day in the summer of 2011 began meditating on my roof and unintentionally began stargazing. I was with some friends and we began to notice that some of the stars were moving around in a zig zag pattern. The more we looked at them the more drastic the stars movement. Well suddenly more stars starting magically coming in from the horizon. We then knew they weren't stars. We watched them move and interact with our requests for hours and hours pausing every few moments to ask each other if this was really happening. Now we see these lights almost every night. However, it seems we have almost developed a relationship with these beings. Everyone always experiences similar feelings of warmth and joy and overall peacefulness. Really an amazing experience. There are now many many people in this area that have been shown these craft and everybody has had many different personal experiences. I myself along with others have seen the \"moving stars\" as I before mentioned, but also what appear to be satellites moving across the sky. However these \"satellites\" can stop motion in an instant and immediately change direction. Also what appear to be meteors shooting across the sky occur every so often while we try to make contact (often multiple craft manifest this way during this type of sighting). It is important to note that these sightings occur very often and happen right next to the University of Oklahoma campus. Anyone that is in the vicinity should keep an eye on the sky. We do not claim to know much about what happens, but we do know that it is very real and these intelligent craft are here for peaceful reasons and to communicate with us. I hope this can help some people out."],"Region":"Oklahoma","Disposition":"Unknown","City":"Norman"}