{"trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around August 29th 2011"],"Weather Factors":"Unknown","Summary":"Saw a star it went dim and faded out, called my gf, we both saw it reappear and get bright then fade back out, but farthur away from first sighting, In a straight line path, 0 clouds all stars were visible.","City":"Tucson","Region":"Arizona","Latitude":"32.215726","Viewing Distance":"Unknown","Tags":"City","Disposition":"Unknown","Log Number":"US-08292011-0035","files":["/var/www/straped/mufon/html2text/31301.html.txt","/var/www/straped/mufon/org/31301.html"],"Date Submitted":"08/29/2011 11:28 UTC","Object Shape":"Sphere","Longitude":"-110.762171","Object Flight Path":"Straight-line path","Object Features":"None","Case Number":"31301","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.215726,+-110.762171(31301)&iwloc=A&hl=en\"> mufon case (31301) map </A>","Date of the Event":"08/29/2011 08:00 UTC","Sighting Duration":"00:01:00","divs":["Sighting DetailsI was at home, appx 8:00 pm arizona time, I am a home renter and we have to smoke outside, I got up to go smoke in the backyard, I always look to the stars to see if its clear or cloudy, I happened to catch a star to my east direction brighter than normal, didnt think much of it, but it looked like a power surge, it got brighter then faded out to black, I called my girlfriend out who has very poor eyesight to say I just saw a wierd thing, then it reappeared and went from dim to very bright again, she actually saw it too and also told me she had seen something like that a week earlier but thought it was just her eye, I told her to grab my phone so I could video it, but it did not reappear, it was moving in a straight line somewhat north westerly, I am not crazy and I hope others saw it as well. other than fadeing in and out I didnt witness anything that made it unusual except it was brighter than any other star and it went black, we watched for several minutes more in the trajectory I would have imagined it would have traveled but nothing further.We both felt as if we had seen our first UFO together I am 41 years old and must say I was excited, and the fact that it was bright enough for her to see was great, she has very poor vision I am glad we both got to share this. I watched the trajectory of what I thought it would go but nothing. I am hoping others saw it as well and together we can all share in what we saw."],"Country":"United States"}