{"Region":"Indiana","Date Submitted":"08/30/2011 12:37 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/31305.html.txt","/var/www/straped/mufon/more/31305_submitter_file1__8-29-11UFOsketch.JPG","/var/www/straped/mufon/org/31305.html"],"Log Number":"US-08302011-0001","Latitude":"38.604478","Disposition":"Unknown","Tags":"City","trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around August 29th 2011","This sighting has never been favorited.",""],"Country":"United States","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Viewing Distance":"Unknown","Longitude":"-87.519943","map":"<A HREF = \"http://maps.google.com/maps?q=38.604478,+-87.519943(31305)&iwloc=A&hl=en\"> mufon case (31305) map </A>","divs":["Sighting DetailsI was outside talking to my mom, and i just happened to be facing east, when i noticed what appeared to be a plane flying behind a tree (11:54 PM, i look at my cell phone to see what time it is each time i see an unknown object in the sky), so at first i did not think much about it, but before i saw it, i had a strange feeling that i would see another UFO, but i was not sure if i should trust that feeling or not. As the object is passing behind the tree, my mom goes inside, and i looked at our '95 ford taurus to see if the windows were rolled up, and they were, so i looked back at the object behind the tree, and i could tell it was distinctly triangular, with a red blinking light between the center and the front, and three white lights, one at each point of the triangular shape. As it began to move roughly east-southeast of me, i could see that the back of the object had a panel of white lights that appeared to be strobbing from left to right and two white lights (not blinking) one on the left and one on the right. This is what immediately caught my attention, because back in 2004 i witnessed a simaler triangle that was much lower in altitude and appeared to be hovering, and it had a simaler light panel on the back with white lights strobbing from left to right. Another familier part of this sighting was that it had no sound whatsoever, even at its closest distance and as it was moving away from me (if it was a jet, it should've had a roar from its jet engines). I went around behind our shed (south of the house) and watched it begin to bank slightly to the left, but did not change direction for some reason. As it got south-southwest of my location, it appeared to have stopped, and began to fade slowly (it was probably climbing in altitude causing it to do this). Finally at 11:59 PM (i had my cell phone with me so i looked at the time to make a more accurate report) i lost sight of the object. I tried to take some pictures of the object, (i took 6 photos) but the object did not emit enough light for my camera to see. I did make a quick sketch of it though."],"Summary":"Triangular object moving towards Mount Carmel.","City":"Vincennes","Case Number":"31305","Source":"MUFON","Object Features":"Unknown","Object Flight Path":"Path then hovering","Date of the Event":"08/29/2011 11:54 UTC"}