{"map":"<A HREF = \"http://maps.google.com/maps?q=40.158531,+-79.53195(31300)&iwloc=A&hl=en\"> mufon case (31300) map </A>","Object Features":"Unknown","Country":"United States","Log Number":"US-08292011-0034","Case Number":"31300","Date of the Event":"08/29/2011 10:35 UTC","Longitude":"-79.53195","Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"08/29/2011 10:57 UTC","divs":["Sighting DetailsMy husband saw something interesting tonights and aske dme to come outside. By the time I had gone out all I could see was a large orange-yellow light hanging above the horizon. This is what planes coming head on look like. They seem to hover forever but they are actually coming staight on. We live near Latrobe airport, which takes commercial jets in and out so we're used to seeing planes of all shapes and sizes. My husbad described that previeous to me coming out he say the object but in front of it, about two inches in length from our viewpoint, were two red, solid lights. The lights were ahead of the object and got bigger then suddenly disapeared. i decided to stay out and observe the object which moved slowly above us. It made no sound until it was on top of us. It sounded like a plane and had blinking yellow and white lights. But what I noticed when it flew almost directly overhead, was that it was very black against the night sky and that it was a solid diamond shape. Unlike planes that fly through here with a body wings and tail. This was, from wing-tip to wing-tip a slightly elongated diamond. I am sure it was man-made but the red lights in front of it were strange."],"Region":"Pennsylvania","Summary":"strange large red lights preceding plane?","City":"Mt Pleasant","trends":["There have been 6 other sightings in Mt Pleasant","There were no other sightings in Mt Pleasant on or around August 29th 2011"],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/31300.html.txt","/var/www/straped/mufon/org/31300.html"],"Tags":"City","Disposition":"Unknown","Object Shape":"Diamond","Latitude":"40.158531","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}