{"trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around August 29th 2011","This sighting has never been favorited.",""],"Object Features":"None","Region":"Pennsylvania","Summary":"Very bright circle light in PA","Object Flight Path":"Straight-line path","Longitude":"-79.945286","Tags":"City","Viewing Distance":"Unknown, N/A","Disposition":"Insufficient Data","City":"Pittsburgh","Date of the Event":"08/29/2011 09:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.498291,+-79.945286(31317)&iwloc=A&hl=en\"> mufon case (31317) map </A>","Weather Factors":"Unknown","Date Submitted":"08/30/2011 02:31 UTC","Source":"MUFON","Object Shape":"Circle","divs":["Sighting DetailsLast night around 9:15 I went to smoke a cig. on my front porch before heading to bed. I have a traight shot of open sky off my front porch and could see a light that looked like a bright star. Then it started moving closer towards my house and it kept getting brighter and brighter. It was all alone until it was almost over my house then it seemed like out of no where 2 airplane like figures appeared beside it and behind it, constinantly changing positons. The airplanes had red and green lights on the side. I convinced myself it was just two planes meeting up with something else to refuel. I snapped two different pics. One as it was approaching my house, which in the picture, you can see it was going fast enough to cause i tail behing it. Then another when it was above my house. The photo on my phone just made it look like a dot on my small cell screen but when i uploaded it on my computer you can see it is a circle and very bright. THere were tons of stars out last night and none of them were bright enough for my camera to pic up but this is clear as day. It went over the hill behind my house and I went inside assuming it was gone. So I posted something on facebook about it and 20 minutes later my neighbor replied they went outside and looked and it was there again, followed by someone 2 miles in the opposite dierction of where i last saw the \"thing\" headed that it was also over their house. That is what really got me thinking. It if were jets refueling would they be circling a town or headed in a straight path to their destination. I don't know much about that kind of stuff, but I would bet money that was not plaines refueling, the light on this object was almost as if it were a high powered search light but the light never pointed down to the ground it just surround the object"],"Latitude":"40.498291","Country":"United States","files":["/var/www/straped/mufon/html2text/31317.html.txt","/var/www/straped/mufon/more/31317_submitter_file1__ufo2.jpg","/var/www/straped/mufon/more/31317_submitter_file2__ufo.jpg","/var/www/straped/mufon/org/31317.html"],"Sighting Duration":"Undisclosed","Log Number":"US-08302011-0013","Case Number":"31317"}