{"Summary":"Bright ball of light (bright gold with red in the middle) solid outline, moved slowly across sky, turned into red star and vanished","Latitude":"40.89661","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","Longitude":"-76.801157","City":"Northumberland","divs":["Sighting DetailsI was out on my deck watching an unusual number of planes in the sky. These planes were accompanied by strange lights that seemed to appear out of nowhere, flutter around for a few moments, and then disappear. It was a very clear night, no cloud cover. After awhile, all the lights and planes had gone and I suddenly noticed a huge, bright ball of light ascending from behind the treeline. At first I thought it was a low flying plane coming at me head on, but this object made no noise, was rising very slowly, and did not blink. In fact, the light never fluctuated - no twinkling or blinking. It was so low that if it had been a plane it would have been very loud, but this was silent. I watched for about 5 minutes as it slowly rose and then moved directly over my house. I was in awe at the low altitude, the silence, the unwavering outline of a sphere with a slightly domed top, and the bright gold color with a hint of red in the middle. As it flew over my house, I was looking directly up at it (maybe an 80 degree angle) and it began to shrink. It got smaller and smaller until it turned into a tiny red dot about the size of a star, and it was gone. It went from a giant ball of light to a red dot to nothing in less than 5 seconds. It vanished into thin air. The sky was clear as could be, and there was nothing obstructing my view. It just disappeared. It was not a plane. It was not a meteor. It was not natural. It was very disturbing. I am reporting this because I believe that other people must have seen this. It seemed to parallel the Susquehanna River in Northumberland PA around 10 pm."],"Object Features":"Dome, Other, Unknown","Object Shape":"Saturn-like, Sphere","Date of the Event":"08/29/2011 10:00 UTC","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Flight Path":"Hovering then path,Other","Date Submitted":"08/30/2011 01:35 UTC","trends":["There have been 3 other sightings in Northumberland","There were no other sightings in Northumberland on or around August 29th 2011"],"Log Number":"US-08302011-0012","Case Number":"31316","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31316.html.txt","/var/www/straped/mufon/org/31316.html"],"Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.89661,+-76.801157(31316)&iwloc=A&hl=en\"> mufon case (31316) map </A>"}