{"Latitude":"40.903987","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Case Number":"31318","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.903987,+-73.19789(31318)&iwloc=A&hl=en\"> mufon case (31318) map </A>","files":["/var/www/straped/mufon/html2text/31318.html.txt","/var/www/straped/mufon/more/31318_submitter_file1__1.png","/var/www/straped/mufon/more/31318_submitter_file2__2.png","/var/www/straped/mufon/more/31318_submitter_file3__3.png","/var/www/straped/mufon/org/31318.html"],"Weather Factors":"Unknown","Country":"United States","Log Number":"US-08302011-0014","Object Shape":"Circle, Disc, Oval, Sphere","Summary":"silver craft over flooded long island bay during hurricane irene","trends":["There have been no other sightings in Nissequogue","This sighting has never been favorited."],"City":"Nissequogue","Date of the Event":"08/28/2011 02:27 UTC","Longitude":"-73.19789","divs":["Sighting DetailsI have a boat moored in Port Jefferson, Long Island. As Hurricane Irene approached NY I found a cctv camera that is about 5 miles from my boat to monitor the storm, flooding, wind..... The camera i was monitoring is at Defeo Marina and can be viewed live at their website. At about 2:30 pm on Sunday i logged into the camera to check the flood conditions. I witnessed a large silver round disc type object in the sky over the flooded bay. I watched it live for a few minutes as it hovered in the same spot rotating around. My first thought was that someone might be launching a weather balloon but i soon realized that the object had lines and a structure that didn't look like a balloon. I took 3 screenshots of the live camera view. the 3 screenshots were taken about 10 seconds apart. It appears in the pictures that you can see the craft rotating toward the camera. I spoke to the marina to see if the live cam is recorded but it is not. At the time of this sighting most of the area was evacuated and no planes were flying in or out of ny airports."],"Tags":"City","Source":"MUFON","Disposition":"IFO","Date Submitted":"08/30/2011 03:25 UTC","Object Flight Path":"Stationary,Hovering then path","Region":"New York"}