{"Region":"California","Case Number":"31315","files":["/var/www/straped/mufon/html2text/31315.html.txt","/var/www/straped/mufon/org/31315.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.676294,+-120.241038(31315)&iwloc=A&hl=en\"> mufon case (31315) map </A>","Weather Factors":"None","Longitude":"-120.241038","Source":"MUFON","trends":["There have been no other sightings in Loyalton","This sighting has never been favorited."],"Object Shape":"Star-like","City":"Loyalton","Date Submitted":"08/30/2011 12:49 UTC","Object Features":"Unknown","Latitude":"39.676294","Disposition":"Unknown","Country":"United States","Summary":"Two nights of observing star-like objects very high in the atmosphere with pulsating colors.","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-08302011-0011","divs":["Sighting DetailsOn August 28th 2011 I went out on my back deck to stargaze. We live in a rural area and the milky way is viewable here. The sky is very clear and stars are very bright. I noticed one particular star low on the horizon north west from my location 39' 19' 39'N, 120' 10 57W which was pulsating blues, reds and whites. I grabbed my binoculars and with the increased magnification, could confirm this was not a star, planet or aircraft. The lights were being produced by the object and were not a reflection. I called my wife out to look and she observed the same thing. The object never moved and remained hovering in place for 2 hours. I eventually went to bed, but before that I reported what I saw to my friends list on FB. On August 29th at 8:30pm, we observed the same object in the same relative place again, but also another had appeared due west just over the horizon. This one was larger or closer. After several minutes, we noticed a large amount of aircraft heading in that direction. We could only see the lights on the planes, but they were identical with one red blinking center light and two white lights, one on each wing. Within 10 minutes, the northwest object disappeared below the horizon (behind the mountain, we have a range between us and the objects). The object due west began moving north in the sky and then dropped behind the mountain. It moved very slowly. A friend in a town about 5 miles from me, who doesn't have the same mountain range obstruction as I do, called to tell me he saw both objects pairing up and moving north. After about 30 minutes, we found 8 more of the same objects in the south west sky. Four of them were paired up individually and one was brighter than the rest and more west. Two friends in Cold Springs Nevada also observed the objects. One friend saw just one object and he said it vanished as he was viewing it. The other friend viewed one object this morning at 5:30am. Both friends described the objects the same way we saw them from here. Star-like, pulsating very bright blue, red and white lights."],"Date of the Event":"08/28/2011 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path"}