{"Country":"United States","Object Flight Path":"Straight-line path,Path then hovering","Sighting Duration":"00:01:00","Case Number":"31314","Object Features":"Wings","Object Shape":"Other","divs":["Sighting DetailsI was driving north bound on I-79 from Fairmont, WV toward Morgantown around 9:00 PM on Friday evening, July 29th. My husband and son were also in the car with me. Off in the distance, off to the southbound side of the interstate, I saw three white flashing lights. I first thought them to be a radio tower because of their distance from one another and because they appeared to be stationary in the sky. I mentioned to my husband that I did not recall a radio tower being there. I kept watching the lights as they seemed to be getting larger. After a few seconds we all noticed that they were in fact moving. After a few seconds more, the lights were directly over our car and seemed to be hovering there. They appeared to be extremely low in the sky as well. When they first appeared over the car, all we could see were the lights; there were now also well more than three, perhaps six or eight, though we did not count. We really could not imagine what it was as the lights seemed to remain directly over vehicle for at least 4-5 seconds, with no noise. After several seconds we saw a faint outline of what looked like a commercial airliner. We chuckled and dismissed it at first, however I quickly pointed out that I have never seen or heard about an airplane with lights on the underbelly. Because we did see the distinct outline of an airplane after it was over head for several seconds, my husband and son were convinced it was just an ordinary airplane. I do believe that it was an airplane however, certainly a very odd one which seemed to move extremely slow and low and with lights covering the underside of the fuselage. I tried googling such an airplane and was unable to find any. I did however find two other similar sightings to mine. So I decided to contact you to report my sighting also."],"Date of the Event":"07/29/2011 09:10 UTC","Source":"MUFON","trends":["There have been 5 other sightings in Fairmont","There were no other sightings in Fairmont on or around July 29th 2011"],"Region":"West Virginia","City":"Fairmont","Tags":"City","files":["/var/www/straped/mufon/html2text/31314.html.txt","/var/www/straped/mufon/org/31314.html"],"Summary":"What appeared to be an airplane with several lights covering underside of the fuselage.","Viewing Distance":"Unknown","Log Number":"US-08302011-0010","map":"<A HREF = \"http://maps.google.com/maps?q=39.531653,+-80.228061(31314)&iwloc=A&hl=en\"> mufon case (31314) map </A>","Longitude":"-80.228061","Disposition":"Insufficient Data","Date Submitted":"08/30/2011 11:28 UTC","Weather Factors":"None","Latitude":"39.531653"}