{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.728708,+-79.950886(31313)&iwloc=A&hl=en\"> mufon case (31313) map </A>","Longitude":"-79.950886","Tags":"City","City":"Cambridge Springs","Date of the Event":"04/30/2007 12:00 UTC","files":["/var/www/straped/mufon/html2text/31313.html.txt","/var/www/straped/mufon/org/31313.html"],"Object Flight Path":"Straight-line path","Country":"United States","Latitude":"41.728708","divs":["Sighting DetailsIt was just before dark and I was laying on the sofa recuperating from a knee injury. My husband was on the computer in our dining room. Suddenly we both heard an extremely loud whistle like noise right outside our dining room patio doors. My husband immediately went outside on our deck and looked up to just above the tree tops to see mostly the bottom of a large object. He said it was pulsating randomly with an opalescence color. It flew in an east to west direction and was gone in under a minute. By the time I was able to get up off the sofa, it was gone. My husband spent his military service in the Air Force. He said he couldn't explain what he saw or heard. I thought at the time, the whistle noise sounded as if air was rushing by an opening very fast, as if \"someone\" left a window or door open on the craft. It was THE strangest experience I've ever had, and I think I can say the same for my husband, who actually saw what we heard. At the same time, my son was riding in a car along ST RT 77 which runs in an east to west direction, when a friend pointed out an object in the sky and asked \"What's that?\" They didn't report hearing a noise."],"Summary":"A large object flew almost directly above our house which made NO engine noise but was emmiting an extremely loud whistle noise","Region":"Pennsylvania","Object Features":"Unknown","Case Number":"31313","Date Submitted":"08/30/2011 11:26 UTC","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"101-500 Feet","Disposition":"Unknown","trends":["There have been no other sightings in Cambridge Springs","This sighting has never been favorited."],"Object Shape":"Unknown","Log Number":"US-08302011-0009"}