{"Latitude":"42.361861","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.361861,+-71.056613(31321)&iwloc=A&hl=en\"> mufon case (31321) map </A>","Disposition":"Unresolved","City":"Boston","Object Features":"Undisclosed","Log Number":"US-08302011-0017","Source":"MUFON","Date Submitted":"08/30/2011 05:06 UTC","Longitude":"-71.056613","Date of the Event":"08/30/2011 02:40 UTC","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31321.html.txt","/var/www/straped/mufon/org/31321.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Case Number":"31321","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around August 30th 2011"],"divs":["Sighting DetailsI had just completed a yearly physical with my Primary Care Physician. Upon exiting the medical building I turned left towards my parked automobile. It is a beautiful day outside with extremely pleasant conditions. I simply glanced up into the sky in appreciation when I immediately noticed a clear and unmistakable object stationary and flashing brightly in the sky... I paused because it required NO momentum to stay air borne. My first thought was is it a \"star\"? But at 2:00pm in the bright afternoon, no way. Not like this. What really caught my attention was the objects spinning motion. I watched for minutes. It just hung there spinning. I thought, how can anybody not see this? I had enough time to observe that the bright flashing was created by the reflection of the sun to my right. Looking up, the spinning was clock wise. As it rotated about, certain sections of it were angled slightly differently. This created a varying degree of brightness per flash and size. I took all this in. Very fascinating... Now the remarkable part. I watched as a passing cloud slowly began to approach the object. They seemed to be at the same elevation. Suddenly, as the cloud got nearer, the leading edge of the cloud began to be \"pulled forward\", like a \"whipping towards\". The closer the cloud approached the more of it was pulled or effected rather by the spinning of the object. The cloud was violently stirred clock wise into a whirlpool around the object. Amazing! When I say violently I mean that the interaction of the cloud and the object began slow then increased as more of the cloud entered its area. It was incredible to see the cloud so peacefully floating along with the leading edge being swirled so fast. The leading edge of the cloud swirled around the object as the cloud engulfed it. I watched several more minutes for the whole cloud to pass in anticipation of observing the object again but it was gone. Seems that once in the cloud it disappeared, at least from my view. I checked today's weather and the cloud elevation is 12000 feet. Meaning this object was big and so was its effect."],"Object Shape":"Sphere","Summary":"Spinning Unidenified Hovering Object creates Vortex in passing cloud.","Region":"Massachusetts"}