{"Case Number":"31328","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around August 20th 2011"],"Object Shape":"Triangle","Country":"United States","City":"Sarasota","Date Submitted":"08/30/2011 08:08 UTC","Tags":"City","Object Features":"Unknown","Log Number":"US-08302011-0024","Summary":"It zig-zagged very slowly across the bay, then landed beyond nearby trees.","Longitude":"-82.569453","Disposition":"Insufficient Data","divs":["Sighting DetailsLast Saturday night, three of my friends and I went for a walk on our college campus down to the bay (our campus is on the gulf coast of Florida). It was about 10pm, and totally dark. We were standing by the water trying to look at the stars- there weren't many. The night was overcast and it had been rainy all day. We were mostly hanging out, joking around. None of us were intoxicated. I saw a bright light from north of where we were standing, and I actually jokingly said that it was a UFO. Once everybody was focusing on the object, we became confused about what it could be- it wasn't too far from us, but it was moving very, very slowly. As we watched, it began to make a zig-zag pattern over the water, at times heading right towards us. It was definitely less than a mile away, but we couldn't hear anything. Our campus is right next to an airport, so we are all very familiar with the noises that various objects in flight make-- this object was entirely silent. It continued to travel slowly, zig-zagging across the bay, in our direction. There were no other lights on the craft other than the main brightest white one, and the object appeared to be triangular in shape. We were standing next to a copse of trees which separated the campus from a nearby neighborhood. The copse of trees is very small- maybe as wide as an average sized house. The UFO descended just beyond the trees and landed, very slowly and silently. We didn't go into the trees to investigate because we were unsure of what the object could be. We didn't feel threatened- mostly just in awe."],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Source":"MUFON","Weather Factors":"Windy, Light","Region":"Florida","Date of the Event":"08/20/2011 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.371407,+-82.569453(31328)&iwloc=A&hl=en\"> mufon case (31328) map </A>","Latitude":"27.371407","files":["/var/www/straped/mufon/html2text/31328.html.txt","/var/www/straped/mufon/org/31328.html"],"Sighting Duration":"00:15:00","Object Flight Path":"Hovering then path,Path with directional change,Other"}