{"Object Features":"Unknown","Latitude":"38.440258","Tags":"City","Longitude":"-122.684922","Log Number":"US-08302011-0018","map":"<A HREF = \"http://maps.google.com/maps?q=38.440258,+-122.684922(31322)&iwloc=A&hl=en\"> mufon case (31322) map </A>","City":"Santa Rosa","files":["/var/www/straped/mufon/html2text/31322.html.txt","/var/www/straped/mufon/org/31322.html"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Disposition":"Unknown","Region":"California","Source":"MUFON","Case Number":"31322","Object Shape":"Oval","Date of the Event":"08/29/2011 10:04 UTC","divs":["sighting detailsmy wife and i had just turned off the tv in our room and got ready to go to sleep. after a short time (5-10minutes) i got up to relieve myself in our master bathroom. it was at this time i observed through my bathroom window a some what large pulsating red orb in the sky to the east\\north east of my location. the object appeared to be a considerable distance away (at least three miles)and about the size of a silver dollar. i could hear no rotor wash or engines of any kind. as i observed the object it immediately struck me as odd. it literally moved slowly on a straight trajectory and then would zip backwards, forwards, up and down. my area of view is limited by several trees. the observed object stayed within a my clear 15' field of vision for close to two and a half minutes. it is during this period the object seemed to linger,hover and change location in a millisecond. the object was pulsing bright red with hints of orange and white. at this point i'm in disbelief of what i'm seeing, so i called out to my wife to hurry and come look. the object was moving once again on its original trajectory very slowly and was beginning to leave our clear field of vision. as it moved behind the trees it struck me how bright this object was that it could still be made out through the trees. at this point i feared losing sight of the object and threw on minimal clothes and grabbed my camera to head outside. once i got out i searched the sky for the object but could not sight it. i still have a sense of disbelief in what i saw. it was unlike anything i have ever observed in the sky. it is worth mentioning i served in the us army as a cavalry scout and received intensive training in observing and identifying all types of aircraft and armored vehicles."],"Viewing Distance":"Over One Mile","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around August 29th 2011"],"Summary":"Strangest thing I have ever seen. Left me doubting what I saw..","Date Submitted":"08/30/2011 05:21 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States"}