{"Region":"Tennessee","City":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"Unknown","Summary":"Moving Star Like Object","Latitude":"35.523991","Longitude":"-86.571957","Log Number":"US-08302011-0019","Object Shape":"Star-like","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31323.html.txt","/var/www/straped/mufon/org/31323.html"],"Case Number":"31323","Date of the Event":"08/27/2011 03:00 UTC","Disposition":"Unknown","Country":"United States","Object Features":"None","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=35.523991,+-86.571957(31323)&iwloc=A&hl=en\"> mufon case (31323) map </A>","divs":["Sighting DetailsAugust 27 2011 flying object witnessed by 5 people from 3 AM until about 5:30 AM. We were in the backyard,the sky was very clear and so many stars were out so we decided to get a blanket and lay out and stargaze. We seen 3 shooting stars in about 10 minutes time. Then with 30 minutes we seen about 7 to 8 shooting stars(maybe more) as I lost count because it was really something to see. I began to question was this normal? Next we witnessed a star moving,the light looked different from a regular star,it's hard to explain because I have never seen a light source like it. Possibly similar to the cars with the blueish halogen lights,if you take away the blue hue it was something like that,very vivid,very clear unlike any light I have ever seen. At first it moved across the sky in almost a serpentine motion and very fast,we have 2 acres of treed land here so we had to run through the yard to follow it as to not lose it behind a treetop. It then stopped and hovered and then shot across the sky at a very high speed,like a shooting star,then it appeared to be searching with the snake like movement going side to side as if it was looking for something. My mind couldn't believe what my eyes were seeing. Now I think that some if not all of the shooting stars that we witnessed may have been this object all along. We ended up watching it and running all around the yard for 2 hrs+ It was almost as if the thing was playing with us I know that sounds weird,but it would hover wait for us to run over across the yard and then zip off stop and wait and then move... just very odd to me. There seemed to be 3 of these,sometimes they would move so fast it was hard to keep up with more than 1. The sky was extremely clear that night,the moon did not show up until just before sunrise,not sure why that is? But I believe it was about 6% full when it did show. Naturally, we were all tired from this event so we said our goodbyes and I went in to sleep not long after that a military jet the ones that make the sonic boom noise went over and shook my house.I suspect they were looking for these object(s). I searched all weekend trying to find a video of something like what we witnessed and I came across one that is exactly like what we seen on Youtube. The man known as (Magnetflipper) uses a high powered camera and has actually captured 60+ video's of these things. Notes* -The moving star stayed high in the sky maybe slightly under the stars -Time seemed to speed up, it seemed like we were outside like 45 mins to an hour we had no idea that it was 5:30ish am until it started getting light outside and we lost the object and someone looked at the actual time. -Object(s) moved at incredible speeds with precision movements -there was no sound -we did see 2 planes go over during this time, but they were much lower in relation to the object we were watching -Sometimes it looked like a aura was around the object when it was just hovering -When it would zip off it left a slight trail like a shooting star but the streak would hold a little longer than that of a shooting star giving us time to see where it zipped off to, the trail looked blueish white in color. -For the record we were not drinking nor doing drugs,we don't do that anyway but I suspect someone will ask...I know I would if I read this. Just saying."],"Date Submitted":"08/30/2011 05:29 UTC"}