{"Object Features":"None","City":"Forest Park","Object Flight Path":"Path with directional change","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/31320.html.txt","/var/www/straped/mufon/more/31320_submitter_file1__SearchGuttergawkeronYouTube.jpg","/var/www/straped/mufon/org/31320.html"],"Region":"Illinois","Date Submitted":"08/30/2011 03:42 UTC","divs":["Sighting DetailsA few months ago I had back surgery for the third time in 3 years so I like to rest and relax my back in the backyard at my Forest Park IL home on nice clear warm starry nights like last night Aug 29 2011 I was sky watching as I usually do when I noticed a dull orange orb fly over heading South East at 830 PM CDT. I did not have my camcorder but went inside to get it because I know that sometimes when you see one UFO others might be sure to follow. So I waited and sure enough another flew over at the same height, distance, color and speed. I had my camcorder so I started recording. I followed it until it disappeared in the South East Chicago sky. I lit a cigarette and waited to see if anymore would show. About 5 mins later at 845 PM another larger brighter orb showed and started in the same path as the others but deviated dimmed out and vanished when a regular aircraft began to fly at it. None of the Orbs that flew over had the required FAA rotating beacon lights. I have been watching the skies over Chicago for a few years now and have seen many types of craft of various shape size and color but the star like orbs seem to be the most frequently visible. I have a YouTube channel where I post my videos of what I catch. I call the youtube channel Guttergawker, I named it this long ago before I began to see UFOs. I called it that because I would sit at work and watch all kinds of stuff on YouTube and my friend would say \"Why are you always looking at the gutter?! You're just a regular Guttergawker!\" So I decided to call my channel that. Anyways one of the friends I made on YouTube who live in the Chicago-land area emailed me maybe 10 minutes after I saw these orbs fly over saying they had just witnessed similar orbs pass over including two dull ones and a third bright one, not knowing I recorded what they saw 10 minutes earlier. It was pretty cool and amazing to have someone else validate what I had just witnessed but in another part of the City. They said they lived near California and Archer which is SE from where I am located in Forest Park. If you want to check out the video search bright UFO Chicago August 29 2011 or search my channel name. If you go on YouTube and have a sign on and live in the Chicago area and see the same things in the sky please email me I would like to start networking with other people to see if we can begin to catch these same events in various locations in IL. I promised I would not make another MUFON report a while ago because some in the UFO community think that people that have multiple encounters numerous times are full of it but I am here to say that's not true. Everything I see the reports I make and the videos I capture are all sincere and honest. I have 25 videos on my channel so check out the different things I caught on tape. Some of the things may be explainable and a little artsy but most of the videos are recorded and uploaded without any enhancement and are open to the viewers interpretation. I am under the strong impression that the things I see are Extraterrestrial I believe this only from the first hand experiences I have had. Some have been very up close and revealing. Idk why I continue to see these things but I know I am not the only one. I think they target me to show themselves because the first time I saw the UFOs Aug 23 2009 I said a small prayer, thought positive and asked them to please come down and show their technology and knowledge with us to help humans end war, poverty, sickness, homelessness, etc. I think they were able to hear my thoughts and that positive thinking resonated with them so now when they are around they continue to \"show\" themselves to me. Thanks for taking the time to read my report. Hopefully someone will be able to tell us what these things are someday. Peace."],"Object Shape":"Fireball, Sphere, Star-like","Case Number":"31320","Weather Factors":"Unknown","Log Number":"US-08302011-0016","Latitude":"41.882476","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around August 29th 2011","This sighting has never been favorited.",""],"Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.882476,+-87.81126(31320)&iwloc=A&hl=en\"> mufon case (31320) map </A>","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-87.81126","Summary":"Starting at 830pm Saw 3 Orbs pass over in 5 minute intervals HD Video","Date of the Event":"08/29/2011 08:30 UTC","Sighting Duration":"Undisclosed"}