{"Disposition":"Unresolved","Region":"Texas","Log Number":"US-08312011-0003","Tags":"City","Longitude":"-97.107227","Date of the Event":"04/15/1992 12:00 UTC","Case Number":"31339","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere","Latitude":"32.813993","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around April 15th 1992"],"Date Submitted":"08/31/2011 12:11 UTC","Country":"United States","City":"Arlington","Summary":"Bright light with abrupt down then up and out of sight movement and a speed that seems incalculable. Unforgettable in every way mainly because there's is nothing to compare it to.","divs":["Sighting DetailsMy UFO sighting happened while I was driving on Hwy 820 in Fort Worth. (The sky was free of clouds.) I was on my way to Trade School and concentrating on the traffic and listening to the radio. All of a sudden my attention was captured by a bright light in the sky. The light made an abrupt movement and quickly disappeared. I had an immediate process of deduction going through my mind following the sighting. I told myself that it couldn't have been an airplane, helicopter etc...becauce it was so unbelievably fast. And the light was so brilliant and its movement was not like a normal aircraft. I distinctly had a feeling that what ever it was did no really want to be seen. And I did not get to see it very long at all. But I do know that I saw something that to this very day make me wonder deeply about reality. I became alot more passionate about topics involving ancient Egypt, Stonehenge, crop circles, Nazca Lines ... History Channel programs. At the Trade School, while in computer class, I did mention to a classmate what I had witnessed earlier while driving and other classmates heard the conversation and rudely made fun of me for telling about my UFO account. I felt slightly embarrassed but quickly shrugged it off. I couldn't allow any one to shame me into thinking that what I saw was just my imagination. During my sighting I never became afraid only bewildered and mesmerized. In less than 10 years I had a second sighting. This occurrence I was a passenger in my sister's car. She was driving. We were traveling south bound on 360 and just having a normal conversation. At the same time our attention was drawn to a bright light in a clear night sky. The light moved simular to my first sighting and I was once again amazed. I had to calm my sister down. She asked me \"Did you see that?\" And I replied \"Remember I told you I saw a UFO before and you didn't believe me?...Now you got to see what I saw! She told me that she couldn't hardly drive because her leg was shaking so bad and she said it felt like her heart was beating out of her chest! I asked her to calm down because it was gone. She then said \"We can't tell any body about this 'cause they'll think that we're crazy. I told her I knew, I had already found that out but that I didn't care what others thought. Anyway, that's what I remember. Thanks for the opportunity to share with others. Sincerely, Salem"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.813993,+-97.107227(31339)&iwloc=A&hl=en\"> mufon case (31339) map </A>","files":["/var/www/straped/mufon/html2text/31339.html.txt","/var/www/straped/mufon/org/31339.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Object Features":"Unknown","Source":"MUFON"}