{"Log Number":"US-08302011-0026","Sighting Duration":"Undisclosed","Latitude":"39.473403","divs":["Sighting DetailsMy roommate and I were sitting in our front lawn talking and an extremely bright light caught my attention. We had thought we had seen a satellite moving northwest to southeast across the sky roughly ten minutes earlier and I thought, at first, that maybe what I saw was a shooting star or some other thing entering the atmosphere. I looked up and told my roommate to look up immediately. What I saw was the most astonishing bright white light I had ever seen. It was moving slowly across the sky from southeast to northwest. As I watched the object, it appeared to be experiencing a rotation along its yaw axis because the bright white seemed to dim with the same characteristic one might see when a flashlight is turned away from them. The light was still visible but it was much dimmer as it seemed to rotate. We continued to watch, though it was much dimmer than when we first caught sight of it. And as we watched, we saw the bright white light roll back over so we could see it. It lasted for possibly 10 seconds in its brightest visible position. It continued to rotate and we lost sight of it. It must have been extremely high. We noticed no noise nor did we notice any vapor trail. Also, it was moving extremely slowly across the sky. As we sat in our chairs, not moving, I would say we saw it cover about 15% of the nighttime sky before we lost sight in an event that took perhaps three minutes at the very most. It was, without a doubt, the most brilliant, clear, white light I had ever seen. These were not landing lights as it seemed to project straight down and it gave off no halogen luminosity. Also, because it seemed to rotate along the roll axis, I do not see how it could be landing lights which point straight ahead (also, due to the extreme altitude of this light, landing lights seem impractical for any aircraft at that point). Also, because there were no flashing lights visible, like an airplane might have, we thought it might have been a reflecting satellite but I have never, ever, seen anything so brilliant. It was the size of a pinhead but it was as bright as any xenon headlight I've seen except it was perfectly white in color."],"City":"Terre Haute","Source":"MUFON","Object Features":"Unknown","Viewing Distance":"Unknown","Disposition":"IFO","Date Submitted":"08/30/2011 08:23 UTC","Object Shape":"Unknown","Date of the Event":"08/29/2011 09:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/31330.html.txt","/var/www/straped/mufon/org/31330.html"],"Tags":"City","Region":"Indiana","Object Flight Path":"Straight-line path","trends":["There have been 22 other sightings in Terre Haute","There were no other sightings in Terre Haute on or around August 29th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.473403,+-87.406509(31330)&iwloc=A&hl=en\"> mufon case (31330) map </A>","Case Number":"31330","Summary":"Fluctuating bright white light appeared to exhibit a rotation on they roll axis moving slowly across sky.","Longitude":"-87.406509","Weather Factors":"None"}