{"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around November 30th 1984"],"Source":"MUFON","Case Number":"31336","Weather Factors":"Unknown","Summary":"Disc hovered, moved to the right a bit and I lost it in the trees as I was moving in a car.","Object Features":"Dome","divs":["sighting detailsi know this is a long time ago, but it always eats away at me that i haven't \"reported\" it. i have told many people of it, but have not known of mufon until now, so here goes... i was riding in the car with my mother at the time on blue ridge road here in raleigh, nc when i looked to my left over the trees and noticed a grey disc hovering approximately where crabtree valley mall is located. it was a classic disc shape with a dome above...as a matter a fact very similar to the mufon logo as i am looking at it now. i always smile when i think of how \"stereotypical\" ufo shape it was...just like something you would see in a movie. when i was young i had 20\\10 vision and i know for a fact it was something with which i was not familiar; not then, not now. i was in a moving car at the time but i definitely could tell it was moving to the right a bit before hovering again. i excitedly told my mother, who was trying to drive the car safely, but as she attempted to look, the car was still moving when the viewing angle became obscured by trees. this event changed my life as simple as it was. i am much more skeptical what i am told, and much more open-minded to the other things we are not told."],"Region":"North Carolina","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/31336.html.txt","/var/www/straped/mufon/org/31336.html"],"City":"Raleigh","Log Number":"US-08302011-0032","Date Submitted":"08/30/2011 11:45 UTC","Latitude":"35.832496","map":"<A HREF = \"http://maps.google.com/maps?q=35.832496,+-78.695318(31336)&iwloc=A&hl=en\"> mufon case (31336) map </A>","Date of the Event":"11/30/1984 12:00 UTC","Longitude":"-78.695318","Object Shape":"Disc","Object Flight Path":"Hovering then path","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed"}