{"City":"Corunna","Disposition":"Unknown","Log Number":"US-08312011-0001","Region":"Indiana","Summary":"Very bright white light that was ball/star shaped","Date of the Event":"08/29/2011 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.437272,+-85.147193(31337)&iwloc=A&hl=en\"> mufon case (31337) map </A>","Object Flight Path":"Straight-line path","Tags":"City","Case Number":"31337","Date Submitted":"08/31/2011 12:00 UTC","trends":["There has been one other sighting in Corunna","There were no other sightings in Corunna on or around August 29th 2011"],"Country":"United States","Latitude":"41.437272","Weather Factors":"None","Object Shape":"Star-like","Viewing Distance":"501 Feet - 1 Mile, Unknown","Source":"MUFON","Sighting Duration":"00:05:00","Object Features":"None","files":["/var/www/straped/mufon/html2text/31337.html.txt","/var/www/straped/mufon/org/31337.html"],"Longitude":"-85.147193","divs":["Sighting DetailsThe only reason I am posting this is because I saw similar postings. My husband, sister along with myself were sitting on the back patio Monday night around 9:30PM and I saw a very bright white light coming from the west, heading east, shaped like a star. It appeared to be wobbling, almost traveling snakelike across the sky. I was looking straight up at it and it was probably between 500 and a 1000 feet up. I told my sister and husband to look at it and asked them if they thought it was a plane because I didn't. They didn't know what it was either and it made no noise. We studied it for about a minute, the my husband started to make fun of me about it being a UFO but I told him it looked like it was wobbling and he said,\"yeah, you're right, it is.\" As it moved more east it suddenly dimmed then completely dissappeared. We had observed a plane traveling west at the same time and knew what that was immediately. We sat there for a few minutes discussing what we saw and we don't have a clue. It was such a brillant bright light and the experienced lasted around 4 or 5 minutes. We never saw it reappear. I wish I had got a photo of it but by the time I thought about it, it had disappeared."]}