{"Latitude":"39.929283","map":"<A HREF = \"http://maps.google.com/maps?q=39.929283,+-75.015321(31333)&iwloc=A&hl=en\"> mufon case (31333) map </A>","Case Number":"31333","Disposition":"Unknown","Date of the Event":"08/29/2011 01:00 UTC","files":["/var/www/straped/mufon/html2text/31333.html.txt","/var/www/straped/mufon/org/31333.html"],"Source":"MUFON","Summary":"Silver cigar-shaped ufo","City":"Cherry Hill","divs":["Sighting DetailsI was sitting at the light coming out of the Home Depot on Route 70 in Cherry Hill. It was a gorgeous day and there was little cloud cover. I happened to look up towards the southeast and saw an unidentified flying object. I can't really estimate distance... it was probably a few miles away at a height of at least 10,000 feet. It was a silver cigar-shaped object. Pointed on both ends. I supposed it could have been a flying saucer being viewed from the side. It was moving at a steady, non-hurried pace for about 4 seconds and then it simply disappeared. It didn't accelerate suddenly or change directions - it simply popped out of existence. I kept staring at that part of the sky for another 30 seconds but saw nothing else. I don't believe this was a plane or a jet. I've seen jets leave vapor trails and there was none. There wasn't a cloud in that part of the sky. No other aircraft. It was a silver object moving in a general northern direction and after a few seconds - POOF. It was just gone. I keep an open mind with regards to UFO's. This is the first time I've seen an object in the sky I could not identify. Hoping some other people may have spotted this object for corraberation."],"Object Shape":"Cigar","trends":["There have been 7 other sightings in Cherry Hill","There were no other sightings in Cherry Hill on or around August 29th 2011"],"Weather Factors":"Unknown","Date Submitted":"08/30/2011 11:07 UTC","Region":"New Jersey","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Tags":"City","Object Features":"None","Longitude":"-75.015321","Sighting Duration":"00:00:05","Log Number":"US-08302011-0029","Country":"United States"}