{"City":"Rochester","Sighting Duration":"00:00:45","Latitude":"43.309216","Log Number":"US-08302011-0030","map":"<A HREF = \"http://maps.google.com/maps?q=43.309216,+-70.971429(31334)&iwloc=A&hl=en\"> mufon case (31334) map </A>","Viewing Distance":"Over One Mile","Date of the Event":"08/30/2011 08:45 UTC","trends":["There have been 4 other sightings in Rochester","There were no other sightings in Rochester on or around August 30th 2011"],"Summary":"White light traveling east. Wavered a little, shrunk to a red dot, then disappeared.","Weather Factors":"Unknown","Longitude":"-70.971429","Date Submitted":"08/30/2011 11:16 UTC","divs":["sighting detailswe were without power for 3 days due to hurricane irene. the power was restored this afternoon. after getting home from work, i coiled up my extension cords and put away the generator. i shut off the lights to the garage and went to close my tailgate on my truck. i decided to finish my bottle of beer while sitting on the tailgate. very clear night. it was almost 9pm and lots of stars in the sky. i only had 1 bottle. and i may drink zero, one, or two 12oz bottles per week. not a drinker. i turned back toward the cab of the truck, then slowly scanned the sky. no airplanes. but then i saw one over my neighbor mary's house. it must be a plane. but it seemed to be much brighter and whiter. and bigger. it was traveling east, away from me. kind of slow and straight, like a plane. but why would i see bright headlights if it was traveling away from me? this puzzled me, so i kept staring at it. i still can't seem to see any blinking lights on it. i've seen those bag lanterns people light and send off to the sky. this was way too bright and white to be one of those. then something bizarre happened, which is why i am submitting this report. the light wavered back and forth slightly a few times, then started to shrink. it shrunk down to a little orange\\red dot, then disappeared. i mean gone. poof. what the heck? where did it go? it's not like it went behind some trees and i lost sight of it. it was right up there in the sky. i looked around the sky again searching for anything that might be moving. nothing. that was bizarre."],"Object Flight Path":"Straight-line path","Object Shape":"Star-like","Country":"United States","Object Features":"Unknown","Tags":"City","Region":"New Hampshire","Disposition":"IFO","Case Number":"31334","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31334.html.txt","/var/www/straped/mufon/org/31334.html"]}