{"Tags":"City","files":["/var/www/straped/mufon/html2text/31338.html.txt","/var/www/straped/mufon/org/31338.html"],"Weather Factors":"Unknown","Case Number":"31338","Latitude":"29.400525","Log Number":"US-08312011-0002","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around August 30th 2011"],"Summary":"Saw triangular craft gliding over our neighborhood and it made no sound.","Date Submitted":"08/31/2011 12:10 UTC","City":"San Antonio","Longitude":"-98.535263","Object Features":"Unknown","Region":"Texas","Date of the Event":"08/30/2011 10:00 UTC","divs":["Sighting Details1st sighting: My father had called me outside to see something \"strange\" and that's when I noticed a craft that had a blinking red light that would blink consecutively and it appeared to go from one point in the sky to another far off point really fast and that's when i noticed that this was not a craft ive seen before. 2nd sighting: I had went inside again to get something and my father had told my sister about what he had seen. She went outside and he immediately followed minutes later I decided to go back outside as well. We were looking up at the sky and that's when we saw the red blinking lights again coming from a different direction and again this craft emitted no sound which was odd for a craft of this size. My sister and I in a futile attempt to get close to it decided to chase after this craft.. that's when we got a closer look at it and noticed that this craft was not an airplane or a helicopter. It was triangular in shape and had 3 lights in the back and a red blinking light in the center. AS we chased it we noticed that it did not make a sound and that it just glided in the air like a kite. Then we saw it turn abruptly as if it was going to go back around but at that precise moment it disappeared behind a house in our neighborhood."],"Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Viewing Distance":"Unknown","Disposition":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.400525,+-98.535263(31338)&iwloc=A&hl=en\"> mufon case (31338) map </A>"}