{"Object Flight Path":"Straight-line path","Region":"New York","files":["/var/www/straped/mufon/html2text/31347.html.txt","/var/www/straped/mufon/more/31347_submitter_file1__perspective.jpg","/var/www/straped/mufon/org/31347.html"],"Viewing Distance":"Unknown","Latitude":"43.123398","Summary":"Big, meteorite like speed, bright flourescent sea green like color, close to if not perfectly round.","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=43.123398,+-77.597512(31347)&iwloc=A&hl=en\"> mufon case (31347) map </A>","Date of the Event":"08/31/2011 03:42 UTC","City":"Rochester","Date Submitted":"08/31/2011 08:04 UTC","Log Number":"US-08312011-0010","Sighting Duration":"00:00:03","Longitude":"-77.597512","Case Number":"31347","divs":["Sighting DetailsI was walking home from my friends house, when out of the corner of my eye I saw what I thought was a shooting star. First thought I turned around to make a wish on it and that's when I saw that it was really big for being a meteorite. It was heading in from the west going towards the east starting about 70 degrees above the horizon and lost site of it no thanks to the roof of a house when it was at about 50 degrees. Heading in a straight line, speed and apparent size it couldn't have hit more than a couple miles from me at the most, and if it had been a meteorite I'm very sure that I would have felt the ground shake from that kind of impact of one that big. So I waited about a minute and felt nothing. It was moving way to fast and happened to quickly for me to get a picture, but like any intelligent person i didn't move at all and took a picture of where I saw it go through to try to figure out the path it took and later on try to figure out where it landed. After doing all of this I immediately called my friend, whos house I just left to tell him what happened. My phone says I placed that call at 3:42 am (New York time)."],"Tags":"City","trends":["There have been 53 other sightings in Rochester","There was one other sighting in Rochester on or around August 31st 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","Disposition":"Unresolved","Source":"MUFON","Country":"United States"}