{"map":"<A HREF = \"http://maps.google.com/maps?q=43.290647,+-84.563186(31348)&iwloc=A&hl=en\"> mufon case (31348) map </A>","City":"Ithaca","divs":["Sighting DetailsI was driving home at approximately 11:00 p.m. on M-46 from Saginaw, Mi headed toward Ithaca, Mi when I noticed a off to the south above fielded area that was flashing blue and red as I thought I was approaching it, it disappeared. I then turned South down a side road, and looked out the drivers window to the East, and I saw this huge star-like bright, glowing object that looked completely out of place to be a star and almost seemed too low to the ground to be a star. I was the only one on the roads this late at night and was starting to get a little freaked out as I noticed the object seemed to be getting closer to me and getting larger. I called someone to step outside to see if they also could see the object and they did and they were about an hour from where I was. Therefore, it must of been high enough in the sky to be seen elsewhere. It appeared to move slightly closer to the surface of the Earth and then moved upward again. I was driving (alone in the dark) I started to feel scared like I was being followed or watched. I arrived home about 2:00 a.m. and the object was still in the sky. It was higher up and not as large as it was originally, but was still very bright. I did notice as the night went on the object did not move from its original location. With the constant rotation of the Earth and stars, I found it weird that the object did not move from its original position."],"Log Number":"US-08312011-0011","Object Shape":"Star-like","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/31348.html.txt","/var/www/straped/mufon/org/31348.html"],"Region":"Michigan","Object Features":"Undisclosed","Date Submitted":"08/31/2011 09:51 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"31348","Date of the Event":"08/29/2011 12:00 UTC","Disposition":"IFO","Summary":"Bright Bright White Light in Eastern Sky","Latitude":"43.290647","Longitude":"-84.563186","trends":["There have been no other sightings in Ithaca","This sighting has never been favorited."]}