{"Tags":"City","Log Number":"US-08312011-0005","map":"<A HREF = \"http://maps.google.com/maps?q=40.927814,+-73.898237(31341)&iwloc=A&hl=en\"> mufon case (31341) map </A>","Date of the Event":"08/30/2011 08:44 UTC","Case Number":"31341","Date Submitted":"08/31/2011 12:54 UTC","trends":["There have been 6 other sightings in Yonkers","There were no other sightings in Yonkers on or around August 30th 2011"],"Source":"MUFON","Country":"United States","Object Features":"Unknown","Summary":"I thought it was a bright star till i realized it was moving","Sighting Duration":"Undisclosed","Longitude":"-73.898237","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/31341.html.txt","/var/www/straped/mufon/org/31341.html"],"Viewing Distance":"Unknown","Region":"New York","Object Flight Path":"Straight-line path","Object Shape":"Star-like","Latitude":"40.927814","City":"Yonkers","divs":["sighting details1- i was home and decided to look out my living room window like usual, and look at the night sky like i do every night. 2- i looked out the window and glanced at the night sky before i started looking at stars and i saw a few stars and a very bright one, i glance at the other side of the sky then look back to the other side to realize the bright star moved from its position a bit so i started looking at it and i saw it was moving. i called my mom over to see it and she saw it as well. 3- what i thought the object was a plane or a helicopter. 4- the object was as bright as a bright star but a little brighter. i noticed it didnt have red\\green lights or blinking lights like aircraft should have. the object was moving in a straight direction (moving from west to east). i opened the window to hear nothing coming from it. then i said in my head \" ufo? alien life? government test?\" 5- what i felt was anxiousness to know what it was that was just a moving light with no sound. what i did during the sighting was just stand at the window with my mom and watch it till i couldnt see it anymore because of my buildings shape. so the building got in my way to view it longer. after the sighting i went online to search if anyone else saw this before or even when i saw it. a tweet on twitter said \"there was a strange light in the sky tonight, not a star but not a helicopter, had no sound just slow moving ball of fire.\""],"Weather Factors":"Unknown"}