{"Date of the Event":"08/31/2011 05:00 UTC","Tags":"City","Latitude":"36.108026","Sighting Duration":"Undisclosed","Disposition":"Hoax","Object Shape":"Diamond, Sphere","trends":["There have been 2 other sightings in Spring Valley","There were no other sightings in Spring Valley on or around August 31st 2011"],"Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=36.108026,+-115.245001(31352)&iwloc=A&hl=en\"> mufon case (31352) map </A>","Region":"Nevada","Longitude":"-115.245001","City":"Spring Valley","Case Number":"31352","Viewing Distance":"21-100 Feet, Over 1 Mile","Country":"United States","Summary":"Seen 4 UFOs over highway by my house and in the sky towards Henderson.","divs":["sighting detailsi was waiting for my shuttle bus to college as i noticed a bright reddish bright light somewhat blinking but thought it was a airplane. its 5am and we are heading down the highway now and i noticed a really small starlike thing moving and blinking like crazy then i seen two more of those and thought i was just seeing things. at that moment i saw a huge diamond black\\gray object it had 5 red lights under it on each corner and one in the middle and 2 white lights on oppisite ends of the diamond object i was directly under it at this point i was frozen with shock at what i saw. there was another person with me including the driver but the other person was asleep and the driver was not paying attention. now recently i have seen 7 red orange orbs flying over vegas a few days ago. after my close enconter i was having an anxiety attack when i got to the school i had to go straight back home because i could not stop shaking from what ive seen it scared me . you can choose not to believe me, but i know what i saw i can decribe every single detail of the bottom of the huge object. anyway as i was waiting for my ride back home i continued to watch the huge object hover the go up slowly and slowly headed towards the southern mountains. following along i seen the starlike objects flying crazy blinking white light till the dissappeared."],"files":["/var/www/straped/mufon/html2text/31352.html.txt","/var/www/straped/mufon/org/31352.html"],"Date Submitted":"08/31/2011 12:38 UTC","Log Number":"US-08312011-0015","Weather Factors":"Unknown","Object Features":"Other"}