{"Case Number":"31359","Summary":"I've been witnessing detailed cloud apparitions for over a year now.","Object Shape":"Other, Unknown","Object Flight Path":"Stationary","Sighting Duration":"00:01:00","Country":"United States","City":"O'Fallon","Latitude":"38.609418","Viewing Distance":"Over One Mile","Longitude":"-89.929604","Object Features":"Other","Date of the Event":"05/15/2010 03:00 UTC","Log Number":"US-08312011-0022","map":"<A HREF = \"http://maps.google.com/maps?q=38.609418,+-89.929604(31359)&iwloc=A&hl=en\"> mufon case (31359) map </A>","trends":["There have been 4 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around May 15th 2010","This sighting has been favorited 1 time.",""],"Date Submitted":"08/31/2011 05:02 UTC","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Region":"Illinois","divs":["Sighting DetailsIt begins with a UFO sighting in my backyard where I saw searchlights shining from the local Scott Air Force Base, then a black shadow jump from tree to tree about 40 feet in the air. That was March of 2009. During the same month an apparition of a tall body with a narrow chin face appeared to me through a cloud of tobacco smoke as I smoked a cigar in my backyard. Then in Spring 2010 I began to Ghost Hunt at my house as I took dozens of detailed photographs of paranormal phenomena (apparitions, shadows, orbs, and images emblazened into woodgrain walls and carpet). During this same time through the summer of 2010, I began to take pictures of these apparitions forming within the clouds as I walked. I have dozens of pictures of supernatural apparitions within cloud formations that I only noticed after taking these pictures of normal weather phenomena, and enhancing their contrast, shadows, and lighting on photoshop. These photographs are in no way falsified or a hoax. They are 100% real, and you can tell by zooming in around the apparitions and finding zero pixelation which would indicate tampering or introduction of a new layer. I'm attaching the best 3 in this report, but I have dozens more. I am also emailing your director and editor the rest of these photos in hopes that you'll contact me and we could possibly meet in person someday to discuss this. I've already spent 3 weeks in county jail and 9.5 months in a state mental hospital after repeatedly sending these photographs in emails to the local newschannel5 KSDK (NBC) in St. Louis. I won't give up this fight for what is right until the American Public are shown these images by the American Media. I need your help. Thank you and good day, Your Fellow Countryman."],"files":["/var/www/straped/mufon/html2text/31359.html.txt","/var/www/straped/mufon/more/31359_submitter_file1__jetexahusttrail6-9-101at630pm.JPG","/var/www/straped/mufon/more/31359_submitter_file2__jetexhausttrailcross6-9-102at630pm.JPG","/var/www/straped/mufon/more/31359_submitter_file3__stormcloud6-15-101at215pm.JPG","/var/www/straped/mufon/org/31359.html"],"Weather Factors":"Unknown"}