{"Object Features":"None","files":["/var/www/straped/mufon/html2text/31355.html.txt","/var/www/straped/mufon/org/31355.html"],"Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-112.418177","Log Number":"US-08312011-0018","trends":["There have been 5 other sightings in Chino Valley","There were no other sightings in Chino Valley on or around July 23rd 2011"],"Case Number":"31355","Date of the Event":"07/23/2011 01:18 UTC","Summary":"saw a floating orb accelerate into slow arc.. a cloud shrouded rectangle straffed orb at high speed--orb turned back toward me, cloud returns from left and straffes orb, bright glint light, cloud goes away, orb comes to me hovers 3 minutes then goes","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Arizona","Date Submitted":"08/31/2011 03:07 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI was girlfriend back yard. I heard crows looked up to see crows circling over trees in backyard. above them I see a white floating sphere, aspirin sized. it proceeds flat and moving very slow south..looks like a plastic pab in wind.suddenly it moves alittle faster and turns in an arc to the right and higher..it then turns downard aliitle..all of a sudden from the right comes what looks like a rectangle shaped cloud, like a dash of a cloud--it is moving very fast from the right and just misses the orb and speeds off to the left. we are atill looking at the white orb that now starts to descend towrds u...the rectangle cloud comes fast from the left and crosses the orbs path, as the starnge fast rectangle cloud just passes the orb a very bright glint from the 1pm high sun in the cloudless clear blue sky bouncing off the structure within the clud as it swings by--blinds us. very bright shiny silver glint. the cloud flies off to right at 3 times the speed of the fighter jets that fly at high altitude over my house. the orb is still descending back towards us and returns back to the original spot above the reesline in my back yard, it hazs now completed a colplete circle. it hovers there for a minute or 2 as i am pointing and we are excitetly talking about--what was that? i run 25 feet to kithcen an binoculars--come out raise glasses and it is no loger visible. She tells me it just moved away behind the visible treeline. I am atrained navy navigator and snoopy team observier. i know the differences between lights and objects--from a ship in high seas, bobbing up aND DOWN IN THE DARK AMONGST OTHER LIGHTS AND OBJECTS- i have personally operated and been in jets and advanced systems as a boat driver a member of elite 6 man special boat unit ie riverrat.. U do not assume this is a non human craft--but the fact that they made no sound at all--hovered , moved and stopped atr will in any direction,... and that the white cloud shroud covered craft went from one side of the sky to the other and then back at high speeds--silently--makes me have no doubt that i have witnessed the interaction of not one but two highly intelligent and highly advanced UFOs. If y ou have any info regarding what I have seen--you must...please reach out. thx-"],"City":"Chino Valley","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.767928,+-112.418177(31355)&iwloc=A&hl=en\"> mufon case (31355) map </A>","Latitude":"34.767928","Object Shape":"Cylinder, Sphere"}