{"Date of the Event":"08/29/2011 10:05 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31354.html.txt","/var/www/straped/mufon/org/31354.html"],"Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Summary":"bright light floated up into clouds, had close star to refrence path","Object Features":"None","Log Number":"US-08312011-0017","Disposition":"IFO","Tags":"City","divs":["Sighting DetailsI was at work. I usually take a smoke break at about 10. I, in fact, looked at the clock before I went out. My job runs on keeping track of times, so I know it was 10. I usually like to go the the roof of our building so I can stargaze and the roof offers the least amount of street lights. I was looking in the direction of the big dipper when I saw a large orange light(orb?) floating upwards.I thought for sure it was a star, then I kept watching and it slowly started floating up. I could tell because a star to the left of it was a reference point I used. It was floating very slowly-if I didn't have that star to the left I wouldn't have thought it was anything but a star. There were some clouds in the area and it seemed to go into a cloud. -or vanished. I stuck around and lit another smoke to see if I would see anything else-or to see it pop back out of the cloud-I could see the top of the cloud. It never came back out of the cloud. It was a solid light, no flickering or pulsing. I got very excited during the sighting, I was hoping to watch more. I gave myself another 10 minutes to look but never saw anything in the area. I did go back out to the roof about an hour later to see if I was just looking at a star, but the clouds had moved and there was no stars like what I'd seen."],"Case Number":"31354","trends":["There have been 13 other sightings in Branson","There were no other sightings in Branson on or around August 29th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.652577,+-93.288336(31354)&iwloc=A&hl=en\"> mufon case (31354) map </A>","Date Submitted":"08/31/2011 02:36 UTC","Object Flight Path":"Straight-line path","Longitude":"-93.288336","Object Shape":"Sphere, Star-like","Latitude":"36.652577","Region":"Missouri","Source":"MUFON","City":"Branson"}