{"map":"<A HREF = \"http://maps.google.com/maps?q=47.69335,+-117.279431(31367)&iwloc=A&hl=en\"> mufon case (31367) map </A>","Date of the Event":"08/30/2011 10:45 UTC","Object Flight Path":"Path with directional change","Latitude":"47.69335","divs":["Sighting DetailsI was out on the back porch and was looking at the night sky as I had seen a shooting star prior to the sighting. My porch stands roughly 8 feet off the ground and I have a fairly clear view of the stars considering the street lights in the neighborhood. Roughly five minutes after I saw the shooting star an object flying overhead passed my field of view and was traveling in a straight trajectory approaching from NNW and heading SSE toward Dishman Hills. As I was looking at the object I was trying to process what I was seeing, as I could make out the fact that it was solid, but it appeared opaque in color (almost camouflage). I knew what I was seeing was NOT an airplane, helicopter, balloon, kite, plastic bag, helicopter or bird. I was somewhat mesmerized and rubbed my eyes to try to get a clearer view as I knew what I was seeing was very strange. It had the solid outline of an oval object but it was difficult to make out any other details. A commercial airplane was visible overhead at probably 20 thousand feet (I could see the blinking lights) the object was very close (relatively speaking)and well below the cloud line - but not close enough that I felt alarmed. There were no lights whatsoever and no sound. The object blocked the background but gave off no reflection of the surrounding environment. Instead it appeared somewhat milky and wavy colored (very dimly pulsating?) I got the feeling whatever it was was trying not to be seen - as odd as that sounds. I knew that had I not just happened to look in that exact spot as it crossed my field of view I would have never noticed it. I wanted to rush inside and grab my camera but given the objects speed (50 mph? at a distance of 500-1000 feet?), lack of lights and the darkness, I knew it would soon disappear from my view. I watched as it continued along its flight path in a completely straight line towards the hills. The object made two seemingly impossible flight maneuvers where it shot straight up and then back down to the left as it was passing over Centennial Middle School and then disappeared out of sight. The whole sighting was 10-15 seconds. I was not scared before, during or after the sighting. I was more just trying to analyze what I was seeing. It was very weird and I have never seen anything like it before or since! I stayed outside scanning the sky where I had last seen the object hoping to see it again (I really want to know WHAT it was). I remained outside for about 15 minutes looking - but never saw it again."],"Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Egg, Oval","Object Features":"None","Log Number":"US-08312011-0030","Summary":"noticed a strange object in the night sky that appeared almost opaque in color (whitish-gray)","Date Submitted":"08/31/2011 10:53 UTC","Source":"MUFON","City":"spokane valley","Longitude":"-117.279431","Region":"Washington","files":["/var/www/straped/mufon/html2text/31367.html.txt","/var/www/straped/mufon/org/31367.html"],"Disposition":"Unresolved","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Case Number":"31367","trends":["There have been 2 other sightings in spokane valley","There were no other sightings in spokane valley on or around August 30th 2011"]}