{"Date Submitted":"08/31/2011 09:31 UTC","Sighting Duration":"Undisclosed","Case Number":"31362","Object Flight Path":"Path with directional change,Path then hovering","City":"Hazleton","files":["/var/www/straped/mufon/html2text/31362.html.txt","/var/www/straped/mufon/more/31362_submitter_file1__Pic1.jpg","/var/www/straped/mufon/more/31362_submitter_file2__Pic2.jpg","/var/www/straped/mufon/org/31362.html"],"Longitude":"-75.984428","Region":"Pennsylvania","trends":["There have been 5 other sightings in Hazleton","There were no other sightings in Hazleton on or around August 23rd 2011","This sighting has never been favorited.",""],"Object Shape":"Diamond","Latitude":"40.967991","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.967991,+-75.984428(31362)&iwloc=A&hl=en\"> mufon case (31362) map </A>","Log Number":"US-08312011-0025","Object Features":"None","Country":"United States","Source":"MUFON","Date of the Event":"08/23/2011 03:15 UTC","Disposition":"Unresolved","Tags":"City","Summary":"Within 15 minutes of earthquake spotted black diamond shaped object over Northern part of city.","divs":["Sighting DetailsI did not witness this but am reporting what a family friend saw. I received the pictures and interviewed the friend in great detail to put the report together. Our friend, about 15 minutes after experiencing the minor earthquake, went outside to look around and observed a black diamond shaped object hovering or moving very slowly in the sky. Curious as to what the object was, the friend took a couple of pictures with a cell phone. Our friend isn't a great judge of distance, but believed the object was large and very high, probably at cloud level. It was a relatively clear day with high occasional clouds. The object made no sound or smoke. I asked if it could have been a stealth fighter or bomber and the fried said it wasn't and that they had seen those before and this wasn't it. I asked if the object could have been a balloon, RC plane, debris or a hoax of some kind and our friend said there was no way it was that. I then asked why there weren't more pictures if it was hovering or moving so slowly and there actually is a 3rd picture that I didn't receive yet. I also asked how did it leave the area or go out of view and it actually changed direction and ascended abruptly out of sight. It moved much faster than any plane or jet they ever saw. The oject moved from East to West and I believe took off up. In Pic1 it is farther, in Pic2 it is closer and the sequence confirms the direction of travel. Our friend isn't shook up or affected in any way, but incredibly puzzled by what they saw. Anyone else see something like this in the area? Does it have something to do with the quake? Is it the X37B? Can somebody look at these pics to see if they were altered? I can't see any signs of it when I zoom in to the pixel range."]}