{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 30th 2011","This sighting has never been favorited.",""],"Latitude":"40.739893","Viewing Distance":"Over One Mile","Log Number":"US-08312011-0031","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31368.html.txt","/var/www/straped/mufon/more/31368_submitter_file1__P1140770.JPG","/var/www/straped/mufon/more/31368_submitter_file2__P1140770_2.JPG","/var/www/straped/mufon/more/31368_submitter_file3__P1140771.JPG","/var/www/straped/mufon/org/31368.html"],"Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.739893,+-73.9953(31368)&iwloc=A&hl=en\"> mufon case (31368) map </A>","Object Shape":"Cigar","Object Features":"Unknown","Case Number":"31368","Region":"New York","Date Submitted":"08/31/2011 11:08 UTC","Object Flight Path":"Path with directional change","Longitude":"-73.9953","Summary":"Object slowly moved at height from over Jersey City into New Jersey","Date of the Event":"08/30/2011 12:00 UTC","City":"New York","Tags":"City","divs":["sighting detailslast night in new york (aug 30th) around 10pm i noticed from the apartment windows overlooking the hudson looking out across to jersey city from lower manhattan a hovering, stationary-seeming airborne object over jersey city. it had a bright red light flashing regularly underneath. i enjoy aviation and frequently look out of the apartment windows to see what's what. i knew this wasn't a plane from first glance. i looked at it long and hard because it had an odd bulk to its shape. it seemed too big for a helicopter, and probably therefore was a blimp. my feeling was that it was unidentifiable by the naked eye. it made me pretty inquisitive to know what it was. i watched it hardly moving, maybe progressing but very slow. logic told me it had to be a helicopter, so i got on with other stuff. but when after 10 minutes i saw it was still there and had not changed position much, i decided to photograph it. these pictures were taken with an 8 second exposure. i zoomed one using iphoto. the object is not something i recognise. it is probably some sort of balloon\\blimp. but it would be interesting to know what type, and what it was doing. it continued slowly, progressing inland away from jersey city for about an hour, the flashing red light very prominent and visible. my friends' kids came in not long after i had photographed it and i pointed out the object to them. it must have been seen by thousands. i am sure there is a sensible explanation."]}