{"Country":"United States","Summary":"At8:20 PM two objects were seen by my wife,my neighbors, and myself. One orange, one greenish. They were traveling in different directions.","Sighting Duration":"Undisclosed","Region":"Illinois","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Latitude":"41.810634","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/31364.html.txt","/var/www/straped/mufon/org/31364.html"],"Date of the Event":"08/31/2011 08:23 UTC","Object Shape":"Sphere, Triangle","divs":["Sighting DetailsMy wife was returning from her nightly walk, when she noticed the first anomoly. She called me on her cell phone and told me to go look out the front door,which faces east. She told me to look in the sky above the neighbors house across the street to the east and tell me what I thought was in the sky. As I stepped outside I didn'tnotice it at first, but as it was taking a tract from southeast to northwest, it appeared above the tree a very reddiish-orange,what appeared to be triangular shape made a slow,around 30 second path, which ended by it disappearing about the time it reached the tipp of the cup of the Big dipper. When it reached the apogee of its flight, the second ,greenish white object intersected its flight path travling in the other direction. Being the first had just disappeared, we followed the second to low on the eastern horizon, when the wife said there the other one is again! It seemed to take the same tract as it did the first time, disappearing once again at the point of the cup of the Big dipper in the western sky. Got to go to work in the morning or I'd stay up all night sky watching! Sorry I didn't have my camera. Never have witnessed anything quite like it. Amazing!"],"City":"Morrison","Viewing Distance":"Unknown","Weather Factors":"Unknown","trends":["There have been no other sightings in Morrison","This sighting has never been favorited."],"Longitude":"-89.968797","Log Number":"US-08312011-0027","Date Submitted":"08/31/2011 10:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.810634,+-89.968797(31364)&iwloc=A&hl=en\"> mufon case (31364) map </A>","Source":"MUFON","Case Number":"31364"}