{"Longitude":"-121.983857","Latitude":"37.35246","Log Number":"US-08312011-0023","map":"<A HREF = \"http://maps.google.com/maps?q=37.35246,+-121.983857(31360)&iwloc=A&hl=en\"> mufon case (31360) map </A>","Summary":"Red and black orb spinning like a top","Disposition":"Insufficient Data","Source":"MUFON","trends":["There have been 12 other sightings in Santa Clara","There were no other sightings in Santa Clara on or around June 23rd 2007","This sighting has never been favorited.",""],"Region":"California","Object Shape":"Sphere","Weather Factors":"Unknown","divs":["Sighting DetailsThat day on June 23, 2007 I was headed to school heading north on foot I made a right hand turn on the corner of 7th and Normandie and I saw this thing above a building spinning like a wobbly top, you know when the top is loosing its momentum and it starts to wobble; Luckily that day I had my digital camera, I was taking art at the time at the local college which is why I had the camera that day, I only had a few seconds to react to pull the camera from my backpack, turning it on and snapping the two pictures by the time I had done that the object was gone. I've seen unconventional objects before but this was the first time I had a camera and I felt lucky to have captured it on digital film. The camera model is a Canon Powershot A95 5mp. The pictures don't do the object justice of what I saw that day especially the spinning movement characteristics of the object that I witness that day. Afterwards I took a look at the pictures on the first image it looks like a black sphere, on the second it looks like the object is going, for lack of better word, invisible. Looks like when I snapped the second image I captured the object turning invisible. I added arrows to indicate the location of the object on the pictures and cropped one of the pictures."],"Sighting Duration":"Undisclosed","Object Features":"None","Date Submitted":"08/31/2011 07:02 UTC","Case Number":"31360","Tags":"City","City":"Santa Clara","Date of the Event":"06/23/2007 02:10 UTC","files":["/var/www/straped/mufon/html2text/31360.html.txt","/var/www/straped/mufon/more/31360_submitter_file1__IMG_0239.jpg","/var/www/straped/mufon/more/31360_submitter_file2__IMG_0240.jpg","/var/www/straped/mufon/more/31360_submitter_file3__IMG_0239cropped.jpg","/var/www/straped/mufon/org/31360.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Country":"United States"}