{"Weather Factors":"Unknown","trends":["There have been 27 other sightings in Providence","There were no other sightings in Providence on or around August 30th 2011"],"Date of the Event":"08/30/2011 02:00 UTC","Source":"MUFON","Object Flight Path":"Stationary","Latitude":"41.819574","Date Submitted":"08/31/2011 11:22 UTC","Log Number":"US-08312011-0033","files":["/var/www/straped/mufon/html2text/31370.html.txt","/var/www/straped/mufon/org/31370.html"],"Region":"Rhode Island","Tags":"City","City":"Providence","Sighting Duration":"Undisclosed","Longitude":"-71.430377","divs":["Sighting DetailsWas walking home down Broadway Street between 1:30-2AM on the night of August 30 in Providence, Rhode Island. Admiring the stars, I noticed an unusual 'line' of bright white vertical lights at about 55 degrees and very far away in the distance (star distance). The lights caught my eye because they were perfectly vertical,and very close together, making a straight pulsating line of subtle color changes (very faint however, not obvious at first glance) like how a radio or cell tower might look if it were up in space. This was not a cell tower. When I got home I stood on my balcony transfixed by the lights. The crazy thing happened when I turned my head laterally. If you hold your finger out in front of your face vertically (and keep it like that) and tilt your head from left to right, the perspective of the finger remains the same, it doesn't move, stays vertical. These lights, however, would turn with my head. For example, hold your finger in front of you, tilt your head to the left and also tilt your finger to the left, tilt to the right and tilt the finger to match. It was if the light were connected to my vision somehow, whereby altering my angle of perception altered the vertical nature of the lights. Lying down would cause the lights to match the angle of my horizontal viewing perspective. The lights were there for over an hour, but finally I got bored and went to bed, so they might have been there longer. Not sure what could account for this but I'll look out tonight when I get home and see if I see them again. I gave a psychic wink to the ET's if it's them so maybe I'll have a abduction story before long. Hope not, unless it's fun. Probably too dark for a photo but will try if the lights are back tonight. Thanks!"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.819574,+-71.430377(31370)&iwloc=A&hl=en\"> mufon case (31370) map </A>","Object Shape":"Other","Object Features":"Unknown","Case Number":"31370","Viewing Distance":"Over One Mile","Summary":"Vertical line of lights high in the sky above Providence, Rhode Island","Disposition":"IFO"}