{"Date Submitted":"09/01/2011 01:29 UTC","divs":["Sighting DetailsI live in a very dark area just outside of Joshua Tree National Park. I was having my evening cigarette in front of my house while gazing at the stars as usual. I've seen what I've assumed were satellites before, a solid light tracking across the sky from one end of the horizon to the other. Tonight I saw what at first seemed to be an airplane because of how low on the horizon it was, but I didn't see any blinking lights. It was in the North sky traveling East to West about 25 degrees over the horizon. Then I thought it may be a satellite, but it was moving really fast and smooth. It moved behind a tree so I figured I'd keep an eye on it until it came out the other side. I saw the lights twinkling through the tree as it was making its way past, but it never came out the other side, so I stepped out into the street and I saw it going the opposite direction back behind the tree. So I waited for it to come out the other side. It never did. Then I looked up to about 50 degrees and there was a stationary orangeish light. It then slowly rose a couple of degrees, blinked 3 times and then it was gone."],"Source":"MUFON","Region":"California","Case Number":"31372","Country":"United States","Longitude":"-116.307045","Disposition":"IFO","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Joshua Tree","There were no other sightings in Joshua Tree on or around August 31st 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.128085,+-116.307045(31372)&iwloc=A&hl=en\"> mufon case (31372) map </A>","Weather Factors":"None","Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"Over One Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/31372.html.txt","/var/www/straped/mufon/org/31372.html"],"Date of the Event":"08/31/2011 09:30 UTC","Object Shape":"Star-like","Latitude":"34.128085","City":"Joshua Tree","Log Number":"US-09012011-0001","Summary":"I thought it might have been a satellite at first but then it changed directions","Object Features":"Unknown"}