{"divs":["Sighting DetailsI had just went downstairs to check something that I had cooking on the grill. Being an avid sky watcher, I turned and scanned the sky. I then noticed an extremely bright light coming out of the west. I at first thought that it was a helicopter with a bright search light on. It was then that I noticed that what ever it was it was completely silent. After a few seconds I realized that it was a UFO, so I called for my wife to come out on the upstairs deck and look at it. She came out on the deck and saw it, upon which time I asked her to run in my office and get my camcorder. She brought it down to me and brought her camera too. We both then tried to get pictures of it as it flew overhead and in an easterly direction. Suddenly it dimmed down to about as bright as a bright star. Shortly I lost sight of it, but my wife went around to the front of the house with a pair of binoculars. She then yelled to me that it was returning but at a much higher altitude. By the time I realized what she was saying, it had apparently gained altitude and disappeared. I have seen lights moving in the sky, both in the day and at night before, but never have I seen one that close. I'm used to seeing both planes and helicopters fly over my property so I can definately say that this was neither. It was too slow to be a meteor, and too fast to be a satelite."],"Latitude":"39.658692","Longitude":"-79.641159","Case Number":"31371","Region":"West Virginia","Disposition":"Unknown","Viewing Distance":"Unknown","Date Submitted":"08/31/2011 11:37 UTC","City":"Bruceton Mills","files":["/var/www/straped/mufon/html2text/31371.html.txt","/var/www/straped/mufon/org/31371.html"],"Object Flight Path":"Straight-line path","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=39.658692,+-79.641159(31371)&iwloc=A&hl=en\"> mufon case (31371) map </A>","Country":"United States","Source":"MUFON","Date of the Event":"08/31/2011 09:20 UTC","Object Features":"None","Tags":"City","Summary":"Very bright light first noticed at about 80 degrees. It continued to fly directly overhead and passed me.","trends":["There have been no other sightings in Bruceton Mills","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-08312011-0034"}