{"trends":["There have been no other sightings in Spinnersrtown","This sighting has never been favorited."],"Latitude":"41.208122","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.208122,+-77.190615(31387)&iwloc=A&hl=en\"> mufon case (31387) map </A>","Case Number":"31387","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Summary":"Bright orange UFO heading West, Northwest over Upper Bucks Co, Pennsylvania. Object was large and rectangular in shape and emitted a bright a bright orange flame frame the underbelly.","Object Flight Path":"Straight-line path","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/01/2011 08:20 UTC","Log Number":"US-09012011-0016","City":"Spinnersrtown","Country":"United States","divs":["sighting detailsi am a licensed pilot and very familiar with faa requirements for aircraft lights. while in my car waiting for my daughter to finish her piano lesson at her teacher's house i was talking on my cell phone with a good friend when a very bright object caught my attention. i ended my call in order to watch the mystery object. the object was traveling west by northwest at about 1000-1500 ft. and was traveling at about 150-200 mph. the object was a very bright orange, rectangular in shape with fuzzy edges, and was emitting a flickering bright yellow\\orange flame from the center of the underbelly of the object. the object made no sound. i initially thought that it could be a floating lighted lantern. however, in my opinion, the object was traveling too fast to be a floating candle. the object did hold a steady course but appeared to gain altitude as it sped off in the distance to the west, northwest. the object was completely out of sight in about 10 seconds. it was much larger than any aircraft i have seen at that distance. it had none of the usual aircraft markings and had no flashing strobes, no red or green navigation lights, no landing light, and no tail light. i had a clear view of the bottom of the object as it flew practically directly overhead. it glowed a very bright orange color. i thought that the rectangular shape was extremely unusual and have never before seen an object of this shape flying in the sky. i was in awe of this unusual object and got out of my car to watch it."],"Longitude":"-77.190615","files":["/var/www/straped/mufon/html2text/31387.html.txt","/var/www/straped/mufon/org/31387.html"],"Object Features":"Other","Tags":"City","Object Shape":"Square, Rectagular","Date Submitted":"09/01/2011 10:20 UTC","Disposition":"Unknown"}