{"Region":"Wisconsin","Date Submitted":"09/01/2011 08:36 UTC","Sighting Duration":"Undisclosed","Latitude":"42.886722","Date of the Event":"09/01/2011 01:30 UTC","Object Shape":"Cigar","Object Features":"None","Weather Factors":"Unknown","Longitude":"-89.904413","Country":"United States","trends":["There have been no other sightings in Hollandale","This sighting has never been favorited."],"Tags":"City","files":["/var/www/straped/mufon/html2text/31383.html.txt","/var/www/straped/mufon/org/31383.html"],"City":"Hollandale","Disposition":"Insufficient Data","Case Number":"31383","map":"<A HREF = \"http://maps.google.com/maps?q=42.886722,+-89.904413(31383)&iwloc=A&hl=en\"> mufon case (31383) map </A>","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Summary":"Light pink cigar-shaped UFO seen in broad daylight","Object Flight Path":"Straight-line path","divs":["Sighting DetailsThis afternoon I was taking the scenic route home and noticed a light pinkish-salmon colored cigar-shaped UFO in the sky. The weather was hot, humid, and hazy. As I was driving on Star Valley Road, northeast of Hollandale, Wisconsin, about a quarter mile before the junction with County Road F, I noticed something flying left to right in my line of sight and thought 'small plane'. The object was about the size of a small jet, but an odd color for a jet or plane. Within a couple of seconds I also realized that the object had no wings, no tail, no windows, and had 'soft', indistinct edges. The sky was a light grayish-blue with no clouds, and the color of the object made it blend in with the sky, unlike a plane or helicopter. The object looked like a jet fuselage with no markings, windows, wings, or tail. There were no contrails. I don't know if there was any noise, as I had the windows rolled up and the air conditioning on. The object seemed to move a bit faster than a small plane. After observing it for about 6 or 7 seconds, it disappeared, as if it became invisible. I had a clear, unobstructed view - the object didn't go behind a cloud, treeline, etc. When I reached the intersection of Star Valley Road and County Road F I stopped for several seconds and scanned the entire area. I was able to see for 2-3 miles in all directions, and the object was nowhere to be seen."],"Log Number":"US-09012011-0012"}