{"Disposition":"IFO","Case Number":"31391","Country":"United States","trends":["There have been 31 other sightings in Springfield","There were no other sightings in Springfield on or around August 1st 2011"],"Date Submitted":"09/01/2011 10:53 UTC","Summary":"Looked just like the Jerusalem UFO","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Longitude":"-93.286499","divs":["Sighting DetailsMy Son was driving. We left Springfield, MO in my convertible. I was gazing at the stars as we drove. We were in between Springfield and Bolivar. I could make out the Milky Way haze. It was very clear. I noticed a light coming from a distance, but it did not blink. I pointed it out to my son. I moved very slowly in one direction toward us. Not as high as a jet and not as low as a helicopter. It passed slowly over us and then toward Springfield. I kept watching it from the front and then the back. No blinking lights at all. It appeared to look just like the Jerusalem UFO that was seen on youtube. As I watched it, it faded to nothing. It didn't fade into the distance. It just faded out shortly after passing over. It was not a shooting star. It moved very slowly. On a whim, I dropped my son off at home in Bolivar and drove to the Hospital to check the helicopter. It was parked. The only helicopter in the Bolivar area. I have seen all our local helicopters at night and they have a green and red light and other lights that blink. This thing was a diamond shape light with bright parts extending, like a star. It appeared somewhat like magnesium burning but did not pulsate. It was too big to be a Chinese lantern. I've seen those as well. We witnessed this thing on Highway 13 heading North past the Green county dump. out in the middle of nowhere."],"City":"Springfield","Latitude":"37.215007","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31391.html.txt","/var/www/straped/mufon/org/31391.html"],"Log Number":"US-09012011-0020","Date of the Event":"08/01/2011 09:00 UTC","Object Features":"None","Region":"Missouri","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.215007,+-93.286499(31391)&iwloc=A&hl=en\"> mufon case (31391) map </A>","Object Shape":"Cross, Star-like","Tags":"City"}