{"trends":["There has been one other sighting in Henrico","There were no other sightings in Henrico on or around September 1st 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=37.607715,+-77.589039(31392)&iwloc=A&hl=en\"> mufon case (31392) map </A>","Date of the Event":"09/01/2011 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-77.589039","Tags":"City","Source":"MUFON","Log Number":"US-09012011-0021","Date Submitted":"09/01/2011 10:57 UTC","Disposition":"IFO","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was outside watering the plants on my balcony. I looked up at the horizon and I saw 2 bright white objects, oval shaped, one of them seamed different, longer and bigger, flying in a very close formation. I observed them for a few seconds and I was thinking in the same time if I have time to get dressed, grab my camera and try to capture them on film. The objects were moving in a fast straight pattern. I went inside, grabbed my camera, got dressed and run outside. I had to go in a three clear spot to be able to spot the objects again. I tried to capture them on film but I've stopped after a few seconds because I was loosing sight of the objects and I didn't have time to focus on them. They got pretty far in a matter of seconds. So I switch my camera of photo capture and I snapped a few pictures of the objects. They broke formation and were getting distance between them when I was able to photograph them. Immediately after that they disappear. Not by distance like furthering away, they just disappeared like dissolving very fast in the sky. I have the original un-cropped photos that I cant send you for analysis. I really regret that I lost time, amazed by what I was witnessing and I lost the opportunity to snap photos when the two objects were so close to me and to each other and more detail could be observed."],"Object Shape":"Cylinder, Oval","Summary":"2 bright white objects, oval shaped, flying very close to each other.","files":["/var/www/straped/mufon/html2text/31392.html.txt","/var/www/straped/mufon/more/31392_submitter_file1__crop1.jpg","/var/www/straped/mufon/more/31392_submitter_file2__crop2.jpg","/var/www/straped/mufon/more/31392_submitter_file3__oect2crop1.jpg","/var/www/straped/mufon/org/31392.html"],"Object Features":"None","City":"Henrico","Country":"United States","Region":"Virginia","Weather Factors":"Unknown","Case Number":"31392","Latitude":"37.607715"}