{"Weather Factors":"Unknown","Object Shape":"Sphere","Region":"California","Date of the Event":"09/01/1976 01:12 UTC","Latitude":"37.127118","Case Number":"31397","Tags":"City","trends":["There have been 3 other sightings in Boulder Creek","There were no other sightings in Boulder Creek on or around September 1st 1976"],"divs":["Sighting DetailsCommuting from work from Redwood City to Boulder Creek. On Skyline Bld of top of ridge that devides the bay area from the Pacific Ocean. At points on the road can see both sides clearly. On side is Palo Alto and the other is Pescadaro beach and ocean waves clearly. Small amber sphere came out of the ocean at Pescadero so we stoped aside on Skyline (1200 feet above sea level) and observed. It must of seen our car lights and proceeded toward us (no commuters at that time period. Got larger and larger as came straight toward us then stoped in front of us with no sound. I jumped out of our '72 Toyota Landcruiser with spotlight on top of roof. Jumped up and down waving my arms then sent \"SOS\" signal with the spot light directly toward this incredably large amber ball of light. Each time I did this it would repond up and down, side to side, and diagonally and returned to its original position each time (no sound) After 20 min or so it took off straight up leaving a com trail within a less than a second out of sight (no sound). Question: What is in the Pacific Ocean in the Monterey Gorge? Saw same similar object later and looking as if it was in trouble, then another time leaving com trail grids (about 10 mile squares) in the entire bay area below a 1000 feet One person said it was too old of an incident. San Jose Mercury (Betty Barnical) reporter reported same similar object was sighted at the same time in Pheonix, Arizon. I had her describe the object to me and never revealed my story."],"Disposition":"Unknown","Object Features":"None","Country":"United States","Viewing Distance":"101-500 Feet","Log Number":"US-09022011-0001","Sighting Duration":"00:25:00","Date Submitted":"09/02/2011 12:03 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.127118,+-122.118207(31397)&iwloc=A&hl=en\"> mufon case (31397) map </A>","files":["/var/www/straped/mufon/html2text/31397.html.txt","/var/www/straped/mufon/org/31397.html"],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","City":"Boulder Creek","Longitude":"-122.118207","Summary":"huge amber ball of light that came from Pescadaro Beach ocean to us"}