{"Region":"South Carolina","Country":"United States","Date of the Event":"09/01/2011 11:00 UTC","Object Features":"Unknown","City":"Florence","Longitude":"-79.785186","Tags":"City","Object Flight Path":"Path with directional change","Summary":"disc like shapes, looked like big stars, moved from west, east, south, north.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.191696,+-79.785186(31396)&iwloc=A&hl=en\"> mufon case (31396) map </A>","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"34.191696","Weather Factors":"None","Object Shape":"Circle, Disc, Sphere, Star-like, Other, Unknown","Disposition":"Unknown","trends":["There have been 11 other sightings in Florence","There were no other sightings in Florence on or around September 1st 2011"],"Log Number":"US-09012011-0025","Date Submitted":"09/01/2011 11:54 UTC","divs":["Sighting DetailsI was leaning out of the window in my room at night smoking a cigarette. As I was smoking, looking out at the sky and the stars, four bright white lights came into sight. They were disc like shapes, they looked like stars but bigger. Each one would come in different directions. One moved towards the west, one towards the east, one towards the south, and one towards the north. It looked like they were going around the world, and then they all came back together above me but to my left kinda. They did this pattern for about 3 min, and it was doing it pretty fast as well. I had no Idea what it could be because nothing could project a light that could wrap around like that it was a very confusing situation. I knew it was something not human because no plane, jet etc. can do what it was doing. I called my neighbor because she was over at my house earlier and still up. She went outside and didn't know what it was either, but just kind of \"swept it under the rug\". These strange objects stopped after a while but the whole time I was watching them very intently."],"Source":"MUFON","Case Number":"31396","files":["/var/www/straped/mufon/html2text/31396.html.txt","/var/www/straped/mufon/org/31396.html"]}