{"trends":["There have been 229 other sightings in Las Vegas","There were 2 other sightings in Las Vegas on or around September 1st 2011"],"City":"Las Vegas","Log Number":"US-09022011-0008","files":["/var/www/straped/mufon/html2text/31404.html.txt","/var/www/straped/mufon/org/31404.html"],"Sighting Duration":"Undisclosed","Date of the Event":"09/01/2011 01:30 UTC","Case Number":"31404","map":"<A HREF = \"http://maps.google.com/maps?q=36.120856,+-115.164236(31404)&iwloc=A&hl=en\"> mufon case (31404) map </A>","Object Features":"Unknown","Disposition":"Hoax","Latitude":"36.120856","divs":["Sighting DetailsI was walking down the street to the gas station and saw 3 red ufos it was very far away but the rised towards the sky and then dissappeared. As i got home i stood near the pool area of my apartments to smoke a cidgarette when i saw 3starlike stars rise but the stayed in a triangle shapei notice somewhat of an outline of them it turned out to be a boomerang shapped object i then seen small what looked like stars going back and forth from one end of the object (a small light would go to one end of the boomerang stay for about 30 seconds thenhover away then just went so fast and dissapeared) i noticed to re blue pulsating object below the boomerang moving around the object as if it were protecting it. about a mile away from the boomerang there was a very very bright star i had thought it was a planet but then it proceeded to move to north of nevada i observed these objects till about 2am. i went inside i ate and came out to see if they were still there but they werent at his time it was about 330 am I stared at the sky about 4am a fast white glowing object zig zagged then dissappeared. that was the last that i saw then went to school."],"Longitude":"-115.164236","Weather Factors":"Unknown","Object Shape":"Boomerang, Star-like","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date Submitted":"09/02/2011 12:44 UTC","Source":"MUFON","Summary":"I saw 3 red ufos rise up and a boomerang shaped ufo with many small ufos going to it","Tags":"City","Viewing Distance":"Over One Mile","Country":"United States","Region":"Nevada"}