{"Sighting Duration":"Undisclosed","Longitude":"-85.62591","divs":["Sighting DetailsMe and my ex where driving down highway 18, we had just passed the new ethinole plant that just got up and running like a week or so before. I was just driving down the road when all of a sudden six lights appeared above my car at first i thought it was just big street lights it felt like i was in side a football stadium. and then i asked my ex if she was seeing the lights and she said yes. keep in mind i was going 55 mph when i first noticed it. i then started asking how can this still be in front of me its like it was staying at my speed, 3 min or so had gone by and the lights where still in the same spot in the sky obove my car where i frst noticed them so i decided to slow down to get a better look when i did, it seemed to move then but only because i backed of my speed down to 35. now the craft was a little lower in my view and i had to clime over to the passanger seat to see the other side and i also had to lower my body in my seat to see the left side the thing was massive. it was longer than the distance it was away from me. back to what happend after i slowed down. i stayed at about 35 for 5 min or so when all of a sudden the lights started to do things. the fisrt light turned off then the fourth light turned off then the second light turned off then the fith light turned off then the third light turned off then the sixth light turned off. and at that point i thought it was over and then like 30 sec later all the lights turned on in the some pattern. at that point i was speachless. then it like someone had a light dimer and the lights dimed out this time it took about 3 to 4 second for the lights to lose all power but it kept the same pattern as before. 1 4 2 5 3 6 then as soon as i could i pulled of on a side road and got out and look all over the sky and i noticed that there where 10 plus lights in the sky moving in all directions and no real flight path they where flying in triangle shape squars and just all over the sky and we watche these for about 10 min before we decided to go we where on a scedual and we had wasted enough time and we left."],"Object Flight Path":"Hovering then path,Straight-line path,Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.552563,+-85.62591(31406)&iwloc=A&hl=en\"> mufon case (31406) map </A>","Object Shape":"Oval, Square, Rectagular, Other","Viewing Distance":"101-500 Feet","Region":"Indiana","Date Submitted":"09/02/2011 01:03 UTC","Disposition":"Unresolved","Object Features":"None","trends":["There have been 7 other sightings in Marion","There were no other sightings in Marion on or around June 1st 2008"],"Log Number":"US-09022011-0010","files":["/var/www/straped/mufon/html2text/31406.html.txt","/var/www/straped/mufon/org/31406.html"],"Latitude":"40.552563","Date of the Event":"06/01/2008 12:00 UTC","Weather Factors":"None","Summary":"Very larg flying object, going about fiftyfive miles and hour then down to 35and less slowed when i slowed down","City":"Marion","Case Number":"31406","Tags":"City","Country":"United States"}