{"City":"Calgary","files":["/var/www/straped/mufon/html2text/3140.html.txt","/var/www/straped/mufon/org/3140.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"51.04755","Sighting Duration":"00:00:59","map":"<A HREF = \"http://maps.google.com/maps?q=51.04755,+-114.054322(3140)&iwloc=A&hl=en\"> mufon case (3140) map </A>","Object Shape":"Disc","Country":"Canada","Summary":"Fast Object Over Calgary, Alberta","Tags":"City","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around July 17th 2004"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"3140","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"","divs":["Sighting DetailsAfter watching from a distance of NW Calgary - Tuscany the Calgary StampedeFireworks display in downtown at7E1145pm we decided to stay outside and to bring out my telescope into thebackyard - which faces due south. After looking up for 15mins for new targets totrain the telscope on, I noticed an object coming out of the west movingextremely rapidly. It had a shape that at arms length would fit on your pinkynail. It was not a point of light, it seemed to only reflect ambient light fromthe street lights surrounding the neighborhood - and was slightly brighter thanthe background stars. No lights on it. No sound. No trails . When it was almostoverhead 2s after I first saw it , Ben picked it up and we both watched it flyout due east within7E2s more. So, from horizon to horizon, aprox. 4s travel time Its height isdifficult to describe, as night was clear. Interestingly, it would have traveledover or very near Calgary International Airport and their radar records could bechecked.We do not feel this was a meteor, low flying bird, jet, etc. I am an amateurastronomer, and know what it wasnt. Hope this helps."],"Region":"Alberta","Date Submitted":"07/17/2004 11:59 UTC","Date of the Event":"07/17/2004 11:59 UTC","Source":"MUFON","Longitude":"-114.054322"}