{"Country":"United States","Longitude":"-93.290823","files":["/var/www/straped/mufon/html2text/31407.html.txt","/var/www/straped/mufon/org/31407.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.049316,+-93.290823(31407)&iwloc=A&hl=en\"> mufon case (31407) map </A>","Viewing Distance":"21-100 Feet","Object Shape":"Circle","Date of the Event":"08/19/2011 09:30 UTC","divs":["sighting detailsreport called in to sd and filed by sd. sighting occurred while family was returning from school event. present: husband\\wife\\12 yr old daughter\\14 yr old female friend. the family was returning from high point elementary school and took a wrong turn. they asked for directions and were going home from cheyanne rd down hwy cc. the daughter was the first to notice the 3 red lights in the distant field (75-100 yrds away)which were parallel and rising. the wife was driving and pulled over so they could have a better view. they rolled down the car windows and watched the lights rise to a height of a telephone pole, form a triangle, rise again, spin and form a diamond shape, rise higher (helicopter altitude) form a straight up and down line, flash, then rise very fast straight up and disappear. the area was very dark where the sighting occurred. there were no houses, lights, or passing cars, just fields, hills and trees. duration of sighting: 10 min. time: 9:30pm location: near cheyanne rd\\hwy cc no sound (errie) no emf effect no physical side effects no missing time no animal reaction weather: clear\\hot total number od witnesses: 4"],"City":"Nixa","Tags":"City","Sighting Duration":"Undisclosed","Region":"Missouri","Date Submitted":"09/02/2011 01:09 UTC","Latitude":"37.049316","Summary":"row of red lights rising from field at night with changing alignment.","Disposition":"Unknown","Case Number":"31407","Source":"MUFON","Weather Factors":"None","Object Features":"None","trends":["There have been 5 other sightings in Nixa","There were no other sightings in Nixa on or around August 19th 2011"],"Log Number":"US-09022011-0011","Object Flight Path":"Hovering then path"}