{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsThis is something,tho imprinted in my mind, that is very hard to explain in words. I was walking in the side yard if my Grandmothers home in downtown Lawrenceville when I had the feeling to look up. The sky was a beautiful blue,sort of bluebird color. Something caught my eye to my left,it was very high up. I thought it was a bird as it looked as if it was flapping it's wings but I soon realized this was something slowing down and coming out of beening seen and turning colors. Then the object stopped and I could see the outline and almost dull aluminum like exterior no more colors. This object was approximately 10,000 ft straight up from my viewpoint. It was extremely large and sorta egg shaped. Then another one just like the other came up next to it. I can still see the outline of both against that sky. I looked around to see if anyone else was watching but as I was in the yard and most folks were in cars or walking around the side walks no one else looked in that direction. I looked back up to see what I had already thought of as UFOs. I have no idea how long I watched them hover at that altitude as time seemed to stop. Then the UFO which had come up next to the first moved forward just passed the other and then turned on it's own axis and took off at a very high rate of speed. The other UFO started to turn different colors while not moving and then took off at a very,very high rate if speed then disappeared after several seconds. Then all town sound came back and I looked around again for any sign of witnesses. No one that I know of was around. I served in Army Aviation during the 60's and I have seen every type of aviation aircraft,including the spy planes,nothing,and I mean nothing, comes close to what I saw that afternoon. No aircraft I know of can turn around or move that fast on this Earth. I have learned to live with this knowledge knowing there are some other beings who are much more advanced then we will be,if ever. I have only discussed this with very close friends who understand what I am talking about. A few others have seen UFOs also but one would be hard pressed to get them to come forward. I hope this will help but nothing beats talking about it face to face because there is a few things not very explainable here ."],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09022011-0009","files":["/var/www/straped/mufon/html2text/31405.html.txt","/var/www/straped/mufon/org/31405.html"],"Summary":"(happened around 1979) Inside town noise stopped and it was as if time stood still. I still have no idea why I looked up that day. It was like they wanted me to do so.","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Tags":"City","Date Submitted":"09/02/2011 12:57 UTC","Latitude":"33.957758","City":"Lawrenceville","map":"<A HREF = \"http://maps.google.com/maps?q=33.957758,+-84.000615(31405)&iwloc=A&hl=en\"> mufon case (31405) map </A>","Case Number":"31405","Weather Factors":"None","Region":"Georgia","Source":"MUFON","Longitude":"-84.000615","Disposition":"Unresolved","trends":["There have been 14 other sightings in Lawrenceville","There were no other sightings in Lawrenceville on or around July 1st 1979"],"Object Features":"Other","Date of the Event":"07/01/1979 03:00 UTC","Object Shape":"Egg, Oval, Sphere, Other"}