{"Case Number":"31402","Country":"United States","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/31402.html.txt","/var/www/straped/mufon/org/31402.html"],"trends":["There have been 3 other sightings in Mountain Home","There were no other sightings in Mountain Home on or around September 1st 2011"],"divs":["Sighting Details i was a military brat. my father was a pilot in vietnam and later he flew as a commercial pilot for a number of years. It was about 930pm and my fiance was outback of our duplex and said \"hey come here, quick\". so i joined her outside. She then pointed out an unknown object and said \" Is that a plane?\".The ufo was a starlike craft. We didnt see any red flashing lights, and as it flew by it was silent. The object was a white starlike object traveling horizontally from approximately NW to SE. About halfway through our observed flightpath we witnessed what we thought was a \"shooting star\" intersect with the object. Then my wife said \"its gonna disapear\", i literaly had my hand over my mouth and it got dimmer and it dissaper. From the time me and my f'iance saw this starlike object till it dissapeaed i would guess the distance to be anywere from 25-55 miles , the wasnt an asteroid, meteorite, plane,helicopter,drone, it was unlike any manmade objects i have eer seen. There were not any tall buildings, there was not any cloud cover. and i had a good vantage point to observe. i figured the odds off a meteorite colliding with a plane or any flying objects are slm to none. i am not a professional astronamer, or of any ther sort to certify all distances are of he best of my abilty. i have never withnessed any thing like this in my life before. and i was actually a little worried for some reason."],"Date Submitted":"09/02/2011 12:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.13985,+-115.683428(31402)&iwloc=A&hl=en\"> mufon case (31402) map </A>","Region":"Idaho","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"09/01/2011 10:35 UTC","Log Number":"US-09022011-0006","Sighting Duration":"00:02:30","City":"Mountain Home","Longitude":"-115.683428","Object Shape":"Sphere, Star-like","Disposition":"Unknown","Summary":"Bright white starlike object with straight path observe a shootingstar","Object Features":"Unknown","Latitude":"43.13985"}