{"Date of the Event":"11/30/1970 12:00 UTC","Source":"MUFON","Case Number":"31415","Object Features":"Dome, Window(s)","files":["/var/www/straped/mufon/html2text/31415.html.txt","/var/www/straped/mufon/org/31415.html"],"Date Submitted":"09/02/2011 03:52 UTC","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-122.299448","Latitude":"47.839198","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=47.839198,+-122.299448(31415)&iwloc=A&hl=en\"> mufon case (31415) map </A>","Log Number":"US-09022011-0018","divs":["Sighting Detailsi have seen 3 different UFO's all about 40 years ago but i remember them like yesterday fist one almost everyday occournce at lake serene north of lynnwood wa. best one i watched for 10 minutes or so on top on roof of gulf gas station it was tilted about 20 deg. there were about 5 people like about 3-4 ft. tall 2 white may6be boss's 3 blue's workers they were on the deck working on it i guess i was on my way for a date or something that was 40 years ago. it was still there when i left. the last one was across the street from the gulf gas station going abouve Mc alesters motor cycle shop i think that was the name of the place. just went over the cycle shop was wood's i was driveing at the time after work going to a friends place or something. about 2 years later . the lake serene one was a almost everyday ocrence you could see them i used to have a picture but its long gone now. it had fire comming out from the bottom center cant remember what color it was in all 3 times i was driveing all 3 times i parked & watched the first one lot's of people saw them most everyday at night or dusk second one on gulf gas station after work i worked for seattle school dist.1 as a custodian i was about 20 years old it was kind of strange why it was at 20 deg. angle on gulf roof & people on deck of ship there was no feeling of time i dont know how long i watched it i left because i felt like i had to go."],"City":"Lynnwood","trends":["There have been 9 other sightings in Lynnwood","There were no other sightings in Lynnwood on or around November 30th 1970"],"Object Flight Path":"Stationary,Hovering then path","Object Shape":"Disc","Summary":"disk was ontop of roof of gulf gas station at 20 deg.angle hovering","Weather Factors":"Unknown","Tags":"City"}