{"Country":"United States","Disposition":"Unknown","Region":"Pennsylvania","Latitude":"40.141475","Longitude":"-76.309795","divs":["sighting detailsit was 9pm at my friends house in lititz, pa. we were standing in her front yard talking. i noticed that the moon was rather close to the horizon and looked very bright orange. i told my friend to check it out then realized the moon was to my left so the large \"fireball\" was not the moon. it was the same size as about a quarter of the moon would appear. it changed in shape and hovered and moved in the same general location. then it got much smaller so that it appeared slightly bigger and brighter than the brightest star. my friend took two pictures. it changed color from orange\\red to white. it began to move in somewhat of a circle then flew away from us. it disappeared within a second or two. it was exciting to see it because i've never seen anything strange in the sky before and because it was so large and unique, i am confident that i am not mistaking it for a plane, meteor, or anything else i am familiar with. later, two other people i know told me they saw it at different locations in the same county."],"Log Number":"US-09022011-0015","City":"Lititz","Tags":"City","Summary":"Bright red-orange fireball above horizon changed in shape, size, and color.","Case Number":"31412","Date of the Event":"09/01/2011 09:00 UTC","files":["/var/www/straped/mufon/html2text/31412.html.txt","/var/www/straped/mufon/more/31412_submitter_file1__IMG-20110901-00026.jpg","/var/www/straped/mufon/more/31412_submitter_file2__IMG-20110901-00027.jpg","/var/www/straped/mufon/org/31412.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"09/02/2011 02:29 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.141475,+-76.309795(31412)&iwloc=A&hl=en\"> mufon case (31412) map </A>","Source":"MUFON","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Egg, Fireball, Oval, Sphere, Star-like, Other","trends":["There have been 2 other sightings in Lititz","There were no other sightings in Lititz on or around September 1st 2011","This sighting has never been favorited.",""]}