{"Object Flight Path":"Hovering then path","Source":"MUFON","Object Shape":"Disc, Saturn-like, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.439094,+-92.833447(31411)&iwloc=A&hl=en\"> mufon case (31411) map </A>","Longitude":"-92.833447","Weather Factors":"None","Tags":"City","Disposition":"Unknown","Summary":"Disc shaped craft seen near end of Big dipper with 6-8 smaller silver craft interacting.","Country":"United States","Date of the Event":"08/31/2011 10:10 UTC","Log Number":"US-09022011-0014","Viewing Distance":"Over One Mile","Latitude":"38.439094","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Region":"Missouri","trends":["There have been 2 other sightings in Versailles","There were no other sightings in Versailles on or around August 31st 2011"],"divs":["Sighting DetailsCalled in to SD via cell phone. 10:07pm to 11:05pm August 31, 2011 Versailles, Mo. Witness saw 2 large craft and 6-8 smaller craft interacting with the larger craft. At first he thought they were airplanes, but got his binoculars and saw the Disc structure and the smaller surrounding craft. The craft were located near the end of the big dipper hovering. The large craft had flashing red lights and several shades of green lights that were darker and brighter. EMF-no Animal Reaction: no Sound: no; too high All the craft seemed to be at commercial airline altitude (30,000 ft ?). The 2 larger craft hovered while the smaller craft zipped around in the same area. The larger craft were a little smaller than Jupiter appears, and the smaller were star size. The smaller craft were flying a broken (Z) pattern formation. I was on the phone with the witness through most of the sighting but about 200 miles away looking in the same part of the sky as we spoke. Since I could see nothing described, the action would have to be localized. Debbie Z SD"],"files":["/var/www/straped/mufon/html2text/31411.html.txt","/var/www/straped/mufon/org/31411.html"],"Case Number":"31411","City":"Versailles","Date Submitted":"09/02/2011 02:19 UTC"}