{"Country":"United States","Log Number":"US-09022011-0022","divs":["Sighting Details My friend and i were on our way back to NC from Fl,with me as the passenger.(Our third such trip in as many months.) We were both so tired of the long distance drive that the radio had been turned off hours previously.So it was dead quiet,except for the hum of the little Honda we were in..(Just ready to get to our destination if you know what i mean.) We were approaching the only real clearing and straight road that 38 has to offer.When \"it\" shot down from above and hovered over the road for a moment.(At least a mile ahead of us,at the other end of the clearing.) It then shot toward us at an unreal speed,but just before it hit the windshield it shot upwards(,and yes we both flinched from it.). I immediately looked behind us,and then hung my head out the window to look upwards..but i saw nothing more. Both of us just sat there completely stunned by what we just saw..All that was said between us was..\"Did you see that?\"..\"Yep\"..,and there were no other words exchanged between us about it until the following day. It was slightly larger than a basketball and it's coloring seemed to be both white and yellow,but there was no discerning whether there were multiple lights or if it was just changing rapidly..Who knows,but it was fast!"],"City":"Blenheim","Longitude":"-79.63455","Date of the Event":"09/02/1997 12:00 UTC","Region":"South Carolina","Date Submitted":"09/02/2011 05:08 UTC","Source":"MUFON","trends":["There have been no other sightings in Blenheim","This sighting has never been favorited."],"Summary":"Fireball in South Carolina that seemed to follow the road for a moment.","Object Features":"Unknown","Weather Factors":"Unknown","Object Shape":"Fireball, Sphere","files":["/var/www/straped/mufon/html2text/31419.html.txt","/var/www/straped/mufon/more/31419_submitter_file1__GoogleEarth_ImageSphere.jpg","/var/www/straped/mufon/org/31419.html"],"Case Number":"31419","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=34.479418,+-79.63455(31419)&iwloc=A&hl=en\"> mufon case (31419) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Object Flight Path":"Straight-line path,Path with directional change,Other","Latitude":"34.479418","Tags":"City"}