{"Sighting Duration":"00:00:59","files":["/var/www/straped/mufon/html2text/3141.html.txt","/var/www/straped/mufon/org/3141.html"],"Tags":"City","Summary":"UFO over Redwood City CA","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Redwood City","There were no other sightings in Redwood City on or around July 18th 2004"],"Case Number":"3141","divs":["Sighting DetailsI work at a country club located in northern california near a town calledWoodside. I work security there and I went to empty out my office waste basketand on my way back I was looking in the sky at a hawk that was shieking andriding the air currents. I notice there was a stationary object high up in thesky and it immediately caught my attention. It was very high up and not reallyvisible unless you knew where to look. It was cylindrical and cone like on oneend. The cylindrical part was somewhat fuzzy with not as much detail as the coneend. It was completely stationary in the sky. I watched it for about 25 secondsbut I had to take my eyes off of it as people were driving through the frontgate and I needed to divert my attention. This happened about 3 times and on thefourth time I could no longer locate the object. The object was a mettaliclooking and appeared to be somewhat relective. the body looked fuzzy and sort ofwashed out yet the cone part was larger and had much more visible detail. Myestimation was that it was very high up thousands of feet and very large.bigger than an airliner"],"City":"Redwood City","map":"<A HREF = \"http://maps.google.com/maps?q=37.485215,+-122.236355(3141)&iwloc=A&hl=en\"> mufon case (3141) map </A>","Country":"United States","Date Submitted":"07/18/2004 05:16 UTC","Object Features":"Other","Longitude":"-122.236355","Region":"California","Date of the Event":"07/18/2004 05:16 UTC","Disposition":"Insufficient Data","Log Number":"","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Latitude":"37.485215","Object Shape":"Bullet, Missile"}