{"City":"Flowery Branch","divs":["Sighting DetailsLooking off my deck in the bright afternoon sun My wife and I witnessed at least 3 different objects in the sky. They stayed in a triangular pattern but then would break apart and come back together again. We watched them for roughly 20 minutes but they gradually faded off in a distance. I see planes every day and know their common path. These seemed higher up then the average plane but its hard to judge objects in the sky. They also would disappear and then appear in a different place. The location that I saw them in is in Flowery Branch, Ga.I took several photographs with my camera phone but they did not show up in the picture. I also took a video of them with my phone but could not see them in the video either. These were not airplanes! I have never seen anything like it. I called the national ufo hotline to report it but they were not very helpful. I just wanted to document it in case others saw the same thing. This siting was less than a mile of a farm that has had several cow mutilations that was never solved so I felt as though this reporting may be useful I saw this sighting on October 17 2010. I tried to put this date in my form but after I submitted it I continued to get an error. Please correct this if possible"],"Date of the Event":"10/09/2010 06:30 UTC","Log Number":"US-09022011-0027","Date Submitted":"09/02/2011 09:07 UTC","Source":"MUFON","Summary":"Silver/shiny disks or circles","Longitude":"-83.867857","Sighting Duration":"00:30:00","Tags":"City","Region":"Georgia","Latitude":"34.135876","Viewing Distance":"Over 1 Mile, N/A","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/31424.html.txt","/var/www/straped/mufon/org/31424.html"],"Disposition":"Unknown","Object Features":"Unknown","Case Number":"31424","Object Flight Path":"Hovering then path","trends":["There have been 3 other sightings in Flowery Branch","There were no other sightings in Flowery Branch on or around October 9th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.135876,+-83.867857(31424)&iwloc=A&hl=en\"> mufon case (31424) map </A>","Object Shape":"Sphere, Star-like"}