{"Longitude":"-80.220389","Log Number":"","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","City":"Miami","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around June 30th 2004"],"Date of the Event":"06/30/2004 12:30 UTC","Latitude":"25.796449","Date Submitted":"06/30/2004 12:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/3142.html.txt","/var/www/straped/mufon/org/3142.html"],"Region":"Florida","Disposition":"Unresolved","Case Number":"3142","Object Features":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path","Summary":"Miami amber lights","divs":["Sighting DetailsWITNESS STATEMENT from tape recordingI went to walk my dogs. It was about 1215 when I left. I took the dogs, I walkedup a block, I heard an airplane. I looked up because its dark, I like to look atthe lights, theyre pretty. I watched the airplane for a few seconds and then asI could see the tail end of the airplane I at first thought that I saw somethingshoot out of it. It was golden-amber in color. It was moving in the direction ofthe plane, so I knew that it wasnt something that was shot out of the plane.Then I said Oh, thats really coolI just saw a shooting star, even though it wasnt the color or the height atwhich you would usually see a shooting star. And it disappeared. The dogs arestill kind of sniffing aroundI looked up at the sky and saw the same colored light, same size, coming fromthe opposite direction and flying in the opposite direction of the first one Isaw. It also lasted about 20 seconds or so. About a minute later I saw it againcoming from a third different spot and heading back to the original spot wherethey all kind of convened.Then I came back into the house and I thought I had been outside for 10, maybe15 minutes, but it was 1255 in the morning, so I went to bed. Even though thelights were really pretty and I was happy when I saw them, when I went to bed Igot terrified and couldnt sleep and had to turn all the lights on inside myhouse so I could try and rest."],"Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=25.796449,+-80.220389(3142)&iwloc=A&hl=en\"> mufon case (3142) map </A>","Object Shape":"Oval"}