{"Date Submitted":"09/02/2011 12:04 UTC","divs":["Sighting Detailsawakened as usual by my dogs @ around 3:05 am i took them to a field 75 yards east of my apt.i let 1 off leash and tethered other on 30' rope. i looked up and there it was pinkish in color what looked like two jellyfish facing away from each other but connected by rigid tentacles , the rounded spear shaped ends had flowing lights with a constant hue in between ( tentacle part) remember im comparing to two jellyfish, the outer shapes. it sat there like there was a slight distortion between it and i like gas fumes but still very clear visually. it was very large, my guess if it were to be laid in a football field it would cover width and length. i know someone else must of seen this, after watching it for almost a minute i felt my female dog shaking against the back of my legs, scared, i had also let go of the rope that had my male dog sometime during the event, i looked around to see if i could spot him when ALL my hairs seemed to fill with a static electricity, the craft then shot off towards the southeast in a downward angle , still searching for it i saw what was the opposite of a falling star shoot up into the sky with a tail of light behind it, miles to the south of me. i did find my male dog back on my porch, im talking about a dog that would live in that field rather than indoors if he could, he was also shaken up badly. both dogs acted very skitish for many hours following, i feel that was the most beatiful thing ive ever seen or could ever see in my lifetime. i would like one of your investigators to contact me, this was not my imagination or a lie or the first experience ive had of this nature. its appreciated that someone finally has the brains to look into these events, thank you. im submitting this to you via ps3 i cannot attach my sketch."],"Region":"Florida","Object Features":"Other","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/31429.html.txt","/var/www/straped/mufon/org/31429.html"],"Country":"United States","Date of the Event":"08/23/2011 03:17 UTC","Log Number":"US-09022011-0030","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Case Number":"31429","Tags":"City","Summary":"two jellyfish connected by rigid tentacles with flowing lights facing opposite direction","map":"<A HREF = \"http://maps.google.com/maps?q=29.221004,+-81.051784(31429)&iwloc=A&hl=en\"> mufon case (31429) map </A>","Latitude":"29.221004","Sighting Duration":"00:01:10","Longitude":"-81.051784","City":"Daytona Beach","Source":"MUFON","Object Flight Path":"Hovering then path","trends":["There have been 13 other sightings in Daytona Beach","There were no other sightings in Daytona Beach on or around August 23rd 2011"],"Weather Factors":"Unknown"}