{"Object Features":"None","Weather Factors":"Unknown","Case Number":"31430","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Region":"Illinois","Disposition":"Unresolved","Tags":"City","trends":["There have been 3 other sightings in Wilmington","There were no other sightings in Wilmington on or around July 15th 2003"],"Log Number":"US-09022011-0031","Source":"MUFON","Date Submitted":"09/02/2011 12:16 UTC","Summary":"UFO flies in low then ascends to other crafts","map":"<A HREF = \"http://maps.google.com/maps?q=41.365687,+-88.109612(31430)&iwloc=A&hl=en\"> mufon case (31430) map </A>","City":"Wilmington","Latitude":"41.365687","files":["/var/www/straped/mufon/html2text/31430.html.txt","/var/www/straped/mufon/org/31430.html"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-88.109612","Country":"United States","Date of the Event":"07/15/2003 11:30 UTC","divs":["Sighting DetailsWorking at Joliet Army Ammunition Plant back in July of 2003 I was having my truck de-conned to leave our work area. On the horizon coming toward me I noticed a silver object that resembled a party balloon(octagon) in shape but was spinning very quickly and was much larger. The sun reflecting off of the edges of the craft gave it an appearence of pulsating. My first thought was that it was a helicopter. It remained on an Eastward path toward me and suddenly made an abrupt turn to the north and started to ascend rapidly. As it climbed up above what clouds were there, I noticed two other formations of crafts. They were in a diamond formation, with 6 in one formation which was 4 in a diamond and two that looked like they were forming a second diamond attached, and 3 in the second. The one craft that had been flying near the ground then filled in the second diamond shape. My co-worker and I both watched in silence, and no one else on the site ever mentioned it. We did not share the experience in fear of ridicule. I would have estimated the speed of the low flyng craft at around 150 mph and the height was anywhere from 150 to 350 feet and then it accelerated quickly on ascent. I would estimate the altitude of the other crafts to have been around 35,000 ft. They also had a silver reflective look to them."],"Object Shape":"Square, Rectagular"}