{"Longitude":"-73.77562","Region":"New York","Source":"MUFON","City":"CLIFTON PARK","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI have only told this story to my immediate family and closest friend. I want to tell it now because I am at the autumn of my life and it needs to be told for my own peace of mind. It was 1972 and I had to go to the store for milk, I had three small children. We lived out in the country and the convenience store was about 5 miles away. There was a burn ban in the area due to very dry conditions. It was dark, and as I was traveling along the road to the store which was elevated from the large field below by approximately 8' on a large slope. There were no other cars on the road at the time. As I drove along the road, in the distance to my left approximately 50-100 feet, I noticed a glowing, burning area that I could not make out clearly from the road as I was on the opposite side and going about 35 MPH. It resembled exactly what a lit cigarette looks like in the dark when someone inhales. It was that kind of a glow, like embers, but very bright and pulsating in the moonlight and the size of a small bon fire but yet not on fire. I remember saying to myself, \" Those darn teenagers around here, they're out in the field starting a bonfire and there's a burning ban on. When I come back from the store, I'm going to knock on the door of the house (which was on the opposite side of the road from the field) and let them know what's going on in their field.\" This was of course before cell phones. When I came back from the store, I had to pull over pretty far onto the opposite embankment facing the wrong way to see where the glowing was as it could no longer be seen from the other side of the road. As I slid over to the passenger side of my car (my window was already opened), there it was. I was at once terrified and transfixed at what I saw, and my heart began to pound wildly. There below me in the distance, approximately 50-100 yards, was a disk about 8-10' across. It was off the ground about 5-6', perhaps hovering, but I saw no visible means of support or heard any noise or witnessed any movement.The entire top of the saucer was invisible, or not there, as if whatever forces were at hand, had put the top down like a car window, and out of sight. I could see clearly down into the craft which was silver in color on the outside. There were instrument panels about 10\" deep (with small squares and grids) encircling the entire inside approximately 3' off the floor of the craft. All the panels were tilted downward at an angle, there was nothing else inside. The diameter or floor space only appeared to be 4 or 5' within the interior. The colors were iridescent, pulsating and neon like, with reds, blues, yellows, and white, like no colors I have ever seen before or again. All this took place within a few minutes because the terror I felt was overtaking me. Upon the realization that there wasn't any entity in the craft and they (I thought at the time) would have seen me. I sped away wondering the whole time if anything was in my car or behind me. My imagination was running wild about what might happen to me. Upon arriving home, I raced in to tell my husband so he would go back with me, but he told me to lock the doors and refused to go back with me. I wanted to call the State Police, but he said no one would believe me and I would be ridiculed, so I didn't. We went back the next day and there was no visible trace of the incident on the ground. I made a sketch of the craft, but over the years, cannot find it. My friend has since married a State Trooper who worked in that county and we talked about it a few years ago. He remembered there were several reports of sightings of a UFO in the area during that time. I am now a grandmother and great grandmother, but this mystery will always be my most amazing and frightening experience."],"Disposition":"Unresolved","Date of the Event":"07/25/1972 12:00 UTC","Case Number":"31435","Tags":"City","Object Shape":"Disc","Summary":"I witnessed a UFO hovering above the ground in a field 1972 and could see inside","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.829256,+-73.77562(31435)&iwloc=A&hl=en\"> mufon case (31435) map </A>","files":["/var/www/straped/mufon/html2text/31435.html.txt","/var/www/straped/mufon/org/31435.html"],"Date Submitted":"09/02/2011 01:54 UTC","Log Number":"US-09022011-0036","Country":"United States","trends":["There have been 3 other sightings in CLIFTON PARK","There were no other sightings in CLIFTON PARK on or around July 25th 1972"],"Viewing Distance":"21-100 Feet","Object Features":"Dome","Object Flight Path":"Stationary","Latitude":"42.829256"}