{"Disposition":"Unknown","Summary":"I saw an UFO parked (landed) along side the freeway, several cars were parked watching it.","Log Number":"US-09022011-0037","files":["/var/www/straped/mufon/html2text/31436.html.txt","/var/www/straped/mufon/org/31436.html"],"City":"The Dalles","Object Flight Path":"N/A","Case Number":"31436","trends":["There have been 7 other sightings in The Dalles","There were no other sightings in The Dalles on or around September 20th 1978"],"Date Submitted":"09/02/2011 03:37 UTC","Latitude":"45.627539","Source":"MUFON","Tags":"City","divs":["Sighting DetailsIt was sometime in the afternoon, I was driving down the freeway from Boardman, OR to Portland. I was in the opposite lane. The craft was landed in a ravine alongside the freeway, outside of The Dalles, OR. There was a State Police car there and 2-3 passenger cars parked behind it, on the side of the freeway, pulled over watching it. I was on my way to the airport so I couldn't turn around and go back to pull over to view it better. I didn't want to miss my plane. I have never forgotten it and always wonder if the cop made some kind of report, or if anyone else reported it. It was so long ago now that I don't remember the exact date. I do know my daughter had just been born (Aug. 28, 1978) and she was with me in the car as an infant, newborn actually, so it had to be Sept. or Oct. of 1978. That's all I have. I'm really hoping someone else reported seeing it because there were people pulled over and the cop there too, plus everyone like me who passed by but didn't stop. It was in the Eastbound lanes and I was traveling west, somewhere maybe around mile post 93? That's a total guess because it happened so long ago. I saw it because it was large and had lights on it. I also noticed the State Police car along side it. It totally looked like a UFO. It wasn't doing anything that I could see, I drove by pretty fast. I was just sitting, parked at the bottom of a \"draw\" or ravine. As near as I can remember it was cigar shaped with red (I think) lights around it. I was so amazed that I had actually seen a UFO!! I wanted to go back but thought \"with a State Policeman there surely there will be something in the paper!\" I really thought there would be a giant uproar about it. But I was on my way to Texas and people were expecting me to be on that plane so I had to keep going. We didn't have cell phones and things like we do now so there was no way to get ahold of my people to let them know I'd be late. I was gone for 1-2 weeks and when I got back I never did hear anything. I lost sight of it as I continued down the freeway, until I couldn't see it in my mirror any more."],"Weather Factors":"None","Region":"Oregon","Object Shape":"Cigar","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=45.627539,+-121.104845(31436)&iwloc=A&hl=en\"> mufon case (31436) map </A>","Longitude":"-121.104845","Sighting Duration":"00:02:00","Date of the Event":"09/20/1978 12:00 UTC","Viewing Distance":"21-100 Feet","Country":"United States"}