{"Tags":"City","Summary":"Lights near Bethlehem, Pa. Massive in size.","Log Number":"US-09022011-0040","Country":"United States","Source":"MUFON","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=40.60843,+-75.484253(31439)&iwloc=A&hl=en\"> mufon case (31439) map </A>","divs":["Sighting DetailsI was driving down the PA Turnpike, south, on my way to work. It was approx 6:30 am on July 3rd, 2010. I was aprrox 5 miles from the Allentown exit when I took note of the morning clouds and the vibrant colors they were displaying. The clouds were low lying and as I was enjoying the colors, I noted a flash of light from within the cloud. The flash was pure white, illuminating the cloud from within. It consisted of two lights, parallel to each other, length approx 100 yards. The pattern followed a daimond pattern, moving in a counter clockwise motion. The size would be approx 800 yards or larger. I thought perhaps something was reflecting on my window, so I rolled down my window. The lights were still there. I then thought perhaps something was reflecting off the clouds while I was driving. I pulled over to observe the lights while stationary. I noted no light source from the ground. The lights were still there although I had traveled a mile or so down the road. As I was watching, two small, pure white circular lights took off from the main source of light headed south. They rate of speed was astounding. They traveled approx 2-3 miles in seconds. One turned left towards NJ, the other south, towards Philadelphia. They moved so fast they were out of sight in seconds. It was then I got an uneasy feeling about what I was seeing. I always thought if given the chance I would want to see unknown things up close, but not that day. I continued to work, and could see the lights for a few more miles. When I got to work, I told my coworkers. Not much to my surprise, I got laughed at. But, the next time I saw one of my coworkers who resides in Bethlehem, Pa., he told me he thought I was nuts. But he saw it on the news that night. Made me feel a little better. I would submit to a polygraph without hesitation. Thank you for allowing me to report this. Anyone else who has seen it, feel free to contact me."],"files":["/var/www/straped/mufon/html2text/31439.html.txt","/var/www/straped/mufon/org/31439.html"],"Case Number":"31439","trends":["There have been 45 other sightings in Allentown","There was one other sighting in Allentown on or around July 3rd 2010"],"Latitude":"40.60843","Disposition":"Unknown","Object Features":"Unknown","Region":"Pennsylvania","Date of the Event":"07/03/2010 06:30 UTC","City":"Allentown","Date Submitted":"09/02/2011 05:53 UTC","Weather Factors":"Unknown","Longitude":"-75.484253","Object Shape":"Diamond"}