{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/31448.html.txt","/var/www/straped/mufon/org/31448.html"],"Viewing Distance":"101-500 Feet","Region":"Washington","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was sitting in my daughters home when she started yelling for me to come outside. \"mom\", she said. \"I dont know what it is, I just dont know, hurry.\" As I got outside, I couldnt believe my eyes,there was these three bright lights and none of them were moving they also werent that far from us. She kept asking what is it? I said in disbelief, \"It must be a UFO.\" I ran to get my husband who was asleep in the chair. I yelled at him to get up and come see this, we dont know what it is. While I was getting my husband, the UFO held still and never moved. Then once we got outside, One light went out and then the other light went out too. It almost looked as if it seperated, But then it started to move right in front of us when all the sudden the third light went out and we saw something like maybe vapor fall out from underneath. But when the lights left there was no noise or anything. We took a picture of the lights and what we think is the UFO. It shows four lights but we never saw more then three lights with our own eyes. The shape was in a saucer, as in one of the old toy tops that you spin. There was also two beams of light coming from underneath the UFO. I was astonished seeing this with my own eyes."],"City":"Spokane","Object Flight Path":"Hovering then path","Log Number":"US-09022011-0049","Latitude":"47.682543","Source":"MUFON","Case Number":"31448","Country":"United States","Longitude":"-117.33454","Weather Factors":"Unknown","Summary":"Still in disbelief it was shocking","map":"<A HREF = \"http://maps.google.com/maps?q=47.682543,+-117.33454(31448)&iwloc=A&hl=en\"> mufon case (31448) map </A>","Object Shape":"Other","Disposition":"Unresolved","Date Submitted":"09/02/2011 09:36 UTC","trends":["There have been 41 other sightings in Spokane","There were no other sightings in Spokane on or around August 27th 2011"],"Tags":"City","Date of the Event":"08/27/2011 10:15 UTC"}