{"map":"<A HREF = \"http://maps.google.com/maps?q=33.989819,+-117.732585(31445)&iwloc=A&hl=en\"> mufon case (31445) map </A>","Date of the Event":"07/04/2011 12:00 UTC","Region":"California","Case Number":"31445","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09022011-0046","City":"Chino Hills","trends":["There have been 2 other sightings in Chino Hills","There were no other sightings in Chino Hills on or around July 4th 2011"],"Disposition":"Unknown","divs":["Sighting DetailsThis report is filed by Steve Murillo, State Section Director for MUFON Los Angeles. This report is a follow on to report number 30017, in which Witness A reported seeing a black \"hockey puck\" like object ambling slowly through the sky near her location in Studio City, CA at approx 8:45 PM on the 4th of July, 2011. Witness A did not take any photos or video of the object. After her sighting, Witness A performed a search on the internet and found a video on YouTube, filed by Witness B. Witness A identified the object in the video as what she saw. Witness B was eventually located and interviewed. This report is a result of that interview. Witness B and her family were celebrating the 4th of July in front of their house in Chino Hills, CA. Chino Hills is approximately 40 miles SW of Studio City and Witness A. The adult witnesses present were she, her husband, her sister, her brother-in-law, and her sister-in-law. At around sunset, the family was lighting fireworks and enjoying the evening, when a strange black object with pulsing lights was suddenly spotted. Witness B already had her camera in hand, and began to film the object. The witness stated that she only filmed the object for about a minute, due to the fact that she had her hands full with a baby in arms, and was simultaneously supervising the other children who were playing with fireworks. She stated that even though she only filmed it for a minute or so, the sighting actually lasted for a good 15 minutes or longer. She called her sister out of the house (also holding a baby) and her husband was helping the kids light fireworks, so he also immediately observed the object. In total, there were eventually five adult witnesses to the object. Witness B stated that the neighbors two houses down also seemed to notice the object. I asked why she and her family seemed to have a casual attitude while viewing the object. She stated that at first she did not know what to think-she is not given to \"believing in aliens\", nor is her family, and at first thought that it might a remote controlled toy. She stated that after watching it for a while, she decided it could not be an RC craft, because it was too large. I asked her how large it appeared to be, and she stated \"about the size of a small helicopter\". The witness stated that the object moved through the sky in an ascending straight line, SE to NW. They watched the object until it disappeared as a small black dot, lost in the clouds."],"Summary":"Dark UAV with red flashing lights on the 4th of July","Country":"United States","files":["/var/www/straped/mufon/html2text/31445.html.txt","/var/www/straped/mufon/org/31445.html"],"Weather Factors":"None","Object Flight Path":"Hovering then path,Straight-line path","Longitude":"-117.732585","Object Shape":"Disc","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"33.989819","Source":"MUFON","Date Submitted":"09/02/2011 08:04 UTC"}