{"Longitude":"-83.902416","Disposition":"IFO","Tags":"City","Summary":"Bright white ball of light that disappeared..","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around September 2nd 2011"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"09/02/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.016552,+-83.902416(31447)&iwloc=A&hl=en\"> mufon case (31447) map </A>","City":"Knoxville","Region":"Tennessee","Date Submitted":"09/02/2011 09:33 UTC","Latitude":"36.016552","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31447.html.txt","/var/www/straped/mufon/org/31447.html"],"Log Number":"US-09022011-0048","divs":["Sighting DetailsI live about 15 miles from the airport, so I am very used to seeing planes and helicopters. Their flashing lights seem to give them away. However, I was sitting on the porch with my boyfriend when I looked up and saw a light so round and bright, I had to ask him if he saw in which he replied yes. I then asked if he saw any flashing lights. Like me, he saw none, so we continued to watch this object. The skies are heavy with airtraffic tonight so it was very easy to see that this was something out of the ordinary. The light was extremely bright white in nature and it seemed to be gliding across the sky very slowly. The intensity and speed of this light favored a meteor, however it wasn't descending and it had no trail of any type. As I continued to watch, it stayed very bright as it moved farther away and within a blink of an eye it literally disappeared. No gradual fade of light, nothing. It just vanished. I have NEVER seen a UFO or anything I couldn't explain but this something that has truly frightened me. If you need anything more from me, please do not hesitate to contact me."],"Object Flight Path":"Straight-line path","Country":"United States","Object Features":"Unknown","Case Number":"31447","Object Shape":"Fireball, Star-like","Viewing Distance":"Unknown"}