{"trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around July 31st 1998"],"City":"Portland","Case Number":"3145","Object Flight Path":"Straight-line path","Disposition":"IFO","Latitude":"45.526992","Viewing Distance":"101-500 Feet","Country":"United States","divs":["Sighting DetailsAround 900 P.M. I was in my mothers backyard to turn the sprinkler off, and wasgazing up at the stars as it was a beautiful, clear, moonless night. As I lookedtoward the north I saw a string of lights-about the brightness of a mediumstar-heading toward me, moving south. At first I thought it might be a string ofballoons reflecting street lights broken loose from somewhere, but almostimmediately I realized that these were not rising, but moving in a straight linetoward me.When I first spotted the lights, they were about 200 yards north andabout 200 feet high. It was not directly overhead but over the street in frontof my mothers house, app.60 ft. in front of where I was standing. It was movingabout the same speed as a car would , app. 15-20 mph. It was a string of about10 lights, evenly spaced app. 10-15 ft. apart. Just as it was almost to me, 3 or4 lights in the center of the string went out. As it passed , I noticed thatthere was absolutely no sound, as it is very quiet where my mother lives.Immediately after it passed where I was standing, the lights came back on again.It proceeded south and I watched it for about another 20-25 seconds, about aquarter mile, and was just going to run to my car to follow it, when instantlyall lights vanished as if someone had hit the off switch. I stared in thedirection it had been heading, but saw nothing more. It was such a dark night, Inever did see any shape, but thought that a cylinder or cigar shape wouldprobably be the most likely. As soon as I realized I was mostlikely looking at a UFO, I felt almost shocked. In fact I remember my jawdropping about the time it was directly over me. Immediately after I ran insideand called several of my friends and family to tell them what I saw. At thistime I was a long haul truck driver I now own a business here on Maui and hadbeen experiencing an interesting nighttime phenomena for 11 years. Since 1987when I was a taxi driver, I noticed that many streetlights went out immediatelyas I was passing them, never in front or behind me. Some nights this happened7-8 times. It never mattered what vehicle I was driving, or how many cars infront or back of me there were. I often wonder if that had any connection to thelights going out when it passed by me. Being a truck driver, I saw many strangethings, but nothing has ever come close to what I saw that night that I cantexplain.Every night when I look at the stars, I still look for a string of lights,although I dont know whether I want to see"],"Tags":"City","Object Features":"Undisclosed","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=45.526992,+-122.674487(3145)&iwloc=A&hl=en\"> mufon case (3145) map </A>","Source":"MUFON","Date Submitted":"07/31/1998 09:00 UTC","Summary":"UFO sighting in Portland, OR","Weather Factors":"Unknown","Date of the Event":"07/31/1998 09:00 UTC","files":["/var/www/straped/mufon/html2text/3145.html.txt","/var/www/straped/mufon/org/3145.html"],"Sighting Duration":"00:00:59","Region":"Oregon","Log Number":"","Longitude":"-122.674487"}