{"Case Number":"31467","Object Shape":"Other","Country":"United States","Object Features":"Window(s)","City":"Center","Viewing Distance":"101-500 Feet","Longitude":"-94.258455","Date of the Event":"10/11/1985 10:00 UTC","Sighting Duration":"01:00:00","files":["/var/www/straped/mufon/html2text/31467.html.txt","/var/www/straped/mufon/org/31467.html"],"Tags":"City","Source":"MUFON","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI was a senior in High School. It was 10:30pm. My mother went outside to throw left over food over the fence for the racoons. I heard her scream my name. I went outside near the fence and she pointed east and yelled, \"Look!\" There was a disk shaped object about 100 yards away hovering above the tree line on the other side of a large open field. It was the size of a football stadium. Biggest thing I've ever seen. There were a few lights along the lower half of the object. The appearance of the object was black. I could see a single row of windows along the edge. The object dropped behind the tree line and landed. We could see the lights through the trees. It then rose back up silently above the tree line again. It then took off at an incredible rate of speed along our line of sight. So it appeared like it just disappeared. We went back inside and realized that much time had passed. When I went out side the TV show Nightline was on. It started around 10:30pm. When we came back in it was 2:00am and we don't know why so much time passed. We went into separate rooms and drew pictures of the object which I still have today. This is the first time I've told anyone about this except for my wife."],"Disposition":"Unknown","trends":["There have been no other sightings in Center","This sighting has been favorited 1 time."],"Log Number":"US-09032011-0004","Region":"Texas","Latitude":"31.728093","Date Submitted":"09/03/2011 12:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.728093,+-94.258455(31467)&iwloc=A&hl=en\"> mufon case (31467) map </A>","Weather Factors":"Unknown","Summary":"Enormous disk like object with lights hovered over tree line. Dipped belowe tree line and landed. Rose up, hovered and left at high rate of speed."}