{"Summary":"Hawks and Pidgeons DONT hover together, yet now I","files":["/var/www/straped/mufon/html2text/3146.html.txt","/var/www/straped/mufon/org/3146.html"],"Weather Factors":"Unknown","Object Shape":"Boomerang","Source":"MUFON","Country":"United States","Date of the Event":"06/18/2004 10:15 UTC","divs":["Sighting DetailsPhoenix, Arizona..Car battery was dead, needed smokes, started to walk fromhome,old,tiny,enclave, horseshoe type, neighborhood in desert, use to be whereTuberculosis people came to get healthy back in 30s,very quiet littlecommunity,also surrounded by mountains...walked south then west then south, theneast around neighborhood block, about 5min altogether. I walk fast..about 75ftlater I saw the hawk laying on the wind and smiled, love metaphysics, took it tomean a good omen...been having a rough time for too long....car trouble wasntneeded.. sky perfect.aprox 1015am...clear as a window,only thing in sky is thehawk, azure blue, not one cloud, very sunny,aprox 90 degrees,had sunglasses on,head down still walking, look to my left again aprox. 200ft away, hawk stillfloating on the air, back and forth gliding,about 100ft up, but now I noticenortheast of hawk,I thought at time aprox. 100 feet away from hawk,and a bithigher,what I take to be a white pidgeon, doing the same thing, many pidgeonsaround here, think private breeder in neighborhood as well, see them releasedand fly as a group occasionally and go back to same place always... been here 312 years. Head down and still walking, look again, that bird is awful white. Hdwn, stil wlkg,lk again, didnt realize pidgeons layed on the air like a hawk, Hdwn, stil wlking, WHY would a pidgeon want to play on the wind NEAR a hawk Ilook up again, stil wking, and the pidgeon is not floating back and forthanymore, its hovering, same place, but wings arnt moving at ALL, must be astrong updraft, but now where is the hawk I look at the pidgeon again and Ithink man, that must really be a CLEAN bird cause the lite is reflecting off thetop of it like crazy, use to have a cockatoo and 2 amazons for 15 years, shineyfeathers but not THAT shiney and I slow down and stop, turn and payattention.......its still just hovering, no wing movement, how far is it Am ISURE its not a plane yes, sure......planes dont float back and forth, is itpidgeon, no updraft or wind to keep pidgeon up, no wind at ALL...how can it DOthat IT CANT, what the hell is this Then I look for the hawk, nowhere, thatwas too fast,all this conversation in my hea"],"Tags":"City","Object Features":"Other","Date Submitted":"06/18/2004 10:15 UTC","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Other","Case Number":"3146","Longitude":"-112.069627","map":"<A HREF = \"http://maps.google.com/maps?q=33.451337,+-112.069627(3146)&iwloc=A&hl=en\"> mufon case (3146) map </A>","Region":"Arizona","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around June 18th 2004"],"Sighting Duration":"00:10:00","Log Number":"","City":"Phoenix","Latitude":"33.451337","Disposition":"Unknown"}