{"Country":"United States","Object Flight Path":"Path then hovering","Date of the Event":"04/02/2011 06:30 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.477057,+-87.529052(31465)&iwloc=A&hl=en\"> mufon case (31465) map </A>","files":["/var/www/straped/mufon/html2text/31465.html.txt","/var/www/straped/mufon/more/31465_submitter_file1__1.jpg","/var/www/straped/mufon/more/31465_submitter_file2__7.jpg","/var/www/straped/mufon/more/31465_submitter_file3__10.jpg","/var/www/straped/mufon/org/31465.html"],"Longitude":"-87.529052","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"41.477057","Object Shape":"Other","Date Submitted":"09/03/2011 12:18 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","trends":["There have been 4 other sightings in Dyer","There were no other sightings in Dyer on or around April 2nd 2011","This sighting has never been favorited.",""],"Region":"Indiana","Log Number":"US-09032011-0002","divs":["Sighting DetailsIn early April my huband and I were looking out the window and noticed a UFO and then we realized there were several of them. We saw a group of UFO's in the sky across the street from our home. I noticed it because it was out of place in the sky and I realized it was a UFO. We immediately got our digital camera and started taking a series of 15 pictures. The UFO's were in a sort of straight but diagonal line, there were 4 of them. 3 were in a line and one was off to the left side. We watched them sort of moving in and out of the clouds or changing shape and slowly descending in unison. They were very reflective of the setting sun.They moved in unison the whole time, and when the event was over the blended in with the clouds and disappeared. The whole thing lasted a bit more than 5 minutes. The series of pictures in a row shows hte movement of the objects. The helicopter was too far away to hear it, or to tell if it was a black heliecopter or not. We were excited but remained calm and had no further issues resulting from the event. We did not write down the date, time, or our observations at that time."],"City":"Dyer","Summary":"Reflective Hatch Mark -like group of 4 UFO's","Object Features":"None","Case Number":"31465","Disposition":"Insufficient Data"}