{"divs":["sighting detailsthis is the second time we have wittnessed this object. first time was in july 2010 just south of due west. it lasted for about two hours and we saw a small white object fly past at hight speed in a upward direction.i figured it was a weird star and a meteor passing at a strange angle. i contacted a friend that works for a local news station to see if anyone else reported anything strange. he told me they had no reports. so i left it at that. my stepson who was with me the first time we saw it, told me he had seen it a few more times. i really did not bother to look, and laughed it off still believing it was just a strange star. the second time was tonight (9\\2\\11) 10:30pm about an hour ago. aporx 30 to 40 degrees north of due west. same flashing, stationary lights, but when a plane passed near , it dissapeared. 5 min later it was back. i just went out to look again at 12:02 am in is now in the east sky aprox 50 degrees north of east.. i did not see it move position, and no other star in the sky looks like it! this is happening now!!! i filmed the object...at 12:20 am ....it's not a star , or a plane... it is now out of view below the horizon in the east!"],"Latitude":"42.659709","Summary":"stationary pulsating lights(red on bottom, green on top, mixed blue, yellow, white) small white object fly by ( up direction)","Weather Factors":"Unknown","Tags":"City","Log Number":"US-09032011-0003","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.659709,+-73.750732(31466)&iwloc=A&hl=en\"> mufon case (31466) map </A>","Object Shape":"Flash, Sphere, Star-like, Other","Date Submitted":"09/03/2011 12:28 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/31466.html.txt","/var/www/straped/mufon/org/31466.html"],"Source":"MUFON","Case Number":"31466","Date of the Event":"09/02/2011 10:35 UTC","City":"Albany","Country":"United States","Longitude":"-73.750732","Object Features":"None","trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around September 2nd 2011"],"Region":"New York","Viewing Distance":"Unknown"}