{"divs":["Sighting Details1. Soaking in our hot tub, located on a flat plank deck in the backyard.2. I had been looking up at the sky, looking at the constellations and watchingsatellites, aircraft, and meteors traverse the sky.3. A UFOthat is, an Unidentified Flying Object.4. I was surprised. It crossed the sky faster than anything Ive ever seen - 2or 3 seconds, at most.5. What I saw of it consisted of three dim rather than blinding or bright whitelights that were cool in character, like florescent lights rather thanincandescent, arranged in a perfect equilateral triangle. The lights had kindof a poached-egg appearance, in that the center of each circular light wasslightly different in brilliance than the rest of the cirle. I saw it as itpassed from the northwest, directly overhead, and moved toward the southwest. Icould not make out a surface or structure between the lights, but they did notmove in position with respect to one another, so they gave the appearance ofbeing parts of a single structure. The object required only 2 or 3 seconds atmost to traverse an arc of about 45 degrees of open, cloudless sky before treesobstructed my view. If it were a fighter jet traveling at close to supersonicspeed very close to the ground, Im not sure that it could have covered that muchsky as quickly, and certainly could not have done so without any sound.6. Trees that grow on the other side of our backyard fence and the canal bankbeyond them obscured further observation."],"Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around July 20th 2004"],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Object Features":"Other","Log Number":"","Country":"United States","Latitude":"43.621921","map":"<A HREF = \"http://maps.google.com/maps?q=43.621921,+-116.205926(3147)&iwloc=A&hl=en\"> mufon case (3147) map </A>","files":["/var/www/straped/mufon/html2text/3147.html.txt","/var/www/straped/mufon/org/3147.html"],"Date of the Event":"07/20/2004 11:30 UTC","Weather Factors":"Unknown","Longitude":"-116.205926","Date Submitted":"07/20/2004 11:30 UTC","Sighting Duration":"00:00:59","City":"Boise","Object Shape":"Unknown","Summary":"Triangular Craft over Boise, Idaho","Case Number":"3147","Region":"Idaho"}