{"Sighting Duration":"00:00:12","map":"<A HREF = \"http://maps.google.com/maps?q=52.354658,+4.886376(31473)&iwloc=A&hl=en\"> mufon case (31473) map </A>","Object Shape":"Disc","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/31473.html.txt","/var/www/straped/mufon/more/31473_submitter_file1__DSC_0145.jpg","/var/www/straped/mufon/org/31473.html"],"City":"Amsterdam","Weather Factors":"Unknown","Summary":"Checking on my Marijuana plants when something cruised above that was defiantly a UFO","Date of the Event":"09/03/2011 12:23 UTC","Object Features":"Unknown","Longitude":"4.886376","Region":"Noord-Holland","Case Number":"31473","Viewing Distance":"Over One Mile","Latitude":"52.354658","trends":["There have been 8 other sightings in Amsterdam","There were no other sightings in Amsterdam on or around September 3rd 2011","This sighting has been favorited 1 time.",""],"Date Submitted":"09/03/2011 07:00 UTC","Country":"The Netherlands","Tags":"City","Log Number":"NL-09032011-0009","divs":["Sighting DetailsJust so everyone knows I was never a believer until the other day when I saw something passing in the sky that was defiantly not a Bird, Plane, Balloon, Smudge on my camera, Star or Satellite it was a flying disk shaped vehicle. This did scare me quite a lot when i saw this as i just couldn't find any reasoning for what i was seeing. Every day I go onto my roof to feed my weed plants and on sunny days take some photos to show their growth. I was taking shots of the plants from below to make them look bigger, my cousin who was on the roof as well pointed something in the sky, at which point i looked above me to see 3 UFO's flying quite high above us and passing us not crazy speeds but still fast. Straight away we looked at the photos taken on my computer so we could zoom in to see what they were. well see for yourself and and get in contact if I am mistaken. Peace out and keep watching the skys!"]}