{"trends":["There have been 7 other sightings in Manchester","There were no other sightings in Manchester on or around September 3rd 2011"],"Latitude":"35.496724","Summary":"Moving Star(s)","Sighting Duration":"Undisclosed","Date Submitted":"09/03/2011 07:13 UTC","Weather Factors":"Unknown","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/31474.html.txt","/var/www/straped/mufon/org/31474.html"],"Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=35.496724,+-86.110805(31474)&iwloc=A&hl=en\"> mufon case (31474) map </A>","Longitude":"-86.110805","Country":"United States","Log Number":"US-09032011-0010","Object Features":"None","Date of the Event":"09/03/2011 04:45 UTC","Region":"Tennessee","Object Shape":"Star-like","Case Number":"31474","Viewing Distance":"Unknown","divs":["sighting detailsmy fiance and i have been star gazing lately and we've noticed some phenomeneon we have never seen lately. from approximately 4:45am - 5:15am 9\\3\\2011 we witnessed what appeared to be a moving star traveling north, south and west. we witnessed this 5 times in 45 minutes. the first time we seen it heading north and it remained in our view for about a minute and 10 seconds. i ran in and checked the time soon after we lost sight of it as it traveled out of our sight, 4:48am. the second time we were in the front yard and my fiance seen a large ball of white light the size of a cantaloupe, shoot off south west, leavign a trail, when we witnessed the same star like object heading south this time. when she seen the huge white ball she choked. the third time we were in the back yard and we noticed a plane moving west, and as were observing that we noticed the star like object moving west, going out of sight. the 4th time we were on the back porch again hoping to see this, and we did as with the plane. the plane was heading west and the star like object was heading north again. i ran out to the front yard to try and keep this in sight and i saw (i assume the same object) heading south. i kept this in sight for about 2 minutes, watching it turn from the star like blue to a red, back to blue, red again until it went out of sight behind the tree lines. it seems like 3am - 5am is he best time to witness this lately."],"Source":"MUFON","City":"Manchester"}