{"Date of the Event":"09/01/2011 12:00 UTC","Viewing Distance":"Over One Mile","Summary":"saw large colored light in sky followed by light flashes","map":"<A HREF = \"http://maps.google.com/maps?q=38.12248,+-121.161649(31475)&iwloc=A&hl=en\"> mufon case (31475) map </A>","City":"Lodi","Region":"California","Longitude":"-121.161649","Latitude":"38.12248","divs":["Sighting Detailson 9-1-2011 I woke at 11:45 to the dogs' furious barking. After 5-6- minutes, I went to my west window to see what was causing them to bark. About 20-25 degrees up I saw a red and yellow object. Clearly visible were rows of alternating red and yellow lights in a circle formation, which was at least the size of my thumb. After perhaps 15 seconds it began to scintillate, with each light visibly twinkling. I ran for my camera, and when I returned (approx. 10 seconds) the object had descended near to the western horizon. I watched hoping it would reappear. Suddenly at a point nearly above my house two bright flashers appeared. These flashers were like those emitted by strobe lights, bright white and much larger than a planes lights would be. They vanished above my house toward the east. Ten seconds later another such light appeared - just suddenly popping into view in the middle of the sky. Followed in a few seconds by another, and another, until six had appeared and (presumably) went eastward. I went to my kitchen window (east side of the house) and scanned the sky, but all I saw was Venus and other stars. During the time I observed these phenomena there was no sound and NO other lights (like planes) visible. Air traffic at late night in this area is rare, and usually will be coming from the southeast as planes are making their landing approach to Sacramento airport."],"Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Circle, Flash","files":["/var/www/straped/mufon/html2text/31475.html.txt","/var/www/straped/mufon/org/31475.html"],"Disposition":"Unknown","trends":["There have been 20 other sightings in Lodi","There were no other sightings in Lodi on or around September 1st 2011"],"Log Number":"US-09032011-0011","Country":"United States","Case Number":"31475","Date Submitted":"09/03/2011 02:19 UTC","Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","Weather Factors":"None"}