{"Source":"MUFON","Date Submitted":"09/03/2011 07:46 UTC","City":"Redlands","Date of the Event":"10/31/2000 12:00 UTC","Latitude":"34.061539","Viewing Distance":"Over One Mile","Sighting Duration":"00:00:10","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/31483.html.txt","/var/www/straped/mufon/org/31483.html"],"Country":"United States","Case Number":"31483","trends":["There have been 10 other sightings in Redlands","There were no other sightings in Redlands on or around October 31st 2000","This sighting has never been favorited.",""],"Longitude":"-117.178138","Log Number":"US-09032011-0019","Disposition":"IFO","Region":"California","Summary":"UFO seen over Redlands , CA in 1999 or 2000 looked like a rapidly moving star.","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other","divs":["Sighting DetailsOn October 31st in the year 1999 or 2000, three friends and I were in the car on our way to a Halloween party in Redlands, California around 9pm. My friend was looking for a place to park and I was looking at the moon because it was full that night. Then I spotted what I thought at first was a falling star. I told my friends to look at the falling star. We all stopped and watched from the car as the star suddenly came to an abrupt stop. At that moment our Ooos and Awws became gasps of confusion and shock as we watched the star make a precise triangular maneuver. I was still confused as to what I was now looking at because I knew it was no longer a falling star. I remember one friend saying, \"It's a UFO, It's a UFO\" repeating himself in astonishment. I now couldn't believe what I was seeing. The starlight then starting moving North at about 500 mph and started a blinking light pattern with different colors. Red being one of the colors I remember for sure. after the blinking light pattern, it then appeared to charge up with an extremely pure white light and then shot off unbelievably fast. In the blink of an eye, it was gone. I was then convinced that yes, as my friend had said, it was a UFO. I was in shock, but also felt really lucky to have witnessed such a phenomenon. I had never seen anything like that before and till this day, as I search countless on-line videos clamming to be footage of UFOs, I still have not come across anything that looks like what I saw. The UFO's lights were so pure and bright, I've only seen light like that in stars and no aircraft that I know of as a civilian goes way past mach 10 or at the speed of light."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.061539,+-117.178138(31483)&iwloc=A&hl=en\"> mufon case (31483) map </A>","Weather Factors":"Unknown","Object Shape":"Star-like","Tags":"City"}