{"Weather Factors":"Unknown","Date Submitted":"09/03/2011 07:15 UTC","Object Flight Path":"Straight-line path","Summary":"My friends and I saw a large black triangle with large blue white lights on the back end of craft.","divs":["Sighting DetailsI had experienced other strange encounters in the past before this event took place. I had never really given much thought however to the past experiences. In 1991 I was with some friends swimming after dark at a nearby lake when we all witnessed several small flickering lights that danced above the surface of the water, and then instantly one by one shot straight into the air, disappearing from sight once they reached the height above the treeline in the distance. We all thought it might have been car lights reflecting on the water, or maybe someone in the woods with lights that were playing tricks on our eyes. We never really knew how to explain what we saw, we just knew we had seen it and it was enough to make us get out of the water. All we really knew was the objects resembled the actions of fireflies or lightning bugs but were moving and flashing at a higher rate of speed. And according to the distance across the lake from where we were, we all agreed they must have been about the size of baseballs or softballs. Needless to say it wasn't something I would forget, but still questionable, or at least I thought it was at the time. Then, in 1995, I was talking with a friend outside of our church building. We saw what looked like 5 golden meteors, all different tail lengths, stream across the sky above us. Their tails looked like amberish gold flakes or some sort of fiery golddust. Again, kind of spooky to think of something that close to me, but I always thought it must have been meteors or something like that. We even entertained the thought that it would be really neat if they were angels! But without any proof we just chalked it up as something natural that we had witnessed. In '97 or '98, I can't be certain of the year, I was driving on an interstate that winds through a lot of trees. Upon driving past a point where the trees clear for a bit, I was met by other drivers that had pulled over on the side of the shoulder. Some were standing outside their vehicles and were pointing to an orb-like object hovering in mid-air approximately 2 or 3 miles from where we were. I pulled over behind one of the vehicles and got out myself. With my eye on the object, I made my way to the guy in front of me and asked \"What is that?\" He smiled, shook his his head and answered, \"You got me! But that lady 2 cars up said it's been there for about 5 minutes!\" It looked like a full moon, brightly lit, stationary, and spooky! Well, before I could get too astonished at what I was observing, and before I could even question what the source of light could be, you know, large flare, spotlight on a plane or helicopter, it began to ascend slightly and very quickly started making distance from our line of sight. In seconds it was as if we all had pinhole vision and we were squinting to see it. Like a star that suddenly quit emitting it's light, it was gone! I didn't even think of it at the time, but I should have exchanged phone numbers with some of the other witnesses while we talked on the side of the road. By the time I did think about it we had already disbursed from the area and were again back on the road. My apologies. Now, several years had passed before my next encounter. This encounter is what prompted me to make this report. I've thought about this for quite some time and finally decided it's time to share with the public this particular experience. Okay, I'm sure by now most everyone has heard of the famous Phoenix lights. If you haven't I would urge you to research it. It's quite interesting and I should note that before this experience I had never heard of the 1997 incident. My son and I moved to Phoenix shortly after my father passed away in '04. Needing a change of pace after a brutal divorce, I took a job training sales associates for a company located in the center of the metroplex. We moved into a small 1 bedroom suite, enrolled him in school, and I started my new job the next day. Our routine would last about year before we would seek a roommate with a larger space. A friend from church had a similar situation so we decided to join forces, and we moved into her garden apartment condo. Fast forward to July 4th 2006. The day was just like any other. I went to work that morning, got home around 4:30 pm and discussed briefly with my son on how his day went. We were preparing to let him spend the night with my roommates grandchild in Scottsdale. After he left with them for the evening, my roommate and I discussed dinner plans. Too tired to go out anywhere, and too hot to grill, we decided to cook inside and invite her daughter and fiance over. After eating we all decided to retreat to the garden patio to visit. It was almost dark outside. The space within the patio area is approximately 12 ft. in width and 42 ft. in length with a 7 ft. wall that encompasses the area. On the west end is a gate that leads to a basketball court, and on the east end is a divider wall that seperates the neighbors patio area from ours. 3 ornamental orange trees lines the length of the south wall. Although having larger canopies now, they are still there according to a google map I looked at today. We no longer live there so I'm not sure of any structural changes. Google won't zoom down far enough to check it out, at least mine won't. Anyway, the time was approximately 9:45-10:00 pm. My roommate had just stepped back in thru the sliding glass door to freshen a glass of tea. Her daughter, fiance, and I were standing by the slider door talking when all of the sudden, something strange happened! Starting at the west end gate and moving quickly across the patio floor, a shadow darkened the whole area, blocking out the reddish looking glow of smog and city lights overhead. We all stopped talking immediately and upon looking upward I almost fell to my knees. My roommates daughter gasped and her fiance darted torward the door but stopped to keep looking up. We thought the sky was falling! It scared the living daylights out of us! Mesmerized, we just kept staring upward. Immediately the air around us had changed. Hearing a slight hum as the craft flew over us, the air felt really thick, and a sense of slow motion took over our bodies. I remember looking at each other, our mouths gaped open, eyes wide, utterly shocked. We all turned in the same direction the craft was flying, positioning ourselves to view it from that angle. My roommate was still inside freshening her tea and I remember hearing a couple of cubes tinkling the bottom of her glass. The kitchen window was open and her daughter called in to her saying \"Mom get out here quick!\" Still looking up, we observed the underbelly of the craft. The whole surface was wavy and shimmering kind of like water at night. There were no lights underneath as best as we could tell, but the surface was like that of mercury or some sort of liquid black metal. The underbelly stretched as far as we could see to the north above the roofline, and as far as we could see to the south on the other side of the block wall that runs the length of patio area. It was mega huge! If you google map the area between Union Hills and West Bell Road, You could get a fairly accurate estimate of the span. Left wing tip Union Hills, right wing tip Bell. After the craft passed over we observed the back end of the craft. This is how we know it was triangular in shape, much like a boomerang. The craft was outlined on top by an edge that inverted toward the center. It was also outlined on the bottom with the same inversion. The estimated space in between was about 30 to 40 ft. about as tall as a 2 story house. Usually when I'm telling someone about this, I usually refer to 5 evenly spaced lights, but because of our field of projectory, it was impossible to see the far left side. We were however able to see 4 lights. The lights were blue-white in color and very bright. They were located directly between the outlines top and bottom and inverted toward the center. All the lights were the exact same size. Two on the right, one in the center, and we assume two on the left although we could only see one. The craft continued east very slowly until it left our field of sight. The whole encounter lasted approximately 1 minute. We were perplexed and amazed and spent the rest of the night talking about it until about 2:30 am. We talked about it often before my son and I decided to move back home. My roommate never did make it back outside in time to see it. I often think back to that night and wonder. Who was piloting it? Was it being piloted at all? How in the world was that thing staying in the air? And why would our government or anyone else's allow such a large craft to fly over the heads of so many people? Obviously there exists a confidence that it's not going to crash. I still ponder it's origin. It doesn't seem like we should have technology that could produce such a machine, but then what do any of us really know? Well, I guess that's about it. I should tell you I haven't seen anything since that night. I'm not entirely sure I want to. But every now and then, after the sun goes down and the stars come out, I will sometimes go outside just to look up at the sky. I pray more now than I used to. Not because of UFO's, but because I have had the opportunity to realize there are things that exist that are much bigger than me. I've learned to trust my creator. I've learned to study the bible and put to practice it's precepts. Is there life on other planets? I don't know. While it seems arrogant on our part to dismiss the idea, I'm not sure I've understood why it would be all that necessary. At any rate, I guess God could do whatever He wants and if he wants et's then I'm sure He will have them. Until we know for sure it's anybody's guess but I can say with confidence that I will never, ever forget that night. Thanks and God bless!"],"Viewing Distance":"101-500 Feet","Disposition":"Unknown","Country":"United States","Longitude":"-112.101526","Source":"MUFON","Region":"Arizona","Case Number":"31480","Object Shape":"Boomerang, Triangle","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around July 4th 2006"],"City":"Phoenix","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=33.618839,+-112.101526(31480)&iwloc=A&hl=en\"> mufon case (31480) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/31480.html.txt","/var/www/straped/mufon/org/31480.html"],"Latitude":"33.618839","Date of the Event":"07/04/2006 09:45 UTC","Log Number":"US-09032011-0016","Sighting Duration":"Undisclosed"}