{"City":"Los Angeles","Viewing Distance":"Unknown","Summary":"Three lights, one bright and large, hover and two small lights absorbed and dissappears","Disposition":"Insufficient Data","Date of the Event":"07/17/2011 07:00 UTC","Longitude":"-118.472196","Region":"California","Date Submitted":"09/03/2011 08:08 UTC","Tags":"City","Latitude":"34.19754","Sighting Duration":"00:00:02","Object Flight Path":"Straight-line path,Path then hovering","Log Number":"US-09032011-0020","files":["/var/www/straped/mufon/html2text/31484.html.txt","/var/www/straped/mufon/more/31484_submitter_file1__ufoatjohnshouse.jpg","/var/www/straped/mufon/org/31484.html"],"Case Number":"31484","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 17th 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was sitting in my friends yard and looked up at the sky for no real reason and at the end of his yard, 25 feet from where I am sitting, he has a couple of very tall palm trees. Just above the palm trees I see 3 lights moving together in a straight line. The first light was large and had a kind of peach-colored aura. It stopped and the other two lights, smaller, the size and look of maybe the north star, zoomed into it and then it disappeared. I was too shocked to say anything the first moment I saw it, but when I did say something, my friends were mid conversation and ignored me and so they missed it. It was a bright summer evening and there was nothing else in the sky as far as I could remember. There was a small cloud formation a few inches away from the brightest light. I have the exact date marked in my diary, but I don't have that on me right now, I do know that it was a recent Sunday, however."],"Source":"MUFON","Country":"United States","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.19754,+-118.472196(31484)&iwloc=A&hl=en\"> mufon case (31484) map </A>","Object Shape":"Circle, Star-like","Weather Factors":"None"}