{"Disposition":"Hoax","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","trends":["There have been 229 other sightings in Las Vegas","There were 2 other sightings in Las Vegas on or around September 1st 2011","This sighting has never been favorited.",""],"Object Shape":"Star-like","divs":["sighting detailsmy fiance and i have been seeing a ton of ufo's lately over las vegas (see the mufon report i made previously: http:\\\\mufoncms.com\\cgi-bin\\report_handler.pl?req=view_long_desc&id=31351&rnd= ) due to the recent sightings we decided to go out to red rock canyon, located about 5 miles west of the edge of las vegas. there are absolutely no lights anywhere around the canyon, so it's perfect for star-gazing. we arrived around 3am and we couldn't have been outside of our car for more than 5-10 minutes when we noticed a ufo flying towards us from the west heading towards the east. the object would move from side-to-side zig-zagging it's way towards us until it stopped and hovered. this amazing object was very bright and it flickered every color in the rainbow. the colors were extremely vivid and it changed colors extremely rapidly. we couldn't see this from the ground when we were watching it, but after reviewing the video we noticed a smaller light located at first to the bottom-left of the ufo, and then to the top-right of the ufo, that would randomly blink on. this tiny object seems to be located at a fixed distance to the main multi-colored ufo, however it only appears in a small portion of the recorded video. you can view the video in 1080p hd on youtube at this url: http:\\\\www.youtube.com\\watch?v=za0lyuev7aw i've also attached a few screen caps of the ufo to this report."],"Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Region":"Nevada","Date of the Event":"09/01/2011 12:00 UTC","Summary":"ON VIDEO: Multi-Colored UFO Moving and Hovering west of Las Vegas","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Date Submitted":"09/03/2011 10:56 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/31493.html.txt","/var/www/straped/mufon/more/31493_submitter_file1__Multi-Colored-UFO-1.png","/var/www/straped/mufon/more/31493_submitter_file2__Multi-Colored-UFO-2.png","/var/www/straped/mufon/more/31493_submitter_file3__Multi-Colored-UFO-3.png","/var/www/straped/mufon/org/31493.html"],"Latitude":"36.142503","City":"Las Vegas","map":"<A HREF = \"http://maps.google.com/maps?q=36.142503,+-115.411485(31493)&iwloc=A&hl=en\"> mufon case (31493) map </A>","Log Number":"US-09032011-0027","Case Number":"31493","Longitude":"-115.411485"}