{"files":["/var/www/straped/mufon/html2text/31495.html.txt","/var/www/straped/mufon/more/31495_submitter_file1__ufo003.jpg","/var/www/straped/mufon/more/31495_submitter_file2__ufo005.jpg","/var/www/straped/mufon/more/31495_submitter_file3__ufo002.jpg","/var/www/straped/mufon/org/31495.html"],"Object Flight Path":"Stationary","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.981179,+-118.031414(31495)&iwloc=A&hl=en\"> mufon case (31495) map </A>","Sighting Duration":"01:00:00","Object Shape":"Square, Rectagular","Case Number":"31495","trends":["There have been 27 other sightings in Whittier","There were no other sightings in Whittier on or around September 3rd 2011","This sighting has never been favorited.",""],"Region":"California","Date Submitted":"09/03/2011 11:41 UTC","Date of the Event":"09/03/2011 10:40 UTC","divs":["sighting details driving on 60 fwy going east at 10:30 am on 9\\3\\11..upon entrance to fwy while my husband drove i immediately noticed a large white square up high in the northern part of the sky, i often take pictures of clouds. i thought it was strange in the shape, square clouds are not the norm even though it looked like a cloud at first. it was a drive from rowan ave in east la to rowland hts.,,,the entire drive i had my eye up in the sky and my husband and 5 yr old son did also. i began to try to take a photo with both cameras i had just came from a baptism and had them ready. my husband was able to get a good look when we came to a mild traffic jam and then again when we exited on nogales. the shape had stopped and then started to move towards the foothills and soon disappeared from our viewpoint due to a large building. i did manage to snap some shots...it seemed to flutter at the top of the square and was plain white...???? i wanted to follow it some more and wasn't able to due to traffic..i would like to know what that was..."],"Object Features":"None","Disposition":"IFO","Longitude":"-118.031414","Summary":"white large square shaped object in sky","Country":"United States","Tags":"City","Source":"MUFON","Log Number":"US-09032011-0029","City":"Whittier","Latitude":"33.981179","Viewing Distance":"Over 1 Mile, Unknown"}