{"Object Features":"Unknown","Case Number":"31496","Disposition":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.270984,+-74.317688(31496)&iwloc=A&hl=en\"> mufon case (31496) map </A>","Sighting Duration":"00:02:00","Longitude":"-74.317688","files":["/var/www/straped/mufon/html2text/31496.html.txt","/var/www/straped/mufon/more/31496_submitter_file1__UnknownObject1.jpeg","/var/www/straped/mufon/org/31496.html"],"Source":"MUFON","Tags":"City","Object Shape":"Circle, Disc","Date of the Event":"06/18/2011 10:50 UTC","Latitude":"40.270984","trends":["There have been 4 other sightings in Freehold Township","There were no other sightings in Freehold Township on or around June 18th 2011","This sighting has never been favorited.",""],"Date Submitted":"09/03/2011 11:43 UTC","Region":"New Jersey","City":"Freehold Township","divs":["sighting detailsi was camping out on monmouth battlefield state park with my unit at this years 2011 rev war reenactment of the battle of monmouth. i arrived with my family friday night and several people said to have seen a strange glowing object with no sound flying overhead but i didn't see it for i was in the bathroom at the time. plenty of witnesses to that sighting. saturday night around 10:50pm est i was outside talking with my commander when another member pointed out there is something in the sky. that is when i turned and looked up and could see a round disc that was glowing red\\light pink with an aura of the same color around the edges (reminded me of the reentry of the space shuttle glowing from the burning plasma underneath. same color and aura effect.) no sound coming from it what so ever but could hear a passenger jet and see one flying in the distance away from where i was standing. this had no wings and i kept saying it looks like it might be entering our atmosphere or skipping off it. that is when i noticed it making a left turn and continue to fly out of sight. we all didn't know what it was but most laughed it off as a ufo. after that i kept an eye out for it and close to 20 minutes later it appeared again but this time seemed to be flying slower and had a slight zig-zag, wobble as it was turning and slowing down even more. same burning aura covering it and around it. again no sound. it flew the same flight path as before. knowing that an altitude of 120 km (75 mi) is where atmospheric effects become noticeable during atmospheric reentry of the space shuttle the disc appeared to be a about 2 centimeters radius. this tells me that this disc is huge that is entering our atmosphere. my personal feelings at the sight were that of awe as well as investigative as to what it was i was seeing and taking account of others reactions to it as well to make sure i was not alone in seeing it. my whole family seen it too. when i seen the zig-zag wobble in the flightpath and slowing down i recalled the space shuttle doing the same to bleed off airspeed. there were was a couple fighter jets (f-16) flying in the direction of the disc's flight path 5 min after losing sight of the disc the second time flyby. there were others that seen close to a hundred others around in their camps both british and continental that night."],"Log Number":"US-09032011-0030","Object Flight Path":"Path with directional change,Other","Summary":"Glowing Disc flying at high altitude glowing red like burning plasma underneath it with no sound what so ever from it.","Country":"United States"}