{"Country":"United States","Latitude":"32.218859","Date of the Event":"05/10/2011 12:00 UTC","City":"Carlsbad","Viewing Distance":"101-500 Feet, Unknown","Date Submitted":"09/04/2011 12:08 UTC","Source":"MUFON","trends":["There have been 12 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around May 10th 2011"],"Sighting Duration":"12:10:23","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/31498.html.txt","/var/www/straped/mufon/org/31498.html"],"Longitude":"-104.223285","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=32.218859,+-104.223285(31498)&iwloc=A&hl=en\"> mufon case (31498) map </A>","Case Number":"31498","divs":["Sighting DetailsA freind n I had went down a dirt road off of Old Cavern Hwy, not far from my house, as we were sitting there talking & scratching lotto tickets i noticed a light out the window approx 400ft. away i told her \"check those out\"! While we were watrching the light move around up down left right, a second one appeared, then they were both bouncing around as if they were dancing. The lights went about40 ft away from eachother, then they took off towards eachother and the 2 became 1, then a few seconds later they separated and started bouncing around more. After a few minutes of this a third light appeared and it was red, it was like they were talking to eachother and dncing around. Eventually they all just dissappeared, but i have returned to the very spot on several different accasions and the lights are there, kind of like the Marfa lights of Marfa, Tx. The first time i saw these lights, they scared me crazy!! I would go and take different friends with me to see if they saw them as well, and they did. I would not let anyone out of my vehicle, i would keep the doors locked and windows up!! I can't figure out a \"logical\" explanation for these lights. They have been driving me crazy wondering what they are. I have been to the area in the daytime and there is nothing out there that could explain this.Alkso i have been there in different kinds of weather- cloudy, raining, clear, windy,calm etc...- and they are there. However, it is not every night that they come out to play, sometimes they're there and other times they're not. I dont know what they are, but it's driving me crazy!! Thank You, Tamy"],"Object Features":"Unknown","Region":"New Mexico","Log Number":"US-09042011-0002","Summary":"lights that move around, pass eachother, and dissappear.","Disposition":"Insufficient Data","Object Shape":"Circle, Sphere"}