{"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"Unknown","Case Number":"31499","Summary":"Silver sphere chased by two jets","Source":"MUFON","Disposition":"Unknown","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around July 25th 1952"],"Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/31499.html.txt","/var/www/straped/mufon/org/31499.html"],"Country":"United States","Date of the Event":"07/25/1952 03:00 UTC","Object Features":"None","Tags":"City","Latitude":"42.430652","City":"Detroit","Log Number":"US-09042011-0003","Region":"Michigan","divs":["Sighting DetailsThis may no long be of any interest to you since it happened about 59 years ago. This happened in late July, 1952, a few weeks before my seventh birthday. New houses were being built on Hollywood Street in Detroit. I was with my sister and a friend playing King of the Hill on the dirt mound from a dug out basement. We heard loud jet sounds and looked up to see them. The sound was coming from the North. Flying South as if over Woodward Ave was a round object that was like the size of a dime held at arms length being followed by two jets we had known as Thunder Jets. We thought it was a UFO being followed by jets. It looked like a ballbearing, a silver sphere. We watch as they headed South toward downtown Detroit. The silver sphere, as we watched turned West. This was a sharp 90 degree abrupt turn with no change in speed. The two jet made a large radius turn as they followed. At arms length the sphere seem to travel 15-18 inches accross the sky after turning. It then stopped in mid air. As the jets got closer the sphere got smaller as if we were in direct line with it as it accelerated into space. We could no longer see the sphere but the jets circled two or three time in the area where the sphere appeared to stop, then they headed back most likely to Selfridge ANG Base. We ran home and told our parents what we had seen. They checked the news papers for the next couple of days and said there was no mention of it. A couple of weeks ago my sister asked me if I remembered the UFO that we had seen. I told her I never forgot it and have been telling people about it all my life."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.430652,+-83.103388(31499)&iwloc=A&hl=en\"> mufon case (31499) map </A>","Sighting Duration":"00:01:00","Longitude":"-83.103388","Date Submitted":"09/04/2011 12:21 UTC"}