{"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","divs":["Sighting Detailswe were on our deck looking west just after sunset...about 8:15 when two very bright lights of an orange color appeared in the sky. Five of us exclaimed. I ran for camera. Witnesses said the lights rose for a time and then headed together to the NW. I was able to get one light on film for just a second. Nothing special except the magnitude can be judged as the other stars in the sky do not show up. It was pehaps 3 or 4 times brighter than Jupiter is tonight. We have been at this location now just a few months. Rural with little aritraffic I have seen several satellites, etc. This didn't fit any of those. I was a witness to lights in Phonix many years ago, these were similar in some ways..the brilliance and the apparent drift or fading after about 5 or so minutes. We could not tell if they went \"out\" or went into distance. Thre was no trail or smoke we could see. No sounds. No guess on distance. I reviewed the film, not so hot - no tripod and I was late getting back to porch. You can have it if need be, but would just frustrate web viewers."],"Date of the Event":"09/03/2011 08:25 UTC","trends":["There have been 7 other sightings in Orland","There were no other sightings in Orland on or around September 3rd 2011"],"Object Features":"None","Weather Factors":"Unknown","Region":"California","Latitude":"39.75638","City":"Orland","Viewing Distance":"Unknown","Case Number":"31504","Date Submitted":"09/04/2011 02:23 UTC","Object Flight Path":"Path with directional change","Country":"United States","files":["/var/www/straped/mufon/html2text/31504.html.txt","/var/www/straped/mufon/org/31504.html"],"Object Shape":"Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.75638,+-122.192775(31504)&iwloc=A&hl=en\"> mufon case (31504) map </A>","Longitude":"-122.192775","Log Number":"US-09042011-0008","Tags":"City","Summary":"2very bright orange lights appeared over Orland direction, they seemed to acend for a bit and then move together NE and fade from view. No flashing, just extremely bright lights of amber color. About 10 minutes after I saw a single flash of white"}