{"divs":["Sighting DetailsEntering this report for my sister: I was driving on the road at 50th St East going toward Avenue K. I had just passed Ave L and a small house on the side of the road to my right (in the direction toward 60th). Through my peripheral vision I could see an object moving quickly toward the ground in a straight line. I turned to look at it since it caught my attention. The object was emanating many colors, I couldn't tell what color it was exactly, it was as if it was cycling through many colors at once. There was no point from which lights were coming, the whole object was THAT color or colors all at once as it moved, it wasn't SHINING and it didn't project any beams of light. The object looked to be round in shape however not a sphere, more like a donut shape or a wheel but no hole in the middle or at least I couldn't see one it moved too fast. Once it reached near the ground I lost sight of it for a split second as if it disappeared completely. Then it reappeared and moved straight back up. Not at an obvious angle like a plane or any angle I could tell. Simply straight back up. I was still moving toward the object the entire time (which was about 3 seconds). Once I saw it moving up toward the sky I tried leaning forward to look and see if I could catch it again but it was already gone. The object had only been gone for a second when my phone started beeping low battery, that scared me further. I had also heard a static noise when I first saw the object, I was talking over speaker phone and over my car's speakers so when I heard the static it was quite noticeable. The distance from me in my car driving toward it at around 65mph to where it was is probably about a football field in length, it wasn't very far but it wasn't close enough that I could see many more details and it didn't linger. It was a very scary few moments that had me terrified."],"Object Features":"Unknown","Longitude":"-118.041171","map":"<A HREF = \"http://maps.google.com/maps?q=34.726446,+-118.041171(31508)&iwloc=A&hl=en\"> mufon case (31508) map </A>","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 15 other sightings in Lancaster","There were no other sightings in Lancaster on or around August 29th 2011"],"Summary":"Multi colored object flies down toward ground then back up very fast","Source":"MUFON","Viewing Distance":"101-500 Feet","City":"Lancaster","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31508.html.txt","/var/www/straped/mufon/org/31508.html"],"Region":"California","Date of the Event":"08/29/2011 09:45 UTC","Latitude":"34.726446","Disposition":"IFO","Object Flight Path":"Other","Date Submitted":"09/04/2011 08:23 UTC","Case Number":"31508","Object Shape":"Oval","Log Number":"US-09042011-0010","Country":"United States"}