{"Region":"Arizona","Tags":"City","Latitude":"34.572837","Weather Factors":"Unknown","Case Number":"31506","Object Flight Path":"Stationary","Date Submitted":"09/04/2011 03:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.572837,+-113.179085(31506)&iwloc=A&hl=en\"> mufon case (31506) map </A>","Viewing Distance":"101-500 Feet","Log Number":"US-09042011-0010","Date of the Event":"07/07/1978 11:12 UTC","Object Features":"Dome","Country":"United States","divs":["Sighting DetailsThe four of us were out spotlighting game four miles southwest of Bagdad Arizona at around 11p.m. We were on our way back to town when all at once the four of us saw a disc of about 30' to 35' hovering about 10' off the ground right over a Juniper tree not more than 400' away from us, and just slightly above eye level. As I went to shine the spotlight on the object, the driver pulled the cord out of the cigar lighter. He and the outer two passengers began breathing very hard and gasping in distress as the driver sped us off away from the object. The object did not move, and I was the only one willing to keep looking at it. As we approached the main road out, the road went uphill. No, as we sped off up this road, we were now looking down on the top of this object. The other three would not stop until we reached town. I found a willing friend who drove me back out to the location, but the object was long gone. The other three that were with me were almost in tears and very scared. I kept telling the driver to stop, but he would not. There was no doubt that this was a flying saucer hovering right before our eyes. The saucer was towards the bottom of a very steep hill about 50' above the small creek, and just above the 8' to 10' high Juniper tree. Although it was emitting very bright blue light, this light did not cast outward very far only shinning on the ground right below the craft. I probably could have hit it with a rock This is just one in a series of even greater sighting with multiple witnesses. This being the second of several very close encounters, this area is still very active, and these witnesses will not go back to these areas after dark. As the crow flies, this area around Bagdad Arizona is not that far from Luke Air Force Base, who does daily training in this area, and also not that far from Area 51. However, I'm sure we have nothing like this."],"Disposition":"Insufficient Data","trends":["There have been no other sightings in Bagdad","This sighting has never been favorited."],"Longitude":"-113.179085","Source":"MUFON","Summary":"Stationary 30' disc hovering 10' above ground emitting bright blue light","City":"Bagdad","Sighting Duration":"00:20:00","files":["/var/www/straped/mufon/html2text/31506.html.txt","/var/www/straped/mufon/org/31506.html"],"Object Shape":"Disc"}