{"Summary":"Dark Grey Rectangle moving right to left slowly then moving away.","Date of the Event":"09/03/2011 06:30 UTC","Tags":"City","Sighting Duration":"00:07:00","files":["/var/www/straped/mufon/html2text/31500.html.txt","/var/www/straped/mufon/more/31500_submitter_file1__CIMG0235.JPG","/var/www/straped/mufon/more/31500_submitter_file2__CIMG0236.JPG","/var/www/straped/mufon/more/31500_submitter_file3__CIMG0237.JPG","/var/www/straped/mufon/org/31500.html"],"Region":"Texas","Object Features":"Patterned Surface","Latitude":"30.502787","Object Shape":"Square, Rectagular","divs":["Sighting DetailsI normally do not pay much attention to UFO sightings or even read about them. This may sound strange, but the prior day I was watching on the internet an experience that someone had with a UFO. I normally don't believe these stories, but this was coming from a prominent Christian, telling about an expereince he had more than 40 years ago. Today, I decided to buy a new book to read and purchased the book \"Majestic\", for no particular reason until I began to read what it was about, a story about the Rosewell incident. I then came home and had this feeling to look out my window in my apartment, but saw nothing. 10 minutes later I had this feeling again to look out my window and I saw a rectangle shaped object that seemed as large as an 18 wheeler or bigger hovering at least a 1000 feet moving from right to left slowly for about 5 minutes, and then it began to move away at a faster pace until it disappeared in the horizon after about 2 minutes. I took pictures because it seemed very odd that something shaped like a rectangle was flying with nothing else near it."],"Case Number":"31500","City":"Round Rock","trends":["There have been 11 other sightings in Round Rock","There were no other sightings in Round Rock on or around September 3rd 2011","This sighting has never been favorited.",""],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.502787,+-97.677067(31500)&iwloc=A&hl=en\"> mufon case (31500) map </A>","Log Number":"US-09042011-0004","Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-97.677067","Date Submitted":"09/04/2011 01:09 UTC","Object Flight Path":"Path with directional change","Disposition":"Unknown","Weather Factors":"Unknown"}