{"Source":"MUFON","divs":["Sighting Details \"THE EVENT\", YOU ARE ABOUT TO READ OF IS TRUE , IT HAPPENED TO US, ME AND MY GIRLFRIEND AS WE WERE WALKING AS WE OFTEN DID AROUND OUR APT. COMPLEX, THE GARDENS. IN ARIZONA, AT THIS TIME OF YEAR ITS REALLY WARM HERE IN TUCSON. IT WAS MARCH,9TH ,2009 AT EXACTLY 9:OOPM, JENNY AND I, OH YES, LET ME INTRODUCE MYSELF, MY NAME IS DANIEL, WERE WALKING AROUND OUR COMPLEX ROUNDING OUR SOUTHERN END AND PROCEEDING NORTH SKIRTING THE WESTERN BORDER, A QUITE NICE HEDGEROW NOW REFERED TO AS,\"UFO ROW\" , A HEDGEROW OF BEAUTIFUL OLEANDERS 9FT. HIGH,AND RUNS STRAIGHT , TWO HUNDERD YRDS.TO THE NORTH AND THEN CURVES TO THE RT. TOWARDS OUR MAIN ENTRANCE AND THE CLUBHOUSE. WE WERE HALFWAY UP THE HEDGEROW AIMIABLY TALKING ABOUT WORK AT THE HOSP., LIFE AN ALL. I WAS ONLY A FEW STEPS AHEAD OF JENNY, ACTUALLY ON THE SPEEDBUMP WHEN I HEARD JENNY SCREAM! \" DANNY, THE LIGHT, LOOK AT THE LIGHT\", I WHIRLED AROUND AND JUMPED OFF THE SPEEDBUMP IN DIRECTION OF JENNY,S SCREAM, THERE DIRECTLY SOUTH OF US AT WHERE WE HAD JUST ROUNDED THE SO. END OF THE COMPLEX ,ACROSS THE OTHER SIDE OF THE RD. WERE 30 TO 40FT. TREES SCATTERED ALL THE WAY DOWN TO THE END WHERE THE LIGHT WAS. IT WAS MONSTROUS. LIKE THAT OF A FREIGHT TRAIN THE BEAM ,30FT. UP INTO THE TREES ,WAS BEAMING THROUGH THEM AND WAS MOVING FAST, IT WAS AS IF IT WAS ROARING BUT IT WASN'NT ,CHRIST IT WAS COMING RT AT US THROUGH THE TREES, GOD WHAT THE HELL IS THIS, I MOVED FORWARD TO THE OPPOSITE SIDE FROM US TO GET A BETTER LOOK. WHERE WE WERE, IT HAD TO EXIT THE TREES AND COME IN TO VIEW, AS IT DID THE WORLD STOPPED, AS IF IN A DEAD TIME, IT CAME THROUGH, TWO HUGE CYLINDERS LIKE TORPEDOES NOT ONE, BUT TWO, THAT FLEW SIDE BY SIDE, NOSE TO NOSE, BLU-WHITE LIGHT, IN BANDS OF INTENSE ARC-LIGHT BLU, FOLLOWED BY WHITE AND BLU AGAIN, SO BLUE LIKE AN ARCH WELDERS BLUE, SO INTENSE , PAST OUR HEADS NOT 30FT.. ABOVE US. AT THE SPEED OF LIGHT AND SRAIGHT IN TO THE THE NEXT BLDING UP FROM US AND CHANGED INTO BRIGHT LINES OF GEOMETRIC PATTERNS OF LASER LIGHT COLORS OF ORANGE, CHANGED DIRECTION AND SHOT OUT INTO TKE SKY. IN A NANO SECOND, IT WAS OVER THE SANTA CATALINA MTNS. NOW SPINNING AND REVOLVING AS A SPHERE OF ORANGE LIGHT, THEN IN A FLASH IT MOVED OVER MIDTOWN TUSCON AS A SPINNING SPHERE N BLU-GREEN AND WHITE. LIKE THE EARTH ITSELF, THEN AGAIN OVER SO. TUCSON HOVERING A FEW MOMENTS THEN GONE. WE WERE NOW STANDING IN FRONT OF OUR GIANT MAGICAL 1OOFT. EUCALYPTUS TREE, THATS ANOTHER STORY, JENNY JUMPING UP AND DOWN DANCING IN THE STREET, YELLING,\" DID YOU SEE THAT!, DANNY DID U SEE THAT\", I COULDNT SPEAK ,MY THROAT CLOSED UP, SUDDENLY LOOKING UP, WAY UP IN TO THE GIANT EUCALYPTUS SKYWARDS, IT CAME BACK! GOD, \"IT WAS IN THE TREE\" , A BRIGHT LIVING LASERLIGHT OF ORANGE ,LIVING,MOVING, 30FTX40FT. LIKE MOSES,S BURNING BUSH OF GOD, IT STAYED FOR 30SECONDS, AND THEN AS QUICKLY WAS FOREVER GONE. WERE NOT TOGETHER ANYMORE AND ONE YR. LATER ON THE SAME DATE WE CAME BACK TO SEE IF ANYTHING HAPPENED BUT, NOTHING. IVE NEVER BEEN THE SAME SINCE."],"Object Shape":"Bullet, Missile, Cigar, Cylinder, Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=32.338998,+-110.980079(31503)&iwloc=A&hl=en\"> mufon case (31503) map </A>","Latitude":"32.338998","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around March 9th 2009"],"Tags":"City","City":"Tucson","Date Submitted":"09/04/2011 01:27 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering,Other","Object Features":"Other","Longitude":"-110.980079","files":["/var/www/straped/mufon/html2text/31503.html.txt","/var/www/straped/mufon/org/31503.html"],"Sighting Duration":"Undisclosed","Log Number":"US-09042011-0007","Date of the Event":"03/09/2009 09:00 UTC","Case Number":"31503","Viewing Distance":"21-100 Feet","Region":"Arizona","Weather Factors":"None","Disposition":"Unknown","Summary":"TWO TORPEDO SHAPED CRAFT GLOWING BLU AND WHITE FLEW AT US TROUGH THE TREES 30FT. OVER OUR HEADS","Country":"United States"}