{"Case Number":"31509","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/31509.html.txt","/var/www/straped/mufon/org/31509.html"],"Sighting Duration":"Undisclosed","Summary":"a large and bright ball of light that quickly vanished","Country":"United States","divs":["Sighting Details Me and a friend of mine are both standing in my driveway looking at the stars in small town east of colombus ohio. It was a very clear night, there were zero clouds in the sky. We stood and watched for about an hour to an hour and a half. We observed many aircraft including helicopters, airliners or jets, small aircraft, and a few different military aircraft. I am very familiar and used to seing small aircraft since there is a small airport less than a mile from my house where i have lived my entire life. We observed and talked about each aircraft we saw that night guessing what type of aircraft it was since we are both \"fans\" of aviation. It was just about the time for me to go into my house and for my friend to leave. We said our goodbye's and he walked towards his vehicle and i turned towards my house when out of the corner of my eye, i saw a bright yellowish white light that was bright enough to get my attention. The light was just above my house from my point of view and to the south of my house towards the nearest city. I said to my friend what the hell is that??? He turned around and walked to my side when he said i have no clue, we went back and forth, both saying oh my god what could that possibly be? I was very scared and im sure my friend was too, wondering what this was and what it would do next. It was just a ball of light. There was no aircraft for the light to reflect off of. It was just one single light that remained solid for the entire time i saw the unidentified flying object. It was hovering very slowly but it had one general directional path, however it moved slower than any flying object i have ever seen. I remember my friend telling me to shut up for a second so we could listen for the engine noise but we heard no engine at all. There were no other aircraft in the area at the time. The light was also much brighter and larger than the other aircraft i saw that night or any other night. We observed the object for maybe one to two minutes but its really hard to say how long it was because it seemed liked it lasted forever, it was like our shoes were glued to the pavement. After a few minutes of watching and discussing the object it dissappeared and the light was gone. It just vanished, no more light. We looked and hoped to see the object again but that was the last we saw it. We sat and talked about it for atleast another half hour trying to think of some explanation for what we saw, in the end we couldnt come up with anything that we know of on our planet that could explain it. Eventually my friend left and i went inside not beleiving what i had just seen. I immediately ran down my steps to tell my father what i had seen, thinking to myself on my way down what am i going to tell him? Is he going to think im crazy? I told him anyway and he listened and surprisingly he believed me, but how much can you believe when someone tells you a story like this. I know if someone told me this story i would probably think there crazy. So thats the end to my story, was it aliens? I dont know but probably not, who knows? What i do know is that its something that is either not from this world or very well hidden from us by our government, but it wouldnt be the first time out government kept a secret from us."],"Latitude":"40.01971","Date of the Event":"07/27/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.01971,+-82.012523(31509)&iwloc=A&hl=en\"> mufon case (31509) map </A>","Object Shape":"Sphere, Unknown","Log Number":"US-09042011-0011","Object Features":"None, Unknown","Date Submitted":"09/04/2011 09:26 UTC","City":"Zanesville","Longitude":"-82.012523","Region":"Ohio","trends":["There have been 2 other sightings in Zanesville","There were no other sightings in Zanesville on or around July 27th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path,Path then hovering,Other"}