{"Object Shape":"Disc, Fireball, Oval, Sphere","Latitude":"43.88493","Log Number":"CA-09042011-0019","files":["/var/www/straped/mufon/html2text/31517.html.txt","/var/www/straped/mufon/org/31517.html"],"Region":"Ontario","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/03/2011 09:40 UTC","Date Submitted":"09/04/2011 01:07 UTC","Tags":"City","Disposition":"Unresolved","Longitude":"-79.43039","Country":"Canada","Summary":"I have seen two dark orange fire like spheres in the sky, following each other in an exact path","Source":"MUFON","divs":["Sighting DetailsI just drove off from my house, made around the corner and saw a car parked in the middle of the road and two guys standing outside. I did not realize they were watching something and asked them if they needed help. They asked me to come out and asked me if i see what they see, a UFO. I came out with a smile on the face, not a believer in UFOs, when every explanation i tried failed to describe the moving orange red like fireballs moving in the sky. They were very close, 300-500meters above us. I ran towards them than got scared that they were very close, so i even ran back a little. There was no noise present, and they literally looked like they were spheres moving in the sky with a short oval like trail behind them. They were moving slow, in the middle of the city, they are not afraid of us thats for sure. As they approached they looked brighter orange, then they turned north coming from sout easth, thats when they started to fade away, in an orange disc like shape with dark circle in the middle. So the last thing i saw before they disappeared was like the eclipse of the sun, but very faded. Its like it was a shield from the rear. It felt like they were living beings rather than an object, they were behaving unlike an aircraft, flowing so calmly on a path one after another, so organized. Seemed like they had a purpose and going somewhere, they weren't just hovering to look around. I saw only last two, but the guys that were there told me that they saw two more before i got there, and said something about hovering. I'll try to find them in the neighbourhood, one of them was walking a dog, and the other just like me was riding a car. Unbelievable. Good luck to all of you, hope you guys see it to, now i definately know something unexplainable out there."],"Object Features":"Undisclosed","trends":["There has been one other sighting in Richmond Hill","There were no other sightings in Richmond Hill on or around September 3rd 2011"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=43.88493,+-79.43039(31517)&iwloc=A&hl=en\"> mufon case (31517) map </A>","City":"Richmond Hill","Case Number":"31517"}