{"files":["/var/www/straped/mufon/html2text/31518.html.txt","/var/www/straped/mufon/org/31518.html"],"Source":"MUFON","Region":"Oregon","Sighting Duration":"00:03:00","Weather Factors":"Unknown","Object Shape":"Star-like","Object Flight Path":"Path then hovering","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around August 29th 2011"],"Case Number":"31518","Log Number":"US-09042011-0020","Longitude":"-123.075111","Object Features":"None","Summary":"Very fast moving shooting star turns into stationary bigger glowing object.","Country":"United States","Viewing Distance":"Over One Mile","Disposition":"Unknown","Date of the Event":"08/29/2011 10:10 UTC","divs":["sighting detailsthis object at first looked like a shooting star. then grew bigger with an orange\\yellow glow as it entered the atmosphere. about the size of pea in the sky. my second reaction was this shooting star is now a fireball, it had a tail, that is going to impact the ground. as this fireball entered what looked like a shallow entry into the atmosphere, about 20 to 30 degrees above the horizon, it changed direction slightly from the north to north northwest. and stopped. then it made what looked like an intelligent move to the west. and stopped. it appeared in the night sky as a glowing flare, however it was very high in the night sky. what became an unusual event is that it did not continue to descend, but remained stationary and eventually the glow diminished like turning down your lights in the living room with a dimming knob. almost as if it backed out of the atmosphere where it entered... i googled this and actually saw a video on youtube that occurred in medford or. and it looked similar.............and i have never seen anything like this before. i have a science and engineering education and even though this object appeared to observe physical laws, it did not do it in a natural state that one would expect from a falling or entering object."],"City":"Salem","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.879987,+-123.075111(31518)&iwloc=A&hl=en\"> mufon case (31518) map </A>","Date Submitted":"09/04/2011 01:30 UTC","Latitude":"44.879987"}