{"City":"Cincinnati","Tags":"City","Region":"Ohio","Object Features":"Undisclosed","Disposition":"Unknown","Log Number":"US-09042011-0022","Summary":"Gigantic orange glowing sphere moving slowly, changing direction.","Date of the Event":"09/03/2011 11:15 UTC","Latitude":"39.066584","Country":"United States","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Weather Factors":"None","Object Flight Path":"Stationary,Path with directional change","Date Submitted":"09/04/2011 02:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.066584,+-84.392353(31520)&iwloc=A&hl=en\"> mufon case (31520) map </A>","Case Number":"31520","files":["/var/www/straped/mufon/html2text/31520.html.txt","/var/www/straped/mufon/org/31520.html"],"trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around September 3rd 2011"],"Longitude":"-84.392353","divs":["Sighting DetailsMy fiancee and I were at a local sports pub last night out on their back deck having a smoke and seated at a table where two other people were also sitting and smoking. My boyfriend looked up and said, \"What the heck is that up there?\" And all four of us looked up and there was an enormous glowing red-orange sphere moving slowly and silently in the sky. It was simply enormous, about softball-sized and it moved very, very slowly, changed direction, then paused and just hung in the sky, then it proceeded across the sky again slowly and when it was almost out of our sight, it broke into two tiny orange pinpoints of light and each pin point zipped fast away in opposite directions and were both gone almost instantly. We discussed how large we all thought it was and the consensus of everyone who saw it on the deck was that it was very very high, and extremely large and we have all seen satellites moving on a clear night, and this was moving way way slower then satellites and even slower then a plane. It was too large and silent to be a helicopter and none of us could discern a shape it was more like a glowing red-orange sphere and none of us have ever seen anything like it. I decided to report this because I went on your site and saw that there were a number of glowing orange spheres last night and recently being reported in California and New York so I thought what we saw was so much like what those other reports described that I wanted to add our sighting to your site. All of us discussed that it definitely didn't have the feel of anything man-made or terrestrial, and it gave us all a really weird feeling in the pit of our stomachs and the thing that was truly amazing to me is that it broke up into such smaller pinpoints of light...how that huge sphere that was so darn bright could break down instantly into two smaller way less intense lights was pretty incredible and we were all pretty stumped and amazed at the same time. The entire sighting probably only lasted 30 seconds and we were so stunned that unfortunately no one had time to get out our phones to snap a picture and it was so dark out, it would have just probably been an orange blob against a dark background."],"Source":"MUFON","Sighting Duration":"Undisclosed"}