{"Summary":"bright lights w/ occa. red beam","Longitude":"-96.549877","trends":["There has been one other sighting in Ennis","There were no other sightings in Ennis on or around September 3rd 2011"],"Disposition":"IFO","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMe and my cousin, about a month ago have been seeing a bright light in the sky. At first we thought it may be a plane or something but as we watched it closely it didnt move like a plane. It had a bright light(s) with a occasional red beam. We were just sittin outside one night and happen to notice it. In the past month we have noticed the same thing in the same spot every weekend starting around 11p.m. to around 4a.m. The crazy thing is, it seem to have a gravitational pull on it the was pretty strong, beacause the little dipper and other stars would cluster near it and move as it moved. It pops up in the south-south east direction moving slowly in the sky, appearing to be inside the atmosphere. The object moves towards straight over-head of our position by time 4a.m. The bright light(s) that are on it will get real bright then turn and dim out and we will see a sort of search light come from the object that will glow on the trees and scan the ground. At times the light(s) will pulsate and blink. We are currently still observing it. One night i was out there and i saw the light scan the ground, it would stop on a certain spot near our road and for some reason somewhat kinda communicate with me telling me to walk in it. I did and when i stood there i had a out-of-body experience and my brain had a feeling like it was being read. After the experience, my mind was fuzzy and my cousin said i was doing weird things things like speaking something unknown.Im not sure what happened but it was not normal. We have never lost sight of it. we observe it every weekend."],"Log Number":"US-09042011-0031","Object Features":"Unknown","Date Submitted":"09/04/2011 06:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.441499,+-96.549877(31529)&iwloc=A&hl=en\"> mufon case (31529) map </A>","Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","Source":"MUFON","Date of the Event":"09/03/2011 12:00 UTC","Latitude":"32.441499","City":"Ennis","files":["/var/www/straped/mufon/html2text/31529.html.txt","/var/www/straped/mufon/org/31529.html"],"Case Number":"31529","Tags":"City","Object Shape":"Circle, Oval","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering"}