{"Case Number":"31531","divs":["Sighting Detailsi was walking to the train station after leaving my mates house. the train station was 10 minutes away and like usual i toke the usual route on my way there which was a across a few fields outside a sport centre. At the time, im going to be honest i was stoned because i was smoking abit off marijuana that night but i didnt have much. And as i was walking across this field i thought i'd lower my hood which i had up over my head just to catch the refreshing breeze that blew across my face because i felt abit warm, it was very very refreshing. Then i looked up too the clouds and noticed that one of the clouds sort of looked like a man, sort of looking like a genie type effort. As i walked and starred at this cloud for a few minutes thinking about things everything just suddenly grew abit darker and the wind started to pick up. i then looked up and this huge cloud gradually flew over me. The cloud was shaped like a spaceship disc (like any common ufo) but it looked like a cloud but you could clearly see the huge wings on teh side and the construction and detail off the spaceship, as i looked up at the bottom off this cloud i started feeling tingles around my body. my body didnt feel like it was there, just my mind and my vision. i starred and experienced this for a couple of minutes. The cloud flew slightly further away and i could see other several cloud shaped like the one i was looking at, but they were further up and further away. it was like if they were hidden or camouflaged in clouds. i could clearly see about 4 - 6 ships covered in clouds just flying off. but the weird thing was that these cloud like ships flew away and there was no way they were cloud because seriously, all the other clouds in the sky stayed still and the cloud i was looking at earlier that was shaped like a genie was gone. i was well freaked out and i didnt know what to think about anything, on the train ride home i felt good for some reason but at the same time i thought i was going mad. and i know it wasnt the weed that made me hallucinate because weed doesnt do that. It was the weirdest experience ive ever had in my life. i did feel alive after it but at the same time mad, i didnt know what too think or do. i only told one person and he didnt say nothing to me after i told him. so i never told anyone until i saw mufon on tv. i couldnt remember the exact month or date but it was around may - april time. i drew a rough sketch on paint, ive also added another picture which the ufo reminded me off. if you combined the too covered in clouds, you see what i saw."],"Log Number":"GB-09042011-0032","Country":"United Kingdom","Source":"MUFON","Disposition":"IFO","Weather Factors":"Unknown","Summary":"4 - 5 cloud ships flying over my head","Object Flight Path":"Stationary,Straight-line path,Other","Latitude":"51.489034","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/13/2011 10:15 UTC","Longitude":"-3.184062","Tags":"City","Object Shape":"Circle, Disc, Oval","trends":["There have been 8 other sightings in Cardiff","There were no other sightings in Cardiff on or around April 13th 2011","This sighting has never been favorited.",""],"City":"Cardiff","files":["/var/www/straped/mufon/html2text/31531.html.txt","/var/www/straped/mufon/more/31531_submitter_file1__theufoisaw.png","/var/www/straped/mufon/more/31531_submitter_file2__Pelican1.jpg","/var/www/straped/mufon/org/31531.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.489034,+-3.184062(31531)&iwloc=A&hl=en\"> mufon case (31531) map </A>","Region":"","Date Submitted":"09/04/2011 07:52 UTC","Object Features":"Dome, Wings, Other"}