{"Source":"MUFON","Object Features":"Unknown","Country":"United States","Date Submitted":"09/04/2011 11:21 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.651309,+-111.945477(31536)&iwloc=A&hl=en\"> mufon case (31536) map </A>","Case Number":"31536","Viewing Distance":"20 Feet or Less","Longitude":"-111.945477","Object Shape":"Unknown","Latitude":"40.651309","Object Flight Path":"Other","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31536.html.txt","/var/www/straped/mufon/more/31536_submitter_file1__GuyIFO.jpg","/var/www/straped/mufon/org/31536.html"],"trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around March 17th 2011","This sighting has never been favorited.",""],"City":"Salt Lake City","Log Number":"US-09042011-0037","Region":"Utah","divs":["Sighting Details My 2 year old Chihuahua, and 13 year old Jack Russell woke up my husband,and myself, about 4 am in the morning by low guttural growls, and hackles full up. My Chihuahua sleeps on my pillow, I grabbed my gun,and so did my husband, sensing someone was in the house, he listened for a minute, only to see a huge Bright light light up the bedroom, and was quickly followed by the loudest sonic boom, shaking the daylights out of our house rattling the windows, even shaking our big garage door. At this point my husband and I jumped out of bed,and went racing down the hallway. As we reached the living room, we could literally feel what ever it was shoot off above the house, we still did a quick check of the house, but we both knew what we had just experienced. We have both been having experience's for years. The next morning my youngest son ( 12 at the time) he is now 13. Asked if he could tell me something, he didn't want me to think he was crazy, he then told me he had alien's come into his room, he was hovering, the next thing he knew he was in the air craft with the aliens, they had suction cups connected to his arms, he then showed me the marks they had left. I took pictures immediately, and asked him if he knew the time this had happened. He said about 4 am that morning. I called my husband, and told him what my son had just told me, he was not surprised. I then let my youngest son know that this had been happening to his father, and brother,and stepfather, and grandparents for years. He asked if I had any experience's. I told him That others that had been in the room with me when the alien experiences had happened said the aliens were afraid of me especially the greys because they could not get me under control. That his father, had said that my violent reactions and movements had kept him safe a few times. I have absolutely no recall of any of these experience's. I have woke up with they feeling like I was fighting,and have found finger print type bruises on my legs, But that on the night of his experience, I had nothing other than being woken up, and the light's, and the sound of the craft taking off. I Immediately contacted a well known UFO psychologist about this experience, and spoke with him for about 45 minutes."],"Summary":"It was right above our house, Shook windows like a sonic boom, rattled big garage door.","Tags":"City","Weather Factors":"Unknown","Date of the Event":"03/17/2011 12:00 UTC","Disposition":"Insufficient Data"}