{"Region":"Minnesota","Source":"MUFON","Tags":"City","Date of the Event":"09/02/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.560139,+-91.643349(31537)&iwloc=A&hl=en\"> mufon case (31537) map </A>","files":["/var/www/straped/mufon/html2text/31537.html.txt","/var/www/straped/mufon/org/31537.html"],"Object Shape":"Unknown","trends":["There have been no other sightings in Spring Grove","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","City":"Spring Grove","Weather Factors":"None","Case Number":"31537","Date Submitted":"09/04/2011 11:38 UTC","Latitude":"43.560139","Object Features":"Unknown","Log Number":"US-09042011-0038","Sighting Duration":"00:05:00","Summary":"Two lights coming at me that look like head lights 4 red tail light looking lights.","Disposition":"Unresolved","Country":"United States","Longitude":"-91.643349","divs":["Sighting DetailsI awoke at 3pm to use the bathroom as I walked back towards my bed that is near a window I saw two big lights comming toward that window, I walked over to the patio doors and all I could see was the two big ligts just above the tree lines as it went past I could then see the big red tail light there appeared to be 4 of them, there was no sound comming from this obeject at all, it was a cloudy night and I could not see any shape the lights were very bright, I strained to see anything I possilby could but just could not make out a shape, it did not move very fast just sorted glided across the side road and over a little building across the street then it went behind some trees and I could not see it anymore. I felt scared I have never seen anyting fly that low before with no noise, I have seen airplanes in the sky and heard them and this was no airplane. The last few nights when going to bed I get scared, The lights were just to big and the object flew lower than any airplane would. I was to stunned to even think about getting any pictures, I just stood and watched it."],"Viewing Distance":"21-100 Feet"}