{"Object Shape":"Sphere","Case Number":"31535","Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"Over One Mile","trends":["There have been 8 other sightings in Rio Rancho","There were no other sightings in Rio Rancho on or around September 3rd 2011"],"files":["/var/www/straped/mufon/html2text/31535.html.txt","/var/www/straped/mufon/org/31535.html"],"Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"09/04/2011 10:08 UTC","Tags":"City","Summary":"Appeared in the south east moved northwest, then vertical through clouds","divs":["sighting detailsat approx 2150 hrs, 09\\03\\2011, i stepped out the front door (facing north) and at about 20% elevation; a very bright orange light caught my eye. once i had focused on the light, you could see at the top, a red light. this object was moving from southeast to northwest at a very quick pace, covering approx 45 degrees in less than 2 seconds. at this point it seemed to slow down to less than half its former rate, to almost a hover. i then could tell it was moving up, and through the clouds. i did not see any reflection of light as it went through the clouds, but could tell that it might have passed through an opening. once it had completely disappeared, i started to return inside when i saw a second orange light (orb), coming from the same area. this orb followed the same path as the first, and up through the same area in the clouds. this orb was approx 1 minute or less behind the first. again, i turned, but this time looking for another orb, and sure enough, there was a third orb, moving on the same course. at this point i called out for my son-in-law to come out and verify what i was seeing, which he did. we watched three more orbs, moving along the same course as the first group. at this time, my daughter and wife came out to see what was going on, and during the next few minutes, they too saw this event, and counted approx 8 more orbs, totaling 12+ orbs. note that with the passing orbs, there were several times that two orbs were in plain sight at the same time, moving in the same direction. also, there were several orbs that took slightly different paths, varying by altitude, and angle of approach. during this event i moved to several different angle\\locations to see just where they were coming from but never could get a clear view, with the exception of two different times, where they seemed to flash on, then head out. this event started at approx 2150hrs and lasted until 2220hrs. we watch until 2300hrs or so not seeing any further orbs."],"Sighting Duration":"Undisclosed","Log Number":"US-09042011-0036","map":"<A HREF = \"http://maps.google.com/maps?q=35.268354,+-106.656207(31535)&iwloc=A&hl=en\"> mufon case (31535) map </A>","Date of the Event":"09/03/2011 09:50 UTC","City":"Rio Rancho","Longitude":"-106.656207","Latitude":"35.268354","Disposition":"Unknown","Country":"United States","Region":"New Mexico","Source":"MUFON"}