{"divs":["sighting details as in many reports from many states about noticing recent star-like objects, it has appeared in this area (upstate ny) at a certain time every night now (after sunset it suddenly appears) for the past 2 wks with other smaller objects in either a triangle or \"t\" position. like other reports, they all wobble and last monday, the large object made a rapid descent (observed by other witnesses as well). like many reports, the sky is too dark or the object\\s too quick\\darting to get close-up photos\\videos at night with conventional equipment. my family and i are in the category of those of you who are unsettled and confused by these witnessed events (but fascinated). last night we used high-power binoculars we recently purchased when the large star-like object appeared (suddenly from the east this time)after sunset. for some reason it worked better than our telescope. it was nothing like the bright star-like object we saw by the \"naked eye.\" large light-blue\\grey spherical orb that had small black lines that moved \"snake-like\" around the orb. there was a definite black \"v\" marking that remained prominent to the right side of the orb from top to bottom. the whole thing appeared to have movement on its surface like the sun's gas emissions and looked like its surface was slowly spinning. the other \"stars\" had the same quality but not as pronounced as this particular \"star\" that shows up all of a sudden lately."],"Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Object Features":"None","City":"Rochester","Date Submitted":"09/04/2011 11:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.123681,+-77.624883(31538)&iwloc=A&hl=en\"> mufon case (31538) map </A>","Latitude":"43.123681","Log Number":"US-09042011-0039","Tags":"City","Summary":"Large star-like wobbling orb finally observed through high power binoculars lotsof sightings of same","Region":"New York","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around September 4th 2011"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Longitude":"-77.624883","Case Number":"31538","Date of the Event":"09/04/2011 10:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/31538.html.txt","/var/www/straped/mufon/org/31538.html"],"Object Shape":"Sphere, Star-like","Object Flight Path":"Path then hovering"}