{"Summary":"Appeared as 2 pulsating orb like lights above mountains, hovering, ascended straight up in sky then across, triangular shaped","files":["/var/www/straped/mufon/html2text/31543.html.txt","/var/www/straped/mufon/org/31543.html"],"Tags":"City","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around September 4th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","Date Submitted":"09/05/2011 01:02 UTC","City":"Tucson","divs":["Sighting DetailsI am just emailing to report what I witnessed this evening. I am an attorney, and the very last person that would make up something like this. I was sitting outside this evening with my mother and my sister (Northwest Oro Valley), and we all witnessed what was not a plane, nor helicopter, and the only way I can think to describe it would be to say a UFO. It was hovering above the mountains, not even moving, then it went straight up into the sky (not horizontally as plane would fly, straight up), at a slow hovering pace, we noticed it first as two pulsing lights, it is really hard to explain. Then it moved over the sky, right above us, and it was DEFINITELY not a plane. I really do not know how to describe it, I have never seen anything like it. It was triangular shaped and had a line of lights (I would say about 5), but they were not regular lights. I really don't know how to describe it. Then it was just gone. Frankly, I am still in a state of shock and awe at this point. I had my phone with me at the time, and at first we were just so shocked at what we were seeing. Then I thought of my phone being in my hand, so I turned on the camcorder of my phone, and you can definitely see it. It is not as clear as what we saw, because it is a video from a phone, but it definitely shows the hovering lights. I don't know why I am even writing this. I guess because in case other people call in that perhaps report that they saw it, I just wanted to say don't discard them as not being credible. We saw it too. I would never in a million years make up something like this."],"Object Features":"Unknown","Object Shape":"Triangle","Case Number":"31543","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.228543,+-110.917799(31543)&iwloc=A&hl=en\"> mufon case (31543) map </A>","Weather Factors":"None","Log Number":"US-09052011-0003","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"09/04/2011 09:00 UTC","Source":"MUFON","Latitude":"32.228543","Longitude":"-110.917799","Region":"Arizona"}