{"Object Features":"Unknown","Object Flight Path":"Path with directional change","divs":["sighting detailsi was at a friend's house, we were all sober. someone pointed and said 'what is that?' it was low and fast. the location is on the flight path to o hare, it was not a plane or helicopter but a bright 'ball' heading east to lake mich. it made a slight correction to south\\southeat. my 1st thot was it was going to explode as i thot it was on fire and i was anxious about loss of life. another guy thot it was on fire too. most of the witnesses thot it was 'glowing' from a power source and not on fire (there were about 10 of us) one person thot it was a weather balloon but admitted he never saw one before. most felt it was not but couldn't give a better explanation. most thot 'ufo'. we all kinda kept looking up after that. we could see it for approx 6 seconds before it was out of sight. maybe it was longer, we were all kinda stunned.it was lower than a plane, silent and faster than a plane would have been visible. trying to understand what i was seeing was very confusing. i've always wanted to see a ufo and wondered what my response would be. in the short time span i was concerned about it exploding but it remained under 'control'. i followed it out to the street when it was done passing over, thinking maybe i could see more of it but it was gone."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.884084,+-87.622298(31555)&iwloc=A&hl=en\"> mufon case (31555) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-09052011-0014","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Disc, Fireball, Sphere","Case Number":"31555","files":["/var/www/straped/mufon/html2text/31555.html.txt","/var/www/straped/mufon/org/31555.html"],"Summary":"about 10 of us observed it, moving purposefully and fast for about 6 seconds","Source":"MUFON","Region":"Illinois","Longitude":"-87.622298","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around September 4th 2011"],"Date Submitted":"09/05/2011 02:39 UTC","Country":"United States","City":"Chicago","Date of the Event":"09/04/2011 08:03 UTC","Latitude":"41.884084","Tags":"City"}