{"map":"<A HREF = \"http://maps.google.com/maps?q=27.24414,+-82.53401(31553)&iwloc=A&hl=en\"> mufon case (31553) map </A>","Longitude":"-82.53401","Object Flight Path":"Hovering then path","Case Number":"31553","Object Shape":"Fireball, Star-like","Tags":"City","Object Features":"None","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around September 15th 2010"],"Date of the Event":"09/15/2010 09:10 UTC","Date Submitted":"09/05/2011 01:56 UTC","Log Number":"US-09052011-0012","files":["/var/www/straped/mufon/html2text/31553.html.txt","/var/www/straped/mufon/org/31553.html"],"Region":"Florida","Source":"MUFON","Weather Factors":"Windy","Latitude":"27.24414","City":"Sarasota","Country":"United States","Summary":"Several friends and I witnessed an orange ball UFO while on the beach at night.","Sighting Duration":"00:05:00","Disposition":"Insufficient Data","divs":["sighting detailsmy brother, four of his friends, and i were fishing at a spot on siesta key beach in sarasota fl known as point of rocks. we were there fishing for a few hours until we left at about 8:30 pm, just before dusk. after driving towards home for about 10 minutes, my brother realized he had left his cell phone on a large rock by the water. we went back, nobody was at the section of the beach, (it's now completely dark out) and as we stepped off a trail and onto the beach, we first noticed the ufo. it was hovering just above ground, maybe about 5 ft., above a 25ft. seawall. (on top of this seawall there is small house) at first i assumed it was some kind of torch, like a tiki-torch or citronella candle that the owner of the house had placed there. i ignored it, and none of the people who were present mentioned anything about it, so i presume they thought the same. after my brother found his cell phone, we explored the rocks. it was extremely low tide that night, so consequentially the large congregation of would-be submerged rocks were very accessible to walk around on. at some point during this sort of loitering, we payed more attention to the object, and began to question the identity of it. it looked to be too large for a torch, but it was above the ground so it could not have been a bonfire. it almost looked like a miniature sun, like a ball of fire, but no flames. it was about 5 to 10 ft. in circumference, completely motionless, besides a slight pulsation or flicker like that of a flame, and quiet (although it is possible that i\\the group was not close enough to hear any sounds it could have made). after about 30-45 seconds of observation, it simply \"took off\" extremely fast. it ascended to approximately 500 ft. as it sped away from land out into open ocean (did not go into ocean, it maintained its altitude going offshore). it did this so fast that we all witnessed it actually bend along with the curvature of the earth, and eventually fade out of view (approximately 5 second duration). i have testimony of the entire group that this event took place. all of us were literally in shock, and i'm not sure about the other witnesses, but i also felt excited. i don't believe any of us were frightened or scared, but we were all amazed during the event. i have spoken to all the witnesses since last year's incident, and all recall the event with accuracy. notes: - the ufo did not spin or oscillate to my knowledge when in motion - there were no other aerial vehicles present during the event"],"Viewing Distance":"501 Feet - 1 Mile"}