{"Weather Factors":"Unknown","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Date Submitted":"09/05/2011 02:25 UTC","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-111.905972","Date of the Event":"08/24/2011 11:00 UTC","files":["/var/www/straped/mufon/html2text/31554.html.txt","/var/www/straped/mufon/org/31554.html"],"Tags":"City","Latitude":"40.749865","map":"<A HREF = \"http://maps.google.com/maps?q=40.749865,+-111.905972(31554)&iwloc=A&hl=en\"> mufon case (31554) map </A>","Country":"United States","Summary":"observed 5-6 lights moving from north to south direction, above the homes on the east side mountians.","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around August 24th 2011"],"Disposition":"Insufficient Data","Log Number":"US-09052011-0013","Source":"MUFON","City":"Salt Lake City","divs":["Sighting DetailsI usually have trouble sleeping and like to watch the sky and the light of the city to the east of my bedroom window, I keep a pair of binoculars next to my bed and use them to look at the stars etc,on Wed the 24 was watching the sky without the binoclars and noticed about five very bright lights just above the large homes on the east mountains, they were moving from the north to south,they were moving smoothly, no bounce which would expect with the way the land runs, if they were people on off road vehicles they would bounce,or move up and down with the lay of the land, they did neither, the brightness did brighten and dim. The covered about 10- 15 miles in about one minute. I have seen this about three time in the last three months. I have lived around airports, have watched many types of aircraft. My first thoughts were what are people doing up on the mountian this late and in the dark, then realized that the way they were moving didn't seem right. There are not the first sightings I have seen over the years Just would like to know what they are. They do not frighten me, find it very interesting, just want to know."],"Case Number":"31554","Region":"Utah","Viewing Distance":"Unknown"}