{"Viewing Distance":"501 Feet - 1 Mile","Summary":"Triangular shaped with orange lights at three points. Moved North to South in formation, without sound. Visually observed for 30 seconds. Ambient light prevented digital pictures.","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/31551.html.txt","/var/www/straped/mufon/org/31551.html"],"Date of the Event":"09/04/2011 10:20 UTC","Object Features":"Other","City":"Sterling Heights","Log Number":"US-09052011-0010","Weather Factors":"Unknown","Latitude":"42.582732","Case Number":"31551","divs":["Sighting DetailsMy wife and I were visiting with friends on Sunday night. We were sitting in the backyard when we noticed three oranges lights moving in a north to south trajectory about a mile from our location. We noticed the lights because they were the brightest objects in the night sky. The three lights formed a triangle. The lights did not strobe or blink and there were no other lights visible that would have indicated a traditional aircraft. The lights flew at a relatively slow rate in the direction of Selfridge ANG base. From our vantage point it was hard to determine if the lights formed a singular object or if they were independent. If they were independent, they flew in a precise flight pattern. I attempted to take a digital picture of the lights, but the ambient light of the backyard obscured the photo. Only one light is visible in the picture. All four of us saw the lights and no one could explain what we saw. I'm convinced it was a UFO. The observation lasted for approximately 30-60 seconds until we lost sight of the lights when they passed over a stand of trees in our sightline."],"Country":"United States","Longitude":"-83.020523","trends":["There have been 13 other sightings in Sterling Heights","There were no other sightings in Sterling Heights on or around September 4th 2011"],"Disposition":"Unknown","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.582732,+-83.020523(31551)&iwloc=A&hl=en\"> mufon case (31551) map </A>","Date Submitted":"09/05/2011 12:07 UTC"}