{"Log Number":"CA-09052011-0011","Region":"Ontario","Country":"Canada","trends":["There have been 11 other sightings in Cambridge","There were no other sightings in Cambridge on or around September 4th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.364781,+-80.307308(31552)&iwloc=A&hl=en\"> mufon case (31552) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31552.html.txt","/var/www/straped/mufon/org/31552.html"],"Object Shape":"Cone, Circle, Fireball, Sphere","Weather Factors":"Unknown","Longitude":"-80.307308","City":"Cambridge","Disposition":"Unresolved","Case Number":"31552","Object Features":"Unknown","Latitude":"43.364781","Date of the Event":"09/04/2011 08:50 UTC","Viewing Distance":"20 Feet or Less, Over 1 Mile","Source":"MUFON","Summary":"Orange burning glow moving slowly in the sky at about 3000ft","Date Submitted":"09/05/2011 01:45 UTC","Tags":"City","Object Flight Path":"Path with directional change","divs":["sighting detailsstanding outside on my friends driveway, when we noticed a very bright orange light moving from w to e due sw of us, we ran into the road as we first thought plane had taken off from cykf & was fully engulfed, it was moving at the speed of an aircraft. at approx 3-5000 ft. we live on the flightpath to cyyz, but flights on that path fly at 7000-10,000 ft. and the flight path was actually behind us as only a few seconds earlier we saw a plane on approach. the orange glow got close, i ran to my car to retrieve my iphone. by the time i got the camera ready the orange glow started to change direction, i managed a quick 5 second video & then managed to get a still shot. the object was moving most likely above hwy 401, it changed direction heading southerly and then ascended. i uploaded the image to my twitter page, i also magnified the shot and uploaded that too. when enlarging on the iphone, it looked cone shaped, more half circle at the rear, but once enlarged on my computer it looks circular with a tail of fire dropping down from it at an angle. never seen anything like it before, but i am so happy that others spotted something similar & i got to take a quick shot. my twitter feed is www.twitter.com\\nigel_mufc check my tweets for 4th sept pm & 5th am. i also called the local police to report it at 20:55"]}