{"Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 12 other sightings in Lenexa","There were no other sightings in Lenexa on or around September 2nd 2011"],"Weather Factors":"Unknown","Source":"MUFON","City":"Lenexa","Date of the Event":"09/02/2011 08:41 UTC","Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsI was out swimming with my friends when I heard a noise. It was very loud, jet like. I looked up and saw a large craft above us. It had three lights going down the center, and two lights even with the bottom one. The sky was still a little grey, but you could definitely see that this craft was almost pitch black. You could tell it was triangle shaped. At first I thought it was a bomber or something similar, so I just started to get back to what I was doing. I could still hear the noise, but then it got louder. I looked overhead, and there it was again, this time seeming larger. It went off again, but then it came back to fly the direction it was originally headed. I didn't see it again, but I could easily hear it five minutes after it had left. I was pretty excited because I have always wanted to see a UFO, even though my sister doubted it. My dad was into that kind of stuff so I told him about, he thought it was cool, and later that day he found an article in the paper about all of the UFO sightings. I read it, and hopefully what I saw is not just an airplane, I want it to be known as a spacecraft."],"Region":"Kansas","Object Flight Path":"Path with directional change,Other","Summary":"Three lights down the center, two on the side. Upside down T shape","Case Number":"31550","files":["/var/www/straped/mufon/html2text/31550.html.txt","/var/www/straped/mufon/org/31550.html"],"Object Features":"Wings","Log Number":"US-09052011-0009","Viewing Distance":"101-500 Feet","Date Submitted":"09/05/2011 10:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.963307,+-94.725641(31550)&iwloc=A&hl=en\"> mufon case (31550) map </A>","Longitude":"-94.725641","Latitude":"38.963307","Object Shape":"Triangle"}