{"Date of the Event":"03/01/1975 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Region":"California","Object Flight Path":"Undisclosed","Source":"MUFON","City":"Marine Corps Base Camp Pendleton","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.315338,+-117.310552(31557)&iwloc=A&hl=en\"> mufon case (31557) map </A>","Log Number":"US-09052011-0016","Longitude":"-117.310552","Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsIn the first half of 1975 I was stationed at USMC Base Camp Pendleton at 22 Area. One morning when we were shaking out of the barracks before breakfast I noticed a lot of foot traffic milling around the Company Office. As I approached a buddy of mine that worked in the Company Office saw me and dragged me in the office and took me behind the counter, the First Sergeant was on the phone and my buddy got his attention and kind of mouthed to the sergeant could he show them to me. The sergeant looked at us kind of frowning and nodded yes. My buddy picked up as I recall 2 photos laying face down taken from a cheap Polaroid self developing camera and showed me what looked like a disc shaped metallic object with the top floor corner of our barracks in the foreground and the object maybe 500 feet beyond, you could as well see the silhouette of the rolling hills behind 22 Area, they were taken by a Marine that night before. He told me that the First Sergeant was on the phone with the \"man\" (I assumed the Colonel). Later that day when I got off work I was excited to get to the Company Office and find out what was new because the scuttle-butt had been circling all day about the photos. When I got back to the Company Area that afternoon and asked him about them, he said in a very serious tone that the photo's had been taken by someone from the Air Force (I believe a Captain), and that they would not be returned. I did not know the Marine that took the picture and I never heard another word about the photo's or the incident, I have always wondered if anyone else ever reported that event. I don't know how many of the Marines gathered around the Company Office got a peek at the photos, I don't think many because when I came out they said did you see it? I reported to them that I had and they asked me what it looked like and I told them it looked like a flying saucer, they were good clear photos of what appeared to be a hovering (stationary) metallic object. I remember looking for strings or something to support it and I saw nothing. It was at night but the night sky was light enough to see clearly the hills behind the barracks. Please email me if anyone else has reported this event."],"files":["/var/www/straped/mufon/html2text/31557.html.txt","/var/www/straped/mufon/org/31557.html"],"Country":"United States","trends":["There has been one other sighting in Marine Corps Base Camp Pendleton","There were no other sightings in Marine Corps Base Camp Pendleton on or around March 1st 1975"],"Date Submitted":"09/05/2011 05:36 UTC","Summary":"UFO Photographed at 22 Area USMC Camp Pendleton","Case Number":"31557","Latitude":"33.315338","Object Shape":"Unknown","Weather Factors":"Unknown"}