{"divs":["Sighting DetailsI was walking a friend to his car outside my house, we were looking up at the sky because we thought we'd heard rain just before. The sky was overcast and cloudy, but we saw a group of different sized, whitish orbs in the sky & became captivated. They were rapidly moving, in a clockwise circular direction. Some were larger than others,& occasionally one would break formation, then return to the circle. At times it appeared 2 were traveling together, but not always. After my friend left, I continued to go outside to look at their continued action. I called a local TV station, to inquire as to whether they'd had any reports and they said they hadn't. We ruled out a beacon or other lights used in sales promotions, it simply wasn't like that. I finally had to come back inside and go to bed. Again it is overcast this evening, with the expectation of rain, so I suspect I won't be seeing them tonight. Last night I estimate we'd watched them from about 11:30 to midnight, then I continued to go outside until after 12:30. It is inconceivable to me that there were no other witnesses to this spectacle, and I would love to know if someone else saw this. Thank you!"],"Summary":"Amazing, round spheres going in circular pattern clockwise, don't know when it started or ended; we watched an hour.","Viewing Distance":"Unknown","Sighting Duration":"01:00:00","City":"Scottsdale","Source":"MUFON","Latitude":"33.494661","Country":"United States","Object Features":"Undisclosed","Disposition":"Unresolved","Date Submitted":"09/05/2011 09:02 UTC","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/31565.html.txt","/var/www/straped/mufon/org/31565.html"],"trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around September 4th 2011"],"Object Flight Path":"Other","Log Number":"US-09052011-0023","Region":"Arizona","Date of the Event":"09/04/2011 12:00 UTC","Longitude":"-111.949838","map":"<A HREF = \"http://maps.google.com/maps?q=33.494661,+-111.949838(31565)&iwloc=A&hl=en\"> mufon case (31565) map </A>","Case Number":"31565","Weather Factors":"Unknown","Tags":"City"}