{"Date Submitted":"09/05/2011 09:35 UTC","files":["/var/www/straped/mufon/html2text/31567.html.txt","/var/www/straped/mufon/org/31567.html"],"Region":"North Dakota","Date of the Event":"09/01/2011 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.27074,+-101.773356(31567)&iwloc=A&hl=en\"> mufon case (31567) map </A>","Tags":"City","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Case Number":"31567","Object Shape":"Blimp","Longitude":"-101.773356","Country":"United States","divs":["sighting detailswe were sitting around a campfire about 15-20 minutes after sunset. the sky was not yet dark enough to see stars. my wife suddenly said \"what is that?\" and pointed south. we witnessed a large string of lights (about 12-15 of them perhaps, very close together) moving west to east at less than 50 mph (a car moving on a highway is faster). it looked to be 3 miles away and was pretty large very low to the horizon. we estimated 1000-2000 feet up. we each estimated the string 200 feet long. the string of lights were so close together my wife thought of them as a light bar. i could see them as very close lights. after we watched for a couple of minutes i asked my wife to get a pair of binoculars in the house. i stared at the lights for at least 2 minutes while she was gone. i seemed to detect some surface above and below the lights i would call dull gray. once she returned we noticed the lights turned towards the south, south east. not straight south. the string of lights shrank to a point source after the turn. i eventualy looked through the binoculars and could see brighter light on the left and dimmer on the right. i assumed the string of lights was on each side and when it was traveling sse and i could see more of the left side than the right hence the brighter left side light point than the right. the width of the lights now 1\\4th the size of the length. (about 50 feet) i watched the entire 6 minutes and we lost interest as the \"craft\" moved farther away at slow speed. later that evening we saw comercial airliners flying high overhead, we could easily see green, red and the strobe lights. we could hear them also. the craft we saw moved less than 1\\4th as fast of a commercial airliner (commercial airliners at altitudes of at least 35,000 feet) and appeared 4 times bigger. there is also a cell tower east of this sighting that we can easily see the blinking red light on top. we each commented several times that there were no other colored lights on the craft but bright white. there were no strobes. we saw several airliners over the next 3 evenings while around campfires and never as low as this craft and never as slow. my wife also saw a meteor the night before the sighting that streaked west to east and lastest 10-15 seconds. what we saw was not a meteor, commercial airliner or satellite and we saw several airliners over the 4 nights we sat around campfires. i would describe this craft as a very large blimp with only a long string of floodlights down it's center. no visible cabin, control surfaces or rudder. can't imagine why a blimp would be flying across the prairie after dusk with about 15 flood lights on it's side and no strobe or red\\green lights. we could see the left side and back of the craft."],"Viewing Distance":"Over One Mile","City":"Beulah","Summary":"string of lights, about 12 to 15. Wife described the sighting as light bar. Moved West to East for 3 minutes then turned to SSE and moved off over then next 3 minutes. We stopped watching.","trends":["There has been one other sighting in Beulah","There were no other sightings in Beulah on or around September 1st 2011"],"Object Features":"None","Object Flight Path":"Path with directional change","Latitude":"47.27074","Log Number":"US-09052011-0025"}