{"Tags":"City","City":"Los Angeles","Weather Factors":"None","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around September 4th 2011"],"Summary":"Starlike Glowing Orb Traveling SE Across Sky","Disposition":"IFO","Log Number":"US-09052011-0020","Longitude":"-118.475586","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None","Object Flight Path":"Straight-line path","Latitude":"34.237092","Date Submitted":"09/05/2011 07:05 UTC","Source":"MUFON","Case Number":"31561","files":["/var/www/straped/mufon/html2text/31561.html.txt","/var/www/straped/mufon/org/31561.html"],"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Country":"United States","Region":"California","Date of the Event":"09/04/2011 04:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.237092,+-118.475586(31561)&iwloc=A&hl=en\"> mufon case (31561) map </A>","divs":["sighting detailsobserved an luminescent silver \\ purple object directly overhead on a clear, partly clowdy day. object seen at exactly 4:55 pm pt. it was traveling about the speed of a slow moving airplane in a roughly se direction. the object looked at first like a mylar balloon. the direction of the sun leads me to believe it could have been a large mylar balloon except for the fact that the object seemed to have a very direct, very steady trajectory as if under power. ceiling on that day was unlimited. very little wind but i did not check the kvny atis (nearest airport). observed object travel in a constant rate and direction for approx three minutes. i looked away to call it to the attention of my wife but when i looked back, the object was gone. it could have traveled out of sight but it was still extremely bright when i looked away and did not seem to be fading from view. this leads me to believe the object was relatively low. perhaps below 10,000 ft. the orb looked like an extremely bright star and was about the size of an extremely bright star, except of course for the fact that it was traveling. it's possible it was a satellite but i've never observed a satellite during the day."]}