{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Object Features":"Unknown","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=44.50265,+-84.589928(31577)&iwloc=A&hl=en\"> mufon case (31577) map </A>","Source":"MUFON","Latitude":"44.50265","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"IFO","trends":["There have been 3 other sightings in Roscommon","There were no other sightings in Roscommon on or around September 3rd 2011"],"Region":"Michigan","files":["/var/www/straped/mufon/html2text/31577.html.txt","/var/www/straped/mufon/org/31577.html"],"Date of the Event":"09/03/2011 10:12 UTC","Summary":"5 orange/red lights","Log Number":"US-09062011-0008","City":"Roscommon","divs":["sighting detailswe were camping on higgins lake michigan, and i was sitting by the campfire with my wife. i always look at the sky, looking for strange things, so i have seen about everything. there were quite a bit of tall trees, but i noticed a bright orange\\red light at about 1:oclock in the sky, at around 10pm. i thought it looked odd because of the color, and there were no blinking lights, and it was kinda pulsating a bit. it was raining a bit so there were no stars. my wife and i watched it move north to south, not real fast..but probably faster then an airplane. we could see it very clearly even through the trees. we knew it was not a plane, comet, or shooting star. after it dissapeared i sat staring at the sky in the direction it had came from, when i noticed another of the exact same thing, come in the same direction...same path. this was about 15 seconds later. we watched this one move north to south until we couldnt see it anymore because of the trees. now i knew we were seeing something weird, when all the sudden about 10-15 seconds later another appeared, same color, size, path...everything. about an hour or so later, we saw another object...same everything, then 10-15 seconds later another. after that we didnt see anything else, and i watched the next night...didnt see anything but a plane...which we could also hear. i put my sighting on facebook, and within a few minutes a friend said they had seen an orange\\red object near davison mi."],"Tags":"City","Object Shape":"Circle, Fireball","Date Submitted":"09/06/2011 12:26 UTC","Case Number":"31577","Longitude":"-84.589928"}