{"files":["/var/www/straped/mufon/html2text/31573.html.txt","/var/www/straped/mufon/org/31573.html"],"Summary":"Walked outside to smoke a cigarette looked up and a thought I saw a high flying bird but then I noticed it was a craft of some sort","City":"Northfield","Disposition":"Unknown","Latitude":"44.467888","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","divs":["Sighting DetailsAs I said above I walked outside to smoke and thought I saw a high flying bird like a hawk or vulture. I looked closer as being an avid bird watcher and noticed that this was definitely not a bird. The object was hovering and had a boomerang type shape,and was a grayish black.It seemed that one side out the boomerang shape was long and pointier than the other. After one minute of hovering it began to wobble then started to move to the south over St Olaf college. When it was almost directly over St Olaf college it made a course change straight north turning on a dime. At this point it had risen well over 2000 to 3000 feet from its original height. It kept moving north toward Minneapolis rising in height as it went until I could no longer see it. It seemed to slowly go faster and faster as it rose but the craft stayed level, not like a plane where the nose goes up if you go up. I live right under a flight path for the Minneapolis airport and not 15 seconds after I saw this I saw an airplane fly over maybe they saw more than I did. I believe it was a MD-80 commercial airline possibly delta."],"Country":"United States","Object Features":"Undisclosed","Longitude":"-93.152594","Case Number":"31573","Date Submitted":"09/06/2011 10:46 UTC","Sighting Duration":"Undisclosed","Region":"Minnesota","Object Shape":"Boomerang","Date of the Event":"09/06/2011 08:20 UTC","Log Number":"US-09062011-0004","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.467888,+-93.152594(31573)&iwloc=A&hl=en\"> mufon case (31573) map </A>","trends":["There have been 4 other sightings in Northfield","There were no other sightings in Northfield on or around September 6th 2011"]}