{"map":"<A HREF = \"http://maps.google.com/maps?q=32.83569,+-96.761536(31584)&iwloc=A&hl=en\"> mufon case (31584) map </A>","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around September 6th 2011"],"Log Number":"US-09062011-0015","Source":"MUFON","Date of the Event":"09/06/2011 12:00 UTC","Viewing Distance":"Over One Mile","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"31584","Object Features":"None","Latitude":"32.83569","Longitude":"-96.761536","Disposition":"Insufficient Data","Date Submitted":"09/06/2011 02:02 UTC","Summary":"Stationary, pulsating object observed from kitchen window, before object disappeared.","files":["/var/www/straped/mufon/html2text/31584.html.txt","/var/www/straped/mufon/org/31584.html"],"City":"Dallas","Tags":"City","Object Flight Path":"Stationary","Object Shape":"Fireball, Star-like","divs":["Sighting DetailsI live in Dallas, and was rinsing a cup out in my kitchen sink when I happened to look out the window next to me and see a bright, pulsating light situated on the horizon between my neighbors' roof and a patch of trees. The light was stationary, but did not appear to be a planet, as the colors frequently changed from yellow gold, to pink, to red and orange. There may have been two smaller lights flashing at different times, actually. It was difficult to see exactly what I was looking at given the distance of myself from the object. Anyway, I observed it for around three minutes with no change aside from it's weird flashing. I felt no fear, just a kind of awe and confusion over what it was. In this time, I saw two planes fly by and matched them to both (definitely neither). After that, I went back to the living room and was on the computer for maybe fifteen minutes, before I decided to check the window again and see if the object was still there. When I checked again, it was gone. I still don't know what to make of it, since I've never observed an object like that that low in the sky and flashing like it did."],"Region":"Texas"}