{"trends":["There have been 28 other sightings in Escondido","There were no other sightings in Escondido on or around May 25th 2011"],"Date Submitted":"09/06/2011 08:22 UTC","Latitude":"33.121227","City":"Escondido","Object Shape":"Circle, Sphere, Star-like","Case Number":"31596","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Hovering then path","Object Features":"Undisclosed","Longitude":"-117.082201","Viewing Distance":"Over One Mile","divs":["Sighting DetailsThe Pulsating lights I saw from Escondido so, I estimate they dropped down directly over Valley Center, southern CA. My girl pointed out the blue one 1st and we thought it was a star for 3 minutes. Then the pulsating became more prevalent as it got closer. The blue would flash a beautifully piercing laser pen blue color for a second, go dim for a second, and then would stay a medium brightness for about 8 to 10 seconds before flashing brightly again. This was basically the size of a very bright medium sized star. Then we realized what we thought was a star under it was actually another of the exact same pulsating light, but a beautiful green color. like a green laser light. So now 5 minutes into this these 2 lights slowly rotated in a circle so the green was on top and blue on bottom, to blue back on top again. The full rotation took 5 min. then did a slight slow couple zig-zags while staying the same distance from each other . Now more than 10 minutes through this they are very bright pulsating and look like about the distance of a high up plane not to far northward from us.This is as far as they drop down and both move directly east until they disappear out of view which takes about another 7 minutes.These were definitely beautiful lights that 3 of us had never seen before. It is also possible that the lights were connected if that were so it would have been massive but i am leaning more towards they were separate. (I wrote this immediately after we witnessed the event. I have seen a couple more UFO's but this one was the most amazing and beautiful) The date is estimated. I know it was a Wednesday in may."],"files":["/var/www/straped/mufon/html2text/31596.html.txt","/var/www/straped/mufon/org/31596.html"],"Summary":"2 pulsating lights (laser pen brilliance)","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.121227,+-117.082201(31596)&iwloc=A&hl=en\"> mufon case (31596) map </A>","Weather Factors":"Unknown","Country":"United States","Date of the Event":"05/25/2011 10:15 UTC","Source":"MUFON","Region":"California","Log Number":"US-09062011-0023"}