{"files":["/var/www/straped/mufon/html2text/31594.html.txt","/var/www/straped/mufon/org/31594.html"],"Object Features":"None","Date Submitted":"09/06/2011 08:19 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.87911,+-74.725052(31594)&iwloc=A&hl=en\"> mufon case (31594) map </A>","Date of the Event":"09/05/2011 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-09062011-0021","Longitude":"-74.725052","Summary":"Bright starlight objects arc across the sky","Case Number":"31594","Latitude":"40.87911","Viewing Distance":"N/A","Tags":"City","Object Shape":"Sphere, Star-like","Source":"MUFON","Weather Factors":"None","Region":"New Jersey","City":"Mount Olive","trends":["There has been one other sighting in Mount Olive","There were no other sightings in Mount Olive on or around September 5th 2011"],"Object Flight Path":"Straight-line path","Country":"United States","divs":["Sighting DetailsWhile driving home early in the evening, we pulled into the parking lot of a shopping center when I immediately spotted four bright orange objects in the sky that were out of place in the area. The sky was slightly overcast with a crescent moon visible. Once we pulled into a parking space, I got out of my vehicle for a better look and observed four very bright objects (more luminous than any planet or star in the night sky but not as bright as the moon) moving across the sky from west to east. They appeared from behind trees along the western horizon and moved at a relative speed comparable to a high altitude commercial jetliner. Each light glowed with an orange tinge and, while in close proximity to each other, moved independently, with no observable structure linking them together. There was no direction change and as they appeared directly overhead, they all \"fizzled\" out at different times. Another witness in a darker area than us stated she could see individual structures around each light which she would compare to helicopters, but absolutely no noise was heard by anybody. I observed after their disappearance ambient glowing from each object for another several minutes before they totally disappeared, which led me to believe they may have been flares suspended from balloons but I cannot be sure."]}