{"Latitude":"40.87949","Object Features":"Other","Object Shape":"Cylinder","Disposition":"Unknown","Longitude":"-74.050862","Sighting Duration":"Undisclosed","divs":["sighting detailson the morning of 10\\22\\82 7:30 a.m. i awoke to a real sighting of an unknown object which was over my floor in front of my bed to the left. it was aprox. 10\"w x 18\"h cyclinder shaped, rotating its mass of small round, different sized shapes at an extremely fast speed in a clock wise direction, colored in blues and greens, creating a loud humming sound. this was a starting experience to come in contact with while i was awake and watching it from my bed in total amazement. i almost could not believe this was happening, before my very eyes and ears. i was looking at something that was spinning with centrifugal force that i could not explain. after viewing it for some time i gave myself a reality check and pinched myself. after i realized it was real, beautiful and bizzare i did not know what it was there for or what to do so i walked along the right wall into the next room, the bathroom and i could still hear the humming loud sound it was making so i came out went into bed and watched some more untill it dissapeared. it did not scare me and it left me with tranquillity and joy. i actually believed immediately afterwards it came to heal me. aprox. 5 years later i was in a health food store and picked up a book called metaphysical meditations and by coincidence the first page i came to was page 35 titled \"tune in with the cosmic sound\" and read about aum for the first time in my life. then i realized what i saw was the cosmic force of the universe creating the aum sound which attuned my brain wave activity; which allowed me to feel hope, security, love, and a connection to god which i still have today."],"Region":"New Jersey","Object Flight Path":"Stationary","Date Submitted":"09/06/2011 08:36 UTC","Weather Factors":"Unknown","Tags":"City","Log Number":"US-09062011-0024","trends":["There has been one other sighting in Hackensack","There were no other sightings in Hackensack on or around October 22nd 1982"],"Viewing Distance":"20 Feet or Less","Date of the Event":"10/22/1982 07:30 UTC","Summary":"Mass of blu-green small varied size atom shapes rotating very fast making loud humming sound.","Case Number":"31597","map":"<A HREF = \"http://maps.google.com/maps?q=40.87949,+-74.050862(31597)&iwloc=A&hl=en\"> mufon case (31597) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/31597.html.txt","/var/www/straped/mufon/org/31597.html"],"City":"Hackensack","Source":"MUFON"}