{"Summary":"Witnessed a 'circle of lights' UFO hover and zig-zag about 200+- feet over a corn field in Lafayette, Indiana in 1967.","Country":"United States","trends":["There have been 30 other sightings in Lafayette","There were no other sightings in Lafayette on or around August 28th 1967"],"divs":["sighting detailsi was spending the night (a friday night) to meet up with another friend the next day to go on a field trip by bus to chicago. my friends parents were having a card party, and she and i were sitting in her parents car in the driveway, listening to music and looking at the stars and talking about ufos. after a short while, i noticed an odd bright light in the sky, and jokingly told my friend that, \"...and there's one now...\" we both got out of the car and started waving our arms saying goofy kid stuff like \"come on down\", etc. and laughing. to our surprize, the object we saw simply 'dropped' from it's very high location to a much lower one. it was at this time that i could clearly see what appeared to me to be a large circle of round individual lights. we stopped goofing around, and were totally stunned by what we saw, then the object shot up, sort of zig-zagged, and sped away (north) in a blink. we both ran into the house, but of course, the adults just laughed off what we were saying. we did not go outside to check anything again, as we were truly shocked and a little frightened by our experience. my friend's cat acted very strangely the rest of the evening - sort of moaning and meowing in a way i've never heard a cat act. the next morning when we went to meet up with our friend, we were 25 minutes late. unbeknownst to us, the clock had lost time, which had made us arrive late to our friend's house. the only really interesting thing about all of this was that i have always been amazed and liked to read stories, etc about ufos, but i never once saw in any picture, story, whatever, what i witnessed that night. not until 25 years later in january\\february 1992 when i was casually watching an episode of unsolved mysteries narrated by robert stack. it was about ufos, and i was watching it in passing. it was then(and only then), that i saw a supposed picture of a ufo that was 'exactly' what i saw that night in lafayette, indiana... come to find out, the picture was taken in indiana and it was taken by a policeman. i have never been able to locate that particular episode of unsolved mysteries, but it is on record, and i definitely know what i saw. growing up in lafayette, indiana, on occasion, there was air traffic backed up from the chicago airports in our location, but even though this was an odd sight once in awhile, this is 'not' what my friend and i saw in 1967. it is truly something that has stayed in my mind like it happened yesterday my entire life. the only other time i have seen (in a movie) something closely resembling what i saw was when the spacecraft took off in et at the very end - it had that same 'circle of lights' that i clearly saw over the cornfield behind the house in lafayette, indiana in 1967. i am a current federal employee working for a law enforcement agency, and have never witnessed any event other than the one outlined above."],"Viewing Distance":"101-500 Feet","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/31592.html.txt","/var/www/straped/mufon/org/31592.html"],"Source":"MUFON","Region":"Indiana","City":"Lafayette","Date Submitted":"09/06/2011 07:45 UTC","Date of the Event":"08/28/1967 08:30 UTC","Object Features":"Unknown","Longitude":"-86.871887","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-09062011-0019","Object Shape":"Circle","Latitude":"40.422012","Disposition":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.422012,+-86.871887(31592)&iwloc=A&hl=en\"> mufon case (31592) map </A>","Case Number":"31592"}