{"Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Fort Collins","Object Flight Path":"Hovering then path","Region":"Colorado","files":["/var/www/straped/mufon/html2text/31606.html.txt","/var/www/straped/mufon/org/31606.html"],"Object Shape":"Other","Date Submitted":"09/06/2011 11:12 UTC","Date of the Event":"09/04/2011 09:02 UTC","divs":["sighting detailsi called cliff today and talked to him about what my son and i saw, and he asked me to email to let you know. we live in fort collins colorado. on sept 4th 2011 at about 9:00 pm i went outside to wait for my son whom i had told to come out to \"have a talk\". walking around in my backyard, a light in the sky caught my eye. through a tree i saw a large orange light and since it wasn't moving in the sky i thought it was a helicopter flying toward our house. i went to the outer garage door of the house to get my son to look at it as my son was coming out of the house. i told him to hurry over so we could watch it. (it's still cool for my 10 year old to watch planes and helicopters fly over). when we got to a spot where we had a clear view of the sky we saw not one, but 6 or 7 of the same lights in the sky. my son got nervous right away and asked me what it was. as i told him it was probably helicopters and we should hear something soon (which we never did). the lights on the outside of the line quickly moved left and right respectively. at the same time working into the middle, the other lights also moved in different directions and out of site. as i was telling my son that they could still be helicopters the last light appeared to go straight up\\back, and within about 4 or 5 seconds it was gone. the lights were at first about as big as making a circle with you fingers about the size of a pea, and holding your arms out at arms length. the color was an orange color and they were just \"shining\". not the pulsating thing i have since read about online. i don't have a clue on how far away these things were, but even at close range the speed in which they left is something i have never seen. i'm not a big believer in ufo's but i now have a new appreciation for the conversation. i hope all of this helps you all to find the answer. i know my son would appreciate it."],"Tags":"City","Source":"MUFON","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around September 4th 2011"],"Summary":"six or seven large orange lights in the sky","Log Number":"US-09062011-0029","Country":"United States","Case Number":"31606","Weather Factors":"Unknown","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.58628,+-105.079083(31606)&iwloc=A&hl=en\"> mufon case (31606) map </A>","Latitude":"40.58628","Sighting Duration":"Undisclosed","Longitude":"-105.079083"}