{"Source":"MUFON","City":"North Myrtle Beach","Country":"United States","Summary":"We witnessed from one to three reddish-orange objects over the ocean from our beachfront apartment. They would appear for awhile in a fixed position and then disappear.","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/31607.html.txt","/var/www/straped/mufon/more/31607_submitter_file1__NorthMyrtleBeachUFOs2.jpg","/var/www/straped/mufon/org/31607.html"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Shape":"Fireball, Sphere","Object Flight Path":"Stationary","Date Submitted":"09/07/2011 02:25 UTC","Date of the Event":"08/10/2010 10:20 UTC","Sighting Duration":"Undisclosed","trends":["There have been 24 other sightings in North Myrtle Beach","There were no other sightings in North Myrtle Beach on or around August 10th 2010","This sighting has never been favorited.",""],"Weather Factors":"None","Log Number":"US-09072011-0001","Longitude":"-78.671046","Object Features":"Unknown","Region":"South Carolina","Case Number":"31607","divs":["Sighting DetailsI attended a family reunion at Windy Hill Dunes,a North Myrtle Beach condominium in North Carolina in a complex between 48th Avenue South and 33rd Avenue South from August 6, 2010 to August 13, 2010. On the night of August 10th, some of us gathered on a fifth floor terrace overlooking the ocean at approximately 10:00 p.m. There were periodic fireworks displays to our right on the shoreline that appeared to be 2 to 3 miles away. At approximately 10:20 p.m. A single glowing reddish-orange object appeared over the ocean directly opposite our vantage point at about 20 to 30 degrees above the surface of the water. It did not move for at least two minutes; it appeared to hover over the ocean in the same position before it faded out. Less than 5 minutes later, two of these glowing reddish-orange balls appeared in a slightly different location...a bit to the right this time and at an increased elevation of perhaps 35 degrees. Soon these objects faded out. Finally, within another ten minutes three of these same objects appeared in a sideways Vee formation at about 25 to 35 degrees. They remained in that position for a good two or three minutes and then faded out. Throughout our observation time, we did not see them move at all. They just appeared and then eventually blinked out. They were not fireworks, as the pyrotechnic displays were too far away. There was no sound, and the objects were all uniform in size and color...reddish-orange with rough edges and plasma-like pulsation. Three of us saw the strange lights and agreed that they were definitely UFOs. By the time I retrieved my camera to try to capture a photo or two, the lights did not return. We speculated that the objects were attracted to the fireworks displays further down the beach. At one point not long after the three objects disappeared,my wife Carol and I noticed two silvery cylindrical craft streaking overhead at a very high elevation and with great speed. We do not know if these objects were related to our initial sighting."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.821656,+-78.671046(31607)&iwloc=A&hl=en\"> mufon case (31607) map </A>","Latitude":"33.821656"}