{"Weather Factors":"Unknown","Log Number":"US-09072011-0002","Source":"MUFON","Region":"Indiana","Date of the Event":"09/06/2011 11:30 UTC","trends":["There have been 41 other sightings in Fort Wayne","There was one other sighting in Fort Wayne on or around September 6th 2011"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Summary":"Saw a line of 5 very bright lights in sky, appeared solid","Date Submitted":"09/07/2011 02:42 UTC","Latitude":"41.088293","Tags":"City","City":"Fort Wayne","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Longitude":"-85.130581","files":["/var/www/straped/mufon/html2text/31608.html.txt","/var/www/straped/mufon/org/31608.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.088293,+-85.130581(31608)&iwloc=A&hl=en\"> mufon case (31608) map </A>","Case Number":"31608","Object Shape":"Other","divs":["sighting detailsi was taking my dogs out in my backyard when i happened to look off to the east in the sky and suddenly noticed a line of 5 bright lights that appeared to be connected as one large object that was turning in the sky. i ran back inside to tell my father what i was seeing and by the time i got back out, which was 5-10 seconds tops the object was gone. i stayed out looking with him for another 10 or so minutes when we heard a very loud plane which came into view heading northwest towards possibly the direction of columbia city\\wherever at a high speed, another did the same a few minutes later, both were very, very low flying and going in the opposite direction of the local afb (air force base). during this time we also noticed 2 very high flying planes going in a counter and alternatively clockwise circle over the area where i had seen the craft. note i saw a very similar object like this back in 2006 that did the exact same thing, one moment it was there the next it took off at an extreme rate of speed, which i assume this one did too."],"Country":"United States","Disposition":"Insufficient Data","Object Features":"Unknown"}