{"Object Shape":"Circle, Disc, Oval, Sphere, Star-like, Other","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"09/07/2011 05:30 UTC","Latitude":"42.458691","Object Features":"Unknown","Log Number":"US-09072011-0011","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Longitude":"-87.824753","Country":"United States","Weather Factors":"Unknown","trends":["There has been one other sighting in Winthrop Harbor","There were no other sightings in Winthrop Harbor on or around September 7th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Region":"Illinois","Date Submitted":"09/07/2011 06:13 UTC","Summary":"A sparkling, bright object that hoevered and then a second object that appeared above it.","Case Number":"31617","City":"Winthrop Harbor","files":["/var/www/straped/mufon/html2text/31617.html.txt","/var/www/straped/mufon/more/31617_submitter_file1__OBJECT001.JPG","/var/www/straped/mufon/more/31617_submitter_file2__OBJECT002.JPG","/var/www/straped/mufon/org/31617.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.458691,+-87.824753(31617)&iwloc=A&hl=en\"> mufon case (31617) map </A>","divs":["Sighting DetailsHere's what happened: 1. At 530am on Wednesday, September 7, 2011, I was outside on our patio, having a cigarette while the dogs were out in the backyard doing their morning business (you know what I mean). I happened to look up over the trees next door (as seen in the photograph), and noticed a bright, sparkling light hovering in the sky, directly to the SW of my position. 2. At first, I thought it was a bright star, or possibly a planet, since the dawn was breaking, and most of the stars had vanished, save for Venus and one other. However, the brightness & sparkling was really quite noticeable. 3. I then thought that the object was an airplane; living so close to Chicago, it's not uncommon to see aircraft at all distances, and I wondered if this was the same thing, but wondered why it seemed to hover in the air. I then thought, well, maybe it's flying towards me, and thus is only appearing to remain motionless. 4. Then, quite suddenly, a second object appeared, directly over the first one, shaped vertically, almost like a sail, or an uplifted rudder. I honestly was very puzzled, and thought I was seeing things. The second object also disappeared rather quickly. 5. I then realised that the object was rising, very, very slowly, through the air, up and to (my) right. It seemed to climb for a few seconds, then levelled off, and came back down! It took a long time to do so as well. I really got the impression that it was having difficulties, and, for some reason, also thought that it was an airplane being re-fueled in mid-air...I'm still not sure why. 6. At periodic intervals, the second object would appear, always on top, and always vertically aligned. It was really most puzzling. I had the strangest impression that it was reflecting light from the (not yet risen) sun, as it seemed to catch the glow from the east in that manner. But, again, it would always disappear after a few seconds. 7. I ran inside for my camera, and took several shots. I tried to capture the second object, but, alas, did not do so. I do have several images, one of which is attached to this email, highlighted with a red circle. The trees are approximately 50-60 ft tall, and about the same dimension away, in my neighbour's yard. 8. The object remained in view from 530am until 6am, when I left for the gym; however, I lost sight of it as I drove away."]}