{"Case Number":"31612","Disposition":"Unresolved","divs":["Sighting DetailsI was sitting on by balcony and smoking a cigarette. When I was finished, I just wanted to look at some clouds, and there it was. Since I have been watching the sky over Vienna the whole summer, and have seen nearly everyday at around 21:15h \"strange lights\" that where flying with enormous speed, and suddenly stopping, and accelerating after 4-5 minutes to highspeed, my first thought was that it could be an UFO. This object was just hovering there for like 10 minutes, and after a big cloud moved over it for some seconds, it was gone. When I noticed it, I ran into my room, told my girlfriend what I saw, took her \"Cannon EOS 500D\", ran back with her to the balcony, and took one snap of it, and we where seeing it both of us, I felt how my heart started beating faster and felt some strange things. I also took some photos of the airplanes in the area for comprehension, and none"],"Source":"MUFON","Log Number":"AT-09072011-0006","Sighting Duration":"00:10:00","trends":["There have been 3 other sightings in Vienna","There were no other sightings in Vienna on or around August 31st 2011","This sighting has never been favorited.",""],"Longitude":"16.38607","files":["/var/www/straped/mufon/html2text/31612.html.txt","/var/www/straped/mufon/more/31612_submitter_file1__IMG_4297.JPG","/var/www/straped/mufon/more/31612_submitter_file2__IMG_4302.JPG","/var/www/straped/mufon/more/31612_submitter_file3__IMG_4303.JPG","/var/www/straped/mufon/org/31612.html"],"Object Features":"None","Country":"Austria","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=48.205192,+16.38607(31612)&iwloc=A&hl=en\"> mufon case (31612) map </A>","Summary":"A star-like object was hovering for around 10 minutes in the sky.","Region":"Wien","Object Shape":"Sphere","Date of the Event":"08/31/2011 12:46 UTC","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary","Latitude":"48.205192","Date Submitted":"09/07/2011 09:41 UTC","City":"Vienna"}