{"Date of the Event":"09/07/2011 09:32 UTC","trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around September 7th 2011","This sighting has never been favorited.",""],"Case Number":"31625","Viewing Distance":"Unknown","Longitude":"-87.539493","Country":"United States","City":"Vincennes","Sighting Duration":"00:07:00","Region":"Indiana","files":["/var/www/straped/mufon/html2text/31625.html.txt","/var/www/straped/mufon/org/31625.html"],"divs":["Sighting DetailsI was driving south on highway 41 heading home after I got off work, but just before I reached the John Deere store, I noticed a red pulsating light to my southwest, about my 2:30 position, and about 20 degrees above the horizon heading due south parallel to the highway. I forgot to bring my camera so I drew a quick sketch of the lights. As I looked closely at it, I could see that there were two red lights, one on the front and one on the back. The front light remained constant, but the one behind it was pulsating about twice per second. The lights made an abrupt turn toward the south-southwest and picked up speed (roughly 150 to 200 mph). I followed them for about four miles before I turned west onto our road and pulled over to watch the lights. I rolled down the drivers side window and shut off the engine to listen for any noise that they might have been emmiting, but I did not hear anything, other than moderately loud traffic noise behind me on highway 41. I started up the engine about 10 seconds later and decided to make my way home, but made sure to keep my eyes on it. When pulled into our driveway I got out and watched the the lights finally disappear behind the trees on the horizon to my south-southwest. This occured from 9:32 PM EDT to 9:39 PM EDT. This is the second UFO that I have witnessed in about a week now, and I am beginning to wonder if another UFO outbreak is about to unfold, I am going to make sure to have my camera ready everytime I step outside of the house."],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Summary":"2 red lights, one pulsating and the other unwavering","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.583015,+-87.539493(31625)&iwloc=A&hl=en\"> mufon case (31625) map </A>","Log Number":"US-09072011-0019","Object Features":"None","Latitude":"38.583015","Object Shape":"Unknown","Date Submitted":"09/07/2011 10:17 UTC","Disposition":"Unknown"}