{"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"09/07/2011 10:46 UTC","Log Number":"US-09072011-0022","Object Features":"None","files":["/var/www/straped/mufon/html2text/31628.html.txt","/var/www/straped/mufon/org/31628.html"],"Weather Factors":"None","Object Shape":"Cone","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around July 9th 1974"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.711898,+-78.975601(31628)&iwloc=A&hl=en\"> mufon case (31628) map </A>","Latitude":"33.711898","Viewing Distance":"21-100 Feet, 101-500 Feet","Longitude":"-78.975601","divs":["Sighting Detailsthis is actually the first sighting i had. it took place near my home in socastee, south carolina. i was about ten or eleven years old. we lived out in the country and spent every spare moment in the woods or the river. my dad was stationed at myrtle beach a.f. base. it was summer and there was a group of kids we hung out with, hunted,fished, the whole huck finn thing. one day after lunch we were headed back out to meet up with the gang, when we heard a high pitched whining noise. we is me and my younger brother. we stopped to search for the source of the noise when the rest of the guys walked up. one of my friends asked what the noise was. i told him i didn't know after searching the sky for several seconds we saw a shiney silver colored cone shaped object (like the capsule of the appolo space program) desending over our heads. as it got closer the sound got louder and the object appeared to be spinning, why i thought this i don't know because the object did not appear to have anything sticking out from it, it was very smooth looking. we all stared at it with our heads leaned back as far as they would go. while we watched it, the object came down to maybe a hundred feet off the groung. i could see the corn field reflected in the bottom of the craft. it hovered for nearly a minute then started moving off towards the tree line, maybe a thousand feet away. there was absolutely no wind from the craft. it asended maybe 500 feet or so then moved off parallel to the ground. it might have moved about several thousand feet then hovered again. then it desended to tree top level and started moving back towards us. it made several direction changes in it's flight path. as it approached us the second time we started running towards my house, about a quarter mile away. the object then made a 45 degree turn and flew off towards the town of conway. we stopped running as the sound got softer and started watching it again. it was then that two a-7 corsairs out of myrtle beach air force base showed up at tree top level and in the blink of an eye the object shot straight up and out of sight. we ran home to tell my parents. when we got there we told my mother what we saw. she confirmed that she had heard the sound but she thought it was my father working with a drill. when we told my father, he said it was not him. then he called a friend of his who was on duty at the base. they spoke for several minutes then hung up. he never would tell us what they talked about. but he never tried to explain what we might have seen. to this day the whole incident remains fresh in my mind."],"Case Number":"31628","Country":"United States","Source":"MUFON","Tags":"City","Date of the Event":"07/09/1974 12:00 UTC","Region":"South Carolina","Disposition":"Unknown","Summary":"I believe","City":"Myrtle Beach"}