{"divs":["Sighting DetailsI am reporting this event for my husband. On Tuesday July 27th 130 am my husbandJustin was traveling south on Interstate 25 in New Mexico. He is a truck driver.The night sky was pitch dark. No moon or cloud cover. Traveling at 63 mph henoticed a bright blue light about 12 mile ahead on the exit ramp south boundside exit 138 it appeared to be like a blue laser similar to the light peopleput on the hoods of their cars. As he came nearer the ramp he saw two figuresaproximately 3-4ft tall. each was either holding a blue light or the light wascoming from their head area. He couldnt tell for sure. As he continued thefigures appeared to be looking north and south. They looked toward his truck ashe went by. The figures seemed to have on loose fitting bright silver suits,similar to Haz mat suits. He couldnt tell if they were wearing helmets. Theterrain was flat and he did not see any vehicles in the area. The ramp was anoverpass so nothing could of been out of his view. He slowed to turn around andgo back but the next exit was 30 miles down the road. My husband and I have beendriving truck for 14 years, we have seen strange lights but nothing as strangeas this. Please feel free to call if you would like a first hand account. Thankyou Robyn Webster"],"Country":"United States","Latitude":"35.196994","Case Number":"3162","Object Features":"Undisclosed","Longitude":"-105.325007","files":["/var/www/straped/mufon/html2text/3162.html.txt","/var/www/straped/mufon/org/3162.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.196994,+-105.325007(3162)&iwloc=A&hl=en\"> mufon case (3162) map </A>","Object Flight Path":"Stationary","City":"Segora","Log Number":"","Summary":"strange sighting in New Mexico","Sighting Duration":"00:05:00","Region":"New Mexico","Date Submitted":"07/27/2004 01:30 UTC","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Segora","This sighting has never been favorited."],"Object Shape":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"07/27/2004 01:30 UTC","Disposition":"Hoax","Tags":"City"}