{"Longitude":"-123.005018","Case Number":"31621","City":"Springfield","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Features":"Patterned Surface","Tags":"City","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Latitude":"44.05622","Summary":"Came over my patio from behind me going towards NW..was extremely large with no lights on.","Object Shape":"Square, Rectagular, Other","Log Number":"US-09072011-0015","files":["/var/www/straped/mufon/html2text/31621.html.txt","/var/www/straped/mufon/org/31621.html"],"trends":["There have been 14 other sightings in Springfield","There were no other sightings in Springfield on or around September 6th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.05622,+-123.005018(31621)&iwloc=A&hl=en\"> mufon case (31621) map </A>","divs":["sighting details>> september 6, 2011 >> about 9:15ish pm.... >> standing on 2nd story patio in an apt building in springfield facing north northwest ....watching stars n enjoying evening. from over my left shoulder...and not very high at all...was a huge ship of some sort..it had no lights on it..it was so close even in the evening i could see quite well that it was a brown or reddish color. it made no sound and scared the wits out of me that this huge ship was suddenly right there and so close and so huge. it was almost oval\\rectangular in shape...i say both because it was like the corners were rounded off a bit. it wasn't going too fast at all...it was headed the in the northwest in the direction of the pacific from behind me. it was dark out, but i'm in the city of springfield, oregon and its pretty bright here in the apts i live in&the hotel sign that's shines for the freeway makes it bright. this huge ship was low enough that it must have just flown right over that sign to go over my head that low. i didn't know how to get mufon to work for my mobile, & i wanted to contact someone because i'm sure i'm not the only one to see this thing...i'm right off the freeway!!! like i said brownish or maybe a red brown in color and was giant. i would venture to guess maybe a football fields size, give or take. i have always been scared of reporting this type of thing in the past, but with the mere size of this thing and its closeness to the freeway and hotel and how low it was, i can only hope someone else will report it too. >> again..this happened september 6,2011 @ approximately 9:15pm in springfield, oregon and it was going northwest."],"Date of the Event":"09/06/2011 09:15 UTC","Date Submitted":"09/07/2011 08:18 UTC","Region":"Oregon","Viewing Distance":"21-100 Feet, 101-500 Feet"}