{"files":["/var/www/straped/mufon/html2text/31639.html.txt","/var/www/straped/mufon/org/31639.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.204304,+-88.212572(31639)&iwloc=A&hl=en\"> mufon case (31639) map </A>","Object Shape":"Unknown","Date of the Event":"09/07/2011 10:15 UTC","Disposition":"Unknown","Longitude":"-88.212572","Viewing Distance":"101-500 Feet","Country":"United States","Case Number":"31639","Summary":"I saw 2 beings run and stop and a white and red light at a distance","Latitude":"35.204304","divs":["sighting detailsi went outside around 10pm to let the dogs out before retiring to bed and one of my dogs would not get off the front porch. she ran to the left of the porch and growled. i took the dogs back inside and decided 15 mins later i would go out one more time. i went out to the front porch and stood watching the skies and as i was going back inside i heard to my left something running at a high rate of speed sounding similar to running across plastic.i looked around and saw 2 beings which my first instinct was dogs. the more i looked i realized that 1 was black in color and the other was a white\\ gray color.they only had 2 legs each so i knew it was no animal.they stopped at the end of my driveway and the white\\gray turned around and looked right at me for a second and then they both ran at a high rate of speed and vanished.i do not believe in aliens but i do not know what these things were.i am still shocked and stunned and a little frightened by this.i went inside scared and looked out the windows and saw a light hovering above the trees so i ran and got my camera and video taped what i saw. there was a light above the trees blinking red and white and then it would go out. i taped this for about 3to 5 mins.there was 2 lights above and 2 lights below it. i am attaching the video and hope it can be seen clear."],"Log Number":"US-09082011-0008","City":"Savannah","Date Submitted":"09/08/2011 06:19 UTC","Region":"Tennessee","Sighting Duration":"00:25:00","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","trends":["There have been 11 other sightings in Savannah","There were no other sightings in Savannah on or around September 7th 2011"]}