{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Log Number":"US-09072011-0024","Country":"United States","Date Submitted":"09/07/2011 11:57 UTC","Sighting Duration":"Undisclosed","Weather Factors":"None","Case Number":"31630","Source":"MUFON","City":"Jackson","map":"<A HREF = \"http://maps.google.com/maps?q=40.116576,+-74.325834(31630)&iwloc=A&hl=en\"> mufon case (31630) map </A>","Latitude":"40.116576","Region":"New Jersey","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Disposition":"Unknown","Longitude":"-74.325834","Object Features":"None, Unknown","trends":["There have been 2 other sightings in Jackson","There were no other sightings in Jackson on or around August 14th 1990"],"divs":["Sighting DetailsObject seen while traveling west on highway 195, east of exit 22 over a housing development named the Plantation. It was a grey day with possible rain but the ceiling was high with no visible clouds. The object was noticed first by my father and myself. It looked like a classic diamond shaped kite black in color but a very very high altitude. We knew there wasn't an open area large enough to fly a kite so high except maybe this new housing development. So being curious and objectively scientific with an explanation as to where this could be from. My father exited the highway which was our turnoff to go home anyway. At this time the rest of my family in our vehicle were watching the object. My mother, sister, brother,aunt and cousin were present. The housing development turned out to be empty and not open enough to fly a kite. We stopped to watch and try to figure out where this apparent kite was being flown from. While watching, the object started to move around almost instantly from point to point. It was very very fast. The distance of travel was at least a hundred yards in any given direction with no clear path. Each movement was within a several hundred yard radius. This lasted a minute or two then its altitude dropped by about half and the object started to change shape. It changed several times into several different shapes while continuing to move around in the same radius. Shapes were the kite diamond then triangle, square and rectangle. After shape changing for a few minutes, it stopped and multiplied into three objects and proceeded to move around again with the three objects in unison and pattern. Shape change happened again into same shape patterns remaining in unison with movement and type of shape changing. After several more minutes it stopped and absorbed back into one object which kept the triangular shape. It now moved very high up and seemed to disappear from everyones sight except for my mothers. For the next 30 seconds she was the only one who could see the object. It then disappeared from her sight and my cousin was now the only one who could see the object. After about 30 seconds it completely disappeared from his sight and never reappeared. This event has to be the only thing that my father or my brother and I have not been able to scientifically explain or dismiss. I myself have suffered no effects psychologicaly or otherwise and neither has anyone who witnessed the object except for my cousin. Several years after the event he denied ever seeing or being present when it happened and still denies it to this day."],"Summary":"thought to be a kite unusually high up. then moved fast and far. changed shapes and multiplied","files":["/var/www/straped/mufon/html2text/31630.html.txt","/var/www/straped/mufon/org/31630.html"],"Tags":"City","Object Shape":"Diamond, Square, Rectagular, Triangle","Date of the Event":"08/14/1990 07:00 UTC"}