{"divs":["Sighting DetailsI was on my way to a friends house when I looked up at the sky, which I'm always doing, and the very first place I looked they just appeared out of thin air. I remember thinking to myself why nobody else saw what I saw. There were others round but nobody seemed to notice even when I pointed it out to a couple walking in the opposite direction. The first thing I noticed when I saw them was that all three appeared at the same time. They were all the same size and when they first appeared they big enough to hold a quarter up to. They were all the same colour. It was a very bright yellow or gold that had no illuminated qualities about it. They were coming close to me then far away agin and seemed to have no flight plan. they almost seemed like they were having fun. I could see them so clearly because the sun wasn't down yet but it also wasn't all the way up anymore. It was pretty cloudless as well. When I saw the object my first feeling was of a benevolent nature. I felt warm and comfortable. Excited and adventurous. It was amazing that I was getting to be a part of this sighting. The object seemed to fly into or through something I couldn't see at one point. I figured this because they seemed to warp or bend and expand with the air. It was a sight to behold. I immediately came to the conclusion that what I am seeing is non other than an extra terrestrial craft hard at work or just plain around. The three object took up a triangular formation then an odd looking bending light came out of all three on the furthest part from the inner triangle formation. These lights were just plain odd. They were very thick and oddly colored. They seemed to do something to the air around the crafts. When ever the craft moved the light moved with as if it were a rope hanging off the side of the craft. The light also distorted or bent the air or space around the objects until they were covered by the off looking air around them then a sudden red streak flew across the sky directly into the object and the objects, lights, and red streak all just disappeared. Once they were gone my happy feeling suddenly turned sour and I felt very angry and walked home completely forgetting to go to my friends house."],"Region":"Washington","Latitude":"45.672237","Viewing Distance":"101-500 Feet","Source":"MUFON","Summary":"Walking down the street to a friends saw the object and remembered as much as possible","Disposition":"Unresolved","Country":"United States","Date Submitted":"09/08/2011 06:32 UTC","files":["/var/www/straped/mufon/html2text/31640.html.txt","/var/www/straped/mufon/org/31640.html"],"Object Flight Path":"Other","Date of the Event":"09/08/2011 05:00 UTC","Object Shape":"Saturn-like, Sphere, Star-like, Triangle","Object Features":"Appendage(s)","Longitude":"-122.56889","map":"<A HREF = \"http://maps.google.com/maps?q=45.672237,+-122.56889(31640)&iwloc=A&hl=en\"> mufon case (31640) map </A>","Weather Factors":"Unknown","Log Number":"US-09082011-0009","City":"Vancouver","Tags":"City","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around September 8th 2011"],"Case Number":"31640","Sighting Duration":"Undisclosed"}