{"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering,Other","Log Number":"US-09082011-0015","Disposition":"Unknown","Tags":"City","Weather Factors":"None","City":"Logansport","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around September 7th 2011"],"Date Submitted":"09/08/2011 05:51 UTC","Object Features":"Unknown","Summary":"Looked like a Fireball Hovering above cornfield","Object Shape":"Fireball, Flash, Sphere","Region":"Indiana","Source":"MUFON","Date of the Event":"09/07/2011 10:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.730313,+-86.412796(31648)&iwloc=A&hl=en\"> mufon case (31648) map </A>","Country":"United States","Case Number":"31648","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/31648.html.txt","/var/www/straped/mufon/org/31648.html"],"Longitude":"-86.412796","divs":["Sighting Detailstonight my sister and I went out to just observe the sky.. in the area that she has been seeing alot of things when she is on breaks at work.. and within being there 45 mins.. at approximately 10:25pm this Very bright object appears below cloud cover.It was Orange and it looked like the thing was on FIRE. so i continued to watch it and attempt to get video of it.. and i can say this thing reminded me alot of the sighting i had when my boyfriend and daughter were outside fixing the pool. but this thing was very intense just to see it and then try to follow it, we followed it for a good 10- 15 mins.. i think? i dunno exactly..we were almost right up on this thing!!! my sister got really scared and wouldn't drive any closer to it.. as it just sorta looked like it was sitting there getting closer to us.. it was Orange and it appeared to burn with intensity.. and i was like? we aren't looking at a Lantern? it was really exciting and i kept telling my sister to get closer get closer!! and she wouldn't! this thing changed directions on us a few times as we were following it.. and we did record it.. meanwhile my sister is out at the east end of Logansport we are on the West side just out of city limits. she calls us telling us she shes something in the west... and we tell her we are chasing it! so we keep following.. and then it gets Dim a little and changes direction shortly after we stop the car to get another good look at it.. it Dropped below the tree line and i could SWEAR that it was landing!"],"Latitude":"40.730313"}