{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.625926,+-78.735506(31641)&iwloc=A&hl=en\"> mufon case (31641) map </A>","Log Number":"US-09082011-0008","Source":"MUFON","Case Number":"31641","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","Region":"North Carolina","City":"Fuquay-Varina","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Fuquay-Varina","There were no other sightings in Fuquay-Varina on or around September 8th 2011"],"Object Features":"Unknown","Disposition":"IFO","Latitude":"35.625926","Viewing Distance":"Unknown","Date Submitted":"09/08/2011 09:59 UTC","Summary":"Bright, white-silver gelcap shaped objects that glided silently over my neighborhood","Longitude":"-78.735506","divs":["Sighting DetailsSept. 8, 2011, approximately 8:25 AM. I was waiting with my 9-year-old daughter at the bus stop. We were sitting in our van with the windows down. The sky was clear and blue and I noticed something coming from the south. It was a bright, white-silver color. It would reflect sunlight from time to time. I watched as it grew nearer and could not see any wings or a vapor trail. I did not hear any engine noise. I pointed it out to my daughter and asked her what she thought it looked like (without telling her what I thought I saw) and she said it looked like a \"pill\". I then asked her if she saw any wings and she said \"No\". Then she said maybe it was a blimp. I told her it was going too fast to be a blimp. We watched as it glided almost directly over us and then I looked to the south again and saw another one, exactly the same, at what I judged to be the same altitude. My daughter's bus arrived and so I went up the street, parked the van and went to look at these things some more. I could see the two objects still gliding toward the NE from the south. I then noticed another one of the objects gliding in from the SW and heading toward the other two objects. I kept watching as they went further NE then saw a couple more join up in the \"procession\". The last two came in from the West. They were all headed the same direction which was NE. I did not hear ANY sound at all. I then heard an airplane coming from the south. From what I could tell it was at roughly the same altitude as the objects (although it's difficult for me to know since there were no wings on the objects so I could not know its true size). I could EASILY see the planes wings. It was a very dark colored plane and it was not shiny, but rather dull looking. If I had to guess I'd say it was military. It continued to fly NE. I looked back to where I had last seen the objects and some had already disappeared into the distance, but I was able to see the last couple of them fade off as they got further away. I stood outside staring up into the sky for a good 20 minutes to see if I could see more. My neighbor was outside so I told him what I had seen and we tried to come up with reasonable explanations, but really couldn't. I stayed outside for a bit longer and was able to see a Southwest Airline plane fly overhead (we live about a 35-minute drive from RDU Airport). I could clearly see its wings and the colors and hear its engines. Seeing those objects was very interesting, yet made me feel a bit strange because I could not come up with a good explanation for them. I know that commercial aircraft don't all fly at the same altitude when they are in the same airspace, so these objects were not commercial aircraft. We have helicopters fly over our house often, and they are LOUD and you can see they are helicopters. These things were not helicopters. We also live within a 2 or 3 hour drive of some military bases, and often have big military planes and helicopters fly over us. These objects were not like any of the military things I've seen before. I am just hoping that someone else, aside from me and my daughter, saw these things so that I know I am not going crazy."],"Object Shape":"Other","Date of the Event":"09/08/2011 08:25 UTC","files":["/var/www/straped/mufon/html2text/31641.html.txt","/var/www/straped/mufon/org/31641.html"]}