{"files":["/var/www/straped/mufon/html2text/31647.html.txt","/var/www/straped/mufon/org/31647.html"],"Log Number":"US-09082011-0014","Latitude":"39.588722","trends":["There have been no other sightings in North East","This sighting has never been favorited."],"Longitude":"-75.971804","Object Shape":"Egg","divs":["Sighting DetailsMy brother and i were playing in our backyard i believe in 1968. We lived out of town bordering the woods in the town of North East Md. It was summertime and still light, but soon to be dark. My brother and I were having a catch in the backyard. I was app. 8 or 9 years old at the time and my brother was app. 10 or 11 years old. My brother threw up the ball in the air and i went to catch it. I saw a bright, shiny aluminum type egg shaped object with the sun reflecting off of it fly over top of our two story farmhouse, my brother and myself and just over the tree line. It was broad day light. I asked my brother did you see that? He stated he did not see anything. It was egg shaped and just barely cleared the treeline about 40 ft. It was about 30 ft in size lengthwise and about half that width and had strange black writing on the bottom, which is the angle i saw it from for the majority of the time. It looked liked some kind of foreign writing like Russian or hieroglyphics which were in black. It moved very rapidly and the whole event took only a few seconds.It was moving so fast if you didn't happen to be looking up at the time you would have missed it. I attribute this due to the fact my brother did not see it and he was only about 20 ft away from me. It made no sound whatsoever. I was so scared i would not go outside at night for the rest of the summer. Twenty five years later while working with someone who also lived in North East at the time and bringing up the subject, he stated that at about the same time he and his friends were playing basketball in town and saw the same object, during the summer and in broad daylight as well in that same time frame of 1968."],"Region":"Maryland","Tags":"City","Date of the Event":"07/15/1968 08:00 UTC","Viewing Distance":"20 Feet or Less","Object Features":"None, Insignia","Date Submitted":"09/08/2011 04:50 UTC","Country":"United States","City":"North East","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.588722,+-75.971804(31647)&iwloc=A&hl=en\"> mufon case (31647) map </A>","Case Number":"31647","Sighting Duration":"00:00:04","Summary":"In broad daylight saw 30 ft shiny egg shaped object fly over me at a very fast rate of speed."}