{"Log Number":"US-09082011-0023","Object Features":"Unknown","Object Flight Path":"Path then hovering,Other","Longitude":"-73.193637","files":["/var/www/straped/mufon/html2text/31656.html.txt","/var/www/straped/mufon/org/31656.html"],"Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.886282,+-73.193637(31656)&iwloc=A&hl=en\"> mufon case (31656) map </A>","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"09/08/2011 10:07 UTC","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Region":"New York","City":"Smithtown","Weather Factors":"Unknown","Summary":"What at first looke like star seen moving across sky , slowed down then stopped , stationary for about 2 - 4 sec before immediatly gone","Disposition":"Unresolved","divs":["sighting detailson the evening on aug 28th just after hurricane irene passed our area leaving our town in total blackout. the night sky as a result of all area lights being out and clear air after the storm allowed for very rare vivid visibilty of the stars. my son and i were looking at the stars when he brought to my attention almost straight up what looked like all the other starts except this one was moving across the sky, first thought it was a high flying jet or maybe we saw a satellight , space station or something like that. immediatly the light\\ star began slowing down in rapid fashion, never saw an aircraft do this! within a few ticks of the clock it came to a complete stop and both my son and i realized jets, and satellights dont do that! while both of us observed this now stationary light it just and abrubtly dissappeared, my son said he actually saw it zip off at great speed, to my eye it just gone in an instant. very strange can not explain it, happened to fast to even consider a picture . did not expext this so no proof to offer . just sharing this experience as it is the strangest thing i have seen in the sky in my 57 years!"],"trends":["There have been 5 other sightings in Smithtown","There were no other sightings in Smithtown on or around August 28th 2011"],"Case Number":"31656","Latitude":"40.886282","Date of the Event":"08/28/2011 09:00 UTC"}