{"Summary":"a triangle shape craft with 1 light in the center,and went vertularly invisable as it flew over head.","Log Number":"US-09082011-0019","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"00:04:10","Object Flight Path":"Straight-line path","Tags":"City","divs":["Sighting Detailsat that time i worked grave yard. one night i got off early and went home like normal, grabed a cup of coffee and went out on the patio to relax,( i lived in a flight path of 1 public and several military airports.)knowing at this time of morning around 4am there is little to no planes in the sky.after 5 to 10 minutes to relax, unwind, enjoy the peace and quietness something caught my attention above my brow.looking straight up,an object as out of the star war movies just kept coming and coming. it was night black,triangle in shape with rounded corners,and 1 large light directly in the center. the craft gave off no sound. as i watched the craft for about 3 min. flying due south toward the state capitol it seamed to be changing.starting at the rear.it was as though you could see through it and even the stars above it.looking closely you could make out rectagular shapes apearing in the craft. as the rectagular shapes kept appearing,the less you could make out. the out line and a narrow section from the front to the center of the craft is all you could make out. it was as though this craft went almost invisable. afterward i wrote down everything i could remember. as i was writing something came to mind. just a few years earlier i was on a military base where very few people get to go to this part of the base. in one of the offices i found something showing several different crafts in detail. one was the ----- estimated 2000 to 4000 mph + . one of the other ones resembles the one i saw, but not as large. estamated 6000 to 8000 mph +. i am a very open minded person, and i really don't think this craft was man made. if it was,we had help. ???"],"Disposition":"Unknown","Source":"MUFON","Date of the Event":"09/14/2005 04:03 UTC","Date Submitted":"09/08/2011 06:54 UTC","files":["/var/www/straped/mufon/html2text/31652.html.txt","/var/www/straped/mufon/org/31652.html"],"Latitude":"38.623838","Case Number":"31652","Region":"California","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around September 14th 2005"],"Object Shape":"Triangle","Object Features":"Other","Longitude":"-121.473343","City":"Sacramento","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.623838,+-121.473343(31652)&iwloc=A&hl=en\"> mufon case (31652) map </A>"}