{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/31663.html.txt","/var/www/straped/mufon/org/31663.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.489759,+-120.690325(31663)&iwloc=A&hl=en\"> mufon case (31663) map </A>","Summary":"The whole County saw it. Why hasn't this one been covered?","Log Number":"US-09092011-0002","Date Submitted":"09/09/2011 06:57 UTC","Date of the Event":"09/29/1975 10:00 UTC","Longitude":"-120.690325","Weather Factors":"Unknown","Object Features":"Dome, Other","Viewing Distance":"501 Feet - 1 Mile","Region":"California","City":"Atascadero","divs":["Sighting DetailsSeems Like it was early fall. I do know that the approximate date was two weeks after \"Close Encounters of the Third Kind\" had come out in the theaters, because that was one of the things that Victor had said to Dan. I want to restate for the record... I don't know why this sighting hasn't been reported long before now. Everybody in three counties saw the darn thing. And it was huge. OK, So here goes... The football game wasn't quite over. I still had my Greyhounds Marching Band Sweater on. I'm pretty sure I was supposed to walk home after the game was over. I ran into Victor Smit_ and Dan Souz_ in the parking lot out in the front of Atascadero High School. Victor and Dan had procured some weed and a case of budwiser and asked if I wanted to join them. They were headed out to a spot known as 3F Meadows. One of their prefered party spots. But it seemed that Victor had decided to show us a new spot off Morro Road, not that far from our original destination. The reason he liked this new party hole was because it was just that, a hole in the center of these large rocks that had been draged together I guess by the Indians thousands of years ago.(a megalith) There was plenty of room for maybe three or four cars to park. What made this spot exceptional was that the roof line of the car was just high enough that you could see the tops of cars approaching, but thier headlights were low enough that they didn't blind you. It was easy to tell if the approaching vehical had a cherry on top. And there were six or eight ways out of there. A pretty neat spot. We had just arrived, got out to strech our legs Victor popped the trunk and we got four beers out, Bud Talls. We got back in the car listening to the radio as Dan was rolling a joint in the shotgun seat. Victor was just talking about how good it was that I had joined them that evening and commented on the stars and how bright they were in this secluded spot he had introduced us to, due to there not being any light pollution from town(Atascadero,CA). He then became very excited. \"Dan Look! It's just like in Close Encouters of the Third Kind\". Dan complained because Victor had made him screw up on rolling the joint, broke the paper or spilt it or something. Dan gave the lights in the sky an off-hand look and decided to get back to work trying to roll a joint. Dan procceded to tell the tale of how he and Victor had been to see the movie which had just opened two weeks before. He was telling us the tale of the movie when Victor just about came unglued... \"Put that shit away and look at this. They're coming right to us. Their coming right here\". Dan looked up and out the front windshield and was Freaking out. I looked at the guy who was sitting beside me in the backseat and we both leaned over the back seat to get a better look at this thing. We could see it big as life. It was approaching us from the north, heading due south, right at us. It was moving slow and low over the foothills, just to the west of town. And it was headed straight out to where we were parked, in the midlle of this circle of rocks. As it got closer to us it slowed down even more. I remember this ancient Oak tree that looked as if it had been hit by lighting once or twice in the past five hundred years, standing there under that flying sauser as though it had seen this craft before. Victor said, \"I'm going to get out and make contact\", and immediatly both Dan and I grabbed Victor. I had wrapped my arm around him from behind and Dan had his arm. I said \"Like Hell, I'm not going to go home tonight and tell mother you were abducted by aliens\". Dan said, \"Ya right, You don't even know his parents. It would be me trying to explain this shit and I say we're all staying in the car no matter what happens\". I want to call the other guy in the backseat with me Jack or Craig but I can't say for sure. Well, he spoke up and suggested that we roll down our windows and sit in the windows so we could see it better. We all agreed. That sauser hung there just above that old oak like it had just been headed out to the woods and found us in its' parking space. Then it began to just sort of moosy off toward Pozo. This is the point in my story where I want to describe the craft for you... It was as big as a NFL Regulation football held at arms length. Approximately 200-300 yrds in diameter. It was hard to tell. I don't remember there being a moon or not, or we would have been able to see the skin of the craft better. It was the classic shape of one dinner plate inverted on the other. There was no dome on top per-say, but there was a plasma like blue eletricity flowing from the top to the center and from the bottom to the centerline where the two plates would form the edge of the craft. Just so you get the idea of how low to the ground this thing was...on the bottom of the craft there were two glowing orbs of energy, one greenish-white and the other redish-orange, but as it started to move away slowly, you could see a blueish orb on the far side, so as to make a group of three glowing orbs on the bottom of the craft. As it moved off it began to gain altitude, but not much. As it went out and around the foothills toward Santa Margarita,CA. It kind of gave a wagging off the wings. (I used to dream that I was on board and gave myself a dipping of the wings, so that I would remember that it was me flying by that night, saying goodbye to myself). The story doesn't end there. Victor said \"It's headed for Black Mountain\". He fired up the car and we through out our beers that we had just opened and Dan started cleaning up that joint he never finished rolling. We scramed to the 101 south bound. Victor doing about a hundred miles per hour to Margarita. As we screamed past the graveyard at Hwy 58, I finaly talked Victor into giving up the chase. I told him, \"Look, that thing could have sat down in any one of the valleys on either side these ridges and we would be driving right past them\". We turned around at the 58 junction and headed home. I figure the only reason we weren't pulled over is because the cops were busy with the aliens. Turns out that wasn't too far from the truth. Victor dropped me off at 23:30. As I walked up the driveway to my house I decided that I had to wake up Mom, Dad, everybody and tell them what I had seen. If I waited till morning they would just blow me off as having gone out and partied too much the night before. I had to show them right now that I wasn't stoned or drunk or anything else by looking in my eyes tonight and seeing for themselves that my eyes were clear and that I was telling the truth. I had really seen a UFO. They're Real!!! I got everybody up and gathered in the living room. I knelt down in front of my father sitting in his chair and looked him in the eyes and said glancing back and forth to mother, \"Tonight I saw a UFO, for real\". My mother leaned over and sniffed me, \"you've been drinking\". \"Yes Mother, I had maybe three swollows off a beer. Don't you see? That's why I got you all up, so you can look in my eyes and know I'm telling you the truth\". Mom dismissed everyone while I knelt there at my father's knee and told him my story. \"Well\", he said. \"Sounds like you had quite a night. Let's go to bed. We'll talk about it in the morning\". Seems like the next morning was school. Victor and Dan amushed me at my locker, Physcally threating me with kicking my ass if I told anyone about our UFO experiance. They knew it would take the two of them if they were to have have any chance of carring out thier threat. What really bothered me was how scared they were that I was going to say something. What was it that they were so afraid of? That evening I was watching the evening news when there it was. KSBY San Luis Obispo's television said that the sherif and police departments had responded to calls and witnessed the object cruising on by. I tried to get my mom into the living room to show her but it was too late. That weekend my Uncle Jerry and his brood (who lived in Santa Maria, CA)were over playing cards with Mom and Dad. When Mom told Uncle Jerry, Jerry called me into the dining room and asked me what I had seen. I told my story again. He said, \"I saw it too\". Turns out he had been on the head end (he was an engineer for Southern Pacific RR) of a train pulled up to the gate at Surf, CA.. For those who don't know, Surf CA is the siding that trains have wait at before they can enter into Vandenberg AFB, the coastline. JR proceeded to tell of how he was just sitting there when our flying sauser came cruising over the coastal mountains at his back. He took notice when it dropped into his rearview mirror on the engine. It paralleled along about half of the trains length, slowly looking over the train. Just then two jets scrambled off the runway headed in the wrong direction. When they started to come back around, my Uncle Jerry said \"that sauser did a zig north and a zag west and that thing was gone like a bolt of lighting. Those two planes didn't have a chance\". It just so happened that My Uncle Jerry was actively pursuing his pilots' licence and knew just who to call at the Santa Maria Airport tower. He asked if they had seen what he had just saw? His friend told him that the craft had cruised by slow and low that they thought it was going to hit the tower. A few days after the card game, JR calls me and tells me to go down to the store and get the Telegram Tribune and look on, it was either the forth or fifth page... and there it was. No bigger than a postage stamp, tucked in among the public service announcements... \"Vandenberg AFB reported tracking a UFO. Contact was lost. An investigation is ongoing. There is nothing more to report at this time\" (or something to that effect). I was 15 years old, a freshman."],"Case Number":"31663","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Object Shape":"Disc","Latitude":"35.489759","Disposition":"Insufficient Data","trends":["There have been 5 other sightings in Atascadero","There were no other sightings in Atascadero on or around September 29th 1975"],"Country":"United States"}