{"Region":"New Mexico","Weather Factors":"Unknown","Disposition":"IFO","Object Flight Path":"Stationary,Other,Unknown","files":["/var/www/straped/mufon/html2text/3166.html.txt","/var/www/straped/mufon/org/3166.html"],"Tags":"City","trends":["There have been 2 other sightings in Durango","There were no other sightings in Durango on or around February 14th 1980"],"Longitude":"-107.827828","Date of the Event":"02/14/1980 10:00 UTC","Sighting Duration":"01:59:00","Log Number":"","Date Submitted":"02/14/1980 10:00 UTC","Summary":"saw silvery sparkes, taken underground by military","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Latitude":"37.245485","Source":"MUFON","Case Number":"3166","City":"Durango","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.245485,+-107.827828(3166)&iwloc=A&hl=en\"> mufon case (3166) map </A>","divs":["Sighting DetailsI was 16 at the time and I was hitch-hiking west bound on I 10 heading toCalifornia. Sitting on my suitcase for hours by the side of the highway.Finally, around 10 pm, i could see the lights of a car in the distance headingtoward me. The sky was moonless and was extremely clear, the stars shone withincredible beauty. The vehicle pulled up after about ten minutes, it was a whiteFord Galaxy 500, 4 door. The man mid to late 20,s in age said., where are youheading I answered California. Hop in, Im going that way. After putting mysuitcase in the back seat I got in and we proceeded westbound on I 10. We drovefor no more than a minute or two when, rounding a curve we both saw and Iexitedley yelled WOW LOOK AT THAT DO YOU SEE THAT Off to our left in the sky,visible through his drivers side of the windshield were what I can only describeas sparklers You know the kind one would light on Christmas or New years as achild and would blazen and throw off sparks all around while being waved aroundor in circles. Well I was so exited, but never the less I noticed a crossing inthe median that continued into a dirt road on the other side of the highway andturned into a dirt road which led into the direction of the lights. These lightswere sow bright that they lit up the whole side of a mountain range includingthe dirt road. So I immediately yelled to the driver, STOP, STOP, GO BACK, TAKETHE DI"],"Object Shape":"Other"}