{"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.255657,+-122.439271(31662)&iwloc=A&hl=en\"> mufon case (31662) map </A>","Longitude":"-122.439271","files":["/var/www/straped/mufon/html2text/31662.html.txt","/var/www/straped/mufon/org/31662.html"],"Case Number":"31662","Viewing Distance":"Unknown","divs":["Sighting DetailsMy significant other and I were sitting on the back porch, when an orange light caught my eye. It was immediately unusual. I live 20 miles south of an international airport, and 5 miles north of an Air Force base, and have grown up watching the skies. This was completely silent, which was the first thing that struck me as odd. I hear planes all the time. This seemed so close, the light (singular) so much larger than normal that it should be emitting sound. We walked out into the back lawn to get a better view. The light was oval in shape and seemed to pulsate in waves, and almost spin, or maybe it was more like the light was showering down. It moved at a constant speed, which seemed faster than the airplanes I see daily. The size was larger than any airplane light I've witnessed (and the color all wrong), so I assumed the object was close, but perhaps it was larger and farther away. We watched for maybe 30 seconds before it was no longer viewable. Planes seem to stay in view much longer than this object did. It appeared from the north, and disappeared to the southwest, and quickly. We sat back down and scratched our heads, and a couple of minutes later a second object appeared and followed what appeared to be the exact flight path, and had the identical features. Then it repeated a couple minutes later, for a total of 3 sightings within a period of no more than 5 minutes, all seemingly identical. I have not seen anything like that before, or since. It's quite possible it was some experimental aircraft, given my proximity to the Air Force Base, but it was definitely unusual, and definitely something I'd never witnessed in my long lifetime."],"Sighting Duration":"Undisclosed","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around September 4th 2011"],"Summary":"3 sequential objects witnessed separately minutes apart. No sound, large, orange pulsating lights. Seemed close, but absolutely no sound. Lights had oval shape.","Object Flight Path":"Path with directional change","Object Features":"Unknown","Latitude":"47.255657","City":"Tacoma","Log Number":"US-09092011-0001","Tags":"City","Weather Factors":"Unknown","Region":"Washington","Disposition":"Unresolved","Country":"United States","Date Submitted":"09/09/2011 12:34 UTC","Date of the Event":"09/04/2011 09:30 UTC","Source":"MUFON"}