{"Latitude":"36.190901","files":["/var/www/straped/mufon/html2text/31677.html.txt","/var/www/straped/mufon/org/31677.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"N/A","Case Number":"31677","Viewing Distance":"20 Feet or Less","Tags":"City","trends":["There have been no other sightings in Deering","This sighting has never been favorited."],"Weather Factors":"Unknown","Object Shape":"Circle","City":"Deering","Region":"Missouri","Disposition":"Unknown","Country":"United States","Date of the Event":"09/20/1978 12:00 UTC","Source":"MUFON","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.190901,+-89.882865(31677)&iwloc=A&hl=en\"> mufon case (31677) map </A>","Longitude":"-89.882865","divs":["Sighting DetailsMy cousin and I were riding our bicycles as young teenagers on a rural road in Southeast Missouri in the town of Deering. We were riding from the High School down the road to his house. All the sudden we looked to the left of us, and there it was, a yellowish orange orb floating about five feet off the ground next to us, keeping the same speed as the bikes. I have to say it scared us,and we didn't have far to go, we sped up and didn't look back. To this day, I don't know what it was, but never forgot. The above is just the first strange siting. Now living in New Jersey, and grown with children, retired New Jersey Air National Guard,something else happened. One day after work, 4:30 pm in the fall of 2010 I had arrived home from work. I sat back on the bed upstairs to rest and noticed while looking through our closet door mirrors, which was inline with the window, at the trees outside and I noticed an outline in the trees. The figure was very tall and thin, looked to be seven feet in height with long arms. I couldn't believe what I was seeing. I thought the tree bark was playing a trick on me, but I stayed in place to study it. As I mentioned, it was tall and very thin, had the large head and black eyes and the limbs were away from the tree trunk. It seemed to be looking at me through the mirror. So I thought maybe it doesn't notice me looking at it because I was viewing him through a mirror. So after a few minutes, I decided to actually get up and look through the window. I did, and wasn't able to find it. I then went to the bed, same position and looked through the closet door mirrors again. I couldn't find what I had saw previously. I don't know what it was, if anything, but it still bothers me. Be advised, I don't need to be contacted, just wanted to tell someone other than my family."],"Log Number":"US-09092011-0016","Date Submitted":"09/09/2011 10:00 UTC","Summary":"Yellowish/Orange in color floating ball/Orb."}