{"Disposition":"IFO","Weather Factors":"None","Longitude":"-105.458475","Sighting Duration":"00:00:59","City":"Westcliffe","Source":"MUFON","trends":["There have been 3 other sightings in Westcliffe","There were no other sightings in Westcliffe on or around July 29th 2004"],"Log Number":"","divs":["Sighting DetailsHelloLong time night observer, familiar with night sky and all objects therein.Last night, 729, at my home in Westcliffe Colorado, while stepping outside tojust enjoy the evening, a bright spot caught my attention. It was just belowthe constellation Cassiopeia in the NE and was brighter than Jupiter or Venus attheir brightest. I was surprised as neither should be there at this time andthis was a little bit too north for either. Then it intensified for 1-2 secondsand then faded quickly to almost nothing. Then I observed a low magnitudeobject at that very point and then I noticed it moving south from that spot.I guesstimated that I was observing a satellite passing over head, somethingobserved often every night and for many years. Also, that the brightness mighthave been brilliance from reflecting the sun and then the angle changes,something I had noticed before.But this was different. As it moved south, it accelerated It moved at first,at the speed of a high flying aircraft or a satellite as observed from theground. Then it appeared to be moving, for a few degrees across the sky, thenfaster and faster until it was moving some 4-6 times any observed satellite Ihad ever seen. It stayed visible for about 5 seconds longer then I lost it inthe glow from the moon, which was in the SSE.In all my years I had not seen this phenomenon.If you have any information on this, please share, e-mail or ask for my number.Noel BergeWestcliffe Colorado"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.140292,+-105.458475(3167)&iwloc=A&hl=en\"> mufon case (3167) map </A>","Latitude":"38.140292","Tags":"City","Region":"Colorado","Object Features":"Unknown","Object Flight Path":"Unknown","Date of the Event":"07/29/2004 09:30 UTC","Summary":"Bright object fades then accelerates away","Viewing Distance":"Over One Mile","Date Submitted":"07/29/2004 09:30 UTC","Object Shape":"Star-like","Case Number":"3167","files":["/var/www/straped/mufon/html2text/3167.html.txt","/var/www/straped/mufon/org/3167.html"]}