{"Object Features":"Unknown","Date Submitted":"09/09/2011 09:49 UTC","Object Shape":"Circle, Square, Rectagular, Unknown","Longitude":"-84.48436","Disposition":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Case Number":"31675","Latitude":"42.703321","Object Flight Path":"Straight-line path","Date of the Event":"09/08/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/31675.html.txt","/var/www/straped/mufon/org/31675.html"],"Log Number":"US-09092011-0014","divs":["Sighting DetailsI think it was around 11 pm, maybe earlier or maybe later. I was with a companion, walking on Michigan State University's campus. We were walking back towards the stadium, crossing the bridge over the river, the one closest to Wells Hall, when I noticed the lights. At first I only noticed the four, and pointed them out to my companion. I also pointed them out to two female students passing over the bridge at the same time. The light pollution illuminated the clouds, as did the objects. They appeared to be heading towards the stadium. I'm not sure what direction I was facing, but the stadium was to my right and the objects to my left in the sky. After watching for about thirty seconds or a minute, I told my companion that they reminded me of the Phoenix lights, something I had seen on YouTube a couple of years ago, which turned out to be flares. I suggested that these might be flares because the color was similar. He pointed out, correctly I think, that the objects were moving steadily (albeit slowly, without making any sound) to the right, towards the university, and that they were not breaking formation. They were not simply hovering and flailing about. There was wind, so I would think that balloons with flares should have been moving about more. At least, one would think. Then I saw a fifth light trailing the others, following at the same pace and in the same direction but not part of the rhomboid formation. I then realized that the lights might just have been points on a much larger object that was obscured by the clouds. A short while later, they faded away behind the clouds. Unfortunately I couldn't take any photos because my sd card slot on my phone is defective. Not sure what it was, if the lights were solitary objects or if it was part of a larger object, but it was a little eerie and unsettling. I'm pretty sure that extraterrestrial intelligence exists as a matter of probability, but I don't personally subscribe to the belief that sentient extraterrestrial life visits Earth on a regular basis and is responsible for UFO sightings. This is the only time that I have ever truly seen something that I would describe as an unidentified and unidentifiable flying object. I kept thinking it was possible that it could be a hoax but I don't know what the mechanism would have been."],"trends":["There have been 8 other sightings in East Lansing","There were no other sightings in East Lansing on or around September 8th 2011"],"Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.703321,+-84.48436(31675)&iwloc=A&hl=en\"> mufon case (31675) map </A>","City":"East Lansing","Summary":"Five lights. Four were arranged in shape of rhomboid parallelogram and moved over MSU stadium. The other was tailing the four.","Sighting Duration":"Undisclosed","Region":"Michigan","Viewing Distance":"Unknown"}