{"Date of the Event":"09/07/2011 12:00 UTC","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/31681.html.txt","/var/www/straped/mufon/org/31681.html"],"Country":"United States","Log Number":"US-09092011-0020","Source":"MUFON","trends":["There has been one other sighting in Ridgeland","There were no other sightings in Ridgeland on or around September 7th 2011"],"divs":["Sighting Details-3rd Party Report from civilian witness. Under investigation at this time, please contact me for further details if needed. I received a report of a Large Craft hovering over Grays HWY (HWY 278) Cross street Wooden Horse Run on the sharp Curve. Caller was very upset and stated that she just observed a large unidentified craft move and hover in front of her car from the sod farm fields next to the HWY at tree top level. The current information I have is that the craft had an unknown number of bright white lights surrounding it or encircling it, after hovering for a moment it then departed at a very high rate of speed and was visible again in the distance through the trees on the opposite side of the HWY for a moment. Note: I have also found that this isn't uncommon for that area and that in the past a vehicle was \"pursued\" or tracked by a similar object. Obviously many of these reports are not readily shared. I also made a report about 2 years ago in which myself and a number of other Emergency Responders witnessed similar lighted crafts within 15min North of that area from different locations."],"Longitude":"-80.980386","Object Flight Path":"Hovering then path","Latitude":"32.480744","map":"<A HREF = \"http://maps.google.com/maps?q=32.480744,+-80.980386(31681)&iwloc=A&hl=en\"> mufon case (31681) map </A>","Object Features":"Unknown","Summary":"Large Craft hovering over Highway surrounded by Bright white lights","Tags":"City","Object Shape":"Unknown","Case Number":"31681","Region":"South Carolina","City":"Ridgeland","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date Submitted":"09/09/2011 11:10 UTC"}