{"Longitude":"-120.550171","Case Number":"31686","Date Submitted":"09/09/2011 11:49 UTC","Object Flight Path":"Stationary","City":"Bend","divs":["Sighting DetailsMy girlfriend and i decided to go to the Les Schwab amphitheater at around 8:30. We were the only ones there. we walked out to the field and decided to climb this tower that said (do not climb) haha. it was about 12 feet. a minute after we got to the top of it my girlfriend said \"did you see that?\" i was like what? no. where? ( i thought she was kidding)so i looked out and probably no less than a minute i saw what she was talking about. It looked like 3 UFOs that formed a triangle, 2 UFOs at the bottom and one at the top. The 2 UFOs at the bottom had lights similar to an airplane. ( a white light with a red flashing light right next to it) except these lights were a bit bigger and they weren't moving anywhere. The third UFO that was at the top (the peak of the imaginary triangle shape)That UFO had a bigger light. And that light was white. That light would slowly brighten and look bigger. The UFOs would appear and dissapear. But they always reappeared at the same spot, they never moved. At one point there was a beam between the 2 bottom UFOS. Just a white skinny light that connected the 2. Also at one point The bright white light at the top was bright blue for a while. All of this probably lasted for 10 minutes. Also we probably sat on that tower for 4 minutes before we got scared and climbed down. we walked a few feet towards the ufos and watched them for the remaining of the time. I tried to take a picture with my cell phone. but my cell phone sucks. - we didnt hear any noise coming from the UFO's - Within the last year we have seen quite a Few UFO's together. She has also seen some more UFO's when she was not with me. as have i. They all have seemed different in some way. Friends of ours have also seen them while they were with us. We have seen them a lot in Burns OR, and the one i described was in Bend. also about 4 or 5 years ago my friends and i saw a UFO twice in one night in John Day OR. That was the first one i saw and it was very scary. - I would appreciate if you guys emailed me back and told me what you thought."],"Weather Factors":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31686.html.txt","/var/www/straped/mufon/org/31686.html"],"Viewing Distance":"Unknown","Date of the Event":"09/04/2011 08:55 UTC","Log Number":"US-09092011-0025","Summary":"We believe we saw 3 UFOs that formed an imaginary triangle. They were hovering in one spot. they'd appear and disappear. at one point we saw a beam of light connected from one UFO to the other.","Country":"United States","Latitude":"43.805943","map":"<A HREF = \"http://maps.google.com/maps?q=43.805943,+-120.550171(31686)&iwloc=A&hl=en\"> mufon case (31686) map </A>","Object Shape":"Circle, Flash","Sighting Duration":"Undisclosed","Tags":"City","Region":"Oregon","Disposition":"Insufficient Data","trends":["There have been 20 other sightings in Bend","There were no other sightings in Bend on or around September 4th 2011"],"Object Features":"Unknown"}