{"Region":"Arkansas","Object Shape":"Cross, Oval","trends":[],"Log Number":"US-09092011-0026","Case Number":"31687","Disposition":"Unresolved","Date Submitted":"09/09/2011 11:54 UTC","Object Features":"Appendage(s)","Source":"MUFON","divs":["Sighting DetailsRelaxing on back deck facing south and observed and object 45 degrees above horizon. Object seemed to be a very large aicraft at first but really caught my attention as it seemed to become much brighter.I first dismissed the light as red navigation lights but it soon became obvious that the object was a sort of T or cross shape moving away from me. It seemed to be very large and the light source pulsated and totally illuminated the object. I watched for about 1 minute and it simply went dark. About 1 minute later another object appeared from the west and I called for my wife to confirm what I was seeing. It was much brighter and more of a round light wth a hard form. This object also seemed to pulsate and abruptly fade. I am an aviation nut and can easily identify most any aircraft at a glance. I have also witnessed the passing over of countless satellites and manned spacecraft over the years but this was much different as the form was very distingushable. 2 aircraft were on approach to XNA with landing lights on and at fairly low altitude and appeared as normal on such a clear evening. We reside on the landing path approx. 5 miles from XNA. I would explain the obects a satellites normally, but the hard lines defining the shapes and the color and frequency of the light puzzle me."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","Date of the Event":"09/09/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.2026,+-91.830363(31687)&iwloc=A&hl=en\"> mufon case (31687) map </A>","Latitude":"35.2026","Longitude":"-91.830363","Sighting Duration":"Undisclosed","City":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/31687.html.txt","/var/www/straped/mufon/org/31687.html"],"Summary":"Observed 2 very different objects with similar color pulsating light","Object Flight Path":"Straight-line path,Path with directional change"}