{"divs":["sighting detailsmy wife and i were looking for shooting stars lying on our backs on the tramp in the back. it was after 1:00am. yes we were sober =) and out of no where a ufo flew over these apartments directly behind our house going exstremly fast....if i had to guess over 100 miles per hour traveling south. this ufo was huge and had no lights on. it appeared to be long almost like a huge battle ship in the sky. it made no engine sound it just made \"moving through the air sound\". almost like it was solar powered. my wife and i froze in shock of what we had seen. we both saw it and were just amazed and freaked out by it. it was flying in a straight path and in low air space...illegal flying \"way to low\" but super fast. no lights? never seen anything like it...? fyi: this area has had ufo sightings in past some documented,etc. note: my wife and i know what we saw. it was real! we share it with friends and they think we are crazy ha ha just kidding... well i am sure some do but they haven't came forward... lol sicerely- (name removed to fi field) cms 09\\09\\11 22:52 cst flg"],"Date Submitted":"09/09/2011 11:32 UTC","Object Flight Path":"Straight-line path","Object Shape":"Bullet, Missile, Other","Longitude":"-119.23153","Object Features":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.206329,+-119.23153(31683)&iwloc=A&hl=en\"> mufon case (31683) map </A>","City":"Kennewick","Log Number":"US-09092011-0022","Country":"United States","trends":["There have been 14 other sightings in Kennewick","There were no other sightings in Kennewick on or around August 15th 2009"],"Case Number":"31683","Summary":"wife and I looking for shooting stars and a space ship or ufo flew passed us over the apartments flying over 100 mils an hour at illegal flying space...","Sighting Duration":"00:00:10","Weather Factors":"Unknown","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet","Source":"MUFON","Date of the Event":"08/15/2009 12:00 UTC","Latitude":"46.206329","files":["/var/www/straped/mufon/html2text/31683.html.txt","/var/www/straped/mufon/org/31683.html"],"Region":"Washington","Tags":"City"}