{"Longitude":"-123.894384","Source":"MUFON","City":"Hoquiam","Weather Factors":"Unknown","Latitude":"46.982823","map":"<A HREF = \"http://maps.google.com/maps?q=46.982823,+-123.894384(31682)&iwloc=A&hl=en\"> mufon case (31682) map </A>","files":["/var/www/straped/mufon/html2text/31682.html.txt","/var/www/straped/mufon/org/31682.html"],"Disposition":"Unresolved","Log Number":"US-09092011-0021","Date Submitted":"09/09/2011 11:16 UTC","Object Shape":"Circle","Country":"United States","Case Number":"31682","Summary":"small pool of light, 5th grade, it was on the grass, when I approached it backed up..couple times","divs":["Sighting DetailsI realize that as a senior you may think it odd to share this story after so many years. I have told it to my family..but they like everyone I ever met just..look at me and roll eyes. This took place apx 1956 I was in 5th grade, I was walking to my elementary school this is the same street I lived on was about halfway to school when I noticed on ground on the grass a pool of light...not a beaming thing..it was flat..light...dont know how to explain that except I dont recall it having any height...it was a small circle of light...if you could pour light on the ground thats exactly what I saw...just a pool of light. Since I am now in my sixties...you can imagine people say it was a sun beam. This was apx 7:30 in morning and no this was no sun beam. Because when I saw it......and walked over to it it backed up..I again went toward it and it backed up again... I just stopped and looked at it...it then moved...like a puddle of light off the grass down the curb and accross the street, about half way to other side of street I heard someone say \"you will be late for school\" , I followed it and it went up the curb like it had went down ...and stayed their for a moment...I really wanted to touch it..but it then started to move away from me and went so fast it was gone I been married 47 years, I told my parents...my husband, my children and my grand children...no one understands that I have no explaination for what I saw that day. Its frustrating that we cannot validate this to our family on something that is witnessed only by yourself, and as a child I did not have a clue what I was seeing.. I do know I told my parents I saw an angel that day... I am retired ..and I am trying to inquire if you have a data base for people like myself who see something odd that is not explainable, even in this day and age. My family gets embarrassed that I should even look into this after all these years..but in my mind, I would just like to know what it was I saw. Apx one year later.1957 (best guess).their was an article in our local paper and no I cant remember what it was entitled..but it was a sighting by a lady who lived just few blocks from us...it was in the paper I do know that much..She saw a something outside her window that (it was like a small ball....I cant remember much about but will try to locate that aricle if I get to visit family who still live in that town. if you able to help me understand this I would appreicate it very much."],"Tags":"City","trends":["There have been 2 other sightings in Hoquiam","There were no other sightings in Hoquiam on or around April 17th 1957"],"Object Features":"Undisclosed","Region":"Washington","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Date of the Event":"04/17/1957 12:00 UTC","Object Flight Path":"Path with directional change"}