{"Country":"United States","Tags":"City","Latitude":"41.689444","divs":["Sighting DetailsDec 24 1999 rural albion nebraska,man 30, wife29, son 7 and half. Diving home after christmas eve visiting parents one half mile from my place,still clear night,bright moon and snow on ground. As driving to my farm saw to right side of car a large black object going same speed low to the ground. I said to my wife and son look at that! They saw it. Continued to follow it past my place roughly three quarters of a mile. It then stopped in mid air. We never went over 40 miles an hour. I shut car off and got out and looked up at this huge triangular object. It made no sound. Three lights on each end of the bottom of triangle. I stood and watched for several minutes. My wife, very upset was yelling for me to get back into car. My son said nothing, but watched. The object then slowly turned north and to me just disappeared. We all looked at the night sky totally bewildered. I got back in car and went home. We did not sleep well. My wife did make a report on internet, but nothing came of it. Having taken flying lessons, I know this was no plane. We told some people but was not received well. My son never wanted to talk about it till lately. He is 19 in collage and is considering hypnosis about the event. He thinks I should too since I was outside. Would like advice thanks. darrelltexley@yahoo.com"],"Longitude":"-98.003056","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path then hovering","Object Shape":"Triangle","Date of the Event":"12/24/1999 12:00 UTC","Source":"MUFON","Region":"Nebraska","Sighting Duration":"Undisclosed","Log Number":"US-09102011-0010","files":["/var/www/straped/mufon/html2text/31697.html.txt","/var/www/straped/mufon/org/31697.html"],"City":"Albion","Weather Factors":"Unknown","Date Submitted":"09/10/2011 02:27 UTC","Case Number":"31697","Disposition":"Unknown","trends":["There have been no other sightings in Albion","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.689444,+-98.003056(31697)&iwloc=A&hl=en\"> mufon case (31697) map </A>","Summary":"huge triagle black 3 bottom lights"}