{"Tags":"City","Sighting Duration":"Undisclosed","Case Number":"31690","Summary":"2 people in callahan florida see bright light in treetops take off into space........","Source":"MUFON","City":"Callahan","map":"<A HREF = \"http://maps.google.com/maps?q=30.569021,+-81.822172(31690)&iwloc=A&hl=en\"> mufon case (31690) map </A>","Latitude":"30.569021","Region":"Florida","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/31690.html.txt","/var/www/straped/mufon/org/31690.html"],"Country":"United States","Weather Factors":"Unknown","Longitude":"-81.822172","Object Features":"Other","Date Submitted":"09/10/2011 01:18 UTC","divs":["sighting detailsa friend and i were in his backyard from 10pm untill 3:45am. we had been discussing ufo's and zodiac signs then listening to music that envolved extraterestrial content. then i read my horoscope and it clearly stated id be afraid and intrigued by a new relationship. then my friend noticed a light behind a pine tree in his backyard. i didnt see it so i dismissed his statement and continued on with mine and and quote, i said that dosent make any (word removded) cms flg sense the a huge brite whitish blue light emerged from behind the pine tree went forward about 100- 150 feet then turned and shot into the sky away from us and as quick as we saw it, it dissapeared. this isnt the first time ive seen this light in the sky but never this close and its never turned always a straight path. after the sighting we started feeling weird and both described the same symptoms to each other, a light headedness upset stomach cold and hot sensation just a over all uncomfortability. i was at the time amazed. my friend and i were taping each other but was in such shock it was like punching. after it dissapeared i jumped out of my chair and shouted( word removed) cms flg 09\\10\\11 09:09 cst was that i was at the time very astonished and couldnt grasp why me and my friend witnessed that. im kind of scared because i have seen the light sense but no where near as close and before also nowhere near as close."],"trends":["There have been 2 other sightings in Callahan","There were no other sightings in Callahan on or around September 3rd 2011"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Viewing Distance":"101-500 Feet","Date of the Event":"09/03/2011 12:00 UTC","Log Number":"US-09102011-0003","Disposition":"Unresolved"}