{"map":"<A HREF = \"http://maps.google.com/maps?q=38.76614,+-90.252805(31692)&iwloc=A&hl=en\"> mufon case (31692) map </A>","Log Number":"US-09102011-0005","Source":"MUFON","Date of the Event":"07/15/1968 12:00 UTC","Longitude":"-90.252805","Country":"United States","Disposition":"Hoax","City":"St Louis","Object Flight Path":"Undisclosed","Tags":"City","Latitude":"38.76614","Region":"Missouri","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Case Number":"31692","Date Submitted":"09/10/2011 01:22 UTC","files":["/var/www/straped/mufon/html2text/31692.html.txt","/var/www/straped/mufon/org/31692.html"],"divs":["sighting detailsi must be completely out of my mind for doing this, but here goes. i was pitching a fit to go with my mother. she was dressed like she was going to go shopping. i get the distinct feeling someone else was there, but don't remember seeing anyone. mom told me i could not go this time. she was unusually calm, for my obnoxious behavior. she told me to go to the bedroom and take a nap with my dad and my brother. i said i would. but i remember distinctly, that i wasn't tired and i wasn't going to take a nap. i was going to go play in my room. my room was the last room on the left at the end of the hall. my dad and brother had just walked down to my parents room (last bedroom on the right). my brother's room was on the left, just before mine. as i passed his room, i looked in. there was this huge, weird looking head in the window with bigger than normal eyes and it had on a big, blonde wig. the sun was really bright coming through the window behind it's head. i knew it had seen me and i was scared. so i ran to get my dad. but he and my brother were sprawled out on my parent's bed and they were completely asleep. i remember thinking that was not right, because they had just came in there. then a thought that was not my own popped in my head. \"you should go to sleep.\" so i climbed up on the bed and that is all i remember. here is some other information. - my brother's bedroom window looked out into our front yard. - my mother was pregnant with my sister at this time. - i was wearing play clothes. - the sun was shining. it was a very sunny day. there are some things that are simply, just not right about this, at all. - why did my dad take off down the hall with my brother while i screamed & yelled at my mother? my dad was the type to snatch you up and tan your hide for acting like that. - why was my mother so calm, when she was always loud and high strung about most everything? - who was my mother leaving with? and why can't i remember any one else being there? - and how did my dad and brother go to sleep so quickly? and why weren't they laying in the bed like you're supposed to lay in a bed? i re-visit this memory at least once a year. i usually just file it back away and go on with my life. but the older i get, the more i want to find out what this is. growing up, i don't remember ever not having this memory. periodically, since high school, i have shared this memory with various individuals. once in a while, i have actually been lucky enough to share it with someone who didn't call me a total nut-job. where\\how can i find someone who can help me figure out what these memories are? i really want to know."],"trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around July 15th 1968"],"Summary":"I think I might have seen my mother abducted.","Weather Factors":"Unknown","Viewing Distance":"Unknown"}