{"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Latitude":"34.347252","Disposition":"Unresolved","Log Number":"US-09102011-0007","divs":["Sighting Detailsok, well I've never spoke of this outside my family. But this has haunted me for years. I cannot explain what I saw, because for years I have listened to other reports and have never heard of any other experience like I had. First of all, I am an above average intelligent person, with common sense and problem solving skills. But I still cannot reconcile what i saw. I lived in Lake Havasu, AZ 93-94. what i went thru caused me to pack up my entire house and leave overnite, and move an entire state away. At first I tried to talk about it to others, but after much ridicule, I stopped and kept it to myself. But now, for some reason, my senses are begging me to reach out. In fact I am so frightend of what I experienced that I only mention the high points of my experience to see if anyone has had anything similar. so, for my own piece of mind I\"ll give this one last try: Just for the record the security officer at my work put in his official nightly report an ufo experience for the same night. It was not like mine. My experience happened over my home. also more to this, not willing to put here. my daughter was only 3 at the time. Dusk, vacuum of silence, cloaked, immense, capital letter I, slow moving, low orbit(maybe 40 stories) lit from within 4 half globes each side just inside of the ends. things were milling around inside. The embryonic, electrical smell. 2 weeks later. came home to look thru my front window to see someone or something (dark figure) running out the back kitchen door. packed up that night and moved out of state the next morning. since then, I feel watched. a spooky kinda feeling. night terrors and sweats, and still to his day experience the strangest things. almost what some would call a haunting. oh I just want to put this to bed. if anyone out there has had anything like this happen to them, i just need validation. thxh"],"Object Shape":"Other","trends":["There have been 8 other sightings in lake havasu","There were no other sightings in lake havasu on or around April 24th 1994"],"Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=34.347252,+-114.175133(31694)&iwloc=A&hl=en\"> mufon case (31694) map </A>","Longitude":"-114.175133","City":"lake havasu","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"09/10/2011 01:50 UTC","Viewing Distance":"Unknown","Case Number":"31694","Summary":"haunting experience","Date of the Event":"04/24/1994 12:00 UTC","files":["/var/www/straped/mufon/html2text/31694.html.txt","/var/www/straped/mufon/org/31694.html"]}