{"Object Flight Path":"Unknown","Region":"Colorado","Log Number":"US-09102011-0006","Country":"United States","Disposition":"Unknown","Sighting Duration":"Undisclosed","Summary":"A Three Light Triangle in the Sky","divs":["Sighting DetailsI can't remember the exact date but I think it was around Thanksgiving in 2010. My Wife and I were driving back home after dinner at my parents house somewhere between 8pm-10pm, dark outside and clear skies. The drive home was from Boulder to Loveland. I took the back roads. After driving through Hygiene and crossing Highway 66 via N 75th St., we saw three lights - where the points of a triangle would be. It appeared to have a very large wing span (if it had wings). For example, looking at the hills to the East as you drive North between HWY 66 and the sharp turn on N 75th,the lights spanned the entire big hill with the weather station or whatever that place is. At first I thought the lights were coming from there. Once we turned the sharp turn on N 75th we realized the lights were way out there, possibly over Mead and appeared to be maybe 10,000ft. After the turn, N 75th turns into Woodland Rd., its a pretty open view of the sky. The lights didn't flicker or move at all, and as we drove East on Woodland Rd. the object didn't get any bigger - so it must have been far away. I turned left onto N 83rd St., the lights still shining, and drove up the hill. Over the hill, the trees block the view of the East for a mile or two, but once a clear view was able, near Yellowstone Rd., we looked for the lights and they were gone. I'm curious to know if others around my area have witnessed anything similar and what the logical explanation might be. I've seen video clips shown on TV of similar light formations in the sky."],"Viewing Distance":"Unknown","Longitude":"-105.092998","City":"Longmont","Date Submitted":"09/10/2011 01:42 UTC","files":["/var/www/straped/mufon/html2text/31693.html.txt","/var/www/straped/mufon/org/31693.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.172247,+-105.092998(31693)&iwloc=A&hl=en\"> mufon case (31693) map </A>","Weather Factors":"Unknown","Latitude":"40.172247","Case Number":"31693","trends":["There have been 30 other sightings in Longmont","There were no other sightings in Longmont on or around November 24th 2010"],"Source":"MUFON","Object Shape":"Triangle","Date of the Event":"11/24/2010 12:00 UTC","Object Features":"Undisclosed"}