{"Disposition":"Unresolved","Longitude":"-81.512354","Summary":"OBJECT ENTERING ATMOSPHERE IN A SLOW, CONTROLLED D","Country":"United States","Date Submitted":"03/05/2004 11:00 UTC","Region":"Florida","divs":["Sighting DetailsWe were conducting training exercises in northern Kuwait. It was late at night,just after 11pm. We had prepared out sleeping bags on the roof of our humvee. We were looking up at the stars. I had gotten out my night vision, since youcan see almost twice as many stars. We were at least 20 miles from anypopulated areas so visibility was very good. I was looking through the nightvis when i noticed an object that seemed to be coming into the atmosphere. Itwas not a meteor, since its decent was slow and controlled in nature. Myobersvation is that this object was entering the atmosphere. The objects lumincreased, and you could tell that it was getting hotter, almost like it wasflaming. This kept up for a few minutes, then the glow started to lessen, as ifit were cooling off. Even after the object had completely cooled off, i couldview it in the night vision. It was moving rather slow across the sky,obviously very high in alitude. Even though it was moving slow across the sky,i would say that its ground speed wouldve been that of a highspeed aircraft. The object seemed to be heading from the north, to the east. I watched it forquite sometime before it became to dim to pick up in night vision."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.672627,+-81.512354(3169)&iwloc=A&hl=en\"> mufon case (3169) map </A>","files":["/var/www/straped/mufon/html2text/3169.html.txt","/var/www/straped/mufon/org/3169.html"],"Log Number":"","Viewing Distance":"Over One Mile","Latitude":"27.672627","Object Flight Path":"Other","Object Shape":"Other","Tags":"City","Case Number":"3169","Source":"MUFON","City":"NORTHERN DESSERT","Weather Factors":"Unknown","trends":["There have been no other sightings in NORTHERN DESSERT","This sighting has never been favorited."],"Date of the Event":"03/05/2004 11:00 UTC","Sighting Duration":"00:05:00","Object Features":"Undisclosed"}