{"divs":["Sighting DetailsWel, one night im with some friends and we decide to go to a local playground near a school where they have taken down all the trees for the kids. It was light when we got there and it turned dark rather quickly i remember, but we never thought anything of it. As soon as it turned dark i wanted to sit around and look at stars as i normally do because i have a dream to be an astronomer, so we did. I noticed a few lights that were moving in the sky and with the amount of air traffic out this way i didnt think it was anything unnatural. As i continued looking up more staring appearing and as it caught my eye i started noticing the lights would come on then go off after a few seconds, or they would blink as if in a code then another would simotaeuosly blink . Then all of a sudden i seen about had to be over 10 or 15 lights all going in different directions in the sky all blinking in different patterns. i watched the flight path to see if it could be identified as a jet but i dont think i know of a jet yet that can take right angle turns and slow down almsot to a stop instantly after zooming acrosss the sky. We continued to watch these lights until they all dispersed and we retreated back to my house. After the strange appearance we went to lay on my roof to look at the stars again to see if we could find anything else. Two things happened while on the roof.Both i encountered but only on of these did one of my friends see. The one we both seen was a bright flash in the sky jsut behind a thin cloud cover u could mostly see behind. now this light was more of a strob light or a really powerful explosion of light off a high powered prejector but it was in midair as if it was cloud to cloud lightning but this was not lightning and this cloud could not have produced it being as thin as it was. my friends girlfriend who was up at the moment wasnt lookin but claims to have seen in her perifial vision a bright flash. Now the one i seen and they didnt is when i was laying down looking up and they were kissing, i know it seems like its made up but i dont have time to be typing all this making this up, while they were kissing i seen almost a long missle shaped ship with a transparant bottom shoot overhead towards the light, and i coul have sworn i seen more than one but it was so fast if you bliked u would most likely miss them. Anyways this happened all in the same night. And even before all this happened i have been seeing strange lights floating and flying stangly and just disappearin all in the sky.. i hope you find my story credible because i have never told anyone."],"Latitude":"32.723645","Log Number":"US-09102011-0014","Longitude":"-82.724832","Object Features":"Unknown","City":"Wrightsville","files":["/var/www/straped/mufon/html2text/31703.html.txt","/var/www/straped/mufon/org/31703.html"],"Object Flight Path":"Other","Sighting Duration":"Undisclosed","Date Submitted":"09/10/2011 10:20 UTC","Source":"MUFON","Date of the Event":"02/07/2011 12:00 UTC","Region":"Georgia","Weather Factors":"Unknown","Summary":"Hard to believe yet unexplainable","Viewing Distance":"Over One Mile","Country":"United States","trends":["There has been one other sighting in Wrightsville","There were no other sightings in Wrightsville on or around February 7th 2011"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.723645,+-82.724832(31703)&iwloc=A&hl=en\"> mufon case (31703) map </A>","Object Shape":"Bullet, Missile, Circle, Sphere, Star-like","Tags":"City","Case Number":"31703"}