{"City":"Chicago","Source":"MUFON","Disposition":"IFO","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.000982,+-87.79299(31709)&iwloc=A&hl=en\"> mufon case (31709) map </A>","Summary":"Overnite white imprint found on living room picture window.","divs":["Sighting DetailsLike any other morning ritual opened the living room window blinds for daylight. Found mysterious and unusually large white imprint. An erie feeling I felt immediately. Such a large wing suggesting a wingspan around 6-8 feet. Large body imprint and ratio to wingspan. That path of observation concluded with an unnerving reaction to its head. It looked evil and demonic. The pointed ears. Its eyes. If it wasn't for what I am about to say next I would have never taken this investigation this far. My eyes are seeing what looks like \"teeth\"!! Yes teeth!!! Wishing to document this I took digital camera shots from different interior angles for better defintion. Instinctively I then got the outside water hose to erase it. Found no feathers below elevated PW. Then took camera sim card to a major TV store. Wanted the best LCD resolution for enhancement and largest TV size for scale to my 72\" X 60\" picture window. Technician implemented and confirmation was made of teeth. Moreso fellow workers where schocked by its evil and demonic look too. This is my UFO and it desperately needs identification especially when the veiwing audience all agrees. Please notice that the different camera angles somehow give a different look to the static image. Almost holographic. Incidentally I told my story to the neighbor. He too had an encounter. Breifly saw it and heard its large flapping wings. Quickly ran inside and prayed with his Mexican wife. The catholic cemetery borders both our backyards. Asked church for blessing but they declined. Went the opposite to a psychic and she said \"a sleeper demon\" entered the house. Hopefully the attached pictures will help you help me define this."],"Date of the Event":"05/15/2007 12:00 UTC","Date Submitted":"09/10/2011 12:04 UTC","Longitude":"-87.79299","Sighting Duration":"Undisclosed","Latitude":"42.000982","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around May 15th 2007","This sighting has never been favorited.",""],"Viewing Distance":"20 Feet or Less","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/31709.html.txt","/var/www/straped/mufon/org/31709.html"],"Country":"United States","Region":"Illinois","Log Number":"US-09102011-0020","Weather Factors":"Unknown","Case Number":"31709","Object Shape":"Other, Unknown","Object Features":"Window(s), Appendage(s), Wings"}