{"Disposition":"Unresolved","Source":"MUFON","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around September 10th 2011"],"Latitude":"36.782538","City":"Virginia Beach","Summary":"Spotted several round orbs all week single brite & clustered flat light.","divs":["Sighting DetailsOver a dozen round ojjects hovering but slowly moving, or staying stationary as earth moved. They have been here all week at night. They are round and a few can be mistaken for venus or jupiter, but lower than cloud cover and much larger than a normal star or satelite, Some can be seen even though not lit up, especially thru the scope I used after visual sighting. Tonite (9-10-11) is clear and I watched them for over an hour. There was a cluster of six that trailed the bright one. There were 4-6 bright onesd scattered at distance. The closest one was quite the britest. I have viewed it at least 4 nights this weel from @1am to 4am. Other nights were too cloudy to see. By searching with my scope, I detected some that I could not see exceept thru the scope. The cluster is very faint visually, clear when scoped. The cluster moved around each other in no particular shape. I watched them go from round to thin as they assumed disc shaping. They seem to be normally orb shaped. The closest ones can be detaile thru the scope. They look like round balls of white rough surface characteristics. I liken it to a softball or baseball without a hide cover. You can see lines and ridges in a haphazard fashion making a type of texture more than anything. A black line went from top to bottom, down the center. You could see the object rotating, bur it seemed to mostly be back and forth by quarter and half turns. It sometimes changes shape like a balloon that deflating or being compressed (smashed) into another form than round. It sometimes is viewed asa quarter moon or half moon style. It appears malleable at times, becoming a cone or disc or quarter moon. The strangest thing about it is some shapless blobs appearing on it's surface. All roundish or blobish or paisley shaped. Sone seemed static, but some appeared to move. At times they appeaared 3-dimensioinal, rather than always flat on the surface. I would best describe them as giant bacteria or virus cells that appear round under a microscope. Their behavior mimiced the same. Pac Man comes to mind."],"Sighting Duration":"Undisclosed","Object Shape":"Cone, Circle, Disc, Oval, Sphere","Log Number":"US-09102011-0014","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31701.html.txt","/var/www/straped/mufon/org/31701.html"],"Object Features":"Patterned Surface","Date Submitted":"09/10/2011 05:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.782538,+-75.98226(31701)&iwloc=A&hl=en\"> mufon case (31701) map </A>","Date of the Event":"09/10/2011 12:00 UTC","Case Number":"31701","Region":"Virginia","Longitude":"-75.98226","Object Flight Path":"Hovering then path","Tags":"City","Viewing Distance":"Unknown"}