{"Case Number":"31712","City":"New York","Source":"MUFON","Longitude":"-74.010617","Latitude":"40.718846","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI began noticing what appeared to be a bright star out of my window, high in the sky over Jersey City from the 20th floor of my apartment in Tribeca. It was a bright star-like light. I noticed that the light was pulsating so I kept and on it and it started to move diagonally. It would hover in the same place then suddenly make short, quick diagonal movements. On occasion it seemed to change colors, red mostly. The first night I saw it I watched intensely. It very slowly made its way north, as if it was surveying manhattan from afar. It would hover for an hour, making its diagonal movements and then when i would look up an hour later it would be further north. I had many people tell me it was probably a weather ballon or satellite or something like that. The diagonal movement was odd though and I don't know how you could explain that. Anyhow, I kept an eye on the sky and the thing was showing up every night anywhere between 11am and 1am and doing the same thing. I finally got used to it. Perhaps it is a military surveillance, but I wouldn't be surprised if it is a UFO. I'd be happy to show someone where it is and would appreciate if anyone can explain what it is. I moved in June, but it was there every night."],"Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around October 1st 2010"],"Object Shape":"Star-like","Summary":"Distant pulsating star like object that hovered over Jersey CIty making short, quick diagonal movements, appeared in the same area every night and made a northern path as if surveying manhattan from about midnight - 5am","Date of the Event":"10/01/2010 12:00 UTC","Log Number":"US-09102011-0023","Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=40.718846,+-74.010617(31712)&iwloc=A&hl=en\"> mufon case (31712) map </A>","Region":"New York","Viewing Distance":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31712.html.txt","/var/www/straped/mufon/org/31712.html"],"Tags":"City","Object Features":"Unknown","Country":"United States","Date Submitted":"09/10/2011 12:28 UTC"}