{"Object Shape":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 14 other sightings in Mansfield","There were no other sightings in Mansfield on or around August 27th 2011"],"Disposition":"Unresolved","Object Features":"Unknown","Summary":"My friend and I saw unusual lights moving North - South just above treeline","Source":"MUFON","Tags":"City","Longitude":"-82.626617","City":"Mansfield","Case Number":"31710","divs":["sighting detailsmy friend and i usually take 2-4 \"trudges\" @ night each week. i always observe the stars and watch for meteors, etc. on august 27th we started out a little later then usual, about 9:45pm we were walking south on state route 42, just outside of the house when we saw what i assume to be the i.s.s. going over head west to east, very bright in the west fading out to the east. i have seen the space station go over before and that is the only object that i know of which behaves in that manner & is that bright. we continued to walk turning on to schmidt rd. then to eckert rd. heading to the pebble creek golf course, where we have permission to walk the cart-path. safer then walking on the roadside @ night. we were walking towards the green, on hole #2 (westward) when we both noticed the lights moving from the brightend sky area towards lexington (appearing from behind the treeline) and moving parallel to the horizon southward (west of our position). the light\\s were pulsing, there was one light high to the right, another light low to the left of the 1st, very close together. i assume they were on the same craft. there was no noise, and the night was quiet. usually we can hear cars on the sr42, or planes when they are in the sky. there was no sound with this craft. it moved quite fast. the lights seemed to be about as bright as would be seen if someone about 200yrds away were flashing halogens in your direction on and off. the upper light would flash on then dim and as it dimmed the lower light would come on, then back to the upper light. if it was an airplane i have never seen that pattern of lighting. i always watch any unsual lights i see in the sky to see if they display normal aircraft flashing lights this did not change light patterns even though its position to us was quite different from when we started to watch it to where it left visual range. on other occasions i have noticed 3 lights in triangle formation moving from either north to south or south to north, about the same brightness as satalites. which i assumed they were, even though normally i have only viewed solitary satalites and normally they are going east - west."],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.683162,+-82.626617(31710)&iwloc=A&hl=en\"> mufon case (31710) map </A>","Region":"Ohio","Date Submitted":"09/10/2011 12:21 UTC","Date of the Event":"08/27/2011 10:00 UTC","Latitude":"40.683162","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31710.html.txt","/var/www/straped/mufon/org/31710.html"],"Log Number":"US-09102011-0021","Country":"United States"}