{"City":"Tehran","Date of the Event":"10/18/1975 06:30 UTC","trends":["There have been 2 other sightings in Tehran","There were no other sightings in Tehran on or around October 18th 1975"],"files":["/var/www/straped/mufon/html2text/31717.html.txt","/var/www/straped/mufon/org/31717.html"],"Object Flight Path":"Straight-line path","Object Features":"Other","divs":["Sighting DetailsI was on my way to work at Mehrabad Airport. I was in the USAF at the time working at the MAC terminal and was an aircraft mechanic with 14 years of experience on many types of aircraft. I had just turned west on the access highway to the airport and was about halfway between the Shahyad monument behind me and the eastern access road to the airport ahead. As I pulled into the left lane to set up my turnoff I saw directly ahead crossing 90 degrees left to right, a cylindrical object right at the top edge of my windshield at an altitude of maybe 150 feet. It was daylight and a clear morning. The location meant to me that this object had just flown across the eastern end of the main runway which runs parallel to the highway. At first I thought someone had accidentally fired a missle again (it happened a year earlier) because the rear of the cylinder looked like a blunt multi-port propulsion system of some sort and had a faint exaust resembling steam comming out. I quickly realized it had no fins, no wings, a blunt front, and was flying much to slow; hardly fast enough even for a small plane. I pulled over to the left shoulder so I could get out and look. My thought now was that a helicopter must be hauling this pipe-like thing somewhere. But, no helicopter and no noise. Two other cars had pulled over in the right lane and watched as I did. The object maintained a northward direction staying just above ground level and away from the residential area of Northwest Tehran. We could actually watch the item for about 5 minutes until it went past a rolling ridge just short of the mountain range which borders north of the city. I waited for another minute expecting to see an explosion or smoke or something, but nothing happened. I continued on to work, told what I had seen and had inquirys made of all agencies both military and civilian. No one had seen anything and no reports were filed. I found this very hard to believe but since I was in my last days there and getting myself ready to be reassigned back to the states I didn't bother to take the time looking for the location that I suspected it might have impacted. I want to make it clear that this was in October of 1975 and not 1976 when they had the larger UFO incident which also included a cylindrical object. The other witnesses were local Iranians and we just looked at each other after the incident and went our separate ways."],"Viewing Distance":"101-500 Feet","Case Number":"31717","Sighting Duration":"Undisclosed","Tags":"City","Summary":"Slow moving, stable, aerodynamically impossible, no flight controls or wings","Source":"MUFON","Date Submitted":"09/10/2011 04:46 UTC","Latitude":"35.705871","Log Number":"IR-09102011-0028","Object Shape":"Cylinder","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.705871,+51.427626(31717)&iwloc=A&hl=en\"> mufon case (31717) map </A>","Disposition":"Unresolved","Country":"Iran","Region":"Tehran","Longitude":"51.427626"}