{"City":"Ventura","divs":["Sighting DetailsA friend and I had decided to have a small fire at a place called Farmers Beach. It is down a gravel road and sits right next to the lake of Clear Lake. I happened to bring some binoculars and my camera because the last time we were there, we saw 4 other UFOs. We arrived at Farmers Beach to find that we had the place to ourselves at around 8:20 (estimated)and started a fire. It was a somewhat clear night but the stars weren't as visible as they usually are. At around 8:45 I looked up towards the south to see a few glowing lights moving, one of them being blue. I quickly grabbed my binoculars to check it out. The objects were miles away and when I looked at the object it appeared to be a moving white light with a blue glowing trail behind it. Immediately excited I grabbed my camera and snapped my first picture at 8:55. In the picture were three white odd shaped objects that were somewhat in a triangle pattern. I was very intrigued by them since I had three on one picture, they have a somewhat cross like shape to them. At 9:01 I snapped another one. This one is eery and sends chills up and down my spine. The details that I am describing are coming from my camera as the naked eye would have just seen lights and shrugged it off possibly. When zoomed in on this picture, it almost appears to be a planed with a ring around it. Within the next minute it just disappeared and I do not know how. After this, I just started snapping pictures in the direction that I saw these objects in the sky in hopes to catch something. At 9:08 I caught what looks to be an object with three lights, one in front and on each side. This object was being followed by a small white orb. These orbs have shown up by these objects in almost all of my pictures. Eight minutes later, I had a picture with 7 similar glowing white, cigar like shapes. One of them almost looks like a space shuttle with an orangish glow emitting from the bottom. The weirdest one in this photo has a vertical glowing white light along with a horizontal one towards the bottom of the object, almost like an upside down lowercase t. When I zoom in, this object also has a blue and sort of orangeish light on it, exactly diagonal from each other. The friend that I was with witnessed it all happening too, although he was more interested in the fire. My pictures speak more than my words as these are hard to describe. The objects were in the sky for maybe thirty minutes, I cannot explain how they appeared and disappeared, they just did. Later that night at 2:45 am, when I was back in town at a friends house I had decided to snap a picture of the stars so I could compare with my zoomed in images. Not one star appeared in the photo but to my surprise there was a straight line that was illuminated. I definitely did not see this before the photo. In my photos, most of them look just like lights until zoomed in once again as they were so far away. Total, I caught maybe twenty on my camera, adding up in the multiple photos."],"Weather Factors":"Unknown","Region":"Iowa","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=43.126667,+-93.473333(31713)&iwloc=A&hl=en\"> mufon case (31713) map </A>","Object Shape":"Bullet, Missile, Circle, Cross, Disc, Oval, Saturn-like, Star-like, Triangle","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Features":"Unknown","Country":"United States","Source":"MUFON","Date Submitted":"09/10/2011 12:44 UTC","Date of the Event":"09/09/2011 08:55 UTC","Summary":"Very odd, different colored objects and shapes, glowing lights in sky. Somewhat hard to see with the naked eye. Multiple white glowing objects, It's hard to describe.","Case Number":"31713","Latitude":"43.126667","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-93.473333","Log Number":"US-09102011-0024","trends":["There have been no other sightings in Ventura","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/31713.html.txt","/var/www/straped/mufon/more/31713_submitter_file1__IMG_0659.JPG","/var/www/straped/mufon/more/31713_submitter_file2__IMG_0662.JPG","/var/www/straped/mufon/more/31713_submitter_file3__IMG_0667.JPG","/var/www/straped/mufon/org/31713.html"]}