{"Object Shape":"Star-like","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-71.887572","files":["/var/www/straped/mufon/html2text/31718.html.txt","/var/www/straped/mufon/org/31718.html"],"Object Features":"None","Case Number":"31718","Date Submitted":"09/10/2011 04:53 UTC","Latitude":"41.846487","Date of the Event":"09/10/2011 02:22 UTC","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path","City":"Killingly","Summary":"appeared like planet but closer and brighter tree linestopped and moved slowlycloser with no sound","trends":["There have been 6 other sightings in Killingly","There were no other sightings in Killingly on or around September 10th 2011"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=41.846487,+-71.887572(31718)&iwloc=A&hl=en\"> mufon case (31718) map </A>","divs":["Sighting Detailsdog woke me up barking.let dog out and looked at stars from porch as I often do. I noticed a very bright star behind a tall pine tree. I often watch visible planet straight off path way wondered if it moved to different location or was another planet because it was so bright, than it moved out from tree and stayed for a short time.Wondered if it was a helicopter.It continued to move closer and I waited to see if I could hear sound of helicopter as it came closer. I was only out for 14 minutes and as it came closer it stayed just about treeline I could not hear any noise.thought to myself fiance watching too many ufo shows.After telling him he suggested I check out mufon website, I was amazed to see there was a case number that explained exactly what I had just explained to fiance. I was never a believer or a non believer. The other stars were not very bright because of the moon phase. My dog also barks every time she is let out. But she made no sound on this night.I watched until it was on other side of residence out of sight."],"Country":"United States","Log Number":"US-09102011-0029","Region":"Connecticut"}