{"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/31728.html.txt","/var/www/straped/mufon/org/31728.html"],"City":"Windsor","Region":"Pennsylvania","Sighting Duration":"01:00:00","Latitude":"39.916211","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Windsor","There were no other sightings in Windsor on or around August 30th 2011"],"Date of the Event":"08/30/2011 04:15 UTC","Object Shape":"Disc","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.916211,+-76.584411(31728)&iwloc=A&hl=en\"> mufon case (31728) map </A>","Case Number":"31728","Source":"MUFON","Object Flight Path":"Path with directional change","Date Submitted":"09/10/2011 11:39 UTC","Summary":"Flat shaped silvery disc bilaterally proportional hovered or direct tword me path then moved laterally then away","Longitude":"-76.584411","Disposition":"Unknown","divs":["Sighting DetailsI was out on the back balcony talking on the cell phone when a large symmetrical disc shaped object on the horizon between two radio towers was pointed out to me by a friend. I am knowledgeable about many types of civilian and military aircraft and at first thought we were seeing a C5 Galaxy heavy USAF transport coming directly toward our location. After another look I realized that the craft lacked definition sufficient to be identified as the craft above, then realized that it lacked most definition. The object on the horizon then began to move laterally to the right of my field of view. I raced to my vehicle after trying to take picture from my balcony did not work well, and began to travel in the direction the object was located in. As I closed in with the object, being able to see only brief glimpses here and there as the area is hilly, I noticed it had begun travelling away from me in the same direction of travel that I was moving. It was lazy and lethargic looking in its movement yet I could not catch up with the object. There were no other aircraft in the area, and the object began to pick up speed as it moved over the Susquehanna River several miles from my home, then pitched up without changing geometry and went into some clouds where I lost site of it. Only one very blurry image of this was captured on my camera unfortunately. On the way home, there was a huge amount of air traffic including several private light craft in the Cessna 150 category, a couple commercial airliners in the 737 range and a pair of YF-22 Interceptors moving at great speed at approximately 1,000 ft. above the ground which flashed by very quickly in the direction the object went in. All the aircraft were heading in that directing as well."],"Object Features":"None","Tags":"City","Log Number":"US-09102011-0036"}