{"Object Features":"Unknown","Source":"MUFON","trends":["There have been 16 other sightings in Olathe","There were no other sightings in Olathe on or around September 10th 2011"],"City":"Olathe","divs":["Sighting Detailsi was sitting on my front porch with my wife and 2 friends when one of our friends interrupted the conversation by saying what the he'll is that. I turned around in my chair and we all viewed a bright amber orange colored light heading in what appeared to be our direction. I watched for maybe 10 seconds and then ran into the house to get my binoculars. I could hear my wife and her friends out front from inside and they were excited. After grabbing the binoculars from inside I made it back out to the front porch and the object had dropped behind some trees but I could still make out the light through the branches. I don't believe the object dropped to tree level but from our vantage point it was behind the trees. My wife and her friend informed me that just the few seconds I was inside the object had descended rapidly behind the tree and began to glow even brighter than before. I witnessed the object ascend back to a higher altitude and moved in several directions. With the binoculars I could see a bright light at what appeared to be the bottom of the object and from the glow of the light it seemed to have a ballon shape or teardrop shape above the light. The object seemed to dim and get bright multiple times and after about 2 minutes it shot away at an incredible speed. I thought the object just dimmed out at first but when I brought the binoculars back up I could still see the object but it was much further away. Shorty after it disappeared. The object made no sound that we could tell and there wasn't a lot of background noise in the area that would make it hard to hear. We see slot of airplanes in our area but this was no airplane."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.879147,+-94.829754(31733)&iwloc=A&hl=en\"> mufon case (31733) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-09112011-0005","Case Number":"31733","Date Submitted":"09/11/2011 04:41 UTC","Latitude":"38.879147","Longitude":"-94.829754","Object Flight Path":"Hovering then path","Disposition":"Unknown","Object Shape":"Teardrop","Country":"United States","Weather Factors":"Unknown","Summary":"Orange color light hovered about 500ft off the ground and moved and hovered multiple times. Object also became real bright at one point and then dimmed down. Object shot away at an incredible speed","Date of the Event":"09/10/2011 11:30 UTC","files":["/var/www/straped/mufon/html2text/31733.html.txt","/var/www/straped/mufon/org/31733.html"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"Kansas"}