{"map":"<A HREF = \"http://maps.google.com/maps?q=42.003482,+-87.78312(31737)&iwloc=A&hl=en\"> mufon case (31737) map </A>","files":["/var/www/straped/mufon/html2text/31737.html.txt","/var/www/straped/mufon/more/31737_submitter_file1__DEMONIC(2).jpg","/var/www/straped/mufon/org/31737.html"],"Longitude":"-87.78312","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around May 15th 2007","This sighting has never been favorited.",""],"Date of the Event":"05/15/2007 04:30 UTC","divs":["Sighting DetailsMorning wakeup. Put on the coffee. Opened the frontroom picture window blinds for daylight and schocked to find mysterious white image on the glass and its size and erie look to it. Overwhelmed my senses how hellish looking it was...that face! Had to document this mystery so grabbed my only camera (digital) and took various angle photos trying to gain a dark background for better imaging to its whiteness. Went outside and checked ground below PW. Found nothing. Not even a crack in the 72\"wide by 60\" high size glass. So over-powering this image was on me I sought out a major TV store with large size LCD screens. Asked technician if he could take my SIM CARD from camera and bring these mystery photos up on the high resolution screen. IT WAS SCHOCKING! So evil looking. More schocking was jawbone \"teeth\". Also estimated wingspan about 6-8 feet. Other veiwers gaspped in horror. I was then schockingly convinced I had a unique close encounter with some type of ufo species. Who do I turn too now? Went home and told story to neighbor. Neighbor then confided in me his wife was schocked by something evil she saw. Both our backyards border a cemetery. About dusk time while in backyard she heard an unusual loud wing flapping noise and looked up and saw \"it\" flying at her as she bolted into her home. They didn't want to tell anyone in fear of \"your crazy\". That truely told me not to drop this story but put it into the hands of special investigators. Footnote: Life's path has taken me into the realm of The Institute of Parapychology of Duke University. Wow,what a rabbit hole,expedition and journey into higher consciousness of the biggest picture. Many fascinating coincidences and synchronisitys but much needs to be focused on this story and photos attached...please."],"Disposition":"Unresolved","Object Flight Path":"Path with directional change,Other,Unknown","Log Number":"US-09112011-0009","Tags":"City","Summary":"Overnite WHITE IMAGE found on living room picture window one morning.","City":"Chicago","Date Submitted":"09/11/2011 09:38 UTC","Viewing Distance":"20 Feet or Less","Country":"United States","Object Shape":"Other, Unknown","Region":"Illinois","Case Number":"31737","Sighting Duration":"00:01:00","Source":"MUFON","Object Features":"Appendage(s), Wings, Other, Unknown","Weather Factors":"Unknown","Latitude":"42.003482"}