{"divs":["Sighting DetailsMy daughter and me were going out to grab some food around mid-night(maybe earlier) and while at a stop light I noticed a star that looked bigger than the rest. I told my daughter that must be a planet(it was hovering)it just appeared to be a star or planet sitting there and then it twinkled like crazy I said with excitement \"wow look at that\" and then it flashed red and back to white (it stayed white and flashing) and then it took off and eventually it moved at a great speed,changed direction with ease,no sound.I did notice it seem to have a luminous radiation around it. In the beginning, as I was driving and watching the object I caught up to it and it slowly went right over my car and then it just took off. We followed as long as we could,but there was no keeping up with this thing at that point. It flew with great speed out of our field of vision near the restaurant we were heading to. This happened in Manchester,TN. I am very curious if anyone else seen this? I have seen life flight (helicopter) many times in this area along with airplanes and it was not the same lights, nor did it move like any regular aircraft. This light was one single flashing white light,nothing else was around it or moving. There was no tail or wings as with aircraft (that I could see),only a luminous radiation ball around it. *My time could be slightly off,we were up gaming,got hungry and went out for a late night snack."],"trends":[],"Object Shape":"Star-like","Object Flight Path":"Hovering then path,Path with directional change,Unknown","Weather Factors":"Unknown","Disposition":"Unknown","Tags":"City","Viewing Distance":"Unknown","Region":"Tennessee","Latitude":"35.523941","map":"<A HREF = \"http://maps.google.com/maps?q=35.523941,+-86.578217(31748)&iwloc=A&hl=en\"> mufon case (31748) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"09/11/2011 05:12 UTC","files":["/var/www/straped/mufon/html2text/31748.html.txt","/var/www/straped/mufon/org/31748.html"],"Source":"MUFON","Date of the Event":"09/10/2011 12:00 UTC","Country":"United States","Case Number":"31748","City":"Undisclosed","Summary":"Manchester,TN Looked like a star","Longitude":"-86.578217","Log Number":"US-09112011-0018","Object Features":"None"}