{"trends":["There have been 3 other sightings in Berea","There were no other sightings in Berea on or around September 9th 2011","This sighting has never been favorited.",""],"Longitude":"-81.856203","Case Number":"31741","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","City":"Berea","Object Flight Path":"Straight-line path","Summary":"Three Ascending lights followed up with disc sighting.","Viewing Distance":"Unknown","Latitude":"41.366678","divs":["Sighting Details1. Giant Eagle parking lot, placing groceries into my car. 2. Noticed a single bright red orange light ascending from behind the horizon (tree line). 3. At First I thought it was an airplane departing Cleveland Hopkins, then the second light appeared, then the third. Then I thought it must be helicopters, but there was no noise and no beacons or navigation lights. 4. The object(s) appeared from behind the treeline and ascended straight up maintaining equal distance from each other. As they reached what I believe to be the cloud base the vanished without any light reflecting from the clouds. The last light turned white and vanished. Within a few seconds a disc shaped object appeared and moved to the east vanishing into the clouds. 5. At first I had no reaction as the third light appeared I called out to other people in the parking lot to look. After eliminating all possible logical explanations, I was...curious. When the disc showed up I was kind of shaken but still amazed. 6. The three lights vanished into the clouds, as did the disc but moving in a different direction."],"Date Submitted":"09/11/2011 02:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.366678,+-81.856203(31741)&iwloc=A&hl=en\"> mufon case (31741) map </A>","Log Number":"US-09112011-0011","Date of the Event":"09/09/2011 09:05 UTC","Disposition":"IFO","Object Features":"None","files":["/var/www/straped/mufon/html2text/31741.html.txt","/var/www/straped/mufon/more/31741_submitter_file1__Giant-Eagle-UFO.jpg","/var/www/straped/mufon/org/31741.html"],"Object Shape":"Disc, Star-like","Region":"Ohio","Sighting Duration":"Undisclosed"}