{"Region":"California","Country":"United States","Log Number":"US-09112011-0022","Object Flight Path":"Hovering then path","Date Submitted":"09/11/2011 08:12 UTC","Source":"MUFON","Object Features":"Dome","Summary":"3 bright Triangular Gold/Copper lights appeared on mountain. 2 bright white/red lights appeared on mountain top.","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Coarsegold","There were no other sightings in Coarsegold on or around September 10th 2011","This sighting has never been favorited.",""],"Weather Factors":"None","Longitude":"-119.731402","divs":["sighting detailson 09\\10\\11 @ 10:02 pm. pacific time, my wife, daughter and i were on our back patio visiting. my daughter asked, what are those lights on the mountain? we looked over to the mountain and saw 3 bright triangular gold\\copper lights. the lights began to pulsate sequentially. within 3 minutes we saw smaller trail lights blinking in a straight line from each point of the triangle. we called out my mother and father from inside the house to witness this phenomenon. the triangular shape moved up and over the mountain, we then lost sight of the object. 1 1\\2 hour later 2 bright white\\red stationary lights appeared on the farthest mountain top. these lights were similar to one another and were distanced from each other. the light on the highest point of the mountain ejected 2 smaller red lights from the east and west side. the ejected red lights slowly moved away from each other and then out of site. all the while the 2 large lights remained. 1 hour later the 2 stationary lights began to blink from white to red, one would blink and the other would blink back, as if they were signaling each other. the signaling went on for 3 minutes and then one light was gone, 10 seconds later the other light vanished."],"files":["/var/www/straped/mufon/html2text/31752.html.txt","/var/www/straped/mufon/more/31752_submitter_file1__get-attachment4.aspx.jpg","/var/www/straped/mufon/more/31752_submitter_file2__get-attachment3.aspx.jpeg","/var/www/straped/mufon/more/31752_submitter_file3__get-attachment2.aspx.jpeg","/var/www/straped/mufon/org/31752.html"],"Latitude":"37.265748","Date of the Event":"09/10/2011 10:02 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.265748,+-119.731402(31752)&iwloc=A&hl=en\"> mufon case (31752) map </A>","City":"Coarsegold","Viewing Distance":"Over One Mile","Object Shape":"Saturn-like, Triangle","Tags":"City","Case Number":"31752"}