{"map":"<A HREF = \"http://maps.google.com/maps?q=45.525612,+-122.668877(3175)&iwloc=A&hl=en\"> mufon case (3175) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/3175.html.txt","/var/www/straped/mufon/org/3175.html"],"Object Flight Path":"Straight-line path","Date Submitted":"08/03/2004 10:20 UTC","Latitude":"45.525612","Viewing Distance":"501 Feet - 1 Mile","Summary":"Group of lights moving west high over Portland Ore.","Sighting Duration":"00:30:00","Disposition":"Unresolved","Tags":"City","Date of the Event":"08/03/2004 10:20 UTC","Weather Factors":"Unknown","Object Shape":"Undisclosed","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around August 3rd 2004"],"Longitude":"-122.668877","Country":"United States","Region":"Oregon","divs":["Sighting DetailsI observed a series of dim lights moving together in a straight line path movingat what appeared to be the same speed as most other commercial aircraft flyingat cruising altitude. The lights moved from East to West over the period ofabout 1-2 minutes. Because they were so dim I lost track of them in the lightpollution over Portland. What intrigued me was that the set of 4-5 lights movedtogether in a straight line and then gradually change into a sort of echelonleft formation as they moved overhead so I knew it could not be one largeaircraft. The lights were dim, but they did not appear to be like otheraircraft lights in that they had a dull glow around them instead of a brightcenter, or pinpoint light like most airdraft lights at high altitude. The otherthing that appeared unusual was the closeness of the lights. Except for thechange in formation and its uniform appearance I could speculate that this mighthave been a meteor skimming the atmosphere or entering the atmosphere. I mightspeculate it was a formation of military aircraft, but it appeared that theaircraft were very close.Well, I appreciate having the chance to report my data and I hope someone got abetter look at them."],"City":"Portland","Source":"MUFON","Case Number":"3175","Log Number":""}