{"trends":["There have been 6 other sightings in Florence","There was one other sighting in Florence on or around September 11th 2011"],"Object Features":"None","Case Number":"31764","Date of the Event":"09/11/2011 10:17 UTC","Region":"Arizona","divs":["Sighting Details This is just what happened a couple hours ago. I took my dog out at 10:17pm, which was the time I seen on the kitchen clock when we went out the back door. Beautiful night, temperature was 88 degrees, no wind, high overcast, but clearing. Visibility was over 10 miles according to the local weather. For some reason, my dog didn't want to come down the steps to where I was standing, and he usually can't wait to. He stood looking toward the west-northwest corner of my property instead. He wouldn't come down even when I called him. He just stood there staring. I looked to see what the heck he was worried about, and saw what I at first thought was a plane approaching to land at Phoenix-Mesa Gateway Airport, which is northwest of me here, about 16 miles away. It was in the same area of the sky as where the regular flight path that planes use is. It looked like a plane coming head-on at me with the white landing lights on. I couldn't see any FAA lights on it, but thought that was maybe because the landing lights were so bright. Then, as I was just about to lose interest and turn away, I could see that the light was becoming more and more orange-colored, and getting brighter. The more orange it got, the more oval-shaped it became, and the larger it seemed to be. After this continued for about 10 seconds or so, it appeared to stop at the same height as, and right next to the top of the big hill in the desert about 4,000 feet west from my back door. It stopped growing larger, or closer, when it was about 75 feet wide, and seemed to hover next to the peak about 200 feet north of the hill. I was confused, and continued to watch it as it sat still in the sky without a sound, for about 15 or 20 seconds. If it were a plane at that distance (4,000 feet), and at an altitude of roughly 350 feet, I should have for sure heard the sound of the engines. There was no noise whatsoever. No traffic way out here, all is pretty quiet. Suddenly, the oval shot sideways about 150 feet, flashed twice as it moved, and completely disappeared! It didn't accelerate away, it was just all of a sudden moving at a rapid speed to my right instantly. As I stood there with my mouth hanging open, looking real hard to find any trace of it I could see, a very, very bright red light lit up at the peak of the hill that the oval was just next to. I focused my eyes on it, but couldn't tell if it was around the other side of the hill, or sitting there on the ground at the right side of a spot just below the rocky peak. I could see it was a perfectly shaped ball of red light, and the lower left edge of it was hidden by part of the hill. The red light didn't reflect on the hillside, it seemed to be contained inside the ball somehow, but was still extremely bright anyway. It made me squint. The red ball light didn't come on gradually, it just snapped on, stayed lit about 1 second, maybe a little bit longer, then snapped off. If it was on the side of the hill as it looked like it was, it had to have been about 30 feet in diameter. When the light went out, I couldn't see it against the dark hill, or the night sky. I was trying to figure out what it was that I just saw when my dog came part way down the steps, looked in the direction of where the lights used to be a couple of times, then meandered off to do his job just like nothing happened. That's what I saw, and I don't care who believes me and who doesn't because that don't change nothing about what happened. I been living here almost 10 years now, and seen probaly hundreds of planes coming in for a landing, and also some other strange lights in the desert, but this wasn't no plane or other lights like I've ever seen before. No way. What they were or where they went, I just don't have a clue."],"Weather Factors":"Unknown","City":"Florence","Latitude":"33.074026","Longitude":"-111.4385","map":"<A HREF = \"http://maps.google.com/maps?q=33.074026,+-111.4385(31764)&iwloc=A&hl=en\"> mufon case (31764) map </A>","Date Submitted":"09/12/2011 06:01 UTC","Object Shape":"Oval, Sphere","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09122011-0005","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/31764.html.txt","/var/www/straped/mufon/org/31764.html"],"Tags":"City","Summary":"White light turned orange while approaching, hovered, then shot away. When gone, red sphere on or beyond hill lit up brightly, then went out.","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering"}