{"Country":"United States","Log Number":"US-09122011-0006","Object Shape":"Sphere","Source":"MUFON","Latitude":"43.568333","Sighting Duration":"00:02:00","divs":["Sighting DetailsI was driving home from work and the orange ball of light was hovering very low on the horizon over the tree line. it did not move or blink or make any noise. I am reporting this sighting not because it's the most spectacular but because it's the most recent. I took notice of it because I've seen these before. The first time I saw the orange ball was while i was in high school and living in peru maine( best guess fall of 98). I was sitting on the couch looking south at an orange ball that looked like it was hovering over the ridge line but at that distance I couldn't be sure what I was looking at so i was trying to figure out if I was looking at a star and I noticed a second one a ways down the ridge so I kept looking for about 15 minutes. then the ball started to move in a straight line along the ridge. of in the distance a jet came into view. and started chasing the orange ball. so i ran out the back door so I could continue watching. the orange ball made a right angle turn across the back yard and the jet persued it until they were out of sight. the jet was low enough so even though it was dark out you could very clearly see it was a jet about the length of 2 quarters and yet the only feature I could see of the other object was that it was a glowing orange ball. I looked back to where the other ball of light was and it took off straight up and disappeared into the atmosphere. I have seen this orange ball off and on for years. on my way to work about 7 years later driving to work in the late fall at about 3 in the morning. an orange ball of light about the size of a moving truck was shadowing my movments downs the river of route 2. i turned and looked away and it had disappeared. I descided to report this becuase I have just watched the fayetteville case on ufo's over earth and was freaked to see the reanactment clip had orange balls just like what I have seen. So even though this is a witness case I have no proof, no pictures and such that It could still be helpful in mapping where these different kind of sightings are happening."],"Longitude":"-71.029722","trends":["There have been no other sightings in Wakefield","This sighting has never been favorited."],"Region":"New Hampshire","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/31765.html.txt","/var/www/straped/mufon/org/31765.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.568333,+-71.029722(31765)&iwloc=A&hl=en\"> mufon case (31765) map </A>","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Date of the Event":"09/02/2011 08:44 UTC","Case Number":"31765","Summary":"orange ball of light","Date Submitted":"09/12/2011 07:19 UTC","City":"Wakefield"}