{"Weather Factors":"Unknown","trends":["There have been 3 other sightings in Lisbon","There were no other sightings in Lisbon on or around August 25th 2011"],"Region":"Ohio","Tags":"City","Latitude":"40.781924","Source":"MUFON","Viewing Distance":"Unknown","City":"Lisbon","files":["/var/www/straped/mufon/html2text/31760.html.txt","/var/www/straped/mufon/org/31760.html"],"Longitude":"-80.766064","Object Features":"Patterned Surface, Appendage(s)","Date Submitted":"09/12/2011 12:05 UTC","Object Shape":"Disc, Oval","Date of the Event":"08/25/2011 05:30 UTC","Disposition":"IFO","Log Number":"US-09122011-0001","Object Flight Path":"Straight-line path","Country":"United States","divs":["Sighting DetailsI am making this report for my brother-in law who has no computer. On August 25th and 26th at approximately 5:30 am, my brother-in law, who was staying at a remote cabin just south of Lisbon, Ohio, was looking out of his bedroom window when he spotted a disk or oval shaped object moving slowly above the tree tops of the surrounding woods. The weather at the time was stormy, with thunder and lightning. The object had a ring of bright, rapidly flashing, multi-colored lights(red, green, orange, yellow) as viewed from approximately a 45 degree angle. There was a round spot which protruded from the bottom center which emitted an extremely bright white light. It was more of a flood light than a spot light. The object moved slowly and did not hover or stop. The sighting lasted approximately 1 minute and 45 seconds. It made no sound, but there was thunder, so any sound might have been covered up. The next morning at about 5:36, he saw the same object, but it was higher up and was flying a slightly different path than the morning before. It was extremely foggy but he could very easily see the bright white light at the bottom of the craft. This sighting lasted about 45 seconds. He did not make a size estimate because he could not tell how far away the object was in either case. He was very excited and did not want to take his eyes off the object. The object disappeared behind trees on both mornings. Sorry for any lack of detail. I am recounting details as told to me by my brother-in law."],"Sighting Duration":"Undisclosed","Case Number":"31760","map":"<A HREF = \"http://maps.google.com/maps?q=40.781924,+-80.766064(31760)&iwloc=A&hl=en\"> mufon case (31760) map </A>","Summary":"Disk or oval object with multi-colored flashing lights and bright white light on bottom"}