{"trends":["There has been one other sighting in Wolverine Lake","There were no other sightings in Wolverine Lake on or around September 11th 2011","This sighting has never been favorited.",""],"Disposition":"IFO","Region":"Michigan","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Latitude":"42.550368","map":"<A HREF = \"http://maps.google.com/maps?q=42.550368,+-83.482167(31768)&iwloc=A&hl=en\"> mufon case (31768) map </A>","Object Shape":"Cylinder, Fireball","Longitude":"-83.482167","Object Features":"None","Log Number":"US-09122011-0009","Date Submitted":"09/12/2011 10:31 UTC","Tags":"City","Summary":"Multiple straight-line cylindrical-shaped, vertical flames traveling either in formation or individually","Weather Factors":"Unknown","Date of the Event":"09/11/2011 10:15 UTC","Case Number":"31768","Country":"United States","files":["/var/www/straped/mufon/html2text/31768.html.txt","/var/www/straped/mufon/org/31768.html"],"divs":["sighting detailswe were getting ready to close up the house for the evening and looked out our front picture window to witness these cylindrically-shaped, vertical self-contained flame\\fireball objects slowly traveling from a south-west to a north-east direction in a straight line just above the treetops. they appeared to look like big vertical hot air balloon flames only without the balloon, basket or accompanying noise. they were travelling in groups and\\or triangular formations as well as singularly...all in the same path together, one right after the other. we were shocked and confused because we couldn't figure out what they could be...there is no physical, logical, atmospherical, meteorological or military explanation that we're able to conjer up. we ran in and grabbed our brand-new camcorder to try to capture as much as we could on video. the best perspective we were able to capture was the one we got showing the three of these independent, non-connected cylindrically-shaped balls of flames travelling together in a triangular-shaped formation. we watched them slowly travel away from us and then gradually just fade away into the clear night sky. unfortunately, we haven't owned our camcorder long enough to get a really great shot for posterity as you can tell from our photo date saying \"sept. 12, 2011\" when it actually was the evening of september 11th. we are in complete and total awe!"],"City":"Wolverine Lake","Sighting Duration":"Undisclosed"}