{"Date Submitted":"11/30/1983 12:00 UTC","Object Flight Path":"Unknown","Summary":"brilliant blue ball of light low over Ashland, OR","files":["/var/www/straped/mufon/html2text/3176.html.txt","/var/www/straped/mufon/org/3176.html"],"Object Shape":"Sphere","trends":["There have been 10 other sightings in Ashland","There were no other sightings in Ashland on or around November 30th 1983"],"Log Number":"","Viewing Distance":"Over One Mile","Tags":"City","Date of the Event":"11/30/1983 12:00 UTC","Sighting Duration":"00:00:59","Object Features":"Undisclosed","City":"Ashland","Source":"MUFON","Region":"Oregon","divs":["Sighting DetailsMy sighting occurred sometime in the mid-8092s 1984 or 1985 when I was with two friends leaving a house in the QuietVillage Subdivision on the eastern end of Nevada Street just below HelmanElementary School in Ashland, Oregon. Since this event occurred in the daysbefore the internet, I did not know how to report it, though I tried, and hadvery little information available to me about UFO sightings and reports. Mymemory of the event is somewhat sketchy now, with regard to date and time. I amnot sketchy about what I saw.Ashland is a small town, with a population around 15,000 back then. We were inthe NE area of town. The two friends and I were teenagers at the time 17-19years old. As we left the house heading to our car, one of the two friends andI glimpsed a brilliant blue ball of light traveling across the sky above us inthe distance to the east, low enough that it was below the horizon line of themountains. We both saw it because I wasnt looking down at that moment andcalled out when I glimpsed it, and one friend looked in the correct directionwhile the other did not. The ball itself was brilliant, even at that time ofday during the clear daylight. At arms length, its size was about that of apenny, and it was between us and the mountain range, perhaps a mile away orless, but maybe a little more. Even at that time, I wasnt really sure exactlywhere it was in the sky with reference to us, because of the nature of its form,I guess. It seemed close and low. Not far away like a plane in the sky - evena small one flying low - but also not so near as to worry us. It was travelingSW at a downward and slightly-arced angle, and at a moderate speed not ashooting star speed, not that of an airplane, either - slower, but not such thatI perceived its movement as slow, either. It was a moderate speed at first, andabout the time that it registered to me what I was seeing something not likeanything Id seen or heard about as fact ever before, it immediately shot up atabout a 65-degree angle still SW very quickly - at a very high rate of speed -and disappeared from my view. I remember being confused as to whether my viewof it was obscured behind a very large tree in the yard, or whether the object93blinked out94 just before it passed behind the tree. It didn92t reemerge in my view on the other side of the tree.The friend who saw stopped in amazement with me. We both were incredulous andtrying to understand with each other what we92d seen, and the third friend who92d missed it all was wondering how he92d missed it. I don92"],"Country":"United States","Disposition":"Unknown","Latitude":"42.198496","Case Number":"3176","Longitude":"-122.706177","map":"<A HREF = \"http://maps.google.com/maps?q=42.198496,+-122.706177(3176)&iwloc=A&hl=en\"> mufon case (3176) map </A>","Weather Factors":"Unknown"}