{"Object Shape":"Sphere","Object Features":"Other","Object Flight Path":"Other","Date of the Event":"09/10/2011 09:15 UTC","Source":"MUFON","divs":["Sighting DetailsWe were driving on Filmore street when I saw lights in the sky out of my passenger window. I asked my husband what the lights were and he at first thought they was a tower. I said no, they are moving and the ones in front are crossing over each other. We then turned into a school parking lot to observe them stopped in our car. We watched them for about 20 minutes. There were about 100 of them at first and as they ascended into the sky they just disappeared out of view. Then more would appear from what looked like a field area about a mile away. At one time 3 of them formed a straight line and then moved on. Then several of them formed a right angle arrow type formation and then moved on. We left the school parking lot and drove to Lake Michigan Dr. and turned east and drove approximately a mile and then turned south on a dirt road to see if we could see where they were coming from but by that time all of them had disappeared into the heaven and no more were ascending. We have never experienced anything like this in our life. I am 62 years old and my husband is 63 years old. We drove home thinking maybe there would be something about this on the 11:00 news but there was not. So far we haven't talked with anyone who saw these but us. I am curious to find out if anyone else saw what we saw."],"Longitude":"-85.944884","Log Number":"US-09122011-0015","Summary":"Yellow/red orbs, hundreds of them hovering up and then disappearing into the heavens","Weather Factors":"Unknown","City":"Allendale Charter Township","Case Number":"31774","Date Submitted":"09/12/2011 07:57 UTC","files":["/var/www/straped/mufon/html2text/31774.html.txt","/var/www/straped/mufon/org/31774.html"],"Latitude":"42.975696","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.975696,+-85.944884(31774)&iwloc=A&hl=en\"> mufon case (31774) map </A>","Region":"Michigan","Sighting Duration":"Undisclosed","Tags":"City","trends":["There has been one other sighting in Allendale Charter Township","There were no other sightings in Allendale Charter Township on or around September 10th 2011"],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO"}