{"Date Submitted":"09/12/2011 09:40 UTC","Object Shape":"Oval, Sphere","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.438033,+-90.727793(31777)&iwloc=A&hl=en\"> mufon case (31777) map </A>","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Date of the Event":"09/09/2011 02:15 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31777.html.txt","/var/www/straped/mufon/more/31777_submitter_file1__2011-09-0912.58.02.jpg","/var/www/straped/mufon/more/31777_submitter_file2__2011-09-0912.58.05.jpg","/var/www/straped/mufon/org/31777.html"],"divs":["Sighting DetailsOn the 9th I was working in downtown Rock Island doing a disconnect for a local cable company. My partner and I were in the alley of 7th st just off 5th Ave. While my partner was on the ladder working on the line I was on the street. This incident took place around 2pm in the afternoon. The sky was clear with few high clouds. As I looked down the alley to the north about 500ft to 1500ft up I saw 20 to 25 objects moving left to right and in a swirl motion. At first I thought they were balloons, but they did not look right, then I thought they may bee birds but I could not see wings flapping as you would with a flock of birds. I said to my coworker \"What the hell is that?\" He looked and didn't see them at first. I said there! Then he noticed them as they were moving closer in a southwest direction still with the swirling around each other motion. He said he couldn't figure out what they were either. He also asked a lady in the alley if she could see them and she said yes but did not know what they were. They were about 30ft across and the sun glinted off of them. They left like a haze or almost like they were moving through water and leaving a slight wake. We watched them for about 5mins until we had to leave to go to another job. I know this sounds odd as it was at the time of the sighting since it was in broad day-light. I also know what we saw moved with purpose. I am also a member of MUFON. So I don't just freak out at everything I see in the sky. The strangest part of all of all this is that I took out my phone which is a Android that shoots pictures in HD. I snapped 2 photos of the objects which I know for a fact were visible on the screen before I took the pictures after examining the photos none of the objects appear in either frame. This is very strange to me. I would like to know if anyone in this area also sighted these objects and I have uploaded the photos. Thank you for your time."],"trends":["There have been no other sightings in Andalusia","This sighting has never been favorited."],"Summary":"Objects in sky during daylight","Object Features":"None","Sighting Duration":"00:05:30","Log Number":"US-09122011-0018","Latitude":"41.438033","Source":"MUFON","City":"Andalusia","Longitude":"-90.727793","Disposition":"Unresolved","Region":"Illinois","Case Number":"31777"}