{"Date of the Event":"09/11/2011 09:10 UTC","City":"Howell","map":"<A HREF = \"http://maps.google.com/maps?q=42.608485,+-83.923735(31776)&iwloc=A&hl=en\"> mufon case (31776) map </A>","Latitude":"42.608485","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 20 other sightings in Howell","There were no other sightings in Howell on or around September 11th 2011"],"Date Submitted":"09/12/2011 09:28 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31776.html.txt","/var/www/straped/mufon/org/31776.html"],"Country":"United States","divs":["sighting detailsmy son noticed the three red cylindrically-shaped balls\\orbs at 9:10 pm across the road hovering in a triangle formation above the neighbors barn they were so low the barn was glowing and a fourth ball\\orb appeared. he ran in the house to have my husband and myself see them. i watched them go into a singularly path that angled, they made no sound or noise. all were independent of each other i went to get the camera, my camera would not work, every time i tried it would not work. the stayed in a line and started to change from red to orange and finally to a pale yellow and disappeared. they did not take off or shoot away the vanished. about 5 mintues later as we were still looking a fifth red ball\\orb appeared alone just hovering again very low just above the trees, this one you could see a ring of lights which we assume was the underside, it also turned to an orange to pale yellow and was gone. all three of us were stunned and could not believe what we had just watched, the camera wold not work during the time they were there and the camera worked fine after."],"Object Features":"Unknown","Longitude":"-83.923735","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Log Number":"US-09122011-0017","Summary":"5 red orbs form triangle shape above barn then change formation into a line.","Source":"MUFON","Object Shape":"Sphere","Disposition":"IFO","Case Number":"31776","Region":"Michigan","Weather Factors":"Unknown"}