{"Date Submitted":"09/12/2011 04:09 UTC","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-09122011-0014","map":"<A HREF = \"http://maps.google.com/maps?q=37.734312,+-97.002757(31773)&iwloc=A&hl=en\"> mufon case (31773) map </A>","Viewing Distance":"Unknown","Region":"Kansas","Object Shape":"Oval","Source":"MUFON","Longitude":"-97.002757","Case Number":"31773","City":"Towanda","Disposition":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Country":"United States","files":["/var/www/straped/mufon/html2text/31773.html.txt","/var/www/straped/mufon/more/31773_submitter_file1__100_0068.JPG","/var/www/straped/mufon/more/31773_submitter_file2__100_0069.JPG","/var/www/straped/mufon/org/31773.html"],"Latitude":"37.734312","Date of the Event":"09/07/2011 12:00 UTC","trends":["There have been no other sightings in Towanda","This sighting has never been favorited."],"Summary":"oval, very large, bright white with no other markings, trail following from clouds, visible on digital camera only","divs":["Sighting DetailsI was taking pictures of the sunrise on Sept. 7, at about 7 am, taking several shots due to the changing colors of the clouds. The fourth picture had what appeared at first glance to be a smear or something. I took another shot of the sunrise then went into the house. Later I looked at the pictures and discovered the \"smear\" was actually a white object, quite bright, with a tail that came down out of the clouds, showing that the object swooped to the south. I did not see this when taking the picture, or before or after taking the picture. It appeared on the digital screen only. When I enlarged the photo to show more detail, the object seems to have gone through the clouds when it turned to the south. The trail has lines in it that look like it is some kind of exhaust, coming out of the back of the object. I did not see or hear anything. My husband and I have seen some odd things in the sky before, but we have no idea how this picture came to be. I am not very computer savvy, so I hope you get the picture attached. I also attached a picture that I took a minute or so after."],"Object Features":"Other"}