{"trends":["There have been no other sightings in Badajoz Extremadura","This sighting has never been favorited."],"Viewing Distance":"Unknown","Log Number":"ES-09132011-0004","Disposition":"Unresolved","Tags":"City","Object Shape":"Disc","Date Submitted":"09/13/2011 08:37 UTC","Source":"MUFON","Summary":"Clear disc shape moving across clear blue sky Badajoz Spain","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was fishing with my brother on the great river Guadiana in Badajoz Spain on thursday 9th June 2011. It was a wonderful sunny day only a couple of whispy clouds in sky. It was around 4pm and I was becoming a bit tired and thinking of packing up when I lazily lay back and rested enjoying the sunshine. I was staring straight up, I suppose 90 degrees to horizon. I must have lay like that for five minuets or so when from behind me and directly into my field of vision A clear Black Disc shape moved quite rapidly across the sky along the line of the river. My imidiate thought was WTF is that!!?? As noted above it was roughly asprin sized. I called to my brother who was engrossed in his fishing to look pointing at it. It took me quite by surprise, I sat up as it moved down the river and towards the horizon. As it was sunny there was some glare off the water and my eyes took a moment to readjust I picked it up again and pointed to it but my brother only saw some birds down river and suggested that was what it was. I just put it to the back of my mind for a while but I keep thinking about it and what it could have been. I dont remember seeing aircraft in the area at all that day. Although there were lots of birds on the river. If it was a bird that is the first and fastest Disc shaped bird I have ever seen!"],"Longitude":"-5.992598","Country":"Spain","Latitude":"38.907486","Case Number":"31783","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31783.html.txt","/var/www/straped/mufon/org/31783.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.907486,+-5.992598(31783)&iwloc=A&hl=en\"> mufon case (31783) map </A>","Date of the Event":"06/09/2011 12:00 UTC","Region":"Extremadura","Object Flight Path":"Straight-line path","City":"Badajoz Extremadura"}