{"Longitude":"-79.881072","Disposition":"Unknown","Log Number":"US-09132011-0005","Source":"MUFON","Case Number":"31784","Date Submitted":"09/13/2011 10:21 UTC","Tags":"City","Object Shape":"Sphere","Viewing Distance":"Unknown","Summary":"Two seperate lights, on two seperate occasions in seperate locations that I was unable to identify.","Object Flight Path":"Straight-line path","divs":["Sighting DetailsOn July 17, 2011: I was setting up my telescope to try some digital astrophotography. This fact really has nothing to do with what I saw other than it is why I was outside at the time. I was with my daughter, who is 4 in my front yard. It is the best place to use my telescope when I use it at home because I am somewhat shielded from street lights. I am not an expert in aircraft, or satellites, or meteors and meteorites, but I am very confident in my ability to identify objects I see in the sky by those categories. I have even managed to see a weather balloon on the horizon. It is not abnormal for me to be outside looking at the sky. Literally every time the sky is clear at night, I am looking up. At about 9:45 pm, I had just managed to connect my digital camera to my telescope. I was getting ready to practice tacking photos of stars, and later on that night if I could stay up late enough I planned to try and photograph M31. I noticed out of the corner of my eye a light. It was in between the roof of my house and my neighbors roof in the distance. Where I noticed it first was in the vicinity of polaris moving from West to East pretty slowly. It was bright red, maybe with a little orange. I am not sure how to describe what I saw perfectly, but this should help you understand. My first thought was that it must be the ISS. It seemed bigger and the color was and brightness were way off, but the way it consistently moved across the sky was similar to a satellite or the ISS. I watched it for probably 45 seconds until I decided it was odd enough to go inside and get my wife. So my daughter and I went in to get her, and when we came back outside, I was unable to locate it again. After a minute or two of discussion, she went back inside and my daughter and I went back to the telescope. I thought that it could possibly have been the space station or a satellite that just happened to catch sunlight in a way that would cause what I saw, and didn't think much more of it. Approximately 10 mintutes after the first sighting, my daughter, who had apparently been staring where we had seen it the first time, called out to me that she saw it again. I looked, and sure enough at pretty much the same starting point as before, the exact same thing was there, moving in the same direction, West to East at the same speed. This time I really tried to get a feel for what it was, and again I really couldn't come up with a good answer. So again, I went to get my wife, and when we returned, it was gone. After thinking about it for a while, I checked online to see sighting times and locations of the ISS, and some satellites. Nothing I found matched the time and location. Running over scenerios of things that may be able to create what I saw, I thought it was possible that they may be some sort of chinese lantern. When I say this, I don't want it to sound convincing though. Because I am not convinced that is what I saw. So the next day I reached out to some people in the astronomy community, and we came to the same conclusion together. It must have been some sort of chinese lantern. On a side note, I live close to a major airport, and the 171rst air refueling wing of the airforce, and the 911th airwing as well. So between all of this, I just put it aside in my head as something explainable by something along the lines of airports being close by or chinese lanterns. August 12, 2011 About 4 weeks later, on August 12th, at about 9:00PM I was in Geneva, Ohio. My wife, and daughters were eating at an outdoor restaurant (Old Firehouse Winery) when again I noticed the same light moving through the sky. This time I was able to show my wife. The light was moving almost directly overhead, this time East to West. I watched it until it dissapeared behind some trees about 30 seconds later. I started explaining that I had seen it before, and that it was strange to see it again. About 5 or so minutes had gone by, and it again drifted out of the conversation when I looked up, and saw it again. In the same path and trajectory, with the same color and speed. I personally ruled out the space station or shuttles. I am completely convinced it was not a satellite. It was definitely not a meteor or meteorite. I am not sure what it was to be honest. It has been weighing on my mind for a month now. I usually have no trouble identifying what I see in the sky. I doubt that this story in itself is spectacular enough to really warrant your attention. However, maybe others have seen the same thing, and this could help determine what was seen."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.435083,+-79.881072(31784)&iwloc=A&hl=en\"> mufon case (31784) map </A>","Latitude":"40.435083","Object Features":"Unknown","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around July 17th 2011"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Region":"Pennsylvania","City":"Pittsburgh","files":["/var/www/straped/mufon/html2text/31784.html.txt","/var/www/straped/mufon/org/31784.html"],"Date of the Event":"07/17/2011 09:45 UTC"}