{"Log Number":"","files":["/var/www/straped/mufon/html2text/3178.html.txt","/var/www/straped/mufon/org/3178.html"],"Object Flight Path":"Straight-line path","Summary":"Hot Pink UFO in Sarnia, On.","City":"Sarnia","Viewing Distance":"Unknown","Source":"MUFON","Case Number":"3178","Date Submitted":"07/18/1995 12:00 UTC","Country":"Canada","divs":["Sighting DetailsIt was a very hot,humid,muggy night and I was lying on the livingroom couch withthe lights off and the central airconditioner running. I was facing the front,north-facing window and suddenly saw a bright, hot pink object descending slowlyat a steady pace. My first, gut reaction was, oh, theyre landing, immediatelyaccepting that it was a ufo. I was afraid to move off the couch in case itdisappeared while I was getting up, so I didnt go out to the front porch untilit was almost out of view. When I went out, the humidity struck me and I noticedthat there were haloes around the street lights, from the heat. The object wasclear and did not have a halo around it. While I was still inside, I had thestrong feeling that it wasnt making any sound and I didnt hear anything when Iwent out. It was about the size of a car headlight, but I couldnt judge how faraway it was. I watched until it disappeared behind some trees. Since Lake Huronwas directly north, about 1 mile from our house, I dont know if it disappearedover land or water. I was convinced at the time that it was an extraterrestrialcraft, but since then have been telling myself it couldnt have been, because Idnever heard of one that was hot pink in colour. My main reason for contactingyou so many years later is to find out if anyone else saw it and if ufos doindeed come in that colour. Unfortunately I didnt write it down, so no longer amsure if it was just after 1 am or 2am, but the date is definite."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.98939,+-82.35699(3178)&iwloc=A&hl=en\"> mufon case (3178) map </A>","Sighting Duration":"00:05:00","trends":["There have been 16 other sightings in Sarnia","There were no other sightings in Sarnia on or around July 18th 1995"],"Latitude":"42.98939","Disposition":"IFO","Longitude":"-82.35699","Object Shape":"Sphere","Date of the Event":"07/18/1995 12:00 UTC","Tags":"City","Region":"Ontario","Object Features":"Undisclosed"}