{"Country":"United States","Sighting Duration":"12:00:00","divs":["Sighting DetailsHello Guys, This is kind of a long story, spanning the last 4 years, but I'll do my best to explain. My grandparents own a farm in Drakes Branch, Virginia. My father, my uncles and I all hunt on this land every year. Mainly for Turkey and Dear, but we do shoot the occasional Bear too. About 3 and a half to 4 years ago, we started to sew crops and put up digital game cameras throughout the property. For the first 3 years we had the cameras activated, all we ever recorded were some nice bucks, more than a few doe, and a couple Black Bears from time to time. About a year ago, that all changed. We started getting some really weird photos last year with those game cameras (some of which I have attached) and my purpose of writing to you now is to see if someone can offer a reasonable explanation as to what is happening. I must say that we've never shook hands with aliens, our houses aren't haunted and we've never eaten lunch with Bigfoot. So we are all skeptical about these photos. However, there is enough documentation on our end to say that \"something\" is definitely happening and we're so curious as to what it is, that we have decided to explore all possibilities, even the more exotic ones. With that said, let me explain some of the weirdness and allow you to form an opinion of your own. The cameras we use are MOULTRIE 4mpx Digital Game Cameras. We have 3 of them in total. They were placed in 3 separate corners of the farm. The cameras have only 2 ways they can be triggered. The first way is with movement. The second way is with a heat signature. The cameras have an infrared sensor on them that detects variations in temperature. But the manual to the cameras says that both sensors (movement and infrared) are only good for about 45 feet away. Anything further out than 45 feet should \"technically\" not trigger the camera to take a photo. However, we started getting photos of some really crazy looking \"orbs\" (for lack of a better word) on only 1 of the cameras we had setup. The photos were very strange considering the fact that whatever had triggered the camera appeared to be at least 250+ feet away. We erased the images and changed the cameras around so that an identical type, but totally different camera, was placed in the spot that we had taken the strange photos. Then the \"broken\" camera (we thought it must have had a defect) was switched to the spot we had taken the \"different\" camera from. Of course the broken camera was not broken at all, and ceased to take pictures of anything out of the ordinary once it was switched. It did capture many pictures, but only of the passing Dear or Bear. The pics were perfectly clear and had nothing in them that looked like what we had seen the same camera take photos of when it was in the other spot. Well, the photos of the strange lights didn't stop with the different camera. Actually, they became more frequent once the newer camera was placed in the sweet-spot. We began to accumulate even more strange photos of these orbs, as well as some light phenomenon that isn't spherical, so I can't call it an orb. These photos we did not erase. We kept them because of the same reason the cat got killed, curiosity. Playing the detectives, we immediately switched the 3rd and final camera we had to the spot the photos were being taken, and in turn, we moved the 2nd camera which had captured these images to another spot. This, of course, resulted the same way as when we switched the cameras the first time. We caught a few more images but then the images abruptly stopped. Well, we did capture \"normal\" photos, but nothing out of the ordinary. The abnormal images did start up again, but only after about a month or so. During that month of downtime, we started examining the photos more closely and realized that there seemed to be a cycle. The one thing the photos all had in common was that they only occurred in low light. You can see a country-mile in the full moonlight. But the lights never came on nights where there was a full moon. Nor a half moon! The only time it happened was when there was little to no light in the fields. However, some nights we had a bigger moon and the lights did come, but it was extremely overcast and no moonlight could be seen. Other than that, there appears to be no rhyme nor reason as to when the lights will occur. But we do know where. They always occur in the same field between sun down and sun up. Before the lights kicked-up again. We invested in some better cameras. The newer cameras had the same sensor detection, but these new cameras were 8mpx and had the ability to take video. The new cameras also had a feature that helped our cause greatly. They had a battery that held for (up to) 1 year. However, when we set the video cameras, the batteries began to deplete almost instantly. Sometimes we would have dead batteries within a few days. Other times it would take a few weeks. But regardless, the batteries would be dead in no more than a month. We had bought 3 of these video cameras in total. So we decided to start putting more than one in the area of the phenomenon. What resulted was the batteries in all cameras dieing within days. Also we had a few cameras cease to operate at all, totally fried! This did not stop the fact that the phenomenon was still being captured with the still cameras. No battery problems or malfunctions with them. We then saw some pics that really were cool. The still camera had captured a black bear that was no more than 5 feet away from the camera, but there was an orb behind the bear. We also have a pic that looks as if there is \"something\" (not going to speculate here) in the lower half of the light-beam. Very strange, in deed, but not even close to evidence of the paranormal. After all, it could be some weird weather condition or something of the sort causing these strange lights. Then one day, we were talking to my grandmother, who is very old but well within the sane-range. She told a very odd story that captivated our imaginations in such a way that we started actually considering something other than a natural reason for the lights. She told us a story about when she was only a little girl and had lived only 200 yards from the spot where the photos were being captured. She explained that her and her sister had seen the same strange lights in that field and had always been frightened of them. Her recollection of the lights was vague, but she did remember one event that she said she'd never forget. One night the lights had been particularly bright. Her and her sister were so scared that they had huddled together under the covers of their bed. In the morning, they had ventured in to the field and discovered their uncle had died in the barn of a heart attack. They immediately told their mother who, in turn, called their father to investigate the situation. Their father found the body of his brother and uttered only a small sentence, that my grandmother said she'd never forgotten. He said \"Must have seen what was makin' those lights out here!\". That story was so amazing to us that we decided that if \"we\" couldn't get better evidence and solve the mystery, maybe it'd be better to ask the professionals. So that is why I am contacting you now. Some of our better photos are still on the SD card from the cameras. So I couldn't show you one photo in particular that is pretty awesome. It shows extremely bright lights in the field. But they must be 200 yards in the distance, which is impressive, considering we know these cameras like the backs of our hands, and it seems impossible to us that photos would be taken of something so far in the distance. I'm sure we have new photos as well, but we have to wait until the data is retrieved from the cameras, which are active at this time. My father also noticed a few places in the field where there are cylindrical depressions in the ground accompanied by dead vegetation. We don't want to jump to conclusions, but it is what it is. The phenomenon only seemed to occur during the Autumn and Winter months. But that's probably because we only use the game cameras at that time. It is almost that time again and we'd really like a better explanation as to what is happening. If someone out there has any idea, please let us know. I'm currently in Germany preparing for a European tour with my band. My father asked me to contact you because he has no idea how to use a computer. I have included the appropriate contact information in the above fields."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31788.html.txt","/var/www/straped/mufon/more/31788_submitter_file1__Mufon1.jpg","/var/www/straped/mufon/more/31788_submitter_file2__Mufon2.jpg","/var/www/straped/mufon/more/31788_submitter_file3__Mufon3.jpg","/var/www/straped/mufon/org/31788.html"],"Date of the Event":"10/01/2010 12:00 UTC","Latitude":"36.909645","Disposition":"IFO","Object Features":"Unknown","trends":["There have been no other sightings in Drakes Branch","This sighting has never been favorited."],"Viewing Distance":"Unknown","Date Submitted":"09/13/2011 11:58 UTC","Longitude":"-78.528518","Case Number":"31788","Log Number":"US-09132011-0009","Object Shape":"Cigar, Cylinder, Fireball, Flash, Oval, Sphere, Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.909645,+-78.528518(31788)&iwloc=A&hl=en\"> mufon case (31788) map </A>","Tags":"City","City":"Drakes Branch","Summary":"Many Strange Lights Caught By Game Camera In Virginia","Region":"Virginia","Object Flight Path":"Unknown"}