{"Object Features":"None","Longitude":"-104.998757","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"39.780137","Tags":"City","Object Flight Path":"Path with directional change","Log Number":"US-09132011-0002","Source":"MUFON","Date of the Event":"09/12/2011 08:05 UTC","Region":"Colorado","divs":["Sighting DetailsMy room mate and I were going out for dinner about 8PM 9-12-11. His house is in a tree strewn neighborhood just off 44th and Pecos. When we rounded the corner and faced due South we both saw three brightly lit orbs to the South South West leaving what looked like tails of sparks flying over the tree tops. Our first reaction was one of disbelief and excitement. They were some distance away, anywhere from 500-1500' AGL, and appeared to be near the Mile High football stadium during a broncos game. One of them appeared to be falling, or stationary while the other two were changing directions and flying around each other. They left brilliant trails of sparks, and their movements were smooth and gentle. I have seen footage on You Tube from Oxford UK and California that matched what we saw tonight. We were driving towards the lights, and eventually lost sight of the objects through the trees, and stopped the car to find a better vantage point. I had line of sight on them for a good 45 seconds out of a minute or two we were observing them. I called 911 to report what I was seeing and make sure there was a log of our sighting. We knew what we were looking at when we saw it- just like the footage we have seen of UFO's elsewhere. The only thing that might explain what happened is if it were somehow part of the halftime show, but honestly, I don't think this small town has the sack to pull something like that off. I hope we are not the only ones to see this- and I hope some footage pops up. I will be checking the local news to see if they have any info."],"files":["/var/www/straped/mufon/html2text/31781.html.txt","/var/www/straped/mufon/org/31781.html"],"Case Number":"31781","Weather Factors":"Unknown","Object Shape":"Sphere","trends":["There have been 185 other sightings in Denver","There were 2 other sightings in Denver on or around September 12th 2011"],"Summary":"three flaming orbs with sparkling tails interact over denver","Viewing Distance":"Over One Mile","Date Submitted":"09/13/2011 01:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.780137,+-104.998757(31781)&iwloc=A&hl=en\"> mufon case (31781) map </A>","City":"Denver","Disposition":"IFO"}