{"Date of the Event":"08/29/2011 09:14 UTC","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=34.241167,+-84.080425(31793)&iwloc=A&hl=en\"> mufon case (31793) map </A>","Country":"United States","Summary":"Star-like object pulsates twice with VERY bright white light","Date Submitted":"09/13/2011 04:38 UTC","Region":"Georgia","Longitude":"-84.080425","trends":["There have been 14 other sightings in Cumming","There were no other sightings in Cumming on or around August 29th 2011"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Latitude":"34.241167","Case Number":"31793","Object Features":"Undisclosed","Object Shape":"Star-like","divs":["sighting detailsmy wife and i were outside at about 9pm est on 8\\29\\2011. i alone normally take out multiple loads of trash to the edge of our driveway on monday nights, but this particular night my wife helped out since there was such a large load. as we were finishing up, at approximately 9:14pm, i looked up to the sky to look at the stars. it was a very clear night with absolutely no clouds. here are the exact stats for that time period: cloudless, clear night, visibility 10+ miles, 79f, wind nw @ 3mph, 33% humidity, uv index of 0, dew point 47. i have an uncanny ability to pick out satellites since i've been doing so for the past 25+ years and started as a kid. at the very moment i looked up, and in the very location my eyes first fixated, i saw what appeared to be a satellite moving in a constant albeit slower than usual path from right to left. it had the same very small shape and brightness (dull) as a satellite so i assume similar altitude. there was absolutely no sound. within 10 seconds of watching it, it pulsated to incredibly large, bright white ball of light. it grew in brightness at least 500-1,000 times if not more and within a second returned back to it's original size and luminosity. amazed i yelled over to my wife who was standing just feet away in the opening of our garage door. i quickly told her what happened, relocated the object and had her fixated on it. within several seconds, the objected pulsated again in the exact same manner. my wife witnessed it and couldn't believe it either. once again it returned to the satellite-like object and continued it's path. we followed it until it was out of site. so again, the pulse occurred twice, each within 30 seconds of each other and each lasting for approximately 1 second. i know of no other object that can do what this object did at that altitude and to that degree of brightness. the altitude was much greater than that of an airplane or helicopter. there was no sound, no other colors and no blinking lights. to note, before i submitted this report today, i performed a search in the mufon database. there is an identical report on the exact same day in ga. you may want to attempt to triangulate the time and location between our two events so that we can confirm the path of the object and determine if they indeed are the same. thank you."],"Tags":"City","files":["/var/www/straped/mufon/html2text/31793.html.txt","/var/www/straped/mufon/org/31793.html"],"City":"Cumming","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-09132011-0014","Viewing Distance":"Over One Mile"}