{"Sighting Duration":"01:39:00","Latitude":"36.808494","Log Number":"US-09132011-0015","Date Submitted":"09/13/2011 06:45 UTC","Object Features":"None","City":"Fresno","Disposition":"Insufficient Data","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.808494,+-119.738616(31794)&iwloc=A&hl=en\"> mufon case (31794) map </A>","Viewing Distance":"21-100 Feet","Longitude":"-119.738616","Region":"California","Country":"United States","Date of the Event":"09/12/2011 01:33 UTC","files":["/var/www/straped/mufon/html2text/31794.html.txt","/var/www/straped/mufon/more/31794_submitter_file1__Snapshot_20110913.jpg","/var/www/straped/mufon/org/31794.html"],"Summary":"red blinking lights at random sound like 10 jets flying above me and comlpetely invisible the speed was about 25 to 30 mph","trends":["There have been 63 other sightings in Fresno","There was one other sighting in Fresno on or around September 12th 2011","This sighting has never been favorited.",""],"Tags":"City","divs":["Sighting Detailsthree buddies and me were having a smoke on the front porch at 1:30 am. we were talking about some of the sightings we have seen before and i made the statement \"our world is about to change.\" at that very moment we heard these jet like noises start up instantly.my friend walked off the porch and looked up and started to jump around yelling at us asking what it was so we all got up off the porch and looked and saw a boomerang shaped object directly above us moving so slow it looked as if it was hovering in the sky.the lights blinked randomly and noise was so loud i could feel the ground shake.as it moved through the sky we lost sight of it behinds some trees so we ran to the street to get a better look and we could see stars in between the lights like nothing was even there completely invisible except for the red lights.as it kept moving on its straight path we lost sight of it behind the dense tree line."],"Object Shape":"Boomerang","Case Number":"31794","Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON"}