{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.228695,+-71.522565(3179)&iwloc=A&hl=en\"> mufon case (3179) map </A>","Region":"Massachusetts","trends":["There have been no other sightings in Hopkinton","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/3179.html.txt","/var/www/straped/mufon/org/3179.html"],"Log Number":"","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date Submitted":"08/07/2004 04:10 UTC","Latitude":"42.228695","Summary":"Lake Maspenock sighting","divs":["Sighting DetailsIt was my morning routine to go out on my deck over looking the Lake and have mymorning coffee. Before exiting the sliding glass doors I noticed a reflectionon the lake just like if the moon was full thats when I looked up and saw whatI thought was a large star but it seemed to be very low. My first instinct wasto get my camera but for some strange reason I couldnt. I sat down and watchedit mezmerizesd. I was very aware of my surroundings but just really couldntfocus on anything else. I did look to the left and saw a 34 moon in the treesand also I think what was the North star, but this was nothing like that.While I was watching I thought to myself if this moves then I will really befrightened. Then it slowly moved in my dierction over the house and it soundedlike a far away jet engine.When it left I sat there about 2 minutes in awe. My first instinct was to tellsomebody. Nobody around at that time of the morning people were still sleeping. I went to the internet and looked up UFO and found this Web page.Before this I didnt believe in UFos and Im having a hard time thinking aboutanything else and I really dont understand why I didnt get up and takepictures.I also thought about reporting it to the police but was afraid of themnot believing me and looking ridiculous. I am willing to take a lie detectortest and to be hypnotized.I find myself hoping opssesively for it to come back or to find someone else whowitnessed the same thing or some explanation to what I saw.My only regret is that it was there for a long enough time that I could havetaken alot of pictures but the fact that I didnt will haunt me for the rest ofmy life."],"Object Flight Path":"Stationary","City":"Hopkinton","Longitude":"-71.522565","Tags":"City","Sighting Duration":"00:10:00","Date of the Event":"08/07/2004 04:10 UTC","Disposition":"IFO","Country":"United States","Case Number":"3179","Object Features":"Patterned Surface","Object Shape":"Undisclosed"}