{"Country":"United States","Disposition":"IFO","Date of the Event":"09/12/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.97551,+-105.023954(31790)&iwloc=A&hl=en\"> mufon case (31790) map </A>","Tags":"City","Longitude":"-105.023954","Date Submitted":"09/13/2011 02:06 UTC","Case Number":"31790","trends":["There have been no other sightings in Placitas North of Albuque","This sighting has never been favorited."],"Summary":"Viewed over 50 UFO's during a 2 1/2 hour period","divs":["Sighting DetailsI observed for over two hours using binoculars over 25 pairs of lights in a very large circle over head. To the naked eye they looked like one craft, but there were two crafts close together. One craft stayed in place and the second one would move away a distance, stop and then move back toward the other craft. The circle over head covered many miles and the objects were at different altitudes. The two that I observed mostly were East of Albuquerque and North East of the Sandia Mountain Range. There was no airline traffic going into or out of ABQ. during this time,that I could see. I counted at least 50 craft (25 pairs), but there were more than that. The moon was very bright during the sitting and the two crafts I watched were very bright with white, red, orange and violette color. There was one other person with me during part of the evening. I stopped viewing at about 1:30 AM. I went outside with my dog at about 11:00 PM and that is when I noticed the two brightest lights. I came back in and got my binoculars and could make out the lights like I have described. The night sky here in Placitas is normally very clear at night. I will be checking again tonight to see if they are there."],"Viewing Distance":"Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Latitude":"34.97551","Object Shape":"Cylinder, Star-like, Triangle","Region":"New Mexico","Weather Factors":"Unknown","Log Number":"US-09132011-0011","files":["/var/www/straped/mufon/html2text/31790.html.txt","/var/www/straped/mufon/org/31790.html"],"Source":"MUFON","City":"Placitas North of Albuque"}