{"Latitude":"28.250497","trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around September 13th 2011"],"Weather Factors":"Unknown","Disposition":"Insufficient Data","Longitude":"-82.716237","Case Number":"31805","Object Features":"Other","Tags":"City","Date of the Event":"09/13/2011 11:40 UTC","Date Submitted":"09/14/2011 09:46 UTC","Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=28.250497,+-82.716237(31805)&iwloc=A&hl=en\"> mufon case (31805) map </A>","City":"New Port Richey","divs":["Sighting DetailsAround 11:30 last night I went on my porch for a cigarette. I noticed it being a little foggy outside and one star glowing really bright. I went outside to look at it and the second I went outside, I saw what appeared to be two red orbs floating up above my fence line. They were going up in a wave like pattern. At first, the only logical possibility I thought was maybe a weather balloon with flares or something, but these things were moving thousands of feet in seconds, and gracefully. I ran inside and woke up my wife. When we went back outside the orbs were brighter and were still going up, but in more of a straight line. One was a little bit behind the other and started fading. By the time the one faded away the other one started fading. When I could barely see it, it started changing direction and got bigger. I realized that it was getting bigger because it lowered and it came down to where it was about the size of a dime. It changed direction and glided right above us. When it got to it's closest point you could clearly see a disk shape with about fifteen or twenty red lights lining the edge of it, glowing the bottom a little bit. It looked like gravity had absolutely no affect on it. It was completely silent. If it was a plane or helicopter we would have easily heard it, and I have never seen a plane or helicopter shaped like that before. We watched it as it got brighter and moved faster. It went over US 19, and after it got to the point to where my roof was blocking our view we ran out front. When we got there it disappeared. I'd like to note that every time it changed direction, moved faster, or raise it got brighter. Almost like the brightness was linked to it's energy use."],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/31805.html.txt","/var/www/straped/mufon/org/31805.html"],"Sighting Duration":"Undisclosed","Summary":"Disc shape red lights around edge","Country":"United States","Region":"Florida","Log Number":"US-09142011-0006","Source":"MUFON","Viewing Distance":"101-500 Feet"}