{"Object Features":"None","Region":"Arizona","divs":["Sighting DetailsAt around 7:30 PM Arizona time I happened to step out front to smoke a cigarette only to discover the most amazing thing I have ever seen. An extremely bright greenish-blue glowing orb with a tail stream like a meteor was rushing through the sky. I was facing south at the time. I first spotted the object to the southwest and it continued for roughly 30 seconds on an eastern course until it flashed red for a second and then completely disappeared. It looked like something burning up in the atmosphere. But I've seen shooting stars and meteors before and this was like nothing I've ever seen. It looked huge and it was very bright. I've also never seen a meteor that was green like this one (although I have heard of their existence). The object was visible long enough for me to call two of my friends outside who witnessed it as well. The strangest thing of all was that as soon as I came back inside the house (maybe 5 minutes after seeing the object) I pulled my cell phone out of my pocket and it had mysteriously turned off. It would not turn back on until I removed the battery and replaced it. Upon turning it back on, the battery life was at 75%, so this was not a case of the phone shutting off due to a low battery. Upon checking out this website, I was glad to see that others had reported a similar sighting in my area."],"Summary":"Extremely bright glowing comet-like orb in sky","Disposition":"IFO","Date Submitted":"09/15/2011 05:14 UTC","Date of the Event":"09/14/2011 07:30 UTC","files":["/var/www/straped/mufon/html2text/31819.html.txt","/var/www/straped/mufon/org/31819.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.458017,+-112.067677(31819)&iwloc=A&hl=en\"> mufon case (31819) map </A>","Country":"United States","Longitude":"-112.067677","Object Shape":"Bullet, Missile, Fireball, Sphere","Sighting Duration":"00:00:30","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around September 14th 2011"],"Viewing Distance":"Unknown","Case Number":"31819","Source":"MUFON","Tags":"City","City":"Phoenix","Log Number":"US-09152011-0003","Object Flight Path":"Straight-line path","Latitude":"33.458017","Weather Factors":"Unknown"}