{"divs":["Sighting DetailsTo whom it may concern: My wife and I were spending the weekend at a motel in Montauk, NY. On Friday, Sept.09,2011 my wife was sitting on the terrace while I was watching television in the livingroom. She began calling me to come see something in the sky as she had no idea as to what it could be. The sky was crystal clear with a full cpmpllment of stars. At approximately 21:15 hrs. I stepped onto the terrace, from which we had a 180 degree unobstucted view of the sky and a eastern, western and southern view of the Atlantic Ocean. I observed a cylindrical or disc shaped object with a bright yellow to orange color radiating above below the full length of the object. It appeared to be travelling at a speed greater than a passenger jet from west to east. I raised my I-4 cell phone to get a picture of the object but I was afraid of losing sight of the object and refrained from doing so. The object disappeared into the eastern sky. As my wife and I continued watching the skies we never thought we would see such a sight again. To our amazement at approximately 21:30 hrs. the same or another identical object appeared from the northwest sky, continuing south and then turning towards the east. It appeared to be travelling at the same rate of speed. We observed it until it disappeared into the eastern sky. My wife received a phone call and exited the terrace and answered the call in the bedroom. I remained on the terrace in awe of what we had just witnessed. I continued to watch the sky and at approximately 21:50 hrs. for the third time I observed another or same object travelling from the northern sky heading south and turning towards the east. When it was almost directly in front of where I was standing on the terrace observing this object in the distance the object made a sudden stop or right turn to the the south. It then proceeded to travel upward into the sky in a steep climb, at a tremendous rate of speed. I still have to catch my breath thinking of what I had just witnessed three times in one night, never mind in a lifetime. This was not imagined or a dream, it was real and will never be forgotten."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.012142,+-71.947039(31829)&iwloc=A&hl=en\"> mufon case (31829) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31829.html.txt","/var/www/straped/mufon/org/31829.html"],"Country":"United States","City":"Montauk","Viewing Distance":"Over One Mile","Source":"MUFON","Longitude":"-71.947039","trends":["There have been 4 other sightings in Montauk","There were no other sightings in Montauk on or around September 9th 2011"],"Log Number":"US-09152011-0013","Object Flight Path":"Straight-line path,Path with directional change","Region":"New York","Object Shape":"Cylinder, Disc","Date of the Event":"09/09/2011 09:15 UTC","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"09/15/2011 06:35 UTC","Case Number":"31829","Summary":"Yellow to orange colors radiating above and below a cylindrical or disc shaped object traveling at a high rate to an extremely high rate of speed","Latitude":"41.012142","Weather Factors":"Unknown"}