{"Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Country":"United States","Object Flight Path":"Straight-line path","Log Number":"","City":"Richmond","Weather Factors":"Unknown","Summary":"Saw Star-Like Object Over Richmond, BC","Tags":"City","Latitude":"40.560531","Object Shape":"Undisclosed","Source":"MUFON","trends":["There have been no other sightings in Richmond","This sighting has never been favorited."],"Longitude":"-74.147485","Date of the Event":"08/08/2004 11:05 UTC","files":["/var/www/straped/mufon/html2text/3182.html.txt","/var/www/straped/mufon/org/3182.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.560531,+-74.147485(3182)&iwloc=A&hl=en\"> mufon case (3182) map </A>","Region":"New York","divs":["Sighting DetailsIt was 1105 pm on Sunday evening Aug 8,2004 and my brother and I were walkinghome after returning a movie. As we were walking my brother stopped and pointedup and said, Hey look how bright that star is. I looked up and at first Ithought it was the N.Star, but the intensity of its brightness grew. The objectat this time was stationary for approximately 5-6 seconds. The object then grewincreasingly dimmer to the point where it looked like a regular star. With theshift in the brightness the object appeared to get smaller as well could be haloeffect almost half the size. After it dimmed it was staionary for a few moreseconds then suddenly began to move SE about the width of my pinky finger heldat arms length. At that point the object disappeared. We stood there for closeto two minutes afterwards to see if it would reappear but it did not. We wereboth calm during the sighting as well as after. We tried to deduct wether itcould have been a satellite they dont stay still, a shooting starthey dont staystill either, or Saturn Saturn doesnt just start moving then disappear. I thinkthat there may still be a logical explanation for it that we perhaps may haveover looked."],"Disposition":"Unresolved","Date Submitted":"08/08/2004 11:05 UTC","Sighting Duration":"00:00:59","Case Number":"3182"}