{"Latitude":"39.885562","Object Shape":"Saturn-like, Triangle","trends":["There have been 3 other sightings in Red Lion","There were no other sightings in Red Lion on or around September 15th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.885562,+-76.597059(31824)&iwloc=A&hl=en\"> mufon case (31824) map </A>","Date of the Event":"09/15/2011 09:10 UTC","Country":"United States","City":"Red Lion","divs":["Sighting DetailsI was standing out on my pool deck this morning which is about eye level with my roof. Looking out over top of the right side of the house I noticed something round in the sky off in the distance. At first I thought it was a balloon, but kept watching it anyway. As the object came straight at me, it looked very Saturn-like. Then, it smoothly and quietly shifted direction toward the left at which time I could see it pretty much from underneath. The object was dull gray and triangular from a bottom view but I could see what looked like dividing lines of a darker shade, there was no sound from it at all and no lights that I could see. It was drizzling a little this morning when this happened so I had to be careful not slip as I ran in for my Nikon Coolpix camera. I remembered that it is important to get a shot of what I was seeing. So, I ran in the house and by the time I came back outside and ran up to the deck again it was behind a tree. I waited a couple of seconds and it came into view again but flying away at this point until I couldn't see it anymore. I took as many pics as I could, one right before it passed behind another tree, four total. It is very hard to get a good photo of things up in the sky! Now I understand why all the distorted photo evidence out there! I was disappointed when I uploaded the pics to my computer; they are very distorted. When I zoom in on them all I can see is a circular object. I tried to find a website where I could send them to be enhanced or find software to do it myself because that was all I cared about and came across your site. Is there somewhere I can send them to get them better focused and cleaned up? I just want to get a better view of what it was I saw."],"Region":"Pennsylvania","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Case Number":"31824","Tags":"City","Summary":"I saw what I first thought was a balloon. However, as it got closer and smoothly changed direction, I didn't know what it was.","Longitude":"-76.597059","Object Flight Path":"Path with directional change","Log Number":"US-09152011-0008","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31824.html.txt","/var/www/straped/mufon/more/31824_submitter_file1__003.JPG","/var/www/straped/mufon/more/31824_submitter_file2__004.JPG","/var/www/straped/mufon/more/31824_submitter_file3__006.JPG","/var/www/straped/mufon/org/31824.html"],"Date Submitted":"09/15/2011 02:06 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","Weather Factors":"Unknown"}