{"trends":["There has been one other sighting in Limestone","There were no other sightings in Limestone on or around September 14th 2011"],"City":"Limestone","Object Flight Path":"Hovering then path,Straight-line path,Unknown","Sighting Duration":"Undisclosed","Summary":"Witness over 22 stars moving west of the bigdiper constalation after observing a faint light that could of bin a satalite","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","Case Number":"31820","Object Shape":"Diamond, Star-like, Triangle","Date Submitted":"09/15/2011 10:44 UTC","Object Features":"Unknown","Tags":"City","Region":"Maine","Longitude":"-67.900806","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.935446,+-67.900806(31820)&iwloc=A&hl=en\"> mufon case (31820) map </A>","files":["/var/www/straped/mufon/html2text/31820.html.txt","/var/www/straped/mufon/org/31820.html"],"Disposition":"Unresolved","Latitude":"46.935446","divs":["Sighting Detailsseptember 14,2011 (9:27-9:37) I whent out for a walk towards a baseball field that no one suppose to go to after hours(when the sun sets) at about 9:15am. I was walking around admiring the full moon when precisely at 9:27 I notice a faint glimmer of light moving north or towards the bigdiper, it almost looks like a satalite passing by; Thats when i notice what looked to be moving stars moving west as the satalite passess by moving north. I counted well over twenty-two star moving the same direction, sum seem to be connected in what looked to be triangle others looked like an octagon,rotating from a 45DEG angle to a 180DEG were i can clearly see that the lights were conected but not on all of them were, I only notice about tow triangler shaped one and one Resembling an octagon. I new that they were moving because i stood sill for about ten minutes watching them move forward, I also saw other \"real star\" that they pass by under blocking there light. I looked behind me and i notice other stars it looked like they were trying to catch up with the rest of the fleet. This sorta looked like that video i saw when they recorded well over one-houndred bright orbs that resemble stars appearing and disapearing in broad day light. To believe that we are the only intellegent species out here or in our solar system is like being spit on the face, our ancient ancestors left us clues something gunna happen that will change everything."],"Log Number":"US-09152011-0004","Date of the Event":"09/14/2011 09:27 UTC"}