{"Log Number":"US-09152011-0006","Latitude":"36.205634","Object Shape":"Unknown","City":"Roan Mountain","Object Features":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.205634,+-82.092801(31822)&iwloc=A&hl=en\"> mufon case (31822) map </A>","Tags":"City","Date of the Event":"12/25/2010 12:00 UTC","divs":["Sighting Details Around midnight on Dec 25 my girlfriend and I was on our way home after meeting a friend to get a guitar I bought from him. On out way back, the road was very iced over and with snow. We was traveling 25mph or less. As we was going around a right handed curve something on the right side of the road caught my eye. Then when my headlights hit the being, it got on its knees and placed its very long and skinny arms on the ground. The arms was 3' or longer in length and maybe 1\" around. As we passed the being, it stayed very still, as if it was trying not to be seen. The being was around 5'5\" on its knees so standing it would have been over 6' tall. Very dark gray, with no fur or hair. The eyes was about 3\" and almost round. One thing I thought was strange is when my headlights hit the being the eyes they didn't glow like a deer or other animal. There was two large black bag like items not far from the being. After we passed the being I looked at my girlfriend and asked what the hell was that. She said very fast she didn't want to talk about it. Less then a half mile up the road, I turned around and rushed back to try and figure out what it was. When I got back to were the being was it was gone and the big black bag like items were gone with it. It took less then 3 min. to get back where the being was seen. I got out to look and found no foot prints or any sign of where the bag like items was. The snow on the ground was untouched. At this time I got scared thinking the being may be just past the tree line looking at me. So I got back in the car and went home. To this day when I talk about the being my eyes tear up. I really wish I could find out what my girlfriend and I seen, and what the black items was. It has made me be very scared at night when I am alone thinking it may come back."],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/31822.html.txt","/var/www/straped/mufon/org/31822.html"],"Viewing Distance":"20 Feet or Less","Weather Factors":"Snow, Light","Longitude":"-82.092801","Region":"Tennessee","Case Number":"31822","Summary":"Seen a being while driving.","trends":["There have been 2 other sightings in Roan Mountain","There were no other sightings in Roan Mountain on or around December 25th 2010"],"Sighting Duration":"00:00:35","Object Flight Path":"Undisclosed","Country":"United States","Date Submitted":"09/15/2011 12:38 UTC"}