{"Object Flight Path":"Stationary,Path with directional change","files":["/var/www/straped/mufon/html2text/31830.html.txt","/var/www/straped/mufon/org/31830.html"],"City":"Fairless Hills","Region":"Pennsylvania","Log Number":"US-09152011-0014","Viewing Distance":"101-500 Feet","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"31830","Longitude":"-74.845184","Latitude":"40.188084","Object Features":"Window(s), Patterned Surface","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.188084,+-74.845184(31830)&iwloc=A&hl=en\"> mufon case (31830) map </A>","Date of the Event":"05/10/1994 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Disposition":"Insufficient Data","trends":["There have been 12 other sightings in Fairless Hills","There were no other sightings in Fairless Hills on or around May 10th 1994"],"Object Shape":"Square, Rectagular, Other","Summary":"It was HUGE. i could see what looked like windows. I could not believe that no one else was pulling over--it was directly over a major rd which was busy. Stationary for 10 min then it abruptly took off fast and then looked like a colorful snake-like objec","divs":["Sighting DetailsWas with mother in law in my vehicle on S. Oxford Valley Rd going North to Fairless Hills. I remember reading about a sighting in Fairless Hills in the local newspaper a day or so earlier about a man seeing an object in the sky. The date i submitted is not approximate as I cannot remember even what month this was. My wiper blade flew off and radio died. It was sprinkling so I pulled into the turning lane. I got out and instinctly looked up at it without even looking for my wiper. I did not know it was there before I looked up. It was HUGE--wider then 2-3 football fields. I could see windows. I called for my mother in law to get out and look up. She saw it too and I must have asked her 100 times if she really see's it and asked her to describe what she saw. She described exactly what I was seeing. What i did not understand was why no-one else was pulling over because it was clearly visible right above the trees and this major roadway which was very busy with traffic and why was this huge object not making any noise. It stood stationary for about 10 minutes then it abruptly too off so fast that the only thing we could make out was a colorful snake-like trail. We jumped in the car an sped to follow it. We lost sight of it just before reaching Morrisville, PA. It simply disappeared in the sky. I pulled over to collect my thoughts and I could not validate what this object was. I could not sleep as I felt like something was watching me. I'd open my eyes to find nothing there. The very next night I had the same sensation and opened my eyes. Right next to my bed were 3 beings. Each one a different size. I immediately panicked and slid sideways til I was under my husband screaming. I believe I was abducted as I remember details but will not go into that on here. After that experience, I remember being in my bed once more and I slid sideways under my husband and was screaming. He awoke and told me I had a nightmare & to go back to sleep. There has got to be more witnesses to this sighting besides the two of us."],"Date Submitted":"09/15/2011 06:46 UTC"}