{"Longitude":"-87.522161","Region":"Indiana","divs":["Sighting DetailsI was going to go outside to see if i would see anymore UFO's, and sure enough i did. I was about to step outside, and i was looking through our back door (faces south) and i could see a white orb hovering due south of us. I asked my mom to take a look at it, and she thought it was a plane, but i wasn't sure, so i ran back to my room to grab my new camcorder and then i ran back into the kitchen and looked at the clock because i broke my phone earlier, it said 9:16 PM EDT. I stepped outside, and i walked to our back yard, on the edge of the field and started taking video. I could still see the white orb hovering above the tree line to my south. Then a second object appeared out of nowhere, to my south-southeast, and began heading west at a pretty good speed, i'm guessing between 300 and 500 mph and was about 500 feet above the ground. It was fairly bright, it was white and did not pulsate or blink, but remained constant. It went behind a farm that had three large grain silos, but i never did see the object again, so obviously it disappeared behind the silos. The first object began to slowly move northeastward. It took roughly 10 minutes for it to travel from my due south to my due east. I turned around to check the sky to the north, and thats when i saw yet a 3rd object coming from the north, so i started walking fast to the north of our house, i stood there for about 2 or 3 minutes, and this object got closer to me, and thats when i realized that it was just a jet with it's landing lights on heading into the Evansville airport. Right then, a 4th object, a white orb appeared to my north. It was hovering above Vincennes, IN, between 200 and 500 feet in altitude. The 1st object was now to my east-northeast, and was still moving northeastwards. The 4th object was stationary for about 5 minutes, and then began to move westward. It moved west at about 100 mph, and remained at it's same altitude as it was when it was over Vincennes. Another 5 to 7 minutes past when it got to my north-northwest, where it began to rapidly descend and got very bright, about as bright as Jupiter or Venus. It then began to head back east, again at about 100 mph, but was much lower in altitude, less then 200 feet. This is where it gets a little strange. It started to descend to the north-northwest, to the point where it was at the tree line. Then it went behind the trees, where i lost sight of it. That's when yet a 5th object appeared to the northwest, it appeared slightly orange, but mainly white, and was about 500 to 800 feet in altitude and was also heading east. Shortly after, about a minute or 2 later, the 4th object reappeared above the tree line, as if it saw the 5th object approaching. Then i saw a 6th orb, a very bright white light, that i saw for just a second, it came on, and went back off, but i know it was not a flare, because i watch F16's practice their dog fights during the day and at night, and i've seen them drop flares, they are orange and slowly descend, and last about 2 or 3 minutes. The 4th object picked up speed and started rapidly increasing in altitude and headed east about 50 or 100 mph. The 5th object quickly caught up to the other object, to the point where they were only about a mile and a half apart from each other. Then both objects stopped, and hovered for about a minute, and object number 4 faded away, but the other object began moving eastward again. Right then, i looked up and saw a triangular object, simalar to the other triangles that i've witnessed in the past. A red blinking light in the center, with 3 white lights (not blinking or pulsating) in a triangular formation. There were some pulsating lights on the rear, but i could not see a specific pulsating pattern, but they pulsated regularly at about once per second. This object was making a turn towards the left and was begenning to head north-northeast at about 200 or 300 mph, towards the white orb near Vincennes, as if it was going to check out the orb. Both objects were now heading northeast. I was filming for almost the entire time. From about 9:17 PM EDT to 10:09 PM EDT. I finally lost visual of the orb, and lost visual of the triangle about 5 minutes after i lost visual of the orb. I did not see anything afterwards. This was certainly the most objects i've ever witnessed in one night, in about an hour i saw about 4. I did manage to take 2 photos of orb number 4 to my north before my camera batteries died (i didn't bring any extra batteries) and i managed to take a very long video, (over 30 minutes long) although the majority of the objects did not show up in the video, at times i did actually get some of the objects on video (i don't remember exactly which ones i captured). I am hoping Mufon can do some examining of my photos and video that i attempt to send in. I will have to send my video in some other time due to our very slow dial up internet connection, i will attempt to upload the 2 photos that i took. I looked at my photos and both photos do have what appears to be the white orb, it is almost in the very center of both photos, but you have to zoom in a few times in order to see it."],"trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around September 15th 2011","This sighting has never been favorited.",""],"Summary":"At least 6 orbs and 1 triangle near Vincennes, IN","Object Features":"Unknown","Weather Factors":"Unknown","Latitude":"38.596921","Object Shape":"Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=38.596921,+-87.522161(31836)&iwloc=A&hl=en\"> mufon case (31836) map </A>","files":["/var/www/straped/mufon/html2text/31836.html.txt","/var/www/straped/mufon/org/31836.html"],"Viewing Distance":"Unknown","Date of the Event":"09/15/2011 09:16 UTC","Country":"United States","Case Number":"31836","Tags":"City","Sighting Duration":"00:50:00","Log Number":"US-09152011-0020","City":"Vincennes","Source":"MUFON","Date Submitted":"09/15/2011 11:04 UTC","Object Flight Path":"Stationary,Path with directional change","Disposition":"Unknown"}