{"Sighting Duration":"Undisclosed","Latitude":"39.997263","Viewing Distance":"Unknown","Summary":"Orange/Orb balls hover over woods, changing size and shape, come from sky and imitiate planes.","Date of the Event":"08/21/2011 09:30 UTC","Longitude":"-86.34583","City":"Whitestown","Weather Factors":"Unknown","Object Shape":"Circle, Fireball, Oval","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/31831.html.txt","/var/www/straped/mufon/org/31831.html"],"Region":"Indiana","Case Number":"31831","Tags":"City","Date Submitted":"09/15/2011 07:27 UTC","trends":["There have been no other sightings in Whitestown","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.997263,+-86.34583(31831)&iwloc=A&hl=en\"> mufon case (31831) map </A>","divs":["Sighting DetailsAugust 11, 2011 5:30 a.m.- Noticed a star moving up from northwestern sky horizan then stopped. It stayed in same position for 1 hour. Looked through binoculars and the \"star\" changed color from red,green, yellow and white. August 17, 2011- 11:00 p.m.\"color changing star\" was in northeastern sky. Did not witness movement. August 21, 2011 9:30 p.m.- Went outside to look for \"color changing moving star\" in southwestern sky and noticed orange orb like glowing lights hovering around treeline in field by my house. There were about 2 or 3 moving in and out of tree line. Not moving like anything I had ever seen compared to our aircraft. There ae powerlines between our house and the treeline. August 22, 2011 - 5:30 a.m. \"star\" was present in northeastern sky, but located in a higher postition. No movement witnessed. August 23, 2011 - 9:30 p.m. 2 Orange orbs appeared in the treeline in the same field in the back of my house. This night I zoomed in on one and video recorded it. It appears to look like a plasma fireball changing colors. When I play the video, there is a strange high frequency techno sound recorded. This was not audible to my ear at the time I was recording. August 26, 2011 9:45 p.m. Orbs show up in smae treeline area. This time we showed them to my neighbor. I also showed him the video with the strange audio. August 28, 2011 9:20p.m. Orbs were visible in same treeline again. This time there were more thatn I had ever seen. Maybe 4 or so. Our power went out in the whole neighborhood for 2 hours on a clear night. I was watching more of these orbs coming down from sky into treeline. One orb started glowing white and getting larger and closer to our house. I was upstairs at this time and informed my husband of this. We got the kids and went downstairs. The light was so bright and big and almost to our house. It was silent. By the time it flew overhead, it made a noise like a plane. I looked to the other side of the house where it flew over and it was gone. This light was so bright, but did not hurt our eyes to look at it. August 30, 2011 9:30- orbs are back as usual. Sept. 2, 2011- 6:00a.m. Orbs in the morning now, leaving treeline, imitating plane lights as they head into the sky. Septemeber 3, 2011- 10:00 a.m.- 3 military helicopters are flying over wooded area and field. September 4, 2011- Evening sometime. Next door neighbors said they saw about 8-10 chinese lanterns in northeast sky. Septemeber 12, 2011- 6:35 a.m. orb imitating plane and headed back into sky. This day a small yellow plane flew over my house and neighborhood, over field and treeline about 10 or more times. September 13, 2011 6:45 a.m. Orb turned into fake plane and headed into sky. Small yellow plane flew over same path or route about 10 times again. September 15, 2011 6:45a.m. Two orbs hovered over treeline then imitated planes. One of the orbs got really bright white as I tried to record it, then imitated a plane and flew off into sky."],"Country":"United States","Source":"MUFON","Log Number":"US-09152011-0015"}