{"files":["/var/www/straped/mufon/html2text/3183.html.txt","/var/www/straped/mufon/org/3183.html"],"Source":"MUFON","Date Submitted":"11/30/1977 07:00 UTC","Country":"Canada","trends":["There have been 14 other sightings in Victoria","There were no other sightings in Victoria on or around November 30th 1977"],"Disposition":"IFO","City":"Victoria","Date of the Event":"11/30/1977 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=48.438411,+-123.359846(3183)&iwloc=A&hl=en\"> mufon case (3183) map </A>","Log Number":"","Longitude":"-123.359846","divs":["Sighting DetailsI first want to say that I have not told a lot of people this experiance. Inaddition I had tried to do a search in my to find somebody to report this to,but the numbers turned out to be NIS anymore. I found your site today andreported a sighting we just had 2 days ago and figured I may as well tell you myearliest experiance.I was 4or5 at the time and my brotherMilen was about 7or8 so that would put theyear at 1978. We lived on Taunton St.sp in Victoria, British Columbia and ourmother wanted us to walk down to the end of our cauldesac and pay our babysitter his money. We had just gotten a new puppy and we took him with us aswell. It was dark outside as we left. As we approached the front of our yard atthe gate we noticed a large round disc that was a bright white color. I hadthought that perhaps it was the kids that lived behind us using a flashlight. Itwas about 4 houses high 120 and followed us as we walked down the street. It wasat that time that I knew a flashlight couldnt shine that far. We reached ourbabysitters house and the object hovered over top. It was not visible from theporch and front door but could be seen from the front lawn. The mother answeredthe door and we told her that a light in the sky had follwed us to her house.She didnt react at all and went and got her son. We paid him his money and left.When we reached the sidewalk the object moved over us again. My brother freakedout and started running home faster than I could. I began to cry and panicbecause I couldnt keep up with him and the puppy was running slower than me. Theobject stayed over me and not my brother. This scared me even more so and I wasyelling at our dog to please hurry up as I didnt want him to get hurt by them ortaken.We got inside and our mother immediatley began yelling us asking us where wewere. We had said we went up the street and ran right back because a light inthe sky was following us. She said that she called the baby sitter and was toldwe hadnt even been there yet. We had said that we were only gone a few minutesand that we had RAN home So we couldnt have been gone that long. Our mom hadsaid that she was about to go out looking for us and call the police.We didntsay anymore because we were being yelled at. We then got ready for bed and thatwas the end of it.It wasnt until almost 8 months ago that I put 2 and 2 together. Could we haveexperienced missing time I have"],"Object Shape":"Unknown","Case Number":"3183","Tags":"City","Region":"British Columbia","Latitude":"48.438411","Object Features":"Undisclosed","Summary":"Childhood Sighting wPossible Missing Time","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Sighting Duration":"00:10:00"}