{"files":["/var/www/straped/mufon/html2text/31839.html.txt","/var/www/straped/mufon/org/31839.html"],"Longitude":"-79.577401","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.072742,+-79.577401(31839)&iwloc=A&hl=en\"> mufon case (31839) map </A>","Object Features":"Other","Summary":"Chased a UFO and several hours missing time.","Tags":"City","divs":["sighting detailsi was an art instructor (college level) teaching night classes. i also was a business owner. i dropped off a student at about 10:00 pm and stayed for a cup of coffee before leaving for a late night at my business with my partner. it takes about 35 to 40 minutes to travel from my students home to my business. i stopped to pick up a candy bar for my partner at a 7-11 as i had promised. as i came within 150 feet of the graveyard entrance a ufo shot down from left (11 o'clock angle) to right (4 o'clock angle). i at first thought it was a small plane crashing but as it got to within approximately 30 feet of hitting the road in front of me it slowed and shot upward at a sharp angle. all i could see were 5 large lights ( blinding bright) that blinked from left to right continuously as if on a circlular object. i pulled into the entry of the graveyard and got out of my car. it was hovering at tree hight(60 to 80 foot tall pine trees) near the edge of the graveyard and almost above the only house on that side of the road at that time. then it moved off and i jumped back in my car and followed it down the road as it moved just above the trees and power lines in a sort of swinging or zig zag movement while the white lights continued to blink in a spinning pattern. i chased it for about 3\\4 of a mile and then it moved out over fields toward i-85\\40. when i arrived at my business, just another 1\\2 mile away, it was near 3:00 am. i have been bothered by this for years and just wanted it reported while i am still alive. in the early part of 1988 i had a secon encounter with something completely different while recovering from surgery. i will report it in another post."],"Date Submitted":"09/16/2011 12:55 UTC","Latitude":"36.072742","Date of the Event":"11/19/1987 11:00 UTC","Sighting Duration":"02:00:00","Country":"United States","Object Shape":"Unknown","City":"Whitsett","Disposition":"Unresolved","trends":["There have been no other sightings in Whitsett","This sighting has been favorited 1 time."],"Log Number":"US-09162011-0003","Case Number":"31839","Weather Factors":"Unknown","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Region":"North Carolina","Viewing Distance":"21-100 Feet"}