{"trends":["There has been one other sighting in Wendover","There were no other sightings in Wendover on or around September 14th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Case Number":"31842","Object Flight Path":"Stationary","Date of the Event":"09/14/2011 04:15 UTC","Object Features":"Unknown","Latitude":"40.745572","Country":"United States","Tags":"City","Summary":"Strange hovering dot found while driving West on I-80 in Utah","Source":"MUFON","City":"Wendover","Log Number":"US-09162011-0006","Sighting Duration":"Undisclosed","Region":"Utah","divs":["Sighting DetailsMy friend and I were driving West on I-80 through Utah around late afternoon, between 4-4:30pm. I was sitting in the passenger seat of the car and I saw a small black dot against the sky. There were clouds in the sky, but no excessive cloud cover. We thought it might have been a blimp or a hot air balloon at first; we were probably a good 5-8 miles away from where this object seemed to be hovering over. I took a picture of it as a joke saying we found a UFO on our way out to California. After a few minutes driving on the highway we ended up being on the left-hand side of this object, due to turns in the road. When I looked up again at the object, it was no longer black...it appeared white, almost as if it was relecting the sunlight. My friend thought it appeared to be in the shape of a fish, and I thought it had looked like a space shuttle. There was wind blowing around while we were driving, so we found it bizarre how this object didn't seem to sway back and forth. Also, it did not ascend, descent, make any sudden turns, anything to indicate some sort of movement. Even as we were driving away from it, it still seemed to just stay in the same spot it was in when I first noticed it."],"Longitude":"-114.03236","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/31842.html.txt","/var/www/straped/mufon/more/31842_submitter_file1__2011-09-14_17-15-01_907.jpg","/var/www/straped/mufon/more/31842_submitter_file2__2011-09-14_17-27-27_697.jpg","/var/www/straped/mufon/more/31842_submitter_file3__DSC01834.JPG","/var/www/straped/mufon/org/31842.html"],"Disposition":"Unresolved","Date Submitted":"09/16/2011 01:20 UTC","Object Shape":"Blimp, Oval, Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.745572,+-114.03236(31842)&iwloc=A&hl=en\"> mufon case (31842) map </A>"}