{"Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path","Source":"MUFON","Region":"California","Longitude":"-120.846534","files":["/var/www/straped/mufon/html2text/31846.html.txt","/var/www/straped/mufon/org/31846.html"],"Date of the Event":"09/15/2011 08:30 UTC","Disposition":"Unknown","Date Submitted":"09/16/2011 02:16 UTC","divs":["Sighting DetailsOne the way home at roughly 8:30 pm in Turlock, CA on 9-15-11, on a crystal clear light. I noticed 3 bright lights forming a perfect triangle in the sky. It was flying too slow to be planes and the three lights were perfectly aligned in a vertical triangle. It was enormous and you could see an outline of an object. We looked at it for about three minutes. My two kids got scared and didn't want to stop. We hurried home to look at it some more and it was gone. I have never seen anything like it but it didn't look like planes flying in formation and the three lights made it an exact triangle. It was enormous. It was something and it was huge. I can't think of anything logical that it could have been. Other than three planes flying in a triangle formation very slowly with bright lights which is very unlikely as this is a small rural town in central california. We also do not have any tall buildings or radio towers in that area. It is just flat and the sky was extremely clear. I am skeptical because I don't believe in UFOs but I saw something very unusual."],"Sighting Duration":"Undisclosed","Case Number":"31846","City":"Turlock","Object Features":"Unknown","Tags":"City","trends":["There have been 8 other sightings in Turlock","There were no other sightings in Turlock on or around September 15th 2011"],"Weather Factors":"None","Log Number":"US-09162011-0010","map":"<A HREF = \"http://maps.google.com/maps?q=37.510313,+-120.846534(31846)&iwloc=A&hl=en\"> mufon case (31846) map </A>","Latitude":"37.510313","Summary":"Giant Triangle Object with faint outline hovering and flying slow","Country":"United States"}