{"map":"<A HREF = \"http://maps.google.com/maps?q=40.587144,+-75.335275(31840)&iwloc=A&hl=en\"> mufon case (31840) map </A>","Longitude":"-75.335275","Weather Factors":"Unknown","Tags":"City","City":"Hellertown","Sighting Duration":"Undisclosed","Latitude":"40.587144","Summary":"UFO spotted above I-78 near Hellertown, Flies over couple.","Case Number":"31840","Log Number":"US-09162011-0004","Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Dome, Wings, Other","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsAt approximately 11:15PM EST on Sept. 15th, 2011 My wife and I had pulled over along I-78 nearing the town of Hellertown in Pennsylvania. There we had witnessed an extraordinary sight that we could NOT explain. Above the sky we had witnessed what appeared at first to be an odd plane- odd since the lighting on it did not seem to match anything that we had seen on planes around the area. We had pulled over on the side of the road to observe this strange light (yellow-gold in colour)which, as it had approached, appeared to have oscillating lights mounted on it's metallic hull. We had observed the object for an approximate 8-10 minutes when it had subsequently glided effortlessly over top of us, proceeding past the nearby treeline and off into the distance. The object seemed to be metallic in nature, with three couplings (think jet engine-esque) which appeared to house three large yellow-gold lights. Upon observing the object past the treeline it appeared to begin making jerky movements overtop of the city of Allentown close by. The object had dissappeared past the treeline from sight and we had decided to begin heading out when we had witnessed several more of the same type of yellow gold lights in the distance. These were dismissed as being planes at first but upon closer inspection these objects had the same strange oscillating light patterns that we had observed in the first object. We had observed these objects for quite some time, one of them had begun dimming and subsequently re-igniting so to speak in an apparent timed manner. The included Microsoft paint doodle is the best rendition I can create of the underside of the craft that had passed over us. If anyone has any news regarding these sightings please feel free to contact me.a"],"Date Submitted":"09/16/2011 12:58 UTC","files":["/var/www/straped/mufon/html2text/31840.html.txt","/var/www/straped/mufon/more/31840_submitter_file1__Ufo.png","/var/www/straped/mufon/org/31840.html"],"Object Shape":"Bullet, Missile, Sphere, Triangle","Date of the Event":"09/15/2011 11:15 UTC","Disposition":"Hoax","Country":"United States","trends":["There has been one other sighting in Hellertown","There were no other sightings in Hellertown on or around September 15th 2011","This sighting has never been favorited.",""],"Region":"Pennsylvania"}