{"trends":["There has been one other sighting in Snow Camp","There were no other sightings in Snow Camp on or around January 26th 1988"],"Date of the Event":"01/26/1988 12:00 UTC","Sighting Duration":"00:30:00","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","Date Submitted":"09/16/2011 01:23 UTC","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/31843.html.txt","/var/www/straped/mufon/org/31843.html"],"Object Shape":"Boomerang, Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.89333,+-79.43028(31843)&iwloc=A&hl=en\"> mufon case (31843) map </A>","Country":"United States","Latitude":"35.89333","Summary":"Vehicle hovered above our house for about 30 minutes","Source":"MUFON","Object Features":"Other","Log Number":"US-09162011-0007","Disposition":"Unresolved","Case Number":"31843","City":"Snow Camp","Tags":"City","divs":["Sighting DetailsI was sitting in a glass enclosed room reading (I was recovering from surgery and could not sleep). My husband was watching Johnny Carson on our bedroom tv. I heard a deep droning (very heavy sounding but not loud) noise. I got up and looked out back but didn't see anything and I thought that maybe someone was gunning an engine way off in the distance. I sat back down and continued to read for a good bit when my husband came running through the house saying it was hovering over our house. We went out side and looked up and saw a UFO shaped like flying wings( sharper shape than a boomerang)with colored lights across the back of both wing sides. It made very little sound except for the deep humming. It moved off directly east. As it went over our neighbors barn ( a 2 story barn with a long milking building attached about 100 to 125 feet), it was longer than the length of the barn and milking building and if I had stood on the roof I could have reached up and rubbed the bottom of the craft. It moved off so slowly that I could have kept up with it at a fast walk. We live in a very rural area."],"Viewing Distance":"21-100 Feet","Longitude":"-79.43028"}