{"Disposition":"IFO","Viewing Distance":"Over One Mile","Country":"United States","Summary":"We saw approx. 6 silver teardrop UFO in a circle moving about at about 6 mi and 15000 alt. Then 2 blk aircraft looked f117 at lower altitude. then both flew south till out of sight.","Source":"MUFON","Log Number":"US-09162011-0009","Region":"California","Tags":"City","Date Submitted":"09/16/2011 01:47 UTC","trends":["There have been 22 other sightings in Victorville","There were no other sightings in Victorville on or around September 14th 2011","This sighting has never been favorited.",""],"Longitude":"-117.164499","Latitude":"34.754376","Weather Factors":"None","Case Number":"31845","Object Flight Path":"Hovering then path,Straight-line path","Object Shape":"Teardrop, Triangle","Date of the Event":"09/14/2011 02:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31845.html.txt","/var/www/straped/mufon/more/31845_submitter_file1__UFO.jpg","/var/www/straped/mufon/more/31845_submitter_file2__UFO2.jpg","/var/www/straped/mufon/org/31845.html"],"City":"Victorville","divs":["sighting detailson 09\\14\\11 at approx. 1400 hours my wife and i pulled off of the i-15 north at stoddard road for a break. it was partially cloudy with great visibility. my wife saw it first. about six miles to the east (from stoddard wells rd., towards barstow) approx. six bright metal objects hovering in a semi circle near some clouds. they moved about independently, side to side, up, down but remained more or less in the same pattern. a couple of minutes later and very suddenly there were two black objects below this cloud. they looked like swept wing planes , very geometric not like the other objects which were teardrop shaped. both sets moved on to the south at about the same respective altitudes. we lost sight of the teardrop shaped objects first, and then the \"blackbirds\". one of the \"blackbirds\" appeared briefly under neath other clouds further south. all oblects appeared very small. i gather we were some miles away and they were at a pretty decent altitude. we were amazed by what we saw but were not aprehensive or fearful."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.754376,+-117.164499(31845)&iwloc=A&hl=en\"> mufon case (31845) map </A>","Object Features":"Wings"}