{"Case Number":"31847","Object Shape":"Circle, Fireball","Disposition":"IFO","Object Flight Path":"Path with directional change","Source":"MUFON","Country":"United States","Region":"Colorado","files":["/var/www/straped/mufon/html2text/31847.html.txt","/var/www/straped/mufon/org/31847.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 185 other sightings in Denver","There were 2 other sightings in Denver on or around September 12th 2011"],"Summary":"UFO Over Denver UPDATE","Tags":"City","Object Features":"Undisclosed","City":"Denver","divs":["sighting detailsthis is a direct response to the posting of ufo over denver mon, sep,12,2011 at 8 p.m! i too witnessed this event and i must say i was awestruck, however upon further examining it is my conclusion that the supposed ufo's\\orbs were not out of the world visitors, but instead they were straight from buckley air national guard, more specifically four (4) f-16's doing a flyover of the opening night monday football game of the denver broncos at the conclusion of the national anthem, as they have done for many years on the opening day football game. the kickoff was held shortly after 8 pm preceding the national anthem, and there was massive low cloud coverage over denver at that exact time, which later turned to rain. the visual ceiling for that night for ifr, and vfr flight was approximately 6500=7000 feet broken! the f-16's were flying in formation with their navigation landing lights on, which may have given the illusion of bright white yellow orbs to those who were more than a mile away from the stadium. my direct vantage point was in westminster, looking south when i too saw this event around 8 pm! once the jets flew over the stadium they broke formation turned off their nav lights to form a staggered formation to return to base! i wish this was a true ufo sighting, but i am sorry to say it was a natural man made event!"],"Longitude":"-104.982923","map":"<A HREF = \"http://maps.google.com/maps?q=39.745394,+-104.982923(31847)&iwloc=A&hl=en\"> mufon case (31847) map </A>","Log Number":"US-09162011-0011","Date Submitted":"09/16/2011 02:22 UTC","Date of the Event":"09/12/2011 12:00 UTC","Viewing Distance":"Over One Mile","Latitude":"39.745394"}