{"Viewing Distance":"101-500 Feet","Object Features":"None","Sighting Duration":"Undisclosed","Log Number":"US-09162011-0013","Object Flight Path":"Straight-line path","Object Shape":"Unknown","Case Number":"31849","trends":["There have been 11 other sightings in Lansing Charter Township","There were no other sightings in Lansing Charter Township on or around August 26th 2011"],"Tags":"City","files":["/var/www/straped/mufon/html2text/31849.html.txt","/var/www/straped/mufon/org/31849.html"],"Latitude":"42.740846","divs":["Sighting DetailsIt was approximately 12:33ish AM very early Friday morning. I was traveling directly east on Saginaw Street from downtown Lansing to pick up some McDonald's at the eastern city limits of Lansing before you enter East Lansing. I was traveling about 40 MPH, and it was already unusual as there wasn't another car on this well-traveled through-way at least for another mile ahead of me or behind me (you travel down a kind of steep drop, so you can see a lot of the street). At the bottom of the slope I come upon Marshall Park which would be directly to your north and looking left out of your window. Marshall Street is the major intersection here with the light and the area is composed of a lot of schools and open fields so you get a view of the sky. Anyway, I see a blinking light above Marshall Park; it couldn't have been anymore than 500 feet above me and no more than 300 feet north of my vehicle. The blinking light was attached to an object whose shape couldn't be made out because the light was not unusually bright, nor was the object itself illuminated. Being that the object wasn't moving erratically and kept on a straight path, I originally thought little of it. What began to really catch my attention, though, was that this thing was moving parallel to my vehicle, and it began to pick-up speed at an unusual (but gradual) rate, definitely faster than any airplane could increase it's speed. What really got me disturbed me, though, was that the interval of the blinking light on the object (about the same brightness, size, and color (white) of beacons on a plane wing or helicopter) was just ever so off, and unlike the beacon on a conventional aircraft which either strobe or slowly pulsate off and on, this blinking light would go COMPLETELY out when it dimmed and then appear back on; it's the only way I can describe it, it simply wasn't a normal blinking light. I noticed that I was beginning to get uncomfortable because I couldn't make sense of what this thing was. I couldn't have been watching it for more than 30-40 seconds, and was reaching where the homes and the neighborhood come back up to Saginaw Street at the intersection of Fairview when I also realized that this thing wasn't making any sound, at all. This is when I totally ruled it out as a helicopter. I began to lose the thing over the homes, businesses, and trees around Frandor Shopping Center as it continued to accelerate. I was so mesmerized with the thing that instead of stopping at planned at the McDonald's at Frandor Shopping Center, that I continued to try and follow the thing by continuing up Saginaw Street (instead of continuing down Grand River Avenue where the two split at the city borders), but neither street continues directly east so I began to lose the object. Last I saw it it had not just continued east but was now heading upward, but not at some unusual angle. I estimated at 12:38 AM that the object had to be somewhere over Okemos or immediately to the east of there given the distance. To summarize, what I found odd about the object was the slightly-off blinking light, it's unusually straight eastward and upward path as if it was being pulled on a string, its unusual acceleration, and the fact that I didn't hear any kind of engine despite the thing being only a few hundred feet away from me and above me when I first saw it. The object seemed to move so smoothly through the air as if completely unincumbered by friction. It didn't seem to be subject to any physical laws."],"Country":"United States","Date Submitted":"09/16/2011 08:11 UTC","Weather Factors":"Unknown","Date of the Event":"08/26/2011 12:00 UTC","Disposition":"Unknown","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.740846,+-84.527688(31849)&iwloc=A&hl=en\"> mufon case (31849) map </A>","Summary":"Silent, Blinking Object above Lansing","Source":"MUFON","Longitude":"-84.527688","City":"Lansing Charter Township"}