{"divs":["Sighting DetailsMy daughter and I were outside to watch the meteor shower for a while. Aftersome time of pointing out satellites and planets and such, we watched theskies... After about 15 minutes of watching my daughter exclaimed What the heckis that dad She was pointing straight up and I looked. I couildnt beleive myeyes What I saw was a boomerang shaped craft that was VERY difficult to reallymake out any features. It almost looked like a Klingon Bird of Prey when it iscoming out of cloaked mode. It was like liquid, or smoke or something with adistinct V shape. I could see the stars through it, or what I beleive to havebeen the stars. they were discolored yellow though. As it passed, it was silentand flying steady and straight. After about 30 seconds I couldnt see it any morebecause it was so hard to see to begin with. Im going to ask my daughter to drawthe shape of what she saw tonight and see if it looked the same to her. Shedescribed it to my wife as a thousand little yellow dots all crammed together."],"Longitude":"-122.570369","Case Number":"3185","City":"Clackamas","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/3185.html.txt","/var/www/straped/mufon/more/3185_submitter_file1__John_boyd.jpg","/var/www/straped/mufon/more/3185_submitter_file2__Richelle_boyd.jpg","/var/www/straped/mufon/org/3185.html"],"Tags":"City","Latitude":"45.40762","trends":["There have been 3 other sightings in Clackamas","There were no other sightings in Clackamas on or around August 10th 2004","This sighting has never been favorited.",""],"Country":"United States","Object Flight Path":"Straight-line path","Region":"Oregon","Date of the Event":"08/10/2004 09:45 UTC","Source":"MUFON","Log Number":"","Sighting Duration":"00:00:59","Object Shape":"Boomerang","Date Submitted":"08/10/2004 09:45 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.40762,+-122.570369(3185)&iwloc=A&hl=en\"> mufon case (3185) map </A>","Disposition":"Unknown","Summary":"boomerang with Klingon cloaking device","Weather Factors":"Unknown"}