{"Object Features":"None","Date Submitted":"09/16/2011 06:31 UTC","Tags":"City","Latitude":"46.736836","divs":["Sighting DetailsI was in Idaho helping with the family farm during harvest time. My job was driving a truck hauling grain (wheat) with another friend of the family, a farmer of over 30 years in the business. I positioned my truck directly in front of my friends truck awaiting a loaded combine. I then stepped out of the truck to make a phone call walking several paces away to escape some of the noise. After I had dialed my phone waiting for it to answer, I heard my friend yelling to me from 50 yards away and saw him pointing to the top of a hill of wheat stubble. He was trying to bring attention to a wolf he sighted that came into view just over the hill about 150 yards in front of us. I looked but did not see the wolf that quickly retreated back down the other side of the hill. It was nearing the end of the day and the sun had just fallen behind the tree line to the west. What did become apparent to me was a stationary yellowish object maybe the size of an aspirin at arms's length at 40 to 60 degrees from the top of the hill. I disregarded at first but pointed it out to the other driver muttering \"its kind of early for a star to be showing up\", and this not being my first unexplainable aerial object, I went about my business for a couple of minutes and noticed that the \"star\" had \"dropped\" a few degrees and it was then that I brought it to the drivers attention. As we were both watching it, it started moving, not in a quick flash or sudden motion, but in a smooth even acceleration towards the east until it just faded out of sight in the distance making no noise. I know that the horizon was fairly clear and the line of sight was about 75 to 100 miles toward Montana, as we were at 3,000 feet at the time on a hill in a wheat field with an unfettered view to the east. I asked him as the object faded from view \"did we just see a ufo\"? He replied, \"I have seen this type of activity before in this region as I was farming several years ago about 25 or 30 miles from here where I saw a stationary object drop out of sight\". As we watched this object we agreed that the object may have been moving 600 to 800 mph what with the perspective and angle that it traveled."],"Object Flight Path":"Hovering then path","Country":"United States","Object Shape":"Star-like","Disposition":"IFO","City":"Troy","Case Number":"31856","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Troy","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/31856.html.txt","/var/www/straped/mufon/org/31856.html"],"Log Number":"US-09162011-0019","Summary":"Dark yellow to amber, round, stationary.","Longitude":"-116.769602","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.736836,+-116.769602(31856)&iwloc=A&hl=en\"> mufon case (31856) map </A>","Region":"Idaho","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"08/29/2011 07:15 UTC"}