{"Case Number":"31864","Latitude":"41.696634","Longitude":"-73.890012","Country":"United States","Log Number":"US-09172011-0005","Date of the Event":"09/17/2011 02:30 UTC","trends":["There have been 14 other sightings in Poughkeepsie","There were no other sightings in Poughkeepsie on or around September 17th 2011"],"divs":["sighting detailsmy daughter and i were taking our dog out, before retiring for the night. i was pointing to the moon and showing her that the star to the right of the moon was on the left of the moon last evening. i was watching the sky as i told her that last evening there seemed to be crazy air traffic going on for about 2 hours, as i was saying this a huge white sphere with a beautiful blue halo \\ aura around it appeared suddenly, in fast decent at about a 45 degree angle. it appeared to be going to crash, i watched it disappear right into the trees of the mountain. i am a star\\ sky watcher and have seen comets and shooting stars many times, i had the feeling as i watched this that this craft was in trouble, and would crash. i waited and listened, but heard nothing. i watched for an explosion, none, i waited but never saw the craft leave the trees. my daughter and i told no one what we saw, as the night went on, i became very aware that i needed to tell someone what i saw. i realized even if the authorities found something they would just lie anyway. while lying in bed trying to put the event out of my thoughts, i realized i could tell people that don't lie, and want to tell the truth, so i called a number on the mufon web site, and told them my story. this is not my first sighting, but it is by far the most upsetting one, as i am sure the craft has crashed. for those of you who are asking the exact same question i would ask if i read this story, why didn't i go check it out? i live in the country, i am not familiar with that area of woodland, it was pitch black outside, cold and i am a middle aged woman. frankly i was afraid, and i didn't wish to scare my daughter anymore than she already was. i may go in the morning though."],"Object Flight Path":"Straight-line path","Weather Factors":"None","Source":"MUFON","Date Submitted":"09/17/2011 06:45 UTC","Object Features":"None, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.696634,+-73.890012(31864)&iwloc=A&hl=en\"> mufon case (31864) map </A>","Summary":"I watched a round white brightly lit object with a blue halo/ aura, rapidly descend into the trees, I would say it was traveling at aprox 50 60 mph. It never came out of the trees. int","files":["/var/www/straped/mufon/html2text/31864.html.txt","/var/www/straped/mufon/org/31864.html"],"City":"Poughkeepsie","Sighting Duration":"Undisclosed","Tags":"City","Region":"New York","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle","Disposition":"Unknown"}