{"City":"Lakewood","Date of the Event":"09/16/2011 09:00 UTC","Longitude":"-105.079313","Log Number":"US-09172011-0004","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Shape":"Circle","Object Features":"None","Summary":"A disappearing and reappearing orb","Source":"MUFON","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around September 16th 2011"],"Case Number":"31863","Date Submitted":"09/17/2011 02:38 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/31863.html.txt","/var/www/straped/mufon/org/31863.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.71116,+-105.079313(31863)&iwloc=A&hl=en\"> mufon case (31863) map </A>","Region":"Colorado","Latitude":"39.71116","Sighting Duration":"00:20:00","divs":["Sighting Details 9 PM First, I saw a bright white light streak across the sky. My Husband missed it and we argued the fact that it could have been a shooting star. I was very excited and sure it was something else. Later I decided to sit outside and watch the sky for a while. After about 10 mintues a bright orange light appeared. It looked like a planet or something, but it just APPEARED. I watched it thinking maybe it was hidden behind clouds before, but I couldn't see any close to it...soon it started flickering and disappeared! I knew I saw a ufo! I ran in to get the Hubby and I looked out the window and there it was again! This time RED and bigger!!! We rushed outside and looked at it thru binoculars and saw that it was not blinking like a plane, just pulsed. This time it was moving, very slowly south, as we noticed a plane pass it much faster. It again disappeared! My Husband went inside because his stomach was hurting so I ran to get my sister from next door. As soon as we came out it was back! And it was BRIGHT BRIGHT RED! My sister was like omg it really is a UFO!!! We watched it for about 3 minutes. It pulsed but stayed in one spot before it flickered and disappeared once again. It did not come back this time but My family and I are fully convinced of what we saw!"],"Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Disposition":"Unresolved"}