{"Summary":"Yellow-orange orb that ascended, and moved in a S-N direction for about 1 min. until it faded out of site.","Source":"MUFON","Longitude":"-81.442762","Log Number":"US-09172011-0002","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/31861.html.txt","/var/www/straped/mufon/org/31861.html"],"Weather Factors":"Does Not Apply","City":"Orlando","divs":["Sighting DetailsI was driving behind Royal Pacific Resort in Orlando, FL at 10:32 PM EST when I looked in a southerly direction. I noticed what looked like an orange glow ascend from above the hotel skyline. It almost looked like a shuttle launch, but I wasn't aware of Cape Canaveral launching any rockets this evening. I parked my vehicle and got outside. I watched as it ascended to a top-most vertical point and started to move horizontally in a south to north direction. It moved almost directly overhead. As I watched what was moving over me, it had what looked like a yellow center and had an orange glow. It was radiating almost like a bright light. It was moving slowly across the sky, much to slow to be a meteor. The movement was constant. It did not speed up or slow down. As it progressed in the northerly direction, its luminosity started to degrade until I couldn't see it anymore. The entire event lasted approximately 1 minute. The size of the object was approximately an aspirin if you were to hold one out at arms length looking toward the skyline. When it passed over me, the object looked to large to be a rocket moving overhead."],"Case Number":"31861","Country":"United States","Date Submitted":"09/17/2011 01:09 UTC","Object Features":"None","Latitude":"28.458789","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Disposition":"Unknown","Date of the Event":"09/16/2011 10:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.458789,+-81.442762(31861)&iwloc=A&hl=en\"> mufon case (31861) map </A>","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around September 16th 2011"],"Object Shape":"Circle, Sphere, Star-like","Region":"Florida"}