{"Viewing Distance":"20 Feet or Less","divs":["Sighting Details1, I was on my way home from work at 1-130 am. driving down country road with agravel pit on one side, and forest on the other.2, In my headlights, I saw something in the clearing between the forest and theroad.3, At first i thought it was a deer, I slowed down in case it started to runinto the road. As I got closer, I noticed it was walking on two legs.My first thought at this point was that there was a car accident from up ahead,and this person was looking for help.4, At first I was confused, an animal or personAs I approached and lowered my window, at this point I realized that it was nota person or animal I got goosebumps which lasted for about 30 seconds.5, It stood as high as a toyota civic, it had a very thin body, covered in awhite or semi- transparent material. Legs and arms very thin and long. The headwas slightly larger than a human, with black eyes, no nose, and a slit where themouth would be.It moved in an erratic manner as it entered the road, then it turned, saw me,and began walking toward my car with an almost spiderlike walk.When it got to within 5-7 feet on the drivers side, I got really spooked, anddrove away.6, I drove away, I kept thinking that there was a car accident ahead.There was nothing, and that is the time I realized that something really weirdwas happening.For the next week I had a hard time making a logical decision as to what I hadseen. I told my wife several days later, and she said that I had been actingdifferent."],"Disposition":"IFO","Object Shape":"Other","Object Flight Path":"Unknown","City":"Cary","Weather Factors":"Unknown","Case Number":"3186","trends":["There have been 7 other sightings in Cary","There were no other sightings in Cary on or around February 28th 1995"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/3186.html.txt","/var/www/straped/mufon/org/3186.html"],"Sighting Duration":"00:05:00","Log Number":"","Country":"United States","Object Features":"Undisclosed","Region":"Illinois","Longitude":"-88.238138","Date Submitted":"02/28/1995 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.211968,+-88.238138(3186)&iwloc=A&hl=en\"> mufon case (3186) map </A>","Summary":"strange person","Date of the Event":"02/28/1995 01:30 UTC","Latitude":"42.211968","Tags":"City"}