{"Object Shape":"Diamond, Teardrop","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/31878.html.txt","/var/www/straped/mufon/org/31878.html"],"Log Number":"US-09182011-0008","Disposition":"Unknown","divs":["Sighting DetailsI woke up exceptionally early at 4am. When I went outside I saw what appeared to be a huge star in the dark sky. It was way too big to be a star. Then I thought maybe it is that satelite that is supposed to fall. I realized it was getting bigger. It was in the eastern sky slightly to the south of the rising sun. I think it stayed rather stationary as it grew in size until it took off upward. Through binoculars it seemed transparent and then solid. I could see 2 or 3 pinpricks of light on it. These lights may have been moving. A small biplane entered this sector of the sky at about 5:30 am. It disappeared at about 6:30 to 6:45. Sorry wasn't watching the time when it left. It looked like an upside down teardrop or diamond. My Dad saw this too. I took a picture with my house in it for scale. It is not a good quality from my cell phone."],"Summary":"5am: Extremely bright diamond shaped blueish light. Thru binoculars I could see 2 pinpricks of even brighter light. I am not sure but they appeared to move occasionally. As it grew it the glowing got brighter and dimmer. 1/5 sz of moon.","Date Submitted":"09/18/2011 10:10 UTC","Latitude":"33.61875","Country":"United States","Region":"Arizona","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.61875,+-111.720058(31878)&iwloc=A&hl=en\"> mufon case (31878) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"31878","trends":["There have been 8 other sightings in Fountain Hills","There were no other sightings in Fountain Hills on or around September 18th 2011"],"City":"Fountain Hills","Object Flight Path":"Hovering then path","Date of the Event":"09/18/2011 05:59 UTC","Longitude":"-111.720058","Source":"MUFON"}