{"Summary":"Large bright red spere with a red aura that had a short taper to a pointed end. Appeared to be moving approximately 100MPH","Case Number":"31871","Tags":"City","Object Shape":"Sphere","Longitude":"-95.946356","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.42483,+-95.946356(31871)&iwloc=A&hl=en\"> mufon case (31871) map </A>","files":["/var/www/straped/mufon/html2text/31871.html.txt","/var/www/straped/mufon/org/31871.html"],"Date Submitted":"09/18/2011 12:43 UTC","Date of the Event":"09/17/2011 08:28 UTC","Source":"MUFON","divs":["Sighting DetailsSept 17, 20011 I was sitting on the Fannindel gym parking lot waiting for my grandson to come out from a dance when I saw a bright red ball in the sky. It was at 8:28 PM. I got out of my pickup to better observe it and to be sure it was not a reflection from the glass. It was moving from a southly direction, slighly nnw and curved to about due north. There were some high thin clouds and it was below the clouds. It appeared to be moving at about 100 MPH. As I was watching it my grandson came out and I pointed at it and he saw it and started yelling \"What is it?\" I watched it for about five minutes as it slowly disappearded to the north in the general direction of Bonham, Texas. I did not hear any sounds and there was no wind at the time. This thing was very large, I would guess at least 300 feet in diameter and a very bright red with a fainter red aura that tapered into a short point. The tail was short, about one third the diameter of the sphere. The aura appeared to be about one fourth larger than the sphere or about 350 to 375 feet in diameter not counting the short taper. The sphere had a definate outline and looked to be solid and glowing. It is difficult to say how high it was, but it appeared to be about 5,000 ft. or a little less."],"City":"Ladonia","Log Number":"US-09182011-0001","Viewing Distance":"Unknown","trends":["There have been no other sightings in Ladonia","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Region":"Texas","Disposition":"IFO","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"33.42483"}