{"Disposition":"IFO","Sighting Duration":"Undisclosed","trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around September 17th 2011"],"Date of the Event":"09/17/2011 09:10 UTC","Longitude":"-80.110991","Country":"United States","files":["/var/www/straped/mufon/html2text/31870.html.txt","/var/www/straped/mufon/org/31870.html"],"Summary":"It was an orange light, moved appx. west the light faded slightly, then it vanished","Object Features":"None","Object Shape":"Circle","Source":"MUFON","Latitude":"42.118257","Log Number":"US-09172011-0010","divs":["sighting detailsit was approximately 9-910pm. my neighbor and his friend knocked on my door and started to tell me about these abnormal lights they saw in the sky. then we saw one orangeish light in the sky. it was north\\north west from my house, so it appeared to be above lake erie. the light was visible for about a minute. it appeared to be moving west(left in the sky) slightly, the light started to fade a little bit, then competely dissappeared. during this time the light moved up and down slightly. the light was orange, but didn't appear to be a fireball. it was not making any sounds that we could hear. my neighbor and his friend then told me that maybe 4-5 minutes before, they steped outside thier house to smoke. they saw 6 orange lights (like the one i saw). the lights appeared to be north\\north west (again appearing to be above lake erie) they ran into their front yard to get a better look. the six lights appeared to be in some sort of formation, moving together. during this time multipe car alarms in our neighbor hood alarmed (i heard these while i was inside my house) the car alarms were on different streets. after about a minute or two, they came and knocked on my door, that is when i saw the one light i previously mentioned. when i first saw the object, i wasn't sure what it was, planes usually appear higher in the sky. also i've never seen a plane with an orange light like that. i really couldn't think of any logical explanations, especially after the story my neighbor and his friend told me of seeing six lights. we all found it to be slightly odd that there were a number of car alarms that had gone off as well. i have no clue what it was, but it was definitly out of the ordinary."],"Date Submitted":"09/17/2011 11:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.118257,+-80.110991(31870)&iwloc=A&hl=en\"> mufon case (31870) map </A>","Object Flight Path":"Path with directional change","City":"Erie","Case Number":"31870","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Tags":"City","Region":"Pennsylvania"}