{"Sighting Duration":"01:59:00","Summary":"UFO following plane near OHare Airport","Disposition":"Unknown","Case Number":"3187","Region":"Illinois","files":["/var/www/straped/mufon/html2text/3187.html.txt","/var/www/straped/mufon/org/3187.html"],"Latitude":"42.066417","Source":"MUFON","Tags":"City","City":"Mt Prospect","Object Shape":"Undisclosed","Date Submitted":"08/11/2004 03:00 UTC","Viewing Distance":"Over One Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.066417,+-87.937291(3187)&iwloc=A&hl=en\"> mufon case (3187) map </A>","Date of the Event":"08/11/2004 03:00 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There have been no other sightings in Mt Prospect","This sighting has never been favorited."],"divs":["Sighting DetailsI saw a pin point object following closly behind a large commercial aircraft tothe south. The object slowly pulled up next to the aircraft, briefly disappeardand reappered, then pulled infront of and to the side of the aircraft. Theaircraft soon after turned south and the object disapeared completely. When theobject first disappeared and reappeared it was for about one second and wentinvisable to visable like turning off and on a light switch. My first thoughtwas that it was being followed by a military jet, but compairing size, it wouldhave been the size of a small car, and no military craft I know is that small. The object and the aircraft were seen SSE to South of my location in Mt.Prospect, IL, which would put it just north of OHare which is 5 miles south ofme. I estimate the elevation of both objects to be between 7,000 and 11,000feet and proximity to each other was within 300 feet. The commercial aircraftdid not seem to try to avoid the object. It did bank to the south but it didnot seem out of the ordinary, only as if it was in a holding pattern, turning tomake an approach, or changing direction after reaching altitude towards itsdestination."],"Longitude":"-87.937291","Log Number":"","Object Features":"Undisclosed"}