{"divs":["Sighting DetailsI was inside our house watching the ABC Friday Night Movie (one of the Pink Panther movies). I was going on 13 years old at the time. I noticed some commotion from other family members going in and out the front door. The other family members were my grandmother, my mother, and two of my brothers. I asked what was going on. They said there was a UFO down the street. I went outside with them and saw a disk-shaped object with lights hovering over a house 3 or 4 hundred yards down the street. The object was approximately 40 or 50 feet in the air. There were 10 or 12 white lights rotating at its perimeter, in what I remember to be a counter-clockwise direction as seen from below. I couldn't tell if the entire object was rotating or just the lights. At the time, I believe we all assumed that it was just the lights. There was one red light on the top. The red light made it look as though it were trying mimic a water tower. The object was otherwise completely dark, and only visible as a blackness blotting out the ambient city lights of Dallas which cast a white haze in the sky. As soon as we all got outside, the object started moving up the street toward us. It move at about 5 miles an hour directly over the street. As soon as it came to the front of our house it stopped. There was no noise or wind. The rest of the neighborhood was very quiet and no cars drove by. My oldest brother just kept saying, \"A real UFO, a real UFO.\" None of us seemed frightened or overly excited. I remember looking at the two bedroom house across the street and thinking that the UFO was the same size as that house. I remembered a portion of the book \"Chariots of the Gods\" which I had read. It said that an old man regrew new teeth after having worn dentures after an encounter with a UFO. I decided to try to communicate a message to the object or its inhabitants, asking if they could help my grandmother with her arthritis, which had confined her to a wheelchair. After few seconds, my other brother said he was going to call the police. We were all standing in the area near the front door. I wanted to walk out to the driveway, but thought it might be dangerous. My brother and I started to get excited. I ran upstairs to see if I could find the camera. As soon as I got to my parents closet, I realized that the camera probably didn't have film, plus I didn't want to be there by myself. I ran back downstairs and outside where they were still watching it. My brother and I then ran in and got on the phone to call the police. Somebody said that it was moving away. I went outside and saw that it had started moving up the street, continuing in the same direction as it had. It veered slightly to the south (no longer directly over the street) and went out of view behind the houses at the top of the street. Half and hour or so later, a police officer from the Richardson Police Department came to our house and took our very strange statement. The next night we observed it again, only now it was about 2 miles to the south and perhaps 2,000 or 3,000 feet in the air. A small aircraft seemed to be attempting to get close to it, but the object continually moved away. As I remember, both the object and the aircraft moved further to the south until I could no longer see them. I have a follow-up incident which occurred exactly 11 years later, which I will document on this site within the next week or so."],"Latitude":"32.940209","City":"Richardson","Object Flight Path":"Path then hovering","Date of the Event":"09/23/1977 09:00 UTC","Date Submitted":"09/18/2011 02:10 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/31872.html.txt","/var/www/straped/mufon/org/31872.html"],"Country":"United States","trends":["There have been 10 other sightings in Richardson","There were no other sightings in Richardson on or around September 23rd 1977"],"Weather Factors":"Unknown","Log Number":"US-09182011-0002","Case Number":"31872","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.940209,+-96.692398(31872)&iwloc=A&hl=en\"> mufon case (31872) map </A>","Object Shape":"Disc","Viewing Distance":"21-100 Feet","Object Features":"None","Disposition":"Unknown","Region":"Texas","Summary":"disk-shaped with 10-12 round white lights rotating on the perimeter and one small red light on top","Sighting Duration":"00:05:00","Longitude":"-96.692398"}