{"Date Submitted":"09/18/2011 06:32 UTC","Object Flight Path":"Stationary,Other,Unknown","trends":["There have been 11 other sightings in Newark","There were no other sightings in Newark on or around September 1st 2011"],"files":["/var/www/straped/mufon/html2text/31889.html.txt","/var/www/straped/mufon/org/31889.html"],"Country":"United States","Sighting Duration":"12:59:59","Latitude":"39.691613","City":"Newark","Case Number":"31889","Summary":"a bright random multi colored pulsing starlike big dot mid sky","Object Features":"Unknown","Region":"Delaware","Disposition":"Insufficient Data","Viewing Distance":"Over One Mile","Object Shape":"Circle, Sphere, Star-like","Longitude":"-75.747887","Source":"MUFON","divs":["Sighting Detailsit sends chills throughout my entire body to even think about it now. the strangest thing is this is not a one time incident. every night i go onto my balcony to smoke. i usually smoke anywhere from 3 to 5 cigarettes throughout the night while looking up at the stars. i have a pretty good starmap in my head so at any given time i am looking at big dipper and other star formations. it started a couple of weeks ago i started seeing this star-like light flickering in the night sky. it just appears like someone flicked on a lamp. i have tried cameras and binoculars to try and see the object in more detail but they lack the magnification to see better. the best sightings of it are with my own eyes. when i saw it the first time i immediately went thru my checklist. not a plane. not a helicopter. not a airport tower or a high rise building. what could it be then? so i start thinking even harder at the things Ive heard such as high intensity flares weather balloon Chinese lanterns and non of them make sense. if someone was to tell me it was one of these things i would be extremely offended sad even that someone would try and insult my intelligence in that way. i have seen it off and on since the first time and i have even got some of my friends to make sure im not a lunatic and tell me they see it as well. we speculate as to what it could possibly be but have still not been able to figure it out. it is sometimes brighter and more random flashing of beautiful colors the bluest of blues and the most purplest purples i or my buddy has ever seen. not knowing what it is is really bothersome. i know this sounds weird but i had a sort of intimate moment with the object the other night. i sat by myself it was around 2am i was smoking my last cigarette of the night and staring at the star-like object as i have done for about a week or so previous when i sort of felt like it knew {even from as far away as this thing was} that i was watching it. i felt an overwhelming urge to stare at it i felt like a moth. i COULD NOT look away. more like i didnt want to look at anything else in the world ever i only wanted to look at this flickering. i went thru two emotions at that point scared goosebumps followed by immediate relief as if i saw an old relative friend or pet. i actually had tears swell in my eyes but not bad or sad but really happy? like i always knew the possibility of life but at that moment i knew in my heart and soul what i was seeing and feeling was real. no one can tell me otherwise. when you know something and you can feel it.. an epiphany is the best way to describe it like i suddenly realized that i was staring into something different then anything else. i also saw it moving in very small almost nothing zig zags and there was at one point something smaller that came out of it an sped around a bit. looked similar to a bat flying around at night barely any light barely visible but very agile and without a doubt there... i have to say most people would be scared of being labeled or being told they are lying but i am not. i know what i saw and continue to see. the last time i saw it was last night after 10pm before 2am."],"Log Number":"US-09182011-0018","Tags":"City","Date of the Event":"09/01/2011 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.691613,+-75.747887(31889)&iwloc=A&hl=en\"> mufon case (31889) map </A>","Weather Factors":"Unknown"}