{"City":"Burgas","Summary":"2 red lights stationary close together diamond or rectangle shape flashing together in fluttery ways then seperating into small white lights and moving across the sky in opposite directions miles apart until fading into nothing","Sighting Duration":"00:05:00","Object Flight Path":"Stationary,Other","Case Number":"31887","Log Number":"BG-09182011-0016","Tags":"City","Object Shape":"Flash, Square, Rectagular, Star-like, Unknown","divs":["Sighting DetailsOn Sunday 31st July i saw something in the night sky that was quite simply ... stunning ! I was stood on a balcony in a small rural village near the east coast of Bulgaria in the 'Yambol' region. It was 12:30 at night and i was on my own after my friend had just left me about 20 minutes before. I love sitting on the balcony and watching the sky, its perfectly clear with not many street lights and no big cities or towns near by to pollute the sky with lighting or smog. I turned around to get something from the house and as i turned back round to continue my enjoyment of the night sky i saw two red vertical lights, about twice as big as a typical plane in the sky at night, slightly diamond in shape, next to each other and they were flashing in sequence, one after the other. They were in the distance, and could have been on the coast above the city of Burgas, as the city is only a two hour drive away to the east, but far enough away as to not see its glow or lights. Between Yambol and Burgas its mostly small villages and forest. One light would flash then the other would flash quite quickly, the lights also had a tinge of blue in them when they flashed, the flashing wasnt like a plane light ( slow and continuous ) it had a kind of fluttery sparkle to it. The lights ( for a moment ) were stationary. I became absolutely transfixed on the lights knowing full well that this wasnt turning out to be something i typically saw in the sky, a total feeling of awe and excitement came over me. The lights were stationary for only a few seconds and then, the two lights began to seperate sideways. One would flash then move left then the other would flash and move right, when they began to move they were no longer red, elongated and diamond in shape, they were small and yellow white in colour. They became further and further apart and gradually fading out of sight after the light on the left had practically crossed the whole of the sky and faded to nothing. the whole sighting lasted about 2 to 5 minutes, i had my camera within reach, but to be honest i knew that if i had tried to photograph the lights after they had seperated there wouldnt have been much to see on camera and i would have missed much of my sighting while messing with the camera and the settings. so .. the best thing i thought of at the time was to call my girlfriend during the sighting, who was back home in England, and tell her what i was seeing 'live' on the phone. I spend much time watching the sky, i see planes, satelites, strange glows of the moon through the clouds, chinese lanterns and everything else, and i can always explain something i see in the sky, however this was definitely something different. It was something technological and unlike anything i have ever seen."],"Country":"Bulgaria","Object Features":"Other","Longitude":"27.479315","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31887.html.txt","/var/www/straped/mufon/org/31887.html"],"Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Date Submitted":"09/18/2011 05:10 UTC","Region":"Burgas","trends":["There has been one other sighting in Burgas","There was one other sighting in Burgas on or around July 31st 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.505288,+27.479315(31887)&iwloc=A&hl=en\"> mufon case (31887) map </A>","Date of the Event":"07/31/2011 12:00 UTC","Disposition":"Unresolved","Latitude":"42.505288"}