{"Tags":"City","divs":["Sighting DetailsLast night about 8:35 p.m. I went on the back of the boat we live on and noticed an extremely bright,red object in the sky moving from east to west over the gulf. I called my Paul out to see it, as well. We have a lot of air traffic over us (middle of the Florida Keys) and I know it was not an airplane...it had no blinking lights and appeared to be large and EXTREMELY bright. Paul suggested that if you put a glowing cigarette up in the sky at arm's length it was almost that big. We both watched it as it flowed slowly though the sky from east to west, a couple of minutes perhaps. It slightly veered off of a straight line...like a plane would...but then just disappeared. According to the compass in my iphone it was at about 38 degrees NE, about 20ish degrees above the horizon. There were no clouds to speak of in the area, save directly north out on the gulf closer to the Everglades. Living on a boat as we do we check the radar often. Just before this thing disappeared it appeared to \"fade\" just a bit in the front and then \"poof\" was gone! We sat on the back of the boat for quite some time after that scouring the sky to see if it came back out from anywhere and not a thing. Thinking perhaps there was a cloud it might have gone behind we watched for that, too. No clouds there. I have seen many unusual things in the sky but this one was glowing RED which is different from any others. It wasn't \"white-hot\" white. This sounds funny but I was almost drawn to watching it and to look up at that time which may be why I called my Paul to see it too. We will be on the back of the boat tonight just in case they are still hanging around cruising our waters. We are a \"mature\" couple and not given to being aroused or frightened easily. This one has me stumped. As opposed to being just a random entry in your data base, if you have any light that you can shed on this I will certainly appreciate any feedback you might offer. I will keep you informed of any further findings. Thank you for the work you do."],"Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 13 other sightings in Marathon","There were no other sightings in Marathon on or around September 17th 2011"],"Longitude":"-81.056759","Case Number":"31885","map":"<A HREF = \"http://maps.google.com/maps?q=24.718211,+-81.056759(31885)&iwloc=A&hl=en\"> mufon case (31885) map </A>","Disposition":"Insufficient Data","City":"Marathon","Object Shape":"Unknown","Country":"United States","Date Submitted":"09/18/2011 05:00 UTC","Sighting Duration":"Undisclosed","Summary":"Brilliantly red glowing object moving slowly in sky then disappears","files":["/var/www/straped/mufon/html2text/31885.html.txt","/var/www/straped/mufon/org/31885.html"],"Latitude":"24.718211","Log Number":"US-09182011-0014","Object Features":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Region":"Florida","Date of the Event":"09/17/2011 08:35 UTC"}