{"Source":"MUFON","Date Submitted":"09/19/2011 12:09 UTC","Date of the Event":"09/16/2011 10:04 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"New York","Object Shape":"Other","trends":["There have been 19 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around September 16th 2011"],"Object Features":"Undisclosed","Weather Factors":"Unknown","City":"Niagara Falls","map":"<A HREF = \"http://maps.google.com/maps?q=43.100664,+-79.031149(31899)&iwloc=A&hl=en\"> mufon case (31899) map </A>","Disposition":"Unresolved","Latitude":"43.100664","divs":["Sighting DetailsIt was a clear night, and I had a feeling that I would be able to see all the stars and maybe something more. I watched outside from the front of the house in the street. I saw a bright white light moving quickly across the sky,with absolution there was no sound, so I went inside to grab my camera. When I came back out, I didn't see anything out of the ordinary again, but I stayed outside for approx 20 minutes to make sure. I came into the house to warm up a bit and decided to go outside on the back porch to check out the stars and the sky again, just to be sure. I was out back approx 3 minutes when I looked over my head, like I always do when looking for stars in the night sky, and saw a slower moving UFO, whisper quiet or NO SOUND at all, In the shape of a 'V', with the nose of it being the converging point of both sides, or an upside down 'V', with multiple bright white lights scattered all over the bottom of the craft, flying southwest. I yelled for my husband and continued watching the UFO move in a southwest direction for about 40 or 50 seconds. And then, It just seamed to converge into one main round light before it just ''took off at the speed of light''. The Craft or UFO didn't appear to have the standard defined Hull to it. It was just gone after that, and no matter how long I stood outside, it just didn't re-appear. It was strange that after the event I saw a larger number of airplanes and helicopters in the air that I have ever seen in our area, especially at approx 10:00, 10:30ish p.m., as well as for a while afterwards. This was the most amazing specimen of a UFO that I have seen to date! And I have seen at least 5 UFO's in the last 20 years. This one was different than the others, in shape, size, color & light color. It almost reminded me of a stealth bomber, but from where I was it had passed just to the left of the big dipper and it was at least the size or larger than the constellation of the big dipper! I wish I had just turned on the video portion of my camera to capture it, but I was in such astonishment and didn't want to take my eyes off of it, because this is a once in a lifetime experience, for some, and I didn't want to miss a thing! I had an experience this past summer where it was extremely quiet, clear and perfect summer night. No rain for almost a week before, and no rain for almost a week after, and very low humidity with consistent temperatures. At around 3a.m. on a weekday, I was in the restroom with the lights off and windows wide open, when all of a sudden an extremely bright white flash of light came from nowhere! I sat in awe for a few moments almost unable to move. I looked out the windows and didn't see a thing, or hear anything for that matter. To this day I am still trying to figure it all out, but now I believe it was a UFO. I know one thing is for sure, I will be watching the sky more often, and with my camera in tow! I am wondering if anyone else saw this, especially in my area!? Don't be afraid to say so, this can be done anonymously. Thank you all for listening and reading my story! Good luck to you all!"],"Object Flight Path":"Straight-line path","Case Number":"31899","Tags":"City","Longitude":"-79.031149","Log Number":"US-09192011-0001","Country":"United States","files":["/var/www/straped/mufon/html2text/31899.html.txt","/var/www/straped/mufon/org/31899.html"],"Summary":"I saw V shaped UFO flying overhead and watched as it just ''took off'' & disappeared in seconds!"}