{"Date Submitted":"09/18/2011 11:14 UTC","City":"Amite City","Weather Factors":"None","Object Shape":"Star-like","Date of the Event":"09/16/2011 08:30 UTC","Log Number":"US-09182011-0026","Country":"United States","Summary":"Light in the southeast sky materialized and moved to southeast followed by 2 other objescts.","Case Number":"31897","divs":["Sighting DetailsAt approximately 8:30PM on September 16, 2011 a couple of miles outside of Amite, LA as I looked toward the southwest sky a bright light caught my eye about 50 degrees above the horizon to the southeast. I quickly glanced over to find it getting brighter until the light faded slightly and proceeded to move about 10 degrees to the southeast before dissapearing,I then observed another faint object moving from the other way that materialized from the same area the initial object dissapeared. This second object was followed by another object that took roughly the same path as the first object. The duration of the event took about 30 seconds in all. My girlfriend witnessed the event as well and claims she saw the first object avoid something but i cannot confirn since i didn't see it. I am an amateur astronomer with 14 years experience and an avaiation enthusiast so I am well versed in sky phenomena and general operations of aircraft especially in my area. Immediately following the event i checked the tracks of many satellites including the International Space Station which was the only explanation i could possibly think of but none were in the area. In my opinion the objects were moving to slow to be a satellite, I have often observed them in my countless night outside with my telescope. Ive always been on the fence about wether I believe or not but Im convinced now, Ive been looking at the sky nightly for 14 years and Ive never seen anything like this. At first it frightened me a bit because it appeared as if it was only gonna get bigger but that later turned to excitement when i reallized what i had just seen."],"trends":["There have been no other sightings in Amite City","This sighting has never been favorited."],"Region":"Louisiana","Latitude":"30.728611","Object Features":"Unknown","Longitude":"-90.508611","files":["/var/www/straped/mufon/html2text/31897.html.txt","/var/www/straped/mufon/org/31897.html"],"Object Flight Path":"Hovering then path","Disposition":"Unknown","Source":"MUFON","Sighting Duration":"00:00:30","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.728611,+-90.508611(31897)&iwloc=A&hl=en\"> mufon case (31897) map </A>","Tags":"City"}