{"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around September 17th 2011","This sighting has never been favorited.",""],"Longitude":"-106.57791","Log Number":"US-09182011-0019","Viewing Distance":"Over One Mile","Object Shape":"Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=35.202635,+-106.57791(31890)&iwloc=A&hl=en\"> mufon case (31890) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Date of the Event":"09/17/2011 07:30 UTC","Region":"New Mexico","City":"Albuquerque","Case Number":"31890","Weather Factors":"Unknown","Date Submitted":"09/18/2011 06:52 UTC","Latitude":"35.202635","Summary":"Re Submission 31875 Las Cruces NM - saw it from Placitas NM photo attached","Source":"MUFON","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/31890.html.txt","/var/www/straped/mufon/more/31890_submitter_file1__Sept1811001.JPG","/var/www/straped/mufon/org/31890.html"],"Disposition":"IFO","Sighting Duration":"Undisclosed","divs":["Sighting DetailsYesterday evening, I was riding my bike near the BLM land in north eastern Placitas, facing south, admiring the beautifully colored pink clouds surrounding the east and south Sandia Mountains when an unusual light abruptly came on just west of the mtn range. Unusual insofar it had a bluish tint to it and was brighter than a star. I kept my eyes on it as I rode home hoping whatever it was stayed around for me to look at it with my binoculars. Well, through the large 20x80 binoculars I have, the light appeared to be a weather balloon made of the most beautiful white gossimer material I've ever seen, with what appeared to be a rope dropping down from the balloon equal to a third the size of the balloon; no balloon \"basket\" was visible. However, when I got my 14mg pixel camera with 5X zoom out, only an orb appeared in the visual. I figured when enlarged, the photo would show the tear-drop shape of the balloon, but it doesn't (see attachment). As described by the Las Cruces viewer, I too watched it turn pink then red and when it got dark, I could no longer see it. So was it an orb disquised as a ballon, or merely a weather balloon? Perhaps someone else from the area has a photo taken closer than mine. For the record I estimate it was about 5 miles south of me and just a few miles north of the Sandia Casino Resort and should have been visible to a large number of people driving on I-25 corridor between Santa Fe and Albuquerque. I apologize for not including the mountains in my photo, as I was focusing solely on the \"balloon.\""],"Tags":"City"}