{"Sighting Duration":"Undisclosed","Region":"Idaho","Country":"United States","Date of the Event":"04/25/2011 12:00 UTC","Log Number":"US-09192011-0005","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/31905.html.txt","/var/www/straped/mufon/more/31905_submitter_file1__ufotrajectory2.jpg","/var/www/straped/mufon/org/31905.html"],"Latitude":"47.679843","divs":["Sighting DetailsI went out on the deck at about 2 AM for a cigarette, and just mentally registered \"green\" and thought somebody must be doing fireworks. But I hadn't heard anything, which seemed a little strange because normally we can hear the pop sound when they are set off. We live by a lake and people are always doing fireworks at all sorts of strange times, so I didn't actually look at it until I got my cigarette and sat down. Then I realized it wasn't fireworks, but a neon green upside down Arial font U, about aspirin sized from my vantage point. While I was watching, it moved fairly slowly in an approximately 30 degree arc from south to north (maybe SE to NW), and then instantly was gone. It didn't pulsate, didn't glow, didn't have a tail, didn't fade out, it was just a neon green upside down U that moved across the sky and then instantly wasn't there. I actually watched it for about 30 seconds, but it was there when I first came out, and I have no idea how long it was there before that. As I was watching I wasn't frightened, I was thinking this is very, very weird, and is the kind of thing people call the police about. And I wondered what I could possibly tell them if I did call - I saw a neon green upside down U that disappeared? I didn't call. I did look in the newspaper for any reports, but there were none. The next day I went out and took a photo so I can mark exactly where I saw it. I finally decided I had to report it to somebody, just to get it on record. The photo was taken the next day and the two green Us show where I first began watching, on the left, and where it disappeared, on the right."],"Viewing Distance":"Unknown","trends":["There have been 19 other sightings in Coeur d'Alene","There were no other sightings in Coeur d'Alene on or around April 25th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-116.773676","Case Number":"31905","Weather Factors":"Unknown","Tags":"City","Object Features":"None","Date Submitted":"09/19/2011 02:51 UTC","Disposition":"IFO","Summary":"Bright neon green upside down u shaped thing in the sky, remained a steady green without pulsating. No glow, no tail, moved in an arc and then vanished instantly. Did not fade out.","City":"Coeur d'Alene","map":"<A HREF = \"http://maps.google.com/maps?q=47.679843,+-116.773676(31905)&iwloc=A&hl=en\"> mufon case (31905) map </A>"}