{"Object Shape":"Cylinder, Triangle","Disposition":"Unresolved","City":"Normal","Date of the Event":"09/17/2011 08:15 UTC","Tags":"City","Longitude":"-88.99915","Object Features":"Other","Case Number":"31907","Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Normal","There were no other sightings in Normal on or around September 17th 2011","This sighting has never been favorited.",""],"Date Submitted":"09/19/2011 03:25 UTC","Region":"Illinois","Log Number":"US-09192011-0006","Latitude":"40.529628","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.529628,+-88.99915(31907)&iwloc=A&hl=en\"> mufon case (31907) map </A>","divs":["sighting detailsi had just gotten home from work about 8:15pm, gotten out of my car to walk across the parking lot. i was looking north when i saw an object with many lights in the sky and seem to strobe about every 20 seconds or so. to me the object had a main cylinder body and two v shaped wings with white lights running along the sides of the v's and possibly on the main body as well. it would pulsate\\strobe as well. i don't recall hearing anything but traffic noise from the road nearby. the object flew over a apartment complex just north of where i live and the area is well light. it is not a usual flight path for planes to come into the airport. i actually thought it was a plane with landing lights on but after looking at it again i noticed all the lights. i could not make out any color on the object-it was a black silhouette. the object flew west\\northwest over the trees and pulsated one last time before i lost sight of it. i just felt curiosity of what i was seeing at the time."],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/31907.html.txt","/var/www/straped/mufon/more/31907_submitter_file1__IMG.jpg","/var/www/straped/mufon/org/31907.html"],"Sighting Duration":"Undisclosed","Summary":"Unusual flying object","Country":"United States"}