{"Region":"Missouri","Latitude":"40.357492","map":"<A HREF = \"http://maps.google.com/maps?q=40.357492,+-94.869934(31917)&iwloc=A&hl=en\"> mufon case (31917) map </A>","Disposition":"Unknown","Weather Factors":"None","Log Number":"US-09192011-0017","Date of the Event":"09/10/2011 09:15 UTC","Object Shape":"Oval","Longitude":"-94.869934","trends":["There have been 2 other sightings in Maryville","There were no other sightings in Maryville on or around September 10th 2011"],"Tags":"City","City":"Maryville","files":["/var/www/straped/mufon/html2text/31917.html.txt","/var/www/straped/mufon/org/31917.html"],"Sighting Duration":"00:05:00","Object Flight Path":"Stationary","Country":"United States","Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsAfter putting the children to bed I went out to look at the stars. Our street lights were all out because of a severe hailstorm so the night sky was much more visible than usual. I had only been out for a minute when I noticed a bright light to the northeast about 45 degrees above the horizon. It was orange with slightly silver edge around it. At first I thought it was a star because it had a twinkling effect to it but it was too large and too bright. Then I thought of an airplane because of the two colors and the slightly ovoid shape... but the lights didn't blink and the whole thing was orange. Venus became visible just a about 30 degrees south and I noticed it was about the same brightness and 2-3 times larger. while it was stationary for 2-3 minutes it did begin to rise slowly... about 5 degrees higher before it seemed to just fade into the distance. It seemed that the light was either moving directly away from me or it faded out while shrinking. There were no observable effects or sounds that I associated with it and was otherwise unremarkable. I could not tell how large it was or whether it was astronomical or atmospheric... there were no clouds, planes, or stars visible near it at the time. Size and altitude were indeterminable."],"Case Number":"31917","Summary":"An orange light in the northeastern sky at dusk just before the stars came out, hovered for a while before rising slowly and disappearing","Date Submitted":"09/19/2011 11:05 UTC"}