{"map":"<A HREF = \"http://maps.google.com/maps?q=42.02473,+-93.615982(31919)&iwloc=A&hl=en\"> mufon case (31919) map </A>","Tags":"City","Latitude":"42.02473","Object Shape":"Blimp, Other","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 9 other sightings in Ames","There were no other sightings in Ames on or around September 9th 2011"],"Viewing Distance":"21-100 Feet","Country":"United States","Log Number":"US-09192011-0019","Summary":"on Hwy30 north of Ames huge black ufo with lights slowed down above cars","Weather Factors":"None","Region":"Iowa","Sighting Duration":"Undisclosed","Date Submitted":"09/19/2011 11:19 UTC","Longitude":"-93.615982","Object Features":"Patterned Surface","Case Number":"31919","Date of the Event":"09/09/2011 03:29 UTC","Source":"MUFON","divs":["sighting detailsdriving thru the night from sioux falls sd to tama iowa. around 3:30 am i was behind a truck towing a trailer, suddenly a huge whump whump whump from the sky made me look up. a huge black object with white dashes of lights appeared - the sound made it seem like the object was braking before hitting the earth. the black object against the black sky immediately made me think it was a ufo. the vehicle in front of me swerved back and forth on the highway - finally pulling over. when i first heard the noise - i tried to wake up my passenger - but he would not wake up. i pounded on his arm and screamed his name and he would not wake up. the object hovered above the highway for a moment and then ascended back into the sky from my perspective in a straight up heading just to left of my view. the object filled 1\\4 of the sky - maybe it was 50-100 feet above us. i thought oh no - not again! i admit i was afraid because i could not wake the person with me. a friend said it was probably a black helicopter - but aside from the fact it was way too big for any helicopter i have seen, the whump sound only came when it appeared to brake above us , and then the abrupt direction change was not accompanied by sound and it zipped straight up out of sight - admittedly - it was black but it also had white dashed lights along a varied surface bottom."],"files":["/var/www/straped/mufon/html2text/31919.html.txt","/var/www/straped/mufon/org/31919.html"],"City":"Ames","Disposition":"Unknown"}