{"Longitude":"-106.690094","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around August 28th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Case Number":"31915","Country":"United States","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/31915.html.txt","/var/www/straped/mufon/more/31915_submitter_file1__ufo1.JPG","/var/www/straped/mufon/more/31915_submitter_file2__ufo3.JPG","/var/www/straped/mufon/more/31915_submitter_file3__ufo4.JPG","/var/www/straped/mufon/org/31915.html"],"Disposition":"IFO","Sighting Duration":"Undisclosed","Region":"New Mexico","Tags":"City","Log Number":"US-09192011-0015","Source":"MUFON","Summary":"Saw something hovering in the sky then it disappeared.","Viewing Distance":"Over One Mile","Object Shape":"Oval","City":"Albuquerque","Latitude":"35.171484","Date of the Event":"08/28/2008 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"09/19/2011 10:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.171484,+-106.690094(31915)&iwloc=A&hl=en\"> mufon case (31915) map </A>","divs":["Sighting DetailsWas at my computer in my home office at the front of the house. My two dogs were sitting in the window looking outside. Suddenly my female dog started howling & when I turned my head to look at them, they were both looking towards the sky. I got up from my chair, looked out the window in the direction they were staring and saw a shiny object. At first I thought it might be a weather balloon because this IS Albuquerque and it looked like it was kind of in the direction of Kirtland AB, but then suddenly the hair stood up on my head, neck & arms because it disappeared & reappeared nanoseconds later. I grabbed my camera & took the first shot thru my window & screen. It looked big but my little Nikon couldn't capture what I saw. So I went to put on my shoes to go outside for a better shot and realized my dogs had run to one of the bedrooms, jumped on the bed, and the female was still howling. When I went outside to the front of my house, it was still there so I took the second shot & almost immediately took the third shot. But as I clicked it the second time, I didn't see anything in the viewfinder at the time so I thought I missed the third shot. I lowered the camera and scanned the sky for the object but it was gone. As you can see, it was a clear morning in Albuquerque. When I downloaded my pics a few hours later, I saw that indeed I had caught the third shot. The camera time says 12:52 pm but it was really more like around 6:45-7:00 in the morning when the photos were taken."]}