{"Date Submitted":"09/19/2011 10:35 UTC","trends":["There have been no other sightings in Meadow Bridge","This sighting has never been favorited."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.860461,+-80.895158(31913)&iwloc=A&hl=en\"> mufon case (31913) map </A>","Object Shape":"Fireball","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet","Log Number":"US-09192011-0013","files":["/var/www/straped/mufon/html2text/31913.html.txt","/var/www/straped/mufon/org/31913.html"],"Object Flight Path":"Hovering then path","Tags":"City","Object Features":"Unknown","Weather Factors":"Unknown","Region":"West Virginia","Date of the Event":"06/17/1995 12:00 UTC","Longitude":"-80.895158","Sighting Duration":"Undisclosed","Latitude":"37.860461","divs":["Sighting DetailsIt was a seemingly normal summer night in June of 1995. My oldest brother (18 years old) was driving me (13 years old), my middle brother (16 years old), and my middle brother's girlfriend (17 years old) home from seeing Batman Forever at the movie theater. Honestly, looking back, the only thing abnormal about the night was the abundance of lightning in the sky. We all noticed that and commented on the fact we were having a lot of \"dry lightning\" that night. In fact, it was so intense that we stopped at the local cemetery and turned off the headlights and watched the sky light up almost constantly. I believe we sat there for a few moments and reminisced about old ghost stories we had heard growing up before heading out to continue the trip to take my brother's girlfriend home. It was close to midnight. After driving across the mountains and after dropping my brother's girlfriend off at her house, we began our journey home. Still, the lightning was flashing continuously...but we thought nothing of it. It wasn't until we were driving down the largest mountain we crossed that we spotted something in the sky that appeared to be the moon at first glance--it was circular in shape and gave off light. However, the only reason we knew it wasn't the moon is because we could see it better when the lightning flashed and further illuminated the object. My brother asked, \"What is that? \" and all three of us stared curiously at this round object in the sky. We knew it definitely wasn't the moon when we realized the object was moving. At one point my oldest brother asked, \"Is it following us?\" We sat in awe as we drove down the only road home trying our best to keep our eyes on this strange object in the sky. My heart pounded in my chest as the car drove down the road and almost stopped after driving over a small hill about 1.5 miles from home. My brother immediately stopped the car upon seeing the sight: in a field 70-100 yards in front of us was a flaming circular object that hovered in the air as a constant stream of lightning shot down to the ground while other bolts of lightning shot out of it in all directions. It looked to be about 50 feet off of the ground and at arm's length, it looked to be the size of a quarter. We were terrified and looked at each other with our mouths gaped open in shock, wondering if we were all witnessing the same thing. In reality, we thought it was the end of the world and began praying. My brother wouldn't budge the small vehicle and we sat there for what seemed to be several minutes wondering if it was the end of our lives while staring at this impossible sight in front of us. Finally I told my brother to speed past the object to make it home to our parents, but he was hesitant since the object was fairly close to the paved, one-lane road. I started to cry and somehow my brother found the courage to drive home. When we moved, it moved fluidly away from the field and appeared to be following us. We sped down the country road while trying our best to keep our eyes in the sky. We woke our parents up immediately upon getting home and we all tried explaining what we saw in the sky to my mother. We even tried showing her the object out of the bathroom window, but at that point, it was already sinking down and was hidden behind the thick line of trees in the western horizon. To this day, we still talk about that night and wonder what it was we saw. We all agree on one thing: whatever it was, it wanted to be seen. We only wonder why."],"Country":"United States","Case Number":"31913","Summary":"Ball of flame hovered over field with lightning constantly shooting out of it","City":"Meadow Bridge"}