{"Country":"Australia","Object Flight Path":"Undisclosed","Log Number":"AU-09192011-0010","Summary":"entity in bedroom at night then vanished","Weather Factors":"Unknown","Object Features":"Undisclosed","Tags":"City","Date of the Event":"08/15/2009 12:00 UTC","City":"Beaumaris","Case Number":"31911","Longitude":"145.048639","Source":"MUFON","files":["/var/www/straped/mufon/html2text/31911.html.txt","/var/www/straped/mufon/org/31911.html"],"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-37.970861,+145.048639(31911)&iwloc=A&hl=en\"> mufon case (31911) map </A>","Viewing Distance":"20 Feet or Less","Date Submitted":"09/19/2011 06:29 UTC","divs":["Sighting Detailswoken up at night, with what I thought was my mother or father crouched near my bed picking up something, I could only see the top of a head at this point in the dark. I then said \"mum, dad?\", as I said this the entity seemed to have realized that I had awoken and rose up from the crouched position and ceased what it was doing with its hands (the most I could see before it rose was its forehead and shoulders moving in a motion that would suggest movement with its hands, perhaps operating something) onto two feet and stood with its torso moderately bent over the bed. It then waved its two hands over my bed whilst facing me then slowly disappeared. During the experience I wasn't paralyzed or unable to move, but I felt I strong feeling to not harm or be afraid of the situation. After it had passed I stayed awake for several more minutes and turned the TV on before going back to sleep. It was difficult to judge the entity's height and anatomical dimensions due to the angel at which it was in relation to me but approximate of 5-6 ft in height, glowing white skin(?) all over, average size head although eyes were roughly 3x larger than an average human's and were full black in colour, no visible orifice's or unusually large or small physical appendages (except for the eyes), no reproductive organs, no communication established."],"Region":"Victoria","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Beaumaris","There was one other sighting in Beaumaris on or around August 15th 2009"],"Latitude":"-37.970861","Disposition":"Unresolved"}