{"Longitude":"-74.035192","trends":["There have been 7 other sightings in Hoboken","There were no other sightings in Hoboken on or around September 18th 2011","This sighting has never been favorited.",""],"Log Number":"US-09192011-0025","map":"<A HREF = \"http://maps.google.com/maps?q=40.745909,+-74.035192(31925)&iwloc=A&hl=en\"> mufon case (31925) map </A>","Case Number":"31925","Region":"New Jersey","Object Shape":"Oval, Sphere","Tags":"City","Disposition":"Unknown","Weather Factors":"None","Date of the Event":"09/18/2011 10:35 UTC","Object Flight Path":"Stationary,Path with directional change","files":["/var/www/straped/mufon/html2text/31925.html.txt","/var/www/straped/mufon/more/31925_submitter_file1__ufosunday91820111045am.jpg","/var/www/straped/mufon/more/31925_submitter_file2__ufo272dpi.jpg","/var/www/straped/mufon/more/31925_submitter_file3__Screenshotcompilationufo72dpi.jpg","/var/www/straped/mufon/org/31925.html"],"Object Features":"Other","Summary":"white stationary object high in daytime sky . then started to move and then reversed direction.","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"40.745909","divs":["Sighting Detailsafter seeing an all white jumbo jet without any markings pass above me, i noticed high above a small white object sitting motionless . it did not move for at least 3-4 minutes. i then ran inside and returned with my camera canon 20 d with zoom lens. i took about 10 shots and called a neighbor mike over to ask him to witness it. he agreed he could not figure out what it could be? i asked him to remain there as i ran in to get my tripod. when i returned, we then noticed it was moving slowly west and away from us. i took about 10 more photos , 24 in all. then to my surprise it stopped and started moving back towards the direction it started from. this made me realize it could not be anything in orbit such as a planet , a satellite or the space station. i took a few more photos as it hid behind the clouds and behind the side of my building. when i downloaded the images, i was surprised to find it changing shape in every shot. i could not believe this was any kind of balloon or conventional craft i have ever seen or heard about. the way this object sat motionless for over 3 minutes was most notable. i checked this by in referencing the object to my building and the telephone wires. then moving and changing direction was quite amazing and perplexing. i truly felt i witnessed something beyond the normal explanation. i also felt i acted with quick decision to get a camera, tripod and a witness to what i saw."],"Country":"United States","City":"Hoboken","Date Submitted":"09/19/2011 12:48 UTC"}