{"Region":"California","files":["/var/www/straped/mufon/html2text/3192.html.txt","/var/www/straped/mufon/org/3192.html"],"Date Submitted":"08/08/2004 08:48 UTC","divs":["Sighting DetailsAt approx. 848AM on 8-8-04, I was in the backyard and noticed a small planeflying overhead to the North- NorthWest and happened to notice a circular objectfar above the small plane. It seemed to be larger or the same size as the smallplane, but I forget really. It appeared, at first thought, to be a hot airballoon, that was dull gray or dull silver, without the basket at the bottom. It appeared to be dime sized in the sky using your extended arm technique. Iasked my wife if she thought it was unusual, she said yes. Im a PrivateInvestigator specializing in video surveillance on land, since 1992, but I haveno sky viewing experience.I got my digital camera within 30 seconds and was videotaping. My first frame isthe largest, after that, things are smaller. The video lasts for approx. 10minutes, I guess. My first frame is bright whitish-silver, which seemed like thesun reflecting off the UFO. After about 20 minutes, 2 planes, several minutesapart, came from the NW, passing under the UFOs, by my house and circled backtoward the NW and out of view. The planes were detected as planes very quicklyby my camera. The circular balls would get larger when zoomed in, but neverappeared anything like the planes. There was not trail to the planes. The UFOsvideotaped, were much larger and closer, when I first saw them without thecamera and the sun did not seem to be reflecting off the object.When I videotaped, they were no longer close. I knew I couldnt tell how largethey really were or how far away. I tried to put telephone lines in theforeground for comparison, hoping that someone could figure out size anddistance and movement from my position and the position of the wires, andfactoring in that I was apparently swaying while recording.I was constantly trying to zoom in on them, but most times they disappeared uponzoom and the outline of a classical sauser spaceship, much larger than the ballwas videotaped. This was probably just a trick of light, I know. Since I wasconstantly zooming, I cant swear that the objects were moving or not. My wifesays they moved from a triangle to a straight line and back again. The photos Ihave, were made by inputing the digital camera into a capture card on mycomputer and saving the film to an avi at 6 frames per second, uncompressed. Itwas the best I could do. I still have the original.One photo, shows the jet crossing"],"Source":"MUFON","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=33.835849,+-118.340629(3192)&iwloc=A&hl=en\"> mufon case (3192) map </A>","Object Features":"Undisclosed","Summary":"3 ufos over Los Angeles","City":"Torrance","Latitude":"33.835849","Country":"United States","Object Shape":"Sphere","Weather Factors":"Unknown","Case Number":"3192","Disposition":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"08/08/2004 08:48 UTC","Tags":"City","Log Number":"","Sighting Duration":"00:30:00","Longitude":"-118.340629","trends":["There have been 16 other sightings in Torrance","There were no other sightings in Torrance on or around August 8th 2004"]}