{"Case Number":"31921","Country":"United States","Date of the Event":"09/16/2011 09:40 UTC","Object Features":"Unknown","Date Submitted":"09/19/2011 12:16 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Region":"North Carolina","Latitude":"35.139688","divs":["Sighting DetailsMe, my wife and 2 friends were in a parking lot after eating dinner, when I noticed three orange-ish lights in a row traveling from east to west off in the distance just over the trees in our direction. \"Planes don't fly that close together do they?\" I said. As we watched them come closer, the center light went higher forming a triangle juxtapose the other two. The lights one by one slowly ascended up in to the clouds out of view as they seperated further apart from each other. There was no sound. We shrugged it off and went to our cars and left. The lights would have been going towards the Charlotte airport. As my wife and got in the car and left the parking lot we saw two more of the orange lights flying VERY close together. As they came closer one either went behind the other or joined the other making one light. They then seperated and put a greater distance between them. As I'm driving south on Park Road I continue to watch. I confirmed with my wife that we did in fact see the same event that took place. Off in the distance above the trees there were three more aproaching. I kept waiting to hear a sound which would identify what we were seeing but never did. I observed one fly over us just below cloud cover and saw that the bottom looked exactly the same as they looked at a distance, an orb of orange light. I didn't pull over because I kept expecting to discover a logical explanation, tail lights or a sound. There was none. They were not planes (we see them all the time) and they were not helicopters. The oddest part is we had just had a conversation about UFO's during dinner and surmised the possibilities of what they could be including the biblical interpretations of Angels depicted as having wings because they fly in the sky like birds. The last time you ever expect to see something like this is when you just get through talking about it. We were perplexed by the experience. I kept driving and lost sight of them as I needed to watch the road. I haven't stopped thinking about it since. We saw UFO's."],"Disposition":"Unknown","Longitude":"-80.852094","Log Number":"US-09192011-0021","Summary":"Orange lights that appeared to fly like controlled ballons (straight and random)","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around September 16th 2011"],"Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=35.139688,+-80.852094(31921)&iwloc=A&hl=en\"> mufon case (31921) map </A>","files":["/var/www/straped/mufon/html2text/31921.html.txt","/var/www/straped/mufon/org/31921.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path,Path with directional change","City":"Charlotte","Tags":"City"}