{"Latitude":"40.298778","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31927.html.txt","/var/www/straped/mufon/org/31927.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was looking up at a contrial of a commercial jet while talking to my dad, brother in law and sister. I looked at the jet trail for a while and noticed something that looked like a yellow dull metalic sphere above the contrail. I first thought it was a yellow child's balloon floating in the sky. The object was just hovering motionless and I told my dad to go get his binoculars toget a better view of it. It stayed there for a long time, at least 20 minutes. When my dad gave me the binoculars I looked at it and noticed it was a sphere with a yellow dull metalic surface that was at I would guess 50,000 feet in altitude, much higher than the airliner at 20-30000 feet in altitude. I was able to see 3 aircraft now in a triangle hovering flight formation. I noticed a fourth one close to the other 3 and it moved horizontally in a linear path slowly to the right and I noticed then 3 more spheres hovering motionless. They all formed a trapezoid flight position. The surprise came when some of them started glowing brightly as a bright yellow to white light. Some of them changed shape to an elongated sphere and then looked disklike with edges on the outside of the shape. They all stayed in formation for over 20 minutes and then some of them just disappeared as I was looking at them in my binoculars! My dad, brother in law,sister and later mom all heard me describe these objects while looking at them in the binoculars. They were not very visible to the natural eye, just tiny starlike spheres. I watched them for a while as I looked at them they disappeared one by one but changed shape first and glowed a like a white brilliant light like snow with the sun reflecting off it or a bright mirror reflecting the sun. I was amazed and it was like nothing I had ever seen and I had been to air shows by the Air Force. I have seen weather balloons, balloons, helicopters at night and in daylight. Nothing was like these things. They were at 50,000 feet in altitude at least and were motionless and not moving for 20+ minutes. They changed shape, appearance, and disappeared while viewing them. One moved linearly and stopped as it formed a flight position to the other objects. Unbeliveable but actually happened. I have been interested in UFOs but did not believe that they existed for real. I know they exist now!!! I have seen some photos of the same kind of things on the internet and now I do believe they are real!!!"],"Case Number":"31927","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Log Number":"US-09192011-0026","Date of the Event":"04/04/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.298778,+-111.687748(31927)&iwloc=A&hl=en\"> mufon case (31927) map </A>","Date Submitted":"09/19/2011 01:43 UTC","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Country":"United States","Source":"MUFON","Object Shape":"Cylinder, Disc, Oval, Sphere","trends":["There have been 5 other sightings in Orem","There were no other sightings in Orem on or around April 4th 2010"],"Tags":"City","City":"Orem","Disposition":"Unresolved","Longitude":"-111.687748","Region":"Utah","Summary":"7 ufo objects sighted for over 20 minutes without moving and at 50000 feet in altitude."}