{"Source":"MUFON","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=32.227503,+-110.922529(31922)&iwloc=A&hl=en\"> mufon case (31922) map </A>","Case Number":"31922","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Latitude":"32.227503","Weather Factors":"Unknown","Longitude":"-110.922529","Tags":"City","Date Submitted":"09/19/2011 12:24 UTC","Date of the Event":"11/09/2009 12:00 UTC","Log Number":"US-09192011-0022","Object Features":"Undisclosed","divs":["Sighting Details I lived just east of Tucson an had observed on occasion a bright object motionlessly hovering over Tucson. The object would pulsate various colors of light. I was curious about how a glowing object could remain motionless for so long, as it would hover for up to 20 to 30 minutes without being effected by winds or air currents. Yet on the evening that I took some video there seemed to be a different object. The object I filmed was also motionless, yet did not pulsate light, rather it gave off a white glow. I do not know if the object was a weather balloon or not. It seemed to be made up of three or four large glowing spheres connected together in a bit of a triangular fashion. It was pretty distant and I had some difficulty focusing in with my video camera. I've submitted still shots from some video taken of the object that evening.Perhaps someone out there will be able to determine if the object was a weather balloon or not."],"Summary":"A stationary object that seemed to be three or four large spheres connected together.","Object Flight Path":"Stationary","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around November 9th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/31922.html.txt","/var/www/straped/mufon/more/31922_submitter_file1__twilightobject.png","/var/www/straped/mufon/more/31922_submitter_file2__twilightobject_02.png","/var/www/straped/mufon/more/31922_submitter_file3__twilightobject_05.png","/var/www/straped/mufon/org/31922.html"],"Region":"Arizona","City":"Tucson","Object Shape":"Sphere"}