{"City":"Phoenixville","Object Flight Path":"Straight-line path","divs":["sighting detailsthe date of this event was between september-october of 1990, approx 8:00 p.m. est. the location was phoenixville, pa (approx 40 w of philadelphia)it was so long ago i cannot remember the exact day which it happened, but i know it was during one of those months during that year. i was 13 years old at the time and getting ready to go bowling with my family. my mother asked me to change the kitty litter, so i took the bag outside to our attached shed. i have always been fascinated with the night sky, and as always looked up at the stars. flying directly over my head\\house was a giant black triangle. by giant i mean this thing was huge, approx 1500 feet along each side. you could have fit an unknown number of the largest airplnes in the world inside the outline of this thing, it was massive. as soon as i saw it, i dropped the kitty litter bag and key to the shed right where i stood. i was scared and mesmerized at the same time. i watched this thing for about 3-4 minutes. it had 3 smallish red lights at each point in the triangle. it was low to the ground, maybe 1000-2000 ft at the most. it made no noise whatsoever and flew over my house in a ese direction. it did not deviate from this course at all and flew at a very slow speed. it was a clear night, no clouds at all and the stars were visible. the object was solid as it blacked out all of the stars behind it. when the object was starting to get further down on the horizon i came to my senses and ran inside to get my mom and grandmom to see this thing. unfortunatly when i finally got them outside the object was too far away for them to see it as the triangle had gone far enough towards the horizon that the trees blocked it out. i haven't reported this before and have really only told my closest of friends as i didn't want people to think i was crazy, but i know what i saw, the sight of it is burned into my memory. for some reason it has been on my mind alot recently and i felt like i had to tell soemone about this. i can't think of any other details to relay. i figured this would be all over the news and the newspapers at the time as i live in a fairly highly populated area but i have never heard a thing. i still to this day am freaked out by what i saw as i can't possibly imagine this thing is earthly."],"Region":"Pennsylvania","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Tags":"City","Object Features":"None","trends":["There have been 7 other sightings in Phoenixville","There were no other sightings in Phoenixville on or around September 1st 1990"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/31928.html.txt","/var/www/straped/mufon/org/31928.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.125233,+-75.53997(31928)&iwloc=A&hl=en\"> mufon case (31928) map </A>","Log Number":"US-09192011-0027","Sighting Duration":"Undisclosed","Summary":"Huge black triangle, silent, 3 red lights at points. Heading from WNW to ESE.","Latitude":"40.125233","Disposition":"Unresolved","Object Shape":"Triangle","Date of the Event":"09/01/1990 08:00 UTC","Case Number":"31928","Country":"United States","Longitude":"-75.53997","Date Submitted":"09/19/2011 01:58 UTC"}