{"divs":["Sighting DetailsI was around 16 when this situation happened. A friend and I where walking back after a day of playing around at a junk yard behind my mothers house. It was approximately around 7-730pm and was just getting dark when we decided to leave the junk yard. We crossed over a set of rail road tracks to head onto the trail that lead back to my mothers house when a really bright light over head hit us both with a blinding white light. From my memory I remember the light being so bright all you could really see was white and dark shadows in the wooded areas. I had the sensation that something large was over our heads when I looked at my friend that was with me and yelled to run. The light flicked off as we were running through the wooded area back to my mothers house. Neither of us looked back or up while running until we reached my mothers back yard. The time it took us to reach the yard was approximately 5 minutes. We looked up and noticed nothing unusual in the clear nights sky. We walked around to the front of my mothers yard discussing what things it could have been. We came around the corner of the house and my sister and her boyfriend were sitting on his car talking. We asked if they had seen or heard any helicopters from the base that was approximately 20 miles away. They replied no they didn't see anything or hear anything near the house. The distance from my mothers house to where this experience happened was around a mile and a half. The approximate time the light was over our head was brief and I wouldn't put it past a few seconds."],"Country":"United States","files":["/var/www/straped/mufon/html2text/31920.html.txt","/var/www/straped/mufon/org/31920.html"],"Region":"Michigan","Disposition":"Unknown","Tags":"City","Latitude":"46.499736","Object Flight Path":"Unknown","Date of the Event":"07/20/1991 07:30 UTC","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.499736,+-87.59687(31920)&iwloc=A&hl=en\"> mufon case (31920) map </A>","trends":["There have been no other sightings in Negaunee","This sighting has never been favorited."],"Date Submitted":"09/19/2011 11:45 UTC","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Case Number":"31920","Sighting Duration":"00:00:03","Source":"MUFON","Log Number":"US-09192011-0020","Object Features":"Unknown","City":"Negaunee","Summary":"Unknown","Longitude":"-87.59687"}