{"City":"Hopewell","Object Shape":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.304315,+-77.2872(3193)&iwloc=A&hl=en\"> mufon case (3193) map </A>","Summary":"My friend and I, saw a saucer move at light speed","Case Number":"3193","Sighting Duration":"00:05:00","Weather Factors":"Unknown","Latitude":"37.304315","Region":"Virginia","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Details It was one morning around 400 am. Sometime in either June or July of 1997. My friend Joe and I were sitting on my porch in Hopewell Va.. Which at that time I lived behind Hardees off of Miles Ave. Well, while we were sitting there we noticed a bright White light in the sky. So, we didnt really think much of it. We just thought it was probly a search and rescue light from a Police helicopter because, it was moving slowly across the sky like a helicopter would. About a min. goes by and then we were thinking maybe its headlights on a plane but, the plane was travling pretty slow. About another min. goes by then, we noticed something really odd as, it was getting closer. The White light seemed to give off a shine to the ships underbelly. It was then when we noticed that the ship was not a helicopter or a plane. It was round just like a saucer. Then the ship stoped. Then White light on the bottom of the ship started to change colors. From a White light to Blue ,then Red, then White again. The light was changin these 3 colors and they were picking up speed. Then from a dead standstill the the ship darted off in an up rightward slanted postion in the sky. It was one of the most amazing things I have even seen in my life. The ship was gone in the blink of an eye..literally. My friend and I were in shock by what we had seen. We discussed the event and realized we had just seen a flying saucer. It was a few yr.s later that I realized somthing really even more odd about the whole event. 1st 0ff the ship looked Terran made man made. 2nd The lights were changing to Red, White, and Blue. Just like you would see as if an airplane was flying through the sky at night. If you ask me in my opinion it was not Alien but, the US Airforce and that when the ship darted off it left at, what appeard to be some form of light travel or close to it. I would just be happy to find out wether or not any Airports in the surronding area had seen anything on radar or not. If anyone feels free to investigate this for me I would be really, really gratefull thank you for letting me get this off of my chest. P.S. SYNFUL2U@HOTMAIL.COM is my E-mail address for any questions or ans"],"Object Features":"Other","trends":["There have been 2 other sightings in Hopewell","There were no other sightings in Hopewell on or around July 20th 1997"],"Source":"MUFON","Longitude":"-77.2872","Log Number":"","Disposition":"IFO","Date of the Event":"07/20/1997 04:00 UTC","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/3193.html.txt","/var/www/straped/mufon/org/3193.html"],"Date Submitted":"07/20/1997 04:00 UTC"}