{"map":"<A HREF = \"http://maps.google.com/maps?q=39.946257,+-105.808832(31938)&iwloc=A&hl=en\"> mufon case (31938) map </A>","files":["/var/www/straped/mufon/html2text/31938.html.txt","/var/www/straped/mufon/more/31938_submitter_file2__UFOPicture2_09.04.11_05.38AM.jpg","/var/www/straped/mufon/more/31938_submitter_file3__UFOPicture1_09.04.11_05.39AM.jpg","/var/www/straped/mufon/org/31938.html"],"Summary":"Two different unidentified flying objects flying above Fraser Valley, Grand County, CO","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"Colorado","Longitude":"-105.808832","Object Shape":"Star-like","Source":"MUFON","Log Number":"US-09192011-0037","divs":["sighting detailsi first submitted a report about a sighting i had around 5:15 am in the sky high above james peak (continental divide) on august 29th, 2011. in the 21 days since, i have witnessed similar sightings, in the same general vicinity, for most of the clear mornings (cannot be seen when cloudy). there is a flashing, very bright object(brightest object in sky besides moon)in the sky high above the continental divide. the object at times appears still, but then clearly moves, making short jutting motions in erratic directions. for the first several nights (mornings, actually - i viewed it at varying times between 3:00 am and 6:30 am when the sun is up) i tried to capture this object on any and all of our cameras, but had no luck. all the cameras could capture was blackness. finally, on september 4th, i was able to capture still photos and video of the object on my blackberry phone (pictures\\video attached). at times when millions of stars are visible to the naked eye, this is the only object that the camera on my phone would pick up, that evening and in several evenings since. perhaps this isn't so odd, considering this object appears to be the brightest object in the sky, although many of the stars are nearly as bright, just not quite as large to the naked eye. strangely, on the evening of august 30th, around 9:30 pm, i observed a very similar object high in the sky to the northwest of sheep mountain (above the pole creek valley). at that point i thought for sure my eyes were deceiving me, as i was seeing the same thing i had been observing in the sky nearly 180 degrees to the south (and at a different time - 9:30 pm vs 3:00 - 6:00 am) the previous two mornings. just as with the other sightings, this object made short, jutting motions in erratic directions. in all sightings, i have a number of tall trees (and the frame of the windows in our home) to judge the position of the objects and their movement. i watched this object first from our house, then from cr 519, hover and move high above the pole creek valley until it was no longer visible due to its distance. this routine, of observing these bright, flashing, jutting objects, from about 9:00 pm - 11:30 pm in the valley, and\\or 3:00 am - 6:30 am over the divide, has continued for 21 days now, with the only exceptions being when it was cloudy. i have several videos and still photos of both objects, taken over several different days, but can only attach a limited number here. it would be great if these objects could be identified, but as of yet, the handful of observers that have also seen these objects (friends and family) have no explanation. any suggestions on getting these objects identified would be appreciated."],"Date Submitted":"09/19/2011 10:47 UTC","Viewing Distance":"Over One Mile","Latitude":"39.946257","Object Flight Path":"Other","Tags":"City","trends":["There have been 2 other sightings in Fraser","There were no other sightings in Fraser on or around September 19th 2011","This sighting has never been favorited.",""],"Date of the Event":"09/19/2011 03:00 UTC","City":"Fraser","Case Number":"31938","Weather Factors":"Unknown","Country":"United States"}