{"Country":"United States","Disposition":"Unresolved","Object Features":"None","Viewing Distance":"Unknown","Date Submitted":"09/20/2011 03:30 UTC","Longitude":"-73.9456","Case Number":"31949","Latitude":"40.65519","Sighting Duration":"00:00:05","Summary":"Bright green light similar to a military flare 20 deg above horizon falling at 45 deg and vanishing about 10 digs above horizon","Object Shape":"Fireball","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.65519,+-73.9456(31949)&iwloc=A&hl=en\"> mufon case (31949) map </A>","Object Flight Path":"Straight-line path","Date of the Event":"09/19/2011 12:00 UTC","Tags":"City","City":"New York","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around September 19th 2011"],"Source":"MUFON","Log Number":"US-09202011-0006","Weather Factors":"Unknown","divs":["sighting detailsi was facing south while investigating a vehicle accident on interstate 278 ( i am a police officer) when a bright green object with a trail appeared at 20 degs +\\- above the horizon and fell at a 45 deg angle down and to the right (as i observed it). it vanished at about 10 degs above the horizon and it lasted 5 seconds or less. it was very similar to a military flare but nothing like a firework. however i saw it appear and lose altitude then disappear. if i saw it eject from the ground i would have believed it to be a flare or even a fire work but it's appearance mid air was odd. no aircraft were low enough to emit it otherwise i would have thought it a flare like one ejected from military aircraft to distract anti air missiles.(however unlikely over new york city) would have thought it was a meteor but being green and moving fast and it's size ruled that out. it was too large for a shooting star. if assuming the object was the size of a standard military flare i would estimate it's distance at under 500 feet away. i am prior military and have seen many flares. was it an alien... doubtful. was it unidentified and flying? yes"],"files":["/var/www/straped/mufon/html2text/31949.html.txt","/var/www/straped/mufon/org/31949.html"]}