{"Longitude":"-101.835696","Region":"Texas","Country":"United States","City":"Amarillo","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date of the Event":"09/12/2011 12:00 UTC","trends":["There have been 15 other sightings in Amarillo","There were no other sightings in Amarillo on or around September 12th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Summary":"While driving through Amarillo Texas in the evening my sister and I witnessed something going in and out of the clouds. My sister captured a photo on her phone through the window.","files":["/var/www/straped/mufon/html2text/31946.html.txt","/var/www/straped/mufon/more/31946_submitter_file1__mail.jpg","/var/www/straped/mufon/org/31946.html"],"Object Features":"Unknown","Date Submitted":"09/20/2011 02:07 UTC","Latitude":"35.194872","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.194872,+-101.835696(31946)&iwloc=A&hl=en\"> mufon case (31946) map </A>","divs":["Sighting DetailsOn Sept 12, 2011, my sister and I were driving through Amarillo on a cloudy evening on our way back home to California. My sister saw something in the sky very big and very bright going through the cloud cover. She grabbed her phone and took a picture of it. There is a reflection of the flash of the camera on the glass of the window, she was driving and only had one hand available so she didn;t have time to roll the window down. We didn't know what it was but it was not a plane. When we looked at the picture we both we stunned at what we were looking at. It was dark with some thick cloud cover that was visible but there were no airplanes and absolutely nothing giving off any reflection on the window. These lights were in the sky outide the car up above us passing through the clouds. Very big and very bright. We are still baffled.."],"Tags":"City","Log Number":"US-09202011-0004","Source":"MUFON","Object Shape":"Unknown","Case Number":"31946","Viewing Distance":"Unknown"}