{"Summary":"one small white light and one larger pulsating white light on one craft","Sighting Duration":"00:03:10","Country":"United States","Longitude":"-95.108558","Object Shape":"Unknown","trends":["There have been no other sightings in Troup","This sighting has never been favorited."],"divs":["Sighting DetailsAt about 4:55 AM on July 13th 2011, I stepped out onto the back porch to throw some garbage into the trash can. When I go outside at night I always look at the stars for a minute or two before going back inside, which I did on this particular night as well. As I looked south-west, I suddenly saw a light that was slowly moving toward me in a south-west to north-east direction. For the first 5-10 seconds, I figured it was a helicopter or commercial jet. But this obect made no noise at all, and it consisted of one large, pulsating white light, and another small white light that remained a constant size and brightness. I could not see the shape of the object, only the lights. I watched in awe as it moved in a straight line from the south-west to the north-east over my house, still making no sounds at all. These two lights gradually became dimmer until I could no longer see them. The entire sighting lasted only 2 or 3 minutes. I felt wonder and excitement, because I have wanted to a see UFO since I was 11 years old. I also felt a little angry at myself for not thinking to grab a camera until after the object was gone. I went back inside and quickly wrote down the sighting, still wondering what this object was. I hope to see many more things like this in the future."],"Case Number":"31944","Object Features":"None","Region":"Texas","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/31944.html.txt","/var/www/straped/mufon/org/31944.html"],"Object Flight Path":"Straight-line path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.167491,+-95.108558(31944)&iwloc=A&hl=en\"> mufon case (31944) map </A>","Weather Factors":"Unknown","Latitude":"32.167491","City":"Troup","Log Number":"US-09202011-0002","Date of the Event":"07/13/2011 04:54 UTC","Disposition":"Unknown","Date Submitted":"09/20/2011 12:51 UTC"}