{"Object Flight Path":"Stationary","divs":["sighting details this ufo was viewed by my boyfriend on 09\\18\\2011-that sunday morning. he first started viewing the ufo at about 6 a.m. from his place of employment. he has a job that allows him to be outside and able to look at the sky. the entire viewing lasted approximately 44 minutes. he was looking in a south-east direction and he saw a bright, shining object. at first he thought it was one of the few stars that was still visible around daybreak, but as he scanned the sky there were no other stars visible, even when he looked up with his binoculars. he grabbed those binoculars to get a closer look and as he focused, he saw what looked to be a bright, metallic and diamond shaped object. the side that was facing east was getting the most sunlight and the object was showing an illuminated rim with a bright glint and a hot spot. as i mentioned before, the object was diamond-shaped (meaning traditional diamond, and not baseball field diamond shaped)and it remained stationary during the entire time that it was visible. after my boyfriend got off of work he kept checking the skyline to see if it had moved, but it didn't. at around 6:44 a.m., the object itself had still not moved, but a smaller object was seen separating from the larger,diamond-shaped object. the separated object was heading in a south-east direction. after that, my boyfriend couldn't find it anymore."],"Region":"Arizona","files":["/var/www/straped/mufon/html2text/31947.html.txt","/var/www/straped/mufon/more/31947_submitter_file1__ufosketch.jpg","/var/www/straped/mufon/org/31947.html"],"Case Number":"31947","Latitude":"33.611001","Object Shape":"Diamond","Disposition":"IFO","Object Features":"Unknown","Date of the Event":"09/18/2011 06:44 UTC","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/20/2011 02:26 UTC","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around September 18th 2011","This sighting has never been favorited.",""],"Log Number":"US-09202011-0005","Source":"MUFON","City":"Phoenix","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Star-like UFO","Weather Factors":"Unknown","Longitude":"-112.112362","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.611001,+-112.112362(31947)&iwloc=A&hl=en\"> mufon case (31947) map </A>"}