{"Summary":"hughe white orb darting in and out in the clouds from east to west","files":["/var/www/straped/mufon/html2text/31941.html.txt","/var/www/straped/mufon/org/31941.html"],"Date Submitted":"09/19/2011 11:46 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.552813,+-87.939478(31941)&iwloc=A&hl=en\"> mufon case (31941) map </A>","Object Features":"Unknown","Date of the Event":"04/28/2010 03:30 UTC","Log Number":"US-09192011-0040","Case Number":"31941","Region":"Kansas","Longitude":"-87.939478","Object Shape":"Sphere","Sighting Duration":"00:00:15","Tags":"City","Source":"MUFON","City":"Kansas","divs":["Sighting Detailsmy wife and i are traveling back from our vacation from nebraska to Dallas and switching drivers every two hours and I moved to the passenger side about 3 in the afternoon and a very windy day from the startof the trip and lots of clouds coming from the south to north east patern and I was looking up looking at the beautiful clouds ect and all of a sudden as we are just about to leave kansas to oklahoma I see this huge ORB above and around maybe 10000 ft or less moving west to east darting in and out of the clouds. this was whiter than the whitest cloud that I have ever seen with a few crystal sun like flares coming off the orb. I saw this for about 15 secs total and with out any clouds around it at times just as plain as you can get. we are traveling north to south and the clouds approx south to north and the orb from west to east...the sun was at the west at 3:30pm.. so you know how big this was you could put about 75 or so sm jetsabout the size where leave the chem trails.. sm but this ORB was not hard to miss. Inside the orb was white white white and swirling kind of look and you could not see the debt of it cause it never turned it just was moving as if not to be seen west to east only. I am describing it to my wife and she is trying to pull over as she was freaking out..Oh well but this is true and I would die before I would lie about it. thanks for listening..Ronnie feel free to contact me anytime for futher info"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Kansas","This sighting has never been favorited."],"Latitude":"39.552813","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}