{"Date Submitted":"08/18/2004 08:16 UTC","Tags":"City","Country":"United States","trends":["There have been 7 other sightings in Hudson","There were no other sightings in Hudson on or around August 18th 2004"],"Log Number":"","divs":["Sighting DetailsAbout 1016PM took the dog out to the back yard, wich faces north. Stopped tostar gaze for a few minutes becaause of the unusual clarity of stars here inFla. As I looked away i saw an explosion in my peripheral vision. I looked backup and saw a bright light in the sky sitting there perfectly still like anairplane light for several seconds, then is just disapeared. I decided to keepan eye out for a few more seconds in case any thing else happened. Few secondslater I saw a pulsating light thatflashed quickly and appeared to be on a fastmoving object traveling at extreme high speed to the north These lights wew verydim as compared to the first light spotted Also direction that pulsating lightscame from was directly were the first bright light was and quickwent out ofsightly. I used to have a 6 inch reflector telescope. This was not a naturalevent meteor for example. This happened in the flight path of of runways 36L and36R North of Tampa International Airport. But what I observed had nothing to dowith any commercial, private , or militry craft that I know of. I have a pilotslicense, and worked in naval aviation as an aviation firecontrol bombing radartechnition I also worked on radio communication, radio navigation, andelectronic warfare systems. I was a quqlified aircreman, and also launched andrecoveres aircrat on the the aircraft carrier John F.Kennedy for 1 year I haveseen ufos before, objects, not just lights that did cause EM interfiernce, butnot this time, just the lights. There may be air crews from Tampa that saw this,maybe evev one that might report it That is all"],"Weather Factors":"Unknown","Summary":"Explosion in the sky over Hudson,Fl","Object Shape":"Other","Case Number":"3194","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=28.364448,+-82.693434(3194)&iwloc=A&hl=en\"> mufon case (3194) map </A>","City":"Hudson","Longitude":"-82.693434","files":["/var/www/straped/mufon/html2text/3194.html.txt","/var/www/straped/mufon/org/3194.html"],"Object Flight Path":"Straight-line path","Region":"Florida","Sighting Duration":"00:00:59","Date of the Event":"08/18/2004 08:16 UTC","Latitude":"28.364448","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Source":"MUFON"}