{"map":"<A HREF = \"http://maps.google.com/maps?q=39.152981,+-123.203783(31940)&iwloc=A&hl=en\"> mufon case (31940) map </A>","divs":["Sighting DetailsMyself and another person went outside last night(9-18-11) at around 10:30 pm to go in the hot tub. This was in Ukiah, CA in Mendocino County which is about two hours north of San Fransisco. We were casually observing the night sky when we both noticed a very bright \"star,\" however within a minute we both saw that the star hovered to the right a little bit rather quickly, then to the left. It would hover then shift a little, then hover some more and the strange thing was that it would hover in a kind of an arc pattern. Not a direct shift to the left or right. It continued to do this hovering thing for at least two hours (we came inside about 20 minutes after we first observed it) but we went to the back door a few more times to see if it was still there, which is was, and around 12:30 am went to sleep. It's hovering behavior was too fast to be a helicopter and it also seemed too high in the sky to be a helicopter - plus we didn't hear any chopper sounds. It was east of us maybe all the way over to Lake County. We tracked it against a structure to be sure it was moving. Over the two hours it moved more towards the west and by the time we went to bed it was about 85 degrees up from the horizon. We star gaze quite a bit - our rural area provides beautiful night skies and we often see shooting starts and satellites but this was totally different. I am a professional person, as is my friend and neither one of us are particularly interested in UFO's. We have no idea what the heck this was though so I thought I'd report it somewhere, did a search on the internet and found this web site. we set up our telescope tonight but so far nothing has appeared like what we saw last night."],"Viewing Distance":"Unknown","Case Number":"31940","Object Flight Path":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"09/19/2011 11:41 UTC","Object Features":"Unknown","Source":"MUFON","trends":["There have been 8 other sightings in Ukiah","There were no other sightings in Ukiah on or around September 18th 2011"],"Tags":"City","Weather Factors":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/31940.html.txt","/var/www/straped/mufon/org/31940.html"],"Region":"California","Log Number":"US-09192011-0039","Disposition":"Unknown","Date of the Event":"09/18/2011 12:00 UTC","Latitude":"39.152981","Object Shape":"Star-like","Longitude":"-123.203783","City":"Ukiah","Summary":"Bright star-like thing that hovered around for two hours. Random smaller red light intermittedly flashed"}