{"divs":["sighting detailsnoticed a very bright light through the window and at about 30 degrees above the horizon in the eastern sky (almost due east). as it wasn't moving, nor were red lights blinking, i knew it wasn't a plane, so got my sister who said, \"that is weird,\" and asked for the binoculars. we stood on our loading dock that is raised some four feet above the patio so as not to have any obstruction from trees or power lines. we wondered if mars wasn't particularly bright--but this was far too bright (and not red) for a planet. we managed to get the binoculars adjusted and my sister described what she saw: \"i really don't know how to describe it. it looks organic. it's got a swirl of smoke or mist around it. and it's like it's being eclipsed by a round object.\" i snatched the binoculars and managed to find it also. the best description i can offer is that it appeared to be a gold\\copper colored yin or yang symbol with swirls of mist on the outside. i saw what my sister meant by the eclipse, as that was what was creating the yin\\yang look. to me it appeared that the entire visible surface was stippled with lights or had a very pocked, though highly shiny gold surface. the object then blinked out for perhaps two seconds, then was back but some three degrees lower in the sky. (we were using the vastly scientific method of determining movement by guaging it by the electric line coming into our building. most of the time we were looking at it, it was directly over the lowest sag in the line. then suddently it was a good deal higher than. another blink out and it was below the line.) we called my sister's daughter who deemed it a planet on a glance outside. we watched it for a while longer, then individually drew pictures of what we had seen. shortly after 10:30 p.m. the object was still visible in the eastern sky, and still in the same location."],"Disposition":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Stationary,Other","Region":"New Mexico","Date of the Event":"09/19/2011 09:20 UTC","files":["/var/www/straped/mufon/html2text/31955.html.txt","/var/www/straped/mufon/org/31955.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.398722,+-104.518668(31955)&iwloc=A&hl=en\"> mufon case (31955) map </A>","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around September 19th 2011"],"Log Number":"US-09202011-0012","Object Features":"Other","City":"Roswell","Longitude":"-104.518668","Summary":"Through window observed light too bright to be a planet, but not moving. Called my sister, we went outside with binoculars. Could see it, but looked liked nothing we'd seen before.","Country":"United States","Latitude":"33.398722","Object Shape":"Teardrop, Other","Sighting Duration":"Undisclosed","Case Number":"31955","Date Submitted":"09/20/2011 11:27 UTC","Viewing Distance":"Unknown"}