{"Log Number":"US-09202011-0015","Summary":"Star-like light with visible form","Viewing Distance":"21-100 Feet, 101-500 Feet","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.556091,+-73.006785(31958)&iwloc=A&hl=en\"> mufon case (31958) map </A>","City":"Waterbury","Date Submitted":"09/20/2011 12:25 UTC","Region":"Connecticut","Case Number":"31958","Weather Factors":"None","Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"41.556091","Longitude":"-73.006785","Sighting Duration":"00:07:00","Date of the Event":"09/19/2011 08:22 UTC","Tags":"City","Disposition":"Unknown","divs":["sighting detailsi just hung up from a call with a friend of mine, when approx. 1-2 minutes later she called me back frantically saying to go outside that i would see \"them\". she witnessed 3 ships\\lights in the sky above her home headed toward the direction of my home, which is 2-3 blocks away from hers. as i ran out the door, i clearly saw 1 star-like light with a \"visible\" form to it emerging from over my rooftop. it seemed to be transparent but i saw that it had a chevrom shape to it. it was literally only about 100 ft. above the rooftop. i followed it for a minute until it was out of sight. it was moving at a slow and steady pace, slow enough for me to walk at a faster pace up my 30ft. driveway to follow it. since july 4th this year there have been several people in my area that have witnessed these same type of craft, usually heading north, at a pretty regular pace. i would say that total there might be 10-15 sightings since july 4th. this was definitely the most significant to date. i di not witness the other two craft that my friend saw. she descibed the same thing that i saw. she said that one was in front and headed towards my home while the other two flew right next to each other at approx. 30-50 ft. apart in a westward direction. the first coming to my area would have been going eastward."],"trends":["There have been 15 other sightings in Waterbury","There were no other sightings in Waterbury on or around September 19th 2011"],"files":["/var/www/straped/mufon/html2text/31958.html.txt","/var/www/straped/mufon/org/31958.html"],"Object Shape":"Chevron, Star-like","Country":"United States"}