{"Date Submitted":"09/20/2011 11:15 UTC","City":"Sheridan","Object Shape":"Fireball","trends":["There have been 4 other sightings in Sheridan","There were no other sightings in Sheridan on or around July 15th 2002"],"Log Number":"US-09202011-0011","Case Number":"31954","map":"<A HREF = \"http://maps.google.com/maps?q=44.806953,+-106.929915(31954)&iwloc=A&hl=en\"> mufon case (31954) map </A>","Latitude":"44.806953","files":["/var/www/straped/mufon/html2text/31954.html.txt","/var/www/straped/mufon/org/31954.html"],"Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Date of the Event":"07/15/2002 08:45 UTC","divs":["Sighting DetailsI had just finished branding a new horse at a neighbors ranch approximately 2 miles to the North and was riding home. I had my horse saddled and was leading the new gelding. As we turned off the county road and into our drive I spotted two bright, glowing orbs comming out of the hills to the East at a distance of one and one half miles. They came directly at us at an incredible rate of speed taking just a few seconds to cover the distance. They were side by side as they passed just a few feet from the North wall of our home. They stopped instantly at the corner of the North and West walls. They paused just a fraction of a second, broke to my right with one following the other. They reached the South and West corner, angled at about a 45 degree up to the middle of the house, angled down again at a 45 degree angle, got back to their orginal path and retreated back into the hills at speeds that defy discription. When they got to the corner of the house I remember shouting'What the Hell is this!' Both the horse I was riding and the one I was leading are what we describe as 'bomb proof', meaning that they are dead broke and never offer to buck. When those two objects, about the size of volley balls zoomed around the front of the house, both horses reared up, pawed the air and whinied in a total panic. I was able to stay on and contol them but they were clearly frightened....as was I. The next day I rode through my pastures and got permission to ride through my neighbors to the East. I never found anything like scorched grass but there are several square miles of open range and rolling hills."],"Weather Factors":"Unknown","Summary":"Two glowing orbs on a straight-line path approached my home at a great rate of speed. They paused, moved south, up, down, back to the north and headed back east","Viewing Distance":"21-100 Feet","Longitude":"-106.929915","Object Flight Path":"Path with directional change,Path then hovering","Region":"Wyoming","Object Features":"None"}