{"files":["/var/www/straped/mufon/html2text/31959.html.txt","/var/www/straped/mufon/org/31959.html"],"Country":"United States","Weather Factors":"Unknown","City":"Canton","Longitude":"-83.439082","Date Submitted":"09/20/2011 12:53 UTC","Object Shape":"Circle, Sphere, Star-like","Tags":"City","Object Features":"None","Sighting Duration":"Undisclosed","Date of the Event":"09/17/2011 09:02 UTC","Latitude":"42.284147","map":"<A HREF = \"http://maps.google.com/maps?q=42.284147,+-83.439082(31959)&iwloc=A&hl=en\"> mufon case (31959) map </A>","Case Number":"31959","Source":"MUFON","Disposition":"Unknown","trends":["There have been 16 other sightings in Canton","There were no other sightings in Canton on or around September 17th 2011"],"Summary":"Star-like object moving from NNW to SSE, light intensified overhead then got dimmer and headed SouthEast and then disappeared out of thin air.","Log Number":"US-09202011-0016","divs":["Sighting DetailsI was at my apartment in Canton and walked out to my car with my girlfriend to go to the store at 9pm Saturday, September 17. We were looking up at the stars and I noticed an object that also looked like a star moving from the Northwest to the Southeast. It was directly over top of us moving towards the Southeast when it went from being a dim moving star-like object to a extremely bright pulsating light- almost like a meteor or asteroid when it skips off the atmosphere, but this object continued on it's way and suddenly it dimmed back down to it's original light intensity, continuing southeast towards the Metro Airport where it suddenly disappeared in the sky. The sky was crystal clear that night, a decent amount of stars were out for living in the city and this object was no satellite or plane. There were several planes in other locations in the sky to reference that this object was something unknown. It didn't have any specific details, other than seeming star or orb-like in appearance. The sighting only lasted about 1 minute at the most. Quite an amazing event to witness!"],"Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Region":"Michigan"}