{"files":["/var/www/straped/mufon/html2text/31967.html.txt","/var/www/straped/mufon/org/31967.html"],"divs":["Sighting DetailsMy husband and I were outside with the kids watching the clouds -my daughter said she saw a star, but we didn't see any because it was still light at the time. Then almost directly up, but towards the southern part of the sky we saw a star-like object moving in the sky. It followed a path behind the clouds, appeared out of the clouds shortly afterward and seemingly ascended until it was no longer visible. Then we spotted another. This one went one direction, then oddly changed direction...I wouldn't say it was fast, but very unlike a plane. Then four slowly came out from behind clouds settled in the northeastern part of the sky and they gathered together in a pyramid shape. It looked like a constellation because it was at this point the sky was dark enough for stars to show. The objects hovered from that point on. They didn't move AT ALL from what I observed after that. I went inside and decided to report; I was a little shocked and excited. There were at least two planes flying during this event -we live close to Cessna and the Wichita Airport."],"Log Number":"US-09202011-0023","Region":"Kansas","map":"<A HREF = \"http://maps.google.com/maps?q=37.713513,+-97.256015(31967)&iwloc=A&hl=en\"> mufon case (31967) map </A>","Disposition":"Unknown","Case Number":"31967","Object Features":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"09/20/2011 08:10 UTC","Tags":"City","Object Flight Path":"Path then hovering","Summary":"Several star-like objects moving in different directions","City":"Wichita","Source":"MUFON","Longitude":"-97.256015","trends":["There have been 39 other sightings in Wichita","There were no other sightings in Wichita on or around September 20th 2011"],"Weather Factors":"Unknown","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Date Submitted":"09/20/2011 09:39 UTC","Country":"United States","Latitude":"37.713513"}