{"Viewing Distance":"Over One Mile","Sighting Duration":"00:02:30","Object Flight Path":"Path with directional change","Date Submitted":"09/20/2011 06:49 UTC","Date of the Event":"09/17/2011 12:00 UTC","Disposition":"Unresolved","Latitude":"51.765908","Country":"United Kingdom","Object Features":"None","City":"essex","Log Number":"GB-09202011-0018","trends":["There have been no other sightings in essex","This sighting has never been favorited."],"Summary":"Invisible airplane, Lights on either wing (invisible)","divs":["Sighting DetailsNight (9 - 10pm) On 17th September I was out metal detecting on a field in Essex, As I was metal detecting in a ploughed field, I looked over to the lane next to the field where my car was parked to see the police checking over my car, most probably wondering why a car was parked on its own in the middle of nowhere, at the same time I noticed over the estuary a large airplane heading in my direction above coryton oil refinery, a moments thought was that this was going to pass right over me, instead it swiftly suddenly changed direction to then disappear, I thought well thats strange, on a very clear night, so I decided to watch in the flight path it went to see if could be seen again, then it came out of nowhere again for a couple of seconds then went again for good. I am a little uncertain of things as I was also watching the police at the same time, however, I definitely saw something that did not behave like any airplane, it seemed to be transparent except for lights either side. I often metal detect at night and see many planes, this was not one. This aircraft had the ability to disappear and reappear."],"Longitude":"0.667366","Tags":"City","Object Shape":"Other, Unknown","Region":"England","Weather Factors":"Unknown","Case Number":"31961","files":["/var/www/straped/mufon/html2text/31961.html.txt","/var/www/straped/mufon/org/31961.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=51.765908,+0.667366(31961)&iwloc=A&hl=en\"> mufon case (31961) map </A>"}