{"Date Submitted":"09/20/2011 03:47 UTC","Object Shape":"Unknown","Disposition":"Insufficient Data","Date of the Event":"09/20/2011 05:35 UTC","Source":"MUFON","divs":["Sighting DetailsI was driving south on Interstate 45 on my way to work in downtown Houston, TX. While still a few miles outside of downtown, with the city skyline visible, I watched a bright red light that flashed slowly about every 2 or 3 seconds. After the red light flashed, it was immediately followed by a fast strobe or twinkle of blueish white lights, much smaller than the red. I thought it might be a small aircraft's beacon, or a helicopter, but the lights maintained the same brightness as it flew over the highway and off to the east horizon. It was about as low as a helicopter would fly. It moved west to east over the highway and continued to the east horizon. I was driving so that's as far as I could watch it while driving. There was also one of those beacon towers with the red lights and flashing light on top off on the east horizon, it seemed to stop near it. It flew faster than a helicopter and lower than a plane. The red light was very bright, and never changed intensity from the different angles I viewed it at as it moved away. It was about 5:35 AM and still dark out."],"Case Number":"31960","Longitude":"-95.371722","Log Number":"US-09202011-0017","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around September 20th 2011"],"Country":"United States","Tags":"City","Viewing Distance":"Over One Mile","Summary":"Bright flashing Red/Blueish White light over I-45 Near Downtown Houston","files":["/var/www/straped/mufon/html2text/31960.html.txt","/var/www/straped/mufon/org/31960.html"],"Region":"Texas","Weather Factors":"Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.800691,+-95.371722(31960)&iwloc=A&hl=en\"> mufon case (31960) map </A>","Latitude":"29.800691","Object Flight Path":"Path with directional change","City":"Houston"}