{"Sighting Duration":"00:08:00","Object Shape":"Star-like","Region":"Wisconsin","Case Number":"31979","Object Flight Path":"Stationary","City":"Mt Pleasant","Country":"United States","Log Number":"US-09212011-0010","Latitude":"42.682441","map":"<A HREF = \"http://maps.google.com/maps?q=42.682441,+-87.802598(31979)&iwloc=A&hl=en\"> mufon case (31979) map </A>","divs":["Sighting DetailsMy girlfriend and I were traveling south on hwy 32 and about to approach chickory road. It was about 8:40 in the evening and we were returning home to Kenosha from a dinner date with some friends in Racine. We were on my motorcycle, so we had a clear view of the night sky. I got this sensation as if someone was watching me from the sky. As I looked up into the night sky, I saw this brilliant white, yet very specific, light shining not too high in the sky. As we road for several minutes, it seemed to be either emitting more intense light or descending closer, or maybe even growing in size. There was a jet headed parallel to it, going north west, bit then hurriedly changed its course, abruptly flying west, seemingly getting as far as possible from the object. As the jet did this, the light didn't fly away, but appeared to vanish in an instant, sort of a vacuum type vanishing. Throughout all of this, my girlfriend refused to look, which I thought was odd, since I didn't tell her what it was that I wanted her to witness. Then it was over."],"Date Submitted":"09/21/2011 06:03 UTC","Date of the Event":"09/21/2011 08:40 UTC","Tags":"City","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/31979.html.txt","/var/www/straped/mufon/org/31979.html"],"Weather Factors":"Unknown","Summary":"starlight object hovered for several minutes, then appeared to vanish in a vacuum of space.","Source":"MUFON","trends":["There have been no other sightings in Mt Pleasant","This sighting has never been favorited."],"Object Features":"Unknown","Longitude":"-87.802598"}