{"Sighting Duration":"00:04:30","trends":["There have been 6 other sightings in Pinetop-Lakeside","There were no other sightings in Pinetop-Lakeside on or around July 25th 2011"],"Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/31970.html.txt","/var/www/straped/mufon/org/31970.html"],"Object Features":"Unknown","Summary":"Saw light in sky with a beam underneath. Changed direction carefully and rapidly. Could see beam on clouds.","Case Number":"31970","Date Submitted":"09/21/2011 12:48 UTC","Weather Factors":"Unknown","City":"Pinetop-Lakeside","Country":"United States","divs":["Sighting DetailsMe and my buddies were walking from rainbow lake to Mcdonalds late night one night and i was in the back of the pack on my skateboard and my neck hurt from football so I looked up and was looking at the stars. I was watching a satellite drift when a light just floated out of the clouds. I though it was an airplane at first, then I decided it was a helicopter. But if it was a helicopter I would've heard it and it changed direction abruptly and violently sometimes but it was mostly carefully turning and making large sweeps to turn. So as a reasonable response I shouted \"Holy S''t! Somethings in the sky!\" my friends all looked up and were confused but then they realized it wasn't normal and someone said that's gotta be a UFO and so we had a little freak out session and were so excited to be able to say we witnessed a UFO but then a beam opened up out of the object and we started to get scared. And it hovered back and forth. The clouds were odd that night. There was a semi transparent cloud underneath the thing and then a thicker, but still hazy, cloud above it. We slowed down to a near stop and kinda got closer to eachother and the object was making a slow motion bee line and we could see the light on top of the cloud underneath it. We were afraid so we decided to get out and power walked until it made a sharp turn and then sluggishly accelerated into the cloud and then out of sight. We were constantly looking for something on the ground cause we just felt unsafe and watched. I may be in high-school. But we know what we saw and if you don't want to take this for truth don't. I cannot describe exactly where I was but it was just us on the closest road to the rim and the national forest with a ton of uninhabited homes. Near a cemetery to add to the creepiness."],"Log Number":"US-09212011-0001","Disposition":"Insufficient Data","Source":"MUFON","Latitude":"34.155043","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.155043,+-109.966088(31970)&iwloc=A&hl=en\"> mufon case (31970) map </A>","Date of the Event":"07/25/2011 11:45 UTC","Longitude":"-109.966088","Region":"Arizona","Tags":"City","Object Flight Path":"Path with directional change"}