{"Weather Factors":"Unknown","Date Submitted":"09/21/2011 03:46 UTC","City":"Casa Grande","Case Number":"31978","Object Flight Path":"Path with directional change","Region":"Arizona","Log Number":"US-09212011-0009","divs":["Sighting Details My wife was dropping me off to my place of work and I had noticed something shiney in the sky. Thinking it was light reflecting off of a plane I paid no mind to it. Then I had looked again and it was blinking. That got my attention. There were approximately 4 objects in the sky and a helicopter (which I did not notice, my wife did),and the disc shaped objects were glowing. Now what really freaked me out is that the objects were disappearing and reappearing almost in a slanted line from about 500 feet to almost where the 2pm sun was located. When the objects disappeared they left a shadow and appeared almost directly on top of their previous location. Kind of like blinking Christmas lights. I do not know how long the incident lasted because I had to go to work at 2:30pm and my wife had an appointment. But I'm sure it wasn't that long because no one at my place of work had seen the event. I was trying to film the objects with my cell-phone but I am so amateurish that I didn't know how to zoom in. I'm pretty sure there are some video experts that can zoom in and see the objects from the video. Also I was filming directly under the sun... As a note: Barry M. Goldwater Airforce Range is south of the location where the sighting had occured. This is not the only time there has been strange objects in the sky."],"files":["/var/www/straped/mufon/html2text/31978.html.txt","/var/www/straped/mufon/org/31978.html"],"Country":"United States","Viewing Distance":"Over One Mile","Tags":"City","Object Shape":"Disc","Sighting Duration":"00:15:00","Summary":"Blinking lights over Barry M. Goldwater Airforce Range","Latitude":"32.899557","map":"<A HREF = \"http://maps.google.com/maps?q=32.899557,+-111.793182(31978)&iwloc=A&hl=en\"> mufon case (31978) map </A>","Disposition":"IFO","Date of the Event":"09/20/2011 02:15 UTC","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around September 20th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Object Features":"None","Longitude":"-111.793182"}