{"map":"<A HREF = \"http://maps.google.com/maps?q=30.206618,+-85.657234(31981)&iwloc=A&hl=en\"> mufon case (31981) map </A>","Region":"Florida","Summary":"Satalite looking object changed directions, got brighter, and then disappered. Re-appered briefly but looked invisible or cloaked.","Object Shape":"Boomerang, Chevron","Object Flight Path":"Path with directional change","Case Number":"31981","Date Submitted":"09/21/2011 08:28 UTC","Date of the Event":"09/16/2011 12:00 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","Object Features":"None","files":["/var/www/straped/mufon/html2text/31981.html.txt","/var/www/straped/mufon/org/31981.html"],"trends":["There have been no other sightings in Lynn Haven","This sighting has never been favorited."],"divs":["Sighting Details My wife and I were in a hot tub staring at the stars. My wife was watching what she thought was a satelite through the trees when the object got brighter and disappeared. Seconds later I noticed the same object,(Going the opposite direction from what my wife seen),and I said \"Hey look at the satelite.\" We watched the object get extremely brighter,(Brighter than the north star),and then disappear. I asked my wife if she just saw what I did and thats when she told me about it doing the same thing though going the other direction. A few, (Maybe 3?), minutes later we both see what appeared to be a boomerang or cheveron shaped object, but it looked invisible or cloaked,(If your a trekky). We could see the stars behind it but we also were able to see the shape. It flew off, out of our view, very quickly, but we were able to watch it until it was distance that allowed it to leave eye sight versus just disappearing as it had just minutes before, hard to explain. It reminded me of Star Trek when a ship is cloaked. The whole thing lasted for around 5 minutes. After words we couldn't believe it, but it was a shared experience, so we agreed it has some validity. I'm a 19y Air Force veteran who works on aircraft and could not explain what we had just seen."],"Longitude":"-85.657234","Disposition":"Unknown","Country":"United States","Source":"MUFON","Log Number":"US-09212011-0012","Sighting Duration":"Undisclosed","City":"Lynn Haven","Latitude":"30.206618"}