{"Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.293179,+-111.841731(31980)&iwloc=A&hl=en\"> mufon case (31980) map </A>","Object Flight Path":"Stationary","Date Submitted":"09/21/2011 08:21 UTC","Region":"Arizona","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/31980.html.txt","/var/www/straped/mufon/org/31980.html"],"Disposition":"Unresolved","Object Shape":"Circle, Fireball, Star-like","Case Number":"31980","Weather Factors":"Unknown","Latitude":"33.293179","Longitude":"-111.841731","City":"Chandler","Country":"United States","Date of the Event":"09/18/2011 06:00 UTC","trends":["There have been 52 other sightings in Chandler","There was one other sighting in Chandler on or around September 18th 2011","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Log Number":"US-09212011-0011","Object Features":"None","divs":["Sighting DetailsI live in an apartment. The apartment faces east. I was doing laundry in the complex laundry room. I started at 4:30 in the morning. I went to retrieve my laundry at about 10 minutes to six in the morning. When I was returning to my apartment with the completed laundry I saw the light. I set down my laundry basket and took out my cell phone to take the pictures. The light was completely stationary. There were no other lights of any kind present. It was very large. A single bright light. 6 am in the morning. No stars or moon or sun present. Light out side but the sun wasn't visible yet. The object was a very bright light. I took four photos of it with my 8 mega pixel camera in my cell phone. It was way too bright to be a star and there would have been other stars in the sky. There were none. It was too light out side for there to be stars. I stayed out side for about ten minutes and it never moved. I went in side and didn't go back out for about a half hour. When I did. It was gone. I regret not staying out there to see what if anything it would do. It never moved. I am 53 years old and I don't spook easily. This thing spooked me."],"Summary":"A single bright light. 6 am in the morning. No stars or moon or sun present. Light out side but the sun wasn't visible yet. A very bright light"}