{"Viewing Distance":"20 Feet or Less","Region":"Florida","Date of the Event":"03/15/2010 03:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.341318,+-87.184726(31987)&iwloc=A&hl=en\"> mufon case (31987) map </A>","Object Flight Path":"N/A","Object Shape":"Other, Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"31987","divs":["Sighting DetailsI fell asleep in my recliner aprox. 9 p.m. Both of my dogs slept on both sides of my chair on the floor. My boyfriend was on the couch next to my recliner and he was asleep also. Aproximately 3 a.m. i awoke to a horrific jabbing pain im my mid-lower back right on my spinal column. Upon awakening i can vividly remember sitting up and grabbing my back at the same time..as i turned to sit all the way up i saw a \"large human like figure\" turn away from me and proceeded to walk toward my front door with some sort of very large clear syringe he placed on his right hip like a gun would be placed for carrying purposes. I remember trying to scream out and pointed at the same time but \"nothing\" would come out of my mouth no matter how hard i attempted to shout i could not produce even a whisper. It was as if he possessed some sort of immortal power over my actions until he was out of my sight. He never once turned around where i could see his face but he was all \"black\" and \"soldier like in his walk...like on a mission he needed to complete?\"...\"very muscular and strong in appearance\". I remember immediately grabbing my arms and saying to myself, \"Oh my God...i am not dreaming...this really did happen and this alien creature just inserted something into my back...or took something out.\"...I had no further pain from that episode and could not bring myself to even tell my boyfriend about it for aproximately 6 months thinking my family would think i was insane.. One of the wierdest things about the situation was that both my dogs never even budged....nor did my boyfriend wake up during the incident...I was in total disbelief. Not scared for some odd reason...maybe because he never showed his face...i dont know. However, to this day...i don't know if he possibly abducted me during the night and had just finished bringing me back consciously by inserting some sort of medication to awaken me or not. I \"do know\" for a fact that he had just finished using that large syringe on me because i watched his motions intently and he was walking away and at the same time placing that syringe to his hip \"holster\". The last thing i saw was him walking towards the front door but right before he got to it he veered to the airconditioning vent as if he had come from \"it\". Possibly from underground i wondered? I then faded out for aprox. 30 minutes and awoke with a very clear vivid rememberance of this event. I never believed or even thought something like this could be true but I now KNOW they are out there and in OUR homes at their own leisure!! They are \"quiet\", \"meticulous\", \"strong\", \"unafraid\", and i think \"curious\" in nature. They seem to be in a \"time zone\" that only they are familiar with and seem to have that mastered so well as to quietly appear as they \"need or want to\" then disappear without a trace. Things are still happening here in Gulf Breeze and now in my new residence as \"glowing type\" foot prints are appearing continually everywhere on my carpet during the night!! I am not a story teller and would LOVE to take a polygraph so badly..People believe me...i do not know if there has been some sort of government cover up about this UFO issue but why would we have full grown aliens walking around right now in our homes of all places??? They had to grow to get that big so there has to be many many more of them...right? OMG! I do not know why \"I\" am being targeted as an \"experiment\" to \"him\" or \"them\" but it is not ending for me...i really am not scared because i have never lost faith in my God above..he has his hand on me...but i really really need some help on this other issue...If there is some sort of alien specialist out there feel free to call...a.m. preferably...and only serious inquiries...I am not a gossipist or yapper....and would not be writing this if it were not true...but heed my words now...we ARE being watched and experimented on...i just dont know why or what they want...Be safe and please believe this is no joke folks..i now know they DO exists."],"Date Submitted":"09/21/2011 10:57 UTC","files":["/var/www/straped/mufon/html2text/31987.html.txt","/var/www/straped/mufon/org/31987.html"],"trends":["There have been 55 other sightings in Gulf Breeze","There were no other sightings in Gulf Breeze on or around March 15th 2010"],"Latitude":"30.341318","City":"Gulf Breeze","Object Features":"Other","Summary":"Aprox. 5 foot tall ..only saw walking away from me with a Large syringe attached to his hip like a gun would be attached....no sound and i could not yell or speak. He walked toward the vent in my house.","Log Number":"US-09212011-0018","Tags":"City","Disposition":"Insufficient Data","Weather Factors":"Unknown","Country":"United States","Longitude":"-87.184726"}