{"Log Number":"US-09222011-0002","Object Shape":"Unknown","City":"Islip","Weather Factors":"Unknown","Date of the Event":"08/19/2011 10:15 UTC","Object Flight Path":"Hovering then path,Path then hovering","divs":["Sighting DetailsI was taking my dog out for a walk. As we came out the front door I noticed something to my left in the sky between some tree branches. It seemed odd and out of place. As me and my dog walked toward it under the tree I looked up and saw three bright orange lights in a triangle formation. We ran back into the house so I could grab my cell phone. My dog would not go back outside so I went out alone and now there were 4 orange lights in a staggered formation moving slowly from SW to NE as I video tapped them on my Iphone 3gs 2 of the lights just \"blinked out\". Then from the West a 5th light traveling extremely fast came over the tree line and came to a complete stop. It hovered for several moments. Then it followed in the direction of the first 4 lights. They all eventually \"blinked out\". I was shaking the whole time. I've always wanted to see something but It was not how I expected it to go. There was absolutely no sound except for the crickets. My dog would not go outside until the next morning and she was still not happy about it. The first thing I did when I got back in the house was look at the clock to make sure I didn't loose any time, which I didn't."],"Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"N/A","Summary":"3 lights in traingle formation. Then 4 staggered then a 5th moving fast then stopping.","files":["/var/www/straped/mufon/html2text/31990.html.txt","/var/www/straped/mufon/org/31990.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.751189,+-73.227308(31990)&iwloc=A&hl=en\"> mufon case (31990) map </A>","Object Features":"Unknown","Case Number":"31990","Region":"New York","Longitude":"-73.227308","Tags":"City","Latitude":"40.751189","Date Submitted":"09/22/2011 09:30 UTC","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Islip","There were no other sightings in Islip on or around August 19th 2011","This sighting has never been favorited.",""],"Country":"United States"}