{"Disposition":"Unknown","Object Shape":"Triangle","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/31994.html.txt","/var/www/straped/mufon/more/31994_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/31994_submitter_file2__travelpath.jpg","/var/www/straped/mufon/org/31994.html"],"Country":"United States","Case Number":"31994","Longitude":"-95.18222","Date of the Event":"09/04/2003 12:00 UTC","divs":["Sighting DetailsI was facing west at Old baldwin lake. i was on the south side of the lake. when from the north a pyramid like object with two pyramids about a 20th of the size of the craft on its \"base\" of the larger pyramid. started toward me in a southern direction. at this point i wasnt sure what i was seeing. i first thought it could be a helicopter. but quickly pushed that out of mind as it approached me. i remember thinkin that it had to be somethin military related. an then thinkin to myself. there is no way the military could make something like this AND expect it to fly. it could only be from another world. it flew in a straight line over my head about 500 ft away. it made no noise. but as it flew over i noticed i could see lines between what i assumed to be panels on the craft. it glowed in a color that reminded me of extremely hot metal. i watched it fly over my head an toward the south for about 3 min traveling at a very slow speed. before it turned into a ball that looked similar to the sun. then started causing a pulsating light and then traveling at a speed hundreds of times faster then it was previously and was gone. Affixed are two documents. one showing the craft that i drew. an the other is my location an the crafts travel path in reference to a map."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.777087,+-95.18222(31994)&iwloc=A&hl=en\"> mufon case (31994) map </A>","Viewing Distance":"101-500 Feet","Log Number":"US-09222011-0006","City":"Baldwin City","Object Features":"Patterned Surface, Wings","trends":["There have been 2 other sightings in Baldwin City","There were no other sightings in Baldwin City on or around September 4th 2003","This sighting has never been favorited.",""],"Tags":"City","Latitude":"38.777087","Date Submitted":"09/22/2011 01:29 UTC","Weather Factors":"Unknown","Source":"MUFON","Summary":"A UFO flew over my head","Region":"Kansas","Sighting Duration":"Undisclosed"}