{"trends":["There have been 10 other sightings in Redondo Beach","There were no other sightings in Redondo Beach on or around August 22nd 2011"],"divs":["Sighting DetailsMyself and two friends were at the beach in Redondo Beach, CA, when the incident occurred. We were actually looking for UFOs - \"UFO Gazing\" we called it - but none of us had ever seen one nor really expected to. We had been out at a few different beaches that night, staring out over the water for any signs of UFOs, and there had been a boat that we assumed was border patrol shining spotlights around, sometimes even on us, for much of the night. We didn't think much of it until later. At 1:10 am (we looked at our phones a few minutes later and deduced the time as accurately as we could) something caught my eye in my left peripheral. When I swung my head I saw an object that I can only describe as a craft - perhaps a stealth craft. It looked to be about 6 feet long with a slightly shorter width, though it was very difficult to accurately guess its size or distance in the darkness. It was oval shaped, but my first instinct was that its form was somehow related to a manta-ray. The beach we were on was a few dozen feet below the streets and neighborhood, and the object looked as if it must have come from just over the houses on the streets above. It was moving in a completely straight line, was totally silent, and moved very slowly for something flying and with such little noise. It seemed to be grey, slightly lighter than the night sky (Los Angeles light-polluted night sky mind you) but it could have just as easily been transparent or reflective, and simply hiding in the sky. A second or two after noticing the object I yelled out to my friends. One of them had apparently already been watching it for a few seconds before me and said something about first thinking it was a kite and then realizing it was no kite. It was at this moment, the craft still soaring overhead, that I went into a state of disbelief. I would describe it as an altered state. The world I was in seemed like a dream. We were sitting next to a lifeguard tower and as the object glided behind the post of a handrail I jumped up off the sand and started running toward it. I heard PK saying something like, \"What? Where is it?\" so I pointed at it and yelled \"Right there!\" It was still solid and clear as day as I got to the water's edge and watched it disappear into the darkness over the Pacific Ocean. CH saw it fly away as well. PK never got a glimpse. Apparently he was looking out over the ocean the whole time. At around 2:00 a.m. we left the beach and dropped PK off at home. CH and I decided to go back to the beach to keep watching the sky. At around 3:30 or 4:00 a.m. a police car rolled slowly and quietly down the bike path on the beach shining a spotlight around the sand. CH and I realized there was no way we could get up and run without them seeing us so we just stayed down on the sand as they rolled on by. Were the cop car and the boat related?"],"Date of the Event":"08/22/2011 01:10 UTC","Summary":"An dark oval object glided slowly and silently above myself and two friends as we sat on the beach. It flew in a perfect line from over the neighborhood, over us and to the south, and then out into the ocean until we could no longer see it.","map":"<A HREF = \"http://maps.google.com/maps?q=33.852572,+-118.382148(32007)&iwloc=A&hl=en\"> mufon case (32007) map </A>","City":"Redondo Beach","Country":"United States","Disposition":"Insufficient Data","Tags":"City","Longitude":"-118.382148","Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","Log Number":"US-09222011-0019","Region":"California","Sighting Duration":"00:00:15","Latitude":"33.852572","Object Shape":"Oval","Object Features":"None","Date Submitted":"09/22/2011 09:00 UTC","files":["/var/www/straped/mufon/html2text/32007.html.txt","/var/www/straped/mufon/org/32007.html"],"Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","Case Number":"32007"}