{"Object Shape":"Unknown","divs":["sighting detailsthis was reported in the filer's files #38 and #39 denver -- this is a direct response to the posting of a ufo on september 12, 2011 at 8 pm! i too witnessed this event and i must say i was awestruck, however upon further examination it is my conclusion that the ufo's or orbs were not out of the world visitors. instead they were four f-16's doing a flyover from the buckley air national guard for the opening monday night football game of the denver broncos shortly after 8 pm. there was 7000 feet cloud coverage and the f-16's were flying formation with their navigation lights on, which may have given the illusion of bright white yellow orbs. i wish this was a true ufo sighting, but i am sorry to say it was a natural man made event! thanks to mufon cms ---------------------------------------- this isn't correct. i was at sports authority stadium for the broncos\\raiders game. what was seen were 4 men dropping into the stadium with parachutes. they had red (flares)fireworks attached on their shoes which emitted a large red glow and sparks. this was what was reported on filer's files #38 there was no military flyover that evening at the game. i sure that you can confirm this with buckley air base. the broncos lost....."],"Date of the Event":"09/12/2011 08:20 UTC","Object Features":"Undisclosed","Date Submitted":"09/22/2011 08:59 UTC","Tags":"City","Disposition":"IFO","Log Number":"US-09222011-0018","Country":"United States","Case Number":"32006","Weather Factors":"Unknown","City":"Denver","files":["/var/www/straped/mufon/html2text/32006.html.txt","/var/www/straped/mufon/org/32006.html"],"Source":"MUFON","Latitude":"39.740934","Region":"Colorado","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"101-500 Feet","Longitude":"-104.978413","trends":["There have been 185 other sightings in Denver","There were 2 other sightings in Denver on or around September 12th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.740934,+-104.978413(32006)&iwloc=A&hl=en\"> mufon case (32006) map </A>","Summary":"Not Correct Report"}