{"Sighting Duration":"02:00:00","Latitude":"33.288733","Viewing Distance":"Over One Mile","City":"Gilbert","Case Number":"32016","map":"<A HREF = \"http://maps.google.com/maps?q=33.288733,+-111.686465(32016)&iwloc=A&hl=en\"> mufon case (32016) map </A>","Country":"United States","Date Submitted":"09/23/2011 12:48 UTC","Object Shape":"Star-like","Region":"Arizona","Date of the Event":"09/21/2011 07:00 UTC","Log Number":"US-09232011-0003","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/32016.html.txt","/var/www/straped/mufon/more/32016_submitter_file1__11-1.jpg","/var/www/straped/mufon/more/32016_submitter_file2__11-2.jpg","/var/www/straped/mufon/more/32016_submitter_file3__11-3.jpg","/var/www/straped/mufon/org/32016.html"],"Object Features":"Unknown","divs":["Sighting DetailsMe and two of my friends were heading to a nearby city for some food. It was about 7PM, as we were driving down the road we can see a wide view of the sky, there were no stars out yet, but there was one really bright looking \"star\". I joked and said something like \"hey look at that UFO\" as a joke, and as we all looked again at the light, a second bright light appeared in the distance, and moved toward the other light. When the second light reached the first one, it stopped and the first light flew off and in a couple seconds faded out completely. After we ate at the fast food joint, we started driving down near an intersection at Power and Pecos and pulled over, when in the distance we saw 3 strange lights in the sky, which were stationary, then moved and made multiple formations (such as lines). Out of the three lights, the one on the right started drifting further away from the other two, as the other two drifted further way from each other, a forth light appeared in between those. These are the pictures I have, they are not that great, but at least its something. All three of us saw the same thing."],"Tags":"City","Longitude":"-111.686465","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 10 other sightings in Gilbert","There were no other sightings in Gilbert on or around September 21st 2011","This sighting has never been favorited.",""],"Summary":"Strange lights over Chandler/Gilbert, AZ"}