{"Country":"United States","City":"Corpus Christi","Date Submitted":"09/22/2011 11:16 UTC","Longitude":"-97.393551","divs":["Sighting DetailsMy daughter txt me with this message,dad i just saw a ufo and got a pic.what is strange is that i had been on net pass 3days looking at ufo pics.I called her(as waited on pic mail) and she was very upset telling me she was scared cause she went outside to walk baby when she felt she was being watched,as she looked up between trees above small trailer in backyard she saw a hovering craft that didnt look like a plane or jet.She always has a pic phone in pocket for pics she takes of baby.she took a pic and grabed the baby and headed back to house,looking back at the object to get another pic it was gone.she was really upset.About that time my phone said i had pic mail.as i looked at the pic she text under the pic look between trees,i then saw an object that did look odd but a good pic.I SENT THE PIC TEXT TO MY IMAGES ON MY PHONE THEN HAS I ZOOMED IN I COULD NOT BELIVE MY EYES.THIS IS A GREAT PIC.AS GOOD AS ANY.WOW NOW MY DAUGHTER SEES WHAT I SAW 40YRS AGO IN SAME AREA.Im 53 and have been otr truck driver 12 yrs.ive seen numerous ufos on my trips to LA driving through west ON INTERSTATE 10 AND 40.THIS PIC NEEDS TO BE SEEN."],"Source":"MUFON","trends":["There have been 26 other sightings in Corpus Christi","There were no other sightings in Corpus Christi on or around September 22nd 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/32013.html.txt","/var/www/straped/mufon/more/32013_submitter_file1__untitled.png","/var/www/straped/mufon/more/32013_submitter_file2__ufo.png","/var/www/straped/mufon/org/32013.html"],"Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=27.810003,+-97.393551(32013)&iwloc=A&hl=en\"> mufon case (32013) map </A>","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc","Disposition":"Hoax","Log Number":"US-09222011-0021","Object Flight Path":"Hovering then path","Object Features":"Dome","Latitude":"27.810003","Case Number":"32013","Tags":"City","Date of the Event":"09/22/2011 03:20 UTC","Summary":"walking baby in backyard saw weird object hovering as i got a pic it was gone.didnt know if i got pic.","Sighting Duration":"Undisclosed"}