{"Tags":"City","Disposition":"Insufficient Data","Date Submitted":"09/23/2011 02:54 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.980774,+-94.463871(32026)&iwloc=A&hl=en\"> mufon case (32026) map </A>","divs":["sighting detailsjuly 12, 2011, 8:30p.m.cdt raytown, mo i live in a wooded area between 2 cities with the woods being approximately 10 miles square. i have a nice, unobstructed view of the sky. i was taking pictures of the clouds as i do quite often. i was facing ene. i noticed an anomaly in the clouds. i saw a perfectly straight line which appeared to be in front of and abruptly hiding the altocumulus clouds. i was immediately calling it a cloaking device of a ufo. i took 7 photos, 4 showed an object(s) with or at the front of the cloaking device. i did not notice the object\\reflections until i down loaded the photos. there appeared to be one object with the front reflecting the sun as if off a window or metallic material. i believed it to be a reflection. the ufo became more apparent as the clouds moved. the object was stationary based on the sequence of photos i took. i was freaking out with joy. i ran inside to show my boyfriend the pictures i took. what i saw did not seem natural. i've been a believer nearly my whole life. ive been looking for my \"ufo experience\" for over 30 yours. i was glad to have taken these photos. but now i don't feel quite the same. i've been feeling like i'm being watched. it's just an eerie feeling i get now and then. i live near (approximatly 7 miles) a nuclear power plant. i'm also 3 hours north of whiteman air force base where the stealth bombers are base out of. there have been enough ufo reports that the kansas city star featured a front page article onsunday, september 4th, 2011. my photos were taken at 8:28p.m, 8:29p.m. and 8:30p.m. on july 12, 2011. the photos have not been altered. i used a fujia230 using the auto focus setting. thank you for your time and interest."],"Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around July 12th 2011","This sighting has never been favorited.",""],"Object Shape":"Star-like, Other","Log Number":"US-09232011-0011","Weather Factors":"Unknown","Summary":"A cloud formation had a perfectly straight line abuptly cutting off Altocumulus clouds. Not until I downloaded my photos did I see the shining object(s) in the cloud.","Object Features":"Other, Unknown","Latitude":"38.980774","Longitude":"-94.463871","Date of the Event":"07/12/2011 08:29 UTC","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/32026.html.txt","/var/www/straped/mufon/more/32026_submitter_file1__71211828pm.JPG","/var/www/straped/mufon/more/32026_submitter_file2__71211829pm.JPG","/var/www/straped/mufon/more/32026_submitter_file3__71211830pm.JPG","/var/www/straped/mufon/org/32026.html"],"Country":"United States","Source":"MUFON","Case Number":"32026","City":"Kansas City","Region":"Missouri"}