{"Object Features":"Window(s), Patterned Surface","Longitude":"-74.005963","Object Flight Path":"Undisclosed","Latitude":"40.711911","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"New York","City":"New York","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.711911,+-74.005963(32025)&iwloc=A&hl=en\"> mufon case (32025) map </A>","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/32025.html.txt","/var/www/straped/mufon/more/32025_submitter_file1___MG_5714_detail.jpg","/var/www/straped/mufon/more/32025_submitter_file2___MG_5716_detail.jpg","/var/www/straped/mufon/more/32025_submitter_file3___MG_5717_detail.jpg","/var/www/straped/mufon/org/32025.html"],"divs":["sighting detailsthe event occurred last saturday 9-17-2011 in the early afternoon. i was taking digital photographs from the roof terrace of the new museum located on bowery in manhattan's lower east side. i was shooting a series of images of the downtown manhattan skyline to get some pictures of the freedom tower construction. because i had no tripod i was shooting at a very fast exposure rate 1\\500th of a second. in addition i was shooting in continuous mode at a frame rate of about 4 frames per second. i took my pictures and left the location. last night upon looking at the images, i noticed a diamond shaped object moving very close to the horizon in four frames of my images. on closer inspection i notices what appeared to be regular markings and windows on the craft. i had to be moving at an incredible rate of speed for it to have moved as far as it did give the frame rate it was captured at. it seems to be faintly emitting both blue and red light from the openings on it's back area. a helicopter was also present in the nearby vicinity. at first i thought it was a flag or something, but soon realized there was no flag pole and from frame to frame it's shape stays regular. i'm hoping an expert in this type of thing can help me to rule out any other possible explanations for what they think this might be. please contact me a.s.a.p. as i am curious to get another opinion, especially an expert one. the three images i have supplied are lower resolution details of the actual four images that were taken as described above."],"Object Shape":"Diamond","Case Number":"32025","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around September 17th 2011","This sighting has never been favorited.",""],"Log Number":"US-09232011-0012","Summary":"Taking photographs of downtown Manhattan skyline I captured and extremely fast moving craft of some sort.","Tags":"City","Disposition":"Unresolved","Date Submitted":"09/23/2011 12:39 UTC","Date of the Event":"09/17/2011 03:30 UTC","Sighting Duration":"Undisclosed"}