{"City":"Wheatland","Disposition":"Unknown","Object Shape":"Star-like","Object Features":"Unknown","divs":["Sighting DetailsAs reported to ASD by phone: On Monday night at about lOpm, June the 27th, 2011 I was following my brother, who was driving a truck, in my car driving South on Hwy 83 outside of Wheatland Missouri. The sky was completely overcast and it had rained some during the day. Suddenly, I noticed five new bright star-like objects in a random pattern in the sky that had to be below the overcast. They were extremely bright and strangely defined with rays of light coming off of them in all directions. They were multi-colored. I checked my glasses to see if they could be causing this effect, but there was nothing wrong with them. At first the objects almost appeared to be stationary, but then I could tell that they were moving off in the same direction we were traveling. Then they began popping off and on, seemingly random- appearing then disappearing. When we reached AA Highway we and turned left (East) and they suddenly all vanished. I kept looking to my right and in about thirty seconds they came back on in a new uniform straight line. Then they disappeared sequentially, one after the other. I jumped out of the car when we stopped at a stop sign and ran to my brother's truck to see if he saw the objects. He said no, but he did remember seeing something like what I described a few years ato. When we arrived at my brother's place in the country, 1 stood at the fence line looking off in the direction I had last seen them for several minutes. Then, just as I was about to give up, I saw two lights come on at the horizon at a very low elevation. Then independently, they went out. Whiteman AFB is off in that direction, so several days later I called to see if they knew anything about this. They knew nothing about it, but an information officer listened to my story, including the orange objects I had seen in Kansas City. The person I was talking to did make the comment that he wished he could see a UFO. I listened to the radio the rest of the day to see if the report would be repeated but it never was, and I never saw anything in the paper about it. However, there is an on-line site- missourimufon.org that did list this report along with others and said that UFO sightings in the Kansas City area have been increasing in recent months."],"Source":"MUFON","Date Submitted":"09/23/2011 07:01 UTC","Latitude":"37.924677","Sighting Duration":"Undisclosed","Date of the Event":"06/27/2011 12:00 UTC","Longitude":"-93.410067","files":["/var/www/straped/mufon/html2text/32035.html.txt","/var/www/straped/mufon/org/32035.html"],"Weather Factors":"Unknown","Region":"Missouri","Object Flight Path":"Path with directional change","Summary":"Five multi-colored star-like objects stationary, then move across sky and dissapear","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.924677,+-93.410067(32035)&iwloc=A&hl=en\"> mufon case (32035) map </A>","Country":"United States","Case Number":"32035","trends":["There have been no other sightings in Wheatland","This sighting has never been favorited."],"Tags":"City","Log Number":"US-09232011-0020"}