{"divs":["Sighting DetailsMy father and I had noticed the strange object on a few occasions over the past month and I decided to bring my iPad 2 with me on my next visit to my parent's house for dinner to use the astronomy apps on it to determine the identity of the object if it was a star or not. I also planned to take any pictures if possible. After dinner and awhile later when I was leaving, I almost forgot to look up for the light while leaving down the driveway when I saw it already high in the sky brighter than any star. I felt anxious at the time to get my iPad out as quickly as possible in case the object disappeared. I had no doubts what I was seeing was something out of the ordinary because I do a lot of stargazing when I find the time most of my life. Especially since there had not been any sightings in the area since 93-94. I backed my car up the driveway and called my dad to come outside to see it. My mom and sister also saw it but were too nervous to stay outside so they went back inside while my dad and I took pictures and watched the object move slowly across the sky. Sometimes the object would seem to come closer or further away judging by the existing landscape for reference points. The whole time it continuously blinked a series of colors extremely brightly, almost seeming to rotate but hard to determine at such a distance. Unfortunately the colors of the lights did not come through on the photos I took. I took about a dozen pics but am sending only the least blurry of the bunch since I had no tripod and the second photo is an inverted color version. During the observation there was plenty of other planes flying high and low to compare the object to also and it was far larger and brighter than them. There was even a Airforce C-130 cargo plane flying solo and low that passed through the area. Usually they fly in pairs at least, but rarely if ever solo. While watching the object, we could faintly make out small orbs flying to and from the larger object but moving too fast and small to pick up on the camera. I also was not able to use the built-in video recorder on the iPad or iPhone because it had no zoom like the camera does and there was a street light pole nearby causing glare. We kept expecting the object to do something other than to move slowly about, but it never went out of view and I was pressed for time to head home so I had to leave. I have also heard from my mother since then that when FBI agents were interviewing her yesterday about a friend of mine who had applied to work for them, they asked her if she had happened to see the object in the eastern sky as I had described. My mom admitted seeing it and the agent agreed with her saying he felt it not to be a planet or known object."],"Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"09/20/2011 10:02 UTC","Tags":"City","Longitude":"-92.353449","map":"<A HREF = \"http://maps.google.com/maps?q=35.628778,+-92.353449(32032)&iwloc=A&hl=en\"> mufon case (32032) map </A>","Case Number":"32032","trends":["There have been no other sightings in Shirley","This sighting has never been favorited."],"Object Flight Path":"Hovering then path,Path with directional change","Country":"United States","Log Number":"US-09232011-0017","City":"Shirley","Region":"Arkansas","Date Submitted":"09/23/2011 05:27 UTC","Latitude":"35.628778","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32032.html.txt","/var/www/straped/mufon/more/32032_submitter_file1__Odd.jpg","/var/www/straped/mufon/more/32032_submitter_file2__Odd01.jpg","/var/www/straped/mufon/org/32032.html"],"Summary":"The object has been seen in the same area for the past month at relatively the same time with multiple witnesses.","Disposition":"IFO","Object Shape":"Disc, Sphere","Object Features":"Dome","Viewing Distance":"501 Feet - 1 Mile"}