{"Longitude":"-94.438112","Summary":"Orange pulsing objects over downtown Kansas City change direction","map":"<A HREF = \"http://maps.google.com/maps?q=39.268384,+-94.438112(32033)&iwloc=A&hl=en\"> mufon case (32033) map </A>","Log Number":"US-09232011-0018","Date of the Event":"07/02/2011 12:00 UTC","Country":"United States","trends":["There have been 12 other sightings in Liberty","There was one other sighting in Liberty on or around July 2nd 2011"],"Case Number":"32033","Object Features":"None","files":["/var/www/straped/mufon/html2text/32033.html.txt","/var/www/straped/mufon/org/32033.html"],"Disposition":"Unknown","Object Shape":"Egg","Source":"MUFON","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Tags":"City","Region":"Missouri","Latitude":"39.268384","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Date Submitted":"09/23/2011 06:00 UTC","divs":["sighting detailsas reported to asd by phone and in writing today with slight editing: on the evening of friday july 1st at midnight, i was driving through downtown kansas city, missouri on i-35 hwy heading north. i had just passed under bartle hall and could see the at&t building up ahead, when i suddenly noticed 3 orange, glowing, pulsating objects coming very low and straight towards me from the east. as the objects passed to the left of me and the line of traffic not more than 1\\2 block from my position, i could see that they were about the size of small or midsize cars. one was lower than the other two and actually passed in front of the high rise buildings below their roof lines. the other two were slightly higher up. suddenly, the lower one veered up to the right to join the other two at which time they all disappeared over the roof lines going north. briefly, i could not see them, then they reappeared, coming back south at which time they separated. one went south, one went west, and the other one just continued to circle over and down between the buildings. at this point, i was out on the shoulder with my car turned off watching this, when suddenly, out of the south, the other two returned, joined the third one, and then they all went straight north until i could no longer see them. final thoughts on this sighting: their elevation i would estimate, varied from 35 feet to 73 feet. their speed was probably about 75 mph or less, while i could see them, except when they took off to the north. at that point they may have been doing 100 mph or more. they had a glowing, plasma look to them and were rhythmically pulsating (in time with each other). they reminded me of giant fireflies. and upon reflection, i remember they had a reddish tinge at their centers and seemed to be somewhat bell shaped as seen from the side when they passed me on the left. note from asd: due to the speed of the objects and directional change it is ulikely that these were sky lanterns."],"City":"Liberty"}