{"Object Features":"None","Case Number":"32045","Source":"MUFON","Date of the Event":"09/23/2011 12:00 UTC","Object Flight Path":"Stationary","Log Number":"US-09242011-0004","Date Submitted":"09/24/2011 12:52 UTC","Weather Factors":"Unknown","Country":"United States","Latitude":"38.965785","trends":["There have been no other sightings in Fillmore","This sighting has never been favorited."],"Region":"Utah","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Summary":"Bright light east of Fillmore Utah, appears stationary in nature","Tags":"City","Object Shape":"Circle","Longitude":"-112.329206","files":["/var/www/straped/mufon/html2text/32045.html.txt","/var/www/straped/mufon/org/32045.html"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.965785,+-112.329206(32045)&iwloc=A&hl=en\"> mufon case (32045) map </A>","City":"Fillmore","divs":["Sighting DetailsAt about 2130 hrs, I observed a bright light in the eastern sky above Fillmore, Utah at about 45 degrees above the horizon. After observing the object for about 30 minutes it did not appear to be moving. I then used 10X40 binoculars to observe the object. When viewed through the binoculars, which I rested on my truck to avoid movement, it appeared to be a bright white light, and on either side of it were four smaller objects that also appeared to be stationary lined up at a 5 degree angle from the horizontal. They appeared to be lit up by the object. I could not see any other stars in the vicinity of the object. The object appeared to be stationary. I observed the object for an additional half hour but it did not appear to move. During this same time frame, I watched several planes flying either east or west and north and south along which appeared to be flying at a much lower altitude than the object, and they had the typical blinking lights. The sky was moonless, and we do not have street lights on our block, so the area is dark and bright lights in the sky are noticeable, and since we are in the flight path between Hill Air Force Base and the Air Force Base at Las Vegas I am used to seeing routine aircraft flights at night. This object stood out because of its brightness in the dark sky. The smaller objects on either side were not visible with the naked eye, but only through the binoculars. At 1050 hours I checked the location of the object and it appeared to be higher above the horizon than earlier. It still has the smaller lights on either side of it. It is most likely some object in orbit."]}