{"Date of the Event":"09/24/2011 12:00 UTC","Object Flight Path":"Stationary,Other","Date Submitted":"09/24/2011 03:47 UTC","Weather Factors":"Unknown","Object Shape":"Circle, Flash, Sphere, Star-like","Viewing Distance":"Unknown","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"32049","Log Number":"US-09242011-0008","divs":["Sighting DetailsI was at home and had gone outside to get something from my vehicle. I glanced up and saw what first appeared to be a star. I noticed it was kind of flashing . So I made note of where it was in the sky and ran inside to get my wife and my telescope. I sat and observed the object for roughly fifteen to twenty minutes . During this time my wife and I noticed that it was not only flashing but it was moving as well . Short small movements from left to right and also up and down . We did not notice the movement of the object until we observedit through The scope . The evidence of the changing colors was also great through the scope . I have been a star gazer my whole life and have never witnessed anything like this. This is not the first occurance of these objects in the night sky around here . I was also witness to one several months ago back in January. It kept me mesmerized for five and half hours I even called The police department to report that one. They thought I was some nut or drug addict I'm sure ."],"Latitude":"34.656411","trends":["There has been one other sighting in Booneville","There were no other sightings in Booneville on or around September 24th 2011"],"files":["/var/www/straped/mufon/html2text/32049.html.txt","/var/www/straped/mufon/org/32049.html"],"Longitude":"-88.571118","City":"Booneville","Object Features":"Unknown","Source":"MUFON","Summary":"bright blue red and white light blinlimg in the night sky appears at first like it is a star","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=34.656411,+-88.571118(32049)&iwloc=A&hl=en\"> mufon case (32049) map </A>"}