{"Log Number":"US-09242011-0002","Date Submitted":"09/24/2011 12:44 UTC","Disposition":"Unresolved","Case Number":"32043","Object Features":"Wings, Unknown","Country":"United States","Latitude":"48.763356","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Unknown","Summary":"many ariplane-shaped object with erractic flight patterns","divs":["Sighting DetailsMy friends and I were standing outside, gazing at the stars. Then we saw the re-entering satellite streak across the sky at incredible speed. we stood, amazed at what we had just seen, and looked at the last spot we had seen it. No less than 5 minutes later, i witnessed a triangle-shaped object move across the sky in the opposite direction of the satellite. I called my friend over, but by the time he looked, it had vanished. Perhaps no more than 7 minutes later, he pointed out an object that was almost similar to the satellite, but was moving north to south, rather than the west to east as the satellite had. Mere sconds later, about 15 objects of the same approximate shape and size appeared in the same direction, almost as if they were chasing it. Then another \"flock\" appeared. The term \"flock\" refers to that we almost thought they looked like glowing birds, but they were flying about in what might have been a figure-8, had they not been following the first object. I rode my bike home as fast as i could and told my family, and then made this report."],"Source":"MUFON","Region":"North Dakota","trends":["There have been no other sightings in Mohall","This sighting has never been favorited."],"Tags":"City","files":["/var/www/straped/mufon/html2text/32043.html.txt","/var/www/straped/mufon/org/32043.html"],"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-101.513217","Date of the Event":"09/23/2011 11:10 UTC","City":"Mohall","map":"<A HREF = \"http://maps.google.com/maps?q=48.763356,+-101.513217(32043)&iwloc=A&hl=en\"> mufon case (32043) map </A>","Object Shape":"Cross, Triangle","Sighting Duration":"Undisclosed"}