{"Viewing Distance":"Over One Mile","Summary":"saw a black triangle","Latitude":"41.685811","Object Features":"Other","files":["/var/www/straped/mufon/html2text/3205.html.txt","/var/www/straped/mufon/org/3205.html"],"Country":"United States","Region":"Indiana","Log Number":"","Date of the Event":"08/15/2004 03:45 UTC","Object Shape":"Triangle","Case Number":"3205","Source":"MUFON","Longitude":"-86.244807","Disposition":"Unresolved","Date Submitted":"08/15/2004 03:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.685811,+-86.244807(3205)&iwloc=A&hl=en\"> mufon case (3205) map </A>","Sighting Duration":"00:05:00","Object Flight Path":"Straight-line path","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around August 15th 2004"],"divs":["Sighting Detailswhile watching a couple of turkey buzzards from my drive way sunday afternoon, Inoticed a high flying object moving overhead to the northwest. I thought, atfirst, it was amazing a buzzard could fly that highthen it made an instant right turn to the northeast then north with out slowingor banking. I ran into the house and grabbed my binoculars and ran backoutside, it was still above slightly to the north. When I got a good look atit, it was a black triangle wider than long, kind of like a hang-glider, withall red accross the back. It made some turns back and forth then stopped,hovered for maybe 15 seconds rotated in place then shot off to east like abullet. When it took off, it was instant full speed with no noticeableacceleration. About 4 - 5 seconds later a commercial jet flew over going inalmost the same direction. The jet left a contrail, the object did not. Also,I could just hear the jet noise, but the object made none.It looked to me, the object was at about the same altitude as the jet justscimming the bottom of a small puffy white cloud. The object also looked aboutthe same size as the jet, a little smaller than my little finger nail at armslength. I believe someone else had to have seen this being a mostly clear daywith just a few puffy clouds. I also believe the pilot of the jet must haveseen the object. The object was in my sight for most of about three and a halfto four minutes."],"City":"South Bend","Weather Factors":"Unknown","Tags":"City"}