{"City":"Simi Valley","Weather Factors":"Unknown","Object Shape":"Disc","Case Number":"32050","Date of the Event":"07/17/1998 02:00 UTC","files":["/var/www/straped/mufon/html2text/32050.html.txt","/var/www/straped/mufon/org/32050.html"],"trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around July 17th 1998"],"Summary":"Ufo Light up Simi Valley in July","Object Features":"Unknown","Viewing Distance":"Unknown","Longitude":"-118.737101","divs":["Sighting DetailsIt was a warm night in july,and I couldn't sleep so I decided to go outside and look into the sky without My video camera.I saw in the distance a pulsating white light that danced in the sky,I ran back in the house and Immediately grabbed my video camera and started to film the object in the sky.I Honestly thought that this object was very weird looking because it kept dancing in the sky,I could figure it out.But the real party was just getting started,all of a sudden a BRIGHT INCREDIBLE DISC SHAPE OBJECT DANCED INTO MY VIDEO SO CLOSE THAT IT WAS SCARY.I knew than that what I filming what not from EARTH,I almost felt that they KNEW that I WAS FILMING THEM.The object MOVED at such HIGH SPEED IN MY CAMERA LENS,that I WAS SO STUNNED.Local Channel 9 video bought My TAPE,and the reporter that'' YOU have something INCREDIBLE''.Even when I called them up,they thought I was filming a Plane or it was fake,until they saw MY video.They new than that what i had was so real and downright SCARY. I Please need to get this video watched by Professional UFO investigators. I am going to get this video preserved to dvd."],"Sighting Duration":"00:01:59","Object Flight Path":"Undisclosed","Date Submitted":"09/24/2011 04:32 UTC","Source":"MUFON","Log Number":"US-09242011-0009","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.271167,+-118.737101(32050)&iwloc=A&hl=en\"> mufon case (32050) map </A>","Latitude":"34.271167","Region":"California","Disposition":"Insufficient Data"}