{"Tags":"City","Log Number":"US-09242011-0011","Date of the Event":"09/23/2011 06:20 UTC","Object Shape":"Sphere, Star-like, Triangle","Disposition":"IFO","Region":"Montana","map":"<A HREF = \"http://maps.google.com/maps?q=45.68457,+-111.040599(32052)&iwloc=A&hl=en\"> mufon case (32052) map </A>","Object Features":"Unknown","divs":["sighting detailsi walked out of my shop at exactly 6:20 am and noticed a very large plane flying across the sky east to west just south of bozeman, as i was observing the plane i noticed what i thought was a typical satellite flying across the sky from south to north and west of bozeman when suddenly it stopped for a moment and then changed direction from west to east. this object\\light appeared to be in space or very far away soon after it changed direction i lost sight of it. at almost the same moment that i lost sight of the small satellite like object i noticed a very large bright star like object moving from the s. west to the n. east coming straight towards me. this thing was very large and silent, the lights did not flash and i could not notice any kind of strobe as i was trying to identify it as a possible giant plane. the object flew right over my head and continued towards the n. east and never changed direction, it moved at a very steady speed, it appeared to be pretty high in the sky but, it was lower then some of the clouds i was expecting to lose sight of it as it approached some clouds but, it was lower then them and i continued to watch it until it was just to far away to see. when the object was very far away but, still barley visible a jet did take off west to east from gallatin field. now for the kicker! this morning 9\\24\\11 at exactly the same time 6:20 am my wife observed an object very similar to what i saw yesterday only she saw it making zig zags and changing altitude right over bozeman she observed this for several minutes.she came to wake me and when we rushed out to look it was gone. i did not have my phone on me when i made my observation therefor i have no pics or video."],"Object Flight Path":"Straight-line path,Path with directional change","City":"Bozeman","Weather Factors":"Unknown","Country":"United States","Latitude":"45.68457","Source":"MUFON","trends":["There have been 9 other sightings in Bozeman","There was one other sighting in Bozeman on or around September 23rd 2011"],"Sighting Duration":"Undisclosed","Date Submitted":"09/24/2011 10:09 UTC","Case Number":"32052","files":["/var/www/straped/mufon/html2text/32052.html.txt","/var/www/straped/mufon/org/32052.html"],"Viewing Distance":"Unknown","Longitude":"-111.040599","Summary":"Looked like a Very bright star or planet only it moved!"}