{"Weather Factors":"Unknown","City":"Oceanside","Source":"MUFON","Case Number":"32056","Disposition":"Unknown","Country":"United States","Object Shape":"Diamond","Tags":"City","Date Submitted":"09/24/2011 02:08 UTC","Latitude":"33.216445","divs":["sighting detailson september 8th, 2011 during the blackout that covered san diego county, i went out the front door several times to observe. the night was clear and cool, only a few stars were visible, really great night. across the the street a neighbor had a portable generator runnung. he was the only visible house with lights on. i recall hearing and seeing a helicopter circling in the area. at one point, maybe aound 6-7 pm i went outside and noticed an object with red, green, and white lights hoving straight out from my house. the helicpoter was gone. the object's shape was difficlut to tell because of the lights. it did appear to be a vertical diamond shape with the top flatter than the bottom. it moved slightly up and down and horizontally, but essentially stayed in the same spot. my first thought was that it was an airplane because i had seen a distant airplane about this time. the airplane i observed\\heard moved away and soon disappeared. the object hovered in the same area. it appeared to be about 1-2 miles to the east and about 500-1500 feet above the ground. i thought several times, of getting my camera, but for an unexplained reason i did not. i have no photo record. the object was in the same place for at lease 4 hours. i wnet outside several times and saw it. as best i can recall this is my first ufo sighting."],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Log Number":"US-09242011-0014","Object Flight Path":"Stationary","Region":"California","Summary":"OBSERVED AT NIGHT ABOUT 1-2 MILES AWAY","files":["/var/www/straped/mufon/html2text/32056.html.txt","/var/www/straped/mufon/org/32056.html"],"Longitude":"-117.249554","Date of the Event":"09/08/2011 12:00 UTC","trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around September 8th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.216445,+-117.249554(32056)&iwloc=A&hl=en\"> mufon case (32056) map </A>"}