{"Summary":"Disc shape as large as jet in photogragh taken with smaller disc behind","Weather Factors":"Unknown","Object Shape":"Disc, Sphere","Object Features":"Dome","Sighting Duration":"Undisclosed","Country":"Canada","Longitude":"-119.421474","trends":["There have been 9 other sightings in Kelowna","There were no other sightings in Kelowna on or around September 23rd 2011","This sighting has never been favorited.",""],"divs":["Sighting Details I was at work on the car sales lot and noticed there were a number of Jet contrails overhead so I decided to take a few Photos of the Jet just to see if I could identify it. I downloaded the Phtograpghs to my computer and when I opened the images I could see a very small object out in front and above the jet. there was also a evry tiny dot behind and above the jet. When you zoom in on the photo you can clearly see a huge disc shaped object above and in front of the jet and you also will se a smaller disc shaped object flying on an angle behind and above the jet, almost in line with the disc out front. I was totally shocked and surprised to see these two objects in the photogragh and all my coworkers were just as surprised as I was. What are these discs doing here? Who is piloting these objects and why are they flying along withan unmarked jet spewing contrails or Chemtrails? I went outside again about a half hour later to phtograph another one of these jets and to my amazement there is an unidentified object behind and above that jet as well. It's a different shape almost looks wedge or arrow shaped but about the same size as the jet in the photo. Don't know what's going on here but it is pretty curious! These jet pilots had to have known these objects were there, especially the first one as the disc out front and above is as big if not bigger than the jet itself! I get the distinct feeling that we are being lied to and not in any small way either! The government knows a heck of a lot more than they are saying! These objects seem to me to be working in unison with these jets. And justr what exactly is in those contrails? There had to have been at least tywenty ot more of these flights over our skies here yesterday. All at about the same altitude but on different flight paths and all spewing these large contrails. It seems to be happening on pretty much a regular daily basis lately. I will definitely be taking more photos of these jets just to see how common this phenomenon of other unidentified objects along with them is! I could not see the objects with my bare eyes and it was not untill I downloaded the images to my computer that I could see the objects. I have not edited the photos in any way, they are just as they came from my camera. I wish I had a good zoom lens for the camera but unfortunately I can't afford one at the moment. I was using my Cannon EOS Rebel XSi camera with an 18-55mm lens zoomed in as far as possible and using the image stabilizer mode on automatic camera settings. I have attached the two photographs, unedited and also a third with the two objects circled ( A copy of the first photo) You may not see the objects very well at first as the jet and the objects were flying at a very high altitude and quite a distance from where I was standing, but just blow the photos up a small amount and it becomes quite apparent. When you really zoom in on the front disc in the first photo you can clearly see that it is a disc shape and has shadow on the bottom and is sunlit on the top. and you can also see the back disc is lit from the sun on the front edge while the back is in shadow. It is on it's side following behind and above the jet. You can also see that these jets seem to have no external markings of any kind. None on the fuselage and none on the tail or the wings that I can see. Just plain white jets spewing plain white contrails. But it's these discs that truly have me wondering!"],"Tags":"City","Disposition":"Unresolved","Object Flight Path":"Straight-line path","City":"Kelowna","Date Submitted":"09/24/2011 01:39 UTC","Case Number":"32055","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32055.html.txt","/var/www/straped/mufon/more/32055_submitter_file1__skywatch005.JPG","/var/www/straped/mufon/org/32055.html"],"Viewing Distance":"Over One Mile","Date of the Event":"09/23/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.885366,+-119.421474(32055)&iwloc=A&hl=en\"> mufon case (32055) map </A>","Region":"British Columbia","Latitude":"49.885366","Log Number":"CA-09242011-0013"}