{"Longitude":"-86.71197","Log Number":"US-09252011-0002","Weather Factors":"Unknown","divs":["sighting detailsmy husband and i were on i-65 n, after going to see a movie, we were headed home from rivergate. we were on two mile pkwy (rivergate pkwy)entry ramp to the interstate and after we topped the hill that is where we observed a rectangular shaped object hovering almost directly above the tyson plant. i can only assume it was rectangular in shape from the lights. the lights on 2 corners were white and blue\\green flashing in color. the lights on the other 2 corners were a purplish\\orange white. it was huge. my husband observed it, however he was driving. we drove past it and it sat there. didn't move an inch. i turned in my seat and still watched it sit there, until we past millersville exit ramp and topped the hill on the other side. i could not believe what i saw... it had to have been the length of a commercial jet and i know that other people had to have seen it as well. the lighting on the ground below it and from the cars on 65-s made it impossible to make out any more details. i just wish that we could have stopped and observed it better but we had to get home to my brother who was on the phone with me at the time. i had cellphone interference as well."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.325107,+-86.71197(32068)&iwloc=A&hl=en\"> mufon case (32068) map </A>","Source":"MUFON","Summary":"Huge rectangular shape","Date Submitted":"09/25/2011 01:14 UTC","Latitude":"36.325107","City":"Goodlettsville","Case Number":"32068","Viewing Distance":"501 Feet - 1 Mile","Region":"Tennessee","trends":["There have been 5 other sightings in Goodlettsville","There were no other sightings in Goodlettsville on or around December 14th 1971"],"Date of the Event":"12/14/1971 12:00 UTC","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/32068.html.txt","/var/www/straped/mufon/org/32068.html"],"Tags":"City","Object Flight Path":"Stationary","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Object Features":"Unknown"}