{"Country":"United States","Date of the Event":"09/24/2011 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Elizabeth","There were no other sightings in Elizabeth on or around September 24th 2011"],"Viewing Distance":"Unknown","Longitude":"-79.881371","Date Submitted":"09/24/2011 10:59 UTC","divs":["sighting detailswe were driving along highway 51 just south of elizabeth, pa at approximately 8:57 p.m on september 24, 2001. we noticed many (40+) orange orbs exactly as described in the below hyperlink. http:\\\\www.examiner.com\\ufo-in-national\\multiple-orange-lights-move-unison-over-pennsylvania we exited off hwy 51 at w. newton road where we were continued along rainbow run rd for approximately 1 mile until a clearly appeared. we stopped along side of the road where we were one of about 7 cars parked viewing the same thing. no one had a clue of what it could be. no sound. nothing. just orange orbs. once we stopped and watched for about 2 minutes, they moved in a horizontal direction. at this point we had only could view about 10 orbs with all the tree cover. after about 2 minutes that just disappeared. not much fading or anything. we then proceeded back towards the highway where we pulled off for about 5 minutes at the entrance ramp to hwy 51 off of rainbow run rd. from that vantage point after about the first 2 minutes about 5 orange orbs reappeared. they too disappeared after about 1 minute. again, after about another minute 2 more orange orbs reappeared for a third time. these two orbs were present for about 1 minute. they seemed to join into one light as they \"fly\" away. then they disappeared, never to reappear. i called the pittsburgh international airport to see what they had on radar, and they reported that the supervisor had nothing and no other reports. i also contacted the pittsburgh post gazette to report the story. they too had no other reports. to sum this up, just saw many (40+) orange orbs that appeared to hover until we got as close as you could were they then moved horizontally. they disappeared and reappeared 3 separate times. no explanation as to what it could be. most bizarre thing i have ever seen."],"Disposition":"Unresolved","Region":"Pennsylvania","Summary":"40+ Orange orbs appeared hovering at a distance. Once we got closer they moved horizontal.","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Case Number":"32065","map":"<A HREF = \"http://maps.google.com/maps?q=40.276677,+-79.881371(32065)&iwloc=A&hl=en\"> mufon case (32065) map </A>","files":["/var/www/straped/mufon/html2text/32065.html.txt","/var/www/straped/mufon/org/32065.html"],"Tags":"City","Object Shape":"Sphere","Latitude":"40.276677","City":"Elizabeth","Object Features":"None","Source":"MUFON","Log Number":"US-09242011-0023"}