{"Date Submitted":"09/25/2011 01:58 UTC","Region":"Oregon","Case Number":"32069","Sighting Duration":"Undisclosed","Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=45.287929,+-122.535342(32069)&iwloc=A&hl=en\"> mufon case (32069) map </A>","trends":["There have been no other sightings in Beavercreek","This sighting has never been favorited."],"Longitude":"-122.535342","Summary":"Two fire ball blaze orbs hovering in sky, moving up and down as if they were helicopters, but there was no sound. Eventually both crossed paths and I could see a reflection of light off the other object.","Source":"MUFON","City":"Beavercreek","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","Date of the Event":"09/21/2011 11:38 UTC","Latitude":"45.287929","Disposition":"Insufficient Data","Tags":"City","Log Number":"US-09252011-0003","Country":"United States","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/32069.html.txt","/var/www/straped/mufon/org/32069.html"],"Viewing Distance":"Over One Mile","Object Features":"Unknown","divs":["Sighting DetailsI just recently moved back out into the country on 80 acres of field. Ranch to be exact. As i was laying in bed looking out the window i noticed a very bright light in the sky at first thought it was a planet maybe but than colors starting changing from blue to green to white like flickering or it was spinning. Than noticed it was not up in the sky alone another object almost identical but it had more of a orange glowing orb. They were hovering like moving up and down very quickly. I thought maybe my eyes playing tricks on me so i put these objects in my sight and indeed they were the ones moving in such a strange way and so quick. Than one crossed in front of the other i thought they would hit eachother but instead i witnessed a reflection of light from one onto the other at a very strange angle. These were no planes. Next i witnessed the fire like ball move very fast downwards toward the tree line across the field like it was going to land or crash. It hit the tresses and vanished. As for the other objects slowly dimmed faded lights but continued to move up and down and back and forth right in front of my eye. I should have taken photos there were no other lights out its very dark out here. I was just in Awwww over what i was witnessing. The next morning on the news people said they saw meteorite oh than it was a fireball or blaze...all i knew than was i wasn't the only one who saw this. But what they were...? I believe UFO"]}