{"Weather Factors":"Unknown","Tags":"City","City":"Undisclosed","Disposition":"Unknown","Object Features":"None","Country":"United States","Summary":"UFO Landing In Gila Wilderness Near Murdock's Hole On Gila River","Case Number":"32067","Date Submitted":"09/25/2011 12:55 UTC","Date of the Event":"09/23/2010 07:30 UTC","divs":["sighting detailson thursday september 23rd 2010 at 7:30 pm in the evening, our backpacking group of eight was encamped near alum camp on the gila river. it was a very clear night with virtually no cloud cover and the moon had not risen enough above the mountains to shine down into the gila river valley. we had just completed dinner and had begun cleaning up the mess gear. everyone was sitting around the fire talking like people usually do on such occasions. after cleaning up the dishes, i walked out away from the fire, past my tent and found a nice place to urinate before i went back to join the crowd by the fire. i was facing downriver from our location looking down the river valley. as i stood there relieving myself, i noticed a bright light, much larger than a star and considerably brighter begin descending from the sky straight down into the river valley. it dropped steadily lower until it was below the mountain ridge line towering over the river valley and was now silhouetted with the river valley cliffs above it. it was then i was certain i was looking at a possible ufo. at this juncture, i hollered at my trail companions and they all came out to where i was standing to observe the phenomena. we all watched the craft noiselessly descend to treetop level, jink back and forth a few times, then turn on a light on the bottom of the object's hull which was aimed below the craft into the trees below. presently, the object appeared to hover and then settled down below the treeline at which point we lost visual sight of the object. entire incident from the moment of initial observation to conclusion was maybe 15-20 minutes in elapsed time. we tried to videotape the craft and only got a single clear view of the object on the video footage --the point where the craft put the light beam down into the forest. everyone including the cameraman was pretty agitated and the camera moves around a goodly bit which is disruptive of the overall view of the ufo. however, after carefully examining the film footage at length, i could easily make out a known mountain ridge's appearance directly behind the object. i was then able to guesstimate the distance from our vantage point to the object as approximately 1 1\\2 miles distance downriver from our campsite."],"Log Number":"US-09252011-0001","Source":"MUFON","Longitude":"-105.026364","files":["/var/www/straped/mufon/html2text/32067.html.txt","/var/www/straped/mufon/org/32067.html"],"trends":[],"Viewing Distance":"Over One Mile","Object Shape":"Disc","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.98158,+-105.026364(32067)&iwloc=A&hl=en\"> mufon case (32067) map </A>","Region":"New Mexico","Object Flight Path":"Other","Latitude":"34.98158"}