{"Region":"South Carolina","Sighting Duration":"00:03:15","divs":["sighting detailsi saw what looked like a satellite going over but it was brighter than the normal ones i had seen and bigger. it was moving at a fast rate of speed from south to north in a straight line. i then saw another object that i thought was a satellite but not as bright and smaller moving from north to south in a straight line but slower. all this is w\\in minutes. i then saw two objects, one behind the other not too bright and very far up going from north to south. even w\\binoculars i could not get the shape or tell what it was. they all appeared to be rotating. i then saw two more very high up going from ne to sw, again following one another. the last one i saw again looked like a satellite i see once in a blue moon where i live going over. i followed it with my binoculars and all of a sudden it flashed a huge bright light aspirin size and it scared me for i thought it was coming down towards me. i took the binoculars away and the light was still on and then it went off and i continued to follow it from north to south out of sight when it went over my house. it seemed to stall and stay stationary as the bright light came on. the light was white and very bright like looking into the high beam of a headlight on an automobile. it was almost blinding. my neck hurt so from looking up in 10min i had to come in but will go back out later and look. i have no way of taking night pictures or night video for with my digital camera they do not show up that far away. i do live in the country with no street lights and it is very dark and the night was clear so i have an excellent viewing area. i hope to get a telescope when i can afford it! this is my account of what happened."],"Summary":"Saw w/in 10min 7 objects moving S to N & N to S, one E to W very fast, some slow, one behind the other, one flashed bright light & then it went off.","Tags":"City","Source":"MUFON","Longitude":"-83.054846","Latitude":"34.813475","Viewing Distance":"Over One Mile","Log Number":"US-09242011-0018","Date Submitted":"09/24/2011 09:27 UTC","Object Shape":"Disc","trends":["There have been no other sightings in Walhalla","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/32060.html.txt","/var/www/straped/mufon/org/32060.html"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.813475,+-83.054846(32060)&iwloc=A&hl=en\"> mufon case (32060) map </A>","Date of the Event":"09/24/2011 08:40 UTC","Disposition":"Unresolved","Object Flight Path":"Path then hovering","City":"Walhalla","Country":"United States","Case Number":"32060","Object Features":"Other, Unknown"}