{"files":["/var/www/straped/mufon/html2text/3207.html.txt","/var/www/straped/mufon/org/3207.html"],"Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","Tags":"City","divs":["Sighting DetailsI take a walk whenever weather permits with my cats, preferably at night.I had dreamed of ufos a month previously which caused me to think I would beseeing some soon. This is how my sightings frequently happened in the past, Iget notice.It was a lovely night and I was watching the sky as usual but not expectinganything peculiar though I love to see shooting stars, meteors, airplanes andsatellites. Iam quite familiar withlocal air traffic patterns and what goes onin my neck of the woods. Amo is about 500 population and the cemetary has around paved road so it is ideal for a walk and the south side looks out at openfields and countryside facing south.I was looking up and saw two dim white lights slightly larger than a star butmuch closer. One was over the other slightly above and they moved in tandem asone very slowly then without stopped after two seconds or so just winked outcompletely.I see planes and heliocopters all the time and know the differenceThese objects made no noise whatsoever. This is just one report.15 minutes earlier on the other side of the round walkway I saw what I thoughtwas a meteor at first. It was a single dim white light larger than a star andcloser yet very high up about 50 degrees or so moving from left to right again,very slowly then without stoppin it lit up considereably and looked veryintensely bright white and larger as a result, I believe of the intensity.Then it kept moving grew dim again then simply winked out How odd to see boththese instances at once when I usually have sightings sometimes years apart.but then I had been asking to see them mentally and calling them so it did notseem like a real surprise. I am going out every night now that it does not rainand taking my camera and binoculars in case. I love being outside anyway.Many people I know have seen things here and are afraid to discuss out of fearof ridicule. I myself talk to only people who are like-minded."],"trends":["There have been no other sightings in Amo","This sighting has never been favorited."],"Sighting Duration":"00:00:00","Region":"Indiana","Viewing Distance":"Over One Mile","Summary":"white lights over Amo cemetary, Indiana","Case Number":"3207","Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Country":"United States","Object Shape":"Undisclosed","Latitude":"39.688102","Date of the Event":"08/24/2004 10:30 UTC","Longitude":"-86.613613","City":"Amo","Date Submitted":"08/24/2004 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.688102,+-86.613613(3207)&iwloc=A&hl=en\"> mufon case (3207) map </A>","Log Number":""}