{"divs":["sighting detailson friday, september 23, 2011, my girlfriend and i were staying in a hotel in west palm for holiday. i had actually stepped out to smoke and looked up at the sky. i also did remember seeing a brief moment of lightening but it was just a one streak caught out of the color of my eye. s i saw the most \"whitest\" cloud i had ever seen and it freaky thing was at the bottom where a cloud is usually \"curvy\\billowy\" this cloud was squared on the left side ( like it was cut out with a level). there was lights reflecting out of it. at first i thought it was one of those things that nightclubs do then i realized there was no way. i knocked on the hotel door got my friend out and she saw it too. there was no lights coming from the ground and the lights in the clouds were a white \"rainbow\" color. they actually appeared to be \"dancing\"..anyway. i honestly kept thinking i was making too much of it, i must of missed the outside influence.etc..though i must mention both she and i both appeared to have an almost physical reaction on viewing. later on, neither of us admitted to fear but we both seemed to feel an almost \"joyful\" feeling.. i was actually ready to chalk this up to something, and i had to be somewhere so we left. as we drove up the highway. this cloud was next to us. there was no logical explanation on how it could be doing this and it was not stationary at all. it was there from the hotel where we were staying until we drove on to i believe i-95, it was gone, like it never existed. i have never seen a cloud like that ever. i do not drink,. she was not drinking and we were not high. i do not know what i saw."],"Object Features":"Unknown","Longitude":"-80.054485","Case Number":"32074","Log Number":"US-09252011-0008","Latitude":"26.685883","Object Flight Path":"Stationary","Date of the Event":"09/23/2011 08:20 UTC","Disposition":"Hoax","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.685883,+-80.054485(32074)&iwloc=A&hl=en\"> mufon case (32074) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/32074.html.txt","/var/www/straped/mufon/org/32074.html"],"Country":"United States","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"09/25/2011 11:08 UTC","City":"West Palm Beach","Sighting Duration":"Undisclosed","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around September 23rd 2011"],"Summary":"strange cloud/lights/west palm","Object Shape":"Unknown"}