{"Case Number":"32075","divs":["Sighting DetailsI was walking toward my house from across the street and looking up at a light in the sky that I thought was a commercial airline comming my way from the north. I have been looking up at the sky in that direction because an exact occurance of what I am now relating happened once before in July. The object (just a spec of light at first) grew much larger as it came nearer but did not have the shape of an aircraft- just a red- orange \"fireball\" appearance(even when viewed through binculars) There was no sound as it followed a straight course to the south. At its closest point, it seemed to be less than 1 mile away and was the size of a streetlight about 1 block away. As before, it was followed by 3 similar objects that appeared at the same point near the northern horizon and moved on the same course.These objects kept the same approx distance from each other(maybe a third of a mile). When the first of these 4 got closest to me, 1 half mile overhead and just south of my location, it seemed to increase speed and change direction. It then travelled straight up and disapeared. Each obect repeated this same course and each disapeared moving upward. When the similar incident occured in July, the objects moved in the same course but they were closer to where I was standing. Both of these incidents happened right over the Delaware Bay shoreline."],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/32075.html.txt","/var/www/straped/mufon/org/32075.html"],"Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=39.091814,+-74.819079(32075)&iwloc=A&hl=en\"> mufon case (32075) map </A>","Region":"New Jersey","Disposition":"Unknown","Date of the Event":"09/24/2011 12:00 UTC","Latitude":"39.091814","Summary":"I witnessed 4 objects appearing to be fireballs but moving like aircraft","Weather Factors":"None","Object Features":"None","Log Number":"US-09252011-0009","Object Flight Path":"Path with directional change","Longitude":"-74.819079","Tags":"City","Country":"United States","Date Submitted":"09/25/2011 11:40 UTC","trends":["There have been 2 other sightings in Middle","There were no other sightings in Middle on or around September 24th 2011"],"City":"Middle","Sighting Duration":"Undisclosed","Source":"MUFON"}