{"Object Shape":"Square, Rectagular, Other","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/32070.html.txt","/var/www/straped/mufon/org/32070.html"],"Sighting Duration":"Undisclosed","Date Submitted":"09/25/2011 02:32 UTC","trends":["There have been 21 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around September 24th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.10257,+-94.155833(32070)&iwloc=A&hl=en\"> mufon case (32070) map </A>","divs":["Sighting DetailsI checked out at Wal-Mart at 22:39 and walked out and I remember thninking that it was WAY too early to have Christmas lights out but there they were a dull red, crimson red, really red in the shape of a huge letter H on the mountain between myself and home. I was curious because they didn't look right so I took a different way home that would put me closer to the lights. when I got on the street the car in front of me had spotted the lights and was driving very slowly as was I. I topped a hill and saw some cars coming up behind me at a high rate of speed. There were three police cars running flat out. They may have been going 100 MPH or faster headed in my direction which was South. The \"object\" was moving a little to the left and a little to the right as if it were looing for something and suddenly (and I do mean very suddenly) it took off to the south at an unbelieveable speed and was gone. The police cars had gone over the hill. When it took off I noticed I could see lights on the hill that I could not see before. That's how I estimated the altitude. This thing was huge. The police cars were running silent and without their emergency lights on. I am not 100% positive they were chasing it but Fayetteville was fairly quiet tonight. I got home and called my son who had seen something in the sky in Bentonville headed south that was curious but theoretically explainable because he was farther away than I was. He saw it from the side and I saw it from directly below. That's it. This thing was really REALLY huge and incredibly fast and in the shape of (of all things) a capital letter \"H\"."],"Latitude":"36.10257","Object Flight Path":"Path with directional change","Source":"MUFON","Tags":"City","Country":"United States","Region":"Arkansas","Log Number":"US-09252011-0004","City":"Fayetteville","Longitude":"-94.155833","Summary":"A huge letter H in blood red lights","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Case Number":"32070","Weather Factors":"Unknown","Date of the Event":"09/24/2011 12:00 UTC"}