{"Latitude":"35.921715","Log Number":"US-09252011-0012","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/32078.html.txt","/var/www/straped/mufon/org/32078.html"],"Source":"MUFON","Object Shape":"Egg, Oval","Longitude":"-77.888468","Date Submitted":"09/25/2011 01:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.921715,+-77.888468(32078)&iwloc=A&hl=en\"> mufon case (32078) map </A>","Disposition":"IFO","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Features":"Dome, Unknown","Summary":"supersonic yet silent flyby, nearly overhead","Case Number":"32078","City":"Rocky Mt","trends":["There have been 3 other sightings in Rocky Mt","There were no other sightings in Rocky Mt on or around September 23rd 2011"],"Region":"North Carolina","divs":["sighting detailsi had been driving, southeast to northwest, home after a trip to the store when seeing a bright orb like or sphere like light fly nearly overhead in a manner of about 2 seconds from horizon to horizon, traveling slightly more south to north than i. it may have had a slight \"egg\" shape, although i believe that effect was just the speed of travel visually \"stretching\" whatever it was i witnessed. the first thing that got my attention was the speed, size and brightness. i don't believe i thought of anything other than a feeling of curiosity, my instinct was to follow but there was no chance. the night had been foggy\\hazy in early evening. by 9:33pm visibility had increased to one of the clearest views of the milky way ever seen from this area... very rare within itself. we have an airport about 6 miles due south, my first thought was the rotational beacon shining on an otherwise transparent fog bank but this was far too intense and had zero curvature to it's path. the closest metaphorical description would be the clarity, brightness and contrast of a full moon, without crater contrast within, and a slightly more \"yellow\" hue(red shift?), using the \"at arms length size comparison\"(finger, knuckle, fist,etc.). with little to no way to judge distance and the speed at which the object traveled, it could have been at tree top elevation up to a couple 1000ft. or so. intuition tells me it's in the range of 100-1000ft elevation, otherwise speeds would be absolutely unprecedented for anything with significant mass. with several hundred hours observing the night sky, i have ruled out nearly every natural phenomenon from meteorite to known man made craft. there has been an influx of military presence in the sky the past week or so, but there should have been a sonic boom, which is unlawful here without direct order, yet there was none. i have witnessed night time and day time supersonic flight at multiple elevations, this was much, much faster in my opinion and had no exterior lighting other than the item itself which appeared to be \"made of light\"."],"Date of the Event":"09/23/2011 09:32 UTC","Weather Factors":"None","Tags":"City"}