{"Disposition":"IFO","divs":["sighting detailsmy husband and i were driving home that afternoon. i was in the passenger seat looking out the window as we approached this greyish-black colored sphere right next to the highway. we were heading east on state highway 45 toll road just passing aw grimes blvd. the object was to the left of us about half a mile from us, just above a neighborhood built on the access road to the left of the toll. it was so obvious to us that i couldn't help but stare at it for a few seconds... it was right above the houses, but high enough that i knew it wasn't a balloon. it was larger then a balloon, as the pictures show, about 3-6 feet from what i could tell from the distance... i could not see anything holding it up in the air, nor did i view any other objects near it. as we got closer to the object, i remembered i had our camera in my purse. i quickly grabbed my camera and snapped two pictures. this object, from the way the pictures appear, was low in the sky, about 20-30 feet above the power lines. this object had no light shining off of it, however it seemed to reflect a small area of light from what i am assuming was the sun's rays. this object made no noise, and as i could tell, did not move, spin, or rotate in any way. it just remained in the sky as if it was just there to settle itself. the texture of this craft\\object appeared to be metal looking, more grey then black. as i snapped these pictures, we passed the object and i was able to get a still close up of the object... :) to this day, i do not know what that was and i would love to figure it out! unfortunately it has been 4 years since i have taken these photos, and all that i have are the files saved from my computer...however, i have been extremely curious as to what i saw, and want clarification and\\or an explanation of what it may be..."],"Summary":"Just hovered over the houses near the tollroad. Did not move, perfect spere, and large enough I had to take a picture!","Country":"United States","City":"Austin","Object Flight Path":"Stationary","Weather Factors":"Unknown","Object Features":"Unknown","Case Number":"32081","Date of the Event":"04/08/2007 12:00 UTC","Viewing Distance":"101-500 Feet","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around April 8th 2007","This sighting has never been favorited.",""],"Latitude":"30.273093","map":"<A HREF = \"http://maps.google.com/maps?q=30.273093,+-97.740101(32081)&iwloc=A&hl=en\"> mufon case (32081) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/32081.html.txt","/var/www/straped/mufon/more/32081_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/32081_submitter_file2__ufo2.jpg","/var/www/straped/mufon/org/32081.html"],"Region":"Texas","Date Submitted":"09/25/2011 07:28 UTC","Object Shape":"Sphere","Source":"MUFON","Longitude":"-97.740101","Log Number":"US-09252011-0015","Sighting Duration":"Undisclosed"}