{"Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32082.html.txt","/var/www/straped/mufon/more/32082_submitter_file1__UFO.JPG","/var/www/straped/mufon/more/32082_submitter_file2__UFO_Wide_Angle.jpg","/var/www/straped/mufon/org/32082.html"],"City":"Asheville","Longitude":"-82.585459","Disposition":"IFO","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.638159,+-82.585459(32082)&iwloc=A&hl=en\"> mufon case (32082) map </A>","Source":"MUFON","Case Number":"32082","Date Submitted":"09/25/2011 08:00 UTC","Summary":"Photo of unknown object with a reflective dome taken while photographing the sun","Object Flight Path":"Unknown","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around September 25th 2011","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","divs":["Sighting DetailsI observed this phenomenon only after the fact, since I was photographing the afternoon sun and couldn't look in the area long where the object appeared in the photograph because the sun was so blinding. I didn't have any contact with entities or heard strange noises when I took this image. I was out trying to capture a decent photograph of the afternoon sun in the southwestern sky through a telephoto lens of my DSLR. After I came back and reviewed my photos, an odd object appeared in one of my images. It neither looks like an airplane or a helicopter, but appears to be a saucer shaped object tilted toward the sun. It also appears to be metallic and seems to be have a dome that reflects the sun's light. I do not know what kind of object this is and it doesn't appear to be any kind of conventional aircraft. Since my DSLR has a fairly high resolution, I have both a cropped version of the photograph and the original wide angle copy in order to find if there is any type of obvious details that this object has that would give away it's true identity, or verify it as a real UFO."],"Log Number":"US-09252011-0016","Region":"North Carolina","Date of the Event":"09/25/2011 05:18 UTC","Object Features":"Dome","Latitude":"35.638159","Object Shape":"Disc, Saturn-like, Sphere","Tags":"City"}