{"files":["/var/www/straped/mufon/html2text/32084.html.txt","/var/www/straped/mufon/org/32084.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.681446,+-104.87449(32084)&iwloc=A&hl=en\"> mufon case (32084) map </A>","Country":"United States","Longitude":"-104.87449","Object Flight Path":"Stationary","Case Number":"32084","Source":"MUFON","Object Features":"Unknown","Date of the Event":"09/25/2011 06:25 UTC","Date Submitted":"09/25/2011 09:11 UTC","City":"Denver","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around September 25th 2011"],"Viewing Distance":"Unknown","Object Shape":"Square, Rectagular","Weather Factors":"Unknown","Latitude":"39.681446","Disposition":"IFO","Summary":"I thought it was a satellite but it didn't move. Binoculars revealed square object.","Log Number":"US-09252011-0018","Region":"Colorado","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI called the non-emergency police phone number, and they had not received any other calls about this object, which they hadn't. There wasn't anything they said they could do, except send a deputy out if I wanted (I didn't see the point of that). The object almost looks like the first star that comes out, or a planet, but it was still very light outside. The object is above the clouds--in other words, the clouds would sometimes obscure my view of it. My wife saw the object, too, as did my little girl (who said it scared her). I had time to get my binoculars and look more carefully. Although this wasn't much magnification, it showed that the object was more square-like in appearance, and it was very shiny...more silver than white, but it was reflecting the sunlight. It seemed like it might be made of metal, perhaps. This all happened when my daughter and I were drawing with chalk on our driveway, and I was feeling a little lazy so I laid down on my back and looked up at the sky. There was definitely nothing in the part of the sky where I was looking, and then suddenly there was this mysterious object. Having used a telescope years ago, I know that a stationary object will appear to be moving because of the earth's rotation. This object did not appear to move, in a 30-minute period of time. My reaction was more of curiosity, and I called to my wife to look at it. I wasn't scared, but I just wanted to report this in case others saw it, too. I'm left wondering if it was a satellite? For awhile, I lost sight of the object due to clouds rolling in, but approx. 30 minutes later, the clouds have mostly gone and it is still there! Maybe it is simply watching us?"]}