{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/32099.html.txt","/var/www/straped/mufon/org/32099.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Circle, Egg, Sphere","Region":"Mississippi","divs":["Sighting DetailsWe were returning from a trip from Alabama headed home to Louisiana so we were driving west on I-10. It was approximately between 8-9 p.m. September 25, 2011. I suddenly saw a large orb traveling from the upper left portion of the sky descend to the bottom right and then disappear (I'm assuming over water but couldn't tell). My father-in-law said \"Look! Look! Look!\" There were four adults and we all saw it. It was very large and glowed brightly. I keep trying to think logically that it was a meteor or something falling out of the sky. However, we are all in agreement this was not a falling or shooting star. We could not judge its distance, but it did NOT appear to be very far away yet not very close either. We were traveling in the car and was currently in Mississippi at the time and the object could have been in Louisiana; just couldn't tell. The sky was very dark and very clear last night. Object appeared to be an enormous, unbelievably bright orb in the western hemisphere (we were driving in this direction) and was not-so-slowly descending from left to right then disappeared. Object also seemed to have a very faint, slight tail behind it. It glowed a bright white the entire time and did not appear to have any external lights. I have witnessed falling stars and a meteorites but nothing like this. Otherwise a rather logical person, I must find out if anyone else other than the four of us saw this. We were not the only car on the interstate."],"Date Submitted":"09/26/2011 10:43 UTC","Tags":"City","Object Flight Path":"Other","trends":[],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.360068,+-89.388728(32099)&iwloc=A&hl=en\"> mufon case (32099) map </A>","Longitude":"-89.388728","Source":"MUFON","Date of the Event":"09/25/2011 12:00 UTC","Log Number":"US-09262011-0010","Country":"United States","Latitude":"32.360068","City":"Undisclosed","Summary":"Large, bright orb in seen while driving on I-10 headed west towards New Orleans at approximately 8-9pm Cental time","Case Number":"32099"}