{"Case Number":"32094","divs":["Sighting DetailsMy wife and I decided to take our dogs for a walk around the park, we had been walking for aprox a half an hour, when I noticed a plane. I was watching the plane, and it's collision lights blinking, and was waiting to hear the sound of the jet engine, As I was following the plane across the sky, I noticed a Huge flash. From my position it looked like it was just above the plane, who ever was in that plane must have seen it! As the plane kept on moving, I noticed the flash again in the very same spot, but this time it looked kind of orange and not as bright as the first flash. Aprox 10-15 seconds I saw it flash again, still in the same spot in the sky. My wife and I could not see the object until it would flash,each flash was a different color and a different intensity it would flash aprox every 10-15 seconds and each time the color would change from white which was the brightest intensity, to a brownish , and a yellow orange. The brownish flash kind of looked flat. The yellow-orange was kind of blurry, and more round. The white flashes were at times the size of a golf ball.and extremely bright. my wife and I often go out and watch the sky and just about every night we see what look like stars moving across the sky,but this was a first to not see the object just the flashes of light and extremely bright we watched this object for a good 45 min until we got back home and went in the house.This object stayed in the same spot the whole time it was to the right of orion's belt and below Jupiter I believe it was just about the 5 o'clock position from Jupiter, below and to the right I can not stress enough how Bright and large the white flashes were"],"Object Flight Path":"Stationary","Date Submitted":"09/26/2011 04:26 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.429901,+-70.97921(32094)&iwloc=A&hl=en\"> mufon case (32094) map </A>","Summary":"Flashing Light of different colors no sound","Source":"MUFON","Weather Factors":"Unknown","City":"Milton","Object Features":"Unknown","Latitude":"43.429901","trends":["There have been 2 other sightings in Milton","There were no other sightings in Milton on or around September 26th 2011"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/32094.html.txt","/var/www/straped/mufon/org/32094.html"],"Longitude":"-70.97921","Log Number":"US-09262011-0005","Tags":"City","Region":"New Hampshire","Date of the Event":"09/26/2011 01:20 UTC","Object Shape":"Unknown"}