{"City":"Boise","Weather Factors":"Unknown","Latitude":"43.614231","Object Shape":"Unknown","Date Submitted":"09/26/2011 02:11 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.614231,+-116.205476(32092)&iwloc=A&hl=en\"> mufon case (32092) map </A>","Longitude":"-116.205476","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"IFO","Log Number":"US-09262011-0003","Summary":"Strange lights over Boise, Idaho 9/22/11","Case Number":"32092","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around September 22nd 2011"],"Viewing Distance":"101-500 Feet, Over 1 Mile, Unknown","Object Features":"Unknown","Date of the Event":"09/22/2011 09:00 UTC","Region":"Idaho","Tags":"City","divs":["Sighting Details I was sitting on my front porch last night on West State Street viewing the Southern horizon and I saw a bright yellow light just past, and over St. Lukes hospitol to the East. It had flashing lights that resembled track lights on a plane, but were more speratic and appeared to be running side to side, as if down the side of a vessel. After making its furthest approach towards St. Lukes, it climbs in altitude slightly and then starts traveling in the opposite directions. Shortly after this, I witnessed another yellow light slowly scanning the neighborhoods just to the West and making sudden stops and jerking motions. After this disappears behind some houses, I see an even brighter white light coming from the downtown area heading west towards what now seems to be another yellow light in the West where the last one had originated. As the white light passes in front of me, and only about 10 city blocks away, and about 200 - 300m in the sky, it turns slightly towards my direction while still flying towards the other object in the sky. I can now see that it is very clearly two objects flying side by side at a very fast pace. As they get within a mile of the other object, it flashes and the two objects make an \"S\" shaped retreat vertically and away from the object, and then head back east before disappearing. As a \"UFO enthusiast\", I decided it was time to take a walk. I made it to about where I saw the light scanning to the west and didn't see anything. As I turned back to walk home, I saw another light downtown that looked similar to the one I saw next to St. Lukes, and then disappeared behind some buildings. I walked downtown and went to the top of a eight floor parking garage to get a higher vantage point. From there I saw another set of lights that were so close to each other, they looked like they could have been one object. This was just South of the parking.. Thinking back on it, They seemed to have just come out of a parking lot somewhere off 9th st a few blocks away. Unlike the others that disappeared into the night sky, they disappeared bellow the horizon just before the Train Depot. Seconds later, what I thought was a star for the last several minutes banked West before disappearing. Moments later I saw two lights flying very rapidly about 100 m away from each other from East to West. The front \"vessel\" seemed to have a cylindrical blue light standing vertically on it, but I couldn't make out the actual shape. The rear light was just like the bright yellow lights I had seen before. The rear light, as they approached the Train Depot, sped up towards the other one while the other one looped entirely around the Depot from front to back. The yellow light followed and they both disappeared somewhere behind it. I walked up there and found nothing. This all happened between 9pm and 11pm."],"files":["/var/www/straped/mufon/html2text/32092.html.txt","/var/www/straped/mufon/org/32092.html"],"Source":"MUFON"}