{"Region":"Michigan","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering,Other,Unknown","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown, N/A","Latitude":"42.331042","map":"<A HREF = \"http://maps.google.com/maps?q=42.331042,+-83.750871(32095)&iwloc=A&hl=en\"> mufon case (32095) map </A>","files":["/var/www/straped/mufon/html2text/32095.html.txt","/var/www/straped/mufon/org/32095.html"],"Date of the Event":"09/25/2011 12:00 UTC","Case Number":"32095","Tags":"City","divs":["Sighting DetailsI was going south on Whitmore Lake road at the highway 23 interception. I noticed a strange set of lights in a delta formation moving east to west very slowly strait ahead at about a 40 degree angle from the road. I knew right away that these objects were not conventional aircraft. The way that they moved and the light given off by these objects is almost unexplainable. I raced to a boat ramp a few hundred yards ahead of where I had first noticed the objects, I parked my car, and I ran to the best viewing position that I could acquire. The objects kept moving very slowly, almost hovering at times, without any sound whatsoever. I tried to take pictures and videos of the objects, but it seemed that although the lights seemed bright to my eyes, they were not registering at all on my I-Pod Touch camera. After a couple of tries to document the event with my I-Pod, I realized that it was useless. I kept observing the formation of lights move across the sky with my naked eyes. After a couple of minutes, the object that lead the formation slowly disappeared. About 30 seconds to a minute after that, the light following the lead object slowly disappeared also. The rest of the objects kept their trajectory as a new object came from behind the formation slightly faster than the rest of them. It caught up with the original delta formation as it moved through the sky, then stopped (as the delta formation kept moving slowly,) hovered for a few seconds, it came back at a higher rate of speed and it seemed to lower its altitude by a few degrees until it settled straight ahead of my point of view. As the object hovered straight in my line of sight, I ran to the edge of the river to get the best view I could. Thinking back on that action, now it feels like a futile attempt to get closer to an object that was very far away from me in the first place. Nevertheless, I did it. The object hovered for about 30 seconds to a minute, then it followed its original path at a slightly higher rate of speed and joined it's fellow \"objects.\" After about another minute, they all disappeared almost at the same time..... That's the whole incident..... The whole experience, from the very first second that I noticed the formation of lights until they all disappeared only took about 10 minutes.......... This is strange to say.... But when the last bright \"object\" that came from behind the formation to catch up with \"them\" and then stopped and came back to hover in front of my line of sight for a few seconds..... I don't know?..... I felt like \"it\" knew that I was watching........... Strange........ I hope that this helps even though it's only my experience."],"Country":"United States","Longitude":"-83.750871","City":"Ann Arbor Charter Township","Sighting Duration":"00:09:00","Weather Factors":"Unknown","Log Number":"US-09262011-0006","Object Shape":"Circle, Flash, Oval, Sphere, Triangle, Unknown","trends":["There have been 2 other sightings in Ann Arbor Charter Township","There were no other sightings in Ann Arbor Charter Township on or around September 25th 2011"],"Object Features":"None, Unknown","Summary":"Objects moved from east to west very slow in a delta formation in the southern sky. 5-6 objects. The last one in the formation came back!","Source":"MUFON","Date Submitted":"09/26/2011 08:16 UTC"}