{"trends":[],"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","Latitude":"39.552611","Object Features":"Unknown","Longitude":"-105.779567","map":"<A HREF = \"http://maps.google.com/maps?q=39.552611,+-105.779567(32107)&iwloc=A&hl=en\"> mufon case (32107) map </A>","Case Number":"32107","Log Number":"US-09262011-0014","Tags":"City","Country":"United States","divs":["Sighting DetailsThe first time my wife and I saw these objects, we were out in our front yard,about nine oclock at night, looking at the stars when we noticed strange lights in the sky. we counted five different sets of lights and joked to each other that it was aliens. About two hours later, we were sitting on our front porch. Very bright lights appeared through the trees in our front yard. My wife said to me that a plane was about to crash in front of our house. We ran out to the street in a panic. There was a huge silver craft,that was covered in flashing lights. the lights were flashing every color in the rainbow. The object was hovering about as high as the treetops, very slowly moving toward the north. My wife and I were awestruck. The object was large, about the mass of city bus, but sort of disc shaped. We watched the object for about twenty minutes, then it suddenly lit up bright white. It shone a huge white beam down toward us. We were so frightened that we ran in our house and hid for the rest of the night. We have witnessed these same objects on three other occasions. on another night, we followed an object that looked exactly the same for about three miles. it was moving about thirty miles an hour, just above the treetops. It turned and started coming at us. We ran from it. It was obviously following us, so we just kept driving. I was watching the sky as we drove, there were dozens more of them flying low. I counted fifteen of them, and there were a lot more than that. We drove for forty miles, while they followed us. We have observed these objects many times. They can be seen regularly in the skies over pueblo. I strongly urge anyone who is interested in ufo's to watch the sky above pueblo colorado. There are strange things going there on a regular basis. I have watched these things for hours on end, way too much to type here. Please go check this out."],"files":["/var/www/straped/mufon/html2text/32107.html.txt","/var/www/straped/mufon/org/32107.html"],"Summary":"multiple sightings of bizarre lighted craft. covered in flashing lights, behavior defied physics.","Date of the Event":"09/15/2011 09:00 UTC","City":"Undisclosed","Region":"Colorado","Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Shape":"Disc","Source":"MUFON","Date Submitted":"09/26/2011 12:44 UTC","Sighting Duration":"Undisclosed"}