{"Case Number":"32102","files":["/var/www/straped/mufon/html2text/32102.html.txt","/var/www/straped/mufon/org/32102.html"],"Weather Factors":"Unknown","Disposition":"IFO","Summary":"Daughter saw something that shocked her and breifly described it.It was a yellowish streak almost like a meteor.","Viewing Distance":"101-500 Feet","Date of the Event":"09/25/2011 07:20 UTC","Country":"United States","Region":"Louisiana","map":"<A HREF = \"http://maps.google.com/maps?q=30.23316,+-92.016283(32102)&iwloc=A&hl=en\"> mufon case (32102) map </A>","divs":["Sighting DetailsI was driving home on highway 90 west from Lafayette La, to New Iberia, returning from my daughters baseball practice and like any 12 yr old, she was mad at me for no reason other than I'm her dad. All of a sudden she says \"dad I just saw something very strange,\" and I could tell something had really startled her. I tried to act calm so she would tell me the details. She knows how I'm into anything going on in the sky, and she is a bit spooked by it. She told me she saw a yellow streak of light coming down like a meteor of sorts. When it came close to the ground it sort of disintegrated. For her to say this, it must have been really amazing. I tried to get more out of her but I could tell she was alarmed and scared,and she is really embarrassed by my interest in this stuff. I then stopped at the nearest gas station, got down and was looking for something to drink as I was approached by a man with a cane in his 60's who was sober as a Judge. He said, \"did you see that thing in the sky,\"? He then explained what he saw which was similar to my daughters. I could tell he was amazed by it and wanted more of an explanation. He also thought it was more of a blueish color if I remember right. I was so shocked that he had witnessed it too. I think he sensed that I was sort of a UFO BUFF. It's almost like he knew I was. He said it looked like he saw 2 orbs when it disintegrated, which I then asked if he saw 3. He replied no. I then brought him outside to talk with my daughter. I asked him if it was sort of like a fireball, and he said he didn't think so. But while my daughter downplayed it, I know she was alarmed and saw something very peculiar. The man validated it too. We were near an airport but, by their reaction, it was either a meteor, or a UFO. It did break up or as I said disintegrated and they were both very amazed and I could tell it was a once in a lifetime sight for the both of them. There is no doubt that something is going on in our sky's and I don't think it will be long before we REALLY find out. A year or 2 ago, a good friend of mine saw something similar to this in the same area, and one of the local TV channels reported a meteor sighting at the beginning of the month. In closing, something very strange happened and I don't think it was a meteor."],"Object Shape":"Fireball","Source":"MUFON","trends":["There have been 7 other sightings in Lafayette","There were no other sightings in Lafayette on or around September 25th 2011"],"Latitude":"30.23316","Object Flight Path":"Straight-line path","Log Number":"US-09262011-0012","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","City":"Lafayette","Longitude":"-92.016283","Tags":"City","Date Submitted":"09/26/2011 11:58 UTC"}