{"City":"Los Angeles","Disposition":"IFO","Weather Factors":"Unknown","Country":"United States","Object Features":"Unknown","Longitude":"-118.364594","Object Flight Path":"Hovering then path","Date of the Event":"09/25/2011 01:03 UTC","Latitude":"34.167791","Case Number":"32114","map":"<A HREF = \"http://maps.google.com/maps?q=34.167791,+-118.364594(32114)&iwloc=A&hl=en\"> mufon case (32114) map </A>","Summary":"Orange light seen above San Fernando Valley","Log Number":"US-09262011-0020","Object Shape":"Sphere","divs":["Sighting DetailsAt approximately 1am on Sunday Septmeber 25, 2011 my boyfriend and I were turning from Addision street to Denny Ave in North Hollywood and noticed two groups of people walking. Both groups of people were pointing and looking up at the sky. We looked as well and saw a bright, large orangish light in the night sky. First thinking it was debris from the falling satellite, we didn't regard it much, but we did keep watching as it was odd. We decided it wasn't a plane going into Bob Hope airport, since they have a flight curfew that had passed. It didn't have any other lights on it, just one glowing orange hued light. We see (and hear) helicopter all the time in the Valley and it wasn't a helicopter either. There were no wing lights or blinking lights. I pulled over and we joked with two guys on the street about seeing a UFO. They asked if we were pulled over to watch it and I said yes. It was slowly ascending, leading us to realize it was not falling debris, since it was going up and not down. It didn't have a tail so I didn't think it was a meteor. I've seen pretty large, spectacular meteor displays and they typically are moving very fast and have a tail. It was too big and too close to be a satellite that was orbiting. If I put my hand out and closed my fingers around the diameter of it, it would be about the size of a golf ball. It was below a low marine layer and eventually disappeared into the clouds. My boyfriend and I went online and watched some of the videos that are out there and we saw that some of the other videos looked quite a lot like what we'd seen, except we didn't see multiples, we saw only one single light. I really don't want to have witnessed a UFO. I'd love an alternative explanation."],"files":["/var/www/straped/mufon/html2text/32114.html.txt","/var/www/straped/mufon/org/32114.html"],"Viewing Distance":"Unknown","Region":"California","Sighting Duration":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 25th 2011"],"Tags":"City","Source":"MUFON","Date Submitted":"09/26/2011 06:13 UTC"}