{"Log Number":"US-09272011-0006","Country":"United States","Object Shape":"Sphere","Region":"Pennsylvania","trends":["There have been 3 other sightings in Canonsburg","There were no other sightings in Canonsburg on or around September 25th 2011","This sighting has never been favorited.",""],"Sighting Duration":"00:10:00","divs":["Sighting DetailsSo I was outside grilling some chicken, talking to my mom on the phone when something caught my eye, a black dot moving through the sky in a wierd fluttery type motion. It came down at an angle and then i saw another kinda standing still. Thats when i realized it was not an airplane so I told my mom I had to go that she wouldnt believe it I would call her back. I ran inside my girlfriend and her mom were inside and told them there were 2 ufo outside I needed to grab my video camera. I was in disbelief and so were they my girlfriend comes outside to see. Her eyesight is not that good so she couldnt see and said i was freakin her out so she went back inside. The whole time I thought i was video taping talking to the camera explaining what happened turns out i wasn't. So i lost a good five minutes of video :( but i was able to capture one of them. The duration lasted 10 minutes in total however i only captured a couple minutes before it was out of focus or sight. Contact me with any questions."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","Date of the Event":"09/25/2011 06:30 UTC","Longitude":"-80.201115","Disposition":"Unresolved","Summary":"daylight sighting and vid","Source":"MUFON","Date Submitted":"09/27/2011 11:46 UTC","Latitude":"40.295976","Case Number":"32129","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.295976,+-80.201115(32129)&iwloc=A&hl=en\"> mufon case (32129) map </A>","City":"Canonsburg","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"None","files":["/var/www/straped/mufon/html2text/32129.html.txt","/var/www/straped/mufon/org/32129.html"]}