{"Longitude":"-88.181","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.000488,+-88.181(32120)&iwloc=A&hl=en\"> mufon case (32120) map </A>","Object Features":"None","Case Number":"32120","Region":"Illinois","Log Number":"US-09262011-0026","Country":"United States","Date Submitted":"09/26/2011 10:24 UTC","Summary":"A black dot followed a 767 airliner underneath the tail from about 2 oclock to 10 oclock with 12 oclock being south facing","Latitude":"42.000488","Source":"MUFON","Date of the Event":"09/24/2011 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/32120.html.txt","/var/www/straped/mufon/org/32120.html"],"trends":["There have been 7 other sightings in Bartlett","There were no other sightings in Bartlett on or around September 24th 2011"],"divs":["Sighting DetailsI was at a football game in Bartlett, Il. where my grandson was playing and turned around from watching the game at the sound of a 767 airliner in a landing approach to Ohare airport coming from my right to my left. What caught my eye was a small black dot just under the fusilage forward of the left side horizontal tail assembly. It was just moving along with the aircraft until it passed in front of me when it slowly began to slide rearward maintaining the same distance under the aircraft as when I first observed it. As it moved away from me it continued to move rearward until it became to small for me to distinguish. It's last position was just behind and below the fusilage. The object was in sight from 15-20 seconds. Of course being the quick on my feet Mufon field investigator that I am I snapped several pictures with my expensive twelve megapixel digital camera that I was carrying in my hand...Not! No instead I stood there trying to come up with a logical explanation for what I was seeing, and then it was gone. I would judge the apparent size of the aircraft at it's closest approach as the size of a half dollar held at arms length. The size of the dot was impossible to judge. At first I thought it was one of those floaters you sometime see as black dots that are inside your eye but when I looked away the dot stayed with the airplane and disappeared when I looked completely away. A floater kind of moves around with a kind of slow motion when you move your point of focus around. This dot stayed right with the airplane and didn't behave like any floater I have seen."],"Sighting Duration":"Undisclosed","City":"Bartlett","Tags":"City","Weather Factors":"Unknown"}