{"Region":"Indiana","Date of the Event":"09/15/2006 01:30 UTC","Longitude":"-79.146805","Disposition":"Unknown","Source":"MUFON","City":"Indiana","Viewing Distance":"21-100 Feet","Summary":"Nighttime landed domed craft in a rural farm field","Date Submitted":"09/26/2011 11:51 UTC","Object Shape":"Oval","Object Flight Path":"Undisclosed","Tags":"City","Latitude":"40.630455","Object Features":"Dome","Country":"United States","divs":["Sighting DetailsI drove a Ford cargo van for an overnite delivery company in Indianapolis in 2006. My route had 50 stops and I drove the same route each night travelling about 400 miles each evening. As I was heading west from US 31 to the town of Culver on a two lane country road around 1:00 am when I came over the top of a hill and down the hill I witnessed something out of the ordinary. What was normally a farm field pasture littered with some implements and a few head of cattle, now appeared to have the orange glow of a campfire. I thought to myself, that is kind of unusual because it was quite some distance from any residence. As I approached the area, I rolled down the window of the van and stopped to see if this was a campfire or perhaps an accidental fire. My eye level was about the top of the wire fence and the weeds that had grown up along the fencerow. What I witnessed about twenty feet away gave me chills and caused me a great deal of anxiety. What I saw was a highly reflective dome just over the top of the weeds about 20'-35'in diameter reflecting the color of the night sky with just the faintest sliver of an outline that defined its shape. But the weirdest thing about it was, it was mimicking a fire, soft orange and reddish undulations were reflecting off its surface but even stranger were the spark embers that normally float off a fire, they were recreated in a pixel type format, very quick dashes of light that floated in a zigzag geometric pattern making sharp right angles in a multi-sized square track across the surface of the dome. The light even dimmed as to copy an ember burning out. It was semi-convincing in reproducing a campfire but it was not natural. When I saw that it scared me and I immediately drove off. I was so close to it that I thought if lingered there any longer who knows what might happen."],"files":["/var/www/straped/mufon/html2text/32123.html.txt","/var/www/straped/mufon/org/32123.html"],"Weather Factors":"Unknown","trends":["There have been 3 other sightings in Indiana","There were no other sightings in Indiana on or around September 15th 2006"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.630455,+-79.146805(32123)&iwloc=A&hl=en\"> mufon case (32123) map </A>","Log Number":"US-09262011-0029","Case Number":"32123"}