{"Latitude":"38.182283","Weather Factors":"Unknown","Summary":"red//white blinking light with sudden increase to unbelievable speed","files":["/var/www/straped/mufon/html2text/32136.html.txt","/var/www/straped/mufon/org/32136.html"],"Disposition":"Unresolved","Viewing Distance":"Unknown","Region":"Kentucky","Case Number":"32136","trends":["There have been 8 other sightings in Morehead","There were no other sightings in Morehead on or around September 25th 2011"],"Sighting Duration":"Undisclosed","Longitude":"-83.477333","Date of the Event":"09/25/2011 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.182283,+-83.477333(32136)&iwloc=A&hl=en\"> mufon case (32136) map </A>","Log Number":"US-09272011-0013","Country":"United States","Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","divs":["Sighting DetailsSometime between 11 and midnight I took my dog out. Since it was warm, I laid down in the lawn chair to watch the sky. There were patchy clouds moving steadily. Occasionally, you could see stars when the clouds cleared or were thin. From the south, and headed toward the north, I spotted what I assumed was an airplane coming over the tree line. It flashed white, then red, then white, then red. It was moving at a rate of speed typical of planes. Then, in an instant, it shot across the sky out of my field of view. It did not gradually speed up. It went from one movement rate -that of an airplane, instantly to a much faster movement rate -that of a shooting star, the kind that zip across the sky really fast. When it shot across the sky like a meteor, it seemed pink and also appeared to leave a trail. The object must have been just below the cloud level, because I had a clear view of it (with the clouds in the background) the entire time. The entire sighting only lasted about 5 seconds which was very frustrating. I would have loved to have seen where it went or what happened to it. My only emotional reaction was being uncertain that I could believe my own eyes, and annoyed that I didn't get to see it longer."],"Date Submitted":"09/27/2011 04:56 UTC","Object Features":"Unknown","City":"Morehead","Object Shape":"Unknown"}