{"Source":"MUFON","Weather Factors":"Unknown","Disposition":"Insufficient Data","Region":"Florida","Country":"United States","Log Number":"US-09272011-0015","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around September 27th 2011"],"City":"Naples","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/32139.html.txt","/var/www/straped/mufon/org/32139.html"],"divs":["Sighting DetailsAt approximately 9:03 pm while taking a walk on a dark street, my husband and I looked up. I don't know why we looked up, but we felt there was a reason to. My husband said \"Look at that\", and pointed. I looked up and there was almost a milky cast of an object going across the sky. Upon further inspection it was a dark, gray boomerang shape that matched the color of the sky. However, on the front leading edge were lights intermittently blinking. As it got right over our heads, we could see that it was very large, very quiet, and then we were better able to see that it was actually two boomerang shapes in formation. It almost seemed to glide by. My husband, questioning what he saw, then decided he had seen birds in migration. However, I see birds fly over Naples at night in formation, all the time, and they don't look like this. I would say the object moved at approximately 80 miles an hour. Upon returning home, we were so excited to see it again so we laid down in the back of a pickup truck to watch the sky. We saw the shape again, but this time it was higher, moving more quickly, and was only one boomerang shape. We also saw shooting lights periodically in the area. This second sighting occurred at 9:22 pm. As the object would approach downtown where the lights were brighter, it would appear to dissolve from the sky....probably by reflection."],"Object Shape":"Boomerang","Date of the Event":"09/27/2011 09:03 UTC","Longitude":"-81.79191","map":"<A HREF = \"http://maps.google.com/maps?q=26.144206,+-81.79191(32139)&iwloc=A&hl=en\"> mufon case (32139) map </A>","Latitude":"26.144206","Date Submitted":"09/27/2011 10:22 UTC","Summary":"Naples Boomerang Sightings","Tags":"City","Case Number":"32139"}