{"Disposition":"Hoax","Sighting Duration":"00:10:00","City":"Kingsland","Weather Factors":"None, Unknown","Date of the Event":"08/28/2004 08:35 UTC","Object Features":"Undisclosed","Log Number":"","files":["/var/www/straped/mufon/html2text/3213.html.txt","/var/www/straped/mufon/org/3213.html"],"Date Submitted":"08/28/2004 08:35 UTC","Source":"MUFON","Longitude":"-81.689826","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI was the passenger in a truck headed to Kinglsand, GA, headed south on I-95.Theobject was seen while we were approaching exit 6 6 miles from GAFL line. Thedriver could not see the object once we were close enough for me to realize thatit did not seem to be moving. It seemed to stay in the same spot in the air forthe duration of the sighting until we were too far away and trees obscured theview. The object was a few hundred yards SW of I-95 exit 6, perhaps about800-900 feet in altitude.At first, I thought the object was a plane, naturally. However, a plane thatlarge, would require some velocity to stay aloft. This object seemed to be justhovering motionless. The only problem with my assertion is that I was in amoving vehicle. As we got closer to the object, I could see that there were 3bright lights in an equilateral triangular pattern. Occaisionally, pure blue skywas behind the object and a structure seemed visible. It appeared to be straightlines connecting the bright lights. There was another, less bright light thatwould occaisionally flash. It seemed to be a light red or pink color. It wassituated in the center of the 3 bright lights. The strangeness of it hit me whenI could not figure out which direction it was moving. It seemed to be locked inposition above the woods near a road called Old Still Road. I could notunderstand how it could not be moving. It reminded me of some footage fromBelgium in about 1991 of a Triangular UFO only it did not seem to be moving andI watched it for at least 6 or 7 minutes. I bet someone else saw it as it wasjust a few hundred yards west of one of the busiest highways in the area on asaturday night. The driver of the vehicle I was in did not really notice it atfirst and when I decided it was strange, he could not see it from his positionwithout pulling over, which I wanted to do, but we were in a hurry to get to agig I am a professioanl musician in Kinglsand at exit 3. I lost sight of theobject as we got farther away. It still seemed to be over the same area of thewoods at the same position. I could not see it anymore when we pulled into ourdestination a few mile south of the area of the sighting."],"Object Shape":"Triangle","Country":"United States","Region":"Georgia","Latitude":"30.799956","Case Number":"3213","trends":["There have been 5 other sightings in Kingsland","There were no other sightings in Kingsland on or around August 28th 2004","This sighting has never been favorited.",""],"Summary":"Possible Anomolous Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=30.799956,+-81.689826(3213)&iwloc=A&hl=en\"> mufon case (3213) map </A>"}