{"Sighting Duration":"Undisclosed","Longitude":"50.119423","Region":"Eastern Province","Object Flight Path":"Straight-line path","Summary":"Sighting exactly like the one reported on 25 Sep 11 in Illinois","Tags":"City","Date Submitted":"09/27/2011 03:03 UTC","Object Features":"None","Source":"MUFON","divs":["sighting detailsi was stunned when i saw the photograph of the sighting reported in illinois on 25 sep 11; i saw an object exactly like that in saudi arabia during the 1991 gulf war. the entire sighting lasted approximately 1 minute. at the time i was active duty military, deployed to the dhahran, saudi arabia area in support of operation desert shield\\storm. it was dusk and i was walking back to the field site after dinner. i was alone; everyone else was watching the super bowl game. i noticed three orange-hued lights moving almost directly overhead; in the exact configuration as those depicted in the illinois photo. there was absolutely no noise associated with the sighting. as with the illinois photo, the area encompassed by the 3 lights was without any discernable features. it appeared as though there was nothing at all between the 3 lights, but they all moved in concert - as if they were connected to a single source. the size of the object was approximately the size of a fifty cent piece held at arms length. again, as with the illinois sighting, it didn't appear to be a high altitude object. the object was moving relatively slowly, covering the length of the object in approximately 1 second. it was moving in an easterly direction through the very clear sky, towards a single small cloud. the sky, with the exception of the small cloud which was not much larger than the object, was perfectly clear, which made observation very easy. the 3 lights flew into the small cloud and that was the last i saw of them - nothing emerged from the cloud which again, which was scarcely larger then the configuration of the 3 lights."],"Country":"Saudi Arabia","trends":["There has been one other sighting in Dhahran","There were no other sightings in Dhahran on or around January 27th 1991"],"Case Number":"32132","map":"<A HREF = \"http://maps.google.com/maps?q=26.295768,+50.119423(32132)&iwloc=A&hl=en\"> mufon case (32132) map </A>","Date of the Event":"01/27/1991 12:00 UTC","Object Shape":"Triangle","Disposition":"Unresolved","Log Number":"SA-09272011-0009","City":"Dhahran","Weather Factors":"Unknown","Latitude":"26.295768","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/32132.html.txt","/var/www/straped/mufon/org/32132.html"]}