{"Longitude":"-94.153033","divs":["Sighting DetailsIn the late spring,early summer of 1974,at around 12 am, I witnessed multiple lights, 'Star Like' high in the sky moving around erratically. I watched them for around 8-10 minutes. White Star Like objects just moving around very strangely... I thought they were going to crash in to one another as they seemed to have many near misses. After about ten minutes of this, I had to use the restroom so I went inside. It took just a few minutes and I was on my way back outside to see if the lights were still there and I could see a Glow, Orange Glow, through the glass of the back door of the house! Startled, I decided to stay inside and watch through the window. I could see a bright orange orb, glowing way off in the distance, about 300 yards away over open pasture. It was moving closer to my location as it continued to get larger. The light hovered over the trees on the mountain to the southeast, moving northwest down over open land. This object flew right over the top of our house at close range. It lighted the entire ground under it as it moved over the house and moved down through the valley below. I watched it fly away till it just turned in to a glow through the Forrest. I thought it was going to crash in the woods as I continued to watch that direction. Suddenly, I looked up, and there, was the star like object I had seen earlier, in a circular formation, a cluster, and then the orange object launched vertically up in to the cluster of star like objects, merged with them and shot up out of the atmosphere! Never saw this before or since. One photo shows the tree line with a gap in it... those trees died after that night... slowly jusy died in a gap about 60 to 80 feet across..."],"Tags":"City","trends":["There have been no other sightings in Mountainburg","This sighting has never been favorited."],"Case Number":"32135","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.614666,+-94.153033(32135)&iwloc=A&hl=en\"> mufon case (32135) map </A>","Weather Factors":"Unknown","Latitude":"35.614666","Sighting Duration":"Undisclosed","Object Features":"None","Date of the Event":"05/01/1974 12:00 UTC","City":"Mountainburg","Region":"Arkansas","Source":"MUFON","Viewing Distance":"21-100 Feet","Object Shape":"Sphere, Star-like","Summary":"Witnessed star like lights high above the farm, then orange and multi colored orbs flew very low over our house","Date Submitted":"09/27/2011 04:54 UTC","Log Number":"US-09272011-0012","files":["/var/www/straped/mufon/html2text/32135.html.txt","/var/www/straped/mufon/more/32135_submitter_file1__Captureufopath2-74.JPG","/var/www/straped/mufon/more/32135_submitter_file2__Captureufopath74.JPG","/var/www/straped/mufon/org/32135.html"]}