{"Tags":"City","trends":["There have been 4 other sightings in Sherbrooke","There were no other sightings in Sherbrooke on or around September 17th 2011"],"files":["/var/www/straped/mufon/html2text/32143.html.txt","/var/www/straped/mufon/org/32143.html"],"Latitude":"45.408169","Case Number":"32143","Date Submitted":"09/28/2011 01:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.408169,+-71.882206(32143)&iwloc=A&hl=en\"> mufon case (32143) map </A>","Region":"Quebec","Sighting Duration":"Undisclosed","Country":"Canada","Source":"MUFON","City":"Sherbrooke","Weather Factors":"Unknown","Longitude":"-71.882206","Object Flight Path":"Straight-line path","Summary":"UFO over Sherbrooke, Quebec being chased by 2 U.S. decommissioned fighter planes","Disposition":"Unresolved","Object Shape":"Sphere","divs":["Sighting DetailsWas eating at McDonalds with my son and husband. My son loves airplanes he pointed to us to look out. It was the regular plane that passes over our town. For some reason though he was a low altitude and tilted like he was avoiding something. Still looking, we noticed a dull white object going upwards. We figured it might be a balloon but that would have been impossible cus if it came from the aircraft there would have been decompression. Funny thing is nobody where we were paid attention to what we were seeing. Not but 10 seconds later two decommissioned U.S. fighter planes were chasing it... So... wouldn't there have been any mention of U.S. aircrafts over our town in Canada? There was no mention of it on the news but we've seen the same regular airplane the following Saturday roaming over the town multiple times. Maybe he was hoping to see the same thing again. Believe what you will, but we know for a fact that UFO's will never make the news, and even when they do, government makes sure to twist the reality into a possible hoax. The day we find out the truth will most likely be too late."],"Date of the Event":"09/17/2011 12:00 UTC","Viewing Distance":"Unknown","Object Features":"None","Log Number":"CA-09282011-0001"}