{"trends":["There have been 4 other sightings in California City","There were no other sightings in California City on or around May 11th 2011"],"files":["/var/www/straped/mufon/html2text/32144.html.txt","/var/www/straped/mufon/org/32144.html"],"Object Shape":"Cylinder","Disposition":"IFO","Summary":"Fixed wing and helo in ear airspace. Watching F/W W/ binos, when object is viewed and begins to reciprocate at amazing speed. The plane banks away 4-500 from object.","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09282011-0002","Source":"MUFON","divs":["Sighting DetailsWorking in my yard I noticed some aviation activity above. A red charter plane maneuvering a half-mile or so from a black 'copter that seemed to have a turret-mount camera. These two aircraft had been executing an orbit of about 4 miles in diameter, with the chopper staying put while the plane flies around it. It seemed they were filming the plane, possibly for a movie or commercial. Watching with my 15X70 binocs, the plane (heading north), appears to be a Cessna with a wide body to accommodate skydivers, ascending about 3,500 feet from my position, and about 45 deg above the horizon. It banks 70 deg to port as it ascends. The plane may have been at about 3,000 feet, assuming that as a minimum VFR altitude. I'm certain the distance to myself was less than 5,000 feet. In the middle of this turn an object approx 300 ft ahead of the Cessna aircraft, hovers then starts to pump up & down, so fast as to almost be a blur. Through my optics it looks like a great flying soup can, silver and white, in an upright attitude. It appeared to be about 20 feet tall and maybe 10 feet across, assuming my distance estimates are accurate. The sight confuses me so much, that I take the binocs and put them on a similarly distant object (I believe it was a lamp pole down the street) which behaves as I would expect and does not pump up & down like a flying piston. When I look back to the \"soup can\" it is gone. The aircraft and helicopter leave the scene in seconds. The weather conditions were \"severe clear\" with completely unobstructed visibility. It was mid day on the desert near Edwards Air Force Base. The nearest mountains were about ten miles away, the Tehachapi's and the south end of the Sierras and the Panamint Range. My location was 9-10 miles due south of Jawbone Canyon, 3 miles east of California City Airport, where Cessna's such as the kind I saw are often chartered."],"Longitude":"-117.978504","map":"<A HREF = \"http://maps.google.com/maps?q=35.130841,+-117.978504(32144)&iwloc=A&hl=en\"> mufon case (32144) map </A>","Region":"California","Date of the Event":"05/11/2011 02:00 UTC","Object Features":"None","Country":"United States","Tags":"City","Weather Factors":"None","City":"California City","Date Submitted":"09/28/2011 01:23 UTC","Object Flight Path":"Stationary","Case Number":"32144","Latitude":"35.130841","Sighting Duration":"Undisclosed"}