{"Sighting Duration":"00:05:00","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Summary":"Saw Large Disk Moving S to N","Case Number":"3214","Log Number":"","Country":"United States","Disposition":"Unknown","Region":"Pennsylvania","Date of the Event":"08/31/1952 09:30 UTC","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/3214.html.txt","/var/www/straped/mufon/org/3214.html"],"Latitude":"41.326456","Source":"MUFON","trends":["There have been no other sightings in Renovo","This sighting has never been favorited."],"City":"Renovo","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.326456,+-77.75082(3214)&iwloc=A&hl=en\"> mufon case (3214) map </A>","divs":["Sighting DetailsI would like to report that I, along with a number of adults, didsee a UFO in the fall of 1952 dont hold me to the date, but there is anewspaper story that confirms this. It was a summer or fall evening Ithink fall. I left my house about 930PM to walk to a small store for asoda. As I was walking east on Erie Ave at 10th Street, in Renovo, PA, Isaw what I thought was a full moon over the NE mountain. I was about 10at the time and although I wasnt a trained observer, I was aware of andinterested in science so it occured to me that it was unusual for themoon to be where it was in the sky. It took about 3 minutes or so to getmy soda and when I left the store, walking west now, I looked over myshoulder and the moon was gone. I thought it had set rather quickly,but I was involved in something at home and didnt think any more about it.The next evening, in The Renovo Daily Record, there was a story abouta flying saucer over Renovo. It seems that a number of men who wereworking in the Pennsylvania Rail Road marshalling yard had also seen theUFO and had watched it traverse from the southern mountain to thenorthern mountain I just caught the tail end of the scene. While therewas some speculation about the object I seem to recall that the war inKorea was on-going at the time and there was concern that ourmarshalling yard might be the subject of bombing...I know now that thisis nonsense, but at that time, this seemed sort of real. We were doingduck and cover at school etc..Im 62 now and retired from IBM. Over the years, I considered thevarious alternatives it REALLY was a full moon - nope, not according tothe ephemerishow about Venus - no wayI later owned a six inchreflecting telescope and it wasns a planet or a starfireball - nope,none reported in PA for that dateairplane with landing lights on - noton any air route, no sound and way too large, to say nothing of landinglights which would have been pointing in the direction of flight,essentially north, not westnoticlucent clouds - too late and far tomuch motionhallucination - maybe, but it struck a really strange groupof people, railroad brakemen and a 10 year old. My net a genuine UFOwith insufficient information to resolve oh, I almost forgot theresno swamp gas anywhere near the sighted position as it was about 500 feetabove the valley floor.I doubt this is of much use to you but let it be"],"Longitude":"-77.75082","Date Submitted":"08/31/1952 09:30 UTC","Tags":"City"}