{"divs":["Sighting DetailsWe were sitting on our patio when noticed star sized objects moving over southwest night sky (about 11:00 pm). Four or five the first night would hover, make formations then seperate. Occasionally one would flash east across sky over the roof. We watched off and on for about three hours before going to bed. During this time, an airplane flew by very low (usual for this area) and a few minutes later a jet flew by fairly low in the sky. These object were starlike, about the size of Venus. They would make circle, zip off at acute angles and reconverge in the same area of the sky. This occured every night until cloud cover began covering the sky labor day weekend. The last night, we noticed at least ten of these objects lower in the southwest sky; the previous nights they had been about 90 degrees above the horizon. As noted above, we did not see again until last week when the night sky was clear of clouds again. Noticed two zipping across sky from west to east quickly followed by a formation of three objects slowly moving from north to south. We have several thirty foot tall evergreens and a small copse of woods blocking our view of the western horizon so difficult to say where they are flying from or to. We've lost sight of the objects as they moved into the sky behind the trees or when they fly over the building since our east horizon is also blocked by trees. Sometimes they zip off so quickly they can't be followed with the eye and other times they just simply vanish. I've never actually seen anything like this before and quite frankly I was excited at the prospect of beings from another planet coming here but at the same time very skeptical. Couldn't be swamp gas, we're on a hill and I don't think gas would move like these. Can't be lasers-nothing to reflect off of on a clear night. Have to be above cloud cover. Has anyone else seen these? Please let me know."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Date Submitted":"09/27/2011 11:49 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.150905,+-86.520366(32142)&iwloc=A&hl=en\"> mufon case (32142) map </A>","Region":"Indiana","Sighting Duration":"Undisclosed","Case Number":"32142","trends":["There have been 12 other sightings in Bloomington","There were no other sightings in Bloomington on or around August 22nd 2011"],"Tags":"City","files":["/var/www/straped/mufon/html2text/32142.html.txt","/var/www/straped/mufon/org/32142.html"],"Object Shape":"Star-like","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-86.520366","Country":"United States","Viewing Distance":"Unknown","Latitude":"39.150905","Disposition":"Insufficient Data","City":"Bloomington","Summary":"lights over bloomington week before labor day weekend and every night til cloud cover","Log Number":"US-09272011-0018","Date of the Event":"08/22/2011 11:00 UTC"}