{"Case Number":"32152","Summary":"Mulitple starlike objects moving erratically around the sky for 7 nights","City":"Fulton","Tags":"City","divs":["Sighting DetailsAs reported to ASD by phone today: I am 55 years old and have been a sky watcher my entire life. My dad used to take me out to show me the stars and constellations, and I kept up the tradition with my own son. At night we like to go out and lay on the roof to watch the stars and the Milky Way. Since we live in a rural area we can see the stars very well. The past seven nights I've noticed multiple star-like objects that move around in zigzag patterns, circles, and back and forth erratically. This is something entirely new and something I've never seen before. The objects move very fast. Some remain still for a long time, then make sudden movements. The first night I noticed a large bright object in the dark center of the Milky Way that shouldn't have been there. I watched it for a while trying to figure out what it was, when to my surprise it started moving. I noticed that when planes are in the area, it stops moving, but after they planes are gone it moves again. This particular object seems to be returning nightly. However, there are others. Some nights there are as few as four, and other nights as many as a dozen, with numbers increasing nightly. I've never seen a plane move as fast as these objects do. The most active places to look are in the west and south sky, and they are active from dark until dawn. My neighbors and son have also noticed this phenomena. I can see the objects with the naked eye or with binoculars, but have been unsuccessful using the telescope. I want to find out if anyone else is seeing the same thing."],"Log Number":"US-09282011-0010","Sighting Duration":"Undisclosed","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/32152.html.txt","/var/www/straped/mufon/org/32152.html"],"Date of the Event":"09/27/2011 12:00 UTC","Country":"United States","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.79063,+-91.981442(32152)&iwloc=A&hl=en\"> mufon case (32152) map </A>","Date Submitted":"09/28/2011 03:45 UTC","trends":["There has been one other sighting in Fulton","There were no other sightings in Fulton on or around September 27th 2011"],"Region":"Missouri","Disposition":"Unknown","Latitude":"38.79063","Object Features":"None","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-91.981442"}