{"Object Features":"Dome, Other","Object Flight Path":"Stationary","Date of the Event":"09/27/2011 12:10 UTC","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=39.09714,+-94.541114(32155)&iwloc=A&hl=en\"> mufon case (32155) map </A>","Latitude":"39.09714","City":"Kansas City","Country":"United States","Longitude":"-94.541114","Tags":"City","divs":["Sighting DetailsAs given by phone to ASD today. No phone number or -email was provided and there was no caller ID (it said private): The witness stated that she just had to tell someone what she saw but didn't want any further contact. \"I am a government employee working in downtown Kansas City, Missouri and when I went to lunch yesterday with two friends I noticed something hovering in the sky above us. It was almost transparent, and had a glow to it. It was a silver craft with a whitish glow around it. There were no lights that I could see but it looked like it was lit up somehow. I stopped and looked at it, and asked my friends if they saw it, too, but they didn't. Then one said, \"yea, there is something there, but I can't see what it is.\" I don't know what that meant. They just wanted to go on to lunch, but I was shocked that I could see this silver disc-shaped UFO but neither one of them could see it even though we were looking in the same location. I figured later on that maybe they just couldn't deal with the strangeness of the situation. I mean, a UFO in the middle of the day in a downtown area? I looked around at other people, but they seemed oblivious to it. I've never seen anything like this and it really has me shaken. I can't give my personal information out because I have a sensitive job.\""],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/32155.html.txt","/var/www/straped/mufon/org/32155.html"],"Object Shape":"Disc","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around September 27th 2011"],"Date Submitted":"09/28/2011 04:38 UTC","Case Number":"32155","Viewing Distance":"21-100 Feet","Summary":"UFO hovering over buildings in downtown Kansas City","Weather Factors":"Unknown","Log Number":"US-09282011-0013"}