{"Disposition":"Unresolved","Weather Factors":"Unknown","Date Submitted":"09/28/2011 05:43 UTC","Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/32158.html.txt","/var/www/straped/mufon/org/32158.html"],"Object Shape":"Circle, Star-like, Other","Longitude":"-89.225768","Case Number":"32158","Sighting Duration":"00:02:00","Region":"Wisconsin","Country":"United States","Viewing Distance":"Unknown","Tags":"City","divs":["sighting detailsback in the fall of '09, my wife and i went out to the back roads outside of sun prairie, wi (northern edge of town). we often did this to go star gazing and get away from some of the light pollution from madison. the time was around 9 pm and it was a clear night, with not a cloud in sight. it was fall, like i said, so it was cooler and we needed to wear jackets. we stopped on the shoulder of a road that ran north and south along the edge of a corn field (i think n or bird street). it was a great night because we could see so much - galaxy, satellites, planes, etc. we were looking at the sky and i turned to look south south\\east and noticed something weird in the sky, about 60 degrees above the horizon. it was a bright white orb, that appeared star-like, but was much too large to be a star (roughly between a star and aspirin in size). since we live close to the truax madison airport and that area is the approach path for many planes, i first thought it was a plane or jet exhaust. what was odd about it, was that number one, it made no sound! it also had no blinking lights of any type, and seemed to give off a bright-white to almost blue-white unwavering glow that was just on the brink of twinkling like a star. it was circular in shape to my eyes, but so are most stars, so i couldn't get any definite shape of it. it is hard to guess the distance away and size of it since i could only see it as a larger than normal star like glow. however, that said, this had to be between 1-5 miles away and roughly 500 ft in the sky, based on how planes on approach look (size in the sky). when i spotted it, it appeared motionless for an instant, and then i noticed it was moving in a very slow, deliberate, straight path from right to left (maybe a distance of 1 to 2 actual miles?). it was moving for maybe a minute and eventually faded out of sight. again, no sound was heard during this whole event. during i didn't take my eyes off of it and didn't blink because i didn't want to lose it. i asked my wife, \"what the hell is that?\". when she looked she didn't know and watched it with me. she disregarded it as most likely a plane, but i didn't think so since i have seen many types of aircraft come in for landings and this was not typical. i thought for sure that i had seen something unidentified, but couldn't be positive, so i didn't bother reporting it. i decided to now just for integrity. felt intrigued afterward, and now that i think of that night, i don't remember any other aircraft in the sky during the event. the whole sighting was strange. also wanted to post because i have seen several other reports of near identical description from other parts of the country."],"Latitude":"43.203172","Summary":"Looking S/SE just outside of Sun Prairie WI back in Fall of '09 in evening; saw bright white orb travel from right to left making no sound.","Log Number":"US-09282011-0016","Object Features":"Unknown","City":"Sun Prairie","Date of the Event":"09/15/2009 09:00 UTC","trends":["There has been one other sighting in Sun Prairie","There were no other sightings in Sun Prairie on or around September 15th 2009"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.203172,+-89.225768(32158)&iwloc=A&hl=en\"> mufon case (32158) map </A>"}