{"Date Submitted":"09/28/2011 11:21 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Tags":"City","Object Flight Path":"Hovering then path","Weather Factors":"None","Object Shape":"Disc","Object Features":"Other","Region":"New Jersey","divs":["Sighting DetailsThis happened back in mid 1996...I was sleeping with my window open and at about 5 am I woke up from the constant whirl of a helicopter over the house...I looked out the window..it was still dark, I thought maybe there had been an accident on the highway which was about a mile away because many times if that happened a news helicopter would hover over the scene. It was still dark out and I was SHOCKED when I looked up at the sky and saw this big disc shaped object with different colored lights all around it just hovering and this helicopter (which looked like maybe a green army helicopter) was hovering just watching it. I watched them both just hover there for about 3 min when suddenly, the disc shaped object turned and took off so fast it was gone in an instant! The helicopter slowly turned and then flew away. It was the strangest thing!! But I have no doubt that I saw a UFO being watched by the military! Another time on that property I was standing on the back deck of the house and looked off into the trees and saw a flourescent green rod shaped light flittering around..it was so strange! I told someone about it and they said they are actually some extraterrestrial thing called 'Rods' ...anyhow, there is obviously activity in this area!"],"Source":"MUFON","Latitude":"40.832683","Log Number":"US-09282011-0024","City":"Bloomfield","Sighting Duration":"00:03:00","Date of the Event":"04/20/1996 05:00 UTC","Longitude":"-74.188801","Case Number":"32166","files":["/var/www/straped/mufon/html2text/32166.html.txt","/var/www/straped/mufon/org/32166.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.832683,+-74.188801(32166)&iwloc=A&hl=en\"> mufon case (32166) map </A>","Summary":"Saw UFO hovering in Bloomfield NJ","trends":["There have been 4 other sightings in Bloomfield","There were no other sightings in Bloomfield on or around April 20th 1996"]}