{"trends":["There have been 4 other sightings in Altamonte Springs","There were no other sightings in Altamonte Springs on or around September 28th 2011"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Case Number":"32163","files":["/var/www/straped/mufon/html2text/32163.html.txt","/var/www/straped/mufon/org/32163.html"],"Object Flight Path":"Hovering then path","Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"09/28/2011 09:14 UTC","Longitude":"-81.358704","Object Shape":"Circle, Star-like","Region":"Florida","Latitude":"28.666779","Summary":"a bright white light, multicolor light changes from red, green, blue, and it dimmed on and off..it was stationary at one time then started to slowly drift away north over the trees","divs":["Sighting DetailsI went on my porch to smoke a cigerette and to see the rain storm. I looked up cause I saw a flash of lightening. The noticed a really bright white light and it seemed to have blinking lights like a aircraft would but it didnt make no noise or any movement. It hovered during the durattion of my first cigerette and while I was smoking it I saw the blinking lights change from green, red, blue, and yellow. Then I lit another cigerette cause it got me intriqued. I was watching it then I saw a bright red light appeared from the center and it lasted for maybe 2 to 3 seconds and then dimmed to and the white light resumed. Now during this time I had my wife come out to confirm that I wasnt seeing things and she saw the light as well. So my wife went into the apartment and then noticed the light move northward then stopped. Now I had went out at 8pm eastern standard time and I lost sight of it 845pm. I lost sight of the object cause it went over some trees that are nearby my apartment."],"map":"<A HREF = \"http://maps.google.com/maps?q=28.666779,+-81.358704(32163)&iwloc=A&hl=en\"> mufon case (32163) map </A>","City":"Altamonte Springs","Log Number":"US-09282011-0021","Disposition":"Insufficient Data","Source":"MUFON","Date of the Event":"09/28/2011 08:00 UTC"}