{"Weather Factors":"Unknown","divs":["Sighting DetailsI went out to my front porch last night, Sept. 27, 2011, about 10:30pm. I was admiring the stars when I noticed one very bright in the northwestern sky. The more I looked at it I realized it was 'twinkling' but with all colors of the rainbow. I got my camera and took over 40 pictures of it. I could see it clearly when my camera would focus, but most of the pics came out like a colored scribble. It was so far away and I didn't have a tripod. I tried to take video, but my camera wouldn't focus on it. I watched and took pics for about 15 min then it got lighter and smaller and was gone. Once I thought it was going to disappear, but then got brighter again and stayed a bit longer. Tonight, Sept. 28, 2011, I tried again to see it. At about 9:30pm it was there again. Further south and about the same height in the sky. I made a make-shift tripod and got much better pics! I tried again to take some video. Not sure that turned out, but the pics are awesome! I went back out to see if it was still there at about 10:30, but it was completely gone."],"Object Shape":"Circle, Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=60.563744,+-151.255303(32176)&iwloc=A&hl=en\"> mufon case (32176) map </A>","Date Submitted":"09/29/2011 02:48 UTC","Object Features":"Patterned Surface, Appendage(s)","Disposition":"Unresolved","Log Number":"US-09292011-0006","Sighting Duration":"Undisclosed","Case Number":"32176","files":["/var/www/straped/mufon/html2text/32176.html.txt","/var/www/straped/mufon/more/32176_submitter_file1__raincloudandufo057.JPG","/var/www/straped/mufon/more/32176_submitter_file2__raincloudandufo046.JPG","/var/www/straped/mufon/more/32176_submitter_file3__youtellme043.JPG","/var/www/straped/mufon/org/32176.html"],"Summary":"Star-like. Ring with attached appendages. Rainbow of lights along rim.","Date of the Event":"09/27/2011 10:30 UTC","Country":"United States","Source":"MUFON","Tags":"City","trends":["There have been 2 other sightings in Kenai","There were no other sightings in Kenai on or around September 27th 2011","This sighting has never been favorited.",""],"Longitude":"-151.255303","Object Flight Path":"Stationary","Region":"Alaska","Viewing Distance":"Unknown","Latitude":"60.563744","City":"Kenai"}