{"Viewing Distance":"21-100 Feet, 101-500 Feet, Over 1 Mile","trends":["There have been 4 other sightings in Lawrenceburg","There were no other sightings in Lawrenceburg on or around April 26th 2011"],"Longitude":"-84.895417","Date Submitted":"09/29/2011 04:50 UTC","divs":["Sighting DetailsI and four other persons were taking a late night drive at about 12:30 am out in the country. We turned onto a outer city road and were only driving for about 10 minutes when we saw a blimp-like object about 200 yards to our left and about 500 yards in altitude. There was a single row of lights that went all around the object that stayed illuminated and were bright white. There was a flashing blue and white light atop of the object. We followed that object for about a mile. I was not driving at this point, so I continued to search the sky for other objects. The first object made no noise at all. The second object, I spotted first. It was a few miles away and was covered by a cloud. It appeared to have a bright white light that was pulsating. I could only see the lights behind the cloud which looked to be heat lightning. Then the object came from behind the clouds and realized that what i thought was heat lightning was really the light on top of the object. We then turned right onto another country road and after following the two original objects for about 5 or 6 miles several of us spotted about 5 more aircraft surrounding us. We pulled over and got out of the car when the original UFO was coming directly towards us. When it was about 100 ft away from us and 100 ft in altitude it made the strongest winds i have ever felt in my life. strong enough to almost knock me on my feet. The noise emenating from the object was loud enough for me to cover my ears. It then went to directly overhead and we tried to videotape the object but nothing showed up on the film. It sped off at speeds unimaginable. We then got back in the car and drove towards the other 6 or 7 objects that were still in the sky. I was driving at this point because the original driver wanted to try to film this on her phone. I felt compelled to follow the objects. Once we had been driving for about 15 more minutes, we pulled over again in an open area. When we got out of the car this time, we counted about 15 objects in about a mile radius around us. We again tried to document the objects but the audio was the only legible thing in the video. At this point we looked in the fields around us and spotted several(5 or 6)objects on the ground about a mile away. They were about 100 ft tall. They had rows of lights on them. The rows were vertical. The first row had red lights. The second had white. The third had a bluish light. They all flashed in sequence and were all perfectly similiar with one another. The flashing also was in sequence with the white flash of the objects in the air. After standing outside for about 30 minutes we got back into the vehicle to see if we could find a roadway that got us closer to the landed objects. When we began to drive again, every one of our phones died. Not at the same time, but in succession. Then it began to rain, but the rain was only falling on the drivers side of the car. We followed the objects for another 30 minutes and saw several of them coming very close to our vehicle. We stopped in the middle of the road at some sort of country road intersection with a run down convenience store. This time when we were out of the vehicle, one of the UFOs flew about 50 ft above our heads. This object was triangular in shape and about 100 feet in length. The object was solid with what looked like weird carvings that looked like some sort of circuitry. It reminded me of a computer chip. There was a bright white light on each corner of the triangle. It got directly above our head, but this made a buzzing sound. When it was there, it hovered and ascended slightly at an angle and then its two back lights went out. It then elevated rapidly and then a red light appeared and the lights were flashing. At this point it looked like an ordinary airplane. There was a second one that came close to us at this point that was disc-like in shape. It came within a hundred yards of us and looked to be about 50 feet in diameter. It had a greyish-black color for the base of the aircraft. It seem to spin as it moved away from us. This one also had a white pulsating light at the base and the top. The third object that we saw at this point was about 100 yards above us. It was trapezoid-like shaped and on the side of it, it had the same patterned row of lights as the aircraft we saw landed earlier. It, too, pulsated in sequence with the other objects that we could see in the distance in the sky. This object was about 150 feet in length. While this one was hovering about 100 yards above us and about 100 yards away, another one seemed to appear and disappear behind it. The one that appeared, appeared as a orb of some sort that looked to me as if it was caught on fire. I believed at this point, that It had malfunctioned and blown itself up because before it disappeared, it appeared to be descending rapidly. When the object that looked to be on fire disappeared, so did all of the others. That is how we lost sight of the objects. This time that we were out of our vehicles felt like it lasted 10 minutes, but I think it was really about 45 minutes. At this point, we were about 45 minutes to an hour away from Lawrenceburg, KY. On the drive back , we all felt very anxious, and for the first time since we saw the first object, frightened. It was about 4 in the morning at this time. On the drive back, we didn't spot another object in the sky. At every time that we exited the vehicle to get a better look, there were no visible stars in the area directly above us. It was completely dark. The whole sighting was about three and half hours long as I remember it now."],"Disposition":"Unknown","Object Shape":"Blimp, Circle, Disc, Fireball, Flash, Sphere, Square, Rectagular, Star-like, Teardrop, Triangle","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/32179.html.txt","/var/www/straped/mufon/org/32179.html"],"Weather Factors":"None, Windy, Rain, Light","Summary":"Sighted 30+ UFOs circling the vehicle. The UFOs hovered and had flashing lights that seemed to pulsate","City":"Lawrenceburg","Case Number":"32179","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date of the Event":"04/26/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.039637,+-84.895417(32179)&iwloc=A&hl=en\"> mufon case (32179) map </A>","Region":"Kentucky","Log Number":"US-09292011-0009","Tags":"City","Object Features":"Patterned Surface, Appendage(s), Wings","Source":"MUFON","Latitude":"38.039637"}