{"Sighting Duration":"Undisclosed","Region":"Mississippi","Longitude":"-90.316028","Country":"United States","divs":["Sighting DetailsI was outside looking for this light that shows up out of nowhere, when my husband noticed a light in the eastern sky the looked to be spinniing with red,blue,yellow and white lights that didn't blink on and off, but rotated in a circle around like a spinning top. Shortly after trying to get the lights on camera we saw what we first thought was a helicopter with a search light going in the direction of the lights. So we ran into the garage so the search light would not see us. When we looked up about 10 seconds later the lights went out as the plane got closer. The plane turned off the search light and headed east. When it got out of sight the bright spinning lights came back but not in the same spot. I don't know of any plane with a search light but I know it was not a helicopter and we heard a engine but we didn't see or hear helicopter blades. I just want to know anyone else saw this or notices the lights. They show up often and no it's not a star. I study stars!!!!!!!!!!!!! Do not currently have upload cable, but I am willing to show videos."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.343124,+-90.316028(32174)&iwloc=A&hl=en\"> mufon case (32174) map </A>","Summary":"object spins and hovers with bright colors. Moves very, very slowly and dims in and out with colors visible with the naked eye.","Date of the Event":"09/28/2011 09:10 UTC","City":"Clinton","Tags":"City","Log Number":"US-09292011-0004","Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path","trends":["There have been 6 other sightings in Clinton","There were no other sightings in Clinton on or around September 28th 2011"],"Date Submitted":"09/29/2011 12:48 UTC","Disposition":"Insufficient Data","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Circle, Cylinder, Disc, Sphere, Star-like, Unknown","Case Number":"32174","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32174.html.txt","/var/www/straped/mufon/org/32174.html"],"Latitude":"32.343124"}