{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"32177","Summary":"Object approached my location from SE rapidly, then slowed, stopped, moved to my left, and turned back toward SW. Then vanished.","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Shape":"Blimp, Cylinder, Oval, Teardrop","Weather Factors":"Unknown","divs":["Sighting DetailsMy wife and I were sitting outside of our home in Los Angeles near the LA river. I noticed a very bright yellow-orange light approaching rapidly from the SE. I am a space and aircraft enthusiast and it seemed strange that this object was flying so quickly in a direction never used by any of the aircraft that fly over our area. It also did not look like the helicopters that are a ubiquitous part of living in L.A. I listened for the sound of an engine as it approached and heard nothing at all. There was nothing else in the sky at that time. There were minimal hazy patches of clouds but the few stars visible in Los Angeles were easy to see. The object then slowed as it came nearly overhead. At that time I asked my wife to have a look and she didn't have an explanation for it either. We watched as it came to a stop, slowly moved to the right (our left) and very slowly turned in a parabola towards the SW. It then completely disappeared. The color was yellow-orange and was constant. No flashing lights and certainly no sound. I have no idea what it's altitude was. We are neither of us given to this type of speculation. Nor are we UFO enthusiasts in any way. I know from my experience with various aircraft that the only things that move like this did are helicopters but the speed at which it approached and the silence from it makes me think it was not a helicopter. Neither of us drink or use drugs, neither of us are prone to hallucinations. There was nothing in the news today at all about it and I have not found any statements online from either witnesses or authorities. What did we see?"],"Latitude":"36.781161","trends":[],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.781161,+-119.416872(32177)&iwloc=A&hl=en\"> mufon case (32177) map </A>","Longitude":"-119.416872","Country":"United States","Date Submitted":"09/29/2011 03:26 UTC","files":["/var/www/straped/mufon/html2text/32177.html.txt","/var/www/straped/mufon/org/32177.html"],"Date of the Event":"09/27/2011 11:08 UTC","Tags":"City","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09292011-0007","City":"Undisclosed","Source":"MUFON"}