{"Object Features":"None","files":["/var/www/straped/mufon/html2text/32172.html.txt","/var/www/straped/mufon/org/32172.html"],"Country":"United States","Source":"MUFON","Case Number":"32172","Region":"Pennsylvania","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in South Park Township","There were no other sightings in South Park Township on or around August 31st 2011"],"Tags":"City","Log Number":"US-09292011-0002","Date of the Event":"08/31/2011 09:15 UTC","Date Submitted":"09/29/2011 12:24 UTC","Object Shape":"Sphere","Summary":"Transparent red glass like orb, odd roundish shape, w/ bright orange flare like in center approached from east slowly changed to north. Guesstimate alt 1-2000ft speed 150-250 mph. Observed 2-3 min.","Object Flight Path":"Path with directional change","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-80.014106","map":"<A HREF = \"http://maps.google.com/maps?q=40.30849,+-80.014106(32172)&iwloc=A&hl=en\"> mufon case (32172) map </A>","Latitude":"40.30849","City":"South Park Township","Weather Factors":"Unknown","divs":["Sighting DetailsAugust 31 2011 at approx 2115 hrs I was driving home from work, just started going down a hill when I noticed a light in the sky heading towards me west to east. Initially thought it was an aircraft as I got to the bottom of hill and object got closer I noticed an odd color to it I pulled my vehicle over into local tennis club parking lot to watch it. It continued to head towards me and at it's nearest point to me approx eigth mile or less it gradually changed course to a northernly heading. It's speed was between 150-200 mph and altitude approx 1000-2000 ft. Object was like a transparent red glass roundish shape with a very bright orange flare in center. As I watched for 2-3 min before landscape obscured my view of it, it struck me as being comical- like an artist's depiction. I didn't look real. Shortly after my sighting I called a local news station to see if anyone else reported this-response was negative. I am ex military and not even an astronomer by any means, but I have seen meateors and I know when I'm looking at a satellite, iridium flare or the iss. The object I saw that night had no nav lights and made no noise. I cannot come up with any plausible explanation as to what I saw that night."]}