{"divs":["Sighting DetailsTwo of us were sitting on a secluded part of the beach several miles south of Yachats, Oregon. The sky was clear, and I spent much of the evening looking up at the stars. I am a UFO enthusiast, but also a skeptic, and was hoping to see aircraft of any kind (human-made or not) because of the great visibility. My companion isn't a UFO enthusiast and is more skeptical than me, but he acknowledged he saw something odd last night. We didn't have a clock on us, but I believe it was around 9 p.m. when I glanced up and saw a series of lights moving above and slightly to the north of us. The object was about the size of a golf ball at arm's length when it was flying over us, slightly to the northwest out toward the Pacific Ocean. The craft's lights were in the approximate shape of an arrow, with three steady, white-yellow lights forming a chevron at the front of the craft. At least one or two of the same type of lights formed the shape of a narrower, fuselage-type \"arrow shaft\" in the middle. At the back of the craft, a pair of the same lights extended out again like another chevron pointing in the same direction as the front of the craft. On the rear of the craft was a single red light, the same size as the white-yellow lights, only this one was blinking at a rate of about every other second. The two of us walked further out on the beach to get a better look at the craft, as we both realized it didn't look like a conventional aircraft. We looked but did not see any flashing green or white FAA-regulation navigation or anti-collision lights. The craft continued over us toward the northwest but eventually made what appeared to be a wide arc and began flying south down the coast, several miles out to sea (I am not good at estimating distance so cannot say how far out it was). The craft, when viewed at a distance from the side, looked like a stereotypical \"flying saucer\" with a series of white lights flying in a row. The craft appeared to continue flying to the southwest, further out to the ocean. As it flew further away and out of sight, I was able to keep my eyes on the single blinking red light as it moved further out to sea. Eventually it faded away out to the southwest, and we didn't see any other aircraft that night. I'm not sure if the craft made any noise because we were right next to the ocean and waves, which were very loud."],"Object Shape":"Other","Country":"United States","Date of the Event":"09/28/2011 09:00 UTC","Latitude":"44.29967","Tags":"City","Region":"Oregon","Log Number":"US-09292011-0014","trends":["There have been 4 other sightings in Yachats","There were no other sightings in Yachats on or around September 28th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=44.29967,+-124.108244(32184)&iwloc=A&hl=en\"> mufon case (32184) map </A>","Date Submitted":"09/29/2011 12:08 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/32184.html.txt","/var/www/straped/mufon/more/32184_submitter_file1__Screenshot2011-09-28at11.28.02PM.png","/var/www/straped/mufon/more/32184_submitter_file2__yachatsufo.png","/var/www/straped/mufon/org/32184.html"],"Object Features":"Unknown","Object Flight Path":"Path with directional change","Summary":"Low-flying, arrow-shaped craft with steady white-yellow lights and one flashing red light","Longitude":"-124.108244","City":"Yachats","Case Number":"32184","Disposition":"Unknown","Weather Factors":"None","Viewing Distance":"Unknown"}