{"Date Submitted":"09/29/2011 02:05 UTC","Country":"United States","Latitude":"34.743081","Date of the Event":"09/28/2011 05:40 UTC","Sighting Duration":"00:07:00","Case Number":"32187","files":["/var/www/straped/mufon/html2text/32187.html.txt","/var/www/straped/mufon/org/32187.html"],"Summary":"Star like object that looks like a round white sphere with binoculars.","Weather Factors":"None","Object Shape":"Circle, Oval","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.743081,+-112.005622(32187)&iwloc=A&hl=en\"> mufon case (32187) map </A>","divs":["Sighting DetailsWhile in our front yard waiting for our Son to come pick up our Grand daughter my wife spotted this star like object in our north center sky. It seemed strange as it was day time and the sun was shinning beautifully. I had my Grand daughter get my binoculars from the house to see it better. By that time our Son and his wife arrived to pick up our Grand daughter, finding us all looking at something in the sky. Using the binoculars the object looked like a round white circle about the size of a BB, it just seemed to stay in one place with little or no movement. I couldn't tell how high up this object was. At the same time, my Daughter in law was watching it with the binoculars and the rest of us just watching it without, the object disappeared, gone. But my Daughter in law saw something a little different as she had the binoculars, the object shot off to the west, which the rest of us were unable to see and it happened in a split second. This sighting lasted roughly 7 minutes. Our Grand daughter was so excited as she also watched it, with and without the binoculars!"],"Longitude":"-112.005622","Object Features":"Unknown","Tags":"City","Region":"Arizona","Log Number":"US-09292011-0017","City":"Cottonwood","Viewing Distance":"Over One Mile","Source":"MUFON","Object Flight Path":"Stationary","trends":["There have been 13 other sightings in Cottonwood","There were no other sightings in Cottonwood on or around September 28th 2011"]}