{"files":["/var/www/straped/mufon/html2text/3219.html.txt","/var/www/straped/mufon/org/3219.html"],"Longitude":"-123.080744","Date of the Event":"08/31/2004 11:15 UTC","Object Shape":"Triangle","Sighting Duration":"01:59:00","Date Submitted":"08/31/2004 11:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.061959,+-123.080744(3219)&iwloc=A&hl=en\"> mufon case (3219) map </A>","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around August 31st 2004"],"Latitude":"44.061959","Disposition":"IFO","Log Number":"","Case Number":"3219","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Features":"Undisclosed","Summary":"UFO over Eugene Oregon, August 31, 2004","Weather Factors":"Unknown","Source":"MUFON","Region":"Oregon","divs":["Sighting DetailsFriend called me and Said the News said there was a UFO over Eugene. KEZI LocalTV Station I guess showed it with some nice zoom in from their Camerason the1100 News. He said it had been up there for a couple hours and that the newshad been getting calls on it from about 900 PM.Another Friend and I drove to where it was reported. There were a few people inthe parking lot. They pointed it out to us. It initially was very dim withLight pollution and haze. We brought our cameras and a pair of Binoculars.It moved a bit then hovered and we were able to get a better view of it. Wewatched it for the next 20 - 30 minutes while more people from town streamed in. It was too faint for our cameras to pick up, but with the Binoculars there wasmuch more clarity.The Object would Move a bit then Hover in place for about 5 minutes or so, thenmove in another direction and Hover again. You could tell it was hovering byits stationary position to background stars. When it moved sometimes it wasslow, and sometimes very fast. Total movement over 20 minutes encompased about90 Degrees of the sky. Eventually it moved rapidly down and farther off andwent over the horizon. This seemed like a controlled movement and not like itcrashed.If the Object moved normally it would have likely been mistaken for an Airplane. With the Binoculars it had various lights in a triangle shape. A Red one Uptop, and a Green one on the left and sometimes another green one or red one onthe right. The Green Light would sometiems be very bright, and other timeswould dim, perhaps as the light pointed other directions. At one time itstarted flashing a Bright blue light in the middle for a total of 4 lights.The News is going to repeat their coverage on their morning editions. KEZIChannel 9 in Eugene. A Call to the Station indicates they shall not likely putthe video online, unfortunately.The Day was sunny and about 90 degrees and clear skies. Some Haze then cloudsmoved in at night. Clouds a couple hours later were moving opposite thedirection that the Object was last seen travelling. The Moon was near Full butin the other half of the Sky.Due to the flight characteristics it seems the Object is Unidentified. It wasnot a plane because planes dont hover for 5 minutes at a time. It did not movelike a baloon and although its movement was mostly ZigZag and it sometimes movedslowly like drifint, its was also controlled, and wou"],"Object Flight Path":"Unknown","Tags":"City","City":"Eugene"}