{"Case Number":"32194","Region":"Texas","City":"El Paso","Longitude":"-106.335537","Date Submitted":"09/29/2011 05:07 UTC","Summary":"About 20 feet abobe my head it was flouting ( like a wite sfera sombady inside)","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsIn 1995 I was living in El Paso TX during that time I was Working as a Machinist and Like Witter at Golden Corral Restauran at nigth that date was Thanks Guiving Big reasson to not forgot. During that time I was living in My truck (a Chevy Truck 1962 With camper ) i use to Been park it in Front of the machine Shop I been Working during the day wich was in that time ubicated about Half Mile a way from Golden Corral. So after finished my shift in the Restaurant i Drove back to my coustomary place to rest I decide to Praid for Thanks to God it was a good tiping night and other \"reassons I did have in that time \" I did focoused my eyes at the sky I just start my oracion and sudenly emerge a whit Ball at the thistance bijaind of the machine shop Biulding about 100 yards distance at that moment i did notice a figure inside my reaccion was irrace my arms an scrime to called his attention but I dont know wy but i couldent at any time i did not feel scarry the n I decide to walk to the Encounter of the thing then I walk to this but my sorprise was when I was closse to him about 10 or 15 feet above my head it or he watever it was ignorest me like i was'nt there he just kip flouting at the same altitud and at the same speed until it just was a small ligt at the distance . Af ter this event i allso saw a big Mirror in the Sky Clousing like a Window it happens at the same City Elpaso TX .You can imvestigate the location is on Lee Trevino av i was Working in Golden Corral and the machine shop Was closed to Golds Gym which is about half Mile a way. any way this is par of my story now I am living in Ventura CA an I allso have Experiences same tipe maive some day you wuold like to lisento me 9 for me advances tecnologie is all ready owed to Goverments Like USA but at the same time some tecnologies from outher space is trying to showing more about Creation of the universe . Thanks for this and I just feel like i need to sher this Experiences (Lo que quiero compartirles es que ellos no estan aqui para lastimarnos ellos quieren que el equilibrio en el universo no se altere y eso se deve a que todo tiene un tiempo para cumplirse y su trabajo es cuidar de que asi sea. amedida de que nuestra capasidad de respeto a lo creado cresca *Llegara el Tiempo*) Translation above I want to share is that they're not here to hurt us they want the balance in the universe is not altered and it is to deve everything has a time to meet and work is taking care of so be it. amedida that our layers of respect for the created Cresca * Arrival Time *)"],"files":["/var/www/straped/mufon/html2text/32194.html.txt","/var/www/straped/mufon/org/32194.html"],"Object Shape":"Egg","Sighting Duration":"Undisclosed","Log Number":"US-09292011-0024","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around November 25th 1995"],"Disposition":"Unknown","Latitude":"31.761108","Date of the Event":"11/25/1995 03:20 UTC","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=31.761108,+-106.335537(32194)&iwloc=A&hl=en\"> mufon case (32194) map </A>","Country":"United States","Object Flight Path":"Path with directional change","Weather Factors":"Unknown"}