{"Log Number":"US-09292011-0026","Disposition":"Insufficient Data","Latitude":"33.979561","trends":["There have been no other sightings in Bolivia","This sighting has never been favorited."],"City":"Bolivia","map":"<A HREF = \"http://maps.google.com/maps?q=33.979561,+-78.270056(32196)&iwloc=A&hl=en\"> mufon case (32196) map </A>","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Summary":"During a sheet lightning display I was staring at the western sky when I clearly saw a cigar shaped object moving at a speed over 500 mph. It path was straight for a short time and then abruptly turned east. I continued to watch but it vanished.","Region":"North Carolina","divs":["sighting detailsi was on my back patio watching sheet lightning in the western sky. as i was looking up i clearly saw a solid cigar shaped, illuminated object traveling somewhat faster than a commercial aircraft. it was so clear that i immediately saw that it lacked any fixed wing , rotor, tail or navigation lights. this object was even more clear each time lightning struck, though it was very clear even without it. i watched it travel along a straight course for about 1- 1 1\\2 minutes at which time it abruptly turned on a dime to the east. i waited for it to pass some sparse pine tree limbs. i watched for at least 6 or 7 more minutes but the object vanished. this was no anomaly. it was exceptionally easy to see. i have watched the skies for the better part of my adult life (i'm 62)and have had more than just a passing interest in ufo's. i have never seen one before this. i knew immediately that it was a ufo."],"Case Number":"32196","Weather Factors":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/32196.html.txt","/var/www/straped/mufon/org/32196.html"],"Date of the Event":"09/28/2011 09:30 UTC","Longitude":"-78.270056","Date Submitted":"09/29/2011 08:02 UTC","Object Flight Path":"Path with directional change"}