{"Object Flight Path":"Straight-line path","Longitude":"-81.153136","City":"Alliance","Latitude":"40.904029","Object Shape":"Boomerang","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32193.html.txt","/var/www/straped/mufon/org/32193.html"],"Date Submitted":"09/29/2011 04:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.904029,+-81.153136(32193)&iwloc=A&hl=en\"> mufon case (32193) map </A>","Case Number":"32193","Region":"Ohio","trends":["There have been 5 other sightings in Alliance","There were no other sightings in Alliance on or around November 3rd 2009"],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-09292011-0023","Country":"United States","Weather Factors":"Unknown","Object Features":"None","Summary":"3 black","Disposition":"Unknown","Date of the Event":"11/03/2009 11:00 UTC","divs":["Sighting Details My wife and I went outside our Alliance OH area home on the night of November 3, 2009 at about 11pm to star gaze and talk. It was a cool crisp cloudless night.The stars were really twinkling and changing colors,we were even joking around about them being UFOs and how we wouldn't ever be lucky enough to see a UFO. Not long after the conversation started my wife jumps really close to me and says \"what is that\" and points straight up.I immediatlly look upwards and my eyes are instantly drawn to a black glider or boomerrang shapped craft heading south at a high rate of speed,I'm talking thousands of mph.Then we notice another one a couple seconds later, then another. They all were 15000-25000 feet up,silent,black and fast...real fast,like nothing I've ever seen before.They were out of site almost as soon as we spotted them,we only could focus on them long enough to make out the shape and color and to notice that they didn't have any lights.The only way that we could see them is because they were so black and the fact that the sky's backdrop was lit up so bright from all the stars. As the event happened I was trying to rationalize what I saw,was it a jet,milatary...? As I collected the information in my mind I could come to only one unbeleivable conclusion...UFO. We had mixed emotions as we laid in bed that night talking about what we had seen.We were excited about it but also scarred because in our eyes that question of is there aliens and real UFOs had been answered and we didn't know if we were ready to accept that knowledge. I still think of that night and my heart kind of skips a beat or two when I relize that we arn't alone...but we must accept it."]}