{"Country":"United States","Object Shape":"Boomerang, Circle, Flash, Sphere, Star-like, Triangle","Case Number":"32192","Viewing Distance":"21-100 Feet","Date Submitted":"09/29/2011 03:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.25796,+-121.77936(32192)&iwloc=A&hl=en\"> mufon case (32192) map </A>","City":"SAND DOLLAR BEACH/BIG SUR","Log Number":"US-09292011-0022","Source":"MUFON","Summary":"My BFF & I were Jade hunting at Sand Dollar Beach in Big Sur Ca. After sunset we went up the first flight of stairs to leave. We stopped to look at the ocean. We saw a strange blinking white/blue/red light over the water","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","Date of the Event":"08/07/2011 08:00 UTC","divs":["sighting detailsmy bff & i were jade hunting at sand dollar beach in big sur, ca. we stayed until after sunset, so it was dark when we headed up the stairs to go home. we went up the first flight of stairs and stopped to rest, as we looked out at the ocean. i noticed a strange bright white light hovering over the water. i asked my gf what it was and she thought it was the oncoming car lights from the hiway up above us. i informed her it was not because the hiway is directly behind us not in front of us or to the right side of us! we acknowledged the light and it darted away. then i said,\"dont be shy!\" (of course i was kidding)then it reappeared and got brighter, it seemed to blink when we talked to it. then it blinked from white to blue to red. we started to get scared so we decided to leave. my intuition and sixth sense became overwhelmingly strong. i felt a premonition...i knew something was going to happen. i knew something was waiting for us at the top of the trail. i was reluctant to leave but my gf encouraged me. she reminded me how late it was and we had a 2hr drive ahead of us back to monterey bay. she lead us up the staircase to the trail, all we had was our cell phones used as flashlights. once the staircase ended we continued up to the dirt trail. im really scared and holding onto her by the back of her shirt with one eye open. then we see a light, it looked like a flashlight shining threw the trees and bushes. it looked like someone jogging down the trail towards us with a flashlight\\spotlight shining randomly. i had a sign of relief for a minute thinking it was a person, but as it got closer it then looked like a miners hat with a bright white spotlight. we both then realized it wasn't human and it wanted to communicate. i spoke to it and said, \"i don't understand what you are trying to say to us because your not human and dont speak our language!\" then it got closer, the miners spotlight hat turned into a boomerang\\triangle with the bright white spotlight. it started to touch down, but with white tenticles\\strings hanging from it that started to take human form. thats when the 3 points of the triangle materialized into 3 beings & 3 lights!! white light turned into an animal, blue light turned into a lady with long black hair overweight wearing a blue dress, and the red light turned into a man in a red outfit. we asked them if they were friendly? right when they completely took form and hit the ground,they immediately rushed us and ran full-force towards us!! that is not friendly!!!! we did not like that at all!!!! we started praying! my gf kept repeating the lords prayer. i called upon god to cover us with jesus's precious blood and protect us from all evil!!! i called upon my guardian angels to wrap their beautiful wings around us and keep us safe!! within an instant they disappeared!!! i still remember the look of fear on the lady's face...very creepy!!! not sure if they are aliens or spirits!? maybe their cousins, lol!! we continued to see them above the ocean on our left side on our drive home. i have some video footage of it. i also have pictures of the beach before we left. my pictures have alot of orbs in them. very strange!"],"Region":"California","files":["/var/www/straped/mufon/html2text/32192.html.txt","/var/www/straped/mufon/more/32192_submitter_file1__IMG_1802.JPG","/var/www/straped/mufon/more/32192_submitter_file3__IMG_1899.JPG","/var/www/straped/mufon/org/32192.html"],"Sighting Duration":"03:00:00","Object Flight Path":"Stationary,Hovering then path","Latitude":"36.25796","Longitude":"-121.77936","trends":["there have been no other sightings in sand dollar beach\\big sur","This sighting has never been favorited."],"Object Features":"Undisclosed"}