{"Tags":"City","Longitude":"-93.720338","Summary":"Reddish-Orange light in sky, hovered for 5 minutes then sped northward","Source":"MUFON","Object Features":"Unknown","City":"Urbandale","Sighting Duration":"Undisclosed","Weather Factors":"None","Log Number":"US-09302011-0001","Region":"Iowa","divs":["Sighting DetailsMy daughter and I were driving westward on Meredith Drive in Urbandale, IA around the 7400 block at 10:18pm on July 30, 2011. My daughter was looking out the passenger window looking to the north, and she saw something in the sky. She said, \"Look Dad.\" I leaned over but couldn't see it at first. Then I leaned farther over and could see it out of her window. It was a reddish-orange light in the sky about the size of my small finger's fingernail. It hovered in the sky and did not move. It was approximately between 30 degrees and 40 degrees above the horizontal. I could almost make out a disk shape on the right edge of it. The light covered the entire object. It glowed reddish-orange. It almost seemed as if it were on fire. But it wasn't. We drove westward and kept our eyes on it. I turned north on a side street at approximately the 8900 block of Meredith Drive so I could stop the car and get a better look at it. Once I spotted it again, it appeared to be moving northward, away from us. It was much smaller now. The size of a star, but still red in color. We could see it moving away from us at incredible speeds. It stayed at the same altitude. My daughter's friend who was watching the stars that night told my daughter that he had seen this reddish object that same night also. He was a few miles north of us at Saylorville Lake. The event lasted about 5 minutes. It was over by 10:23pm."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.659112,+-93.720338(32199)&iwloc=A&hl=en\"> mufon case (32199) map </A>","Latitude":"41.659112","files":["/var/www/straped/mufon/html2text/32199.html.txt","/var/www/straped/mufon/org/32199.html"],"Country":"United States","trends":["There have been 5 other sightings in Urbandale","There were no other sightings in Urbandale on or around July 30th 2011"],"Date of the Event":"07/30/2011 10:18 UTC","Case Number":"32199","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Date Submitted":"09/30/2011 12:17 UTC","Object Shape":"Circle, Oval"}