{"files":["/var/www/straped/mufon/html2text/32198.html.txt","/var/www/straped/mufon/org/32198.html"],"Object Flight Path":"Path with directional change","Summary":"Boomerang in shape. Back side was more curved. Ends were more tapered","Date of the Event":"09/29/2011 08:15 UTC","Date Submitted":"09/29/2011 10:14 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=41.161043,+-96.034628(32198)&iwloc=A&hl=en\"> mufon case (32198) map </A>","City":"Papillion","Country":"United States","divs":["Sighting DetailsI was sitting on the patio this evening. First I saw what looked like a star moving from west to slightly north east. It was only a small white light moving in a straight line. As it moved, it faded and finally disappeared. Then just seconds after that, another identical light came from the same western place in the sky, moved the same direction and also faded and then disappeared. As I was looking for another light to show up, I noticed what looked like a \"shadow\" in the sky in the same place that the lights had come from. It did not have any lights, and was barely different in color than the sky, but slightly lighter. It may been reflecting the ambient western light? There were no clouds. It was large, boomerang in shape, except that the back side was curved, making the front part wider that a boomerang and the ends were more tapered. It did not make any sound. It was larger than any large aircraft I have ever seen. It started out heading from west to slightly northeast, like the lights, but then headed south. I live near Offutt airforce base, and I have seen stealth bombers and they make a very loud sound. This was not one of those. I have no idea what it was that I saw. But I am very impressed with the shadow or almost transparent appearance, how large it was and that it made no sound. It seemed to be moving at the same speed as the lights that came before it. this was not fast, but almost like the speed of an airplane coming in for a landing"],"Object Shape":"Boomerang, Star-like","Weather Factors":"None","Case Number":"32198","Tags":"City","Latitude":"41.161043","Region":"Nebraska","Longitude":"-96.034628","trends":["There have been 2 other sightings in Papillion","There were no other sightings in Papillion on or around September 29th 2011"],"Source":"MUFON","Log Number":"US-09292011-0028","Object Features":"None","Disposition":"Unknown"}