{"Viewing Distance":"20 Feet or Less","Log Number":"CA-09302011-0011","Date of the Event":"05/28/2007 12:00 UTC","Region":"Ontario","Object Shape":"Triangle","Object Flight Path":"Hovering then path,Straight-line path","trends":["There have been no other sightings in Hillsdale","This sighting has never been favorited."],"Country":"Canada","Longitude":"-79.761198","Date Submitted":"09/30/2011 01:43 UTC","divs":["Sighting DetailsThe sightings began one day before by my gf and her friend. They said they saw multiple things flying around their farm and causing electrical problems with their vehicles. The next night i went to the farm and we saw multiple ufos flying around again but very high up. As we were driving we had one of them descend down to our truck at lighting speed, then it hovered for a bit behind the truck and after 15 secs or so it flew directly beside our truck, just above the power lines. It went past us slowly as we all just stared in awe. It sounded like very small outboard boat motor, very quiet hum. It had red blue green white lights that flashed with no specific pattern. It followed the powerlines and we never saw it go back up in the sky. We followed it as far as we could. This wouldnt be the last time we saw these crafts... After doing a ton of research I found that these crafts have been sighted since the 50's and BMW most likely makes the small engine that runs it. It only needs a small engine because it is almost weightless. Apparently by spinning mercury around in a circle within a vacuum you can reduce the gravitational forces of anything within the circle. But who really knows. I know what we saw."],"Weather Factors":"Unknown","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=44.580155,+-79.761198(32209)&iwloc=A&hl=en\"> mufon case (32209) map </A>","City":"Hillsdale","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/32209.html.txt","/var/www/straped/mufon/org/32209.html"],"Latitude":"44.580155","Case Number":"32209","Summary":"Black Triangle UFO Sighting 1 of 5","Tags":"City"}