{"Country":"United States","Region":"Kansas","City":"Overland Park","Source":"MUFON","Date Submitted":"09/30/2011 11:40 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","Latitude":"38.986838","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAs reported to MO ASD by phone. Witness did not have internet access and submitted this report after giving me another report in Missouri. He did not wish to leave his contact information. See his other report in Missouri over 635. \"I was driving on I-35 highway at approximately 8:50 PM when I noticed a triangluar shaped craft passing over the highway in front of me at approximately 3,000-5,000 feet altitude. It was flying slower and lower than a jet aircraft would, but it appeared to be the size of a 747 or larger. It was so odd looking that I pulled over to the shoulder to get a better look at it and watched it through binoculars. It moved very slowly. There were three white lights on the bottom, which did not have beams and a red light in the center. It looked like the object was black with structure. None of the lights were flashing or pulsing. There was no tail or wings, and I did not see a red or green light like you would on a plane. Then, two more white lights came on and the object was not in a triangle shape any longer - it was in a V shape with five white lights for a few minutes, then those lights went off, leaving the three white lights on. It continued moving until it was out of sight. I did not have a camera with me.\""],"Object Features":"None","files":["/var/www/straped/mufon/html2text/32204.html.txt","/var/www/straped/mufon/org/32204.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.986838,+-94.662382(32204)&iwloc=A&hl=en\"> mufon case (32204) map </A>","Object Shape":"Triangle","Log Number":"US-09302011-0006","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around September 26th 2011"],"Summary":"Triangular shaped craft over I-35 Highway","Date of the Event":"09/26/2011 08:50 UTC","Longitude":"-94.662382","Viewing Distance":"Unknown","Case Number":"32204"}