{"City":"Whitehall","Region":"Michigan","Country":"United States","Weather Factors":"Unknown","Date of the Event":"06/07/1995 12:00 UTC","files":["/var/www/straped/mufon/html2text/32214.html.txt","/var/www/straped/mufon/org/32214.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.393746,+-86.347867(32214)&iwloc=A&hl=en\"> mufon case (32214) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Source":"MUFON","Date Submitted":"09/30/2011 02:02 UTC","Object Features":"Undisclosed","Viewing Distance":"101-500 Feet, Over 1 Mile, Unknown","Object Shape":"Sphere, Star-like, Other","divs":["Sighting DetailsMy girlfriend at the time and I went out to the pear on lake Michigan to hang out with friends;that's what we would do on the weekend. That night we where the only ones there because a big storm was approaching from the west. It was a beautiful night no wind very calm and no waves. We were looking at the stars, you could see millions of them when my wife said to me look at that boat out there. When I looked I saw a light about 10miles down the lake to the southwest towards the storm and said \"He better get in or he'll be in trouble\" and went back to looking at the stars. about 10-15 sec. passed and she said \" were is that boat\", I looked and it was not there, so I looked around. The light was past us about 5 miles to the north, that is impossible, no boat is that fast, when all of a sudden it shot up about a hundred feet and hovered for five min. dropped back to the water then came toward us,as it got closer I saw a huge black mass but could not make out any shape.My wife got scared and wanted to go, I told her to go find someone to see this.She left \"FAST\"telling me to come but I was to drawn to it.When it got within a hundred feet it shot away so fast it was unbelievable. I couldn't hear anything but some thunder from the storm.It was now about ten miles away from me. It would hover off the water and sometimes look as if it would enter the water.after watching it go up and down for awhile it soon entered the storm and that was the last I saw it.We drove to town and told people but no one would believe us.The next day on the radio more people say they saw UFO over lake Michigan that night."],"Tags":"City","Log Number":"US-09302011-0016","Longitude":"-86.347867","Latitude":"43.393746","Disposition":"Unknown","Case Number":"32214","Sighting Duration":"Undisclosed","Summary":"It was a brite light off in the distance over lake Michigan like a boat but moved to fast and raised above and below the water .The closer it got it was like a huge black mass.","trends":["There has been one other sighting in Whitehall","There were no other sightings in Whitehall on or around June 7th 1995"]}