{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsJust after the 10:00 oclock news came on the TV, July 2,2011, I went outside and from my front porch I looked up and saw four very pretty red lights in the sky. I went in and got my wife and had her come out and look. We went out the back door because the lights were moving in that direction. They were directly overhead in a clear stary sky. We watched as they moved off to the northeast. We looked back and four more were comming. No sound, no flashing or rotating like an aircraft beacon. These four moved off following the first four. Then four more came and followed the others. They were directly overhead, I would guess at about 500 to 800 feet. We watched them fly away toward the northeast very slowly wntil they all disappeared out of sight, probably 15 to 20 miles away. They were getting higher in the sky as they flew away. Later I went to the gas station to get a news paper and I ask the clerk if he saw the lights, he said yes, we all saw them and wondered what they were. And thats my question too. what were they. I was a pilot and flight instructor when I was younger, I am now 73 years old and I have seen a lot, but I have no explaination for what I saw. just red lights flying by themselves, twelve lights following each other, not in a stright line, not all at exactly the same altitude, but maintaining the same position as a group slowly, silently moving away. If you have an answer I would sure like to know it."],"Disposition":"Unknown","trends":["There have been 2 other sightings in Santa Fe","There were no other sightings in Santa Fe on or around July 2nd 2011"],"Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=29.335507,+-95.076654(32215)&iwloc=A&hl=en\"> mufon case (32215) map </A>","Country":"United States","City":"Santa Fe","Summary":"Red/orange lightys , three groups of four passed directly overhead. Very bright , pretty lights, no sound, no flashing or rotating, directly overhead in clear stary sky, mover off to the north east.","Viewing Distance":"101-500 Feet","Latitude":"29.335507","Tags":"City","Weather Factors":"Unknown","Date Submitted":"09/30/2011 02:35 UTC","Case Number":"32215","Region":"Texas","Date of the Event":"07/02/2011 10:15 UTC","Log Number":"US-09302011-0017","files":["/var/www/straped/mufon/html2text/32215.html.txt","/var/www/straped/mufon/org/32215.html"],"Object Flight Path":"Straight-line path","Object Features":"None","Longitude":"-95.076654","Source":"MUFON"}