{"Date Submitted":"09/30/2011 02:45 UTC","Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Flight Path":"Stationary,Other","Region":"California","Country":"United States","files":["/var/www/straped/mufon/html2text/32217.html.txt","/var/www/straped/mufon/org/32217.html"],"Date of the Event":"07/31/2011 09:00 UTC","divs":["Sighting Detailsdriving from san diego to palmdale ca. on route 138 at approximately 9 pm. my oldest son (18) was sitting in the back seat and said whats that? my daughter (16) in the front me driving and my nephew (14) in the back seat with my son. the kids pointed it out to me. i pulled over so i could observe. the object was a red orb approximately golfball or baseball size from our point of view, pulsating slowly then vanished. didnt move anywhere just dissappeared. about a minute later the orb reappeared in the same place and started emmitting what looked like shooting stars but they were falling to the ground. after about 6 of these slow falling stars the orb dissappeared again, only to return after approx. 1 minute and started the star deployment again, this time with 10 stars falling. the orb did this same thing 2 more times, so a total of 4 vanashings and reappearances. the last appearance it dropped 5 more of these stars and the red orm got really bright and dissappeared for good this time. as a former army paratrooper ive seen flairs and helocopters at night and this isnt one of them. its taken me this long to go through my head to figure out what it was. i have no explination as to what it was. now im not very familiar with rte 138 as im new to this area. as for exact location i could probably find it again but it was nighttime and again im unfamiliar with the area. if there is any other info please do not hesitate to contact."],"City":"Bakersfield","Log Number":"US-09302011-0019","Object Features":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 32 other sightings in Bakersfield","There was one other sighting in Bakersfield on or around July 31st 2011"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.416088,+-119.097149(32217)&iwloc=A&hl=en\"> mufon case (32217) map </A>","Longitude":"-119.097149","Summary":"red pulsating light emmitting white pulsating lights","Object Shape":"Sphere, Star-like","Latitude":"35.416088","Tags":"City","Case Number":"32217"}