{"Viewing Distance":"101-500 Feet","Log Number":"US-09302011-0014","Disposition":"Insufficient Data","Latitude":"45.208173","Case Number":"32212","Date of the Event":"09/29/2011 11:54 UTC","files":["/var/www/straped/mufon/html2text/32212.html.txt","/var/www/straped/mufon/org/32212.html"],"Longitude":"-93.364122","trends":["There have been 5 other sightings in Coon Rapids","There were no other sightings in Coon Rapids on or around September 29th 2011"],"Object Flight Path":"Hovering then path,Straight-line path","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=45.208173,+-93.364122(32212)&iwloc=A&hl=en\"> mufon case (32212) map </A>","divs":["sighting details1) myself and my fiance went outside to have a cigarette at 11:53 pm cst. 2, 4) i walked outside onto the deck and saw the craft hovering just above houses about 100 yards away. it had two solid huge, bright blue led style lights on the left side, with two rows of 4 red lights of the same style and sizeabout 1\\2 inch vertically separated from my view that went off like a wave on the right side of the craft from the left to the right (right and left are relative to my view; the left was the rear of the craft, where the open part of the \"v\" was, the right was the front, the vertex of the \"v\") when i saw it my fiance was walking out right behind me and i began hitting her to gain her attention and just kept saying \"hunny hunny hunny\" and pointing with my other (right) hand. 3) i immediately knew what it was because of a previous encounter with the same craft. i could make out the shape as a chevron-esque shape. 4,6) i then watched it semi hover, possibly moving extremely slowly, then it took off straight north, covering the remaining field of my vision (about 45-50 degrees to the north from the original spot of the craft) in about 4 seconds. right as it went too far north for me to see any longer, i saw a plane which was heading south as i was watching the craft, turn abruptly and head north. i knew that was a plane because of the relatively dim red-white flashing, which i see on a nightly basis. my reaction is the same as it is any time i see the \"others\". it is a feeling of general fear of the unknown, but more pure elation as to what they know and what i can learn. as i have mentioned, i have had multiple sightings and a few encounters with the people. my fiance has had close encounters as well."],"Tags":"City","Sighting Duration":"00:00:35","Weather Factors":"Unknown","Object Shape":"Chevron, Triangle","Object Features":"Window(s)","Source":"MUFON","Summary":"solid blue lights with red sequence hovered then flew away","City":"Coon Rapids","Country":"United States","Date Submitted":"09/30/2011 01:54 UTC"}