{"Disposition":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around August 10th 1985"],"Object Flight Path":"Straight-line path","Tags":"City","Case Number":"32219","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/32219.html.txt","/var/www/straped/mufon/org/32219.html"],"Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting Details40 years of aviation experience as Naval Aviator and Commercial Pilot. While looking out the hotel window (toward the north) from about 10th floor I observed an object traveling from west to east at an elevation that did not enable me to fix a distance or size as it did not traverse any building or other physical object. The interesting thing here is that the hotel is directly east of LAX and under the arrival flight paths to LAX. The object appeared to be kind of an elongated octahedron oriented vertically vice horizontally with distinct corners and slowly rotating clockwise as viewed from the ground. It appeared to be a kinda burnt orange color, so at first I thought that it was an errant target from the Pacific Missile Test Range out of Pt. Mugu. But no, the targets that they use are bright international orange, and besides, from many years experience on the range, I have never seen a target that was that shape or color. The object moved slowly and horizontally and was in my sight less than a minute. This is one of the times one wishes for a camera or binoculars. I thought that it must be some sort of balloon, but I soon eliminated that as it flew horizontally and DID NOT appear to be influenced by the relatively strong winds coming over the city. This one fact might indicate that it was quite a bit higher than the buildings. So, I have no idea what it was. I saw nothing in the papers. Also, since it happened in \"controlled airspace\" with all sorts of commercial traffic arriving it is hard to believe that nobody reported it. That is it in a nutshell."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.058974,+-118.240885(32219)&iwloc=A&hl=en\"> mufon case (32219) map </A>","Object Shape":"Other","Country":"United States","Object Features":"Unknown","Latitude":"34.058974","Longitude":"-118.240885","Summary":"Airborne burnt orange Octahedron shaped object seen from hotel room","Region":"California","City":"Los Angeles","Date Submitted":"09/30/2011 03:24 UTC","Date of the Event":"08/10/1985 12:00 UTC","Log Number":"US-09302011-0021"}