{"Object Shape":"Sphere","Region":"Missouri","Weather Factors":"Unknown","Summary":"Light in the sky that changed direction abruptly","trends":["There have been 7 other sightings in Lebanon","There were no other sightings in Lebanon on or around June 16th 2002"],"Date Submitted":"09/30/2011 05:35 UTC","Source":"MUFON","Date of the Event":"06/16/2002 10:30 UTC","Case Number":"32225","Sighting Duration":"Undisclosed","Disposition":"Unknown","City":"Lebanon","Country":"United States","Object Flight Path":"Path with directional change","Latitude":"37.682557","Tags":"City","divs":["Sighting DetailsMy sister and I saw a light that at first we thought was a plane move in a westerly direction and abruptly move north it was not a turn as you would see with a plane.The closest I can come to explaining the movement is like a helicopter can fly sideways but the light did not stop and then move sideways it was moving forward heading west and then it shot north and was out of sight much faster than it seemed possible from watching the way planes fly. It was like it was moving at a steady pace and as soon as it changed direction it moved like at a speed like nothing I have ever seen.It seemed to me it had to be a UFO or some top secret aircraft.We were in the country at her home we had gone out for me to smoke.When we first saw the light we had been looking at the stars and when we saw the light and we thought it was a plane we had seen planes fly over this area alot when it changed direction like it did we both said that was no plane. It was maybe white I am not sure after so much time.The color was not that big a deal to me compared to the way it moved.We were pretty stunded at first we then went in and told her boyfriend he did not believe us.We were a little excited to have seen something like this."],"Object Features":"Unknown","Longitude":"-92.657146","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.682557,+-92.657146(32225)&iwloc=A&hl=en\"> mufon case (32225) map </A>","Log Number":"US-09302011-0027","files":["/var/www/straped/mufon/html2text/32225.html.txt","/var/www/straped/mufon/org/32225.html"]}