{"Latitude":"40.74999","Country":"United States","Region":"Pennsylvania","Case Number":"32222","Object Flight Path":"Stationary","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"09/30/2011 03:53 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/32222.html.txt","/var/www/straped/mufon/org/32222.html"],"trends":["There have been 16 other sightings in Easton","There were no other sightings in Easton on or around September 29th 2011"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Tags":"City","divs":["Sighting DetailsWent out for a smoke watching the thunderhead above grow then noticed a dot in the sky that wasn't moving. thought to myself it was a weather balloon, but it didn't move at all. The sky was mostly cloudy some sun with chance of thunderstorms, I watched it for at least five minutes as it hovered just around the cloud. It wasn't quite under the cloud but near the edge of it. The object seemed to stay in one place as the cloud moved. It appeared to be higher than lower clouds. It looked red at times but that may have been just my eyes from staring at the sky. I wonder if the airport nearby noticed it on radar. Planes fly over all the time here and I don't know if they fly weather balloons near busy airports There was a break in the clouds that allowed sunlight through and that's when I lost sight. A small strange looking cloud formed near the spot were I lost sight but that may have been just the clouds and had nothing to do with it. I'm filing this report in case the sighting is more than a weather balloon. I don't know who to call to find out and just maybe someone else had seen it too."],"Longitude":"-75.238708","Log Number":"US-09302011-0024","Summary":"It looked red at first then black","City":"Easton","map":"<A HREF = \"http://maps.google.com/maps?q=40.74999,+-75.238708(32222)&iwloc=A&hl=en\"> mufon case (32222) map </A>","Object Features":"Unknown","Date of the Event":"09/29/2011 12:00 UTC","Source":"MUFON","Object Shape":"Circle, Star-like, Other"}