{"Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Log Number":"US-09302011-0026","Date Submitted":"09/30/2011 04:12 UTC","Weather Factors":"None","trends":["There have been 4 other sightings in New Brunswick","There were no other sightings in New Brunswick on or around November 17th 1980"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.493566,+-74.448869(32224)&iwloc=A&hl=en\"> mufon case (32224) map </A>","Date of the Event":"11/17/1980 03:30 UTC","divs":["Sighting DetailsI was around 21 years old and was loading farm product on a truck, open dock with a beautiful view of the farm meadow. I'm now 55. It caught my eye, the colors were unreal, I always look up at the sky at night but this caught my eye. I called the other workers out to see it, they kept asking me what is it, after a while I said it might be a UFO. It looked just like one of those toys you pump on the top and it spins, the middle was blasting all kinds of light. My boss at the time had a Master's degree and worked for NASA, but his dad fell ill and he came back home to run the business so I called him and said you have to see this object in the sky. He was a mile away, I also called the police. I ran down to the house and brought back binoculars, my boss just pulled up the colors were unreal but wouldn't stay in view through the binoculars. I asked my boss \"what is it?\" he said iI don't know. Than a couple police cars pull up and they told me they have been watching it for over a hour about 5 miles away at a K-Mart parking lot. The cop said to me \"I will not report this, I like my job\". Than we were all looking up at it and out of nowhere two white objects fly into at an unreal speed, it looked like two shooting stars hit it. Than it slowly faded away. Best part is now, 15 plus years later My friend Bill is explaining to the date and time what I saw. We were in shock that someone else seen this, he was getting a drink of water and saw it out his kitchen window. We still talk about it, he's now 60 years old. The dumb newspapers at the time said people were calling in about lights in the sky, what they were seeing was Zarrahpaths Radio tower lights. Wrong, those lights nowhere near our UFO. I wrote a whole page in detail back than, it's at a friends house, I never asked for it but I'm sure they still have it, he worked on the dock with me. I spoke of this event at a very high class UFO meeting at a local college, and I mean only Professional people were allowed in. I got to know a professor really well from Rutgers and he wanted me to join him at this closed meeting. He told me this will blow you away but I think you can handle it. I know after hearing people tell their stories what I saw was real. The average Joe would of passed out or have a heart attack that evening."],"Object Features":"Unknown","Source":"MUFON","City":"New Brunswick","Disposition":"Unknown","Object Shape":"Disc","Longitude":"-74.448869","files":["/var/www/straped/mufon/html2text/32224.html.txt","/var/www/straped/mufon/org/32224.html"],"Summary":"I will not fail a Lie detector, Way out over the 82 acre field it just stayed there than two objects entered it at a high rate of speed than if left.","Case Number":"32224","Region":"New Jersey","Viewing Distance":"Over One Mile","Latitude":"40.493566"}