{"divs":["Sighting DetailsI was sitting on the swing on the front porch. Listening to internet radio on my phone, having a drink and smoking a cigarette. I look up to the left a bit and right above the tree line, about 300 - 500 ft away and I noticed a set of lights over the trees and I thought to myself, that plane is flying really low. It's going to crash. that's when I noticed directly up and right of the set of lights, 3 more lights. in a line . . . and i focused on them and all of a sudden a fourth light appeared . . . . and as the light on the left appeared the one on the right disappeared.. so i stand up and walk to the side of the porch. to get a better look. as i'm standing there looking at these two sets of lights I'm saying to myself out loud, \"you have to be kidding me, this isn't happening. I am not seeing this\" and I immediately think of my phone sitting on the railing at the end of the porch.. I glance over at my phone thinking, i need a picture of this. I looked back up in the sky and it was as if it knew I was going to take a picture of it and it all just disappeared.. I sat back down in the swing and started yelling for it to come back. Strange"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date of the Event":"08/30/2011 12:00 UTC","Latitude":"33.357662","Object Flight Path":"Stationary","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","City":"Sparta","map":"<A HREF = \"http://maps.google.com/maps?q=33.357662,+-82.802609(32220)&iwloc=A&hl=en\"> mufon case (32220) map </A>","files":["/var/www/straped/mufon/html2text/32220.html.txt","/var/www/straped/mufon/org/32220.html"],"Date Submitted":"09/30/2011 03:34 UTC","Case Number":"32220","Tags":"City","Log Number":"US-09302011-0022","trends":["There have been no other sightings in Sparta","This sighting has never been favorited."],"Object Shape":"Disc, Fireball, Sphere, Star-like","Country":"United States","Summary":"3 lights side by side, then two lights side by side a little below","Region":"Georgia","Weather Factors":"Unknown","Longitude":"-82.802609","Source":"MUFON"}