{"Viewing Distance":"Over One Mile","Region":"Maine","Longitude":"-70.277544","files":["/var/www/straped/mufon/html2text/3223.html.txt","/var/www/straped/mufon/org/3223.html"],"Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=43.970913,+-70.277544(3223)&iwloc=A&hl=en\"> mufon case (3223) map </A>","divs":["Sighting DetailsWe were out on the deck following supper, chatting, observing the night sky anddoing a little stargazing. We had just cleared the dishes when my brother lookedout to the west, and there the thing was In the very first few short seconds oflooking at it, I remember thinking My God Is that some kind of a huge militaryjets headlights plowing right at us, thinking that the pair of orbs couldpossibly be the mist-enshrouded headlights of some kind of super- giant miltaryjet...but it was just seconds before I realised that that made no sense at allfor numerous reasons - the thing appeared to be almost stationary at first,there was no mist, and there was no sound, to begin with, plus I realised thelights were just plain all wrong for such a thing, and the thing was changinganyway as it moved towards us almost immediately negating my initial thoughts.To the naked eye, the thing glowed a bright, slightly greenish-white. Form-wise,it looked sort of like a single dumb-bell with a shortened bar between its ends- two distinct, roundish halves connected by a little bar, glowing verybrightly. As it moved towards us, the bar elongated and the orbish forms at eachend appeared to shrink somewhat but continued to glow a little bit more brightlythan the bar. As it moved even closer, it slowly began to fade in and out a bitin brightness mostly fadingbut to spread in form and size until it became like agiant, softly glowing amoeba or, indeed - a distant galaxy, very freeform.Looking through the binoculars at first when it was still the very defineddumb-bellish shape, it almost had the appearance of like a miniature northernlights type thing, except it was all basically just bright whitish green with noother color with maybe just a trace of rainbow-prism action at the featheryedges and it still had that very defined form to it, but it was kind of allflowing and shifting around the edges. About halfway into the watching of it, ateveryones insistance, I called WCSH-tv our local nbc news affiliate, and sureenough, the person I spoke to in the news room said theyd received numerousother calls, and some folks were saying theyd seen more than one of whatever itwas I was asked a bunch of questions and the woman said they were trying to getto the bottom of it and that if they figured it out, it would definitely be onthe eleven oclock news - well NO SOAP Not a word... No one found it in any ofthe papers today, either This thing has GOT to be in the news somewhere -"],"Source":"MUFON","Sighting Duration":"01:00:00","Tags":"City","City":"New Gloucester","Date Submitted":"08/31/2004 09:30 UTC","Case Number":"3223","Object Features":"Other","Date of the Event":"08/31/2004 09:30 UTC","Object Shape":"Unknown","Disposition":"Unknown","Country":"United States","Weather Factors":"Unknown","Latitude":"43.970913","trends":["There has been one other sighting in New Gloucester","There were no other sightings in New Gloucester on or around August 31st 2004"],"Summary":"Bright glowing prconnected orbs movesmorphs West t","Object Flight Path":"Straight-line path"}