{"Country":"United States","Source":"MUFON","City":"Redding","Date of the Event":"09/30/2011 08:30 UTC","Date Submitted":"10/01/2011 12:02 UTC","files":["/var/www/straped/mufon/html2text/32238.html.txt","/var/www/straped/mufon/org/32238.html"],"Viewing Distance":"Unknown","divs":["Sighting DetailsI was sitting in my hot tub watching the stars, jets and satellites passing overhead; we're in northern California in Redding right under the jet corridor from southern California and the Northwest U.S. Many nights have been spent observing the skies. Last night 9-30-11 I caught an image of something flying south at a very unusual high rate of speed...enough to actually make me stand up. The object was crescent shaped with lights moving through what appeared to be liquid without a specific geometric pattern. It came from the northern horizon at a very high rate of speed approx. 30 degrees off the horizon heading south. What got me to stand up in the hot tub was that it began to turn east quickly in a 45 degree arc covering nearly one third the horizon line before it quickly snapped to a southern flight at a higher rate of speed in a slight \"S\" pattern heading due south where I observed it until the end of my observable horizon line. The object was very visible, flew in what I felt was a frantic pattern and emotionally caused the hair on my body to stand up simply because what I saw was not normal in any way and in fact seemed more cinematic and unreal. I assumed seeing something like this would be more interesting instead of eerie and somewhat threatening. This object possessed an immeasurable power that I can't relate to which stirs the soul more than ever. I called my wife and brother and couldn't find the words that would convince them that what I saw was very very unnatural and disturbing. As for size it seemed to be somewhere between the altitude of passenger jets and myself..if this were the case then the object would be quite large. If it were at the altitude of passenger jets I would then assume it's size to be massive. What bothered me was the motion, silence and hesitation of flight. It moved with purpose and this bothers me."],"Latitude":"40.584023","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.584023,+-122.418879(32238)&iwloc=A&hl=en\"> mufon case (32238) map </A>","Longitude":"-122.418879","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Sighting Duration":"00:00:12","Case Number":"32238","Log Number":"US-10012011-0001","Region":"California","Object Shape":"Boomerang, Unknown","trends":["There have been 39 other sightings in Redding","There were no other sightings in Redding on or around September 30th 2011"],"Object Features":"Unknown","Tags":"City","Summary":"Visually this was very disturbing and very real"}