{"Region":"Michigan","Tags":"City","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/32233.html.txt","/var/www/straped/mufon/more/32233_submitter_file1__IMG_0012.jpg","/var/www/straped/mufon/more/32233_submitter_file2__ScreenShot2011-09-30at9.53.17PM.png","/var/www/straped/mufon/org/32233.html"],"Summary":"Constant single point light","Latitude":"42.987456","trends":["There have been 2 other sightings in Grand Rapids Charter Township","There were no other sightings in Grand Rapids Charter Township on or around September 30th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Source":"MUFON","Case Number":"32233","Sighting Duration":"Undisclosed","Date of the Event":"09/30/2011 09:27 UTC","Object Features":"Unknown","Country":"United States","Date Submitted":"09/30/2011 10:38 UTC","Disposition":"Unknown","Viewing Distance":"Over One Mile","City":"Grand Rapids Charter Township","Log Number":"US-09302011-0035","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=42.987456,+-85.716321(32233)&iwloc=A&hl=en\"> mufon case (32233) map </A>","divs":["sighting detailsmy wife called on her way home from work describing a line of lights in the sky near our home. i went outside in my pjs and observed one light through the trees. i waited for my son to get in the car, we pulled out, waiting for a passing car, and drove 6 blocks towards the light which traveled very slowly perpendicular in a true north and south direction. just slightly off from the n\\s street grid. it only managed to move about 2 blocks to our left while we moved 6 towards, and 2 over. it them seemed to be behind us and passing over as i snapped some pics with my iphone. my son and i observed it and as i switched the phone to camera mode the light disappeared. a few minutes later we could see a jet take off from a distant international airport. i'd have to say that the upf was about a mile higher than the plane and appearing almost as large in the sky. the light was really deceiving. as if it was only as high as a sky scraper, and at the same time miles high like the bombers i'd watch take off in az."],"Longitude":"-85.716321"}