{"divs":["sighting detailsi was walking out of work after midnight. i rode my bike to work and while i was unchaining it in the parking lot, i noticed a falling star (meteor) falling to the earth. i stopped to pause and look at it; roughly a meteor is something caught with the naked eye monthly, and as i was staring at it, it stopped in mid-air. it then \"descended\" from it's stopping point and became, in my vision, as large as half of the size of our moon, and 3\\4 as luminous as venus is in the night sky. it \"grew\" in size from a pinpoint of light (meteor) to as big as half of our moon, and then proceeded to travel east. it hovered\\jerked around for around five seconds (zigzagging in a small area) before it hovered away to the west towards lincoln, ne. it spent 3 seconds flying westward before it disappeared - it did not fly past the horizon, it simply disappeared in the air. i rode my bike to a hill below harrison street after the incident; it took me five minutes to get there. after i got to the hill, i called my brother and told him about it. he was shocked by what i had seen. i disconnected; on my bike roughly ten minutes later, he claimed to have stepped outside to smoke a cigarette, and saw three orbs flying above lavista in formation, led by a blinking strobe orb, and followed by two brightly lit ones. the strobe-orb flew away from the other two orbs, and then the remaining two orbs flew off in the opposite direction. i can only verify what i have seen with my own eyes (the original orb seen at 12312 port grace blvd,) the encounter lasted roughly 2-3 seconds for the falling meteorite, 5 seconds for the meteorite to expand and \"grow\" into a large size, and then 3 seconds heading westward before disappearing. i have seen this with my own eyes and testify it is true."],"Weather Factors":"Unknown","Tags":"City","Date of the Event":"09/30/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/32232.html.txt","/var/www/straped/mufon/org/32232.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.181529,+-96.099729(32232)&iwloc=A&hl=en\"> mufon case (32232) map </A>","Latitude":"41.181529","Date Submitted":"09/30/2011 09:18 UTC","trends":["There have been 2 other sightings in La Vista","There were no other sightings in La Vista on or around September 30th 2011"],"City":"La Vista","Country":"United States","Sighting Duration":"00:15:00","Log Number":"US-09302011-0034","Longitude":"-96.099729","Object Features":"Unknown","Case Number":"32232","Region":"Nebraska","Object Shape":"Disc, Sphere, Star-like","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"Unknown","Disposition":"Unresolved","Summary":"A ball of light descended from the sky, and shot off towards Lincoln, NE (Offutt Air Force Base)"}