{"Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Latitude":"42.978098","Region":"New York","Disposition":"Unknown","Source":"MUFON","Date Submitted":"10/01/2011 04:52 UTC","trends":["There has been one other sighting in Nedrow","There were no other sightings in Nedrow on or around August 21st 2011"],"Summary":"Syracuse, NY and it's surrounding cities has been booming with UFO's as of late. Crafts I've observed were: Spheres, Triangles, saucer shaped, and star-like.","Object Shape":"Oval","City":"Nedrow","files":["/var/www/straped/mufon/html2text/32244.html.txt","/var/www/straped/mufon/org/32244.html"],"Country":"United States","Sighting Duration":"00:02:00","Object Features":"Unknown","Longitude":"-76.146048","divs":["Sighting DetailsI was at my girl friend's house waiting for her to get ready so we can leave, so i thought i'd wait outside and star gaze. I noticed a very peculiar looking star, very low to the ground, blinking, flashing, and pulsating different colors. So i start flashing my flashlight on my key chain at it, S.O.S. Thinking I'm being foolish, even when it starts to drift away, I'm still thinking it's a star. Then right before it becomes out of view it starts to wobble and pulsate red, blue, and white. I knew this couldn't be a star, even called my girl friend over to make sure my eyes weren't playing tricks on me. And she confirmed it was moving. Seeing as she is deathly afraid of Aliens, she goes back inside. Shortly after the \"star\" is no longer visible, a big flash of light out of nowhere comes from the trees around the area where I first noticed the \"star\". This light is still at first for a couple seconds and I'm thinking it's someone's porch light, (in the middle of the woods). The light starts moving, and its moving slightly off from my direction, goes through the trees slowly and towards the backyard, so i run off the porch and run to the back fence as far as i can go, and now i can make out the shape of this object, it was your average bumper sticker UFO, and it had 2 or 3 large lights in the center of it, slowly rotating. I was going to jump the fence and continue to chase it, until i remembered the neighbors own a dog. So i didn't want to risk it. Not to mention I was very afraid and excited at the same time but i kept telling myself to be brave. There was a time where I thought to myself, \"this may not be such a good idea...\" (chasing it down). And from there, it flew til I no longer had sight of the object. It was traveling Eastbound at a constant slow, eerie pace. And that was my very first UFO sighting in my life. For those who are interested, Syracuse and it's neighboring cities have strange objects in the skies almost every night. Since my first sighting I've observed UFO's and orange spheres in Fayetteville, Nedrow, and the Indian Reservation by Nedrow. As soon as it gets dark, the party starts. It may take patience. Worse part is, no one cares. Even those who genuinely believe me, don't seem to care too much. Those who doubt me aren't lifting a finger to debunk me. Don't take my word for it, go see for yourself. They are out there almost EVERY night. Question is why are they here? (Assuming the objects are of E.T. origin). Could be government crafts flying around, or BOTH... Am i sounding crazy yet? Like i said, don't take my word for it, go and find one, or one will find you. They're out there almost every night."],"Weather Factors":"Windy, Light","Log Number":"US-10012011-0005","map":"<A HREF = \"http://maps.google.com/maps?q=42.978098,+-76.146048(32244)&iwloc=A&hl=en\"> mufon case (32244) map </A>","Case Number":"32244","Date of the Event":"08/21/2011 11:30 UTC","Object Flight Path":"Straight-line path"}