{"files":["/var/www/straped/mufon/html2text/3224.html.txt","/var/www/straped/mufon/org/3224.html"],"Latitude":"33.852962","Disposition":"Unknown","Tags":"City","Case Number":"3224","divs":["Sighting Details1. I was outside the City Water Treatment Facility, looking up into the earlymorning sky, facing south. Observing the position brightness of the Moon, andthe planet Venus.2. I looked up again, as I was going back into the building, and saw it. Atfirst I noticed how bright the object was, how fast it was moving, how itappeared rather abruptly, without any sound at all.3. At firstI thought that the object was a meteorite shooting star, and that itwould burn up as it fell.4. My reactions were that it was not a meteorite, a commercial airliner too fastor a satellite too low alt. I was amazed that it was silent.5. The object was the brightest one in the sky - as it traveled at a high rateof speed - in a direct straight line, and not changing course. I thought thatperhaps the front of the object was reflecting the rising Sun, but it was still40 min. from sunrise, and the object was too low in the sky. It was very bright.As it moved away from me , heading East, I noticed that the sides and back ofthe object were Dark - with the luminous front gradually disappearing from myvantage point - and I think a small red, or redorange type of light was on itsleft side.6. It moved along its course, and was no longer visible because of the terrainhills.Additionally, I logged onto the J-Track program on the web, and no East boundaircraft were being tracked at that time, around my position.If this was one of our U.S. military aircraft, it is definitely classified."],"Weather Factors":"Unknown","Date of the Event":"09/01/2004 05:45 UTC","City":"Anaheim","Summary":"Saw Bright Object.","Date Submitted":"09/01/2004 05:45 UTC","Object Shape":"Undisclosed","Sighting Duration":"00:00:59","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around September 1st 2004"],"Longitude":"-117.747666","Source":"MUFON","Log Number":"","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.852962,+-117.747666(3224)&iwloc=A&hl=en\"> mufon case (3224) map </A>","Object Features":"Other","Object Flight Path":"Straight-line path"}