{"divs":["Sighting DetailsI want to remain COMPLETELY anonymous on this account so (1) You will know that I am 100% NOT doing this for fame or attention and (2) so my friends, business clients (some who are religious), work colleagues, etc... will not think I'm insane. I hope you don't mind that I provided no contact information - I don't have any other info you can get from me other than what's in this report. I did not take video so it's not like anyone will believe me anyways but I hope you will review this and maybe SOMEONE out there also saw it or will believe me. I was also NOT dreaming nor asleep. I swear this is what I saw that evening. I was driving on local road. Environment = dark, around 6-7pm. The area is prone to police helicopters so as soon as I saw a large dark object hovering and moving ahead slowly above my car, I immediately thought \"helicopter\" and kept my eyes on the road and my mind distracted by the non-related events in my life earlier that day. Up ahead, I stopped at a red light. No longer focused on the road, I randomly glanced up again. The thing is now lower - about 20ft above my car. And THAT'S when it hit me: Helicopters make noise right? LOTS of engine noise. This thing above my car was COMPLETELY SILENT. Not only that, despite it being the size of a helicopter, there were no rotary blades. And I swear i am NOT LYING when I say this, but at the bottom of its body was some sort of blue screen. I realized it covered half the vehicle's body. I have no idea what it was. To get an idea of what I saw, picture a hovering helicopter the size of the Presidential helicopters you see on TV where Obama walks off and waves. Now imagine a helicopter that big with a huge plasma tv screen that covers half the bottom of the helicopter that's playing a rock concert where the entire show is in blue. Basically half the bottom of the craft or whatever it was, was flickering blue. Not anything I ever seen. It looked like some of those computer screens you only see in Star Wars movies. It did not look like a light bulb but rather some sort of weird show of \"pictures\" or symbols that merged into one another that I cannot comprehend. While I was stopped at that red light, it ascended again and flew off. Again, completely silent. No exhaust flames, no rotating blades, nothing. I knew I should have taken a picture but at that moment my heart felt like it was beating 50mph, my mouth opened in shock, and I was just completely in awe of the object...even a bit of an admiration I would say. Before I could even think about reaching for my Blackberry to take a shot, it flew off quickly. Anyways, that's what I saw that evening. I never told anyone for fear of being called crazy. Other drivers on that road probably thought it was a helicopter and didn't even give it a second look. I hoping that's not the case and more people come out. I searched everywhere on the net. I believe I'm the first one to come out about this incident."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32240.html.txt","/var/www/straped/mufon/org/32240.html"],"City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.782381,+-119.414872(32240)&iwloc=A&hl=en\"> mufon case (32240) map </A>","Object Flight Path":"Straight-line path","Log Number":"US-10012011-0003","Region":"California","Date Submitted":"10/01/2011 02:27 UTC","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Object Shape":"Other","Tags":"City","Country":"United States","Case Number":"32240","Longitude":"-119.414872","Object Features":"Unknown","Date of the Event":"08/01/2011 06:00 UTC","Source":"MUFON","trends":[],"Latitude":"36.782381","Summary":"Saw UFO hovering over my car with","Disposition":"Insufficient Data"}