{"Region":"Colorado","divs":["Sighting DetailsThursday night I came home from church choir and went immediately to close the chickens door. I looked up coming back to the house because the stars were so clear. As I was walking to the house, I sensed a shadow and looked up. Above me was a dark triangle shaped something that went slowly but directly to the southwest. My first thought was that it was the shape of geese flying but there was no noise or movement other than it's course. The shape was determined by it blocking out the stars. My next thought was that it must be a steath ship but it seemed low. I could not tell exactly how high above me it was but I sensed not too high. Size? Maybe 10 feet across but I couldn't determing how high it was because it was so dark outside. The event lasted only minutes as the object went over the house and southwest. No sound or lights. At first, I felt a sense of fear but I let it go and curiosity took over. I can't explain why but I do not fear aliens from another planet or dimension. I did contact the Wildlife Dept. in Ft. Collins to ask if geese fly at night and then called the local Mufon office in Greeley. Cheryl Gantz called me back and was most helpful and professional."],"Case Number":"32249","files":["/var/www/straped/mufon/html2text/32249.html.txt","/var/www/straped/mufon/org/32249.html"],"Disposition":"Unknown","Object Features":"Wings","Object Shape":"Triangle","trends":["There have been 19 other sightings in Greeley","There were no other sightings in Greeley on or around September 29th 2011"],"Latitude":"40.386214","City":"Greeley","Date Submitted":"10/01/2011 10:37 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.386214,+-104.807606(32249)&iwloc=A&hl=en\"> mufon case (32249) map </A>","Date of the Event":"09/29/2011 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-104.807606","Source":"MUFON","Log Number":"US-10012011-0011","Viewing Distance":"21-100 Feet","Object Flight Path":"Straight-line path","Summary":"I saw a dark triangle slow moving object at night over my farm.","Tags":"City"}