{"trends":["There have been 9 other sightings in Pembroke Pines","There were no other sightings in Pembroke Pines on or around September 30th 2011"],"Disposition":"Unknown","Viewing Distance":"Unknown","Latitude":"26.010797","Region":"Florida","Date Submitted":"10/01/2011 07:26 UTC","Object Flight Path":"Straight-line path","Tags":"City","divs":["Sighting DetailsI was getting ready to go to bed, but I decided to walk my dog in the backyard at 10:50 pm. When I go out, I was looking up at the stars, as I usually do every night when I walk my dog. When on my right peripheral vision, I notice something moving in the sky. I focused on this thing and at first i thought is was a formation of birds, but then I realized that whatever I was looking at, was in SPACE! I was looking at a triangular formation of dim lights in space as it traveled from north to south right over my backyard. The shape was like the outline of an ice cream cone. I stood there with my mouth wide open, trying not to lose sight of it. In the mean time, I was trying to count the lights. One was in the front and I counted at least five on one side. I really couldn't concentrate on counting the lights because my mind was racing and my heart rate was increasing! On top of that, I was being distracted by the falling meteors that would flash and disappear. The lights I was observing were way above the meteors that were falling. That's way I know these lights were in space. Though, I couldn't tell if it was one solid object or multiple individual objects. After, I lost sight of the lights, I brought the dog in and I ran up to my son's room and told him what I just saw. We both came down and went out back and pulled a couple of chairs and sat there for 45 minutes hoping we would see something else. All we saw were a couple more meteors falling and one airplane in the 45 minutes we were out there."],"Case Number":"32246","Log Number":"US-10012011-0006","Longitude":"-80.348428","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=26.010797,+-80.348428(32246)&iwloc=A&hl=en\"> mufon case (32246) map </A>","Country":"United States","Summary":"Triangular formation of multiple lights in the sky.","City":"Pembroke Pines","Object Features":"Unknown","Weather Factors":"Unknown","Object Shape":"Triangle","Date of the Event":"09/30/2011 10:55 UTC","files":["/var/www/straped/mufon/html2text/32246.html.txt","/var/www/straped/mufon/org/32246.html"],"Sighting Duration":"00:01:00"}