{"Tags":"City","Source":"MUFON","Summary":"Boomerang shape","Log Number":"US-10012011-0017","Region":"Florida","Latitude":"27.782256","Object Shape":"Boomerang","Longitude":"-82.63266","Disposition":"Insufficient Data","Weather Factors":"None","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=27.782256,+-82.63266(32256)&iwloc=A&hl=en\"> mufon case (32256) map </A>","City":"St Petersburg","Viewing Distance":"Unknown","Date Submitted":"10/01/2011 04:41 UTC","Date of the Event":"09/30/2011 12:00 UTC","Country":"United States","Case Number":"32256","files":["/var/www/straped/mufon/html2text/32256.html.txt","/var/www/straped/mufon/more/32256_submitter_file1__Sketch.jpg","/var/www/straped/mufon/org/32256.html"],"Object Features":"Patterned Surface","divs":["sighting detailsseptember 29, 2011 i was with my girl friend outside the house, walking the dog. around 12:15 am i looked at the clear sky and i saw an object flying; it had a boomerang shape, it was dark color and silent. i saw it for about 10 seconds and try to show her what i was seeing but she couldn't see it, then it disappeared, but about 10 seconds later, we both saw like a very bright shooting star and then few second later a second bright shooting star. i was very surprised of what i saw, i didn't want to get inside the house and i kept looking at the sky while i was telling her my experience. i told her to stay outside so we might see it again. she took the dog inside the house and came back to join me; we were there looking for 30 minutes, so we decided to laid down on the bed of my truck. we kept looking and looking.. around 1:35 am i saw it again and i could not believe it, i told her \"there is!\" and i pointed at it and we both start following the object. it was like a boomerang shape but a little more rounded, it was dark color but a bit lighter than the sky, like it camouflages with the sky. the object had no sound at all, it was flying at the speed of an airplane or a bit slower, like it was scanning the area or checking around. it had no lights but seems to have like a line pattern that was lighter than the body. it was flying from north to south and we saw it for about 30 seconds until it was very hard to spot it because of the lights of the street. my friend said, that before it disappeared, the object did a round\\circle move. about 10 seconds later we saw like another very bright shooting star. we were in shock and stayed there for another 30 minutes, but we never see it again. we went inside the house and try to draw the object, we ended up with similar drawings and similar details, the only difference according to her, the object had a soft glow at the backside. i think this is one of the most amazing experience we ever had. i try to called you yesterday morning, but the only way to contact you is thru here. thanks, hector"],"trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around September 30th 2011","This sighting has never been favorited.",""],"Sighting Duration":"00:00:40"}