{"divs":["Sighting DetailsIt was late in the afternoon on the day of the first landing of the spaceshuttle Columbia. I was a stringer for NBC news and shot the landing from thedry lake bed.I left Edwards Air Force Base and headed back to the San Joaquin Valley onHighway 99.Late in the afternoon, I saw something that looked to be a dark spot on the sun.I pulled over and got out my binoculars. The sun was too bright, so I waitedtill the sun started to set. Soon, the dust from the earth allowed my binocularsto see what cannot be anything but UFO92s.First there was the large round ship that I could see with my naked eye and gaveme the reason to pull over, thinking it was a sunspot. When I looked below thelarge ship, I saw six smaller ships lined up three in a row, like on a dice, allat 45 degree angles. Next to these93dots94 was a long dark bar like a pencil that was twice the length of the large sunspot ship. All these items were stationary is space between earth and the sun. Idid an experiment to see if I was just seeing things. I positioned myself infront of distant telephone poles and placed the UFO92s directly behind them. I watched as the group slowly dropped at the samerate as the sun. They started above the telephone wires and as the sun set theyended up below the telephone wires till they all sunk into the horizon.These things had to be huge since they were not even close to being on earth anddropped into the horizon at the same rate of the sun.I am amazed to this day, that no one has reported this and if they have, I wouldsure like to know about it.Thank you,Steven Whetstone"],"Longitude":"-113.763283","Country":"United States","Date Submitted":"04/14/1981 05:30 UTC","Object Shape":"Sphere","Log Number":"","Sighting Duration":"01:59:00","Viewing Distance":"Over One Mile","Case Number":"3225","Tags":"City","Date of the Event":"04/14/1981 05:30 UTC","City":"Mohave","trends":["There have been no other sightings in Mohave","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.214335,+-113.763283(3225)&iwloc=A&hl=en\"> mufon case (3225) map </A>","Source":"MUFON","Latitude":"35.214335","files":["/var/www/straped/mufon/html2text/3225.html.txt","/var/www/straped/mufon/org/3225.html"],"Weather Factors":"Unknown","Disposition":"IFO","Object Flight Path":"Stationary","Object Features":"Undisclosed","Summary":"It was on the day of the first landing of the spac","Region":"California"}