{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.227084,+-94.424353(32252)&iwloc=A&hl=en\"> mufon case (32252) map </A>","Object Flight Path":"Straight-line path","Disposition":"Unknown","Date of the Event":"07/01/2011 10:02 UTC","Summary":"Flat oval, Bright orange. 3 to 5 bright small white lights down center line appeared late in sighting.","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Region":"Missouri","Case Number":"32252","divs":["Sighting DetailsMy wife and I had just returned home from a 4th of July celebration at our daughter and son in law's house. I went out on our back deck to smoke a cigarette at exactly 10:00 p.m. I was facing east. I noticed a bright orange light through the trees and at first thought it was the moon. I then noticed that it was moving. I then thought that it could be the landing lights of an airliner. we are located on a flight path for the Kansas City International airport and we often see the aircraft approaching the airport. After seeing this object for a short period of time I realized that their were no beams of light that are often seen on the aircarft and also I could tell that the whole object was a very bright orange. It was moving from south to north and it was rock steady in it's movement. I kept waiting to hear a sound from engines but it was absolutely quiet. After a few seconds it cleared the tree and came into full view. I kept trying to make it into an airplane of some sort but i knew without a doubt that it wasn't anything like I had ever seen. After a few seconds I noticed that there were a row of bright white ligts (small) starting to appear on a lateral line running from the front of the object (stating maybe a quarter of the way back from the front and extended about halfway back along the object). These white lights were small, bright and sharp. At first I thought thay maybe they were the lights on the end of an aircrafts wing as I was still trying to turn this object into an aircraft. The white lights started to appear one after another in rapid sequence starting from the front. The object kept moving at a relatively slow speed and completely quiet. It dissapeared behind trees as it moved north. It sent chills down my back and the hair on the back of my head stand up. I have never had anything do that to me. I couldn't explain what it was and it just wasn't normal in shape, color or anything else. I have set the time at 10:00 p.m. exactly but again it could have been 11:00 p.m.. Whatever this thing was it was VERY strange. I have always had a hard time beleiving in UFO's or flying saucers but I have NO explanation for this sighting. Being at night I can not give any real estimate as of distance from my location or it's size. All I can say is that it appeared to be large and not that high in elevation from the ground. I would guess a few thousand feet but that is only a guess. I keep going out on the deck at nigt with my cell phone camera hoping to catch this or something like it but I have never seen it since. I will send photo's if I ever catch it again."],"Date Submitted":"10/01/2011 02:04 UTC","Object Shape":"Oval","City":"Liberty","Latitude":"39.227084","files":["/var/www/straped/mufon/html2text/32252.html.txt","/var/www/straped/mufon/org/32252.html"],"Country":"United States","Log Number":"US-10012011-0014","Object Features":"Other","Longitude":"-94.424353","trends":["There have been 12 other sightings in Liberty","There was one other sighting in Liberty on or around July 1st 2011"],"Sighting Duration":"00:05:00"}