{"Country":"Mexico","Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","Log Number":"MX-10012011-0018","Case Number":"32257","City":"JuchitÃƒÂ¡n de Zaragoza","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI was lying in my backyard was even playing with my phone and it was as if I had indicated in which direction to look.The first thing I saw was a light red color but because of the distance of the object, which at first seemed like like me and thought it was a plane or satellite since I've seen often.But when I realized how fast it moved dude. The address of the object was coming from northwest to east, but suddenly a sharp twist by changing its direction towards the southeast.It was the sudden change in the direction that made me understand that it was not a plane or satellite.That was also when I get to see northern light proceeded from a more intense but more rare This light was a blue flash but changed to white.This object was shining moments and then went dark but when he was no longer shine in the same place, it was like in just a matter of seconds progressed a great distance.Which was verifiable at the time because after 3 appearances progress to reach the first red object above.It seemed as if the red object was to escape the second blue object which appeared to be larger because the light emitted was bigger than the other object.I was on the slope of the whole process until it achieves currencies. It is not the only sighting I've had in my city. Throughout the month of September I had five sightings and all differently.But it seems as if no one else would notice if I am not the only one who has this kind of event in my city I have mentioned to people I care about, and no one gives me a solid answer.The fifth sighting was very surprising when I can not say but if I can describe the phenomenon.The object was orange hue and came from the direction that I was outside on the patio with a cigarette and looking up to heaven to see him succeed, but at that moment I felt like I was not afraid locked but felt as if trying to communicate me It was at that moment when the object back and began to whirl about me and then proceed with your order rumbo.el looked very close as about 800 or 1000 meters.After that experience I have noticed that there has been a shift in my consciousness. And I want to know if it's normal. Not by attaching photos or videos because I do not have video cameras alone with my cell phone but it fails to capture the images. I excited about this phenomenon but also I have fear.I had never in my life seen or experienced so far EXPERIENCE so I remained incredulous.That's something that I can share. Their own criteria to judge nobody forces them to believe."],"Longitude":"-95.032584","Date Submitted":"10/01/2011 05:27 UTC","Sighting Duration":"00:03:10","Region":"Oaxaca","files":["/var/www/straped/mufon/html2text/32257.html.txt","/var/www/straped/mufon/org/32257.html"],"trends":["There has been one other sighting in Juchitán de Zaragoza","There was one other sighting in Juchitán de Zaragoza on or around September 9th 2011"],"Summary":"2 objects followed by another one","Disposition":"Unresolved","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=16.443558,+-95.032584(32257)&iwloc=A&hl=en\"> mufon case (32257) map </A>","Source":"MUFON","Date of the Event":"09/09/2011 08:13 UTC","Latitude":"16.443558","Object Shape":"Flash, Sphere"}