{"Sighting Duration":"00:12:00","Disposition":"Unresolved","Date Submitted":"10/02/2011 12:48 UTC","Summary":"green light followed van for 10 minutes, about 20 feet behind us","trends":["There has been one other sighting in Prince Rupert","There were no other sightings in Prince Rupert on or around December 10th 2005"],"Date of the Event":"12/10/2005 12:00 UTC","Latitude":"48.610213","Weather Factors":"Unknown","Country":"Canada","Object Flight Path":"Path with directional change","Object Features":"Unknown","divs":["Sighting DetailsI was in grade 8 and we were driving back from prince rupert bc to smithers bc after our volleyball zones. There were 8 of us (including me) in the vehicle. We were driving along a straight stretch and at the end of the straight stretch we noticed a green light about 1 km behind us and thought \"that's funny, none of us saw that when we drove by there.\" But not thinking anything of it we drove on, when we came to the next straight stretch the object was suddenly about 20 feet behind us and 20 feet in the air (very rough estimates). The object was about 15-20 feet across and im guessing 10 feet top to bottom. We could not actually see the object, the light it was emitting was so bright all we could see was white light and green radiating all around us. This object followed us for about 10 minutes or so and then suddenly disappeared, all of us were shocked and not too sure what we had seen. I still keep in touch with everyone that was in the vehicle, we were also next to a water source (the ocean)."],"Region":"British Columbia","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=48.610213,+-93.36973(32269)&iwloc=A&hl=en\"> mufon case (32269) map </A>","Log Number":"CA-10022011-0001","files":["/var/www/straped/mufon/html2text/32269.html.txt","/var/www/straped/mufon/org/32269.html"],"City":"Prince Rupert","Longitude":"-93.36973","Case Number":"32269","Object Shape":"Disc, Sphere, Unknown","Source":"MUFON","Tags":"City"}