{"divs":["sighting detailsit was about 8:30 pm and i went to take my dog outside.. something caught my eye over the trees in the nw corner of my house moving s. at first, i thought it was a really large hawk gliding over, but when i focused in on it, it was a transparent, boomerang shaped object. but it had straight edges on the object, not curved, like a boomerang. anyhow, i saw it move across the sky, completely silent, maintained it's altitude and course. it was translucent, like it was made of water. it looked like the surface of a pond. there were no lights. i watched it move across the sky for about 10-15 seconds until it sort of blended in with the color of the sky. the other stars in the sky appeared smeary when the object passed over them, then they would re-appear perfectly clear, that's how i could tell the shape. i couldnt judge how large it was, because i couldnt get a feel of it's altitude, but i got the impression it was about 1\\4 mile west of my position. no matter what altitude this was, it appeared bigger than any airplane i've seen. ive never seen anything like it before. i am prior air force, i used to be an air traffic controller, i've been around airplanes since i was a baby. this was nothing i have ever seen before. i expected noise, there was none. it moved across the sky very slowly. it was unbelievable. i don't know what i saw, but it looked the some computer graphics of a cloaking device in a movie. but it wasn't a movie. crazy."],"Object Shape":"Boomerang","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=27.102788,+-82.453073(32268)&iwloc=A&hl=en\"> mufon case (32268) map </A>","City":"Venice","Date Submitted":"10/01/2011 11:01 UTC","files":["/var/www/straped/mufon/html2text/32268.html.txt","/var/www/straped/mufon/org/32268.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"27.102788","Region":"Florida","Date of the Event":"10/01/2011 08:30 UTC","Object Flight Path":"Straight-line path","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile, Unknown","Longitude":"-82.453073","trends":["There have been 20 other sightings in Venice","There were no other sightings in Venice on or around October 1st 2011"],"Source":"MUFON","Tags":"City","Country":"United States","Case Number":"32268","Log Number":"US-10012011-0029","Summary":"Object flew in perfectly straight path from north to south until it appeared to blend in with the sky"}