{"Sighting Duration":"07:00:00","Country":"United States","Object Shape":"Unknown","Tags":"City","Object Features":"Undisclosed","Log Number":"US-10012011-0023","Case Number":"32262","Date of the Event":"10/01/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/32262.html.txt","/var/www/straped/mufon/org/32262.html"],"Object Flight Path":"Undisclosed","Latitude":"36.784971","Disposition":"Unresolved","Longitude":"-119.414062","trends":[],"Viewing Distance":"Unknown","divs":["Sighting Details**PLEASE DON'T USE MY REAL NAME** I will tell you my story. Well, here it goes, I am a 41yo who had a heart transplant in 2001 and a stroke which left my right side partially limited. I was living in San Jose and had a fantastic position with an international hi-tech firm doing project management in Palo Alto. It was a great future in store for me, and I was very excited to be a part of it. I am living north now in McKinleyville, CA. From what I can remember in the past: 5 years old: I was climbing on the outer railing when I fell off the second floor and right before I landed on my back on the tiles, I felt my body being set down very slowly. Being five I thought that was really neat and ran into the kitchen to tell my Grandmother who got angry and scolded me telling my \"You're full of \"cazzata\" which translates to \"Bull S****\" and scolded me to my room. I never forgot that moment even for a second. At the age of 24: I was away at collage and living in an old c.1894 house with four other students. For about two months at least 2 mornings per week I had a series of waking up and being completely unable to move anything except for my eyes for approx 30 minutes. Another thing was the \"weight\" that heavily pressed my body into the mattress, it felt like someone was on top of me. That was a disturbing times but it ceased at two months. Not ever was I into 'ghosts' but that made me serious about wondering if they really exist. I searched the old house at Humboldt State University's library and found that the 1894 house was built right over the ashes of a previous building. The wondering about a ghost faded as I was in an intensive program that needed my focus. 2 years ago: I woke up in my bed and looked at my watch seeing that three days had passed with no recollection of anything. I was extremely upset about it and went to my Doctor who took a blood test and everything was normal. I did not tell him about why I was so frazzled. In addition I had multiple dreams where I was unable to move except for turning my head. It was a very strange room with two other tables with people laying on them and again there was a being 8-9 feet tall wearing an outfit with a hood and shielding for the face working on the body to my right. I can recall turning my head to the left where small rectangle windows looking down at Clam Beach from I guess around 7000 feet, just a guess. During the two years I had multiple dreams like that. The last week: The last night for the third time in the past week I dreamt of being in an underground 'lab?' or some kind of very large underground facility 'people' of two types. One type was 8-9 feet tall and the other was 'human-like' who can communicate using their minds. (I feel like I'm going crazy.) They were very calm and 'loving.' There are dozens of windows in the rock where the 'humans' would live, they would open into the rock. I would wake up and fall right back into the same dream. I have noticed new skin-marks and two new tiny scars. I live alone, my family is in So. California. That's my story and you may do what you like with it, but again, PLEASE DO NOT USE MY NAME."],"City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.784971,+-119.414062(32262)&iwloc=A&hl=en\"> mufon case (32262) map </A>","Source":"MUFON","Summary":"Abduction","Date Submitted":"10/01/2011 08:42 UTC","Region":"California","Weather Factors":"Unknown"}