{"Country":"United States","Viewing Distance":"Over One Mile","Case Number":"32265","Date of the Event":"09/30/2011 11:17 UTC","Object Shape":"Chevron, Triangle","Region":"Colorado","Date Submitted":"10/01/2011 10:17 UTC","Latitude":"40.164488","trends":["There have been 30 other sightings in Longmont","There were no other sightings in Longmont on or around September 30th 2011"],"Weather Factors":"Unknown","City":"Longmont","map":"<A HREF = \"http://maps.google.com/maps?q=40.164488,+-105.143223(32265)&iwloc=A&hl=en\"> mufon case (32265) map </A>","divs":["Sighting DetailsHello everyone; This is what I had seen on Friday night September 30th 2011... This U.F.O. sighting happenned on Friday night at around 11:17 P.M... I was visiting my friend that night at his house, I decided to go outside to get some fresh air, when I just happenned to notice a very strange light in the night sky within a couple of miles from where I was at in Longmont, Colorado. Longmont Colorado has a population of around 75-thousand residents. This sighting happenned on the very end of this city, on the far south end of town. My friend wasn't outside at the same time that I was for him to witness this U.F.O. sighting. Anyway that night on Friday September 30th 2011, I just happenned to notice a very bright white lights that were in the shape of a V-shape triangle slowley heading south east of Longmont, Colorado at a steady crusing speed. this object wasn't going real fast like most U.F.O.'s that are reported to travel. It was going a steady speed of what a normal twin engine airplane woul'd travel it seemed. This V-shaped object that I seen that night was a real solid object that wasn't an airplane, or a sattelite, or any known type of a natural man-made objects that we have here on our planet! The bright lights on this U.F.O. object were very bright white lights, the lights were lighted up in a V-shape pattern. The lights seemed to be pulsating in a strange pattern. I only had a short time to view this object before it dissapeared behind the trees at my friend's place before I lost full view of it. When I spotted this U.F.O. object I was tottally stunned at what I was seeing with my own two eyes. I rushed in my friends house where he was at to explain to him what I had just seen, and wittnessed! My friend was on the phone talking to his girlfriend, and by the time I finnally got him to see what I had just wittnessed this object was moving over the trees in his back yard to where he couldn't get a full view of this U.F.O. before it dissappeared out of full view behind the trees in his back yard. I didn't have my cell phone on me at the time of this sighting, otherwise I woul'd have taken a picture recording of it. There has been alot of these type of U.F.O. reports all over the areas of not only the Longmonr area, but also in Laffaette, Colorado back in March of this year 2011, there was a major U.F.O. sighting that hundreds of residents of this town located within fifteen miles of the city of Longmont, Colorado where I live at and have seen this U.F.O. that I have mentioned above. The Laffaette, Colorado U.F.O. sighting was on the major news on channel 9-news, and other news stations through out Colorado. Hundreds of people wittnessed back in March, 2011, a V-shapped traingle shapped object hovering still over Laffeatte, Colorado the night of their major sighting here in Colorado. This U.F.O. sighting is filmed on U-tube, and this U.F.O. hovered still above the town of Laffeatte, Colorado for at least close to a half an hour. There has been many other U.F.O. reports that other people have video taped with their cam-corders this year in 2011 here in Colorado. \"THESE ARE \"REAL\" U.F.O. SIGHTING'S FOLKS!!! INCLUDING WHAT I WITNESSED TO ON SEPTEMBER 30TH 2011... It seems very strange that the closer that we are getting to the suppossed Mayan End times date of December 21st 2011, which is on a friday by the way, the more every day average people are wittnessing U.F.O. objects in the skys, either in the daytime, and night time both! There are on average hundreds of these sightings every month all around the world! We all need to take these U.F.O. sightings \"VERY SERIOUSLEY!!! I don't know why these objects are showing up every where lateley. Do these extra-terrestrials have a plan to invade our planet earth, or are they just simpley watching, and observing all of our cities around the world??? Why all of a sudden are these reported U.F.O. objects showing up almost in every major city all around the world recentley. I was born in the earley 60's and through out all of my life I have never wittnessed or seen anything like I had seen recentley in the sky! Anyway thank's for reading my true story of what I just wittnessed in the night sky, of what I believe is an honest to God's \"REAL U.F.O. SIGHTING\" that I had just seen and wittnessed!!! Go on the internet on \"yahoo\" and type in DENVER, COLORADO U.F.O. SIGHTINGS IN 2011\" and check out not only the reported major U.F.O. sighting that I had mentioned above in Laffeatte, Colorado and you will see the actuall cam-corder video taped earlier this year in 2011... But also on yahoo, type in the words U.F.O. sighting's in Denver Colorado on August 23rd 2011, and September 2011... There is a man who has many live camera videos that he has taken here in the Denver, Colorado area of major U.F.O.'s that he has on his video-camera taken in the daytime, with his high power spotting scope with a digital camera-video recorder attached to it, plus at night time too! In August, and September 2011, also all year long, from March of 2011 this man with the nickname on U-tube he goes by the name of \"MAGNET FLIPPER\" look this name up also on U-tube and see all of his \"FANTASTIC-U.F.O.videos there! With his spotting scope he has many fantastic video camera shots of these U.F.O.'s... As I close my full true story of my personal U.F.O. sighting on September 30th 2011, I wan't to mention to all of the non-believers out there that if you don't think that U.F.O.'s exist, or another higher intelligence higher than ours here on earth exists, sooner or later you can very possibbley have an encounter with a strange object in the skys too if you woul'd just look up in the sky when you are out in your back yard, or anywhere either in the day time, or night time, I can almost guarentee it that sooner, or later you will spot something up in the sky that doesn't look like an airplane, or something normal on our earth that we have man-made today! Don't forget to alway's have your cell phone camera ready or cam-corder by your side just in case you do happen to be in the right place at the right time to wittness an exciting event such as my U.F.O. sighting and hundreds of others of average every day people that see these objects in the skys! Don't forget to look up these U.F.O. sightings on \"yahoo\" that I listed above, then you be the judge of if you believe that U.F.O.'s are real and if they trueley do exist!!! Ken, of Longmont, Colorado."],"Log Number":"US-10012011-0026","Summary":"I just happenned to be outside over visiting a friend when i spotted this Triangle shapped U.F.O. on Friday evening September 30th 2011...","Sighting Duration":"11:17:00","Object Features":"Wings","Object Flight Path":"Straight-line path","Longitude":"-105.143223","Source":"MUFON","Tags":"City","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/32265.html.txt","/var/www/straped/mufon/org/32265.html"]}