{"Region":"Florida","files":["/var/www/straped/mufon/html2text/3227.html.txt","/var/www/straped/mufon/org/3227.html"],"divs":["Sighting DetailsI am not sure of the date or the exact time. This occurred while I was working in Chiefland, Fla. as a reporter. It was my habit to walk late at night in the school yard for exercise. Often I walked until well after midnight. I saw this same formation of interstellar objects twice a year apart, going in opposite directions each time, but across the same stretch of space. On both occasions, it was bitterly cold and the night sky was perfectly clear. No clouds or moisture in the air. I could see far into space. I was also in the habit of watching the stars, just for enjoyment. On both cccasions, I saw a formation of white dots, almost identical to the size and shape of stars, moving rapidly through the star field. This group of objects was not in our atmosphere. It, or they, moved from one side of the horizon to the other side in less than two seconds. The formation of starships, as I call them, seemed to \"float\" or \"skip\" from side to side ever so slightly. It was the same formation a year later. The first time the formation was headed from the south-southeast to the north-northwest. It was headed south-southeast from the north-northwest the following year. There is absolutely no doubt what I saw. I have never seen a \"flying saucer\" in the earth's atmosphere. I had begun to think they were someone's imagination. Not until I saw these interstellar vehicles did I realize the possibility of UFO's might actually be real. I told my story to a number of friends. They listened as though I was talking in a foreign language. They politely said...okay and changed subjects. I covered Stanton Friedman while a college newspaperreporter, probably in 1971 or 1972. Mr. Friedman spoke at the University of Wisconsin Stevens Point. He probably won't remember me. In any case, I haven't said anything about the two sightings publicly and very little privately for fear of being called a nut. Given the reception I received when I mentioned it to friends, I felt it was best to keep a secret. The sightings probably occurred in the late 1980's or early 1990's. I felt I was quite fortunate to see this. I now laugh when I hear people debunk UFO's. I now know, without any doubt, that a much more advanced civilization exists somewhere in the universe, a civililzation capable of the same type of interstellar travel we saw in the fictional Star Trek series."],"Weather Factors":"Does Not Apply","Date of the Event":"01/01/1988 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-82.859842","Object Shape":"Star-like","Source":"MUFON","Case Number":"3227","Summary":"Out walking-saw group of objections flying in cross formaton through the stars","trends":["There have been 2 other sightings in Chiefland","There were no other sightings in Chiefland on or around January 1st 1988"],"Latitude":"29.474962","map":"<A HREF = \"http://maps.google.com/maps?q=29.474962,+-82.859842(3227)&iwloc=A&hl=en\"> mufon case (3227) map </A>","City":"Chiefland","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","Log Number":"US-06202005-0002","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"01/01/1988 12:00 UTC","Viewing Distance":"Over 1 Mile, Unknown"}