{"Date of the Event":"09/16/2011 11:00 UTC","Disposition":"Unknown","Object Features":"Unknown","Object Shape":"Triangle","Longitude":"-121.946526","City":"Campbell","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","Case Number":"32272","files":["/var/www/straped/mufon/html2text/32272.html.txt","/var/www/straped/mufon/more/32272_submitter_file1__Sept162011.jpg","/var/www/straped/mufon/org/32272.html"],"Object Flight Path":"Straight-line path,Path with directional change","Country":"United States","Weather Factors":"Unknown","Log Number":"US-10022011-0004","divs":["Sighting DetailsI have been debating whether or not to report this sighting. It happened on Friday, September 16th, 2011. (This is from my view in Campbell, CA) I was sitting on my bed watching TV at 2300 hrs when I heard helicopters flying over. I tend to ignore them since I live directly under the Moffet Field air path, but decided to get up and look out the window since it was pretty loud. It sounded like two or three choppers flying over. When I looked out the blinds, I saw a three bright white lights evenly spaced apart flying overhead with a plane and two choppers chasing it. They all headed from San Jose towards the Santa Cruz mountains (N to SE). I thought that was pretty amazing, but it happened so fast (they were all moving very fast) that I couldn't get it on video or any pictures. Since they flew over fast, I just went back to the bed to continue watching TV. Then at 0000 (midnight), I heard the same sounds again, but coming back (SE to N). I ran to the bedroom window saw them coming back. I saw this same \"triangle\" moving fast back towards San Jose being obviously chased by a chopper. I ran through the house, grabbed my video camera and went out the living room patio door. I looked up just in time to see the object still with it's three white lights (still evenly spaced) flying directly towards another chopper. And in fact, the chopper had to make a hard left dodge to avoid a mid-air collision with the object. Then, the object and two choppers chased it towards San Jose (N). Once again, it happened so fast that I couldn't get my camera on quick enough to catch this event. The reason why I have debated on whether or not to report it is because I have been hearing about Moffet Field testing a recon spy plane in the area. However, I did the research on it and found that the test plane is a little bit bigger than a Cessena, and in no way even comes close to what I saw. It was definitely a triangle."],"trends":["There have been 7 other sightings in Campbell","There were no other sightings in Campbell on or around September 16th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=37.2603,+-121.946526(32272)&iwloc=A&hl=en\"> mufon case (32272) map </A>","Latitude":"37.2603","Sighting Duration":"00:00:10","Date Submitted":"10/02/2011 02:36 UTC","Summary":"Triangle chased from San Jose to Santa Cruz mountains, then back an hour later","Region":"California"}