{"Region":"California","City":"Cathedral City","Object Flight Path":"Straight-line path","trends":["There have been 3 other sightings in Cathedral City","There were no other sightings in Cathedral City on or around October 1st 2011"],"Weather Factors":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32270.html.txt","/var/www/straped/mufon/org/32270.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.823198,+-116.46513(32270)&iwloc=A&hl=en\"> mufon case (32270) map </A>","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-116.46513","divs":["Sighting DetailsMy wife and I were in the back yard stargazing. She noticed and pointed out a star-like dot of light moving across the night sky from southeast to northwest. I've seen satellites many times, and this looked very much like one -- a solid, unwavering, star-like light, moving steadily in a straight pattern across the night sky. My wife thought it moved a little too fast to be a satellite; that I'm not sure about. I saw it as a whitish light, like a star. She saw it reddish. What I am sure is it was NOT an airplane or helicopter, much too far up in the night sky to be that, and this light didn't blink. About 30 seconds or so into tracking it, we both saw to our astonishment it split into two dots of light, very close together and moving parallel to one another at the same speed. My wife, who thought the initial sighting was reddish, thought the second light was whitish. This second light continued for about five seconds, then one of the lights seemed to fade out (not cut out abruptly), then it was back to the initial light. Everything about it was like a satellite -- except I've never seen a satellite suddenly split into two dots of light."],"Object Features":"Unknown","Sighting Duration":"00:01:00","Tags":"City","Country":"United States","Date Submitted":"10/02/2011 12:56 UTC","Log Number":"US-10022011-0002","Case Number":"32270","Disposition":"IFO","Date of the Event":"10/01/2011 09:05 UTC","Summary":"Small star-like light moving like satellite. But then it split briefly into two lights moving parallel to each other before going back to just one.","Object Shape":"Star-like","Latitude":"33.823198"}