{"Country":"United States","City":"Campbellsville","Log Number":"US-10022011-0008","Object Shape":"Star-like","Region":"Kentucky","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Latitude":"37.263557","divs":["Sighting DetailsWe left from my mother n laws house drove up the driveway. it was about 8:25pm oct 1 2011. my father n law was on a 4 wheeler right behind us. and I shut off the vehicle. we got out and i looked toward the Northwest, saw a bright light moving at a high rate of speed. the light seem to be moving in a linear motion across the sky. it made no noise. i got excited told my wife and father n law look up there in the sky. they saw the same thing. wife said it was a plane, and i said no its not a plane. i see planes often and was no plane. we continue to watch as the light seem to dissipate, (faded out). then i turned and asked what was that? I looked again the light appeared again. the light seem to decend down, kinda like a slow fall. the light again faded out and it was gone. I think that my wife and father n law was stunned. they had no explaination, but after the event i notice a aircraft, or maybe a chopper. not for sure i know that what ever the aircraft was it had a propeller sound, flew in the same direction as the object. it may have been maybe about 5-7 mins after the object was observed. but the experience was like shock and awe. but this is what we saw. and I know for a fact it was no airplane or helicopter. I witness lots of commercial airtraffic in my yard daily and also nightly."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.263557,+-85.375473(32276)&iwloc=A&hl=en\"> mufon case (32276) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/32276.html.txt","/var/www/straped/mufon/org/32276.html"],"Disposition":"Unknown","Longitude":"-85.375473","Date Submitted":"10/02/2011 08:38 UTC","Object Flight Path":"Straight-line path","Object Features":"Unknown","Date of the Event":"10/01/2011 08:25 UTC","Summary":"the bright light seem to move very fast","Sighting Duration":"00:02:10","Case Number":"32276","trends":["There have been 5 other sightings in Campbellsville","There were no other sightings in Campbellsville on or around October 1st 2011"],"Source":"MUFON"}