{"trends":["There have been no other sightings in Gerald","This sighting has never been favorited."],"Country":"United States","Date Submitted":"10/02/2011 03:30 UTC","Longitude":"-91.331847","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-10022011-0007","files":["/var/www/straped/mufon/html2text/32275.html.txt","/var/www/straped/mufon/more/32275_submitter_file1__100_1204.JPG","/var/www/straped/mufon/more/32275_submitter_file2__100_1213.JPG","/var/www/straped/mufon/more/32275_submitter_file3__100_1201.JPG","/var/www/straped/mufon/org/32275.html"],"Summary":"My family and I saw and have been seeing UFOS for a long time. On this night and from everynight since then we have been seeing them more and more are appearing everyday.","Object Shape":"Disc, Fireball, Flash, Oval, Sphere, Star-like, Other","Disposition":"Unknown","City":"Gerald","Viewing Distance":"Unknown","Object Features":"Unknown","Object Flight Path":"Path with directional change","Latitude":"38.401822","divs":["Sighting Details my brother and i have been seeing these ufos everynight. the first thing that makes them so very easily noticeable is it looks like a star that is flashing every color in the spectrum. I thought right away it was a UFO because stars don't flash and pulsate many different colors. it is a pulsating object that looks stationary with the naked eye, but when in the camera lens, it is moving at light speed it moves so fast it looks like it is at a standstill. After taking several photos, you can see that they are doing speeds and manuevers we don't have the ability to do. You just have to see the pics and come to Gerald and look in the sky and you will see what i am talking about. I want to know what they are, it isn't something that we should take lightly. please contact me and when you see the photos I took i'm sure you will definitely want to come see for yourselves. The pictures are 100 percent legit and evidence there are many UFOs everywhere and more are present everyday! they scare me and make me very uncomfortable because you can tell they are here to stay for what i don't know, after me and my family watched for awhile, i saw another one come and appear close to the one we were watching and well after seeing more than one my niece got a bit scared and went inside. so we lost sight when we went inside the house."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.401822,+-91.331847(32275)&iwloc=A&hl=en\"> mufon case (32275) map </A>","Case Number":"32275","Date of the Event":"09/05/2011 12:00 UTC","Source":"MUFON","Region":"Missouri"}