{"Source":"MUFON","Log Number":"US-10022011-0013","Viewing Distance":"501 Feet - 1 Mile","Case Number":"32282","Weather Factors":"Unknown","Summary":"Straight-line flight, WNW-to-SW, of 3 groupings of lights, with one object speeding up to join another group.","Longitude":"-75.294344","divs":["Sighting DetailsThis was reported to me at 9:30pm, Oct. 1, by a neighbor who wishes to remain anonymous. \"I was walking from my parked car to the back entrance of Kohl's department store in Havertown, when I noticed a very bright aerial light in my furthest right peripheral vision. Looking up, I saw what I thought at first to be many helicopters flying in three groups consisting of 1-to-four objects. The sky was overcast but it was not raining. What startled me was that there was no sound at all. There was very little sound from the parking lot and by-passing traffic. I was by myself. We live in a flight path, and are used to seeing and hearing various planes and helicopters at all times of day. I walked about 30-35 feet as I watched the objects, flying from WNW to the Southwest...in the direction of the Philadelphia Int. Airport. During the time they were in sight, one of the lights in the middle grouping suddenly zipped from the group, joined the first group just slightly ahead of what had been its original front light. The instant speed of the thing took me completely by surprise, at which point I looked to see if there was anyone else in the lot who might also be seeing this. One woman was coming out of the store, but by that time, the objects were obscured by the facade of the store roofline. I was shocked at the sight, but kept walking into the store to continue my errand, simply because I didn't know what else to do. I reported this to a neighbor who has an interest in these things, and we did a sketch of the sighting.\""],"Date of the Event":"10/01/2011 08:10 UTC","Date Submitted":"10/02/2011 12:55 UTC","Country":"United States","Object Features":"None","Latitude":"39.968563","Tags":"City","files":["/var/www/straped/mufon/html2text/32282.html.txt","/var/www/straped/mufon/org/32282.html"],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Havertwon","This sighting has never been favorited."],"Region":"Pennsylvania","City":"Havertwon","map":"<A HREF = \"http://maps.google.com/maps?q=39.968563,+-75.294344(32282)&iwloc=A&hl=en\"> mufon case (32282) map </A>","Object Shape":"Circle","Sighting Duration":"Undisclosed"}