{"files":["/var/www/straped/mufon/html2text/32281.html.txt","/var/www/straped/mufon/org/32281.html"],"Disposition":"Insufficient Data","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Naples","Date of the Event":"10/01/2011 10:20 UTC","Object Features":"Unknown","Longitude":"-81.79399","Date Submitted":"10/02/2011 12:08 UTC","divs":["Sighting DetailsMy girfriend and I were out on my front porch enjoying an unusually cool and clear night (for Florida). Something caught her eye and she got up and walked to the driveway and said (quite simply) \"What in the hell is that?\" I looked up to see what can be loosely described as grey boomerang with red and white lights drifting across the sky. In the center was a cluster of tiny white lights that could almost be described like a disco ball. We watched it drift for about30 seconds going north to south and fade away. Then, to our amazement, another one appeared following the same course as the first one. Drifted for awhile then faded away. We stood in the driveway dumbfounded for about an hour looking for another one. Nothing. Then just before bed we went out for one last look. About ten minutes later here comes another one. Except the sky was much darker and clearer now so it was much more well defined. It was illuminated much like a small watt light bulb seen through a lampshade. With the same cluster of tiny lights in the center. It must be noted that these were not like little dots in the sky. There were two helicopters in the area for the first two but none for the third one. I'm going out to get a video camera!"],"Latitude":"26.152715","Summary":"Bizarre lights in boomerang shape.","map":"<A HREF = \"http://maps.google.com/maps?q=26.152715,+-81.79399(32281)&iwloc=A&hl=en\"> mufon case (32281) map </A>","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around October 1st 2011"],"Region":"Florida","Object Shape":"Boomerang","Source":"MUFON","Log Number":"US-10022011-0012","Tags":"City","Weather Factors":"None","Country":"United States","Object Flight Path":"Straight-line path","Case Number":"32281"}