{"Log Number":"US-10022011-0019","Object Shape":"Star-like, Unknown","Sighting Duration":"Undisclosed","Region":"Florida","Viewing Distance":"Unknown","City":"Fort Myers","divs":["Sighting DetailsMy brother and I were talking late into the night about various topics when we were doing a divination concerning which constellation to ponder and meditate on. This ended up being Pisces. So we walked out onto our pool deck after being in a pretty meditative mindset and directly above our neighbors house (from there you would be able to see the couch where we were sitting) we saw two star-like lights in a parallel formation which was slightly diagonal from the horizon. It was completely silent outside, and a perfectly clear night. This formation moved into the Pisces constellation which was 60 degrees above the horizon. It moved at a medium pace, and at a steady velocity. The space between the two lights looked fuzzy and seemed interconnected. We immediately went to the backyard to try and see more of this somewhat eerie presence and a meteorite came flying by and then after a few minutes directly above the tip of Pisces a blinking blue light appeared and stayed exactly in its position for nearly 45 minutes. The blinking was not consistent with its intervals; they ranged from split seconds to 30 seconds apart. Again, it did not move. Very interesting. This morning we read the other reports in the area about a boomerang-shaped UFO that were seen lats night, and they sounded very familiar."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.551011,+-81.931205(32288)&iwloc=A&hl=en\"> mufon case (32288) map </A>","Object Flight Path":"Path then hovering","Summary":"Two star-like lights hovered above our neighbors house and then at medium speed and parallel formation went towards Picses.","Date of the Event":"10/02/2011 01:30 UTC","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around October 2nd 2011"],"Longitude":"-81.931205","Disposition":"Unresolved","Date Submitted":"10/02/2011 03:49 UTC","Latitude":"26.551011","Case Number":"32288","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32288.html.txt","/var/www/straped/mufon/org/32288.html"],"Tags":"City","Weather Factors":"None"}