{"Weather Factors":"None","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around September 10th 2011"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.6939,+-78.879474(32283)&iwloc=A&hl=en\"> mufon case (32283) map </A>","Date Submitted":"10/02/2011 01:12 UTC","Log Number":"US-10022011-0014","Viewing Distance":"Over One Mile","Case Number":"32283","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/32283.html.txt","/var/www/straped/mufon/org/32283.html"],"City":"Myrtle Beach","Region":"South Carolina","Source":"MUFON","divs":["Sighting DetailsMy fiancee and I had went to the beach to celebrate his upcoming birthday (on the weekend, since his birthday falls on a weekday) and we were in our hotel room lounging on the bed with the patio door open observing the night sky and listening to the ocean when we both saw the same thing happen. We saw two star like objects ascend through the sky side by side going along the same path. It was almost like falling star except that they both went in the complete opposite direction, as if you were seeing stars fall in reverse only slower. It happened not slowly, and not fast and we didn't see any specific shape of the objects or notice anything odd about them except that they were definitely taking off and going upwards side by side from ground to sky in the eastern direction. If we weren't laying there taking in the view, we never would have noticed it happen or have heard anything, so it was an extreme coincidence that we were able to see this. Both of us were pretty shocked and have been for the past few weeks. We've talked about it a few times and have finally decided to simply believe that we did in fact see two ufo's ascending into space, nothing else made sense at that distance, time, speed, or direction. So now that we've both accepted it we decided to report it to your company, in case there were others that saw it the same night as well. We lost sight of the objects taking off together when they flew out of our range of sight from the doorway. I think both of us just kinda sat there dumbfounded for a few seconds before saying \"Did you see that?\" and getting up to look out the patio doorway, only finding at that point there was nothing else in the sky except the stars. We sat there for about another hour staring at the sky until we just gave up and went to sleep."],"Longitude":"-78.879474","Latitude":"33.6939","Sighting Duration":"00:00:10","Object Shape":"Unknown","Object Flight Path":"Straight-line path","Summary":"saw two objects fly upward diagonally together into space","Tags":"City","Date of the Event":"09/10/2011 12:00 UTC","Country":"United States"}