{"Case Number":"32298","divs":["Sighting Details1. We were driving south on Ormond Rd. Saw a glowing orange object to the west that seemed to be stationary at aprox 820pm just behind the tree line. Then we turned west on to White Lake Rd. Then object was still on our right side but seemed smaller and higher in the sky. We then turned south on Ormond Rd. object was behind us and seemed to be moving north. We lost sight and then spotted it moving south(twords us) until it was almost directly overhead. We then stopped the car just north of Jackson Blvd. and watched the object slowly assend up until it suddenly vanished. 2. I saw a large orange glow in the tree line. 3. I thought at first the top of a cell phone tower was on fire. 4. It looked like a orange dull glowing bubble. I would compare it to a harvest moon. It looked like it was stationary at first when I saw it through the trees. Then we could see it was moving away from us then changed direction and came back tword us traveling in the same direction as us. At this point we stopped the car to observe the object. We thought maybe it was a strange looking helicopter but when it got almost overhead we could hear nothing and could not see any lights a helicopter would normally have. It then started assending upward, glowing as it passed in and out of some clouds and then suddenly vanished. 5. We were very courious during the sighting, trying to figure out what we were seeing. There were 6 of us in the car all seeing the same thing. There were other cars on the road but we were the only ones that pulled over. We could also see airplanes higher in the sky. 6. We were watching it and it just vanished."],"Log Number":"US-10022011-0029","Tags":"City","City":"White Lake","Date of the Event":"10/02/2011 08:30 UTC","Country":"United States","Object Features":"Undisclosed","Region":"Michigan","Viewing Distance":"Unknown","Object Shape":"Fireball, Oval, Sphere","Longitude":"-83.55411","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=42.691696,+-83.55411(32298)&iwloc=A&hl=en\"> mufon case (32298) map </A>","trends":["There have been 3 other sightings in White Lake","There were no other sightings in White Lake on or around October 2nd 2011"],"Disposition":"Unknown","Weather Factors":"Unknown","Summary":"Large object tree top height started moving.","Source":"MUFON","Date Submitted":"10/02/2011 11:19 UTC","Sighting Duration":"Undisclosed","Latitude":"42.691696","files":["/var/www/straped/mufon/html2text/32298.html.txt","/var/www/straped/mufon/org/32298.html"]}