{"Summary":"saucer-like ufo flying over courtney campbell bridge going east towards Tampa, lights were clear, like waving around the saucer perimiter, there was one blinking red light. We stopped seeing it once we got to the international plaza mall.","Source":"MUFON","Date of the Event":"10/01/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.952125,+-82.450028(32297)&iwloc=A&hl=en\"> mufon case (32297) map </A>","files":["/var/www/straped/mufon/html2text/32297.html.txt","/var/www/straped/mufon/org/32297.html"],"Longitude":"-82.450028","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change","City":"Tampa","Sighting Duration":"00:03:00","Case Number":"32297","Weather Factors":"None","divs":["sighting detailslast night (oct. 1 2011); we,(my husband, myself and our 4 kids) were driving east bound on sr 60 courtney campbell bridge from clearwater towards tampa. we left our home a few minutes past 9pm, so this took place sometime between 9-10pm. as my husband drives i look up and there i see a \"flying saucer\" and although we were very close to the tampa airport (tpa) it took me a fraction of a second to realize this wasn't a plane, so i scream it out, look a flying saucer (in my native language; spanish) my husband immediately looks up, and is like omg what the... no...!? and he is laughing in disbelief... this thing was flying\\hovering in the direction we were going a few hundred feet above us. it had clear or white lights flashing in a wave-like motion around its perimeter, and one red flashing light. my husband and i both got our cell phones out and recorded the thing, however, it was night time and a cell phone camera is not very potent after all, so unless someone has some sort of high-tech equipment that might be able to perhaps magnify it and see something, these videos are pretty much useless. but we do have them in case. we continued to see the ufo until it turned north (to our left) and then east again, but far from us. we stopped seeing it once we got onto the turning lane to get into the international plaza mall in tampa, fl. i asked the kids ages 10 & 12 if they had seen it and they said they did. my 12 yr old especially gave me the exact description of what i had seen myself. i want to mention that i had never seen anything like it in my life, and that for the record, i'm one if those people that do not believe in extraterrestrial aliens, area 51, or any of that stuff, but i know i saw this thing last night, as well as my kids and husband and unless it a new type of air force, military aircraft, i would say it was a \"flying saucer\"."],"Region":"Florida","Object Shape":"Disc","Log Number":"US-10022011-0028","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around October 1st 2011"],"Latitude":"27.952125","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","Date Submitted":"10/02/2011 10:47 UTC","Tags":"City","Object Features":"None"}