{"Object Flight Path":"Path with directional change","Case Number":"32292","files":["/var/www/straped/mufon/html2text/32292.html.txt","/var/www/straped/mufon/org/32292.html"],"Log Number":"US-10022011-0023","Country":"United States","City":"Desert Hot Springs","map":"<A HREF = \"http://maps.google.com/maps?q=33.967414,+-116.492958(32292)&iwloc=A&hl=en\"> mufon case (32292) map </A>","Object Features":"Undisclosed","Summary":"Disc-shaped, black bottom, white top, tilting back and forth","Date of the Event":"10/02/2011 02:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsDriving home from the store with 3 children in car. My 8 year-old son spotted it first and said \"look at that in the sky\" - I looked up and saw 3 birds and said to him \"those are birds\" - he said \"no look right there\" and at a second glance I spotted the object. We turned to go towards the object to get a better view. It was disc-shaped like a saucer or frisbee. It was close enough to see the colors - which was black on the bottom and white on top. It moved up and down and side to side in a tilting like motion. It was wierd. I thought what could that be. I immediately thought of my camera phone when it occured to me, I'd left it at home. We observed this for about 30 to 45 seconds. I told the kids to keep an eye on it while I headed home which was about 1 minute away. After arriving back at the sight within 3 minutes, it was gone. Before we left the sight the first time, it appeared as it was going over the mountain in Desert Hot Springs (not sure the name of the mountain but by Joshua Tree National Park). I'm wondering if it was a man-made radio controlled object. It just seemed too large and far away to be controlled by a radio remote control."],"Date Submitted":"10/02/2011 05:43 UTC","Weather Factors":"None","Viewing Distance":"Over One Mile","Longitude":"-116.492958","trends":["There have been 5 other sightings in Desert Hot Springs","There were no other sightings in Desert Hot Springs on or around October 2nd 2011"],"Disposition":"IFO","Latitude":"33.967414","Tags":"City","Region":"California","Object Shape":"Circle, Disc"}