{"City":"Brownwood","map":"<A HREF = \"http://maps.google.com/maps?q=31.71146,+-98.985961(32303)&iwloc=A&hl=en\"> mufon case (32303) map </A>","Weather Factors":"Unknown","Tags":"City","Longitude":"-98.985961","Date Submitted":"10/03/2011 11:02 UTC","Source":"MUFON","trends":["There have been 21 other sightings in Brownwood","There were no other sightings in Brownwood on or around October 1st 2011"],"Object Features":"Unknown","Date of the Event":"10/01/2011 12:00 UTC","Log Number":"US-10032011-0004","Summary":"ORANGE LIGHTS IN THE SKY OVER BROWNWOOD TX","files":["/var/www/straped/mufon/html2text/32303.html.txt","/var/www/straped/mufon/org/32303.html"],"Country":"United States","Object Flight Path":"Other","divs":["Sighting DetailsOn the evening of sat oct 1st 2011 i was in brownwood tx visiting with friends and family. There was approximately 15 of us outside when we noticed 3 vertical bright orange lights appear in the sky. These lights stayed on for maybe 30-45 seconds and vanished. In the mean time there were many white blinking lights flying all over the sky. At first we wrote that off as commercial aircraft in the sky, but we quickly realized that these lights were flying way to erraticly and dimming in and out until they couldnt be seen anymore. shortly after that we hear this loud thunderous roar above our heads as if something was flying right over us. it definately was unlike any other aircraft ive ever heard before, it was almost ear piercing. a few seconds more pass by and we see the orange lights appear again but this time in a different area of the sky. they remained vertical for a few seconds and then started moving around as if they were conforming to a shape. but as quick as they started doing that they faded out and were never seen again for the rest of the night. another 10-15 mins passes and we all start to hear noises again in the sky, but this time i was familiar with it. a military Chinook helicopter passes overhead but as if it was looking for something. I guess ive never really been a believer of the extraterrestrial but this has been bothering me for a couple days now since we all saw this. i guess more than anything im just looking for answers and possibly explanations as to what we all witnessed."],"Viewing Distance":"Unknown","Region":"Texas","Latitude":"31.71146","Disposition":"IFO","Case Number":"32303","Sighting Duration":"Undisclosed","Object Shape":"Circle"}