{"map":"<A HREF = \"http://maps.google.com/maps?q=44.465238,+-93.156844(3230)&iwloc=A&hl=en\"> mufon case (3230) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"06/21/2005 12:00 UTC","Object Features":"Undisclosed","Source":"MUFON","Longitude":"-93.156844","Log Number":"US-06222005-0001","Latitude":"44.465238","Object Shape":"Undisclosed","Weather Factors":"Unknown","Country":"United States","City":"Northfield","Summary":"Black Triangle with lights, silent, low, with many witnesses","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting Details1. Me and 5 friends were standing on my roof, downtown Northfield, having a smoke and talking. 2. I noticed a flashing light coming over the buildings to my southeast, approaching heading northwest. 3. I thought the object was an airplane when I first noticed it, and for a while after first seeing it i thought it was still an airplane. 4. The object had a bright flashing white light,which made me think it was an airplane, but it flew directly over our heads, lower than the clouds, (they were about 6,000 feet base, I am a skywarn spotter for the national weather service, so it had to be lower than 6,000 ft.) we couldn't see the white light as it passed over our heads, but there were 3 red lights and the sky was clear over our head, and you could make out the triangle against the setting suns sky. Then as it traveled NW from the back it was flashing red lights from the rear, 3 of them, it sort of looked like break lights of a car. But the object was completely silent, no noise at all, and for how low it was, we should have heard it. 5. My reaction as it passed overhead and I realized it was not a plane, I got really excited. My action was to just watch it float into the setting suns sky. 6. We watched it till we could no longer see it."],"trends":["There have been 4 other sightings in Northfield","There were no other sightings in Northfield on or around June 21st 2005"],"Tags":"City","Disposition":"IFO","Date Submitted":"06/21/2005 12:00 UTC","Case Number":"3230","Region":"Minnesota","files":["/var/www/straped/mufon/html2text/3230.html.txt","/var/www/straped/mufon/org/3230.html"]}