{"Viewing Distance":"Unknown","Object Shape":"Unknown","Latitude":"21.164164","Summary":"four orange lights moving acroos sky at high speed. Two in straight line, one along same path but made a U turn, one crossing previous paths at 90 degree angle.","Weather Factors":"Unknown","Log Number":"MX-10032011-0005","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=21.164164,+-86.844927(32304)&iwloc=A&hl=en\"> mufon case (32304) map </A>","Date Submitted":"10/03/2011 12:08 UTC","Source":"MUFON","divs":["Sighting DetailsWe were at a Cancun Mexico resort hotel pool side on lounge chairs watching the stars at around 9:30PM. The sky was clear with a few cloud and a rising full moon. We saw what appeared to be a shooting star cross the sky from south to north at a high rate of speed. Approximately 3 minutes later a second \"light\" appeared at the same speed and direction, both disappeared behind clouds. Approximately 5 minutes later a third \"light\" appeared going at same speed and direction, however this one made a right hand U turn without slowing down and returned in the same direction that it had come. A fourth \"light\" appeared approximately 3 minutes later going in a west to east direction. It appeared to be the same color, size, distance and traveling at the same rate of speed. The \"lights\" did not slow down, change color, blink or make a sound. To compare their speed to airplanes we also saw; airplanes took 20 to 30 seconds to disappear, the \"lights\" took only a few seconds to cross the sky. The \"light\" that made the U turn did not change color or fade as it turned, the orange light remained constant as it made the turn. If this \"light\" had not made the U turn, we would have believe we had seen shooting stars or possible space junk burning up. Now, we are not sure what we have seen, except that I have never seen anything make a high speed turn without slowing down as this object did nor do I believe shooting stars change direction."],"Object Features":"Unknown","trends":["There have been 5 other sightings in Cancun","There were no other sightings in Cancun on or around September 15th 2011"],"files":["/var/www/straped/mufon/html2text/32304.html.txt","/var/www/straped/mufon/org/32304.html"],"City":"Cancun","Date of the Event":"09/15/2011 09:30 UTC","Country":"Mexico","Sighting Duration":"Undisclosed","Case Number":"32304","Longitude":"-86.844927","Region":"Quintana Roo","Tags":"City","Disposition":"Unresolved"}