{"Object Shape":"Cylinder, Fireball","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","trends":["There have been 18 other sightings in Windsor","There were no other sightings in Windsor on or around October 2nd 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.301976,+-82.990395(32317)&iwloc=A&hl=en\"> mufon case (32317) map </A>","Object Features":"Undisclosed","Summary":"Brief sighting, light in sky as bright as a bonfire, traveled straight, stopped, made shape in sky, disappeared behind cloud.","Latitude":"42.301976","Date Submitted":"10/03/2011 07:50 UTC","Source":"MUFON","Country":"Canada","Viewing Distance":"Unknown","City":"Windsor","Tags":"City","Weather Factors":"Unknown","Case Number":"32317","Date of the Event":"10/02/2011 08:10 UTC","Region":"Ontario","divs":["Sighting Details The sun had just set as I was going for a walk to a friends house. I left home at about 7:30pm, and arrived there at 8:30pm Oct 3rd 2011. I was heading SSE, I believe it was about 8:00pm - 8:10pm when I gazed upon an object in the sky. It was close to downtown in Windsor Ontario, I was just exiting a park named International Gardens, coming out onto University Ave West. The building to my left was blocking my view on that side, so I do not know where the object came from, only that it came from the East and was heading west. There was absolutely no doubt in my mind that this object was not a plane, satellite etc. It was traveling at the same speed as most passenger planes, at about the same height in the sky as well. It was ridiculously bright when I first saw it, as if a plane was on fire in the sky. It wasn't like it had lights, the whole thing was glowing brightly and flickering a yellow-light orange color. When I looked closer, it seemed as if in the middle of this bright glow was a silver cylinder like object spinning clockwise. I'm not very good with judging distance, but I'd say it traveled straight heading west for about 200 meters, flickering more randomly while loosing brightness. I'm not sure if the craft itself got smaller, but as it faded I lost the ability to see the object inside the glow & the glow itself took up a lot less space in the sky. It was still yellow-light orange at this time. As it started to fade I waved one hand at it, I'm not sure if it was why, but shortly after that it slowed to a stop and stayed there for about 30 seconds. It then changed direction and made a shape in the sky similar to a square, going about 50 meters for each side. At this time, I couldn't see a flicker anymore, and it was changing from yellow-light orange to red-red orange. (This is also when I was awe-struck and about to kill myself for not bringing my camera.) At this time, I think the ship and I both, noticed a plane in the sky. It wasn't a jet or militarily plane it was heading SSE and seemed to be just for travelers. I swear the passengers would have seen it, I couldn't have been the only one. After that, it changed direction again, flashing on and off from no light to red, heading SSW for another 50 meters as well as moving higher into the sky. I waved again :) Shorty after that, it disappeared behind a cloud... I tried to chase after it but I never saw it again. I lost track of the plane but it didn't fallow the ship. I couldn't see anyone else who might have witnessed it. Just to put it out there, I, along with a few others I've spoke to, have seen many, many UFO's in this area, and over Detroit, Michigan. Especially during storms. I have seen both this type, and those that emit a blue light and have some sort of cloaking devise which makes it hard to see them and hurt to look at. I have also seen mutilated wild animals with black burn marks around them. The park I saw those in, is now under constant supervision. I wonder why? Please do not fear what you have yet to understand."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/32317.html.txt","/var/www/straped/mufon/org/32317.html"],"Longitude":"-82.990395","Log Number":"CA-10032011-0016","Sighting Duration":"Undisclosed"}