{"Region":"Indiana","trends":["There have been 4 other sightings in Greencastle","There were no other sightings in Greencastle on or around October 3rd 2011"],"files":["/var/www/straped/mufon/html2text/32312.html.txt","/var/www/straped/mufon/org/32312.html"],"Date of the Event":"10/03/2011 02:30 UTC","Source":"MUFON","Tags":"City","divs":["Sighting DetailsI am an auto claims adjuster for an Auto Insurance Company. I drive daily aprox. 100- 250 miles per day. I was in Greencastle Indiana at the Marathon gas station at St. rd. 40, & St. rd 231, Greencastle. Met a customer there, wrote the estimate, then proceeded to drive south on St. Rd. 231 to get back on I-70 east. I was driving south on St. Rd. 231 south, aprox 3-5 miles before hitting the exit for I-70. Out of the left corner of my eye, I saw a bright, silver, disc shaped object that appeared stationary in the sky. The object was located to the south east of my position as I was driving south on 231, toward I-70. I would guess that the object was pretty close to the Indianapolis International Airport at the time of my sighting. I am prior Air Force Special Ops, and prior commercial air line jet mechanic. At first, I thought the object could possibly be a plane that had a polished stainless steel fuselage. As I continued to view the object, it was not moving, had no noticable wings of any type, and was very bright. There were little to no clouds in the sky at the time. The more I looked, the more I realized that I have never seen an object like this, no markings, just a bright perfect disc shaped object that left no vapor trail, and was not moving around. it just sat there in the sky. As I contined to watch the object, it suddenly just disappeared. It did not move off in any direction, it simply vanished. I thought to myself, holy ****, that was a freakin UFO. The first thing I did was call my wife. I explained it to her, and she then confessed that she had seen the exact same thing some time ago. I aksed her why she never told me?, and she said that she thought maybe she was just seeing things, and really didn't want to believe what she saw was a UFO."],"Country":"United States","Latitude":"39.65238","Date Submitted":"10/03/2011 02:48 UTC","Object Features":"None","Case Number":"32312","City":"Greencastle","Longitude":"-86.855642","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.65238,+-86.855642(32312)&iwloc=A&hl=en\"> mufon case (32312) map </A>","Disposition":"Unresolved","Object Shape":"Disc","Log Number":"US-10032011-0012","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Flight Path":"Stationary","Summary":"BRIGHT SILVER POLISHED DISC STATIONARY IN THE SKY, THEN IT DISAPPEARED."}