{"Weather Factors":"Unknown","trends":["There have been 3 other sightings in Brady","There were no other sightings in Brady on or around October 1st 2011"],"Country":"United States","Case Number":"32313","Date Submitted":"10/03/2011 03:09 UTC","Sighting Duration":"00:20:09","Tags":"City","Viewing Distance":"Over One Mile","City":"Brady","Summary":"4 Bright Yellow-Orange Lights for 10 - 20 Seconds","Object Shape":"Flash, Unknown","Object Flight Path":"Stationary","Longitude":"-99.331795","divs":["Sighting DetailsOn October 1, 2011 my son and I were at our ranch north of Brady Texas and South of Brownwood Texas. We were sitting outside listening to the Texas vs Iowa State football game on the radio and watching the stars. It was a clear sky. From about 8:30 PM to 8:50 PM in the northern sky towards Brownwood there were approximately 15 small bright white lights like strobe lights on airplane tail sections blinking in the night sky, but they were stationary or barely moving. Then 4 larger bright yellow-orange lights(vertical the first time, then horizontal each time after) came on for approximately 10-15 seconds. These lights came on about 4 different times. All of the small blinking lights were scattered around in no discernible pattern. The last time we saw the bigger lights they had moved about 10 degrees to the west. Then very suddenly all of the lights were gone and we heard the sound of a large jet engine for a few seconds and it faded away to total quiet. We know that there are some air force bases nearby and had heard the sound of jet engines several times during the day light hours, but could never spot a plane in the sky."],"Region":"Texas","Date of the Event":"10/01/2011 08:30 UTC","files":["/var/www/straped/mufon/html2text/32313.html.txt","/var/www/straped/mufon/org/32313.html"],"Latitude":"31.143938","map":"<A HREF = \"http://maps.google.com/maps?q=31.143938,+-99.331795(32313)&iwloc=A&hl=en\"> mufon case (32313) map </A>","Source":"MUFON","Log Number":"US-10032011-0013","Object Features":"None","Disposition":"IFO"}