{"Country":"Mexico","Summary":"The main one looked like a bright star and moved slowly.","Latitude":"20.630901","Object Flight Path":"Stationary,Hovering then path","Case Number":"32316","map":"<A HREF = \"http://maps.google.com/maps?q=20.630901,+-103.274437(32316)&iwloc=A&hl=en\"> mufon case (32316) map </A>","Object Features":"Unknown","Log Number":"MX-10032011-0015","Source":"MUFON","Region":"Jalisco","Date Submitted":"10/03/2011 06:09 UTC","Disposition":"Unresolved","trends":["There have been 8 other sightings in Guadalajara","There was one other sighting in Guadalajara on or around October 2nd 2011"],"Tags":"City","Longitude":"-103.274437","divs":["Sighting DetailsI was standing with other six to eight people, outside a building, waiting for other fellows, on a sunday afternoon under a scarcely clouded blue sky. A friend of mine said there was a white point in the sky and pointed it with her arm. At first I thought it could be a big balloon, but it wasn't following the wind as the clouds. I saw it hiding among the clouds, moving against them. The couds moved from North East to South west, and the object seemed to move irregularly heading towards the East. In a certain moment that many of us were focusing on the big object, another small object flied much faster in another direction, almost intesecting the biggest object's path. It dissapeared from our sight rapidly as it was too small to be identified in such altitude, and because of the reflects from the sun. Especially when the smaller object crossed the bigger one, many of us yelled in surprise. After that, the object ended separated from all clouds and it seemd to descend as we could see it bigger and clearer. We quit seeing the objetc when we entered the building. It kept flying East."],"Date of the Event":"10/02/2011 05:40 UTC","City":"Guadalajara","Object Shape":"Circle, Disc, Sphere, Star-like","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32316.html.txt","/var/www/straped/mufon/org/32316.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}