{"Date Submitted":"10/03/2011 05:58 UTC","Country":"United States","City":"Keller","Tags":"City","Object Features":"None","Summary":"white cigar shape object that was higher than airplanes in the vicinity.","trends":["There have been 4 other sightings in Keller","There was one other sighting in Keller on or around October 1st 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.94132,+-97.245002(32315)&iwloc=A&hl=en\"> mufon case (32315) map </A>","Case Number":"32315","Sighting Duration":"00:00:10","Weather Factors":"None","Longitude":"-97.245002","divs":["Sighting Detailswas going 35w just outside of denton and before the texas motor speedway on my way to weatherford. I work out near dfw airport and see how high the airplanes are normally. This object was flying much higher than any airplane i had seen and was not going near as fast as they go. The object was a white, cigar shape object that appeared to hover, move slightly and then i blinked it was gone. looked up again a few seconds later and it was there again and then gone for good. It was a bright clear day, hardly any clouds. I was getting near alliance airport but this thing was flying way too high to be one of the airplanes i have previously seen either near alliance or dfw or love field. definitely strange enough i noticed it. I just remeber being observant enough to call my mother and tell her what i was seeing. I didnt have any of my field equipment with me and my phone camera was not any good to capture it. I lost sight of the object while driving. I literally blinked and it was gone. I noticed the object when i happend to look up for a split second. I thought at first it was a plane and then realized it was too high up to be a plane."],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/32315.html.txt","/var/www/straped/mufon/org/32315.html"],"Disposition":"IFO","Source":"MUFON","Object Flight Path":"Hovering then path","Region":"Texas","Object Shape":"Cigar","Log Number":"US-10032011-0014","Latitude":"32.94132","Date of the Event":"10/01/2011 03:00 UTC"}