{"Disposition":"IFO","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/32328.html.txt","/var/www/straped/mufon/org/32328.html"],"Longitude":"-101.840677","Tags":"City","Date of the Event":"10/03/2011 07:30 UTC","Object Features":"Unknown","divs":["sighting details9-23-11 amarillo, tx. - 2 nasa ballons seen in sky- looks cool - about 1\\2 the size of the moon - 9-24-11 - went outside to see if they are still there. no, but there's an odd star in the sky directly overhead - it's still daylight. called a coworker to see it. we're both watching & it goes out. how odd. 9-26-11- working outside about the same time as last sighting. approx. 7:30 -look up & see this star again. watched for a few min & it went out. double odd. 10-2-11-playing football with grandkids outside- it's 7:30pm. same time. it appears. i tell the kids & they see it too. called their mother\\my daughter & told her to look. she lives several blocks away. she see's it & says \"you know dad, it's moving\" - i agree. it goes out again by 7:40. 10-3-11 it's 7:30pm. i'm on the highway coming home from work. i stop the car & get out & look - it's there. within a few min. it simply goes out. like a lightbulb being turned off. this appears to be happening everyday. it appears as a star. satallite or balloon or marvin martian it is extremely odd."],"Log Number":"US-10042011-0003","Object Flight Path":"Path then hovering","Summary":"everynight at 7:30pm a star directly overhead appears when all others are still out - then it abruptly goes out - you could probably see this light from a great distance. every day for a week now at the same time. multiple people seeing this. it moves","Weather Factors":"Unknown","Region":"Texas","Latitude":"35.189233","Case Number":"32328","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.189233,+-101.840677(32328)&iwloc=A&hl=en\"> mufon case (32328) map </A>","City":"Amarillo","Viewing Distance":"Unknown","Date Submitted":"10/04/2011 12:48 UTC","Country":"United States","trends":["There have been 15 other sightings in Amarillo","There were no other sightings in Amarillo on or around October 3rd 2011"],"Source":"MUFON"}