{"Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","City":"Austin","Longitude":"-97.755678","Summary":"4 Bright lights (1) Yellow (4) red lights for 15 - 20 Seconds","Latitude":"30.323504","Case Number":"32322","Date of the Event":"10/01/2011 08:25 UTC","Object Features":"Unknown","Country":"United States","Source":"MUFON","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around October 1st 2011"],"divs":["Sighting DetailsOn October 1, 2011. It was a clear sky night. Time was about 20:15 hrs. We were at my in-laws ranch located in Center City, Texas located 10 miles east of Goldthwaite, TX on hwy 84. I went out on the front porch to let my dog outside. I looked to the north and noticed 4 bright red lights and 1 bright yellow light in a vertical stationary pattern above tree level. The trees are about 75 yds from the house and stand 30'-40' tall. The pattern of lights was left to right was yellow, red,red, red, red. It stayed that way for about 15 - 20 seconds and then all lights went dark. I went inside and got my brother and two friends to come outside. When they came outside I pointed in the direction I saw the lights, all three of them noticed what look like small white lights on approximately 12-15 small planes. We watched the lights for another 15-20 minutes, the small objects were flying back and forth from east to west and west to east. We did not hear any jet engine noises. The distance of the lights is unknown but we assume over 15-20 miles north of us."],"Region":"Texas","Viewing Distance":"Over One Mile","Log Number":"US-10032011-0021","Date Submitted":"10/03/2011 08:56 UTC","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=30.323504,+-97.755678(32322)&iwloc=A&hl=en\"> mufon case (32322) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32322.html.txt","/var/www/straped/mufon/org/32322.html"]}