{"City":"Baytown","divs":["Sighting DetailsMy wife and I were on our way home from grabbing dinner around 8:30PM on October 2, 2011. We took our exit off of Interstate 10 to Sjolander Road. As I was pulling up to the stop sign to Sjolander my wife noticed some strange lights to the east south east. We observed a dark object with three bright white lights in the shape of a triangle. This craft was approximately a mile away, maybe less. It was hovering slightly above the tree tops from our angle. As we turned south on to Sjolander we noticed the object, which was initially hovering horizontally started to position itself vertically. It was the strangest thing we've ever seen. So, as we were traveling south on Sjolander we started to lose sight of the object through the trees. Right before we lost sight I noticed a low flying helicopter with its search lights on, going in the direction of the craft. This really got us curious and we decided to see what was really going on. So we headed east on to Archer Road occasionally seeing the lights through the trees and observing a few more helicopters coming into the area. We decided to get back on I-10 from Sjolander so that we'd have a better vantage point. We were heading east towards Highway 146. This is where it gets strange. We no longer saw the object but from our new found vantage point we saw a dozen, possibly more helicopters with search lights on. They were flying in threes and were in every direction. We then pulled over to a gas station off I-10 and 146 to watch the helicopters. We changed seats and I let my wife drive as we headed home. I noticed the helicopters would break formation and have one fly over an area to search then return to formation. We exited and were at the stop sign on Sjolander again when a helicopter flew right above us, no more the 80 feet on the ground. It was close enough to blind us with its light. It then flew off to the south west over a field. Then we returned home. The three lights we saw prior to the helicopters was an object we've never seen and we could distinguish the two from one another. Just looking for answers and wondering if anyone else noticed this strange occurrence in Baytown."],"files":["/var/www/straped/mufon/html2text/32325.html.txt","/var/www/straped/mufon/more/32325_submitter_file1__helicopters_chase_triangle.jpg","/var/www/straped/mufon/org/32325.html"],"trends":["There have been 7 other sightings in Baytown","There were no other sightings in Baytown on or around October 2nd 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=29.736895,+-94.971147(32325)&iwloc=A&hl=en\"> mufon case (32325) map </A>","Disposition":"Unresolved","Latitude":"29.736895","Longitude":"-94.971147","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/03/2011 10:07 UTC","Sighting Duration":"00:15:00","Object Flight Path":"Stationary,Hovering then path","Summary":"Triangular UFO tracked by multiple helicopters in Baytown, Texas.","Weather Factors":"Unknown","Country":"United States","Tags":"City","Log Number":"US-10032011-0023","Region":"Texas","Object Shape":"Triangle","Date of the Event":"10/02/2011 08:30 UTC","Case Number":"32325","Object Features":"Undisclosed"}