{"Case Number":"32331","trends":["There have been 2 other sightings in Chestertown","There were no other sightings in Chestertown on or around June 15th 2009"],"Summary":"this object followed me for at least 20 min. it was shaped like two teacups month to month with a ring in the middle spinning profusely. it followed me through the tress and flew directly over my head.","Latitude":"39.202846","Date Submitted":"10/04/2011 02:05 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI got off work at midnight, when I went out to get in my car, for some reason I looked up in the sky and noticed what I thought was a star. As I proceeded down the road, I notice the object was getting closer, then I thought it was a plane. I noticed two red lights one on each end of the object. Now I travel on a lonely road, two lanes. When I noticed it again, it was following me through the trees, but this time I could see white lights across it. I would slow down and it would too. by now I was going 30miles a hour, and I continued to slow down, and it did to, like it was pacing me. Now I am down to 10 miles an hour. Now it just above the trees.I was just making a bend in the road and it flew over my head very slowly and it was beautiful on the bottom of it. i could see the ring in the middle of the craft spinning very quickly and the lights across the front. When it got to the other side of the road, I saw the white lights go out then the red ones and it just disappeard. it didn't fly off it just vanished. When I got home I checked the time and there was no time lost, so i know I was abducted. But about a year later or so I woke up in bed and had a feeling I had been aboard a spaceship, so I thought I had a dream. in this mixed feelings I felt something had happened to me. I had been aboard this spaceship, the leader was very tall and the others were about 3 ft tall. I was shown different parts of the ship and their operating room. this was manned by the little ones and it was semicircular and their was robots at the operating tables. the leader told me his name and why they were coming to earth. i never felt in danger, it was like he want me to understand why they were here. He said man was destroying the earth. I was also shown the command center, where i must of been up in space because it was so black in space except for the stars, which you could almost touch it seemed. I asked him where they were from and he said where the stars triangle. I asked him how they traveled so fast and he said something about reverse propulsion. There is more but my story is already to long. thank you for listening."],"Region":"Maryland","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=39.202846,+-76.048332(32331)&iwloc=A&hl=en\"> mufon case (32331) map </A>","Object Features":"Window(s)","Tags":"City","Viewing Distance":"21-100 Feet","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32331.html.txt","/var/www/straped/mufon/org/32331.html"],"Log Number":"US-10042011-0006","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Circle, Cylinder","Date of the Event":"06/15/2009 12:00 UTC","Longitude":"-76.048332","City":"Chestertown"}