{"Longitude":"-94.377666","Weather Factors":"Unknown","City":"Lee's Summit","Latitude":"38.920873","Summary":"Unidentified object sighted while driving on 50 HWY E in Lee's Summit at 470 interchange.","Sighting Duration":"Undisclosed","Date Submitted":"10/04/2011 09:45 UTC","trends":["There have been 52 other sightings in Lee's Summit","There were 14 other sightings in Lee's Summit on or around October 4th 2011"],"Region":"Missouri","Disposition":"IFO","divs":["Sighting DetailsMy wife and I were driving home from the school we work at when we saw a strange flashing object in the sky. We were driving on 350 HWY as it turns into 50 HWY E at 470 in Lee's Summit. At first we thought it was an airplane landing at the Lee's Summit Airport...then it sharply changed direction, turned completely sideways and showed a vast array of lights...white, green, blue flashing in a pattern at first, and then quickly pulsating in a random pattern. It then hovered in place for a short time, then rotated back to horizontal. We could only see white lights when it did this. It then very quickly flew southeast at approximately 300-400 mph...then stopped abruptly in the sky over what would be downtown Lee's Summit. It then hovered in place and turned back toward us going northwest. We could once again see all of the colored lights on what appeared to be the bottom of the craft. The craft continued northwest and flew quickly out of view. In the area at the same time were at least 2, maybe 3 helicopters. I have never seen anything like this and have always been very skeptical of UFOs."],"files":["/var/www/straped/mufon/html2text/32347.html.txt","/var/www/straped/mufon/org/32347.html"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-10042011-0021","Country":"United States","Object Features":"Unknown","Date of the Event":"10/04/2011 07:55 UTC","Tags":"City","Object Shape":"Diamond, Triangle","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Case Number":"32347","map":"<A HREF = \"http://maps.google.com/maps?q=38.920873,+-94.377666(32347)&iwloc=A&hl=en\"> mufon case (32347) map </A>"}