{"trends":["There have been no other sightings in 3 different objects in di","This sighting has never been favorited."],"Disposition":"Unknown","Viewing Distance":"Over One Mile","Tags":"City","Object Flight Path":"Stationary","Case Number":"32349","map":"<A HREF = \"http://maps.google.com/maps?q=43.79073,+-88.786468(32349)&iwloc=A&hl=en\"> mufon case (32349) map </A>","Object Shape":"Circle","Object Features":"Other","Latitude":"43.79073","Date of the Event":"10/04/2011 09:10 UTC","Country":"United States","Longitude":"-88.786468","Weather Factors":"Unknown","Log Number":"US-10042011-0023","Region":"Wisconsin","City":"3 different objects in di","files":["/var/www/straped/mufon/html2text/32349.html.txt","/var/www/straped/mufon/org/32349.html"],"Summary":"3 objects spotted at equal distance and altitude approx 20 miles apart","Sighting Duration":"Undisclosed","Date Submitted":"10/04/2011 10:48 UTC","divs":["Sighting DetailsAt my parents house watching tv my mother went outside on the deck and noticed this blinking type of light and after looking through some binac's she called me outside to have a look. There was one not moving but had 3 lights red, green and white and about every 3 to 4 minutes it would look like it flashed a light away from itself. We looked around and noticed 2 others doing the same thing. During this time 3 aircraft flew around the area. I normally am a skeptic to these types of events as I do paranormal investigations, but I do not research UFO's. I looked for any logical explination as to why we were seeing these but could not come up with one unless the military has some new aircraft that I do not know about. I am familiar with landing lights on aircraft and with military aircraft as I served in the Army. We observed this object for about 45 minutes then went back in the house. As far as feellings, well nothing really suprises me anymore after doing paranormal research for 15 years I do not have good enough equipment to get good pictures. I have a cheap digital that really sucks for photos, I have several Nikon film cameras but can not shoot night shots at that distance and I have a video but it is really fuzzy. I will see if these appear again but if you have any sugestions as how to document these, please let me know. One other thing I noticed, we are in a flight path for MSP airport traffic but the aircraft that we saw was not following that pattern. Maybe this was nothing but thought I would atleast let you know. Please feel free to contact me, if you can not reach me by my cell please e-mail me."],"Source":"MUFON"}