{"Longitude":"-95.639423","Region":"Oklahoma","City":"Delaware","Date of the Event":"Unknown","trends":["There have been no other sightings in Delaware","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThis story was relayed to me by a cousin and brother,my mother has also confirmed that the story was told to her as well. My grandmother and Aunt lived on a farm either inside or just outside of Delaware, Oklahoma. They were part of a skywatch program during WWII, either operation skywatch or lookout. They were volunteer citizens for civil defense who were trained to spot enemy aircraft if they should invade the US during WWII. The Story goes that on this particular night they saw bright light which eventually got close enough for them to see it was a silver saucer. There were several bright lights and it was \"beautiful\". My aunt went on to say that she and my grandmother were actually contacted by the \"spaceship\". they were taken inside and showed an area that was very bright and full of beautiful lights. They (occupants) of the \"spaceship\" asked my aunt if she wanted to go with them, she said yes. They replied that her spacesuit wasn't ready yet. When asked by my cousin to explain any more details all my aunt would say very adamantly was \"it was a spaceship!\" My aunt and grandmother have since passed away for some time. I just recently learned of this story by a chance UFO story I was telling my brother. I know this isn't much information and several family members have passed on. My mother would not elaborate much on the story but did say that Aunt Ida had seen a spaceship once. My family in OKlahoma are very religious and for them to admit they saw something peculiar makes me believe that they indeed see something unidentified that night. I hope this can be of some use or perhaps someone has some information on this. The time was during World war II and upto 1955. thank you"],"Latitude":"36.778698","Source":"MUFON","Summary":"large saucer shaped, bright lights, silver","Log Number":"US-06232005-0002","Object Shape":"Undisclosed","Date Submitted":"06/23/2005 02:16 UTC","Viewing Distance":"Unknown","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/3234.html.txt","/var/www/straped/mufon/org/3234.html"],"Object Features":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.778698,+-95.639423(3234)&iwloc=A&hl=en\"> mufon case (3234) map </A>","Case Number":"3234"}