{"Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"10/04/2011 12:00 UTC","Longitude":"-94.570267","Region":"Missouri","Weather Factors":"Unknown","Date Submitted":"10/05/2011 04:17 UTC","divs":["Sighting DetailsMy friend and I were heading to downtown kansas city on 435 N, near the I70 exit I noticed what looked like a very bright 3 lights that were blinking (first thought was that it was an airplane) until we got closer and the object was floating in the sky about 200 feet or less above. The lights now appeared to have different colors and there were about 7 of them in a triangular shape that somewhat looked circular. The objest was HUGE and just hovering above on the right side of the highway. It felt as if the object was so close that you could touch it. We drove under it and as we were passing it, it appeared to almost split apart (the lights were about 10ft apart from eachother and then they became like 30ft apart and it started to slowly move further north going along I70 but with loads of smoke coming from it.) We watched and seen helicoptors in the sky. At first we wondered if it could of been helicotors flying but the object was silent as for the helicoptor we saw earlier you could hear perfectly. As we were driving severeal cars on the highway were slowing down dramatically as it flew over. Please PLEASE Please if anyone knows anything about this please please post something! I am not a believe in UFO's nor Aliens and after seeing this I am in utter awe!"],"Latitude":"39.106956","Summary":"Undescribable UFO KANSAS CITY 8/4/11","map":"<A HREF = \"http://maps.google.com/maps?q=39.106956,+-94.570267(32357)&iwloc=A&hl=en\"> mufon case (32357) map </A>","trends":["There have been 134 other sightings in Kansas City","There were 9 other sightings in Kansas City on or around October 4th 2011"],"Viewing Distance":"20 Feet or Less, 21-100 Feet","Log Number":"US-10052011-0005","Disposition":"IFO","Object Shape":"Boomerang, Sphere, Triangle","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/32357.html.txt","/var/www/straped/mufon/org/32357.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Case Number":"32357","City":"Kansas City","Country":"United States","Tags":"City"}