{"Tags":"City","Object Features":"Unknown","divs":["Sighting Details I waa driving along at night and noticed a large shadowlike object on the horizon descending over the tree tops just off towards the river. My car radio went fuzzy but I hardly noticed as i pulled over to see what was flying above the trees. I thought it was a stealth bomber at first but then remembered that they do not hover or make strange whistling sounds. The object was a boomerang shape around 150-200 ft. from wing tip to tip and around 75 ft. from nose to rear.It flew a short slow path of about a quarter mile over the river and slowly turned south and slowly cruised away, just making that odd whistling sound. I did not feel any effects or anything from the expeience just confusion from what not really knowing what I just saw,but I will say this, It did fly off to the south and Dobbins Air Force Base is located about 100 miles south of our town. I do not know If the object flew off to the base or changed course after I lost site but I Have seen other reports where UFO,s frequent military bases at times. This is bthe first I have told of this and I hope it might be helpful, thanks for listening, and believing."],"Weather Factors":"Unknown","Log Number":"US-10052011-0004","Summary":"driving north, observed large shadowlike object on the horizon as it grew larger as i got closer, I stopped to see what it was.","Latitude":"34.871185","Region":"Georgia","Object Flight Path":"Path then hovering","Date of the Event":"11/20/1992 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-83.963563","Case Number":"32356","Country":"United States","trends":["There have been 6 other sightings in Blairsville","There were no other sightings in Blairsville on or around November 20th 1992"],"City":"Blairsville","files":["/var/www/straped/mufon/html2text/32356.html.txt","/var/www/straped/mufon/org/32356.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.871185,+-83.963563(32356)&iwloc=A&hl=en\"> mufon case (32356) map </A>","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/05/2011 01:13 UTC","Disposition":"Unresolved","Source":"MUFON"}