{"trends":["There have been 67 other sightings in Independence","There were 3 other sightings in Independence on or around October 4th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.04049,+-94.365364(32355)&iwloc=A&hl=en\"> mufon case (32355) map </A>","Case Number":"32355","Source":"MUFON","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/32355.html.txt","/var/www/straped/mufon/more/32355_submitter_file1__UFO.10.4.11.jpg","/var/www/straped/mufon/more/32355_submitter_file2__UFOSKETCH.10.4.11.jpg","/var/www/straped/mufon/org/32355.html"],"Object Flight Path":"Hovering then path","City":"Independence","Viewing Distance":"101-500 Feet","Latitude":"39.04049","Date Submitted":"10/05/2011 12:37 UTC","Disposition":"Unknown","Tags":"City","Object Shape":"Boomerang, Sphere","Region":"Missouri","divs":["sighting detailsthis is nuts, i saw a ufo when i was 14 w\\my mom a long time ago in the distance but tonight was nothing like that. this was the craziest thing i have ever seen, i was soo close to it, i can't believe it. i was driving down interstate i-70 westbound came up to the 291hwy intersection that was backed up due to an accident on 291hwy south. i look up and saw this huge giant object beaming with white bright white lights all over it hovering in midair right above the i-70 and 291hwy intersection. it was hovering about 500ft. above the highway, i pulled the car over and watched it just hovering. i rolled the windows down to hear it but no noise whatsoever came from it. total silence just the cars passing by. i was freaking out and yelling i could not believe my eyes what i was seeing. my family was with me and we were all freaking out. within about 2-3min of hovering it turned south and started at a straight path going south, i tried to take pics but my camera on my phone couldn't pick it up enough. i saw the rear of the craft and it was huge. the back had 3 separate box shaped glowing lights that looked as though they were spreading apart. it headed along 291hwy south but was more flying over the cliffs homes area direction. 291hwy south was closed off by police due to the wreck so i couldn't follow it but i did head down 40hwy west off of 291hwy and then went south on lees summit rd but did not see it due to soo much traffic backup and trees. the shape was like a small pyramid, dome ontop but covered in bright white lights, lots of them, then as it turned i saw the bottom of it and the side. the bottom view was a v shape with a few lights also had blinking blue lights near the bottom of the craft. but the bottom view was total v shape no doubt about it. then as i saw it from the rear, i could only see 3 bright white square shapes in a row but not straight in a row, all 3 rear square lights were in different angles. this has changed my life going forward. i have never seen anything like this nor have been as close to one. i mean this thing was hovering right outside the car window above me at a 45degree angle in front of me. just pure crazy.... amazing! i never thought i would see one again in my life. the pic i have attached was taken with my cell phone but for some reason i dont know why does not look like what i saw. but i figured i might was well attach it. better than nothing."],"Date of the Event":"10/04/2011 08:10 UTC","Weather Factors":"None","Sighting Duration":"Undisclosed","Longitude":"-94.365364","Log Number":"US-10052011-0003","Summary":"CRAZIEST THING I HAVE EVER SEEN, THIS IS REAL!!","Country":"United States"}