{"Disposition":"Insufficient Data","Region":"Idaho","Longitude":"-116.602557","Date Submitted":"10/05/2011 04:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.597679,+-116.602557(32358)&iwloc=A&hl=en\"> mufon case (32358) map </A>","Object Features":"Dome","Object Shape":"Sphere","Log Number":"US-10052011-0006","divs":["Sighting Detailsoblect hovered obout 20ft, in the air the size of about, maybe half the size of a football feild. disc shaped a dull silverish metal color I observed the craft for about 45min or longer no visibal rivits or seams in the craft in the belt area of the craft i observed what appeared to be tares of light which reminded me of differnt colored socks you might see tumbling in a dryer the red tare looked to be 10ft long by 4ft wide. the blue tare tumbling randumly or maybe in unisin with the red, was id say 8ft long by maybe 6ft wide. the yellow tare of light looked to be maybe 12 ft long by 3ft wide. the green tare of light looked to be 6ft long by 4ft wide there was no sound from the craft and there was no sound from the frogs or crickets that struck me as odd, the bottom of the craft was a very bright white light that did not reflect onto the blacktop. the dome of the craft when I looked at it looked to be transparant just like the middle or better yet the center line of the craft then it moved just slightly to the left, the craft left no telltail sighns I looked around and it was a good 2blks away from me at that time wich looked to be hiding behind two vary large oak tree,s and an old out door theater wich only covered up maybe one third of the craft for about 5min then shot strait up it seemed to take only 15sec to exit our atmosphear I could still make out the colors. I know that stars are bright pin points of light and not red,green,blue,yellow lights in the night sky. the craft apeared to imitate the distance of a star when the craft took off from it,s hover mode there was no sonic boom no noise nothing the image of the craft was burned into my mind for a very long time this happened in 1977 behind the karcher mall in nampa Idaho at 3am my then wife and I are the only witness to this event my wife did not run outside to get a better look at like I did. allthough I have suspected for a long time that this in fact our technoligy that we have improved on from the old nazi prototyps of world war2 the hanaboos with the thechnology of today our military tec is 50yr.s ahead of the privite sector or maybe a secret socity is developing this technoligy to what end maybe for the nepflem to make an entrance on 2012 dec 21st is my guess huh.. well I feel like a great weight has been lifted......"],"Country":"United States","Latitude":"43.597679","files":["/var/www/straped/mufon/html2text/32358.html.txt","/var/www/straped/mufon/org/32358.html"],"Tags":"City","Source":"MUFON","Date of the Event":"06/20/1977 03:00 UTC","Object Flight Path":"Hovering then path,Straight-line path","Viewing Distance":"20 Feet or Less","trends":["There have been 15 other sightings in Nampa","There were no other sightings in Nampa on or around June 20th 1977"],"Case Number":"32358","Weather Factors":"Unknown","Summary":"disk craft about the size of a football feild.","City":"Nampa","Sighting Duration":"Undisclosed"}