{"Summary":"UFO flying over busy I-70 interstate for a long time.","Object Features":"Unknown","trends":["There have been 67 other sightings in Independence","There were 3 other sightings in Independence on or around October 4th 2011","This sighting has never been favorited.",""],"Latitude":"39.092516","Date of the Event":"10/04/2011 08:15 UTC","Region":"Missouri","Case Number":"32350","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Boomerang, Oval, Triangle","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=39.092516,+-94.410427(32350)&iwloc=A&hl=en\"> mufon case (32350) map </A>","files":["/var/www/straped/mufon/html2text/32350.html.txt","/var/www/straped/mufon/more/32350_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/32350_submitter_file2__ufo1.jpg","/var/www/straped/mufon/org/32350.html"],"Source":"MUFON","Log Number":"US-10042011-0024","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"10/04/2011 11:19 UTC","Country":"United States","divs":["Sighting DetailsDriving along I-70EB in Independence,Missouri, headed home after a quick run to the store, my husband and I, with our two kids in the backseat all saw strange lights headed towards us over the highway. The closer we got, we realized the object was just hovering very low over the cars moving extremely slow. There were hundreds of huge, extremely bright lights completely covering the front of the craft. These lights were almost blinding, and resembled stadium lights. We pulled over to try and take pictures with my phone, only two came out somewhat okay. Traffic was slowing and two ramps next to us were shut down due to a wreck we believe. Many were in the area and had to of seen it along side us. As we were trying to take pictures out of the window, the craft was over our car and began to turn south, no sound whatsoever was coming from it, dead silence other than the passing cars on the highway. The underneath and back of the craft didn't have as many lights as the front head on. It was gigantic,the front seemed rounded then boomerang or arc shaped as it turned(Not sure if it changed shape, but for sure two different shapes compared with head on to the back side of it) it took off a little bit faster, but still at fairly low speed(compared with airliners or even stealth bombers which would both be very loud, this again, was silent) After it turned away, my husband thought it broke into three separate pieces, I thought it was just so big, it expanded and the three brightest lights appeared to be separate. We tried to follow the path, but with traffic backed up, we eventually lost sight after a 45 minute drive. Definitely not something either of us have seen, tried to stay calm not to frighten our two little ones in the back. Would love an explanation."],"Longitude":"-94.410427","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","City":"Independence"}