{"Case Number":"32352","Tags":"City","Latitude":"32.394974","Log Number":"US-10042011-0026","Source":"MUFON","Date Submitted":"10/04/2011 11:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.394974,+-90.148415(32352)&iwloc=A&hl=en\"> mufon case (32352) map </A>","Object Shape":"Circle, Sphere, Other","City":"Jackson","Country":"United States","trends":["There have been 9 other sightings in Jackson","There were no other sightings in Jackson on or around October 4th 2011"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-90.148415","Object Flight Path":"Path with directional change,Other","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/32352.html.txt","/var/www/straped/mufon/org/32352.html"],"Object Features":"Appendage(s)","Summary":"2 circular solid white balls decend from behind half moon, circle clockwise & counterclockwise around moon then go behind & front of moon. Something drops down from each ball shape then retracks & they go off in the sky.","Weather Factors":"Unknown","Region":"Mississippi","Date of the Event":"10/04/2011 04:45 UTC","divs":["Sighting DetailsWas laying in back of our motorhome watching the sky surprised that the half moon was out at only 4 p m. Noticed the sky was compleatly cloud free from the horizon for as far as I could see in 3 directions. We were traveling E. on I40 just N. of Jackson, Mississippi & I kept looking at the moon on the N. side of our rig & watching how it went from one side of the picture window to the other. Thinking how the road really wasn't straight & trying to find it again when it was hidden by trees occasionally. All of a sudden I thought I saw 2 white balloons come down from behind the moon, one following the other. They went halfway back up, then to the left & I thought the wind was blowing the balloons around. Since the change in direction was kinda jerky & abrupt, I sat up to take a better look. That's when I noticed they weren't balloons but UFO's that seemed to be playing a game of \"catch me if you can.\" They would go in a direction one following the other till the back one caught up, then they would turn around & the front one would kinda chase the other. They did this going both clockwise & counterclockwise over & under the moon. I thought these things were not as far away as the moon but then they proceeded to go around the moon in the same direction the Equater goes around the Earth. They would disappear behind the moon & then come back in front from the other side. After awhile they just went in every direction darting around & going behind clouds & coming out again. This was very odd to me because there were no clouds visible in the sky, on taking a better look the \"clouds\" they were going behind were more brown than cloud color. They went away completely & then came back, came towards the RV (still far up) & had something hanging from the bottom of both. Reminded me of the shape of hot air balloons now & while trying to get a better look they went back to their origonal shape, darted around a couple times & disappeared. I'm very curious as to if anyone else saw them, I kept telling my husband to look but he was driving & couldn't even see the moon! He takess his driving VERY seriously, pulls off the road for cell phone calls so I know he wouldn't try hard to see a UFO."]}