{"Summary":"Strange aircraft seen in sky followed by a large starlike object which followed us","Region":"Tennessee","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Longitude":"-82.828166","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Latitude":"36.164207","files":["/var/www/straped/mufon/html2text/32351.html.txt","/var/www/straped/mufon/org/32351.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.164207,+-82.828166(32351)&iwloc=A&hl=en\"> mufon case (32351) map </A>","divs":["Sighting DetailsI went out front of our home to smoke a cigarette, as I do not smoke inside. It was about 9 pm. I looked in the sky in front of me towards town, and there was a bright red pulsating light. I called my children outside because two nights prior we saw something similar in the sky while driving and it flew at low altitude over the highway. It was so strange that we turned around to look again to find out what it was but it had quickly disappeared over the tree line. My son came out first he is 15, and I asked him if that was what we saw the other night. He said yes, then my daughter came out and began to make fun of us because she did not believe in UFO's she is 16. The object hovered there for about three or four minutes, then moved toward our home. As the object moved closer over the house we began to see that there were lights at each corner of the aircraft and a red pulsating light in the middle. We continued to watch as it slowly flew silently over the house toward the mountains. We watched it until it was over the mountains and it hovered there for about five minutes as we were watching this aircraft we noticed that there were three more similar objects that were flying in the same direction as that one. Then one came back and flew over our house again. We watched as it flew back toward town. Then we looked to the right and over the tree was a very large bright looking star thing. I had never seen something so large in the sky that looked like this. It definitely was not a star. I told the children to get my keys because I wanted to get a closer look at the star thing because it was so strange and it did not look like a solid object. As we drove right the star thing was to our left. We pulled out about a quarter mile away and the star thing moved above the field across the road. I turned left and it seemed as though it followed our car. I got scared and decided to turn around and go down the highway to get away from there but it continued to follow us several miles down the road. I got scared and called my husband on the phone. My children were freaking out, so I turned around again and drove back to town where it was populated. As I drove into the shopping center parking lot it was still there along side us above the grocery store. Then we saw a helicopter go back and fly over our house at a low altitude. I decided to go back home. As I pulled in the driveway and turned back around it was in the same spot as before we left only a little higher and dimmer. I called the neighbor over because I just could not believe what just happened. I told him to get into the car and drive with me to see what we just saw. The star thing followed us again. As we drove down the highway we saw ambulances, fire engines, and police cars sitting in the back of a cemetary with lights flashing. We did not know what was going on. We could not explain what was happening and the neighbor got freaked out. We went back to the house and my husband had come home. So I told the neighbor to stay at the house while we drove the same path to see if he could see it follow my husband and me. It sure did follow us except when we called the neighbor on the cell he said it had not moved. This was impossible because it followed along side of us several miles down the road in the opposite direction. When we came back another triangle aircraft was hovering off in the distance. We decided to come inside because we were frightened. I got on here and decided to report this activity. This is something that we have never experienced before. I am afraid to look outside to see if anything else is going on, and our children are going to sleep on our floor tonight."],"trends":["There have been 9 other sightings in Greeneville","There were no other sightings in Greeneville on or around October 4th 2011"],"Object Shape":"Sphere, Triangle","Sighting Duration":"Undisclosed","Date of the Event":"10/04/2011 09:00 UTC","Country":"United States","Case Number":"32351","Date Submitted":"10/04/2011 11:42 UTC","Object Features":"Undisclosed","Log Number":"US-10042011-0025","Disposition":"Unknown","City":"Greeneville"}