{"Longitude":"-82.955075","Country":"United States","Source":"MUFON","Latitude":"42.485694","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","divs":["Sighting DetailsStepped outside to let dogs go to bathroom at 8:00 PM Eastern Standard Time. Very Clear Starry Night, with Half Moon in the South, 30 Degrees off horizon. I happened to look up, and spotted a fireball with a prominent tail come streaking in from space at 60 degrees above the horizon, traveling from East South East to West North West. The fireball was quite large and pronounced, with a large tail indicating falling debris melting off from re-entry, and was a bright white color like phosphorous. The size was about dime sized as held at arms length, or 50% of the size of the half moon. I must emphasize that I am familiar with judging mass and size of objects dropping to the ground from space. This object HAD to be massive, and it remained illuminted all the way to the ground as well, while most meteors or meteorites extinguish after passing half way through our atmosphere. It is extremely rare for an object to survive reentry unless it has a LOT of mass to burn off of it. This object MAY have been the German Roentgen Satellite (ROSAT) falling to Earth after reentry. It was estimated it would fall back to Earth in late October or early November of 2011, BUT, that was just an estimate, and its reentry orbital path was supposed to take it to 53 degrees North and South Latitude when its orbit decayed and it fell into the gravity well, well within the bounds of southern Michigan. The duration of the siting was only two to two and one half seconds, but BOY, what a view! This event reminded me of Space Shuttle debris reentry as shown on video."],"Date Submitted":"10/05/2011 12:18 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.485694,+-82.955075(32354)&iwloc=A&hl=en\"> mufon case (32354) map </A>","City":"Roseville","Weather Factors":"Unknown","Case Number":"32354","Viewing Distance":"Unknown","Object Shape":"Fireball, Flash, Teardrop","trends":["There have been 14 other sightings in Roseville","There were no other sightings in Roseville on or around October 4th 2011"],"Object Features":"None, Unknown","Summary":"Fall Of Object From Space - Maybe Large Space Debris Or ROSAT Satellite","Disposition":"IFO","Log Number":"US-10052011-0002","Region":"Michigan","files":["/var/www/straped/mufon/html2text/32354.html.txt","/var/www/straped/mufon/org/32354.html"],"Date of the Event":"10/04/2011 08:05 UTC"}