{"Summary":"UFO seen over University Avenue and Chicot Road area in Little Rock.","Country":"United States","Date Submitted":"10/05/2011 12:38 UTC","Disposition":"Insufficient Data","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.20715,+-91.826833(32367)&iwloc=A&hl=en\"> mufon case (32367) map </A>","Tags":"City","Latitude":"35.20715","files":["/var/www/straped/mufon/html2text/32367.html.txt","/var/www/straped/mufon/org/32367.html"],"Region":"Arkansas","trends":[],"Viewing Distance":"Over 1 Mile, Unknown","Case Number":"32367","Weather Factors":"Unknown","Date of the Event":"10/05/2011 06:40 UTC","Object Shape":"Cigar, Other","City":"Undisclosed","Log Number":"US-10052011-0013","divs":["Sighting DetailsI was driving to my classes headed from Benton towards Little Rock. It was still pretty dark outside. As I passed the Chicot Road Exit sign, at about 6:40am, I noticed a plane headed towards an oddly shaped craft in the sky. I first thought this was just another plane that I was viewing from the front instead of from the side like I was the other plane. As I watched, I noticed the craft had two lights, and the lights were very bright on this other craft and weren't blinking like the ones on the plane near it. From my perspective it looked cigar shaped, and I got the impression it was a saucer. The craft's two very bright lights stayed on the whole time I saw it. The plane seemed to be turning away from the object after a moment and was joined by another plane that I didn't see earlier as it was behind the treeline. The planes looked like they were descending beneath where the craft was. I don't know how far away the object actually was from the planes, but I do believe that it was pretty close to them. I then noticed that the craft disappeared from my view for a second, then reappeared, turned itself from a horizontal hovering position to a vertical position, and it shifted backwards in the sky like it was backing up. It backed up very quickly and so far, that it appeared to get smaller. After this it descended behind the treeline and disappeared from my view. I drove in the direction I thought it had gone but could not relocate it. I don't know where it went and I am having a hard time finding other witnesses as I was in my car. I did however look into the other cars when I initially saw this happen and the other drivers did seem to be seeing what I was also seeing."],"Longitude":"-91.826833","Object Flight Path":"Path with directional change,Path then hovering,Other","Source":"MUFON","Sighting Duration":"00:01:30"}