{"files":["/var/www/straped/mufon/html2text/3237.html.txt","/var/www/straped/mufon/org/3237.html"],"Case Number":"3237","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Sierra Vista","There were no other sightings in Sierra Vista on or around June 22nd 2005"],"Source":"MUFON","Country":"United States","Tags":"City","divs":["Sighting Detailsat 11pm last night, i had to take my dog outside. while we were walking around my apt complex, i looked up in the sky for i do like to do a little star gazing when i am out that late. But what i saw wasnt any star at all. As i looked oover towards the mountains, that are so prevelent here, and are close to the Ft Hucachuca military base, I noticed some green, red and blue lights traveling around in no particular order. I thought that maybe it was a plane coming in for landing at the military base, but it wasnt doing such a thing. I guess the best way that i could descrbie it is like a ball of fire but with different colors, and the colors were changing constantly from red, green, blue . it kind of shocked me, cuz it was something that i have never seeen before, so i just stood there watching these obljects. I wanted to go around the apt bld and get my camera but i was just frozen there just watching it. One of the color balls, headed towards me, and as it came closer, it was high in the sky, but there was no noise and it was traveling at a very low speed. at one point i thought and felt like i could just reach out and touch it, but it was a little high up. Around this time, it was above me, but was around tree height. My dog was starting to growl but she didnt bark. she was just as stunned as i was. I saw this colored ball stop, and then it turned around slowly and headed back to where the others were and then they just shot up in the air. I didnt feel scared, just kind of trying to believe what i was seeing. I have heard rumors around town, that there are some really strange aircraft flying into the base at night, and things that one doesnt want to see. so i am really not too what i saw, but i know that i have never seen anything like it. I am a little startled now that i have thought about it, and i dont want people to think i am off my rocker, but i know what i saw. When i came back in the house, i just kind of sat down in my chair, trying to make sense of the sighting. It did take me a while to calm down, and go to bed. But now that i think about it, my dog growled for a long time after that, and she was staying right near me, the whole night. This morning, when i went ot take her outside both her and i were a little hestiate cuz i really wasnt sure if it was still out there or not. BUt it wasnt."],"Date Submitted":"06/22/2005 11:00 UTC","Object Features":"Unknown","City":"Sierra Vista","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary,Hovering then path,Other","Longitude":"-110.330097","Disposition":"Unknown","Weather Factors":"Windy","Summary":"Thre were some bright lights up in the sky around 11pm at night.","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=31.591504,+-110.330097(3237)&iwloc=A&hl=en\"> mufon case (3237) map </A>","Log Number":"US-06232005-0004","Region":"Arizona","Latitude":"31.591504","Date of the Event":"06/22/2005 11:00 UTC"}