{"Longitude":"-94.571427","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/32376.html.txt","/var/www/straped/mufon/org/32376.html"],"Region":"Missouri","Viewing Distance":"501 Feet - 1 Mile","Summary":"Kansas City/Raytown/Independence MO UFO Sighting","Tags":"City","Date Submitted":"10/05/2011 04:44 UTC","Country":"United States","City":"Kansas City","Weather Factors":"Unknown","divs":["sighting detailsi was driving from the umkc campus after my night class at 8:10-8:15 on emanuel cleaver blvd along brush creek. i had just past gates bbq at the paseo headed north\\east towards raytown. i saw about a 1-2 miles away a v shaped aircraft with several orange lights very close to the tree line. they were not blinking. it did not appear to move like a normal airplane, it hovered. i first thought it was a large jumbo jet making an emergency landing in the location of 350 highway near 435. but the distance from where i was to where the object was made it too big to be a commercial plane. i continued to drive north\\east on emanuel cleaver hoping i'd see it closer but i lost sight of it in the trees once i passed 71 highway. i used to live near whiteman afb when i was in college and would see b2 bombers and other military planes, this was nothing like i'm used to. it was too big. when i got home my fiance told me he had seen something odd in the sky in independence where we live. he was on 39th street near the independence center. he saw the aircraft hovering in the sky around 7:40-7:50 over 470\\291 towards the bass pro shopping area (west direction). he said it was v-shaped with and had lots of blinking lights. he thought it was a plane but it moved too slow and circled around to much. he said at one point it went vertical and hovered then broke into three parts. it kind of freaked me out that he saw the exact same object and told me about it before i said anything to him about what i had seen. that just struck us both as odd and not normal. hence why i'm submitting this report. i've seen other reports through mufon on a blog and those reports are similar to ours. i would definately like to know if the military is testing an object over civilian areas without informing us or if this really is what i believe it is."],"Date of the Event":"10/04/2011 08:10 UTC","Log Number":"US-10052011-0022","Latitude":"39.105856","Case Number":"32376","Object Features":"Undisclosed","Object Shape":"Boomerang, Diamond","map":"<A HREF = \"http://maps.google.com/maps?q=39.105856,+-94.571427(32376)&iwloc=A&hl=en\"> mufon case (32376) map </A>","trends":["There have been 134 other sightings in Kansas City","There were 9 other sightings in Kansas City on or around October 4th 2011"],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Sighting Duration":"Undisclosed"}