{"Longitude":"-85.574662","trends":["There have been 4 other sightings in Portage","There were no other sightings in Portage on or around August 31st 2011"],"Disposition":"Unknown","Weather Factors":"Unknown","Object Shape":"Chevron, Circle, Star-like","Latitude":"42.230193","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.230193,+-85.574662(32370)&iwloc=A&hl=en\"> mufon case (32370) map </A>","Date Submitted":"10/05/2011 02:08 UTC","files":["/var/www/straped/mufon/html2text/32370.html.txt","/var/www/straped/mufon/org/32370.html"],"Region":"Michigan","Viewing Distance":"Unknown","Log Number":"US-10052011-0016","Tags":"City","divs":["Sighting DetailsI was standing outside, in my backyard taking on the phone when I noticed a very bright white circle flying over my house. The object was flying Southeast. It was approximately 500 feet high. I ended my phone call to try to make sense of what I was witnessing. There was no sound coming from the object, it was very bright, and was not blinking at all. I watched it as it flew off in the distance, then it stopped moving for a couple of seconds, then it disappeared. Amazed by what I just saw, I went inside and told my wife. She thought I was making it up, but I got her to come outside to see if we could see any more. About ten minutes later we saw a chevron shaped aircraft flying over my neighbors house. It had at least 5 white blinking lights on the back, and on red blinking light in the front. Underneath there were three very large, distinct, triangle shaped lights that did not blink. The best way I can describe the lights on the underside of the aircraft is to compare them to dome lights in a car. This aircraft did not make any sound, and was flying in a strait line from West to East. We watched the aircraft fly towards the East until it was too far to see. After that we decided to stay outside and sit in the hammock and stare at the sky. It wasn't long before we noticed objects moving in the sky in the far distance. There were lights moving from one end of the sky to the other. These were very high up in the sky, miles away. If I didn't know better, I would have thought they were shooting stars, but they were not as fast as shooting stars. We saw about 3 of these lights moving around. One of them flew across the sky and then lit up about 10x brighter for about 2 seconds, then I knew for certain they were not shooting stars. After watching that for about 4 minutes, we lost track of them. Then maybe 10 minutes later, another chevron shaped aircraft, identical to the first, flew the exact same flight path of the one the flew over my neighbors' house about 20 minutes before. We didn't see any more after that one flew away in the distance. I know it sounds crazy, but that is what I saw."],"Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"32370","Object Features":"Undisclosed","City":"Portage","Date of the Event":"08/31/2011 09:20 UTC","Summary":"Extremely bright white circle in the sky, flew overhead, then hovered and disappeared.","Object Flight Path":"Straight-line path,Path then hovering"}