{"Object Features":"Undisclosed","Case Number":"32373","Object Shape":"Boomerang, Triangle, Unknown","Date of the Event":"10/04/2011 07:50 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-91.823943","trends":[],"divs":["Sighting DetailsWas driving North on Todd George Road approaching 350 Hwy in Lee's Summit at approximately 7:50PM (best guess on my part, did not look at my clock). Saw out of my windshield what I thought was a large airplane with numerous lights (did not count how many, but best guess is 6 large blinking lights, with smaller non blinking lights in between...perhaps a total of 12) flying extremely low and without much speed. Very first thought (because of the size and how low it was) that perhaps a commercial jet was attempting some kind of emergency landing (quickly ruled that out). Next thought was that it was perhaps a few different smaller aircraft flying in formation, perhaps practicing at night for an airshow or flyby of Arrowhead Stadium (quickly ruled that out as well because of speed, appeared to be almost hovering, or simply going extremely slow). At that point, because of the speed, I assumed it must be helicopters; ruled that out because of how close they would have to be flying to one another, and the fact that I could not hear any noise whatsoever. Furthermore, at this point it was close enough that it seemed to be one solid object (although I freely admit my mind could have been playing tricks on me). The object was coming in from the North, flying South...again, extremely slow, and blatantly obvious, I don't see how it could have been missed by anyone that happened to be outside or driving at that time. The object then turned West and appeared (to me anyways) to break up into three separate pieces for a few moments, then join back together. I am typically a very skeptical person by nature. From a rational standpoint my assumption is not that this was any kind of extraterrestrial craft coming to visit the Kansas City area, but rather one of two things: 1. Either this was a group of (somehow silent) helicopters, with absolutely the most insane pilots on the face of the earth for deciding to fly and maneuver as close as possible to one another. Or... 2. This was some kind of experimental aircraft, convincing me that the U.S. military has developed what I would consider the coolest and most awe inspiring aircraft in their fleet yet (blows the stealth out of the water). Regardless, whatever it was, I could not identify, and felt intrigued enough to think about it all night long, and find a place on the web where I could report it this afternoon(and read other individuals descriptions as well)."],"files":["/var/www/straped/mufon/html2text/32373.html.txt","/var/www/straped/mufon/org/32373.html"],"City":"Undisclosed","Disposition":"IFO","Date Submitted":"10/05/2011 03:06 UTC","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Summary":"Very intriguing unidentified flying object (perhaps objects)","Log Number":"US-10052011-0019","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.974033,+-91.823943(32373)&iwloc=A&hl=en\"> mufon case (32373) map </A>","Latitude":"37.974033","Viewing Distance":"501 Feet - 1 Mile","Region":"Missouri","Country":"United States"}