{"Weather Factors":"Unknown","Disposition":"Unknown","trends":["There have been 2 other sightings in Papillion","There were no other sightings in Papillion on or around November 3rd 2010"],"Date of the Event":"11/03/2010 03:30 UTC","Object Features":"Dome","Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32384.html.txt","/var/www/straped/mufon/org/32384.html"],"Country":"United States","Sighting Duration":"Undisclosed","City":"Papillion","Log Number":"US-10052011-0030","Region":"Nebraska","map":"<A HREF = \"http://maps.google.com/maps?q=41.161753,+-96.040918(32384)&iwloc=A&hl=en\"> mufon case (32384) map </A>","Object Shape":"Teardrop","Summary":"I was driving south, when I spotted a strange object in the sky. It flew south--south-west before disappearing.","divs":["Sighting DetailsI was about a mile south of Cornhusker Road, headed south bound on 72nd, in the town of Papillion, NE. I was headed to the grocery store at the time. I first noticed the object because it was very clear out, not a cloud in the sky. This object was the only thing I could see. When I first saw it I thought it was an airplane or a jet of some kind. There is not only an airport nearby, but an air force base, so seeing objects in the sky is in no way unusual. This was not one of the usual objects, easily identifiable as planes or jets. At first the object looked translucent, but definitely solid. It was completely smooth, and roughly the shape of a lemon. The more I looked at it, the more it looked like it has a shiny, polished surface, like a mirror finish. There were no visible lights, markings, or breaks in the surface. It looked large, but not much larger than what a fighter jet would look like, but I have no way of knowing how far away it actually was. It was moving when I first saw it, heading swiftly in a straight line towards the south-south-west. It continued in this direction for a minute or two, until it vanished from my sight. It didn't go beyond the horizon, it just sort of vanished. When I realized it was something unfamiliar, at first I felt a little curious, then excited. It's something I've always found fascinating, but never assumed I would ever see something like it."],"Tags":"City","Case Number":"32384","Latitude":"41.161753","Date Submitted":"10/05/2011 09:32 UTC","Longitude":"-96.040918","Viewing Distance":"Over One Mile"}