{"Date of the Event":"10/25/1983 02:10 UTC","Object Shape":"Cigar, Cylinder","Sighting Duration":"Undisclosed","City":"Newbury","Latitude":"41.469999","Object Features":"Unknown","Date Submitted":"10/06/2011 12:13 UTC","trends":["There have been 3 other sightings in Newbury","There were no other sightings in Newbury on or around October 25th 1983"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Disposition":"Unresolved","Country":"United States","Source":"MUFON","Case Number":"32386","files":["/var/www/straped/mufon/html2text/32386.html.txt","/var/www/straped/mufon/org/32386.html"],"divs":["Sighting DetailsReporting again because of the 9-24-11 report in Newbury as observed from Church during bingo. The road or address where I saw my UFO and was paced by it was Pekin road, which is just one block north of the church. My report has been filed on Mufon before. There have been four other sightings along that road since 1983 that I have verified. Probably many others. Thought this would be significant since the other observation was so close to the one I had in 83', to wit, I was exiting a driveway onto Pekin road, heading east, when a row of six red, white and green lights rose above the tree line to the east about 200 feet from me any hovered. No sound as the light sequentially traveled left to right, as along a blimp ad. Used my index finger for size comparison, row of lights was the length of it. When I turned toward them, they moved towards the road ahead and passed over me. Then there is a blank spot where I'm trying to figure out why the blimp was out here at 2AM, when, after driving another mile down the road, it comes back from my left and hovers over the next intersection. This is where I become very frightened, turn right and speed down Sperry road, saying over and over, \"not tonight\". As I drove, the lights paced my car about 150 feet to my right at about 40 feet off the ground over a field. I drove as fast as possible and lost them after a mile or so. When I traveled another two miles to the main road, Mayfield, I got out and looked back, where I could still see it hovering and blinking at tree top level, about a mile or so back. I don't' know if I was abducted, as that blank spot where I saw it over the car to where I was questioning what I had seen has never been resolved."],"Weather Factors":"Unknown","Longitude":"-81.239488","Tags":"City","Region":"Ohio","Viewing Distance":"101-500 Feet","Summary":"Hovering row of lights crosses road, changes direction and paces car","Log Number":"US-10062011-0001","map":"<A HREF = \"http://maps.google.com/maps?q=41.469999,+-81.239488(32386)&iwloc=A&hl=en\"> mufon case (32386) map </A>"}