{"divs":["sighting detailsi was around 10 to 12 years old, but the image is still vivid in my mind. it was around 9 or 10pm i think, i am also not sure of the month or year, but it was completely dark and could not of been after 11pm at night. i believe it was during the school winter holidays or on the weekend due to how late i was up that night. i also kept having strange dreams after i saw the object. this was not the first time i saw a ufo, but it was the most spetacular. it was huge. it seemed to cover almost the whole sky. it looked light a search light, but with a solid surface where you couldn't see the stars. it also seemed to have a hazy light around it. seeing this image seems very important, but i am not sure why. recently i have been having strange ideas. it is like my mind is trying to figure something out, but i'm not sure what. it has to do with math, science and energy. ....- ....- .._\\ .._\\ -\\-\\..-\\ beat, beat, beat, beat, string beat beat beat beat string beat beat string up, beat beat string up string down, string down, beat, beat, long string beat down this is just part of what i see. it seems jumbled. music, art, science, math spiral-strings be composites radiation pyramids monoliths jupiter pluto-charon-venus mars ** electric mercury tin ?gold *** silver volcanic ? water hydrolics (but not water) string theory atoms ?motion theory triangle-5 sided pyramid with curved sides up celtic-egyption-mayan-koorie-aztec-inca-others stonehenge-ayers rock-pyramids-stone mountain-others curves-spirals-hexagons-pentagons-triangles 7 5 6 2 12 parrallels not sure what else, have to sleep on it. just had to get this off my chest. not sure what it means. string theory-circles-waves- 2 2 9 7 3 3 4 there is more, but not sure about it."],"trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around December 15th 1975"],"Disposition":"Unresolved","Object Shape":"Circle","Date Submitted":"10/05/2011 09:08 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Longitude":"-84.380702","Log Number":"US-10052011-0028","Date of the Event":"12/15/1975 12:00 UTC","Summary":"I was around 10 to 12 years old, but it was huge. Like a search light except not see through.","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Other","Sighting Duration":"Undisclosed","City":"Atlanta","Tags":"City","Latitude":"33.754405","Case Number":"32382","Country":"United States","Region":"Georgia","files":["/var/www/straped/mufon/html2text/32382.html.txt","/var/www/straped/mufon/org/32382.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.754405,+-84.380702(32382)&iwloc=A&hl=en\"> mufon case (32382) map </A>"}