{"Country":"United States","Date of the Event":"10/02/2011 10:15 UTC","Case Number":"32381","City":"Charlotte","Weather Factors":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32381.html.txt","/var/www/straped/mufon/org/32381.html"],"Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=35.366489,+-80.741846(32381)&iwloc=A&hl=en\"> mufon case (32381) map </A>","divs":["Sighting DetailsI was driving home Sunday night down I-85 and stopped at a gas station to use the restroom and get a drink. After my purchase, I walked out of the store and just happened to look up in the sky. I'm not entirely sure what compelled me to look up at that moment, however I must admit I tend to look up and enjoy the stars frequently. As I looked up I noticed a rather large ball of orange light. At first glance it looked similar to a night time rocket launch, but upon looking further I realized the object was far too large to be a rocket, and looked nearly perfectly spherical. As I looked at this object, I noted it had no beacon lights whatsoever and no visible fuselage. It was as bright, if not brighter than the Moon and I felt like with the luminosity it carried it should have reflected any material that would make up an aircraft or bodywork. The orb itself was an Amber color, lighter in color and brighter at the center and more orange around the edges; although I should point out there were no visible 'edges' to be seen, it was diffuse around the circumference. This object was going very slowly across the sky at what my best estimate is East to West in what I could tell was a straight path. It's difficult to gauge, but I would say this object had an altitude of approximately 1000ft, and was certainly within our atmosphere. When I had first noticed it, the orb was slightly to my left maybe 30 degrees, and I had anticipated some sort of sound as it drew closer, however throughout the whole observation there was absolutely no noise emitted at all. The object continued on it's path (still slowly) until it got about 40-45 degrees to my right, where it seemed to arc to it's left (away from me) and a few seconds after that it dissipated and disappeared. I had anticipated watching it until it went over the horizon or behind trees, however the dissipation made a strange event even stranger. It contracted a bit from the outside edges inward, and then dissolved until it was just the black sky left. The duration of the dissipation was about 2-3 seconds, and the entire duration of the observation was nearly 5 minutes long. At one point a guy leaving the gas station had seen me staring up into the sky mesmerized, and looked up too. After a second he turned to me and asked \"What is that? ...some sort of airplane or something?\" to which I replied \"It certainly doesn't look like any aircraft I have ever seen.\" He grew visibly uncomfortable, got into his car and quickly left. A few additional notes to consider which may be helpful are the visual effects I experienced while observing this object. While it was as bright as the moon, fairly bright for the night sky, it wasn't blinding. However when I closed my eyes I could still see the glow, as if I had been looking into something very bright. Also while looking directly at it, it seemed to be a solid ball of light, however when viewed through my peripheral sight it was pulsing similar to an old tube computer monitor. I would estimate around 60hz or so. At one point I attempted to phone my girlfriend to explain to her what I was witnessing, but my cell had no reception or bars, which could be incidental but I generally get good reception in Charlotte and I did find it odd my phone wouldn't even dial out. I don't claim to be an expert, but I do have quite a bit of knowledge in regards to Aircraft and Helicopters both Military and Civilian, and this object did not fit the paradigm of anything I am aware of. In fact, the whole reason I have submitted this report is because of how strange of an incident this entire situation was. I never felt upset, frightened or perturbed in any way, however I must say I am very, very intrigued as to what this could have been. I hope this helps and would love to know if anyone else witnessed this event."],"Log Number":"US-10052011-0027","Latitude":"35.366489","Date Submitted":"10/05/2011 07:28 UTC","Region":"North Carolina","Object Features":"None","Tags":"City","Longitude":"-80.741846","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around October 2nd 2011"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Summary":"Orange Orb flies slowly over Charlotte","Viewing Distance":"501 Feet - 1 Mile"}