{"Region":"Pennsylvania","Summary":"Very fast moving LARGE object in the sky","City":"Carbondale","Date of the Event":"10/05/2011 07:40 UTC","Longitude":"-75.543093","Date Submitted":"10/06/2011 07:41 UTC","Tags":"City","Object Flight Path":"Path then hovering","Object Features":"Unknown","divs":["sighting detailsi was out walking my dogs at 1940 est on 10\\5\\2011. shortly after taking them out, i noticed a very fast moving group of lights that came over the trees near my house. these lights appeared to be very high in the sky. i went into my home to grab a set of binoculars and returned outside to try to see more. the lights which were travelling in a long pattern for me to see had already travelled 15-20 degrees in the short period of time it took me to get my bino's. i was having a hard time seeing the object, mainly because of the speed it appeared to be travelling. from the time i took my bino's down to see where the lights were and put my bino's back to my eyes, it was further ahead in it's flight path. when i did manage to get a glimpse of it, it appeared to be very large, randomly flashing red and white lights in a crescent shape and had no noticable sound. about halfway through the total time that i saw the object, i noticed another set of lights come from over the trees, appearing to be trying to follow\\catch the set of lights which just simply left it further away by the second. this second object had the noise of a jet of some sort and sequentually flashing lights like any other jet seen in the night time sky. the total time lasted about 1 minute, but surely appeared different in the skies that any other object i saw before."],"Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-10062011-0003","Object Shape":"Unknown","Country":"United States","Case Number":"32388","files":["/var/www/straped/mufon/html2text/32388.html.txt","/var/www/straped/mufon/org/32388.html"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.57466,+-75.543093(32388)&iwloc=A&hl=en\"> mufon case (32388) map </A>","Latitude":"41.57466","trends":["There have been 2 other sightings in Carbondale","There were no other sightings in Carbondale on or around October 5th 2011"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved"}