{"Tags":"City","Latitude":"51.635979","Disposition":"Unresolved","Date of the Event":"10/07/2010 12:00 UTC","Country":"United Kingdom","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/32392.html.txt","/var/www/straped/mufon/more/32392_submitter_file1__DSCF0160.jpg","/var/www/straped/mufon/more/32392_submitter_file2__DSCF0168-2.jpg","/var/www/straped/mufon/more/32392_submitter_file3__DSCF0175-2.jpg","/var/www/straped/mufon/more/32392_submitter_file4__DSCF0180-2.jpg","/var/www/straped/mufon/more/32392_submitter_file5__DSCF0191.jpg","/var/www/straped/mufon/org/32392.html"],"Summary":"Orange egg shape as bright as sun hovering outside window, then shot down landed other ufos around","Log Number":"GB-10062011-0007","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Briton Ferry","This sighting has never been favorited."],"Weather Factors":"Unknown","Case Number":"32392","divs":["Sighting DetailsDaughter was looking outside window (age 2) and said bright light in sky, I looked out and saw egg shaped bright orange object, watched this for around 10mins very very bright as bright as sun in fact looked like mini sun, ran upstairs to my wife to tell her and as i looked out of the window again watched as the object shot down and to the side and landed on the salt marshes that are next to our house maybe less than a mile away but with no obstructions in the way I had a clear view of the craft below us, by now a helicopter (large noise) came up the estuary towards the landed object, i say helicopter but could only see a red and white light and hear the noise of a helicopter, this shone a light or beam at the ground all the way towards the landed object and went straight towards it, but when it did reach it the light went off and the helicopter or what ever it was went back in the same direction it had come from, this happened quite a few times. All the time this was happening the landed object kept sending huge pulsating lights towards my house, a different colour every 5 seconds (blindly bright), another object was in the sky directly opposite the landed object and kept getting brighter then dimmer and seemed to approach the helicopter each time it went towards the landed object as if to warn it off. After the 1st 20mins of watching and finally decided it was not a plane crash, I went and got my camera and binoculars (very powerful) I took around 35 pictures before the camera was full. I expected lots of other people to have seen this event but it was never reported in the media, I contacted the police to ask if it was there helicopter it was not, I contacted the coast guard it was not them, I contacted 2 local rat bases it was not them, I went on local radio asking for witnesses but none came forward, so it's just me my wife and my daughter who saw it but i have the pictures and i think someone should see them!!!!!"],"Source":"MUFON","City":"Briton Ferry","Object Flight Path":"Stationary,Hovering then path","Date Submitted":"10/06/2011 12:53 UTC","Object Shape":"Egg","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.635979,+-3.822124(32392)&iwloc=A&hl=en\"> mufon case (32392) map </A>","Region":"","Longitude":"-3.822124"}