{"Tags":"City","Region":"Missouri","Source":"MUFON","City":"Lee's Summit","Date Submitted":"10/06/2011 07:16 UTC","Log Number":"US-10062011-0013","Date of the Event":"10/04/2011 08:30 UTC","Weather Factors":"Unknown","Disposition":"IFO","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"32398","Latitude":"38.982901","divs":["Sighting DetailsOn the evening of October 4th, 2011 around 8:30 P.M. a buddy of mine and I were driving back from Blue Springs, MO towards Lee's Summit on Woods Chapel Road (Throught Fleming Park) when we observed a massive unidentified flying object hovering near the Lee's Summit Airport. The object was very large, probably over 100 foot in diameter and hovered about 300-500 feet above the ground. The object made several banking manuevers and could change speed and direction very quickly. At first we thought that it may have been several helicopters or planes flying in a tight pattern until the craft accelerated extremely quickly and at one point flew from our location at Woods Chapel and 470 several miles north towards I-70 and then came back south of our location in just a few seconds. The object flew over us at one point and appeared to be a true triangle shaoe and made absolutely no noise. The lights on the object were very odd and blinked and pulsated at random intervals. The top of the craft appeared to have white lights with several larger blue ones mingled in but when the craft banked, the bottom of it was covered in red lights of varying size and brightness. At one point all the lights went and we thought the craft had disappeared but in a few seconds they powered back on green but then gradually changed back to the colors described earlier. During the observation, a small plane or helicopter with a bright spotlight shared airspace very close to the craft and appeared to be pursuing the object. Once the object decided to accelerate, the smaller plane was unable to keep up. We observed the craft for the better part of 30 minutes and then it just disappeared. One other note, as the craft flew near the Lee's Summit Airport, a small plane took off from there and it looked like it nearly collided with the craft. Granted it is very difficult to judge distance and size at night with no true vantage points but what I have described above is how I saw it and has not been exaggerated. I have had the opportunity to see the Stealth Bomber fly during the day and at night, and though my initial conclusion was that it was probably that type of aircraft, the more I put everything together and replayed the events in my head, the more I felt this was truly an Unidetified flying object, and that I should share my experience on this website."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.982901,+-94.37005(32398)&iwloc=A&hl=en\"> mufon case (32398) map </A>","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/32398.html.txt","/var/www/straped/mufon/org/32398.html"],"trends":["There have been 52 other sightings in Lee's Summit","There were 14 other sightings in Lee's Summit on or around October 4th 2011"],"Summary":"UFO Observed Over Blue Springs, Lee's Summit, and Missouri","Longitude":"-94.37005"}