{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date of the Event":"10/05/2011 09:00 UTC","Viewing Distance":"Unknown","Source":"MUFON","City":"Toledo","Log Number":"US-10062011-0011","trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around October 5th 2011"],"divs":["Sighting DetailsI live on the 8th floor of a high rise apartment building. I was sitting on my couch looking out the window when I saw a glowing ball of light hovering in the distance, right above the horizon. Admittedly, I do see singular balls of light in that area occasionally, and often wonder what they are--helicopter maybe? They never venture near me, nor do they move much. However, last night it hovered stationary for a few minutes, then slowly moved to the right. At this point, my interest in the object piqued and I did not take my eyes off of it. I also began to grow excited, asking my husband to come look. It hovered briefly before slowly moving back to its initial position; about 30 seconds later, it slowly began to descend. As soon as my husband came to the window to look, it disappeared below the horizon-- the exact second he would have been able to see it! A few minutes later, it reappeared, shot straight toward me, and when it got relatively close (though, I could not discern its shape, approximate speed, or elevation), it flashed. I really feel like the flash was the Object acknowledging me, or even saying hi. As mu husband was standing up to look, it shot away. He did see it though before it disappeared again below the horizon. I should note that my windows were open and it was quiet during this time both inside my apartment (no music or tv or surrounding noise) and outside (minimal traffic). I was listening for helicopter sounds, and can assert that I did not hear any. And for that matter, I have never seen a helicopter adhere to that kind of flight path."],"Object Features":"Unknown","Country":"United States","Latitude":"41.656022","map":"<A HREF = \"http://maps.google.com/maps?q=41.656022,+-83.545859(32396)&iwloc=A&hl=en\"> mufon case (32396) map </A>","Weather Factors":"Unknown","Object Shape":"Fireball, Unknown","Longitude":"-83.545859","Summary":"Hovering, glowing ball of light","Sighting Duration":"00:05:00","Region":"Ohio","Case Number":"32396","Tags":"City","files":["/var/www/straped/mufon/html2text/32396.html.txt","/var/www/straped/mufon/org/32396.html"],"Date Submitted":"10/06/2011 04:13 UTC","Disposition":"IFO"}