{"Longitude":"-81.117755","Weather Factors":"Unknown","Region":"South Carolina","Object Flight Path":"Path with directional change,Path then hovering","City":"York","Date Submitted":"10/06/2011 12:12 UTC","files":["/var/www/straped/mufon/html2text/32391.html.txt","/var/www/straped/mufon/org/32391.html"],"Tags":"City","Country":"United States","Object Features":"Unknown","Disposition":"Unknown","Case Number":"32391","trends":["There have been no other sightings in York","This sighting has never been favorited."],"Object Shape":"Circle","divs":["Sighting DetailsI was watching sky looking for the star like object moving we have been seeing lately when I noticed one moving much slower then normal. As I watched it move on an east to west heading I noticed what looked like white was more blue in color, then it started fading to red, back to blue and kept this up. I am now staring at this object and find I cannot look away. It stops moving and hovers for a couple seconds. The object then jumps north and immediately back to where it was hovering, then does this same movement to the south and then again to the east. Returning to where it was hovering. Feeling of fear came over me(and I don't get afraid) and I could not stay there any longer to watch it because it was almost overhead and I didn't want them to see me so I went in the house(strange feeling for me). I returned 15 minutes later and the object is gone, I sat there for a while but it never returned. I was watching time closely while this event happened and it lasted for maybe 1o minutes. I have seen objects in the sky before but none of them every made me feel this way before. I found that very strange."],"Log Number":"US-10062011-0006","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.004332,+-81.117755(32391)&iwloc=A&hl=en\"> mufon case (32391) map </A>","Date of the Event":"10/05/2011 10:39 UTC","Source":"MUFON","Summary":"Star like light changing in color moves slowly, stops hovers, jumps around, then hovers","Viewing Distance":"Unknown","Latitude":"35.004332"}