{"Latitude":"34.989604","City":"Plainview","Longitude":"-93.299835","Country":"United States","Object Shape":"Disc","trends":["There have been no other sightings in Plainview","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Log Number":"US-10062011-0024","Date Submitted":"10/06/2011 11:49 UTC","Region":"Arkansas","divs":["Sighting DetailsI was 10 years old, living in a rural area of Arkansas. I saw it in the sky hovering. It looked like a 'typical' saucer shape and silver color. I ran inside to find a parent. Mother was in the shower so I ran back outside and yelled for my dad. I saw him come out of the barn. I had looked away for 2-5 seconds. I pointed to the sky as I looked back where it had been. It was gone. There were no clouds anywhere nearby. I think I remember what looked like windows (square shapes) around it. I remember standing there waiting to see if it would come out from behind a distant cloud. My dad looked confused, shook his head and walked off as he couldn't see anything where I was pointing. I knew what a 'flying saucer' was because I watched 'Lost in Space' on tv so I was fascinated and excited when I saw it. I remember being kind of shocked when it just 'disappeared', feeling a little embarrassed that my dad gave me a weird look for pointing at an empty sky. He was far enough away from me that I couldn't immediately explain what I'd seen and he walked back into the barn after not seeing what I had seen. I felt disappointed that I didn't see it again. I'd hoped it would come out from behind a cloud, but I couldn't see how it would've gotten that far away in such a short time. I have no idea how close it was, how big it was or how high off the ground, but I could see it clearly. There was no doubt in my mind that it was a flying 'saucer'. I went back to the area as an adult around 1999 to 2001 (thereabouts) and drove around the area. One interesting thing was that a large area of adjacent land was posted 'no trespassing' and I remember thinking it looked like a military area. I don't remember seeing anything that specifically said that though."],"Object Features":"Window(s)","map":"<A HREF = \"http://maps.google.com/maps?q=34.989604,+-93.299835(32409)&iwloc=A&hl=en\"> mufon case (32409) map </A>","Summary":"Saw it hovering; ran inside to find parent; ran back out. Still there. Looked away for a couple seconds. When looked back it had disappeared. No clouds nearby.","files":["/var/www/straped/mufon/html2text/32409.html.txt","/var/www/straped/mufon/org/32409.html"],"Object Flight Path":"Unknown","Case Number":"32409","Disposition":"Unresolved","Date of the Event":"07/01/1973 12:00 UTC","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown"}