{"Date of the Event":"08/17/2011 09:30 UTC","trends":["There have been no other sightings in Macomb","This sighting has never been favorited."],"Object Shape":"Star-like","Longitude":"-90.671797","Tags":"City","Summary":"Wife points out a jet approaching, then a light appears approaching the jet.","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"40.459208","Region":"Illinois","Object Features":"Unknown","Disposition":"Unresolved","Log Number":"US-10062011-0019","divs":["Sighting DetailsI was on the computer and my wife had just sat down out side. She yelled my name and told me to look at this jet. We both didn't know why she pointed it out she just felt like she should. I think I had the impression it was a just a jet but it was flying kinda low and had to bright red blinking lights on each wing. I figured I would grab my binoculars real quick and I did but they are broken so I just looked at the plane. My wife and I can't remember the plane making any noise now but I am still not sure if it made noise or not. I am also having a hard time remembering is apparent size even thought I had the impression it was flying low and was large. Suddenly a bright light appeared to the North east of us and heading south west toward the jet. As the light approached the jet it was very bright (brighter than any planet) and with angular speed about twice that of the jet in a nice straight line but approaching the jet from a side angle not from behind. As it approached it became very dim and hard to see. It could still be seen barely till it reached the jet then disappeared. By this time the jet was about as close as we would see it over head about 75 or so degrees above the horizon and to our south east. We then spotted the light going the other way barely visible almost retracing its path. It became a bit brighter but not much and disappeared over some trees in the horizon. The Jet just continued on its path toward the south west. I reported this on nuforc the day We spotted it but had some problems getting the data right so I decided to post this here"],"Object Flight Path":"Path with directional change","Date Submitted":"10/06/2011 10:05 UTC","City":"Macomb","files":["/var/www/straped/mufon/html2text/32404.html.txt","/var/www/straped/mufon/org/32404.html"],"Case Number":"32404","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.459208,+-90.671797(32404)&iwloc=A&hl=en\"> mufon case (32404) map </A>"}