{"Longitude":"-94.379316","Disposition":"IFO","Object Shape":"Blimp","Latitude":"38.923643","Tags":"City","Region":"Missouri","City":"Lee's Summit","Viewing Distance":"501 Feet - 1 Mile","Summary":"ufo sighting in lees summit mo","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.923643,+-94.379316(32406)&iwloc=A&hl=en\"> mufon case (32406) map </A>","trends":["There have been 52 other sightings in Lee's Summit","There were 14 other sightings in Lee's Summit on or around October 3rd 2011"],"Date Submitted":"10/06/2011 11:31 UTC","divs":["Sighting DetailsMonday night my husband and three kids were driving around 730 at night and saw a weird large object far away with bright lights. i showed it to my husband and he said it was a spray plane. i said no way it is dark outside and the object is way too large and is over a city. we went inside a store to eat ice cream. my son was so scared he called his uncle and told him. we ate ice cream and came back outside. we were all looking for the object and saw it again. i drove closer to it, my husband and i dont believe in UFO's. we drove closer and it hovered over our car near down town lees summit mo. it had bright white lights and green flashing lights. my kids started crying and i started driving really fast. the object looked as large as a 747 or larger but was hovering so low. Again, I do not believe in UFO's but after that night i do. my husband and i tried to forget about the event. the next day i went onto the news website and didnt see any other reports. so we dismissed it. tonight on the news we saw all the other reports and now know 100% we saw a UFO!!!"],"Country":"United States","Object Flight Path":"Hovering then path","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-10062011-0021","files":["/var/www/straped/mufon/html2text/32406.html.txt","/var/www/straped/mufon/org/32406.html"],"Date of the Event":"10/03/2011 12:00 UTC","Object Features":"Unknown","Case Number":"32406"}