{"Tags":"City","divs":["Sighting DetailsMy son and I were leaving my girlfriend's apartment in the Natomas area of Sacramento tonight to return home. She was walking with us to my car. She looked up and said \"What's that?\" and pointed out three glowing red-orange objects in a roughly triangular formation to the South of us at about 60 degrees above the horizon. The three of us watched the objects for 2-3 minutes as they maneuvered around each other, occasionally crossing one another. They appeared to be moving, as a group, slowly closer to us and from east to west. There was no sound. When first observed, they appeared to me to be perhaps 10-15 miles away. My girlfriend estimated 20 miles away. As the objects progressed roughly westward, they began to move behind the treeline, blocking our view. I then ran to the other side of the building to get a better view. When I got there, I saw that the objects had dimmed and faded from a red-orange to a yellow-orange. Shortly thereafter, another object ascended from on or near the ground in the southeast and stopped in about the same part of the sky as the original three. It then moved around in a seemingly random pattern. The original three objects had, by then, dimmed and ultimately disappeared. About a minute later, a fifth object ascended and behaved in much the same way as the fourth. The ascents were roughtly straight and, in my estimation, too slow to be flares or fireworks and too fast to be conventional aircraft. The fourth and fifth maneuvered around each other for a minute or two and then faded just like the first three. The event, from beginning to end was about 10 minutes in duration. My girlfriend, an Air Force Master Sergeant with 14 years in the service, said she'd never seen anything like this, even on deployment in combat areas in Iraq and Afghanistan."],"Object Features":"Unknown","Case Number":"32417","map":"<A HREF = \"http://maps.google.com/maps?q=38.654929,+-121.43485(32417)&iwloc=A&hl=en\"> mufon case (32417) map </A>","Source":"MUFON","Date Submitted":"10/07/2011 03:00 UTC","Region":"California","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/32417.html.txt","/var/www/straped/mufon/org/32417.html"],"Date of the Event":"10/06/2011 08:49 UTC","Weather Factors":"None","Viewing Distance":"Over One Mile","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around October 6th 2011"],"Log Number":"US-10072011-0006","Object Shape":"Circle, Square, Rectagular","City":"Sacramento","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"38.654929","Sighting Duration":"00:15:00","Summary":"Observed three red-orange, glowing objects maneuvering above southeast Sacramento. Then observed two more ascend from on or near ground.","Longitude":"-121.43485"}