{"trends":["There have been 4 other sightings in Arcata","There were no other sightings in Arcata on or around October 6th 2011"],"Object Shape":"Flash, Sphere, Star-like","Date of the Event":"10/06/2011 10:00 UTC","Disposition":"Hoax","Country":"United States","Source":"MUFON","City":"Arcata","Summary":"Red Pulsating UFO swaying left and right at high altitude, then disappeared","Tags":"City","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","divs":["sighting detailsred pulsating ufo swaying left and right at high altitude, (like a gravitational propulsion) then disappeared. five other witnesses watched it with me. its red glow \\ energy allowed me to feel relaxed and reassured. it looked identical to the ufo we spotted over the temple at burning man, although this one did not drop anything, it just faded into the distance. earlier in the night (about 30 minutes earlier) we saw what looked like a stationary triangular shape with numerous lights, which disappeared as we turned the car to take a closer look. since we were unable to watch it for very long, we were unable to confirm it to be truly extraordinary (other than its sudden disappearing act, and that it was hovering silently without moving). i wouldn't have made much a fuss about it except for that we saw another (red glowing version) in the same hour. i felt reassured by these sightings because i had actually made a formal request for them to make an appearance and reassure me .. and that's exactly what happened! i love our celestial neighbors! i'd love to hear from others who also saw these lights, hence why i am posting this. {unconditional love} flowerdust"],"Latitude":"40.870947","Longitude":"-124.08104","Case Number":"32416","map":"<A HREF = \"http://maps.google.com/maps?q=40.870947,+-124.08104(32416)&iwloc=A&hl=en\"> mufon case (32416) map </A>","Viewing Distance":"501 Feet - 1 Mile","Region":"California","Date Submitted":"10/07/2011 02:10 UTC","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32416.html.txt","/var/www/straped/mufon/org/32416.html"],"Log Number":"US-10072011-0005"}