{"City":"Waterloo","Viewing Distance":"Unknown","Region":"Iowa","Date Submitted":"10/07/2011 12:47 UTC","Tags":"City","Disposition":"Unknown","Date of the Event":"10/05/2011 12:00 UTC","Object Features":"Unknown","Log Number":"US-10072011-0002","Longitude":"-92.34154","Latitude":"42.492048","Sighting Duration":"00:00:10","Source":"MUFON","Object Flight Path":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.492048,+-92.34154(32413)&iwloc=A&hl=en\"> mufon case (32413) map </A>","Case Number":"32413","Object Shape":"Cone","trends":["There have been 7 other sightings in Waterloo","There were no other sightings in Waterloo on or around October 5th 2011"],"Summary":"Beam of Light","files":["/var/www/straped/mufon/html2text/32413.html.txt","/var/www/straped/mufon/org/32413.html"],"divs":["Sighting DetailsIt was nearly midnight when my husband and I got ready to go to bed. We had just finished reading our Bible passages for the night and turned out the lights. The weather has been very nice, so I asked him if he would like to have our window open. Our bedroom is in the basement with an egress window. He said that would be great. I got up to go over to the window. As I began to crank the window open, I saw some lights outside. Our room faces a well-traveled street. Many nights it is very quiet with a few vehicles that pass. He thought a car was passing by, as did I. As the window began to crank open, I saw the lights were still outside. They were not passing by as if from a vehicle but rather passing back and forth over our side lawn. I stopped cranking the window to peek outside. There were no planes, cars or other vehicles to be seen or heard by our house. The lights were bluish-white and there were two, like spotlights crossing over our lawn. Then I looked up through the tall maple tree towards the sky. The lights were being beamed down from above our house. I was startled. Could it be a helicopter? They have spotlights but these were bluish-white, ethereal and they crossed each other. I was stunned, but managed to listen and hear a faint strange humming sound. Fortunately for us we had our MP3 player on the dresser, so I recorded the sounds for several minutes. We had a very disturbing incident on September 25th at 9:30pm with humming that shook our home and paralyzed me with fear. My husband has been shook up by that event ever since. I don't know what's going on with our area but there have been black and dark helicopters flying overhead. These have been documented, filmed, and reported. It's just weird!"],"Weather Factors":"None"}