{"Latitude":"32.457066","Sighting Duration":"Undisclosed","Object Shape":"Sphere","divs":["Sighting Details At approximatly 9:07 pm I was in my front yard (which faces the East) watering my trees, when I looked up in the sky because of a light that had appeared at about 20-25 degrees Southeast of where I was standing in Abilene, Texas. The light was a single light at first, then divided until there were five lights in a row turning on one after another from left to right. I realized exactly one year ago I had seen the same lights and actually recorded and had given a copy of this video to a local TV station which aired the video. I have recorded these lights multiple times over the past year. They first appeared on Oct 6, 2010 and continued at exact times every day for a week in the following months: October, November, December, January, and February (starting in 2010 and ending in 2011). I had not seen them since then, until tonight. These lights have always started at around 8:30 PM and continued until 9:00 PM every day until daylight savings time, after which, the time changed from 7:30-8:00 PM. Another observation I made was that neighborhood dogs always started barking right before I would see the lights. These lights have appeared as singular lights and multiple lights, up to five at a time. These lights also appeared in multiple areas of the sky at same time. I know that several other people have seen these lights in the Abilene, Texas area. I also know that these lights could not be military flares due to the burn ban which has been in effect in our area for several months now. Along with the burn ban, the fact that the wind was blowing at a constant 25 to 30 mph (along with gusts of up to 40 mph today), made it improbable in my mind and the minds of other eyewitnesses, that military flares could not have stayed in these exact formations as long as they did."],"Object Flight Path":"Stationary","Weather Factors":"Windy, Medium","Source":"MUFON","Summary":"at aprox.9:07 PM I looked up in sky when a light caught my attention.it was red orange in color then changed into five different lights in a row from left to right","Object Features":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/32412.html.txt","/var/www/straped/mufon/org/32412.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.457066,+-99.723844(32412)&iwloc=A&hl=en\"> mufon case (32412) map </A>","Longitude":"-99.723844","Country":"United States","Date of the Event":"10/06/2011 09:07 UTC","City":"Abilene","Date Submitted":"10/07/2011 12:22 UTC","Tags":"City","Region":"Texas","trends":["There have been 63 other sightings in Abilene","There was one other sighting in Abilene on or around October 6th 2011"],"Log Number":"US-10072011-0001","Case Number":"32412"}