{"Object Shape":"Star-like, Triangle, Unknown","Latitude":"40.032955","Object Flight Path":"Path with directional change,Path then hovering","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.032955,+-79.628608(32424)&iwloc=A&hl=en\"> mufon case (32424) map </A>","Tags":"City","trends":["There have been 2 other sightings in Connellsville","There were no other sightings in Connellsville on or around October 7th 2011"],"Case Number":"32424","City":"Connellsville","Longitude":"-79.628608","Sighting Duration":"00:15:00","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsEvery am I drive my 13 yr old son to his bus stop and we sit and wait for his bus and while waiting we are always talking about the stars we see every morning. This particular morning my son glance up before me to view the same stars we look at every morning and before I had a chance to look up he said, \"Mom, what star is THAT?\". I looked up and started to tell him I did not think it was a star when he interrupted me and said, \"Mom, why is it moving, Look, how could it move that fast!\". I was looking at the same thing he was and looked to the right of it and saw several, at least 10, more of the same light that would be in on spot and within a millisecond another, and kept repeating this at about 10 sec intervals. At this time, an airplane (looked commercial) was flying right past these, as if it did not even see them. It was not military. Knew it was a plane because of the red and white lights blinking and the steady pace it kept at a normal rate. Anyway, It almost appeared as though the lights was moving in the shape of a triangle. We got out of the car and everywhere we looked in the sky, we could see them. If you were to glance up for a second and then look away, you would mistake the lights for stars. But these were not stars. My son's bus came, I started to drive down the road to my house and saw in the sky a much larger light that looked like the others but was bigger and much brighter and was actually moving along a path. It was blinking at intervals but would be one place in the sky and then be in a completely different part in a second. I ran in the house to get my sister yelling there were ufo's everywhere in the sky, come see, come see!. And of course, she came outside and witnessed the last light I just wrote off, and then in a blink, it was gone, like it just disappeared. I have seen on occasion, these kind of lights in the sky but only ever one here or there. I have never witnessed so many at one time. It was overwhelming."],"Log Number":"US-10072011-0013","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"10/07/2011 07:15 UTC","Summary":"Multiple UFO's in early morning sky","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32424.html.txt","/var/www/straped/mufon/org/32424.html"],"Date of the Event":"10/07/2011 06:30 UTC","Viewing Distance":"Unknown"}