{"Latitude":"38.965791","Date of the Event":"10/04/2011 07:50 UTC","Object Features":"Undisclosed","Disposition":"Unknown","Tags":"City","trends":["There have been 134 other sightings in Kansas City","There were 9 other sightings in Kansas City on or around October 4th 2011"],"Country":"United States","divs":["Sighting DetailsOn Oct 3, at about 7:50 p.m. we were driving on 40 Highway west heading towards Noland Road to return to our home near Raytown. As we headed west on 40 Highway we saw off in the distance a rather large object with many lights. It was moving very slowly and we wondered what it was but didn't think much about it at the time since we only saw it for a short time. Then, the next evening, we were going out for an evening walk since the weather was so beautiful on October 4th around 8:00 p.m and saw the same object again. As we exited the house (we live up high on a bluff between Raytown and Lee's Summit, MO) we noticed unusually bright lights in the sky and I said that I wondered what that was since it was moving extremely slow and looked very large. Then all of a sudden, it appeared to separate so then I thought it was three separate planes but just as fast as it separated it went back together as one and headed northeast. I wonder now if it looked like it separate but in fact had just turned vertically. We continued to wonder what it was but went on with our walk as it continued across the horizon. When we got about 3 blocks from the house, we again observed the large brightly lit object in the sky and as we walked it moved very slowly and seemed to hover at times. The lights would change sometimes being horizontal and other times being vertical, sometimes solid and other times blinking. When we got to a cul-de-sac which sits on a bluff, we stood in someone's driveway and watched the object in amazement. It was off on the horizon and appeared to be over the Raytown area. At one point it appeard to make a 180 degree turn and go the other way. The lights appeared to triangular in shape when it would turn a certain way. When it was the nearest to us we commented that it was making no sound. My friend commented that maybe it was some kind of blimp since there was no sound. As we were standing there, the person whose driveway we were standing in came home and we pointed the object out to them. The guy jokingly said it was a UFO and we laughed and agreed. As we started to walk we heard some noise and then saw a helicopter but the object had disappeared. We ran into some other neighors who said they had seen it while they were walking in the parking lot of the Teetering Rocks Golf Course. We all agreed it was like nothing we had ever seen but had no idea what we had seen. After reading all these other sightings, I decided I would report what we saw. It was never as close to us as others have reported but our description would be very similar to the others that have been reported."],"Log Number":"US-10072011-0014","files":["/var/www/straped/mufon/html2text/32426.html.txt","/var/www/straped/mufon/org/32426.html"],"City":"Kansas City","Region":"Missouri","Object Flight Path":"Path then hovering","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date Submitted":"10/07/2011 11:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.965791,+-94.444264(32426)&iwloc=A&hl=en\"> mufon case (32426) map </A>","Longitude":"-94.444264","Weather Factors":"None","Summary":"Large Bright Object Flying Slowly and Very Low Near Raytown MO","Source":"MUFON","Case Number":"32426"}