{"Case Number":"32428","Disposition":"Unknown","Viewing Distance":"21-100 Feet","Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=38.923163,+-94.375716(32428)&iwloc=A&hl=en\"> mufon case (32428) map </A>","Object Features":"None","Latitude":"38.923163","City":"Lee's Summit","Log Number":"US-10072011-0016","Date Submitted":"10/07/2011 04:34 UTC","Tags":"City","Region":"Missouri","trends":["There have been 52 other sightings in Lee's Summit","There were 15 other sightings in Lee's Summit on or around October 5th 2011"],"Country":"United States","Object Flight Path":"Hovering then path","Weather Factors":"None","Summary":"40-60 ft Orange fireball hovered over my car","Longitude":"-94.375716","Source":"MUFON","Date of the Event":"10/05/2011 09:50 UTC","divs":["sighting detailsas reported to assistant state director by phone yesterday: \"i was driving south on douglass in lee's summit, missouri at 9:50 pm and came to a stop at forest street when a bright orange\\red fireball moved over the top of my car from the back to the front and hovered over my vehicle, almost at exactly 90 degrees above me but slighly forward above the windshield. it stayed there for ten minutes. i was too scared to move, or drive on and just sat there, frozen, until it took off very quickly directly east. it was out of sight in less than five seconds. it was approximately 40-60 feet in diameter and aproximatley 60 feet above my vehicle. no other cars came by at that time. i immediately went home, just a few blocks away, went inside the house and locked all of the doors and windows. when i heard about all of the other ufo sightings in the area i thought i'd better report this. i heard from some friends that they saw something similar earlier in the evening and they said they'd contact mufon, too. unfortunately, i don't have any pictures. i was too afraid to get my cell phone out to take a picture, but wish i had now.\""],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/32428.html.txt","/var/www/straped/mufon/org/32428.html"]}