{"Viewing Distance":"Over 1 Mile, N/A","Date Submitted":"10/07/2011 02:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=18.35745,+-66.111(32427)&iwloc=A&hl=en\"> mufon case (32427) map </A>","Longitude":"-66.111","Latitude":"18.35745","Date of the Event":"09/07/1998 09:20 UTC","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/32427.html.txt","/var/www/straped/mufon/org/32427.html"],"Disposition":"Unresolved","Summary":"Disc type with flashing lights","Tags":"City","divs":["Sighting DetailsCuba 1998 Guanabo beach extimated time 9 to 10pm My father and i were having a walk accross the beach, there was a strong wind and something odd about the clouds. It was a silent night and pitch black, once we stop to look at the horizon wondering if they were other living things out there one of the far away star beggings to be moving and getting closer towards us. At first we think is some kind of aircraft but then things get a little bit more odd, the winds get to have a cold breeze and the moving aircrat stars to flash and at great speed goes under the sea level, the sea level rises and wind gets stronger. The flashing craft stars to ascent from the sea level and goes behhind one of the odd clouds, at least we think it went behhing but is probably it went inside of it. Right after the craft dissapears into the cloud a sudden TORNADO beggins to form under the same cloud, the sudden tornado cause a incredible heat wave and strong winds, as we ran inside the our second floor apparment that was 10 seconds away we turn back and notice the cloud had vanished, so did the tornado. The rest of the night was cold and silent as if nothing happen, but i remember the next morning seing several Cuban Army trucks filled with soldiers leaving the beach."],"trends":["There have been no other sightings in Guaynabo","This sighting has never been favorited."],"City":"Guaynabo","Weather Factors":"Unknown","Object Shape":"Disc, Oval","Object Flight Path":"Path with directional change","Country":"Puerto Rico","Case Number":"32427","Log Number":"CU-10072011-0015","Sighting Duration":"Undisclosed","Region":""}