{"Date Submitted":"03/01/2005 05:02 UTC","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-32.890183,+-68.84405(3242)&iwloc=A&hl=en\"> mufon case (3242) map </A>","Viewing Distance":"Unknown","Disposition":"Unresolved","Object Features":"Undisclosed","Object Shape":"Undisclosed","trends":["There has been one other sighting in Mendoza","There were no other sightings in Mendoza on or around March 1st 2005"],"Region":"Mendoza","Object Flight Path":"Undisclosed","Latitude":"-32.890183","Country":"Argentina","Summary":"Not Provided","divs":["Sighting DetailsSighting Report: It was when I was going on a bike ride to= \"Cerro de la Gloria\" (\"C.G.\") about 3 months ago We were two.= That place is usually visited often by tourist or even locals.= My friend went to take some sun, and I went to watch the= monument at the top of \"C.G.\" (arround 6:30pm). On top there= were some \"Condores\" (or Condors, I don=B4t know the international= translation for this kind of bird). Well they were flying= arround the light posts for the monument (they have a side place= for the birds to stay). Then all of the sudden I notice a tiny white ligh-dot going too= fast in the sky... too fast for a jet or advanced plane and with= no tail or friction for a small meteorite... also it was at too= high altitude. And maintaning a constant speed, I can=B4t tell for= sure, but I think it was heading toward the \"Cordillera de los= Andes\"... I checked other people to catch if they saw that, but= everyone were watching the monument... I was really impressed= and didn=B4t told anything to my friend until a week. High altitude, constant speed, no trails, no lower shadow, just a= white light spot at a very high speed. What do you think about it. Many thanks in advance for your answers."],"Log Number":"","Case Number":"3242","Date of the Event":"03/01/2005 05:02 UTC","Source":"MUFON","Longitude":"-68.84405","files":["/var/www/straped/mufon/html2text/3242.html.txt","/var/www/straped/mufon/org/3242.html"],"Sighting Duration":"Undisclosed","City":"Mendoza"}