{"Summary":"star like","Object Shape":"Star-like","Case Number":"32425","files":["/var/www/straped/mufon/html2text/32425.html.txt","/var/www/straped/mufon/org/32425.html"],"Source":"MUFON","Object Flight Path":"Straight-line path,Path then hovering","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around July 30th 2011","This sighting has never been favorited.",""],"City":"San Diego","divs":["Sighting DetailsMy friends and I went to the Azusa mts, while enjoying the clear night sky we noticed a light that wasn't moving in the same pattern as the rest of the stars or other heavenly objects. We stayed and watched for a few hours (3to4 hours) even as the rest of the objects moved towards one end of the sky, this object never left the position we originally spotted in. This star like object only moved side to side (north to south)with subtle but visible twirls. The star like object hovered above a hill, how high above the hill I don't know, but it was low enough that on the hill right under the object there was a bright green and blue flash coming from the spot on the hill that was right under the star like object. The green and blue light pulsated many times, it seemed like someone was welding but there was no welder. This was around 1 to 5 in the morning so it was pretty dark. We didn't have a camera up there with us, so we didn't record the object right then and there, but this strange light followed us home. The video clip attached to this is the object in the day light, not in the Azusa mt. I shot this in East Los Angeles."],"Object Features":"Other","Region":"California","Weather Factors":"None","Viewing Distance":"Unknown","Date of the Event":"07/30/2011 11:04 UTC","Latitude":"32.750486","Disposition":"IFO","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-117.095681","Log Number":"US-10072011-0014","Tags":"City","Date Submitted":"10/07/2011 07:46 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.750486,+-117.095681(32425)&iwloc=A&hl=en\"> mufon case (32425) map </A>"}