{"Region":"Texas","Summary":"a pulsating light along the horizon. Stopped. then sped across the sky and zipped back and forth till we got scared and left","map":"<A HREF = \"http://maps.google.com/maps?q=31.969969,+-99.895963(32429)&iwloc=A&hl=en\"> mufon case (32429) map </A>","Disposition":"Unknown","Object Features":"Unknown","Log Number":"US-10072011-0017","Case Number":"32429","Country":"United States","Source":"MUFON","Object Shape":"Star-like","Latitude":"31.969969","Date of the Event":"04/26/1975 12:00 UTC","Date Submitted":"10/07/2011 04:39 UTC","files":["/var/www/straped/mufon/html2text/32429.html.txt","/var/www/straped/mufon/org/32429.html"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-99.895963","trends":["There have been no other sightings in Canyon, TX","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","City":"Canyon, TX","Tags":"City","divs":["Sighting DetailsWent out to see the tail of a comet that was supposed to be visible. We were in college in Canyon, TX so went out from town about 7 miles towards Palo Duro Canyon. There were three of us lying on the hood of the car waiting to see comet debris. We noticed a pulsating star like light traveling slowly along the horizon to our left. As we watched it pulse from one color to the next and back, it suddenly stopped and just kept pulsing. Then, it zipped across the entire sky above in about a second. One of my friends had his pilot's license and he assured us that no vehicle we know of can travel that fast. The light then would zip from left to right and down and across. Each time it would stop, it did this weird motion like a pendulum swinging back and forth and then it would make a 360 degree rotation from the pendulum movement, stop and then zip to the next location where it would repeat a similar dance. We remembered having heard about cattle mutilations on the news the day before, so we got a bit afraid and after about 45 minutes or so, we decided to leave."]}