{"Longitude":"-91.637135","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32435.html.txt","/var/www/straped/mufon/org/32435.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.130498,+-91.637135(32435)&iwloc=A&hl=en\"> mufon case (32435) map </A>","trends":["There has been one other sighting in Griffithville","There were no other sightings in Griffithville on or around September 15th 2011"],"Object Shape":"Sphere","Summary":"Its Not The First Time For Me","Log Number":"US-10072011-0023","Date Submitted":"10/07/2011 07:51 UTC","Date of the Event":"09/15/2011 12:00 UTC","Object Features":"None","Latitude":"35.130498","Country":"United States","City":"Griffithville","Tags":"City","divs":["Sighting DetailsThere can be many stories I can tell you of a place I frequent on nights me and my buddy want to get a little freaked out. Last monthly I had just left my ex-girlfriends house. She lives near where me and my buddy go UFO hunting. Well that night was calm as could be. Not a cloud in the sky and you could see for miles. I was only a mile away if that from her house when I noticed two closely places yellow balls of light in the sky. I stopped and I turned my radio off. Sorry if I miss spell stuff cause it makes me kinda tear up still. So I watched it as it slowly turned directions. It was going I think east and changed going NE. As I watched it for about a minute it had gotten closer to me. All of a sudden the inside of my car took on a blue glow. Yet it didnt come from what I had been watching. With in 5 to 10 sec. I heard(this freaked me the hell out)foot steps running towards my car. Not like one person but like the sound of 5 to 10 people running on this gravel road. I through my car in drive and took off. I didnt look back cause I didnt want to know what it was. I will say I hate to be on that road at night. I have seen roughly what I can honestly UFO's over 25 times. I would get them on film but I dont make the money right now to by a video recorded. But I would be willing to take someone out there. Now I have seen things right down my road. I live right outside of Cabot. Yet oddly it mainly takes place at my buddies house. I have seen it but him and family dont want nothing to do with research. But back to my spot. Now several years ago I was taking an ex and her mother home. Oddly the live on the same road. They told me about seeing craft sitting in fields off that road. Well one night as we top a little hill I saw the biggest craft I'd ever seen. To tell the truth it looked to be 2 to 3 hundred yards big. It was a line of 6 yellow lights in the sky thy looked to be 15 ft in diameter. It was stationary but as I got near it was no more that 100 to 150 ft off the ground. As I got close I started flashing my lights at. After a few times the lights lit up and it shifted to what I say would be a 20 degree angle and started coming towards us. As we neared the clearing it was a tree top level when it made a 90 degree turn to the right and shot off. I have other stories. Feel free to contact me at anytime. I have had prolly 50 or more experience dealing with ghost and ufo."],"Region":"Arkansas","Object Flight Path":"Path with directional change","Case Number":"32435"}