{"trends":["There have been 52 other sightings in Lee's Summit","There were 14 other sightings in Lee's Summit on or around October 4th 2011"],"Object Features":"None","Summary":"Huge triangular gray object with blue and white lights hovered over highway","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsAs reported to Assistant State Director by phone yesterday: \"I was driving on the highway and getting onto an on-ramp when my husband, daughter, and I noticed a very large triangular shaped object floating or hovering over the highway. There was a triangle shape within the outer triangle, and the sides looked like they were about 15 feet high. The radio went off by itself and we heard only static, We could see a plane with a red flashig light in the distance above this object. The object moved around very slowly and other cars around us were slowing down to get a look at it. We opened the sunroof and watched it. The lights were all on the underside and were bluish white, with approximatley 12 or more lights on it. We did not see a red or green flashing light like you see on airplanes. I called a local T.V. station and sent photos to them. We have never seen anything like this and know that this was not a plane or planes. We see a lot of planes because there is an airport nearby, and can be sure this was not a plane.\""],"Case Number":"32431","Longitude":"-94.380136","Weather Factors":"None","Region":"Missouri","Object Flight Path":"Stationary","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32431.html.txt","/var/www/straped/mufon/org/32431.html"],"City":"Lee's Summit","Log Number":"US-10072011-0019","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Date Submitted":"10/07/2011 04:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.918223,+-94.380136(32431)&iwloc=A&hl=en\"> mufon case (32431) map </A>","Date of the Event":"10/04/2011 07:55 UTC","Latitude":"38.918223"}