{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/32439.html.txt","/var/www/straped/mufon/org/32439.html"],"City":"Crestview","Weather Factors":"Unknown","Longitude":"-86.563768","divs":["Sighting DetailsI was sitting ouside the back of my house smoking a cigarette with my wife. She said \"look a shooting star\" and i turned around to see what she was talking about. Initially it was white with a small streak behind it moving fast, as i turned around to look it turned green and blue with a very LONG orange contrail behind it. I observed the object for a total of approximately 5 seconds, from the time it lit up until it disappeared behind the trees in my back yard. The object rapidly picked up speed as the lights came on. The object was approximately headed south-south east from the area of crestview, florida. Honestly, it scared the ever loving **** out of me. I have never seen anything like this in my life. About an hour later i was speaking with my sister, she had seen my post on facebook about seeing a UFO (of which it included no description). She asked if it was Green and blue with an orange trail. I said yes. She and her boyfriend had seen the same thing, approximately 500 miles south of where I am, all the way in fort myers, florida. The event occured within the same minute that i saw it to when she saw it with her boyfriend. She reported the same object, moving at a fast rate of speed, headed in the same direction. I lost sight of the object as it passed behind the trees in my backyard, and then over the horizon. Im a combat veteran of Iraq, and this event scared my ********"],"Disposition":"Unknown","Case Number":"32439","map":"<A HREF = \"http://maps.google.com/maps?q=30.769743,+-86.563768(32439)&iwloc=A&hl=en\"> mufon case (32439) map </A>","trends":["There have been 6 other sightings in Crestview","There were no other sightings in Crestview on or around October 6th 2011"],"Country":"United States","Log Number":"US-10072011-0027","Object Flight Path":"Straight-line path","Summary":"Green and blue object with long orange trail","Latitude":"30.769743","Date Submitted":"10/07/2011 09:52 UTC","Object Shape":"Teardrop","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"10/06/2011 07:41 UTC","Object Features":"Unknown","Viewing Distance":"Over One Mile","Region":"Florida"}