{"City":"Memphis","Region":"Tennessee","Summary":"I saw multiple sightings what i believe to be dimensional. I saw to solid shapes come together as one shape and take off rapidly. Others at my work saw what they believed also to be UFO's. I was able to take two digital photos of these things in flight","Latitude":"35.054831","Object Features":"Unknown","Longitude":"-89.915375","Country":"United States","Disposition":"Unknown","Object Shape":"Circle, Cylinder, Oval, Sphere, Square, Rectagular, Triangle","Date Submitted":"10/07/2011 07:46 UTC","files":["/var/www/straped/mufon/html2text/32433.html.txt","/var/www/straped/mufon/org/32433.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Unknown","Source":"MUFON","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around October 7th 2011"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.054831,+-89.915375(32433)&iwloc=A&hl=en\"> mufon case (32433) map </A>","Sighting Duration":"00:18:00","divs":["Sighting DetailsI was on break outside my work. It was a beautiful day so I was looking upward. I had noticed a white looking spot that was hanging around a cloud. I asked the others if they knew what that was. About 6 of us saw it. It was ascending coming toward us. Then all of a sudden... it just stopped. I said look! It stopped. It stayed in 1 place for about 15 seconds. It quickly started going the other way away from us. We saw about two of them at the same time. I told the rest of the crew I wish I had gone to get the camera I keep in my desk. After break... that is just what I did. I went outside thinking I might see something and take a pic of it. I was about tired and I was just about to come in the warehouse, when towards the Memphis Airport I saw 2 black dots. I automatically thought maybe they are having a show this weekend. Hardly... what I saw next... I can't explain. They 2 dots were flying zig zagging in and out with each other... going around each other. I told myself they arn't planes because they are too close and planes don't do that. I don't blame you for what I am about to say... but these to things became as 1 and shot off. I was able to take pics of them after becoming one. After, downloading the photos, I had noticed that I caught 2 UFO's. At least I have proof of what I saw. The pictures are good but far away. If you blow them up... you can see IT AINT NO AIRCRAFT. Well... that's about it. Thanks.6"],"Date of the Event":"10/07/2011 02:17 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"32433","Log Number":"US-10072011-0021"}