{"files":["/var/www/straped/mufon/html2text/3243.html.txt","/var/www/straped/mufon/org/3243.html"],"Latitude":"36.401182","Summary":"Not Provided","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-93.737971","Country":"United States","Date of the Event":"03/17/2005 08:13 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"03/17/2005 08:13 UTC","trends":["There have been 4 other sightings in Eureka Springs","There was one other sighting in Eureka Springs on or around March 17th 2005","This sighting has never been favorited.",""],"Case Number":"3243","Object Shape":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsSighting Report: Eureka Springs, Arkansas 72632-9446, two miles east of the city limits, Carroll County, Arkansas Weather: Ceiling unlimited. Calm 0-5 mph. Out of west. Very clear. Trajectory: From 320 to 290 degrees, magnetic north not considered. =20 I stepped outside to be with our dogs. The object, bright red, suddenly = appeared, larger than the usual meteorite, streamed a brilliant red as = it seemed to angle downward in a straight line, NW to SW. When it = reached the approximate 310 degree location it swerved from a straight = line, moving in same direction but in a slow erratic fashion, then = burning out at about the 290 degree location. The trajectory for the = last 10 or so degrees was curved, lazy, first to the right and then to = the left and a smaller curve to the right and then staight ahead and = burned itself out. My written observations may be off as to the number = of times it curved. No noise. No odor. =20 Observer s estimate: My guess is that it was space junk burning up. = Very impressive. Perhaps others saw it, too, and then a more accurate = evaluation can be determined. My wife saw a bright meteroite moving = from ENE to WSW a few evenings before. We live on a ridge top and our visibility is superior. Richard ="],"Region":"Arkansas","Disposition":"Insufficient Data","City":"Eureka Springs","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.401182,+-93.737971(3243)&iwloc=A&hl=en\"> mufon case (3243) map </A>","Log Number":""}