{"Case Number":"32440","Latitude":"45.887608","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.887608,+-95.369198(32440)&iwloc=A&hl=en\"> mufon case (32440) map </A>","Region":"Minnesota","Log Number":"US-10072011-0028","Tags":"City","trends":["There have been 4 other sightings in Alexandria","There were no other sightings in Alexandria on or around October 1st 2011"],"Disposition":"Unresolved","Object Shape":"Unknown","Longitude":"-95.369198","City":"Alexandria","files":["/var/www/straped/mufon/html2text/32440.html.txt","/var/www/straped/mufon/org/32440.html"],"Date of the Event":"10/01/2011 12:00 UTC","Summary":"An unknown craft changing directions 3 times during the day(vapor trails, high altitude)","Date Submitted":"10/07/2011 10:38 UTC","Country":"United States","Source":"MUFON","divs":["Sighting DetailsLast Saturday Oct. 1st. Coming back home after picking up my son from a friends house during the day, He and I saw what we assumed was an airplane because of it's vapor trails, this is quite common of course but what happened next is something I have never seen before..Hwy. 94 driving East between the cities of Alexandria, Mn. and Osakis, Mn. this assumed airplane had changed course in a sharp south-western direction, then changed opposite direction in a south-eastern direction then moved northward. The vapor trails created the shape of a back-ward \"S\". I'm thinking that the pilot of this craft lost his way, navigation problems. This is just something you don't see. This was the highlight of our conversation(my son and I) the rest of the way home. I told my husband when we got home, Now earlier tonight my husband mentioned he heard on the radio about several reports in Kansas and missouri areas past month now and I get on here and read almost identical reports of crafts making strange maneuvers, which prompted me to throw my 2 cents worth. Still curious about what it really was."],"Viewing Distance":"Over One Mile","Object Features":"Unknown"}