{"divs":["Sighting DetailsI was driving home from work and called my wife at 6:55 PM to let her know I was on my way. I spotted the object while driving past Chico's on Hwy 190. It had a plasma like appearance, like that of a comet's tail illuminated by the sun. (See similar report in Case #32436.) The orb then began to morph and suddenly elongated in a northwesterly direction. Then, it returned to its original approximate shape at it's northwesterly limit. I would say that it streaked from one spot to another but it didn't leave a trail; it was more of a distinct projection. I told my dubious wife to go outside and see if she could see it. She later told me that she walked around our house (west of downtown Covington) but did not see it. I ended our call at 7:02 PM, made a right turn onto Asbury Dr, immediately turned into the shopping plaza, and pulled alongside another vehicle stopped beside Voodoo BBQ. During this time I had watched the object disappear and then reappear further to the east-northeast and lower on the horizon. The owner of the car next to me was standing in front of his vehicle also witnessing the event. I exited my car and asked him, \"What is that thing?\" to which he replied, \"That's a UFO!\" His two young sons were in the church parking lot ahead of us also watching the orb. The older son captured some pictures and video on his phone. We exchanged e-mail addresses but I have not yet received any pictures or video. I heard one of the boys describe the object as turning sideways. I did not witness any maneuver that I would describe that way but perhaps that is how he perceived the elongation that I witnessed, or he might have been describing something that I did not see. I don't know how long the object was in the sky before I saw it and I had to take my eyes off it periodically while driving. I asked one of the boys how long they had been watching the UFO and he said it had been a couple of minutes. The older boy showed me part of the video he recorded on his phone, so I know he has footage of the object but I didn't see the whole thing and don't know how much of the event he captured."],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","map":"<A HREF = \"http://maps.google.com/maps?q=30.393117,+-90.084668(32445)&iwloc=A&hl=en\"> mufon case (32445) map </A>","Summary":"Comet-like orb in north sky that changed shape and direction, then disappeared and reappeared further to the east and lower on the horizon","Latitude":"30.393117","Country":"United States","Log Number":"US-10082011-0004","Date of the Event":"10/07/2011 07:01 UTC","trends":["There have been 5 other sightings in Mandeville","There was one other sighting in Mandeville on or around October 7th 2011"],"City":"Mandeville","Weather Factors":"Unknown","Tags":"City","Region":"Louisiana","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/32445.html.txt","/var/www/straped/mufon/org/32445.html"],"Case Number":"32445","Disposition":"IFO","Date Submitted":"10/08/2011 02:08 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Longitude":"-90.084668","Source":"MUFON","Object Shape":"Fireball"}