{"files":["/var/www/straped/mufon/html2text/32441.html.txt","/var/www/straped/mufon/org/32441.html"],"Region":"Florida","City":"Tarpon Springs","Viewing Distance":"Over One Mile","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"28.134818","Weather Factors":"Windy","Log Number":"US-10072011-0029","Summary":"Red/orange glowing large orb with fire like distortion below flying at steady speed,horizon to horizion, with no sound.","Date of the Event":"10/07/2011 08:30 UTC","Object Shape":"Sphere","Longitude":"-82.709611","Date Submitted":"10/07/2011 10:45 UTC","divs":["sighting detailsfirst let me say that i am a usaf viet nam veteran, with 4 years as a b-52 maintenance crew chief. i'm very aware of the flight characteristics of conventional aircraft. i also lived many years in the antelope valley in so. calif. with-in a few miles of lockeed\\martin skunkworks and edwards afb where i have seen everything from the sr-71 to all the shuttles and many different types of aircraft flying day and night. what i witnessed this evening was un-like anything i've seen before. i was sitting on my back patio at approximately 8:30 pm talking on the phone when i looked up, out over the lake and tree line, and saw a large reddish\\orange ball of light moving northeast to southwest passing directly in front of me.it immediately caught my attention due to it's abnormal size and brightness, but it wasn't close enough to see any real detail. something was going on beneath the objejt.it looked like bottom was on fire. the whole thing reminded me of a reddish\\orange hot air baloon,at night, brightly lit ,slightly pulsating, with the bottom on fire, moving much faster than a baloon could fly. although it resembled fire under the object, it wasn't affected by the speed of the object like fire would be at a couple of hundred miles per hour.. everything stayed fairly constant throughout the sighting. the object was completly silent. it didn't make any unconventional or erratic moves. but i know that what i witnessed for almost a full minute was not anything i've ever seen in the sky before."],"map":"<A HREF = \"http://maps.google.com/maps?q=28.134818,+-82.709611(32441)&iwloc=A&hl=en\"> mufon case (32441) map </A>","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","Case Number":"32441","Country":"United States","Tags":"City","trends":["There have been 7 other sightings in Tarpon Springs","There were no other sightings in Tarpon Springs on or around October 7th 2011"]}