{"map":"<A HREF = \"http://maps.google.com/maps?q=32.7319,+-117.197312(32467)&iwloc=A&hl=en\"> mufon case (32467) map </A>","City":"San Diego","Source":"MUFON","Summary":"Gold/Copper Spheres Over Point Loma, San Diego","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around October 2nd 2011","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Object Flight Path":"Stationary","Log Number":"US-10082011-0025","Weather Factors":"Unknown","divs":["sighting detailsat approximately 11:25am on october 2, 2011 i was walking to my vehicle at the san diego airport terminal 2, when i looked to the west and saw a bright object in the sky which happened to be in the flight path of departing air traffic. at first i thought it was the reflection of the sun off of an american airlines md-80(polished aluminum) however the object did not move. then i thought that it could be an aircraft from the miramar air show that was going on that day, but again, the object didn't move. i then retrieved my binoculars from my vehicle and looked at the object with magnification. with binoculars, my initial thought was that it was a pair of balloons perhaps released from a picnic or party at the ntc park just west of the airport, however the object\\s did not move as balloons do in the wind. this is to say, that their horizontal and vertical location did not vary, however the object\\s were spinning at perhaps 15rpm around each other with a fairly regular and consistent rotation. imagine two spheres attached and rotating around each other. i ruled out balloons when i saw that even with good binoculars, the objects still had fuzzy edges, and at that apparent distance they were similar in size, if not larger, to aircraft (ie 737's) when banking north or south on their ascent out of san diego. i watched the object\\s with my naked eye and then with binoculars for about 2-3min, then when i pulled my binoculars down to look again with the naked eye, the object was gone. it hadn't moved or gone behind the clouds, it was simply not in the sky. i continued to scan the sky, and saw no trace of the object. if it had been balloons that burst, i would have seen one of the two still there, or floating down etc, but this object\\s simply disappeared. on my way home, i drove through the park to look for parties or picnics with gold balloons, and saw no picnics or parties with any balloons. when at home, i got online and downloaded the air traffic control recordings for that time, and at one point during my sighting, atc notifies an airplane in their frequency that they have an unknown object to their right at 1600ft(24:25min on the recording). but that is the only mention of anything suspicious or remotely out of the ordinary. i am still not sure what i witnessed, if it was anything at all."],"Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"10/02/2011 11:25 UTC","Region":"California","Case Number":"32467","Object Shape":"Sphere, Other","Country":"United States","Longitude":"-117.197312","Latitude":"32.7319","Disposition":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"10/08/2011 10:15 UTC","files":["/var/www/straped/mufon/html2text/32467.html.txt","/var/www/straped/mufon/org/32467.html"]}