{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/32463.html.txt","/var/www/straped/mufon/more/32463_submitter_file1__photo.JPG","/var/www/straped/mufon/org/32463.html"],"trends":["There have been 19 other sightings in Greeley","There were no other sightings in Greeley on or around October 3rd 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was sky-watching, meditating after class on a beautiful day. There wasn't a cloud in the sky. At 1:00 I decided I was going inside to do some homework. I took one last look at the sky and noticed a planet-like object high up, almost directly above (slightly north-west of me). This was strange since I had been watching the sky above me for almost an hour and I would have noticed it if it was there. I got out my binoculars and saw a curious orange-ish orb floating motionless in the sky. I called my roommate(1) and he came outside. After his eyes adjusted he saw it, and his first reaction was to ask if it was \"a planet or star.\" When I gave him the binoculars he described it as slightly morphing like a cell or an ameba. My roommate(1) called our other roommate(2) out, and he was shocked. Roommate(2) said it might have had a tail, I thought I might have seen the same but it was hard to tell. He also said that it looked silver to the naked eye, and orange through the binoculars. Roommate(1) said it was more white-ish than orange, and slightly translucent. To me it just looked like an orange orb, self-illuminating and curiously still. After 25 minutes I was on the phone with the colorado mufon advisor, and someone who works in the building came out to tell me that an employee's uncle is the international mufon director (which was quite a coincidence) and I got distracted for a couple of seconds. When I looked back it was gone. It had traveled due-East, but remarkably slowly. I would like to note that earlier in my sky-watching session, there was one faint cloud that floated West at about the same speed. My first thought was that the object could have been a weather balloon, but further research has made it less likely that it was. So far I have not been able to identify what my roommates and I saw that day. I have attached a photo, but I think the object was too high to be captured by my cell-phone camera."],"Sighting Duration":"Undisclosed","Tags":"City","Disposition":"IFO","Date of the Event":"10/03/2011 01:01 UTC","Case Number":"32463","Object Features":"Unknown","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","Log Number":"US-10082011-0021","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.424865,+-104.690832(32463)&iwloc=A&hl=en\"> mufon case (32463) map </A>","Region":"Colorado","Longitude":"-104.690832","Object Flight Path":"Stationary,Straight-line path","Latitude":"40.424865","Country":"United States","Summary":"Orange orb appeared high in the sky. Watched it for 25 mins w/ binoculars, resembled an ameba. Slowly went West-East then till we lost sight.","City":"Greeley","Date Submitted":"10/08/2011 05:18 UTC"}