{"Date Submitted":"10/08/2011 03:36 UTC","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around October 5th 2011"],"Summary":"UFO in Asheville, North Carolina. oct.5, 2011","City":"Asheville","Tags":"City","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Viewing Distance":"21-100 Feet","Date of the Event":"10/05/2011 09:33 UTC","Latitude":"35.601965","Case Number":"32460","Region":"North Carolina","Object Shape":"Diamond, Triangle","Longitude":"-82.546835","Source":"MUFON","Disposition":"IFO","Log Number":"US-10082011-0018","map":"<A HREF = \"http://maps.google.com/maps?q=35.601965,+-82.546835(32460)&iwloc=A&hl=en\"> mufon case (32460) map </A>","Object Features":"Patterned Surface, Wings","files":["/var/www/straped/mufon/html2text/32460.html.txt","/var/www/straped/mufon/org/32460.html"],"divs":["Sighting Detailsi saw that same thing oct. 5th in Asheville, North Carolina, that was on a wednesday night, my mother, little sister and me, where going to my sisters home in asheville, and there was this light in the sky hovering over the highway, we drove right under it. It was the size of a stealth plane, was shape in a pyramid, diamond, triangle shape, with a very bright light at the nose and red , green lights on the wings, the back had flames coming out the rear, but hovered in air and may no nose, everyone seen it, who where driving on interstate 26, near longShaw road exit. it was only hovering less then 100 from the ground, at tree top level over a﻿ The Frenh broad river in Asheville, i saw the craft very clearly, it was solid black with blue markings all over that glowed, my mom said maybe it's a plane and i said planes don't hover, then said maybe it's a cellphone tower or radio tower, with a huge spot light on it, but once we drove under it, she shut up for a second and said maybe it's a helicopter, and said if it was a chopper, we would heard it before seen it."]}