{"divs":["sighting detailsi was sitting on my back porch after finishing light chores in the yard about 5:30 pm near downtown cartersville,ga on 10-08-11. i then witnessed an object in west\\northwest sky coming directly at my angle but from very far away. this is the flight path of incoming flights to atlanta, so i did not think much of it until it got a bit closer and it started to resemble an atmospheric balloon, and then it appeared to separate. this object was at a very high altitude, but i could tell it was not an airplane. i ran to my kitchen to fetch my binoculars used for bird watching, and as i returned i searched for the objects. what first appeared as one balloon-looking object was now two with a third trailing. they all appeared round and bright with the first two objects one right above the other and the third trailing far behind. the front two objects floated above one another with each pulling ahead of the other as they all changed paths from southeast to south\\southwest. their entire movement seemed very slow across the sky, but at what appeared to be very high altitude,the slow speed seemed relative to height. as i continued to follow their path, i thought i have to get my camera, but they just disappeared. it was a cloudless day and it just blew my mind to see them disappear. i have never had an encounter like this before. their path took them about 1\\4 the distance across the western horizon in about 4 1\\2 minutes."],"Case Number":"32464","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Undisclosed","Summary":"Three objects in Western sky at 5:30 PM EST viewed from home in Cartersville, Ga.","map":"<A HREF = \"http://maps.google.com/maps?q=34.155684,+-84.787137(32464)&iwloc=A&hl=en\"> mufon case (32464) map </A>","City":"Cartersville","Date Submitted":"10/08/2011 08:57 UTC","Object Flight Path":"Path with directional change","Tags":"City","trends":["There have been 9 other sightings in Cartersville","There were no other sightings in Cartersville on or around October 8th 2011"],"files":["/var/www/straped/mufon/html2text/32464.html.txt","/var/www/straped/mufon/org/32464.html"],"Longitude":"-84.787137","Region":"Georgia","Log Number":"US-10082011-0022","Disposition":"Unresolved","Date of the Event":"10/08/2011 05:30 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"34.155684","Weather Factors":"Unknown","Object Shape":"Circle","Country":"United States"}