{"Viewing Distance":"Unknown","Object Features":"Unknown","Date of the Event":"09/30/2011 11:35 UTC","Object Shape":"Circle","divs":["Sighting DetailsI was in the backyard of my residence putting the dog out for the evening. I tunned facing southeast and noticed 3 orangish lights in there sky. They were moving in a northwest direction and when I first noticed them they were low in the sky and seemed to gain altitude as they went directly over me. they went from the first sight area until they reached a point past me and appeared to go up in the sky. This freaked me a little as it did not appear to be a plane and they made no noise when they were over me. Appx. five minutes later a second set of the same lights flew over me following the same direction and in the same pattern. Two lights in front and one behind. The lights in front seemed to moved back and forth to some degree and then they would fall back so that it appeared they were directly across from each other in the sky. Now having observed a second set of lights I was really excited and anxious and my brain was jumping around as to what these could be. It was something I never seen before. About ten minutes later a third set moved across the area in again the same pattern and direction. As the third set approached I called my wife out of the house and she had exactly the same reaction that I did. She had never seen anything like it and it was really frreaky. She too wondered what they could have been. They all appeaared to go up in the sky and out of sight as they moved away from us. The whole event took appx. 15-20 minutes. I called the local police dept. and inquired if they had any reports of strange lights in the sky, as I figured that someone else had to have seen these things. They reported that they had not had any reports and asked me if it was a plane that I had seen. I told them that it was not a plane and that I didn't know what it was. They asked me if I wanted the police to come out and I said no, that there was nothing to see or do at the time of the call."],"Longitude":"-84.018027","Country":"United States","Summary":"I observed 3 sets of 3 lights all flying in the same direction and in the same pattern.","Region":"Michigan","Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=43.407771,+-84.018027(32469)&iwloc=A&hl=en\"> mufon case (32469) map </A>","Log Number":"US-10082011-0027","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32469.html.txt","/var/www/straped/mufon/org/32469.html"],"Case Number":"32469","Date Submitted":"10/08/2011 11:30 UTC","Tags":"City","City":"Saginaw","Disposition":"Unknown","Source":"MUFON","Latitude":"43.407771","trends":["There have been 20 other sightings in Saginaw","There were no other sightings in Saginaw on or around September 30th 2011"]}