{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","Latitude":"22.896483","Region":"Baja California Sur","Date of the Event":"10/08/2011 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=22.896483,+-109.909077(32484)&iwloc=A&hl=en\"> mufon case (32484) map </A>","files":["/var/www/straped/mufon/html2text/32484.html.txt","/var/www/straped/mufon/org/32484.html"],"Weather Factors":"Unknown","trends":["There have been 10 other sightings in Cabo San Lucas","There were no other sightings in Cabo San Lucas on or around October 8th 2011"],"Object Flight Path":"Straight-line path","Object Shape":"Fireball, Oval, Other","Longitude":"-109.909077","Date Submitted":"10/09/2011 03:03 UTC","Case Number":"32484","Tags":"City","Viewing Distance":"Unknown","Log Number":"MX-10092011-0013","divs":["sighting details recently there have been numerous sightings in the area where i am living. i live on a cliff overlooking the sea of cortez and a beautiful little cove beach. there were two sightings in september - - one on september 2 and then again on september 18. these sightings were viewed by people in the housing community next to where i live i will tell you about those later. last night my husband and i both saw what we feel were ufo's. we were walking along the walkway returning from dinner at a friend's house to our condo. my husband suddenly said he left his cell phone in the car and returned to the car to get his phone. at this point, i was walking alone and looked in the sky and saw an amber colored light traveling along the sea of cortez (east to west). it was very bright and looked like a burning light (orange\\red). it traveled up and to the west and then just seemed to disappear. (i don't know if it disappeared behind a cloud or just vanished.) there aren't many clouds here. i entered my condo and minutes later my husband came in. i said to him \"did you see the ufo?\" he said \"no\" and then proceeded to make fun of me saying \"yeah, right - - you saw a ufo. you seem pretty calm for having just seen a ufo.\" i said \"well, i've been expecting to see one.\" he then went out on the deck and screamed \"oh my god - - get the camera!!!\" there was another bright light - - traveling the same way . it seemed like every minute another one would go by until four went by our deck. my husband is a pilot and he said the lights looked nothing like anything he has ever seen.(that's five in all - - counting the one i saw while walking to our condo. they traveled faster than an airplane. my husband stayed out on the deck and fifteen minutes later - - another one came by - - only this one seemed to go straight out over the sea of cortez (south)and in a different direction from all the others. as for the other sightings - - there is a man who teaches tai chi on our little beach here. he is a very honest, spiritual man. he was up one morning at about 4:00 a.m. or 4:30 a.m on or about september 2 - - when he saw a strange looking, amber colored light in the sky. it hovered over the housing community where he was staying. he said he could hear a buzzing sound from it. he drew a picture in the sand of what he saw. it was a ufo with amber colored lights around the bottom. he said that the lights changed color - - multi colored - - and then went over the hill to the beach. when it went down to the beach he said it morphed in size and color. originally it was about the size of a volkswagon and then changed to the size of a trailer and the color was bluish white. he said he saw it leaving just before sunrise and then \"poof\" - - it just disappeared. he said he felt a lot of love coming from the craft. then on or about september 18 at about 4:30 a.m. - - two night time security guards at the housing community next to us saw a craft hovering over their community. they described it as a ufo with amber colored lights. they watched as it went down towards the beach and changed color and they say that it disappeared into the sea. they tried to take a photograph but the photo only showed something that looked like intereference on a television screen. they were freigtened by the experience."],"Object Features":"Other","City":"Cabo San Lucas","Country":"Mexico","Summary":"My husband and I witnessed amber colored lights traveling across the sky over the Sea of Cortez in Cabo San Lucas, Mexico"}