{"trends":["There has been one other sighting in Paisley","There were no other sightings in Paisley on or around December 25th 2009","This sighting has never been favorited.",""],"Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=55.853728,+-4.432074(32487)&iwloc=A&hl=en\"> mufon case (32487) map </A>","Source":"MUFON","Date of the Event":"12/25/2009 07:00 UTC","Object Shape":"Circle, Fireball","Region":"Scotland","divs":["Sighting DetailsThere were two of us walking at around 7pm on Christmas day 2009. We were in a town in the west of Scotland near Glasgow, and it was a quiet and very cold, crisp evening. We were walking towards a row of residential buildings (the front of the buildings facing us) when above the roof tops we seen a round glowing object travelling towards us (but overhead) very quickly. We noticed it because it was bright and moving quickly in our direction. We both stopped and asked eachother what we thought it was, it was like nothing we had seen. Much too big to be a star, definitiely not a comet, too fast to be a chinese lantern. Feeling a little panicked we just stood and stared and I reached into my bag for my camera. I took some photographs but had to zoom. As it became closer overhead it slowed down and descended before acsending very rapidly and vanishing into the clouds. We were both quite scared by it and shaking a little, even though we did not see it close up we both thought because of the direction and speed it was going it may land on top of us! We're not joking when we say that, it was quite frightening. As soon as it dissappeared we rushed on home (only a few feet away) and felt glad to be inside. We called everyone we knew and told them to check the skies, but they laughed it off. We also kept our eye on the news over the next couple of days but there was nothing. We uploaded the photographs that were taken to our computer and they turned out pretty blurry, mainly because the zoom on the camera was not so good and possibly because of the speed of the object. It was not a windy evening, quite still and the object made no noise, and had no wings or anything like that."],"Log Number":"GB-10092011-0016","Summary":"Descent very quickly towards us (2) before rapidly ascending into sky at great speed.","Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"32487","Tags":"City","City":"Paisley","Latitude":"55.853728","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/32487.html.txt","/var/www/straped/mufon/more/32487_submitter_file1__FlyingObject1.JPG","/var/www/straped/mufon/more/32487_submitter_file2__FlyingObject2.JPG","/var/www/straped/mufon/org/32487.html"],"Object Features":"None","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Date Submitted":"10/09/2011 05:32 UTC","Longitude":"-4.432074"}