{"Country":"United States","Disposition":"Unresolved","Latitude":"40.587882","map":"<A HREF = \"http://maps.google.com/maps?q=40.587882,+-74.148301(32489)&iwloc=A&hl=en\"> mufon case (32489) map </A>","Tags":"City","Object Shape":"Oval","Summary":"Bronze/Dark Copper flying craft with large windows with bright flashing lights seen flying over Staten Island, NY","Weather Factors":"Unknown","divs":["sighting detailsafter work on a friday evening, i was sitting in my car in my home driveway talking to my friend on my cell phone (connected to my car speakers). i was sitting in my car for a good 20+ minutes, when i noticed a large, dark figure from my peripheral vision and quickly looked over. at first, i assumed it could have maybe been a blimp because of the color, density, and low altitude of this craft. i was stunned and opened my car window with my mouth hanging open in awe while i witnessed this bronze\\dark copper colored oval craft with large square windows (with bright colorful lights flashing sequentially from the windows) slowly move from south to north. i was still on my phone with my friend at this moment while i was witnessing this, and described this to my friend. i immediately ended the phone call while i tried to take a picture with my blackberry of what i saw. this craft was so low in the sky that i saw how detailed the windows, lights, color, shape, and material of this ship was. i could not unfortunately take the photo with my phone as i could not find the point in the sky with the small camera lens of my phone and did not want to take my eyes off this craft. i continued to watch in amazement while this craft floated almost right over me and watched it slowly ascend away towards the north. with this, an airplane was flying by from north to south (opposite direction) right past this craft, so close to each other-- i thought they were going to collide. i could not believe my eyes. in broad daylight, this silver plane was maybe 50-100 feet away from this dark bronze oval craft with brilliant flashing lights floating in the opposite direction. i continued to watch this craft ascend higher and higher into the sky, farther and farther away. with no visible clouds in the sky, i was able to maintain a good visual on where this craft was going. i watched until this craft seemed to disappear from thin air. i assumed it may have flew into a cloud or fog, but there was none in the sky. i was amazed and am certain i will never remember what i saw. it was a ufo."],"Object Flight Path":"Straight-line path","Source":"MUFON","Sighting Duration":"00:02:30","Region":"New York","Date Submitted":"10/09/2011 06:59 UTC","Date of the Event":"10/07/2011 06:05 UTC","City":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around October 7th 2011"],"Object Features":"Dome, Window(s)","files":["/var/www/straped/mufon/html2text/32489.html.txt","/var/www/straped/mufon/org/32489.html"],"Longitude":"-74.148301","Log Number":"US-10092011-0018","Case Number":"32489","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile"}