{"Object Shape":"Oval, Sphere","Disposition":"Unknown","Log Number":"US-10102011-0003","Tags":"City","Region":"Missouri","Date of the Event":"10/09/2011 04:00 UTC","Summary":"glowing object in the sky!","Viewing Distance":"101-500 Feet, Unknown, N/A","Longitude":"-90.75","divs":["Sighting DetailsI was driving home from work when I noticed a shining light moving at incredible speed through the sky changing directions and zipping back and forth as I observed this I let my car slow to a stop and just sat and watched the sky it never crossed my mind of other traffic however there were other vehicles anyhow as I watched this object it slowed to a hover and seemed a ways into the distance but then it began to glow and it glowed brighter and brighter until its light was blinding and impossible to overlook its light seemed to be only yards away and then the glow began to disappate and shrink back to its original position only when the shape took form again it seemed to be oval shaped and n longer sphere shaped I watched until it was almost impossible to see and realized I should get moving since I was at a stop in the middle of the road as I began to take off again I noiced that everyone else had also stopped their vehicles and some were standing in the road next to the vehicle when I began to move I suppose it sparked the same thought into the others and they loaded up and started moving aswell noone said anything to each other during the sighting I could overhear some people saying what the hell and holy **** and oh my god but as it disappeared noone had anything to say to each other we all just went our own ways. These sightings are growing to be the normal thing around here every day or night at any point one can simply go outside and see a ufo everyone here knows about them only noone here talks about them this isnt even the first or most influeincing contact I've had just the most recent."],"Object Features":"None","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Wildwood","There were no other sightings in Wildwood on or around October 9th 2011"],"files":["/var/www/straped/mufon/html2text/32497.html.txt","/var/www/straped/mufon/org/32497.html"],"Case Number":"32497","Date Submitted":"10/10/2011 02:15 UTC","Country":"United States","City":"Wildwood","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering,Other","Latitude":"38.481389","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.481389,+-90.75(32497)&iwloc=A&hl=en\"> mufon case (32497) map </A>"}