{"City":"Atlanta","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.80676,+-84.37556(32499)&iwloc=A&hl=en\"> mufon case (32499) map </A>","divs":["Sighting DetailsIt was a very clear summer day and I was exiting a drug store around lunchtime and a movement and reflective surface caught my attention in the air above me. I looked up to see a metallic looking sphere about 6 to 8 feet in diameter moving in a straight line about 125 to 150 feet above ground. It did not waver or alter it's course and moved very slowly and deliberately. It appeared to be like a large \"pinball\" as it was all chrome and very mirror-like in it's reflective appearance. I watched it until it went out of sight. It lasted maybe 2 minutes total. The very next day I was again at the same store (lunchtime) and upon exiting I saw the exact same scenario developing again. This time a small family was also coming out of the store and I made them aware of the object to get someone else's corroboration and opinion. The couple had one child with them which upon seeing the \"ball\" began to cry and asked his father if \"they\" were going to take them away. Again the sphere never wavered or deviated from it's course at all. I did not have a phone with a camera and was probably too much in awe to use one if I did. It is however indelibly etched into my memory. I have tried to see it again at the same time and place but I have not seen it since. I am a pilot and a skilled observer and I assure you this was not a technology that I am aware of. All I can add is it was very awe inspiring."],"Case Number":"32499","Summary":"Observed silver sphere","Country":"United States","Date of the Event":"06/15/2008 01:00 UTC","Object Features":"None","Log Number":"US-10102011-0002","Longitude":"-84.37556","Tags":"City","Sighting Duration":"00:02:00","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around June 15th 2008"],"Weather Factors":"Unknown","Date Submitted":"10/10/2011 07:08 UTC","Object Flight Path":"Straight-line path","Latitude":"33.80676","Object Shape":"Sphere","Region":"Georgia","Viewing Distance":"101-500 Feet","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32499.html.txt","/var/www/straped/mufon/org/32499.html"]}