{"Object Features":"Patterned Surface","Disposition":"Unresolved","Viewing Distance":"Unknown","City":"Springfield","Date of the Event":"10/09/2011 10:00 UTC","Case Number":"32503","Longitude":"-89.556876","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around October 9th 2011"],"Latitude":"39.825901","Weather Factors":"Unknown","Log Number":"US-10102011-0007","Object Flight Path":"Hovering then path","Source":"MUFON","Date Submitted":"10/10/2011 12:50 UTC","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy Aunt was staying the night with me at my apartment, she went out to have a smoke a few minutes later asked me to come out and look at something. She pointed at the sky and asked me if her eyes were playing tricks on her or does that star look like it is blinking. I look at were she was pointing and it looked to me like it was blinking then we noticed that a red light seemed to eminate from it and move from side to side and then a light blue light did the same thing. Almost as if it was spinning but it was so far away we couldn't tell it was spinning or not. We could definately see that is was blinking with red and blue lights. As we kept watching the sky we noticed more of the same type of objects in the sky all with the same caractoristics of the first object. from 10:00pm to 11:07pm we were able to see 7 objects with the exact same caractoristics as the first one. All 7 objects also seemed to move from side to side and up and down at different time. Also within the same time period we saw what looked like a shooting star which shot toward the NW of where we were looking. Then at about 10:45pm we notice a larger formation (cluster)of dim but white lights off to the right where we were standing and it seemed to have a triangle space and move up and down then side to side but never straying from its original position once it finished moving. This larger object also seemed to have a ridge going down the middle of from the tip of the triangle to the middle of the bottom of it and then a ridge on each side going out to the other 2 points of the triangle. It was grey in color and very hard to see against the night sky. It was definately not a plane as we saw 2 planes go by with their red flashing lights. All 8 objects totally looked totally different than the planes. We also notice a sound of a jet type engine come into hearing range but we could not see it at all. The sound was like a jet engine with a humming sound at the end. It was unlike any jet engine I have ever heard and I have lived near airports most of my life. The only rational explaination I can come up with is that they are unidentified flying objects. I would like to know if anyone else near my area saw these last night."],"files":["/var/www/straped/mufon/html2text/32503.html.txt","/var/www/straped/mufon/org/32503.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.825901,+-89.556876(32503)&iwloc=A&hl=en\"> mufon case (32503) map </A>","Region":"Illinois","Object Shape":"Circle, Star-like, Triangle","Tags":"City","Summary":"About 10:00pm my a Aunt asked me to look up into the clear night sky to see if I see what she sees and I saw what looked like a star that was blinking with occasional red and blue pulses of light"}