{"Country":"United States","Longitude":"-94.382016","files":["/var/www/straped/mufon/html2text/32507.html.txt","/var/www/straped/mufon/org/32507.html"],"Object Features":"None","Summary":"Three orange glowing spheres in my backyard","map":"<A HREF = \"http://maps.google.com/maps?q=38.922603,+-94.382016(32507)&iwloc=A&hl=en\"> mufon case (32507) map </A>","Date of the Event":"10/03/2011 02:10 UTC","Region":"Missouri","Source":"MUFON","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","City":"Lee's Summit","Tags":"City","divs":["Sighting DetailsAs reported to ASD by phone and e-mail: \"I let the dog out of the back door of my house because he was barking at something - at first I thought he just needed to go out, but he stopped and looked up after he reached the edge of the patio. I stepped outside and looked where the dog was looking and saw three spheres floating at about 30 feet off the ground not 50 feet away from me. They were glowing a bright red-orange and looked like they were on fire. My first thought was that they were meteors, but I realized that they couldn't be. The objects were close together - maybe 10 feet apart - and were probably each three feet in diameter. They moved slightly while floating there and kind of pulsed. I was just too shocked to move, and afraid to draw attention to myself. I did not have a camera so couldn't get a picture. They stayed in that position for approximately 5 minutes, then moved slowly off in an Easterly direction - as if they didn't care if anyone saw them or not. I did not see wings, or a tail or any lights. The next day I spoke to some neighbors about it and one said they saw something similar earlier that evening but that it was only one ball of light, not three. He said it was right at tree-top level and then shot off quickly to the East. I just thought that someone should know about this since there have been so many reports lately.\""],"trends":["There have been 52 other sightings in Lee's Summit","There were 14 other sightings in Lee's Summit on or around October 3rd 2011"],"Weather Factors":"Unknown","Case Number":"32507","Disposition":"Unknown","Latitude":"38.922603","Date Submitted":"10/10/2011 03:03 UTC","Viewing Distance":"21-100 Feet","Log Number":"US-10102011-0011","Object Shape":"Fireball, Sphere"}