{"Source":"MUFON","Date of the Event":"10/09/2011 04:00 UTC","Case Number":"32505","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Country":"United States","files":["/var/www/straped/mufon/html2text/32505.html.txt","/var/www/straped/mufon/org/32505.html"],"Object Features":"Wings, Unknown","Region":"Indiana","Longitude":"-85.378036","Sighting Duration":"Undisclosed","Object Shape":"Boomerang, Circle","Tags":"City","Viewing Distance":"Unknown","Summary":"Last night I saw lights that HAD to be artificial flickering in a pattern and descending to the right and two smaller objects on both sides that appeared similiar in every way but size.","divs":["Sighting DetailsLast night (or early this AM) at about 3:50 AM I was letting my dog out and looked up in the sky to notice a Light that appeared to be far away like a star, but, the light seemed closer and was flickering at a fast rate and very bright. It would flicker between white and some blue greenish and then have a flash of Red in two spots. To me it seemed either it was in a circle shape and what I was seeing was rotating lights on the bottom of a darker then the sky object. Either it was a circle laying flat and I was seeing the front end and some of the backside...or the light that wrapped upward to look like wings was actually highlighting a circular object. I could draw it if needed. Then I lloked to the left and right and noticed on each side at a good distance from the object a boomerand shaped light that would seem like a pattern of stars, until you notice them moving closer to each other, these lights seemed red and white in nature. The Big object or lights started to descend to the right over the next 40 minutes while the on to the right moved to the left and the one on the left moved down and to the right. At approximately 4:45 I looked up again and could not see any of them..."],"City":"Muncie","Latitude":"40.189487","trends":["There have been 13 other sightings in Muncie","There were no other sightings in Muncie on or around October 9th 2011"],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.189487,+-85.378036(32505)&iwloc=A&hl=en\"> mufon case (32505) map </A>","Date Submitted":"10/10/2011 02:10 UTC","Log Number":"US-10102011-0009"}