{"Object Features":"None","files":["/var/www/straped/mufon/html2text/32506.html.txt","/var/www/straped/mufon/org/32506.html"],"divs":["sighting detailsi was driving to my farm in the country on a rural road. while adjusting my sun visor two shiney silver aircrafts caught my eye straight up in the sky. they were lower than an airplane, about 10k feet up. i saw one, then the other about a mile behind it in a straight line. i pulled over and got out of the car and tried to take pictures with cell phone, but did not show up on camera. i saw no wings. they were cigar shaped with a black band in the middle. the same as pictured in roger marsh's 9\\29\\11 article. they eventially disappeared out of sight. the day was very sunny, no clouds in sight, about 10 a.m. two days later, i was travelling about a mile away, also on my way to the farm and saw one of the same a\\craft. i grabbed my binoculars and saw the craft turn slightly upward and disappear into the sky. i know these are not airplanes; there were no wings, no sound or trail and hovered rather than flew. in the past, i have seen a blimp type craft with a fish tail hovering over the woods line near my farm. it seemed to be over the county waste area. no sound or movement, then disappeared. i saw this one about four times, but not since last spring. in all cases, i had no fear of the crafts, just a reluctance to report for fear of government contact."],"Date Submitted":"10/10/2011 02:54 UTC","City":"Harrington","Object Flight Path":"Path then hovering","Date of the Event":"10/07/2011 10:00 UTC","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Harrington","There were no other sightings in Harrington on or around October 7th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.970556,+-75.630931(32506)&iwloc=A&hl=en\"> mufon case (32506) map </A>","Object Shape":"Cigar","Longitude":"-75.630931","Summary":"cigar shaped aircraft shiney silver with black band in middle","Source":"MUFON","Case Number":"32506","Country":"United States","Sighting Duration":"Undisclosed","Region":"Delaware","Tags":"City","Latitude":"38.970556","Disposition":"Unknown","Weather Factors":"None","Log Number":"US-10102011-0010"}