{"Date Submitted":"10/10/2011 04:01 UTC","Region":"Tennessee","Summary":"Orange Ball with blinking craft that seem to come out of it","Longitude":"-86.571187","divs":["Sighting Details10.7.2011 This past Friday night around 9:30 pm very clear night no cloud cover, I was driving down this dark road to drop my husband off to his shared ride to work. On the way we seen this very bright orange light that was very out of place, hovering just above the treeline, it's never been there before as we take this road nightly. It looked like a bright orange ball of light almost star like, then a blinking (mostly white and some red lights) craft came out of it. I was watching the road as well and lost sight for a second but my husband said it should show up when we pass the trees and sure enough there it was traveling very fast with flashing, blinking, very fast lights almost to the point of looking like a sparkler that kids have on the 4th of July {best I can describe it} the orange ball of light that it came from seem to be gone. The blinking light would blink and the whole craft would shift left and then right,forward and then back,sometimes the lights would completely go out, there was absolutely no sound. Friday night is the first time we seen the orange light. It's almost like the orange light was a portal or vortex that the blinking object came out of or possibly the orange light turned into the blinking craft? We see this blinking object allot, almost every night. Later on I plan to buy a very good camera with a hella zoom lens so I can capture all the oddness that we see out here in Manchester, TN. USA!"],"Tags":"City","Viewing Distance":"101-500 Feet","Source":"MUFON","City":"Undisclosed","Weather Factors":"Unknown","Latitude":"35.521591","Country":"United States","Date of the Event":"10/07/2011 09:30 UTC","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"32509","map":"<A HREF = \"http://maps.google.com/maps?q=35.521591,+-86.571187(32509)&iwloc=A&hl=en\"> mufon case (32509) map </A>","Object Shape":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-10102011-0013","trends":[],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/32509.html.txt","/var/www/straped/mufon/org/32509.html"]}