{"City":"Pleasanton","Longitude":"-121.955411","Log Number":"US-10102011-0008","Object Features":"Unknown","Case Number":"32504","trends":["There have been 5 other sightings in Pleasanton","There were no other sightings in Pleasanton on or around October 10th 2011","This sighting has never been favorited.",""],"Disposition":"Unresolved","Summary":"Bright light spotted over Pleasanton","Sighting Duration":"Undisclosed","Date Submitted":"10/10/2011 01:45 UTC","Source":"MUFON","Date of the Event":"10/10/2011 12:00 UTC","Object Shape":"Unknown","Country":"United States","Latitude":"37.697008","divs":["Sighting DetailsAt 12:30, just before going to bed, i was peering at the night sky over Pleasanton. The moon was near full size and the sky was partially clear of clouds making a spectacular scene. I noticed a bright light vertically above me. This light was way brighter than all other stars in the sky. At first i thought it was a plane flying over and disregarded it. I also seemed to see 3 lights in a row. But as i continued to look at this i noticed that this object was not moving, its lights were not flickering. I immediately picked up my camera with the 250 mm zoom lens and focussed upward and began to click. One of my first pics showed 3 blurry lines. The light looked like a line because i shook the camera- dragging the light to appear like a line. It still did not make sense that i had 3 lines in the same pattern. I have attached the picture below. Then i went out to my patio and began clicking pictures. All the pictures i clicked looked like one bright light except one picture where you could clearly see a 3 light pattern with blue lights on the sides. Further i also shot a long exposure picture - all the stars in the sky made much thinner trails but this object made a thick trail- indicating a much brighter source. Im not at any point claiming this is a UFO- but id like to know what i saw. I then proceeded to get my 10x50 mm Nikon binoculars and i could see a 5 prong pattern on this object. This object stayed at the same spot for 2 hours. At around 2:30- the clouds began to cover the object and it dimmed out."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32504.html.txt","/var/www/straped/mufon/more/32504_submitter_file1__IMG_6771.JPG","/var/www/straped/mufon/more/32504_submitter_file2__IMG_6773.JPG","/var/www/straped/mufon/more/32504_submitter_file3__IMG_6857.JPG","/var/www/straped/mufon/org/32504.html"],"Tags":"City","Viewing Distance":"Unknown","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.697008,+-121.955411(32504)&iwloc=A&hl=en\"> mufon case (32504) map </A>","Object Flight Path":"Undisclosed"}