{"Weather Factors":"Unknown","Object Shape":"Triangle","Date of the Event":"10/04/2011 07:45 UTC","Longitude":"-94.392576","City":"Independence","Tags":"City","Object Flight Path":"Hovering then path,Path then hovering,Other","trends":["There have been 67 other sightings in Independence","There were 3 other sightings in Independence on or around October 4th 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/32514.html.txt","/var/www/straped/mufon/more/32514_submitter_file1__UFOSketch.jpg","/var/www/straped/mufon/org/32514.html"],"Latitude":"39.023696","divs":["Sighting DetailsTuesday night- October 4th, 2011- at about 7:30, I was coming home in my daughter's car. As I drove into my neighborhood, I glanced down the street where our clubhouse is. Above it there was a big mass of lights just sitting there. I had just watched a show about aliens the night before so I immediately thought, 'No, it can't be.' I thought it was too much of a coincidence and too crazy. I backed up and turned down that street and drove toward it. It just sat there! This gigantic mass of lights! As I got closer, I could see that it was a triangle shaped craft of some kind. It was only about 500 feet above the building, just hovering. It was black, but it looked like it was made out of mercury. I could see the whole underside of the craft as I drove slowly toward it. It had yellow-orange lights at each corner that pulsated and blue and white lights just inside the perimiter. They were very bright and they cast a bright light on everything below, but they didn't glare like our normal lights do. The light seemed to be a part of the surface. Just as I got in front of the clubhouse, it rotated and took off. It flew across the street and up over the trees toward my house in a straight line. I drove on down the street toward home and as I turned the first corner, there was a group of people running the same direction. I caught up with them just as I got to the last turn onto my street and one of the guys yelled, \"Did you see it?\" I said, \"Yes!\" He said, \"It was a freakin' space ship!\" I knew exactly what it was but it didn't really hit me until I heard him say the words. Anyway, I wasn't scared at all, but I had misplaced my cell phone somewhere in my daughter's car, or so I thought. I remember unplugging it that morning and putting it in my purse but couldn't find it later. I thought it fell out in her car. I didn't have any way of taking a picture without it. After I turned the corner, I could see it up ahead. It had stopped again just past my house. I drove down the street and pulled in the driveway honking my horn as loud as I could. I wanted my daughter to come outside and see it so my family wouldn't think I was crazy or something. She said she didn't even hear the horn and I was really laying on it. Anyway, I jumped out of the car, forgot to turn the engine off and left the door hanging open because I wanted to go get her and my camera. As soon as I got to the gate, it spun around and took off again. This time it went almost straight up and it was gone in a fraction of a second. I have never seen anything move that fast in my life! Those other people had been running down the street right behind me, but after it disappeared, they were gone too. I don't know who they were or where they went but it was really weird. They were right behind me one second and gone the next! I looked up and then back toward them and they were just gone. My heart was beating so fast by the time I got inside I could actually hear it. I think my daughter did too. She knew I wasn't kidding when I told her about it. I have never seen anything so strange in all my life. It was as big as three huge houses and it was just sitting there until I got close. Then, it went to my house and waited for me! That's how it seemed anyway. Later I looked all through my daughter's car for my phone and still couldn't find it. I went back in and then to my bedroom and there was my phone, plugged into the charger laying on my bed. I know I remember taking it off the charger that morning and putting it in my purse! I thought maybe it fell out and Malory put it back on the charger but she swears she didn't. I don't know how any of it happened, but it did. Looking back, it really scares me. Did that thing know where I lived? And what was up with those people and my phone? I feel like I'm loosing my mind but I am as sure about all of it as I could possibly be. I wish I could find those people but I'm not about to go door to door asking if the people who saw the UFO live there. I filled out a report on the National UFO Report site but I didn't bother to call the police. What could they do? Probably just laugh. The next day my other daughter told some friends at work about it and two of them said they had seen something that sounded like the same thing within the past week. I wonder how many other people have seen them around here? Anyway, I spent several hours on the computer looking at new aviation technology and I can't find anything that's anything close to being like what I saw. Then a friend said something that made perfect sense. If it was an experimental government or military aircraft, why would they be flying it over a neighborhood full of people? Why would they hover for so long allowing us to see it? I know, without a doubt, it was not from this earth. I knew it the moment I got close enough to see it. I never denied the possibility of aliens visiting earth, but that just took all doubt away. It was unbelievably amazing! Now I'm reading that other's in this area saw something similar around the same time. Wow!"],"Source":"MUFON","Country":"United States","Region":"Missouri","Disposition":"Unknown","Log Number":"US-10102011-0018","Object Features":"Dome","Date Submitted":"10/10/2011 06:51 UTC","Case Number":"32514","Summary":"Obvious Spacecraft visits Independence, MO neighborhood on October 4, 2011","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.023696,+-94.392576(32514)&iwloc=A&hl=en\"> mufon case (32514) map </A>","Sighting Duration":"Undisclosed"}