{"Case Number":"32519","Latitude":"39.834518","files":["/var/www/straped/mufon/html2text/32519.html.txt","/var/www/straped/mufon/org/32519.html"],"Viewing Distance":"21-100 Feet","Country":"United States","Log Number":"US-10102011-0023","Longitude":"-105.053269","Object Shape":"Circle, Disc, Oval, Sphere","divs":["sighting detailswe were walking out of the corner store at 76th and sheridan at 5:50pm on 10\\10\\11 and immediately noticed a big ball in the sky aprox 100-150 feet in the air, aprox 20-30 feet wide. at first it appeared to be a big dull grey ball. we both said, what in god's green earth could that be?! it appeared to be hovering in one spot, and then slowly started it's path southwest. as it moved, it morphed, from circle shaped to oval to boxy shaped to completely flat and disc like. as it moved and morphed it changed from a dull grey to what looked like gold plating. it seemed to morph and flash gold in a particular pattern, like it was spinning and one side of it was gold plated, the other side dull grey. we thought maybe it was a weather balloon, but how and why would it be morphing in a particular pattern, and how could it go into a boxy shape? could it be a mylar balloon? i've never seen one that was 20-30 feet wide. it was moving directly over sheridan boulevard so alot of people had to have seen it. we watched it go on it's path, getting smaller and smaller, sometimes we would lose sight of it, until it would flash gold again. we watched it until we could not see it anymore."],"Sighting Duration":"Undisclosed","Date Submitted":"10/10/2011 10:01 UTC","trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around October 10th 2011"],"Weather Factors":"Unknown","Summary":"a big morphing ball of gold. no lights.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.834518,+-105.053269(32519)&iwloc=A&hl=en\"> mufon case (32519) map </A>","Date of the Event":"10/10/2011 05:55 UTC","Tags":"City","Disposition":"IFO","Object Features":"Undisclosed","Region":"Colorado","Object Flight Path":"Hovering then path","City":"Westminster"}