{"Source":"MUFON","divs":["Sighting DetailsWe live just south of a typical flight path from the Vancouver International Airport. This object was first thought to be an airplane (passenger jet) leaving the airport east bound with its landing light on. Usually a jet like this has two landing lights but this object only had one very bright light on, what appeared to be the front. As this object moved toward us I noticed that there were no green or red wing lights, nor a tail light. At this point I realized that there were no wings. As the object was 90 degrees to us I realized that the light was not a landing light because if they were they would be facing away given the direction the object was traveling. In other words, the light was the same bright light at a 90 degree angle. As the object continued on the same easterly path, the same bright light conntinued to glow. At this point the object has passed us and was moving away. Eventully the object disappeared in the night sky. A few other factors were very important with this object: its flight path was significantly further south than a regular plane, appeared to be flying lower normal given the area (residential) and there was no noise coming from the object."],"Country":"Canada","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","City":"White Rock","Disposition":"Unresolved","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Log Number":"CA-10102011-0021","Date of the Event":"08/31/2011 12:00 UTC","Summary":"Large and bright ball of light, at first thought to be Airplane landing lights","Object Features":"Unknown","Date Submitted":"10/10/2011 08:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.033966,+-122.827755(32517)&iwloc=A&hl=en\"> mufon case (32517) map </A>","Case Number":"32517","trends":["There have been 2 other sightings in White Rock","There were no other sightings in White Rock on or around August 31st 2011"],"Latitude":"49.033966","files":["/var/www/straped/mufon/html2text/32517.html.txt","/var/www/straped/mufon/org/32517.html"],"Tags":"City","Longitude":"-122.827755","Region":"British Columbia"}