{"Date of the Event":"09/01/2011 12:00 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/32516.html.txt","/var/www/straped/mufon/org/32516.html"],"trends":["There have been 35 other sightings in Delray Beach","There were no other sightings in Delray Beach on or around September 1st 2011"],"divs":["Sighting DetailsI speak with a Law Enforcement Officer that has been seeing from 9 - 50 UFO's nightly unless overcast since August of 2011. As of today he has seen approximatley 200 or more. In his words they seem to suround a bigger brighter object in the sky. While we are speaking on the phone nightly then suddenly appear above him for 30-60 minutes nightly. I am reporting this because his fellow officers kibits him about it and I feel MUFON should follow up with this and video tape it for the Public being it is nightly. The area is above Boyton Beach which is fairly dark at night to see the sky much better if videoed. I myself have seen 9 different objests at various dates in the last 3 months that I can't explain the origin. One in particular I have seen 3 times which is like a opaqe Diode that lights up and then goes out. After it travels a certain distance it does it again. I don't know of any satellites that light up and yet nightly I can spot satellites so I know the difference. I hope some of you substantiate these nightly sitings in Florida."],"Region":"Florida","Object Features":"Unknown","Longitude":"-80.068398","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Delray Beach","Summary":"Nightly sitings of many UFO's","Case Number":"32516","Tags":"City","Object Shape":"Oval, Star-like","Disposition":"Insufficient Data","Date Submitted":"10/10/2011 08:33 UTC","Country":"United States","Weather Factors":"Unknown","Latitude":"26.468234","map":"<A HREF = \"http://maps.google.com/maps?q=26.468234,+-80.068398(32516)&iwloc=A&hl=en\"> mufon case (32516) map </A>","Log Number":"US-10102011-0020","Object Flight Path":"Path with directional change,Path then hovering"}