{"Longitude":"-90.04644","Case Number":"32520","Region":"Tennessee","Log Number":"US-10102011-0024","Latitude":"35.158154","map":"<A HREF = \"http://maps.google.com/maps?q=35.158154,+-90.04644(32520)&iwloc=A&hl=en\"> mufon case (32520) map </A>","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Date of the Event":"10/10/2011 02:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"10/10/2011 10:22 UTC","Object Features":"Wings","City":"Memphis","divs":["Sighting DetailsI was riding in a truck leaving downtown Memphis at 2PM. The base clouds were around 4,000 ft. As we went around the ramp to get on I40 I noticed two very dark objects in the sky right below the clouds. At first I thought they were buzzards, but I didn't see them move their wings. I then thought the objects might be kites but they weren't moving at all. I watched them for about 10 more seconds and decided to say something to the other two people in the truck. As I got half way through telling them to look at what I was seeing the two objects were just gone. I thought they may have gone into the passing cloud but they never came out. My friend, being sarcastic, said it was probably an airplane taking off. The thing is that the planes in Memphis don't depart over the downtown area. These two objects were solid black and hovering almost like when you see military planes flying in formation. The front was a big triangle with a skinny strip going from it to the rear smaller triangle. I had a phone with photo capabilities but the thought never crossed my mind to take a photo until it was too late."],"trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around October 10th 2011"],"Disposition":"Unknown","Country":"United States","Tags":"City","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/32520.html.txt","/var/www/straped/mufon/org/32520.html"],"Summary":"Large triangle in front, narrorow strip to rear, rear was smaller triangle"}