{"Tags":"City","files":["/var/www/straped/mufon/html2text/32533.html.txt","/var/www/straped/mufon/org/32533.html"],"Disposition":"Unknown","Object Flight Path":"Straight-line path","divs":["sighting detailsstood outside apartment with dog on leash,talking with wife and neighbor who was on her balcony on a second level. i walked five feet out in the grass and looked up at the stars on a clear night and was mesmarized by a faint grey outline of an object hardly noticable. two seconds pass and i'm certain the object was not a flock of geese. it's shape was that similar. three second pass and i instinctively take my eyes off it to reconfirm its position and at four seconds i see it folling the same course and speed heading directly towards the moon!! maybe now i'll surely see the object more clearly with the moon as a backdrop. but a five seconds it was directly above me and it just either absorbed the stars or completely disappeared. i think what little reflection i did see was due the moon light off the edge of the obect. this sign is exactly and i'm certain the shape and ufo i seen { if you can enlarge that sign to 1 and a 1\\2 feet then thats the length too."],"Date of the Event":"10/11/2011 07:51 UTC","Latitude":"43.999384","Viewing Distance":"Over One Mile","trends":["There have been 6 other sightings in Tomah","There were no other sightings in Tomah on or around October 11th 2011"],"Log Number":"US-10112011-0011","Sighting Duration":"00:00:05","Source":"MUFON","Case Number":"32533","City":"Tomah","Summary":"grey bommerang fuzy outline absorbed stars heading towards moon but no visual once past overhead. Tipped head and slight back arch from tip to create wings. AMAZING!!!!!!!!","map":"<A HREF = \"http://maps.google.com/maps?q=43.999384,+-90.500521(32533)&iwloc=A&hl=en\"> mufon case (32533) map </A>","Date Submitted":"10/11/2011 09:37 UTC","Weather Factors":"Unknown","Object Features":"Wings","Longitude":"-90.500521","Object Shape":"Boomerang, Triangle","Region":"Wisconsin","Country":"United States"}