{"divs":["Sighting DetailsI was outside on my deck at around 7:15pm. The stars are just becomming visible and i look up as I always do because I love looking at the stars and constellations. As I am doing so I see a small star like pulsating light travel above the small cloud cover in an opening in the cloud. (moon still visible through clouds) I watched it for awhile. It had to be up higher in the atmosphered and travelled faster than any satellite I have seen. The light was mainly pulsating, no blink at all. I waited as it would have been visible through the other side of the cloud it went above (it would have taken approximately 6 seconds top to travel back in a clear area of view) but it never came out. I immediately went onto spaceweather.com (as i do everyday) and checked for flybys. the only satellite that would be visible would be at 7:39 pm and i observed the satellite while writing this sighting. I have seen 2 other objects in this area a few months a part. one an orange fiery colored pulsating energy looking orb about 500 feet just before christmas last year with 1 other witness accross town. I was also watching the leonid meteor shower not too long ago and witnessed the same thing i did tonight, but this one did many maneuvers and changed directions."],"Tags":"City","Log Number":"CA-10112011-0010","Longitude":"-85.321084","trends":[],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"51.257795","files":["/var/www/straped/mufon/html2text/32532.html.txt","/var/www/straped/mufon/org/32532.html"],"Region":"Ontario","Object Flight Path":"Straight-line path","Summary":"star like object appeared and flew in a south eastern direction very fast","City":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"10/11/2011 07:46 UTC","Object Shape":"Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=51.257795,+-85.321084(32532)&iwloc=A&hl=en\"> mufon case (32532) map </A>","Viewing Distance":"Unknown","Disposition":"Unresolved","Date of the Event":"10/11/2011 07:15 UTC","Case Number":"32532","Country":"Canada"}