{"Summary":"Walking to our local firedepartment when i suddenly looked up and saw a hovering light.","Viewing Distance":"Unknown, N/A","Date of the Event":"08/19/2011 09:30 UTC","Sighting Duration":"00:02:00","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=46.643985,+-64.876464(32537)&iwloc=A&hl=en\"> mufon case (32537) map </A>","Source":"MUFON","Longitude":"-64.876464","Case Number":"32537","Date Submitted":"10/11/2011 11:31 UTC","Latitude":"46.643985","Country":"Canada","Tags":"City","Object Shape":"Circle, Sphere, Star-like","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","Object Features":"Unknown","trends":["There have been no other sightings in Rexton","This sighting has never been favorited."],"Log Number":"CA-10112011-0015","files":["/var/www/straped/mufon/html2text/32537.html.txt","/var/www/straped/mufon/org/32537.html"],"Region":"New Brunswick","City":"Rexton","divs":["Sighting DetailsI was walking to a friend of mines house to retrieve my bicycle which I had left there after visiting him. I had gotten a ride home with my mother, so now I had to make the journey back to grab my bike so I could get to school in the morning. Walking alone on the sidewalk with my mp3 playing, I noticed that the sky was full of very bright stars. Especially one that was brighter then the rest. Being the kind of person I am to just sit outside and watch the stars for hours and hours on end I decided to stand still and admire the wonderful starry night. When I came to a stop I noticed a more brightened star then the rest of the stars throughout the whole sky. Thinking it was another planet like Saturn or Uranus or even the international space station. I didn't really care for the bright \"star\" until it began to move. I was confused and I immediately shut off my music. Keeping my eyes on the weird star I folded up my mp3 and shoved it into my pants pocket. To see this bright object to which I thought was the international space station begin to move quicker and quicker. I came to realize it wasn't a satellite either. I knew this because the summer before, I sat in my yard counting satellites passing over head and noticing that satellites aren't bright nor as bright as this \"star\". Nor did the things I thought before were falling into the characteristic as this \"star\" object or UFO. With the object moving quicker and quicker I tried to make out any noise in the distance or any noise that wasn't necessary for a 9 o'clock stroll around my quiet neighborhood. I never heard any suspicious sounds or anything in particular. As I vaguely remember it seemed to be a sphere shaped glowing thing and growing slightly then shrinking slightly again. Just like a balloon when you let a little air out then blow some more back into the balloon to replace the lost air. After watching it for about a minute or two, I followed the path of this object with my eyes and followed the straight line in which it started to move towards the east. I watched it till I couldn't see it through the trees about a few hundred feet away from where I was standing. I was kinda freaked out from not knowing what it was. I also got another witness saying she saw the same thing in the sky the same night but was with other people not alone like I was."]}