{"Longitude":"-96.932091","trends":["There has been one other sighting in Giddings","There were no other sightings in Giddings on or around November 1st 1995"],"Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Cigar, Triangle","Latitude":"30.188766","Object Features":"Other","files":["/var/www/straped/mufon/html2text/32536.html.txt","/var/www/straped/mufon/org/32536.html"],"City":"Giddings","map":"<A HREF = \"http://maps.google.com/maps?q=30.188766,+-96.932091(32536)&iwloc=A&hl=en\"> mufon case (32536) map </A>","Source":"MUFON","Object Flight Path":"Hovering then path","Tags":"City","Log Number":"US-10112011-0014","Date Submitted":"10/11/2011 11:02 UTC","Region":"Texas","Summary":"Two Tx teachers witness UFO, truck over turned, troopers document, witnesses see it all the time","Case Number":"32536","divs":["Sighting DetailsSome time around 1995, I and a teacher I was dating came out of the diner in Giddings, Tx and headed east on HW 290. We noticed a bright light in the distance, towards Houston, under the cloud cover and it resembled a train light. We laughed since we had seen a UFO abduction movie and noted the time, 3:15 am. As we drove out approximately 10 miles towards Ledbetter, HW 180 I believe, we noticed that it was not a plane and was really about 5 miles north on HW 180 and 5 miles east of 180. We turned north on 180 and started getting pretty nervous, it appeared to be hovering and the light was very bright and it was apparent that it was a craft. We got home, 5 miles or so north on 180 and as I got out of the truck to get the gate, my girl yelled, \"look, it's moving\" and I saw it move at a high rate of speed at 90 and 45 degree angles, hundreds of miles an hour, and return to it's original position. I got my binocs and it was a cigar shaped craft with triangle shaped features on the bottom and top of the craft. We drove out the front gate, under trees, and it was gone when we got to 180. This was approximately 3:35am. The area it was over was towards Sommerville lake, but exactly over pasture land that was declared a federal oil reserve, hmmm. So, we took off to go look at the area but saw nothing. I went to the pay phone at Somerville lake entrance and called Lee county sheriff's dept and told them who I was (I worked in county law enforcement also, juvenile) and they said,\"Hey, there is a drunk mexican on HW 290 east of FM 180 a mile or so and he is claiming that a UFO came from teh north and ran him off the road and overturned his truck. But, call the next county over,Burleson county, and ask them.\" Then they said that they see this all the time and said I should report it. I called Burleson county, they said that they saw UFO's all the time and gave me MUFON's number and said that the exact place of the overturned truck was another county, Washington, which I called. They said the same thing, \"We see that stuff over Somerville lake all the time, report it. I got the exact location of the truck and drove out there. When we pulled up, there was a pickup truck overturned on the northside of HW 290, a mile or so, east of 180 with a trooper there and he had a mexican national handcuffed in the back. I showed him my badge, told him the story and ask to speak to the guy in the car. He walked back to his car, spoke to the man, then came back to me and said, \"He is a Mexican state police officer and does not want to talk to you, he said that this happens all the time in Mexico and he will get fired if he speaks about it.\" The trooper said they got the call at about 3:37 am....2 minutes AFTER we lost sight of the object. So, we went home, got up, and agreed that we had to investigate. We headed south on FM 180 to HW 290, headed east towards Houston. We stopped in at the next 5 stores, mostly antique stores, maybe a gas station, and asked them if they had seen any UFO's around. 4 of 5 people said yes. One pulled out a piece of paper, drew a cigar with triangles on top and bottom with one red light on top. I showed her my drawing and it was exactly the same but had two red lights. She said, and the 3 others did also, that they saw it towards Sommerville lake \"all the time\". One other lady, I believe in either Burton or Carmine, Carmine I'm thinking. She said that she had a friend whose husband was the fire chief and she saw them driving a flat bed with alot of dead pigs in it. She asked what happened and the wife said that they woke up and found the pigs with burnt off genitals. I called the jail then to bail the man out that overturned his truck and they said that they let him go since he was not legally drunk!!! But, they gave me the name of the man that got him out and it was a man that ran an auto parts store, dang, cant remember exactly where, but towards Brenham, maybe in Brenham. So, we drove there and asked him if he would call his, cousin I believe, and he said that he did not want to talk to anyone, period, since he might get in trouble. Also, I think that we talked to the people at the Sommerville lake store adn I think, I remember them saying they saw it. Another law enforcement officer had laughed at me, teasing me, but called me back in a year or so and said, \"I'm sorry for teasing you, I was headed back from Houston to Giddings and saw A UFO off HW 290 near where you saw it. Anyone near this area could take these steps to investigate: 1. Drive HW 290 from Giddings to Brenham and stop into each antique store, gas station and cafe and ask about seeing stuff over Sommerville lake. 2. Look up the police reports, if they are there, and document the name, I did have the info, but it has been to long. 3. Check out the auto parts stores towards brenham and ask about the person that works there with a cousin ? whom is a trooper in Mexico. 4. Drive the Sommerville lake, especially from FM 180 north past the lake and head east towards Sommerville and ask around. 5. Interview Lee county, Burleson and Washington county troopers, deputies and other county workers."],"Disposition":"Unknown","Sighting Duration":"00:20:00","Weather Factors":"Unknown","Date of the Event":"11/01/1995 03:15 UTC"}