{"Date of the Event":"10/11/2011 05:47 UTC","Viewing Distance":"Unknown","Object Features":"Undisclosed","trends":["There have been 15 other sightings in Raytown","There were no other sightings in Raytown on or around October 11th 2011","This sighting has never been favorited.",""],"Latitude":"38.997435","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.997435,+-94.471215(32535)&iwloc=A&hl=en\"> mufon case (32535) map </A>","Date Submitted":"10/11/2011 10:52 UTC","Sighting Duration":"Undisclosed","Region":"Missouri","files":["/var/www/straped/mufon/html2text/32535.html.txt","/var/www/straped/mufon/more/32535_submitter_file1__IMG_3381.JPG","/var/www/straped/mufon/more/32535_submitter_file2__IMG_3385.JPG","/var/www/straped/mufon/more/32535_submitter_file3__IMG_3367.JPG","/var/www/straped/mufon/org/32535.html"],"Weather Factors":"Unknown","Log Number":"US-10112011-0013","Disposition":"Insufficient Data","Source":"MUFON","divs":["Sighting DetailsI have been photographing these things for the past three years. But only in the last year have I been able to photograph so much! The photo I'm submitting was taken in downtown Kansas city, Mo. This morning at 5:47 am. I have tried without success to make everyone aware of these things as far back as the spring of 2009. Unfortunately there are so many of them here now that I don't think that it makes much difference. the fact that they are here is meaningless without knowing why they came here in the first place. People react slowly if at all to things like this. We have been duped for so long in to beleiving that Alien's don't exist, so now it will be extremely difficult to make people believe otherwise. The reason I took the picture in the first place was to prove that there is an ongoing incursion or deluge of these things. I had already taken additional photos in route to this location."],"Object Shape":"Sphere","City":"Raytown","Tags":"City","Longitude":"-94.471215","Case Number":"32535","Summary":"Disk shape craft downtown, a white energy ribbon or rod. orbs in all pictures.","Object Flight Path":"Undisclosed"}