{"City":"Lexington","Case Number":"32530","Source":"MUFON","Latitude":"38.03602","Disposition":"IFO","Summary":"4 orange lights following approx 2 min apart from NE then leveling and turning, each light appeared for approx. 20-30 sec, no tails","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Log Number":"US-10112011-0008","Date Submitted":"10/11/2011 02:30 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.03602,+-84.386638(32530)&iwloc=A&hl=en\"> mufon case (32530) map </A>","Region":"Kentucky","Longitude":"-84.386638","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around October 8th 2011"],"Object Features":"None","divs":["Sighting DetailsApprox. 9pm on Oct 8, 2011, in Lexington, KY, I saw an large orange, glowing light descending from the northeast on a slight trajectory to the southwest. It leveled off towards the west, continued awhile and then seemed to turn back to the north for a short period before it vanished. It was like a bright orange glow about 4-5 times larger than a star. It maintained the same color and had no trail. It came across somewhat fast but seemed to slow when it leveled off in the sky moving westward. I called my wife and it appeared long enough that she was able to come out side and catch it before it disappeared. My two sons came out and while we were discussing it, another one appeared from the same proximity, on the same path and speed as the first. Two more appeared the same way and it seemed that there was about a two minute space between each appearance. I had nothing to calculate their distance but they were far away and high in th sky. A couple of planes were in the sky at the same time and the lights seemed to be higher than they were which would mean, I think, that they had to be fairly large. One son tried to take a picture with his camera and one tried to take a picture with his phone but neither one produced anything. I was visiting my son and went outside to get something from the car. It was a beautiful, clear night and I looked up in the sky just to admire it. It was not quite yet fully dark. I noticed the object because it was so large and orange. I knew right away that it wasn't a star and I had never seen a comet or anything like that before. I had no idea what the object was when I first saw it - maybe some weather balloon. My feelings were amazement, awe,and curiosity. I spent quite a bit of time discussing what we saw with my wife and two sons. I was somewhat disappointed because we could not figure out what they were. I was hoping that there would be something on the news or in the newspaper but there was nothing. Each object would curve to the north, possibly turning away from the earth, hard to tell, move a a steady but not fast speed and then just disappear."],"Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/32530.html.txt","/var/www/straped/mufon/org/32530.html"],"Country":"United States","Date of the Event":"10/08/2011 09:00 UTC"}