{"Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There has been one other sighting in Oregon","There were no other sightings in Oregon on or around May 10th 1987"],"Object Shape":"Cylinder","Sighting Duration":"Undisclosed","Country":"United States","City":"Oregon","Object Flight Path":"Hovering then path","Log Number":"US-10122011-0002","Summary":"small group of teenagers witness ufo hovering overhead,close distance, then took off at high rate of speed,followed by black helocopters.","Date of the Event":"05/10/1987 03:00 UTC","Source":"MUFON","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsMy neice and some of her classmates were at a lake 4 miles from town having a few beers, when they all noticed a ufo overhead. they were all amazed as it was fairley close to them.then what seemed to be only minutes it took off followed by several black helocoptors. once they all started talking about the event that just happened,one of them realized that a full hour had passed by, not just a few minutes. several months later at a big lake in northern idaho, she saw the same ufo, and experienced time loss again.It should be noted that my neice also has some pshycic abilities as does her mother.The following year she was in a car crash which she was a passenger and hurt her wrist. upon examination by the DR.they found a small triangular black metal object,which was removed and unfortunatly discarded as the dr. had no idea what it was.well as it turned out she had two(2) more of these objects removed later as they were thought to be cists.one was in her breast and the ohter in her arm. I really wish she would go under hypnosis as I am sure she has alot of info. Like I said she does have some pshychic abilities,she can see ghosts, and can sometimes predict events ect.This is no joke.it is real. I am not sure of the names of the other witnesses in the first event, but she does.If you would like to speak to her about this you may contact me and I will arrange it if possible."],"Tags":"City","Longitude":"-83.419843","Object Features":"Unknown","Latitude":"41.65351","Date Submitted":"10/12/2011 06:24 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.65351,+-83.419843(32543)&iwloc=A&hl=en\"> mufon case (32543) map </A>","files":["/var/www/straped/mufon/html2text/32543.html.txt","/var/www/straped/mufon/org/32543.html"],"Case Number":"32543","Region":"Oregon"}