{"Country":"United States","Log Number":"US-10122011-0007","City":"Encinitas","trends":["There have been 13 other sightings in Encinitas","There were no other sightings in Encinitas on or around October 11th 2011"],"Date of the Event":"10/11/2011 09:45 UTC","Object Features":"None","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"10/12/2011 12:05 UTC","Summary":"A black triangle, size unknown, with white lights lining two sides and one line of lights down its center--all lines meeting at one point--hovered/moved over a street. Direction changes were quick and the object was silent. 10/11/11 21:45 Encinitas, CA.","Tags":"City","Viewing Distance":"101-500 Feet","Case Number":"32547","Longitude":"-117.287242","Object Flight Path":"Path with directional change","Object Shape":"Triangle","divs":["Sighting DetailsDriving in a residential area in Encinitas, CA on October 11, 2011, 2011 at 21:45, I saw bizarre lights in the sky above the street. The lights descended, coming closer. The object was still unrecognizable and, curious, I stopped the car, pulling over to watch. It was a black triangular object with white lights lining two sides and one line of white lights going down the middle of the object; the three lines of lights met at one of the triangle's points. I rolled down my window to see if the object was making any noise. It was completely silent. It moved rapidly, changing direction quickly. It appeared to be perhaps 100 feet above the car at its lowest altitude. It's difficult to say its size, but I had the impression that it was perhaps 3-5 feet in diameter. It moved above my car, making it difficult to see (since I inside). With another car moving up the street behind me, I drove on. The experience lasted about a minute."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.040147,+-117.287242(32547)&iwloc=A&hl=en\"> mufon case (32547) map </A>","Region":"California","Latitude":"33.040147","Disposition":"Hoax","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/32547.html.txt","/var/www/straped/mufon/org/32547.html"]}