{"Source":"MUFON","Tags":"City","Latitude":"39.852546","City":"Westminster","files":["/var/www/straped/mufon/html2text/3255.html.txt","/var/www/straped/mufon/org/3255.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsSighting Report: This has been a long time, but i feel i need to share this,, as this really happened, and this is real. 190 Description: It was,, i believe, the summer of 1973,, my brother and i,, were born in california, my brother was born in 1959,,, i was born in 1060. we were told by our father, who was in to air force,, to look up to the sky,, when we were just little kids,, so we did,, and my dad, knowing about satalites, and falling stars, pointed these things out to us boys,, and we were fastenated by looking up to the night sky,, and identifying these objects, ,, he then worked for howard hughes aircraft, then locheed, then martin marieta, worked on the 2nd spacecraft that went to mars,, the vicking 2, my father went on to I.B.M, and finally retired from I.B.M. It was my fathers having us boys looking up into the night sky that led me to the sighting, that i wish i did nt ever see,, myself and my brother studyed the night sky during the early 1970 s colorado sky,,and we saw a lot of things we had never seen before, even though we had stuydied the skys back in california, and even out in the desert. But here in the mountains of colorado, we began seeing all sorts of things,, much more than the usual narural things like falling stars, and things like satalites, were much more obvious than in the city, but i remember this very clearly, i was waching a very distant,, dim pin point type of light,, moving across the sky, at a very slow, steady speed, and i said to my brother,\" there s another satalite\" i am not sure if my brother ever even found this one,, it was allways very hard,, because of the vastness of the sky,, for either one of us to be able to find what each other were looking at,, sometimes, we would find the moving object that the other was looking at, sometimes,, not. this was the 1st one i saw,, that blew me away.. it was just a very distant piont of light, i mean, way up there, i thought it was a satalight, but it just changed direction, sharply,, like off maybe 40 degrees, no speed change, it was way ,, i mean WAY up there, moving very slowly across the sky,, just like a regular satalite,, but it made a instant,, 40, maybe 45 degree change in direction,, satalites do not do this,, i know,, because my father told us this is not possible, and i have never seen this before. my brother both witnessed this, and we knew ,, and have been waching the sky for years,, we made it a hobby, because of dad, this object made a sharp course redirection, it was like looking a line on a drafting board. its going this, way,,, then,, all of the sudden,, sharp angle, instantanious re direction off on some angle,, this did not scare me, i just couldny make any sense out of it. In that same year, i witnessed the scaryiest thing i have ever seen in life. i do not EVER want to see anything like ever again. 1 was, i believe, about 13 years old, at that time. my father was driving us up hwy 119, between golden colorado,. and the little town of blackhawk colorado,,,it was very late, after midnight,, my father was driving the \"71\" duster that he had at the time, my mom was in the passenger seat,, i was in the back seat,, on the right side,,and my brother was on the left side of me,, in the back seat. it was late,, we had visited some friends of my parents in denver,, and we were driving back up through the canyon, up hwy 119, and there are very steep mountains on each side,, and as a sky watcher, i was watching,, whenever i could see,, and this night, there was clear sky s ,, and as we turned a corner,, almost all the way home to blackhawk, a very large,, about the size of the moon, ball of light caught my eye, out of the left corner of my eye,, at first,, because it was so large,, and seemingly regular,, i thought it was the moon, but, it moved! and i looked at it,,, AND IT WAS NOT THE MOON!! it was some sort of gasious ball of light,, it overall was,, like i said,, if you just saw it out of the corner of your eye,, and didnt actually look right at it,, you would have easily have mistaken it for the moon. but i caught something moving within it,, so that is when i looked right at it,, it was not the moon, it was moving,, up,, then down,, then up,, then down a little farther, then up,, the drop a little farther, slowly desending,, behind the mountain top,, i got a very good look at it,, it had a \" erie, gasious, moving center, it had a brighter outer ring, around it, it was solid,, you really had to look at it to disginguish these features. again,, i thought it was the moon,, once i noticed it was moving,i knew it was not. i yelled to my dad,, my mother,, and my brother,, \" look mom,, look,, !!! because it was decending behind the mountain,, my mom saw it,, she said to my dad,,bill. there s something up there! my father was driving,, and we were winding up the canyon,, he did not see it. this is not some sort of flying saucer,,, this was some sort of gasious ball of light,, some sort of natural,, or maybe made man thing,, i once saw a program that said that the rocky mountain arsinal pumped a bouch of mustard gass, and all sorts of chemical waste into the ground, and the gasses from this are now comming up through the old mine shafts in the blackhawk,, central city area, as this area is litteraly is like swiss chese with these old mine shafts. i do not believe this theory,, my brother and i stuyded the skys after this,, although we were scared to even look at the sky for a long time. but we have never seen anything else since. 190 Description: It was,, i believe, the summer of 1973,, my brother and i,, were born in california, my brother was born in 1959,,, i was born in 1060. we were told by our father, who was in the air force,, to look up to the sky,, when we were just little kids,, so we did,, and my dad, knowing about satalites, and falling stars, pointed these things out to us boys,, and we were fastenated by looking up to the night sky,, and identifying these objects, ,, he then worked for howard hughes aircraft, then locheed, then martin marieta, worked on the 2nd spacecraft that went to mars,, the vicking 2, my father went on to I.B.M, and finally retired from I.B.M. It was my fathers having us boys looking up into the night sky that led me to the sighting, that i wish i did nt ever see,, myself and my brother studyed the night sky during the early 1970 s colorado sky,,and we saw a lot of things we had never seen before, even though we had stuydied the skys back in california, and even out in the desert. But here in the mountains of colorado, we began seeing all sorts of things,, much more than the usual narural things like falling stars, and things like satalites, were much more obvious than in the city, but i remember this very clearly, i was waching a very distant,, dim pin point type of light,, moving across the sky, at a very slow, steady speed, and i said to my brother,\" there s another satalite\" i am not sure if my brother ever even found this one,, it was allways very hard,, because of the vastness of the sky,, for either one of us to be able to find what each other were looking at,, sometimes, we would find the moving object that the other was looking at, sometimes,, not. this was the 1st one i saw,, that blew me away.. it was just a very distant piont of light, i mean, way up there, i thought it was a satalight, but it just changed direction, sharply,, like off maybe 40 degrees, no speed change, it was way ,, i mean WAY up there, moving very slowly across the sky,, just like a regular satalite,, but it made a instant,, 40, maybe 45 degree change in direction,, satalites do not do this,, i know,, because my father told us this is not possible, and i have never seen this before. my brother both witnessed this, and we knew ,, and have been waching the sky for years,, we made it a hobby, because of dad, this object made a sharp course redirection, it was like looking a line on a drafting board. its going this, way,,, then,, all of the sudden,, sharp angle, instantanious re direction off on some angle,, this did not scare me, i just couldny make any sense out of it. In that same year, i witnessed the scaryiest thing i have ever seen in life. i do not EVER want to see anything like ever again. 1 was, i believe, about 13 years old, at that time. my father was driving us up hwy 119, between golden colorado,. and the little town of blackhawk colorado,,,it was very late, after midnight,, my father was driving the \"71\" duster that he had at the time, my mom was in the passenger seat,, i was in the back seat,, on the right side,,and my brother was on the left side of me,, in the back seat. it was late,, we had visited some friends of my parents in denver,, and we were driving back up through the canyon, up hwy 119, and there are very steep mountains on each side,, and as a sky watcher, i was watching,, whenever i could see,, and this night, there was clear sky s ,, and as we turned a corner,, almost all the way home to blackhawk, a very large,, about the size of the moon, ball of light caught my eye, out of the left corner of my eye,, at first,, because it was so large,, and seemingly regular,, i thought it was the moon, but, it moved! and i looked at it,,, AND IT WAS NOT THE MOON!! it was some sort of gasious ball of light,, it overall was,, like i said,, if you just saw it out of the corner of your eye,, and didnt actually look right at it,, you would have easily have mistaken it for the moon. but i caught something moving within it,, so that is when i looked right at it,, it was not the moon, it was moving,, up,, then down,, then up,, then down a little farther, then up,, the drop a little farther, slowly desending,, behind the mountain top,, i got a very good look at it,, it had a \" erie, gasious, moving center, it had a brighter outer ring, around it, it was solid,, you really had to look at it to disginguish these features. again,, i thought it was the moon,, once i noticed it was moving,i knew it was not. i yelled to my dad,, my mother,, and my brother,, \" look mom,, look,, !!! because it was decending behind the mountain,, my mom saw it,, she said to my dad,,bill. there s something up there! my father was driving,, and we were winding up the canyon,, he did not see it. this is not some sort of flying saucer,,, this was some sort of gasious ball of light,, some sort of natural,, or maybe made man thing,, i once saw a program that said that the rocky mountain arsinal pumped a bouch of mustard gass, and all sorts of chemical waste into the ground, and the gasses from this are now comming up through the old mine shafts in the blackhawk,, central city area, as this area is litteraly is like swiss chese with these old mine shafts. i do not believe this theory,, my brother and i stuyded the skys after this,, although we were scared to even look at the sky for a long time. but we have never seen anything else since."],"Weather Factors":"Unknown","Date of the Event":"02/28/2005 09:46 UTC","Region":"Colorado","Longitude":"-105.049024","trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around February 28th 2005"],"Object Shape":"Undisclosed","Case Number":"3255","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.852546,+-105.049024(3255)&iwloc=A&hl=en\"> mufon case (3255) map </A>","Date Submitted":"02/28/2005 09:46 UTC","Log Number":"","Country":"United States","Object Features":"Undisclosed","Summary":"Not Provided","Disposition":"Unknown","Viewing Distance":"Unknown"}