{"Object Shape":"Circle, Fireball","Case Number":"32553","Date Submitted":"10/12/2011 04:53 UTC","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Longitude":"-87.974139","Source":"MUFON","Object Flight Path":"Hovering then path","Date of the Event":"10/06/2011 08:10 UTC","Weather Factors":"Unknown","divs":["sighting detailsmy family and i were driving from sam's club on the date and time mentioned above. while traveling northbound towards home i at first thought a firework had gone off because there were numerous reddish-orange ember like dots in the sky in a jagged pattern. as we got within a mile i noticed the lights stayed fixed in the sky. because there was an apartment complex in the area i thought maybe it was various apartment lights on until i noticed the lights were over the apartment building. we slowed down to look and all the lights but, after 1-3 minutes they disappeared. however, one remaining light descended and was following our vehicle on a parallel path about 1\\2 mile west of us. we pulled into a parking lot and lost sight of the object. we did however, notice a circular object in the sky many miles from us that constantly blinked every 2-3 seconds. initially, we wondered if it was a satellite but it stayed in a fixed location for at least 3-5 minutes before it disappeared from view. during the time we witnessed the objects, numerous planes went by, noticeable by their noise, and red and green lights. what we witnessed was not an airplane, group of airplanes or helicopter. i, nor my family, have ever witnessed anything like this before. i hope there are other reports of the incident because i know it had to have been seen by more people than ourselves."],"Region":"Illinois","Latitude":"42.220989","trends":["There have been 5 other sightings in Vernon Hills","There were no other sightings in Vernon Hills on or around October 6th 2011"],"files":["/var/www/straped/mufon/html2text/32553.html.txt","/var/www/straped/mufon/org/32553.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.220989,+-87.974139(32553)&iwloc=A&hl=en\"> mufon case (32553) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Log Number":"US-10122011-0013","Summary":"Multiple Orange Lights in jagged formation. Eventually the lights went off except one which began a horizontal flight path, parallel to us for 1/2 mile until it wasn't observable.","City":"Vernon Hills"}