{"Tags":"City","Object Flight Path":"Straight-line path","Log Number":"US-10122011-0011","Sighting Duration":"Undisclosed","Case Number":"32551","Object Features":"None, Other","Region":"Nebraska","trends":[],"Source":"MUFON","Disposition":"Unknown","Weather Factors":"None","Summary":"A bright dumbell shaped object flying faster than airplane slightly behind it, into the clouds.","Object Shape":"Other","divs":["Sighting DetailsI was in the backyard with my youngest, who loves airplanes. I was facing him, when he started hollering that he saw an airplane. I was busy and was placating him and didn't look. He started screaming and getting all excited that now he saw 3 of them. Again, I am facing him and he was looking behind me. He kept asking me to look but, I didn't turn right then. When I noticed he'd gotten really quiet, I glanced up at him and saw he'd tilted his head and looked confused. I asked him what was wrong. He asked me what something was. I turned to look and at first all I saw was the airplane and I told him it was an airplane. He yelled at me NO! This was not what he was talking about apparently. He pointed a bit in front of the plane, it was hard to say how far in front it was though. They looked to be about the same height in the air but, from the ground this would be hard to ascertain. It had to be closer to me though than the plane because I could see the outline almost perfectly. I mean, the plain with the contrail was so high up, it was hard to identify the wings but, I recognized the shape so, I knew it was a plane. That is a pretty normal thing. Two things struck me about this thing. One, that it was bright. I mean really bright and it was daylight. So, my first thought was that the sun must be reflecting off of it. But, the sun was in front of it and I was looking at the back and side of this thing and it was just really white, almost silvery or something but, the brightness of the object is probably one of the main things that made the shape so clear, I think. I've never seen a plane this bright and I used to live next to the airbase for years, so I know what planes look like! The second thing that struck me was the shape of it. I swear I've never seen anything like this and though I am hesitant to report a \"UFO\" as it were, nothing I've been able to think of has come close to matching it. It was dumbbell shaped! I had a circle in front and one in back as if the one end was the nose and the other circle was the tail. It was going fast, again from the ground I realize it is impossible to tell how fast it was going but, it was moving as fast as an airplane. Though truthfully, when I saw it, I thought it was going faster than an airplane and even now, when I try to reconcile what it was I saw, I still would swear it was going faster than a plane. It was so bright and so odd shaped that it even kept my son's attention until it flew into the clouds to the west. He continued to ask me what it was and true to fashion, I told him it was an airplane but, at the time watching, he knew enough to know it wasn't like an airplane he'd ever seen and it was most certainly not anything I've ever seen either. I tried to snap a picture but, by the time I got over my shock and turned on my camera, it was already half in the clouds."],"files":["/var/www/straped/mufon/html2text/32551.html.txt","/var/www/straped/mufon/org/32551.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.498937,+-99.897063(32551)&iwloc=A&hl=en\"> mufon case (32551) map </A>","City":"Undisclosed","Latitude":"41.498937","Date Submitted":"10/12/2011 04:32 UTC","Longitude":"-99.897063","Country":"United States","Viewing Distance":"Over One Mile","Date of the Event":"10/09/2011 02:00 UTC"}