{"Viewing Distance":"Over 1 Mile, Unknown","City":"Bensalem","files":["/var/www/straped/mufon/html2text/32558.html.txt","/var/www/straped/mufon/more/32558_submitter_file1__IMG_0979.JPG","/var/www/straped/mufon/more/32558_submitter_file2__IMG_0980.JPG","/var/www/straped/mufon/org/32558.html"],"Object Features":"Unknown","Object Shape":"Circle, Sphere, Star-like","Sighting Duration":"00:01:00","Case Number":"32558","Source":"MUFON","Latitude":"40.102762","Disposition":"Unknown","Tags":"City","Date of the Event":"09/16/2011 06:12 UTC","Country":"United States","Summary":"Sphere, Two Orbs, Extremely bright glow, disappeared after about 45 seconds with a small trail","Region":"Pennsylvania","Longitude":"-74.925728","trends":["There have been 10 other sightings in Bensalem","There were no other sightings in Bensalem on or around September 16th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.102762,+-74.925728(32558)&iwloc=A&hl=en\"> mufon case (32558) map </A>","Date Submitted":"10/12/2011 08:16 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsThe incident happened September 16 at 18:12 hours in the eastern sky. My wife and I were in our apartment due to a passing shower outside. Was watching TV when I noticed the incredible brilliant Rainbow in the Eastern sky through the window. It was completely amazing, so I called my wife to come out on our balcony. It was like nothing we have ever seen before in 58 years. There were three rainbows that were tight to each other when I noticed a 4th rainbow that was some distance from the other three but following the same path. I have never seen three of them before but when the forth appeared we were ecstatic. We started taking pictures of the rainbow with our phone cameras when my wife ran inside to get our digital camera. The rainbows were the brightest and most brilliant that we have ever seen. My wife started taking some pictures before it faded away. When we came in we never looked at the camera's photo's and put it away. I pulled the camera out a few days ago and looked at the photo's. I was shocked at what I believe she captured. I am nearly 90% sure she captured not only the rainbows but also 2 Orbs that came into the photo and in less that 30 to 45 seconds they were gone. I spent 10 years as a Navy Crash Rescue Captain in the Fire Department and I knew most of all my military aircraft visually and audibly that frequented my air station. Both Naval air stations were closed by re alignment of facilities and moved. No military or civilian aircraft that I'm aware of looked like this and there wasn't a sound from that location. I know we are just north of Philadelphia Airport and in a pattern for aircraft but air traffic is minimal at least. The second photo and the cell phone photo's were all taken seconds of each other. No Orbs, then two Orbs, then gone and looking at photo #1 under a zoom it looks like a White trail under the Orb and the Orb appeared to be headed straight up. I don't know what it was that we have pictures of but they weren't stars nor were they any aircraft that I'm aware of that can come into a photo and the next photo its gone. The part that is intriguing is the fact that I was looking up at that location the whole time admiring the rainbow and never noticed them. It wasn't until a few days ago when we were looking at the camera photo's that we observed the Orbs in the picture. We were just looking at the rainbow photo's when we noticed what we caught. A four banded rainbow and two Orb's.....Dumb luck I guess...would rather have won the lottery! The two attached photo's were from the digital camera and the others are in my cell phone and I don't know how to get them."],"Log Number":"US-10122011-0018","Object Flight Path":"Path with directional change,Other"}