{"Viewing Distance":"Over One Mile","Source":"MUFON","Object Features":"None","Object Flight Path":"Stationary,Path with directional change","Weather Factors":"Unknown","Longitude":"-97.479843","divs":["Sighting DetailsAt 8:50 PM, October 11, 2011, the night of the Full Moon, I was snapping photos of the Full Moon with my 1st Generation iPhone while in the country 15 miles due west of Fort Worth. I took six photos in 46 seconds from a stationary position through the moon roof of an SUV. There was some clouds around the moon and the moon glare was such that I did not think any photos would turn out viewable. I did not see anything other than a blue light in the corner of the iPhone viewer; but when I looked without the iPhone, I could not see a blue light and chalked it up to some camera artifact I was seeing. When I downloaded the photos, I was surprised to see not only a Blue Sphere in the bottom right hand corner of the photos, but a White Sphere within the clouds surrounding the Moon. As I checked each photo, the White Sphere seemed to move around in the clouds while the Blue Sphere remained stationary. I decided to take measure of the distance, angles and diameters of the Spheres in Photoshop. I was surprised to see that the diameter of both the Blue & White Spheres where identical & remained virtually the same, approximately 27 pixels within the six photos. The Full Moon was scheduled to arrive at 9:06 PM, twenty-six minutes later than the photos I took. I went back outside to just look at the Full Moon when a helicopter flew overhead towards the moon's direction. A helicopter flying overhead would not be unusual as they fly from Weatherford to Fort Worth almost nightly, an East-West flightpath. However, this one was flying Southeast. I don't know what to make of these photos, but I have never had something like this appear in any before. It was just very odd to have two different colored spheres appear in photos, one moving and one stationary over a 46 second interval - and both of them being identical in size. Further, the White Sphere's position would be nearly over the Joint Reserve Base - formerly Carswell Air Force Base."],"Object Shape":"Sphere","Tags":"City","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around October 11th 2011","This sighting has never been favorited.",""],"Disposition":"IFO","Log Number":"US-10122011-0017","files":["/var/www/straped/mufon/html2text/32557.html.txt","/var/www/straped/mufon/more/32557_submitter_file1__FMoonUFO-2b.jpg","/var/www/straped/mufon/more/32557_submitter_file2__FMoonUFO-3b.jpg","/var/www/straped/mufon/more/32557_submitter_file3__FMoonUFO-4bcopy.jpg","/var/www/straped/mufon/org/32557.html"],"Region":"Texas","Sighting Duration":"00:00:46","Country":"United States","Case Number":"32557","map":"<A HREF = \"http://maps.google.com/maps?q=32.742898,+-97.479843(32557)&iwloc=A&hl=en\"> mufon case (32557) map </A>","Latitude":"32.742898","Summary":"White Sphere & Blue Sphere Near Full Moon","City":"Fort Worth","Date of the Event":"10/11/2011 08:50 UTC","Date Submitted":"10/12/2011 07:55 UTC"}