{"trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around October 11th 2011","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Object Features":"Dome","Disposition":"Insufficient Data","Date of the Event":"10/11/2011 06:37 UTC","Country":"United States","Region":"California","Latitude":"34.3908","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.3908,+-118.526615(32562)&iwloc=A&hl=en\"> mufon case (32562) map </A>","Object Flight Path":"Stationary","Summary":"Hat shaped object hovering near Newhall Ave Exit off the 14 Freeway at Newhall","Longitude":"-118.526615","files":["/var/www/straped/mufon/html2text/32562.html.txt","/var/www/straped/mufon/org/32562.html"],"City":"Santa Clarita","Log Number":"US-10122011-0022","Case Number":"32562","divs":["Sighting DetailsOn Tuesday morning about 6:30am I was driving to work on Hwy 14 South. I had to slow as usual near Placerita Canyon Exit and proceeded at a slower rate (45mph) towards Newhall Avenue. As I neared the exit I noticed a dark object near the power lines to the East. I thought it was a helicopter at first hovering to watch traffic. Usually this occurs when there is bad traffic so I thought it unusual and it was darker than I would have expected. As I came near I looked over to see the object. The helicopter I expected to see was not there. The object was dark gray without reflection. Since it was not what expected, I stared for a moment trying to decide if it was a group of dark bags or material but that wasn't right either. The shape was closest to a hat with high brim and low top. It did not move. It hovered stationary. Morning light was just beginning to make dark objects stand out. I did not see it move in any direction. Due to the heavy traffic at this time of the morning, I was unable to observe it for any extended time. When I had driven past the point of seeing it directly out the side window, I followed it in my side mirror until I rounded the curve in the road. Seeing an object in the sky that I could not explain has never happened before. There wasn't a place to pull over on the highway. I wanted to be able to see it better but it was impossible. After I lost sight of the object I called my husband to tell him about what I saw. I wanted to describe the experience to someone so they could hear the details as I remembered them right away."],"Viewing Distance":"101-500 Feet","Date Submitted":"10/12/2011 11:59 UTC","Source":"MUFON","Weather Factors":"Unknown","Tags":"City"}