{"Country":"United States","Source":"MUFON","Log Number":"US-10122011-0020","Object Features":"None","City":"Lee's Summit","Date of the Event":"10/06/2011 08:45 UTC","Latitude":"38.903651","map":"<A HREF = \"http://maps.google.com/maps?q=38.903651,+-94.336758(32560)&iwloc=A&hl=en\"> mufon case (32560) map </A>","Disposition":"Unknown","Object Shape":"Triangle","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32560.html.txt","/var/www/straped/mufon/org/32560.html"],"Object Flight Path":"Path with directional change","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"32560","Date Submitted":"10/12/2011 09:04 UTC","trends":["There have been 52 other sightings in Lee's Summit","There were 9 other sightings in Lee's Summit on or around October 6th 2011"],"Viewing Distance":"Unknown","Summary":"Black. Shape of a streched triangle. Moving slow from SE to NW then turned S. No sound whatsoever.","Region":"Missouri","Longitude":"-94.336758","divs":["Sighting DetailsI was walking my dog like most nights. We were at SE 5th Terrace and Todd George Road. We were on the Prarie View Grade School property about 200 ft SW of the school building. My dog was sniffing the ground checking for mice. He spends a few minutes at that so I was just looking around while he did his thing. I was looking up at the sky facing SE just to the left of the church. After a few seconds I noticed there was a patch of sky with no stars visible. I kept looking at it because it was moving so slow and eventually it was obvious it had a triangle shape. It was creepy because there was absolutely no sound and it felt like the object was more stretching toward me than any obvious movement. It was getting larger and I felt it was more massive but I could see nothing but a flat black triangle against a fairly star-filled sky. It seemed like 2-3 minutes had passed. I looked down at my dog partly to check on him but I was also feeling a little shaken and wanted to change my focus. I looked back up about 10-15 seconds later and the point of the triangle was in the process of turning from it's NW direction and within a minute was moving south. I watched it until it disappeared against the night sky."]}