{"Disposition":"Unresolved","Tags":"City","Region":"Illinois","Weather Factors":"Unknown","Summary":"Weird object found in photo after taking picture.","Viewing Distance":"101-500 Feet","City":"Chicago","files":["/var/www/straped/mufon/html2text/32567.html.txt","/var/www/straped/mufon/more/32567_submitter_file1__indian.jpg","/var/www/straped/mufon/more/32567_submitter_file2__weirdobject.jpg","/var/www/straped/mufon/more/32567_submitter_file3__closeup.jpg","/var/www/straped/mufon/org/32567.html"],"Case Number":"32567","Object Shape":"Other","Date Submitted":"10/13/2011 08:24 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.778661,+-87.722774(32567)&iwloc=A&hl=en\"> mufon case (32567) map </A>","divs":["Sighting DetailsI'm from the southwest suburbs of Chicago. My wife and me travel into Chicago to take care of some business. On the way back we took a cruised thru my old neighborhood just to check it out and to see what has changed. We were going down 63rd St. going west and were coming up to Pulaski Rd. I then remembered about a giant Indian that is on the roof of this tobacco store (that's what it was when I was a kid it's something else now)on the northwest corner of 63rd and Pulaski Rd in Chicago. One time when I was a kid I was on the CTA bus going east on 63rd St. when the bus came to a stop at Pulaski. I was looking out the window and notice three teenage girls standing on the sidewalk right next to the bus. Two of the girls were pointing up at this Indian trying to show the third girl something and they all giggling. So I was wondering what they pointing and laughing at. So some time went by and then one day I went to the currency exchange right over there. On the way out I decided to walk over by the Indian to the same spot where I seen these girls laughing and pointing to see what it was they thought was funny. Well it turns out that if you look at the Indian from this exact spot his left thumb is sticking out and it looks like his thing is sticking out his pants. So when my wife and me were going by this Indian on August 22nd 2011 at about 2:00pm I decided to get a picture of this. I just got new smartphone and I wanted to check out how good the camera would work. So I got out of the car and went to the spot and took about four pictures of this Indian. So we left and went home and later on that night I went to look at the pictures I took. When I was checking these photos out, in one of the pictures I notice the object that was on the backside of Indian. At first I didn't think nothing of it, I figured it was plane or something. But just for the heck of it I enlarged it. It looked something similar to a bird or a bat, but then again it doesn't. So I have no idea what it could be. I was reluctant to send it in because I figured there was some explanation for what it is. But then I thought it still qualifies as UFO, because I never seen anything like it before and don't know what it could be."],"Object Flight Path":"Unknown","Country":"United States","Object Features":"Appendage(s), Other","Latitude":"41.778661","Log Number":"US-10132011-0005","Source":"MUFON","Longitude":"-87.722774","Sighting Duration":"Undisclosed","Date of the Event":"08/22/2011 02:00 UTC","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around August 22nd 2011","This sighting has never been favorited.",""]}