{"Latitude":"38.842732","map":"<A HREF = \"http://maps.google.com/maps?q=38.842732,+-104.815843(3256)&iwloc=A&hl=en\"> mufon case (3256) map </A>","divs":["Sighting DetailsSighting Report: My sighting was 27 years ago, and I did not report it to anyone at the time. I have decided to report it to this agency. On March 17th, 1978 at approximately 7:30pm in Denver, Colorado, my husband and I observed several UFO s. Initially, I was inside with my youngest child, my husband was outside with our 3 year son. We had been moving into our new home. My husband was reaching down into the cab of our truck to retrieve a box when he said it lit up like someone had turned large flashlight on. When he turned around, he saw a circular saucer right above tree level almost directly above him. He said it had square \"ice cube\" type lights circling around it, but no sound. He immediately ran inside and got me. When we both went outside, the ufo had moved to the southern sky, and was now a bright light about the size of a dime in the sky. No more than 20 seconds could have passed between him running into the house to get me and us getting outside. As we watched the object, it appeared to change shape, but I suspect this was because it was also changing colors, going from white to light blue, to orange and back. Something appeared to drop off of the ufo and trail to the ground. It was reddish in appearance. During all of this, I had jumped on top of the cab of the truck. While watching this ufo, I sensed something above and looked up to see another ufo directly overhead. It was much higher than tree level, but low enough to appear massive, about the size of a battleship. It blocked the lights from the sky, so I could easily make out its shape, which was like a diamond. It had three large amber lights (shaped in triangular formation) on the bottom. It was moving along at a fair rate of speed, but I heard no sound from it. It continued to coast along going towards Boulder, Colorado. I watched it till I could no longer see it. The other ufo we had initially seen also took off towards Boulder, Colorado at a very rapid speed. It hung over the area of Boulder for about a minute, then shot straight up and disappeared. We were not the only people to see this. Neighbors of ours had just arrived home and also witnessed this. About 10 minutes after these sightings we heard helicopters and jets around our area. I could not say if these were military, but it was unusualfor the area. We lived off Santa Fe in Denver, which is a very conjested area, not rural. Thank you, Kate Charon"],"Summary":"Not Provided","Date of the Event":"02/21/2005 07:47 UTC","Date Submitted":"02/21/2005 07:47 UTC","Object Shape":"Undisclosed","Longitude":"-104.815843","files":["/var/www/straped/mufon/html2text/3256.html.txt","/var/www/straped/mufon/org/3256.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","City":"Colorado Springs","Country":"United States","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around February 21st 2005"],"Region":"Colorado","Tags":"City","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Log Number":"","Case Number":"3256"}