{"Summary":"Single white ball of light. No flashing lights.","Weather Factors":"Unknown","Longitude":"-77.033356","divs":["Sighting DetailsI was driving to work along highway 16 eastbound. About a mile before the toll plaza for the Narrows bridge I saw a white light with flashing red lights right behind it. They were moving eastward. The lights were close enough together (the white light leading) that I thought it was a single airplane. But the white light quickly moved farther ahead of the flashing red lights moving independently from each other showing they were two separate craft. The red flashing lights were obviously an airplane, but the white light consisted of a single white orb-like light with no other flashing lights, and no flashing lights. The airplane appeared to be chasing the white light. They moved in a straight line in a direction which would take it across the Narrows and approximately south of Tacoma. I kept an eye on them as much as possible. As they moved closer toward the horizon they moved behind trees on the side of the freeway. I kept seeing them through several openings in the trees. Finally I came to a large open area and when I looked I saw the airplane but the white light was gone. The area is always filled with many airplanes due to the Sea-Tac Airport, and McChord Airforce Base, so I'm used to seeing a lot of planes. I'm not completely sure what this light was, but it definitely was odd enough to evoke questioning in my mind."],"Date Submitted":"10/13/2011 05:57 UTC","Date of the Event":"10/12/2011 09:25 UTC","Disposition":"Unresolved","Tags":"City","City":"Washington","files":["/var/www/straped/mufon/html2text/32564.html.txt","/var/www/straped/mufon/org/32564.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.896972,+-77.033356(32564)&iwloc=A&hl=en\"> mufon case (32564) map </A>","Viewing Distance":"501 Feet - 1 Mile","Case Number":"32564","Latitude":"38.896972","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around October 12th 2011"],"Country":"United States","Object Features":"Unknown","Region":"Washington","Sighting Duration":"00:04:00","Object Shape":"Sphere","Source":"MUFON","Object Flight Path":"Straight-line path","Log Number":"US-10132011-0002"}