{"Disposition":"IFO","Region":"Idaho","Latitude":"44.522242","Object Shape":"Triangle","City":"Cascade","Source":"MUFON","trends":["There have been 2 other sightings in Cascade","There were no other sightings in Cascade on or around October 17th 2004"],"Object Features":"Other","Case Number":"32561","Weather Factors":"Unknown","divs":["Sighting DetailsWhile hunting in October of 2004 in the forest near Sixteen to One Trail above Stolle Meadows I was standing outside my camp at approximately 10:00pm at night when I observed a strange Triangular Shaped Craft that made no sound and displayed a single lighted window in the center on the bottom of the craft. The window was not like a light as it was a pitch dark night with no clouds and yet you couldn't see a beam of light projecting from the source. The window just displayed a large white surface as if it were internally lighted. There were no other markings, lights or windows that could be seen on the craft. The craft moved from West to East approximately 1000 ft. or so above the ridgeline and even though it was approximately 2-3 miles away it was looking to be about the size of a 737 jetliner. I have seen jets passing by at that distance and even though they are much higher at approximately 30,000 feet you can see them clearly and even see the flame in their engines because the night is so clear. This had no visible source of propulsion and even though it was closer there was absolutely no sound emitted by it. I watched for approximately a minute as it moved from my right to my left and eventually passed out of sight behind the mountain. I was viewing it through the gap between the mountains as I looked toward Boiling Springs down the Sixteen to One Trail from my vantage point about 2-3 miles away towards Stolle Meadows. The craft would have to have been flying at a pretty low altitude as the Monumental Peak that it disappeared behind is only a little bit short of 8000ft. I have searched all pictures of any existing aircraft and have yet to find a craft that has a single large window or light in the center of a Triangle Shape."],"Summary":"Triangular Shaped Craft - No Sound-Single Light in Center on Bottom","Longitude":"-116.033908","Date Submitted":"10/12/2011 11:22 UTC","Log Number":"US-10122011-0021","Date of the Event":"10/17/2004 10:00 UTC","Object Flight Path":"Straight-line path","Tags":"City","files":["/var/www/straped/mufon/html2text/32561.html.txt","/var/www/straped/mufon/org/32561.html"],"Viewing Distance":"Over One Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.522242,+-116.033908(32561)&iwloc=A&hl=en\"> mufon case (32561) map </A>","Sighting Duration":"Undisclosed"}