{"Sighting Duration":"Undisclosed","Latitude":"39.806464","Summary":"Not Provided","Case Number":"3257","Longitude":"-105.085154","Object Shape":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Date Submitted":"02/25/2005 05:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.806464,+-105.085154(3257)&iwloc=A&hl=en\"> mufon case (3257) map </A>","Region":"Colorado","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around February 25th 2005"],"Log Number":"","City":"Arvada","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","divs":["Sighting DetailsSighting Report: I have a tape of 4 UFOs I saw from my backyard in the spring of 1993. I m pretty sure it was early spring, because the trees in my backyard are also in the film, and they have buds on them but are not fully leafed out. It was in the early afternoon, possibly 3:00 to 4:00 p.m. I just happened to have my camera handy (camcorder) because I had been filming my son earlier that day. At first I thought they were helicopters, but I have never seen helicopters move like this, and also they were close enough that, since there were 4 of them, I should have been able to hear something, but I couldn t hear anything. One of them had two perfectly round bright lights in the front, like headlights. The other 3 were just single, round bright lights. They flew back and fourth several times, then hovered, and then 2 of them crossed over each other. Then they were just gone. I tried to keep them together in frame as much as possible, but a few times, they got so far apart from each other, it was hard to do that, but I got pretty good shots of at least 3 of the 4. It s not a very long piece, maybe 3 to 5 minutes. I would be happy to share it with you. Let me know if you are interested. Thank you."],"Tags":"City","Date of the Event":"02/25/2005 05:56 UTC","files":["/var/www/straped/mufon/html2text/3257.html.txt","/var/www/straped/mufon/org/3257.html"],"Source":"MUFON"}