{"trends":["There have been 5 other sightings in Baker","There were no other sightings in Baker on or around October 7th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.580303,+-91.090401(32572)&iwloc=A&hl=en\"> mufon case (32572) map </A>","Object Features":"None","Source":"MUFON","Summary":"I see them every night now. What is going on???? Who are they? Are they good?","Weather Factors":"Unknown","Longitude":"-91.090401","divs":["sighting detailsit all started about a year ago when i got my first green laser in the mail. i took the kids outside to show them how amazing it was to shine the device towards the heavens. after pointing it towards the moon which was 3\\4 full and then towards a bright star, two low flying, extremely bright white objects traversed the exact intersection of where i had just shone the laser beams. it thoroughly frightened me and the kids and we ran to the house for cover. the objects, bright as the sun met just beyond the tree line and were gone. ever since that day, i have been seeing them every night i go outside to look for them (except on overcast nights of course). i don't know how but i think they can hear my thoughts, however i'm not sure how to prove this. i only know that as soon as i go outside and sit in my fold-back chair, they begin to appear within 60 seconds. they traverse the sky from all directions, sometimes one-in-front-of-the-other and sometimes side-by-side forming a barbell shape. my mother lives next door. after telling her what i'v been seeing, she comes out every night and witnesses these things also. for what its worth, my mom is retired from louisiana state department of transportation and i come from an avionics background with boeing aircraft including work with both civilian and military aircraft. i am familiar with most aircraft flying and not flying today, yet what i am seeing, along with known aircraft, are not classified as \"identified\". i have seen several times a strobe flash inconsistently in the same location, as if hovering for several minutes. i have seen several times a bright flash with a streak coming from the flash and then a bright orb materialize similar to star treks enterprise emerging from hyperspace. i have seen these orbs slow down and hover, then disappear as if it just turned down a dimmer switch. most recently i have seen a very large triangle (about the size of three boeing 747's) glide perfectly aligned over my house, just above the trees, extremely slow (almost a hover) heading exactly nne in a perfectly straight line. i estimate it took nearly 10 minutes for the thing to disappear beyond the tree line. the triangle had three extremely bright orb lights on all three points and one deep red, pulsating, ripple strobe in the very center. one week ago, october 6th and 7th with green laser in hand, i managed to communicate with the orbs. as i saw one pass directly overhead, i activated my laser with a solid beam in front of the craft and waited to see if the craft would run through my beam. as the orb approached my beam, i turned my laser off before he passed through. (i don't think he would appreciate it if i shined directly at him). as my laser turned off, he turned his light off. seconds passed and then two orbs side by side flew over me. the following night i see a bright orb. i flash my laser once near him. he flashes back. amazed, i flash my laser once again. he flashes one again. this continues five consecutive times, then i flash my laser far away from him and so he disappears immediately. this was communication without a doubt. there is so much more. often times i \"feel\" or sense when i'm about to see one. they do not obey my thoughts, however they seem to know them. if a request is genuine, they may choose to act upon that request. several times now i have seen a very large and bright streak of light come vertically straight down just beyond the tree line. those really frighten me for some reason. once, an orb acted as if it was shooting straight towards me, but it shrank back to it's original luminosity as i was indeed frightened. oddly enough, what did not frighten me was the triangle, mostly because it was moving so slow and seemingly non-imposing. i am at a loss as to who i'm seeing in the louisiana skies at night among the stars and passing planes. i suppose time will tell us who they are and what their mission is. i only hope they're the good guys."],"Disposition":"Unknown","Region":"Louisiana","files":["/var/www/straped/mufon/html2text/32572.html.txt","/var/www/straped/mufon/org/32572.html"],"Sighting Duration":"02:00:00","Object Shape":"Bullet, Missile, Circle, Flash, Sphere, Star-like, Triangle","Log Number":"US-10132011-0008","Date of the Event":"10/07/2011 07:30 UTC","Tags":"City","Latitude":"30.580303","Country":"United States","Case Number":"32572","City":"Baker","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Viewing Distance":"101-500 Feet","Date Submitted":"10/13/2011 05:17 UTC"}