{"Disposition":"IFO","City":"Brownsville","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=25.944673,+-97.451255(32578)&iwloc=A&hl=en\"> mufon case (32578) map </A>","Case Number":"32578","files":["/var/www/straped/mufon/html2text/32578.html.txt","/var/www/straped/mufon/org/32578.html"],"Summary":"high altitude flight path of strange orb, no anti collision lights","Object Flight Path":"Straight-line path","Country":"United States","Object Features":"Unknown","Date Submitted":"10/13/2011 10:11 UTC","Viewing Distance":"Unknown","Date of the Event":"10/13/2011 08:30 UTC","Region":"Texas","Latitude":"25.944673","Log Number":"US-10132011-0015","Longitude":"-97.451255","trends":["There have been 17 other sightings in Brownsville","There were no other sightings in Brownsville on or around October 13th 2011"],"Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["sighting detailsat about 8:30pm today 10\\13\\11 i walked out my garage towards my truck and i noticed this big orb, light, approaching from the southwest direction. it was as bright as the star or planet in the sky next to the moon. i called my wife out to see it and she was as puzzled as i was. the object was moving fairly slow then sped up a bit as it reached about an 85 to 90 degree angle right above. as the object passed overhead, there was no noise, or anything, but there was a low flying airplane on final towards the airport since our house is in the flight path to the airport. the airplane was a single engine cessna 172, same type i fly. it was fairly low at about 600 feet only. the object of sphere continued in an east northeast direction. as it passed overhead, it began to fade out or dissappear. just like that it was gone. no light what so ever. nothing. immediately following the object, clouds. solid, weird looking clouds. funny part is they formed, in the same line or path that the object took ! a completely cool, clear night with these clouds out of no where in line with the object that passed overhead. how weird is that. i tried to get a video with my phone but couldnt get the darn thing to work right."],"Object Shape":"Oval, Sphere"}