{"Region":"California","Date of the Event":"04/01/2008 12:00 UTC","trends":["There have been 5 other sightings in San Ramon","There were no other sightings in San Ramon on or around April 1st 2008"],"Longitude":"-121.969585","Log Number":"US-10142011-0007","divs":["Sighting DetailsI just want someone other than family to know how this has effected me.They made contact with me after i searched them on the computer.they are important and wise as well as psychic.Not to be feared but to be respected. I saw the mothership as well as 2 others that dont want to speak.it was like nothing on tv and its hard to talk about being it was so close and i had dreams about it before days before it appeared.I promised in my heart not to say anything before it appeared but they know i mean well and no disrespect.Im sorry if i offend you or them i dont mean to.its just a hard burden on my chest i thought i was strong enough for..as i was for some time because its been 4 years now.I dont have no shame in my game.I just dont want to get hurt or captured by us or them.so if i offended the gov or anybody i will never do it again.i appologize.As his is coming out i have tears holding back because its not that serious.It was very close and unacceptable.bright lights like an invisble set diamond charm or tv snow.surrounding curves ,no noise completely.red light on top and bottom.ahh feels better to say..i cant keep raising blood pressure holding things inside.\"I rather live high and fly than live and duck\"I dont know if anyone else is just playing around or on drugs..but this one has never been on tv or internet..if u dont believe me **** * ****.i have witnesses..i wouldnt waste my time on this ****.use your head..remember if you are christian ask yourself\"were the angels born on earth? was God?\" NO \"if your not born on earth your a what...alien\"use your head..God bless..those above us Bless and please protect me for speaking on things im not sure im suppose..I mean well if anything happens"],"Date Submitted":"10/14/2011 03:16 UTC","Tags":"City","Case Number":"32586","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/32586.html.txt","/var/www/straped/mufon/org/32586.html"],"Latitude":"37.788727","Disposition":"Hoax","Summary":"mothership,a mile big.supporting red dot planes.after their were regular planes","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=37.788727,+-121.969585(32586)&iwloc=A&hl=en\"> mufon case (32586) map </A>","Object Features":"Undisclosed","Source":"MUFON","City":"San Ramon","Weather Factors":"Unknown","Object Shape":"Oval, Saturn-like, Other"}