{"Longitude":"-75.137576","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Latitude":"40.10199","City":"abington","map":"<A HREF = \"http://maps.google.com/maps?q=40.10199,+-75.137576(32580)&iwloc=A&hl=en\"> mufon case (32580) map </A>","Case Number":"32580","Date of the Event":"10/10/2011 07:00 UTC","Log Number":"US-10142011-0001","Region":"Pennsylvania","Object Shape":"Boomerang, Chevron, Disc, Fireball, Flash, Sphere, Star-like, Triangle","trends":["There have been 2 other sightings in abington","There were no other sightings in abington on or around October 10th 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/32580.html.txt","/var/www/straped/mufon/more/32580_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/32580_submitter_file2__uufo.jpg","/var/www/straped/mufon/more/32580_submitter_file3__uufo.jpg","/var/www/straped/mufon/org/32580.html"],"Disposition":"Unresolved","Source":"MUFON","Object Features":"Dome, Window(s)","Viewing Distance":"Unknown","divs":["Sighting DetailsNotices geese making crazy patterns, then blackbirds, then ships. Starts off as yellow lights then more and more. Alot of train activity as well. First night say a red tail with a bright blue?green body fall to Earth as a missile. I hear the ships all the time. Plane like dui=ring the day with metallic body. Some are \"writers\" as I call them. Picture perfect days, with only clouds being the ones that linger from the \"planes\". At night, they are oval, plane like, triangle, boomerang, so many different ones. Some are very quiet while others loud and sound like they want to crash in my house. Tonday it is raining, but could hear them all day through the clouds. Most evident around 3 to 4 AM. Thatr seems to be the time the biggest, brightest, longest lingering ones come out. I see them with binoculars very clearly. So many skeptics! I never wanted to believe or even thought about them. But pics dont lie and Im not crazy."],"Summary":"many different ones all day and night. First noticed birds migrating then non stop ships/planes","Date Submitted":"10/14/2011 02:43 UTC","Sighting Duration":"12:01:00","Tags":"City","Country":"United States"}