{"Region":"Wisconsin","Sighting Duration":"Undisclosed","Longitude":"-87.966859","divs":["Sighting DetailsMy wife and I were on our deck because we had heard there would be a meteor shower that Saturday night. It was around 7:45 that we decided we'd see nothing, despite the fact that there was not a cloud in the sky, when I saw a BRIGHT orange globe moving across the sky, south to north in a straight line followed just a few hundred feet behind by an identical orange globe. We both stood up and watched as the two moved steadily to the north. When they disappeared a 3rd light appeared, also moving at a fast rate of speed (about the same speed as a small airplane) toward the north. We then went to our front yard (driveway) and watched as several other objects appeared, all following the first object and all traveling at the same speed and on exactly the same path. This lasted long enough for me to go get my camera and get pictures of 4 of the objects. One of them appeared bright white but all the others were a yellow-orange color. We thought perhaps they were Chinese lanterns, but there was absolutely no wind that night and they were moving very fast to the north. I watched them as they moved north and eventually got so far away that they disappeared. They did not go out, as you would expect a Chinese lantern, they just got too far away to see any longer, despite the clear night. We have seen chinese lanterns before in our area and these were distinctly different. For one, the lanterns always appeared as bright WHITE balls and stayed mainly stationary, climing higher into the sky, but not moving north, south, east or west. These lights were moving as a fast clip and in the same direction, almost on the same exact line, one behind the other. I have quite a few pics and have attached three examples (that's all I could attach) that feature the original picture (on the left) and a blow up of the picture you see. If you want I can send all of the pictures to you. I am the director of News and Information for 6 Clear Channel radio stations in Milwaukee and a veteran of 35 years in the news business and would not file this report as a joke. This really took place and I am extremely puzzled by what we saw as there was no obvious explanation. I talked about this on two of our stations (WISN and WOKY) and have since received reports from three listeners who observed similar events, but on different nights."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/32585.html.txt","/var/www/straped/mufon/more/32585_submitter_file1__cpic001x.jpg","/var/www/straped/mufon/more/32585_submitter_file2__cpic002x.jpg","/var/www/straped/mufon/more/32585_submitter_file3__cpic003x.jpg","/var/www/straped/mufon/org/32585.html"],"Summary":"6 or 7 bright orange globes, moved south to north in line. No wind but fast","Source":"MUFON","City":"Thiensville","Date of the Event":"10/08/2011 07:45 UTC","Object Flight Path":"Straight-line path","Object Features":"Unknown","Country":"United States","Date Submitted":"10/14/2011 01:32 UTC","trends":["There have been no other sightings in Thiensville","This sighting has been favorited 1 time."],"Case Number":"32585","Object Shape":"Sphere","Latitude":"43.235267","map":"<A HREF = \"http://maps.google.com/maps?q=43.235267,+-87.966859(32585)&iwloc=A&hl=en\"> mufon case (32585) map </A>","Tags":"City","Disposition":"Unknown","Weather Factors":"Unknown","Log Number":"US-10142011-0006"}