{"Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United Kingdom","Tags":"City","Sighting Duration":"Undisclosed","Region":"England","files":["/var/www/straped/mufon/html2text/32584.html.txt","/var/www/straped/mufon/org/32584.html"],"Object Features":"Undisclosed","Source":"MUFON","City":"London","map":"<A HREF = \"http://maps.google.com/maps?q=51.498609,+-0.133906(32584)&iwloc=A&hl=en\"> mufon case (32584) map </A>","Longitude":"-0.133906","Object Shape":"Blimp, Circle, Disc, Sphere, Teardrop","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around October 14th 2011"],"Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","divs":["Sighting Details1310 bright sun, slight breeze, clear sky. I'm cycling along Albert Embankment south side of the Thames from Vauxhall to Lambeth Bridge. I regularly cycle that way, always looking towards Parliament, noticed a TV helicopter moving west away from Parliament, airplanes far to the east. Slightly odd silver object flashing as if reflecting sunlight, thought it was another helicopter but it higher than helicopters usually fly, kept my eye on it, imagining I could see a rotor and a chassis beneath it, but it's not quite right, the top end rotates away from me, now it looks like a parachutist or a weather balloon with very short webbing, and its descending slowly, sunlight flashing off it like its a spinning partially reflective surface. At lowest descent I've reached south foot of Lambeth Bridge, park my bike and getting a really good look, can't believe noone else is interested in this - very visible now, it's an orb although some anomalous feature at the bottom like a tiny orb underneath it. Starts to ascend, I fumble my phone-camera (I haven't used it before) got a couple of seconds good footage of my hand. Pointing my camera at it but it's not recording, watching it rising straight up, higher than helicopters go, still flashing, noticed another one higher up to the north-west and then another one, even higher, to the south-east. Still rising and getting fainter, straining my eyes and I'm wondering whether I'm seeing things by that point - possibly several more all pin-pricks. Whole sighting maybe 10 minutes. Highly visible, other people must have seen this."],"Date of the Event":"10/14/2011 01:50 UTC","Latitude":"51.498609","Date Submitted":"10/14/2011 01:11 UTC","Log Number":"GB-10142011-0005","Case Number":"32584","Summary":"Silver-White reflective orbs (3) hovering over Westminster"}