{"Date of the Event":"02/07/2005 08:29 UTC","Object Flight Path":"Undisclosed","Latitude":"38.840172","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around February 7th 2005"],"files":["/var/www/straped/mufon/html2text/3259.html.txt","/var/www/straped/mufon/org/3259.html"],"Country":"United States","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Object Shape":"Undisclosed","Region":"Colorado","Longitude":"-104.813003","Date Submitted":"02/07/2005 08:29 UTC","Disposition":"Unresolved","Viewing Distance":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsSighting Report: My sighting isn t very dramatic. I noticed something bright going across the sky on Friday, Feb 3rd(?). It was a bright white object, probably bigger than a jet but farther away. The reason why I looked outside in the first place, was because there were jets (military aircraft) loud, outside, at approxamitely 9:30...10:00 PM. It is a weird time for jets in colorado springs! So I looked out the window to see them. At first, I didn t think anything of the round, white object. I don t know why! But I followed it from my window for five minutes or so. I told my husband to look ouside, but he said I was crazy. He wouldn t have been a great witness anyway, since he had had a few beers. But I do not drink. I decided to go outside to further track it--it was moving from the west over the mountains, to the southeast, when it stopped around the star that I believe is Polaris. It did some strange manuevers, a weird centricity. There was only one. It seemed to move foward, then back, circle around Polaris, especially to the left of the star. I went back in because it was cold, to get some gloves. When I went back outside, it was still there. I watched it for another five minutes. The white object was not chased by the jets apparently, because they were gone before I had even gone back in for gloves. The sky was clear in the south east, but a little whispy in the north and north west--typical colorado weather. There was no noise. But it moved really fast, it seemed, and did manuevers like jets and helicopters cannot do! I went in for cigarette, and when I came back, it seemed to be somehow following Polaris, directly in front of it. I could still see it, however, when it moved slightly from left to right. I don t follow this stuff (until now) but I happened to have an old map of the sky. I m pretty sure it was Polaris. It seemed to zoom away, toward the star. After staring at it, to see if it returned, or was just a figment, I noticed that the stars blink and twinkle, as do airplanes somewhat. This object did not. It remained a constant white glow the whole time. The little dipper (I m somewhat sure) was above it, and to the right. I live on the East side, by Powers, near Peterson AFB. I watched airplanes after that, to get a better idea of how large it was. It was farther away than an airplane. I really cannot say just how big it was. It really seemed to be just a figment, as I cannot wrap my brain around something so strange. I am 29, a stay-at-home mother, with a bachelors in Art. I would really be interested in hearing from you, or anyone else who may have seen this cool sighting--because I really cannot believe that I actually saw something like this! My husband says he s going to send me to Cedar Springs (he s joking) because I came back in with the whitest face, I m sure! My jaw was almost to my chest! I m only the teeniest bit more scared at night now--I have always figured there were UFO s..."],"City":"Colorado Springs","Summary":"Not Provided","Log Number":"","Sighting Duration":"Undisclosed","Case Number":"3259","map":"<A HREF = \"http://maps.google.com/maps?q=38.840172,+-104.813003(3259)&iwloc=A&hl=en\"> mufon case (3259) map </A>"}