{"Disposition":"Unresolved","Source":"MUFON","Region":"","Weather Factors":"Unknown","Tags":"City","Summary":"very slow moving , the lights were very strange.","Sighting Duration":"Undisclosed","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/32618.html.txt","/var/www/straped/mufon/org/32618.html"],"Date of the Event":"10/15/2011 11:45 UTC","trends":["There have been 3 other sightings in Glastonbury","There were no other sightings in Glastonbury on or around October 15th 2011"],"Latitude":"51.124468","Object Features":"Other","Log Number":"GB-10162011-0007","City":"Glastonbury","Date Submitted":"10/16/2011 03:54 UTC","divs":["Sighting DetailsWas going to bed, it was about 11.45pm. I was looking out of the bedroom window( we have a very good view over the moors),it was a very clear night, I could see some lights in the distance, I thought at first it was a plane coming in to Bristol airport, as we`re close to the flight path that they sometimes use. But these lights were slightly off the usual path & as i was looking, the light seemed to split in to two (one above the other),so i watched it coming towards us(my wife was there, she observed also). The light was really bright, it seemed there was a lot of glare coming from the window, so i opened them wide, but the glare was still there...from about a mile out, it looked like it could possibly two large aircraft with their headlights on, at this time i could make out flashing lights(like landing lights) so i was still sure it was a plane or possibly helicopters from the nearby naval air base, but, i still had to watch to be sure. It moved very slowly, but it`s path was bringing almost directly over our house, as it came closer I could see it was not 2 sets of headlights, it`s a bit hard to explain, the main light was, a straight line(like a strip light), with 2 more shorter ones going off at roughly 45 degree angles from the bottom. There were about 6-8 flashing landing lights around the main light, as it flew over the house, i put my head right out the window & looked up, all the lights were on the front of it, as it passed it looked flat, i could see the lights pass & make out, like,the start of a cube, but did not see anything after the lights had passed my field of vision. After it had passed then I heard sound, it was a quiet noise, a bit like the sound of an commercial airplane, of which i`ve heard a hundred times before, in the night. After it was gone I asked my wife at least twice \"did you see that?\", \"yes\".We didn`t speak for about 5 minutes, it was like wow!!, did that really just happen?"],"Viewing Distance":"101-500 Feet","Longitude":"-2.732533","map":"<A HREF = \"http://maps.google.com/maps?q=51.124468,+-2.732533(32618)&iwloc=A&hl=en\"> mufon case (32618) map </A>","Case Number":"32618","Object Shape":"Square, Rectagular","Object Flight Path":"Straight-line path"}