{"Viewing Distance":"101-500 Feet","Source":"MUFON","City":"Morgantown","Disposition":"Unresolved","divs":["Sighting DetailsOn a very still, unseasonably warm spring night sometime between 11:30 and 12 midnight I heard the sound of what sounded like large trees being toppled at a slow, constant speed. The sound was coming from our neighbors woods which is 800 feet down from our property and was heading our way as it was getting louder and louder, we live in a heavily wooded area in southern Brown County and have enourmous trees just for the record. I woke my husband from a sound sleep and made him come over to the window and explained to him I had been listening to the noise for a while now. He was groggy and said he didn't know what it was and told me he was going back to sleep. The noise continued across our property and continued until I could no longer hear it. The next afternoon a conservation officer stopped by and asked if we had experienced anything strange the night before and before I could say anything my husband said, \"I've been a woodsman my entire life and last night I heard something I have no explaination for\", then proceeded to describe what he had heard. The officer said that there were several hundred sightings of a cigar shaped craft hovering over a church camp and a good friend later told us he was at a party in Nashville, Indiana, which is about 10 miles east of us also in Brown County, and saw it hovering while out on the deck. After hearing what others had seen I then realized that what had happened in our woods was actually the tops of trees being sheared off, and I'm talking large limbs! I could not see the craft as I was inside my house looking into pitch darkness and there was no light coming from the craft.That same night a teenage girl driving home from a church meeting almost wrecked her car when a large creature on two legs leaped across the road only touching pavement once. This happened not 7 miles from our house. My husband worked with her father. This is a second hand account which I cannot confirm as I didn't personally witness it but according to my husband the man was certainly not one to make up a story like that. I was told about this site by Dan Aykroyd and promised to record my account."],"Date of the Event":"04/17/1988 11:55 UTC","Object Shape":"Cigar","Object Flight Path":"Straight-line path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.316406,+-86.355553(32616)&iwloc=A&hl=en\"> mufon case (32616) map </A>","Latitude":"39.316406","Log Number":"US-10162011-0005","trends":["There have been no other sightings in Morgantown","This sighting has never been favorited."],"Case Number":"32616","Region":"Indiana","Country":"United States","Object Features":"Unknown","Summary":"I heard the sound of large trees being sheared of their tops at a slow, constant speed with no noise from a motor on an otherwise still night. The next day there were reports of a cigar shaped object hovering over a campground at the end of our road .","files":["/var/www/straped/mufon/html2text/32616.html.txt","/var/www/straped/mufon/org/32616.html"],"Weather Factors":"Unknown","Longitude":"-86.355553","Sighting Duration":"00:30:00","Date Submitted":"10/16/2011 01:25 UTC"}