{"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/3262.html.txt","/var/www/straped/mufon/org/3262.html"],"Case Number":"3262","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Date Submitted":"03/15/2005 09:30 UTC","Country":"United States","Object Shape":"Undisclosed","Log Number":"","Latitude":"41.921207","City":"Winchester","divs":["Sighting DetailsSighting Report: As I was driving home from work on Wednesday, March 9, 2005 approximately 9:30 p.m. I was driving up Route 44 past the Old Saybrook Fish House and noticed that their was a bright white light in the sky. It was a clear night and as I continued driving up Route 44 along the Farmington River it went from a bright white light to two lights beaming out of the sky and then all of a sudden the lights just disappeared. That evening when I arrived home my daughter mentioned that my mother had called and said that she had seen something around 7:30 p.m. that evening for approximately 30 minutes in the west sky. My father was also witness to what they thought was a UFO. The following day I spoke with my mother and told her about my incident driving home and at that point she shared with me about her incident. Prior to leaving work that evening I had noticed that the planes appeared to be flying lower then usual and thought it was a little odd and mentioned this to my business associate. As a child, I was abducted and remember clearly my experience upto a certain point. It was an intense experience and have not been contacted since of what I m aware of. I have seen a few unusual things in the night skies along my travels since my last contact."],"Longitude":"-73.060108","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Winchester","There were no other sightings in Winchester on or around March 15th 2005"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Summary":"Not Provided","map":"<A HREF = \"http://maps.google.com/maps?q=41.921207,+-73.060108(3262)&iwloc=A&hl=en\"> mufon case (3262) map </A>","Date of the Event":"03/15/2005 09:30 UTC","Object Features":"Undisclosed","Region":"Connecticut"}