{"Weather Factors":"None","Case Number":"32622","Log Number":"US-10162011-0011","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.388568,+-112.010311(32622)&iwloc=A&hl=en\"> mufon case (32622) map </A>","divs":["sighting detailslast thursday, 5:30 a.m. until 5:45 a.m. i was looking at (m42) the orion nebula when 1 light moved across my view. i thought to follow it. i viewed it for a couple of minutes moving from se to nw when 2 other lights started moving down my view from nw to se. they passed each other. when they did, about a minute later, the 1st object stopped. the other 2 moved for a couple more minutes, then they also stopped. i sat there for another 10 minutes just looking at those stopped lights and finally shut my scope down and went to bed. last night, i was again looking at m42 when another light started moving again across my view. again, i followed it. it moved in the same direction as the 1st ones did on thursday 10\\13\\2011. the light caught up to 2 more lights that started moving with it. those 3 caught up to 2 more and they were all moving in the same direction, same speed, it seemed. then the 1st light started to turn back and then it went back to the spot where i 1st noticed it. it then stopped. i went back to see if i could pick up where the others were but they either stopped and just looked like stars or were gone. i'm not sure what happened to them. i went back to light #1 and looked at it for 10 minutes or so and just shut down my scope. it never moved again. i'm going to go buy a video camera for my scope and hopefully i can capyure these lights again for your viewing."],"files":["/var/www/straped/mufon/html2text/32622.html.txt","/var/www/straped/mufon/org/32622.html"],"Object Features":"Unknown","Object Shape":"Star-like","Date of the Event":"10/16/2011 04:45 UTC","Region":"Arizona","trends":["There have been 417 other sightings in Phoenix","There were 3 other sightings in Phoenix on or around October 16th 2011"],"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Longitude":"-112.010311","Country":"United States","City":"Phoenix","Tags":"City","Summary":"5 lights/objects flew across my view in telescope","Date Submitted":"10/16/2011 12:40 UTC","Sighting Duration":"00:20:00","Latitude":"33.388568"}