{"Tags":"City","divs":["Sighting DetailsI was driving west on Pearl street around midnight and off to my right I noticed the object hovering above the power lines and transformers. I pulled over and went into the gas station parking lot directly across the street from the craft. The gas station was closed. The distance was maybe 50 feet away. I stood there and watched it for several minutes just hovering stationary above the facility. It then kind of slowly hovered over to Pearl street and started heading west following the path of the street. I jumped into my car and followed it down Pearl Street when it then took a left turn and headed down another street. I followed it but on this coarse it started to accelerate and then headed over the Puget Sound> i am not sure but I think it went into the water. I called the police and the dispatcher asked me if I would make a report with an officer. She said they had other calls but no one would make the report. I agreed and met with the officers at a convenience store parking lot. They pretty much laughed and made fun of me but took the report. Sorry but this was a long time ago but it is has been an event that I think about often."],"Source":"MUFON","Object Features":"None","Longitude":"-122.515886","Date Submitted":"10/16/2011 01:24 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.281652,+-122.515886(32624)&iwloc=A&hl=en\"> mufon case (32624) map </A>","Latitude":"47.281652","Weather Factors":"Unknown","Case Number":"32624","Sighting Duration":"Undisclosed","Object Shape":"Circle","Date of the Event":"06/15/1977 12:00 UTC","Object Flight Path":"Hovering then path","City":"Tacoma","Region":"Washington","Viewing Distance":"21-100 Feet","Country":"United States","Summary":"I watched it hover over a corner that had a bunch of power transformers","files":["/var/www/straped/mufon/html2text/32624.html.txt","/var/www/straped/mufon/org/32624.html"],"trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around June 15th 1977"],"Disposition":"Unknown","Log Number":"US-10162011-0013"}