{"Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/32636.html.txt","/var/www/straped/mufon/org/32636.html"],"Summary":"Starlike object, no sound, glittering, turned red before fading, slow movement","Latitude":"42.15691","City":"Saline","divs":["Sighting DetailsStepped outside on to the deck to take a look at the stars. Noticed one \"star\" that looked particularly bright, when it started moving slowly from the SW to the NE. Object was shining brightly almost glittering. Watched it for about 20-30 seconds and then went to the sliding door and called my wife and children to come see it. My wife came out and I pointed the object out to her, at no time did either of us hear any noise. We both watched it for around 10-15 seconds when the object started dimming, seemed to turn a dull red, and then completely faded out. My wife went back inside and I stayed out because I had noticed planes in the sky and wanted to see if any of them would come to the are where I last saw the object. A plane did fly, heading from E to W (from Detroit Metro Airport), close to where the object had been. I could definitely hear the plane as it passed. As the object was flying slowly it seemed to almost be vibrating as it moved along the flight path. I noticed that all the planes I could see had blinking navigation lights on them, the object was like a point of light, glimmering, vibrating, I noticed there were no navigation lights on it. As I was watching it with my wife I pointed out to her that there were no navigation lights on the object and then pointed to a plane in the distance to show that it had navigation lights on it. This is the second time I have witnessed an object like this."],"Weather Factors":"Unknown","Case Number":"32636","Tags":"City","Object Shape":"Sphere, Star-like","Sighting Duration":"00:00:50","Region":"Michigan","Viewing Distance":"Unknown","Date of the Event":"10/16/2011 08:18 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.15691,+-83.748621(32636)&iwloc=A&hl=en\"> mufon case (32636) map </A>","Longitude":"-83.748621","Log Number":"US-10162011-0025","trends":["There have been 5 other sightings in Saline","There were no other sightings in Saline on or around October 16th 2011"],"Disposition":"Unknown","Date Submitted":"10/16/2011 08:56 UTC"}