{"files":["/var/www/straped/mufon/html2text/32630.html.txt","/var/www/straped/mufon/org/32630.html"],"trends":["There have been 83 other sightings in Omaha","There was one other sighting in Omaha on or around October 1st 2011"],"Tags":"City","City":"Omaha","Latitude":"41.298037","Weather Factors":"Unknown","Date Submitted":"10/16/2011 05:07 UTC","Object Shape":"Boomerang","Summary":"Just finished riding the trail, getting gear packed in car and a large very slow moving craft came almost straight overhead.Stadium like lights on front of object.","Longitude":"-96.050127","Sighting Duration":"00:01:30","Country":"United States","divs":["sighting detailswasnt sure to report until i read a report from last night of what sounds like the same object i witnessed exactly two weeks ago from their sighting traveling roughly the same area. i was on a local bike\\jogging trail on october first getting in some much needed excersise. it was begining to get dark so i headed back toward the parking lot to pack up and go. i unlocked the car opened the door and stood for a second taking a drink of water and i saw a very large low flying object with stadium type looking lights on the front. it wasnt yet completely dark outside but getting close. the object seemed to be dark in color but the lights on the front were so bright i couldnt really see the objects features but appeared to be boomerang in shape. the lights seemed to be almost stacked on top of each other as well as side to side on the front. once again, they looked like lights you see in a football stadium, extremely bright, lighting up the path in front of it for quite a distance.they were bright white in color. i did not observe any other lights on the object, such as the strobes you would see on the wings of an aircraft. the object appeared to be boomerang shaped. it glided almost directly overhead as i stood there getting goosebumps. i felt an almost euphoric feeling as it glided overhead. i heard the sound of what sounded like jet aircraft but it did not seem to be coming from the object i am describing as it would have been much louder at this close of a distance. the object was traveling north and as it got further away, and the lights werent obstructing my view it appeared to be black. could not make out any other features other then its black or dark color and boomerang type shape."],"Region":"Nebraska","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.298037,+-96.050127(32630)&iwloc=A&hl=en\"> mufon case (32630) map </A>","Date of the Event":"10/01/2011 08:30 UTC","Case Number":"32630","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Log Number":"US-10162011-0019","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Source":"MUFON"}