{"map":"<A HREF = \"http://maps.google.com/maps?q=37.843224,+-93.296394(32632)&iwloc=A&hl=en\"> mufon case (32632) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"32632","City":"pittsburg","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32632.html.txt","/var/www/straped/mufon/org/32632.html"],"Region":"Missouri","trends":["There has been one other sighting in pittsburg","There were no other sightings in pittsburg on or around October 15th 2011"],"Object Flight Path":"Straight-line path","Country":"United States","Object Features":"Unknown","Latitude":"37.843224","Object Shape":"Sphere","Date Submitted":"10/16/2011 07:45 UTC","divs":["Sighting DetailsMy home sets second tier to a lake. My girlfriend and I were hosting my daughters sweet sixteen party and I had gone to the deck to smoke a cigarette. Having seen that same veiw many times west over the lake it caught my attention immediatley. It appeared as a distant light much brighter than the stars and it was a completely clear night.It was still at first. Then it began moving east. i told another adult to come look at this light that was coming over top of us. My girlfriend came out as well. We all three observed this light with no strobes or colors and most oddly no noise at all. It moved directly overhead, got dimmer for 10 seconds then just blinked out like a light being shut off. I commented to the other adult that i had seen simular events in the last couple of years and had heard accounts from well reputable individuals describing events like this but even more detailed and closer observations but refuse to report them. Myself, I have wittnessed lots of things in the night sky i could not explain so I felt happy that I had Wittnesses to what i knew i was seeing. The other two wittnesses could only look at me and say\"what the hell was that\". it wasn't making any noise or flashing lights\"."],"Viewing Distance":"Unknown","Longitude":"-93.296394","Date of the Event":"10/15/2011 10:30 UTC","Summary":"saw a brighter than usual star in the west . was stationary then moved directly over myself and two other wittnesses .then went dim to yellow . then just went out .","Disposition":"IFO","Log Number":"US-10162011-0021","Tags":"City"}