{"Region":"Oregon","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=45.60357,+-122.990649(32638)&iwloc=A&hl=en\"> mufon case (32638) map </A>","trends":["There have been 6 other sightings in North Plains","There were no other sightings in North Plains on or around October 16th 2011","This sighting has never been favorited.",""],"Log Number":"US-10162011-0027","Latitude":"45.60357","Case Number":"32638","Summary":"My daughter and I were driving and it crossed in from of us over the freeway then hovered.","files":["/var/www/straped/mufon/html2text/32638.html.txt","/var/www/straped/mufon/more/32638_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/32638.html"],"Date of the Event":"10/16/2011 06:09 UTC","Country":"United States","divs":["sighting detailsplease read the description on picture i drew. my memory is very strange right now and the memory is not as clear & getting fainter, my daughter is dealing with the same issue. i think i am still very much in shock. also you can view my facebook @ [link moved to field investigator section\\cms\\tg]]. i responded with clearer memory. i was in hwy 26 in hillsboro oregon just north of the intel site. i first noticed it before the jackson school rd over pass as a bright light ahead of me. i first thought it was a plane with its headlights on coming straight at me. its started as a point of bright light about 5 miles ahead of me. i woke my daughter who was sleeping in the back seat to come sit in passenger side seat and view what i was seeing. i slowed the van as i drove along with at least 4 other cars that were on the hwy and was looking at it. it then zipped off to the right and was over my town of north plains, then its zipped to my right on the north side of hwy 26 and started to slowly cruise over the freeway in front of us about 50 yards in front of us heading to the southeast. it only had a unbelievable white light coming out the bottom. once across the freeway it stopped and hovered over the open field to the left of the freeway it then turned on red lights that glided side to side on the far-side of it and green lights gliding side to side on the near side of it. they were gliding separately in opposite directions of each other with the white glow still present. it was at times easy to see the shape of a long rectangle with a triangle front and at times it was hard to see the shape at all. it was dark grey and not shinny at all and made no noise! i was so focused on trying figure out what i was seeing, looking for wings, looking for lights, looking for windows, anything that would have told my brain it was just a weird airplane. but, when i didn't see anything i knew was normal i started stressing and trying to explain to myself what my daughter & i were seeing. then we passed the tree line and i knew i had to turn around and try to see it better. so we turned back around on glencoe rd and headed back and that only took less then 2 min if that and it was completely gone! something that big should have still been in the skyline or something! last thing i was thinking was clicking pictures or stopping. i wish now i had now!"],"Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Cigar, Square, Rectagular, Triangle","Sighting Duration":"Undisclosed","Date Submitted":"10/16/2011 09:26 UTC","Tags":"City","Viewing Distance":"101-500 Feet","City":"North Plains","Object Features":"None","Longitude":"-122.990649"}