{"Log Number":"","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"03/29/2005 04:49 UTC","trends":["There have been 14 other sightings in Manchester","There were no other sightings in Manchester on or around March 29th 2005"],"Country":"United States","Latitude":"41.77815","Summary":"Not Provided","Object Shape":"Undisclosed","Longitude":"-72.517901","Tags":"City","Weather Factors":"Unknown","Case Number":"3263","files":["/var/www/straped/mufon/html2text/3263.html.txt","/var/www/straped/mufon/org/3263.html"],"Date Submitted":"03/29/2005 04:49 UTC","Region":"Connecticut","City":"Manchester","map":"<A HREF = \"http://maps.google.com/maps?q=41.77815,+-72.517901(3263)&iwloc=A&hl=en\"> mufon case (3263) map </A>","divs":["sighting detailssighting report: to whom it may concern, on saturday, 3\\26\\05 late afternoon i was engrossed in taking shots of the prism i noticed in the sky. there was lots of plane pollution that day (some call them chemtrails. whatever they are -they are an aggrevation to me as a photographer as it ruins good color shots.) i proceeded to snap at the sky on the ride home from a local park. i never looked at the photos i took that day till the next day, sunday.i also did not notice the anomoly\\ufo\\whatever it is when i took the photos as my mind was more focused on the prism. in looking over the shots i have 2 photos with the most unusual anomoly. i don t believe it is a \"sunspot\" nor anything reflecting from within the vehicle as my window was wide open. i d be happy to share these with whomever altho i found nothing in the sight that tells me how to share digital photos. from what i can tell, i must send the negatives. i have no \"negatives\". i have the originals in my computer. any suggestions would be greatly appreciated. our scientific minds are stumped on this one!! date taken: 3\\26\\05 time taken: between 5:13 pm and 5:22pm. the 2 photos that show that weird thing were taken at exactly 5:21;19 pm and 5:21:20. one second apart. there is a big change in the \"anomoly\" in one second. i have a series of shots of the prism that i believe was caused by the overhead air traffic.where the sun was setting there was alot of pollution. sincerely, kim picard"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Disposition":"IFO","Source":"MUFON"}