{"Case Number":"32631","map":"<A HREF = \"http://maps.google.com/maps?q=35.236664,+-106.657084(32631)&iwloc=A&hl=en\"> mufon case (32631) map </A>","Object Flight Path":"Path with directional change","trends":["There have been 8 other sightings in Rio Rancho","There were no other sightings in Rio Rancho on or around October 15th 2011"],"Disposition":"IFO","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-106.657084","divs":["Sighting DetailsNM Albuquerque, Saturday Oct. 15th at 11:45 pm, stepped out to my balcony for a smoke before heading to bed. Every night I watch the sky's. As I looked to the South I noticed a stream of star like objects flashing red, blue and what seemed to be yellow and or green. They were coming in a jagged formation from the North West heading in a South East direction. They then turned East toward Orions Belt and slowly despairing. My first thought was they were UFO visitors. I ran back in to get my two oldest kids and husband to witness this exciting event. While watching I called my sister in Albuquerque and 2 friends in Rio Rancho to come out side to see this. After it was over I searched the internet to see of any other similar postings were made. One other in my city I did find. Today the only NEWS postings were on a meteor. We did witness what seemed like it could be a meteor after they (star like objects) flew through then fallowed by one plane about 5 to 10 minutes later. By 12:30 pm I did one more search over the sky's to see if there were any more activity before heading to bed. Researching the News Sunday morning the only listings I found was one possible meteor coming through. These meany many (over 40) objects were not meteors. They moved as if coming into a formation and made a deliberate turn. Meteors do not move in this manner."],"Log Number":"US-10162011-0020","Weather Factors":"None","Date of the Event":"10/15/2011 11:45 UTC","City":"Rio Rancho","Source":"MUFON","Object Shape":"Flash, Star-like","Object Features":"Unknown","Sighting Duration":"Undisclosed","Latitude":"35.236664","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/32631.html.txt","/var/www/straped/mufon/org/32631.html"],"Date Submitted":"10/16/2011 05:19 UTC","Region":"New Mexico","Summary":"Several star like lights moving N to S then East"}