{"Country":"United States","Region":"Colorado","trends":["There have been 7 other sightings in Thornton","There were no other sightings in Thornton on or around October 15th 2011"],"Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Latitude":"39.876321","Object Shape":"Boomerang","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.876321,+-104.965844(32637)&iwloc=A&hl=en\"> mufon case (32637) map </A>","Log Number":"US-10162011-0026","divs":["Sighting DetailsOn October 15th 2011, just past 11pm Mountain time in Thornton, Colorado, I was letting my two dogs out in the back yard. I looked up in the sky to the North direction and saw what may have been a UFO or at least some type of unknown aircraft. It was flying quite low and must have been less than a mile or at max two miles away. It was flying in an easterly direction. It was a very dull gray and almost transparent craft. It was in the shape of a large V, with what seemed to look like 5 very dull gray rather large lights on it. I witnessed it flying and called out to my husband and he didn't take me seriously until he came over and saw it flying soundlessly, rather cruising along slowly before it disappeared, our view now being blocked by my house. After he acknowledged seeing it he thought that maybe it was some kind of new stealth fighter being tested. But we found it weird that they would fly so low in a well populated area and not make a sound as well. We looked all over the internet and could not find any pictures, UFO or man crafted of this V shaped ship. Then we found a report describing the exact ship yesterday in Illinois. Reading that someone else had seen the ship kind of freaked us out. This compelled us to write a report as well."],"files":["/var/www/straped/mufon/html2text/32637.html.txt","/var/www/straped/mufon/org/32637.html"],"Source":"MUFON","Longitude":"-104.965844","Date of the Event":"10/15/2011 11:10 UTC","Summary":"Dull Grey V Shaped Semi Transparent Craft FLying Low in Thornton Colorado Oct. 15th 2011","Tags":"City","Date Submitted":"10/16/2011 09:04 UTC","Case Number":"32637","Object Features":"Wings","City":"Thornton"}