{"City":"Middlesbrough","Latitude":"54.573","Region":"England","Longitude":"-1.238","Country":"United Kingdom","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsSighting Report: Location: Middlesbrough, UK Daate: 26th Aug 2002 I d like to report a multiple ufo sighting witnessed by myself, my girlfriend and a friend of ours mid-afternoon saturday 26th Aug 2002. Conditions were very bright and clear. We were all out on our roof garden enjoying the great weather and my girlfriend, who was lying on her back sunbathing, suddenly pointed straight up and said \"whats that up there?\" At first my friend and I couldnt really see anything obvious and this wasnt helped by the brightness of the sky or the fact that we didnt know what we were looking for. However within a few seconds of scanning the area my partner was indicating, we managed to spot what had captured her attention. It appeared to be a small shiny silvery-white sphere, just hanging there above us - it was impossible really to say if they were very small or very high, but they were probably at least a few thousand feet high. Within a few seconds of spotting this sphere i noticed another one, and then another and then more. They were all in the same area of the sky and i think there were between 7-9 altogether, either just hanging there or moving very slowly. At first we thought they might be birds but their movement was not consistent with this idea, no circling or anything - just stationary or drifting very slowly. As we stood watching them, over a period of 4-5 mins they gradually moved into a V formation directly above us and stayed stationary in this position for several minutes - we realised then for sure that they couldnt have been balloons either and this was something out of the ordinary. We became quite excited at this point and i ran indoors to get my camera and our friend dashed of to his car to get his binoculars. However, by the time we got back the spheres had begun to break formation and drift apart. Looking through the binoculars didnt show any further detail, but we could definitely see that they were solid objects. I put my 70-210mm telephoto lens on my SLR and snapped off a few pictures, one at around 70mm showing 3 of the spheres in the frame and another at 210mm showing just one. I have enclosed scans of the prints. Upon enlarging the scan of the 210mm zoomed picture a little more detail became evident, showing in fact the object is not a sphere but more teardrop or shell shaped. It also seems to show a small trail or maybe a puff of gas venting ? Anyway, as we continued watching they all just moved off very slowly in different directions until they were out of sight. I d say the total duration of the sighting was approx 10-15 mins. Unfortunately after later finishing off the roll of film i mislaid it and it didnt turn up again until a few weeks ago, which is why this report is so overdue. Best Regards - Eric"],"Log Number":"","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=54.573,+-1.238(3264)&iwloc=A&hl=en\"> mufon case (3264) map </A>","Summary":"Not Provided","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3264.html.txt","/var/www/straped/mufon/org/3264.html"],"Date of the Event":"03/05/2005 01:25 UTC","Case Number":"3264","trends":["There have been 4 other sightings in Middlesbrough","There was one other sighting in Middlesbrough on or around March 5th 2005"],"Object Shape":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"03/05/2005 01:25 UTC"}