{"Source":"MUFON","Region":"South Carolina","Latitude":"33.946651","Date of the Event":"10/16/2011 03:30 UTC","Object Features":"Unknown","City":"Lexington","Tags":"City","Case Number":"32645","divs":["Sighting DetailsI saw this on Oct. 16, at about 3-3:30 am. I had gotten out of bed because I could not sleep, I always look out of my bedroom window when I get up... a habit. I saw, in the distance, above the tree line,a very bright and for lack of a better description, twinkling light. It was a moon-bright night, and stars were out. I noticed this \"star\" because of its extreme brightness and I didn't remember seeing a star in that sky position before. I first did think it was just a star but it was too different.. I got my small binoculars and looked at it.I steadied my hand on the window pane. This thing was a good distance from me and it didn't seem to move. When I steadied my hand, looked through the binoculars and I could get the best look at it. It had lights that were rapidly moving and I did notice that there were reddish lights and also what looked like fainter greenish lights. The object didn't move from location the whole time I watched it. I looked at it for at least 10 minutes. I know it wasn't a plane, I see many planes day and night here, and it was not a plane. The movement of the lights are hard to describe. They were so fast and constantly moving on or around the object. I could not get a photo has I have a small digital camera and the object was too far from me, it would have looked like a white blur. It was fascinating. It wasn't high in the sky or far far away but enough that I couldn't see the colored lights except through the binoculars. So after watchig it not move away I went back to bed at about 4:30 am. I am up again very early, and I thought I would check to see if my \"star\" was still in positon. There is nothing there, where I saw it. The other stars are all viewable tonight and the moon is bright again. It is a true mystery to me what it was. I would like to say it was a UFO, but I don't know. I have never seen anything like it before. I would appreciate your take on this event and your feedback.. still looking skyward... Thanks for listening."],"Weather Factors":"None","Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been 2 other sightings in Lexington","There were no other sightings in Lexington on or around October 16th 2011"],"files":["/var/www/straped/mufon/html2text/32645.html.txt","/var/www/straped/mufon/org/32645.html"],"Viewing Distance":"Over One Mile","Longitude":"-81.281408","Summary":"extreme bright light, saw colored lights, rapid light movement","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=33.946651,+-81.281408(32645)&iwloc=A&hl=en\"> mufon case (32645) map </A>","Date Submitted":"10/17/2011 04:50 UTC","Country":"United States","Log Number":"US-10172011-0002","Object Shape":"Fireball, Star-like"}