{"Disposition":"Unresolved","Latitude":"41.365504","Date Submitted":"10/16/2011 11:37 UTC","Tags":"City","City":"Morris","Longitude":"-88.419618","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=41.365504,+-88.419618(32642)&iwloc=A&hl=en\"> mufon case (32642) map </A>","files":["/var/www/straped/mufon/html2text/32642.html.txt","/var/www/straped/mufon/org/32642.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Cone, Star-like","Case Number":"32642","Country":"United States","Log Number":"US-10162011-0030","Date of the Event":"10/16/2011 07:30 UTC","Summary":"notice a twinkling star that was out of place","Object Flight Path":"Stationary,Hovering then path","Object Features":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Morris","There were no other sightings in Morris on or around October 16th 2011"],"divs":["Sighting Detailsat 7:30pm I let the dog out and was out on my deck. I typically observe the night skies with both binoculars and night vision cameras. I was looking at jupitor tonight as its moons were clearly visible through the bino's. I turn and noticed a very bright star that was completely out of place for its position in the sky. I noticed it also twinkling very brightly. I have a pair of Canon 18x56 gyro binos, so I found the star in the lens and locked onto it. After focusing I was completely blown away by what I saw. Very very clear flashing lights, blue green, red, yellow, white in a bar like pattern. I pulled away the binos and looked at it thinking it had to be moving, but it didn't it just stay'd in its position in the sky. The structure of the craft is best described as a cone with a pointed top. The lights display complete randomness to spining like they were racing around the craft. This was a fist of this kind for me. I went to my nieghbors house and show'd him the object and he was dumbfounded also. The craft was in the western sky from Morris. There was lots of aircraft up tonight but none seemed attracted to this craft. My nieghbor and I watched it for at least a half hour. I could not get my camera to peer through the 18x scope. Just with the naked eye takes time to find a object with that kind of power. I went back to my house and watched it for a while longer. I went into the house and came back out a while later and the object was gone. I dont know how high it was or the size but looking through the binos you could absolutely make out that it had a cone structure with a pointed top."]}