{"Viewing Distance":"21-100 Feet","Tags":"City","Longitude":"-87.145779","Summary":"Triangular Craft, blinds and nearly causes a wreck.","Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/32641.html.txt","/var/www/straped/mufon/org/32641.html"],"Region":"Tennessee","Sighting Duration":"Undisclosed","Case Number":"32641","Latitude":"35.588017","Date of the Event":"10/09/2011 09:00 UTC","Disposition":"Unresolved","Country":"United States","Object Features":"Window(s)","Log Number":"US-10162011-0029","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=35.588017,+-87.145779(32641)&iwloc=A&hl=en\"> mufon case (32641) map </A>","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsThursday Oct. 9th, 2011, 9 p.m.: As I traveled home from a house 1.5miles away from mine, I began to notice what at first seemed to be a new light installed by the New Song Baptist Church at the end of Ashwood Dr., but soon came to realize it was a craft! This craft has 3 bight lights on the bottom portion, it was triangular in shape, was moving slowly and also maintaining a low flight path. The lights on the craft were so bright, not only did they illuminate the ground below the craft (I'd say the craft was about 25-35 ft. above the ground)but they also blinded me temporarily as if I had stared directly at the sun for a few seconds. This caused me to swerve across the road and almost into the ditch, at this time I stopped my car fumbling for my phone to take a picture, but the craft rotated, much like how a helicopter lowers its nose so that the piolt could look towards the ground ahead of the craft. I felt cold and light headed, mostly from nervousness because this craft obviously was searching for something, after \"looking at me\" for a few seconds the craft moved above my vechile, in fear I sped off towards my house which was about 300ft away, when I got there (in a matter of seconds) I looked back in the sky towards where the craft should have been, it was gone. I do have an airport south west of my house in Mt. Pleasant, but this craft was headed north west, and flying very low, there is no way it could have escaped my sight in the few seconds it took for me to get home. I have no clue what the craft wanted, or what or who it was looking for, but I've never seen activity like this in my area. I always see the UFO stories that make the TV and all of them are out west, I always wanted to see a UFO and now that I have it almost puts me in fear to really know for sure that something more intelligent than any human does exist, what possibly could they be wanting with Columbia, and Mt. Pleasant? Is it because the End is near, and they are returning to attempt to find the civilizations they left long ago? What sort of intentions do they have, and why haven't they landed and made direct face to face contact with us yet, why do they just fly searching the ground?"],"Date Submitted":"10/16/2011 11:09 UTC","trends":["There have been 2 other sightings in Columbia","There were no other sightings in Columbia on or around October 9th 2011"],"City":"Columbia"}