{"Summary":"Not Provided","Date Submitted":"02/18/2005 06:02 UTC","Object Flight Path":"Other","Object Shape":"Unknown","Log Number":"","Tags":"City","Viewing Distance":"Unknown","Latitude":"50.740166","Weather Factors":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsSighting Report: 17 February 2005, St Andrews Scotland Time: between 10:40 and 10:42 pm Weather: clear, with a gibbous moon My flatmate and I were walking down City Road, St Andrews, heading south. We looked up in the sky and saw an extremely bright white light, moving at a straight southeasterly trajectory at a height of about 50 degrees in the sky. At first, we thought it was a meteorite or fireball, since it was moving at a speed consistent with a slow-burning object in the upper atmosphere; however as we watched it we noticed there was no smoke trail of any kind nor did the light diminish or flicker in brightness. The light was round in shape, and its diameter was approximately that of a pearl earring held at arm92s length. It was noiseless, and did not have the shape or characteristic blinking lights or movement of an aircraft. It took approximately 4-5 seconds to travel across the sky. As we watched the object (which was moving quite fast), it suddenly appeared to stop. The light then split into three separate lights, in a triangular formation. They hovered there for an instant, then blinked out of the sky. They did not fade away or move toward the horizon; they simply disappeared."],"Source":"MUFON","Longitude":"-2.027108","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=50.740166,+-2.027108(3265)&iwloc=A&hl=en\"> mufon case (3265) map </A>","City":"Poole","Case Number":"3265","trends":["There have been 2 other sightings in Poole","There were no other sightings in Poole on or around February 18th 2005"],"Region":"","Disposition":"Insufficient Data","Date of the Event":"02/18/2005 06:02 UTC","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/3265.html.txt","/var/www/straped/mufon/org/3265.html"]}