{"Summary":"two or three bars of bright lights with balls of light between them","Country":"United States","Tags":"City","City":"Dayton","Viewing Distance":"101-500 Feet, Unknown","Region":"Ohio","Date of the Event":"10/15/2011 09:30 UTC","Weather Factors":"Unknown","Object Features":"Patterned Surface, Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.8352,+-84.262312(32659)&iwloc=A&hl=en\"> mufon case (32659) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/32659.html.txt","/var/www/straped/mufon/more/32659_submitter_file1__IMG_0303.jpg","/var/www/straped/mufon/more/32659_submitter_file2__red_2cu.jpg","/var/www/straped/mufon/more/32659_submitter_file3__whitecloseup.jpg","/var/www/straped/mufon/org/32659.html"],"Source":"MUFON","Latitude":"39.8352","Object Flight Path":"Straight-line path","Case Number":"32659","Object Shape":"Cigar, Cylinder","Sighting Duration":"Undisclosed","Log Number":"US-10172011-0013","trends":["There have been 40 other sightings in Dayton","There were no other sightings in Dayton on or around October 15th 2011","This sighting has never been favorited.",""],"Longitude":"-84.262312","Date Submitted":"10/17/2011 11:06 UTC","divs":["Sighting DetailsI'm a photographer and was taking some time lapse photography of stars on Saturday night. I set the camera on automatic and went back in the house. After an hour I retrieved the camera and reviewed the photos and discovered several super bright, glowing cigar shaped objects flying over my house. They appeared to be very large and were very high in the sky as they were passing behind the trees. They traveled from west to east and south to north. There were four. Two, could have been the same object passing in front of the camera at different times. This one was brilliant red. One was white with colored lights in the middle and the other was multicolored. I brought them in to photoshop to have a closer look and there is some kind of structure there. I have no idea what these are. I put the time lapse footage together and had a look at that and the objects move so fast they look like shooting stars."]}