{"Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"10/17/2011 09:08 UTC","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=47.094098,+-122.433494(32651)&iwloc=A&hl=en\"> mufon case (32651) map </A>","Log Number":"US-10172011-0005","Date of the Event":"10/16/2011 10:30 UTC","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Washington","Longitude":"-122.433494","Latitude":"47.094098","Case Number":"32651","City":"Spanaway","Disposition":"Unresolved","trends":["There have been 9 other sightings in Spanaway","There was one other sighting in Spanaway on or around October 16th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Summary":"At first it looked like a bright star. It then came lower to the ground and was larger than a helicopter in size.","Object Features":"Unknown","divs":["sighting detailsi took my dogs out before going to bed. i looked up and noticed what i thought was a bright star. as i was standing there it appeared to come closer to me and became much larger. i could not see an outline with the naked eye it was very bright. i took pictures with my cell phone and upon reviewing the picture it appeared to have a rectangle shape. i became overwhelmed with anxiety. because of this i left my home to spend the night with my daughter, and as i was leaving it retreated to a higher location. as i was going to my vehicle my dog started barking at something in the shadows. the object\\light was visible for a six hours, changing position twice. it was obvious because my reference was the moon. the object was positioned in the east near the moon, and repositioned itself twice moving south then west further from the moon. i felt like something was outside for most of the night and could not go to sleep. at 5:00am, it was still dark, the anxiety just lifted. i continued to check for the object hourly. at 5:30am when i looked for it, it was gone. though the moon was still visible. the object is small, and is situated in the center of the photo."],"files":["/var/www/straped/mufon/html2text/32651.html.txt","/var/www/straped/mufon/more/32651_submitter_file1__664064a990bc__1318830323000.jpg","/var/www/straped/mufon/more/32651_submitter_file2__f277445c4fff__1318830313000.jpg","/var/www/straped/mufon/org/32651.html"],"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering"}