{"Summary":"huge swarm of 30+ starlike lights flying south to north","Longitude":"-75.011744","Object Shape":"Circle, Disc, Star-like, Triangle","Log Number":"US-10172011-0008","Weather Factors":"None","Disposition":"Unknown","Case Number":"32654","Object Flight Path":"Straight-line path","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32654.html.txt","/var/www/straped/mufon/org/32654.html"],"Date of the Event":"08/13/2011 11:00 UTC","Country":"United States","Latitude":"39.717091","Sighting Duration":"00:03:00","Region":"New Jersey","divs":["Sighting DetailsI was at a friends house for a bonfire on a saturday night. while sitting with my girlfriend and chatting with friends i noticed 4 lights (satelite sized) that made a triangle flying in a straight path over the property we were on. I noticed it at first because i always enjoy watching the sky and thought it was a satelite but never seen them so close together so i knew it was something other-worldly. I had a feeling it was a ufo but you just never really expect to get such proof. all 4 lights stayed uniform as it flew south to north overhead of myself as well as several other witnesses. I yelled \"look! what's that?\" astonished. as everyone just watched for maybe 15 seconds as it kept going out of sight. about a minute later, in the same flight path and direction, a swarm of at least 30 single lights all bunched together came overhead. all i could do was watch in awe as this swarm of starlike lights buzzed silently flying south to north. i distinctively remember keeping my eye on two lights that were on the outer rim of the swarm, i watched one bounce over blocking my view of the other and then back again in less then a second. all the lights just kept going at a steady speed (about that of a satelite) and disappeared out of view. I felt like i had just seen something that I will probably never get to see again. I was upset that no one had any video proof, but was super estatic to have my own proof after observing the night sky and wondering what if for so long."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.717091,+-75.011744(32654)&iwloc=A&hl=en\"> mufon case (32654) map </A>","trends":["There have been 2 other sightings in Monroe","There were no other sightings in Monroe on or around August 13th 2011"],"City":"Monroe","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date Submitted":"10/17/2011 11:04 UTC"}