{"files":["/var/www/straped/mufon/html2text/32665.html.txt","/var/www/straped/mufon/org/32665.html"],"Object Shape":"Sphere, Square, Rectagular, Star-like, Triangle, Unknown","Date of the Event":"10/17/2011 09:50 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","City":"Hinesville","divs":["Sighting DetailsA friend and I had just returned home from dinner. We were standing outside looking at the sky, he commented about how clear the night was as I was turning to face the street. I was looking for the North star, which I thought I saw but it was REALLY bright, brighter than I've ever seen anything in the night sky. It also looked MUCH closer than any of the other stars. It started bobbing a little bit and I had to ask if I was crazy... He pulled out his phone and began filming. This first light was exploding and reforming, all the while it was spinning. The light looked like it was pulling it self apart like a cell dividing. There were also at least 6 other flying crafts that were NOT planes and they were too low and completely silent. No crickets nothing. The flying crafts flew back and forth taking turns one at a time until the 5th and 6th were visible and they stayed closer together and began hovering. as soon as we get a cord the videos will be both here and on youtube"],"trends":["There have been 5 other sightings in Hinesville","There were no other sightings in Hinesville on or around October 17th 2011"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Longitude":"-81.592215","Case Number":"32665","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Unknown","Latitude":"31.848537","Date Submitted":"10/17/2011 01:04 UTC","Log Number":"US-10172011-0019","Weather Factors":"Unknown","Country":"United States","Summary":"MULTIPLE UFOs SITED IN ONE EVENING OVER MIDWAY GA","Disposition":"Unresolved","Region":"Georgia","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.848537,+-81.592215(32665)&iwloc=A&hl=en\"> mufon case (32665) map </A>"}