{"Log Number":"US-10172011-0018","Country":"United States","Object Flight Path":"Hovering then path,Path then hovering","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around October 16th 2011"],"City":"Flint","Object Features":"Unknown","Date Submitted":"10/17/2011 01:01 UTC","Summary":"saw a triangle of","Region":"Michigan","Disposition":"Unknown","divs":["Sighting DetailsI was outside smoking a cigarette in front of my dorm. I was looking at the sky because there were 4 spotlights making figure 8 patterns from the roof some night club or something to the east. That's when I noticed what looked like a star moving. It was mostly white but it had different green and blue colors kind of flashing but maintaining a constant luminosity. I thought it was a satellite. Then I saw 2 more of the same making a large triangle and they were all moving with uniform speed and and keeping the same relative distance to one another. I thought it was some sort of plane formation because I'm right near an airport. Then I saw two more to make it an even bigger triangle. Still moving with uniform speed and same distance from one another. The speed and distance were too uniform and the too far apart for them not to be somehow connected I thought. But the space between them just looked like dark starless sky. I thought maybe it was some kind of stealth bomber type of craft but it would have to be giant. Then it stopped for about 5 min. Then I thought I was just seeing things so I waved to it and laughed to myself. But, a couple minutes later, it started moved in a slightly different direction and I stopped doubting myself. It seemed to move relatively slow but much faster than any of the stars. A plane did fly by under it on the way to the airport and that seemed to be much faster but it was also much much closer. The original direction was from east to west directly over my head but after it stopped it took a more northwest direction. I went inside to grab a camera with a video option because my crappy phone doesn't take video and a still picture would have just looked like stars (if it took a visible picture at all) but when I returned it was gone. I went back out every hour or so after that with my camera until about 1 in the morning but didnt't see anything else."],"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=43.018657,+-83.681656(32664)&iwloc=A&hl=en\"> mufon case (32664) map </A>","Case Number":"32664","Latitude":"43.018657","Date of the Event":"10/16/2011 10:00 UTC","files":["/var/www/straped/mufon/html2text/32664.html.txt","/var/www/straped/mufon/org/32664.html"],"Longitude":"-83.681656","Tags":"City"}