{"Country":"United States","files":["/var/www/straped/mufon/html2text/32667.html.txt","/var/www/straped/mufon/org/32667.html"],"Tags":"City","Date of the Event":"10/17/2011 06:45 UTC","divs":["Sighting DetailsI'm a 30 year old, married man. I was alone with my dog outside in Olathe, KS around 6:45AM on the morning of Monday, October 17, 2011. I walked around my apartment building to the north and turned the corner into a small, open field. That is when I saw a stationary, flashing light hovering above the distant horizon to the northeast. It pulsated -- changing from a small pin-point of light to a bright light and back again within about a 2 second time-frame. It did this on a regular interval the entire time I was out there. It did not look like a helicopter or airplane, as there were no other flashing lights that you might find on most man-made aircraft. And it appeared to be completely still and stationary. I've also never seen a helicopter or airplane pulsate with light in such a way. After about 10 seconds of watching this light, I ran back inside and grabbed my camera. I came back out and began video-taping the light. From my perspective, and my familiarity with the surrounding Kansas City area, I would guess that the light was somewhere above the Overland Park, KS area, north of I-435. I live just to the southeast of the I-35 & I-435 interchange. The light could have been as close as a mile or two away from me, or as far as several miles. It was difficult to estimate how far it was, as I didn't see a solid object associated with the flashing light. It was so still that it looked like a flashing light mounted atop a tall radio tower, but there is no such tower in that spot. After video-taping the light for a little over a minute, I turned the camera off and went back inside. I didn't feel like there was much point in sticking around, as the light's behavior never changed. I went inside for about 5-10 minutes. When I came back outside to see if the light was still there, it was gone."],"trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around October 17th 2011","This sighting has never been favorited.",""],"Log Number":"US-10172011-0021","Latitude":"38.987808","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-94.665362","Sighting Duration":"00:10:00","Viewing Distance":"Over One Mile","Region":"Kansas","City":"Overland Park","Case Number":"32667","Object Features":"None","Summary":"Stationary, flashing light hovering above the distant horizon to the northeast of where I stood.","Object Shape":"Circle, Sphere, Star-like","Date Submitted":"10/17/2011 12:47 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.987808,+-94.665362(32667)&iwloc=A&hl=en\"> mufon case (32667) map </A>","Object Flight Path":"Stationary"}