{"Date Submitted":"10/17/2011 12:01 UTC","Log Number":"US-10172011-0017","Weather Factors":"Unknown","Date of the Event":"10/11/2011 07:40 UTC","Disposition":"Unknown","Sighting Duration":"00:01:30","Object Shape":"Sphere","Tags":"City","Object Features":"Unknown","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around October 11th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.603505,+-93.604626(32663)&iwloc=A&hl=en\"> mufon case (32663) map </A>","files":["/var/www/straped/mufon/html2text/32663.html.txt","/var/www/straped/mufon/org/32663.html"],"Latitude":"41.603505","Source":"MUFON","Region":"Iowa","divs":["sighting detailsat 7:40pm, i was heading home on i-235 near the 14th street exit, when i saw something that resembled an object on fire. it was a reddish-orange light, about the exact color of fire, and was traveling in a northerly direction. i stopped the car on the off ramp and got out for a better look. there was a nearly full moon behind me as i watched the light move across the sky. i hold a private pilot's license, and although at this time i am not \"current\", i've been around aircraft all my life, and i've never seen anything like this. there was a thin\\broken layer of clouds i estimated to be about 4,000 to 5,000 feet above ground level. the light was below the clouds. i applied 'critical thinking' in my attempt to identify the light. i asked myself \"why couldn't this be _____?\" no aircraft i know of produces a reddish-orange light. plus there were no position, navigation, or anti-collision lights visible. also, this was not a landing light, as it was omni-directional, not shining ahead as a landing light would. then i considered it may have been the rosat satellite, which is due to re-enter the atmosphere and burn up. the light had no firey trail in it's wake, and it appeared to be traveling in straight and level flight. also the light appeared to be moving fast, so this was no \"oriental lantern\". i would guess the light was about 3,000 feet, and traveled from horizon to horizon in less than 90 seconds."],"Viewing Distance":"501 Feet - 1 Mile","City":"Des Moines","Case Number":"32663","Summary":"A small glowing reddish-orange sphere","Longitude":"-93.604626","Country":"United States","Object Flight Path":"Straight-line path"}