{"Latitude":"38.831818","divs":["Sighting Detailsthe first weekend of october dad and i were watching sports thatn day. MIZZOU and whats left of the big 12 i don't smoke indoors for respect of others plus stinks the house i went out back to smoke and that side of the house faces east an reddish,orange \"plane\" flew over the house and it seemed wrong at the moment then i heard no engines went east reversed slowed and glowed a very bright reddish orange i guess like a fireball but no it was not a fireball i freaked at that moment and got my dad to see it given he is a korean vet and flew for twa for some 37 years jus dont know.......like to have a reason for these things this last saturday something completely different dull aluminum basically white but dull sighting first 3 one smaller than the other two south to north fast less than 300 ft not very big objects kinda of shhhhh sound yet very soft sounding moments later another one no sound moment later another one went by next day around the same approx. time a group of two both days 2:00pm-3:00pm"],"Country":"United States","Log Number":"US-10172011-0022","Weather Factors":"Unknown","Region":"Missouri","Viewing Distance":"N/A","Longitude":"-94.412327","Date Submitted":"10/17/2011 01:24 UTC","files":["/var/www/straped/mufon/html2text/32668.html.txt","/var/www/straped/mufon/org/32668.html"],"Object Features":"Unknown","Object Flight Path":"Straight-line path","City":"Lee's Summit","Tags":"City","Disposition":"IFO","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.831818,+-94.412327(32668)&iwloc=A&hl=en\"> mufon case (32668) map </A>","Object Shape":"Sphere","Summary":"first there were 3 that went by, the sound was shhhhhhh. then 1 , then 1 object, sunday 2 went by just as my mother came by.","trends":["There have been 52 other sightings in Lee's Summit","There were 2 other sightings in Lee's Summit on or around October 16th 2011"],"Date of the Event":"10/16/2011 02:30 UTC","Source":"MUFON","Case Number":"32668"}