{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/3267.html.txt","/var/www/straped/mufon/org/3267.html"],"Date Submitted":"02/01/2005 11:14 UTC","trends":["There have been 2 other sightings in Oviedo","There were no other sightings in Oviedo on or around February 1st 2005"],"Object Flight Path":"Undisclosed","Log Number":"","divs":["Sighting DetailsSighting Report: In Orlando Florida on February 1st 2005 at 8:20am local time, I saw an object about the size of a basketball in the sky. At first I thought it was a baloon, but there was very little wind and the object was moving towards the wind. This made me curious, and I began to look more closely at it. I quickly realized it was not a baloon and may have quite possibly been what WWII Air Force Pilots called a \"Foo Fighter\". As I said; the object was about the size of a basketball, dark grey in color, was not perfectly spherical, but spherical with a smaller protruding lobe visible on the one side that I was looking at. The objects altitude was approximately 150 to 200 feet, and was traveling from the Northeast to the Southwest at 30 to 35 mph. I observed the object for 60 to 90 seconds as it flew in a perfectly straight and level flight path untill I could no longer see it. The object had no lights of any kind, and made no sound. I was on the corner of Semeron Blvd. (S.R. 436) and Michigan Street. This area is just a couple of miles from Orlando International Airport. This intersection is actually on OIA s glide path, and the object was headed towards the airport.The weather was good; 55 degrees fahrenheit, very light cirrus clouds, and a light variable breeze."],"Latitude":"28.674137","Region":"Florida","Disposition":"Unresolved","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.674137,+-81.20227(3267)&iwloc=A&hl=en\"> mufon case (3267) map </A>","Object Shape":"Undisclosed","City":"Oviedo","Country":"United States","Case Number":"3267","Tags":"City","Source":"MUFON","Date of the Event":"02/01/2005 11:14 UTC","Summary":"Not Provided","Object Features":"Undisclosed","Longitude":"-81.20227"}