{"Weather Factors":"Unknown","Object Features":"None","Log Number":"US-10172011-0025","Date of the Event":"10/16/2011 07:14 UTC","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"41.888306","City":"Forest Park","Disposition":"Unresolved","Date Submitted":"10/17/2011 05:31 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.888306,+-87.81198(32675)&iwloc=A&hl=en\"> mufon case (32675) map </A>","Longitude":"-87.81198","Source":"MUFON","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around October 16th 2011","This sighting has never been favorited.",""],"Region":"Illinois","divs":["Sighting Details I got a text from a friend in Villa Park IL who said he was watching a star like object hover in his neighborhood. Villa Park is 11 miles west of where I am so I decided to go outside to my backyard and sky watch. It was a clear night not much going on at first. Then out of the Northern sky I noticed a small dim orange orb UFO flying South at 715pm and began recording it until it was out of view. I looked down and sent a text to my friend that I had just caught a fireball orb flying over me when I looked back up there was the BIGGEST BRIGHTEST ORB UFO I have seen yet. I have seen different types of UFOs flying by day and night for over 2 years but this one was one of the closest and brightest I have ever encountered. It made no noise and was amazingly big bright white light. It was in the shape of a large ball hovering over the tree top. I immediately put my camera on it and starting recording. This was at 717pm. It started to move East toward the City. I got my butt of my zero gravity lawn chair and ran to my right to keep recording it. It kept moving behind a tree so I ran back to the left to see if I could keep recording it but it had disappeared. I sat back down and sent my friend another text saying I just saw a big bright white ORB hovering and waited to see if more would show. About 13 minutes went by and I saw another high quick moving dim orange star like UFO this time flying South to North. I recorded the best I could as I am still a novice trying to film these things. 3 minutes later a second star-like ball of light flew in the same South to North path over the sky at probably the same height speed and distance. I have no idea what they are if they are man made, natural to this world, or ET. My guess is ET. But as I mentioned that have been coming out more often and frequently day and night by where I live. To view my video search MULTIPLE STAR-LIKE UFOs CHICAGO 16 October 2011 on Youtube. I attached a few pics below of the big bright one. I use the Youtube channel name guttergawker if you want to look at the other uploads of UFOs I have caught. On Oct 9th I caught a few day time green diamond shaped UFOs flying over and have good close up video of those craft. Sorry about the name guttergawker, I signed up for Youtube long before I began to see UFOs and would just watch crap on Youtube hence the name. And sorry about all the shake in the video I try and stabilize what I catch as much as possible but it never comes out to smooth. I tried using a tripod but its ever harder to record these things flying across the sky with one. And I never know from which direction or what time they will show up so when I do see them I do my best keeping the camera on them but it moves around alot when I have the focus set on infinity and zoom 300xs. Anyways thanks for reading, if you live in Chicago watch the skies on clear starry nights after 7pm and I am sure you'll see what I am seeing."],"Object Shape":"Circle, Fireball, Star-like","files":["/var/www/straped/mufon/html2text/32675.html.txt","/var/www/straped/mufon/more/32675_submitter_file1__Image2.jpg","/var/www/straped/mufon/more/32675_submitter_file2__Image1.jpg","/var/www/straped/mufon/more/32675_submitter_file3__Image3.jpg","/var/www/straped/mufon/org/32675.html"],"Tags":"City","Summary":"Multiple Star-Like UFOs Over Chicago from 715 to 745pm HD Video","Viewing Distance":"501 Feet - 1 Mile","Case Number":"32675","Object Flight Path":"Hovering then path,Straight-line path"}