{"Object Features":"Dome","files":["/var/www/straped/mufon/html2text/32674.html.txt","/var/www/straped/mufon/more/32674_submitter_file1__183.jpg","/var/www/straped/mufon/more/32674_submitter_file2__185.jpg","/var/www/straped/mufon/more/32674_submitter_file3__191.jpg","/var/www/straped/mufon/org/32674.html"],"Latitude":"33.041799","Object Flight Path":"Path with directional change","City":"Rhome","Log Number":"US-10172011-0024","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.041799,+-97.395947(32674)&iwloc=A&hl=en\"> mufon case (32674) map </A>","Region":"Texas","Weather Factors":"Unknown","Date of the Event":"10/13/2011 09:30 UTC","Case Number":"32674","Longitude":"-97.395947","Source":"MUFON","Summary":"Just went out back to walk dogs with the back porch lights out. Then saw formation","trends":["There have been 3 other sightings in Rhome","There were no other sightings in Rhome on or around October 13th 2011","This sighting has never been favorited.",""],"Date Submitted":"10/17/2011 05:06 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Hoax","Tags":"City","divs":["Sighting DetailsI had taken our dogs outside to walk them and left the back porch light out. Looked up and saw the formation, it caught my eye because the objects were so bright, by the time I took dogs back in then got our camera, I took 3 pictures which I would like someone to analyze them. Was a staright formayion at first 5 seperate objects or 1 huge one, then they made kind of a wavey formation, then seperated into their own hoovering space. This went on for at least 45 minutes, and I heard a helicoptor but never saw it, and of course looking in the other direction we can see aircraft that are going to DFW airport. Whatever these objects are they seem to come out at least twice a week, and anyone that lives in the shalecreek housing addition as we do can clearly see them, they do not seem to worry about being seen, considering how close we are to an air base."],"Country":"United States","Object Shape":"Circle, Oval, Star-like"}