{"files":["/var/www/straped/mufon/html2text/32678.html.txt","/var/www/straped/mufon/org/32678.html"],"Object Features":"Unknown","trends":["There have been 9 other sightings in Hendersonville","There were no other sightings in Hendersonville on or around October 17th 2011","This sighting has been favorited 1 time.",""],"Log Number":"US-10172011-0028","Longitude":"-82.560863","Summary":"Bright light, asprin size, 10 minutes from horizon to horizon, 7:10 pm","City":"Hendersonville","Weather Factors":"Unknown","Object Shape":"Star-like","Country":"United States","Case Number":"32678","map":"<A HREF = \"http://maps.google.com/maps?q=35.306225,+-82.560863(32678)&iwloc=A&hl=en\"> mufon case (32678) map </A>","divs":["sighting detailssilent, bright white light travelling all the way from the ssw (saw it at around 30 degrees above the horizon) to the een direction (disappeared around 15 degrees above the horizon behind the mountain\\tree line). straight line trajectory. about the size of an asprin held at arms length. witnessed by myself, youngest son (20 - chemist major) and daughter (17 - senior in high school and college student). tried to video tape it with my kodak easyshare c433 camera in video mode, but the quality is very bad. this was not a sun reflection off of an airplane as there were several flying in the air as well from a ene to a wsw direction along the normal flight path and all you see from them were there normal lights flashing. their sounds could be heard as well. sighting last approx. 10 minutes from start to finish. did not notice that the other aircraft acknowledge this light as none of them altered their courses. i'm ex-usaf (341st wing headquarters, malmstrom afb, great falls, mt), educated (b.sc.) and have been in r & d for over 20 years - i'm used to looking up at the sky. ps: keep in mind that the video quality is very bad due to the type of camera used. the lights at the bottom left (2 - 3 of them at times) are not the object. i tried to keep in somewhere near the center of the video. you'll see it near the middle the first minute or two in the center. this was shot after the ufo had attained a 90 degree view from me, so already partially into the sighting. you will hear myself and children talking near the end as well."],"Viewing Distance":"Unknown","Date of the Event":"10/17/2011 07:10 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date Submitted":"10/17/2011 07:57 UTC","Tags":"City","Region":"North Carolina","Latitude":"35.306225","Disposition":"Unresolved"}