{"Source":"MUFON","Latitude":"36.992667","Weather Factors":"Unknown","Log Number":"US-10182011-0001","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around October 17th 2011"],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.992667,+-122.053901(32683)&iwloc=A&hl=en\"> mufon case (32683) map </A>","Case Number":"32683","Disposition":"Unresolved","Date of the Event":"10/17/2011 05:00 UTC","Object Shape":"Sphere","Viewing Distance":"Unknown","Summary":"Strange white object above Santa Cruz (CA) harbor","Country":"United States","Longitude":"-122.053901","Sighting Duration":"Undisclosed","divs":["sighting detailsas we my wife and i walked down the beach today i looked up in the sky. because of my interest in the sky i have often witnessed all kinds of planes, satellites, comets and chinese lanterns etc. i have been tested several times for my vision which always results in a 100%. i got tested last time in 2005 before i immigrated to the state and i'm certain that it's just as good now as it was back then. what i saw today was something new to me. the object appeared to be sphere like and seamed to be randomly wobbling. much like in this footage [link moved to field investgator section\\cms\\tg] but, it was too far away for me to be sure that it was more than one object. when i first noticed it, i thought at first it was just another plane because there where already several other airplanes in the air. so the chances of a pilot having noticed it as well are good. after a few seconds i realized it wasn't moving. after a few seconds of observation i noticed that it was moving but very slowly. it moved south slower than a satellite, in fact it moved so slow that it was hard to observe that it was moving at all. than after a while when it was right above the beach it turned west. since it was so slow it wasn't an abrupt 90 degree turn, but it seam very determined in its direction before and after the turn. further more it seamed to be changing its altitude because it became smaller in size. the fog came in from the see side and it was hard to see it at all thereafter. i also had to leave at that point and unfortunately stopped observing it. the whole time i was wishing for someone with a camera to walk by because i haven't had mine with me and a zoom would have come very handy. unfortunately i couldn't spot one. still i have no idea what it was that i saw and i tried to see if maybe somebody had uploaded footage at youtube but found non so far."],"Date Submitted":"10/18/2011 01:58 UTC","Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/32683.html.txt","/var/www/straped/mufon/org/32683.html"],"Tags":"City","City":"Santa Cruz","Object Features":"Undisclosed"}