{"Viewing Distance":"501 Feet - 1 Mile","Country":"Canada","Object Shape":"Circle, Sphere, Star-like","Longitude":"-104.604717","Log Number":"CA-10182011-0002","Source":"MUFON","Case Number":"32684","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","trends":["There have been 10 other sightings in Regina","There was one other sighting in Regina on or around August 21st 2011","This sighting has never been favorited.",""],"Date Submitted":"10/18/2011 02:25 UTC","Disposition":"Unresolved","divs":["Sighting DetailsThrough out my life i have witnessed some amazing specticals in the sky, recently i had witnessed one of these strange lights while watching the sky outside regina sk on our farm which i live. In hopes to capture something on video i sat on our drive way with a camera and a pack of smokes for hours, on numerous occations. to my amazment i was able to get two videos, of what i had seen previous, with in two months of eachother. the second sighting and video is what i am reporting today. while sitting on a lawn chair i noticed to the west of my position, what appeared to be a star. after watching it for a moment i noticed it slowly rise up from its position over regina sk a few degrees. It then began moving toward my position. as the ball of light became closer it started appearing larger and brighter! once it was directly above me i reclined the lawnchair and took my eye off of it for a second. once i got into a comfortable position i started looking for object which just moved above me, however i could not see it moving and i was looking at a sky full of stars. after pointing my camera directly above my position for about 20-30 seconds, i was sure that what ever it was that came over top of me had vanished literaly in the blink of an eye! i ran into my house to see if i had got it dissapearing on video and to my amazment it had stopped moving in a south east direction, and was hovering above me for about 5 seconds, then it takes off verticaly and dissapears in a short few seconds out of sight. ever since my last sighting i have almost religiously been searching for more ufos and have seen one since. however,I was not able to capture it on video but this video is proof that i did see something strange that night and i know it was out of this world!"],"Latitude":"50.461572","City":"Regina","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=50.461572,+-104.604717(32684)&iwloc=A&hl=en\"> mufon case (32684) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32684.html.txt","/var/www/straped/mufon/org/32684.html"],"Summary":"it moved directly above me, stopped for a moment and then took off vertically","Sighting Duration":"00:02:10","Date of the Event":"08/21/2011 10:45 UTC","Region":"Saskatchewan"}