{"Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path","City":"Visalia","trends":["There have been 12 other sightings in Visalia","There were no other sightings in Visalia on or around September 17th 2011"],"Tags":"City","files":["/var/www/straped/mufon/html2text/32681.html.txt","/var/www/straped/mufon/org/32681.html"],"Disposition":"IFO","Case Number":"32681","Source":"MUFON","Latitude":"36.372153","Region":"California","divs":["Sighting DetailsCAME OUT OF MY HOUSE IN TO MY FRONT YARD TO SMOKE A GARRETT AND I ALWAYS LIKE TO LOOK AT THE SKY TO LOOK FOR A STAR THAT ALWAYS COME'S OUT FROM THE SAME DIRECTION, SO AS I WAS LOOKING FOR IT I COULD NO FIND IT (WAS A LITTLE BIT EARLY THAT IT USUALLY COMES OUT) I WAS TURNING MY HEAD WHEN I SAW WHAT I THOUGHT IT WAS THE SAME STAR I WAS LOOKING BUT ON THE OPPOSITE DIRECTION SO I THOUGHT THAT IS WEIRD SO AS I WAS LOOKING AT IT I NOTICE IT WAS MOVING, MY FIRS IMPRESSION WAS IS AND AIRPLANE BUT I WAS WAITING FOR IT TO SEE THE FLASHING LIGHT IT DID NOT HAD ANY AND WAS TO SLOW AND WAY TOO BRIGHT AND I KEPT JUST LOOKING AT IT FOR ABUT I SAY 3 TO 5 MINUTES (THAT IS HOW SLOW IT WAS) THEN ALL OF THE SUDDEN THE INTENSITY OF THE LIGHT JUST THE BLUE JUST BANISH AND LEFT A RED NO SO BRIGHT LIGHT AND I COULD NOT BELIEVED THAT SOMETHING REALLY BRIGHT TURN ON IN FRONT OF THE OBJECT LIKE A LIGHT OR SOMETHING CAN'T REALLY EXPLAIN WITH OUT SOUNDING WEIRD IT WAS LIKE A GATE OR LIGHT THAT THE OBJECT WENT IN TO AND JUST VANISH INSIDE BUT SOMETHING WAS LEFT SHINING FOR A SECOND THEN IT ALSO VANISH. I COULD NOT BELIEVED WHAT I WAS SEEN I HAVE SEEN A LOT OF PLANES FLYING OVER MY HOUSE AT VERY HIGH ALTITUDE BUT THIS ONE WAS TOO LOW AND TO SLOW WITH NO SOUND WHATSOEVER AND THE WAY IT JUST VANISH IN FRONT OF MY EYES WAS IMPOSSIBLE COULD NOT BELIEVED IT. I LIVE ON VISALIA CA. NORTH SIDE IF SOMEBODY READ THIS AND SAW THE SAME THING I DID PLEASE POST IT.!!!!!!!"],"Weather Factors":"None","Log Number":"US-10172011-0030","map":"<A HREF = \"http://maps.google.com/maps?q=36.372153,+-119.295783(32681)&iwloc=A&hl=en\"> mufon case (32681) map </A>","Object Shape":"Star-like","Country":"United States","Summary":"BRIGHT BLUE AND LOW RED LIKE STAR LOOKING THAT JUST VANISH IN FRONT OF ME!!!!","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Features":"Unknown","Date Submitted":"10/17/2011 11:06 UTC","Longitude":"-119.295783","Date of the Event":"09/17/2011 07:25 UTC"}