{"Region":"Florida","Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.545436,+-81.373776(32689)&iwloc=A&hl=en\"> mufon case (32689) map </A>","Longitude":"-81.373776","Date of the Event":"10/16/2011 07:00 UTC","Tags":"City","Summary":"Hovered in the sky for about 15-20 minutes then it changed shape and flew off","Log Number":"US-10182011-0007","files":["/var/www/straped/mufon/html2text/32689.html.txt","/var/www/straped/mufon/org/32689.html"],"Case Number":"32689","divs":["Sighting DetailsI woke up pretty early (between 5:30 am-6 am) and decided to go out for a jog. Before doing so I decided to walk my dog for a bit. I did so around 6:30 am when it was still dark but the sun was just starting to rise. As my dog was using the bathroom, I look out into the sky and saw a dark horizontally rectangular object hovering in the sky with three bright lights on it. Two lights were yellow, the other was red. The light in the middle was pulsing rapidly. At first I thought it was a plane, but as I keptlooking atit I noticed that it was not moving constantly like a plane does at night. Rather it was just hovering there. I leaned over to get a better look as it was pretty far past some trees and I tried to see if maybe it was a tower with lights on it (IE an Antennae) but I saw no tower at all connecting to the object. At that point I was pretty sure...it was a UFO. I took my dog back inside, grabbed my camera, and ran to a nearby neighborhood to get a better look. I began to film the object as it stayed hovering in the air for about another 5-10 minutes all the while still pulsing the bright light. After a while I noticed that there was a sound emitting from the object that sounded alot like helicopter blades and so I began to think that maybe the object in the sky was just a helicopter. So I stopped filming, and began to look at the footage I had caught so far. When I looked back in to the sky, the three lights had now transformed into just one bright light, that flew much higher into the sky, and began to fly off. I began filming the object again and at that point I was convinced it was a UFO. Because a helicopter would not drastically change light patterns or shoot really high into the sky the way this thing did. And that was that. The UFO flew off and Icouldn't follow it because it was really far. Amazing experience..."],"Latitude":"28.545436","Sighting Duration":"Undisclosed","Object Shape":"Oval, Square, Rectagular, Teardrop","Object Flight Path":"Hovering then path","Date Submitted":"10/18/2011 11:31 UTC","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around October 16th 2011"],"Viewing Distance":"Over One Mile","City":"Orlando","Disposition":"Insufficient Data","Country":"United States","Source":"MUFON"}