{"Log Number":"US-10182011-0004","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","Case Number":"32686","Weather Factors":"Unknown","Summary":"UFO Over The Western Hills of Ukiah CA","Longitude":"-123.198393","Country":"United States","Date of the Event":"10/17/2011 08:30 UTC","trends":["There have been 8 other sightings in Ukiah","There were no other sightings in Ukiah on or around October 17th 2011"],"Viewing Distance":"Unknown","Date Submitted":"10/18/2011 04:22 UTC","Latitude":"39.156141","map":"<A HREF = \"http://maps.google.com/maps?q=39.156141,+-123.198393(32686)&iwloc=A&hl=en\"> mufon case (32686) map </A>","divs":["Sighting DetailsI take an evening walk on a daily basis when a red light caught my eye. The red light arrived near the hills traveling west. Tonight there was no moon here so the stars were very visible. When I first saw the light I thought it was a chopper because it seemed to hover over the hills. The county of Mendocino has it's fair share of pot gardens so I thought it was a chopper inspecting the hills. I continued with my walk and noticed a plane on the other side of the valley and compared it to the red light. I continued to watch the red light and out of nowhere a white light appears near the red light. The white light takes the lead as they both start to travel south along the hills in unison. As I watch it looks like both lights are both from one craft. Whatever it was had to be huge. I would describe it as a flying submarine with the white light as the \"headlight\" and the red light at the end of the craft. As it travels the red light spins as if it was a searchlight. The craft moved slowly and with no noise at all. I went into my aunts house to make sure she would witness this craft and yes she did see it too. We watched as it traveled off into the night. I've seen a lot of strange lights in this area in the past couple of years so it was no surprise that more were to come. No time to get pics or anything but I was glad to not witness it alone."],"Disposition":"Unresolved","Object Features":"Unknown","City":"Ukiah","files":["/var/www/straped/mufon/html2text/32686.html.txt","/var/www/straped/mufon/org/32686.html"],"Source":"MUFON","Object Shape":"Cylinder","Region":"California"}