{"trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around February 18th 2005"],"Country":"United States","Summary":"Not Provided","Viewing Distance":"Unknown","City":"New Port Richey","divs":["Sighting DetailsSighting Report: Clear sky, cool to cold, February 1952, Sioux City Iowa. Long cylindric object with hemispheric ends. No wings, tail, engines, noise, no metal seams, no rivets, no windows. Noticed when it was several miles away coming from the north along the river bluffs. I was looking west and on the bluffs above riverside. First noticed due to an intermittent annoying bright blue light flashing on my right eye, right side. Looking to the north the light quit and I didn t notice anything unusual. Looking to the west the blue strobing, flashing, or glinting returned. I looked down at the ground to see if anything was in the grass glinting in the sunlight. Nothing. I then stared at the area where it seemed to be coming from, finally I saw a very small circle with the internal portion about the same color as the atmosphere, it was very close to the bluffs. I watched as it approached getting larger as it got closer. I could see it come past Mt Lucia in Stone Park, it was still a circle. Eventually it was close enough I could see it had a cylinder shape rather than circular, it was now approximately over the junction of Military Road and Riverside Blvd. My thought was it may be a commercial airliner in trouble to be this low and close to the hills, the Sioux city airport was to the south several miles, beyond the Missouri river. As it got closer I braced myself for the sound that was sure to be loud. As it went by there was nothing. I was close enough that had there been rivets and seams they would have easily been seen. I was about 400 feet above the river basin, it was about 600 feet. In distance it was probably 1000 feet away (est), it was about the size of a large airliner, moving about thirty miles an hour. The last I saw it was when it passed over the Missouri River towards the airport. Rather than diving down it just lowered in a flat descent. The color was that of highly polished bare steel. Total time of the incident was probably twenty or so minutes. Later by the next night up to 8000 people from the Riverside area reported an aircraft crashing near the Missouri River. It was reported by the tower that Gen Curtis Lemay s takeoff was held while the runway cleared. I understand it was flying approximately four feet off the ground as it cleared the runway. I have never reported this to anyone, have only told my wife and children about it. I did not nor do I want any publicity. My intent is to document and provide the information to someone that can add it to the list of sightings. I had the opportunity of witnessing this craft longer than any other person. In looking at coordinates and geomagnetic mapping techniques instrumentation I find it would be similar to our remote instrumentation of other terrain. I have searched and watched for any other sightings of similar shaped object, so far I have seen none. I wanted to report this before my memory fades, I am 67 years old, a retired electrical engineer, and a Naval Aviation electronics tecnician and flight crewman veteran (1956 - 1960 VAW 11). I have designed very complex and sophisticated space science payloads for the Naval Research Laboratory and the University of Groningen among others. While an engineering student I worked at the U of Iowa physics Research center headed by Dr James A. van Allen. One other strange incident. Several years ago at 12:05 AM an intense bright light (similar color to a standard flourescent light) lit our bedroom brighter than daylight and lasting for several seconds. Reports the next day had others reporting a bright light traveling north to south over Tampa Bay waking people on both sides of the bay (approximately 17 miles wide). I would appreciate feedback on either of the incidents should you have any."],"Object Features":"Undisclosed","Longitude":"-82.715927","Log Number":"","Case Number":"3268","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=28.252847,+-82.715927(3268)&iwloc=A&hl=en\"> mufon case (3268) map </A>","Region":"Florida","Object Flight Path":"Undisclosed","Latitude":"28.252847","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3268.html.txt","/var/www/straped/mufon/org/3268.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Undisclosed","Date Submitted":"02/18/2005 07:34 UTC","Tags":"City","Date of the Event":"02/18/2005 07:34 UTC"}