{"Country":"United States","Summary":"I filmed this ufo that was above my house in NC at 4 am on 9/11/11","Date of the Event":"09/11/2011 04:10 UTC","Object Features":"Unknown","Log Number":"US-10182011-0014","map":"<A HREF = \"http://maps.google.com/maps?q=35.343211,+-81.861683(32696)&iwloc=A&hl=en\"> mufon case (32696) map </A>","files":["/var/www/straped/mufon/html2text/32696.html.txt","/var/www/straped/mufon/org/32696.html"],"Source":"MUFON","City":"Forest City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-81.861683","Disposition":"IFO","Case Number":"32696","Object Flight Path":"Hovering then path,Path then hovering,Other","Tags":"City","Object Shape":"Circle, Oval, Sphere, Star-like, Other","Latitude":"35.343211","trends":["There have been 2 other sightings in Forest City","There were no other sightings in Forest City on or around September 11th 2011","This sighting has never been favorited.",""],"Region":"North Carolina","Date Submitted":"10/18/2011 05:41 UTC","divs":["Sighting DetailsIt all began when I awoke at 4 am needing to go to the bathroom. Above the toilet is a window, and that's where I first spotted it from. I watched for a few minutes, thinking it must be an airplane. But it moved up, then down, then up again, and I noticed it looked like it was changing size and shape. I thought, woah this is a ufo. I quickly got my son, who was up playing WOW on his computer, and told him to look. He gave it a very quick glance and told me I was nuts. I grabbed his girlfriend and had her look and she was as excited as me. She watched for a couple of minutes, then ran upstairs and got her phone which had a recorder on it. We then proceeded to film this object as it moved, pulsated, changed size and changed colors. It was right above the tree line behind my house. We filmed it until it dropped below the tree line. I have never been so excited. I downloaded the film into a program on my computer, then transferred it to a format for Youtube, and uploaded it to my Youtube account. I finally got some sleep, and upon wakening, I went to my Youtube account to see the film again, and someone had seen the film and uploaded it to UFO-Blogger. But they said it was in New York, lol. I had to set them straight on that, since it was in NC. Since the, many of my friends said I should report it, so here I am. Better late than never I guess."]}