{"Date of the Event":"10/17/2011 06:11 UTC","City":"Hartford","Tags":"City","divs":["Sighting DetailsI was the passenger in the vehicle while my girlfriend was driving. We were headed south on 1-91, just outside of Hartford, CT. She saw this object as well. At exactly 6:11 ( i had changed the radio right before I noticed the object, so I glanced at the clock) I looked above the city skyline to notice the object in the sky. It was reflecting the setting sun off the top of the disc, and banded around the middle in a horizontal row were five white lights. The object was hovering. I thought the object was a helicopter when I first saw it, there are two hospitals in Hartford that use Lifestar helicopter. However after I watched it for a moment I realized it was not a helicopter. It was not a cloudy day and the air was crisp, there was no haze. The object hovered there, and as I commented on it and my girlfriend confirmed what I saw, I looked to the right to see a plane that had taken off and was headed west. Bradley airport isn't far from hartford, and the plane sighting confirmed to me what I saw was NOT a plane. It looked totally different. I felt at ease when I saw the object, it just seemed out of place in the sky. I felt fine after, but I feel the need to share the story. We passed under an underpass (there are a few as you enter the city on the highway heading south) and when I looked again out the window to try and snap a photo with my phone, the object was gone. It just seemed to have blinked out of existence. We got in the slow lane and I looked out all of the windows, but the object was gone."],"Disposition":"Unknown","trends":["There have been 13 other sightings in Hartford","There were no other sightings in Hartford on or around October 17th 2011","This sighting has never been favorited.",""],"Object Shape":"Cigar, Disc","Summary":"Cigar/Disk shaped with 5 white lights in a row banded around the middle of the object.","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-72.680913","Region":"Connecticut","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.764821,+-72.680913(32695)&iwloc=A&hl=en\"> mufon case (32695) map </A>","Weather Factors":"Unknown","Latitude":"41.764821","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/32695.html.txt","/var/www/straped/mufon/more/32695_submitter_file1__Untitled.jpg","/var/www/straped/mufon/org/32695.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"32695","Date Submitted":"10/18/2011 04:17 UTC","Object Flight Path":"Stationary","Log Number":"US-10182011-0013"}