{"Source":"MUFON","Tags":"City","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around October 16th 2011"],"Disposition":"Unresolved","Date of the Event":"10/16/2011 09:00 UTC","Date Submitted":"10/18/2011 12:14 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.236738,+-80.735869(32691)&iwloc=A&hl=en\"> mufon case (32691) map </A>","Object Features":"None","Weather Factors":"Unknown","Case Number":"32691","Longitude":"-80.735869","Latitude":"35.236738","Viewing Distance":"501 Feet - 1 Mile","Region":"North Carolina","Object Shape":"Circle, Fireball","Summary":"Three bright orange circular objects in the sky","City":"Charlotte","divs":["sighting detailsi was out of town, with my 2yr old son, visiting friends in charlotte, nc for the weekend. myself and a friend were leaving another friends house on the northeast side of town, and we were travelling down wt harris blvd. i was driving and my friend was in the backseat with my son and her newborn daughter. i first witnessed two bright orange circular objects, almost fire-like in color and appearance. i saw them in front of the car, flying at the same altitude as several planes that were in the sky at the same time. these objects had no blinking lights and were clearly bright orange orb like objects. when i first spotted them, i pointed them out to my friend in the backseat, and we watched them travel from the front of the car to the left\\drivers side of the car in a matter of seconds, while we were stopped at a red light. when the two lights travelled to the left side of the car, i noticed a third light that joined with the other two to form a horizontal formation. two of the lights then moved upward to form a vertical formation in the sky. then the stoplight turned green and so i could no longer observe the objects. i have always loved looking at the stars ever since i was a little girl, and i have never seen anything like this before. in the sky with these objects were several planes, so it seems to me that there should have been multiple witnesses to this event."],"Log Number":"US-10182011-0009","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/32691.html.txt","/var/www/straped/mufon/org/32691.html"]}