{"Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Appendage(s)","Date Submitted":"10/18/2011 10:25 UTC","Source":"MUFON","Longitude":"-104.948786","Country":"United States","Log Number":"US-10182011-0024","Disposition":"Unresolved","Region":"Colorado","divs":["sighting detailsthis just happened and i must admit i got pretty excited. around 7:30pm 10\\18\\11 i was standing on the front steps of my house when i looked up and something really weird. i saw this triangular shaped blob moving thru the sky. at first i thought it was a flock of birds. but it was moving way too fast. gliding, actually. and then it stopped and changed directions over my house. it had no lights and no sound. the edges of it were fuzzy and black and the inner part was a lighter greyish green. it sort of faded in out out of vision like some sort of camouflage or cloaking. when it stopped to change directions it seemed like it changed its shape. the middle got skinny and the sides got wide almost like an hour glass. i thought for sure it was one of those drones i've read about. but it changed its shape again, into a chevron shape and suddenly what i can only describe as some sort of giant arm unraveled like a snake off the left side of it and then whoosh! it shot out of here as fast as lightening. i don't know what it was or where it came from but it was not natural. no one else saw it unfortunately. but i'm going to keep my eyes open from now on just in case it comes back."],"Tags":"City","City":"Denver","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.736472,+-104.948786(32706)&iwloc=A&hl=en\"> mufon case (32706) map </A>","Summary":"Dark, silent, gliding camouflaged chevron w/ snake like appendage","Object Shape":"Chevron, Other","Case Number":"32706","Date of the Event":"10/18/2011 07:30 UTC","trends":["There have been 185 other sightings in Denver","There were 2 other sightings in Denver on or around October 18th 2011"],"files":["/var/www/straped/mufon/html2text/32706.html.txt","/var/www/straped/mufon/org/32706.html"],"Latitude":"39.736472"}