{"Object Features":"Undisclosed","divs":["Sighting DetailsI came out to give mail to my cousin in law. He was showing me pictures of his new baby. We were standing on my front poarch he said something about a falling star. I looked up and saw nothing. A few seconds past and i heard the nehibor dogs whine like nothing ive ever heard I took a step foward and looked up agin suddenly a black triangle was right above Us no lights nothing but a Black object. I repeatedly asked if he could see it he Said no it moved slightly Berig south east it past between two trees I than saw the side 3 orange colored lights than it changed angles I was able to see 2'sides with 3 lights each. It made no noise as it faded into the horizon at great speed. I immeadtly thought a govt drone or military craft I live close to an afb never seen anything like it. I have personally witnessed 3 drones and nothing like it. There was no lights on the bottom at all. There was a strange haze aroung the ship like a magnetic field around it. Ive never had this kind of Feeling I've always been able to find a reasonable explantion not. This Time."],"files":["/var/www/straped/mufon/html2text/32709.html.txt","/var/www/straped/mufon/org/32709.html"],"Case Number":"32709","Object Flight Path":"Straight-line path","Latitude":"39.736242","Source":"MUFON","Viewing Distance":"21-100 Feet","City":"Aurora","Date of the Event":"10/18/2011 07:48 UTC","Log Number":"US-10192011-0002","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around October 18th 2011"],"Longitude":"-104.82748","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","Summary":"Black triangular object with 3 lights on two sides moved north to south with no sound right above me","Tags":"City","Date Submitted":"10/19/2011 12:29 UTC","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=39.736242,+-104.82748(32709)&iwloc=A&hl=en\"> mufon case (32709) map </A>","Region":"Colorado","Weather Factors":"Unknown"}