{"Region":"Indiana","Log Number":"US-10182011-0025","Country":"United States","divs":["Sighting DetailsMy sister, her Yorkie and I were driving in unknown territory trying to get back to Brazil, Indiana. Our GPS told us to go down several gravel roads in the middle of nowhere through Carbon, Indiana. It instructed us to turn down a gravel road called 100 E where I stopped the car as we turned onto it so my sister's dog could go to the restroom. It was already very dark out and my sister felt very uneasy letting him out of the car. She never got out of the car but put him right outside the vehicle and was hurrying him to go really quickly. When she got him back in the car she told me she was feeling very uneasy and I was too since the road was gravel and in the middle of nowhere. We had seen a sign as we turned onto the road that said \"Low Clearance\" and this made us uneasy as well since we weren't exactly sure what it was referring to. We were driving slowly down this gravel road with the brights on so were could see because it was so dark. We were commenting on how creepy the location was I noticed in the distance there was a series of lights that lit up in a sequencial manner which I thought initially was some sort of reflecters on a structure ahead that we couldn't see yet. This drew my attention to the sky where I was seeing faint flashing that was constant. It looked like faint lightening but it was continuous. I asked my sister if she was seeing the flashing lights in the sky and had almost come to a complete stop with the car. She started looking in the sky but couldn't see what I was seeing. We had a map light on in the car that's on the rearview mirror which was inhibiting her from seeing the lights. As she turned off the light she was still not seeing the flashing. I asked her to look where I was pointing to the clearing in the trees and she said, \"I don't see the flashing but I do see those lights ahead of us!\" That's when I looked forward and saw the lights that I originally thought had been reflecters of some sort. They were extremely bright and appeared to be moving in a pattern that appeared to be going in a circle around an object. In the first few seconds the lights were going in a sequential manner as though they were revolving around the object then they began to blink on and off in random patterns. I had stopped the the car at this point and we sat there staring at the \"light show\" wondering what in the world they could be. The whole thing looked just like the typical lights on an alien craft thing that you see in the movies or on those videos where people are trying to hoax the public. It was so sterotypical that we were wondering if someone was projecting the lights onto something in the distance that we couldn't see at that time. We kept asking each other what we thought it could be but neither of us said anything about a UFO at first. As we watched the lights I finally asked my sister if she thought we were actually witnessing a UFO to which she responded, \"I'm not sure but I was thinking the same thing.\" We both then started to worry quietly to ourselves about how we really hoped we wouldn't get abducted because we have dogs at home that need us. We never said it outloud but that was what we were both thinking simultaneously. The lights were in a horizontal line and remained that way all the time we were watching them except when they briefly tilted up on one side only for a couple of seconds before going horizontal again. It titled up on the left side as we were looking at it. As we were wondering out loud what we should do because we were both now completely freaked out yet acting calm which I believe was more shock than calm. This was something that we always said we never wanted to see. We both always believed that we weren't alone in the universe but really didn't need to see any UFO's or aliens to confirm it for us. This was in fact one of our biggest fears and it was right there in front of us only several yards in front of us. Right after the lights had tilted I reached for my IPhone to try to see if I could get a picture of it. My sister had her camera with her and started to get it ready as well. I held up the phone and realized that I couldn't see anything to photograph and as we watched it and wondered what we should do the lights simply blinked out. My sister never had to time to get her camera ready to get any pictures. The whole \"show\" lasted no more than a few minutes and ended in the blink of an eye. As we debated as to whether or not to drive ahead where the lights had been or turn around, I decided to drive forward. As we neared where the lights had been we were in shock to realize that ahead of us was a tunnel that had a rail road track running across it. It wasn't a large tunnel and only one car could drive through it at a time. We drove very slowly where we saw the lights and realized that no one was around in the woods that surrounded the area and there would have been no way to project a light onto the tunnel and have it look the way it did due to the opening in the tunnel. We didn't stop because we were too scared and stunned by what just happened. As we drove on following the GPS's orders we continued to talk about what just happened but we really we both were in shock. We finally got to a road where we saw a cop car drive by and I wondered out loud if we should flag him down to tell him what we saw. My sister was worried the cop would think we were crazy. I finally decided that we had to drive back there to make sure it wasn't something explainable. We were so scared but we knew we had to do it and I think we were really hoping there was a logical explanation for what we just explerienced. When we drove back through the tunnel we stopped and looked around. There was nothing there and no one was around. We just couldn't find any explanation for what we witnessed. I decided to call the local police and tell them what we saw hoping they would give us that logical explanation we were so desperately seeking. The police didn't act like I was a crazy person nor did they act shocked. She told me that the town of Carbon had fireworks that night and that could've explained the flashing in the sky but she had no explanation for the lights. I was willing to accept that even though I knew what I saw wasn't from fireworks. She said she would send a policeman out to check it out. As we drove home we were in shock and kept talking about it trying to explain it away unsucessfully. This event has affected us so much and caused bad dreams and big fears daily and nightly. We really feel like we will never be the same again. We have a fear that really affects our lives now. We went back to the site a week later in the daytime to investigate it more thoroughly. My sister climbed up the steep hill to the train track to make sure there wasn't something up there that could have caused it. The lights were hoving in front of the bridge just a few feet off the ground from what we could tell in the darkness. We actually experienced two trains going by there in the daytime and got a chance to hear what they sounded like. There was no sound that night from a train or anything else. There was no sign that it had ever been there. I actually went to the two closest houses to the location and asked them if they had seen or ever seen these kinds of lights. One person was very nice and said that kids party around there but she's never seen any lights and didn't see any that day. The other person acted very stoic and made me feel really stupid asking him those kinds of questions. He said he had never seen anything like that. We left that place way before it got dark and still with no definitive answers to what we experienced. I struggled with whether or not to report this sighting but felt that it might be almost theraputic to go through the whole experience again. This sighting has changed us forever. We are actually afraid to be out in the dark now and my sister is still having bad dreams about the whole thing. We will never be the same again. My sister said it felt as though our innocence had been stolen from us that night and even though I laughed when she said it I think it really is true in a way. I'm hoping that by reporting this that someone else speaks up saying they saw something that night too or maybe gives a logical explanation for what we saw."],"Date Submitted":"10/18/2011 11:31 UTC","Summary":"UFO sighted on country road in Carbon Indiana","Date of the Event":"10/01/2011 09:00 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.598933,+-87.107496(32707)&iwloc=A&hl=en\"> mufon case (32707) map </A>","Object Flight Path":"Other","trends":["There have been no other sightings in Carbon","This sighting has never been favorited."],"Viewing Distance":"101-500 Feet","City":"Carbon","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32707.html.txt","/var/www/straped/mufon/org/32707.html"],"Sighting Duration":"Undisclosed","Longitude":"-87.107496","Case Number":"32707","Disposition":"Unresolved","Latitude":"39.598933","Object Shape":"Unknown","Tags":"City","Source":"MUFON"}