{"Disposition":"Unresolved","Date Submitted":"10/18/2011 09:41 UTC","Viewing Distance":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.986404,+-88.20521(32700)&iwloc=A&hl=en\"> mufon case (32700) map </A>","trends":["There have been 6 other sightings in Waukesha","There were no other sightings in Waukesha on or around September 17th 2011","This sighting has never been favorited.",""],"Tags":"City","Longitude":"-88.20521","divs":["Sighting DetailsTheses photos were taken by my sister who was visiting Wisconsin , last month , the photos are taken directly outside my apartment, with a camera phone. She had just finished talking to her husband and was coming back to talk some more to me and our other sister. She told us that she felt compelled to take these photos with in a time lapse of about ten seconds for all three.At the time she took the photos there was nothing visible in the sky to attract her attention to take pictures . As you can see it was a beautiful day . This was not photo shopped or picture manipulation , the images appeared in the photos after she took them. I believe it is an orb., but we donot know exactly how far away , I can honestly say at least a mile or more . I live hear and know the area very well. I went out and tryed photo shooting with my phone and nothing appeared as well as our other sister , nothing appeared on either of our camera phones and it was within 2 to 3 minutes after the event.The time was around 5pm, and after looking at the order of the picture the object is moving from right to left. We saw nothing visible in the sky other than the sun and partial clouds. I and my two sisters do not know what this could be ."],"files":["/var/www/straped/mufon/html2text/32700.html.txt","/var/www/straped/mufon/more/32700_submitter_file1__orb.png","/var/www/straped/mufon/more/32700_submitter_file2__orb2.png","/var/www/straped/mufon/more/32700_submitter_file3__orb.3.png","/var/www/straped/mufon/org/32700.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Waukesha","Case Number":"32700","Latitude":"42.986404","Date of the Event":"09/17/2011 12:00 UTC","Object Shape":"Sphere","Country":"United States","Region":"Wisconsin","Weather Factors":"Unknown","Log Number":"US-10182011-0018","Object Flight Path":"Straight-line path","Summary":"This object was filmed by my sister after she finished a phone call outside . She was walking back up to my door and said something urged her to take pictures at that time. I need to mention that she saw nothing in the sky pryor to taking the photos."}