{"Date Submitted":"03/27/2005 03:10 UTC","trends":["There have been 18 other sightings in Hollywood","There were no other sightings in Hollywood on or around March 27th 2005"],"Object Flight Path":"Undisclosed","Date of the Event":"03/27/2005 03:10 UTC","Source":"MUFON","Summary":"Not Provided","Weather Factors":"Unknown","Region":"Florida","Latitude":"26.015061","Viewing Distance":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/3271.html.txt","/var/www/straped/mufon/org/3271.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.015061,+-80.14132(3271)&iwloc=A&hl=en\"> mufon case (3271) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","City":"Hollywood","Object Shape":"Undisclosed","Country":"United States","Case Number":"3271","Longitude":"-80.14132","Log Number":"","divs":["Sighting DetailsSighting Report: This event occurred either on July 4, 1995 or 1996 with the possibility of it being 1996. I know it was July 4th of the year because we were at my sister-in-law s house in the Chapel Trail section of western Pembroke Pines, FL. It was after dark (somewhere around 9pm EDT) and we were lighting off fireworks in her back yard. The night was overcast as no stars were visible. As we were watching our own fireworks as well as those of the area surrounding, I noticed a round, slow moving object with an orange glow to it moving in the clouds towards us from the east. It was not moving fast, but the speed of a conventional aircraft. It was not the shape of a conventional aircraft, either commercial airliner, private small aircraft, balloon or blimp. It made no sound as it passed overhead in a straight line of flight from due east to due west. I pointed it out and others in the party observed it as I did. It continued on its westardly path and I went to my wife s van (this is what makes the exact year of the event hard to pinpoint. She purchased it in 1994, It was a 1995 model and it was either 1995 or 1996 as she had had it for some time by then and I can t remember if it was the year before or the year of the vacation we took shortly after this particular 4th of July) as I had a pair of binoculars in the drivers side storage bin on the door. I continued to observe the object as I approached the van while walking from the east side of the house (rear) to the west side (front) along the side of the house (north). By the time I got to the van and retrieved the binoculars, the object had disappeared from sight. I scanned the western sky with the binoculars but could not see it. As the object had approached from the east, it was an oval. Overhead, it was circular and as it headed off to the west, it was oval again. This is attributed to the perspective of seeing a circular object from below. It maintained a uniform orange glow throughout the sighting, never changing in brightness or intensity. I apologize for not being able to pinpoint the exact year of this sighting. I had always meant to report it years ago but for whatever reason, I never did. Ten or so years is better than never doing it, I guess, huh?"]}