{"Log Number":"US-10192011-0008","Object Flight Path":"Path then hovering","Case Number":"32716","City":"Lansdale","Source":"MUFON","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.242331,+-75.287535(32716)&iwloc=A&hl=en\"> mufon case (32716) map </A>","Date of the Event":"10/18/2011 07:30 UTC","files":["/var/www/straped/mufon/html2text/32716.html.txt","/var/www/straped/mufon/org/32716.html"],"Object Shape":"Flash, Sphere, Triangle","Tags":"City","Longitude":"-75.287535","Object Features":"Other","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Lansdale","There were no other sightings in Lansdale on or around October 18th 2011"],"divs":["Sighting DetailsHaving researched the UFO phenomena for 52 years, I scan the sky when I go outside at night. I observed a triangular, V shaped object wandering around the sky within a 5 inch box ( holding a ruler at arm's length ). The object appeared as a triangle with a notch at the base making it also resemble a V shape. The structure was internally lit and the surface appeared cotton like with indistinct edges. It started to eject small spheres or orbs that were pinpricks of light to the naked eye. Initially, the spheres were coming from the right side of the main object, traveling straight about an inch, before falling downward in a slight curve. Some would stop and hover for 15 to 30 seconds before continuing down toward the horizon. I grabbed my 20 million CP double spotlight and followed 15 of them with the beam. Two spheres stopped, hovered, and blinked after being hit by the light. 25 minutes into the event, a light appeared out of nowhere to the left and under the primary object and continued to brighten until it was brighter than Jupiter. The light dimmed out after 20 seconds and then spheres started being released from the left side of the primary object. I estimate seeing about 45 to 50 spheres before clouds rolled into the area, ending the viewing session. As I recharged the spotlight, I kept checking on the cloud cover until 11pm. The cover was so thick that Jupiter could not be seen at that time. About 30 aircraft went over my location during the sighting, but the objects were much higher in the atmosphere and remained unaffected."],"Sighting Duration":"00:55:00","Country":"United States","Date Submitted":"10/19/2011 01:14 UTC","Latitude":"40.242331","Disposition":"Unresolved","Summary":"Observed a triangular/V shaped lit object in NW sky ejecting small lit spheres","Viewing Distance":"Unknown"}