{"Weather Factors":"Unknown","divs":["Sighting DetailsI first noticed the object when I was driving home from work at about 430 in the morning. As i was driving i noticed what looked like a very bright star in the sky above and ahead of me. It only caught my attention because while I was driving on a straight road I say the object go horizontal across the sky and then when I pulled into my house I noticed that it had stopped high in the sky right in front of the house but high. I mean I thought it was a star but there were other stars in the sky and this object was much lower and much brighter than those. So to make sure that I was not imagining things, instead of me pulling in to my driveway where I was, I decided to change direction and head toward another location far from me. And I notioced when I did the object was definetly with no doubt following me. And I am for sure this is no normal star that you see in the night sky often. As I moved it followed me, and you could also see it when it changed direction and cut across the sky. To make matters even stranger its been following me for about the last five months, and it mostly happens from about 1100pm to about 700am in the morning.And you can actually see this thing when the sun is starting to rise for the morning, and there is absolutely no stars in the sky when this can be seen. I also notice that during the approaching morning time before it leaves whenever i am driving I see the object but as soon as I stop and face the object it slowly descends into the sky where it can barely be seen, unlike night time when I see it most of the time. I have shown this object that has been followning me to another person and asked them what they thought I should do. The person saw it and believed me, but recommended that I not tell the police about it or they would think that I was crazy. I reported the event to the police anyway and not only did they not believe me but they were very rude about what I had to say and didn't want to listen."],"Source":"MUFON","Summary":"very bright star-like object thats been following me for the last 5 months. changes direction","Object Flight Path":"Path with directional change","Log Number":"US-10192011-0006","Latitude":"39.084138","Longitude":"-94.412843","Disposition":"IFO","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Date Submitted":"10/19/2011 11:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.084138,+-94.412843(32713)&iwloc=A&hl=en\"> mufon case (32713) map </A>","Region":"Missouri","City":"Independence","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/32713.html.txt","/var/www/straped/mufon/org/32713.html"],"Date of the Event":"10/02/2011 04:30 UTC","Tags":"City","Case Number":"32713","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around October 2nd 2011"]}