{"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Region":"New Mexico","divs":["Sighting Details I was at work at corner of Vasser and Lomas Blvd. by the University of New Mexico Hospital when (04) jets were heard taking off from the Kirtland Airforce Base. That alerted me that there might be something that could be a threat in the sky,(approximately at 0125hrs.) i went to the MUFON.com and checked for the latest sightings, then saw an airplane flying east above cloud level right above me. While watching the airplane a Vshape object appeared in front of the plane and right under it. Vshape object had (05) lights under it. Round lights at all (03) points and (02) more in between the three points making a Vshape. Object appeared above me and travelled southbound for(05) seconds then shot up straight into the moonlit night. Half moon was at my 3 o'clock. Airplane travellin from 9 o'clock to 3 o'clock. Object went from 12 o'clock to 6 o'clock about 96 degreez south at mach speed. UFO was so close but lights were not bright. I saw the outline of it and the reflection from the lights off the body. Appeared and disappeared. I then saw a Medic helicopter hovering around the UNMHospital. I saw something of the like back in the early 90's in Zuni, NM. Total of (04) object going west toward Ariz. approximately 1930 hrs. Travelling too far to be jets or planes."],"Date of the Event":"10/19/2011 01:36 UTC","Disposition":"Insufficient Data","Viewing Distance":"Over One Mile","Latitude":"34.97734","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.97734,+-105.023324(32714)&iwloc=A&hl=en\"> mufon case (32714) map </A>","City":"Albuqueque","Case Number":"32714","Longitude":"-105.023324","Source":"MUFON","Log Number":"US-10192011-0007","trends":["There have been no other sightings in Albuqueque","This sighting has never been favorited."],"Object Flight Path":"Path with directional change,Other","Summary":"Watching airplane going east above cloud level, then saw Vshape object appear in front of and under airplane. Object travelling south then shot straight up into moonlit night.","Object Features":"Patterned Surface","Weather Factors":"Unknown","Date Submitted":"10/19/2011 12:11 UTC","files":["/var/www/straped/mufon/html2text/32714.html.txt","/var/www/straped/mufon/org/32714.html"]}