{"trends":["There have been 2 other sightings in Blum","There were no other sightings in Blum on or around October 17th 2011"],"Case Number":"32717","Object Flight Path":"Stationary","Region":"Texas","Latitude":"32.14265","Country":"United States","files":["/var/www/straped/mufon/html2text/32717.html.txt","/var/www/straped/mufon/org/32717.html"],"Date of the Event":"10/17/2011 08:28 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Blum","map":"<A HREF = \"http://maps.google.com/maps?q=32.14265,+-97.397238(32717)&iwloc=A&hl=en\"> mufon case (32717) map </A>","Object Shape":"Diamond, Disc, Oval, Triangle","divs":["Sighting DetailsI was on my way to hang out with friends at an old camp park.On the way there i look to my cell phone and i have absolutely no sevice, and most the time i have full sevice. well when we get to the camp grounds we start talking and as it turns out i aint the only one. as night time gets closer and closer peolpe start to go to bed and its just me and 3 of my best friends. we had the radio up listening to megadeth when everything just shuts off. I mean everthing the car lights my phone,radio,everything. At that momemt one of my buddys yell out hoy **** guys, guys come look art this. I drop everthing and run over to the edge of the water where he is just freakin out. i asked him wht happened he tuned to me and said that a weird colored massive light shot up into the dark abyss we call the sky. Shocked and not knowing hoe to react a big FLASH out ov nowhere almost blinds me like a fleshbang granade. This light seperated into hundreds of lights cicling around then stopping as if they were send ing morse code of some sorts. Or using the stars as a navigation type deal. after abut an hour or so the lights came together and sunk back under water."],"Summary":"Shape shifting beautiful lights. I could not look away","Log Number":"US-10192011-0010","Tags":"City","Longitude":"-97.397238","Date Submitted":"10/19/2011 01:16 UTC","Object Features":"Unknown"}