{"Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/32723.html.txt","/var/www/straped/mufon/org/32723.html"],"Tags":"City","Case Number":"32723","Object Shape":"Sphere","Object Flight Path":"Stationary","Log Number":"US-10192011-0014","Longitude":"-94.387543","Weather Factors":"None","Object Features":"None","Source":"MUFON","Date Submitted":"10/19/2011 02:17 UTC","Disposition":"Unknown","Latitude":"39.045663","trends":["There have been 67 other sightings in Independence","There was one other sighting in Independence on or around October 15th 2011"],"Region":"Missouri","City":"Independence","map":"<A HREF = \"http://maps.google.com/maps?q=39.045663,+-94.387543(32723)&iwloc=A&hl=en\"> mufon case (32723) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting Details I was driving and exited I-70 at the Lee's Summit exit heading East and pulled up to the stoplight on Lee's Summit road. My vehicle was the only one at that intersection. The light was red. Some movement in the road caught my attention- it was located to my left in the center part of the road. It was a dull black sphere about the size of a basketball or a little larger. It had no lights or windows or any features on it at all. The object was floating just a few inches above the road and moving in a straight line right along the middle of the street. It's shadow was cast on the road from the streetlights. The object passed in front of my car at a slow rate, and kept going along the road heading south and to my right, then just disappeared. The object did not fade out, it literally disappeared and was no longer visible. I watched it for approximately one minute, which was long enough to get a good look at it. My 18-year-old son was with me riding in the passenger side of the vehicle and he saw it, too, and said, \"Uh, Mom, what the heck is that?\" I've never seen anything like it but the first thing that I thought it could be was a UFO, however, it might have been something else entirely."],"Country":"United States","Summary":"Black orb floated along the street in front of me","Date of the Event":"10/15/2011 10:30 UTC"}