{"Region":"Florida","Object Features":"None","divs":["sighting detailsmy sister and her friend were sitting at st. mary's beach in bradenton fl when her friend decided to take some pictures of the ocean with his iphone of the water. after he took the first photo he was surprised as he showed her what he had captured. in the picture was a super bright, perfect circle that was blue\\white in color. she told him to take another picture but to move the phone to the right to see if it's in the picture again. when he held up his phone, neither one of them could see the object in the phone, or with the naked eye. he snaps the picture, looks and shows her that the object in fact was still in the picture, and it had moved with the camera. they were wondering if the light was some kind of refraction of light from the sun (which was also in the picture) so they took a third photo, at an even greater angle from the original picture. if you look at the photo you can actually use the stick\\log that is on the beach as a point of reference to show that the object in fact is completely stationary in all three photos. another interesting thing is the fact that in the first photo you can almost see a reflection of the object in the water below it. decide for yourself what it is and feel free to contact me with questions."],"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Bradenton","Disposition":"Insufficient Data","Log Number":"US-10192011-0012","Country":"United States","Case Number":"32721","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=27.502148,+-82.566789(32721)&iwloc=A&hl=en\"> mufon case (32721) map </A>","files":["/var/www/straped/mufon/html2text/32721.html.txt","/var/www/straped/mufon/more/32721_submitter_file1__UFO1.jpg","/var/www/straped/mufon/more/32721_submitter_file2__UFO2.jpg","/var/www/straped/mufon/more/32721_submitter_file3__UFO3.jpg","/var/www/straped/mufon/org/32721.html"],"Summary":"My sister and her friend were sitting taking pictures at the beach when they noticed a super bright blue/white light in the photos.","Weather Factors":"Unknown","Latitude":"27.502148","Date Submitted":"10/19/2011 01:32 UTC","trends":["There have been 27 other sightings in Bradenton","There were no other sightings in Bradenton on or around October 1st 2011","This sighting has never been favorited.",""],"Longitude":"-82.566789","Date of the Event":"10/01/2011 05:00 UTC","Object Flight Path":"Stationary","Object Shape":"Circle","Viewing Distance":"Unknown"}