{"Summary":"Glowing Blimp-like object with two red lights, one on top, the other on bottom over Michigan city, IN","City":"Michigan City","Source":"MUFON","Object Features":"Undisclosed","Date of the Event":"10/18/2011 06:15 UTC","Date Submitted":"10/19/2011 09:14 UTC","Sighting Duration":"Undisclosed","Region":"Indiana","Object Flight Path":"Other","divs":["sighting detailsme and my boyfriend were heading home from the lighthouse mall a little after sundown. it was a chilly, windy, fall evening. the sky was dark blue with few visible stars but bits of clouds in which had a dark burnt orange hew to them. my boyfriend was driving. he noticed a glowing object in the sky and pointed it out to me. it was about the size of a blimp. it was bright. it radiated a whitish, somewhat blue color and it was a ovalish, fat-disk shape. it almost seemed like it illuminated the immediate area around it as well. it reminded me of a glow stick. there were no \"lights\" shining down or onto it or anything else... the entire surface of the object was emitting a soft, but strong, glowing light. i thought it maybe just a blimp lit up like a lantern, but it wasn't. there were no letters or signs... the light was too bright for them to be visible anyway. plus it wasn't a fat blimp shape. it was a bit more elongated and skinnier, like a disk, but not so flat. there was no soil outline of the object. the light was too bright to see that. it moved smooth and straight like a blimp would but faster. we raced threw town, following it, attempting to catch up. he rolled threw stop signs and sped a bit. he was so excited, very loud, freaking out cause we might be actually seeing something crazy. he wanted to stop and buy a camera, i insisted that we did not because we will loose it! he kept repeating \"how can nobody else see this?!?\" i had to remind him to keep some of his attention to the road. we kept loosing sight of it because of the trees along the road blocking our view. it was moving south, or away from the lake at a steady speed. it was traveling maybe 30-40 miles an hour. we got really close to it when it was above the wooded area behind a jewel osco. i'm sure someone in the area could have look straight up at it from their back yard! we hopped onto us-20 and it seemed to be following i-94, now traveling west. now it was traveling about 60-70 miles an hour. it was farther away from us. it was also higher in the sky. but now we were able to get a good long look at the entire object. the color was more white now and then we defiantly seen a red light on top of the object and then another red light on bottom. we got off of us-20 and passed over i-94. we found a field an pulled over and watched the object continuing to head west. it moved out of veiw into the porter\\chesterton area. when we got home, my boyfriend regretted not chasing it. we told a friend. he agreed what we described did sound odd. we did not report it to anyone else. my boyfriend did make the comment \"if's funny how we see something so strange but act like nothing happen.\" i researched blimps and light and did not pull up anything other than ufo sightings. but no photographs similar to what i saw. i thought it was kinnda odd tho, there were simular stories around the same time last year?"],"Latitude":"41.709489","Tags":"City","files":["/var/www/straped/mufon/html2text/32727.html.txt","/var/www/straped/mufon/org/32727.html"],"Longitude":"-86.8932","Case Number":"32727","Country":"United States","Weather Factors":"Unknown","trends":["There have been 15 other sightings in Michigan City","There was one other sighting in Michigan City on or around October 18th 2011"],"Viewing Distance":"101-500 Feet","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=41.709489,+-86.8932(32727)&iwloc=A&hl=en\"> mufon case (32727) map </A>","Log Number":"US-10192011-0018","Object Shape":"Blimp, Disc, Oval"}