{"Latitude":"49.231985","Object Shape":"Sphere, Star-like","Source":"MUFON","Date of the Event":"10/17/2011 11:00 UTC","Object Flight Path":"Stationary,Path with directional change,Path then hovering","divs":["Sighting DetailsFirst my primary language is french so i'll try to do my best to explain it correctly. thank you I first went to the beach at Pointe-Lebel. Pointe-Lebel is a small village just next to the small city of Baie-Comeau. So i went there with my girlfriend to chill out a little bit. I go there like twice a week for about 2 years now. The view is very beautiful. I've never seen anything like that before. There was 2 bright lights flashing red-blue and white. They were hovering over the St.Lawrence river. At first we thought it was a plane of a stard. They were moving slowly, up, down, left and right always around the same spot in the sky. Thats why the theory of a plane or a star came impossible. Right next to those lights, a triangular formation of lights (white-yellow lights) was clearly visible. All those things came ON and OFF multiple times. When the triangle appeared for the first time, a dog near by start barking like i never heard a dog bark like. I think he noticed the thing too. He was completly scared (that's my theory.) The ufos were visible for about 1 hour or more. We were kind of nervous about the situation. I have interest for the UFO phenomenon for a couple of years. I have read about the subject, saw about 50 hours of documentery about it and i watch the sky regulary. But even with my moderate knowledge of the phenomenon, i wasn't prepare for that. I think we were king of scared but we didn't leave. It was just too incredible to me. A short time after we moved to Baie-Comeau and i parked my car in an empty parking lot. We noticed again a strange light (blue-red and white) Right next to the light, a formation of 5 bright lights came on. It was huge. It was completely symetrical. 3 vertical lights with 2 others on each side (including the first blue-red and white light). To me it was like a drawing of a giant flying saucer (but it wasn't a single objet.) The lights came off 30 minutes after. Notice that the sky was full of clouds and the UFOs were under. No stars were visible. A friend of mine who is living in the city of Rimouski saw some lights that looks very similar to the one that i've saw. Rimouski is in the other side of the St.Lawrence River. I have a computer assisted drawing. It's in french but i'm sure you will understand anyway."],"Summary":"Bright lights over Baie-Comeau,QC,Canada .Objects were flashing red-blue and white. Formation of lights were also visible.","files":["/var/www/straped/mufon/html2text/32722.html.txt","/var/www/straped/mufon/org/32722.html"],"Region":"Quebec","Weather Factors":"Unknown","City":"Baie-Comeau","Object Features":"None","Disposition":"Unresolved","Longitude":"-68.212321","trends":["There have been no other sightings in Baie-Comeau","This sighting has been favorited 1 time."],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date Submitted":"10/19/2011 01:55 UTC","Log Number":"CA-10192011-0013","map":"<A HREF = \"http://maps.google.com/maps?q=49.231985,+-68.212321(32722)&iwloc=A&hl=en\"> mufon case (32722) map </A>","Case Number":"32722","Country":"Canada","Tags":"City"}