{"Case Number":"32725","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"35.681583","Tags":"City","Object Flight Path":"Unknown","Summary":"Bright (neon) blue glowing orb moving up and down about the tree tops","Region":"North Carolina","trends":["There have been no other sightings in Catawba","This sighting has never been favorited."],"Date Submitted":"10/19/2011 04:11 UTC","Longitude":"-81.10109","Country":"United States","Log Number":"US-10192011-0016","City":"Catawba","Object Shape":"Sphere","Date of the Event":"10/14/2011 12:00 UTC","Source":"MUFON","divs":["Sighting Details On the evening of friday, oct 14 2011, i was at a friends wedding rehearsal, as i was to be one of the grooms. i was carrying something through the gate that led to where our ceremony was to take place, when i overheard some of the other attendees standing along the right side of the gate entrance. as i passed by them, i overheard one of them saying something about UFOs out of my right ear, and i continued to head toward my destination to set whatever i was carrying down. i returned to the gate to fraternize with everyone and looking at them, i had realized that they were all looking in congregation to the southeast. so i looked in the same direction, as one of my friends was informing me that there was some kinda blue disc-type object moving around the tops of the trees. around 5 to 10 seconds of looking i saw a bright, neon-blue object streak an arch above the tree tops, about 30 degrees above my level to the southeast, maybe 125 yards away. it was moving in a northeasterly direction when i witnessed it, but according to my friend who had witnessed it before my being involved, it had been hanging around that area for the last couple of minutes. he described to me a bright blue orb or disc shaped object making arcs just visible on the tops of the trees, and he wasnt sure if there were two of them or just the one. he also said that on one pass, it seemed to stop at the height of its arc for a second, then continued to finish its arc-ward motion. i saw that the object was so bright, that as it made its vertical semi-circular arcing motion, it left a wall of tracer. after it dipped back toward the tops of the trees, it left my visibility, but some were saying that they could still see it through the trees making its way around the top of the immediate area of the woods. not sure what it was exactly, but it certainly wasnt any kids toy or remote controlled airplane, because it was big enough that if there were any conventional means of flight being applied, we would have heard it at that distance. but it was totally silent. and i doubt any one is flying super-bright, orb shaped, neon lit kites on a non-windy day in the woods of all places."],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=35.681583,+-81.10109(32725)&iwloc=A&hl=en\"> mufon case (32725) map </A>","files":["/var/www/straped/mufon/html2text/32725.html.txt","/var/www/straped/mufon/org/32725.html"],"Object Features":"Unknown"}