{"Object Flight Path":"Stationary","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Connecticut","Tags":"City","files":["/var/www/straped/mufon/html2text/32731.html.txt","/var/www/straped/mufon/org/32731.html"],"Longitude":"-71.962262","Date of the Event":"10/19/2011 05:00 UTC","Latitude":"41.361796","Summary":"Yellow-Orange orb stationary in backyard at 5:00 am","map":"<A HREF = \"http://maps.google.com/maps?q=41.361796,+-71.962262(32731)&iwloc=A&hl=en\"> mufon case (32731) map </A>","Case Number":"32731","divs":["Sighting DetailsI awoke at 5:00 a.m. and turned my head to look out the window from my bed. I noticed that it was completely dark, as if the street lights had gone out on the street behind my backyard. I then saw a yellow-orange orb in my backyard aprox. 150-200 feet from my house. I looked at the clock and noted the time, then closed my eyes for a moment. I looked again and saw that the light was still there so I got out of bed and moved the sheer curtains aside to take a better look. I saw an orb that was yellow-orange - it was stationary in my backyard (below the tree line). It seemed a little fuzzy (or because my eyes were tired), so I closed one eye and tried to focus on it. I realized that it was not my neighbors back porch light, nor a flashlight, nor an interior light from someones house, nor a street light. It was a yellow-orange circular light in my backyard close to the ground. I was really tired, and didn't think about what else it could be, so I got back in bed and fell asleep for another 20 minutes. I then awoke at 5:30 and looked again, the orb was gone, but the street lights were once again lite on the road behind my yard. After going back to sleep, and waking at 6:30 I told my husband the story of the strange light in the backyard at 5am. It rained all day on the 19th, but I went out in the far backyard to take a look. I did not see anything out of the unusual, but then again I don't know what I'm looking for. Let me tell ya... if this happens again, I'm waking up my husband and we're going outside to research. Cause now I can't stop thinking about it."],"Source":"MUFON","Disposition":"IFO","Object Shape":"Circle, Sphere","Country":"United States","City":"Mystic","trends":["There has been one other sighting in Mystic","There were no other sightings in Mystic on or around October 19th 2011"],"Viewing Distance":"101-500 Feet","Date Submitted":"10/19/2011 10:19 UTC","Weather Factors":"Unknown","Log Number":"US-10192011-0019"}