{"Weather Factors":"Unknown","Region":"Illinois","divs":["Sighting DetailsIn reference to MUFON CASE #32715 Joliet Illinois last night at about 7:00 pm I was driving south down Larkin Ave after doing some grocery shopping. I noticed something in the sky that at first looked like the moon trying to come through the clouds. Kind of a domed shape shining behind the clounds. As I kept driving I noticed this thing was actually moving. I got out my phone and started recording this thing. At this point and from my view it looked almost like a large domed shaped object but not defined like I said it looked like it was a very bright glowing object behind the clouds but then agian it wasn't, it's just hard to explain what I was seeing. It was moving too fast to be a blimp but too slow to be a plane or a helicopter so I decided to try and follow it and as I drove down Larkin to Route 6 I just couldn't keep up with it but with that said it was no longer behind the clouds and appeared that it could be a blimp but then I thought, in this weather, at this time....no, and it was glowing, the whole thing was lit up, a blimp doesn't do that. By the time I turned the corner onto Route 6 and heading west it seemed to be flying south west and over Exxon Mobile Refinery off of 55 possibly and then it seemed to head south and then a little east. I soon lost interest and headed home, during the drive home I phoned my husband and told him what I saw and that I recorded the sighting. When I got home and reviewed what I recorded on my phone all you could see was the reflection of my window and the glaring street lights. Today after finding this article I went to get my phone and look at the recording again but unfortunately it was nowhere to be found on my phone and I KNOW I did not erase it, soooooo I don't know what that's about. All I know is I saw something and I don't think it was of this world."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.533061,+-88.080005(32734)&iwloc=A&hl=en\"> mufon case (32734) map </A>","Country":"United States","City":"Joliet","Source":"MUFON","Object Features":"Dome, Other","Log Number":"US-10192011-0022","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Blimp, Other","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Date of the Event":"10/18/2011 12:00 UTC","Date Submitted":"10/19/2011 10:47 UTC","Disposition":"Unresolved","Tags":"City","Latitude":"41.533061","Case Number":"32734","Sighting Duration":"Undisclosed","Summary":"Blimp shaped UFO over Joliet Illinois","trends":["There have been 12 other sightings in Joliet","There were no other sightings in Joliet on or around October 18th 2011"],"files":["/var/www/straped/mufon/html2text/32734.html.txt","/var/www/straped/mufon/org/32734.html"],"Longitude":"-88.080005"}