{"Date Submitted":"10/20/2011 02:16 UTC","Case Number":"32742","Disposition":"IFO","Object Shape":"Sphere, Square, Rectagular","Country":"United States","Date of the Event":"10/08/2011 11:58 UTC","City":"Redondo Beach","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32742.html.txt","/var/www/straped/mufon/org/32742.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.831446,+-118.381807(32742)&iwloc=A&hl=en\"> mufon case (32742) map </A>","Latitude":"33.831446","Longitude":"-118.381807","divs":["sighting detailsat 23:58 on saturday 10-8-11, i was smoking a cigar by the pool in my apartment complex when the security guard on duty came running by shouting to follow him quickly. when we arrived at a clearing, we saw orange lights hovering in the sky, moving in very slow formation. by the time i was able to get my cell phone to record the event, we counted 7 objects in the sky. they seemed round and bright orange and seemed to dim out and disappear. duration was about 2 minutes. two minutes later, at 00:00 10-9-11, we saw a single ufo moving toward us slowly. it was closer this time. the best description i can give is that it looked like a rectangular orange lantern floating in the sky even though we knew definitely that it wasn't a lantern. it was longer vertically and at the center was a brighter spherical light, perhaps the craft itself. the rectangular shape was more like a light surrounding the craft and not the craft itself. it soon dimmed out and with the naked eye we could still see, faintly, the spherical center moving across the sky. almost like it turned the light off that gave it a rectangular aura. then it disappeared. at 00:05 10-9-11, another single ufo appeared and seemed to float across the sky before dimming out again. again orange and like a rectangular lantern with a brighter spherical core. there was never any sound. there was no wind, the night was relatively clear with low cloud in certain parts. when the singular craft moved toward us at 00:00, we could also make out a kind of reflection of white light behind it on the bottom of the cloud. almost like if one would shine a headlight up toward the cloud. i have posted the videos i took from my droid3 phone onto youtube. the cell phone videos don't do justice to what we saw with our own eyes. but at least it was recorded! here are the links for your review. i couldn't figure out a way to send it via email because the file sizes are too big. i work in sales\\promotions for the los angeles times and the security guard was an mp in the army during his tour in iraq. hope that helps! [links moved to field investigator section\\cms\\tg]"],"Weather Factors":"Unknown","trends":["There have been 10 other sightings in Redondo Beach","There was one other sighting in Redondo Beach on or around October 8th 2011"],"Summary":"7 orange lights/UFO's slowly moving in night sky on 10-8-11 23:58 Redondo Beach, CA","Region":"California","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Log Number":"US-10202011-0007","Tags":"City","Object Features":"Unknown"}