{"Latitude":"32.7996","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 3 other sightings in El Centro","There were no other sightings in El Centro on or around September 13th 2011","This sighting has never been favorited.",""],"City":"El Centro","Region":"California","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Date of the Event":"09/13/2011 10:15 UTC","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/32744.html.txt","/var/www/straped/mufon/org/32744.html"],"divs":["sighting detailswhile driving through the desert on i-8 from the city of el centro, ca towards the city of ocotillo, ca at around 10:15 p.m. on september 13, 2011, my daughter noticed some kind of electric fog coming out of the sand and everywhere we looked. it was electric bluish in color for what she asked me, \"mom, what is that?\" i responded; \"i don't know honey, in 25 years that i lived in this area, this is the first time i see anything like this.\" i was driving at a speed of 78 m\\h and was tired. i asked her to find a hair clip to hold my bangs up because they were bothering me on my eyes. while she was digging in her purse, a strange whitish-grayish sphere wearing some kind of bluish gown swoop down from north to south in front of my windshield for what i yelled, \"did you see that?\" my daughter responded, \"i was busy looking for the hair-clip in my purse, what it was?\" i didn't want to scare her, so i responded \"oh, nothing. it must have been a shooting star.\" she kept digging in her purse when the thing came back, now from south to north, swooping down to about one foot away from my windshield, for what i had the same reaction. i yield; \"did you see that again?\" then she angrily answer \"how do you want me to see anything if i am looking for that **** hair clip for you?\" \"well, just pay attention. forget about that clip, because i have the suspicion that thing is coming back\" i said. at that moment the sphere swoop down again in front of the windshield, but this time hovering in front of us at the same speed we were driving for a few seconds, it felt like the thing was trying to stop us or scare us out of the road. it looked like a crystal sphere and the edge was glowing with some kind of grayish electricity. a gown was covering it, also transparent of a whitish-bluish color. to me the gown resembled casper the friendly ghost. my daughter was scared, so she said a prayer to god, and when se said the name of jesus christ, the whole atmosphere that was surrounding us vanished. i would like to say, this is the third time i have a paranormal experience on this area of california."],"Date Submitted":"10/20/2011 04:22 UTC","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Case Number":"32744","map":"<A HREF = \"http://maps.google.com/maps?q=32.7996,+-115.558621(32744)&iwloc=A&hl=en\"> mufon case (32744) map </A>","Log Number":"US-10202011-0008","Tags":"City","Object Features":"Undisclosed","Longitude":"-115.558621","Summary":"Orb swoops down in front of my windshield 3 times while driving East to North on I-8"}