{"Log Number":"US-10202011-0013","Region":"New Jersey","Disposition":"Unknown","Object Features":"Unknown","Date of the Event":"10/20/2011 07:25 UTC","Object Shape":"Sphere","Case Number":"32749","City":"Bayonne","Weather Factors":"None","trends":["There have been 2 other sightings in Bayonne","There were no other sightings in Bayonne on or around October 20th 2011"],"Longitude":"-74.114309","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32749.html.txt","/var/www/straped/mufon/org/32749.html"],"Object Flight Path":"Stationary,Hovering then path","Summary":"went outside for a smoke ,spotted it up in sky, bright red pulsating never seen a plane or helicopter with only red lights ,i watched it for a min.or two and called my son ,then me and 2 neighbors watched it for another 15 mins ,","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.668714,+-74.114309(32749)&iwloc=A&hl=en\"> mufon case (32749) map </A>","divs":["Sighting Detailsi went outside to have a cigarette about 730pm ,i noticed a bright red light in the sky to the north .i watched it for a min or two till my cigarette was done ,it didnt move the whole time only flashed its lights like 1,2,3 1,2,3 then quicker then more steady again for a little longer duration then quick again . i called my son out to see it ,and he said its a blimp.and went back inside .i watched it a bit longer still not moving now its been about ten mins i observed this,and a neighbor walking his dog passed and i asked him what he thought it was. we were both puzzled ,then his daughter came home and asked what were we looking at, and she was just as baffled. now it started to have a green light flash once in while with the red and was drifting a little.i asked my wife to come out and she was shocked too.then it drifted right and left a couple of times ,then it drifted in a northeast direction, much faster ,maybe as fast as a plane or a little faster..a very bright star was in sky just to the south of the path it took."],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.668714","Country":"United States","Date Submitted":"10/20/2011 08:33 UTC"}