{"Object Features":"Unknown","Case Number":"32745","Summary":"I saw the exact same thing the other mans son described but I believe I wasn't close enough to feel or hear any crash landing.","Date of the Event":"10/18/2011 02:15 UTC","divs":["Sighting DetailsMy husband and I were driving through Nebraska maybe around 2 or 3 am, maybe earlier. I noticed the sky was very clear and it was cold, maybe 29 or 30. I saw a flash that looked like lightening. I was headed east on highway 80 at mile marker 335. I looked out to the left to see if there was a storm coming and a giant flaming multiple colored ball of light with a long bright colorful bluish green white in the center tail was following what appeared to be a large object on fire. I followed it with my eyes as did my husband and after it was out of sight the gaseous cloud seemed to hang in the air like a low jet stream almost at my eye level like fog. Then as we looked back it looked like a contained explosion with a blue dome keeping it in had hit the ground out in the darkness. I was hoping nobody was hurt and what exactly I saw. I've seen shooting stars, visited planetariums, watched meteor showers and done recreational research mainly to teach my son about space and the solar system and I have never seen anything like this. I chalked it up to a possible comet collision but it seems different for some reason. I was in awe asking myself what the hell was that and repeating wow for hours. That's why I looked and found this. This was way to close to be a shooting star. In addition we did see four normal shooting stars along the same stretch before and after this other object. It looked like the lunar module entering the atmosphere in the movie Apollo 13. It came from the above right and seemed to curve with the atmosphere of earth. Strange. Hope to hear from you."],"Date Submitted":"10/20/2011 04:47 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Fireball, Flash, Sphere","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/32745.html.txt","/var/www/straped/mufon/org/32745.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.498647,+-99.898043(32745)&iwloc=A&hl=en\"> mufon case (32745) map </A>","Longitude":"-99.898043","Tags":"City","City":"Undisclosed","Object Flight Path":"Path with directional change","Latitude":"41.498647","Source":"MUFON","Viewing Distance":"Unknown","Country":"United States","Log Number":"US-10202011-0008","Region":"Nebraska","trends":[]}