{"Source":"MUFON","Object Shape":"Sphere","Date of the Event":"10/20/2011 12:00 UTC","Longitude":"-93.383576","Sighting Duration":"Undisclosed","Region":"Minnesota","files":["/var/www/straped/mufon/html2text/32743.html.txt","/var/www/straped/mufon/org/32743.html"],"Object Features":"Unknown","Log Number":"US-10202011-0007","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"N/A","divs":["sighting detailsi was just going to bed and happened to glance out the window. my window faces due east. i didn't have my glasses on but i noticed a blurry bright saucer shape off in the distance about 30 to 40 degrees above the horizon. it looked like it could have been 1\\2 mile in diameter. so, i ran for my glasses and when i put them on i realized it was a cloud bank, about 3 to 4 miles away, and it seemed to be glowing from within. then i realized it must be moonlight glowing from behind the cloud. but the rest of the sky was full of stars. i thought it was pretty so i stood looking then after a couple minutes a bright white star sized object dropped down from beneath the cloud. it seemed to have a red light flashing on it's south side the object came to rest about 100 to 200 feet beneath the cloud then expanded to about 10 times it original size. it held this size for about 15 seconds then shrank to it's original size then disappeared. the light reappeared a few seconds later, in the same spot, still flashing white and red, then winked out again. it reappeared a few minutes later in a different spot in the sky at the same height, hovered for a couple of minutes then winked out and didn't come back."],"Country":"United States","Viewing Distance":"Over One Mile","Disposition":"Unknown","trends":["There have been 6 other sightings in Anoka","There were no other sightings in Anoka on or around October 20th 2011"],"Date Submitted":"10/20/2011 02:24 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.203893,+-93.383576(32743)&iwloc=A&hl=en\"> mufon case (32743) map </A>","Case Number":"32743","Latitude":"45.203893","Summary":"Star like object dropped out of cloud","City":"Anoka"}