{"Longitude":"-86.354166","Log Number":"US-10202011-0011","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"40.764184","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around July 1st 1890"],"Viewing Distance":"101-500 Feet","City":"Logansport","Region":"Indiana","files":["/var/www/straped/mufon/html2text/32747.html.txt","/var/www/straped/mufon/org/32747.html"],"Case Number":"32747","Date of the Event":"07/01/1890 01:00 UTC","Object Features":"Unknown","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.764184,+-86.354166(32747)&iwloc=A&hl=en\"> mufon case (32747) map </A>","Disposition":"Unresolved","Tags":"City","Weather Factors":"Unknown","divs":["Sighting Details This is a strange story but interesting none the less so I thought I should share it to see if anybody could do anything with it. I have a video tape of my great grandma from when I was kid. She was sitting around with her sisters talking about old stories from when they were kids. One sister started talking about a story her father, my great great grandpa made her promise to never talk about, but since she was over 90 years old she didn't think it mattered anymore. She was very flustered still just talking about it. The best we can tell, this event took place in the Logansport, Indiana area in approximately the 1890's or so, maybe earlier, maybe later. My great Aunt was taking food to her father and grandfather working the fields all day as she did every day. She would take a horse and cart out to where they were working, have lunch, then come back home. On this particular day, she could not find her father, or grandfather. She then heard them yelling at her to get inside the woods nearby and hide. She complied and that's where they began telling her that they have been watching some sort of flying machine that didn't make any sort of noise flying around the field. They supposedly watched little people get out of the craft and take pieces of corn and soil, then they flew away. The uncle and father had been hiding in the woods for some time afraid to leave. All the people in the video have now passed on, but my grandma who is now in her mid 80's, the daughter in the story's niece, gave me this tape because she was curious if I could find any other reports from that time frame of anybody reporting the same sort of thing. I have the tape of the story, and that's about it. It's just a story, but interesting"],"Date Submitted":"10/20/2011 03:29 UTC","Summary":"Old story on a video tape from my Great Grandma","Source":"MUFON","Object Flight Path":"Unknown"}