{"Longitude":"-115.088436","Object Shape":"Unknown","Log Number":"US-10202011-0015","map":"<A HREF = \"http://maps.google.com/maps?q=36.13105,+-115.088436(32751)&iwloc=A&hl=en\"> mufon case (32751) map </A>","Date Submitted":"10/20/2011 10:35 UTC","Region":"Nevada","Summary":"Don't beleive it is a UFO","Disposition":"IFO","Weather Factors":"Unknown","Object Features":"Unknown","Object Flight Path":"Stationary","Tags":"City","Latitude":"36.13105","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/32751.html.txt","/var/www/straped/mufon/org/32751.html"],"Date of the Event":"07/05/2011 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around July 5th 2011"],"Source":"MUFON","City":"Las Vegas","Country":"United States","Case Number":"32751","divs":["Sighting DetailsApproximately in July I was in my backyard and I saw what appeared to me at the time a possible blimp with flashing red, green and amber lights. I live in a neighborhood where all the street names end in Dale. We are in the neighborhood across from Boulder Station casino. I have consistently seen up to three of these objects which flash the same kind of lights. I have actually seen one move horizontally and stop and then followed it up the street as it moved horizontally south like toward Utah. Then I spoke to neighbors who I don't know and they said they see them all the time and pointed more of these objects out to me. I live in the southeast part of Las Vegas, Nevada. I have no sense of direction but I can drive straight up Nellis and will come to Nellis AFB. I have contacted Channel 3, was told it is a blimp, Have emailed George Knapp who never responeded , spoken to a LVMPD motorcycle officer who spent ten minutes telling me he is sure it is a helicopter. I ahve many other witnesses who I have made come out to see these lights. We all see them. I now see them every night always they are in place as soon as it is dark. They are not stars. I have tried to photograph them. I have tried to see them through binoculars. I don't have the right equipment. Here's the thing. I drove to a Shopping center parking lot near my house and I could barely see one behind a tree. These are to low to be seen by all of vegas I guess. I even contacted a channel 3 cameraman who is acquainted with my Mom and he really showed no interest. Anything you can come up with that it might be does not fit. It (They) are not lights on a mountain, weather balloons or whatever. Here's what I have decided they are but of course How can I possibly prove it. I think they are some kind of survelliance drones sent out by Nellis AFB. I do see one often in the same location as if it is watching Maccarron Airport which I'm sure you know is the big airport for Las Vegas. The One closet to me which I see in the same place nearly every night seems to be over the Las Vegas strip. I am an intelligent person and by now know when something in the sky is not a normal flying machine. Maybe you know what it is. Maybe alot of people know what it ( They) are. But I do not."]}