{"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsI was exiting my car last night, Oct 20th, at approx. 11 pm when something caught the corner of my eye up in the sky. I looked up to see a V-shaped object that was silently gliding fairly slowly across the sky. It went out of my view so I changed locations only to see it make a large circle and then head back north. It was in sight for approximately 30 seconds then moved out of view completely and about that time a smaller object of the same shape and opacity shot from the south heading north behind it. At first I thought it looked like a flock of birds then realized that it was too perfect and when it circled around I got a better view. There were no lights and no sound. The objects were almost transparent, foggy kind of like a cloud but in a V shape and glided very eloquently and smoothly. I have never seen anything other than normal meteorites in the night sky. I was very excited yet perplexed. I do feel validated though when I read on the Examiner that there was another sighting extremely similar just a few miles away from me and only 30 minutes prior to my sighting last night."],"Case Number":"32763","Disposition":"Insufficient Data","Region":"Texas","Longitude":"-96.693676","Summary":"Gliding V shaped objects, no lights, no sounds, mist around them","Viewing Distance":"101-500 Feet","Log Number":"US-10212011-0012","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Object Shape":"Boomerang","Country":"United States","Source":"MUFON","City":"Plano","Date of the Event":"10/20/2011 11:00 UTC","trends":["There have been 25 other sightings in Plano","There were no other sightings in Plano on or around October 20th 2011"],"Tags":"City","files":["/var/www/straped/mufon/html2text/32763.html.txt","/var/www/straped/mufon/org/32763.html"],"Latitude":"33.022913","Date Submitted":"10/21/2011 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.022913,+-96.693676(32763)&iwloc=A&hl=en\"> mufon case (32763) map </A>"}