{"Object Shape":"Boomerang","Source":"MUFON","Date of the Event":"10/16/2011 02:10 UTC","Weather Factors":"Unknown","divs":["Sighting Details It was approximately 2pm, I was sitting in my back yard on a clear Sunday afternoon. With me was my wife, brother in law, 15 year old son, nine year old daughter and a couple of nephews. My son and nephews were busy cleaning the yard from a BBQ the previous day. My wife and I were sitting o the patio chatting with her brother in law. My nine year old daughter interrupted and said, look at the thing in the sky, it looks like a boomerang. We ignored her and kept talking. What ever she was looking at was not in our view due to the angle of the roof. My daughter said it a couple more times. I told her to wait a minute and said I was sure it was just an airplane. My daughter walked to the front yard, leaving us to talk. A couple more minutes passed and she yelled for us to come look, saying it was still there. We got up and walked to the front yard, my brother in law was leaving anyway, along with my son and nephews. My daughter pointed to the sky at an object above the tree line across the street. It appeared to be extremely high and felt it was most likely an airplane. It did not appear to be moving but I felt that was probably due to its extreme hight. My wife went to house and got a pair of binoculars. When I looked at the object through the binoculars, I was surprised to see a large boomerang shaped object that was glowing orange. The object appeared to be stationary. The orange illumination was bright and appeared to be coming from five circular areas all merging together. I could se a faint outline behind the lit area. I thought the orange color might be a reflection from the sun but a high flying air plane passed by and there were no colors reflecting from it. Everyone took turns looking through the binoculars. Everyone thought it was strange. I watched the object for another 10 minutes. During that time I watched as it did the following: The center point of the boomerang rotated from facing left to the right. It then began to move to the right for approximately three seconds. It then stopped, rotated again, until it was pointing up. It began to move up for a couple seconds and stopped again. It rotated until it was pointing down but did not move. A couple seconds later it rotated to the left again and began to move to the left for approximately five seconds. It stopped again and remained stationary for a couple minutes. After approximately 10 minutes of watching it began to slowly move away until I could not see it anymore. I thought of going for my camera but I did not have a lens nearly as strong as the binoculars and I did not think I would capture anything other than the usual blurry UFO photo. I have never seen anything like this and I am usually a skeptic when it comes to things like this. I am a Deputy Sheriff and former long time U.S. Marine, so Im use to dealing with facts. This has left me stumped."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.261671,+-119.244069(32775)&iwloc=A&hl=en\"> mufon case (32775) map </A>","Latitude":"34.261671","Case Number":"32775","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","City":"Ventura","Log Number":"US-10222011-0002","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 17 other sightings in Ventura","There were no other sightings in Ventura on or around October 16th 2011"],"Summary":"clear day, the object was very high in the air. Through binoculars, it was seen as boomerang shaped and glowing bright orange. remained stationary then rotated directions.","Tags":"City","Date Submitted":"10/22/2011 12:59 UTC","files":["/var/www/straped/mufon/html2text/32775.html.txt","/var/www/straped/mufon/org/32775.html"],"Region":"California","Longitude":"-119.244069","Object Features":"Unknown"}