{"Case Number":"32773","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other","City":"Clifton","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.869905,+-97.613827(32773)&iwloc=A&hl=en\"> mufon case (32773) map </A>","Date Submitted":"10/21/2011 11:27 UTC","Object Features":"Other, Unknown","Summary":"As before, our little dog outside barked to alert us of trouble. I went out and saw 3 objects towards the NE and 2 started moving away. I got the binoculars to get a better look. More kept appearing and all seemed to be headed towards SE, with the excepti","Viewing Distance":"Unknown","divs":["Sighting DetailsOur dog barked to alert us of trouble, as he had done with a past sighting. I went outside and saw 3 objects with bright, flashing lights. One stayed stationary as 2 moved away. One of them went into a stealth mode after a circle of red flashing lights. The other followed suit and both appeared again, only more started showing up from the area of the stationary cylinder shaped object. One of the later ones appeared to be cigar shaped as was spotted last year. Several shapes and colors of lights were observed. They mostly headed in a SE to SW direction, some high up and others low to the ground in appearance. Some seemed to try to camaflouge themselves, like they were just heading to the local airport, but they were way too large and anybody watching could tell the differenHce.I had been watching tv with the family when our dog alerted us. Other family members saw this as well. The airplanes have an audible engine noise and these guys were only audible to the animals and their extra senses. This is another dead giveaway that they are not of the norm. The way the objects jump around at times and their size, also says this is not right. Either our government is up to something with unknown aircraft, or the dark angels are reving up their appearances. I first saw them just before 9pm cst and saw last one so far around 10:05pm. Honestly, I have seen many here in the past, but nothing like tonight. Wake-up people and be ready, for the time of the 'Rapture' draws nigh."],"Sighting Duration":"01:10:07","Date of the Event":"10/21/2011 09:00 UTC","Log Number":"US-10212011-0022","trends":["There have been 2 other sightings in Clifton","There were no other sightings in Clifton on or around October 21st 2011"],"Weather Factors":"Unknown","Region":"Texas","files":["/var/www/straped/mufon/html2text/32773.html.txt","/var/www/straped/mufon/org/32773.html"],"Latitude":"31.869905","Disposition":"Unresolved","Longitude":"-97.613827","Country":"United States","Object Shape":"Cigar, Cylinder, Disc, Oval, Sphere"}