{"Date Submitted":"10/21/2011 10:01 UTC","Tags":"City","Case Number":"32770","Object Flight Path":"Straight-line path,Path then hovering","Region":"Missouri","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Summary":"Flew in from SW going NE steady pace then steady hover, very odd AC.","Sighting Duration":"Undisclosed","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/32770.html.txt","/var/www/straped/mufon/org/32770.html"],"Object Features":"Other","City":"Independence","Date of the Event":"10/21/2011 07:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","divs":["sighting detailsit was 1900 (7pm) exactly as i was driving home from work along us hwy 40 in a populated area independence\\lee's summit missouri at dusk. i saw flashing lights in the corner of my eye (coming from the southwest going northeast) and i looked up through my windshield to see a triangular shaped ufo with what looked to be a transparent center with white, non-simultaneous or patterned flashing lights on all sides with at least one or two blue lights on at least one or two corners. the ufo had a steady, straight path without spinning, tilting, turning, raising or lowering and then stopped and steadily hovered over a populated area without spinning, tilting, turning, raising or lowering. i lost sight of the ufo as i continued to drive down us hwy 40 and hills and trees go in my light of sight. at first i thought it was a flight of aircraft, being an ex-air traffic controller, i knew it wasn't since there were no slight adjustments between the lights, it seemed to be a solid structure with no green or red lights and looked as though it was larger than a stealth bomber flying in an area i've never seen aircraft fly around here before. i did not hear any sound, but i also had the radio turned up fairly loud. my feelings were just shock and surprise and i remembered hearing about mufon in an interview on 96.5 the buzz (krbz) in kansas city approximately a month or two before, talking about 7 reports of a similar description in a town connecting to lee's summit over a water tower (raytown, mo) up until i lost sight and i could not observe any more similarities. no interferences besides the observation physically or psychologically of any kind were noticed in this event."],"Longitude":"-94.421158","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around October 21st 2011"],"Latitude":"39.035873","Log Number":"US-10212011-0019","map":"<A HREF = \"http://maps.google.com/maps?q=39.035873,+-94.421158(32770)&iwloc=A&hl=en\"> mufon case (32770) map </A>"}