{"Sighting Duration":"01:00:00","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/32780.html.txt","/var/www/straped/mufon/org/32780.html"],"Disposition":"IFO","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsI was outside smoking a cigarette on my balcony around 2:30am. As I look around at the stars one sticks out more than the others. It was the lowest light in the sky and was flashing all types of colors. It seemed to jump up and down, as well as side to side, and a circular motion. It reminded me of how a fly(insect) would buzz around, but in slow motion. I watched for quite a while and went in to get my girlfriend. She pointed it out without me telling her where it was. The first thing she said was it looks like a UFO. It was too cold for her she went back inside. I stayed and watched as this object seemed to, or at least I thought was telling me to go where it was. From my vatange point, looking west, it was probably above Simpsonville, KY, which is only a few miles away. I tried to film this object with my iPhone camera and it was too dark. I firmly believe this was a craft under intelligent control. I eventually just went back inside and went to sleep because I had work today. People would probably think I'm crazy if I went around knocking on doors."],"Summary":"Saw flashing light from my apartment balcony while smoking. Object changed colors and skipped around a small area in the sky","Case Number":"32780","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.257095,+-85.750156(32780)&iwloc=A&hl=en\"> mufon case (32780) map </A>","Date of the Event":"10/22/2011 02:36 UTC","City":"Louisville","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around October 22nd 2011"],"Log Number":"US-10222011-0007","Latitude":"38.257095","Object Features":"Other, Unknown","Weather Factors":"None","Longitude":"-85.750156","Object Flight Path":"Path with directional change","Object Shape":"Star-like, Teardrop, Other, Unknown","Date Submitted":"10/22/2011 12:00 UTC","Source":"MUFON"}