{"Object Flight Path":"Stationary","Country":"United States","Date of the Event":"10/14/2011 12:00 UTC","City":"Roanoke","Latitude":"37.324389","files":["/var/www/straped/mufon/html2text/32781.html.txt","/var/www/straped/mufon/org/32781.html"],"Longitude":"-79.896459","Viewing Distance":"Unknown","Case Number":"32781","Source":"MUFON","Weather Factors":"None","Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around October 14th 2011"],"Tags":"City","divs":["Sighting DetailsI was in Roanoke VA to visit my family for the weekend and had gone out to my mother's front yard to smoke a cigarette and get some things from my car approximately around 9pm. It was an exceptionally clear night, and i had not trouble seeing many stars as well as aircraft. As soon as I walked out the front door I looked directly ahead approximately NW at an elevation of approximately 24 degrees towards the top of read mountain which was visible between the trees and the neighbor's house across the street. My attention was immediately directed to a light or cluster of lights that appeared to be just over the top of Read Mountain by a couple hundred feet at best. The best guess at the distance (with my brothers help as well as google maps) was about 2000 ft from where I was standing. From my vantage point you could hold a tablet of aspirin flat at arms length and it would just fit in between the mountain and the lights. The lights were unusually bright for a plane or any other aircraft that I've witnessed, and seemed larger than they should be for the distance. They were flashing and brighter than any star in the same area of the sky, as well as any plane, of which there were many, but certainly not at that low of an elevation. Additionally, there were no planes in that particular part of the sky. They all were off to the east and west flying overhead from E to W, and at no less an elevation of 85 degrees compared to the 20-24 of the lights. It was very clear to me that it was some sort of motionless CRAFT, not a star, street light (it was in the air over a mountain with NO lights) or any other common occurence. I am currently 29 years old, mentally sound, and spend a great deal of time looking at the sky. The most notable color was a bright VIVID red, which was the first thing that struck me as odd. As I watched for a moment the colors flashed between red, orange, yellow, and white... possibly pale blue, but from the distance it was hard to tell subtle differences in color variation. I decided to walk up the driveway to the street to my car, thinking it nothing more than unusual. I lit a cigarette and walked down the street till the lights were in view again. From there I had a more clear vantage point than before. The lights were still present and did not appear to move at all, I attempted to hold up my thumb for a reference for size and to gauge the motion, if any, of the lights. I took notice of no discernible movement of the object. I watched the lights attempting to pick out any sort of pattern to the flashing and changing of color, but could not. I currently live in Brooklyn, NY. I spend a lot of time on my roof at night watching the planes and stars as well as through my windows. Directly over my apartment is a main air traffic pathway and am accustomed to seeing many different types of aircraft and watch their light patterns intensely. To my knowledge there is ALWAYS a very simple pattern to them, and this set of lights that I saw were flashing fairly quickly and at random, save of course if it just happened to be a very LONG sequence. I stood and watched the object intently for another 2 minutes or so, when my attention was drawn by another plane passing overhead, quite audibly. I looked away for no more than 10 seconds, and when I looked back to the lights, they were simply gone. After 5 minutes of being essentially motionless, they were just gone. Like someone had unplugged a Christmas tree. I said out loud \"Oh, you've GOT to be f****** kidding me...\" I stood in the same place attempting to locate them for another 5 minutes, looking all around in the sky... nothing. At the time, I wasn't at all sure what I had seen. I went back in the house and told everyone about it. It made enough of an impression that I mentioned it, which is in itself unusual. We talked about it for a couple of minutes and then it faded out of conversation. Just last night I received a call from my eldest brother and mother. One week from the night I saw the lights, and around the same time, they had returned. Both my mother and brother saw them, her from her house and my brother from his. My mother had the longer and more detailed account. The three of us spoke on the phone about it for about half an hour and cross referenced each others sightings. As best as we could tell it was the same or at least similar object in roughly the same location. Her report is on file currently on this very same website, and I urge you to read it. \"Long description of sighting report\" is the title. It is listed under Roanoke, VA on October 21st. Though it wasn't her first sighting, this is both of our first times reporting the matter. This is my first sighting."],"Log Number":"US-10222011-0008","Object Features":"Unknown","Date Submitted":"10/22/2011 01:06 UTC","Object Shape":"Unknown","Region":"Virginia","Summary":"Lights seen in the sky over Read Mountain, Roanoke VA","map":"<A HREF = \"http://maps.google.com/maps?q=37.324389,+-79.896459(32781)&iwloc=A&hl=en\"> mufon case (32781) map </A>"}