{"Object Flight Path":"Straight-line path","Log Number":"FR-10222011-0013","Longitude":"2.359572","Date Submitted":"10/22/2011 09:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=48.862024,+2.359572(32786)&iwloc=A&hl=en\"> mufon case (32786) map </A>","Weather Factors":"Unknown","Latitude":"48.862024","Date of the Event":"06/26/2011 01:02 UTC","Source":"MUFON","Tags":"City","Case Number":"32786","Object Features":"None","files":["/var/www/straped/mufon/html2text/32786.html.txt","/var/www/straped/mufon/more/32786_submitter_file1__ufoboomerang.jpg","/var/www/straped/mufon/org/32786.html"],"Disposition":"Unresolved","Region":"Île-de-France","Summary":"boomrang shape starlite straight direction no sound no noise transparent Paris France June 2011 dark black","Viewing Distance":"501 Feet - 1 Mile","Country":"France","Sighting Duration":"00:00:10","Object Shape":"Boomerang","trends":["There have been 11 other sightings in Paris","There were no other sightings in Paris on or around June 26th 2011","This sighting has never been favorited.",""],"City":"Paris","divs":["sighting detailsfirst sorry about my english (i'm french). at the day of 26 of june 2011 about 1h00 passing 06\\25\\2011 during 10s i made an ufo observation about a dark and silent boomerang above paris buildings. laing down in the grass and about watching the sky, i was observing stars and constellations hence satellite objects because the sky like the atmosphere were very good and clear that day. i started around 11pm and spend about 1hour in what way. then approaching midnight i decided to leave cause i'm leaving far from that place when once again i turned my head to look again the sky. then i was astonish to see something like starlight moving together in the same direction. i knew that this couldn't be possible so immediately i realized that those lights were surrounded by an other light what gave to the object a boomerang shape. the object had 4 no blinking lights in one side and 2 no blink lights in other second side\\ it was move from north east side to the south west side when we refer to the map of france. all inner light of the object was dark and looked transparent because the color was the same as the sky. there was no sound, no noise from the object and it was look close and much more bigger than a simple aircraft. compare to the planes i could observe meanwhile those one who use to be very hight in the sky were in the same size to the light i could see in the sides of the wings boomerang. i was like i could observe 6 airplanes waving same time and in the same direction in the middle of the night or this happened in the center of paris city, with city lights. after 10s of observation when trying to take my cellphone to shoot the scene the object disappear completely. even a lot of people where around to me i was so chocked that i could yell or talk. then i called the police to leave a testimony when talking to theme, they advice me to pass and make a deposit i said yes but never gone before."]}