{"Object Flight Path":"Straight-line path","Date Submitted":"10/22/2011 10:58 UTC","Viewing Distance":"21-100 Feet, 101-500 Feet","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was years ago, I was coming home from work at about 9:20 pm. As I was approaching Church Road heading south on Ferndale Avenue, I noticed in the sky to my left, about 60 degrees up from the horizon, and about 70 degrees to the left of directly in front of me, two lights that looked like car headlights off in the distant sky. I was amused that it looked like the headlights of the flying car in the movie \"Flubber\" by Walt Disney. It held my attention for a second or two as I drove down the straight street and didn't need to watch the road closely. As I approached Church Road, the light on the left came swooping downward in front of me. It went from the size of a BB to about the size of a green pea and made a downward arc passing about 40 to 50 feet in front of my car and with the lowest point of the arc being about 25 to 30 degrees above horizontal to me. It moved in a symmetrical arc back up into the sky and was gone in an instant. I looked back to see what the other light might have done. It was now about the size of a nickel and was about 45 degrees above the horizon and about 45 degrees to the left of directly in front of me, approaching about as slowly as a private airplane. In seconds, the one brighter light became more discernible as four separate lights. The object seemed to have no outline as it moved overhead, and I could see that the lights were two circular white lights and two diamond-shaped white lights. They were arranged with the two diamond-shaped ones on the right and left and the two circular ones in the front and rear. As the object got closer, it was so large I wanted to get a better look at it, so I pulled my car across Church Road and got out to see better. I don't know why I got out. I was not the least bit afraid. I just wanted to see it. It was now directly overhead. I couldn't see an outline at all but was sure it was one object and if round, would have been about the size of a softball held at arm's length. It moved slowly and silently across the sky above me and off to my right. Although it was moving approximately the direction that Church Road went, I did not jump in my car and attempt to follow it, and have no idea why I didn't. It slowly floated toward the horizon and I just got in my car and headed home, feeling so lucky that I had finally seen an object that was flying and unidentified. Due to the facts that I was not afraid, that I got out of my car, and that I didn't try to follow it, I have often wondered if it made me feel those feelings. I would really like to undergo regressive hypnosis to find out if I was taken and returned, or was entranced, and I would like to be made to recall more details and the date of this experience. If this is possible, please contact me."],"Country":"United States","Object Shape":"Circle, Disc","City":"Dallas","Date of the Event":"08/15/1997 09:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.886354,+-96.721211(32788)&iwloc=A&hl=en\"> mufon case (32788) map </A>","Log Number":"US-10222011-0015","Weather Factors":"Unknown","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around August 15th 1997","This sighting has been favorited 1 time.",""],"Longitude":"-96.721211","Case Number":"32788","Source":"MUFON","Latitude":"32.886354","files":["/var/www/straped/mufon/html2text/32788.html.txt","/var/www/straped/mufon/org/32788.html"],"Summary":"Small object passed quickly followed by larger object floating slowly over me.","Disposition":"Unresolved","Region":"Texas","Object Features":"Other"}