{"Object Features":"None","Object Shape":"Flash","Latitude":"37.437993","Log Number":"US-10222011-0016","Tags":"City","trends":[],"Object Flight Path":"Unknown","Weather Factors":"Unknown","Date of the Event":"10/19/2011 11:30 UTC","Country":"United States","City":"Undisclosed","Case Number":"32789","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/32789.html.txt","/var/www/straped/mufon/org/32789.html"],"Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=37.437993,+-78.649594(32789)&iwloc=A&hl=en\"> mufon case (32789) map </A>","Summary":"I was driving and all of sudden all was lit by blue/white light -then flash above tree line and then gone. No storms or search helicopter seen.","Longitude":"-78.649594","Disposition":"IFO","Date Submitted":"10/22/2011 11:54 UTC","divs":["Sighting DetailsI was driving home from my evening job about 11:30pm on 10-19-11. I turned into Pocoshock Dr. from Hull Street Road and about 100 ft after turning in, suddenly everything illuminated with a blueish white light that continued for what seemed about 3 seconds. It was almost as if a light switch had been turned on. I could not see or figure out what was causing such a bright light. There are mature trees on either side of the road so it was difficult to see a large enough portion of the sky. My thoughts were, \"Are we being attacked? Is this an explosion?\" I braced for a bang but then the night blackness resumed--followed quickly by a flash over the tree tops to my right and then whatever the source it was gone. I did not see any indication of a UFO craft--just the amazingly bright light that I described. I immediately rolled down my windows to listen for thunder--but there was nothing but silence. I thought at the time that surely lightening that bright and low as to illuminate such a huge area would cause a big bang--but again there was nothing but silence. There were no other cars traveling on the street that could have been shining bright haligen headlights at me. I pulled over on Dell Drive on the Surreywood Subdivision side where I could safely stop and I looked out the car window for signs of storm clouds or for a search helicopter--but neither existed. The sky was silent and filled with wispy clouds--but no storm clouds that I could see. I was very puzzled, but surprisingly calm. The odd light had been so bright that my eyes slightly ached at the back of my eye balls--but strangely I did not see spots in front of my eyes as would be typical when a bright light was shined in your face. This was definitely a very unique occurrence and has kept me thinking about it and researching similar reports on the internet. I have shared the experience with my family and co-workers--who have listened kindly and considered the event odd as well."],"Source":"MUFON","Sighting Duration":"00:00:03"}