{"Summary":"Satellite-like object traveled slowly, then flew horizontally across 60% of night sky in < 3 seconds.","Tags":"City","Disposition":"Unresolved","Date Submitted":"10/23/2011 03:18 UTC","trends":["There have been 7 other sightings in Lufkin","There were no other sightings in Lufkin on or around November 19th 2008"],"City":"Lufkin","Object Shape":"Sphere, Unknown","Longitude":"-94.724027","Sighting Duration":"00:00:18","Object Flight Path":"Undisclosed","Latitude":"31.425084","Source":"MUFON","Region":"Texas","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32795.html.txt","/var/www/straped/mufon/org/32795.html"],"Case Number":"32795","Country":"United States","Date of the Event":"11/19/2008 01:00 UTC","Log Number":"US-10232011-0006","Viewing Distance":"Over One Mile","divs":["Sighting Details1. 2 Honors college students were stargazing atop tallest building on college campus. (No intoxicants were involved) 2. After about 30 minutes of stargazing and satellite-watching, I pointed out an especially bright \"satellite\" (or so I thought... it was 4-8x brighter than Venus) moving at \"average\" satellite speed, traveling horizontally from North to South. After viewing the object for about 15 seconds, it made a slow S curve in the sky, then suddenly accelerated, and flew across 60% of the night sky, disappearing over the horizon, in < 3 seconds! The object was very high in the air, and the light it emitted was steady and white. Like I said, it could have been mistaken for a very bright satellite if it had not rocketed over the horizon in mere seconds! My stargazing buddy and I were startled, but unaffected by this event. We have not told anyone for fear of being thought \"crazy.\" I have since seen this exact type of phenomenon 2 more times from the roof of the same building, though I did not document the dates. (The view of the sky is unobstructed, and we are not in the flight path of an airport.) The flight path of the object looked roughly like this: === is slow speed, ----- is extreme speed, < indicates direction. <---------------------------------==~==============<"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.425084,+-94.724027(32795)&iwloc=A&hl=en\"> mufon case (32795) map </A>"}