{"City":"San Leandro","Disposition":"Unknown","Tags":"City","Date of the Event":"10/22/2011 10:30 UTC","files":["/var/www/straped/mufon/html2text/32794.html.txt","/var/www/straped/mufon/org/32794.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.73307,+-122.151357(32794)&iwloc=A&hl=en\"> mufon case (32794) map </A>","Latitude":"37.73307","Country":"United States","Case Number":"32794","Date Submitted":"10/23/2011 02:16 UTC","Object Features":"None","Viewing Distance":"Unknown","Region":"California","Object Flight Path":"Path with directional change","Object Shape":"Unknown","divs":["sighting detailsenjoying the nice evening and with much aircraft traffic from oakland int'l and sfo both private and mostly commercial this light caught my eye and i tried to follow it.time was approx 10:30 pm with clear skies. it at first i thought was a commercial ac heading west but then it moved erratically and not so much in a straight line but up,down,right,left,and extremely fast.hard to reference distances at night but movements were fast, slow, just not normal. the light or lights(i could'nt determine if one or more) did not blink as all a\\c do normally and were not,i repeat not,port and starboard red and green or landing lights but what appeared to be just one white light.the movements were very distinct and at times hard to track as the light was not a constant. i tried to follow it and did so until the light went below neighbors roof-line but the movements were extremely erratic. i assumed based on my own knowledge and experience flying that i thought it to be at normal heights of commercial traffic not in the landing or take-off patterns here in the sf\\bay area. i thought it (?) to be at 20 to 30 k ft alt but who knows."],"Summary":"rapid erratic movement from SE to SW with sporadic lights appearing to blink on then off(no constant)","trends":["There have been 8 other sightings in San Leandro","There were no other sightings in San Leandro on or around October 22nd 2011"],"Source":"MUFON","Longitude":"-122.151357","Log Number":"US-10232011-0005","Weather Factors":"None","Sighting Duration":"Undisclosed"}