{"Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/32796.html.txt","/var/www/straped/mufon/org/32796.html"],"Case Number":"32796","Country":"United States","Tags":"City","divs":["sighting detailsi was outside having a smoke and looking at the stars as i usually do. i wanted to see the constellation of orion so i had to sit on our balcony railing. i was looking up as in straight up and then i noticed it. i first thought that it could be a plane but it was moving very fast and had no faa lights on it and if it was a plane it was flying faster then any i'd seen at what i would assume was a very high altitude. it was moving very quickly much like you'd see a bird at about 75' over head. i 1st noticed the 4 red\\orange lights and though it funny that i couldn't see the faa lights, and then i noticed the speed it was traveling and the spacing of the lights was all wrong for a plane. and that's when it clicked in my head that there was something very odd about this. there were red-orange, more red then orange... and not that faa red, this was a dull red, another thing that caught my attention, the color of the lights. 4 lights, no tail lights no faa. just 4 lights traveling very quickly at what i would assume was a very high altitude towards the 2 bottom stars of the orion constellation, for about 6-7 seconds when it faded out and i couldn't see the object \\ objects anymore. i don't know if these 4 lights were part of a larger object or 4 separate objects. i think that covers everything. holy crap... i feel lucky to have seen this. i don't know how to put this in to words, but i've seen space junk, the iss, multi-stage rockets and stealth planes etc etc etc. this was something that i've never ever seen before and i am my own harshest skeptic."],"Object Features":"Unknown","Longitude":"-118.490218","Latitude":"34.44505","City":"Santa Clarita","map":"<A HREF = \"http://maps.google.com/maps?q=34.44505,+-118.490218(32796)&iwloc=A&hl=en\"> mufon case (32796) map </A>","Object Shape":"Cylinder, Triangle, Unknown","Weather Factors":"Unknown","Log Number":"US-10232011-0007","Region":"California","Date of the Event":"10/23/2011 02:24 UTC","Sighting Duration":"Undisclosed","Date Submitted":"10/23/2011 06:36 UTC","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around October 23rd 2011","This sighting has never been favorited.",""],"Summary":"4 lights in a row traveling north to south, faint but moving very fast"}