{"map":"<A HREF = \"http://maps.google.com/maps?q=42.950951,+-123.364233(32801)&iwloc=A&hl=en\"> mufon case (32801) map </A>","Object Features":"Unknown","Date Submitted":"10/23/2011 02:43 UTC","Weather Factors":"Does Not Apply","City":"Riddle","divs":["Sighting DetailsWas leaving a residence at about 2230 hours in Riddle. The sky had been clear and stars were clearly visible. As I got into the car, I saw a large white strobe light brightly blink on the horizon behind some trees, although I found it curious and watched the sky for several minutes, I passed it off as perhaps a small plane flying over the mountains. About five minutes later, as I was driving east on the Riddle by-pass road towards the 103 exit of Interstate 5, we saw the same type of white light randomly blinking over another mountain top. These mountains are to the northwest of the I-5 103 exit. I estimated the lights were just over the mountain tops and about four or five miles away from where we were. You could intermittently see the reflection of some of the brighter flashes across the back of the mountain. We could see the lights start flashing in various random patterns at this point. There appeared to be one main light (about aspirin size) that would flash intermittently. It would disappear and then there would be a series of eight to ten small lights that would flash into a vertical pattern, and then into a horizontal pattern. The length of these patterns seems to vary. I eventually pulled over into an empty parking lot where me and my family got out to watch. The light patterns continued on this pattern for several more minutes. It was then I noticed the lights were also flashing into a triangular shape. Each transformation into these shapes lasted only for a few seconds. At one point, when the lights extended into a vertical line, there appeared to be several small satellite lights that fell from the top of the vertical line. These lights appears as if they must have hit the mountain top or they just seemed to vanish. It was too dark to see any sort of hard structure or shape, other than what shape the lights made. The lights also extended into a curved vertical line (like a half moon shape). The horizontal and vertical patterns seemed to stretch over the greatest distance over the mountain; using about eight to twelve individual lights. We watched these lights for about twenty to thirty minutes. We continued north on the freeway and could still see the lights from mile post #108. I pulled over again to view the lights from a different angle. The lights (although slightly dimmer due to the distance and haze now beginning to form in the air) were still blinking in the same manner. The lights were all white in color, although a few of the smaller falling lights almost appeared to have an orange and blue hue sometimes. The last I saw of the lights had been when a solid light (not blinking as all the others had been) dropped from the top of the vertical line to the ground. The lights seemed to disappear from view at that point. There are some large radio towers several miles to the north along this same mountain top. All the radio towers have solid red and a few blinking red lights on them. Having grown up in the area, I have no explanation for what we saw at this point. My son and I were able to take several videos on our iPhone 3Gs. Due to the distance, darkness and video quality, they didn't turn out great. However, the footage may be able to be lightened."],"Sighting Duration":"Undisclosed","Log Number":"US-10232011-0012","Source":"MUFON","Disposition":"Unknown","Longitude":"-123.364233","Country":"United States","trends":["There have been no other sightings in Riddle","This sighting has never been favorited."],"Case Number":"32801","Tags":"City","Object Shape":"Flash, Oval, Sphere, Star-like, Triangle","files":["/var/www/straped/mufon/html2text/32801.html.txt","/var/www/straped/mufon/org/32801.html"],"Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"Over One Mile","Date of the Event":"10/22/2011 10:00 UTC","Summary":"Observed multiple lights randomly blinking into various shapes over a mountain top.","Latitude":"42.950951","Region":"Oregon"}