{"Case Number":"3280","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/3280.html.txt","/var/www/straped/mufon/org/3280.html"],"Object Flight Path":"Undisclosed","divs":["Sighting DetailsSighting Report: At about 8:40 p.m. on March 21, 2005, I was driving north on Michigan Road (US 421) from Zionsville towards my house, located just north of 146th Street (CR 300S). The sky was clear. As I approached the stoplight at the intersection of 146th Street and Michigan Road I noticed up in the sky, just a bit to my right and at what appeared to be several thousand feet up, a line of three bright orangy-yellow lights - similar to the color and intensity of warning lights on highways at night. The line of three lights was moving slowly to the north. At first I thought I was seeing a large airplane - I momentarily thought it might be a C5A or a 747 that was flying low - but then remembered that neither one of these planes would have three lights of this color in a row (wingtip-center-wingtip), so it then struck me that this was something I had never seen before. I thus brought what I saw to the attention of my wife (sitting next to me) and my son (sitting in the back seat), who both looked up and said they saw the same thing I described and were as confused as I was regarding what we were looking at. After about three seconds, one of the lights dimmed and then went out, then it came back on as the others dimmed and went out, and then the one that had gone out the first time and came back on again dimmed and went off. By this time we had turned into our subdivision, so I parked the car so my sone and I could get out and try to see the lights again. We did; this time, though, we only saw two and they were several miles away, but still headed in a northerly direction. As before, after about ten seconds, the two lights dimmed and then went out. My son and I continued to watch the sky for ten more minutes, but never saw the lights again, so we got back in the car and drove home, getting there about 9:00 p.m. My interest piqued, I then went outside to see if I saw the lights again. I did. At about 9:10, I again saw three lights, of the same color but not the same intensity, as by now they appeared to be about 15 miles north of where I was, seemingly over the town of Kirklin, IN. What I saw this time was two lights in a line and one light above the one on the left. They stayed on for about 15 seconds, then the leftmost of the two dimmed and went out and then the other two dimmed and went out. About five minutes later, in the same spot, I saw two of the three lights come one again, for about 10 seconds before then dimmed and went out. I stayed outside for about 10 more minutes but never saw the lights again, so I went inside for the night. For the record, I called the Exectutive airport near out house to ask if anyone there knew of anything going on - they didn t, and hadn t seen the lights - and I called the newsroom at the Indianapolis Star to report what I had seen, but was told I was the only person who had called that evening. I still haven t a clue what my son, my wife, and I saw, but after reading some of the postings from the April 2004 flap over north central Indiana I realized that other people have seen the same thing I saw, so now I am really interested in learning more. Please feel free to contact me if you need any additional information. Thank you."],"Viewing Distance":"Unknown","City":"Zionsville","Longitude":"-86.261937","Object Shape":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"04/01/2005 03:03 UTC","Country":"United States","Summary":"Not Provided","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=39.950873,+-86.261937(3280)&iwloc=A&hl=en\"> mufon case (3280) map </A>","Region":"Indiana","Disposition":"Insufficient Data","Latitude":"39.950873","Date Submitted":"04/01/2005 03:03 UTC","trends":["There have been 4 other sightings in Zionsville","There were no other sightings in Zionsville on or around April 1st 2005"]}