{"Summary":"saw moon sized light with pulsating light coming from it took pictures on my cell phone revealing awsome detail with entity","divs":["Sighting Detailsreported this back in 2009 to mufon was told was high profile catagory 2 case with entity involved did not get to talk with field investigator before i moved so i am going to put them on again on feb 5th 2009 aprox. 8pm i was staying in austn texas close to lake travis for work while waiting for a tv show i went outside while outside i looked up there was a huge brite lite the size of the moon just feet from the ground so brite i could not focus on it my first reaction was to go inside to get my cell phone to snap pictures i stood to the side of the building i was staying and took one picture holding phone almost straight up keeping phone on object did not move on my screen so i went back to where i was at first took another picture with phone almost straight up again there was a smaller pulsating light coming towards me from the bottom it had a strobing like pattern at this time i became extremly afraid that somthing was not right my first reaction was to go back inside i sat my phone down and sat down in a chair the next thing i remember it was 5hrs. later i woke up on the foor laying on my side my eyes were burning and i was soaking wet all over the front of my body i put ice on my eyes and went back to sleep the next morning i woke to go to work and relized then what had happened got up to check to see if my pictures had came out after checking them and showing my friends they said i should contact mufon which i did and moved before i got any feedback from the investigator so here they are again for those who did not see em before"],"Date of the Event":"02/05/2009 08:00 UTC","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=30.429947,+-97.929285(32804)&iwloc=A&hl=en\"> mufon case (32804) map </A>","Date Submitted":"10/23/2011 06:39 UTC","Longitude":"-97.929285","Case Number":"32804","City":"Austin","Country":"United States","Region":"Texas","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/32804.html.txt","/var/www/straped/mufon/more/32804_submitter_file1__090205_185743.jpg","/var/www/straped/mufon/more/32804_submitter_file2__090205_185820.jpg","/var/www/straped/mufon/more/32804_submitter_file3__090619_212033.jpg","/var/www/straped/mufon/org/32804.html"],"Disposition":"Unknown","Viewing Distance":"101-500 Feet","Log Number":"US-10232011-0015","Weather Factors":"Unknown","Tags":"City","Object Shape":"Sphere","Object Features":"Unknown","Latitude":"30.429947","Source":"MUFON","trends":["There have been 188 other sightings in Austin","There were 2 other sightings in Austin on or around February 5th 2009","This sighting has been favorited 1 time.",""]}