{"Latitude":"32.765976","Object Features":"Unknown","Weather Factors":"Unknown","Sighting Duration":"00:00:09","Region":"Texas","Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=32.765976,+-97.795464(32818)&iwloc=A&hl=en\"> mufon case (32818) map </A>","Date of the Event":"10/06/2011 07:48 UTC","Date Submitted":"10/24/2011 01:45 UTC","Longitude":"-97.795464","files":["/var/www/straped/mufon/html2text/32818.html.txt","/var/www/straped/mufon/org/32818.html"],"Disposition":"Insufficient Data","Summary":"a round white llight 800 miles per hour north to south parallel to the ground","Source":"MUFON","divs":["Sighting DetailsI am a truck driver. I had just got fuel at the pilot truck stop at exit 406 interstate 20. My logbook concurs the time. The fuel card would be even more exact. I left immediately after getting fuel Im headed east on I 20 toward my destination. which was our yard in fort worth. The sky was clear. No heavy traffic. ........... about a mile east of exit 406 a bright white light caught my eye. It was coming in from the north Traveling south. At first of course I thought it was a meteor. I thought heck, I never have a wish prepared, to wish upon a falling star. But it didn't burn out. It kept going. It didn't diminish. And I thought \" god help ne think of a good wish\" Then I said to myself. \"HOLY ______\"***\" Is that?? OMG!! IT WAS ABOUT TO GO OUT VIEW BY NOW. It took me 30 seconds to get to the part of the freeway where it crossed. I was traveling 60 miles per hour. I've been driving for 16 years. I have seen a lot of stuff in the skies. But never anything like this. I am very good at estimating speeds And distances. I have excellent depth perception. My opinion is It was traveling about 800 miles per hour. In a straight line parallel to the ground. 500 to 1000 feet off the ground. And then it was gone. When I got to the point where I believed it crossed. I looked south and saw nothing. That was not a rock burning up in the atmosphere. A few minutes later. I posted on news channel 25 out of waco texas facebook my experience. That's how convinced I am. What ever it was. Was real. THATS WHAT I SAW. THATS WHAT I BELIEVE. EAIT TILL YOU SEE ONE... YOU WILL BE ON THIS SITE ALSO.."],"City":"Weatherford","Log Number":"US-10242011-0002","Country":"United States","Case Number":"32818","trends":["There have been 9 other sightings in Weatherford","There were no other sightings in Weatherford on or around October 6th 2011"],"Object Flight Path":"Straight-line path","Tags":"City","Viewing Distance":"501 Feet - 1 Mile"}