{"Longitude":"-97.400294","Tags":"City","Case Number":"32816","divs":["Sighting DetailsAbout a year ago, I noticed an object in the sky while driving home. I got home and stayed outside to watch the object for about 15 minutes until if finally just faded out. I've been seeing this off and on frequently since then, and it is always appears in the same area, around the same time - 8pm. I have viewed it up to 30 minutes at times. It appears to come in from the northwest, and stops due west and hovers. It sometimes appears to gradually head south until it fades out of sight or it just fades out slowly. Most of the time I see one object, but a couple of times I have seen several smaller objects around the one object moving erratically. The objects seem to project from the bigger object and surround it. There also appears to be some sort of communication with blinking of lights and synchronizing switching of positions in the sky, but I cannot determine a pattern. Tonight was one of the coolest sightings because there were three big objects that were obviously communicating. One came in and stayed hovering while another approached it and took off due south. Then another one came in and hovered beside the original, they traded position,and then the original object headed due south. They all remained blinking different colors, and before trading positions, the colors seemed to coordinate. At one point, the original object started to brighten before it swapped positions with the second. Eventually, the last remaining object slowly dimmed until it just faded away. I've witnessed this fading away before, many times, which makes me feel like it is still there. Sometimes, I have waited and watched it reappear, and then slowly fade out again. Still, there is no pattern to how often or, if it, will reappear. I have captured some of these sightings on recording, but the camera that I have is old. I have a new one now, but the auto settings seem to throw off the resolution from that distance, so it's frustrating. This is a new experience to me, so I've been looking online to see if there are similar sightings, but nothing so far. I don't know what this is. But I do know it is not an airplane, helicopter, satellite, flying star, planet, or any other flying object that I know of. I live in the country with a clear view of the Texas night sky. I can see the city lights of the closest city, and all the smaller towns in between."],"Region":"Texas","Disposition":"Insufficient Data","Date of the Event":"10/23/2011 08:00 UTC","Sighting Duration":"00:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=30.578695,+-97.400294(32816)&iwloc=A&hl=en\"> mufon case (32816) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/32816.html.txt","/var/www/straped/mufon/org/32816.html"],"Object Shape":"Circle, Disc, Flash, Oval, Star-like, Unknown","City":"Taylor","trends":["There have been 3 other sightings in Taylor","There were no other sightings in Taylor on or around October 23rd 2011"],"Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"10/23/2011 11:42 UTC","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-10232011-0027","Weather Factors":"Unknown","Summary":"Witnessing stationary, hovering, flashing, multiple, communicating unidentified flying objects in the Texas night sky for over a year.","Latitude":"30.578695","Source":"MUFON"}