{"Object Features":"Patterned Surface, Other","Date Submitted":"10/24/2011 09:03 UTC","Country":"United States","City":"Delaware","map":"<A HREF = \"http://maps.google.com/maps?q=40.29239,+-83.074502(32823)&iwloc=A&hl=en\"> mufon case (32823) map </A>","Date of the Event":"10/23/2011 08:40 UTC","Log Number":"US-10242011-0007","Region":"Ohio","files":["/var/www/straped/mufon/html2text/32823.html.txt","/var/www/straped/mufon/org/32823.html"],"Tags":"City","Source":"MUFON","Disposition":"Unresolved","Summary":"Large wheel shaped discs flew south to north over our backyard last evening. Outside edge, center and spokes glowing orange. No sound. groups of 3 or 4 at a time, then one at a time in a straight line. When directly overhead, some disappeared.","Object Shape":"Circle, Disc, Other","Latitude":"40.29239","Case Number":"32823","trends":["There have been 13 other sightings in Delaware","There were no other sightings in Delaware on or around October 23rd 2011"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-83.074502","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","divs":["Sighting DetailsLast evening after dark, our dog was at the back door and wanted in the house. This was odd. He never wants to come in. So I left him in and B___ went out on the patio to pick up a few things. Almost immediately I heard him calling me to come see. I hurried outside and we watched these strange orange lights through the trees coming from the south. When we realized they were flying towards us, we stood there and watched in amazement as a whole fleet flew over us. They were glowing orange around the outside, the center, and inner spokes like a wheel and made absolutely no sound. First three of them in a triangle formation, then clusters of two, three, four, then one at a time. As they flew over head, we tried to take some pictures with a cell phone. The time was 8:43 PM. We watched them for about 5 minutes. Some disappeared into the night sky as they flew over. Either they got higher or went above the clouds, or just vanished. We could see stars in the sky, but these flying objects were much larger, much lower and much brighter. They all had a shape, or structure, like a wheel, which was glowing bright orange, and they were flying to the north, not hovering, not floating, not zigzagging. But flying in a direct line to the north. These were not airplanes or helicopters. They were much larger, very different in shape and size, and made no noise. After they were gone, we watched for a while and checked later, but didn't see them anymore. We downloaded the photos and looked at them. They show the glowing orbs, not the distinct outline of lights that we actually saw. I never thought I'd see something like this. In my opinion, these were UFO's."]}