{"Object Features":"Other","Date of the Event":"10/22/1996 09:30 UTC","Tags":"City","Longitude":"-80.415179","Date Submitted":"10/24/2011 03:46 UTC","divs":["Sighting DetailsAround 9:30pm October 22,1996 I was in my backyard cleaning up after a barbecue.All of a sudden I glanced up at the sky and was amazed at the site. There was a diamond-like object extremely large in size with colorful bright lights within the shape which did not reflet out of the object.Suddenly, the object began to tilt and wobble while still traveling in a vertical, straight direction and gaining altitude. This was ongoing for a couple of minutes, I had the opportunity to spot some airplanes in a much lower altitude.The object travled vertically as opposed to the horizontal planes and its size was visibly much larger dispite its higher altitude. Also when the object traveled by a large cloud it was brightly illuminated like nothing I've seen before. As the objct began to head south I watched it till it was nothing more than a tiny glowing dot in the sky. It has been 15 years since the encounter, I have told many friends and family but they are reluctant to believe me. I am open to questioning and futher investigation to confirm that my statements are true."],"files":["/var/www/straped/mufon/html2text/32828.html.txt","/var/www/straped/mufon/org/32828.html"],"Summary":"Diamond-like object with colorful lights traveling vertically","Source":"MUFON","Region":"Florida","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=25.757137,+-80.415179(32828)&iwloc=A&hl=en\"> mufon case (32828) map </A>","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around October 22nd 1996"],"Case Number":"32828","Log Number":"US-10242011-0012","Viewing Distance":"Unknown","Sighting Duration":"00:04:00","Object Flight Path":"Straight-line path,Path with directional change","City":"Miami","Latitude":"25.757137","Object Shape":"Diamond, Unknown","Weather Factors":"None","Country":"United States"}