{"Object Shape":"Blimp, Fireball, Oval","Object Features":"Unknown","Disposition":"Unresolved","Longitude":"-122.405401","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/24/2011 07:58 UTC","Log Number":"US-10242011-0021","City":"Tacoma","Object Flight Path":"Straight-line path,Path with directional change,Other","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32837.html.txt","/var/www/straped/mufon/org/32837.html"],"Country":"United States","divs":["Sighting DetailsI had driven over to a friends' house as I pulled up to the curb I noticed a very bright light in the sky. I thought it was a police coptr with a searchlight but the light was way way brighter than any I'd seen before. As it got closer it then looked to be \"a large bowl of fire\" about the size of 2 billboards or maybe a blimp,\"like the Goodyear or Metlife blimps\". I knocked on the door to have my friend see this. As we watched it \"floated \" in a northeast direction. After a minute or two it dimmed and than shot upwards at a rate I've never seen before.I haden't even noticed that it wasn't my friend but his roommate until afterwards.What I felt mostly was WOW. Iknew and know that I had a close-up ufo sighting. Not just some fast lights in the sky. It made me remember some old sightings where they had described a ufo as a bowl of fire and some theorists thought that maybe rocket or jet exhaust but this really looked like a huge bowl of red hot fire was flying across the sky without a sound. D."],"Case Number":"32837","Date of the Event":"06/06/2011 10:30 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.172735,+-122.405401(32837)&iwloc=A&hl=en\"> mufon case (32837) map </A>","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around June 6th 2011"],"Summary":"saw what looked to be a very bright searchlight on a copter moving west to east when it got closer it looked like a bowl of fire . no noise as it flew at a point it dimmed and then shot up at unreal speed","Latitude":"47.172735","Region":"Washington"}