{"Tags":"City","Log Number":"US-10242011-0016","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-95.100247","divs":["sighting detailsi was driving home at 10:00 p.m. heading east on 68 highway with a close friend when the car in front of us slowed down to a 10 mph crawl. hovering above the road near the power lines on the north side of the road a thick black triangle object with three lights, one on each point and a band of lights on what seemed to be the back of the craft. we stopped (along with the car ahead of us ) and watched the craft 'float' north making no noise. this thing was close, like a football field away close so trust me this is not some idiot reporting a stealth bomber or ambiguous distant light. i could damn near touch the thing! i cannot stress enough how clearly we could see this slow, slow moving air ship\\ ufo\\ whatever. so after at least a solid sixty seconds it kept slowly hovering silently north and then when it was 500-600 yards away it 'blinked out' totally gone...no vapor or exhaust trail or noise of any kind. just some local honest hard working people with their minds blown parked on the side of 2 line kansas highway. whether it's e.t. or just some black budget military project it's real people!"],"trends":["There have been no other sightings in Rantoul","This sighting has never been favorited."],"Object Shape":"Triangle","Latitude":"38.548624","files":["/var/www/straped/mufon/html2text/32832.html.txt","/var/www/straped/mufon/org/32832.html"],"Object Features":"Other","Region":"Kansas","Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Case Number":"32832","map":"<A HREF = \"http://maps.google.com/maps?q=38.548624,+-95.100247(32832)&iwloc=A&hl=en\"> mufon case (32832) map </A>","Source":"MUFON","Date Submitted":"10/24/2011 07:11 UTC","Disposition":"Unknown","City":"Rantoul","Summary":"Driving home on 68 hwy with a friend when the car in front of us slowed down to a 10 mph craw. Signaled to pass and saw a thick black triangle object hovering over the road.","Weather Factors":"Unknown","Date of the Event":"06/10/2009 10:10 UTC"}