{"trends":["There has been one other sighting in Camden","There were no other sightings in Camden on or around October 22nd 2011"],"divs":["Sighting DetailsMyself, my husband and my son all witnessed a light in the sky which seemed to grow in size and brightness at times. At times it took on an almost \"ghostly\" blue hazy appearance.It flew across the horizon very quickly in a straight line, then changed direction and seemed to hover at times. At other times it seemed to move in an elliptical flight path. My son suggested getting flashlights and flashing to see if we might get it's attention. I flashed the light five times, paused, then flashed five more times. Immediately the light seemed to increase in size as if it were coming closer to us. I was astonished at what seemed to be a response from the light and it started to move in a \"U\" shaped path, back and forward, dipping and going back. This type of behavior was observed for at least 90 minutes, one witness says it was 3 hours. The light was not active during the entire time. There were times when the light would hold position for a long time, then suddenly start moving again. This event was also witnessed the next night by the same people at the same location and by our grandson who was in the next county at an outdoor Halloween event."],"Case Number":"32831","Summary":"Light in the horizon changing direction and brightness.","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"36.114487","Longitude":"-88.079768","map":"<A HREF = \"http://maps.google.com/maps?q=36.114487,+-88.079768(32831)&iwloc=A&hl=en\"> mufon case (32831) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32831.html.txt","/var/www/straped/mufon/org/32831.html"],"City":"Camden","Log Number":"US-10242011-0015","Object Features":"None","Region":"Tennessee","Date Submitted":"10/24/2011 06:30 UTC","Date of the Event":"10/22/2011 10:00 UTC","Disposition":"Insufficient Data","Object Shape":"Star-like"}