{"trends":["There have been 2 other sightings in Blountville","There were no other sightings in Blountville on or around October 24th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.533159,+-82.326806(32840)&iwloc=A&hl=en\"> mufon case (32840) map </A>","Viewing Distance":"101-500 Feet","Country":"United States","Object Flight Path":"Path with directional change","Disposition":"Unknown","Object Shape":"Sphere","City":"Blountville","divs":["Sighting DetailsI stopped with my wife for some drinks at the roadrunner market, off of exit 69 in Blountville, Tn. It was nearing 7:30pm on October 24th 2011. Upon leaving the store and returning to our car, I tried starting the car and it wouldn't start. The strage thing was I have never had trouble starting it before, also the lights were still on in the car or I would have believed it to be the battery. I left my car and went back inside asking for help from the employees because, I have no jumper cables. The employees didn't have any either so one of them left to go across the street and borrow some from advance auto. As I stood on the sidewalk of the store facing an Arby's, I seen a strange and rather large for a plane glowing white ball descending from the sky. Being rather close to an airport, I first thought it was a plane but.. it was coming down oddly slow and away from the airport. As it fell, there were small fireball typr things ejecting from it like a normal meteor would. But as it got to the tree tops...it shot straight up super quick and I lost it almost instantly in the clouds. I didn't try my car again until after they had boosted it..But, it did work. I posted about it on facebook and a friend of mine replied saying he had seen the same thing at the same time while driving on Fort Henry Drive in Kingsport!!"],"Region":"Tennessee","files":["/var/www/straped/mufon/html2text/32840.html.txt","/var/www/straped/mufon/org/32840.html"],"Date Submitted":"10/24/2011 08:57 UTC","Object Features":"Unknown","Latitude":"36.533159","Longitude":"-82.326806","Date of the Event":"10/24/2011 07:33 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Case Number":"32840","Summary":"I was at the Roadrunner market off exit 69, my car wouldn't start (no problem before) I seen a glowing ball looked to be falling with pieces of fire coming off of it and larger than any meteor i've seen..when it got to tree top it shot almost straight up","Weather Factors":"Unknown","Log Number":"US-10242011-0024"}