{"Source":"MUFON","divs":["Sighting DetailsOutside on a clear night looking up at the stars as usual when these star-like spheres caught my eye. Originally I was watching a plane fly across the night sky with its blinking lights, then I saw these 2-3 star-like orbs that were at a higher altitude than the plane cross the night sky at about triple the planes speed. They had no blinking lights or anything that would identify them as an airplane. They literally looked liked flying stars but had a bit more of a glow to them than the average star, but not the brightest by far. At one point, one or maybe two of them stopped and was still for about 30 seconds. If I wouldn't have viewed it moving at such speed with my own eyes I would think nothing of it, because it looked like any other star, but then it quickly started moving again with another object just like it by its side. It was almost like it was moving a bit then blending in, as if not to be seen, I don't know. About 5 minutes into it the airplane was no longer visible or audible, so that's when I confirmed these things put off no sound. They were really high up too. After about 8 minutes either they disappeared or I lost them in the night sky. Sorry, no pics or video."],"Object Features":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/32853.html.txt","/var/www/straped/mufon/org/32853.html"],"Summary":"2-3 somewhat glowing star-like objects moving fast with no sound","Object Shape":"Circle, Sphere, Star-like","Case Number":"32853","trends":["There have been 3 other sightings in Meridian","There were no other sightings in Meridian on or around October 24th 2011"],"Longitude":"-88.698146","Region":"Mississippi","Viewing Distance":"Over One Mile","Latitude":"32.36801","Tags":"City","Date of the Event":"10/24/2011 07:23 UTC","Date Submitted":"10/25/2011 12:52 UTC","Country":"United States","Object Flight Path":"Straight-line path,Path then hovering,Other","City":"Meridian","map":"<A HREF = \"http://maps.google.com/maps?q=32.36801,+-88.698146(32853)&iwloc=A&hl=en\"> mufon case (32853) map </A>","Weather Factors":"Unknown","Sighting Duration":"00:08:00","Log Number":"US-10252011-0002"}