{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"10/25/2011 07:18 UTC","Disposition":"Unresolved","City":"LaGrange","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.093773,+-85.002746(32865)&iwloc=A&hl=en\"> mufon case (32865) map </A>","Log Number":"US-10252011-0012","Tags":"City","files":["/var/www/straped/mufon/html2text/32865.html.txt","/var/www/straped/mufon/org/32865.html"],"Summary":"Lights formed triangle w/ large flashing light in center","Longitude":"-85.002746","Object Shape":"Triangle","Date of the Event":"10/24/2011 12:00 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"32865","Region":"Georgia","divs":["sighting details first of all, my dad was an airline captain for 35 yrs. so the better part of my life has revolved around anything that had to do with aircraft. most of our friends were involved in the airline industry, air shows all over the country, my dad's library is filled with books, tapes, dvd's, pictures, and models of aircraft. so when i went outside to feed the cat about 10pm a large, bright, led looking light caught my eye to the north. my first thought it was the \"head lights\" of a plane until i saw it flash. as it moved directly over my house i saw it was a triangle shaped object. it's shape was defined by a soft white glow but bright enough to see clearly it was not any aircraft i'd ever seen before. in the center of this object was an extremely bright flashing light that looked just like someone flashing an led flashlight. the light did not flash at random, it was timed perfectly. i counted the seconds between flashes and it was 3 sec. each time. there were no blue and red collision lights like on the wings of a plane. i listened for a sound and there was none. we live out in the country where it's quiet. i watched the object come from the north and move south at about the speed of a plane. my dad had told me in the past about how commercial planes fly directly over our area, as did he when he flew, very low on approach to hartsfield\\jackson in atlanta. so when a plane is heading to the airport in atlanta, it's low and heading north. all other planes heading east, west and south are very high in altitude, but you can always hear them. that being said, this object was heading south, and was about the size of a golf ball at arm's length, very big and it was dead silent. i watched it for about 30 seconds or so until i lost sight of it behind some trees. but through the trees i could still see the light flash. hope to see it again!"],"Object Features":"Unknown","Latitude":"33.093773","trends":["There have been 29 other sightings in LaGrange","There were no other sightings in LaGrange on or around October 24th 2011"]}