{"Latitude":"43.013236","Date of the Event":"10/25/2011 08:02 UTC","Sighting Duration":"00:05:06","Summary":"Was watching stars, thought was a star, then moved multiple directions at once. Blinking lights, approx2 secs apart, approx 3-4sec blink. hovered, changed direction, spun, have witnesses","divs":["Sighting DetailsI was watching stars on the ground with my boyfriend. I was looking at a shooting star, and he was telling me how much he cared about me. I look up at what I thought was a new planet or big star, began moving rapidly. It was much bigger than a plane which was there a few minutes after I spotted it. As I spotted it, I immediately told my boyfriend to look up because I thought I was hallusinating. He saw it, too and he ran inside to get benoculars. I kept my eye on it the whole time and pulled out my phone to call my dad who is a member of MUFON. I explained to him which was it was facing, which was approximately West about 20 degres up, then once I hung up, tried to video tape it, and my phone shut off midway through my second video and I didnt turn it off and its a brand new phone that has not glitched prior to this event. It wasnt comprehending any of the UFO when it was on but I saw a light zip across my screen when my phone turned back on after the event ended and I reviewed the video at home later that night. My boyfriend took out the benoculars he ran inside for , and rested his arm on my shoulder to steady it, and in the benoculars he saw it zipping around in circular motions, and hovering, then it would steady itself and almost seem like a big star, then it would suddenly make movements again, then it would go in a slight horizontal line then spaz out once more and move rapidly all around one piece of the sky. A plane was then moving underneath, and it zipped around the plane. This ovbject appeared to be rotating with the way the lights were. They would stay on approximately a 3-4 second blink, then stop for about 2-3 seconds. It would once again keep up this pattern the entire time. The object appeared grey in color but the blinking lights were bright enough to mask the rest of the object when it was flashing towards us. They were bright white lights, appearing to rotate with the way the lights were faced. I felt shocked and so did my boyfriend. I felt a bit funny when this was all happening, but that could have been from excitement because we did NOT witness any loss of time. The object zipped towards a pine tree, hovering high over it but in our perspective from the ground appeared to be over it, and then zipped upwards and completely dissapeared. (Please note that I do infact have a video on my phone, but the quality did not appear strong enough to track this apparent UFO on my phone, but I am willing to send it in to see if someone can turn the pixels into negative form to destinguish any objects the phone wouldnt catch in regular quality. Please contact me if you'd like any of those). Thank you very much for your time."],"Source":"MUFON","Case Number":"32868","Object Shape":"Boomerang, Circle, Disc, Flash","map":"<A HREF = \"http://maps.google.com/maps?q=43.013236,+-70.921798(32868)&iwloc=A&hl=en\"> mufon case (32868) map </A>","Viewing Distance":"Unknown","Object Features":"Unknown","Disposition":"Unresolved","Log Number":"US-10252011-0015","Longitude":"-70.921798","Tags":"City","files":["/var/www/straped/mufon/html2text/32868.html.txt","/var/www/straped/mufon/org/32868.html"],"trends":["There have been 2 other sightings in Stratham","There was one other sighting in Stratham on or around October 25th 2011"],"City":"Stratham","Region":"New Hampshire","Country":"United States","Date Submitted":"10/25/2011 09:19 UTC","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering"}