{"Date Submitted":"10/25/2011 10:18 UTC","Case Number":"32869","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32869.html.txt","/var/www/straped/mufon/org/32869.html"],"Disposition":"Unresolved","Sighting Duration":"00:00:30","Weather Factors":"Unknown","Latitude":"44.230208","Object Features":"None","Object Flight Path":"Stationary","Log Number":"US-10252011-0016","map":"<A HREF = \"http://maps.google.com/maps?q=44.230208,+-71.739915(32869)&iwloc=A&hl=en\"> mufon case (32869) map </A>","Country":"United States","Summary":"football shaped object, bright white in color, disappeared in a red flash","divs":["Sighting DetailsJet noise typical of National Guard (NG) night practice was heard in the early evening. Location is in the White Mts (NH) MOA (Military Ops Area). Often we hear and see the NG doing night manuevers - 2 planes chasing - one leading, one chasing. Usually the planes will do a sequence of S turns, and occansionally we see the chaff practice (flares are ejected as part of the manuever practice). The planes strobes are usually blinking a short repeating sequence for id. This evening I ignored what I thought was another NG post-sunset practice in the MOA. Instead my girl friend checked the sky and said that it does not look like a plane. None of the normal red-green and strobe lighting - one object was viewable to the east-south east direction towards Cannon Mt. It had a football like shape and was bright white. Size was similar to a plane at 1-2 miles in distance. It was not visible for very long (less than 30 seconds) and disappeared in a red flash. There was the jet noise - I'm assuming the NG was having a look at the object."],"Viewing Distance":"Over One Mile","Tags":"City","Date of the Event":"10/18/2011 06:30 UTC","City":"Franconia","trends":["There have been 2 other sightings in Franconia","There were no other sightings in Franconia on or around October 18th 2011"],"Longitude":"-71.739915","Region":"New Hampshire","Object Shape":"Blimp, Cigar, Other"}