{"map":"<A HREF = \"http://maps.google.com/maps?q=27.667337,+-81.513704(32863)&iwloc=A&hl=en\"> mufon case (32863) map </A>","Viewing Distance":"101-500 Feet","Date Submitted":"10/25/2011 03:39 UTC","Source":"MUFON","Summary":"Star Like Silver, Flying with wind across/against, erratic","Weather Factors":"Unknown","Tags":"City","Region":"Florida","Sighting Duration":"Undisclosed","Latitude":"27.667337","Date of the Event":"10/25/2011 01:18 UTC","trends":[""],"files":["/var/www/straped/mufon/html2text/32863.html.txt","/var/www/straped/mufon/more/32863_submitter_file1__DSC02897.JPG","/var/www/straped/mufon/more/32863_submitter_file2__DSC02898.JPG","/var/www/straped/mufon/more/32863_submitter_file3__DSC02901.JPG","/var/www/straped/mufon/org/32863.html"],"Object Flight Path":"Straight-line path","Country":"United States","City":"Undisclosed","Case Number":"32863","Log Number":"US-10252011-0010","Object Features":"Undisclosed","divs":["Sighting Details Driving to work place. Saw a Star shaped \"balloon\" - I thought, \"Oh a balloon.\" Drove directly beneath it, looking up out my driver's window I saw it was star shaped with 6 or so arms. Try as I might, I can't remember exactly how many star-arms it had. 5-7, pretty sure 6 my memory says. After passing it, I thought, \"OH ****, UFO? Maybe. Looked like a...big..balloon.\" I am familiar with aircraft, this 'balloon' was the size of a single prop private plane. Fluttering, spinning in a general area over the road like a maple leaf in the short time I saw it. By the time I was to the work place, I realized it was not a balloon. It was seemingly slowly moving South West to North East. Wind is out of the South East at 5-10 MPH. It is no bag or balloon. Nor a plane, flying to slow and way to erratic for even Blimp of any sort. I could not find it again, until I walked back outside to get something from my car 2 minutes later. I saw it back over the road, moving (and erratic still) North East. As if it picked up where I left it off. I had my work camera with me. Took photos. Several. I've uploaded the original 3 that show the most detail. It took way to long to traverse the distance it did, about a minute, to have been a helicopter or anything specific. I've chased Helicopters before, slow and fast, for video purposes. This was no helicopter. It went out of sight in the haze of the blue sky after I took the photos, I couldn't locate it with my eyes again or camera. I'm a camera man, professional. I went to college. I'm familiar with military and civilian planes. I see them on a daily basis. This was no artifact or \"bug\" in-front of a camera. This was a vehicle of some sort, and likely terrestrial. There is Naval Air Station in the direction it was coming from; on top of which, it was flying to slow even for helicopters (Which I have ridden in and seen all my life.) I can guarantee you that this was no mistake or miss-judge unless it was a balloon breaking the laws of physics and flying against the wind."],"Longitude":"-81.513704","Disposition":"Unknown","Object Shape":"Star-like"}