{"Object Features":"Unknown","Date Submitted":"10/26/2011 03:37 UTC","Viewing Distance":"101-500 Feet, Unknown","City":"Cranford","Tags":"City","Country":"United States","Latitude":"40.656613","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.656613,+-74.324876(32877)&iwloc=A&hl=en\"> mufon case (32877) map </A>","Summary":"Noticed Red lights first and the hovering and dancing - no rythem to lights","Longitude":"-74.324876","divs":["Sighting DetailsI live in Cranford New Jersey (Union County) Longitude 70.4? I looked out the 2nd floor window facing North and saw it....thought my eyes were playing tricks. So I stepped away, rubbed my eyes, put on eye glasses and it was still there! My benchmark were the planes flying over-head. We live in flight-pattern for Newark Airport. THIS WAS DEFINATELY LOWER THAN THE PLANES. Also when the planes flow over ~ it seemed to dissapear. I saw red lights at first. Then it danced, and lights blinking, BUT no rythem to the pattern. It moved in un-normal ways. Bobbing and swooping. IT WAS SO BEAUTIFUL! It lasted almost 25 min....so I had time to walk away and make sure my eyes were not playing tricks on me. The very strange thing was the color behind the tall tress ~ they were illuminated from the back in shades of gray and white. like a \"black & white\" photo. I am so very lucky to have witnessed this....i have never seen anything like it in my entire life. It also has changed my life and I will never lookk at anyhting in life the same ever again. Thanks. Hope this helps with your research"],"Date of the Event":"10/25/2011 03:40 UTC","trends":["There have been no other sightings in Cranford","This sighting has never been favorited."],"Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Unknown","Object Shape":"Flash, Other, Unknown","Log Number":"US-10262011-0002","Region":"New Jersey","Source":"MUFON","files":["/var/www/straped/mufon/html2text/32877.html.txt","/var/www/straped/mufon/org/32877.html"],"Case Number":"32877"}