{"Latitude":"33.453547","City":"Phoenix","map":"<A HREF = \"http://maps.google.com/maps?q=33.453547,+-112.066927(32878)&iwloc=A&hl=en\"> mufon case (32878) map </A>","Object Shape":"Sphere, Triangle","Object Flight Path":"Straight-line path","Case Number":"32878","divs":["Sighting DetailsOn October 22, 2011 in Mesa, AZ around 6:40 PM, I step outside onto my porch to smoke a cigarette. The sun had just set earlier, and the sky where the sun had set was barely still showing some twilight. Just as I was sitting down into my lawn chair and started looking around in the sky, I noticed while looking towards the northwest two objects in the far distant and at high altitude. The two objects were moving extremely slow in the sky, and the two objects appeared to be at a good distant from each other (possibly a mile apart.) But what really caught my attention is how the two objects were moving in tandem in speed and direction. Both objects weren't really that bright in the sky; yet, it was obviously seen in the sky without too much difficulties in the beginning. Both objects had a constant lighting, and no navigation lights were seen such as a strobe, red, or green light. The highest object seem smaller in size and not as bright as the lower object. The lower object was much brighter than the higher object. I had a little difficult time trying to focus on the objects seen since their lighting wasn't extremely bright; especially the higher up object. I had my camera with me so I took some pictures; but I forgot I had the camera set at the 100 ISO setting which the objects could not be seen in the 1st picture I had taken. I quickly change the ISO setting to 1600. The camera was also giving me some difficulties, but I finally manage to get some more picture. While looking through the telescopic lens at the larger object, I saw what look to be a triangular shape object. There also seem to be a dim light at each corner; however, I am not absolutely positive about that, but I am absolutely sure the object was orange in color and sometimes triangular in shape. I also thought I had the camera shutter speed set at 1.6 second; however, in my haste to take pictures, I forgotten to set the camera to manual too. Nevertheless, the camera still took pictures near the shutter speed I would had intended to utilized which the pictures still turned out somewhat ok since I was able to capture the lighting. There was barely a breeze, and the sky was clear. The objects appeared to traverse towards either the east or southeast. The object when first seen was located in the northwest direction, and when the object traverse the sky and reach the northeast direction, both objects appeared to had slow down much more. The larger object also seemed to be almost hovering, but it was still barely moving. The lighting intensity at that moment was barely noticeable which also made it extremely difficult to locate the object in the sky. At one point, it almost seemed like a star since it was barely moving or just hovering. I eventually lost track of it in trying to determine which is a star and which is the object. The altitude the objects appear to be located in the sky was at or near the same altitude of very high flying commercial jets. Because objects moved so slowly, they didn't seem to be commercial jets traveling. It almost seem like the objects were just slowly gliding through the air. No noise were heard from the objects possibly due to the vast distant. To my best estimate, the distant the objects from me may had been possibly 5 miles; however, it is also possible that the objects may had been further away in the distant than what I could estimate correctly. The size of the larger object seems to be much bigger than a commercial jet at the height and distant I saw the objects; definitely much taller than a commercial jet in height. The lighting appeared to be a dull orange in color and possibly a hint of yellow in it too. The speed of the object going across the distant sky almost seemed like the speed of drifting balloons if the balloons were very near my location, or the object's speed appeared to be similar to an extremely slow plane that is flying in the far distant at low altitude. The objects didn't appeared to be balloons; especially at the distant I seen the objects. If they were balloons, it would had to been an extremely large balloons nearly the size of a blimp. The angle I saw the objects in the sky was about 30 degrees or higher off the horizon."],"Source":"MUFON","Date Submitted":"10/26/2011 05:03 UTC","Longitude":"-112.066927","Region":"Arizona","files":["/var/www/straped/mufon/html2text/32878.html.txt","/var/www/straped/mufon/more/32878_submitter_file1__Picture-1.JPG","/var/www/straped/mufon/more/32878_submitter_file2__Picture-1_lightingenchanced_note.jpg","/var/www/straped/mufon/more/32878_submitter_file3__Picture-2.jpg","/var/www/straped/mufon/org/32878.html"],"Log Number":"US-10262011-0003","Country":"United States","Summary":"Two orange vertically, tandem objects possibly 1 mile distant apart traversing slowly across the sky at identical speed and direction.","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"None","Disposition":"Unknown","Object Features":"Unknown","Date of the Event":"10/22/2011 06:40 UTC","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 22nd 2011","This sighting has never been favorited.",""],"Tags":"City","Sighting Duration":"00:07:00"}