{"Source":"MUFON","Tags":"City","Country":"United States","Date of the Event":"10/25/2011 08:28 UTC","divs":["Sighting DetailsI was out on My front lawn looking up at the stars with my girlfriend and we were looking fo shooting stars and talking and stuff when she got a weird look on her face and said \"whats that!\" I looked over and at first i didnt see anything and i looked back at her kind of odd but then i looked to where she was pointing and there was something in the sky that looked like a plane at first but it wasnt moving and it had three lights that were blinking at a very slow rate. So I ran into the house and got my benoculars and i went back outside to see what kind of aircraft it was. and I was looking at this thing through x10 benoculars steadied on her shoulder and I say that the object was not moving forward or bcakwards because there was no motion up down left or right from my feild of vision and it never got smaller. then while she was calling her dad to tell him to go look outside and see if he could see this thing it shifted up several inches in perspective to the sky. It then stayed there for a bit and an airplane flew between us and it and because the sun had only gone down a few hours ago there was still a twindge of light up that high so I could make out that the plane was a plane and the other thing was not. the object had no running lights, no red or green. and then after hovering and changing posisions a few times it wizzed up into the air and just disapeared. and there was nothing obstructing our veiw of the object, no trees or anything. latter after she went home (10 mins after siting) a couple jets wizzed over head."],"Region":"New Hampshire","Log Number":"US-10252011-0017","City":"Stratham","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.0411,+-70.929837(32870)&iwloc=A&hl=en\"> mufon case (32870) map </A>","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Latitude":"43.0411","Object Shape":"Circle, Disc, Oval","trends":["There have been 2 other sightings in Stratham","There was one other sighting in Stratham on or around October 25th 2011"],"Case Number":"32870","Summary":"hovering, three flashing lights, spinning, wizzed to diff place, hovered, repeat, airplane passed infront of veiw, disapeared after acending","files":["/var/www/straped/mufon/html2text/32870.html.txt","/var/www/straped/mufon/org/32870.html"],"Longitude":"-70.929837","Sighting Duration":"08:34:00","Date Submitted":"10/25/2011 10:50 UTC","Object Features":"None","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering"}