{"Sighting Duration":"Undisclosed","Summary":"Hovering object, Patterned Extremely bright lights. No sound.","Region":"Washington","Date of the Event":"10/21/2011 06:59 UTC","Tags":"City","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.603292,+-122.334417(32882)&iwloc=A&hl=en\"> mufon case (32882) map </A>","Source":"MUFON","Country":"United States","City":"Seattle","Date Submitted":"10/26/2011 10:45 UTC","Disposition":"Unresolved","Longitude":"-122.334417","Case Number":"32882","Log Number":"US-10262011-0007","Latitude":"47.603292","Object Features":"Unknown","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around October 21st 2011","This sighting has never been favorited.",""],"Object Shape":"Cone, Cylinder","files":["/var/www/straped/mufon/html2text/32882.html.txt","/var/www/straped/mufon/more/32882_submitter_file2__DrawingofObject.jpg","/var/www/straped/mufon/more/32882_submitter_file3__ufolocal.jpg","/var/www/straped/mufon/org/32882.html"],"divs":["sighting detailsmy neighbor and i happened to be walking our dogs on oct 21, 2011 at 06:59 at the same time. my neighbor went up the street to the north and i went down the street to the south. he was about 20 feet from me when i stopped to let my dog go potty. i looked up to check the weather as i always do. the second i looked up an object in the sky took my attention. from my field of view standing under trees and looking above the trees across the street. this object was very large. circular at the top with the brightest lights i've ever seen, dancing in a pattern. some dim others blinding. there was one light stationary at the base of the object hanging down below it. i looked for about 5 seconds in amazement then called to my neighbor \"hey you have to see this!\" i pointed to the the sky. he jogged down to me, looked at it and said, \"what the hell is that?!\" i said i don't know but it's not right. at that point i realized i have my cell phone on me. i pulled it out and got only about 15 sec. of video. i stopped recording to take a zoom still shot. i snapped one picture. (it came out blurry.) i hate my ipone! anyway, as i was trying to put my phone back into video mode when my neighbor said, \"look\" i looked up and the object turned slightly horizontally on it's side and started in an arching motion to the nw over puget sound and illuminated a cloud as it disappeared behind it. the way it started it's motion was amazing and the way it increased in speed before it went behind the cloud was like watching a magnet being pushed away by another magnet. that's the only way i can explain it's foreword motion. the video i am attaching is in no way like what we saw. it looks far away but it was much closer then is appears in the video. there were many more lights than showed up on the video. i am submitting the original. i have edited this video and the only thing i have done to it is adjust the lighting settings and did some slow motion effects. i don't know what we saw but it was strange and i've never seen anything like that is the sky my whole life. after talking to my neighbor the other day we both still concur, it was strange. you can see my edited video at [link moved to field investigator section\\cms\\tg] i called the mufon office the day of the event and talked to a guy named david that is an investigator for mufon but have not heard back from him. i was unable to find this form until now is why the delay in my report. you have my permission to analyzed the video and use it any way you choose. i in no way am looking for publicity or financial gain. [name removed\\cms\\tg] seattle, wa"],"Viewing Distance":"Over One Mile"}