{"Object Flight Path":"Stationary","Weather Factors":"Unknown","Date of the Event":"10/24/2011 02:12 UTC","Viewing Distance":"20 Feet or Less","Latitude":"30.239906","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/32888.html.txt","/var/www/straped/mufon/org/32888.html"],"City":"Orange","Object Features":"Undisclosed","Sighting Duration":"00:00:30","trends":["There have been 3 other sightings in Orange","There were no other sightings in Orange on or around October 24th 2011"],"Disposition":"Insufficient Data","Source":"MUFON","Log Number":"US-10262011-0013","Region":"Texas","Case Number":"32888","Date Submitted":"10/26/2011 04:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.239906,+-93.875948(32888)&iwloc=A&hl=en\"> mufon case (32888) map </A>","divs":["sighting detailsi woke up with my head turned to the side of my bed and opened my eyes to a being about 3 to 3-1\\2 ft tall. the entity appeared to be female in orientation. \"she\" had her hair, which appeared to be black, pulled in to either a tight bun or pony tail behind her head. her skin appeared to be a dark olive tone. she wore clothes but i don't remember them in detail. i knew she was \"otherworldly\" because of her facial features. her eyes were small and completly black, she did not blink the entire time she was in my presence. her mouth was lip-less and in a straight line on her face; it was also slightly parted. she also had extreamly high cheek bones. her body did not move but she spoke to me telepathically. i don't remember what she said, but i do recall it was a repremand of some kind and that i replyed in a sarchastic manner. at no point did i feel afraid. my dog also acknowlaged the being. i after she spoke, i looked to the foot of my bed where my dog was running towards me. when i looked back to the being, she stayed visable for about 2 seconds then disappeared. because of her human like appearance i question wither or not this was a full blooded entity or a hybred. i had the overwhelming feeling that she was familier to me and that we were used to each other's presence. this is my first memorably run-in with a being however i've had several indications that something may be going on. just over a month ago, for instance, i found a red, freshly healed scoop mark on my inner thigh."],"Object Shape":"Unknown","Longitude":"-93.875948","Summary":"I awoke to a child-like entity with dark, almost african hued skin."}