{"Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-80.8611","map":"<A HREF = \"http://maps.google.com/maps?q=35.488402,+-80.8611(32880)&iwloc=A&hl=en\"> mufon case (32880) map </A>","Weather Factors":"Unknown","City":"Cornelius","Date of the Event":"10/21/2011 09:45 UTC","Log Number":"US-10262011-0005","divs":["Sighting DetailsAt approximately 9:45 p.m. on October 21, 2011, I took my dog out, and I noticed a bright orange light in the western sky, but I dismissed it thinking it was a plane. I was outside about a minute when I noticed several more of the lights coming behind the first one. So I ran to the end of my driveway where I could see over the treetops, and there were seven more lights. They were not in a straight line. They all moved slowly, from south to north, eventually disappearing. It was as if they burned out. Their light got smaller and smaller, until it was gone. Several of my neighbors were outside at the time, and I called to them to come out in the street and look at the lights. They did. And we then witnessed the event together. After the majority of the lights were gone, one more single light \"floated\" into view from the direction from which all of the previous lights had come, and we stood and watched it until it disappeared. There were approximately ten lights altogether. They never traveled far enough away to be out of sight, instead they seemed to burn out within a small area of a few hundred yards. The night sky was full of stars. These lights were not stars. They moved very slowly. The pattern was something like this: *(last sighting) * * * * * * *(first sighting) * The total time the event lasted was approximately ten minutes. I was excited by the experience. I hope I see it again."],"Source":"MUFON","Tags":"City","Date Submitted":"10/26/2011 09:14 UTC","trends":["There have been 4 other sightings in Cornelius","There were no other sightings in Cornelius on or around October 21st 2011"],"Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/32880.html.txt","/var/www/straped/mufon/org/32880.html"],"Case Number":"32880","Region":"North Carolina","Disposition":"IFO","Object Shape":"Sphere","Summary":"Bright orange lights in the western sky were seen in Cornelius NC on Friday, October 21, 2011, at approximately 9:45 pm.","Latitude":"35.488402","Country":"United States"}