{"divs":["Sighting DetailsThe night of friday, and saturday morning at 2am my sister in law calls me out side to take a look at some strange lights naturally she is kinda skittish and it was late so she went inside, as I left my apartment complex I kept my eye on the light which as i looked around i could tell there was alot more than one but they were all at some distance unlike the one i was first looking at. It seemed to come closer then move further away almost beckoning me to move closer i wasnt scared but i still wasnt sure what I was looking at cause i could see the light but nothing else i walked on a patch of grass behind the barber shop and was looking above me where the light had made its way. It seems as though a light detached itself from the main body before it put its spotlight on me which was barley decernable from the moon light cause i looked on the ground around me and didnt see it. Before the light was in my eyes i saw a cloud press agianst the hull and for a split second the outline of the ship was visible. At first it seemed like the stars were slowly spining but it seems that it was cloaked predator style. There wasnt much thinking or feeling I just stared kinda in wonder but i didnt think much honestly after that it began to head north north west towards the lake close to my home town i followed it as it was leaving and when i stopped to turn around and go home it seemed to stop and flash so i continued till it daybreak when it just kept on going and abruptly the light faded and i could no longer see it. One strange change is that I am getting nodules in clusters below the skin, so far 3 of them and it seems as more are on there way I'll going to the hospital in the next day or two to get a opinion on this."],"Viewing Distance":"101-500 Feet","Date of the Event":"10/22/2011 02:30 UTC","Summary":"see though with alternating lights of red and blue and main yellow light","Weather Factors":"Unknown","Tags":"City","Date Submitted":"10/26/2011 03:00 UTC","Longitude":"-97.832185","files":["/var/www/straped/mufon/html2text/32885.html.txt","/var/www/straped/mufon/org/32885.html"],"trends":["There have been no other sightings in Mathis","This sighting has never been favorited."],"Object Flight Path":"N/A","Country":"United States","Log Number":"US-10262011-0010","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=28.099764,+-97.832185(32885)&iwloc=A&hl=en\"> mufon case (32885) map </A>","Region":"Texas","Source":"MUFON","City":"Mathis","Disposition":"Insufficient Data","Case Number":"32885","Sighting Duration":"Undisclosed","Latitude":"28.099764","Object Shape":"Disc, Oval"}