{"map":"<A HREF = \"http://maps.google.com/maps?q=29.914649,+-90.05396(3288)&iwloc=A&hl=en\"> mufon case (3288) map </A>","Object Shape":"Undisclosed","Viewing Distance":"Unknown","Region":"Louisiana","City":"Gretna","Date of the Event":"03/11/2005 07:55 UTC","Weather Factors":"Unknown","Case Number":"3288","Longitude":"-90.05396","Object Features":"Undisclosed","Source":"MUFON","Latitude":"29.914649","Sighting Duration":"Undisclosed","Log Number":"","Date Submitted":"03/11/2005 07:55 UTC","Country":"United States","trends":["There have been no other sightings in Gretna","This sighting has never been favorited."],"Tags":"City","divs":["Sighting DetailsSighting Report: While driving on interstate 10 heading west from New Orleans to Baton Rouge. I was on the I-10 about 10 miles outside of New Orleans. I was on the part of the I-10 that crosses over the southwestern edge of Lake Pontchartrain. It was a partly cloudy day and I saw a bright flash that was behind a cloud. Now this may sound like lightning but there was something unusual about it because it was mostly a sunny morning around 6:30 am. It almost looked like several camera flashes went off behind this white cloud. It was really something special. There were several flashes within about 1-2 seconds no sound. This is when it got real interseting. I continued to watch the cloud when a bright round ballshaped object came out from behind the cloud. It was round and looked like a small sun about the size of a softball. It moved a little to the right (west to east) and then took of at about a 35 degree angle upward. I was out of sight within a second so whatever it was was travelling at an incredible speed. I really don t beleive in UFO s as ET s but this was either some kind of natural phenomenon like ball lightning or it really was some type of vehicle. The only thing though. Since it looked like a small ball of fire it really didn t strike me as a craft. It seemed more like a natural event. I emailed a local weathermen and his reply was \"I have no idea what it was\" FYI"],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/3288.html.txt","/var/www/straped/mufon/org/3288.html"],"Object Flight Path":"Undisclosed","Summary":"Not Provided"}