{"Date of the Event":"10/24/2011 08:35 UTC","Region":"Wisconsin","trends":["There have been no other sightings in Mondovi","This sighting has never been favorited."],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Case Number":"32886","Longitude":"-91.687202","divs":["Sighting DetailsHubby and I were on our way home [parts run] on Hy 10,headed se from Durand to Mondovi.I always sky watch.We we re in the area of a wayside north of the Hy.,three,four miles east of durand. There is a long wooded ridge that runs parrarel to Hy. a third to half a mile north of the road, with fields in between. It was around 8:30 pm, cloudy with no stars at the time. I saw a large white light about 100 feet above the woods. It was at lest 5 times the size of what a yard night light would be at that distance. I watched it hover for 30 to 45 seconds and had hubby look. Some trees blocked our view briefly. When we could see again, the large white light was gone and 5 smaller white and 2 blue lights appeared in thee diagonal lines,spsnding 100 feet above woods to 300 feet up.Frist line,look at a clock put awhite light at 1 at the center of the hands,and at 7 oclock. Next at same diagonal put a blue light 50 feet over between the thee white lights, then put 2 more white lights 50 feet over even with the bottom 2 whites lights. It was a weird shape. We saw them for 15 to 20 seconds and then they just went off, totaly dark. I had to go back for more parts the next am. In daylight, there are no towers or buildings in the area where we seen the lights, just a large woods. WE have no idea as to what we saw."],"Disposition":"Unknown","Weather Factors":"Unknown","Object Shape":"Sphere, Square, Rectagular","Summary":"Large white light hovering above wooded ridge,half mile away, 5 times size of yard light. Large light goes out, 5 white lightsand 2 blue lights appear in 3diagonal rows. Then all go out.","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/32886.html.txt","/var/www/straped/mufon/org/32886.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.568856,+-91.687202(32886)&iwloc=A&hl=en\"> mufon case (32886) map </A>","Object Flight Path":"Stationary","City":"Mondovi","Date Submitted":"10/26/2011 03:13 UTC","Source":"MUFON","Log Number":"US-10262011-0011","Latitude":"44.568856"}