{"Object Features":"Unknown","Region":"Michigan","Latitude":"42.909748","Date of the Event":"10/24/2011 11:55 UTC","City":"Grandville","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.909748,+-85.763088(32890)&iwloc=A&hl=en\"> mufon case (32890) map </A>","Disposition":"Unknown","Date Submitted":"10/26/2011 05:56 UTC","Object Shape":"Unknown","Case Number":"32890","divs":["Sighting DetailsI was sitting in my car at 11:55pm at my local Gamestop (waiting to purchase Battlefield 3, over 150 people in line) I was parked about 200 yards away from the main group. I was leaning my head back with my sunroof all the way opened, gazing out at the stars. Red Red Wine began to play on the radio, I closed my eyes for a second and began to get into the song, when I noticed a very faint static disruption with the song. I opened my eyes and it was directly overhead of me. The craft blended in perfectly with the dark. I couldn't make out a shape at all. I turned down my radio to hear the typical noise from a helicopter or plane or what not, but nothing was able to be heard. I watched this thing fly in a straight path directly overhead of me for about 5 seconds. I then stepped out of my car when it went out of view, and I lost sight of it instantly. The thing was VERY inconspicuous. No one in line saw it and no one heard a plane fly overhead at such a low altitude. It had 2 dim white lights that I can best explain as the fluorescent tube lights with cheap plastic covering them that you see in hospitals and schools and such. I say this because the light seemed dim and dispersed rather than very bright. The craft seemed very low in altitude, I'd say up to a maximum of 2,000 feet above me. The lights were also not perpendicular with the direction of flight, they were not in line with one another. It was an odd experience, and it's definitely something that I wouldn't have expected to see. I heard that the space station did pass over my area at around the same time. I'd like to hear back from someone to confirm this, however my eyes seemed to think that it was low in altitude and most picture I've seen of the space station from Earth have only 1 light. Also, the thing moved quite quickly or at least quicker than I believe the space station would, and it disappeared from view when I stepped out of my car and was no longer directly under it."],"Source":"MUFON","Viewing Distance":"N/A","Country":"United States","Summary":"UFO 2 dim white lights, no noise, low altitude only noticeable from directly overhead","files":["/var/www/straped/mufon/html2text/32890.html.txt","/var/www/straped/mufon/more/32890_submitter_file1__ufo.png","/var/www/straped/mufon/org/32890.html"],"Longitude":"-85.763088","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:05","Log Number":"US-10262011-0015","trends":["There have been 4 other sightings in Grandville","There were no other sightings in Grandville on or around October 24th 2011","This sighting has never been favorited.",""]}