{"Country":"United States","Summary":"Bright light like a star","City":"Billings","Object Features":"None","divs":["Sighting DetailsHi,I live in Billings, MT. Last night around 11:30 PM, my husband and I were sitting on our patio. I looked up at the sky and noticed a big bright \"star\" saying, \"Wow, that is awfully close and bright to be a star.\" Also, it was somewhat cloudy out and there was little if any stars to be seen. My husband then figured it must be a satelite. We watched it closely and it appeared to be moving and slowly getting closer. It was still far, far away but it was so bright and looked as though it had white \"spikes\" of light. 8 of them to be exact. We quickly took pictures and this one came out the best. However, it does not capture the brilliance of light that we saw nor the \"aura\" spikes of light. In fact, when its zoomed in on it reminds me of a jellyfish lol. We went back inside for about 5 minutes and decided to come back outside to try and get another picture. Right then, it was moving quicker back into the sky and then all the sudden it speeded up and poof!....it was gone."],"Region":"Montana","Date Submitted":"10/26/2011 06:42 UTC","Longitude":"-108.571391","Log Number":"US-10262011-0017","Date of the Event":"10/25/2011 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.776955,+-108.571391(32892)&iwloc=A&hl=en\"> mufon case (32892) map </A>","trends":["There have been 13 other sightings in Billings","There were no other sightings in Billings on or around October 25th 2011","This sighting has never been favorited.",""],"Disposition":"Unresolved","Latitude":"45.776955","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32892.html.txt","/var/www/straped/mufon/more/32892_submitter_file1__003.JPG","/var/www/straped/mufon/org/32892.html"],"Viewing Distance":"Unknown","Case Number":"32892","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Circle, Diamond"}