{"Region":"Louisiana","Sighting Duration":"Undisclosed","Summary":"Not Provided","Object Features":"Undisclosed","Tags":"City","Case Number":"3289","Disposition":"Hoax","Longitude":"-93.581272","map":"<A HREF = \"http://maps.google.com/maps?q=30.190763,+-93.581272(3289)&iwloc=A&hl=en\"> mufon case (3289) map </A>","Latitude":"30.190763","trends":["There have been no other sightings in Vinton","This sighting has never been favorited."],"Viewing Distance":"Unknown","divs":["Sighting DetailsSighting Report: On Oct 22nd about 10:30 pm about 5 miles from LAX airport on I-10 we saw what appeared to my husband and I to be planes lining up for landing. As we got closer we realized the lights we were watching were not planes. There were 4 lights in a diamond shape. They were white in color, approximately 50 yards apart from each other and maybe 60 feet above the ground. We were traveling west and the lights were moving very slowly going north. As they crossed over I-10 we stopped on the side of the interstate and I grabbed my video camera. They moved directly over top of us. We thought maybe they were flares but there was no smoke, mist or haze around them. I kept taking pictures and video of them until they were completely out of sight. One by one they started dropping or dripping what looked like fireballs. Then they kind of \"flashed\" on and off and disappeared. After the first one did this it looked like they moved into a triangle, then side by side, then they were gone. When we watched the video we still couldnt figure out what exactly it was. It was overtop of a heavy residential area, close to an airport. We never heard if anyone else saw them also. In November we saw a program on ufo s that talked about MUFON. There also was a video of ufo s, that was taken in Florida, 2 years ago that looked identical to our video. Completly identical, but they never gave any explaination of what it might have been. Id be more than happy to share my video and pictures with someone if they think they can solve our mystery."],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Undisclosed","Country":"United States","Date of the Event":"02/09/2005 09:20 UTC","Date Submitted":"02/09/2005 09:20 UTC","files":["/var/www/straped/mufon/html2text/3289.html.txt","/var/www/straped/mufon/org/3289.html"],"Source":"MUFON","City":"Vinton","Log Number":""}