{"Date Submitted":"10/26/2011 08:30 UTC","Weather Factors":"Unknown","Latitude":"39.423032","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/32895.html.txt","/var/www/straped/mufon/org/32895.html"],"Country":"United States","Object Shape":"Other","Tags":"City","Object Features":"Dome","trends":["There have been 5 other sightings in Marietta","There were no other sightings in Marietta on or around March 1st 1998"],"Disposition":"Unresolved","divs":["Sighting DetailsThis goes back about 13 years to when I was returning from a business trip. At the time I was a software engineer, and am currently a senior software engineer for an automotive engineering firm outside of Detroit. I'm sure that also contributes to the delay - it's not something generally discussed in technical circles, or anywhere for that matter. Lately I've heard a few stories about large craft in clouds, so I feel compelled to share what I witnessed that day... I was returning home from a customer system installation on a Friday en-route to Detroit MI from Charlotte SC at approximately 6:00pm EST. My flight was somewhere around 33,000' near the southern border of Ohio. The cloud cover below was 100% with the majority of the cloud tops what I'd estimate to be 5,000' (I'll call it the cloud floor). There were several towering cumulus clouds extending from the floor to our flight level and higher. I had a window seat and was enjoying watching the clouds and other air traffic go by below. I remember noticing other passenger airlines, such as a DC-9, traveling just above the cloud layer and that it's relative distance away made it appear to be about the same size as if an ant were on my window. Then, I noticed a HUGE dark solid object seem to inadvertently protrude from near the base of one of the large cumulus clouds below. From my viewing angle, it was 25-30 degrees to the left of our flight path at approximately 45 degrees below my observation point. I remember having a laser pointer in my hand and deciding it might not be a good idea to acknowledge it's presence. (6 miles above the surface isn't a good place to find out if they minded being spotted. This was also before lasers became a problem...) The craft was still partially concealed within the cloud, yet the part that was visible was about 4 commercial jetliners length in diameter (400-500 feet)! It was roughly round, but had 2 large 'bumps' - so it basically resembled a 'chocolate turtle'. (It certainly wasn't a large candy covered pile of nuts, but that's just what it looked like.) It slowly drifted out of the clouds for only about 3-4 seconds, then appeared to realize it was losing it's cover, then slipped right back in to the cloud base. The movement out and back in to the cloud was at a slow pace. The entire incident lasted about 5 seconds - half the time was spent uncovering itself, then other half was moving back in. No sudden movements, just a smooth partially out, then back in. If there were any other witnesses on that or any of the other passing flights, I am unaware of them. It was by no means a scary situation, but the only thing that caused me any concern was what their reaction might have been if I had shined my little laser beam on them. If I was on the ground, I would definitely 'point' them out. If it provoked a response, anything short of death would be worth it to me because then it would be my proof. Although common sense tells me it's impossible other life doesn't exist, I'd just really like to witness it up close for myself."],"City":"Marietta","Source":"MUFON","Viewing Distance":"Over One Mile","Longitude":"-81.451874","Date of the Event":"03/01/1998 06:00 UTC","Region":"Ohio","Log Number":"US-10262011-0020","Case Number":"32895","Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=39.423032,+-81.451874(32895)&iwloc=A&hl=en\"> mufon case (32895) map </A>","Summary":"Huge UFO hiding in cloud bank"}