{"trends":[],"Case Number":"32891","divs":["Sighting DetailsFirst, let me state that I only file this report at the urging of my sons, otherwise, I would not. The experience of seeing these \"things\" has left me with mixed emotions and somewhat upset. When I think of the affect of the third observance listed below, the hair on my neck stands up and I get cold chills! I filed my first MUFON report with the assistance of my eldest son regarding the two UFOs observed on Friday night, Oct. 21. This report covers three separate observations from my property during Saturday night, Oct. 22. They occurred at different times and locations in the sky, and were different in color, behavior and size. The weather was clear on this night, just like the night before. First sighting: At 7:55 pm, I took my dog outside to potty as usual, and while walking to the edge of my front yard near the street I looked north toward Read Mountain where the UFOs were spotted the previous night. It wasn't long before I spotted a vivid red ball of light that seemed to be hovering in the general area as the night before. However, this one seemed smaller in size to me, but it was the same cherry red color and looked by the naked eye to be changing color to a blueish green with bright blue-white lights that appeared to sort of surround the object but was more underneath the other colors. I took my dog in, grabbed my binoculars and immediately went back to the street to observe the object. I made myself a promise that if I saw another UFO, I was going to get one of my neighbors to witness it with me. So, once I confirmed that it was indeed a similar, if not the same object, I ran up to my neighbors house, range their doorbell and asked them to come outside to see the object hovering over the mountain. Both agreed that the object was moving slowly, changing colors (red, blue, yellow and green, with sparks of blue-white). We observed this for about 5-10 mins, and I shared with them my experience from the night before. The object just \"blinked\" out and we continued to observe the sky and talk. They went inside and I started walking across the street when another \"object\" appeared slightly above me, but it was only randomly shooting out sparks of blue-white light that reminded me of the 4th of July sparklers that kids love. Then it was gone! I went back inside promising myself I would not go out again, but the thought of seeing something again was just to strong. Second sighting: Around 8:35 pm, I walked back outside to check the sky (without binoculars). After about 5 mins or so, as I was looking to the south of my house, over the tree line a saw a bright, blueish-white light just \"blink\" into existence. Shortly thereafter, it began to slowly move to the east, seemingly tracking the valley that runs from Roanoke to Bedford (Rt 460). As I watched this \"object\" another bright, blueish-white light \"blinked\" into existence about where the previous one started, and it began to follow the first one to the east down the valley. I'm thinking \"What the heck???!!!\" when yet a third bright, blueish-white light \"blinked\" into existence, but it was offset to the northwest and it just appeared to hover and blink, and it did not follow the other two \"objects\". I observed it for a few minutes and it began to move in a zig-zag pattern. At this point, I had just about had more than I could handle with these \"things\" and I went inside, feeling a little on edge because I was by myself. Third sighting: Around 9:15 pm, in spite of my better judgment, I once again wanted to check the sky. I walked to the street in front of my house (without binoculars) and stood for a short while, observing the stars and airplanes flying at high altitude which were basically flying from northeast to the southwest. I paid particular attention to the sound that soon followed them. Please note that I never heard any sound whatsoever coming from any of the \"objects\" that I observed the night before or on this night. I was about to turn and go back inside when almost directly above me, a flash of electric, vivid blue-white light shot out like an arc welder, and it appeared to drop down in a spiral and \"burn out\". It sort of reminded me of lightening. Within seconds, another shot out not far from it; then another and another in rapid succession and in different places. Some of the sparks seemed to spiral to the side, rather than drop down. These shooting sparks seemed to come from a large, but \"confined\" area or at least seemed they were contained within a large parameter. This \"object??\" where the sparks were emanating from began to move in zig-zag directions and throughout large swath of the sky. Either this \"object\" was very low in altitude or it was very, very large! Because of its size or nearness to me, I began to feel very ill at ease and soon felt sick to my stomach. I said to myself, \"I've seen enough, I don't want to see anymore, I don't want to see anymore!\" I all but ran into my house, pulled down all the shades, dropped the sheer curtains and called my sons to share what I had observed. Even as I type this report, my hair stands on end and I have cold chills! On Tues, Oct. 25, around 7:30 pm, I noticed from my living room window (which faces in a northwest direction toward Read Mountain) a very bright white light hovering near and to the left of the mountain, close to where the other sightings had occurred, but somewhat lower in the sky. I grabbed my binoculars to confirm what I thought I was seeing, and yes, it was another \"object\". I called my eldest son who lives on the northwest side of Read Mountain and asked him to go outside to see if he could see it as well. He could not see this object, so he said he would drive over to take a look from my house. I promised my neighbor beside me that the next time I saw anything I would let her know so she and her teenage children could see as well, so I ran to her house, rang the doorbell and told her I had spotted another object hovering near the mountain. I walked back to the street to continue my observation while waiting on them to join me. Within seconds of my seeing it again, it began moving in a northeast direction and seemed to be drop in altitude a little bit and disappeared behind the top ridge of the mountain. I was disappointed thinking my neighbors would not get to see it...BUT, within seconds, it showed itself again, but this time it looked like it was tracking the high voltage power lines that are strung on the northwest side of the mountain. The blue-white light became so bright, I could see the tree trunks as it passed behind them, and it looked as if the light illuminated the trees and ground as it passed along the ridge, under the tree line. My neighbors joined me and I gave them my binoculars to observe this \"object\". They got to observe the \"object's\" movement through the tree line; changing of colors (red, blue, yellowish orange and green), and the sparks of blue-white light (just like the ones I saw over the weekend). The object finally rose above the mountain and began moving in our direct to the southeast. It flew toward the Falling Creek Estate area near Vinton, and my neighbor said it just dropped straight down at great speed and disappeared."],"Log Number":"US-10262011-0016","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-78.651044","Object Features":"Unknown","City":"Undisclosed","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.436933,+-78.651044(32891)&iwloc=A&hl=en\"> mufon case (32891) map </A>","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"10/26/2011 06:02 UTC","Latitude":"37.436933","files":["/var/www/straped/mufon/html2text/32891.html.txt","/var/www/straped/mufon/org/32891.html"],"Object Shape":"Flash, Oval, Star-like","Summary":"Second night in a row - - siting of vivid red light over Read Mountain in Botetourt County, with others appearing at different times and locations. Largest one made me very uncomfortable!","Region":"Virginia","Disposition":"Unknown","Date of the Event":"10/22/2011 07:55 UTC","Source":"MUFON"}