{"Region":"Tennessee","Country":"United States","City":"Knoxville","Date Submitted":"10/27/2011 10:10 UTC","Log Number":"US-10272011-0004","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around October 26th 2011"],"Disposition":"Unknown","Viewing Distance":"Unknown","Object Features":"Undisclosed","Object Shape":"Sphere","divs":["Sighting DetailsAt approximately 1945est, I observed something very strange. I was on my porch when I happen to notice an object that appeared to look like a start, but was moving across the sky. As I was trying to find characteristics of an aircraft (flashing lights, movement) it all of a sudden illuminated into a bright white light the size of a basketball. The brightness lasted for about 10-15 seconds. I couldn't speak so I was beating on the door for my boyfriend to witness what was happening. Unfortunately, the object dimmed back into the original size, light pattern and continued it's northern cross across the sky.It even appeared to cross straight into the flight path of a plane that was crossing the sky. Upon standing outside for 10 minutes trying to see it again, we witnessed it coming back the opposite direction at a high rate of speed until we lost visual. I am not sure what I saw and am still very shaken up over this incident. I know that if anyone else was skygazing last night around this timeframe, they would have seen it as well."],"Summary":"Moving starlike object quickly brightens, then goes back to original state","Case Number":"32905","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/32905.html.txt","/var/www/straped/mufon/org/32905.html"],"Sighting Duration":"Undisclosed","Date of the Event":"10/26/2011 07:45 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.024132,+-83.900226(32905)&iwloc=A&hl=en\"> mufon case (32905) map </A>","Source":"MUFON","Longitude":"-83.900226","Latitude":"36.024132"}