{"Country":"India","Region":"Delhi","Summary":"Bright reddish-white glowing UFO's","map":"<A HREF = \"http://maps.google.com/maps?q=28.638738,+77.2262(32904)&iwloc=A&hl=en\"> mufon case (32904) map </A>","Viewing Distance":"Unknown","Disposition":"Unresolved","City":"New Delhi","Source":"MUFON","Date of the Event":"10/26/2011 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"10/27/2011 06:25 UTC","Object Flight Path":"Hovering then path,Path with directional change","Log Number":"IN-10272011-0004","Longitude":"77.2262","Tags":"City","Latitude":"28.638738","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in New Delhi","There was one other sighting in New Delhi on or around October 26th 2011","This sighting has never been favorited.",""],"Object Shape":"Circle, Fireball, Oval, Star-like","Case Number":"32904","Object Features":"Undisclosed","divs":["sighting detailsme and my friends were standing outside. it was diwali yesterday so everyone was burning fireworks and socializing. suddenly a friend pointed towards the sky and a very bright object was moving across the sky. at first we thought it's some firework but it kept moving. it didn't look like an aeroplane, was way too bright. then within another 5 mins a similar object crossed the sky. we rushed to the terrace and we could see it in a distant corner of the sky. and while we were looking at it, we saw that there was another one nearby. they were moving in the sky but were very far off from us. then they disappeared. and just as we were leaving suddenly one of those popped up again and this time very bright and nearby. it crossed the sky and then got dimmer and dimmer and vanished again. again after 10 minutes it came back. but this time from the opposite side and again crossed the whole sky. and i haven't seen anything like it. it was so different. i captured a lot of photos and videos. i've written a blog about the event - [link moved to field investigator section\\cms\\tg]"],"files":["/var/www/straped/mufon/html2text/32904.html.txt","/var/www/straped/mufon/more/32904_submitter_file1__IMG_0151.JPG","/var/www/straped/mufon/more/32904_submitter_file2__IMG_0152.JPG","/var/www/straped/mufon/more/32904_submitter_file3__IMG_0155.JPG","/var/www/straped/mufon/org/32904.html"]}