{"Longitude":"-97.350195","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Flight path seemed parallel to Hwy 177 southbound hovered about Buckstitch Rd and resumed flight","Object Shape":"Boomerang","Tags":"City","Country":"United States","Object Flight Path":"Path then hovering","Region":"Oklahoma","Viewing Distance":"501 Feet - 1 Mile","City":"Sulphur","Latitude":"35.580014","Case Number":"32901","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/32901.html.txt","/var/www/straped/mufon/org/32901.html"],"Log Number":"US-10272011-0001","trends":["There has been one other sighting in Sulphur","There were no other sightings in Sulphur on or around August 10th 2011"],"Date of the Event":"08/10/2011 12:00 UTC","Source":"MUFON","divs":["sighting detailsafter getting off work that night, i was sitting on the back deck with my binoculars and two dauchshunds. i spotted the object approaching from the north, moving pretty slowly. thought it might be aircraft due to formation of lights along wings, but all lights were beautiful kelly-green and pulsating, the whole object being boomerang-shaped. it was close to the horizon (from my elevation it appeared to be at approx. 15-20 degrees above tree level) moving south apparently along the local state highway. at approx. a mile north of our exit, it appeared to hover and veer slightly toward the west (toward my location) my dauchshunds had begun to whimper and gathered beneath my chair, the male's hair up along the back. at this time, the object still had to have been at least a mile and a half away but the dogs seemed to sense it. during this same time, there was a commercial airliner flying from west to east at a typical altitude and i was able to compare the two, no comparison. the general shape was similar to conventional aircraft but the light configuration was way wrong and i could not make out an actual fusilage. there is a lot of commercial traffic moving from west to east to the south of our location but this object seemed to fly along the highway. i became pretty excited when i realized this might not be an airplane! i stood up and went to the far southeast corner of the deck to try to keep it in sight longer. i think it hovered approx. 1 to 1 1\\2 minutes, then resumed it's slow path south. eventually it curved off to the southeast and slowly went out of sight. the dogs insisted on going back indoors and would not go back out that night"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.580014,+-97.350195(32901)&iwloc=A&hl=en\"> mufon case (32901) map </A>","Date Submitted":"10/27/2011 12:56 UTC"}