{"City":"Traverse City/Williamsbur","Date Submitted":"10/27/2011 05:48 UTC","Tags":"City","Sighting Duration":"00:01:00","Summary":"Triangular Object Seen Hovering Over Twin Lake on Supply Road","Date of the Event":"10/26/2011 10:46 UTC","Viewing Distance":"101-500 Feet","trends":["there have been no other sightings in traverse city\\williamsbur","This sighting has never been favorited."],"Longitude":"-85.592834","Latitude":"44.317064","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.317064,+-85.592834(32903)&iwloc=A&hl=en\"> mufon case (32903) map </A>","Log Number":"US-10272011-0003","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving home from a friends house and I was taking Supply Rd to Fife Lake. I noticed when I had almost reached Williamsburg Rd that there was a bright light in the sky, at first it was so low I thought it was part of a tower that might have been worked on or something, but it peaked my interest so I kept an eye on it as best I could. After I passed the Williamsburg Rd turnoff I descended into the valley before the first turn by Twin Lake, and by the I realized that it was an object hovering over the lake. I did the best I could to pull over and get a good look at it, and when I actually stopped the vehicle and shut it off and stepped out to view it, I got a good look at it. It was a triangular looking craft, at least thats what the light pattern made it look like. The lights that were smaller on it were blinking very quickly, and it had a bigger orange-red light that was fairly bright. At first I thought it might be a helicopter, but it did not produce any sound. After I watched it for 20 seconds or so, it took off very quickly to the other side of the lake, and just barely out of my clear view, and the way it moved told me I had witnessed something abnormal...nothing of this world could possibly move that quickly and smoothly while remaining completely quiet. I've seen several UFOs after I started looking for them, but they have always been star-like or orbs very high up...I always dreamed of seeing something like this, but honestly having seen it, it really freaked me out at the time, I guess you can never really know until it happens, and I never thought it would, but it was an incredible experience that I will never forget"],"Source":"MUFON","Object Shape":"Triangle","Object Flight Path":"Hovering then path","Region":"Michigan","Case Number":"32903","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/32903.html.txt","/var/www/straped/mufon/org/32903.html"],"Disposition":"Unknown"}