{"trends":["There have been 8 other sightings in Beavercreek","There were no other sightings in Beavercreek on or around October 22nd 2011","This sighting has never been favorited.",""],"Object Shape":"Fireball, Sphere","files":["/var/www/straped/mufon/html2text/32912.html.txt","/var/www/straped/mufon/more/32912_submitter_file2__UFOEncounterApproximation.png","/var/www/straped/mufon/more/32912_submitter_file3__SightingTracker-Initial-October23.png","/var/www/straped/mufon/org/32912.html"],"divs":["Sighting DetailsI was sitting at the intersection of Grange Hall Rd and Pentagon Blvd in Beavercreek, Ohio. As an astronomer, it is a habit of mine to look up at the night sky as often as possible That night I looked into the eastern sky and noticed 10 glowing, pulsing, red lights in the sky over the city. My experience told me that what I was looking at was not natural and I immediately pulled out my iPod Touch and began filming the lights. I wondered if the lights could be the remains of the ROSAT satellite which was due to fall that night, but my later analysis determined that it was impossible. I believed that what I was seeing was not of terrestrial origin, but I knew that I would have to conduct a thorough analysis of my video data to verify that. I watched as the lights drifted silently across the sky. They appeared to be extremely high in the atmosphere as the moved slowly against the backdrop of streetlights and trees. I was excited and terrified as I watched the objects drift across the sky. I silently cursed myself for not carrying a better camera with me, but I worked with what I had. I made sure to note that Jupiter is the center light in the last few seconds of the video and tried to give coordinates and degrees for the objects, but my fear and excitement caused me to get most of them wrong. The objects eventually vanished one at a time as if in some kind of sequence before disappearing altogether. I contacted the Beavercreek Police Department and asked if they had received any reports of strange lights in the sky, but they replied that nobody had called. The dispatcher noted that a meteor shower was due that night. Since then, ROSAT was confirmed to have gone down over India and the Orionid Meteor Shower which was due to be prominent that night was nowhere near that region of the sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.769767,+-84.071338(32912)&iwloc=A&hl=en\"> mufon case (32912) map </A>","Disposition":"Unresolved","Region":"Ohio","Latitude":"39.769767","Longitude":"-84.071338","Source":"MUFON","City":"Beavercreek","Country":"United States","Case Number":"32912","Date of the Event":"10/22/2011 08:33 UTC","Date Submitted":"10/27/2011 09:59 UTC","Tags":"City","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Summary":"Strange Lights Over Beavercreek, Ohio","Object Features":"None","Log Number":"US-10272011-0010","Weather Factors":"Unknown"}