{"files":["/var/www/straped/mufon/html2text/32917.html.txt","/var/www/straped/mufon/more/32917_submitter_file1__ufo-102711.jpg","/var/www/straped/mufon/org/32917.html"],"Latitude":"41.885016","Longitude":"-87.81248","Date Submitted":"10/28/2011 12:07 UTC","Disposition":"Unresolved","Region":"Illinois","Weather Factors":"Unknown","Object Shape":"Star-like","Viewing Distance":"Over One Mile","Country":"United States","divs":["sighting detailsi was sitting on my balcony facing east. directly north, approximately over des plains or skokie, i saw a large whitish light. the light was twinkling somewhat in the lower atmosphere and appeared sometimes orange or reddish. i thought it was a plane at first. it was hovering around the treetops, directly in the path where commercial traffic approaches o'hare. i thought it was a plane approaching from the north because the light was so bright, which is unusual and caught my attention because traffic typically approaches from south east and then veers west towards o'hare. a jet was taking off at the same time, traveling east. the jet crossed in front of the light (i could see the silhouette), and all the normal lights were on, so i couldn't help but notice how much smaller the jet seemed in comparison to the ball of light. the light slowly ascended at that point and completely disappeared. like someone switched off a lamp. it did not go into the clouds - it looked completely different than that. it just disappeared. then it seemed liked something else was where the light used to be. i'm not sure if transparent is the right word, but the only other accurate word i can use is \"cloaked\". i could see it moving, but it was close to the same color as the sky, and occasionally i saw dim specks of light near it. if you blink, you'd miss it the specks of light. it moved out of my field of vision within seconds. attached is an example i created in photoshop. i tried to keep the scale similar to the objects i saw. earlier this week, on 10\\24\\11 at approximately 7 or 8 pm, i saw a similar cloaked object traveling from north to south in the upper atmosphere. i thought it was a dim satellite until it made a sharp angle west - like it turned on a dime - and went faster than anything i've ever seen in my life. the speed was instantaneous. it corkscrewed straight up and i lost sight of it. i've seen several objects similar to this, but none as fast. it was pretty cool. do satellites ever make sharp turns? i thought they only went in straight paths. thanks for your help."],"Source":"MUFON","Log Number":"US-10282011-0001","Tags":"City","Date of the Event":"10/27/2011 10:10 UTC","Object Flight Path":"Hovering then path","City":"Forest Park","map":"<A HREF = \"http://maps.google.com/maps?q=41.885016,+-87.81248(32917)&iwloc=A&hl=en\"> mufon case (32917) map </A>","Case Number":"32917","Summary":"White Light Hovered, Slowly Ascended and Vanished","Object Features":"Unknown","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around October 27th 2011","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed"}