{"Tags":"City","divs":["Sighting DetailsThursday, October 27, 2011, approximately 10:10 pm. My daughter went outside to take the trash hopper to the road side to be picked up in the morning. She went outside and walked in the direction of the trash can, towards the East. Then she saw a light above her head. She looked up and saw a triangle shaped object with a blue light at the tip and two white lights at the other tips. The craft was spinning in a counter clockwise motion while it was slowly moving in an east bound direction. She observed the object for about 40 seconds. Turned around to call my Mother to come look and then turned back around to look at the object again and she saw it rapidly moving away towards the East. She rushes back into the house and ran up stairs to tell me what had just happened. She was startled and excited. She told me what she saw then I went outside to have her show me exactly where she saw it and describe it to me. We were standing out by the trash can, she was describing it to me, and there was a car coming down the road and just suddenly stopped about 200 feet from our drive way. The headlights were on, the vehicle was still running, and it was just sitting there in the road. I decided I would walk the trash out to the road and get a better look at why this car was stopped in the middle of road like it was. I get down to the end of the drive way and expect to see deer crossing in front of the vehicle, something like that. There was nothing else in the road. So I thought maybe they saw whatever my daughter just did and maybe it was still there. I looked up into the sky and I didnt see anything. But the vehicle still remained stopped in the middle of the road. And I had no idea why. I walked back up to the house and told my Mother to come and look at this car that was just sitting in the road. She did. The vehicle remained in the middle of the road for about 90 seconds and then preceded on at a low speed. When it drove in front of the house I could see it was a dark color SUV, looked like a Ford model. And that was it. Very strange."],"Source":"MUFON","Date of the Event":"10/27/2011 10:10 UTC","Region":"Michigan","Object Flight Path":"Straight-line path","Date Submitted":"10/27/2011 11:16 UTC","Disposition":"Unknown","Latitude":"41.998601","Longitude":"-86.145988","Country":"United States","Object Shape":"Triangle","Object Features":"None","Weather Factors":"Unknown","City":"Dowagiac","Case Number":"32915","Log Number":"US-10272011-0013","trends":["There have been 3 other sightings in Dowagiac","There were no other sightings in Dowagiac on or around October 27th 2011"],"files":["/var/www/straped/mufon/html2text/32915.html.txt","/var/www/straped/mufon/org/32915.html"],"Summary":"Triangle object, three lights, spinning","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.998601,+-86.145988(32915)&iwloc=A&hl=en\"> mufon case (32915) map </A>"}