{"Disposition":"Insufficient Data","Sighting Duration":"01:15:25","files":["/var/www/straped/mufon/html2text/32928.html.txt","/var/www/straped/mufon/org/32928.html"],"Date of the Event":"10/28/2011 11:20 UTC","Object Features":"Unknown","Log Number":"US-10282011-0012","Date Submitted":"10/28/2011 05:18 UTC","City":"Carlsbad","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","Case Number":"32928","Country":"United States","Tags":"City","divs":["sighting detailslast night i took my kids to the \"marfa mamy lights\" (thats what we call them)to see if they were out & sure enough they were. this time i got really scared because it seemed as if they were coming closer& closer to me so i'd turn on my headlights &they'd back off. there were several different ones, but at one time there were 3 as in the shape of a triangle, then they vanished, then they came back. some blinked others were always bright, others seemed to get brightern them dim down n then brite agagin n move up, down, left, right, sometimes fast n othertimes slow. i have been seeing these \"things\" for approx. 5-6 mos. they r more active when there is no moon. its crazy, idk what they could be but it's going to drive me crazy til this isinvestigated n explained. come n see them, it's like they like company i think, but i dont ever get out of my car cuz idk what they r or what they r capable of. please come n help me find a logical explanation 2 all this crazyness i've discovered. thank you, (name moved to fi box ) 10\\28\\11 21:23 cst flg"],"Source":"MUFON","trends":["There have been 12 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around October 28th 2011"],"Longitude":"-104.226898","Latitude":"32.422044","Summary":"Similar to the marfa lights in marfa tx. they come toward you at times","Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=32.422044,+-104.226898(32928)&iwloc=A&hl=en\"> mufon case (32928) map </A>","Object Shape":"Circle, Sphere"}