{"Tags":"City","Source":"MUFON","Latitude":"33.792537","Longitude":"-118.185404","files":["/var/www/straped/mufon/html2text/32921.html.txt","/var/www/straped/mufon/org/32921.html"],"Object Shape":"Unknown","Sighting Duration":"Undisclosed","Case Number":"32921","Log Number":"US-10282011-0005","Summary":"Noticed object that looked like a comet move very slow in the sky, changed directions or altitude, hovered and then vanished.","Object Features":"Unknown","Region":"California","Date Submitted":"10/28/2011 07:19 UTC","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around October 28th 2011"],"Date of the Event":"10/28/2011 02:45 UTC","Country":"United States","divs":["Sighting DetailsOn October 28, 2011 at approximately 2:45 a.m. I noticed an object in the sky that looked like a comet. I caught view of it through the front windshield, to the left (I am in the front passenger seat) My first thought was \"Comet\". But after watching it for a few seconds it looked like it was gaining altitude. However, being the passenger in the car I was able to keep my eye on it and the ground and it was not gaining altitude. This was when i thought it was possibly a crashing plane or helicopter but the object seemed to be moving at a slow rate of speed. Plus, the glowing comet-like tail it had that was bright white in the center and orange all around suddenly stopped. At this point we were starting to pull over and I was reaching for my cell phone so I could film it. The object lost its comet like tail and hovered. I did not take my eyes off of it. It hovered for about 30 seconds. This object was bright white and looked as if it had blinking lights on it. As we made our way over a lane or two in order to pull over and film it, the comet tail came back. The object moved abruptly to the right and then, instantly, just like in the movies, it vanished. It left behind a ring of smoke that we both described as a \"poof\". What we saw this evening defied the normal. We are currently driving out of town...a family trip to the Seqouias and we are baffled by what we witnessed just over an hour ago. It made zero sense and I find it difficult to describe in words because what I saw happen in the night sky does not compute! It's unexplainable, but it isn't because I watched it."],"Disposition":"IFO","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.792537,+-118.185404(32921)&iwloc=A&hl=en\"> mufon case (32921) map </A>","City":"Long Beach"}