{"City":"Tupelo","Date of the Event":"10/28/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.228016,+-88.826242(32922)&iwloc=A&hl=en\"> mufon case (32922) map </A>","Log Number":"US-10282011-0006","Object Flight Path":"Stationary","Country":"United States","Longitude":"-88.826242","Object Features":"Dome, Window(s), Patterned Surface","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/32922.html.txt","/var/www/straped/mufon/org/32922.html"],"Date Submitted":"10/28/2011 11:14 UTC","Summary":"has been here at least 4 wks and is still here. LOTS of disc landing in trees. They are like light beings and greys and so much more. When a being is present you can see like heat waves.","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Disc, Oval, Triangle","Region":"Mississippi","Case Number":"32922","Latitude":"34.228016","divs":["Sighting DetailsIn Sept. 2011, I started having this feeling like we my family and I were being watched, I thought someone maybe watching us to break in our home or something. My husband told told me it was probably nothing. But then we started seeing lights at night walking the field and we thought we were hearing 4 wheelers on our land, the next morning, I would always look to see if there were and tracks, and thing did look differant to me. We have 8 acres of land and our land meets up with a golf course that has been closed down for about a year, and the other side of our land meets up with pasture land. On night my husband was outside looking up at the stars, and he came in the house very excited and said he saw a light in the sky just turn off like a light bulb. Soon after that our 9 year old son told that earlier in the summer, probably August, he saw a ball of light go hover around a tree and then it took off, he said he didnt want to tell us because he didnt want us to thing he was tell a story. Our family has always been star gazers, but since the lights my husband and son saw, we really started looking up at the stars. At first we noticed how all the stars in the sky were formed like triangles small ones and very large ones, we also started watching a really bright star, we thought at first, it my have been a planet, we looked at it with our binoculars and it looked like a large jelly fish with hundreds of lights in it. Later on we find out that it was no star or planet, it some kind of jet. This jet made a noise at first, but then when it hovered, it was completely silent. It was hard to film it, cause it would turn my flash off on my camera and when I walked back inside, my flash would come back on. There are too many events that have happened to list My husband and I will gladly speak to someone about this. The ships and beings are still here, and have been here for at least a month of two. My husband and I have tons of pictures and videos we would love for someone to view. Someone is more than welcome to come to our home and view this for themselves. We arent sure how long they will be here. On one of the videos, you can plainly see a light being on the roof of our home and we are talking to him and he is talking to us. Its a must see. Please contact us asap, we dont know what is going on here.... In one of the pictures I am sending, its a circle with in a circle on my back cant explain where it came from, that happened twice. We have lots more pictures to show and videos. Also note that there are jets flying all around our house, night and day all hours.. and also a neighbor has noticed the jets also. They fly very low like tree top level even. Please contact us soon!! Thank You"],"Viewing Distance":"20 Feet or Less","trends":["There have been 4 other sightings in Tupelo","There were no other sightings in Tupelo on or around October 28th 2011","This sighting has never been favorited.",""]}