{"Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/32939.html.txt","/var/www/straped/mufon/org/32939.html"],"Object Features":"Unknown","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=32.905392,+-105.952945(32939)&iwloc=A&hl=en\"> mufon case (32939) map </A>","divs":["Sighting DetailsI don't know the year for sure, but it may have been around 2003. Some friends and I had gone to white sands, New Mexico, that evening. After walking around on the sand at night, we were in the car and witnessed these lights hovering over us. As I recall there were about five lights to each UFO and the UFO, which were hovering, began to like tilt all the way sideways in different directions and up and down all in sync. We became immediately very frightened and left. I was scared the whole way home to El Paso. The next day or maybe day after, the news reported a missing Japanese tourist from White Sands from that same exact night we had been there. For the next few days (maybe week, actually), it continued to be reported on the news. They were using infra red, etc., to try to locate the tourist to no avail. Then, like a week later, they find the Japanese tourist, dead near his car. I was amazed! How could it take a week of an intensive search using infra red, etc. just to suddenly find him dead right near his car. They new where his car was all along. I have always felt a very eerie feeling knowing that those bizarre UFOs were hovering above White Sands the same night he disappeared. And then, he shows back up dead like a week later! The date above is made up because it was required. It was maybe 2003. I can't remember. It was when the Japanese tourist was missing and then found dead, which I just googled and couldn't find."],"Disposition":"IFO","Region":"New Mexico","Date Submitted":"10/28/2011 11:18 UTC","Weather Factors":"Unknown","Latitude":"32.905392","Summary":"lights from two ufos almost like dancing in unison, hovering above white sands","Country":"United States","Source":"MUFON","Date of the Event":"08/07/2003 12:00 UTC","Case Number":"32939","trends":["There have been 16 other sightings in Alamogordo","There were no other sightings in Alamogordo on or around August 7th 2003"],"City":"Alamogordo","Tags":"City","Object Shape":"Other","Log Number":"US-10282011-0020","Longitude":"-105.952945","Sighting Duration":"Undisclosed"}