{"divs":["Sighting Details On September of 1978 , at approx. 7:20 PM , I happened to be walking my dog in a small church parking lot on Broadway at Franklin St in San Francisco. I happened to look up at the edge of a two story building and noticed the edge of something moving out over the roof of the building. Suddendly a small craft , row boat sized with a central rim about the center and two steep tail fins floated out from the roof. Then a second craft moved by it's side and I realized it was the second fin I had observed. They were silent and the skin of the craft was sort of a soft reflective whiteish-silver with a faint orange glow. One craft rocked back and forth slightly. Both craft were less then 25 feet from me, I literally could have hit them with a stone. I of course was in some sort of shock but I felt both elation , a desire to go with them and a sense of panic, realizing that there was no mistaking what I was seeing. After about 10 seconds they took off and banked up and over a 10 story building then I observed them directly over the Golden Gate Bridge as two orange lights. That month , there were numerious and varied UFO sightings in the SF region and several over SF."],"Date of the Event":"09/21/1978 07:20 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"32930","Region":"California","Country":"United States","Date Submitted":"10/28/2011 06:02 UTC","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around September 21st 1978"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.79552,+-122.425037(32930)&iwloc=A&hl=en\"> mufon case (32930) map </A>","Source":"MUFON","Latitude":"37.79552","Object Shape":"Unknown","City":"San Francisco","Object Features":"Appendage(s), Other","Summary":"2 craft hovered building , 20 feet , above,10 seconds, scaled building then over GG Bridge","Disposition":"Unresolved","Log Number":"US-10282011-0014","Tags":"City","Longitude":"-122.425037","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/32930.html.txt","/var/www/straped/mufon/org/32930.html"],"Object Flight Path":"Hovering then path"}