{"Tags":"City","Log Number":"US-10282011-0019","divs":["Sighting DetailsI woke up around 2:30 AM, restless, and got up out of bed, and just gazed pointlessly out of the two-story bedroom window which faced the south. As I loved to watch the stars, etc. Then it caught my eye. About twenty odd miles away to the south, was a reddish-orange dully glowing football like apparition about 500' off the ground. I could also observe occasional pulsations, and also that it seemed to have several accompanying smaller white discs. So, I assumed that I was probably watching a UFO mothership, or a reasonable facsimile of one, and of it's smaller companions. The reason I suspected it right off to be a UFO mother-ship, is that two of my bosses' sons were attendign a UFO festival up there at a ranch that I want to recall as Buffalo Ranch. However the name could be wrong. As the two boys told me the group intended to \"call in\" a UFO or two, I declined to go, as for one, we all had to work the next day in our very hard jobs. I did not fancy it worth the trip, and it actually sorta creeped me out. The next day the two young men told me that there were approximately a thousand people there in attendance. And yes, we discussed the UFOs, that they had \"called in\". They were very proud of themselves, but something seemed just a little on the occult or spooky side, so I never pursued the matter, or went to one of their events, though I was a believer in UFOs."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.176565,+-122.300606(32935)&iwloc=A&hl=en\"> mufon case (32935) map </A>","files":["/var/www/straped/mufon/html2text/32935.html.txt","/var/www/straped/mufon/org/32935.html"],"Object Flight Path":"Path then hovering","Region":"Washington","Summary":"I viewed a UFO manifestation from a long way off.","Longitude":"-122.300606","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","Object Features":"Unknown","Case Number":"32935","City":"Puyallup","trends":["There have been 13 other sightings in Puyallup","There were no other sightings in Puyallup on or around June 28th 1971"],"Date Submitted":"10/28/2011 08:23 UTC","Date of the Event":"06/28/1971 02:30 UTC","Object Shape":"Blimp, Disc","Latitude":"47.176565","Weather Factors":"Unknown"}