{"Country":"United States","divs":["sighting detailsi smoked then,and got up in the middle of the night to go onto the patio to have a cigarette. as i stood there enjoying the smoke, and the quiter part of a dallas night, just off i-635w., i just happened to be checking out the sorta low clouds. then, off to my left, towards mesquite, i saw this giant football of a thing, come silently gliding through that layer of low clouds. no sound at all. travelling probably 100+\\- mph., no more. looked to be exactly like an old pigskin, except it was about forty or so feet across, and about fiffty five or sixty feet long, in my estimation. it was not brightly lit, and had no lighting visible to me. but,while it was a dirty rusty reddish-orange color, it actually glowed as it did that. now, remembering it better, i recall thinking that it was \"camoflauged\". no wings. no externally visible anything. and it never once varied it's altitude, or it's straight path. it just kept right on, straight as an arrow, and quiet as a mouse. again, i was pretty interested, but what's a guy to do? i just yawned and went back inside and crawled into bed, wondering when these pilots are going to let us in on their real secrets."],"Log Number":"US-10282011-0019","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around May 21st 1995"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.918476,+-96.739604(32937)&iwloc=A&hl=en\"> mufon case (32937) map </A>","Case Number":"32937","Sighting Duration":"00:05:00","Object Flight Path":"Straight-line path","City":"Dallas","Date of the Event":"05/21/1995 03:30 UTC","Source":"MUFON","Disposition":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/32937.html.txt","/var/www/straped/mufon/org/32937.html"],"Object Features":"None","Object Shape":"Oval, Other","Latitude":"32.918476","Date Submitted":"10/28/2011 10:02 UTC","Summary":"A giant football glowing a very dull orangish rusty color.","Longitude":"-96.739604"}