{"Tags":"City","Country":"United States","Sighting Duration":"00:30:00","Weather Factors":"Unknown","Log Number":"US-10282011-0020","Latitude":"48.070997","divs":["Sighting DetailsA group of friends and I had travelled up into the low mountains around Fruitland, Washington,to help a friend and his wife raise an octagonal log two-story house on his twenty acres. But when the evening came and time to leave approached,we discovered that the vehicle needed repairs that could only be done in good daylight. The only sleeping accomodations were on rectangular bales of hay, and our cover was an tarp. A community bed, as it were, out in the wilds of nature. Around two or so, I awoke thinking that I may have heard a bear. I had been a very light sleeper ever since boot camp, and the least thing would awaken me-- especially in Grizzly country! No animal was approaching, thank God, so I lay there marvelling at the awesome display of the skies, and of course wondering how God could do all that? Then something in my perifferal vision caught my eye, near the horizon. At that time of the night, the sky was entirely free of clouds and no moon, until later on. A speck of light, a mere pinpoint, was moving way too fast to be a satellite, so I began to observe it. That pin point of light, then proceeded to rocket across the entire sky, at maybe three hundred miles elevation or more-- but it traversed the entire sky, in a perfectly excecuted zig-zag pattern! It went from horizon to horizon in probably five seconds, and as it was passing over my head, it covered at least a third of the sky, as it went from side to side! And of course, as it was so high up, and far away, it left no sound. The only sound was the snoring of the other sleeping friends, and my gasping at the sight I'd just seen.That and the night creatures. So, I drifted back off to sleep, but to awaken again, a couple of hours later, to check on everyone, and by then the skies had fllled up with what in Texas we call 'buttermilk' skies. Little puffy clouds all around. But the stars still shone brillianty, and the full moon was now up, at about ten 'oclock high. Then out from behind, or from inside a little cloud, moved out a very bright light, appearing about a quarter of the size of the full moon. It almost looked like a lightbulb, floating about, amongst the clouds, and then up, then down-- all rather lazy and unconcerned like. And I really had to ask, \"now, just what the heck is there out here in the middle of nowhere to interest you guys\"? Of course, I heard nothing but the night birds. I watched this light move about for approximately fifteen minutes, and then, like a light bulb indeed, it simply blinked right out. End of show, and I finally went back to sleep. And the next day, told no one."],"Object Flight Path":"Path with directional change,Path then hovering","Source":"MUFON","Date of the Event":"07/25/1973 02:15 UTC","trends":["There have been no other sightings in Fruitland","This sighting has never been favorited."],"Date Submitted":"10/28/2011 09:36 UTC","City":"Fruitland","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/32936.html.txt","/var/www/straped/mufon/org/32936.html"],"Longitude":"-118.198874","Summary":"Two events that night","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=48.070997,+-118.198874(32936)&iwloc=A&hl=en\"> mufon case (32936) map </A>","Object Shape":"Disc, Star-like","Case Number":"32936","Object Features":"None"}