{"Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.454727,+-112.071397(32932)&iwloc=A&hl=en\"> mufon case (32932) map </A>","Summary":"Instantly appearing, transforming bright object (balloon size) that traverse fast then slowly at close range and at low altitude, then instantly disappears.","Longitude":"-112.071397","Object Features":"Unknown","Sighting Duration":"00:03:04","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/32932.html.txt","/var/www/straped/mufon/more/32932_submitter_file1__picture-1.jpg","/var/www/straped/mufon/more/32932_submitter_file2__Picture-2.JPG","/var/www/straped/mufon/more/32932_submitter_file3__picture-3.jpg","/var/www/straped/mufon/org/32932.html"],"divs":["Sighting DetailsOn October 26, 2011 in Mesa, AZ around 2:42 PM, I was sitting in my lawn chair (located on my porch) watching the sky towards the northwest. As I was watching the sky, I saw a balloon size object just instantly appear in the sky from the west, and the object was traversing very swiftly in the sky like a fast and high moving jet. At first that's what I thought it was traversing: a high flying jet that just appeared in the sky. But suddenly I realized that it wasn't a jet, and I promptly began thinking that it may possibly be a balloon that was quickly traversing with the wind which the wind was blowing towards the east at a great gust. I immediately started taking pictures of the object. After taking a few pictures of it, I quickly reviewed one picture to see if the object looked like a balloon in the reviewer. The object didn't look anything similar to a balloon in features after reviewing it via the camera's picture reviewer, so I continued taking more pictures of the object that was traversing. The object also seemed like it was slightly changing it's shape while traversing, and the object had drastically slow down in the sky to almost a crawl which to me appeared to be resisting the wind that was blowing on it. The object appeared somewhat brownish in color with a hint of yellow in it or possibly even a slight orange color too. It also appeared to have a furry-like surface or a fuzzy surface similar to a peach. After thinking initially of it being a jet then a balloon, I quickly began realizing that it's movements was beginning to contradict the balloon possibility yet it was traversing somewhat similar to be a balloon. The object was about 70 feet up in the air, and it was about 100 to 150 feet away from my location. It appeared to be traveling with the wind which was blowing from the west to east at a good gust of maybe 25 to 35 MPH. The object was traveling in the air at a steady slow rate which in the beginning appeared to had been traveling with the wind in great speed. The object was clearly seen in the sky, and it was not always round in shape. When trees started to obscure my viewing of the object, I quickly hurried to the front of my house in order to continue viewing the object and to continued taking more pictures of the object too. Normally, I wouldn't do this if I thought it was just a balloon traversing, and especially if it appeared to be exactly like a balloon while quickly reviewing it via the camera's picture reviewer. While taking pictures, I included lots of landmarks such as trees, buildings, etc while I zoomed out to 70mm. I really didn't want to zoom out; however I also still continued zooming in onto the object too in order to get as much close-up pictures as possible too. I realize when showing the pictures to people that it may be difficult for some people to judge the size of the object in the picture unless there was possibly some structural feature to help in judging the size of the object; therefore, that's the main reason why I included landmarks while taking pictures of the object. While viewing the objects with just my eyes, it instantly disappeared in the sky. I quickly started taking random shots in the sky in the general area where the object was last seen. I managed to get one more picture of the object while not seeing it with my eyes. The object appeared to had quickly traverse across the sky rather than it just instantly vanishing; yet the lighting part instantly disappear before my eyes. The sky was partly cloudy and a little hazy. The wind was blowing very hard towards the east. The temperature was about 85 degrees F. No sound from the object was heard. No reflection of sunlight was seen. Four minutes earlier, a troop-carrying type helicopter from the AZ National Guards (United States Army) number 136 had pass through the area heading west on the same pathway and at the same altitude the objects had traverse in the sky while it went east in direction. It is possible (hypothetically and from my perspective) that the helicopter may had even pass each other while both were in flight. It was not until I downloaded the pictures and examining each picture that I can safely say beyond any doubt that it was not a balloon traversing in the sky. The helicopter was last seen at 14:38 hours, and the object was first seen at 14:42 hours, and the object last seen at 14:45 hours for a total sighting duration of 3 minutes. Time difference between sighting helicopter and object: 4 minutes."],"Log Number":"US-10282011-0016","Source":"MUFON","Date of the Event":"10/26/2011 02:42 UTC","Weather Factors":"Unknown","Date Submitted":"10/28/2011 06:17 UTC","Disposition":"IFO","Object Flight Path":"Path with directional change","Object Shape":"Sphere, Other","Case Number":"32932","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 26th 2011","This sighting has never been favorited.",""],"City":"Phoenix","Latitude":"33.454727","Tags":"City","Country":"United States"}