{"trends":["There has been one other sighting in Bloomfield Hills","There were no other sightings in Bloomfield Hills on or around October 28th 2011"],"Longitude":"-83.245488","Summary":"5 lites convened icosahedronnaly to brighter center, 1 hovered horizonatly, 1 merged, other 2 retracted in random pattern","Case Number":"32943","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/32943.html.txt","/var/www/straped/mufon/org/32943.html"],"Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Date of the Event":"10/28/2011 08:24 UTC","divs":["Sighting DetailsI was driving home south on I75 under little to no cloud cover. As I exited square lake road approaching opdyke intersection, I noticed, across the horizon within a 1-2 miles range, 2 parallel series of equidistant separated lights (3left 2right) of increasing intensity proportionally consistent with two distinct \"approach\" path- patterns of airplanes- a familiar, common and regular occurrence in sw michigan given the neighboring airports namely DTW. My observation was initially triggered by the unusually low altitudes relative to 30 years worth of local, layman observation and the vicinity of local airports: there was nowhere for these things to land based on trajectory and location. Within seconds, the lights abruptly changed direction to convene across their linear parallel counter point,. It looked as if the planes of two approach paths suddenly turned toward each other with increasing speed. The lights varied in their increasing intensity and speed stopping abruptly just shy of a perpendicular alignment above a much brighter, constant, central lower light. The topmost two pairs convened to this central line while the one unmatched light merged entirely with the brighter light. As the unmatched light merged with the still stationary light, their brightness doubled as 1, the approaching paralleled pairs retracted away from each other across random trajectories, with even greater speed, and just prior a new light appeared. The \"new\" light was spatially and proportionally consistent with what would have paired along the initial distribution of all the lights for it to have been the match of the lower, soon to be merged light. It appeared just prior to the others splitting off and it followed a much slower approach toward the central perpendicular line above the brightest light. It was upon this \"new\" light's alignment with the center that the others repelled and the single merged with the larger. The two pairs follow dissimilar patterns in speeding off from each other, zigzagging, bouncing as they dispersed, meanwhile the new on hovered over the bottom bright one. I can not determine what occurred next because my horizontal view of this weirdness was soon consumed by the decreased elevation of the road- i couldn't see anything after I reached a certain point on the downward sloped road, approaching the intersection. This took several seconds only. There seemed nothing definitively significant about the lights themselves aside from the patterns of movement. they were white-yellow- in color- maybe a little more yellow than airplanes but not anything wildly unusual like their movement. the observation was at about 233 degrees from the intersection of opdyke and the i75 sb exit ramp within a 1mile to 2 mile distance. In trying to come across the accurate geometric terms to describe the lines and distance of these things relative to their movent and spatial representation, and direction, across an xy axis, I'm pretty certain it would be accurate to plot a iconsohedron shape and say the distribution and linear movement of the lights, prior to dispersion was 100% symetrically contained and occurring within the lines of an iconsohedron shape. Drawn within the points of the initally observed distribution and symetry of lights serving as perimeter points to sebsequent movement which all occurred within the interior angles of the shape. The lowest, closest brightest light, however, occured outside the linear object along although aligned as implied extension of its points. I came across some patterns of drawn shapes and linear relationships that visually represent what i saw these lights pattern across the xy axis. Though I have no real understanding of any of the math, at all, I will tell you what these geometric terms were in case any one who knows what the mathematical implications of them may find them helpful somehow- some of these terms were: paralleled non-surjective ( 2 top lights approached each other lowest went off to \"injection\" ) appearance of 3rd light is like surjective composition that triggered the scattering of the others."],"Object Features":"Unknown","Latitude":"42.583645","Log Number":"US-10292011-0004","Object Shape":"Unknown","Date Submitted":"10/29/2011 02:56 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","City":"Bloomfield Hills","map":"<A HREF = \"http://maps.google.com/maps?q=42.583645,+-83.245488(32943)&iwloc=A&hl=en\"> mufon case (32943) map </A>","Region":"Michigan"}