{"Object Shape":"Circle, Fireball, Sphere","divs":["Sighting DetailsOn Saturday October 29th around 9:00 P.M. I and 3 other co-workers were leaving the restaurant when one of us spotted something SW in the sky over a one story building, either above or in the fog cover.It was brighter than a halogen street light across the two lane road, glowing a bright orange-yellow color. We watched it for minute or two rise and fall and continue on a northern flight path. then as quickly as it appeared it faded out. After it disappeared, we stood around trying to figure out what we just saw. 2 of the people went back in the restaurant to Finnish locking up and I and my friend made our way across the street to my car, when it appeared again in the same spot in the sky. It appeared to change direction and head right for us so we made our way across half the street and over to the restaurant and alerted the other to who had seen it previously. When we got next top the restaurant it appeared to change direction and head on a northern flight path when it faded out again. The 4 of us stood there awe struck when on of the witnesses got on their cell phone and called their mother who was at home 8 miles away and said they had seen something matching the description over a town 14 miles north. while the person was on the phone it appears in the same place in the sky again changed direction as it did the 2 times prior and blinked out. When it flew by at it's closest I saw what looked like 3 round white-yellow lights on the bottom with a ring of oscillating lights above. I HAVE NEVER IN 25 YEARS OF LIVING IN THIS AREA, SEEN ANYTHING LIKE THIS."],"Latitude":"44.316181","Log Number":"US-10302011-0001","Summary":"UFO over Yachats Oregon.","Sighting Duration":"Undisclosed","Region":"Oregon","Date Submitted":"10/30/2011 01:15 UTC","City":"Yachats","Country":"United States","Disposition":"Unresolved","Viewing Distance":"Unknown","Case Number":"32948","trends":["There have been 4 other sightings in Yachats","There were no other sightings in Yachats on or around October 29th 2011","This sighting has never been favorited.",""],"Tags":"City","Weather Factors":"Unknown","Date of the Event":"10/29/2011 09:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Other","map":"<A HREF = \"http://maps.google.com/maps?q=44.316181,+-124.100732(32948)&iwloc=A&hl=en\"> mufon case (32948) map </A>","files":["/var/www/straped/mufon/html2text/32948.html.txt","/var/www/straped/mufon/more/32948_submitter_file1__308412_2580757686691_1486899335_2909957_394299847_n.jpg","/var/www/straped/mufon/org/32948.html"],"Source":"MUFON","Object Features":"None","Longitude":"-124.100732"}