{"Date Submitted":"10/29/2011 01:11 UTC","Longitude":"-77.443749","Log Number":"US-10292011-0002","divs":["Sighting DetailsMyself and two other witnesses were talking on a side porch of our cabin in north central Pennsylvania when I noticed something brighter than normal to the north. At first glance I thought it was either a heli or an airplane but I didn't hear anything. No rotor wash, no engine sound whatsoever. I immediately stated to the others: \"What in the $@^% is that?\" They both took notice and one took out his cell phone and took a quick photo. Whatever it was, he thought it was peculiar enough to take the shot. We are so glad he did. What really caught our attention was that there were two objects. One was above the other in vertical fashion, and the distance between the two objects never changed during the entire event. One was above a steep mountain wall, the other was below the ridge about half way down the face of the mountain. If it weren't for this bottom light, we probably wouldn't have paid so much attention to it, but this lower light gave us depth perception as it is less than a mile away. They seemed to slowly pulsate from an orange-ish to a red-ish and were very bright. At first they slowly descended moving slightly left then hovered in a static position for approximately 10-13 seconds. None of us said anything, we just watched the objects intently. After the 10-13 second hover they slowly ascended upward. Again, both in tandem. After a few more seconds they began to accelerate very quickly straight upward. The rate of speed was faster than any aircraft could have moved. The closest thing we could compare them to was similar to a shooting star, only they moved straight up. As the objects ascended, they became more and more dim. I said to the other guys: \"They're going to disappear\" and about two seconds after I said that, they did. I immediately asked the guys what they thought it was and one of them said \"It's just something you can't explain. You can't explain it.\" I think some of the words used were \"unbelievable, and holy $#@%\". We went inside the cabin and enthusiastically told others at what we had just seen. Of course, most passed it off as some kind of joke or a high tech military aircraft. We checked the cell phone image and it validated what we saw. The next morning after waking it was the first thought on my mind. I had finally witnessed a ufo event. Personally, I have always believed in other beings or life forms due to the sheer math of the vastness of space. There is absolutely no question in my mind that what we saw was non-human. At first I found it hard to tell anyone that was not in my immediate family for fear of rejection, and I felt very strong about what we saw. Now, after reading so many other's accounts of similar sightings I have no problem telling others. I never felt any fear or danger but I definitely felt uneasy afterward. I have never stopped looking upward ever since."],"Source":"MUFON","trends":["There have been no other sightings in Cedar Run","This sighting has never been favorited."],"Disposition":"Unresolved","Object Features":"None","Sighting Duration":"00:00:15","Weather Factors":"Unknown","Date of the Event":"09/17/2011 09:30 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/32942.html.txt","/var/www/straped/mufon/more/32942_submitter_file1__photo.jpg","/var/www/straped/mufon/org/32942.html"],"City":"Cedar Run","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=41.522087,+-77.443749(32942)&iwloc=A&hl=en\"> mufon case (32942) map </A>","Summary":"2 star-like orbs in vertical formation, silent","Case Number":"32942","Region":"Pennsylvania","Object Shape":"Fireball, Star-like","Latitude":"41.522087","Country":"United States"}