{"Object Shape":"Disc","divs":["Sighting DetailsThe encounter, or rather my memories of the event has to be divided into two chapters. Chapter I A friend and I were driving from Garden City to Ypsilanti. We left my house at 7:30PM; I was driving. We were taking Ford Rd. (rte 153). Back then, Ford Rd. through Canton Township and further west was still quite rural, no traffic. We were listening to WMJC on the radio. The DJ said it was 8:01 and then static, I thought nothing of it, it was in that area that you would lose the Detroit radio staions and start to pick up the Ann Arbor stations. I had just reached down to adjust the radio dial then FLASH!!!! Everything lit up. . . GREEN!!!! We were so frickin' startled I don't know how I maintained control of the car. I turned off the radio and we started looking around and listening. NOTHING! It had been almost as light as daylight, except it was green. It was so light out that we would have been able to read the license on the car ahead of us had we been close enough. We were quite shaken, to say the least, and things seemed a bit fuzzy. We made the obvious remarks: What was that? Did you see anything? Was there a helicopter or something? By that time we had made the left turn onto Plymouth Rd. and had travelled a little more than a mile. I asked J. the time in case there was something to report. It was 8:30PM! That shook us up almost as much as the flash of green. We had lost almost one half hour. I know I slowed down considerably from the 55-60 mph I had been driving on Ford Rd. and of course we made the turn. We reached our destination a little after 9:00PM. That trip normally takes 45 minutes to one hour. I have driven that route, or some variation probably hundreds of times. I even commuted to U of M for a summer semester making that same drive; So I know the route and how long it takes. In case anyone wants to know, we had not been drinking nor were we under the influence of any substance. Chapter II I used to go to a [well-known] hynotist in the Detroit area. A hypnotist with a PhD, not one who does shows at the mall and makes you act like a chicken. I went back to see her, perhaps there was more to the incident. It took a few times to get beyond that initial shock of seeing everything light up. Despite being in a deep state of hypnosis I kept 'waking up'. I think it was on our fourth attempt that I was able to continue, and that is when I remembered seeing it, the thing, the spacecraft, the UFO! Although under hypnosis I was moving around as if it was happening the. I was physically going through all of the actions. I could even feel the steering wheel as I turned my head and body, looking out the driver's window- Doctor: \"What are you doing Steven? Me \"I'm looking at it.\" Doctor: \"What do you see Steven?\" Me: \"The SPACESHIP!\" I guess something changed at that time in what I was doing - Doctor: \"What is happening now?\" Me: \"It stopped.\" Doctor: \"What stopped?\" Me: \"EVERYTHING!!!!\" Despite numerous attempts, I could never get beyond that point,and to this day I get goosebumps whenever I think about it. There were cassette tapes made of our sessions. Unfortunately they are long gone. I mention the tapes because I wanted some friends to listen just to verify that the doctor did not try to influence my memories. Finally after more than 30 years I have made a report of what my friend and I witnessed. Thank you."],"Region":"Michigan","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Summary":"The most significant aspect of the encounter was the loss of time!!!The","Object Flight Path":"Stationary","Country":"United States","Date Submitted":"10/30/2011 03:20 UTC","trends":["There have been no other sightings in Superior Township","This sighting has never been favorited."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/32955.html.txt","/var/www/straped/mufon/org/32955.html"],"Tags":"City","City":"Superior Township","Latitude":"42.301018","Disposition":"Unknown","Case Number":"32955","Weather Factors":"Unknown","Longitude":"-83.605194","Date of the Event":"04/14/1981 08:01 UTC","Log Number":"US-10302011-0008","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.301018,+-83.605194(32955)&iwloc=A&hl=en\"> mufon case (32955) map </A>"}