{"map":"<A HREF = \"http://maps.google.com/maps?q=39.24633,+-94.897247(32956)&iwloc=A&hl=en\"> mufon case (32956) map </A>","Object Flight Path":"Path with directional change","City":"Lansing","Region":"Kansas","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","divs":["sighting detailsa family member and myself were waiting to leave from a resturant that was next to a housing area. we looked up towards the southwest where we heard and saw a dark\\black helicopter coming in low from and near by a residential area. a bright light came in kinda like the ships from starwars leaving hyper space and started following the unidentified black or dark hellicopter. it slowly moved toward the east then north. at first it looked like a airplane from a distance untill it was obviously closer then it was just a very bright light moving in a very slow zigzag pattern. the closer it came toward us and the brighter it became the more of its arua you could see. we then left to go follow it which was annoying cause sometimes ufo's look like they're in one place but in another. once we got moving it was above a residential area and i could actually see it and what it was. it was like a cylinder flying upright with a silver round bubble top and a black bottom. hard to tell the middle due to the light coming from it and the auru around it which was turning yellowish by then. we passed behind a tree doing 40mph and then it was gone. drove around for 10 minutes while getting up on a hill within minutes just in case it was a plane so we could see its lights. we saw nothing in the area and left. my picture is crude but hope it helps."],"trends":["There has been one other sighting in Lansing","There were no other sightings in Lansing on or around October 2nd 2011","This sighting has never been favorited.",""],"Latitude":"39.24633","Source":"MUFON","Object Features":"Other","Case Number":"32956","Weather Factors":"None","Sighting Duration":"07:35:00","Summary":"UFO following helicopter near and in a residential area","Date of the Event":"10/02/2011 07:20 UTC","Log Number":"US-10302011-0009","files":["/var/www/straped/mufon/html2text/32956.html.txt","/var/www/straped/mufon/more/32956_submitter_file1__UFO1.JPG","/var/www/straped/mufon/org/32956.html"],"Tags":"City","Date Submitted":"10/30/2011 07:21 UTC","Disposition":"Unknown","Object Shape":"Cylinder, Star-like","Longitude":"-94.897247"}