{"Date Submitted":"10/30/2011 09:57 UTC","Object Features":"Unknown","Latitude":"35.671843","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Hickory","trends":["There have been 33 other sightings in Hickory","There were no other sightings in Hickory on or around October 26th 2011"],"Date of the Event":"10/26/2011 07:05 UTC","Case Number":"32958","Tags":"City","Object Shape":"Cigar, Oval","Country":"United States","Source":"MUFON","Region":"North Carolina","divs":["Sighting DetailsMy wife and I witnessed another UFO tonight at approx.7:00pm, my wife spotted it first and pointed it out to me the direction from our home was South South West above the tree lines behind our home. We thought it might be a planet at first, we looked around and we could not see any stars in the sky, we still had enough daylight. It was metallic extremely bright, brighter than any star that came out afterwards, almost reflective, with a non nondescript shape. It stayed stationary for at least 5-7 minutes. My wife says \"it felt like it was the same object\" she saw before but in a different location. I got my binoculars out and watched for a while it was oblong; I sat down on a chair for comfort, and could see it. I got up and leaned on the house wall to steady myself and continuing to see it. Then I thought I will sat down again to be more comfortable, and the strangest thing is, it was not in the same location as before it had moved downward behind some branches yet still visible. We decided to go around the front of the house to get another perspective, but it suddenly was not there anymore, just vanished as it had never been there!"],"files":["/var/www/straped/mufon/html2text/32958.html.txt","/var/www/straped/mufon/org/32958.html"],"Summary":"We saw another UFO tonight brighter than any star","Longitude":"-81.331288","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=35.671843,+-81.331288(32958)&iwloc=A&hl=en\"> mufon case (32958) map </A>","Disposition":"Unknown","Log Number":"US-10302011-0011","Viewing Distance":"Over One Mile"}