{"Region":"","Disposition":"Unresolved","Tags":"City","Case Number":"32957","Date Submitted":"10/30/2011 09:14 UTC","City":"Perry","Object Flight Path":"Unknown","divs":["sighting detailsduring a holiday in the us we were enroute from flagstaff to monument valley. enroute to monument valley i took several photographs but noticed nothing special. after a first review back home i didn't notice anything in my pictures as i quickle browsed through them looking for the best ones. except now when i reviewed them again piece by piece with a relative who came back from the same area last week. i noticed a greenish oval\\dome shaped object seemingly diving into a canyon. the date stamp on the camera is 2 februari 2011 at 18:43hrs gmt+1 time. at 20:58 we were at the 'welcome to utah' billboard at monument valley. using google maps i estimate (using the travel time set at fixed legal speed) that the odd picture must have been snapped in the area of cameron, az. it is alongside the interstate 89 then we went to i-160 and i-163. the picture was snapped from inside the car with the windows up (closed). all other pictures do show some dirt spots from the windows but none that even come close to this oddity."],"Log Number":"US-10302011-0010","Date of the Event":"02/02/2011 09:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.741733,+-111.775645(32957)&iwloc=A&hl=en\"> mufon case (32957) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","Summary":"Odd object photographed going into canyon","files":["/var/www/straped/mufon/html2text/32957.html.txt","/var/www/straped/mufon/more/32957_submitter_file1__P1010565.JPG","/var/www/straped/mufon/org/32957.html"],"Object Shape":"Disc, Oval","Latitude":"41.741733","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Perry","There were no other sightings in Perry on or around February 2nd 2011","This sighting has never been favorited.",""],"Object Features":"Dome","Longitude":"-111.775645","Source":"MUFON","Country":"United States"}