{"City":"Lee's Summit","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Log Number":"US-10302011-0016","Object Features":"None, Unknown","Latitude":"38.909989","files":["/var/www/straped/mufon/html2text/32965.html.txt","/var/www/straped/mufon/more/32965_submitter_file1__Martinlightsoct32011.jpg","/var/www/straped/mufon/org/32965.html"],"Summary":"Small spheres of white light danced around trees in our back yard and into the woods","Longitude":"-94.339459","Object Flight Path":"Path with directional change","Weather Factors":"None","Country":"United States","divs":["Sighting DetailsAs reported to MO ASD by phone: \"I took the dog outside the back of the house and waited for him on the deck. I noticed a white light in the woods behind our house and watched it as it moved back and forth among the trees. I was looking SE. At first I thought it was a flashlight and someone was walking in the woods, but then two more white balls of light came in to view, and then two more, for a total of five. They moved around randomly, up and down, side to side, sometimes fast and sometimes slow. They just looked like balls of light that glowed all over. The lights were unwavering and although they were white, looked like a rainbow of color at times. One of them came out of the woods into my yard, only about 25 feet from where I was standing, and about 6' off the ground, hovered there for a minute, then went back into the woods with the others. I knew then that they were definitely not flashlights. The dog barked at the one light and chased it back into the woods. I called the dog back and he did come running back as if he was scared of something. He wined, too. I took him inside and locked the door but continued to watch through the sliding glass door. My wife was not home and she had the camera so I couldn't get any pictures. The balls of light stayed in the area for about 45 minutes then all at once they shot upwards into the sky and disappeared. I've never seen anything like this and was stunned. I am an engineer and have never seen anything like it and cannot explain this. I watched for another hour after and then went to bed without seeing anything else. When I talked to my wife in the morning after she got home from work (she is a nurse working nights)she said that she heard about something similar that her mother and aunt saw when they were kids. When I heard about the news reports of UFOS I thought this might be related somehow.\""],"Disposition":"Unknown","Date Submitted":"10/30/2011 02:51 UTC","Object Shape":"Sphere","Tags":"City","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.909989,+-94.339459(32965)&iwloc=A&hl=en\"> mufon case (32965) map </A>","Case Number":"32965","Source":"MUFON","trends":["There have been 52 other sightings in Lee's Summit","There were 14 other sightings in Lee's Summit on or around October 3rd 2011","This sighting has never been favorited.",""],"Date of the Event":"10/03/2011 11:45 UTC"}