{"Summary":"Balls of light chase our car while large craft hovers nearby","files":["/var/www/straped/mufon/html2text/32962.html.txt","/var/www/straped/mufon/org/32962.html"],"Object Features":"Unknown","Weather Factors":"None","Viewing Distance":"20 Feet or Less","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-10302011-0013","Date of the Event":"08/31/1979 05:30 UTC","trends":["There have been no other sightings in Harrisonville","This sighting has never been favorited."],"Object Flight Path":"Hovering then path","Case Number":"32962","Latitude":"38.653344","Tags":"City","Source":"MUFON","Longitude":"-94.348837","Region":"Missouri","Date Submitted":"10/30/2011 01:33 UTC","City":"Harrisonville","map":"<A HREF = \"http://maps.google.com/maps?q=38.653344,+-94.348837(32962)&iwloc=A&hl=en\"> mufon case (32962) map </A>","divs":["Sighting DetailsAs reported to MO ASD by phone - the witness would not leave any contact information for follow-up. This is an historical case. \"My husband and I were driving to work for the night shift at Bendix. We were driving on Highway 2 headed East towards Harrisonville, MO when we noticed a large disc shaped craft hovering over a field to our North. The craft had these small balls of bright white light around it - maybe 15 or so - and they would fly quickly away from the craft, go down to the ground or in the trees in different directions, then back to the large craft. They were dancing all around the large craft and it was very beautiful to look at. As we drove by the craft it started to move in the same direction we were headed. I knew it was a UFO and tried to get my husband to stop, but he refused and kept driving. He sped the car up to 70 MPH because he was scared. I wasn't scared, and yelled at them out of the window - saying hello and \"come here\" to them. Suddenly, about 12 of the white balls of light came down on either side of our car and followed along with us at the same rate of speed. They were all the same size - less than 12\" in diameter. Some were 50 feet away, and some were 10 feet away from the car. He was driving a 1978 Dodge Charger. I wanted to talk to them, but my husband kept telling me to shut up, and sped the car up to 120 MPH but the lights just kept up with us at the same speed! He was very afraid, but for some reason I wasn't. He wasn't talking at all except to tell me to be quiet. I felt like I knew the lights for some reason, and was happy to see them. I think that the lights are some type of aliens. The next thing we knew we were arriving at work and were 45 minutes late! I could not understand it because he was driving so fast we should have been early, but we were late. I don't remember seeing the large craft or the white lights go out of sight. Several years later I had some dental work done and had a wisdom tooth extracted. The dentist found something in my jaw that shouldn't have been there. He asked me if I had ever had any dental surgery and I said no, never. He said nothing showed up on the X-rays, but that there was this crystal tooth in my jaw, wrapped around my jaw and just under the gum next to my back wisdom tooth that was taken out that day. He was fascinated with it and wanted to keep it so I let him have it. The thing looked like a real tooth but was crystal. I was a little afraid of what it might be and didn't want it. Now I wish I had kept it because I found a magazine article that mentioned implants like the one I had that could be from an alien origin and some kind of tracking device. I have seen strange things several times in my life and believe that we are being visited by UFOs from other planets. My husband and I divorced 15 years ago, mostly because of that night and other strange things that he thought I was responsible for. I just had to tell someone what I saw because I can't talk to anyone I know about it. But it did happen and this is real."],"Object Shape":"Disc, Sphere"}