{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.063654,+-94.483318(32960)&iwloc=A&hl=en\"> mufon case (32960) map </A>","Tags":"City","Latitude":"39.063654","Region":"Missouri","Date of the Event":"10/04/2011 09:50 UTC","Viewing Distance":"101-500 Feet","trends":["There have been 134 other sightings in Kansas City","There were 9 other sightings in Kansas City on or around October 4th 2011"],"files":["/var/www/straped/mufon/html2text/32960.html.txt","/var/www/straped/mufon/org/32960.html"],"Object Flight Path":"Path with directional change,Path then hovering","Summary":"Huge diamond shaped craft with blue and white lights over 435 Hwy","Case Number":"32960","Weather Factors":"None","Disposition":"Unknown","divs":["Sighting DetailsAs reported to ASD by phone: (The witness wishes to remain anonymous) \"I was driving north on 435 Highway from Overland Park to Kansas City North on my way home from doing a video shoot for a commercial. I am a professional videographer and so is my wife, who was with me. As we came around the curve at the 470 interchange I noticed a large diamond shaped craft moving very slowly along my right side (east) approximately 1000 yards from the highway and approximately 500 feet in altitude. It was 9:50 P.M. at that time. The object had a continuous white light all over the exterior sides of the bottom of the craft, and another continuous blue light just inside that one. It was a beautiful medium blue color that I can't describe, and while the white and blue lights were very bright, they had a soft glow to them, too. The dark craft (I think Grey) reflected the lights. It appeared that the top of the craft was kind of domed in the same diamond shape, and the bottom was flat except for the lights. At first I thought it was some kind of blimp but soon realized it wasn't. I've never seen anything like it in 33 years! It continued along the same path for a few minutes until as I approached the I-70 exit the object stopped and hoovered for approximately 20 seconds. I was driving and told my wife to watch the object. She was getting very excited about it and watched it the entire time. I had to keep watching the road and slowed down to 50 mph so we could see it better, but there was no place to turn off. There were no clouds out and it was difficult to tell what the altitude was, but it was flying very low, too low in fact. A Commercial airliner flew over this craft headed SE to NW, but was flying at high altitude. Then, just as we passed the I-70 exit, the object turned to the west and headed that direction, again very slowly, and passed over the highway just as we went underneath it. My wife was saying oh my God, oh my God over and over again. We saw two cars in front of us slow down and it looked like they were watching it, too, but again, there was no safe place to pull over and at this point, I did not want to stop anyway for fear of what might happen. The car radio, which was OFF, made a crackling noise for a few seconds, then a burst of some type. My wife said \"what the _____ was that? She was trying frantically to get her cell phone camera to work when the phone went completely dead. She had the phone charged up fully before we left the house earlier before the video shoot, and only used it a couple of times so that battery should not have died! My camera was in the bag in the trunk and I couldn't get it. Then, just after the craft crossed the highway, maybe 100 yards past the highway, it took off at a very high rate of speed directly West towards Kansas. I'd guess that it was traveling at 750 MPH or more, at an instant without any time to accelerate like a normal airplane would. There were no features or lights on this craft that would indicate it was a common aircraft. It disappeared from view within five seconds! When we got home we called some friends to tell them what we saw, and they told us that they saw some strange white balls of light around their tree line at their house earlier in the evening and their neighbors saw them, too. A couple of days later I heard about all of the UFO sightings in the area on the news and decided to find out where to file a report. That is when I found the Missouri MUFON website and called. I am a pilot and my father is a pilot. He has his own Cessna Caravan 208B that I've flown with him in for years as a co-pilot from the time I was 14 years old. I can tell you that this object was no plane. If it was one of ours it was flying illegally without the proper warning lights and it was below 1,000 feet. I'd really like to know what it was!\" Due to my father's work and my work, I have to remain anonymous."],"City":"Kansas City","Object Shape":"Diamond","Longitude":"-94.483318","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"10/30/2011 12:34 UTC","Object Features":"Dome","Log Number":"US-10302011-0013"}