{"Latitude":"38.984328","Viewing Distance":"101-500 Feet","Source":"MUFON","Case Number":"32961","Country":"United States","Region":"Kansas","Date of the Event":"10/31/2010 10:30 UTC","Tags":"City","Disposition":"Unresolved","City":"Overland Park","Weather Factors":"Unknown","Summary":"Gigantic black triangle projected a beam over houses","Object Shape":"Triangle","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around October 31st 2010"],"files":["/var/www/straped/mufon/html2text/32961.html.txt","/var/www/straped/mufon/org/32961.html"],"Date Submitted":"10/30/2011 12:59 UTC","divs":["Sighting DetailsAs reported to MO ASD by phone (witness wished to remain anonymous and refused to leave contact information). She has no computer, only internet on her cell phone so did not want to file online. My number is the only one she could find. She has a second report for Missouri that I'm posting. \"I was headed home from work one evening in November of 2010. I was in Overland Park, Kansas. I turned on to Santa Fe road and headed East when I noticed a gigantic triangular craft hoovering over some large houses in a nice area off of Santa Fe and Pflumm Road. I was approximately six blocks from the object. The homes in this area are all very large. The craft was projecting a white beam of light over the houses, and the light was moving back and forth like it was scanning the area. I watched it as I drove and then the beam went back up, not suddenly, but slowly from the ground up to the craft. Then the craft started moving East in the same direction that I was driving, then it changed direction suddenly and headed South. It moved out of my sight behind trees. It was moving very slowly the entire time. The thing was that this object was gigantic - it was at least a mile wide if not more. I can't believe that other people did not see this and report it.\""],"Object Features":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.984328,+-94.668992(32961)&iwloc=A&hl=en\"> mufon case (32961) map </A>","Log Number":"US-10302011-0013","Object Flight Path":"Hovering then path","Longitude":"-94.668992"}