{"Summary":"Large A formation of white lights looked like a flock of white birds","Log Number":"US-10302011-0014","files":["/var/www/straped/mufon/html2text/32963.html.txt","/var/www/straped/mufon/org/32963.html"],"Case Number":"32963","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Latitude":"48.117655","Object Features":"Unknown","City":"Port Angeles","Region":"Washington","Object Shape":"Triangle, Other, Unknown","trends":["There have been 6 other sightings in Port Angeles","There were no other sightings in Port Angeles on or around October 29th 2011"],"Date Submitted":"10/30/2011 01:41 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"00:00:10","divs":["Sighting DetailsI went outside at 7:50 to have a cig the reason I am so specific on the time is because I called my husband after I sat down so I went back and checked my cell phone for the exact time. As soon as I sat down I called him and I was looking towards the south scanning the sky I am an avid star gazeri could only see a couple stars due to cloud cover wjen all of a sudden a large formation caught my eye gliding from the east towards the me I have a large fir tree that blocks my view to the east and as soon as it passed the tree I saw it I instantly told my husband to hold on and I dropped the phone and stred at this large letter a formation of what I thought at first must be white birds flying in formation but then I witnessed it fly perfectly still like a hang glider with no sound at all right over me the white lights stayed in perfect formation with equal distance between all lights as soon as it was to the right of me (west) it abruptly cganged shape into a line and then it looked like it was going to change into o diamond and then it was gone it just vanished I wasnt sure if it flew into the cloud bank or dissappeared. I picked the phone up and started to tell my husband about it I wanted to say it was birds but I knew it couldnt be I have lived here in port angeles my whole life and I am very familuer with canadian geese and ducks flyung in v formation and when they fly you can here them coming this object was so low and so close but there was no noise at all almost eeriely quiet. I have seen weird lights in this arwa vefore but I have never seen anything like this in my entire life. Also we are a very small town we dont have any bright city lights our tallest building is 3 stories tall and I live on a very dark block there were not any lights in the area that could have illuminated this if they were birds. I was very excited when I saw this I would say it was as high as a 7 story building and as large as a jumbo jet maybe five lights on each sidw of the v with 3 or 4 spanning across to form the letter a formation. The white lights looked like diamond shape and they weren't really bright like lights they looked more glowing. I was only able to witness this for about ten seconds before it disappeared. Please contact me if you have any questions. Thank you"],"Tags":"City","Date of the Event":"10/29/2011 07:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=48.117655,+-123.410834(32963)&iwloc=A&hl=en\"> mufon case (32963) map </A>","Country":"United States","Longitude":"-123.410834","Source":"MUFON"}