{"trends":["There has been one other sighting in Golden Valley","There were no other sightings in Golden Valley on or around February 5th 2005"],"Longitude":"-93.360003","Weather Factors":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.991715,+-93.360003(3296)&iwloc=A&hl=en\"> mufon case (3296) map </A>","Object Flight Path":"Undisclosed","City":"Golden Valley","divs":["sighting detailssighting report: i am a fi trainee reporting here a sighting my sister had on the evening of january 28th of this year. i apologize for any lack of data or other such shortcomings. i am new to investigations. my sister was driving south on highway 61 in hastings, mn en route to winona when she spotted a bright, oval shaped white light southeast of her position. there were scattered clouds and the moon was fully visible. this object appeared at approximately the 3-4 o clock position relative to the moon and my sister assumed that it was the light of an oncoming plane that she was seeing until it began to perfom some very remarkable movements. from its stationary position it rapidly decended vertically to near the horizon level and hovered. it seemed either to be wobbling or to be flashing lights, the clouds made it difficult to tell. the object then performed a sharp u-turn and reversed direction to head directly upwards approximately 1\\3 the distance it had initially decended, then stopped again. after a second or two the object shot off with incredible speed to the northeast before disappearing. she had managed to reach me by cell phone during the sighting and was obviously excited and seemed certain that she had seen no ordinary aircraft. unfortunately the object left the area before she was able to take pictures with the camera she had with her in her car (she was too busy giving me information over the phone). also of note is the fact that she saw a vehicle pulled over to the side of the road with a man and his child watching the object through binoculars. the lack of star visibility and absence of any other aircraft in the vicinity makes it more than likely that the man and his son were interested in the ufo. i plan to contact the local faa to see if i can get any more information. i will naturally supply any information forthcoming."],"Disposition":"Unknown","Latitude":"44.991715","Sighting Duration":"Undisclosed","Log Number":"","Country":"United States","Source":"MUFON","Date Submitted":"02/05/2005 09:46 UTC","files":["/var/www/straped/mufon/html2text/3296.html.txt","/var/www/straped/mufon/org/3296.html"],"Viewing Distance":"Unknown","Tags":"City","Object Shape":"Undisclosed","Case Number":"3296","Region":"Minnesota","Summary":"Not Provided","Date of the Event":"02/05/2005 09:46 UTC"}