{"files":["/var/www/straped/mufon/html2text/32967.html.txt","/var/www/straped/mufon/org/32967.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.443963,+-97.785367(32967)&iwloc=A&hl=en\"> mufon case (32967) map </A>","Country":"United States","Object Features":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Latitude":"32.443963","Source":"MUFON","City":"Granbury","Log Number":"US-10302011-0018","Summary":"My husband saw this first and then came to house insisting I come outside to look. This is my version. He doesn't wish to talk about the event.","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband went outside to grill steaks while I was watching World Series. About 3 minutes later, he came to the screen door, excited and insisted I come outside. We live on a ranch and I believed he had spotted a larger than average wild pig. I refused to get up from ball game. Husband continued to insist. I went out the front door and he asked me to come to the south side of our home. Then he pointed to the lights. There were 5 spaced out far enough that the object was obviously enormous. I'm thinking close to Football field in length. There were lights from my vantage point only on one side, the bottom of said object, front to back. This object was LOW in the sky. I asked my husband, \"what the Hell is that?\" and he replied, \"you tell me.\". Then he pointed out an airplane flying in the nightsky, stating \"that's a plane.\". Much much smaller, lights were different, speed was faster. I also noticed the planet VENUS to the East. Object flew from Nprtheast to Southwest. I watched it for 3 minutes until it \"glided\" beyond my vision. It was silent. Made absolutely zero noise. I was truly puzzled watching this object attempting to figure out what it was. We are fairly intelligent people, husband has flying experience. Could not see the shape clearly but trust me, it was large. It was not a balloon. Husband just wishes to forget the whole thing. I never felt afraid, threatened or scared. Was just really trying my best to figure it out but it never made any sense. For the size it should have made noise. The positions of the lights made no sense. The lights also blinked in two different rhythms."],"Date of the Event":"10/24/2011 08:00 UTC","Tags":"City","trends":["There have been 11 other sightings in Granbury","There were no other sightings in Granbury on or around October 24th 2011"],"Date Submitted":"10/30/2011 04:31 UTC","Object Shape":"Square, Rectagular","Region":"Texas","Longitude":"-97.785367","Case Number":"32967"}