{"Tags":"City","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 23rd 2011"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting on a flight from SFO and was 5 min out from LA about 8:30PM. Out of the window, I watched a line of planes flying North, one after another. They all had blinking lights and moved smoothly. Then I realized one plane was different. It was sort of bouncing, like a stone across water, but at same speed as normal plane. I though perhaps it was in trouble. Seconds later it shot nearly straight up like a rocket, then quickly moved north, down again, and then south. Once it shot up all its motion was extremely fast. The cloud cover over LA was very heavy, and this all occurred above the cloud layer, so it was definitely a craft and not a toy or balloon. My plane landed 5 min later. The object looked just like a lighted distant plane initially and I saw no details. I lost sight of the object when it moved south..not sure what happened. We began to descend through the cloud layer and the object had moved so quickly it was difficult to track. I was surprised and wondered if it had taken some sort of evasive action."],"Latitude":"34.059074","Source":"MUFON","Country":"United States","Longitude":"-118.235735","City":"Los Angeles","Date Submitted":"10/30/2011 06:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.059074,+-118.235735(32969)&iwloc=A&hl=en\"> mufon case (32969) map </A>","Region":"California","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Date of the Event":"10/23/2011 08:30 UTC","Object Features":"Unknown","Log Number":"US-10302011-0020","Case Number":"32969","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/32969.html.txt","/var/www/straped/mufon/org/32969.html"],"Summary":"Strange behavior of object that first appeared to be plane, above cloud near LA."}