{"Longitude":"-165.406389","Case Number":"32964","Log Number":"US-10302011-0015","divs":["Sighting Details We observed the star-like object in the western night sky for several hours. We first sighted the object around 2:30 am while looking at the auroras. The night sky was cold and clear. The object caught our eye because of the rapid directional movement in many directions although seeming to follow at northerly direction. However it did backtrack, made turns, changed directions, all at extreme high speeds. At times, it seemed to be following a pattern. There is no doubt it was a under control flight pattern. The controlled pattern was like a helicopter but at light speed. No helicopter I know of can travel in outer space and at that speed. We were amazed at the speed of movement, directional changes, and the apparent controlled pattern. The pattern was randomly changed but still in a northerly direction, like as on a mapping line. The size seemed much larger than a satellite and never traveled a path as we have seen before. Also, the length of time, 3-4 hours, we were able to observe this was amazing. This was not a brief sighting. The time frame was like watching a video. We are in a location where there are many international flight patterns and this was not one of them. No resembelence at all. We live remotely, well beyond any city lights. We never lost sight of the object, we went to bed with it still heading north. We will be watching to see if this repeats."],"Object Features":"Unknown","Summary":"Star like object observe moving beyond atmosphere, changing dirction rapidly at high speed. Defintly was under control, n-ne direction, backtracking at times.","Date Submitted":"10/30/2011 02:51 UTC","Source":"MUFON","City":"Nome","Latitude":"64.501111","Country":"United States","Tags":"City","Sighting Duration":"04:00:00","trends":["There has been one other sighting in Nome","There were no other sightings in Nome on or around October 30th 2011"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=64.501111,+-165.406389(32964)&iwloc=A&hl=en\"> mufon case (32964) map </A>","Date of the Event":"10/30/2011 02:30 UTC","files":["/var/www/straped/mufon/html2text/32964.html.txt","/var/www/straped/mufon/org/32964.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Alaska","Viewing Distance":"Unknown"}