{"map":"<A HREF = \"http://maps.google.com/maps?q=38.856094,+-77.298693(32972)&iwloc=A&hl=en\"> mufon case (32972) map </A>","City":"Fairfax","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-77.298693","trends":["There have been 14 other sightings in Fairfax","There were no other sightings in Fairfax on or around November 10th 2007"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/32972.html.txt","/var/www/straped/mufon/org/32972.html"],"Object Shape":"Cross, Triangle","Summary":"UFO took off, activated headlight beams, performed helix maneuver, rushed at us then slowly hovered overhead for less than one minute before zipping into the sky at unimaginable speeds.","Latitude":"38.856094","Date of the Event":"11/10/2007 04:00 UTC","Tags":"City","Country":"United States","divs":["Sighting Details1. Me and my friend were walking to 711, taking a shortcut through the Mantua woods in Fairfax, Virginia. 2. As me and my friend were crossing a steel walk-bridge over a stream in the woods, I noticed, out of the corner of my eye, some light lift up off the ground in front of us. We were no where near it at the time, but could see through the woods to what looked like a large parking lot with a lot of light posts that had orange glows to them. The parking lot was near a building, both of which were probably around a mile or less away. The visibility was good, even though it was completely dark. It was around 4 pm in the Fall so it was like night time. There was no rain or clouds. 3. So when I saw the light come up off of the parking lot, my first instinct told me it must be a helicopter because the light slowly ascended from the ground to around 500 feet or less in the air, and hovered for a few seconds. At this time me and my friend had both seen what had happened so far and were both observing the object. 4. All of a sudden, something like \"headlights\" came on, and the two beams of light looked a lot like powerful landing lights for a big airplane. The lights, or beams that looked like headlights, had very distinguishable outlines to the beams of lights. As in, the \"headlights\" were very focused. The reason we could distinguish them as headlights is because they were so focused, and it almost looked like the flying car from the Harry Potter movie flying through the fog with its lights on. So at this point the object is hovering and the headlights came on, and the headlights were pointing to my 4 o'clock or so. All of a sudden, the object made an extremely quick helix-like maneuver towards the treeline. The shape or turnings of the maneuver were evident because the headlights were still on. If it was not for these headlights, I would not have been able to tell there was a S-like, or helix-like maneuver. It happened very quickly, from a standstill, and all of a sudden the object seemed to be heading right for us, extremely fast, over the tree line. The next thing I know, I'm staring straight up at what seemed to be a slowly hovering object with three bright whitish-yellow round lights in a perfectly triangular shape. I have near-sided vision, about -2 in each eye, and since the lights were so bright, I could not determine the shape of the craft itself. However, my friend who was with me, has better vision, and said that the object was a \"cross\" shape, with the three lights in a triangle formation. This \"cross\" shape lead him to believe it was some sort of secret military stealth helicopter. This object made absolutely no sound whatsoever, which was the most frightening aspect of all, because even though I couldn't determine the objects shape or size because of my vision, I could tell, or just had the feeling that, this object was huge - immense, in fact. We could even hear the sound of the water flowing gently down stream below us, and the noise of cars on the highway in the distance, even though we were witnessing this strange UFO. At the time when the object was hovering straight over us, we were still at the end of the steel walk bridge, which hand thick railings, and I recall my friend saying \"run!\" but I said, \"no, hide!\" and I grabbed him and we hid under the steel railing while it hovered overhead. The object hovered over us, moving very slowly past us, for probably around 30 seconds or more. Then, in a flash, it changed trajectories and flew into the sky at a 45 degree angle or so, at unimaginable speed. I mean, it went from ascending from the ground, performing a helix-like maneuver, going very fast in our direction, hover over us quite slowly, and then accelerating at ridiculous speeds into the sky. 5. I was extremely scared and frightened. At the moment we hid under the railing and my friend wanted to run, a thought ran through my head: that whatever the thing in the sky was, it knew we were there, and that running would only give cause for suspicion. Also the thought ran through my head, that even in the dark of night running would be hopeless because they must have some sort of infrared vision to detect us or something. I just wanted to hide. So we did. It all happened so fast, or at least it felt that way. I barely talk about it because people I tell think i'm crazy or making it up. Sometimes, thinking back on it, I wonder if anything else may have happened that I have no memory of. 6. We lost sight of the object after it changed directions after hovering over us over the steel bridge, when it shot up into the sky at around a 45 degree angle, accelerating at speeds at which no aircraft known to me can do, especially without making any noise."],"Log Number":"US-10302011-0023","Sighting Duration":"00:01:30","Case Number":"32972","Region":"Virginia","Date Submitted":"10/30/2011 10:25 UTC","Source":"MUFON","Object Features":"Unknown"}