{"Log Number":"","files":["/var/www/straped/mufon/html2text/3297.html.txt","/var/www/straped/mufon/org/3297.html"],"Case Number":"3297","Region":"Mississippi","Object Features":"Undisclosed","Date Submitted":"11/30/1987 07:37 UTC","trends":["There have been 4 other sightings in Ocean Springs","There were no other sightings in Ocean Springs on or around November 30th 1987"],"Viewing Distance":"Unknown","Tags":"City","Country":"United States","Longitude":"-88.827806","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.41131,+-88.827806(3297)&iwloc=A&hl=en\"> mufon case (3297) map </A>","divs":["Sighting DetailsSighting Report: I was at home one afternoon in the spring of 1988 in Mendenhall, MS. I lived on a farm so there was quite a bit of open space so I could see for good distances. It was a beautiful day and the sun was just beginning to go down. I decided to go outside to enjoy the sunset that day. When I walked outside the sun was going down just to my right. I watched for a few minutes then I happened to look off to my left. About 1000 feet away to my left was the beginning of my aunt92s property. Just across the fence that separated our property was her feed mill which stood about the height of a two story house. The closest thing to the feed mill was a tree which was about 3-400 feet to the left of the feed mill. I don=92t know why I looked over there but when I did, I saw a beautiful light orange ball between the feed mill and the tree. My very first thought was it was the moon, then I quickly realized it could not been the moon. It was very beautiful, one of the prettiest oranges I=92ve ever seen. It did not take me long to realize that the ball was actually hovering between the tree and the feed mill. I knew that this was something very strange and something I would remember the rest of my life. I watched it for a few minutes, then started thinking I may be crazy for thinking it might be a UFO. I looked back at the sunset just for a moment. I remember feeling as though I were being watched. When I looked back at the orange ball, it was gone. I did not tell anyone for years. I finally told my cousin, who lives in the same area. He told me about similar experiences. The difference is that the orange ball chased a man to his truck, in one of the stories."],"Weather Factors":"Unknown","Date of the Event":"11/30/1987 07:37 UTC","Disposition":"Insufficient Data","City":"Ocean Springs","Summary":"Not Provided","Object Shape":"Undisclosed","Latitude":"30.41131","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed"}