{"City":"Philadelphia","Weather Factors":"Unknown","Log Number":"US-10312011-0001","Object Flight Path":"Straight-line path","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.960275,+-75.156979(32978)&iwloc=A&hl=en\"> mufon case (32978) map </A>","files":["/var/www/straped/mufon/html2text/32978.html.txt","/var/www/straped/mufon/org/32978.html"],"Latitude":"39.960275","Region":"Pennsylvania","Disposition":"Unresolved","Source":"MUFON","Longitude":"-75.156979","Date of the Event":"08/23/2008 12:00 UTC","Summary":"huge low desending orange what looked to be flame ball","Case Number":"32978","Object Features":"Undisclosed","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around August 23rd 2008"],"Tags":"City","divs":["Sighting DetailsI just watched your show on bucks county ufo sightings and I didnt know there where other sightings the same time as mine. I was traveling south on rt. 13 at 1230am one night in august 2008 I dont remember exact date, as I was just about to pass station ave. ,a huge bright orange ball passed from west to east decending less than 500 ft in front of me and what looked to be just over the roof tops of the homes to my left,I only held visual contact for 1 to 2 seconds I stoped on the road right where it passed over but I couldnt see it anymore, I looked for other cars to see if someone else seen it but there where no cars on the road but me.since I had seen it what kept running through my mind was that when that big thing hit the ground there was going to be a big explosion or that it would fall into one of the apartment complexes on station ave.I waited for a few mins with my cell phone in hand to call 911 if it did crash into something.since it was summer I had my windows down and there was no noise when it passed by ,it looked like a huge fire ball with no trailing flames,and when I got tired of waiting to hear or see something I figured that what ever it was must have crashed in the delaware river and thats why I didnt hear or see the crash.fast forward to your show when I seen the map with all the sightings there where the shapes of the sightings on the map and one symbol was flames and in the recreation you did with the 2 ufos in the picture I got the chills when I seen the bright orange ball following behind the other ship. DID ANYONE ELSE SEE THAT BIG ORANGE FLAME BALL IN BUCKS COUNTY??????? this would answer alot of questions for and raise a bunch of new ones please let me know and feel free to contact me with any addtional questions"],"Date Submitted":"10/31/2011 12:06 UTC","Viewing Distance":"101-500 Feet"}