{"Log Number":"US-10312011-0005","Sighting Duration":"Undisclosed","Object Shape":"Disc","City":"Somerville","Country":"United States","Object Flight Path":"Stationary","Weather Factors":"Unknown","Region":"Texas","Object Features":"Dome","Case Number":"32982","divs":["Sighting DetailsI'm a touring musician. We were leaving a show in Somerville, TX at approx. 2:00-3:30AM on April 31st. My singer was driving the RV, both of our techs were sitting up front as well as me. There was nobody on the road and there was nothing but flat land on all sides. We saw a flashing blue light off in the distance. We all thought it was a water tower, and I even joked about it being a UFO. As we get closer, you could see flashing lights were underneath the object and it wasn't attached to anything, it was in actuality hovering above the street. As we got closer, we're all freaking out trying to describe what we were seeing as it was happening, and before I realized how close we were, we passed directly underneath it. The windshield in the RV was angled maybe 60-65 degrees, so I quickly got a glance underneath the object and saw multiple flashing lights. We get a couple of minutes down the street (on a 55 mph road mind you, so a couple of miles at least), when the driver looks in the side view and exclaims that it is right behind us. I tried to look but I couldn't get his angle on the mirror, and then a couple seconds later he exclaims that the lights were way off in the distance again. Out of the 4 of us up front, no one contests against it being a UFO. Following that, I believe I was abducted in Missoula MT around 3:00-4:00AM, October 3rd 2011, led to believe by a strange dream, a missing memory and a strange comment by my guitar player the next day that didn't add up to the series of events from the night before. We had a day off and stopped in Missoula on our way to Billings Montana. we had a BBQ with all the other bands. I was the last one awake. We gave the opening band our hotel room cause we have a bus, so I walked them to their room, hung out for 5 minutes then walked back to the bus. I got to the bus, put some sound isolation headphones on and listened to an album, realized as soon as the album had ended that I had nodded off for approximately 15-20 minutes. I got up, put my headphones in my bunk and proceeded to my bunk for bed. I woke up the next day feeling super horrible all day up until the night. My guitar player during the next day mentioned something about seeing me in the front lounge passed out and that he was going to draw on my face but couldn't find his sharpee. I thought it was weird he had said that because I knew I would have easily been stirred by movement on the bus. I didn't think anything of this comment until 2 weeks later, I was at home and I'm not fully asleep, but dreaming none-the-less. I was conscious enough to know where I was and comprehend that I was dreaming. In this horribly vivid dream, I see this red flashing dot in the center of my vision. My brain is trying to recall an incident that happened sometime on tour after a cookout (which we had 2), and any time I try to find this lost memory, I hear this loud ringing noise slowly get louder and louder with the harder I try to think, and these gray figures with big heads faintly appear in my vision around the red flashing dot. In the ringing noise I heard static, which almost sounded like a transmission with indestinguishable voices in the background. As I try and recall, the ringing gets louder and starts to physically hurt me. I try to kick my girlfriend and say her name to wake me up but sleep paralysis sets in and prevents me. I finally snap out and she wakes up to my deep loud gasp. As I smoke a cigarette outside my room, I start thinking about the dream and trying to figure out what I was seeing. I recall what my guitarist said about the sharpee incident. I texted him the next day and ask him, \"was I wearing headphones when you saw me that night when you were going to draw on my face?\" he responded \"no, I didn't see anything on your head.\" I was wearing very big noticeable headphones, and I only nodded off for a very short period of time. After removing the headphones, I immediately got in my bunk. 1) I would have noticed him walk in the front lounge, because I was facing the direction he would have come from. 2) I was wearing giant headphones which he claims to have not seen on my head 3) Everyone had been asleep for at least an hour or 2 when I entered the bus 4) the next day I felt drained as if I had been in bed for a month straight without moving, I've never felt that exhausted without being sick as well. I highly believe I was abducted and would like to receive repressive hypnotherapy to justify this because this belief is starting to make ME feel like I am crazy. I would like to see if there is more memory from that night that is missing."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.346043,+-96.528302(32982)&iwloc=A&hl=en\"> mufon case (32982) map </A>","Source":"MUFON","Date Submitted":"10/31/2011 01:18 UTC","Latitude":"30.346043","Date of the Event":"Unknown","Summary":"Passed directly underneath UFO on empty highway, less that 60-70 feet in air, belief of abduction months later","Tags":"City","Viewing Distance":"20 Feet or Less","Disposition":"Unknown","trends":["There have been no other sightings in Somerville","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/32982.html.txt","/var/www/straped/mufon/org/32982.html"],"Longitude":"-96.528302"}