{"Summary":"Looks like a star but it moves, will change colors like lights on a christmas tree. Then there is a large one solid white that looks like star.","Country":"United States","files":["/var/www/straped/mufon/html2text/32986.html.txt","/var/www/straped/mufon/org/32986.html"],"Region":"Georgia","Object Features":"Unknown","Tags":"City","Case Number":"32986","Longitude":"-82.910951","Latitude":"32.04409","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in McRae","This sighting has never been favorited."],"Date of the Event":"06/01/2011 12:00 UTC","Log Number":"US-10312011-0009","divs":["Sighting DetailsSince the beginning of June everynight I have seen these objects that look like stars that move but only back an forth or up and down but stationary. As of today they are still there. There are a couple of them that move coming from the end of property up towards my house then it would stay there like it was trying to be a star. Then there is a larger one that hangs over a tree behind my house that moves back and forth like it is studying something. I just want someone to tell me I am not crazy. My children and a couple of friends have seen it also. I just want to know what it is. Can you please help me. I go outside everynight to see if they are there and they are there. They are not close enough to get a picture of at least not with anything I have. I am genuinely scared and just want someone to validate what I am seeing is real and tell me what it is, please. I have looked at it thru binoculars but then it just looks like distorted lights that are different colors on one and to bright to look at on the other. Then as it gets daylight they disappear."],"City":"McRae","Source":"MUFON","Weather Factors":"None","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Object Shape":"Sphere, Star-like, Triangle","Date Submitted":"10/31/2011 01:35 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.04409,+-82.910951(32986)&iwloc=A&hl=en\"> mufon case (32986) map </A>"}