{"trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around September 2nd 2010"],"Object Features":"Other","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-10312011-0010","map":"<A HREF = \"http://maps.google.com/maps?q=30.305282,+-97.936441(32987)&iwloc=A&hl=en\"> mufon case (32987) map </A>","files":["/var/www/straped/mufon/html2text/32987.html.txt","/var/www/straped/mufon/org/32987.html"],"Sighting Duration":"Undisclosed","Object Shape":"Other","Date Submitted":"10/31/2011 01:50 UTC","Region":"Texas","divs":["sighting detailsfour friends where visiting me in northern california at my house in gold mountain. we had just finished a hike to eureka peak and where unwinding with a glass of wine before dinner. we where on the posterior deck of my house overlooking the feather river canyon. the sky was mildly foggy\\hazy. we where partaking in conversation when i noticed a hovering, red \"string-like\" thing approximately 200 yds in the air over the canyon which seamed to fade in and out and hover up and down. it then climbed and accelerated at a great speed and disappeared. about 10 seconds later, it returned and hovered again. we observed it for a few more minutes and then it,once again disappeared vertically upward at a great speed and disappeared. we all agreed at what we saw, but being intelligent and intellectual people, we decided that we would keep it betwixt ourselves, especially since we all had a glass of wine or two. a year later, i mentioned the incident with 3 of the friends and they all agreed it did happen, but did not want to pursue it further."],"Date of the Event":"09/02/2010 12:00 UTC","City":"Austin","Case Number":"32987","Country":"United States","Disposition":"Unresolved","Longitude":"-97.936441","Source":"MUFON","Tags":"City","Latitude":"30.305282","Object Flight Path":"Hovering then path","Summary":"Was on deck after hike in sierras with 4 friends ( we all saw it). A red string like lite hovered in a foggy/hazy sky for 5 minutes and then shot up at a fast speed. Then returned and hovered again for a few minutes. We had been drinking wine, but all saw"}