{"Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Object Features":"Undisclosed","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.951705,+-92.334072(3298)&iwloc=A&hl=en\"> mufon case (3298) map </A>","divs":["sighting detailssighting report: date and time: approximately 4:50 am fri. 3\\18\\2005 columbia, mo, west side of town around 1500 west, 500 south on city street grid. weather conditions: about 40 degrees f, clear skys. i was driving inside a residential neighborhood in the city and noticed an unusually bright light very low, tree top level almost, estimate about 1\\2 mile away. the light was the color of the orange street lights (sodium?) but brighter than a street light. it was moving very slowly northward. after a few minutes my route turned me east toward the light. i saw it again, still low and slow and moving northward, for a short period. this time i noticed several smaller and dimmer lights in a horizontal row behind the bright light, also of the same orange color. i did not notice a blinking red light or any other lights that i would expect to see on an airplane or helicopter. the lights moved out of view and i never saw them again. i noticed no sound, although i probably was too far away to hear if there was sound. i would guess that this was a helicopter. hospitals in the area have helicopter ambulances. however, it still was like nothing that i have seen before. submitted in case this description correlates with something else that has been reported."],"Source":"MUFON","Date Submitted":"03/19/2005 01:56 UTC","Object Shape":"Undisclosed","Summary":"Not Provided","Latitude":"38.951705","files":["/var/www/straped/mufon/html2text/3298.html.txt","/var/www/straped/mufon/org/3298.html"],"City":"Columbia","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around March 19th 2005"],"Viewing Distance":"Unknown","Log Number":"","Case Number":"3298","Disposition":"Insufficient Data","Date of the Event":"03/19/2005 01:56 UTC","Longitude":"-92.334072","Weather Factors":"Unknown","Object Flight Path":"Undisclosed"}