{"divs":["Sighting DetailsMy wife and I were walking out our front door to go to a Lamaze class. The front door of our home faces north. My wife said \"what is that it looks like it is on fire\". She pointed over the rooftop across the street and off in the distance on the horizon. I observed an object that was similar in size to a helicopter that was hovering due north of our location about 500 feet above the ground. The object had what appeared to be red flare droplets falling from the underside and this was what caught our eyes. My wife asked if it was on fire and might crash. The vehicle hovered in the same spot for about 30 seconds and then drifted slowly to the northeast. As it drifted it tilted with the top showing that it was a sphere shaped object. The vehicle remained at this location for about 1 minute and then tilted back flat and the bottom side was red like a flare color. The vehicle drifted to the east and came lower to the ground over the roofs to the east in the horizon. As it got due east it simply sped off and vanished to the east in a flash. I was a Mesa Police Officer and reported it at work that night. I am stll a sworn investigator today. I reported this to the UFO Bureau at Davis Monthan aft the next day. My wife was in nursing school . The next week my wife was in class and learned that the mother of a fellow student had seen the same incident. I heard this was reported to Chandler Pd. I later learned that one of my friends wife had also seen this object the same night. I am not positive of the date but this was between 1 to two months prior to my oldest son being born. I also saw a 60 minutes UFO sighting report about a Roswell new Mexico cop seeing the same thing in his area around the same time. It was never reported on the news at that time. This occurred over a city area near the Chandler -Mesa border."],"files":["/var/www/straped/mufon/html2text/32983.html.txt","/var/www/straped/mufon/org/32983.html"],"Sighting Duration":"Undisclosed","City":"Chandler","Case Number":"32983","Log Number":"US-10312011-0006","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Summary":"My wife and I were both walking to our car and observed an object floating to the north. Viewed two min. out one mile away. The vehicle appeared to be on fire on the underside. The vehicle was almost transparent and round on the top","Region":"Arizona","Tags":"City","Source":"MUFON","Country":"United States","Longitude":"-111.864576","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around December 7th 1981"],"Viewing Distance":"Over One Mile","Object Shape":"Sphere, Other","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.330395,+-111.864576(32983)&iwloc=A&hl=en\"> mufon case (32983) map </A>","Date Submitted":"10/31/2011 01:21 UTC","Latitude":"33.330395","Weather Factors":"Unknown","Date of the Event":"12/07/1981 12:00 UTC"}