{"Log Number":"US-10312011-0008","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Tags":"City","Summary":"Pulsing sun-like object hovered, approached and then loss of memory","Country":"United States","trends":["There have been no other sightings in Mindoro","This sighting has been favorited 1 time."],"Source":"MUFON","Date Submitted":"10/31/2011 01:35 UTC","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/32985.html.txt","/var/www/straped/mufon/org/32985.html"],"divs":["Sighting DetailsI just want to report this in case anyone who reads this has had a similar experience and wants to know if anyone else has. I don't care if anyone thinks this is bogus or not, I finally feel it is necessary to at least tell someone else about this. I was only 9 at the time, keep that in mind. I realize time and memory affect the ability to report events, but this memory has not changed. It was early evening. I was with my parents and sibling, preparing to leave our grandparent's place. I pointed at this object, and said something about the Sun being in a funny place. My mom looked and said that is not the Sun it is right over there. The object approached and that is the last thing I remember before \"coming around\" in our pick-up truck, speeding away trying to get away, hearing my mom telling my dad to go keep going and get the hell out of here. The object was chasing us and I don't remember getting away, just that the next thing you know, everything is back to normal and we're driving home after having been trying to get away in the opposite direction. No one in my family will even talk about it. I think that's why I want to finally report this to someone, to get it off my chest. The object really looked like the Sun in the sky, except in the totally wrong place. And then it started wobbling and markedly pulsating, and then it began to approach. At that point I blacked out. Trying to get away is the most vivid part of my memory, and the panicky fear that even my parents exhibited. My dad drove like mad, the engine was practically howling he had the gas pedal pegged to the floor. And then bam! Nothing, everything right back to normal, driving in the opposite direction we headed to try and escape from this bizarre event. I don't like remembering this, and that may also be another reason I am reporting this event. The lost time really, really bothers me. I'm not claiming abduction or after effects. I am just relaying information on an event whose memory has bothered me for 3 decades plus. Do with it whatever you will, I feel a little better finally getting it out to someone who just might listen."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.021111,+-91.101667(32985)&iwloc=A&hl=en\"> mufon case (32985) map </A>","City":"Mindoro","Disposition":"Insufficient Data","Region":"Wisconsin","Date of the Event":"06/15/1980 12:00 UTC","Weather Factors":"Unknown","Object Features":"None, Unknown","Case Number":"32985","Viewing Distance":"Unknown","Longitude":"-91.101667","Latitude":"44.021111"}