{"Case Number":"32980","divs":["Sighting DetailsHot night, clear sky, I was laying on a cellar door on the east side of the house. Out in the country, twenty miles from the nearest town, a couple of miles from the nearest neighbor. I slept in the attic and it was too hot to get into bed before 11 or midnight. A shooting star seemed to be going across the sky when it came to a stop in the southeast sky at about 45 degrees from me. Absolutely quiet, not a sound, and no other lights. As I watched in amazement, another \"star\" came from a different direction and joined the first to become one light. And then a third came from another direction and joined the others and it was just one light afterwards. Then,it was like it went up into the air and out of sight in less than 10 seconds. It was gone with no sign of exhaust, fire or any kind of a trail. Just like a shooting star going up and out of sight. I never told anyone until lately because I thought they would think I was crazy or dreaming. I was about 14 at the time. I put 1958 but it could have been 1960. I wasn't out there in 59. Probably too late and nobody else can verify but at least I hope you can find some value in my account. It is true to the best of my memory. I don't think this was anywhere close to the ground but I don't know how high it was. Probably hundreds or thousands of feet, it didn't seem to be very close."],"Tags":"City","files":["/var/www/straped/mufon/html2text/32980.html.txt","/var/www/straped/mufon/org/32980.html"],"Date of the Event":"07/12/1958 12:00 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.975325,+-99.895093(32980)&iwloc=A&hl=en\"> mufon case (32980) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Summary":"3 shooting star like objects that came together from different directions and left as a single star","Latitude":"43.975325","Date Submitted":"10/31/2011 12:26 UTC","trends":[],"Longitude":"-99.895093","Object Flight Path":"Path with directional change,Path then hovering","Region":"South Dakota","Source":"MUFON","Object Shape":"Star-like","City":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","Log Number":"US-10312011-0003"}