{"Longitude":"-95.990758","Sighting Duration":"Undisclosed","Latitude":"41.261933","map":"<A HREF = \"http://maps.google.com/maps?q=41.261933,+-95.990758(3299)&iwloc=A&hl=en\"> mufon case (3299) map </A>","files":["/var/www/straped/mufon/html2text/3299.html.txt","/var/www/straped/mufon/org/3299.html"],"City":"Omaha","Disposition":"Unknown","Country":"United States","Tags":"City","Region":"Nebraska","Source":"MUFON","Weather Factors":"None","Summary":"Not Provided","Object Flight Path":"Straight-line path","Date of the Event":"03/02/2005 01:00 UTC","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around March 2nd 2005"],"Case Number":"3299","Object Shape":"Other","divs":["Sighting DetailsSighting Report: I am a polce officer. I was about a half mile outside of my patrol area in a wide open field away from residential and commercial areas. I went there to urinate without anyone seeing me. It was 0100 hrs on 3-2-05. The sky was very clear, no clouds, and many stars visable. The moon was in the south east sky, low and very yellow. as I stood just outside my patrol car, I had my head on a swivel just to make sure I was not being watched (I have jailed people for doing what I was doing) I was standing by a cell phone tower, about 100 ft tall. Something caught my eye in the sky. It was a milky gray color and moving directly overhead. It was about 150-200ft up. It traveled over me with no sound at all, and no lights. It was concealed very well as the color of the objest matched the sky very closely, it was not black, but kind of deep gray and blended very well with the sky that was sort of white washed by city lights. As it traveled north west over head at about 25mph, it slowly blended with the color of the night sky, but I could tell it was still there because the stars were disapearing as it passed. It was not that big, maybe the size of a bus, and had an odd shape. It instantly reminded me of the Galla kite I had when I as a kid. All I could do was stare at it, and try to figure it out. I sat on a long stretch of highway running radar the rest of the night trying to see it again, but I never did. The shape was very odd. It seemed to have some sort of cabel or tube dangling from it, similar to the huge planes that refuel jets in mid air. It was close enough to me that it would have been heard if it was a plane. As I drew it on paper, it looked more like a snail, with a long tube dangling underneath. Sorry no photos, and I now understand why there are not more photos of sightings. I spent all the time I could have been taking pictures, trying to filter my brain to identify the object. Before you can get to a camera, the thing is gone. I now underatand that people that see UFOs do not immediately want them to be UFO s, but they instinctively try to make it familiar, and when it is realized that it is not, it s too late. Don t know what it was."],"Viewing Distance":"101-500 Feet","Object Features":"Appendage(s)","Date Submitted":"03/02/2005 01:00 UTC","Log Number":""}