{"Region":"Maryland","Date of the Event":"10/28/2011 06:30 UTC","files":["/var/www/straped/mufon/html2text/33006.html.txt","/var/www/straped/mufon/org/33006.html"],"Sighting Duration":"00:10:00","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Shape":"Cigar, Fireball, Sphere, Star-like","Viewing Distance":"21-100 Feet","Latitude":"39.299485","Tags":"City","Disposition":"Unresolved","Log Number":"US-10312011-0026","Weather Factors":"Unknown","Date Submitted":"10/31/2011 02:52 UTC","Summary":"I was on 95 s around 6:30 am, saw i bright orb to my left. orb was moving in a","Longitude":"-76.610989","map":"<A HREF = \"http://maps.google.com/maps?q=39.299485,+-76.610989(33006)&iwloc=A&hl=en\"> mufon case (33006) map </A>","Source":"MUFON","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around October 28th 2011"],"Country":"United States","City":"Baltimore","Case Number":"33006","Object Features":"Unknown","divs":["sighting detailsi was on 95s around 6:30 am on 10\\28\\11. just leaving baltimore city i was on 95s for about 8 minutes. i looked left out my window and saw a bright orangish-white orb makiing strange movments. it was moving in a \"z\" pattern. the orb then just stoped and hovered for about a minute. then suddenely the orb just droped out of the sky straight down in an amazing speed. it droped all the way below the tree lines on the state park to my left. i could not see where it went next. around a minute later i saw a strange \"cigar\" shape object cross directly in front of me on 95s coming from the same direction the orb dropped. at first i though it was just a plane because bwi airport is near the location. but just when i though it was just an airplane the object suddenely either turned into or turned on some kind of light switch that lit up the whole object. it was so bright i had to turn away for a second. the crazy thing was when i looked up again i no longer saw the cigar shaped object but saw a bright orange orb in its place. as i watched in aw as the object flew out of sight like a light switch was flicked again the orange orb went out and in its place was the cigar-plane like object again. i was speechless....."]}