{"map":"<A HREF = \"http://maps.google.com/maps?q=30.303574,+-97.716046(33010)&iwloc=A&hl=en\"> mufon case (33010) map </A>","Object Shape":"Fireball","Viewing Distance":"Unknown","Tags":"City","Longitude":"-97.716046","Date Submitted":"10/31/2011 06:07 UTC","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around September 8th 2011"],"Summary":"A bright green light flying across the night sky","Date of the Event":"09/08/2011 04:30 UTC","Latitude":"30.303574","divs":["Sighting DetailsThe following event took place sometime during mid-September or towards the beginning (I apologize for not documenting this information sooner for records). It was in the early morning around 4 or 4:30am CT and I had left my apartment to pick up food. As I got to the stoplight at the cross section of 45th st. and Airport blvd, I used this time to look up at the sky to just observe I guess. Then I saw an object that I couldn't identify, which caused me to become quite startled and confused because this was the first time this has happened to me. I leaned forward in my seat to look up through my windshield and noticed it was traveling at a pretty fast speed towards the distance in front of me. I couldn't make much of what I was witnessing, but a few of the valid observations I could make was that it was of a vivid bright glowing green color and traveled to the direction in front of me. At first glance I thought it could have been a firework due to the color of the object, but ruled that out because of the size of the object and its flight pattern. Then I thought it could have been a weapon of some sort like a bomb or missile because it almost appeared as if it was flying and descending into the distance, but from my position I witnessed no supporting evidence of impact or landing. It flew at a fast speed and remained in sight for a few seconds (7-10 sec). I couldn't tell if it was very cloudy that night or not, but that may have influenced my short sighting of the object. I was on alarm for the remainder of the car ride with emotions of shock, confusion, and paranoia. What I witnessed was very strange and didn't share any characteristics that we would see from a normal modern flying object."],"Disposition":"Insufficient Data","Object Features":"Unknown","Sighting Duration":"Undisclosed","Region":"Texas","Source":"MUFON","City":"Austin","Case Number":"33010","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/33010.html.txt","/var/www/straped/mufon/org/33010.html"],"Log Number":"US-10312011-0031","Country":"United States"}