{"Weather Factors":"Unknown","Latitude":"37.8989","City":"Haven","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=37.8989,+-97.782827(33013)&iwloc=A&hl=en\"> mufon case (33013) map </A>","Disposition":"Insufficient Data","divs":["Sighting DetailsDriving east on US Highway 96 between Hutchinson and Wichita, KS, when I observed a \"weird\" looking star. It was brighter than most stars and with the sky being overcast, for one to shine so brightly it caught my attention. It was north of the highway. After seeing this \"star\" I looked in other directions and noticed two others (one further east and one south). These \"stars\" did not appear to be moving. Looking further, I observed it looked like a tear in the dark sky letting light seep through in a triangular shape. As I was driving, the two others disappeared from my line of site, but the one to the north stayed stationary. The star remained in site until I arrived at my home. Then I cam inside and looked for a website to report it on. I was listening to the radio and talking on my cell phone all of the way and had no interference. I had not been drinking or using illegal substances and am not overly tired. The feelings I experienced were facination at first and then after realizing it was something unknown, I kinda got that X-File like paranoia. I made sure I stayed with traffic and drove through popuplated areas all the way home. This is my very first reporting."],"Date of the Event":"10/31/2011 07:00 UTC","Date Submitted":"10/31/2011 09:23 UTC","Object Flight Path":"Stationary","Region":"Kansas","Source":"MUFON","trends":["There have been no other sightings in Haven","This sighting has never been favorited."],"Longitude":"-97.782827","Summary":"Driving east on HIghway 96 observed a weird looking star upon further glance it was triangular","files":["/var/www/straped/mufon/html2text/33013.html.txt","/var/www/straped/mufon/org/33013.html"],"Tags":"City","Log Number":"US-10312011-0034","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"33013"}