{"Object Flight Path":"Stationary","Longitude":"-82.190805","divs":["Sighting DetailsBetween 10:00-10:30 I was in my garage playing pool, the door was open and facing East, me and two of my friends stepped out of the garage to get some of the cool breeze air. I noticed the strange light first, it was a clear cloudless night, Friday night, and we could see the stars very clearly but this one stood out because it blinked red, and it moved up and down, side to side like it was dancing. I scanned the sky and all of the other stars were stationary. We could visibly see airplanes flying over head and in the distance, strobe lights, and position lights, and could tell the aircraft were man made planes traveling through the airspace above my house, but this one star stood out, it was in the distance. It flashed white like a star and red. We could tell it was moving around but pretty much stayed in the same orbit. We watched this for maybe an half hour, then lost interest and just figured maybe it was a helicopter. I am a retired USAF F-16 and A-10 Crew Chief with 23 years of working on and around aircraft. I have traveled the world and i can tell you this was no airplane or helicopter or a star. We just stood there staring at it. We ended up going inside and just chalked it up to a strange sighting. My friend said there was another one that i didn't see but he said he did. Kind of strange also about two weeks before that in the same vicinity I witnessed a falling star, not streaking across the sky but a white star coming straight down that disappeared behind the tree line, their was no tail, vapor, or plume. Also was stationed at RAF Bentwaters England in 1987. I personally asked a British National fuel tanker driver i had to escort around RAF Woodbridge if the Rendelshem Forest sighting was true, he told me yes it was."],"Viewing Distance":"Unknown","Weather Factors":"None","Object Features":"Unknown","Log Number":"US-10312011-0040","City":"North Port","Case Number":"33019","Latitude":"27.069774","Country":"United States","Date of the Event":"10/28/2011 10:16 UTC","Source":"MUFON","trends":["There have been 7 other sightings in North Port","There were no other sightings in North Port on or around October 28th 2011"],"Disposition":"Insufficient Data","Object Shape":"Star-like","Date Submitted":"10/31/2011 10:38 UTC","Sighting Duration":"00:30:00","Summary":"Star like but flashing red, stationary from a distance but could visibly tell it was moving left to right and up and down but in a small area, You really had to look at it to tell it was moving, but stayed more or less in the same spot, strange","map":"<A HREF = \"http://maps.google.com/maps?q=27.069774,+-82.190805(33019)&iwloc=A&hl=en\"> mufon case (33019) map </A>","Region":"Florida","Tags":"City","files":["/var/www/straped/mufon/html2text/33019.html.txt","/var/www/straped/mufon/org/33019.html"]}