{"Date Submitted":"10/31/2011 10:15 UTC","Log Number":"US-10312011-0037","Disposition":"IFO","Case Number":"33016","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.913613,+-94.402461(33016)&iwloc=A&hl=en\"> mufon case (33016) map </A>","Summary":"Very scary to look at, Many bright flashing lights and it was a fast moving object.","trends":["There have been 52 other sightings in Lee's Summit","There were 6 other sightings in Lee's Summit on or around October 31st 2011"],"Sighting Duration":"00:15:00","Viewing Distance":"Over One Mile","Object Shape":"Blimp, Circle, Sphere, Teardrop, Unknown","files":["/var/www/straped/mufon/html2text/33016.html.txt","/var/www/straped/mufon/org/33016.html"],"Object Features":"Dome, Other, Unknown","Tags":"City","City":"Lee's Summit","Date of the Event":"10/31/2011 07:35 UTC","Latitude":"38.913613","Weather Factors":"Unknown","divs":["Sighting DetailsOk, I was having a boring halloween tonight. I have just gotten back from my school basketball tryouts, and i was planning on going trick or treating with my girlfriend tonight, but i didn't. I instead stayed home, watched southpark, and the chiefs game. Before the chiefs game, i went outside to check on my dogs for about 20 minutes. About 5 minutes after i had gone outside, I saw something moving rapidly across the sky. The Object stopped from time to time, Maybe every 5 minutes, But it moved fast and rapidly. Now, My home is in Peculiar, Missouri. This object was in the direction of Lee's Summit, Missouri. I think it was in Lee's summit, but it MAY have been in Raymore. Nothing really made me notice it at first, I just looked up at the sky, and boom. There it was. This object had very bright lights that seemed to go on randomly, and it moved very rabidly. As i said, it hovered from time to time. I have heard from some of my friends that they saw something move in the sky too. One of my friends from Lee's Summit said that they went outside on their front porch, and they saw something move rapidly across the sky. Another one of my friends was in a car with a group of people. They were about to go to a Halloween party, and they all said they saw something. I looked up Lee's Summit UFO sightings, and i have found out that UFO sightings in that area are very common. I lost sight of the object, when it seemed to look as if it was descending. It MAY of landed, but i am not for sure. I had a weird reaction, I was scared, and i ran inside. However, i went into the sunroom, and continued to look out the window at the object. After the sighting, i talked to my mom. She said that it was probably just an Airplane or a blimp for the monday night football game. I said that airplanes do not hover, and that blimps probably do not move and change direction as fast as the object i saw."],"Region":"Missouri","Longitude":"-94.402461","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Source":"MUFON"}