{"Summary":"UFO sighting","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=32.915222,+-96.669817(33017)&iwloc=A&hl=en\"> mufon case (33017) map </A>","Region":"Texas","City":"Garland","Tags":"City","Case Number":"33017","Country":"United States","Latitude":"32.915222","Date Submitted":"10/31/2011 10:34 UTC","Date of the Event":"08/21/1984 04:45 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","Disposition":"Unknown","trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around August 21st 1984"],"Weather Factors":"None","Log Number":"US-10312011-0038","Object Shape":"Cylinder","files":["/var/www/straped/mufon/html2text/33017.html.txt","/var/www/straped/mufon/org/33017.html"],"Object Features":"Undisclosed","Longitude":"-96.669817","divs":["Sighting DetailsI was walking home from using a pay phone at Chief Auto parts store in Garland Tx,on the corner of Jupiter and Walnut Sreet. It was I am guessing after 4:30 A.M. It was little over a mile from my home. I had to use that phone because my father had ripped out my phone jack fom my bedroom because I had ran up a very expensive phone bill at the time. Anyway I had turned to go down my street on Hillsdale going east and my mother had gotten up to go to work I guess and had noticed I wasn't in bed and went out lookig for me. Anyway she picked my up and we were driving back to the house going east. My mother was chewing me out and I was trying to ignore her like kids do with their parents when their being disciplined. So I started looking out the passenger window and it there was a little bit of low cloud cover at the time, I saw this incredibly hugh object above the houses. I am not sure how high it was I am guessing maybe 2 to 500ft above the houses, again i'm not sure but it was traveling no more than 25 to 30 miles an hour because I looked over to see just how fast we were going at the time. Analog speedometers at the time not very accurate but we were also going down a residential street and the speed limit was 30 miles an hour. I looked out the window again and it was still there paralleling us I told my mother to look out the window too but she was telling me she was driving. I told her to speed up so we could get ahead of it I wanted to get to the end of our street so we could take a right turn on Runnymeade to Lawler then go back east so we could keep following it. I did get my mother to speed up but she stop at our house which was three houses till the end of the street so I got out told my mother to look up and see what she saw and I took off running to the end of the street so I could get a better look without any houses blocking my view. So I saw it pass by on Lawler still going eastward about 30 miles an hour, not making a single sound. I couldn't tell exactly how long it was or how large due to the low cloud cover-which now I am guessing it was using for camouflage-but it was longer than 50ft for sure, it took almost 15 seconds for it to pass me by. I have never forgotten that night. At the time I thought it was a military craft or something but I don't know of any military craft that is even a stealth that can move that slow and not making a single sound. I will try and discribe what it looked like. It was dark greyish and I don't want to say cylindrical but it was kind of cigar shaped and extrodanarily long. Easly over 15ft or higher could not tell you how long it was, but do the math. It took 15 seconds to pass by me at 25 to 30 miles an hour."],"Sighting Duration":"Undisclosed"}