{"Country":"United States","Summary":"large black triangle shaped object passed directly over us. made no noise.","Latitude":"42.500096","Longitude":"-70.857825","Source":"MUFON","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Disposition":"Unresolved","City":"Marblehead","Region":"Massachusetts","Weather Factors":"Unknown","Object Shape":"Triangle","Tags":"City","Date of the Event":"07/15/1981 12:00 UTC","trends":["There have been no other sightings in Marblehead","This sighting has never been favorited."],"Object Features":"None","Date Submitted":"11/01/2011 03:03 UTC","Sighting Duration":"Undisclosed","Log Number":"US-11012011-0004","Case Number":"33027","divs":["Sighting Details My friend and I were sitting on a picnic table at a park in Marblehead, MA in the early 80's. Maybe 1981. It was summer. The park was just a couple blocks from the ocean. We were eating dinner and then we both looked up as a very large silent black triangle object passed directly overhead. It was at least as large as a football field. It moved very slowly. I noted no lights. I never saw the top of it. It was moving from west to east heading towards the ocean. It was above the tree tops, but not by much, maybe 150-200 feet. It was just begining dusk and I think it darkened the sky which is why we both looked up. It was almost halfway over us when we first saw it. We watched until it disappeared from view in the tree line. We asked each other \"did you see that?\". We never mentioned it or talked about it again. We were both in our 20's, not drinking or taking drugs. I was in college. I had no idea what it was, but I always wonder how something so big could move so slow and not make any noise or breeze. Years later when I said anything, people always said it was a stealth. I have since learned they don't move like that and I don't really know that they had them in the early eighties."],"files":["/var/www/straped/mufon/html2text/33027.html.txt","/var/www/straped/mufon/org/33027.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.500096,+-70.857825(33027)&iwloc=A&hl=en\"> mufon case (33027) map </A>"}