{"Longitude":"-84.228593","City":"Midland","Country":"United States","Viewing Distance":"Over One Mile","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Region":"Michigan","Latitude":"43.623899","Summary":"blinking light up in the sky","divs":["Sighting DetailsI had just returned from my break from work and as I started walking towards the building a bright light in the sky caught my eye. It was roughly 25 degrees off the horizon and it was coming from the southwest. It seemed to be blinking and as I observed further I noticed that it was the object itself that was blinking and not a smaller landing beacon or other kind of beacons that you would find on an airplane. It was hard to ascertain the exact size as it was probably at least 1 mile away over the city, but I would definitely say it was larger than a star in the sky. Anyway as I continued to observe it, there was no pattern to the blinking; it would just randomly blink on then off then on again then it would pause and so on. It looked like it was signaling something, akin to someone flashing their lights at you , very strange indeed. Finally the last time it blinked it never came back on and just vanished! I waited an extra couple of minutes to see if it would come back on but it was gone. I just found it very strange and wanted to report it in case someone else saw the same thing and knew what it was. I would classify this as a CE-1. I have had a sighting 11 years ago in northern Michigan and also reported this to Mufon."],"Tags":"City","Date of the Event":"10/31/2011 08:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.623899,+-84.228593(33021)&iwloc=A&hl=en\"> mufon case (33021) map </A>","Log Number":"US-10312011-0042","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/33021.html.txt","/var/www/straped/mufon/org/33021.html"],"trends":["There have been 10 other sightings in Midland","There were no other sightings in Midland on or around October 31st 2011"],"Object Features":"Unknown","Case Number":"33021","Date Submitted":"10/31/2011 10:53 UTC","Object Shape":"Unknown","Weather Factors":"Unknown"}