{"Country":"United States","files":["/var/www/straped/mufon/html2text/33028.html.txt","/var/www/straped/mufon/org/33028.html"],"Log Number":"US-11012011-0005","Object Flight Path":"Hovering then path,Path then hovering","trends":["There have been 52 other sightings in Lee's Summit","There were 6 other sightings in Lee's Summit on or around October 31st 2011"],"Object Shape":"Disc","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Lee's Summit","Source":"MUFON","Disposition":"Insufficient Data","Latitude":"38.892717","Weather Factors":"Unknown","Date of the Event":"10/31/2011 07:50 UTC","Region":"Missouri","Summary":"10/31/11 Lee's Summit, Mo Disc UFO","Longitude":"-94.265924","Object Features":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.892717,+-94.265924(33028)&iwloc=A&hl=en\"> mufon case (33028) map </A>","Date Submitted":"11/01/2011 03:06 UTC","Case Number":"33028","divs":["Sighting DetailsMy wife and I were driving to take our child trick-or-treating. My car was heading west on Hwy 50 and had just passed the Hwy 7 exit. On the north side of Hwy 50 to the North West I saw a long line of lights moving accross the sky to the north. I pointed at them and told my wife to look because it was such a very long line of lights. They quickly changed direction and moved South East bound right at us. The line of lights moved up as the bottom of the disc shaped ufo was exposed. The bottom was covered in a very large amount of spot lights. As the disc came closer and decended it tilted so far up that the bottom part of the disc with all the spot lights was completely visable. One of the spot lights on the bottom caught my eye as the rest of them shown down. The bottom was curved just like a saucer. It was so gigantic and low to the ground I decided to slow down to 50 mph and took the first U-turn available. Cars all around me were slowing down. I passed Hwy 7 again and turned North. I watched the ufo decend and then hover to the North West. The night sky lit up with a flash of light in a perfect circle around the ufo. I kept my eyes in the sky but didn't see it again. I did notice shortly after the ufo sighting an unusual amount of normal aircraft activity was everyhere. Two planes flying at the same low altitude came from the East flying West bound. They flew right over the location the ufo seemed to land but kept going."]}