{"City":"Fredericksburg","Sighting Duration":"Undisclosed","Latitude":"38.260258","Case Number":"33026","Longitude":"-77.437779","Date Submitted":"11/01/2011 01:52 UTC","Object Features":"Dome","Country":"United States","Summary":"Putting air into my car's tires in my driveway, I briefly took a glance at the sky after standing up and saw half of a gray-lead colored flying disc with a bump in the middle between two clouds cloaking itself to become invisible. I will never forget!!","Viewing Distance":"Unknown","Region":"Virginia","Weather Factors":"Unknown","trends":["There have been 17 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around September 11th 2004","This sighting has never been favorited.",""],"Object Flight Path":"Stationary,Straight-line path","Date of the Event":"09/11/2004 05:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.260258,+-77.437779(33026)&iwloc=A&hl=en\"> mufon case (33026) map </A>","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Object Shape":"Disc","divs":["Sighting DetailsIn September of 2004 during day light late in the afternoon after 5:00 P.M. I was kneeling on my driveway and putting air into the tires of my 2001 Toyota Prius. After filling the left-rear tire I stood up and glanced up at the sky at a seventy or seventy-five degree angle. I was surprised to see half of a flying disc with a bump in the middle (its crew compartment I guess), gray-lead in color, stuck between two clouds with a wave or liquid of some kind finishing to cover the remaining part of the spaceship. There was nothing that made me to first notice the object, it was just there, by chance, in my line of sight as I looked up into the sky. The spaceship looked like it was falling into quicksilver (mercury), but upwards in the sky between two clouds. If you hold a quarter (coin) in mercury halfway and see how the liquid covers half of the coin, that is what I saw. As a student in high school years ago in chemistry class, I saw my teacher demonstrate holding a coin in mercury and for what purpose I don't remember; however, seeing this UFO do this, clicked my high school memory and I can't get this view of this UFO doing this out of my mind. I have tried to forget over the years, but I am unable to do that, this image just keeps sticking in my mind. I saw this happen in about ten or twelve seconds and I could not keep my eyes off of what was happening, it stunned me (it was so unusual an occurrence which I was not prepared to see). As this wave or liquid finished covering the half of the flying disc that I could see, the whole ship became invisible and I believe it flew into outer space between these two big clouds that were so many hundreds of feet apart, so it could not be detected visually as it continued flying on its course in one direction. After I saw this happen, I could not believe what I saw and I felt that the sighting stunned me (something I was surprised to see and was unprepared to see). I felt alittle frightened (scare) and I told my wife after I went inside my house, but she did not believe me. I lost sight of the disc half once it became covered with this wave or liquid that made it invisible (I assumed it continued on in its straight flight path into outer space). I hope I never see anything like this ever again. A drawing of what I witnessed (saw) is attached to this report. ***In November 1994 I was abducted from my hotel room in Virginia Beach, Virginia by alien beings called grays. In April 1995 I moved to Seoul, South Korea and a large flying disc was sighted over the city of Seoul. My supervisor had a English printed newspaper with a picture of it, but he gave it to someone and I could not locate the newspaper or the name of the publisher."],"files":["/var/www/straped/mufon/html2text/33026.html.txt","/var/www/straped/mufon/org/33026.html"],"Log Number":"US-11012011-0003"}