{"Date of the Event":"10/31/2011 07:30 UTC","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-11012011-0012","Latitude":"39.963496","map":"<A HREF = \"http://maps.google.com/maps?q=39.963496,+-82.991244(33035)&iwloc=A&hl=en\"> mufon case (33035) map </A>","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["Sighting DetailsStanding in driveway. watched 3 orange lights in the NW sky come into view at a slow pace...thought helicopter but felt odd that the lights were orange. they stopped and hovered. One orage light went west while the other appeared to go east. The center light stayed in position. Ran in house to get camera...came out only one orange light in sky. eventually it headed sw and disappeared. It actually looked like it went behind clouds (disappeared) but do not think there were any clouds out there thich enough to hide bright object. Went in house and was not sure what just happened. Laughed it off and thought too bad I did not have camera first time. Maybe3 15 minutes later I went out not expecting to see the lights but they were back. This time in the NW sky and one over the other resembling the letter I. Grabed camera tio take picture. By time I looked into viewfinder 2 were gone and again only one was left. Called daughter who lives 30 minutes north of cinncinati to tell of expereince. 30 minutes later (9:30pm) she called and sadi dad I see them. She only saw 2 orange lights. Also witnessing the event was her husband. Checked the news and police and no reports filed."],"Summary":"3 orange lights in V shape heading SW.","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around October 31st 2011"],"Longitude":"-82.991244","Case Number":"33035","Region":"Ohio","City":"Columbus","Date Submitted":"11/01/2011 07:34 UTC","files":["/var/www/straped/mufon/html2text/33035.html.txt","/var/www/straped/mufon/org/33035.html"],"Object Shape":"Oval","Object Flight Path":"Path then hovering","Disposition":"Unresolved","Object Features":"None"}