{"Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=42.035674,+-93.646084(33036)&iwloc=A&hl=en\"> mufon case (33036) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-11012011-0013","Longitude":"-93.646084","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/33036.html.txt","/var/www/straped/mufon/org/33036.html"],"City":"Ames","Tags":"City","Weather Factors":"Windy, Light","Source":"MUFON","Summary":"Animals Fall Silent As Large Object Passes","Date Submitted":"11/01/2011 08:11 UTC","Date of the Event":"10/15/2011 09:15 UTC","Case Number":"33036","Disposition":"Unknown","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet, Unknown","Country":"United States","Region":"Iowa","divs":["Sighting Details First of all if these objects are using space and time to bend the field in front of them for propulsion then that would explain the uncany calm prior to the sighting. I should of been well within the field of that when it went by. It was Saturday the 15th of Oct. between 9:15 and 9:20 P.M. Was standing outside as I usually do every night and caught this object in my vision off to the right side. It was 400ft west and 800 to 1000ft high. It had two lights one foward and one aft and a lenth of approx. 400ft. It looked oblonged, however it could of been bigger as it was dark and it was also the dark of the moon. It's total travel distance from my point of view was right at 8 tenths of a mile, using land marks. NO sound what so ever. Did find it distubing that there was not a dog barking or geese making noise at that time and thats not normal here. Have not done the math to compute the speed but will when I get time to do so. Object distance traveld was 8 tenths of a mile in 3 or 4 seconds. I used land marks and line of sight to come up with this. The army tought us well. It should of pasted right over the west edge of the Ames airport. If I had not been looking in that direction that night I would have never seen it, it was to fast."],"trends":["There have been 9 other sightings in Ames","There were no other sightings in Ames on or around October 15th 2011"],"Latitude":"42.035674"}