{"Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","divs":["Sighting DetailsI was in the car with my daughter-in-law and two small grandsons, while Trick-or-Treating last night (10-31-11). We were stopped at a light on a busy street when I noticed a huge, circular object moving right toward us from the North. It had pulsating and blinking multi-colored lights, as well as extremely bright, white lights. It came very close and hovered over all the cars and buildings, through several light changes (everyone who saw it just sat where they were!), then slowly began to move off toward the SW in an arcing path. When we first saw it, it was as if it was approaching us with its bottom facing us, (as if on a vertical orientation, and as it retreated, it turned flat (or horizontal), at times moving very slowly, then accelerating very quickly. It would completely disappear from time to time. We followed it, both of us taking turns video-ing it with our phones. It at times acted as if it were playing a game with us, hiding,then appearing very close so we could see details, including a dome-like appendage on the bottom-center. Then it would speed off, eventually making a complete circle over our area and winding up hovering over the neighborhood where we had originally been headed. It disappeared again, as we got out of the car to go tell our friends, and many people in the neighborhood came running up asking if we saw it, too! It returned from low on the Northern horizon, hovered directly over us, at times turning on its end, as before, and at other times performing all sorts of movements that seemed to defy regular laws of physics! Someone said the news was saying it was a group of 7 precision-flight small plane operators, performing a fly-by over the football stadium, but we saw this very closely and it was not a group of small planes (or large ones)! It was completely circular and everything moved as one, without fail. It made very little noise, a pleasant, low, oscillating hum, that I have never heard before, nor had anyone else. Definitely not the sound of any plane or helicopter I have ever heard. This sky-line ballet went on for over an hour and toward the end, the craft had turned to a horizontal position and forcefully ejected a much smaller, red, orb-like object, then shot off never to be seen by us again. The red orb hovered for many minutes, its light just pulsating and varying in intensity of frequency, then it began moving, slowly at first, then it also shot off in the same direction as the large craft and we never saw it again, either. It had no sound. We all felt very affected on many levels. We were, of course, very excited, skeptical (kept trying to google any news about it but phones were not working well), happy (no one seemed to feel frightened or upset), and tingly. Personally, I felt like I had lost a huge chunk of time, and felt an enormous amount of high-frequency energy around me and running through me! I felt hopeful, and could not sleep the rest of the night. The small children were also elated, and had lots of energy as well. Today, I could find no news on TV or the net, other than MUFON, about this! I am just so sad that my phone camera could not capture the beauty and enormity of this thing!"],"Country":"United States","Region":"Missouri","Tags":"City","Viewing Distance":"101-500 Feet, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.922873,+-94.377986(33047)&iwloc=A&hl=en\"> mufon case (33047) map </A>","files":["/var/www/straped/mufon/html2text/33047.html.txt","/var/www/straped/mufon/org/33047.html"],"Log Number":"US-11012011-0023","Date Submitted":"11/01/2011 02:25 UTC","Case Number":"33047","Object Features":"Dome, Appendage(s)","trends":["There have been 52 other sightings in Lee's Summit","There were 6 other sightings in Lee's Summit on or around October 31st 2011","This sighting has never been favorited.",""],"Object Shape":"Circle, Disc, Sphere","Latitude":"38.922873","Sighting Duration":"Undisclosed","Date of the Event":"10/31/2011 08:10 UTC","City":"Lee's Summit","Disposition":"Unknown","Longitude":"-94.377986","Weather Factors":"Unknown","Summary":"One extremely large, circular, disc-like main ship, bright, pulsating lights of all colors and white, + small, red, orb-like shape ejected toward the end, which stayed behind, hovered for many minutes, then shot off after the large craft!"}