{"Disposition":"Unknown","Object Flight Path":"Hovering then path","Date of the Event":"03/12/2005 07:15 UTC","Tags":"City","Log Number":"US-11012011-0025","Region":"Florida","Object Shape":"Sphere","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.724696,+-84.987346(33049)&iwloc=A&hl=en\"> mufon case (33049) map </A>","Latitude":"29.724696","trends":["There have been 2 other sightings in Mexico Beach","There were no other sightings in Mexico Beach on or around March 12th 2005"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Date Submitted":"11/01/2011 03:43 UTC","Case Number":"33049","Viewing Distance":"Over One Mile","divs":["Sighting DetailsIn March of 2005, I was visiting my wife in Mexico Beach Fl.At apprx. 0715 I went out on the balcony to smoke a Cigar. Her apartment was on the beach and as I looked across St Joe Bay,I saw a brilliant white light off the tip of Cape San Blas. I knew that it was not a planet or a star because it wasn't there the night before.I got my binoculars out and when I looked at the white light I saw the most brilliant red and Green lights I have ever seen and no trace of white light . The lights did not flicker but remained constant. As I am looking at what ever it was, I saw an identical Green and Red Light appear to separate from it and start to go downward slowly. When it had sank down to the point where I was about to loose sight of the top most object in my binocs.(I was resting them on the balcony railing to keep vibrations down), it stopped and started slowly rising back up. It then rejoined the first object. It then started moving in a Westward direction very slowly. After it had moved a short distance it once again stopped , and once again a red and green light separated from it and started going down slowly. It did the exact same thing again. After it rose back up and rejoined the other object, It looked as though it took a turn Southward and just faded away. I would add that I was a Fire Fighter in the Air Force and worked on the flight line. These colored lights I saw were unlike any color I have ever seen. The closest to them would be the Day-Glo paints from the black light days and even that was not as brilliant. I would also add that at first I thought it may have been an F-22 Raptor because Tyndal Air Force base was testing them at the time and they can hover but I don't thik they can do what I saw. By the way, My wife Witnessed it as well. She had gone to the store and returned just in time to see it.I gave her the binocs and asked what do you see. She said\"you mean that bright green and red light ?\" I said \"thats it!\" I can't tell you how glad I was to have a witness. My feelings on what I saw was that I had seen something out of the ordinary.I don't know what it was but I know what it wasn't. Respectfully, submitted Robert L.Register"],"Summary":"Was at Mexico Beach and saw lights in the sky","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33049.html.txt","/var/www/straped/mufon/org/33049.html"],"Longitude":"-84.987346","Weather Factors":"None","City":"Mexico Beach"}