{"Date of the Event":"10/30/2011 09:10 UTC","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Fireball, Other","Source":"MUFON","Object Flight Path":"Other","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around October 30th 2011"],"Latitude":"33.583941","Longitude":"-112.076776","Disposition":"IFO","Country":"United States","divs":["sighting detailsi was at the location listed in phoenix just walking onto a roof when i immediately observed what looked like a disc-string of flames out in the distance (20+ miles). the string was like a forest fire reaching the top of a mountain from the opposite side. as i walked closer to the edge the flames extinguished from left to right. thinking this was because i moved forward i began walking backwards and after about 20 feet the flames slowly reappeared but from left to right not right to left as expected which gave me an eerie feeling. they were no longer disc-shaped but in a row. i stopped and walked forward again to the edge of the roof and the flames did not extinguish this time. after about 30 seconds they extinguished in the same manner. about 1 minute later the sting of flames reappeared lower in the sky than before. i was using freeway lights in the distance to judge its movement.this lasted for only 30 seconds and then they extinguished again from left to right. this appeared to be in the goodyear\\buckeye\\estrella mountain area. i would say it could have been anywhere from 1\\4 mile to 3\\4 long. i new it could have been a forest fire but none were reported and its behavior was all too unusual."],"Log Number":"US-11012011-0018","files":["/var/www/straped/mufon/html2text/33042.html.txt","/var/www/straped/mufon/org/33042.html"],"Date Submitted":"11/01/2011 11:56 UTC","Summary":"String of flame-like object(s) lighting up like fire and extinguishing in a row","map":"<A HREF = \"http://maps.google.com/maps?q=33.583941,+-112.076776(33042)&iwloc=A&hl=en\"> mufon case (33042) map </A>","Case Number":"33042","Object Features":"None","Tags":"City","City":"Phoenix","Region":"Arizona","Sighting Duration":"00:05:00"}