{"Object Flight Path":"Straight-line path","Disposition":"Unknown","divs":["Sighting DetailsLast night my wife and I were travelling east on the Bluegrass Parkway after trick-or-treating back home in Owensboro with our 16 month old little girl and family. We've lived in Lexington for years but we make this trip back to Owensboro every Halloween to trick or treat with my nieces and nephews. Last night at 1AM I was coming up to the first Bardstown exit. This exit has a small hotel and a gas station and is always unusually well lit. As I rounded the corner and the overpass came into view I noticed a plane (?) with bright lights in the direction of the hotel. I was immediately struck by the altitude and size of the plane. It was very, very low and large. 747 large. It was travelling southwest. As I passed under the overpass I looked up and it was directly overhead. I looked up was able to catch a glimpse of it because the light from the exit dimly lit the underbelly. It wasn't smooth or very aerodynamically shaped. Nothing like you'd associate with a current gen stealth aircraft like the B-2, F-22 or JSF. It also wasn't like a 1st Gen stealth aircraft with faceted angles. It was very \"mechanical\" looking for lack of a better term. I only saw it briefly and only the center portion but at the time the closest thing my mind could match the shape and struture to was, oddly enough, an F-14 Tomcat. But much, much bigger. The other oddity was the speed. If it was a jet then it would have been dangerously close to stalling. I honestly think it might have been hard to even generate aerodynamic lift at that speed. It's hard to judge the exact speed given the size of it but using landmarks and reference points I'd have to guessimate 120 mph. At this point I was rather confused and having trouble making sense with what I'd just seen. 30 seconds to a minute later I look off to the left side of the road I see another one. This one had already passed so I was getting the view from the rear. I pulled off to the side and as I ran over the rumble strips my wife woke up (she was asleep in the back with our little girl). I rolled down the driver's window and watched it continue off into the distance. It was wide. How wide is hard to say. At this point by wife is wondering why in the world we're sitting on the side of the parkway. I started to drive off and told her that I had just seen something very unusual. As I fumbled around and tries to explain it, to my amazement I see ANOTHER one directly in from of us. My wife comments that it looks like a helicopter. I take a second and agree because it looks smaller and is travelling low and slow like you'd expect to see from a helicopter,. BUT as we continue on and watch it fly into the distance (over the Coors distributing plant of the parkway) we realize that we'd only seen the side view when it was in front of us. As it travelled further away we were perpendicular to it we were then able to see the width of the craft. Again, very wide. Keep mind my wife and I just saw an A380 in Miami two weeks ago so we're both familiar with large aircraft. A couple miles up the road as we conversed about what we just witnessed we notice a 4th craft off to the right side of the road. I immediately pulled off the parkway (in a construction zone), turned off the car and jumped out. She rolled her window down in the back and we both watched it fly by completely silent. COMPLETELY silent. No thump-thump, no tail rotor, no turbines, nothing. I'm completely stumped here. I don't for one second believe these craft were something other worldly but not much about them makes sense. If they were covert military aircraft then why such a low flight pattern that allows then to be spotted from the ground? If they're covert then why bother with lights? Why would a pilot risk flying so low in such a large aircraft? I'm hesitant to start to think outside the box on how these craft were able to remain airborn at such low speeds and do so silently but I'm out of possible answers."],"Object Shape":"Unknown","Longitude":"-85.458512","Country":"United States","City":"Bardstown","Summary":"Multiple craft","Date Submitted":"11/01/2011 02:39 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.811258,+-85.458512(33048)&iwloc=A&hl=en\"> mufon case (33048) map </A>","trends":["There have been 4 other sightings in Bardstown","There were no other sightings in Bardstown on or around November 1st 2011"],"Object Features":"Patterned Surface","Tags":"City","Region":"Kentucky","Weather Factors":"Unknown","Case Number":"33048","Date of the Event":"11/01/2011 12:00 UTC","Sighting Duration":"Undisclosed","Log Number":"US-11012011-0023","files":["/var/www/straped/mufon/html2text/33048.html.txt","/var/www/straped/mufon/org/33048.html"],"Latitude":"37.811258","Source":"MUFON"}