{"divs":["sighting detailsi had been taking a customary walk around my neighborhood and stopped at my driveway to try to spot a hawk that was making hawk sounds from a group of trees behind my neighbor's house. his trees were around 80 to 100 ft high. slowly this ufo appeared to rise up from behind the trees. my first thought was excitement that i was going to see my first ufo. then i realized that it only appeared to rise up. it was moving in a straight line. i then thought it was a dirigible and i started looking for a gondola, windows, lettering or towing a sign. there were none and i became less excited. there were no engines, propellers, jets nor steering mechanisms. the bottom half was silver colored and the top blue of what i could see. it didn't appear to be over 200 ft high and about 100+\\- ft long and 20\\30 feet in diameter. it was moving in a straight line from the south in a north\\north west direction at 30mph+\\-. i disappeared out of site and i thought no more about it for a day or 2."],"Longitude":"-84.479166","map":"<A HREF = \"http://maps.google.com/maps?q=33.969118,+-84.479166(33044)&iwloc=A&hl=en\"> mufon case (33044) map </A>","Viewing Distance":"101-500 Feet","Summary":"Elongated football shape. 100ft+/- Bottom half silver color. Upper half blue. No sound, steering mechanism, port holes, windows, propellers and flew slowly (30mph) & steadily from the South in N/NW direcrtion.","Region":"Georgia","Latitude":"33.969118","Date Submitted":"11/01/2011 01:22 UTC","Tags":"City","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/33044.html.txt","/var/www/straped/mufon/org/33044.html"],"Object Shape":"Blimp, Cigar","Date of the Event":"10/26/2011 12:00 UTC","Weather Factors":"Unknown","Log Number":"US-11012011-0020","trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around October 26th 2011"],"Sighting Duration":"Undisclosed","Object Features":"Other","Source":"MUFON","Disposition":"Unresolved","Case Number":"33044","City":"Marietta","Country":"United States"}