{"Region":"Kentucky","Longitude":"-84.267228","Disposition":"Unknown","Case Number":"33043","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.844753,+-84.267228(33043)&iwloc=A&hl=en\"> mufon case (33043) map </A>","divs":["Sighting DetailsI saw one or two stationary objects with lights high in the sky above my head and just to the north that looked like stars at aprox 630 to 700 am, My grandfather who is a preacher was also with me and witnessed the event, the object had 3 lights in a straight line and 3 more lights in the shape of a triangle. I dont no if it was 1 object or 2 but the lights would randomly pulsate. you would look up and there would be 4 lights, then 6 lights then 3 lights then 6 again, it continued for a very long time. I also saw 3 separate star like objects in the sky traveling from west to east from the same location as the large object. First there was a single star like light moving across the night sky and i took it as possibly a satellite since i have viewed them before in the night sky, then about 5 minutes later there were 2 of them together, I no they were not one object cause one of them would slow down and speed up in order to catch up with the other, then one of the lights disappeared and the other continued on until it was out of sight. I also saw several shooting stars during this half hour period.It started to get light outside and i couldnt see the large group of lights anymore"],"Weather Factors":"Unknown","Latitude":"37.844753","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/33043.html.txt","/var/www/straped/mufon/org/33043.html"],"Country":"United States","Log Number":"US-11012011-0019","Summary":"was in truck going hunting early morning, star gazing","Object Features":"Unknown","trends":["There have been no other sightings in holycross","This sighting has never been favorited."],"Viewing Distance":"Unknown","City":"holycross","Date Submitted":"11/01/2011 12:38 UTC","Date of the Event":"11/01/2011 07:00 UTC","Object Shape":"Star-like, Triangle"}