{"Case Number":"33055","Summary":"Came frm north, flew till straight overhead, gradually turned east southeast and flew out of sight over horizon.","Log Number":"US-11012011-0030","City":"Murrayville","Country":"United States","Viewing Distance":"101-500 Feet","Tags":"City","Date Submitted":"11/01/2011 11:07 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.454102,+-83.893182(33055)&iwloc=A&hl=en\"> mufon case (33055) map </A>","Latitude":"34.454102","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33055.html.txt","/var/www/straped/mufon/org/33055.html"],"Region":"Georgia","trends":["There have been no other sightings in Murrayville","This sighting has never been favorited."],"Source":"MUFON","Object Features":"Unknown","Longitude":"-83.893182","Weather Factors":"None","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was standing outside on my driveway with the outside flood lights on, talking on the phone with a friend in California and suddenly saw a bright white light fly over the treeline coming from the north. I told my friend she would never believe what I was watching and described it to her as it continued to fly towards me until it got straight overhead and then somewhat gradually turned towards the east southeast and continued on that path until it flew out of sight over the horizon. It was bright like the appearance of a star, and only about 500 feet overhead. It was so bright that I could not make out any shape to it other than a basically spherical shape as a star would look. It did not make a sound, and appeared to almost be made of light as opposed to having lights on it. I know almost as much about physics as anyone on earth, and knew that what I was watching was supposed to be impossible. Almost as soon as I saw it I thought to run inside and get my video camera but remembered that the battery was dead as luck would have it...There is no doubt in my mind that if the battery had not been dead the world would have definitive proof of the existence of UFO's that are not man made. Although it seemed to possibly be made of light, it did not light up the area as I would think something like that would to have been flying so close to the ground. I also realized that since it changed its flight path, it had to have been controlled by some form of intelligence. Took me weeks to wrap my head around what I had seen because the physics of such a craft should be impossible. I tried to identify it as anything I could possibly dismiss it as man made, but even after weeks of thinking about any type of physical laws that could make such a craft man made, I was left with the obvious conclusion that it was not. This was a very difficult realization for me because although I had always kept an open mind about UFO's, I did not believe it was possible for them to visit earth because the physics of such long distance space travel should be impossible. I even talked to retired air force pilots who could not explain it, although they told me of rumors of pilots seeing such things that I now know have been referred to as foo fighters. Now this is where my testimony gets hard to believe for anyone other than those ppl who have been with me and seen these objects. Since '07, I and whoever has been with me at such times have seen around 75 UFO's that cannot be explained as satellites, shooting stars, or anything but what they are. After my sighting in '07 I started watching the night sky frequently but did not see anything else until spring of '08. Since then, my parents girlfriend, her son, my aunt, and I have no idea how many other ppl in this area have seen similar UFO's usually from spring until around the 4th of July, except this summer we have seen a few later than the 4th. None have been as close as the first one I saw, but I have videoed several that came close enough to video in the spring and summer of '08. I have also found that if a high powered spot light, or usually a high powered green laser are shinned at the crafts, they will sometimes light up about 75 percent brighter than before a light is shinned at them. Usually they will light up somewhere suddenly, fly a distance and then dim out to nothing. We have also seen them fly at varying speeds, sometimes so fast they travel great distances vs they're altitude in a matter of seconds. We have even seen them suddenly accelerate to speeds so fast that they leave a light trail and then disappear. My mom and I watched one fly over they're house at an altitude of about 800 feet curving almost the entire path and then disappear. I have seen some that pulseate, slowly going from dim to bright and back and forth. We have also seen many in Blairsville Ga, and one brilliant one just last Saturday night in Jasper Co Ga where I own some timber land, and get this....I have a strange photo of something that seems to be greyish green with black eyes that seemed to be inspecting a trail camera that I use to get pictures of deer on my land in Jasper Co. It moved so fast when the camera took the picture though that it was just a blur, so the picture is inconclusive, but I cannot understand what else it could be but what it looks like. I have searched the net since '08 trying to find some reputable source to report all this to, but this is the first site I have found that I think might be capable of actually finding some answers to all this. I called one UFO group one time and told the guy that if someone would just spend about a week here in the spring that I could prove to them or anyone that UFO's exist and I could show anyone things that should be impossible flying over the area, but he did not believe me and said I needed to write a report and send it in. That's rather frustrating when you can show someone UFO's in the night sky but they won't take the time to come see them. Why should I report something that they would not come see in person I figured? Lol Granted the window of opportunity is not what it was in '07-'10, because we have not seen very many this past summer which is appalling to me that I could not find one single group dedicated to proving these things instead of just making money off the speculation about them. I have a few theories about these things, but nothing I can still satisfy myself with, and things I can't understand almost drive me crazy...lol I've never seen anything until '07 or encountered anything I could not figure out if I set my mind to it, and now I have seen things I can't explain and have no way of finding out more about them. Anyway, I will be more than happy to do anything to help find answers cause I want to know what they are in the worst way now...there's a big difference in even believing something exists and knowing for sure.... Also, I don't know how to upload my videos or anything else right now, but will be happy to send a copy of them by mail or something if I need to. Thanks..."],"Object Flight Path":"Path with directional change","Object Shape":"Sphere, Star-like","Date of the Event":"06/22/2007 04:30 UTC"}