{"trends":["There have been 2 other sightings in Washingtonville","There were no other sightings in Washingtonville on or around October 26th 2011"],"Latitude":"41.42627","City":"Washingtonville","Object Flight Path":"Straight-line path","Country":"United States","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/33056.html.txt","/var/www/straped/mufon/org/33056.html"],"Sighting Duration":"Undisclosed","divs":["sighting detailson 10\\26\\11 i was standing on a roof and a silver object caught my eye. silver with a black band near \\ around the center, and as high as it was i thought that could be the wing that i couldn't see clearly, and no contrail at all. as i watched i noticed a passenger jet approaching following the curvature of the earth with contrails streaming, giving it the appearance of climbing....to a point, so i figured i could now judge how high the silver object was. this silver object was travelling much faster that the jet approaching each other, it would seem due to the speed difference that the silver object was lower...but when the flight paths intersected the jet was under the object because i could still see 2\\3rds of the silver object and all of the jet. so as i'm throwing out expletives of amazement i noticed that the silver object was not getting lower in the sky...it was going higher, it went up and out, not the downward following the curvature as did the jet. the time was 3:31 pm, i went to an aviation map for real-time tracking, went to replay the flights over orange county, n.y. and it wouldn't do the replay for that time of day, and it was travelling north to south , the jet was south to north."],"Date of the Event":"10/26/2011 03:31 UTC","Source":"MUFON","Date Submitted":"11/01/2011 11:31 UTC","Tags":"City","Longitude":"-74.153158","map":"<A HREF = \"http://maps.google.com/maps?q=41.42627,+-74.153158(33056)&iwloc=A&hl=en\"> mufon case (33056) map </A>","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Log Number":"US-11012011-0031","Summary":"Silver Cigar with black band no contrail, higher than jet with contrail, object passed over the jet, could still see object, jet didn't block all of object","Case Number":"33056","Weather Factors":"Unknown","Object Features":"Other","Region":"New York"}