{"Object Shape":"Star-like","City":"Blue Springs","Viewing Distance":"Unknown","Date Submitted":"11/01/2011 03:56 UTC","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsI was going to report this last night, but didn't. I have never seen or reported anything weird like this. I searched again today and saw three others reported the exact same thing. Two reports in California and one close to me in Kansas. My story is pretty much the same as the other three. I didn't notice any temp change like the one person said though. I was sitting in my driveway passing out treats and waiting for my family to get back from trick or treating. At 7:30pm central time,I glanced up in the southeast sky at about 45-55 degrees up from the horizon and noticed what I thought were two bright planets diaganol of each other. They were totally stationary. I noticed in the other reports they were vertical of each other and in another part of the sky. I don't know if that has to do with where they are in the U.S. compared to where these things were in the sky. Anyway, I watched them about 60 seconds. I don't know how long they were there before I noticed them. Then one faded and about 4 seconds later, the other. Weird. I don't think it was any alien action, but I would like to know what it was. I thoght maybe military flares, but they were not falling. Then when it was seen in California, I knew that wasn't the case."],"Object Features":"None","Summary":"Two venus like objects diaganol of each other in the southeast sky one fades then the other.","Longitude":"-94.273025","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=39.025051,+-94.273025(33050)&iwloc=A&hl=en\"> mufon case (33050) map </A>","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 28 other sightings in Blue Springs","There were no other sightings in Blue Springs on or around October 31st 2011"],"files":["/var/www/straped/mufon/html2text/33050.html.txt","/var/www/straped/mufon/org/33050.html"],"Region":"Missouri","Tags":"City","Disposition":"Unknown","Latitude":"39.025051","Date of the Event":"10/31/2011 07:30 UTC","Log Number":"US-11012011-0026","Case Number":"33050"}