{"Country":"United States","Date of the Event":"11/02/2011 06:37 UTC","Longitude":"-89.679564","Object Shape":"Circle","trends":["There has been one other sighting in Chatham","There were no other sightings in Chatham on or around November 2nd 2011"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/33069.html.txt","/var/www/straped/mufon/org/33069.html"],"Tags":"City","Log Number":"US-11022011-0010","Summary":"STAR LIKE MOVED NORTH TO SOUTH HOVERED AND FOLLOWED ME NORHT AND THEN FADED OUT","divs":["Sighting DetailsI WAS TURNING WEST AND SAY WHAT I THOUGHT WAS STAR IN SKY MOVING NORTH TO SOUTH. THOUGHT MAYBE IT WAS MOVING BECAUSE I WAS MOVING. STOPPED AT INTERSECTION TO OBSERVE AND OBJECT STOPPED RIGHT AFTER I DID AND REMAINED STATIONARY FOR 30 SECONDS AS I DID. THEN FOLLOWED ME NORTH WHEN I TURNED TO GO NORTH. I CHECKED INSIDE MY CAR TO MAKE SURE MY CELL PHONE OR SOMETHING ELSE WAS NOT UST REFLECTING ON MY WINDOW BUT THERE WAS NOTHING IN CAR TO DO THAT. IT FOLLOWED ME NORTH AND SPED UP AHEAD OF ME AND THEN SLOWED DOWN TO GET BACK EVEN WITH ME. IT FOLLOWED ME FOR ABOUT A MILE OR TWO AND THEN WITHOUT CHANGING TRAJECTORY IT SLOWLY FADED OUT WITH THE LIGHT LOOKING LIKE A DIMMER SWITCH BEING TURNED SLOWLY OFF. I NOTICED THAT IT WAS THE ONLY STAR I SAW IN THE SKY WHEN I WAS LOOKING FOR TRAFFIC BEFORE I TURNED OFF OF MY STREET TO GO TO EXIT OF SUBDIVISION. I THOUGHT IS WAS A BRIGHT STAR WHEN I FIRST SAW IT. IT WAS MOVING STEADILY FROM NORTH TO SOUTH WITH NO FLICKERING LIGHTS OR LIGHTS OTHER THAN WHITE. IT WAS MOVING VERY SMOOTHLY AND RAPIDLY AND THEN JUST STOPPED WITHOUT A STUDDER RIGHT AFTER I STOPPED TO OBSERVE IT. I THOUGHT OH MY GOD. NO STAR DOES THAT. I SAT THERE FOR 30 SECONDS AND THEN TURNED TO CONTINUE ON TO WORK AND IT STARTED TO FOLLOW ME. IT LOOKED TO BE SEVERAL MILES TO THE WEST OF ME BUT RIGHT IN LINE WITH ME TO THE LEFT OF MY DRIVER SIDE WINDOW. IT WAS ABOUVE THE TREES ABOUT 300-500 FEET I WOULD GUESS. WHEN I WAS GOING OVER THE BRIDGE OFF IRON BRIDGE ROAD AT THE LAKE THE LIGHT STARTED TO SLOWLY DIM AS IF BEING TURNED DOWN AND THEN JUST DISAPPEARED. THIS HAPPENDED AT 6:37AM NOV 2, 2011 AND LASTED ABOUT A MINUTE OR TWO."],"Case Number":"33069","Disposition":"IFO","Source":"MUFON","Latitude":"39.68186","Region":"Illinois","Date Submitted":"11/02/2011 09:30 UTC","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=39.68186,+-89.679564(33069)&iwloc=A&hl=en\"> mufon case (33069) map </A>","City":"Chatham","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Weather Factors":"Unknown"}