{"Log Number":"US-11022011-0003","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.807443,+-112.842297(33062)&iwloc=A&hl=en\"> mufon case (33062) map </A>","Latitude":"33.807443","trends":["There have been 7 other sightings in Wickenburg","There were no other sightings in Wickenburg on or around April 3rd 2000"],"Date of the Event":"04/03/2000 09:10 UTC","Disposition":"Unresolved","divs":["Sighting DetailsThe reason my choices vary is because I have seen so much in the 12 years I lived in the Sonora desert. I was common place. Some like clock work. like every Thursday at 9 pm. We'd see helicopters whar looked like they where escorting crafts out. I suspect these are military experiments with alien craft. Those I grew used to and ignored. I've had 3-4 amazing encounters. First one was an odd small bright light with a dimmer red light off next to it. Then while my ex and I were observing another white light appeared to the other side of the red light. Then slowly one of the white lights went towards the red and disappeared. Followed by the second white light doing the same. Then the red light went poof! While driving home through the desert at night I seen an object very large what appeared to be very close less then 500 feet. All I noticed at first was a dark silhouette against the sky! I stopped to observe. Then I I seen what I've seen dozens if not over 50. White lights appearing as if either attached to the vessel or surrounding it,about 8 of them almost perfectly spaced. I tried to cal home but service was bad out there. To get home I had to enter a canyon for over a mile. I would lose site of the UFO. I also felt I was a sitting duck so went on my way. When I came out it was gone. Now this one was freaky, Laying in my bed looking out a window over the mountain across from me. I seen 1 bright light just hanging there. Very odd. Then from the center out it went to 3 then 5! I rolled over my ex and yelled, Look at that ! I went outside. Now it went back from 5 to 3 then 1. I still see faint lights on the outer 2 and 3. I go back in and get my 8X binoculars. Now all 3 lights are moving towards me. The mountain across from me is maybe 600 yards. As they approach where I'm standing one light veers off right. the next veers left, then circles wide around and appeared to be a very slow moving military jet? I say this because after it got around my mountain it was headed towards Luke Air force base and was flashing lights which is wasn't before. Now the center light is coming straight over head. It was not A JET ROAR, or the humming as I have heard others state. it was more a low rumbling moving very very slow. I was thinking what is keeping this thing in flight moving so slow. When I say slow I'm guessing 20 mph? It was like slow motion. The bottom looked like a scene from Close Encounters. thousands of lights. I seen no wings it was more roundish but massive. My family living there and guests and others have witnessed these events time and time again. the most common was the object with the lights appearing around the outside. Also some daytime sightings which we believed where drones. Erratic flying dropping rapid movements. Your form sucks for information. the witnesses ranged from 1 to 8 over the 12 years"],"Longitude":"-112.842297","files":["/var/www/straped/mufon/html2text/33062.html.txt","/var/www/straped/mufon/org/33062.html"],"Date Submitted":"11/02/2011 03:56 UTC","Country":"United States","Summary":"Multiple events impossible to describe in 25 words","Object Shape":"Oval, Sphere, Other","Case Number":"33062","Object Features":"Other, Unknown","City":"Wickenburg","Region":"Arizona","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Source":"MUFON","Weather Factors":"Unknown"}