{"Case Number":"3306","files":["/var/www/straped/mufon/html2text/3306.html.txt","/var/www/straped/mufon/org/3306.html"],"Disposition":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsSighting Report: on Feb. 25,2005 at about 10:20 p.m. I was leaving a bar in Glen Ullin, N.D. (50 miles west of Bismarck) and heading home. Directly south of the area i noticed an unusual light in the sky at what looked about 4500 feet in the air and about 8 miles south of where I was, over a local lake. I watched it for a few minutes and noticed that the light got very bright then dim a few times. it was sort of blue white and reminded me of a search light on the bottom of a helicopter. while watching it I noticed another light(not the same color, almost slightly amber)come towards the first light from the east then stop moving after getting close to the first light. I knew that this must be a UFO and called the people in the bar(5) to come see. We watched for a couple minutes, during which time a small plane flew almost between the object and us. we went back into the bar and talked about it for awhile, one person said he had seen UFOs many times before. After a short time, I decided to drive home(about 35 miles north) During the drive I watched the object occasionally through my rearview mirror. After about 23 miles I stopped, got out of my truck and saw that the object was still in the sky but had gotten higher up and about 25 miles further north. By this time I could see an outline ot the craft s shape(Chevron) and that the craft was in my estimation about three times the size of a 747 jet. (if I had held a quarter at arm s length it would not cover the object) I continued my drive the rest of the way to the town I live in and after that drive the object was still in the air, only a little higher and further north. The drive took about 40-45 minutes. I went into another bar for about an hour and when I came out the object was gone."],"City":"Beulah","Country":"United States","Summary":"Not Provided","map":"<A HREF = \"http://maps.google.com/maps?q=47.26334,+-101.777946(3306)&iwloc=A&hl=en\"> mufon case (3306) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"03/26/2005 09:51 UTC","Source":"MUFON","Region":"North Dakota","Object Flight Path":"Hovering then path,Path with directional change","Longitude":"-101.777946","Viewing Distance":"Over One Mile","Date Submitted":"03/26/2005 09:51 UTC","Object Shape":"Triangle","Tags":"City","trends":["There has been one other sighting in Beulah","There were no other sightings in Beulah on or around March 26th 2005"],"Object Features":"Undisclosed","Log Number":"","Latitude":"47.26334"}