{"Region":"Missouri","Date Submitted":"11/02/2011 10:31 UTC","trends":["There has been one other sighting in Potosi","There were no other sightings in Potosi on or around November 1st 2011"],"Log Number":"US-11022011-0010","Tags":"City","Weather Factors":"Unknown","Object Shape":"Circle, Star-like","Date of the Event":"11/01/2011 07:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.942408,+-90.783409(33070)&iwloc=A&hl=en\"> mufon case (33070) map </A>","City":"Potosi","Longitude":"-90.783409","files":["/var/www/straped/mufon/html2text/33070.html.txt","/var/www/straped/mufon/org/33070.html"],"Case Number":"33070","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had walked out on the porch when my ex dropped off my son. I was making conversation as he hooked up my sons car seat and happened to look up at the moon. There was a bright light that I can only compare to the northern star that seemed like it was falling to the Left of the moon. The more I watched it the more I realized that it was not a star nor an airlplane. It moved fast and was not falling it was traveling southeast. It faded into a pin point withing a matter of 10-20 seconds. There was no sound. No blinking. No pattern of movement. This light was traveling fast and steady. I yelled at my sons father to look up over and over but by the time he looked up (after securing carseat) the light was already a pin point but still traveling. He also witnessed it but did not see the brightness that I did. I know we have alot of air traffic and I see planes and helicopters day and night... I have never noticed anything like this before. Was odd. I watched the light until it was gone. Lasted a total of maybe 2-3 minutes and that may be over estimated time. It happened quick."],"Source":"MUFON","Object Flight Path":"Straight-line path","Summary":"Bright light moving in sky that was NOT a plan or star.","Country":"United States","Object Features":"Unknown","Latitude":"37.942408","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"IFO"}