{"Date Submitted":"11/02/2011 11:17 UTC","City":"Kingsland","Weather Factors":"None","Region":"Georgia","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=30.767113,+-81.618733(33072)&iwloc=A&hl=en\"> mufon case (33072) map </A>","Date of the Event":"11/02/2011 05:47 UTC","Object Shape":"Unknown","Object Flight Path":"Stationary,Hovering then path","Latitude":"30.767113","Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Kingsland","There were no other sightings in Kingsland on or around November 2nd 2011","This sighting has never been favorited.",""],"Longitude":"-81.618733","Case Number":"33072","Country":"United States","files":["/var/www/straped/mufon/html2text/33072.html.txt","/var/www/straped/mufon/more/33072_submitter_file1__ORIONSIGHTING1.PNG","/var/www/straped/mufon/org/33072.html"],"Summary":"at 5:45 am on 11/2/2011 i looked in the direction of orion and witnessed a flash then continued to see more flashes.","Object Features":"Unknown","divs":["sighting detailsat 5:45 am 11\\1\\2011 i looked in the direction of the constellation of orion. i witnessed a flash of light, more like a reflection that you would see when you witness solar panels from a satellite reflecting sunlight. the object looked like space debris reflecting the soon rising sun,but what had me puzzled was that the object seemed to stay in the same area so i observed more and located the nearest star. after locating the region of sky in a star map of orion it seems in the same area i witnessed the object there is a variable star, but variable stars change magnitude over a period of a few days not minutes! i have witnessed plenty of satellites,iss,hubble,shuttles passing overhead in my life but they always seemed to move across the sky somewhat quickly. this object seemed stationary at first and flashed about 20-30 times and very slowly moved and then got dimmer and dimmer over a period of ten minutes. i think this sighting may just be space debris, but what has me puzzled is all other space debris i have witnessed seemed to move across the sky very fast compared to the object i was seeing. i have included a star map of the orion region and highlighted the objects position and direction of movement. please explain if i witnessed space debris,satellite,pulsar,quasar ,variable star, double star,super nova, or ufo. thank you (name moved to fi box) cms 11\\02\\11 14:31 cst flg"],"Sighting Duration":"Undisclosed","Log Number":"US-11022011-0012","Tags":"City","Source":"MUFON"}