{"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-84.50677","Date Submitted":"02/12/2005 07:22 UTC","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around February 12th 2005"],"City":"Cincinnati","Object Shape":"Undisclosed","Country":"United States","divs":["Sighting DetailsSighting Report: six years ago while setting on my roof my son and I saw a small globe about the size of a beach ball. It went right over my roof and hit way back in the dark woods behind my house.I wanted to go and look for it but it was late and had too go to bed. For some reason I could not sleep something was drawing me too the back woods. My family asleep i went on back in the dark without a flash light which I think was pretty stupid. I looked for about a hour and a half and then I went back too my home by way of the back yard. After I got there I set on my bench and began too smoke a cigarette. I had taken a few draws when a weak voice said those things can kill you. I put my cigarette out and said \"Is someone there can I help you,where are you,? \"Yes walk too the big tree in front of you then you can see me. The tree was about thirty feet or so from me so I walk over too it.where are you I said I cant see you. The voice said light your lighter and then you can. I light my lighter and what I saw made me say Oh my God and dropped my lighter.I am not very good in spelling out what I saw.you have my phone number gave me a call. I can tell you better then I can spell or type."],"Tags":"City","Latitude":"39.106628","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/3307.html.txt","/var/www/straped/mufon/org/3307.html"],"Log Number":"","Date of the Event":"02/12/2005 07:22 UTC","Summary":"Not Provided","Disposition":"Hoax","Weather Factors":"Unknown","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=39.106628,+-84.50677(3307)&iwloc=A&hl=en\"> mufon case (3307) map </A>","Case Number":"3307","Source":"MUFON"}