{"Date Submitted":"11/02/2011 02:37 UTC","Longitude":"-94.47062","Object Features":"Patterned Surface, Appendage(s)","Latitude":"39.008688","Object Shape":"Circle, Disc, Oval","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Raytown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.008688,+-94.47062(33074)&iwloc=A&hl=en\"> mufon case (33074) map </A>","Summary":"It was hugemongeous and very slient in addition it made a disturbing noise that was deafening to the ears.","Tags":"City","divs":["Sighting DetailsIt was October 4, 2011 at approximately 8:00 pm. I was coming out of a friends home, when I noticed children in the parking lot screaming and pointing to the North sky. When I looked I thought it was an elaborate big blimp that was hovering by the third floor on the northeast side of the building. I begin to yell to my friend for him to come and witness the object that was hovering in fornt of his childrens bedroom window. I immediately ran to my car and continued to yell for my friend to come out. As I grabbed my phone I turned towards the object and playfully yelled, \"take me, take me!\" It started rotating as if to position for a directional take-off. It went northeast approximately 5-10 mi radius as it was coming back towards me in what appeared to be a 360 degree turn I began to photograph with my camera phone. At this point my friend came outside and I asked him if it was a jet that I was seeing since he was almost level eye to eye with the object. This is when I began to climb on a green meter box and switched my phone from photo to video because I noticed there was no sound coming from it and the way it hovered, I just had to get it on film because it has audio. My friend yelled to his wife to go get their camera while I continued to film. Then it gave off an intimidating sound; turned slowly to the north; within seconds it was gone headed northward and out of sight."],"Region":"Missouri","Viewing Distance":"21-100 Feet","trends":["There have been 15 other sightings in Raytown","There were 3 other sightings in Raytown on or around October 4th 2011"],"files":["/var/www/straped/mufon/html2text/33074.html.txt","/var/www/straped/mufon/org/33074.html"],"Log Number":"US-11022011-0014","Weather Factors":"None","Country":"United States","Disposition":"Unknown","Sighting Duration":"Undisclosed","Case Number":"33074","Date of the Event":"10/04/2011 08:04 UTC"}