{"Latitude":"35.640124","Date of the Event":"11/01/2011 12:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.640124,+-88.181524(33085)&iwloc=A&hl=en\"> mufon case (33085) map </A>","Log Number":"US-11022011-0026","Weather Factors":"Unknown","Summary":"Two star-like objects seen traveling in unison.","Region":"Tennessee","Longitude":"-88.181524","Source":"MUFON","Viewing Distance":"Unknown","City":"Parsons","Object Flight Path":"Straight-line path","Disposition":"Unknown","trends":["There have been no other sightings in Parsons","This sighting has never been favorited."],"Case Number":"33085","Object Features":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"11/02/2011 07:56 UTC","divs":["Sighting DetailsI was going from my back door to my car to leave for work. It was about 6:00 am, and I paused, as I normally do every morning, to gaze at the stars, which were quite beautiful this morning. As I looked toward my car, which would be looking west, I noticed two stars above the tree line. As I looked at them I noticed that they were moving due north. For a moment I thought that their movement was an optical illusion, but then I saw that they were drawing nearer to the tree line. As they neared the trees I moved into my driveway to see them better. They were positioned one on top of the other, forming an invisible diagonal line. If you close one eye and hold two fingers out in front of you roughly five inches apart, that's how far apart they were from each other. I then noticed that the two \"stars\" were traveling at exactly the same speed and distance, never breaking stride from one another. I watched them until they disappeared from view behind the trees. I was very intrigued and curious about the lights, and wished I could've watched them longer. I don't know what they were, weather alien in nature, satellites, or whatever. I've seen airplanes all my life, and these things were not airplanes. No landing, wing or tail lights, and absolutely no sound at all. In my mind they were either independently piloted craft, traveling flawlessly together, or lights on some larger craft. I don't know."],"files":["/var/www/straped/mufon/html2text/33085.html.txt","/var/www/straped/mufon/org/33085.html"],"Object Shape":"Star-like"}