{"map":"<A HREF = \"http://maps.google.com/maps?q=40.062324,+-74.396291(33088)&iwloc=A&hl=en\"> mufon case (33088) map </A>","Object Features":"Patterned Surface, Other","Weather Factors":"None","Summary":"Saw bright yellow/orange ball in south western sky, as car close with this ball we got out, it hovered over the car underside was bright orange with redish orange pulsing center, surounded by round orange dots, then it headed east and out of view.","trends":["There have been no other sightings in Town of Goshen NJ","This sighting has never been favorited."],"divs":["Sighting DetailsI told my daughter about this and she sent me the email address of Mr. George Filer. He asked if I would fill out a MUFON form and sent me the link. I did not get around to it until now. Below, is the body of the email I wrote to Mr. Filer on July 8, 2011. I added some additional comments that my wife made, at the very bottom. At around 10 pm on the 4th of July my wife and I were heading south on Rt47 in Cape May county NJ between Goshen and Indian Trail Rd (Rt147). I noticed and orange glowing ball in the sky off to north west of us and at first thought it to be fireworks. I watched for a short while realized it wasn't bursting or falling to the ground. I pointed it out to my wife and as I got closer I lost site of it but my wife could still see it out of her side window. She opened the window and told me stop the car that I had to in her words \"see this thing\". I pulled onto the shoulder and we both got out as the object passed over our car going from west to east I could clearly see a round object. It was bright orange. In it's center there appeared to be something like a brilliant reddish orange flame or burner and around the perimeter were orange dots. The whole object was bright orange. There was a moderate but steady flow of traffic heading in both directions so I thought for sure other cars would stop but none did. The object made no noise and kept traveling east until it was out of sight. As it went away form us it looked more like an orange ball again. I took a picture with my blackberry camera but it came out looking like a small dot in the sky. I believe it was overcast that evening as I don't recall seeing any stars. I have tried to rationalize what I saw, thinking it was some kind of 4th of July display or possibly the bottom of a balloon gondola with a 4th of July display under it but nothing made sense. I have never seen anything like it in my life and neither has my wife. I'm just surprised that I have not heard anything about anyone else seeing it. The way it traveled out of sight it was heading for Wildwood on one of the busiest nights of the year. Maybe you folks have received some reports, I just can't believe we were the only ones to see this. The whole episode lasted maybe 3 minutes. I can't say how large it was or how fast it was going. If you held bottle cap over your head and looked up at it, that's about size it looked up in the sky but with the details I describe looking straight up under it were very clear. Ps My wife says the object appeared larger than a bottle cap, closer to the size of a basket ball and hovered directly overhead for about 30 seconds before moving east. I agree with her that it did seem to stop directly overhead and sit there for a short time. I don't know what this thing was, I have never been a fan of ufo's. I have never seen anything like this in my life and neither has my wife. We went home thinking wow, that's all I can say. I tried rationalizing that it was some sort observation balloon launched for 4th of July celebrations but, I have seen balloons before, this was not like any ballon I ever saw. It resembled a round platform or disc from benieth. I took a picture of it with my cell phone when it was moving away from us but it turned out looking like a small dot in the black sky. Every time I drive over that stretch of road now I picture that thing in my mind and wonder if I will ever see anything like it again. It definitely changed my view of ufo's."],"Date Submitted":"11/02/2011 09:35 UTC","Object Flight Path":"Path then hovering","City":"Town of Goshen NJ","Tags":"City","Source":"MUFON","Date of the Event":"07/04/2011 10:30 UTC","Object Shape":"Circle, Fireball","files":["/var/www/straped/mufon/html2text/33088.html.txt","/var/www/straped/mufon/org/33088.html"],"Disposition":"Unknown","Latitude":"40.062324","Case Number":"33088","Sighting Duration":"Undisclosed","Log Number":"US-11022011-0029","Country":"United States","Viewing Distance":"Unknown","Longitude":"-74.396291","Region":"New Jersey"}