{"Tags":"City","Country":"United States","Log Number":"US-11022011-0028","Viewing Distance":"Over One Mile","Source":"MUFON","Summary":"Saw a white disc in the sky. It was stationary for a few minutes before it began moving.","Date of the Event":"10/18/2011 03:12 UTC","Case Number":"33087","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.884564,+-117.559538(33087)&iwloc=A&hl=en\"> mufon case (33087) map </A>","Sighting Duration":"00:07:00","Longitude":"-117.559538","City":"Corona","divs":["Sighting DetailsMy mother and I were heading from finishing up our errands for the day. When we had gone past Yorba Linda boulevard and hit the side of the freeway where it's mostly mountains and trees. I was looking out the window, not really looking at anything in particular. That was when I first noticed a white object in the sky that was right above the mountains. At first I just thought it was just a small or large airplane since we were getting closer Corona Municipal Airport. I ignored it until I saw a regular sized plane pass right below it. Making me realized the size difference was immense, and that it wasn't moving. Looking at it closely I saw it was a white disc shaped object. I started watching it closely for a while after that. I tried to point it out to my mom except she was driving so she couldn't see it. I was able to tell her what was happening though. Another plane passed after a few minutes later but this time except it was a small personal plane (not a jet.) The object it the sky was still slightly smaller than it. When we got close to Green River or a little before. The object had been in the middle of the window when I first saw it, but since we had been continuously moving it was now on the far left. I was getting worried I was about to loose sight of it when suddenly I noticed it slowly began to hover in a strait line to the right before it began to move downwards. Right before it made it midway before it seemed to disappear just like that. After it disappeared a few more planes passed by per usual. Didn't notice any helicopters but I didn't really check."],"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Disposition":"Unresolved","Latitude":"33.884564","Date Submitted":"11/02/2011 09:16 UTC","trends":["There have been 36 other sightings in Corona","There were no other sightings in Corona on or around October 18th 2011"],"Region":"California","Object Shape":"Circle, Disc","files":["/var/www/straped/mufon/html2text/33087.html.txt","/var/www/straped/mufon/org/33087.html"],"Object Features":"Dome"}