{"trends":["There have been 4 other sightings in Murrells Inlet","There were no other sightings in Murrells Inlet on or around April 20th 2006"],"files":["/var/www/straped/mufon/html2text/33097.html.txt","/var/www/straped/mufon/org/33097.html"],"Date of the Event":"04/20/2006 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.556352,+-79.037236(33097)&iwloc=A&hl=en\"> mufon case (33097) map </A>","Log Number":"US-11032011-0007","Viewing Distance":"501 Feet - 1 Mile","Region":"South Carolina","City":"Murrells Inlet","divs":["Sighting Detailsat aapprox. 3am iwas boarding my boat as soon as stepped 1 foot aboard somthing caught myeye to my rt.i looked and ther was octagon shapped disc hovering and bouncing like adragonfly for about three to five seconds it shot up the intercoastal water way towards wilmington n.c.as soon asit did that another one showed up in the exact same spot same movement everything. iwatched this for i believedto be the same amount of time the object took off did two giant looptoloop and shot offin two space with one that went up river streaking across sky into space also. now how did i get close enough to it to see that it had tarnish marks and peeble sized dingsalso i never moved but i could see myself standing on the dock looking up to my right icame down and circled back into my body on my left side. there are few more details but i would rather talk to someone on phone or in person.alsothis thing looked anceint not modern at all the craft itself almost looked alive in the way that it moved."],"Object Features":"Patterned Surface","Date Submitted":"11/03/2011 03:29 UTC","Latitude":"33.556352","Case Number":"33097","Country":"United States","Summary":"octagon in shape very biblical lookinghad pings in exterior with green tarnish marks hoverd like adragonfly","Disposition":"Unknown","Tags":"City","Longitude":"-79.037236","Object Shape":"Other","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","Source":"MUFON","Weather Factors":"Unknown"}