{"Source":"MUFON","Longitude":"-81.845797","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date of the Event":"10/31/2011 02:28 UTC","trends":["There has been one other sighting in Ocklawaha","There were no other sightings in Ocklawaha on or around October 31st 2011"],"Case Number":"33098","Object Flight Path":"Straight-line path","Region":"Florida","Disposition":"Insufficient Data","Tags":"City","Date Submitted":"11/03/2011 03:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.131736,+-81.845797(33098)&iwloc=A&hl=en\"> mufon case (33098) map </A>","Summary":"Plasma Ship Crash Landing","City":"Ocklawaha","Object Features":"Other","divs":["Sighting DetailsAs usual, I was sleeping at this time of the morning, just like anyone else would be in my neighborhood. But also in the norm of things, when they (Aliens) choose for me to witness something that they are doing or something that is going to happen, they make sure I am there for it. At exactly 2am I awoke startled with anxiety over something that was about to happen. I proceeded to get dressed, grab some coffee and head out the door to sit on the front porch and wait and see what was the urgency of their call. At exactly 2:20am the horses in the field next door were spooked and ran furiously for the barn. At 2:28am flying downward at a 50-degree pitch was a brilliant green Plasma Ship with wave like motion of opal around and with tail that reach out over a hundred feet in length behind. The ship was in the shape of a huge Manta-ray that seemed as though it were trying to use it's wings to slow down it's decent. When approximately sixty feet above the ground, it vanished as if it went interdimentional. The only sound was that of what could be heard by the animals. And all this happened within approximately 4 minutes. The only feelings left behind were the same as they always are, the longing for home, wishing they would finally set my mind at ease. So many years of constant communication and yet no real commitment. Feelings of being used. Over the past year or ever since that last ship I spotted approximately a half mile from my home, my health continued to get worse. The ship in mention, was the ship that beamed a light that shown from my head to my toes, feeling as if I were being scanned. Every joint, bone and muscle in my body ached for weeks. Within the past year, I gained over a hundred pounds in water and the doctors cannot figure out why. Now only recently, it is going in reverse, since the last UFO spotting mentioned above. Also, about a week or so ago, I woke one morning to find something very shocking, something that had never happened before, that I can remember. My ankles were black-n-blue as if I had been tightly shackled. This went away within hours but, happened again a few days later and was noticed by a roommate."],"Latitude":"29.131736","Log Number":"US-11032011-0008","files":["/var/www/straped/mufon/html2text/33098.html.txt","/var/www/straped/mufon/org/33098.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}