{"Disposition":"Insufficient Data","Longitude":"-88.533627","map":"<A HREF = \"http://maps.google.com/maps?q=37.746661,+-88.533627(33094)&iwloc=A&hl=en\"> mufon case (33094) map </A>","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Case Number":"33094","Log Number":"US-11032011-0004","Date of the Event":"11/02/2011 06:30 UTC","divs":["Sighting DetailsMy brother, boyfriend and I were sitting by our campfire tonight...approx. 6:30 - 7:00 tonight. First witness saw the light first coming over our neighbors trees just to the North...we were all observing at first through the tree limbs, could have given the effect that the object was wobbling. At first it seemed to be heading our direction, then made a noticable change direction towards the south...as I saw it clearly between the limbs. It seemed to change speed, speed up then slow down...kind of wobbly like, my brother and I walked around the other side of the house into the clearing, when all of a sudden, the light changed from a bright white star like glow...(appeared that way to me as I didn't have my glasses on), it suddenly changed color to a deep reddish orange...then it just dissapeared! Right afterward a really loud jet flew overhead crossing over the area where the object dissappeared. At first we thought it might have been a drone, the only thing was that there was absolutely NO sound...hard to explain what it could be."],"Date Submitted":"11/03/2011 02:15 UTC","City":"Harrisburg","files":["/var/www/straped/mufon/html2text/33094.html.txt","/var/www/straped/mufon/org/33094.html"],"Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Region":"Illinois","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Undisclosed","Latitude":"37.746661","Sighting Duration":"Undisclosed","Summary":"Bright Star like object observed 3 witnesses","Country":"United States","Object Shape":"Star-like, Unknown","trends":["There have been 13 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around November 2nd 2011"]}