{"Source":"MUFON","Date Submitted":"02/21/2005 07:49 UTC","files":["/var/www/straped/mufon/html2text/3310.html.txt","/var/www/straped/mufon/org/3310.html"],"City":"Tahlequah","Object Flight Path":"Undisclosed","Object Shape":"Undisclosed","Disposition":"Unresolved","Region":"Oklahoma","Object Features":"Undisclosed","Log Number":"","Date of the Event":"02/21/2005 07:49 UTC","trends":["There have been 2 other sightings in Tahlequah","There were no other sightings in Tahlequah on or around February 21st 2005"],"Latitude":"35.92038","Country":"United States","Tags":"City","divs":["Sighting DetailsSighting Report: This was several years ago whil I lived in Jenks Oklahoma.It mustve been 1989 in the spring about May or so. I was with a friend, we were outside in his front yard changing his tire to his Bronco, it was a very nice warm day outside and it was only a few white fluffy clouds in the sky. I dont know why I looked up but I did and I say an unusual thing. Now we do live within a few miles of a small but active airport and also there is the Tulsa Intl Airport around so I am used to seeing aircraft of all kinds in the sky and this wasnt anything I had ever seen before. First of all there was absolutley no sound, it was a crimson red in color. It was moving slowly across the sky from north to south in a straight line. Its shape was triangular and it was \"flying\" point first but was rotating on its axis.It was hard to determine how high up it was however It was for sure not as high as the clouds. I asked my friend if he knew what it was he said no. after about 2 mins the object then just suddenly accelerated incredibly fast and then vanished. Ive see jets and jet fighters move at sonic speeds and this thing wouldve outpaced all of them. To this day Ive never seen anything else quite like it or even heard of anythign else. I found your website after doing a google search for ufo , and I only did that after seeing a TV special on sci fi channel. I dunno what else to say other than I can be emailed or called for further questions if you wish. ALSO i HAVE TOLD YOU EVERYTHING TO THE BEST OF MY ABILITY AND IS A TRUE AND HONEST STATEMENT. Thnk you for your time!"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.92038,+-94.965876(3310)&iwloc=A&hl=en\"> mufon case (3310) map </A>","Weather Factors":"Unknown","Case Number":"3310","Longitude":"-94.965876","Summary":"Not Provided","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}