{"Region":"Louisiana","files":["/var/www/straped/mufon/html2text/33111.html.txt","/var/www/straped/mufon/org/33111.html"],"Log Number":"US-11032011-0019","Disposition":"Unknown","Source":"MUFON","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around September 20th 2006"],"Summary":"Bright green glowing orb intelligently navigating the tree tops as it followed my car.","Viewing Distance":"21-100 Feet","Longitude":"-90.063282","Object Shape":"Sphere","divs":["Sighting DetailsIt was the fall of 2006. I was a college student at Louisiana State University. It was a weekday and one of my roommates, Edmond, came to my room and ask me what was the latest I would be willing to drive him to the Louis Armstrong Airport in New Orleans. He had just bought a Vespa off of ebay from a guy in Florida and had booked the earliest flight going out the next day. He knew I had class in the morning and wouldn't be able to take him then. His plan was just to have me drive him there late that night and camp out till his flight. A little after midnight Edmond, myself and my friend Jimmy left Baton Rouge for New Orleans. The drive took us a little over an hour. We dropped Edmond off at the terminal and Jimmy jumped in the front with me. We left the Airport around 1:30 am. Since it was very late and a week night there were hardly any other cars on the highway. We had been driving for 30 or 40 minutes, and had exited the spill way bridge. We were traveling through a very desolate part of I-10 and their were no other cars in sight. There was marsh to our left and thick woods to our right. It was very dark, no street lights on this stretch of road. I noticed a bright green light near the top of my driver side window. I initially thought the light was a reflection from something in the cars cabin, like a cell phone or a check engine light on my dashboard. I looked around my cabin compartment but nothing was different. I looked back out the window and the light was still there. I now realized that the light wasn't a reflection but rather an actual orb of green light flying at about a 60 degree angle next to my car. The light was bright and was a soft green color. It was about the size of a beach ball. I was going about 75 mph and the glowing orb was keeping up with me, sometimes going a little faster, sometimes a little slower. I could see the orb navigating the top of the tree line. going behind some trees and in front of others. I couldn't believe it. I yelled to jimmy to lay in my lap and look up. He could not see the object from the passenger seat since it was almost over the car. I actually grabbed the back of his neck and tried to push his head into my lap. Jimmy was like \"what the hell are you doing!\". I gave up on Jimmy and I was barely even watching the road at this point, my eyes were glued on the object. All of a sudden it turned left at about 75-80 degrees and shot off over the marsh at an easy 200 mph. It left a slight green tail as it shot away through the tree tops. I told jimmy what I had seen, he didn't really say anything to me about it. I think it scared him or maybe he didn't believe me. I did not feel scared though, I actually felt happy. I am not sure if the ship affected me in this way, but I was happy. The rest of the drive home was uneventful. I could draw this scene for you if you like."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.952736,+-90.063282(33111)&iwloc=A&hl=en\"> mufon case (33111) map </A>","Date of the Event":"09/20/2006 02:15 UTC","City":"New Orleans","Sighting Duration":"00:00:15","Country":"United States","Object Flight Path":"Path with directional change","Tags":"City","Weather Factors":"Unknown","Date Submitted":"11/03/2011 09:13 UTC","Case Number":"33111","Latitude":"29.952736","Object Features":"Other"}