{"map":"<A HREF = \"http://maps.google.com/maps?q=38.551599,+-90.268938(33118)&iwloc=A&hl=en\"> mufon case (33118) map </A>","City":"St Louis","files":["/var/www/straped/mufon/html2text/33118.html.txt","/var/www/straped/mufon/more/33118_submitter_file1__2011102216541000.jpg","/var/www/straped/mufon/more/33118_submitter_file2__2011102216553200.jpg","/var/www/straped/mufon/org/33118.html"],"Region":"Missouri","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around October 22nd 2011","This sighting has never been favorited.",""],"Country":"United States","Tags":"City","Object Shape":"Circle","Case Number":"33118","Object Flight Path":"N/A","Weather Factors":"Unknown","Latitude":"38.551599","Date Submitted":"11/03/2011 11:29 UTC","Date of the Event":"10/22/2011 04:54 UTC","Viewing Distance":"Over One Mile","divs":["sighting detailsi often notice the persistent plane vapor trail phenomenon happening since around '99 over st. louis. some call them \"chemtrails,\" and i sometimes take pictures of the trails and\\or planes making them. by the way, i've noticed that not all planes flying at these altitudes leave persistent trails when flying through the same air space close to or through the persistent trails. anyways, in the picture taken saturday 10\\22 @16:54 (4:54 pm cdt) i noticed black dots in the image once i'd downloaded it to my computer, especially noticing a triangle of dots in the bottom-left quadrant of the x-trail i was photographing. i think this picture was taken at the full optical zoom of 24x. i expanded the 5.3 megapixal image and only increased the contrast to find the black objects circled in the image, which is a scaled down image of the original. i've taken many pictures of these trails over the years and have never noticed these circular dark objects. they are not camera anomalies as proven by the two pictures submitted, where the dark objects change position between the two images, evidence contrary to a camera anomaly. the second (contrast only adjusted) picture taken @16:55 (4:55 pm cdt), was zoomed back a bit to include my next door neighbor's house for perspective of the x-trail, also showing the circled black objects have moved. there are 9 circled objects in the first picture, 10 in the second. there may be a few more objects in each seen at greater detail but not really at the detail i've published. these objects are not birds which do show up in my \"skywriting\" pictures sometimes but are pretty easily discerned as such. the objects in these images don't appear to be moving at the time of image capture. these dark objects appear to be something in the sky that has moved in location in the span of 1 minute and 22 seconds. i don't submit this for investigation, but as curiosity to the public of unidentified objects in the sky not conventionally known. i testify that i only altered the original images by; increasing their contrast, overlaying the circles, and scaling them down in size. if you download the images, zoom in with your image viewer to see a bit more detail."],"Summary":"Dark circular objects in different positions in two different pictures of X","Disposition":"IFO","Longitude":"-90.268938","Object Features":"None","Log Number":"US-11032011-0025","Sighting Duration":"00:01:22","Source":"MUFON"}