{"Viewing Distance":"20 Feet or Less, 21-100 Feet, Unknown","Tags":"City","Date of the Event":"09/25/2011 05:30 UTC","Date Submitted":"11/03/2011 11:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.759762,+-117.986792(33116)&iwloc=A&hl=en\"> mufon case (33116) map </A>","trends":["There have been 8 other sightings in Westminster","There were no other sightings in Westminster on or around September 25th 2011"],"Weather Factors":"Unknown","Case Number":"33116","City":"Westminster","Country":"United States","Object Shape":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Other","Source":"MUFON","Object Features":"Unknown","Latitude":"33.759762","Region":"California","files":["/var/www/straped/mufon/html2text/33116.html.txt","/var/www/straped/mufon/org/33116.html"],"Longitude":"-117.986792","divs":["Sighting DetailsUFO shoots up into the sky from outside my window at about 5- 5:30 am. computer freezes and no sound after that. Then minutes later hear them talking. I moved from Swisher, IA to Westminster, CA and i was living at my apt. for about two and a half months. i had just turned 22 sept. 20th. One morning i think sept. 25th i could not sleep, and i have been having trouble sleeping a lot. I was lying there staring at my friends computer screen it had a screen saver that was hard to take my eyes off of when i have been awake the whole time my friend was sleeping beside me. Then the werid notion that i was not the only one awake and that i have been hearing a faint sound of something for awhile but never really relized it was there and it has been there for awhile, and as soon as this idea came into my head i look towards my window that was on the right of me. My friend had put up blankets to keep the sun out, so i could not see anything. But the very second i mean (very) second i relized and looked towards the window i heard something shoot straight up into the sky and i \"can\" remember the sound and how fast it took off. It was like it knew when i relized it was there and it just took off. And as soon as it did my eyes also caught the computers screen and it froze the second that this thing took off. Ufo was the only explanation i could think of. Then i lyed there scared cause i knew that it was out there by me for awhile i never listened close enough to hear the sound. I started questioning why my window, why me? And i couldnt explan so i just lyed there confused and frightened. Soon i believe i might have heard some things talking to one another outside my window, I can remember the sounds they were making. I was very freaked out at this point scared that i was going to come face to face with a thing or things. I believe i started to cry and turned and woke up my friend in tears grabbing him and telling him there was something outside and i believe that were, aliens. The minute i woke him up our power went out for about 30 secs to a min. which seemed forever since i was already terrified. He said he believed me but i really dont think he really understood the fact that those events took place and it was very real. I tried to report the sighting but did not go threw with it, the roomates kinda got me to blow it off. I did tell many people about it. I am back in IA and i have met a few people that also believe they have seen or witnessed for themselves ufo's or aliens. I just want to talk to an expert and tell them my story in real details. This really happened i need someone to actually care for once, what i say is true. 180 Description:"],"Sighting Duration":"Undisclosed","Log Number":"US-11032011-0023","Summary":"Something froze my computer and it shot up into the sky made a jet like sound that only i heard did not wake my friend up.","Disposition":"Unresolved"}