{"Object Flight Path":"Stationary","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33115.html.txt","/var/www/straped/mufon/org/33115.html"],"Case Number":"33115","Region":"Texas","Sighting Duration":"Undisclosed","Date of the Event":"06/23/1978 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Circle","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=27.525245,+-99.495537(33115)&iwloc=A&hl=en\"> mufon case (33115) map </A>","Latitude":"27.525245","Log Number":"US-11032011-0022","Summary":"bight object above house with lights centrally located area but only my family saw it","Object Features":"Other","Country":"United States","Tags":"City","trends":["There have been 21 other sightings in Laredo","There were no other sightings in Laredo on or around June 23rd 1978"],"Date Submitted":"11/03/2011 10:39 UTC","Longitude":"-99.495537","Disposition":"Unresolved","divs":["Sighting DetailsIt happened about 33 yrs. ago. We were coming back from visiting family and we went to our parents room to watch t.v. but t.v. was fuzzy . We thought it was the antenna so I looked out the window and what I saw was something very large above the house. It was round and huge it had many lights like squares red and blue. My parents saw it so did my two brothers and niece who were also in the house. When I was able to react I ran outside but I only saw a small red light getting smaller and smaller. We asked the neighbors but no one saw what we did. I called the police and they said no one reported anything like what we saw. The weird thing is that one of my brothers and my niece forgot about the incident a few days later and so did my niece. Years later my parents were still living at the same location and started having experiences with white light in their bedroom. They both told us that in separate ocassions they would wake up in the middle of the night but couldnt move and the room was all white with the light coming from their window. It happened several times to them over several years until they passed away."],"City":"Laredo"}