{"Weather Factors":"Unknown","Object Features":"None","Disposition":"IFO","Object Flight Path":"Stationary","Region":"Georgia","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/33120.html.txt","/var/www/straped/mufon/org/33120.html"],"Case Number":"33120","City":"Savannah","divs":["Sighting DetailsSaw two glowing orbs- like energy balls- out in the night sky when I took dog outside. They were definitely not planes or helicopters. They were bright and moving around. The one over my neighbors house across the street was much lower than the one all the way to the left. They were in the air for about an hour and a half. No noise. The glowing orb seemed to have different colors coming off it - could be changing lights. We live near an army air field so maybe this is some experiment. They were directly east probably over the ocean. Both my mom and I witnessed them. They seemed to be staying in the same area - no huge moves or anything. My reaction was one of excitement and fear. I've been reading a lot about UFO's lately because I've seen these balls out here on the island before. Luckily, I was able to grab my video cam this time. I immediately went on youtube and saw there were orbs like the ones I saw on other people's ufo videos. What is going on? Government experiment or is it aircraft? I never lost sight of the objects. I just closed the door and went to bed so I can't say how long they stayed out there. I viewed them for about 1.30 hrs."],"Source":"MUFON","Log Number":"US-11042011-0001","Date of the Event":"11/03/2011 01:30 UTC","Summary":"2 glowing orbs changing different colors","Object Shape":"Oval","Latitude":"31.947055","Longitude":"-81.032993","Date Submitted":"11/04/2011 01:43 UTC","trends":["There have been 20 other sightings in Savannah","There were no other sightings in Savannah on or around November 3rd 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=31.947055,+-81.032993(33120)&iwloc=A&hl=en\"> mufon case (33120) map </A>","Viewing Distance":"Unknown"}