{"trends":["There have been 5 other sightings in Alexandria","There were no other sightings in Alexandria on or around November 3rd 2011"],"Region":"Louisiana","Disposition":"Unknown","Country":"United States","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/33128.html.txt","/var/www/straped/mufon/org/33128.html"],"Source":"MUFON","Log Number":"US-11042011-0009","Date Submitted":"11/04/2011 02:35 UTC","Longitude":"-92.439107","Viewing Distance":"501 Feet - 1 Mile","Summary":"Triangular with lights at each point, plus another light.","Object Features":"Other","City":"Alexandria","Sighting Duration":"Undisclosed","divs":["sighting detailsi was driving westward on a narrow two-lane road, and came to a clearing\\open field used for crops. i noticed how bright the moon was, and then i noticed a triangular aircraft in my line of vision. i had been driving about 55mph, and i slowed to 35mph so that i could observe. at first, my inclination was that the craft was an airplane. i rolled down my window to observe noise. it was silent. again, the craft was triangular with very very bright lights at each point of the triangle. there was also another light, perhaps on the bottom of the craft (it may have been pinkish, but still the same hue as the other lights). it was hovering in the air at less than the height of a cell phone tower. i came to my turn in the road (a northward turn), and i watched it hover slowly moving northward. i turned around to retrace my path, and to return to the clearing. when i got back there, the craft was gone. i couldn't even see it in the distance. i was intrigued, but not afraid. i didn't feel anything strange other than maybe adrenaline pumping, because the event was bizarre."],"Date of the Event":"11/03/2011 07:25 UTC","Tags":"City","Weather Factors":"Unknown","Object Shape":"Triangle","Latitude":"31.317444","Case Number":"33128","map":"<A HREF = \"http://maps.google.com/maps?q=31.317444,+-92.439107(33128)&iwloc=A&hl=en\"> mufon case (33128) map </A>"}