{"Log Number":"US-11042011-0004","Object Flight Path":"Path then hovering,Other","files":["/var/www/straped/mufon/html2text/33123.html.txt","/var/www/straped/mufon/org/33123.html"],"Latitude":"43.201908","Weather Factors":"Unknown","Longitude":"-78.016983","City":"Holley","divs":["Sighting Detailsbetween 6 and 8 of us kids were playing hot box with a baseball. I went to get a drink and finished it on the back porch while i noticed and watched this white light approaching. As it got closer it was obvious it was too low for a plane and took too long to get to us. It took several minutes to go a couple of miles. I called all the kids up to the back porch to watch it with me. We all saw it come to within 500 feet or so and then stop. Hovering over a neighbors house with just a 2 lane road between our houses. It had lights on the bottom edge blinking on and off and going in a counter-clockwise direction. Lights were not going fast, just a casual pace. The color was a dull gray brushed aluminum. It was shaped like 2 plates put together and the lights were at the middle section going around the disk. It made no noise. I remember not being scared but the 2 neighbor girls started crying when I said it was a UFO. The girls said \"Don't say that we will have nightmares\" and I said, \"Look at that thing and tell me it isn't a UFO\". I went and got my mother who was on the phone. She said to the person on the phone,\"Hold on the kids are saying they see something outside. She set the phone down and came outside. She was a little upset that we bothered her but when she came outside she said \"Holy !@#$\". Someone get the camera. I went and got the camera and gave it to her and she aimed it at the craft took a picture and the film didn't advance. It was an old flash cube camera. The flash went off but when she opened it there was no film. . My mother said \"I just put film in this yesterday\". She ran back in and told the person on the phone she had to go. We continued to watch it for a few minutes until it left horizontally but raising a small amount as it left. I called a friend down the street and he dropped the phone and said, \"Holy!@#$\" and I heard the phone dangling and hitting the wall. He came back and said \"I will call you back I have to see this\". At this point I was back outside and the disk had moved to the southwest about a mile. Approximately 1,500 feet above the ground and appeared to be above the Holley Rod and gun club. It was much higher now but still very clear to the naked eye. Within a few seconds another disk hovered over to the first one only a few hundred feet apart. They hovered there for about 20 seconds or so. The first one went zip into the sky leaving just a trail of light behind it and the the second one followed the same path. I looked towards the friends house that I had called as the objects I was watching couldn't be the same one as they were too low for him to see them and he had said I see them. When he said that; I could only see one. Sure enough 5-7 more of them hovered real slow along what appeared to be the Erie canal. It is only a little over a quarter of a mile away from our house and in between my friends house who was on the phone and mine. The person my mother was on the phone with also said she saw them and that one had landed in her apple orchard. I still know where they lived and often wonder... If they landed is there a place to get a reading from? My father came home later and we told him. He laughed and didn't believe. He did a few years later as we kept telling him the same story year after year. Nothing changed."],"Date of the Event":"10/07/1978 08:25 UTC","Date Submitted":"11/04/2011 10:48 UTC","trends":["There has been one other sighting in Holley","There were no other sightings in Holley on or around October 7th 1978"],"Tags":"City","Object Shape":"Disc","Case Number":"33123","Viewing Distance":"101-500 Feet","Summary":"flew west towards house at slow speed. no sound hovered over neighbors house for 5 mins. left to join another ufo","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.201908,+-78.016983(33123)&iwloc=A&hl=en\"> mufon case (33123) map </A>","Disposition":"Unknown","Region":"New York","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Other"}