{"Longitude":"-85.678074","Date of the Event":"11/04/2011 12:00 UTC","Region":"Michigan","Object Flight Path":"Straight-line path","divs":["Sighting DetailsIt was a very clear night nov 4 I walked out onto my porch to smoke a cigaret and I noticed what looked like a very bright white star in the sky to the south east.(not where it should be)By the way I am in Wyoming near Grand Rapids Michigan. I noticed it would move but only as short distance left to right. Then it would stop an start moving up and down very quickly. Almost like someone had it on a string and was jurking up and down on it. Least to say no airplane can do these types of movement. I got my crapy camera out and took some pics and video. The video showed what looked like to light on it red and blue I couldn't see this with my eyes only looked like a stay. It would move long distance in the sky and stop. Then it would go back in the direction it came from stop. Start to jiggle up and down and from side to side very fast at times. While I was watching this I decided to walk out to the road I look up and see a giant triangular boomerang type shaped craft fly over about 500 ft. above me no sound. It had three circular red illuminated lights under it. This ship had to be 300 ft across. I ran in told my fiance who was sleeping then went back out to watch the original ufo I was watching. I would say within 15 min I saw another group of these ships smaller in size flying in a formation like geese same in shape, color, texture and lighting, but smaller. About a half an hour latter I saw another group fly over. No sound all dull gray with red under light illumination. Even after all that 2 hours later this star looking ufo in the sky its still in the same area in the sky doing the same crazy movements I wasn't tired, but knew I had to get up early so I had to go in while it was still in the southern sky"],"trends":["There have been 5 other sightings in Wyoming","There were no other sightings in Wyoming on or around November 4th 2011"],"Latitude":"42.912101","Object Shape":"Star-like, Triangle","Object Features":"None","Sighting Duration":"03:00:00","Source":"MUFON","Date Submitted":"11/04/2011 02:13 UTC","City":"Wyoming","files":["/var/www/straped/mufon/html2text/33127.html.txt","/var/www/straped/mufon/org/33127.html"],"Country":"United States","Weather Factors":"Windy, Light","Summary":"I walked out and saw what appered to be a very bright star in a wrong spot. I watched it do some movement not of a star. Then I saw 8 ships triangular in shape .","Viewing Distance":"101-500 Feet","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.912101,+-85.678074(33127)&iwloc=A&hl=en\"> mufon case (33127) map </A>","Case Number":"33127","Disposition":"Unknown","Log Number":"US-11042011-0008"}