{"Weather Factors":"Unknown","City":"Undisclosed","Longitude":"-76.637651","Log Number":"US-11042011-0005","Date of the Event":"11/03/2011 12:00 UTC","Region":"Maryland","Viewing Distance":"Unknown","divs":["Sighting DetailsI first started noticing these starlike objects last year around the same time. Fall. This time was amazing. The objects seem to come out of nowhere, travel for some distance and then slowly turn from bright white to red and the fade away. they don't zoom off, they simply fade out like someone turned of a dimmer switch. I saw 5 of these objects last night at different times going in different directions. This part is what really amazed me about the last one I saw. I had my camcorder out and got one on film. Most of them are too far away to get a good steady shot. The last one appeared traveling from my left to right. as soon as I turned my camcorder on it faded out. I then turned off my camcorder and said \"suckers\". As soon as the word left my mouth a bright flash appeared at the same spot and it was gone. I was amazed. I'm no scientist but i'm starting to wonder if this part of the world at this time of the year is possibly a portal for the ufo's. I can see them almost every night. I have pointed them out to my neighbors, friends and family and they have all seen them. I just wish I can record one from the beginning to the end of the event. We live in an area where airplanes are a norm. These are not airplanes. no flashing lights. just one bright steady light. I live in the Parkville Maryland area. USA."],"Source":"MUFON","Case Number":"33124","Summary":"Bright starlike objects seem to come out of nowhere.","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"United States","Object Shape":"Star-like","Object Flight Path":"Straight-line path","trends":[],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.054285,+-76.637651(33124)&iwloc=A&hl=en\"> mufon case (33124) map </A>","Disposition":"Unknown","Date Submitted":"11/04/2011 10:59 UTC","Latitude":"39.054285","files":["/var/www/straped/mufon/html2text/33124.html.txt","/var/www/straped/mufon/org/33124.html"]}