{"Weather Factors":"Unknown","trends":["There has been one other sighting in Hastings Charter Township","There were no other sightings in Hastings Charter Township on or around November 4th 2011","This sighting has never been favorited.",""],"Summary":"slowly hanged in sky hovering flood light air port path 2 hours before port open","Date of the Event":"11/04/2011 05:55 UTC","Case Number":"33122","Object Shape":"Blimp, Triangle, Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/33122.html.txt","/var/www/straped/mufon/org/33122.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.67975,+-85.416578(33122)&iwloc=A&hl=en\"> mufon case (33122) map </A>","City":"Hastings Charter Township","Date Submitted":"11/04/2011 06:29 UTC","Latitude":"42.67975","Object Features":"Undisclosed","Log Number":"US-11042011-0003","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Source":"MUFON","Longitude":"-85.416578","Region":"Michigan","Disposition":"Unknown","divs":["sighting details2 hours before air port opens, seen light in the sky hanging and hovering ran to grab the camera to get angle video since i have problems with my camera being cheap \\ not a good ufology camera. no zoom\\focus on the camera while taking video. it was a bright flood light at first, and hovering a path slowly silently. it had several red strobe lights, at least 5 red strobe lights, white marker lights and also white flood lights projecting auroras of white. i want to say there were also a green lights on it but im not positive, the white maker lights red strobes and white flood lights really say what this was. dark out, 5 am so shapes hard to decipher definitively. watching the video in vlc in full screen shows the flood light going out and strobe only then flood light back on. ive build linux from scratch, solve rubiks cubes, my parents a navy vet. i woke up this morning choking on rice @ 2:30ish am flying out of bed event was @ 5:55 6 am gerald r ford airport path but 2 hours before any scheduled flights inbound, and outbound flights start @ around an hour before that. unadulterated kodak ez share zd710 video."],"Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Other"}