{"City":"College Station","Country":"United States","Object Features":"None","Weather Factors":"Unknown","Date of the Event":"11/04/2011 02:05 UTC","Summary":"Multiple sightings in one night","Case Number":"33121","files":["/var/www/straped/mufon/html2text/33121.html.txt","/var/www/straped/mufon/org/33121.html"],"Log Number":"US-11042011-0002","Tags":"City","divs":["Sighting DetailsAt about 2:00 AM on Friday morning November 4 2011 I went outside for a cigarette and was looking up at the stars as I always do. The sky was clear and the stars were out. I saw 3 lights in a triangular shape move quickly across the sky from SSE to NNW. The lights were dim and there was no noise. The lights were solid and not blinking, they were white in color and just before it went out of view they switched positions. They could have been 1 craft rotating or 3 different craft switching positions. But the impression I got was that it was one craft with 3 lights. I watched the skies for a bit longer then went inside to text about it. I then went back outside about 15 minutes later and at about 2:20 am saw about 7-8 dim white lights in a line, each light slightly staggered from the previous one. This object moved as one object, it was likely a cigar shaped craft and it moved from North to South. It appeared to be higher in the sky than the first one I saw. I am a graduate student at Texas A&M and live in Bryan just over the College Station border."],"Viewing Distance":"Over 1 Mile, Unknown","Region":"Texas","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-96.332577","Date Submitted":"11/04/2011 04:25 UTC","Source":"MUFON","trends":["There have been 10 other sightings in College Station","There were no other sightings in College Station on or around November 4th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.634057,+-96.332577(33121)&iwloc=A&hl=en\"> mufon case (33121) map </A>","Disposition":"Unresolved","Latitude":"30.634057","Object Shape":"Triangle"}