{"Summary":"I saw object while driving. I watched it in the sky for 10-15 minutes. it was a large oval shape with white lights on perimiter. black color. It was dark out so not much detail. It was at least 500 ft from me and airborn the whole time.","Longitude":"-94.311793","files":["/var/www/straped/mufon/html2text/33137.html.txt","/var/www/straped/mufon/more/33137_submitter_file1__ufoscetch10312011001.jpg","/var/www/straped/mufon/org/33137.html"],"Date Submitted":"11/04/2011 08:14 UTC","Date of the Event":"10/31/2011 07:35 UTC","Country":"United States","Object Shape":"Blimp, Cigar, Oval","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Log Number":"US-11042011-0018","Region":"Missouri","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.919043,+-94.311793(33137)&iwloc=A&hl=en\"> mufon case (33137) map </A>","trends":["There have been 52 other sightings in Lee's Summit","There were 6 other sightings in Lee's Summit on or around October 31st 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","divs":["sighting detailshello margie kay, i am writing you about the ufo witnessed by john goslin on 10\\31\\2011. i saw this with my family on that night. we live in lees summit and we left home at nearly 7:35pm on our way to trick or treat at lees summit north high school. i pulled up to legacy wood and blackwell intersection and was object to south in sky. i turned right onto blackwell and it followed me as i went north. i turned west onto scruggs and saw it clearly until it passed over us near todd george and scruggs. it was large. white lights all over outside diameter of what may be considered a blimp shape. we pondered what it was. had my van windows rolled down and did not hear plane engines. do not believe this was the planes flying to arrowhead. i saw it dip as though it were a blimp as if it pointed nose down but it just didn't look like a blimp. it was too big and moving to fast at that time. it would have been a blimp going sideways to move as it was. after it passed over us and it headed toward the stadium, we concluded it must be the blimp for the chiefs football game. as we drove up to the lees summit north high school we saw what we think were the planes not sure if they were going to the stadium or preparing to go. this was when we pulled into the parking lot at lees summit north high school at 7:45pm. at that time we were pretty freaked out and not sure what to tell our children it was. we think we saw two different things in the sky. one being the planes and the other was unidentified. is there a craft on radar for this position and time that i have seen. my wife and children know what we saw was something that was not supposed to be here. not officially. i think the public safety was at risk by what was flying that night. if it was something not licenced or permitted it should be found and those responsible should be charged with suitable crimes. please contact me and let me tell you more. (information moved to fi box) cms 11\\06\\11 19:00 cdt flg"],"Case Number":"33137","City":"Lee's Summit","Latitude":"38.919043","Object Features":"Dome","Tags":"City"}