{"Case Number":"3313","Date Submitted":"02/21/2005 10:56 UTC","divs":["Sighting DetailsSighting Report: The following is an email sent from my son describing a UFO he and my boyfriend saw in the early morning hours of January 24, 2005. They were traveling on Hway 38, heading towards the coast for home, and had just passed the Scottsburg Bridge and noticed the lights over the Umpqua River. \"We were driving, obviously, and I noticed some lights on the water. The first thing I noticed was the way they were moving. Horizontally, but not bobbing as if in the water. Plus, they moved too smoothly to be any normal object moving across water without making a sound. That struck me as odd, and the color was also weird. It looked like a normal yellowish light, but as they moved it seemed to fade into blues and reds, and it never stayed solid. As I was watching the lights, I noticed I couldn t see past them. If I looked several feet above them I could see the trees on the mountain, but looking at and between them was black. I couldn t make out anything, as if trying to look around in pur darkness. The lights moved closer together, and seemed as if a couple of them were going in and out of each other. Again, this just seemed unnatural. They made no noise that I could hear.\" Well, I guess that s about it... Cory"],"Source":"MUFON","Log Number":"","Sighting Duration":"Undisclosed","Date of the Event":"02/21/2005 10:56 UTC","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in North Bend","There were no other sightings in North Bend on or around February 21st 2005"],"Country":"United States","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.406501,+-124.22428(3313)&iwloc=A&hl=en\"> mufon case (3313) map </A>","Region":"Oregon","Longitude":"-124.22428","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/3313.html.txt","/var/www/straped/mufon/org/3313.html"],"Tags":"City","Summary":"Not Provided","Latitude":"43.406501","Object Shape":"Undisclosed","Object Features":"Undisclosed","City":"North Bend","Disposition":"Unknown"}