{"Longitude":"-85.612942","divs":["Sighting DetailsMy girlfriend and I were standing in line at a store when somebody came inside to tell everyone about the \"three strange objects in the sky outside.\" I immediately high-tailed it to the parking lot to witness several very bright orange objects moving slowly from the eastern horizon toward the west. The objects were significantly brighter than stars and appeared orange, unlike any celestial objects I've ever seen. There were actually 5 objects visible - 3 objects were moving slowly from the east in a triangular formation following the contour of the earth at high altitude, and two more were already overhead and slowly circling each other, as they slowly faded from view as if passing behind a cloud, although the sky was completely clear. All of the objects slowly faded from view at nearly the same spot, slightly overhead. Two more objects appeared from the same direcion and followed in succession only to disappear in the same general location. These were not planes, meteorites, fireworks, or other very easily recognizable aerial objects. I take this subject very seriously, and make this report with the utmost humility and honesty."],"Sighting Duration":"Undisclosed","Object Features":"Unknown","trends":["There have been 13 other sightings in Traverse City","There were no other sightings in Traverse City on or around November 4th 2011"],"Country":"United States","Tags":"City","Date of the Event":"11/04/2011 10:30 UTC","Object Shape":"Star-like","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Summary":"Seven orange star-like objects moved slowly at apparent high altitude in formation, changing direction , some dramatically, and faded out of sight overhead.","map":"<A HREF = \"http://maps.google.com/maps?q=44.767277,+-85.612942(33146)&iwloc=A&hl=en\"> mufon case (33146) map </A>","City":"Traverse City","Region":"Michigan","Source":"MUFON","Date Submitted":"11/05/2011 12:18 UTC","Log Number":"US-11052011-0001","files":["/var/www/straped/mufon/html2text/33146.html.txt","/var/www/straped/mufon/org/33146.html"],"Latitude":"44.767277","Case Number":"33146","Disposition":"Unknown","Viewing Distance":"Over One Mile"}