{"Object Features":"None","Tags":"City","Sighting Duration":"01:00:00","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around November 4th 2011"],"Object Flight Path":"Path then hovering","Object Shape":"Sphere","Country":"United States","Log Number":"US-11042011-0025","divs":["Sighting Details I have seen a ball of light about the size of a large beach ball flying over columbus 5 times in the last year. Tonight at about 8:00 PM I was taking out the garbage and noticed it again. It was low in altitude, I would say less than 1000 feet over head flying from NW to SE toward downtown columbus. It looks like it's about the size of a large beach ball and it has a goldish orangish light that comes from it. This is no aircraft! I have flown as a private pilot for many years and know what aircraft look like. This object moved rapidly from the NW toward downtown, slowed down in speed as it approached down town and stopped completely in mid air. It has been there for over an hour stationary at this point. It is not the Columbus PD helicopter as it was flying west over the grandview area and it was not an aircraft making its turn to final approach into port Columbus. I am right by the final turn to port columbus and have seen just about every aircraft from commerical to military. This thing makes no sound and has no anti collision lights. It literally is a ball with goldish orangish light emitting from it. There were 2 others who witnessed this with me. I would love to know if anyone else is seeing this thing over columbus. Have you had anyone else report a similar object in the passed? I would love to know."],"Longitude":"-83.034526","Viewing Distance":"101-500 Feet","Case Number":"33144","Date of the Event":"11/04/2011 08:00 UTC","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=39.994103,+-83.034526(33144)&iwloc=A&hl=en\"> mufon case (33144) map </A>","Summary":"Moving NW to SE and Stopping over Columbus just west of City","files":["/var/www/straped/mufon/html2text/33144.html.txt","/var/www/straped/mufon/org/33144.html"],"City":"Columbus","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"11/04/2011 10:29 UTC","Weather Factors":"Unknown","Latitude":"39.994103"}