{"Disposition":"Unknown","Country":"United States","Longitude":"-82.053345","Object Shape":"Boomerang","Latitude":"34.489791","Object Features":"Other","files":["/var/www/straped/mufon/html2text/33148.html.txt","/var/www/straped/mufon/more/33148_submitter_file1__Mysigting.jpg","/var/www/straped/mufon/org/33148.html"],"Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=34.489791,+-82.053345(33148)&iwloc=A&hl=en\"> mufon case (33148) map </A>","City":"Laurens","Date Submitted":"11/05/2011 03:19 UTC","Summary":"Was Boomarang shaped with small red lights, that red lights didn't flash.","divs":["Sighting Details I was outside, smoking a cigerarette, It was about 2:00 AM in the morning. I noticied the object while I was looking up at the sky for shooting stars. I knew that I wasn't dreaming, because I saw it before, that first time i saw it I thought my eyes were playing tricks on me but after seeing it again, I know I really saw it the last time. The last time I saw it it was about 2:20 AM in the morning. Last time I saw it, it was moving kinda slow, it was kinda hazy or smoke filled in a way, it was boomarang shaped or V shaped, it had small red lights inside of it, but the lights were not blinking, and the object did not make a sound. it was low flying, it went right over the tree tops. That was about 6-10monthsw since i've seen it. I never saw it again, Until tonight, I was outside smoking just like I said earlier, star gazing, when I saw the object once again, but this time the object was moving faster, it was traveling in the same direction as before, but the red lights were fainter, and it was flying low just as before, that last time I saw it it was aroung 2:30AM, this time I saw it @ 2:11 AM. I don't know it it is a UFO, a satalight,a military experment Or a New Expermental plane, or a blimp, or a weather Balloon, Maybe you or someone else has some answers, I would like to know what this is or may be.I lost sight of it because it disappered. It did the same thing the first time I saw it. everytime I saw it was at nighttime If anyone has any answers as to what this could be I would Love to know. My feeling to seeing this object is what could it be? What is it? Why have I only seen it 2 times? Thanks."],"Sighting Duration":"00:00:11","Log Number":"US-11052011-0003","Tags":"City","Object Flight Path":"Straight-line path","Case Number":"33148","trends":["There has been one other sighting in Laurens","There were no other sightings in Laurens on or around November 5th 2011","This sighting has never been favorited.",""],"Region":"South Carolina","Weather Factors":"None","Date of the Event":"11/05/2011 02:11 UTC","Source":"MUFON"}