{"map":"<A HREF = \"http://maps.google.com/maps?q=29.688758,+-95.605712(33147)&iwloc=A&hl=en\"> mufon case (33147) map </A>","divs":["Sighting DetailsI went outside to have a cigarette. I was standing at the end of the playhouse in the back yard. I was facing the front of the house and I looked up at a commercial airplane (not sure what airline- southwest or continental, unknown) that I saw approaching from the NW direction. At the same time I noticed what at first appeared to be a small airplane off to the right of the other plane, but not parralel to it, I got the impression that it was maybe behind the larger plane but to the side. As I watched the plane I noticed that it didn't have any safety lights, no lights blinking on it at all, but it was as bright as a star only it looked to be a copper color.At that point I thought that what I was seeing was not a plane, but a falling star, however it occurred to me as I watched it that it was not speeding up or burning out, but it was keeping pace with the plane. Then it suddenly turned SW and as I kept watching it, it just suddenly vanished, it wasn't there at all. I even quickly moved to the back of the yard to see if I could spot it anywhere, but it never re-appeared in the area I was watching. The night was clear, no clouds blocking, stars were visible, planes clearly visible. I stayed outside for approximately 25 minutes still searching the sky to see if I saw it again or could somehow account for it's disappearance, but could not find it again. In that time period another large commercial plane flew over close to, but not exactly in the same flight path that the first plane I saw flew over. Many different aircraft fly over the area in which I reside daily as we are near 2 large and one small airport. I cannot tell you if it made any type of noise, there was other noises from traffic and the plane. I am not certain at what altitude the plane or object was at, or at what speed they were traveling, but I can probaly give you an estimate. I am also not certain what size it was due to not knowing for certain the altitude of the object. I could not make out any distinct features, it just glowed very brightly and moved quickly and smoothly. Very odd."],"Country":"United States","Object Shape":"Sphere, Star-like","Tags":"City","files":["/var/www/straped/mufon/html2text/33147.html.txt","/var/www/straped/mufon/org/33147.html"],"Source":"MUFON","Summary":"observed what I thought was small aircraft or falling star, following commercial airplane off to right","Sighting Duration":"00:01:30","Region":"Texas","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Date of the Event":"11/04/2011 08:27 UTC","Date Submitted":"11/05/2011 12:48 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Disposition":"Unknown","Log Number":"US-11052011-0002","Latitude":"29.688758","Longitude":"-95.605712","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around November 4th 2011"],"Case Number":"33147","City":"Houston"}