{"City":"Lawrenceville","Weather Factors":"Unknown","Log Number":"US-11052011-0007","Sighting Duration":"Undisclosed","Date of the Event":"11/04/2011 10:10 UTC","Tags":"City","trends":["There have been 14 other sightings in Lawrenceville","There were no other sightings in Lawrenceville on or around November 4th 2011"],"Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=33.957385,+-83.979982(33152)&iwloc=A&hl=en\"> mufon case (33152) map </A>","Disposition":"Unresolved","Region":"Georgia","Date Submitted":"11/05/2011 03:08 UTC","Case Number":"33152","divs":["Sighting DetailsI was driving home from work on Sugarloaf Parkway between Lawrenceville Hwy. and Five Forks Trickum at approximately 10:10pm. I saw a craft flying lower than normal (not as low as the tree line, but not as high as a small plane would fly). It seemed to be flying slower than would be possible for a plane, so it caught my attention. Then I noticed it had two flashing white lights and then two flashing red lights in sort of a cross or square pattern. I figured it was a small plane because of the flashing lights, but the fact that it was so low to the ground and was moving so slowly kept my attention. I kept my eye on it as much as possible as I drove down the road and it seemed as if it changed directions (like it made a sharp right turn), so I thought it was either a helicopter or a trick of the eye as I was driving. I lost sight of it, but then when I arrived at my home (less than five minutes later) I saw the object again directly over me (which was odd since it was now flying in the complete opposite direction of when I last saw it). I was out of the car, standing still and it was moving very slowly overhead. We are directly beneath the regular flight path of jets heading toward Atlanta airport, so I'm very familiar with jet traffic in the area (which are much higher in the sky, but I can still hear them powering down as they prepare to land at Hartsfield, about 40 miles south). At the same time the object was flying over me going north, a regular jet was flying overhead south toward Atlanta and I could clearly hear it. In less than a minute the jet was completely gone and I could not hear it anymore, however, the lower object was still slowly flying over me, and that's when I realized that the lower object was not making any noise (so it was clearly not a plane or a helicopter). It made its way over the tree line and was gone. I stayed out waiting to see if it would come back for another hour, but it didn't. However, a small plane did fly overhead (because I am near a small local airport) and I could clearly hear that it was a plane and it gave me a good reference for what altitude the small planes in the area fly. The object I saw was definitely much lower than that plane. I want to say that it was a box shape, but I'm only basing that on the fact that the two white lights and two red lights were at four corners, but they almost appeared to be on one flat side rather than around an object. The two white lights flashed together and the two red lights flashed together. So, I can't really say what shape it was, maybe flat, maybe square, maybe diamond shaped. It seemed more like it was meandering along quietly rather than hovering. Almost like it was making a sweep of the area. I tried to take a video of it with my phone, but I only got it for a second, so you can't really see anything. I don't know what it was, but it was definitely unusual and I would be interested if anyone else has seen anything similar in the area."],"files":["/var/www/straped/mufon/html2text/33152.html.txt","/var/www/straped/mufon/org/33152.html"],"Longitude":"-83.979982","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"United States","Object Features":"Unknown","Latitude":"33.957385","Summary":"Slow, silent, low flying object with red and white flashing lights that changed directions multiple times.","Source":"MUFON","Viewing Distance":"101-500 Feet"}