{"divs":["Sighting DetailsI was driving home on bridge street in farihaven mass towards mattapoisett mass. and the end ot the road is a stop sign, at which point you take a 90 degree turn left or right. as i was rolling up to the stop sign, i looked up and noticed three orange bright lights in the sky across the street about 100 yards away over the woods. at first i thought it was just a radio tower and i looked away but then it hit me there are none in that area so i quickly looked back. the lights formed a right triangle O O O in that pattern. the orb all the way to the right began to flicker and slowly move further away from the other two orbs. once it moved for about 20 sec they all just vanished at the same time. from where i was the orbs looked to be about the size of a golf ball if you held it an arms length away from you. once they disappeared i threw my car into reverse and drove down the road further away from the stop sign and then put it into drive and went back to the stop sign to see if i lost sight of them just by the angle i was looking at them but they were no longer visible."],"Case Number":"33158","Latitude":"41.647915","Object Flight Path":"Hovering then path","Object Shape":"Triangle","Object Features":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"11/05/2011 09:30 UTC","Longitude":"-70.882646","Log Number":"US-11052011-0013","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33158.html.txt","/var/www/straped/mufon/org/33158.html"],"Region":"Massachusetts","trends":["There have been 2 other sightings in Fairhaven","There were no other sightings in Fairhaven on or around November 5th 2011"],"Country":"United States","City":"Fairhaven","Date Submitted":"11/05/2011 10:46 UTC","Weather Factors":"Unknown","Summary":"three glowing orange lights formed right triangle, one light moved further away from other two then all vanished","map":"<A HREF = \"http://maps.google.com/maps?q=41.647915,+-70.882646(33158)&iwloc=A&hl=en\"> mufon case (33158) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}