{"Country":"Canada","divs":["Sighting DetailsI was getting a book to read to my kid at night when I saw an extremely bright orange light in the sky over lake Ontario. I called my husband over to see it and asked what he thought it was. I had decided it was a UFO, he thought it was a safety flare from a boat on the water. He went into our kids room, and while he was there a second orb appeared to the left and higher than the first. I called him back in to see. He agreed that it was strange. Then the 2nd one disappeared and a third appeared to the right of the original orb. Most times. The original one was there, though it would fade away, almost fizzle out. Then it would reappear and disappear. The 2nd and 3rd would appear as well, but not as often as the first point. They would just sit and hover there, These bright almost sun like orange orbs. At one point when the 2nd appeared, it appeared right beside the first, to where we though it was plane headlights, then it moved above the first and then merged with it. Whenthe lights would appear and reappear it was almost like a flame burning and going out. The maximum I stayed the inthe sky without disappearing was 20mins. Thus was not a flare. It was not a plane. It barely moved. It was a bit of a distance from us over the water the water. Not far from the nuclear powerplant, but not that close either. My skeptic husband has even decided it's a UFO. They orange orbs looked exactly like the photos of orange UFO that I googled on the computer. Finally around 9:45 the light fizzled out for good and didn't come back n"],"Tags":"City","Date Submitted":"11/05/2011 09:20 UTC","Object Shape":"Sphere","Longitude":"-79.254609","Latitude":"43.777649","Object Features":"Unknown","Date of the Event":"11/03/2011 07:33 UTC","Summary":"2-3 lights hovered over lake ontario east of the Scarborough Bluffs for hours.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.777649,+-79.254609(33150)&iwloc=A&hl=en\"> mufon case (33150) map </A>","Log Number":"CA-11052011-0005","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around November 3rd 2011"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33150.html.txt","/var/www/straped/mufon/org/33150.html"],"Case Number":"33150","Viewing Distance":"Unknown","Region":"Ontario","City":"Toronto","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Stationary"}