{"Latitude":"36.394216","Longitude":"-87.036668","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=36.394216,+-87.036668(33155)&iwloc=A&hl=en\"> mufon case (33155) map </A>","divs":["Sighting DetailsMy wife and I were sitting on our front porch around midnight. We live out in the country and did not have any of our outside lights on--we like to look at the stars. After about 5 minutes of sitting there, my wife said, \"Is that a helicopter or plane?\" I looked where she was pointing and saw what appeared to be the lights (red blinking and solid white) of a helicopter or plane just above the tree line. The lights were far enough apart for me to believe it was a helicopter less than a mile away. But we should have been able to hear it...so at this point I was thinking it was a plane further away. But then things became bizzare; the white solid light began moving away from the blinking red light at a very rapid rate of speed--at least twice as fast. So at this point I was thinking it couldn't be a plane further away because the other light couldn't possibly move that fast. So at this point I was thinking it was a closer helicopter again chasing some smaller object with the solid white light. But if it were closer, why couldn't we hear anything? We watched as the white light was far enough away to disappear behind the tree line and then a minute later the helicopter disappeared behind the tree line too. We first saw it when it was basically directly in from of us to the North and watched as both lights headed East in a straight line and disappeared within one minute. I do not know what it was that we saw, but being the rational person I am it must have been the airforce testing some small aircraft and following it with another plane. They were heading toward Fort Campbell which is about a 45 minute drive from our house."],"Country":"United States","Object Features":"Undisclosed","Date of the Event":"09/02/2011 12:00 UTC","Tags":"City","Sighting Duration":"00:01:00","Object Shape":"Unknown","Log Number":"US-11052011-0010","City":"Pleasant View","Summary":"Small (star like) light being followed by what appeared to be a plane or helicopter.","Case Number":"33155","Disposition":"IFO","Date Submitted":"11/05/2011 09:21 UTC","Weather Factors":"Unknown","Region":"Tennessee","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/33155.html.txt","/var/www/straped/mufon/org/33155.html"],"trends":["There has been one other sighting in Pleasant View","There were no other sightings in Pleasant View on or around September 2nd 2011"]}