{"Object Features":"Unknown","Country":"United States","Longitude":"-74.961902","Summary":"Two brilliant Red Glowing Orbs moving slowly from Eeast to West then leaving the area at an incredible high rate of speed and blinked out.","Tags":"City","Date Submitted":"11/05/2011 10:01 UTC","Log Number":"US-11052011-0011","Source":"MUFON","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Latitude":"40.112219","divs":["Sighting DetailsThis is my second sighting in 6 weeks and I consider myself privileged to have had two sightings in one lifetime. This one kind of gave me the jitters. This sighting took place November 5th at 17:16 hours. My wife and I just finished working on our home and had to go to pick up the wife's car that her son had at his work. While she went inside I waited in the parking lot outside the store. Something caught my attention out the corner of my eye. When I looked up there was a glowing Red Orb coming acrossed the sky moving from East to West very slowly until it passed over head. I went into the store and told everyone to come out to witness a UFO or Orb. Only 2 employees came out to watch the glowing Orb. It then picked up an incredible rate of speed and within 3 or 4 seconds it was almost out of site when it blinked out and disappeared. It was incredible and the people were amazed and went back into the store. About 30 seconds later a second Red Orb came into view following the same trajectory as the first. I ran back into the store and yelled that another Orb is coming a crossed the sky again. This time about 4 or 5 of us were now outside to watch the Orb and were amazed at what we were seeing. It again did the same exact thing as the first and blinked out. After all the excitement was over my wife and I went to get a bite to eat at Burger King in the same shopping center. When we came out 15 minutes later after eating we noticed 5 Large Aircraft circling and criss crossing as if in a grid search. We left that area and was going home when I called my brother and told him what had just happened. He thought I was nuts and told me he had guests over and couldn't talk long. He said so if I go outside I'm going to see all the aircraft. I said \"yes and that I will be at his house in about one minute\". As I pulled up he was walking out front of his house with his guest and said so where are all the aircraft? I said look up brother and when he and his guest saw them he couldn't believe what he was watching. He was quite surprised and said that he was not sure what they were. He said they are not fighters since he knows what fighter aircraft were after being on the USS Enterprise in an A6 squadron. All five aircraft were identical to each other and no sound. They were circling and criss crossing for almost one hour and then headed back toward McGuire AFB in New Jersey. This is the second time in 6 weeks that ORBS were in this area. The first time they were white ORBS and this time they were RED. The description of the ORBS were star-like shaped and were bright red and pulsating. At first they looked like they were just floating through the sky then took off at an incredible speed and blinked out. I tried to take pictures with my camera phone but there was too much white light from the parking lot."],"Region":"Pennsylvania","trends":["There have been 10 other sightings in Bensalem","There were no other sightings in Bensalem on or around November 5th 2011"],"Date of the Event":"11/05/2011 07:16 UTC","Disposition":"Unresolved","Object Shape":"Circle, Fireball, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/33156.html.txt","/var/www/straped/mufon/org/33156.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.112219,+-74.961902(33156)&iwloc=A&hl=en\"> mufon case (33156) map </A>","Weather Factors":"Unknown","Case Number":"33156","Viewing Distance":"Over 1 Mile, Unknown","City":"Bensalem"}