{"Object Shape":"Undisclosed","Region":"Pennsylvania","Country":"United States","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around March 16th 2005"],"City":"Philadelphia","divs":["Sighting DetailsSighting Report: this was january 1st 2002 at approximately 4:20pm. sky was clear, still daylight. i had just started my security rounds at my post which was at a warehouse in NE Philadelphia near the county correctional facility. i watched an airplane flying overhead( probably just taking off from phila. international judging from the altitude) and saw the object hovering in the air close by. the object was an inverted black pyramid. there were no noticable features on it. no markings, windows, lights, jets, nothing. it appeared t be solid. after a minute it began to move.it made no sound. at first i thought it could be a balloon or something similar. but its altitude, speed and direction remained steady as it flew over I-95. i expected to see the cars under it ot slow down or stop. none did. it seemed to be spinning slightly. i could see the sun reflected off of each side that faced it. after maybe five minutes, it vanished. i don t know if it took off faster than i could see, but one minute it was there, clear as day, then it just wasn t. people have asked if maybe i was hungover from new year s. knowing that i had to work that day for the first time ever, that was the first time i did not drink on new year s eve. i would feel better if this was that black triangle that s commonly reported.it isn t. i have searched unsuccessfully since then for similar reports or pictures of it. this is the only \"craft\" sighting, but a week later i saw what i ve seen called an orb hovering briefly over the warehouse."],"Disposition":"Insufficient Data","Summary":"Not Provided","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Source":"MUFON","Latitude":"39.955095","Tags":"City","Case Number":"3315","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/3315.html.txt","/var/www/straped/mufon/org/3315.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.955095,+-75.159109(3315)&iwloc=A&hl=en\"> mufon case (3315) map </A>","Weather Factors":"Unknown","Log Number":"","Longitude":"-75.159109","Date Submitted":"03/16/2005 12:00 UTC","Date of the Event":"03/16/2005 12:00 UTC"}