{"Region":"Georgia","Date of the Event":"11/01/2011 03:30 UTC","Longitude":"-83.917258","Object Features":"Unknown","Latitude":"33.866392","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/33157.html.txt","/var/www/straped/mufon/org/33157.html"],"Case Number":"33157","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Unknown","Weather Factors":"Unknown","City":"Loganville","trends":["There have been no other sightings in Loganville","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.866392,+-83.917258(33157)&iwloc=A&hl=en\"> mufon case (33157) map </A>","Summary":"I awoke to a horrible, terrifying sound of an oscillating hum, low and high in pitch.","Log Number":"US-11052011-0012","divs":["Sighting DetailsI was awaken to my room vibrating around three am Tuesday morning. I felt and heard this OVER my TV on a volume of 20, on a 1-70 volume span. I expected the sound to go away when I turned off my TV and computer, instead it doubled in clarity. I went outside at this point in time (3:30am) and heard the most terrifying sound I have ever heard. The duration was until I fell asleep sometime after 5:30am. The sound was an oscillating hum, low in frequency, accompanied by the sound of mass air being moved, and a high pitch squeal that changed pitch in accordance with the hum. The sounds sounded to be coming from every direction of the sky. There was also an intermittent \"jet engine\" type sound, that sounded like a jet coming towards you, but would stop after only 2 or so seconds of the sound. Almost like a huge blow off valve maybe? I fell asleep listening to the sound, that never got quiet. (with windows closed) The next few nights of staying up late to record the sound has proved to be useless as the sound has yet to return. This sound was EXTREMELY eerie, and left me feeling very stressed over the next few days."],"Object Shape":"Unknown","Disposition":"Unresolved","Date Submitted":"11/05/2011 10:27 UTC","Country":"United States"}