{"files":["/var/www/straped/mufon/html2text/33161.html.txt","/var/www/straped/mufon/org/33161.html"],"Log Number":"US-11062011-0002","Object Features":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"33161","Date Submitted":"11/06/2011 12:24 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.605593,+-83.181526(33161)&iwloc=A&hl=en\"> mufon case (33161) map </A>","Tags":"City","Disposition":"Unknown","Date of the Event":"11/05/2011 08:15 UTC","trends":["There have been 18 other sightings in Troy","There were no other sightings in Troy on or around November 5th 2011"],"Latitude":"42.605593","divs":["Sighting DetailsA series of orange-red orb like lights in the northeastern sky, parallel at the time to Northern Cross, which was in the northwestern sky. Drifted across the sky, for the most part, in a straigth horizontal line. At the same point on this path, each of them disappeared. The lights appeared out of nowhere in the east and moved toward the west. They moved at a steady pace and did not wobble or move off course. More than 14 appeared. The first group was a line of 5. Most were in a straight line, one was lower. The next group had three that formed a triangle. The last few came individually. There was an airplane visible in the same general area, revealed by its blinking white lights. The sky was entirely clear, zero cloud cover. Stars very bright and visible. We were driving south down Rochester Road in Troy, MI when we saw the lights behind us to our right. We stopped and viewed them for approximately 10-15 minutes, until none appeared."],"Country":"United States","Object Shape":"Sphere","Object Flight Path":"Stationary","Region":"Michigan","Longitude":"-83.181526","City":"Troy","Summary":"A series of orange-red orb like lights in the eastern sky, parallel at the time to Northern Cross. Drifted across the sky, for the most part, in a straigth horizontal line. At the same point on this path, each of them disappeared. More than 14","Weather Factors":"Unknown"}