{"Case Number":"33160","Date Submitted":"11/06/2011 12:13 UTC","divs":["Sighting DetailsOn November 5, 2011 at 12:45 pm visibility was unlimited, with a few cirrus clouds in the southern sky, while playing fetch with our dog at a park on a plateau in central Toronto, Canada, an aircraft was noticed moving from the southeast towards the northwest At first when it was noticed by my girlfriend, it was staying at the same altitude and thought to be a white blimp type aircraft. She noticed that it did not appear to be in a normal flight pattern as usually seen from the park with commercial aircraft that are landing at the Pearson International Airport and that it was moving slowly. There was some unusual banded marks around the centre that looked like rings that went around the centre of the aircraft that were elevated slightly from the surface. She thought I could identify it and brought it to my attention since I had spent several years with military aircraft. There was no noise emanating from the aircraft. The commercial aircraft that we normally see in the area are usually in the landing pattern of Pearson International and you can hear the aircraft engines as they ascend and descend. I thought it was a Porter Airlines Bombardier Q 400 flying out of Billy Bishop ( formerly Toronto Island) Airport heading towards a northwest Ontario destination ascending from 3000 feet to 5000 feet. The vertical stabilizers of Porter aircraft are painted in a blue theme so I thought the tail was blending in with the blue sky and the aircraft was banking so that the wings and turbo prop nacelles were at a 90 degree angle and so were not visible. So I waited a few seconds for the angle of sight to change and it became apparent that there were no tail services or wings visible. All that was visible was a white fuselage with no visible means of support and the aircraft then began to ascend rapidly from 5000 feet to 20,000 feet. It's heading then changed to due north and it accelerated to what appeared to be over Mach 2 with no sound and rapidly disappeared from view. We were somewhat astonished that we had witnessed this on a clear day over a major city."],"Sighting Duration":"Undisclosed","Source":"MUFON","City":"Undisclosed","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/33160.html.txt","/var/www/straped/mufon/org/33160.html"],"Latitude":"51.263285","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Ontario","Object Features":"Patterned Surface","Summary":"moved from SE to NW ascended from 3000 ft to 5000 ft then 5000 to 20000 ft in 3 sec turned north and exited at over Mach 2 with no sound.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.263285,+-85.319294(33160)&iwloc=A&hl=en\"> mufon case (33160) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-85.319294","trends":[],"Object Shape":"Blimp, Cigar, Cylinder","Date of the Event":"11/05/2011 12:45 UTC","Country":"Canada","Log Number":"CA-11062011-0001"}