{"Log Number":"US-11062011-0010","Object Flight Path":"Straight-line path","Date of the Event":"11/05/2011 06:20 UTC","Object Features":"Unknown","Viewing Distance":"Over One Mile","Tags":"City","Date Submitted":"11/06/2011 11:40 UTC","Object Shape":"Star-like","Region":"Colorado","files":["/var/www/straped/mufon/html2text/33169.html.txt","/var/www/straped/mufon/org/33169.html"],"Sighting Duration":"Undisclosed","Case Number":"33169","trends":["There have been 2 other sightings in Walsenburg","There were no other sightings in Walsenburg on or around November 5th 2011"],"divs":["sighting detailswas outside at dusk watching the evening stars start to appear when i noticed a very bright one i hadn't seen before. then noticed it was moving due east. my first thought was that it was the asteroid that was making the close approach to earth. i watched it move in a very direct path and as it moved it got noticebly smaller and fainter until it dissapeared over the horizon. all of this took about 5 min. i went inside and looked up the ateroid only to find out it wasnt going to be visible to the naked eye and not even to telescopes until the 8th. this was not a plane and it was still too light out to have seen a satellite, plus satellites dont appear this big and then get noticebly smaller. as a reference when i first saw it i would say it was twice as big and bright as the brightets planet visible in the east which i believe is venus. from my vantage point, venus is about 10 degrees above the horizon by the time the sun has faded enought to see, and this object appeared at about 30 degrees and then moved due east until it went beyond the horiazon. would be curious if anyone else witnessed. thanks much (name removed to fi field) cms 11\\06\\11 17:27 cdt walsenburg co"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.627079,+-104.771154(33169)&iwloc=A&hl=en\"> mufon case (33169) map </A>","City":"Walsenburg","Latitude":"37.627079","Weather Factors":"Unknown","Longitude":"-104.771154","Disposition":"IFO","Summary":"Object moved due east and dissapeared over horizon","Country":"United States","Source":"MUFON"}