{"Log Number":"US-11062011-0004","Object Features":"Undisclosed","Date Submitted":"11/06/2011 01:57 UTC","Tags":"City","Latitude":"33.947804","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33163.html.txt","/var/www/straped/mufon/org/33163.html"],"Region":"California","Disposition":"Unknown","Longitude":"-118.130749","map":"<A HREF = \"http://maps.google.com/maps?q=33.947804,+-118.130749(33163)&iwloc=A&hl=en\"> mufon case (33163) map </A>","trends":["There have been 9 other sightings in Downey","There were no other sightings in Downey on or around November 5th 2011"],"City":"Downey","Case Number":"33163","Object Flight Path":"Stationary,Hovering then path","Summary":"round sphere like objects appearing and dissappearing in groups and formations.","Object Shape":"Sphere, Triangle","Date of the Event":"11/05/2011 02:00 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was out side in the back yard during the day and i noticed a couple of little white spheres floating around in between the clouds at a rather high altitude. There was two connected to each other and they didn't seem to move with the wind but they were changing position constantly. Then i saw a mass of about five more in a kind of geometric shape again not moving with the wind but always rotating the points of each sphere that made up the mass. I know most people would say that's just a bunch of balloons but the wind was 7 mph ssw and these guys just weren't moving that way.How ever someone in the area did release a bunch of reflective multicolored Mylar balloons around the same time and these did in fact float directly past my stationary UFO objects. Once i started observing these objects more intensely the spheres would disappear and reappear in groups and shapes in different locations.This seamed kind of like a game, if i had doubt about what i was seeing i could pick a new place to look in the sky that was clear and they would appear there out of thin air. NO movement to or from those points in the sky, they would just materialize. This lasted from about 2 in the afternoon until sun down. These objects formed triangle formations composed of three spheres spaced out at least 80 to 100 feet apart and stayed in one place for up to ten minutes.They appeared in groups of two at closer distances and orbited each other in a circle like pattern. And the they also appeared and disappeared in line pasterns composed of 3 to 4 spheres lined up in a row. one on the end of the line pattern would disappear and re appear at the front of the row of spheres continuously. Every thing i saw these objects do seemed like it was designed to get my attention and show a sign of intelligence. These little guys were so interactive it was amazing. If i thought of two, one, or three of them, that many would appear were i was looking up at! The only other activity i found could be related is that when this all occurs animals tend to act funny. Birds would circle the area like they were trying to get there bearings and dogs would bark for a little bit when the sighting first starts up. Also i cant forget to mention that i have witnessed planes fly at these objects or directly were they had been moments ago as if they are tracking the spheres or attempting to move them along."],"Weather Factors":"Unknown"}