{"Date of the Event":"10/10/2011 07:12 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Unknown","Region":"North Carolina","Date Submitted":"11/06/2011 02:41 UTC","Country":"United States","Log Number":"US-11062011-0005","Case Number":"33164","City":"Walkertown","Tags":"City","Longitude":"-80.150851","divs":["Sighting DetailsIt was Oct. 10, 2011 at approx. 7:12am. I was driving down a back road towards Walkertown, NC to scout some potential hunting land I had gained permission to hunt this year. As I was driving, a flock of canadian geese caught my attention flying just north of me. As I watched the geese gain height out of this field, I caught a glimpse of a large object disappear behind some trees on the other side of the field. I slowed down and pulled to the side of the road. After waiting several minutes, I observed the object just east of my location. At first, because of the distance I thought it may be a large military air-craft. I have seen large planes in this area before as the airport is not that far away. As it got a little closer, I could clearly see that this was no plane. I must say that I was very uncomfortable about what I was seeing. As it got closer I could see that this was something I was not suppose to be seeing. I even questioned myself at the time. I can't begin to explain why I stood there and watched the object, because the sight of it really scared me. The object was rectangle and was about maybe 2 or 300 feet in length. There were 4 amber colored pulsating lights on the rear of it. They seemed to get brighter as the object moved up the field and dim as it hovered. There was an arm-like structure connected to the right side of it. It almost looked like some type of camera arm. It was round, tube shaped and extended down toward the ground. I could see that the very end of it was black looking in color. The entire object was a dull silver color and had a rough looking surface on the bottom. It continued to hover slowly over the far end of the field. All of a sudden, it started moving up the field and slowly banked to the right. When it made this turn, I was able to see the top right side of it. Again, it was a dull silver color and was rough looking. I did not hear no sound coming from it. It was about 450 to maybe 500 yards across the field from where I was standing beside my truck. I continued to watch the object as it flew up towards the upper end of the field. Again, it stopped and hovered as if looking for something. After hovering it again banked right and disappeared behind the trees. Upon standing there and watching it go behind the trees, I could not help but to get into my truck and try and follow it. Once I was able to reach the next road to turn down, it was a dead-end. I never saw it again. I have told no one about this besides a friend of mine and he suggested reporting it here. This was not a man-made object, I stood there for about 4 or 5 minutes watching it. I have never seen anything that I could compare it to. I can't get what I saw off my mind. It has gotten so bad that I tend to talk about stuff like this to friends and family never discussing what I actually saw but instead just venting to try and calm my thoughts about it. I don't want to be labeled as crazy but, I know what I saw. I have not drawn a picture pertaining to what I saw because I am trying to forget about it, but I can submit one if needed."],"trends":["There has been one other sighting in Walkertown","There were no other sightings in Walkertown on or around October 10th 2011"],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Object Shape":"Square, Rectagular","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"36.184585","Object Features":"Patterned Surface, Appendage(s)","files":["/var/www/straped/mufon/html2text/33164.html.txt","/var/www/straped/mufon/org/33164.html"],"Summary":"Very Large object observed in the country over an open field during am hours","map":"<A HREF = \"http://maps.google.com/maps?q=36.184585,+-80.150851(33164)&iwloc=A&hl=en\"> mufon case (33164) map </A>"}