{"Longitude":"-77.576609","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/33168.html.txt","/var/www/straped/mufon/org/33168.html"],"trends":["There has been one other sighting in Richlands","There were no other sightings in Richlands on or around November 15th 2009"],"Source":"MUFON","Date Submitted":"11/06/2011 11:14 UTC","Log Number":"US-11062011-0009","Summary":"Nighttime black triangle with 3 white lights, no noise, straight flight path.","Tags":"City","divs":["Sighting DetailsMy sighting took place in Richlands, NC, near USMC Camp Lejeune. I've never been in the military, nor a pilot, but I am a fan of military aviation and flight simulation, come from a military family and am very familiar with all types of military aircraft. It was, I believe, late fall or early winter, the end of the year, in 2009. I had taken the dog out on a leash into the back yard. I'm not sure of the exact time, but it was dark, with a clear sky, and I could see the stars well. While the dog was doing its business, I stood motionless, just looking up at the stars, enjoying the crisp night air. I may have been staring at a single point in the sky, hoping to spot a satellite with my peripheral vision. What I saw was at first just a single tiny, white, unblinking light moving across the sky above--but then I realized it was accompanied by two other identical lights, flying in a triangular formation. Once I made that realization, I noticed that the area between the lights was devoid of any stars--it was a solid triangular craft that made no noise whatsoever, left no visible exhaust, had no colored or blinking lights of any kind. I am unable to say with any certainty the altitude of the craft, but my guess is that it was fairly large and 5 to 10-thousand feet up. It moved quickly across the portion of the sky visible directly over my position, in a straight line, without any unusual maneuvers. I remember thinking how ridiculous it was for me to see this thing so suddenly and unexpectedly, and for it not only to be flying over a town instead of a remote rural location, but for it to be in such close proximity to a major military installation. Sure, it could be something covert and man-made... and I'm not claiming it isn't, but it does fit that 'triangular UFO' shape that seems fairly common these days."],"Date of the Event":"11/15/2009 12:00 UTC","Object Flight Path":"Straight-line path","Object Shape":"Triangle","Disposition":"Hoax","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.888528,+-77.576609(33168)&iwloc=A&hl=en\"> mufon case (33168) map </A>","Region":"North Carolina","City":"Richlands","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"33168","Weather Factors":"Unknown","Latitude":"34.888528"}