{"Region":"Missouri","Tags":"City","Log Number":"US-11062011-0011","divs":["Sighting DetailsJust sitting in my living room watching tv when the lights appeared in the east. I thought it was a Haloween prank. It moved like Looking Glass moves when in slow flight out of Offut field in Omaha, but it was dark, and the only visible thing was the ring of about 9 bright, white lights that were boomerang shaped with the front of the boomerang in front. Could not tell how high it was, and my guesses on elevation assume something like a 747. When it turned to the west it was approximately over the new Tudor Road that is just south of my house. I didn't go to the west window to look at it since I thought it was a prank. I thought it might be a small aircraft pulling a series of kites with flares on each one. No noise noticed, but I was inside and my hearing is not good and I also have tinitis. The flares looked bright white, but I observed them through a window that is treated with low-e coating and it is loaded with Argon. I do not use glasses for far vision, and I have good far vision. I read about similar reports in the Lees Summit paper earlier this week, so I thought I had better add my two cents. I did not note the time exactly. Too bad I didn't have a camera handy."],"Case Number":"33171","Latitude":"38.934423","Summary":"saw 9 outlining lights slowly approaching from se to ne then turning to head due-w; large like a 747 might in slow flight","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33171.html.txt","/var/www/straped/mufon/org/33171.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.934423,+-94.348601(33171)&iwloc=A&hl=en\"> mufon case (33171) map </A>","Object Features":"Unknown","Sighting Duration":"00:04:00","Disposition":"Unknown","City":"Lee's Summit","Longitude":"-94.348601","Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There have been 52 other sightings in Lee's Summit","There were 6 other sightings in Lee's Summit on or around October 31st 2011"],"Date Submitted":"11/06/2011 05:53 UTC","Object Flight Path":"Other","Object Shape":"Chevron, Oval","Country":"United States","Date of the Event":"10/31/2011 07:00 UTC"}