{"Sighting Duration":"02:00:00","Date of the Event":"11/05/2011 12:00 UTC","City":"Ocala","Latitude":"29.012706","files":["/var/www/straped/mufon/html2text/33174.html.txt","/var/www/straped/mufon/org/33174.html"],"Log Number":"US-11062011-0014","Source":"MUFON","trends":["There have been 21 other sightings in Ocala","There were no other sightings in Ocala on or around November 5th 2011"],"Object Shape":"Disc, Flash, Star-like","divs":["Sighting DetailsI live on a farm that faces a major highway. I took the dogs out before going to bed and I was star gazing, as I always do when I am out with the dogs at night, when I first noticed the object. At first it looked like a star, but since I am always looking at the same sky, it looked out of place. I had never noticed such a bright \"star\" before. As I continued to look at it, I realized it was flashing different color lights and started to make a pendulum like movement but very lightly. That is when I ran in the house to get my husband and binoculars. With the binoculars I could see the object more clearly. At first it was flat on the top with little red, green, blue and yellow lights flashing, but emitting a net like appearance on the bottom. it looked almost like a disco ball on the bottom with the different lights. About an hour later, as I continued to watch I saw an airplane come by and we thought it was coming to investigate the object. As the airplane approached the object, the net like aura that appeared on the bottom part of the object was like retracted and the object shifted from its original location and that is when I could see clearly the dish shaped object with a bright light on top and the little flashing lights going around. It stayed like that for a short time (a few minutes) then it moved again. As time went by the object would move a little higher and a little higher until it was impossible to see any detail, not even with the binoculars. In addition to me, both my husband and daughter witnessed it. We were all shocked at first and just in total disbelieve of what we had witnessed. To prove to myself what I had seen the next night I went out and looked for it, but there was nothing there other than the stars that are regularly there."],"Object Features":"Unknown","Tags":"City","Longitude":"-82.163727","Country":"United States","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=29.012706,+-82.163727(33174)&iwloc=A&hl=en\"> mufon case (33174) map </A>","Case Number":"33174","Date Submitted":"11/06/2011 07:28 UTC","Viewing Distance":"Unknown","Summary":"Initially appeared to be a star until lights started flashing","Weather Factors":"Unknown","Object Flight Path":"Stationary","Disposition":"Unknown"}