{"Date of the Event":"10/13/2011 10:30 UTC","Region":"Nova Scotia","trends":["There have been 22 other sightings in Halifax","There was one other sighting in Halifax on or around October 13th 2011","This sighting has never been favorited.",""],"Object Features":"Unknown","divs":["Sighting DetailsOn October 13th, 2011 our cruise ship, The Carnival Glory was headed south from Halifax, Nova Scotia towards New York City. The weather was rather unpleasant that night and my wife and I had just returned to our stateroom after eating dinner. It was cold, dark and kind of stormy outside but I wanted a cigarette so I threw on a bathrobe over my clothes to keep warm and went out and sat down and lit up a smoke. The next thing that happened was the most amazing thing that's ever happened to me in my life. I am 57 years old and am a very skeptical person. I am not religious and do not believe in Bigfoot, ghost and that sort of thing. I have always believed in UFO's but have never been able to be sure about them because I never saw one myself before. That all changed when I was sitting out on the balcony having a smoke that night. The next thing I know a silent cylinder with rounded ends comes into view, flying silently from the south heading north. It couldn't have been more than 300 feet from me and about 150 feet above the water. As it reached the back of the ship it angled down and then curved around the back of the ship and was gone. I stayed outside about 20 more minutes hoping it would return with no luck. The entire incident only took about 6 seconds from start to finish but I am now convinced that UFO's are real. It was silent and it didn't appear to be emitting any light of its own. It glowed because our cruise ship was lit up like a Christmas tree and the light from the ship was what illuminated the object. I think I wouldn't have seen it at all had it been farther from the ship. Looking back I now wish I would have reported it to the authorities on the ship. If someone was on the bridge they had to see it as well so there must be some sort of record. Their is a bow camera that may have filmed it as well. I have been looking for other reports from that night but the weather was so nasty it's possible I was the only passenger who happened to be out on the balcony at the time this thing passed by us. My gut feelings tell me that it spotted us and swooped in close to check us out just as a tourist would pull off the road to see something. Anyway, I know what I saw and I now have absolutely no doubt at all that we are not alone. I also understand when I hear someone say they saw something that seemed to be otherworldly because this sure didn't seem to be military."],"Summary":"Closeup Sighting of Silent Craft - Update From My Original Report","Longitude":"-63.565352","Latitude":"44.658281","Object Shape":"Cylinder","Sighting Duration":"00:00:06","Country":"Canada","Log Number":"CA-11062011-0020","Weather Factors":"Unknown","Date Submitted":"11/06/2011 10:40 UTC","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","City":"Halifax","map":"<A HREF = \"http://maps.google.com/maps?q=44.658281,+-63.565352(33179)&iwloc=A&hl=en\"> mufon case (33179) map </A>","files":["/var/www/straped/mufon/html2text/33179.html.txt","/var/www/straped/mufon/more/33179_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/33179.html"],"Tags":"City","Case Number":"33179","Source":"MUFON","Disposition":"Unresolved"}