{"Tags":"City","trends":["There have been no other sightings in Prosper","This sighting has been favorited 1 time."],"Object Flight Path":"Straight-line path","Latitude":"33.236228","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.236228,+-96.80111(33185)&iwloc=A&hl=en\"> mufon case (33185) map </A>","Log Number":"US-11072011-0004","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-96.80111","Summary":"Boomerang shaped large object flying directly north to south at high altitude emitting no sound.","Country":"United States","Case Number":"33185","divs":["Sighting DetailsOn the evening of Sept. 19, 2011 - around 7:30pm, my wife, my little boy and I walked about a mile up the street from our north Texas home to an Elementary School so that our little boy could use the playground...and we could wear him out to get ready for nap time later. We spent about 30-45 minutes at the playground as the skies quickly became dark and night fell. We stayed a while after it got dark and decided it was time to walk back home. As we proceeded to walk north down Church St., we noticed that the skies were very clear, as we could see many of the star constellations and took note of the little and big dipper. We noticed a few planes flying over in their normal landing procedure, strobes on as well as landing lights lit up - as is common in the skies above north Texas, with busy DFW airport to our south. I took note of an airplane coming in to my left (from the west) that I thought I would play a joke with my wife and claim to be something out of the norm. We got to about the halfway point between our home and the elementary school playground, again facing and walking north on Church St. when the plane coming in from the west was right above us. I pointed up at the aircraft and exclaimed \"what is that??\". I noticed she looked up as well and my son, of whom I was carrying (due to scraping his knee at the playground) saw it as well. About a second after we all three were looking up at the airplane, I noticed something barely visible in my right side peripheral vision to the north east and quickly looked over for my eyes to focus on what it was. I noticed my wife turned her head to look at the object as well. At what seemed like the exact same time, her and I both pointed at this object that would not have been visible had you not been looking right at it - it would have been very easy to miss; we both said \"what the hell is that!?!\" followed by \"are you seeing what I'm seeing??\" - in a way trying to re-assure each other that we both were seeing this UFO. As we both stared at the object, which appeared to be flying direct - from north to south at a constant speed and altitude, we both tracked it with our index fingers, pointing at it the whole time. The object was V shaped, however more rounded at the front - more like a boomerang, and huge in size that made absolutely no noise at all. Initially, the object looked to be similar in altitude to what a landing aircraft would if it were heading to DFW. As the object was near directly to the east of us (to our right), I quickly realized that this object appeared to be much higher, more like in the mesosphere...almost like it was poking into the atmosphere. I have seen shooting stars and have seen the space shuttle and ISS as they have passed Earth; the shuttle i have also seen re-entering. This was nothing remotely similar to these occurrences. This object was larger than any aircraft, blimp, flock of birds; anything flying for that matter, that I have ever seen. The object was unified and solid in shape, it did not change, it did not get bigger nor did it get any smaller or change direction and again was at a constant altitude for the entirety of the duration we saw it. The UFO also was traveling very quickly - from the moment we first saw it to the moment at which is disappeared to the south was about 20 seconds. What was so incredible was that an object this massive in size made absolutely no noise at all. Shaped like a boomerang, only the front of the \"hull\" was visible. The object itself had no lights nor emitted light. It was almost as if light was reflecting off the front of the craft so you were able to make out that something was there in the shape of a boomerang. The rest of the craft was almost blurred and the closest comparison would be like in the movie \"The Predator\", when the Predator turns invisible; you can still make out he is there because objects behind him are blurred. After the object disappeared and we could no longer see it (almost like an airplane traveling away from you becomes so far you cannot see it), my wife and I looked at each other and asked \"who is ever going to believe us?\" As we continued our walk home, I continually began reviewing everything in my mind so as not to lose any detail. I wrote an email to my parents that night describing what we saw in detail to document everything. I also quickly started to seek images and youtube videos from the internet, trying to find anything close or exactly like what we had just seen. After searching and searching - most the artist renderings or images that I found were too V shaped, I decided to create my own rendering of what we saw."],"Disposition":"Unknown","Region":"Texas","Date of the Event":"09/19/2011 08:20 UTC","Date Submitted":"11/07/2011 11:33 UTC","files":["/var/www/straped/mufon/html2text/33185.html.txt","/var/www/straped/mufon/more/33185_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/33185.html"],"City":"Prosper","Object Shape":"Boomerang","Sighting Duration":"Undisclosed"}