{"Longitude":"-94.376896","Sighting Duration":"Undisclosed","Date Submitted":"11/07/2011 11:34 UTC","Latitude":"38.922783","Log Number":"US-11072011-0004","Region":"Missouri","Object Features":"Unknown","Tags":"City","City":"Lee's Summit","Object Flight Path":"Hovering then path,Path then hovering","Date of the Event":"10/31/2011 07:30 UTC","Object Shape":"Circle, Disc","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/33187.html.txt","/var/www/straped/mufon/org/33187.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.922783,+-94.376896(33187)&iwloc=A&hl=en\"> mufon case (33187) map </A>","trends":["There have been 52 other sightings in Lee's Summit","There were 6 other sightings in Lee's Summit on or around October 31st 2011"],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","divs":["Sighting DetailsI was driving on Hwy 291 out of Lee's Summit on Halloween night. I saw a group of green and white lights flying above tree line towards me. I first thought it was a fly over for the Chiefs game and then saw the size of it as it approached closer. It was not a group of planes, because I can recognize the distinct shape of F16's and bombers and it moved too fast to be a blimp. Once I saw the size, I immediatley puleed over and started to try to put a new CF card into my camera. At this point, it had stopped and was hovering for about 20-25 seconds with no sound at all. It then took off in the other direction and This is when I could positively indentify it as one moving disc like object. the lights were blinking white and green. I did not get a pic because I did't want to take my eye off of it and my mind was furiously trying to logically explain what I was seeing. I got back in my car and was heading west back into KC on I-435 and saw it move across the sky again, but was too far away to get a pic. I was curious and typed it into Google when I got home and saw all the reports for the month of October. I wish I could have had my camera ready in time!"],"Weather Factors":"Unknown","Summary":"Gigantic disc like object flew low over skyline with pulsating lights. Hovered for about 20-25 seconds then left in opposite direction. No sound noticed.","Case Number":"33187"}