{"Disposition":"Insufficient Data","Tags":"City","Object Features":"Unknown","Object Shape":"Circle, Oval, Star-like","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.807058,+-75.422697(33184)&iwloc=A&hl=en\"> mufon case (33184) map </A>","Case Number":"33184","trends":["There have been no other sightings in Ellendale","This sighting has never been favorited."],"Latitude":"38.807058","City":"Ellendale","divs":["Sighting DetailsWoke up around 4 am and rememberd i forgot to unplug the christmas lights. Went down stairs and as I looked at the christmas lights on out side I saw a really bright object past the trees. Very bright like the moon or something. I sat in the chair next to the window and just looked at it and it seemed to move alittle and I thought it was a reflection. I unplugged the christmas lights and it was still there. I just kept looking at it and then got up and got some water and used the bathroom. Came back to the window and the light looked futher away and had to lean way down to see it so I thought that could not be a star. Got my coat and walked out to the road wearing my underware. Way down the road I could see it and it was large and bright white. Looked like it was palusing or has a movment to it. Got really wondering and ran in the house got my car keys and shorts. Ran out to the road and it was not there, jumped in my car and drove a mile or so and saw it again. It was moving to the west so I stopped and tried taking some pics and a video with my phone. Just sat there and wathed it and it slowly moved to the west and just got smaller and smaller. Went home and just thought what was that."],"Object Flight Path":"Undisclosed","Country":"United States","Log Number":"US-11072011-0003","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"11/07/2011 11:17 UTC","files":["/var/www/straped/mufon/html2text/33184.html.txt","/var/www/straped/mufon/org/33184.html"],"Date of the Event":"11/07/2011 04:48 UTC","Weather Factors":"Unknown","Longitude":"-75.422697","Region":"Delaware","Summary":"Saw something very white in the sky looked like a star but was bigger and very bright,"}