{"Country":"United States","Latitude":"40.716403","Object Flight Path":"Stationary","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around November 6th 2011"],"Date Submitted":"11/06/2011 10:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.716403,+-74.004133(33181)&iwloc=A&hl=en\"> mufon case (33181) map </A>","Weather Factors":"Unknown","Tags":"City","City":"New York","divs":["Sighting DetailsSitting outside on November 6th roughly about 7:30 with my Girlfriend and we noticed a bright glowing light in the sky beyond the trees. I said to my girlfriend what is that and she said it was a helicoptor. I got up and walked in the direction of the object and looked more past the trees. I said that is no helicopter and it certainly was not an airplane, My girlfriend was standing next to me now and we both just stared at the orange glow. It was almost like a mini-sun. We where both not sure what we where looking at but agreed it was unidentified. It would get very bright then it would get dim. Then it would get very bright again and slightly move its direction upward then downward. After about the third time it flared up it eventually got dim to the point it dissappeared altogether gradually. This lasted for about 3-4 minutes. It was a pretty amazing experiemce. My girlfriend who had a bad headache prior to the incident had claimed her headache was gone after seeing the orange orb. I dont know if there is any relevence to that but I felt it had something to do with it. Also we felt we where meant to see the orb. We both had that feeling. Very strange."],"Longitude":"-74.004133","Object Features":"Unknown","Log Number":"US-11062011-0022","Disposition":"Unresolved","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/33181.html.txt","/var/www/straped/mufon/org/33181.html"],"Object Shape":"Circle, Star-like","Summary":"Very bright object in the sky witnessed by my girlfriend and mysel. almost looked like a mini sun in the night time. lasted a few minutes then disapeared.","Source":"MUFON","Case Number":"33181","Region":"New York","Sighting Duration":"Undisclosed","Date of the Event":"11/06/2011 07:30 UTC"}