{"Longitude":"-87.396573","City":"Newburgh","Date Submitted":"11/07/2011 01:00 UTC","Date of the Event":"11/06/2011 07:45 UTC","Case Number":"33190","map":"<A HREF = \"http://maps.google.com/maps?q=37.961203,+-87.396573(33190)&iwloc=A&hl=en\"> mufon case (33190) map </A>","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet, 101-500 Feet","Source":"MUFON","Log Number":"US-11072011-0007","Latitude":"37.961203","trends":["There have been 2 other sightings in Newburgh","There were no other sightings in Newburgh on or around November 6th 2011"],"Sighting Duration":"Undisclosed","Region":"Indiana","Disposition":"Hoax","Object Features":"Dome","Country":"United States","divs":["Sighting DetailsFacing north on Plaza Drive on eastside of Evansville in Vanderburgh County at about 8PM Sunday Nov. 6. My daughter and I saw the colorful lights in the sky. The object was about 100 feet in the air and as it got closer overhead you could see the dark saucer shape. The lights were multi-colored like something off a Christmas tree and blinking in rotation underneath it. The thing slowed to almost a stop just above us then slowly continued flying east. As it got further away, we kept watching it and it seemed to stop and hover again closer to Newburgh, IN. The thing looked like a textbook UFO right out of a Close Encounters movie or something. We were dumbfounded at the sight of it. Both of us were literally speechless with our jaw dropped as we watched it fly East toward Newburgh proper. The thing looked like it was flying parallel between Lincoln Ave. and Lloyd Expressway. For a time it was about 200 feet up then lowered to above the trees. We watched it until it seemed to disappear among trees going to Newburgh. Afterward we were just amazed to see this thing. I am only reporting this because if someone else saw this thing without a witness, they might think they are going crazy or hallucinating but they are not, because we saw it too."],"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Object Shape":"Circle, Disc, Oval","Summary":"Classic saucer shape, dark in color with multi-colored lights, flashing in rotation.","files":["/var/www/straped/mufon/html2text/33190.html.txt","/var/www/straped/mufon/org/33190.html"],"Tags":"City"}