{"Country":"United States","Region":"New York","Latitude":"40.720953","Tags":"City","divs":["Sighting DetailsOn November 7th at 1:00 I was driving home from a friends house in Mineola NY and talking to my girlfriend on the cellphone. I came to a stop sign around the block from my friends house and notice two orange orbs very low in the sky. I said to my girlfriend, \"Wow something must of happen the police have the choppers out\". Then I observed that there was no sound and they were low and moving fast. I was like this is strange and I need to get someone else to witness this. I told my girlfriend I would call her back and she said ok. I proceeded to call my friend and told him to get outside because I think im seeing ufos. He ran outside and told me he doesnt see anything. I said maybe the tree lines are blocking the view around the block . Then he goes \"I see them,two by my house\". I said no their by me still. He said come here. So I rushed back and there they were. We watched them together for 5 minutes as they seemed to ascend then disappear. We were in disbelief I said \"Im going home this is weird.\" Thats when 2 more ufos appeared in the sky my friend said im calling the police which he did. He told the dispatcher \"Hey you might think im crazy but im seeing ufos in the sky . The dispatcher said \"yeah and\". My friend responded \"I just wanna know if im the only one. The dispatcher said no then yeah then said that another call had come in 4 blocks away from us. She ask for his name and what street we are on. Then hung up on us. As soon as that happen we saw the 7th ufo flying low and looking like it was changing shape and moving fast then disappear over the tree line. 2 minutes later 2 police cars showed up and ask us what happen and said that they would look into it. Basically thinking we were nuts. So after the police left we stayed outside seeing if it would happen again with no luck. Im a skeptic but this has no explanation. Hopefully i get answers."],"Case Number":"33199","Log Number":"US-11072011-0017","Date Submitted":"11/07/2011 06:47 UTC","Date of the Event":"11/07/2011 01:02 UTC","Longitude":"-73.998373","Viewing Distance":"Unknown","Object Features":"Unknown","Object Shape":"Circle, Unknown","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around November 7th 2011"],"files":["/var/www/straped/mufon/html2text/33199.html.txt","/var/www/straped/mufon/org/33199.html"],"Sighting Duration":"Undisclosed","City":"New York","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.720953,+-73.998373(33199)&iwloc=A&hl=en\"> mufon case (33199) map </A>","Summary":"saw 7 object very bright flying a straight path no sound and the vanish","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON"}