{"Object Flight Path":"Path with directional change","Disposition":"IFO","Weather Factors":"Unknown","Tags":"City","Object Features":"Unknown","Country":"United States","divs":["sighting detailsi want to know if anyone else had seen this object. it was during bike week in daytona beach 1997. my girlfriend, my friend and myself were traveling south on a1a, i believe around 11pm when i saw a glowing ball with a glittering tail out of my driver side window (i was the driver). it was traveling slowly away from daytona beach out over the water east\\northeast direction at a constant altitude. i slowed down and told the others to take a look at it. the object was moving away from us heading east\\northeast. it was brightly colored orange\\white with an orange\\red\\green sparkling trail extending approximately 4-5 times the length of the object. after approximately 5-10 seconds of moving slowly, it made an abrupt change in its flight angle moving more southeasterly in direction, but gained altitude at an incredible rate of speed. it's velocity took it out of our visual range in only a few seconds. when it changed direction and accelerated away, the tail color changed to a green\\aqua color and it then moved out of sight. we did not see it again on subsequent nights while we were there."],"Sighting Duration":"00:00:15","Source":"MUFON","Longitude":"-80.999676","Latitude":"29.209414","City":"Daytona Beach","Object Shape":"Fireball, Sphere, Star-like","trends":["There have been 13 other sightings in Daytona Beach","There were no other sightings in Daytona Beach on or around March 1st 1997"],"Case Number":"33193","Date of the Event":"03/01/1997 11:00 UTC","Log Number":"US-11072011-0011","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"11/07/2011 03:45 UTC","files":["/var/www/straped/mufon/html2text/33193.html.txt","/var/www/straped/mufon/org/33193.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.209414,+-80.999676(33193)&iwloc=A&hl=en\"> mufon case (33193) map </A>","Summary":"GLOWING BALL WITH GLITTERING TRAIL, CHANGED DIRECTION AND ASCENDED AT GREAT SPEED","Region":"Florida"}