{"Viewing Distance":"Over One Mile","Object Features":"None","Sighting Duration":"00:03:00","Date Submitted":"11/07/2011 05:23 UTC","Case Number":"33196","Latitude":"29.750474","trends":["There has been one other sighting in Sealy","There were no other sightings in Sealy on or around October 27th 2011"],"Tags":"City","Source":"MUFON","divs":["Sighting DetailsI'm near Sealy, Texas, and the morning of Thursday, October 27, 2011 at 5:25am my wife and I witnessed the star Rigel, in the Orion Constellation, pulsating. (My wife had previously observed strange activity in Orion the week before.) I leave every morning at 5:25 and she walks me to the truck. There are almost no street lights in my country subdivision and we have a good view of the stars, especially the westerly stars. Since she had observed strange behavior previously, we were on the look-out. As soon as we walked out of the garage to go to my truck in the driveway, she said, \"There it is!\" I said, \"What? That very bright star?\" \"Yes\" About that time, it dimmed to \"normal brightness\" and then slowly pulsed back up to being very bright -- almost as bright as Jupiter has been these last few weeks; but unlike Jupiter it was a pure white light. The dimming and re-brightening only took about two or three seconds. Then it would remain bright for about ten seconds, and then pulse again. We stood there and watched, never having seen anything like that (my first thought was \"pulsar\", but later research seems to rule this out). We watched it cycle through pulses about five times or so. Then, on what turned out to be the last cycle, an orangish-red orb appeared about one \"inch\" to the 9 o'clock position of the pulsing object (Rigel?). It stayed visible for only two seconds. Then, about five seconds later, the same object appeared about one \"inch\" to the 3 o'clock side of the star. Again, about a two second visibility. When that orange globe vanished, the star made no more pulse cycles. The star was back to normal. It was Rigel, no doubt, or, it was an object directly in front of Rigel. The orange globes had some volume. They were not a mere pin-prick of light, but similar to holding a baby aspirin out at arm's length (maybe just a wee bit smaller than that). There were no noises, no lateral movements, no smells, no barking dogs... All was tranquil. At that point I waited around a bit longer and then had to leave so as to not miss my carpool. My wife hung around and did see a single bright flash above the belt of Orion. (She had seen similar behavior on at least two other occasions in the previous week.) But other than that bright flash, nothing more was seen or has been seen since. I've gotten up most morning and looked. No luck. BTW, there were no clouds that night -- the stars were really bright. No moon in the sky either. That's it. Not the most sensational event, but the strangest I've ever seen -- especially the orange orbs. I've tried to be very factual and have not embellished. I hope this information is useful to someone. My wife and I will continue to be on the lookout."],"Object Shape":"Sphere, Star-like","Summary":"The star Rigel, in the Orion constellation; pulsating with two orange orbs appearing next to it.","Longitude":"-96.058287","Object Flight Path":"Stationary","Log Number":"US-11072011-0014","Weather Factors":"Unknown","Region":"Texas","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=29.750474,+-96.058287(33196)&iwloc=A&hl=en\"> mufon case (33196) map </A>","Date of the Event":"10/27/2011 05:25 UTC","files":["/var/www/straped/mufon/html2text/33196.html.txt","/var/www/straped/mufon/org/33196.html"],"Country":"United States","City":"Sealy"}