{"Viewing Distance":"20 Feet or Less","Log Number":"US-11082011-0003","Date of the Event":"04/19/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.724033,+-73.997203(33204)&iwloc=A&hl=en\"> mufon case (33204) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"microscopic things show in air on IR hi speed camera that zip around unike any dust could floating in air.","Longitude":"-73.997203","Date Submitted":"11/08/2011 01:54 UTC","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/33204.html.txt","/var/www/straped/mufon/org/33204.html"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Latitude":"40.724033","City":"New York","Region":"New York","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Case Number":"33204","divs":["Sighting DetailsI was testing out a IR night vision camera with a real low lux .oo1 and hi frame rate. With all the lights out in the room we (a few of us seen this as it happens every time I show someone.) These specks show up on the monitor that change direction at 90deg instantly and do other crazy moves. They move so fast at times it's amazing. It's not dust in the air. This stuff can't be seen by the naked eye. Only shows with the IR lights on. What ever these are clearly are not influenced by air currents in the room. I have no idea what I am seeing. I know it is not electrical noise in the video signal. I am a electronics nut with over 40 years in the business. I don't want to pretend to waste your time. I have never tried to record these and I am sure that is what you want me to do and send it to you. But I have not wasted my time doing it till.. as I am.. asking someone like you guy's if ya ever heard of anything like this?? Then I'll take the time to try and record this. What ever I seen is sure weird and I got no idea what the hell it is. These little bright specks zoom around like crazy. And to give ya some idea.. say a 10' 10' view area in front of the camera. There will be only 5 or so that I estimate. They move to fast to count and figure out any density. But they are there. I can't wait to hear back from you. I know what I have seen.. I aint nuts..."],"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around April 19th 2010"],"Source":"MUFON"}