{"Log Number":"CA-11082011-0005","map":"<A HREF = \"http://maps.google.com/maps?q=46.49246,+-81.00236(33206)&iwloc=A&hl=en\"> mufon case (33206) map </A>","Region":"Ontario","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33206.html.txt","/var/www/straped/mufon/org/33206.html"],"Latitude":"46.49246","Longitude":"-81.00236","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Boomerang","Case Number":"33206","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"11/08/2011 07:32 UTC","trends":["There have been 12 other sightings in Greater Sudbury","There were no other sightings in Greater Sudbury on or around November 8th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Source":"MUFON","Date Submitted":"11/08/2011 02:30 UTC","divs":["Sighting DetailsI just got out of the hotub on my deck.Im always looking up at night, i work nightshift and i am always looking up for satelites and i always hope one day ill see somthing i will undoubtably decare a ufo. I happened, i dry off from the tub and go inside for about 10 min. I come back out it a cool night and i light a smoke and sit down on the step. I look up and immediatley i see a V shaped line of very dim red amber lights i would think about 7 circular lights per side. I t was about 1000 feet up and very large. to block it from view i would have used about the basketball size object at arms length. It came from direcly over my house and went on in a strait line due east. Abosolutley silent , it covered my sky line in about 7 seconds before it blended in the night sky. My wife caught the tail end of it.When i say lights i dont mean it as we would see lights on a car they were very dim and could easily not be seen by anyone walking it just seemed to blend in with the night sky, yet 100% visible, i couldnt see any sides of it just the circular amber red dim lights. It was alligned in a V shape rather than a boomer rang, it had about 7-9 lights per side wich formed a V that was more of a 60 degree angle. It is my first sighting, i was really taken back, im the kind of guy where i could spin a great tale, but i tell you this was somthing not of this world. Dead silnt as it passed over me and covered my sky line in 7 seconds. I saw it now im questioning what i should do,,, they are here and our goverments probably cant do a thing anyways, they have no need to contact us they can come and go as they wish,,,i am very puzzeled right now about what i should be doing,,, i seen it i believe it and i really feel like i should be trying to expose it to the rest of the world,,, where the hell was it going,,, i ask this because i drive somewhere ive got somthing to do where were they going they obviously have somthing to do they arent just joy riding,,,, this bothers me the most i feel i have to do somthing about this and im inept to do anything except question what they are doing , We are a rich mineral deposited area, gawd i have a tonne of probable reasons but why wont they make themselves known..... i always thought you peeps who report this stuff are wack jobs mabey some of you are ,,, but if u seen what i seen i am certain you are going through what i am going through,,,,"],"Object Features":"Undisclosed","City":"Greater Sudbury","Country":"Canada","Tags":"City","Summary":"V shaped massive silent fast and not of this world 100% sure of that."}