{"Object Shape":"Circle, Oval, Sphere, Triangle, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.521521,+-86.574707(33207)&iwloc=A&hl=en\"> mufon case (33207) map </A>","Disposition":"IFO","Object Features":"Unknown","Sighting Duration":"06:00:00","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/33207.html.txt","/var/www/straped/mufon/org/33207.html"],"divs":["sighting detailsseveral member of local mt community have witnessed 2 weeks of unusual lights along viking mt ridge area..2 photographers have taken over 100 photos of objects\\lights\\orbs after dark.. during the day up to 9 helicopters along ridge area in search patterns.. between 8:45 p.m. and up to sun up, all night long at times looks like a swarm of bees emmitting white to pink to green hovering then grouping lights, no sound.. one local resident of the upper mt area said the lights are very visable and look as though they are coming from within a mt cavity after dark..resident also said they can be clearly seen as just a few hundred feel above her home and tend to gravitate to thw transmission towers..the face book group sky watchers have posted several night photos and one very visible day shot of the objects.the mt area has been the source of these lights for many years just not so many or so steady a period..usually it's a few nights every few years ..this time 2 weeks of lights??"],"Weather Factors":"Unknown","trends":["there have been no other sightings in greeneville\\chuckey\\campc","This sighting has never been favorited."],"Date of the Event":"10/20/2011 08:45 UTC","City":"Greeneville/Chuckey/CampC","Latitude":"35.521521","Region":"Tennessee","Log Number":"US-11082011-0006","Source":"MUFON","Longitude":"-86.574707","Date Submitted":"11/08/2011 08:33 UTC","Tags":"City","Case Number":"33207","Summary":"See Face book EasternTennessee ufo group or SKY WATCHERS pictures.","Country":"United States","Object Flight Path":"Stationary,Path with directional change"}