{"Longitude":"-95.648603","files":["/var/www/straped/mufon/html2text/33215.html.txt","/var/www/straped/mufon/org/33215.html"],"Tags":"City","Date Submitted":"11/08/2011 06:17 UTC","Object Features":"Unknown","trends":["There have been 7 other sightings in Sugar Land","There was one other sighting in Sugar Land on or around October 15th 2010"],"Case Number":"33215","Viewing Distance":"Over One Mile","Log Number":"US-11082011-0014","Latitude":"29.590369","Object Flight Path":"Stationary","Source":"MUFON","Country":"United States","Region":"Texas","Disposition":"Unknown","divs":["sighting detailson friday 10\\15\\2010; the unidentified flying\\hovering thing hovered for 2 or 3 minutes and left a hole punch cloud. that`s what i saw about a year ago, but never reported it, because i simply did not know that i could. it was till two days ago when i saw an uap that i decided to investigated to who to report this. when i was getting into the sw fwy 59, from hwy 6 sugar land\\first colony and then exit right away into w. university blvd. as i was driving i called my dad in ca at 6:24 pm, but at the almost of same time my gf called me and i her missed her phone-call at 6:25 pm. i finished talking to my dad at 6:27-6:28 pm. i looked up straight ahead and i saw a huge blimp or saturn-like thing that reflected the sun on its top just floating in the sky about more than a mile high infront of cumulus clouds, it was not a sundog or halo like. it was big, and not moving with wind, i stare at it the whole time, and i used to worked in lax airport for two years, and i know how manmade blimps look like, also i know how boeing commercial airplanes, airbuses look like before landing or taking off, this was nothing like them. when i took off my eyes for a few seconds to exit the sw 59 fwy into w. university and i look up again, and i saw a hole punch cloud where the object was, and i could see something shining inside of the hole punch cloud, the weather was pleasant about 78 degrees. of course back then i did not know what a hole punch cloud was nor that below freezing temps are needed for that phenomena to happen. the sun was getting ready to set on the horizon and this object was way above the sun, nevertheless i could see the sun reflecting on it(top), even after it was gone(i did not see it taking off btw), i still could see the sun reflecting on something inside of the hole in the clouds. there is an airport about a mile or two away from there but i did not seeing moving in any direction, it just disappeared. it was almost camouflaged with the sky but it was in front of the clouds, so i could see it. it was light blue."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.590369,+-95.648603(33215)&iwloc=A&hl=en\"> mufon case (33215) map </A>","Summary":"unidentified hovering thing hovered for 2 minutes-left a hole punch cloud.","Date of the Event":"10/15/2010 06:25 UTC","Object Shape":"Blimp, Disc, Egg, Oval, Saturn-like","City":"Sugar Land","Sighting Duration":"00:03:00","Weather Factors":"Unknown"}