{"Weather Factors":"Unknown","Source":"MUFON","trends":["There has been one other sighting in Davidsonville","There were no other sightings in Davidsonville on or around November 8th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.961669,+-76.681087(33217)&iwloc=A&hl=en\"> mufon case (33217) map </A>","files":["/var/www/straped/mufon/html2text/33217.html.txt","/var/www/straped/mufon/org/33217.html"],"Summary":"noticed unusually low flying craft bright white lights that changed direction and headed directly towards the house.No sound once near us by road, tilted and noticed triangular shape and flew slowly down road towards Rt 50-white light on points/red ontop","divs":["sighting details190 description: looking at field across from the house on governors bridge rd where normal flight path is for bwi flights. it is a very clear night no cloud cover. we noticed a large craft flying low that changed directions and tilted to fly towards where we were standing in front of the yard on the other side of the road. we questioned why it was so bright and low. we also heard nothing that sounded like jets or planes. as the craft reached towards the road we noticed 3 distinct white lights on each corner and a flashing red light on top of the craft and the craft was approx. 5000 ft up which is not normal for planes that large to fly in this residential\\rural area. it then flew over us silently tilted once again to make a faint turn and realized it was an isosceles triangle. it slowly flew past and above us down governors bridge rd towards route 50. it was so clear and unbelievable that we witnessed this craft. i ran inside quickly to get my phone to take pictures but it had flew off and didn't return. date: 11\\8\\2011 time: 20:30 duration: 2 minutes sighting city: davidsonville sighting zip: 21035 sighting county: anne arundel witnesses: 2 shape: triangle number of craft: 1"],"Log Number":"US-11082011-0016","Latitude":"38.961669","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Path with directional change,Other","Object Features":"None","Date of the Event":"11/08/2011 08:30 UTC","Tags":"City","Disposition":"Unknown","Region":"Maryland","City":"Davidsonville","Object Shape":"Triangle","Country":"United States","Longitude":"-76.681087","Sighting Duration":"Undisclosed","Date Submitted":"11/08/2011 09:25 UTC","Case Number":"33217"}