{"Source":"MUFON","Viewing Distance":"Over One Mile","Region":"New York","Object Shape":"Unknown","Object Features":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Summary":"Green Fireball across night sky","Longitude":"-73.997573","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around September 14th 2011"],"Log Number":"US-11082011-0011","divs":["Sighting DetailsI was working overnight at the bar in Brooklyn. A friend was stopping in, as we were driving the next day to a wedding out of state. It was around 3:30AM, and he was having a smoke and I was sitting on the front steps, looking out over the park. Just then a MASSIVE green fireball streaked across the sky. I have seen lots of shooting stars before, they have always been quick zips across the sky that leave thin white streaks behind them. This was much much larger, with a much thicker tail. I would guess that if I hold my fingers out at arms length and measure across, the streak was roughly 5 inches long, and as I said, just wider across than a normal shooting star. And the trail in the atmosphere was distinctly green, sort of an emerald green glow. I tried to point it out to my friend, but by the time he craned around to look, the trail had faded. The next day I looked on gothamist and gawker and google, all in hopes of finding anyone reporting the same event, as when something happens in NYC, it's often seen by a lot of people. All I saw were a series of reports on green fireballs in the southwest states that same night."],"Date Submitted":"11/08/2011 04:19 UTC","City":"New York","Tags":"City","files":["/var/www/straped/mufon/html2text/33212.html.txt","/var/www/straped/mufon/org/33212.html"],"Weather Factors":"Unknown","Date of the Event":"09/14/2011 03:45 UTC","Country":"United States","Latitude":"40.720583","Disposition":"Unresolved","Case Number":"33212","map":"<A HREF = \"http://maps.google.com/maps?q=40.720583,+-73.997573(33212)&iwloc=A&hl=en\"> mufon case (33212) map </A>"}