{"Country":"United States","Longitude":"-104.75572","Case Number":"33213","Tags":"City","Object Flight Path":"Hovering then path,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/33213.html.txt","/var/www/straped/mufon/more/33213_submitter_file1__SUNP0001.JPG","/var/www/straped/mufon/more/33213_submitter_file2__SUNP0003.JPG","/var/www/straped/mufon/more/33213_submitter_file3__SUNP0010.JPG","/var/www/straped/mufon/org/33213.html"],"Date of the Event":"11/08/2011 12:00 UTC","Viewing Distance":"20 Feet or Less, 101-500 Feet, 501 Feet - 1 Mile","Log Number":"US-11082011-0012","Region":"Colorado","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around November 8th 2011","This sighting has never been favorited.",""],"Latitude":"38.869875","Source":"MUFON","divs":["Sighting Detailsfirst sighting was in back of Norad by Colorado Springs co.Saw a lot of aliens that looked like green man also saw aliens that that looked like cartoon characters.also have a ton of pictures of all kind of aliens. I have over 8000 pictures of a lot of wield things. One set of pictures has this red dot in sky and an alien follows the red dot the whole day I got about 2000 different pictures of this event happening during a weeks filming. I can show you an alien when you came and talk to me. I will bet my life on that. Not too many other people can say that but I can.Have a video of an alien dancing on my car. it last about 5 minutes the whole thing is wild. Haven't seen nothing like it on the internet. the red dot pictures shows an alien beaming down from the clouds. Also have pictures where the aliens moved my camera 3 times in 2 minutes. got a pictures of the biggest bird I ever seen has to be at least 25 tall. I can also show you a video of, what I call a ladder that goes straight up it must be at least 3000 ft tall with nothing supporting it just goes up into the clouds. MY partner has pictures just as good as mine. Inclusion if you guys don't come and see me you made the biggest mistake of your life.Like I said I can guarantee that if you show up I will show you an alien.And you can take that to the bank.Hope to see you soon.I will only send one picture that should be more than enough. if you can blow it up you will be speechless."],"Object Shape":"Bullet, Missile, Disc, Flash, Sphere, Triangle","Summary":"one projected imagine through wall see ships flying around all the time,also appear in lights","Disposition":"Hoax","Object Features":"Dome, Window(s), Patterned Surface","Weather Factors":"Unknown","Date Submitted":"11/08/2011 05:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.869875,+-104.75572(33213)&iwloc=A&hl=en\"> mufon case (33213) map </A>","Sighting Duration":"Undisclosed","City":"Colorado Springs"}