{"Source":"MUFON","Longitude":"-97.741221","Log Number":"US-11092011-0001","Region":"Texas","Summary":"Saw an ovoid silver object leaving a comet-like trail that suddenly and completely disappeared.","Object Shape":"Egg, Oval","Sighting Duration":"00:00:02","Country":"United States","Date of the Event":"11/08/2011 08:00 UTC","Date Submitted":"11/09/2011 12:03 UTC","Object Flight Path":"Straight-line path","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around November 8th 2011"],"City":"Austin","files":["/var/www/straped/mufon/html2text/33221.html.txt","/var/www/straped/mufon/org/33221.html"],"divs":["sighting detailswhile waiting for friends outside a restaurant at 8:00, i turned to see a silver\\gray ovoid object traveling in an arc across the sky. the size of the object caught my eye, as it was much bigger than a star, and about half the size of the almost full moon. the path the object took was similar to that of a shooting star, but it was moving much too slowly to be a meteor, and it has a clearly defined shape and color. it also appeared to be leaving a trail of white vapor behind it, giving it the appearance of a gray egg with a stubby comet tail. i immediately recognized that it was not an airplane due to the lack of red and blue lights, and i've seen helicopters, airplanes and shooting stars before. this was unlike anything i've ever seen. the most incredible aspect of this object was the fact that after only a second in my sight, it disappeared as though it had passed behind an invisible curtain. it was suddenly and completely gone. there were no clouds in the sky, and i have no explanation for the object or its sudden disappearance."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.274433,+-97.741221(33221)&iwloc=A&hl=en\"> mufon case (33221) map </A>","Weather Factors":"Unknown","Latitude":"30.274433","Viewing Distance":"Unknown","Disposition":"Unresolved","Case Number":"33221","Tags":"City"}