{"City":"Winston-Salem","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/33223.html.txt","/var/www/straped/mufon/org/33223.html"],"Object Features":"Dome, Window(s), Patterned Surface, Louvres","Latitude":"36.06052","map":"<A HREF = \"http://maps.google.com/maps?q=36.06052,+-80.251839(33223)&iwloc=A&hl=en\"> mufon case (33223) map </A>","Date Submitted":"11/09/2011 12:39 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","divs":["sighting detailsi was driving north on buchanan street, with the winston-salem skyline directly ahead about 2+ miles from my position. the sun had just gone down, so it was almost twilight, but still plenty of light (not yet dusk). the day was perfectly dry and clear with no visible clouds in the sky. just seconds before i turned right onto beth avenue, this enormous craft appeared right where i had been looking toward downtown winston-salem. my first thought was that i had never seen the wachovia building looking like that, but simultaneously i felt disoriented because my \"landmark\" was out of proportion - it was wide, misty and hovering. i seemed very close. in a split second i realized that i was seeing; what came to my mind was \"a mothership\". it was huge! it seemed to be oval with a dome. i got an impression of textured, slightly reflective surface, barely distinguishable windows and a few widely spaced lights. most of the lights where white, with a couple of blue-green lights and a rose-colored (not red) light. i couldn't see the entire ship because it was surrounded by a mist\\diffuse cloud that gave me the impression that it was trying to blend into the city skyline. i was already turning onto beth avenue, so i continued to trent street and turned left so i was once again facing the winston-salem skyline with the wachovia building directly ahead. that building should have been clearly visible, as usual from that postion\\distance. however, the craft had moved closer to downtown seemed to have moved directly in front of\\over the wachovia building. the mistiness had increased so that all that was visible was the lights and i couldn't see the wachovia building. it was as if the craft was trying to mimic or swallow the building. i felt extremely disoriented because i couldn't see the buildings i knew were there. it was like some sort of optical illusion was obscuring them. i felt so disturbed that i just couldn't look at it for more than a couple of minutes. i went home, went inside and just thought about what i had seen. i went back to the same spot on trent street to look at the skyline about 15 minutes later. that misty obscureness was gone and the skyline looked just as it normally does. it was dusk by then, but not completely dark. the sky\\local atmosphere was perfectly clear, just like it had been all day."],"Object Shape":"Disc, Oval","Log Number":"US-11092011-0003","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around November 1st 2011"],"Date of the Event":"11/01/2011 07:00 UTC","Summary":"Large craft with misty aura obscuring edges its edges. Increasing diffusion/density of aura until craft's body no longer distinguishable.","Object Flight Path":"Hovering then path,Straight-line path","Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-80.251839","Country":"United States","Case Number":"33223","Sighting Duration":"00:05:00","Tags":"City"}