{"Tags":"City","Object Features":"None, Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.880303,+-85.754973(33227)&iwloc=A&hl=en\"> mufon case (33227) map </A>","Case Number":"33227","divs":["sighting detailsit was about 4am on november 5 2011. i just arrived home and parked the van in the driveway. i got out of the van and looked south towards orion's constellation and was observing stars. i saw a few planes very far away as i was observing the stars. i was simply enjoying star gazing when out of the blue came the object. it flew right over my head, going fairly slow, about 2,000 feet in the air. it caught me off guard because it flew right over the lone cloud that was floating right above me. it was a very thin\\low lying cloud, and i hadn't noticed the object beforehand so i was quite startled. any ways, i had a very clear view of it for about 2 minutes. for 20 seconds it was right above me, heading west to east at a fairly regular speed if not slow. the object had orange lights on the outside, a yellowish orange. the lights were curved, and it appeared almost exactly like this ( ) in the center of the lights was a dull, rotating red light that seemed to be blinking randomly. by rotating, i mean it was moving around in the shape of a square in the center of the yellowish orange lights. it was blinking at each corner if that makes sense, yet it seemed random and off center. any ways, the craft made no noise yet it was right above me. i searched online and began to believe that it may have been an airplane with it's landing lights turned on. however, the next night i went outside and observed at around 2am, and a plane flew above me again at a much higher altitude with it's landing lights on. i was still able to see this planes blinking white exterior lights and a clear view of the red blinking light. it also made noise even though the altitude was much higher than the object i saw the night before. this is my 2nd ufo sighting in my life; the first being at the beginning of october this year in which i saw 2 dull white lights flying above me at 500 feet or so that made no noise and was eerily inconspicuous. i wrote this after seeing 2 reports in the last week of almost the exact same craft i saw just a few days ago. i attached a sketch that gives a 'sketchy' example of my microsoft paint skills. the darkness is the sky, the white is the cloud. i'd like to talk to someone about this, preferably the people who reported the exact same craft (the guys in minnesota who witnessed almost exactly what i saw) email me at: [email address removed\\cms\\tg]"],"Summary":"REGARDING NC AFTER MEETING AND MINNESOTA ACCOUNT/Orange w/ Red Center","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/05/2011 04:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33227.html.txt","/var/www/straped/mufon/more/33227_submitter_file1__ufo2.png","/var/www/straped/mufon/org/33227.html"],"Date Submitted":"11/09/2011 07:06 UTC","Country":"United States","Log Number":"US-11092011-0007","Longitude":"-85.754973","Weather Factors":"Windy, Light","Latitude":"42.880303","Object Shape":"Egg, Oval","City":"Grandville","trends":["There have been 4 other sightings in Grandville","There were no other sightings in Grandville on or around November 5th 2011","This sighting has never been favorited.",""]}