{"Disposition":"IFO","Country":"United States","Weather Factors":"Unknown","Case Number":"33225","Longitude":"-77.881758","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Object Shape":"Boomerang, Triangle","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.942535,+-77.881758(33225)&iwloc=A&hl=en\"> mufon case (33225) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33225.html.txt","/var/www/straped/mufon/org/33225.html"],"Date Submitted":"11/09/2011 01:57 UTC","Log Number":"US-11092011-0005","Summary":"Much larger than stars and much smaller than helicopters that fly over our home.","trends":["There have been 3 other sightings in Rocky Mt","There were no other sightings in Rocky Mt on or around November 9th 2011"],"divs":["Sighting DetailsThe object seen had three equally spaced white lights. When first spotted the object was low to the horizon and appeared to be hovering. After I made a quick trip inside to get my binoculars the object started moving very slowly. The object moved from south west to the north not crossing directly over head but, about 80 degrees to east. It appeared to be triangle, delta or boomerang in shape through my binoculars. I never heard any sounds coming from the craft. After passing I did see one red light and possible other white light flashing. The strobing lights did not match the pattern of commercial jets that I often see over head. No green lights were seen from the object indicating port and starboard sides of an normal air craft. Life flight helicopters fly daily over our house making trips to our local hospital about three miles away. At night these helicopters are quite noisy and have only one very bright light that are pointed downward. I am a sky watcher and love to watch the overhead air traffic. The most worthy things about my sighting are the three bright lights being equally spaced apart and probably on a fairly large object. Also, no noise at all from the very slow moving object. I have good hearing and often look up when commercial jets pass over. I am 62 years old retired telephone company central office repairman."],"City":"Rocky Mt","Latitude":"35.942535","Object Flight Path":"Hovering then path,Straight-line path","Date of the Event":"11/09/2011 08:30 UTC","Tags":"City","Region":"North Carolina"}