{"Region":"Pennsylvania","divs":["sighting detailsi was outside enjoying the night air and stargazing about 11:15 pm, observing the night sky for an astronomy class i'm taking in college. while i was facing east and admiring the constellation of orion i saw a red ball streak across the sky super fast from the ese direction streaking towards the ene to enw direction (approximately about 11:20 pm). i first thought my eyes were seeing a glare since i was wearing glasses. i remained outside and gazed in the ese area a little while longer and did not have the same experience twice. i am certain that i either saw a red meteor from a red dwarf star that's near the end of its life...or...a speeding ufo. {according to the local newscast meteorologists the largest meteor was to streak past the earth tuesday evening. they clarified it would not be visible to the naked eye.} the height(elevation) in the sky would have been about one fist from horizon in the ene near orion and as it sped ene\\enw it gained in height(elevation) from the horizon about 3 fists before it disappeared from my view about 4 fists height from horizon thanks to a parking lot lamp at my apartment complex. per my astronomy class it would be awesome to have it clarified that i saw a red 'falling star' and not a speeding ufo. i didn't know any other website other than this ufo reporting site to report even for possible falling stars. if this was indeed a red meteor falling star...let me know the right website to report falling star\\meteor sitings, please."],"Sighting Duration":"00:00:02","Tags":"City","Latitude":"40.157162","Country":"United States","trends":["There have been 6 other sightings in Mt Pleasant","There were no other sightings in Mt Pleasant on or around November 8th 2011"],"Case Number":"33222","map":"<A HREF = \"http://maps.google.com/maps?q=40.157162,+-79.545833(33222)&iwloc=A&hl=en\"> mufon case (33222) map </A>","City":"Mt Pleasant","Summary":"red star like ball streaking thru Southeast to Northeast area of sky","Object Shape":"Star-like","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33222.html.txt","/var/www/straped/mufon/org/33222.html"],"Object Flight Path":"Straight-line path,Path with directional change","Object Features":"None","Date of the Event":"11/08/2011 11:20 UTC","Log Number":"US-11092011-0002","Disposition":"Unresolved","Date Submitted":"11/09/2011 12:33 UTC","Viewing Distance":"Unknown","Longitude":"-79.545833","Source":"MUFON"}