{"City":"Hendersonville","Longitude":"-86.619996","Case Number":"3323","Region":"Tennessee","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/3323.html.txt","/var/www/straped/mufon/org/3323.html"],"Object Features":"Undisclosed","Log Number":"","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.304774,+-86.619996(3323)&iwloc=A&hl=en\"> mufon case (3323) map </A>","Summary":"Not Provided","Date of the Event":"02/19/2005 03:43 UTC","trends":["There have been 4 other sightings in Hendersonville","There were no other sightings in Hendersonville on or around February 19th 2005"],"Latitude":"36.304774","divs":["Sighting DetailsSighting Report: Dear Sir or Madam, I just happened to come across your site browsing the web after seeing a television programme on Area 51. Though having grown up in Britain, I was in Texas during the late 70s and early 80s off and on. I saw that \"UFO\" that supposedly landed in Dayton, Texas I believe. This was in 1979 or 80, I really don t remember the exact date. I was in Cleveland, Texas which is 25 miles away. This is a very rural sort of area and there s little else to do but go for a drive. I was with a friend (he was driving) when we came to a stop sign at Hwy 321 (which leads to Dayton). He stayed there at the stop sign and we were watching what appeared to be a very bright star, I was the first to notice (I believe I said \"look at that star\"). The star became brighter and brighter and larger. Very soon, and I don t remember how, the thing was right on top of us. The thing was very large indeed and triangular shaped. I m a bad judge of distance, but it seemed only a matter of feet above his pickup truck. There were lights of a different colour on each cornor I remember. But, to have been so very bright on approach, the underside seemed dark, and I could see no brightness at all. The thing sort of swirled around the top of us and made for the direction of Dayton. It s leaving gave the very same appearance. It looked like a very large very bright star and became smaller the further it got away. Really, at the time, I didn t think \"UFO\" etc. although this was a very strange event indeed. All I remember saying to my friend, \"that s odd, if that were a plane of that size and that close it would blow us off the road\" (those were my exact words). But, it was very different from a plane, there was absolutely no sound at all. This is what really gave us \"the creeps\". I thought no more about it. Then a very short while later I read about an event in Dayton, Texas in the Houston newspaper, where some family came across some strange object and got radiation sickness or something. And they were suing the Air Force. I thought perhaps this is what we d seen, but after reading that article wanted no part of it. Thinking of it now still gives me \"the creeps\". This thing no doubt approached us, and it could have been us contacted by it. Thinking of it now, probably the only thing saving us was the fact that we were just on the outskirts of town, not remote enough. So the thing made for some remoter area near Dayton. I can t promise you I know what it was, but I ve never seen anything as strange before or since."],"Date Submitted":"02/19/2005 03:43 UTC","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed"}