{"Log Number":"US-11092011-0016","Source":"MUFON","Summary":"Triangle hovering above tree line over Lake Harding as if it were searching for something","Object Features":"Wings","files":["/var/www/straped/mufon/html2text/33236.html.txt","/var/www/straped/mufon/org/33236.html"],"Object Flight Path":"Stationary,Hovering then path","Longitude":"-86.895938","divs":["Sighting DetailsAround mid-October, 2008, I was delivering newspapers around 2:30a EST. The location was near Valley, Alabama (but more nearer to the small community of Beulah). While crossing a bridge that went over Lake Harding on Lee County Rd. 279, I noticed a triangular shaped object hovering just above the treeline. The object appeared to be around a football field and a half from the bridge over a few houses. At best guess, it was some 75 feet in the air. Two blue-white lights were in what I believed to be the rear of the vessel. Underneath, I could make out a reddy-orange lightthat at times seemed to shine to the ground (almost like a hand held spot light). I watched this go on for around 25-30 minutes approximately. It almost seemed as if the vehicle was searching or looking for something. That is just the impression I had at the time. Still having almost 100 newspapers to deliver; I traveled on to my customers. This took about an hour and I decided to go back to the area to see if the craft was still there. Remarkably it was! However, it had \"floated or hovered\" down the tree line a ways and eventually went out of my field of view back into a wooded area that was gated. I want to also point out that I witnessed no beings or aliens BUT, I did witness a full grown panther (gender unknown, about the size of a Lab retriever dog) walk from one side of the road to the next an go behind a small country church. Amazingly, in one nights time; I witnessed my first UFO AND saw a panther (that according to the state, are not supposed to be in Alabama). I came home later that morning and immediately got on the web to try and find a similar craft akin to what I'd witnessed. Loand behold I did, and in fact found upwards of around ten puported triangular shaped UFO's. Some were identical while other depictions were similar but different. If memory serves correctly, I thought upon what I had seen for about a week before contacting a Mr. Robert Patterson of MUFON Alabama. We had about an hour long conversation and his information was very helpful."],"Case Number":"33236","map":"<A HREF = \"http://maps.google.com/maps?q=32.324521,+-86.895938(33236)&iwloc=A&hl=en\"> mufon case (33236) map </A>","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","City":"Valley (But nearer to Beu","Object Shape":"Boomerang, Chevron, Triangle","Region":"Alabama","Weather Factors":"Unknown","Date of the Event":"10/15/2008 02:30 UTC","Date Submitted":"11/09/2011 05:56 UTC","Tags":"City","Disposition":"Unknown","Latitude":"32.324521","Country":"United States","trends":["There have been no other sightings in Valley (But nearer to Beu","This sighting has never been favorited."]}