{"Log Number":"US-11092011-0013","Object Shape":"Triangle","Weather Factors":"None","Disposition":"IFO","Date of the Event":"11/08/2011 08:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.662903,+-116.429617(33233)&iwloc=A&hl=en\"> mufon case (33233) map </A>","Viewing Distance":"501 Feet - 1 Mile, Unknown","Source":"MUFON","Date Submitted":"11/09/2011 02:10 UTC","Latitude":"43.662903","divs":["Sighting DetailsLast night at around 8:35p.m. Mountain Standard Time, I left my home to return a movie to the Redbox at the Maverick. As I was returning home I noticed a blinking light in the distance off to my left in the direction of my subdivision. At first I thought it was a star, then the light smoothly rotated in a clockwise direction. I slowed my car down and watched it more intently as I drove into towards my house, and the light again rotated in a clockwise direction. At this point I had moved closer to the object, and was able to make out the shape of the object. It was a huge triangle, and from what I could tell the blinking light was at the front. As I became parrallel to the object it started to move. It started in the direction of my house so I sped up trying to get home to tell my family. As I pulled into my garage The objectalmost cover my house, moving at a steady pace. I ran into my house and yelled for my wife, two sons, niece, and her husband to come look. I was in the house for no more than five seconds, and when we all got back outside we could still see the object, but it was way off in the distant. This thing was covering some distance, and made no sound whatsoever. My two sons and I sat outside discussing it for a while, and about five minutes after we had lost sight of the object a fighter jet flew over our house headed in the same direction as the triangle we saw."],"Tags":"City","Object Flight Path":"Hovering then path,Straight-line path","Country":"United States","Case Number":"33233","files":["/var/www/straped/mufon/html2text/33233.html.txt","/var/www/straped/mufon/org/33233.html"],"trends":["There have been 5 other sightings in Meridian","There were no other sightings in Meridian on or around November 8th 2011"],"Sighting Duration":"Undisclosed","Region":"Idaho","Object Features":"Unknown","Summary":"Triangle Shaped Object","City":"Meridian","Longitude":"-116.429617"}