{"trends":["There has been one other sighting in Apollo Beach","There were no other sightings in Apollo Beach on or around November 9th 2011"],"files":["/var/www/straped/mufon/html2text/33240.html.txt","/var/www/straped/mufon/org/33240.html"],"Date of the Event":"11/09/2011 05:50 UTC","Region":"Florida","Object Shape":"Other, Unknown","Date Submitted":"11/09/2011 07:48 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.792496,+-82.384474(33240)&iwloc=A&hl=en\"> mufon case (33240) map </A>","City":"Apollo Beach","Viewing Distance":"Over One Mile","Object Features":"None","Summary":"3 streaks of lights,not moving,above an aircraft approaching TPA, each was about 4/5 times the size of the plane. They were angled toward each other as if to form a triangle. The seemed to be around the area of Macdill Airforce Base in Tampa.","Source":"MUFON","Longitude":"-82.384474","Object Flight Path":"Stationary","Latitude":"27.792496","Sighting Duration":"00:06:00","Log Number":"US-11092011-0020","Case Number":"33240","Tags":"City","divs":["sighting detailswhile driving south of tampa fl, we noticed 3 streaks\\lines of lights in the distance.the area near the lights appears to be around macdill airforce base. at first i saw one streak & commented that it was a comet. as soon as my daughter looked, she noticed the second streak. at that point, i looked again (i was driving)and saw all 3 streaks. i was thinking comets but then noticed none of them were moving across the sky like comets do. then i thought planes maybe? with chemical vapor trails, but again, they weren't moving, that we could notice. it was then confirmed that they weren't moving when an a plane flew across the sky under the lights & we saw all four objects in view. the plane was about 5 times smaller than each streak or line of light and they were not moving at all. the plane was probably in approach to tpa and again it flew under the lights, to give you an idea of altitude. the lines\\streaks of light were angled in a way that you could connect them to form a huge triangle. there was no sound. we were late getting to an event at my daughters school & when we came back out they were gone. we did not see them disappear. this was about 5:50 p.m. wed. nov. 9, 2011. i cannot explain what they were, except that they were not planes, comets, flares, skydivers and i really don't think it could have been a cloud light, or reflection of any kind, being constant & linear for an extended period of time. they did not fade like vapor trails but maybe??? everybody around us in traffic was looking too."],"Disposition":"IFO","Country":"United States"}