{"trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around April 3rd 2005"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.16988,+-86.779973(3324)&iwloc=A&hl=en\"> mufon case (3324) map </A>","divs":["Sighting DetailsSighting Report: At approximatly 5pm in the afternoon Jan 2005, I was looking out my kitchen window when I notice a jet airliner veer sharply off course traveling Northwest avoiding a small black arrowhead shaped object traveling I would say 3-600 miles per hour which passed directly overhead of me heading due south. I figured it was a stealth fighter. But when it got above me I determined it was not due to the pointed arrow shape that looked nothing like a stealth fighter (it was too narrow pointed)and it was completly silent, about that time I noticed 2 more objects of the same configuration traveling the same speed and the same course following the same line as the first. On the third pass I really tried to get a look at the third craft and notice a slight glow not in the back of the object as you would think but from the front of the object at the point. I do not think this could be a government aircraft, but it could be possible. These objects produced no sound whatsoever and the did not veer one way or the other , not even to miss the on coming aircraft wheich veered away from them. It excited me alot."],"Region":"Tennessee","Object Shape":"Undisclosed","Case Number":"3324","Disposition":"Insufficient Data","Date Submitted":"04/03/2005 04:00 UTC","Weather Factors":"Unknown","Source":"MUFON","Latitude":"36.16988","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Summary":"Not Provided","Object Flight Path":"Undisclosed","Date of the Event":"04/03/2005 04:00 UTC","Longitude":"-86.779973","Log Number":"","City":"Nashville","files":["/var/www/straped/mufon/html2text/3324.html.txt","/var/www/straped/mufon/org/3324.html"],"Tags":"City","Country":"United States","Object Features":"Undisclosed"}