{"trends":["There have been 7 other sightings in Lawton","There were no other sightings in Lawton on or around November 9th 2011"],"Viewing Distance":"501 Feet - 1 Mile","City":"Lawton","Object Flight Path":"Straight-line path","Log Number":"US-11102011-0006","Sighting Duration":"Undisclosed","Region":"Oklahoma","Latitude":"34.618474","Weather Factors":"Unknown","Summary":"FOUR FAST MOVING, BOOMER RANG SHAPED OBJECTS","files":["/var/www/straped/mufon/html2text/33251.html.txt","/var/www/straped/mufon/org/33251.html"],"Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=34.618474,+-98.446033(33251)&iwloc=A&hl=en\"> mufon case (33251) map </A>","Disposition":"Unknown","divs":["sighting detailsi went outside to have a cigarette. my street runs in a west-east direction. i was looking towards the east at the constellation orion. upon finishing my cigarette, i tossed in the street and turned to re-enter my house. i looked up to the north and saw what i first thought was a small group of white doves flying south. i never took my eyes off of them because it was quickly apparent that they were not birds as they got closer. depth perception told me that they were higher than originally thought and there was no fluctuating pattern you see when you look at birds flying. there is a light haze in the sky but it's a cloudless night. the four objects were flying in a \" ( \" formation. they were not glowing. they were a dull white\\light gray color. non-reflective. boomer rang shaped. maybe about 25 to 30-feet from wing tip to wing tip. once they flew over, it appeared that they were between 800 to 1000-feet msl. they flew in a straight-line pattern. they were traveling in a ssw direction and traveling nearly 150-mph as they flew over me. as soon as they passed over it didn't take long for me to lose sight of them. i stood there for another 30-seconds, give or take before i entered my home and quickly called shephard afb in burkburnet, texas. the dispatcher said he would relay the information to the tower."],"Date of the Event":"11/09/2011 10:58 UTC","Object Features":"None","Source":"MUFON","Country":"United States","Case Number":"33251","Longitude":"-98.446033","Date Submitted":"11/10/2011 12:54 UTC","Tags":"City"}