{"Region":"Florida","Object Shape":"Circle","Date of the Event":"11/09/2011 09:35 UTC","Case Number":"33255","Summary":"Large Orange Fireball over the treetops, watched until out of sight","Country":"United States","Object Features":"None","City":"Scottsmoor","Sighting Duration":"00:00:35","map":"<A HREF = \"http://maps.google.com/maps?q=28.766936,+-80.87811(33255)&iwloc=A&hl=en\"> mufon case (33255) map </A>","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Straight-line path","Date Submitted":"11/10/2011 02:29 UTC","trends":["There have been no other sightings in Scottsmoor","This sighting has never been favorited."],"Longitude":"-80.87811","Latitude":"28.766936","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33255.html.txt","/var/www/straped/mufon/org/33255.html"],"Log Number":"US-11102011-0007","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","divs":["Sighting DetailsMy brother and I stepped outside to have a cigerette. After being outside olny a minute or so, he pointed and said \"What's that?\" At my first glimpse I thought it was the streetlight because of the amber orange color but then I quickly realized it was on fire and it was traveling above the streetlights. My brother kept saying its on fire! It's on fire! I distinctly saw a fire sphere with no sound, no change of direction no change of altitude, no tail. We watched it light up its surounding area as it traveled South until out of sight. We heard an aircraft to the West and slightly North of the sphere. The airplane had only strobe white lights. The sphere traveled under the cloud deck, where as the airplane was in the clouds. Two minutes later another airplane with strobe white lights,and normal red and green avaition lights were visable and even a higher altitude than the first airplane further into the cloud deck. I point this out because the first plane did not have red or green lights. I know what I saw over the treetops it was a fireball of orange and red flames a perfect circle traveling on its own power for the 10-20 seconds."]}