{"Case Number":"33254","Date Submitted":"11/10/2011 12:37 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","Object Features":"Undisclosed","Country":"United States","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=33.689057,+-117.791504(33254)&iwloc=A&hl=en\"> mufon case (33254) map </A>","Disposition":"Unresolved","Date of the Event":"11/09/2011 10:20 UTC","Tags":"City","City":"Irvine","Summary":"South Orange County fire UFO chased away by Jets & Helicopter","trends":["There have been 28 other sightings in Irvine","There were no other sightings in Irvine on or around November 9th 2011"],"Longitude":"-117.791504","files":["/var/www/straped/mufon/html2text/33254.html.txt","/var/www/straped/mufon/org/33254.html"],"Sighting Duration":"Undisclosed","Latitude":"33.689057","divs":["Sighting DetailsI was leaving the Irvine Spectrum shopping center after the gym around 10:20pm. I was about to get on the 5 freeway to facing North and about head south and noticed a brighter than normal star, orange and looked like it was melting. The location of it was about about 1 mile North east of my location. At first I thought maybe someone lit one of those heated ceremony bags and caught on fire, but after closer look the object stayed hovering and changing different colors. I would say it was hovering close to the old marine base near Irvine or Lake Forest. I pulled over to the side of the road with my emergency lights and took out my iPhone to start recording this thing as it was beginning to fade. The street lights made it more difficult to record the object, but I did give descriptions of where the object should be seen. I noticed small blinking lights coming from the East, these must have been Air Force jets scrambled from March AFB to rid of the UFO. As the Jets started to get closer the UFO lost it's glow and turned into off-white maybe silver color with some lights going across barely visible. The shape of this thing was uncertain, I can only describe the shape of a deformed skinny potato that was wobbling away as it would change speed. A helicopter began to investigate the object, but I believe it was told to back off because turned away from the object, but later came back to follow it North. As the object flew North West towards the Tustin hills area, then it started to curve towards Los Angeles.The fighter jets kept circling around, but stayed clear of the object. I have this on video, shows the fighter jet arriving and circling around, the helicopter investigating, but hard to see the UFO."],"Log Number":"US-11102011-0006","Region":"California","Object Shape":"Fireball","Weather Factors":"Unknown"}