{"Date of the Event":"10/08/2010 06:37 UTC","City":"McKinney","Disposition":"Unknown","Latitude":"33.197086","Log Number":"US-11102011-0009","Date Submitted":"11/10/2011 04:05 UTC","Object Features":"None","Source":"MUFON","Tags":"City","Country":"United States","divs":["sighting detailsi observed from my back porch 2 very bright stars in the sky that didn't look like the other stars at 6:37 am. on october 8, 2010 in mckinney, texas. the 2 star like objects were set up at one being at 12 o'clock and the other at lets say the center of a clock. as i am looking at them the object at 12 oclock moved very fluidly as if on a clock to the 1,3, and then stopping at the 6 oclock position. as soon as the object stopped the center object got brighter and ascended up and backwards at what i can only describe as an unbelievable rate of speed and was gone in the blink of an eye. the object at the 6 oclock position stayed in the same position until the sun came up and i lost site of it. i was looking up at about 1\\3 to 1\\2 of the way up in the sky and was facing nnw. i sit on my back porch alot and i sit on a flight path to dfw airport so i see alot of planes and even helicopters on occasion but seeing what i saw that morning was the strangest thing i have ever seen in my life. what was so eery about it was the fluid clock like motion and how perfect the circular movement was. that morning was just over a year ago and its if it just happened yesterday, i believe its one of those instances that is seared in your memory and just can't be forgotten."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/33257.html.txt","/var/www/straped/mufon/org/33257.html"],"Region":"Texas","Summary":"I observed 2 very bright stars in the sky that didn't look like the other stars at 6:37 am. Then in a perfect pattern the one on top made a clock movement from 12 to the 6 position very fluidly and then the center object shot back and upward at a fast rat","Weather Factors":"Unknown","Object Shape":"Star-like","Longitude":"-96.672809","trends":["There have been 30 other sightings in McKinney","There were no other sightings in McKinney on or around October 8th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.197086,+-96.672809(33257)&iwloc=A&hl=en\"> mufon case (33257) map </A>","Viewing Distance":"Over One Mile","Case Number":"33257"}