{"Region":"Texas","Tags":"City","Date of the Event":"02/27/2005 07:48 UTC","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around February 27th 2005"],"Date Submitted":"02/27/2005 07:48 UTC","Summary":"Not Provided","City":"Houston","divs":["Sighting DetailsSighting Report: My account goes back to autumn 1978. I know this will make it impossible to investigate but I want to let someone outside of my family and immediate friends to know. I lived in Williamsburg, Ohio at the time of the sighting. I was outside with my friend that lived next door. His father had cut down the dead corn stalks and we were bundling them together. We saw something coming toward us low over the horizon. At first we thought it was our neighbor that has a gyrocopter, but we remembered he had crashed and wss in the hospital. As it closed in on us we knew right away it was something we had never experienced before. It hovered over us silently. The only noise we heard was like a brisk wind. It was no more than twenty feet overhead at this time. We stood nearly paralyzed with awe. It hovered for what seemed like 3-4 minutes. It then raised in elevation to about 50 feet instantaneously. We went to my house next door and had my older brother come outside to the second story porch. My brother did not believe what he was seeing. The craft would make several more manuevers...all at angles and speeds unobtainable by military aircraft known. I am a very realistic and down to earth person, but what I saw that autumn evening will change my outlook on everything in life."],"Source":"MUFON","Latitude":"29.769543","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.769543,+-95.36701(3326)&iwloc=A&hl=en\"> mufon case (3326) map </A>","Log Number":"","Object Flight Path":"Undisclosed","Case Number":"3326","files":["/var/www/straped/mufon/html2text/3326.html.txt","/var/www/straped/mufon/org/3326.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Hoax","Longitude":"-95.36701","Object Shape":"Undisclosed","Viewing Distance":"Unknown"}