{"Longitude":"-82.551495","map":"<A HREF = \"http://maps.google.com/maps?q=27.969303,+-82.551495(33266)&iwloc=A&hl=en\"> mufon case (33266) map </A>","Object Features":"None","Log Number":"US-11112011-0002","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"33266","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"27.969303","Date Submitted":"11/11/2011 02:21 UTC","City":"Tampa","divs":["Sighting DetailsOn November 8, 2011 in Tampa, Florida at approximately 8:02PM (Roughly) I was headed towards Lee Roy Selmons restaurant via Memorial Highway to then get on the Veterans Expressway. I was headed towards the airport, so East. I was right by the Scottish Rite Masonic Temple in an area called \"Town and Country\" Keep in mind, I live nearby to the airport and am quite used to seeing airplanes and helicopters. I have seen some UFO's in the past (about 5) but never made a report, but considering I took a video of this one, I see no excuse not to. Why did I have a camera with me to go out to eat? Especially my new one I just got for a trip? Good question. I'm one to definitely trust my \"gut\" and since my buddy recently had a sighting on Hilsborough and Racetrack Rd (my extremely skeptical friend who DOES NOT believe in this stuff), I felt the need to trust my gut and bring my camera with me. Its really just for pictures (Canon PowershotSX 150) but videos are always fun. So yes, a gut feeling told me to bring my camera and I did. Within about a mile of my house, I see this Orange Orb-like object quite low than what a normal airplane would be doing in the area. Living by the airport, you get quite used to seeing many many objects in the sky, and I knew IMMEDIATELY that this object was not normal. First, it was low and I could tell it was low. I had perspective. It loooked like a floating Jack O Lantern, a floating pumpkin, or some sort of illuminated object. But it wasnt lit from within, it was lit on the outside as well. When I say floating, I don't mean that it was ascending, not by any means. It did NOT ascend at all. I saw it coming towards me, below any cloud cover and much lower than any airplane. Do you realize how strange it is to see something and know IMMEDIATELY that it shouldn't be there? So I quick pulled over to a blocked entrance to a Scottish Rite Masonic Temple. I got my camera, turned it on and had enough time to catch the object seemingly pass over the Masonic building and continue its path along Memorial. Memorial does curve, so it's difficult to tell which way it was heading. I want to Say Northwest, over the bay. Not entirely sure. However, when I did see it, it was headed straight toward me (seemingly) on Memorial. I got out, saw it basically above me car, but out like 300 or 400 yards. It is difficult to judge distance when you don't know the size of the object you are seeing. To me visually, it looked like a large Basketball. Giving off Orange Hue. Glow, whatever you want to call it. There were NO FAA LIGHTS. And it was coming from the direction of the airport but not in any flight pattern I've ever seen. (When its windy, yes, the runways change) but it was too low to be an airplane from the airport, because it was unlike any flight plan i'd seen. It was moving in the same direction as Memorial Hwy, it was moving (from my vision) left to right if I'm facing the building that was in front of me. It did not ascend, it kept a distinct flight path. It moved quickly, but for how low it was, I would bet it was moving about 60 or 70mph. I do have contacts but I was not wearing them. Way too low, not ONE Flashing light. And thankfully, I caught an airplance in my shot. Unfortunately, I have a typical UFO video in that its shaky, and there are little reference points. I tried to do my best, but it all happened so fast. I zoomed in too much causing it to be blurry and zoom in RIGHT when the airplane was flying over it. But at least I caught that. So again, I saw an object, headed toward me, I saw it from my field of Vision while driving. It was low enough for me to basically slam on my brakes and pull over meaning that I knew it was abnormal as far as an airplane or helicopter are concerned. It couldn't have been a Hot Air balloon. It couldn't have been a remote controlled helicopter and it wasn't a blimp (Ive seen plenty living in Tampa) However, suppose it was a Chinese Lantern, well, it wasn't internally lit. and it moved laterally not up. Never once to did it seeem to rise in height. My first thought was \"Wow, that looks like a pumpkin shooting across the sky.\" I have seen a ball of light very similar and at the same height over St Pete beach (I have no visual evidence of this event). About a year after seeing the Orange ball over the beach, i googled it and found out they are seen ALL over Florida (with video) and there is one instance in Indiana, where I'm from. (I saw a pinpoint of white light fly around an airplane over Grissom AFB while driving by and saw an Orange Orb over the base as well while recounting the pinpoint of light story to my sister...) the more you get into the UFO phenomenon, the more you notice the synchronicity of when and where you see them, and yes, they do seem to know when you see them. So I had the sense literally IMMEDIATELY upon seeing this pumpkin (at this point, coming toward me) Upon stopping, hopping out and grabbing the video, the object was now over me (but i was looking up at it, not directly up, but definitely below any cloud cover and definitely low enough to realize it was way too low? Hard to explain. No flashing or internal light, outside illumination only. No pulsing really, maybe a slight slow strobe, couldn't really make out a shape. I could understand if this was a remote control floating Pumpkin, but darn it if it wasn't out of my sight in about a minute. What kind of long range antennae did this thing have? If it was a prank. IF IF IF, why would they risk being so close to the airport and violating there airspace? Where were ANY flashing lights per FAA regulations? Just another note, the sighting in June or so from the Gandy bridge, the girl and her boyfriend witnessing a giant object that came up to the bridge, was an aquaintance of mine. I have friends left and RIGHT seeeing things in Tampa. My guess is this, there are SOOOO many airplanes in the sky at all times, that a majority of people don't take notice to the objects, so in essence, its a perfect environment for them to blend in. The sightings in Clearwater and St Pete (which are all within an half hour drive) are also quite frequent."],"Object Shape":"Circle, Oval, Sphere","trends":["There have been 105 other sightings in Tampa","There was one other sighting in Tampa on or around November 8th 2011","This sighting has never been favorited.",""],"Tags":"City","Disposition":"IFO","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/33266.html.txt","/var/www/straped/mufon/org/33266.html"],"Date of the Event":"11/08/2011 08:02 UTC","Summary":"Saw moving Orange Sphere, like a Jack O Lantern in Tampa along Memorial Hwy","Region":"Florida"}