{"trends":["There have been no other sightings in Roaring Spring","This sighting has never been favorited."],"Object Shape":"Boomerang","divs":["Sighting DetailsI was driving home from the local archery range on st rt 36 heading south as i turned right onto the road to go to my house i noticed a light off in the distance above the tree line. At that time i thought it was the crecent moon off in the distance. Note what i saw was huge above the trees. I really wanted to get a closer look and hoped to get the trees out of the way so i could get a picture of what i thought was the moon. I turned left onto a road that i thought would give me the best view as i turned onto this road my radio which was working fine cut to static and my cell phone shut off when i got closer to the object maybe 300 yards it began moving off to the west behind the tree line. i thought this was very strange and as the object began moving off my radio came back on and i got several texts that i hadnt recieved since my phone quit working. i made a right to go up a hill where i thought i would have a better look but when i got up there the object was nowhere to be seen. The thing that scared me the most was i looked up to the north and could clearly see the moon up in the sky it was half full and very small compared to the object i had seen and not nearly as bright. The whole sighting only lasted four minutes when i got home i was looking up at the sky the whole way into my house trying to figure out what i might have seen. The object was about the size of two foot ball fields in length and maybe the width of one foot ball field wide. it was crecent shaped and a bright white color."],"Date Submitted":"11/11/2011 12:26 UTC","Source":"MUFON","Tags":"City","Sighting Duration":"00:04:00","files":["/var/www/straped/mufon/html2text/33265.html.txt","/var/www/straped/mufon/org/33265.html"],"Case Number":"33265","Region":"Pennsylvania","Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Latitude":"40.335909","City":"Roaring Spring","Disposition":"Unresolved","Date of the Event":"11/02/2011 11:15 UTC","Object Features":"Unknown","Log Number":"US-11112011-0001","Longitude":"-78.390847","Summary":"At first i thought it was the crecent moon really big behind the trees but it turned out to be something totally different","map":"<A HREF = \"http://maps.google.com/maps?q=40.335909,+-78.390847(33265)&iwloc=A&hl=en\"> mufon case (33265) map </A>","Country":"United States"}