{"Country":"United States","Latitude":"37.347716","Longitude":"-121.887556","divs":["sighting detailsi have been a lifelong \"stargazer\" and a working musician since 1969. as a result i am most often wide awake and outdoors well before sunrise. before going any further...no, i do not smoke pot. i have never used psychedelics nor do i know any blues musicians that have used them. while having a smoke in front of my house at about 0400, as is usually the case, i looked up for the moon and made sure all the stars were in their places and immediately saw 3 points of light, forming a triangle, not at home. it was northeast and slightly above a 45 degree angle from the horizon, apex pointing northward, toward pleasanton\\livermoore. the triangle took up about 1\\10 of the northeastern quadrant. if it was a single entity it was huge. but it did appear to be simply 3 points of light. i don't look up with intent to spot a ufo. it's simply a habit of appreciating the stars and moon on clear nights. so i'm quite familiar with them. this trio was a huge red flag. i have purposely tried to spot them again, scanning the area 2-3 times a night since then and nothing even comes close to resembling them. it may not sound like much to most but this was so wrong to me that it raised an alarm. i've never seen a ship or solid object of any sort before but, besides this trio of lights, have witnessed 2 slightly unusual events in the last 1 1\\2 to 2 years. in the same area of sky what appeared to be \"shooting stars\" shot at tremendous speed in a southerly direction right above, and parallel with, the mountainous horizon adjacent to milpitas\\san jose. not too alarming...except they weren't on a downward trajectory. they shot straight as an arrow south until reaching the horizon in a matter of about 2 seconds. i didn't think it noteworthy, even though i'm aware of the research facilities in the livermoore area, until now since my \"trio of lights.\" i very much appreciate this being taken seriously. thank you. bruce"],"Case Number":"33263","map":"<A HREF = \"http://maps.google.com/maps?q=37.347716,+-121.887556(33263)&iwloc=A&hl=en\"> mufon case (33263) map </A>","Log Number":"US-11102011-0015","Region":"California","Object Features":"Other","City":"San Jose","trends":["There have been 106 other sightings in San Jose","There was one other sighting in San Jose on or around November 3rd 2010"],"Object Flight Path":"Stationary","Tags":"City","Object Shape":"Star-like, Triangle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33263.html.txt","/var/www/straped/mufon/org/33263.html"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/10/2011 08:51 UTC","Weather Factors":"None","Date of the Event":"11/03/2010 04:00 UTC","Viewing Distance":"Unknown","Summary":"3 points of light, starlike in triangular formation, NOT known constellation & not appeared since"}