{"Log Number":"US-11112011-0007","Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around August 15th 2011"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/33271.html.txt","/var/www/straped/mufon/org/33271.html"],"Summary":"Bright planet like light blinking light in the sky. looks like its in Earth's atmosphere.","Weather Factors":"Unknown","Region":"California","Longitude":"-118.237525","map":"<A HREF = \"http://maps.google.com/maps?q=34.056234,+-118.237525(33271)&iwloc=A&hl=en\"> mufon case (33271) map </A>","Date of the Event":"08/15/2011 12:00 UTC","Tags":"City","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Object Features":"None","Disposition":"Unresolved","Case Number":"33271","Date Submitted":"11/11/2011 01:03 UTC","City":"Los Angeles","Sighting Duration":"Undisclosed","divs":["Sighting DetailsFor the last few months from August to now I have been seeing a bright venus sized light, sometimes there are two, in the west and east at night. At first I thought it was helicopter, but it didn't move an inch for over four hours. I was in the military and am familiar with most military aircraft and what can usually be seen over the county of Los Angeles so I ruled out the idea of it being man made. I think it could be a planet but I know a little bit about astronomy and know what planets are in view usually. I've google star mapped it and nothing shows up, plus it blinks different colors and it is never in the same place. Also the north star is the only star that I know of that doesn't move as the Earth moves. This thing just stays stationary in a different place almost every night. A friend of mine saw it too. He said he saw a smaller light connect with the larger light. I don't have a camera plus it would just look like a planet on video, but I was curious if anyone else has reported this. I think its a either a planet or maybe it's the space station, it's just sometimes there are more than one and they are not that close to each other. Sorry for bothering you people. Any info on this would be appreciated."],"Latitude":"34.056234"}