{"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/33287.html.txt","/var/www/straped/mufon/org/33287.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.954654,+-86.329085(33287)&iwloc=A&hl=en\"> mufon case (33287) map </A>","Object Features":"None","Sighting Duration":"Undisclosed","Region":"Michigan","Disposition":"Unknown","Date of the Event":"10/29/2011 12:00 UTC","Summary":"Very similar to the","Source":"MUFON","Longitude":"-86.329085","Date Submitted":"11/12/2011 12:38 UTC","City":"Berrien Springs","Case Number":"33287","Latitude":"41.954654","trends":["There has been one other sighting in Berrien Springs","There were no other sightings in Berrien Springs on or around October 29th 2011"],"Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-11122011-0001","divs":["Sighting DetailsI was traveling north on the 31 bypass near berrien springs on October 29 2011 sometime between 9-10pm. Somewhere between Snow Road and East Shawnee Road on the west side of the highway I saw a VERY large triangle of orangish-red lights taking up the sky in my drivers side window. At first I thought it was several (5) small airplanes waiting to land at the airport in berrien springs, but the lights were constant and moved together changing pitch in a V formation. The formation was huge, and i witnessed one light of the five fade out then another seemed to take it's place. I tried to monitor it's movements further but I was driving on a highway with my son sleeping in the back seat, I then got off at the Berrien Springs exit on Old 31 to get a safer look. Once I found a spot to safely pull over (at Berrien Dental off the highway) The formation was still by the area I first saw it and seemed to be moving slowly. Unfortunately I wasn't able to hang out long enough to see what happened. I believe what I saw was nothing \"normal\", but being a person of science I can't say what it was for sure."],"Tags":"City"}