{"Viewing Distance":"Unknown","Date of the Event":"02/28/1993 09:52 UTC","Log Number":"","City":"Killeen","Sighting Duration":"Undisclosed","Date Submitted":"02/28/1993 09:52 UTC","Country":"United States","Longitude":"-97.727796","Case Number":"3328","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.117119,+-97.727796(3328)&iwloc=A&hl=en\"> mufon case (3328) map </A>","Summary":"Not Provided","Object Shape":"Undisclosed","Object Flight Path":"Undisclosed","Tags":"City","Object Features":"Undisclosed","divs":["Sighting DetailsSighting Report: This happended in 1993 in Killeen, TX. I cannot remember the exact day but I know it was around the middle of March because my husband was at NTC in California and I was alone. We lived in these two story apartments off base (Fort Hood) and it was evening close to 10:00 at night. It was a very clear night, no clouds and fairly warm for that time of year. My neighbor was visiting with me her name was Wendy Hartman ( not sure of last name ) but anyways we were visiting when her little brother who lived with them came over and said there were weird lights in the sky. We went outside to the balcony and looked out. The lights appeared to be coming from over the Fort Hood Air feild area. At first we told him that they were just strobe lights because they seemed to be making some weird pattern in the sky. But as we watched we started to get kind of freaked out because the lights were very bright, I mean as in very very strong not light like an artifical beamed strobe light would make. What was really strange was what these lights were doing. There appeared to be maybe between 10-15 separate lights or globes becasue they were not small. they were white globes. They moved around the sky all scattered up and down in all directions. then to our amazement they all lined up in a straight line and moved together, forward, then backward then up and down, then a few whould shoot away real fast then come back. Some of the globes would shoot straight up into the sky real fast and disapear and then return slowly back down. Some of them would go diagonally and then appear to hover and not move. It was a really fantastic show of some type of areodynamics because as we watched we could not believe the positions these lights were acomplishing only to come back together in a straight line and go up and down and diagonally, horizontally and every which way. Another neighbor came out at that time and stood out there and watched with us too for some time and thought it was really srtange, he ruled out strobe lights becasue of the globes light intensity and what they were doing in the air as if each single globe has a mind of its own, we ruled out helichopters or any type of aircraft because of the speed and the directions the lights were going. Finally we got real creeped out and said that something was no right especially since the lights seemed to be coming from Fort Hoods air field. Our nieghbor suggested we call III Corps and report it. I called III Corps and reported the sighting and I remember the operator was really egsasperated because she said that she had been recieving similar phone calls all night long. I have no doubt in my mind that what we saw that night was not an airplane or strobe lights. IT has been years now since the incident but I have seen shows or reports over the years of lights like the ones we saw and it creeps me out becasue what I saw was so similar to some of these other accounts. I dont know if you can investigate something so old but I am sure that if you call Fort Hood, TX and ask III Corps to show you records of the Blotter Reports for the month of march 1993 there has to be record of all those phone calls that were called in on that night. that is all I have. I am writing this because my husband encouraged me to write to you because it has bothered me all these years about those lights and i know i am not crazy but I know what I saw."],"Weather Factors":"Unknown","Region":"Texas","Disposition":"Unknown","trends":["There have been 16 other sightings in Killeen","There were no other sightings in Killeen on or around February 28th 1993"],"files":["/var/www/straped/mufon/html2text/3328.html.txt","/var/www/straped/mufon/org/3328.html"],"Latitude":"31.117119"}