{"Object Shape":"Sphere","City":"Jamestown","Latitude":"42.087082","map":"<A HREF = \"http://maps.google.com/maps?q=42.087082,+-79.253686(33292)&iwloc=A&hl=en\"> mufon case (33292) map </A>","files":["/var/www/straped/mufon/html2text/33292.html.txt","/var/www/straped/mufon/org/33292.html"],"Weather Factors":"Windy","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 5 other sightings in Jamestown","There were no other sightings in Jamestown on or around November 11th 2011"],"Sighting Duration":"Undisclosed","Date of the Event":"11/11/2011 06:35 UTC","Source":"MUFON","divs":["sighting detailson friday nov 11th i was getting ready to leave my home and go to dinner with my wife the time was 6 35 pm . i was in my car already parked at curb as wife exited the house and got to car door she saw these lights. she kept yelling at me get out of the car get out of the car, \"what is it what is it\" i took a minute was really not wanting to get out but i did. i walked around car to where wife was and looked up to see a large group lights traveling across the sky from sw towards ne right over my house. they were not in a recognizable formation but they appeared to be traveling together in same direction some a slightly different speeds and altitudes. we observed at least 30 of these orbs of bright light. the duration of fly over was about 2 and a half to 3 minutes until they all disappeared over the horizon in a northeasterly direction. i have seen many shooting stars (meteorites)these in my opinion were not anything reentering earth's atmosphere. these lights were moving slower in a controlled flight path if they lost any altitude it was subtle the seemed to be moving quickly in a controlled way. they were not flares. they looked like balls light \\energy not any known aircraft. my wife snapped some cell phone pics but they are low quality. i am a 42 year old ex military man. i have seen a lot of things many aircraft. these i could not explain or identify . this sight has made a huge impression on my wife and me. we believed we saw something very unique."],"Country":"United States","Date Submitted":"11/12/2011 02:08 UTC","Log Number":"US-11122011-0006","Longitude":"-79.253686","Region":"New York","Case Number":"33292","Object Flight Path":"Straight-line path,Other","Object Features":"None","Disposition":"Unknown","Summary":"My Wife and I observed 30 or more yellow red balls of light flying in group from SW towards NE","Tags":"City"}