{"Disposition":"Unknown","Log Number":"US-11122011-0007","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Multitude of dim erratic moving orbs manuevering in all directions and two brighter shapes slowly drifting west moving in small counterclockwise circles of varying speeds","Date of the Event":"11/11/2011 09:00 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/33293.html.txt","/var/www/straped/mufon/org/33293.html"],"Case Number":"33293","Country":"United States","Date Submitted":"11/12/2011 02:16 UTC","Sighting Duration":"Undisclosed","Latitude":"38.832588","Weather Factors":"Unknown","City":"Lee's Summit","map":"<A HREF = \"http://maps.google.com/maps?q=38.832588,+-94.383936(33293)&iwloc=A&hl=en\"> mufon case (33293) map </A>","Tags":"City","divs":["Sighting DetailsMy father and I went outside at aprox 9:00pm on the bottom porch behind the house. Looking at the moon, we both seperately noticed a dim, blue object moving steadily toward the Aldebaran(,brighter red star directly below the moon.) Thinking it just a satelite, we both imediately stopped and backed up to block the moon with the balcony above. It was then that we noticed another round object heading toward the first when it stopped and the first object shot perhaps a handspan across the sky Southeast, fast enough to obviously appear elongated or having a small blue trail, and again hover then move slow. The second object began to quickly drift South then it too darted a short distance. At this point, we both attempted to keep an eye on both objects (which I said were a dim blue). It was then that several objects exactly like these were very obviously moving in straight, steady paths (at different speeds and in different N.S.E.W. directions), hovering, and very visably darting back and forth between the Aldebaran and the several bright stars south of Jupitar. It was at this time that I noticed a large white, red, and green flickering \"star\" that seemed to be dancing. I first dismissed it as a star but upon closer watch and using surrounding dimmer stars as points it was moving in distinct counterclockwise pattern aprox. half-dollar in width accelerating from drift to spurt to loop to drift to spurt,etc. My dad & I were able to verbally collaborate it's distinct direction and speed from various standpoints as it continued. We both turned our attentions back to the zooming blue orbs after ten minutes or so and noticed another identical object above venus moving west making similiar small circular patterns which disappear over the house. The first dancing object by that time had moved more to the Northwest and continued slowly making its way beyond the neighboring houses, all the while continueing its orbital pattern. However it was about this time when we noticed the dusty blue orbs had seemed to dissapate as well and after another 15 or so minutes of seeing nothing out of the ordinary we retired inside."],"Source":"MUFON","Longitude":"-94.383936","Region":"Missouri","Object Shape":"Bullet, Missile, Circle, Flash, Sphere, Star-like","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","trends":["There have been 52 other sightings in Lee's Summit","There were no other sightings in Lee's Summit on or around November 11th 2011"]}