{"Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Farmington","There were no other sightings in Farmington on or around November 6th 2011"],"files":["/var/www/straped/mufon/html2text/33290.html.txt","/var/www/straped/mufon/org/33290.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.351051,+-71.058321(33290)&iwloc=A&hl=en\"> mufon case (33290) map </A>","Summary":"Soundless white light moving horizontally just above tree line","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","Latitude":"43.351051","Region":"New Hampshire","Longitude":"-71.058321","Object Features":"Unknown","Source":"MUFON","City":"Farmington","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Shape":"Sphere, Star-like, Unknown","Disposition":"Unresolved","divs":["Sighting DetailsI was sitting on my front porch, looking out due west at the clear, starry sky. Straight ahead, I noticed a white light moving horizontally, from west to north, just above the tree line. I thought it odd that it was so low and close, yet I heard no noise. My view was partially blocked by a few leafless trees, so I could not be sure if the light was steady or blinking. It moved with a steady velocity, neither slowing nor speeding up. It was moving towards dense forest, and would soon be blocked from my vision, so I walked down my driveway to observe for as long as possible. I watched it until I could no longer see it. Oddly enough, I did also see a shooting star just west of the light, while i was standing in my driveway. This was an interesting comparison to me, because what I'm reporting was definitely not a meteor. I do live about 30 miles from an airport which used to be the site of an air force base and also about 10 miles from a smaller airport. I have seen every sort of aircraft imaginable, but nothing like this. I felt the need to report this because it was so odd, low, close and soundless. I reported this on another site, but it doesn't get updated as often as this one. Came here looking to see if anyone else had reported anything similar around the same date."],"Date of the Event":"11/06/2011 10:57 UTC","Case Number":"33290","Date Submitted":"11/12/2011 01:30 UTC","Log Number":"US-11122011-0004"}