{"Date Submitted":"11/12/2011 12:55 UTC","City":"Camden","Viewing Distance":"20 Feet or Less, 21-100 Feet","Case Number":"33301","Object Shape":"Circle, Disc, Oval","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Dome","Summary":"Grey silver disk the first one seen was July 20,2011 and it had red lights at the bottom.The second one seen was on October 8,2011 and it also was a gray disk,but had blue lights at the bottom this time.","Disposition":"Unresolved","Region":"Arkansas","trends":["There has been one other sighting in Camden","There were no other sightings in Camden on or around October 8th 2011","This sighting has never been favorited.",""],"Log Number":"US-11122011-0014","files":["/var/www/straped/mufon/html2text/33301.html.txt","/var/www/straped/mufon/more/33301_submitter_file1__IMGA0114.JPG","/var/www/straped/mufon/org/33301.html"],"Country":"United States","Longitude":"-92.834329","Sighting Duration":"Undisclosed","Latitude":"33.584558","Date of the Event":"10/08/2011 10:19 UTC","divs":["Sighting DetailsOn July 20,2011 My two sons and me were outside playing bad mitten and my oldest son had happened to look up in the sky and seen a gray matalic disk with orange and red lights at the bottom and the lights were spinning around at the bottom. At the top it had slight hump and the edges were kind of pointed and it had a round circle at the bottom.It made no noise what so ever. My oldest son said look momma up in the sky! I looked up and there I saw it. I was so amazed by it. It was just hovering over one of our trees. It was moving back and forth real slow.It went into the trees and came back out.We was watching it for a good 20 minutes. Then all of a sudden it picked up speed and took off going north. On October 8,2011 My youngest son and I were sitting out on our front porch and my son looked up in the sky. He said momma what is that blue thing spinning in the sky? I was like what blue thing? So I got up and looked and there I saw a gray disk with blue lights spinning around near the bottom edge and it had a small hump at the top. I could not see the bottom.It was hovering right over our property.I told my son to keep an eye on it while I ran inside and got my camera.So, I ran in and got my camera and came back out and was gonna start taking pictures, but my camera was dead. So I ran back inside and put it on charge for like two minutes.Then I came back outside to see if it was still there while my camera was chargeing.It was still there.So, I went back in the house to take my camera off charge.Then I went back outside and started snapping pictures of it.I took like 23 pictures of it.It was just moving all over the place.All of a sudden it fliped over on it side and started going up and down.I then got alittle worried that it might be trying to land.But,it had fliped back upright again.So, I decided to wave at it.Then that is when it started freaking out and was just moving so fast I couldn't keep up with it. We had our eye on it the hole time.But then it just disapered out of nowhere.That is how fast it was moving,I had no clue of where it went."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.584558,+-92.834329(33301)&iwloc=A&hl=en\"> mufon case (33301) map </A>","Source":"MUFON","Tags":"City","Weather Factors":"Unknown"}