{"Region":"Alabama","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Log Number":"","Latitude":"32.319941","Object Flight Path":"Undisclosed","Date Submitted":"11/28/2004 02:25 UTC","Case Number":"3331","files":["/var/www/straped/mufon/html2text/3331.html.txt","/var/www/straped/mufon/org/3331.html"],"Tags":"City","Summary":"See detailed description.","trends":[],"divs":["Sighting DetailsSighting Report: Object sighted near Alabama - Florida border Well, here goes. I was on a trip from Alabama to Florida with my parents sometime between 1954 and 1960, yea I know lots of years to consider. This is the whole point I can t remember all the details, time, how long object was sighted for, etc. Anyway, I keep asking my Father to stop the car because I had to go to the bathroom ( not many service stations stayed open all night back then, also the interstate was not yet constructed. We were on Hyw 231 some where between Alabama and Florida, I believe it must have been near Florala, Alabama. Here is what I remember. My Father pulled off the highway onto the shoulder of the road, stopped the car got out, opened the back door for me to get out, and he and I walked to the rear of the car. I am not sure of what time it was but it must have been very late, we did not see any other traffic. I do remember it was very dark, kind of warm weather. I was about to do my thing, when I looked over my right shoulder and saw an object with red lights around the bottom of it, it appeared to be a disk (circle) shape with me looking up at it from an angle. The object was at tree top level, no sound, I asked my Father, \" What is that?\". I don t remember him saying anything, but I watched the object cross over the road behind us and get to the trees on the other side. This is all I remember. Both sides of the road had trees about 30 feet tall. I believe my Father and I were as close as 50 feet to the object. My parents never talked about the sighting, perhaps it never happened, then again maybe more than this occurred that night somewhere between Alabama and Florida on that lonely stretch of hi way. If you have any information please forward it to me."],"Country":"United States","Object Shape":"Undisclosed","Source":"MUFON","Disposition":"Insufficient Data","Date of the Event":"11/28/2004 02:25 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.319941,+-86.894648(3331)&iwloc=A&hl=en\"> mufon case (3331) map </A>","City":"Undisclosed","Object Features":"Undisclosed","Longitude":"-86.894648"}