{"Country":"United States","Tags":"City","Date of the Event":"11/03/2011 06:30 UTC","Case Number":"33318","Weather Factors":"Does Not Apply","Source":"MUFON","Date Submitted":"11/12/2011 10:08 UTC","Log Number":"US-11122011-0028","Latitude":"36.060322","Region":"Tennessee","Longitude":"-82.813749","Object Shape":"Blimp, Cone, Cross, Cylinder, Disc, Fireball, Oval, Square, Rectagular, Triangle","Summary":"these descriptions are for many sightings on different dates","City":"Greeneville","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Unknown","Disposition":"Unknown","Viewing Distance":"Unknown","divs":["Sighting DetailsI have been getting hundreds upon hundreds of pictures in the last three years.The first was a fireball falling and then made a sharp right hand turn and zoomed off. Since then I have gotten 'coins' that have designs,fuzzy round balls, bright sharp focused balls of red,blue,yellow,white.I even got five tiny lights running around like fireflys and when I 'brought them in' they looked like a kids amuement poark rides...Each in different colors and looking like a dolls shoe with antenna,a dart, a bat, etc. In one picture I got part of apparently a huge disc.with a pattern and a 'doorway' that these came from.They are ALONE AT TIMES.AND OTHER TIMES THERE MIGHT BE TWO TOGETHER OR THREE,FOUR OR EVEN FIVE. sOMETIMES THEY ARE CLOSE TOUCHING AND OTHER TIMES SPACES IN BETWEEN.aT TIMES THEY ARE IN A STRAIGHT LINE WHILE OTHERS IT IS CURVED IN A TRIANGLE PATTERN.I hyave seen them materialize fairly low over our field and then disappear like in a invisable cloak leaving merely a thin see through cloudy mist. I have a picture of lighted area that is a triangle and two that arte like an oblong thick sheet.I've thought some were airplanes but after moving they stopped and stayed in one spot for fifteen minutes. Some were flashes and others were solid lines of lights in a steady move. One night I was watching the sky but all of a sudden saw something I thought might be a star,..even though it pulsated colors but was in the same place for months.One night it started to move and I have pictures (that with it's movement make it look 'blimplike')as it went toward the mt. light,..then under it and went to the right...I have the whole series.I have all kinds of stories from watching these things.....The one I reported here saying Nov. 3rd was the usual flashing lights but the moon was out and I saw a slanted streak that I wondered if it was a contrail.I took the picturte but when I brought it close it appears solid and a couple pictures show two things at each end protruding from it. THEN one picture showed something amazing.There is a clear image of a 'craft' between the slanted streak and the moon. (It looks like my mothers old bathtub with feet.) What's even more amaazing is I started to look back at some pictures I took in Jan.of this year and saw several pictures with a lot of 'garbage' but there was a see through misty cloud(tiny) and the shape was like the 'bathtub' I'd just got. I put it on the computer and was able to 'bring it out' of the background.IT BECAME A SOLID CRAFT! You can see it very sharp and what it is made of. Although we don't know what the material might be ,it 'looks like' a very thick thick plastic'!!!I really have too much information to write down. On Tuesday the 8th of Nov. at 6:30 at night I saw a, close down, huge line of lights heading toward me...There's a big story with this but after a while it changed size and then shape and eventually shot straight up into the sky where it became a tiny red dot.It then came over us and the pictures I got were of a green,two white and a red line...First straight lines,..then wavy lines,..then in some there were tiny lights in between the lines.I take all these pictures from the same place in my front yard. After seeing stuff so much, I go out and look a lot.I thought they were airplanes but to have ten blinking all around you for a half hour and then taking pictures so I could tell what was a plane and wasn't(and found they 'weren't)I just take everything.They end after a half hour and are gone with 'nothing' left.We have two neighbors plus my husband and myself seeing this stuff but we now have heard of at least ten or more staring to look too.(The 'bathtub' actually looks like the craft at the top of this page but yours is upside down.The rounded part belongs on the 'bottom'!)"],"Sighting Duration":"Undisclosed","Object Features":"Dome, Window(s), Patterned Surface, Wings","map":"<A HREF = \"http://maps.google.com/maps?q=36.060322,+-82.813749(33318)&iwloc=A&hl=en\"> mufon case (33318) map </A>","files":["/var/www/straped/mufon/html2text/33318.html.txt","/var/www/straped/mufon/org/33318.html"],"trends":["There have been 9 other sightings in Greeneville","There were no other sightings in Greeneville on or around November 3rd 2011","This sighting has never been favorited.",""]}