{"City":"Baytown","Date Submitted":"11/13/2011 02:14 UTC","Log Number":"US-11132011-0002","Weather Factors":"Unknown","Summary":"Saw cigar shaped object with","Object Features":"Window(s)","files":["/var/www/straped/mufon/html2text/33323.html.txt","/var/www/straped/mufon/more/33323_submitter_file1__DSC01683.JPG","/var/www/straped/mufon/more/33323_submitter_file3__DSC01683enhancement2.jpg","/var/www/straped/mufon/org/33323.html"],"Object Shape":"Cigar","Source":"MUFON","Object Flight Path":"Unknown","trends":["There have been 7 other sightings in Baytown","There were no other sightings in Baytown on or around November 7th 2011","This sighting has never been favorited.",""],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.739125,+-94.972567(33323)&iwloc=A&hl=en\"> mufon case (33323) map </A>","Country":"United States","Region":"Texas","Date of the Event":"11/07/2011 10:37 UTC","Viewing Distance":"Unknown","Disposition":"IFO","Sighting Duration":"Undisclosed","divs":["Sighting DetailsBecause of the many accounts of people finding anomolous stuff in pictures that they didn't see with the naked eye, I will occasionally take random pictures of the sky and examine them on my computer. The very first time I did this back in 2005 I got a picture of 3 white lights in broad daylight. On November 7th, 2011 I was in my backyard (Baytown, TX) and took 2 pictures of the sky approx. 3 seconds apart. I did not see anything with the naked eye at the time. After uploading them to my computer, I opened them with a Photoshop-type program so I could examine them closer. Initially, I did not see anything (in the original picture, the object is only VERY faintly visible.) I know that simply adjusting the brightness and contrast of a photo can greatly enhance the visibility of things. I did this and immediately saw a curious dark line in the clouds in the first picture. So I used a few more techniques to enhance the photo further (sharpened it, negative filter, etc.) I was shocked at what became visible! It looks like a cigar-shaped object (or a disk-shape viewed from the side) with what appear to be dark \"windows.\" I am attaching the original photo along with the enhanced ones. The object was not in the second picture taken almost immediately after."],"Longitude":"-94.972567","Case Number":"33323","Latitude":"29.739125"}