{"Country":"United States","Weather Factors":"Unknown","City":"Seattle","Tags":"City","divs":["Sighting Details(From my own emailed newsletter report) This morning, about an hour before the break of dawn -- at 5:30 am., to be fairly exact -- I had the visitation of two UFOs in the eastern sky! They appeared, like that first one about a week ago, as two medium-bright stars, not paired but fairly close to one another -- and yet behaving quite differently from last week's instance. The one last week, if you'll recall, was on a very slow but definite track southward -- too slow to be any aircraft or even a satellite. This morning's pair had no such consistent track. They moved slowly, but quite erratically and, as noted, independently from one another -- generally southward, but sometimes up or downward. One of them remained visible for more than a half-hour. I was able to track them pretty well with binocs because I was looking through the 'filter' of a leafless tree outside my window, a tree of many slim trunks that allowed me an easy measure of directional movement and relative speed. It was quite a display,and with two such sightings in a week's time, I have to assume that they are out-and-about so as to be on display at this particular time. ___________ [Your questions alongside: 1. In my apartment living room. 2. Watching morning sky for daybreak. 3. Early stars are rare here; my first thought is always aircraft. 4. It required binoculars to pick up movement, as detailed above. 5. Amazed - For me, it was a second occasion, as noted above. 6. Went gradually beyond adjoining building - by then in increasing daylight."],"Sighting Duration":"Undisclosed","Case Number":"33320","Object Features":"Undisclosed","Log Number":"US-11122011-0030","Longitude":"-122.310371","files":["/var/www/straped/mufon/html2text/33320.html.txt","/var/www/straped/mufon/org/33320.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.666692,+-122.310371(33320)&iwloc=A&hl=en\"> mufon case (33320) map </A>","Summary":"two of them, star-like, trending south, but often erratically (up/down)","Date of the Event":"11/12/2011 05:30 UTC","Date Submitted":"11/12/2011 10:09 UTC","Latitude":"47.666692","Object Shape":"Star-like","Object Flight Path":"Path with directional change","Source":"MUFON","trends":["There have been 110 other sightings in Seattle","There was one other sighting in Seattle on or around November 12th 2011"],"Region":"Washington","Viewing Distance":"Unknown","Disposition":"Unresolved"}