{"Region":"Ohio","Case Number":"33324","Country":"United States","Object Shape":"Circle, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.304976,+-81.479194(33324)&iwloc=A&hl=en\"> mufon case (33324) map </A>","Summary":"Initial cluster of 3 lights in a triangle form then saw a series of single lights of the same golden color one after another .","City":"Macedonia","Tags":"City","Latitude":"41.304976","Source":"MUFON","divs":["Sighting DetailsOn the evening of November 12, 2011 I was sitting outside by a firepit with a friend she was facing me. About 5 minutes before I saw anything my neighbors dogs were barking like crazy, I looked in the direction of my neighbors house to make sure all was well, (it was) it could have been a deer... that said shortly after I noticed 3 bright golden solid round lights in a large triangle shape it was moving slowly and seemed to come out of nowhere moving slowly. I said \"Oh-my-God\" and pointed behind her. We ran over to the edge of my property get a better look and then following the large triangle was a series of singular lights following the triangle one after another they were all flying as if they had just taken off. They were going from very low to higher, but not very high in the sky. I ran into the house and called for my two sons to come see it- I found this sight to be disturbing and I called 911 I thought perhaps it may be a terrorist event. I was transfered to a non-emergency number and explained what I was seeing and what was being witnessed by 4 adults. I have spent my day today trying to see if anyone else witnessed what we saw- there could be no way we were the only ones who saw that at that time. 7:30 pm is not all that late and the evening was mild. All the lights were going the same direction and there were over a dozen of the singular ones. I live in a semi-rural area. My home is situated on 2 acres and there are a few small lakes in my neighborhood. I have never seen anything like this in my life. If there is a next time I will be sure to grab a camera."],"Date Submitted":"11/13/2011 03:16 UTC","Date of the Event":"11/12/2011 07:30 UTC","Object Flight Path":"Straight-line path","Object Features":"Unknown","Longitude":"-81.479194","Disposition":"IFO","Weather Factors":"Unknown","trends":["There have been no other sightings in Macedonia","This sighting has never been favorited."],"Log Number":"US-11132011-0003","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/33324.html.txt","/var/www/straped/mufon/org/33324.html"],"Sighting Duration":"Undisclosed"}