{"Case Number":"33333","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/07/2011 03:00 UTC","Longitude":"-86.186546","Weather Factors":"Unknown","Log Number":"US-11142011-0002","Latitude":"38.529435","Object Shape":"Oval","divs":["Sighting DetailsI was feeding my dog outside, i was about to head back into the house when i noticed out of the corner of my eye something brighter and more colorful than an airplane would be at night. I turned my head to the left, and noticed about fifteen or so blinking multicolored lights in the shape of a horizontal oval. I have a wrap around porch that mostly faces the south, and i just stood there and watched this thing for about a minute, and it wasn't moving at all, just completely still. I didn't hear anything, and there was no wind at all that night. If i wouldn't have stopped to watch it, i would have just thought it was like a military jet or something weird, but the fact that this object was completely still and unmoving really freaked me out. So i ran inside and called for my friend who was inside the house, hoping this thing wouldn't be gone when i came back, and her and i just stood on the porch watching this thing, it looked like a flat disco ball. Not the silvery mirrored ones, but the ones with all the multicolored lights that sort of pulsate and make you dizzy. The lights were white, yellow, green, blue, and red in color, and they all alternated in an oval shape. There was no particular pattern in which they blinked, but it was like they got dimmer and then brighter, way brighter than airplane lights. The lights were pulsating in an area about the size of a bottle cap, and the lights themselves were only like tiny dots. And i would guess it was about a mile or so away, and around 300 ft in the air. After i went and got my friend, we stood there just saying things like \"what the hell is it? what kind of airplane is it?\". She just thought it was an airplane, she kept saying over and over again, \"it's moving, we just don't see it moving because it's so far away.\" But then it went from being stationary in the sky, to moving super slow in a straight line, and it took it about ten minutes or so to move across the sky. I felt really excited the entire time, i kept thinking that there was no way this was an airplane. My friend denied it was anything spectacular, but she stood with me and watched it the entire time it moved across the skyline. The object then got bright and shot straight up into the sky, and was gone. I felt sort of sick to my stomach, and my friend was really freaked out, because she went inside and drank two entire glasses of water. She said she felt really thirsty. I had this weird feeling of unease, and we were both very shaky."],"City":"Salem","files":["/var/www/straped/mufon/html2text/33333.html.txt","/var/www/straped/mufon/more/33333_submitter_file1__UFO1.jpg","/var/www/straped/mufon/more/33333_submitter_file2__UFO2.jpg","/var/www/straped/mufon/org/33333.html"],"Disposition":"Unknown","Sighting Duration":"00:10:00","Tags":"City","Region":"Indiana","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.529435,+-86.186546(33333)&iwloc=A&hl=en\"> mufon case (33333) map </A>","Date Submitted":"11/14/2011 02:34 UTC","Object Flight Path":"Hovering then path","Summary":"Was outside looking south west, noticed blinking lights in the sky, the UFO was very still and then moved super slow across the skyline for about three minutes. Then shot straight up into the sky and was gone.","trends":["There have been 5 other sightings in Salem","There were no other sightings in Salem on or around November 7th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Object Features":"Unknown"}