{"divs":["Sighting DetailsI was watching TV in my room, my parents were already asleep, when I heard this loud, hovering sound directly over my house. It sounded almost as if an extremely heavy wind was coming down right on our home. I then got this terrible feeling and got too scared to get out of bed. I started calling out to my parents who are usually very light sleepers and whose room is only about ten feet away from mine, but they wouldn't respond. I continually yelled for them when suddenly the noise over the house got even louder before suddenly zooming off with a swoosh-like sound. As soon as it zoomed off, my parents suddenly awoke, saying that they only heard me call them once, when I actually called them about fifteen times. I then started shaking from head to toe for some reason. I kept shaking for about ten minutes, I have absolutely no idea why I was so frightened, it was almost as if my body was reacting to instinct or something. My parents then told me to sleep in their room because of the terrible condition that I was suddenly in. I eventually stopped shaking and fell asleep. Then, when I awoke in the morning, my parents told me that about 45 minutes after I went to sleep, they were awoken by a strange screeching noise in the distance that seemed to sound similar to the noise that I described. I'm usually a skeptic and I look for logical explanations, but I couldn't find any explanation for the event. It definitely wasn't a helicopter or a jet. The only thing I could compare the noise with is with some type of huge hovercraft. It was especially strange that my parents didn't wake up when I first called them and the reaction that my body had to it. I felt jittery and sick to my stomach for a short while after the event. It didn't seem to give out a friendly vibe, that is for sure. The vehicle was so loud that I'm sure someone else in town must have heard it."],"Object Shape":"Unknown","Region":"California","Longitude":"-115.947851","City":"Salton City","files":["/var/www/straped/mufon/html2text/33339.html.txt","/var/www/straped/mufon/org/33339.html"],"Viewing Distance":"Unknown","Summary":"Heard a loud, hovering sound over my house. It lasted a long time before flying away suddenly.","trends":["There have been 4 other sightings in Salton City","There were no other sightings in Salton City on or around November 13th 2011"],"Log Number":"US-11142011-0008","Weather Factors":"Unknown","Sighting Duration":"00:01:00","Latitude":"33.30181","Date Submitted":"11/14/2011 02:05 UTC","Case Number":"33339","map":"<A HREF = \"http://maps.google.com/maps?q=33.30181,+-115.947851(33339)&iwloc=A&hl=en\"> mufon case (33339) map </A>","Country":"United States","Source":"MUFON","Tags":"City","Object Features":"Unknown","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Unknown","Date of the Event":"11/13/2011 11:15 UTC"}