{"Latitude":"31.247793","files":["/var/www/straped/mufon/html2text/33337.html.txt","/var/www/straped/mufon/org/33337.html"],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Date of the Event":"11/14/2011 06:00 UTC","trends":[],"Log Number":"US-11142011-0006","Longitude":"-92.139784","Region":"Louisiana","Case Number":"33337","map":"<A HREF = \"http://maps.google.com/maps?q=31.247793,+-92.139784(33337)&iwloc=A&hl=en\"> mufon case (33337) map </A>","Viewing Distance":"Over One Mile","City":"Undisclosed","divs":["Sighting DetailsI was outside the front of my house waiting for them to show themselves as they always come out when I come out. It usually takes anywhere from two to five minutes for them to show up. I'v been doing this for one year now, ever since I got my first green laser. It was also in the evening around 6:00p at this time of year. By mere coincidence my son pointed to the sky where I had previously pointed the device and that is when we saw our first UFO's up close and just at tree top level. Ever since that night I, along with others have witnessed odd things in the sky above my home. Things like a flying triangle the size of three Airliners and balls of light that come straight down to the ground or shoot perfectly parallel to the ground. Great flashes of light and orbs that emerge from some type of portal after the flash. Most of the time these objects keep some distance but on occasion they come too close for comfort. Also on occasion - well actually quite frequently now , they communicate or react to my initial laser or flash light signal. Last night was such a night. I was outside for no more than 2 to 3 minutes when I took my laser and shone a direct beam upwards. As usual, a medium intensity orb appears directly overhead traveling south to north. As usual, I froze. Oddly enough They still frighten me even though I'v seen quite literally hundreds of these things since my first sighting a year ago. The orb proceeded as usual at a steady pace, although sometimes they travel at many different rates of speed including, slowing, accelerating, stopping and hovering. I let the orb pass me for a little bit so it would not be directly overhead, then I took my laser and directed a beam directly behind the craft (NOTE: I DO NOT and IT IS NOT advisable to train a light beam of any kind directly at a person or craft as this could lead to retinal damage of the pilot and compromise the safety of the craft). As soon as I released the button, the craft responded with an intense beam of white light right back at me. I used to think that they were either coming straight at me or they illuminated so bright that it appeared that they were coming straight at me, but now that I'v been seeing them for a while, I think their just retorting with a white beam of light back at me. Immediately after this first Orb was out of sight, Two orbs, one in front of the other came from the north where the first orb went. Again I watched these two orbs pass directly overhead but I did not train my laser until they were away from me, partially because I was afraid and because there was an airliner passing through the line of sight. After I had a clear line of sight I trained my laser to the rear of the trailing orb with the knowledge that If they were some type of human craft, this angle would not allow them to see the light source. Immediately, both Orbs began to either Intensify in Luminosity or train a beam of light right back at me. I was so excited because, although I'v been seeing orbs in pairs lately, this is the first time they simultaneously illuminated."],"Summary":"Communication with One Orb then Two Orbs side by side responding to my laser and flashlight.","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date Submitted":"11/14/2011 11:21 UTC","Tags":"City","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Object Shape":"Circle, Sphere, Star-like"}