{"Region":"Vermont","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.152458,+-72.046034(33340)&iwloc=A&hl=en\"> mufon case (33340) map </A>","Disposition":"Unknown","Date of the Event":"02/14/1995 01:00 UTC","Log Number":"US-11142011-0009","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"44.152458","trends":["There have been no other sightings in Newbury","This sighting has never been favorited."],"Case Number":"33340","Viewing Distance":"Unknown","Longitude":"-72.046034","files":["/var/www/straped/mufon/html2text/33340.html.txt","/var/www/straped/mufon/org/33340.html"],"Source":"MUFON","Object Shape":"Other","Object Flight Path":"Other","divs":["Sighting DetailsWas driving north on VT Rte 5 at about 1am on about February 14, 1995 in Wells River Vt. I just made the turn onto Rte 302 and was about to go over the bridge spanning the conneticut river into NH. When I was infront of H.O. Taylor's Chevrolet I repositioned myself in my seat as my back was aching, and when I did so this thing appeared right over me through the windshield. It was symetrical and half an ovoid cut through the center and looked like a shoe heel. I did not see it come or go, it was sort of like in a freeze frame. It was a starry night with no moon, but the starlight was very bright. What I saw was this half ovoid shape outlined in white sparks, like those from a sparkler, and the shape was solid as it blocked out the starlight completely. It was black and I didn't see any lights or windows. I gathered from the direction that the sparks were flying that the flat end of this shape was the leading edge. When I looked at a map later it appeared to have been going in an almost perfect westerly direction. With the speed this thing was going I bet it was over VT and NY states and over the great lakes in a matter of a few seconds. Though I had nothing to gauge the size of this thing to my impression was that it was huge, like VERY huge. There was no sound at all, no boom or anything like that. My car engine died when I saw it. Though I was sort of shocked I immediately jumped out of my car and looked to the west and didn't see or hear anything. I stood there for a few seconds then realized it was about 20 below zero and jumped back into my car, the engine started with no problem. I might add that I had bought the car new about six months before this incident,and had no trouble with it. I was not afraid, didn't feel threatened, just was very perplexed and still am. I live in a Military Operations Area and have seen and heard F15s,F16s, transports,and various types of strangely shaped conventional aircraft, etc. at day and night, as have my friends, coworkers,and neighbors. I have also seen, during my lifetime, blimps, helicopters of various types, and hot air balloons.I have also seen a comet,various meteor showers,the space station,the space shuttle, and satelites. I have never seen anything like this UFO before or since. I question whether ETs have ever been to earth but I know what I saw. I once told the above to a department head of astronomy at a prestigious university. He looked at me like I had three heads, and very curtly said \"I don't know\" and turned on his heels and was gone in a flash. I might add that I am a professional in good standing in my job and community and don't drink or take drugs."],"City":"Newbury","Date Submitted":"11/14/2011 03:00 UTC","Summary":"symetrical half ovoid shape, sold, outlined in white sparks, fast, and huge.","Weather Factors":"Unknown","Object Features":"Unknown"}