{"Object Shape":"Disc, Fireball, Sphere, Star-like, Triangle","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Date of the Event":"11/13/2011 12:00 UTC","Case Number":"33341","Latitude":"38.88587","Source":"MUFON","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.88587,+-77.10093(33341)&iwloc=A&hl=en\"> mufon case (33341) map </A>","Longitude":"-77.10093","Weather Factors":"Unknown","City":"Arlington","files":["/var/www/straped/mufon/html2text/33341.html.txt","/var/www/straped/mufon/org/33341.html"],"Region":"Virginia","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","divs":["Sighting DetailsI was in the parking lot of my apt buildin preparing to bring up groceries. I pulled up to the front of my building as I asked my wife to bring a cart to bring them up stairs. When my wife arrived with the cart...I proceeded to the rear back passanger side of my car to start loading the cart. As I bent down to grab a 50lb bag of rice I heard my wife exclaim ...\"WHOA\". As it happened, as she said that I simultaneously was turning my sight toward the direction that she was naturally facing. At which point I saw what appeared to be what I thought was a shooting star over head. The shooting star that zipped by was extremly low. Unbelievably low. I put the 50lb bag of rice in the cart, grabbed my iphone out of my pocket....and began recording in the general direction of where it shot towards in front of a treeline. Immediately on the iphone I noticed within the trees a blinking pulsating brake like red light turning on and off within the trees. standing near my wife, not sure what it was I brought it to her attention as I was immediately confused as I paned my eyes to the trees I saw nothing....but then back to the iphone theres the light. Then several more lights appeared within the trees white, and several were like a road flare or flare gun color and illumination. I grabed two other random building residents through out the event who saw the same thing. I paned the camera around to see what other objects within a close proximity may appear at which point when I moved the camera to the sky directly above 7 blinking lights in the tree line....I saw a white star like object directly above int he sky that was blinking on and off. It was a clear night at that time...so it was blatanly obvious that it was there. It turned on and off...almost exhibiting behavior like a light that is almost dead and it starts flickering. It did that same thing expect the flickering was slow...but with each...slow flicker what looked like a faint spec of a white dot materialized into a fully symetrically spherical dot...but the flickering continued...and then what was one dot was somehow now two distinct sepearate dots...then finally there were three sepearate dots at which point it started gently gliding toward the building at which point I noticed that what was only visible with my iphone...i could now see naturally with my own eyes as well as within the iphone itself. The object formed a triangel with the just the 3 spherical lights whiter than white lights no other form visbible structure wise as inbetween them was blackness. I brought my attention back to the iphone as the object was almost over the building it did something that would perhaps best be viewed on video for effect, but it suddenly had a blurry glow of red around it while simultaneously doing what looked like a vibration (more aptly a shake) then it jolted forward several ??? unknown amount of feet ahead then was back to the normal three dots. Then it glided gently over the apt bldng."],"trends":["There have been 7 other sightings in Arlington","There were no other sightings in Arlington on or around November 13th 2011","This sighting has never been favorited.",""],"Log Number":"US-11142011-0010","Viewing Distance":"20 Feet or Less","Summary":"witnessed object at length. Recorded video...took photos. Would rather talk to someone. live for forensic analysis of my video.","Date Submitted":"11/14/2011 04:43 UTC"}