{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/3334.html.txt","/var/www/straped/mufon/org/3334.html"],"Longitude":"-77.504986","Case Number":"3334","Date of the Event":"11/30/1998 06:55 UTC","Latitude":"37.377094","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 7 other sightings in Chesterfield","There were no other sightings in Chesterfield on or around November 30th 1998"],"Viewing Distance":"Unknown","Region":"Virginia","Date Submitted":"11/30/1998 06:55 UTC","Log Number":"","Object Shape":"Undisclosed","City":"Chesterfield","Object Flight Path":"Undisclosed","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.377094,+-77.504986(3334)&iwloc=A&hl=en\"> mufon case (3334) map </A>","divs":["Sighting DetailsSighting Report: One night, about six years ago, my wife and I were returning home from visiting my parents. As we descended a hill toward a stop light, heading west, I saw a bright light in the distance that seemed to be moving very slowly or even stopped. As we sat at the stop light I could tell that it was moving very slowly, and I pointed that fact out to my wife, who had not noticed the bright light before. When the light turned green, we turned left and ascended a long hill that led to our subdivision. When we got to the entrance of our subdivision, the light was almost overhead and we could see that it was some kind of craft. As I pulled into the subdivision, I parked the car at the curb and got out just as the craft was overhead. It was very large, maybe 50 or 60 yards long and wide, triangular in shape with a light on each tip. It was probably a 100 yards above the tree tops. Two things that really spooked us was that for a craft that large, it made not a sound and it moved so slow. It just was kind of floated by. A normal craft that large, going that slow,would certainly have stalled out and crashed to earth. My wife and I watched in amazement as it moved east toward the city of Richmond. When I called the local airport to see if they had any strange object on radar, the reply was negative, and I reasoned later that they wouldn t see anything on radar because it was flying so low. Both of us will never forget that night and continue to wonder to this day what that craft was.-"],"Disposition":"Insufficient Data","Summary":"Not Provided","Object Features":"Undisclosed"}