{"Date Submitted":"11/15/2011 12:37 UTC","files":["/var/www/straped/mufon/html2text/33358.html.txt","/var/www/straped/mufon/org/33358.html"],"Log Number":"US-11152011-0007","Date of the Event":"05/31/2009 12:00 UTC","Source":"MUFON","Object Flight Path":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.665652,+-73.834069(33358)&iwloc=A&hl=en\"> mufon case (33358) map </A>","Case Number":"33358","Longitude":"-73.834069","Viewing Distance":"Unknown","Disposition":"Insufficient Data","divs":["Sighting Detailsi tried contacing different ufo's investigations and i'm ignore. Now i just join MUFON and i will have patience until i have MUFONS members present to witness this fleet of ufo's that can be seen by the naked eye on any clear night. Last summer i tried communicated with one alien of one ufo and the alien litely laser me on my face as i sat down on my folding chair on the beach on jamaica bay howard beach queens new york 11414 near where i live adjacent jfk intntr airport. i spoke to this alien for about an hour then i went home nothing happen. The next day in the morning while i was lying in bed the alien litely laser me on my leg i'm not and i don't anyonewho is familiar to communicate with super-intelligince so my reading so much on the internet of aliens of being either friendly or vicious i just became leary and didn't continue to communicate. So now that why i became a MUFON member i like to know if their are any members that can help me to communicate with this fleet of aliens ships that have a changing of the guard on every clear night sky flying out to the east like right over the atlantic ocean. I almost can't wait to have other members witness this happening. I guess i have to put in a report from every clear night that i view these ufo's until other MUFONS members verify my sightings thank you all for reading this and seeing is believeing gang. julio m barriere p.s. i notice the six questions and this is my first written report on july 14, 2009 like any night i go down to jamaica bay queens ny for years i go fishing in the bay and i witness on any clear night sky all these aliens ships. Their follow me up and down the atlantic coastline. The first time i spotted the ufo was in broad daylight a couple of years ago it few by my bedroom window. I called my brother and told him the experience amd he said it impossible only you saw it and no one else in Howard Beach saw it. It was round with lights on the outer rim flashing the lights on and off. I had another experience when i came back from atlantic city n.j. this ufo just turn its light off and was hovering quietly right over a shopping mall as i was coming out of a pizza joint after i got the bus from A.C.N.J. i just stood in the parking lot looking at the saucer with the lights turn off and no noise for about a minute then went i started to move it move very slow but it was noticable about one to two thousand feet elevation and about the same distance from me. i didn't know what to do so i retire because i know these ufo's are on to me and i'll be seeing them for life it seems. Its was obvious a ufo the first time i saw it it flew very low to be identified. I explain number four I don't know how to explain question no. five we live in a dangerous world and mankind is the most vicious most intelligenr animal and these aliens find it hard to deal with us so this is a big gamble and i'm a big highroller i think if these aliens meant any harm to me their would have abducted me and either experimented or mutilated me already i think. question number six myself and these aliens ships don'r lose sight of each other i can't wait till i have members of MUFON and other to witness this ufo fleet thamk you for reading this i know even linda moulton howe a journalist of thirty years of earthfiles still thinks i'm incredible seeing is believeing gang stay in touch if this incredible story as it unfolds all i have for now are night shots of these ufo's at about sixty or more thousand feet"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"New York","Latitude":"40.665652","Summary":"i have for now are night shots of these ufo's at about sixty or more thousand feet","Country":"United States","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around May 31st 2009"],"City":"New York"}