{"Latitude":"30.483693","Case Number":"33354","Tags":"City","Object Features":"Patterned Surface","Country":"United States","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around July 15th 1993"],"Source":"MUFON","Date of the Event":"07/15/1993 04:30 UTC","Longitude":"-87.213527","divs":["Sighting DetailsAfter picking my daughter from school, we were walking through the highschool ballfield when we saw a huge shadow on the ground. When we looked up, we saw a circular shaped object (cerca 60 feet in diameter) hovering right over us(cerca 150 feet high). we were both frozen in schock and couldn't speak at all.The object was not producing any sound, we could just see the lights going around. In the middle, the object seemed to have a circular shape with spirals on the surface.Then my daughter tripped; trying to catch her, I looked down for couple of seconds. When we looked up again, the object was gone. I asked my daughter what she saw and to please draw a picture of the object. She drew exactly what I saw; I asked her to do this because I was not sure what exactly happened to us. We have not talked about this for a long time because it makes us very uncomfortable. I have always thought that UFO stories were a hoax, but I know now that they are real. I am unsure..why or what is happening, but this experience has affected my life in a way where all traditional beliefs that I had been raised with came tumbling down."],"Summary":"Object seen by my daughter and me on a bright sunny afternoon. Can't explain why this large object was not seen by anyone else.","Date Submitted":"11/15/2011 06:54 UTC","Log Number":"US-11152011-0004","City":"Pensacola","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/33354.html.txt","/var/www/straped/mufon/org/33354.html"],"Sighting Duration":"Undisclosed","Region":"Florida","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.483693,+-87.213527(33354)&iwloc=A&hl=en\"> mufon case (33354) map </A>"}