{"divs":["sighting detailsyesterday on sunday, 11\\13\\11, my boyfriend was sitting in the living room playing a video game. he looked out the window next to his chair and saw a bright light on the northwest horizon. not really thinking anything of it at first because there is an airport over in that direction. and we see planes all the time. then he noticed that it wasn't moving. it was just after 6:00 pm, and already dark outside. that's when he called me to come over to the window and check it out. we are in a high-rise building so we have a pretty good view for miles in the north, west, and south directions. so we sat and watched it for a little while and then i decided to get my phone and record it. we were pretty stunned and amazed. it hovered for the longest time, and every so often would get brighter, then dimmer. it wasn't very high up, and it wasn't too low, it seemed about a few hundred feet above treetop level. occasionally it seemed to disappear when a plane would go by. we were watching it and taking turns looking through the binoculars. to the naked eye, it looked like a bright light about the size of a bb, and you could easily see the light getting brighter and dimmer, and the tiny changing colors, almost like the way a star flickers. whereas on the video, you can't because my low resolution phone camera sucks, and it wouldn't let me zoom in. and i only recorded it for like a few minutes or so. anyway, when you looked through the binoculars, the view was even better. i thought it was a sphere, until i looked through the binoculars. we could see the flat disc-like shape, and the different colors of spinning lights. the object itself was spinning very fast it seemed. clearly not a helicopter. a short time later, another one seemed to just \"pop up\" to the right of it, except a tiny bit lower. that one also acted the same way the first one did, with the spinning lights getting brighter then dimmer. they both hovered there doing the same thing. then a really short time later, the second one disappeared. the first one stayed for a little while longer, then disappeared. i cant give you exact time periods because i'm not sure but i can tell you that we think it started at about 6 pm because we had checked the time when we were watching it and it was just after 6. then just tonight, 11\\14\\11 it happened again, at 6 pm just after it got dark. i know this because for some reason i was anticipating its return, and i had been looking out the window. except this time it only lasted like 20 or so minutes, and there was only one. i'm not sure if it happened again, because i haven't looked out the window since then. i recorded that one for only less than a minute. it was actually pretty exciting. i just wish we could've got a better view. u just have to keep watching the first video to really be able to see it. and the second one i recorded at the last minute of it, so u can really only see it best at the beginning. i apologize for the bad quality of the videos. i only wish you could see it the way we saw it, and not the poor picture that the camera picked up. **i tried to upload the videos but for some reason it didn't work. i will keep trying."],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Tags":"City","Latitude":"39.105636","Disposition":"IFO","Longitude":"-94.569967","Date of the Event":"11/13/2011 06:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.105636,+-94.569967(33350)&iwloc=A&hl=en\"> mufon case (33350) map </A>","Object Features":"Unknown","Case Number":"33350","Source":"MUFON","Log Number":"US-11142011-0018","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around November 13th 2011"],"Summary":"Bright spinning object(s) hovering near KCI airport and 291 highway on horizon in Kansas City.","Country":"United States","Region":"Missouri","Object Shape":"Disc, Oval","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33350.html.txt","/var/www/straped/mufon/org/33350.html"],"Date Submitted":"11/14/2011 11:54 UTC","Object Flight Path":"Stationary","City":"Kansas City"}