{"Latitude":"33.146418","map":"<A HREF = \"http://maps.google.com/maps?q=33.146418,+-111.57432(33353)&iwloc=A&hl=en\"> mufon case (33353) map </A>","divs":["Sighting DetailsWhen taking my dog out into my back yard, I briefly noted what I initially perceived to be a plane. My back yard abuts a wide open and quite spacious state owned desert area with what I suppose one would call small mountains or very large hills. There's no available ground lighting in the area save for that of the housing in the neighborhood so it's ideal for watching the stars. When I returned my vision to that where I had seen the 'plane' it had not moved. I stopped and stared at the object for probably two or three minutes. I became keenly interested because I had always imagined that this would be a great property to seek out UFO's but I wasn't exactly prepared for what I was about to see. I ran back into the house to get my binoculars and when I returned the object had still not moved. When I put the optics to my eyes and focused, I saw what appeared to be a platform of sorts that had a red light on one end with large canister or rectangular shaped objects that were rotating and exhibiting brilliantly intense colors of red, reddish pink, blue, green, and amber. If I could relate it to something I know, I would say it was something like a ferris wheel tilted at a forty-five degree angle with only four or five seating cabins that each take turns changing colors. I wasn't fearful so much as I was fascinated as I watched it continue to do it's thing. I was upset that no one was there with me to watch so I decided that, even though my wife has a difficult time sleeping, I would go in and wake her. I went in and got her and, thankfully, she saw the same thing. She said,\"It has all different colored lights and it's not moving.\" I sent her back into bed and called the nearby Wlliams Gateway Airport and asked if they could see the same thing and they stated they couldn't see it. As I was talking on the phone with them, I was looking around and trying to establish a distance and orientation from the moon or some other large star when I saw what I thought was another object exhibiting the same behavior. I concentrated on it for a moment and verified that, yes, it was doing the same thing. From my view, the second object appeared about a foot in perspective from the first. There was no way for me to determine the distance or altitude from me or any other point of reference. As I continued to look further, I was unnerved to find that there were no less than eight and possibly as many as twelve of these 'floating platforms' in the sky. I've gone out each successive night since then and found the same types of craft or images in different areas of the sky with the exception of two nights ago when it was overcast. I retrieved my neighbor last night and he confirmed the same thing. I really hope someone with some good visual equipment could look at this and either help me find out what it is or put me in contact with someone who can. I do know that there is a satellite within the same area and I'm told that there is an office of homeland security almost directly underneath where I witnessed the closest one."],"Object Features":"Patterned Surface, Unknown","Summary":"Multiple stationary red tipped platforms that have rotating rectangular intensely and variously colored apparatus-es.","Date Submitted":"11/15/2011 03:13 UTC","Longitude":"-111.57432","Date of the Event":"11/09/2011 01:15 UTC","Object Shape":"Boomerang, Square, Rectagular, Unknown","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Log Number":"US-11152011-0003","Disposition":"Unresolved","Case Number":"33353","Country":"United States","City":"San Tan Valley","Object Flight Path":"Stationary","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in San Tan Valley","There were no other sightings in San Tan Valley on or around November 9th 2011"],"files":["/var/www/straped/mufon/html2text/33353.html.txt","/var/www/straped/mufon/org/33353.html"],"Source":"MUFON","Region":"Arizona"}