{"Log Number":"US-11152011-0014","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Washington","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around July 4th 2009"],"Latitude":"47.178963","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Longitude":"-122.47013","City":"Tacoma","files":["/var/www/straped/mufon/html2text/33367.html.txt","/var/www/straped/mufon/org/33367.html"],"Summary":"first thought it was a firework until it continued to procede in straight line, didn't explode and made no noise","Object Shape":"Fireball, Square, Rectagular, Other","divs":["Sighting DetailsMy wife and I were meeting friend to watch a firework show on puget sound near lakewood, Wa when I looked up and saw what I thought was a firework until it continued moving very slowly and i observed it moving from the west traveling north in a straight path making no noise and the height was just above a nearby radio tower which it flew over before I lost sight of it and my friends son and a few of his friends also saw the object and we were all a little freaked out about it cause we all are used to aircraft flying overhead being from this area and could not explain what this object was. The best way I could describe the object is that it looked like a straw hat that was on fire but not engulfed in flames, more like it was made of plasma because it looked like pictures that i've seen of the surface of the sun. I've lived in Tacoma, WA all of my life near McChord AFB and I know what an airplane and other aircraft look like and this was not like any conventional or military aircraft known to the public. It really shook me up and have just now been able to get to your site to report it."],"Date Submitted":"11/15/2011 06:35 UTC","Date of the Event":"07/04/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.178963,+-122.47013(33367)&iwloc=A&hl=en\"> mufon case (33367) map </A>","Sighting Duration":"Undisclosed","Object Features":"None","Tags":"City","Country":"United States","Case Number":"33367"}