{"Object Shape":"Unknown","Case Number":"33366","Viewing Distance":"Unknown","Region":"Oregon","divs":["Sighting DetailsI was sitting in the hot tub facing east, the night was clear and I could see stars clearly. While looking for satellites I observed an aircraft with 2 solid red lights at a high altitude flying from west to the northeast. This is out of the ordinary for air traffic in our area, it is mainly north or south direction. I thought it was a military craft but the red lights were behind each other in a straight line in the same direction it was going, not horizontal as on airplane wings. At this point you could cover the 2 lights with a 1 inch pencil held at arms length. I watched it until it went out of sight behind some trees. About 15 seconds later it came out of the trees heading south and quite a bit lower. At this point you could cover the 2 lights with an 3 inch pencil and you could see a white strobe light positioned in the middle of the 2 red lights and above them. I'm assuming that it is positioned on the top of the craft as I didn't see it when it flew directly over me. I could not make out the shape of the craft because it was moonless at this time and there was some steam coming off the hot tub. The strobe light was blinking, but not consistant but in a random blinking. The speed of the craft was faster than the regular aircraft I see. I watched the craft until I lost sight of it behind some trees. It looked to be traveling at a level altitude. There could have been sound but I had the hot tub jets turned on so I couldn't tell. It flew in a smooth constant manner. I don't know if this is military or not. It has been bugging me since I saw it. I would like to know if anyone has seen this type of craft and if it could be military. It seemed like it turned and dropped in elevation at a rate that military craft can't but I'm no expert. The date is just approximate."],"Object Features":"Unknown","Latitude":"44.615484","Tags":"City","trends":["There have been 4 other sightings in Albany","There were no other sightings in Albany on or around August 12th 2011"],"Source":"MUFON","Longitude":"-122.992634","Disposition":"Unknown","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Summary":"2 red solid lights 1 strobe light","Country":"United States","Log Number":"US-11152011-0014","files":["/var/www/straped/mufon/html2text/33366.html.txt","/var/www/straped/mufon/org/33366.html"],"City":"Albany","Date of the Event":"08/12/2011 10:00 UTC","Weather Factors":"Windy","Date Submitted":"11/15/2011 03:46 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.615484,+-122.992634(33366)&iwloc=A&hl=en\"> mufon case (33366) map </A>"}