{"Region":"Alberta","Weather Factors":"Unknown","Log Number":"CA-11152011-0017","files":["/var/www/straped/mufon/html2text/33370.html.txt","/var/www/straped/mufon/org/33370.html"],"Case Number":"33370","Object Features":"Undisclosed","Summary":"V- or Triangle-Shaped UFO Slowly Moving Over West Edmonton","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around October 17th 2011"],"Disposition":"Unresolved","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Longitude":"-113.575943","Date Submitted":"11/15/2011 08:03 UTC","Latitude":"53.542119","Object Shape":"Triangle","Country":"Canada","divs":["sighting detailsi was stopped behind a bus while heading east on stony plain road, close to 149 st intersection in edmonton. the bus was loading\\unloading several passengers, so i had time to look around. looked to my left out the driver's side window and saw an unusual formation of lights in the sky. the formation was flying very slowly towards me - i soon could see 5 distinct lights in a v-formation. the lights were very large, round-shaped, and warm white in color. the lights were large and contiguous with each other. no halo or bleeding of one light to the next - very distinct round shaped. the object was flying very low and not changing altitude. it was traveling south (so it was flying perpendicular to, and towards me). i turned off my ipod and opened my window and stuck my head out to determine if there was any sound (and hopefully to signal to other people to look up). i could hear no sound over that of traffic. as the object got closer - i estimate within 500 feet (< 150 m) total distance from me (horizontal and vertical) - i could observe that the lights were attached to a single silver-gray translucent craft with a body down the center. the craft itself may have been triangular rather than a v. the object was almost overhead when i noticed the bus was gone. no one had honked, so hopefully the drivers behind me were as transfixed by the object as i was. i slowly started driving - looking for a place to pull-off so i could get out and take a better look. my husband called on the cell phone at that moment - i thought he had seen it too. i did not answer the phone (due to distracted driving) but the time of the missed call was 7:13:13, therefore i can be very precise about the time of sighting. by the time i pulled onto a side street to return his call, i could no longer see the object due to distance and trees obstructing my view. i watched the craft for 45-sec to 1-min. sunset was at 6:33 pm on oct. 17, 2011 in edmonton. the skies were clear and calm. the ipod i had with me was 1st-generation shuffle, and my cell-phone is dumb. neither have cameras. i was therefore unable to take a picture\\video. if others saw this object i hope that they report their sighting. i also hope that someone got photos or video - there would have been plenty of time to do so if one had the technology with them. (in the report above i said the object appeared aspirin sized. each light was aspirin sized, so the object was 3x aspirin sized in length down each side.) note: i wrote this report the evening of the sighting. i submitted it to a local ufo group, but did not hear back from them. although i have no evidence, i wanted to have this sighting documented."],"City":"Edmonton","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date of the Event":"10/17/2011 07:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.542119,+-113.575943(33370)&iwloc=A&hl=en\"> mufon case (33370) map </A>","Tags":"City","Source":"MUFON"}