{"Date of the Event":"10/04/2011 02:55 UTC","Weather Factors":"Unknown","Latitude":"32.79983","Longitude":"-116.854323","Viewing Distance":"Over One Mile","Summary":"Only saw a flashing red sequential fight for 20 minutes","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33371.html.txt","/var/www/straped/mufon/org/33371.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.79983,+-116.854323(33371)&iwloc=A&hl=en\"> mufon case (33371) map </A>","City":"El Cajon","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around October 4th 2011"],"Log Number":"US-11152011-0018","divs":["Sighting DetailsBefore work, I was sitting in my back yard drinking coffee. I usually do this every morning I work. I was looking toward Orion's Belt when I noticed a distinct red light flash. I continued to watch and observed the same light flash every 8 to 10 seconds. After each flash there was a very faint red flash immediately afterward in the same spot. It could have been 2 lights or it could have been 1 flashing twice. There was no noise, no other lights and no shape could be seen. I saw nothing except the lights.No outlines of any kind. The light was going in a straight, airplane type direction. I observed this for about 20 minutes. It traveled about as far as the length of the Big Dipper's handle. As the flashing light neared Orion's Belt, the flash began to fade. As the Space Station would if you were watching it. I see military aircraft all the time since I grew up around Miramar NAS. I have observed commercial aircraft also. The way the light faded away gradually gave me the impression that it was very high and soundless. I could hear all the normal night time wildlife in the area. Though I could not tell what it was, my only guess would be that it was a military aircraft flying very high and very slowly. The red flashing light appeared to have the same intensity or brightness of the military helicopters I see at night with only the red lights flashing. I have never seen this before or since. I did not feel any different while I was observing this flashing light. No loss of sleep or any other out of the ordinary change to me or my surroundings. It was completely quiet, the object that is. No noise, lights, outlines or smell of any kind. I did notice that the stars did not effect the flashing. Meaning that the object was between me and the stars."],"Tags":"City","Date Submitted":"11/15/2011 11:38 UTC","Case Number":"33371","Object Shape":"Flash, Unknown","Region":"California","Country":"United States","Object Features":"Unknown"}