{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.208762,+-111.632379(33376)&iwloc=A&hl=en\"> mufon case (33376) map </A>","divs":["Sighting DetailsIn June of '97 my fiance, my college-aged daughter and I were en route to a family reunion in Tehachipi, CA driving from Little Rock, AR on I-40. I was sitting in the passenger side front seat when, in the vicinity of Flagstaff AZ, I noticed two \"brighter than normal\" stars on the horizon north of the road. The clock on the car said 10:30 p.m. which would have been central daylight time, 9:30 p.m. AZ time. They were just so incredibly bright I asked my fiance to notice them. After watching them for a few minuts while driving down the freeway I finally asked him to pull over. I got out the binocs and we both looked at these things, not being able to tell much about any structure but amazed at how brilliantly bright-white they were, glowing, larger than a star...sitting there just above the horizon in the twilight with the mountains faint outline below. As we were just looking at these things from the side of the road trying to figure out what it was we were looking at, the object on the left (west side) suddenly ZOOMED across the sky at an impossible speed, STOPPED and sat in the sky just as it had done when we initially spotted it. It went from dead still to at least 45 miles away in one second or less. Three witnesses. Seconds after, the object that had been on the right (east) started traveling to the east, the opposite direction from the other, at a casual pace. The left object had absolutely no blinking lights on it. I think the object on the right might have had what appeared to be a blinking red light. Since we could not believe what we had just witnessed we took off down the interstate in pursuit of this thing. There was no traffic on this stretch of highway, seemingly in the middle of no where. So, my fiance floored it! We had no conversation. We were all stunned. We topped out at speeds of which I will not admit, trying to catch this object that was right before us. While flying westward down the freeway yet another event. Another bright thing \"blinked on\" in the sky out of no where and started moving slowly in the direction of the one we were trying to catch. After a few minutes of watching both of them, the \"blinker\" disappeared. No cloud cover. It was a very clear night. We drove down the freeway for a good 45 minutes, \"very quickly\", trying to get on this thing and never got close. I never took my eyes off of it, save the time the \"blinker\" showed up and even then I had one eye on each of the two objects. We finally lost sight of the object behind some buildings in a small town we had come to, and perhaps some mountains. We are all into the sciences and know that even Physics 101 says no carbon based life form could have withstood that speed without collapsing or imploding. If someone was driving that thing it wasn't one of us."],"City":"Flagstaff","Object Features":"Unknown","Date Submitted":"11/16/2011 09:48 UTC","Region":"Arizona","Viewing Distance":"Unknown","Weather Factors":"Unknown","Summary":"White light object streaks across the sky and stops again.","Source":"MUFON","Object Shape":"Unknown","Longitude":"-111.632379","Date of the Event":"06/15/1998 10:30 UTC","Sighting Duration":"Undisclosed","trends":["There have been 24 other sightings in Flagstaff","There were no other sightings in Flagstaff on or around June 15th 1998"],"Log Number":"US-11162011-0004","Latitude":"35.208762","files":["/var/www/straped/mufon/html2text/33376.html.txt","/var/www/straped/mufon/org/33376.html"],"Tags":"City","Case Number":"33376","Disposition":"Unknown","Object Flight Path":"Hovering then path,Path then hovering"}