{"Object Shape":"Circle, Sphere","Date of the Event":"11/15/2011 09:33 UTC","Log Number":"US-11162011-0001","Date Submitted":"11/16/2011 12:39 UTC","Sighting Duration":"00:01:00","Weather Factors":"Unknown","divs":["Sighting DetailsBright white objects were observed immediately as they appeared to driver and passenger while driving west on US Highway 10 near the junction of Winnebago County M east of Neenah, WI at 9:33 pm CST, Tuesday, November 15. The sky was mainly clear with stars visible. One white circular object about the size of a dime from the observers' standpoint appeared about 15 degrees off the western horizon (straight ahead of the car). Its brightness was roughly comparable to the intensity of a full moon. Within a few seconds, at least three and possibly four other identical white orbs appeared one-by-one in a horizontal line (perhaps 10 degrees in length) which stretched from south to north. They disappeared within a minute, not to be seen again. Observers saw little or no motion in any of the orbs. An estimation of the distance of these lights to the observers is not possible. This writer does not believe them to have behaved like aircraft, flares, or any 'usual' nighttime phenomena. Personal reactions were limited to the knowledge of having seen something unusual and made us wonder if others saw the same thing. A long discussion of the pros and cons of UFOs are ensued...."],"Longitude":"-88.462609","files":["/var/www/straped/mufon/html2text/33373.html.txt","/var/www/straped/mufon/org/33373.html"],"Tags":"City","City":"Neenah","Disposition":"Unresolved","Viewing Distance":"Unknown","Country":"United States","Case Number":"33373","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.185819,+-88.462609(33373)&iwloc=A&hl=en\"> mufon case (33373) map </A>","Object Features":"Unknown","Region":"Wisconsin","Summary":"One white circular object appeared in the west, followed by 3 or 4 more of the same. They fa north-south line which blinked out after about 30 seconds to one minute. t","Source":"MUFON","Latitude":"44.185819","trends":["There has been one other sighting in Neenah","There were no other sightings in Neenah on or around November 15th 2011"]}