{"Summary":"Super bright light in the sky, stayed in place for 20-30 minutes then changed colors and moved slowly to the southwest before disappearing.","files":["/var/www/straped/mufon/html2text/33387.html.txt","/var/www/straped/mufon/more/33387_submitter_file1__DSCN5383.JPG","/var/www/straped/mufon/more/33387_submitter_file2__DSCN5385.JPG","/var/www/straped/mufon/org/33387.html"],"Object Features":"Unknown","Disposition":"Insufficient Data","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=31.972299,+-99.898113(33387)&iwloc=A&hl=en\"> mufon case (33387) map </A>","Date Submitted":"11/16/2011 11:05 UTC","Country":"United States","divs":["Sighting DetailsIt was around 6:15 pm when I went outside to check on my solar battery charger and I noticed a really bright light above my neighbors house. It caught my attention because it was so bright. It looked like Jupiter but brighter. It wasn't twinkling like a star but staying a constant brightness like a planet. I thought it was odd but figured it was a planet and went back inside even though it was giving me an odd feeling. About 20 minutes later I went outside again to smoke a cigarette and it was still there. Again I was surprised at how bright it was. I went back inside and asked my girlfriend to look out the window at it but now it was flashing a reddish orange color instead of staying a bright white. I got online to check and see if there were any planets or stars in the Western sky that would explain it. After about five minutes of searching and finding nothing I looked back out the window and it had moved. It was really weird. It was almost 7:00 pm now and the thing started to move, very slowly, to the southwest. I freaked out. I got in my truck and drove down the road to get a better look because the trees were blocking it. BY the time I parked down the road and got out of my truck it was gone. I've never seen anything like this before. PIcture the brightest star you've ever seen hovering in place for around thirty minutes then it suddenly changing colors and moving. It was very strange and a little exciting to be honest. I know what planes look like(I live about 10 miles from a small airport) and I know what helicopters look like as well. This was not a plane or helicopter. This was my first time experiencing something so strange. I've been going in and out of the house all night now looking at the sky to see if I can see it again but I haven't seen anything but the usual planes flying over head. Again this looked like a super bright planet that started flashing colors and then flew away. It was crazy! I took two pictures but they came out horrible. I'll attach them anyways."],"City":"Undisclosed","Region":"Texas","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","trends":[""],"Latitude":"31.972299","Date of the Event":"11/16/2011 06:30 UTC","Tags":"City","Object Shape":"Star-like","Longitude":"-99.898113","Log Number":"US-11162011-0015","Weather Factors":"Unknown","Case Number":"33387","Source":"MUFON"}