{"Object Flight Path":"Straight-line path,Path then hovering","divs":["Sighting DetailsI was driving home from a banquet that i had for school and i was just singing along to my music and noticed a really bright light about half a mile in front of me then it went away. So i slowed to a stop on the side of the road and watched a triangle shaped aircraft with very bright pulsating lights on the three ends of the aircraft fly near my car. The lights would stay on for about 2 seconds then go off and in the middle a very bright light would flash and go off almost immediately and this sequence continued. I turned off my radio and shut my car off to listen and watch. This aircraft was completely silent and seemed to blend in with the sky. The only way i noticed it was the star displacement in the sky and the bright lights emitted from the aircraft. The craft was flying VERY fast towards the direction of my car but slowed when it almost reached my car. It was maybe 20 feet above the treetops and it hovered for a few seconds about 200 feet to the northwest of my car above the tree line then resumed its flight. It made a slight alteration in course to go more towards the north but did not turn completely. I drove home and looked into the sky to see if it followed or i could still see it. I looked to the east and could see its middle light shining but from this point it was considerably smaller and looked like a helicopter search light. I was very flustered and confused so i came home and researched all the possible explanations before i came to the conclusion that it was a UFO. In the morning i looked around the area but there was no evidence that it had been there the night before."],"Latitude":"42.639151","Object Shape":"Triangle","City":"Fairbank","Source":"MUFON","Viewing Distance":"101-500 Feet","Summary":"UFO flies over car","Case Number":"33381","Disposition":"Insufficient Data","Country":"United States","Weather Factors":"Unknown","Longitude":"-92.04712","map":"<A HREF = \"http://maps.google.com/maps?q=42.639151,+-92.04712(33381)&iwloc=A&hl=en\"> mufon case (33381) map </A>","files":["/var/www/straped/mufon/html2text/33381.html.txt","/var/www/straped/mufon/more/33381_submitter_file1__UFO.png","/var/www/straped/mufon/org/33381.html"],"Region":"Iowa","Date Submitted":"11/16/2011 06:21 UTC","Log Number":"US-11162011-0009","trends":["There have been no other sightings in Fairbank","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Unknown","Date of the Event":"11/15/2011 08:06 UTC"}