{"Viewing Distance":"Unknown","Country":"United States","Longitude":"-88.786598","divs":["Sighting DetailsSighting Report: This happened in spring, 1985, so you may not even be interested any more. I ve just always wondered if anyone else reported it. It occurred over a very busy highway in northwestern Wisconsin. My dad and I both saw it from our truck; my sister saw it zooming away. The trucker in front of us must have seen it, as he pulled over rather hurriedly to the next rest area. (I didn t know there was a rest area coming up, or I would have followed him in to ask.) I ve never seen a picture of a UFO, or heard of any report that describes what we saw. It was not cigar-shaped, or saucer-shaped, or anything like that. The radio did not go out, although I was expecting it to. ;) It was round, but flat on top and bottom. How to describe the shape...a cylinder, but wider than tall. Lights completely covering the curved surface, and seeming to rotate. No lights on the bottom. One red light from the top on a, well, I guess an antennae. (It was above the upper surface.) It hovered over the highway, maybe 30 feet above the ground (trying to think -- like a 3rd floor window height). No sound. I was driving, and saw it ahead of us, but thought at first it was part of the many headlights and taillights. We approached it and it wasn t moving apparently, as we got closer to it until it was rather over the front, driver s side of the truck -- but maybe 20 feet in front of the truck, as we could still see it out the windshield. My dad was riding shotgun and he told me later he thought it was some sort of billboard and that words would come around in the lights (don t ask me -- different generation, I guess). The weird thing was that we came up \"under\" it and then it stayed even with us for about a minute. Long enough for me to yell at my sister, lying down in the backseat, to sit up and look. Twice. (Because being younger, she is sometimes a butthead and won t do what I say.) She grudgingly sat up just in time to look out her side window and see it zooming away. It was on the horizon in a matter of seconds. My sister kept watching (could still see the red light from the top) and she said it appeared to meet up with another \"red light\" on the horizon. Then both disappeared. Other minor details, too, probably. Okay, so this is the first time I ve \"reported\" this to anyone. I figure my email addy is enough for you to contact me if you want."],"Latitude":"43.78945","Summary":"Not Provided","Case Number":"3339","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.78945,+-88.786598(3339)&iwloc=A&hl=en\"> mufon case (3339) map </A>","Region":"Wisconsin","Date of the Event":"02/25/2005 03:43 UTC","Source":"MUFON","Date Submitted":"02/25/2005 03:43 UTC","Log Number":"","trends":[],"Tags":"City","files":["/var/www/straped/mufon/html2text/3339.html.txt","/var/www/straped/mufon/org/3339.html"],"City":"Undisclosed","Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Shape":"Undisclosed","Object Features":"Undisclosed"}