{"Source":"MUFON","Object Flight Path":"Other","Date Submitted":"11/17/2011 01:32 UTC","Case Number":"33394","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unknown","Log Number":"US-11172011-0004","map":"<A HREF = \"http://maps.google.com/maps?q=29.837143,+-95.662019(33394)&iwloc=A&hl=en\"> mufon case (33394) map </A>","Region":"Texas","Date of the Event":"11/13/2011 06:33 UTC","Viewing Distance":"Over One Mile","Longitude":"-95.662019","Summary":"very bright intense white light flashing like a strobe light, it appeared to be breaking tphe speed of light, with every flash it would randomly zig zag and be in another area of about a mile wide swatch traveling very fast from south east to northwest.","Latitude":"29.837143","Tags":"City","Country":"United States","Object Shape":"Flash","files":["/var/www/straped/mufon/html2text/33394.html.txt","/var/www/straped/mufon/org/33394.html"],"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around November 13th 2011"],"divs":["sighting detailsi was traveling north on hickory downs at approximately 6:33 p m on sunday, november 13th, 2011. as i approach the first stop sign of 3 on the way to my house on hickory downs i noticed in the north sky a very bright and intense white light about 3 times the size of a normal star strobing almost blinding and moving ln erratic manor zig zagging randomly in no apparent pattern. it was traveling in about a mile wide swatch from southeast to northwest. as it flashed it appeared to be traveling at the speed of light as it would reappear randomly in another spot in the mile wide swatch suggesting that it was breaking the light barrier, i was only allowed to view the craft for 30 seconds as it was moving too fast for my pickup truck to keep up. it disappeared out of sight over the tree linees and i lost it. it made me feel quite hypnotized i felt the sensation of being in a trance all night long and still have some lingering affects of the experience. i have had feelings over the past 2 months that it would not be long until i saw another craft. i had felt it it would be on the date of 11\\11\\11 but it ocurred 2 days later."],"Object Features":"Unknown","City":"Houston"}