{"Date Submitted":"11/17/2011 10:48 UTC","Disposition":"Unresolved","Log Number":"US-11172011-0008","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.643668,+-78.458373(33398)&iwloc=A&hl=en\"> mufon case (33398) map </A>","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Case Number":"33398","Tags":"City","Object Shape":"Triangle, Other","trends":["There has been one other sighting in Clayton","There were no other sightings in Clayton on or around September 14th 2011"],"Region":"North Carolina","files":["/var/www/straped/mufon/html2text/33398.html.txt","/var/www/straped/mufon/org/33398.html"],"Longitude":"-78.458373","City":"Clayton","Latitude":"35.643668","Weather Factors":"Unknown","Summary":"Three Sets of three Triangular Red Lights hovering/travelling/vanishing/and taking off at incredible Speed.","Date of the Event":"09/14/2011 08:00 UTC","Object Features":"Other","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn September 14 2011 at 2000hrs at the Walmart Store located at Hwy 70 in the City of Clayton NC, as I came out of the Store, I observed a Three Sets of Three Red Triangular Shapes lights hovering on the area above the visual direction of Wendell NC ( this is based on the position in where I was located). They were not for sure airplanes, because at the time this happened an airplane was crossing thru and a lady was coming out of the store at the same time, I point to her to look at the lights and she said, \"it is an airplane\" to which I answered to her \"No it is not, because that one is an airplane\" (me pointing to the airplane on the other direction for her to see the difference among both objects) so she noticed but pay not attention. All of the triangular units were not connected (I could see thru the dark ski, like if they were with some kind of clogging devise as on Star Trek Movies) but each of the three sets of lights even though they do not appear to be connected with each othe, they were moving as an entity each set of three red lights, but each set was individual to each other set. One set took off in an incredible speed toward the ski. then after a few seconds the second set did the same, but the third set was just hovering and suddenly vanished on place. I reported the incident to the local police (they do not pay attention to the information.) and also to the local news paper. Nothing had been done since. I must indicate that I never smoke or drink or use any kind of drug of any kind in my entire life."]}