{"divs":["Sighting DetailsDay trip to the mnts. 4 or 5 of us. We all felt like we werent up there for as long as the clock was saying. My brother had to get to work by 4pm. He was worried about being late all day, so I know we didnt just let it slip by. About two weeks later I was reviewing some pic on my camera and found the craziest picture. At first I wondered what it was I was photographing. The pic was just trees the side of a cliff and the sky, but when my eyes saw what I thought they saw my jaw dropped. To the right of the picture are two beings I understand you call greys. One is holding what appears to be some sort of testing device, and the other is directly behind the first. looking straight at me. creepy. I can remember the exact spot where I parked my jeep, I can remember my girlfriend asking why I was stopping, and I remember leaning on my jeep while I took this picture. I can not remember seeing it though. I havto have seen it. why else would I take a picture of the hill! Another thing, knowone else remembers anything. I have been up there twice since. the last time was about two weeks ago. The dirt road is now blocked half way up. If you google (green mnt. road washington you will see half the mnt. when you get to the point on the road I took the picture,its blacked out. I will be going back up soon to see what else I can remember, and to see what I can find."],"trends":["There have been 6 other sightings in Granite Falls","There were no other sightings in Granite Falls on or around August 13th 2009","This sighting has been favorited 1 time.",""],"Log Number":"US-11172011-0003","City":"Granite Falls","files":["/var/www/straped/mufon/html2text/33393.html.txt","/var/www/straped/mufon/more/33393_submitter_file1__Picture_edited-1.jpg","/var/www/straped/mufon/org/33393.html"],"Object Features":"Patterned Surface, Other","map":"<A HREF = \"http://maps.google.com/maps?q=48.143687,+-121.798048(33393)&iwloc=A&hl=en\"> mufon case (33393) map </A>","Object Flight Path":"Stationary","Latitude":"48.143687","Sighting Duration":"Undisclosed","Object Shape":"Other","Case Number":"33393","Disposition":"Unresolved","Region":"Washington","Country":"United States","Date Submitted":"11/17/2011 01:22 UTC","Viewing Distance":"101-500 Feet","Longitude":"-121.798048","Date of the Event":"08/13/2009 12:00 UTC","Summary":"I nor anyone I was with remember the event , wich in itself concerns me.","Weather Factors":"Unknown","Tags":"City","Source":"MUFON"}