{"Source":"MUFON","Region":"California","Weather Factors":"Unknown","divs":["Sighting Details I was mowing our lawn on September 21,2011 east of our house near the deck on which boot or foot prints are still visible (see my reportof May 21, 2011). I noticed a trail of burned imprints in our lawn from our garage area westtoward the house. The trail of prints did not step on the back sidewalk but continued in a circle back to where they entered the lawn area. I took pictures and of course have pictures of the trail and the imprints but I do not know how to put those pics on line for you. The prints have faded with the mowing of the grass but some can still be seen as burned grass. We are not sure but now that the grass has slowed its growth there appears to be a circular area of burned grass in this same area. We will wait to see what happens when we get more rain and if it is still there. At any rate we think the prints in the grass were our third visit or sighting in the last two years or 24 months. As I said before, we do not have dogs and our property does not have any lights on at night. We live in a very peaceful and quiet area in the middle of many almond orchards. I might also note, I have no fear of aliens. We took a trip to the Southwest stopping at Roswell, New Mexico to visit the UFO Museum a couple weeks ago. The personnel there gave us the information of how to contact you and saw our pictures. They have asked to have everything sent to them for their research and library. I will do that soon."],"trends":["There have been 7 other sightings in Orland","There were no other sightings in Orland on or around September 21st 2011"],"Case Number":"33405","City":"Orland","Sighting Duration":"Undisclosed","Object Features":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.696192,+-122.087002(33405)&iwloc=A&hl=en\"> mufon case (33405) map </A>","files":["/var/www/straped/mufon/html2text/33405.html.txt","/var/www/straped/mufon/org/33405.html"],"Object Flight Path":"N/A","Tags":"City","Longitude":"-122.087002","Summary":"A trail of imprints burned into our lawn near our house and almost under the deck where foot for boot prints were and are still found on our upstairs deck","Log Number":"US-11172011-0015","Object Shape":"Other","Date Submitted":"11/17/2011 03:22 UTC","Date of the Event":"09/21/2011 12:00 UTC","Viewing Distance":"N/A","Latitude":"39.696192","Disposition":"Unresolved"}