{"Object Shape":"Other","trends":["There have been 7 other sightings in Orland","There were no other sightings in Orland on or around May 21st 2011"],"Date Submitted":"11/17/2011 02:39 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.714563,+-122.11355(33402)&iwloc=A&hl=en\"> mufon case (33402) map </A>","Region":"California","Disposition":"Unresolved","Log Number":"US-11172011-0012","files":["/var/www/straped/mufon/html2text/33402.html.txt","/var/www/straped/mufon/org/33402.html"],"Weather Factors":"Unknown","Longitude":"-122.11355","Summary":"Gone for weekend. Found 4 inch black foot or boot imprints on our upstairs deck. Prints still there and I have photos.","Object Features":"Appendage(s)","divs":["Sighting Details We live on our 80 acre almond ranch which is surrounded by more almond orchards not belonging to us. It is a very peaceful place nine miles from the closest incorporated town and in a county with only 29,000 inhabitants and farming as its major industry. We do not have any dogs and there is no outdoor light on at night. On the weekend of May 21-22, 2011, we watched our grandson receive his master's degree and then helped him celebrate his engagement with all the family in the Sacramento, California area one hundred miles from our ranch. We were not home the night of May 21, 2011. Monday, May 23, 2011 found me shaking out our bedspread from our upstairs deck after the weekly change of linens. Our three upstairs bedrooms have sliding glass doors that open onto the deck.As I turned my head to look south, I noticed what I thought was a layer of dust kind of floating and after affects of activity on the decking about 30 feet away so I began walking toward the \"dust\" and immediately noticed under by feet some sort of black foot or boot prints about 4 inches long and 3 inches wide with three black lines across them on the charcoal decking and then realized there were many more prints all over the entire deck but they did not go over to our bedroom doors. The prints stayed fairly close to the deck metal railing about twenty feet off of the ground. The prints are still there in one area where it appeared \"they\" first stepped on to the deck. I took and have pictures of them. I invited very few friends and relatives to look at the prints over several weeks which did not seem to be going away even though we had several inches of rain. No one could define what they were but I always felt they were those of an alien or aliens. I decided to call our County Sheriff in July. He was very excited when he heard my story. He came out with his camera and took many pictures and agreed with me that the prints on our upstairs deck had to be that of aliens. He then proceeded to tell me of many sightings in our County over the years. He said \"they\" appear to be very interested in water and electricity. I told him about my first sighting on our ranch in 2009 at our irrigation well. I also told him of the twenty-four solar panels we had installed in November of 2010 to make electricity for our home, shop and well. He was very interested and thought that could be the reason for the second visit. Our sheriff is very interested in UFOs but did not know who to contact about the foot or boot prints."],"Source":"MUFON","Tags":"City","Object Flight Path":"Other","Latitude":"39.714563","Date of the Event":"05/21/2011 10:00 UTC","Case Number":"33402","City":"Orland","Country":"United States","Sighting Duration":"Undisclosed"}