{"Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-11172011-0011","trends":["There have been 7 other sightings in Orland","There were no other sightings in Orland on or around September 13th 2009"],"Region":"California","files":["/var/www/straped/mufon/html2text/33401.html.txt","/var/www/straped/mufon/org/33401.html"],"Date of the Event":"09/13/2009 09:30 UTC","Object Shape":"Oval","divs":["Sighting Details I was returning home from a meeting sometime after 9:00 p.m. on September 13, 2009.It was a very dark night - no moon- and as I was driving down the quarter of a mile gravelled driveway on our almond ranch where we live at the above address, I noticed a light in our almond orchard. I immediately became upset because the almonds had just been shook off the 6,000 trees and were lying on the ground. Whoever was out in our orchard was driving over the nuts and ruining them. I stopped the car and listened. There was no noise. The light was very bright and about 40 almond rows south of me heading east and toward the power line which brings electricity to our irrigation pump. When it got near the power lines, it turned north in my direction and I saw a big light that was larger than an automobile or tractor's headlight. It kept coming towards me and then turned west toward our irrigation pump about 24 almond rows from me and stopped. It appeared to be hovering at our irrigation pump as I saw red and white lights making out an oval shape. There was no sound. I turned around in our circular drive to go back west down our driveway and with that they saw me and they were gone! As I approached Road S at the end of our driveway, I saw a tan colored sedan going north on Road S very slowly. My impulse was to overtake the car to talk to the driver to see what he saw what I saw but decided against it. I drove back to our home and immediately asked my husband when I got in the door if he had heard any noises such as a helicopter would make and he said he had not. I also called our nearest neighbor who is located on Glenn County Road 25 south of our almond orchard and he had not heard anything. We have been living on these 80 acres which we own since 1957. We first had a dairy and flood irrigated pastures and hay fields. After 32 years, we planted almonds. We flood irrigated them using the same pump and well that still exists until 2005 when we changed from flood irrigation to micro-sprinkler irrigation which changed a few things in the process of getting the water to the trees at the pump sight. Were they interested in that? I definitely feel I saw a UFO on our ranch near our pump. The pump is approximately 300 feet from our house and driveway."],"Summary":"Big white light in almond orchard, nuts on ground and then oval shaped object with red and white lights hovered at our irrigation pump after driving through our orchard","Tags":"City","Disposition":"Unresolved","Latitude":"39.711606","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.711606,+-122.106887(33401)&iwloc=A&hl=en\"> mufon case (33401) map </A>","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Longitude":"-122.106887","City":"Orland","Date Submitted":"11/17/2011 01:48 UTC","Case Number":"33401","Source":"MUFON","Object Features":"Unknown"}