{"Source":"MUFON","Summary":"The Iron chicken's nest from the Clangers TV series","files":["/var/www/straped/mufon/html2text/33417.html.txt","/var/www/straped/mufon/org/33417.html"],"divs":["Sighting DetailsMy parents took me to the fair at Banbury, it was an annual event around the end of October, I was 5 or 6. I was in the back seat of my dad's car, retuning home and as kids do, I was bored so, I tipped my head back to look up out the rear window. And there several hundred feet up was the Iron Chicken's nest. So I told my mother who informed me I hadn't seen it as it couldn't exist, because it was only on a TV show (69-70 UK Release Series 1). I didn't see it depart because I had to sensibley sit back down in my seat incase of a car crash. It wasn't rain drops on the glass as it was a clear dry night, it wasn't a star. The object was a big as a fingernail when your arm is outstretched. Thats all really, I've no history of mental illness and went on to Serve 22 years in the UK armed forces, I saw plenty of aeroplanes and helicopters in my time, and I'm at a loss to what it was, I can only think it was a big space station, but they wern't up there were they then, and it do look like a jumble of silver scrap metal. No one else saw it and I don't recollect the local paper, the Banbury Cake reporting it in the next few days, I never had any visits from officals and neither did I get abducted."],"Region":"England","Object Flight Path":"Stationary","Object Shape":"Star-like","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Case Number":"33417","Disposition":"Unresolved","Object Features":"Appendage(s)","Date of the Event":"10/01/1970 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Banbury","This sighting has never been favorited."],"Country":"United Kingdom","City":"Banbury","map":"<A HREF = \"http://maps.google.com/maps?q=52.062901,+-1.339775(33417)&iwloc=A&hl=en\"> mufon case (33417) map </A>","Weather Factors":"Unknown","Longitude":"-1.339775","Latitude":"52.062901","Date Submitted":"11/17/2011 06:58 UTC","Log Number":"GB-11172011-0027"}