{"divs":["Sighting DetailsWhile driving on my work route one morning around 9am I noticed a bright light in the sky coming toward me. I first assumed it was a morning traffic helicopter but when it got closer I noticed it didn't make a sound. I pulled off the road and got out of my car and tried to determine what I was looking at. I could see a comercial airplane in the distance leaving from Metro Airport which was about 12 miles south of where I was standing looking at this object when I realized it didn't have a trajectory and it seemed to be reflecting sun light rather than emitting a search light. The object seemed to be a glass diamond being dangeled from a string reflecting the suns light as it wobbled slowly in what became about a mile arc. It went north of me about a mile and then west about a mile of me and then south toward the airport, like a long slow wobbly u-turn not seeming to gain altitude the whole time. By the time it turned south toward the airport I was loosing time on my work route and got back on the road sure I would see something on the evening news about it. That didn't happen and since then I've payed attention to news choppers in the sky which don't have the same outline and don't keep a reflective glow like this object. I've never seen weather ballons that just wobble and never gain height and then make a u-turn either."],"Date of the Event":"05/15/1985 09:00 UTC","Summary":"Bright object came toward me in sky while driving on a sunny morning. First assumed it was a traffic helicopter but realized it wasn't.","Date Submitted":"11/17/2011 06:52 UTC","files":["/var/www/straped/mufon/html2text/33416.html.txt","/var/www/straped/mufon/org/33416.html"],"Viewing Distance":"101-500 Feet","Log Number":"US-11172011-0026","map":"<A HREF = \"http://maps.google.com/maps?q=42.415764,+-83.335313(33416)&iwloc=A&hl=en\"> mufon case (33416) map </A>","Region":"Michigan","Object Shape":"Diamond","Weather Factors":"Unknown","Case Number":"33416","City":"Livonia","Tags":"City","Disposition":"Unknown","Sighting Duration":"00:10:00","Object Flight Path":"Path with directional change","Longitude":"-83.335313","Source":"MUFON","trends":["There have been 16 other sightings in Livonia","There were no other sightings in Livonia on or around May 15th 1985"],"Latitude":"42.415764","Country":"United States","Object Features":"Undisclosed"}