{"Region":"Wisconsin","Latitude":"43.060567","Summary":"Not Provided","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsSighting Report: This happened almost 2 years ago, May 15 2003. I was coming home with my sister around 9 PM. The sky was clear and almost completely dark. I was driving, so I didn t see the object at first, but my sister did. I saw what looked to be a small airplane flying (can t remember its direction), and my sister saw it too, but also saw another aircraft flying straight towards it. She said they looked like the same type of plane. As she watched, the second plane suddenly shot vertically up into the atmosphere and began to fly very fast due north. By this time I could see it. I can t remember if I was looking out the windshield or the sunroof though. I was driving down our street, which runs north-south so we were following it. It was very small, one bright, white light and very fast. When we got to our house, we got out of the car and stood in the street to watch it. It became red, like a stop light (not like fire) and seemed to slow down and descend down to the horizon. I watched it until it disappeared behind the trees. It didn t make a sound (but we had heard the first airplane s engine)."],"Country":"United States","Date of the Event":"02/24/2005 09:23 UTC","Object Flight Path":"Undisclosed","trends":["There have been 5 other sightings in Brookfield","There were no other sightings in Brookfield on or around February 24th 2005"],"files":["/var/www/straped/mufon/html2text/3341.html.txt","/var/www/straped/mufon/org/3341.html"],"Log Number":"","Object Shape":"Undisclosed","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"02/24/2005 09:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.060567,+-88.106479(3341)&iwloc=A&hl=en\"> mufon case (3341) map </A>","Disposition":"Insufficient Data","City":"Brookfield","Longitude":"-88.106479","Weather Factors":"Unknown","Case Number":"3341","Tags":"City"}