{"Latitude":"42.875132","Tags":"City","Disposition":"Insufficient Data","Source":"MUFON","Date of the Event":"02/24/2005 04:09 UTC","Date Submitted":"02/24/2005 04:09 UTC","divs":["Sighting DetailsSighting Report: At approximately 2:00 P.M. today (02-23-05) I was laid back on a park bench facing in an eastwardly direction. I noticed a jet in the sky to my left and watched it for a couple of seconds. In the immediate area of the jet I noticed a bright point of light. I sat up then stood up and watched it for a few seconds, then I began taking pictures of it. I viewed it for about five minutes as it made a slight arc from north to south, from about a ten o clock position to about a two o clock position. When I juxtiposed the object at the end of a tree branch I noticed a slight wobble in the object and a slightly meandering path in it s course. I turned away to notify two passers-by of the object and when looked back, about two seconds, it had gone. The object maintained a constant brightness with no flashing lights during it s entire course. I called attention to the object to a passerby on the park bridge and he watched it with me for a few seconds, commented that we needed binoculars, then continued up the pathway. Later on his return I asked if he would exchange contact info with me so that he may corroborate this sighting and he refused. His opinion was that it was a mylar weather ballon. I have about ten photos of the object, most of them in focus. I have noticed a faint second object in some of them that I did not notice at the time of the sighting. When I zoom in on the photos in my photo editing program, I notice a variation from image to image in dark areas immediately around the object. Please contact me, I am very interested in assisting you with this sighting."],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Log Number":"","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.875132,+-106.310601(3342)&iwloc=A&hl=en\"> mufon case (3342) map </A>","Longitude":"-106.310601","Region":"Wyoming","Object Features":"Undisclosed","Object Shape":"Undisclosed","trends":["There have been 10 other sightings in Casper","There were no other sightings in Casper on or around February 24th 2005"],"Summary":"Not Provided","files":["/var/www/straped/mufon/html2text/3342.html.txt","/var/www/straped/mufon/org/3342.html"],"Case Number":"3342","City":"Casper"}