{"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/33428.html.txt","/var/www/straped/mufon/more/33428_submitter_file1__Triangle.jpg","/var/www/straped/mufon/org/33428.html"],"divs":["Sighting DetailsI was driving home from a client meeting with one of my staff members and noticed a very bright light in the sky. I watched it for a couple of minutes and the person with me saw me looking at it. As is got nearer we noticed it didn't move like a plane or look like a plane. It kind of floated down and hovered above the trees and we could easily see it's triangular shape. It was silver in color with a bright white light in front, a red light in the center and several green lights going around the outer edges of the craft forming a triangle. We were stunned! Soon we saw several other craft flying from several different directions and not flying like planes do. They were higher up in the sky flying over the highway and we could not see under them but they had extremely large, bright lights in the front. They would appear in one part of the sky and disappear and be somewhere completely different! As we drove into Golden Valley there was another low flying triangle exactly like the one we saw hovering over the trees in St. Louis Park. We could easily see the triangle shape because of all the lights on it's under belly. We were freaking out and feeling dazed by the whole thing wondering what it could be. I had to get back to my house to go to another client meeting otherwise we would have gotten out and tried to capture a video of the craft. I still can't believe what we saw! Wondering if it's some kind of military craft monitoring the Occupy MN protests. Have no idea..."],"trends":["There have been no other sightings in St. Louis Park","This sighting has never been favorited."],"Date of the Event":"11/17/2011 12:00 UTC","Longitude":"-93.372078","Sighting Duration":"Undisclosed","Case Number":"33428","Disposition":"Unresolved","Summary":"I saw several metalic flying triangles over a major highway and two, low hovering triangles with green lights.","Viewing Distance":"Unknown","Object Features":"Other","City":"St. Louis Park","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Latitude":"44.970951","Date Submitted":"11/17/2011 11:13 UTC","Log Number":"US-11172011-0038","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Tags":"City","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=44.970951,+-93.372078(33428)&iwloc=A&hl=en\"> mufon case (33428) map </A>"}