{"Tags":"City","Summary":"My wife and i went to see a movie at a drive in when this object floated by and was observed by everyone in the drive in.","Object Shape":"Disc","Date of the Event":"08/12/1987 10:05 UTC","Case Number":"33433","map":"<A HREF = \"http://maps.google.com/maps?q=38.553906,+-121.738507(33433)&iwloc=A&hl=en\"> mufon case (33433) map </A>","files":["/var/www/straped/mufon/html2text/33433.html.txt","/var/www/straped/mufon/org/33433.html"],"Log Number":"US-11182011-0002","Viewing Distance":"21-100 Feet","Source":"MUFON","Latitude":"38.553906","Country":"United States","Object Features":"Window(s), Other","divs":["Sighting DetailsMy wife and i went to a drive in. My wife turned around in her seat of my jeep and yelled \" what is that!\" I turned to my left and seen a disc with windows going all the way around the center of the craft,the inside of the craft was visible and i could see the power source. It was like a center section approx. 8 ft. tall and 4 ft. wide that was glowing orange and red, from that center section lighting bolts of power were coming out and dissipating round the windows in a counter-clockwise direction. The object floated over the ticket booth and headed down the entrance to the drive-in. its speed was about 2 mph. Everyone at the movie saw the object and started to leave and some were driving underneath it. The object changed directions slightly and accelerated out towards another town. where we all observed the object seem to land.I was working for a co. with sensitive work and was told to \"keep my mouth shut\". otherwise i would lose my security clearance.Im tired of being quiet."],"trends":["There have been 8 other sightings in Davis","There were no other sightings in Davis on or around August 12th 1987"],"Object Flight Path":"Path with directional change","Sighting Duration":"00:05:00","Date Submitted":"11/18/2011 12:31 UTC","City":"Davis","Weather Factors":"Unknown","Longitude":"-121.738507","Region":"California","Disposition":"Hoax"}