{"Object Features":"Unknown","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in Sulphur","There were no other sightings in Sulphur on or around November 17th 2011"],"files":["/var/www/straped/mufon/html2text/33431.html.txt","/var/www/straped/mufon/org/33431.html"],"Region":"Oklahoma","Log Number":"US-11172011-0041","City":"Sulphur","Date Submitted":"11/17/2011 11:47 UTC","Object Shape":"Triangle","Latitude":"34.510913","Sighting Duration":"Undisclosed","Date of the Event":"11/17/2011 10:10 UTC","divs":["Sighting DetailsThis is second sighting of same object. Last night it was further west and heading north. Was not close enough to make out anything except general golden glow-thought maybe helicopter?. Tonite, at 10:10 pm, was outside taking break when I observed object approaching from the NW. It moved very slowly and this time I knew it would go directly overhead so I sat down on the sidewalk to watch. It got close enough that I could see one blinking white light at the front and a row of 4 rectangular golden lights just behind the blinkig white light. The backwash of light was bright enough to see that the rectagular lights were on a solid surface. When it passed overhead, for an instant the lights were seen only as silouetted. Then the rear came into view with an identical row of golden rectangular lights. It proceeded at the same slow pace out of sight behind some buildings. During this whole thing, there were 2 commercial aircraft present, one passing very high from ENE to WNW and another a few seconds later, passing from due south to north, also at high altitude. At no time were plane engines audible. I finished my smoke and sat there thinking, what the crap did I just see? I'm ex-military, spent a couple of years of that time stationed at an Air Force base. In no way do I believe I have seen every type of aircraft we have, but this in no way resembled any aircraft I've ever seen."],"Longitude":"-96.954097","Weather Factors":"Unknown","Case Number":"33431","map":"<A HREF = \"http://maps.google.com/maps?q=34.510913,+-96.954097(33431)&iwloc=A&hl=en\"> mufon case (33431) map </A>","Object Flight Path":"Straight-line path","Source":"MUFON","Summary":"Object passed overhead from NW to SE, second sighting of same object","Country":"United States","Tags":"City","Disposition":"Unknown"}