{"Log Number":"US-11182011-0005","Latitude":"42.395688","Summary":"Stationary no sound no lights dull silver black disc plain heat or some sort emitting from bottom of craft","Region":"New York","Date Submitted":"11/18/2011 02:30 UTC","City":"Brocton","Longitude":"-79.451591","Date of the Event":"08/08/1997 06:45 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.395688,+-79.451591(33437)&iwloc=A&hl=en\"> mufon case (33437) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/33437.html.txt","/var/www/straped/mufon/org/33437.html"],"Case Number":"33437","Object Features":"None","Object Shape":"Disc","trends":["There has been one other sighting in Brocton","There were no other sightings in Brocton on or around August 8th 1997"],"Sighting Duration":"00:00:30","divs":["Sighting DetailsThe date and time could be somewhat off. I was about 11-13 when this event happened. Around evening time i was outside by myself throwing a football into the air. I bought a new nerf football so i threw it as high as i could and ran to catch it. This was a common thing that i did when i was bored. I was not outside for more than 5 minutes when i threw it over the fence. I was not allowed to leave my backyard at the time my parents were very strict about me going anywhere period. Thus why i was outside throwing a football into the air by myself and with no friends. When i climbed the fence to look over and see where the football had landed there was a ship right there in front or me. This ship was no more than 15-20 feet away from me and was almost touching the ground i couldn't see underneath the ship it was so low. At first i was stunned and scared i froze up. The UFO was so still it looked like a picture to me. There was no motion at all. Reminded me of that painting by salvador dali with the clock melting it was so unreal. I still had no idea what was happening i was in shock. my eyes were frozen on this disc. There was no activity and the area it was in was relatively small there were buildings that really were not that far apart but this thing was almost touching them. I'm talking millimeters here. Underneath this disc was a very very mild haze. Close to a desert when you see the heat waves but very hard to see. Heat was coming from this ship however i really dont want to call it that. The day that this happened which im not entirely sure other than it was summer and it was warm out but not hot for it was in the evening. This heat felt natural by that i mean like it was in my blood. It was comfortable. The best i can describe the heat that i felt is if i was sweating or hot the heat emitting from the ship would not make me sweat or feel anymore uncomfortable then what i already was. As my eyes were fixated on this disc it was a very dull grey black and i mean extremely dull. The black part of it which was mixed with the grey in no pattern at all reminded me of the shuttle in how when it reenters the earths atmosphere the heat turns it slightly black but very minor i personally believe that is what the disc had experienced from traveling to our planet and probably others as well. The disc was one solid piece of metal. No weld marks at all just one solid disc. that's it. No windows doors or anything that i could see. After staring at it for about 10-20 second i climbed down the fence looked at the ground and trying to catch up with my brain into what was happening. I was trembling because i seriously believed that i was loosing my sanity. I did this for about 5 seconds or so when i climbed back up the disc was gone. One thing needs to be crystal clear i'm not a nut. At the time i wasn't even really aware of ufo's other than the movies but i never not even once thought they were based off of anything. That year which i'm not entirely sure on other than it was the mid to late 90's 96-98. I supressed this memory until about 3 years ago. It scared me to even talk about it to anyone and i didn't tell anyone until recently. I know what i saw and there is no explanation for it other than what i have stated. I was extremely close to this thing and it is proof to me that they exist. If you believe great if you don't i don't care. This is my roswell and to me the most important thing to happen in my life to date. Thanks for reading and remember that regardless of what others say about the subject it is real it is here and we need to embrace it rather than criticize it."],"Object Flight Path":"Stationary","Source":"MUFON"}