{"Object Shape":"Boomerang, Bullet, Missile, Cigar, Chevron, Egg, Other","City":"Prescott","Log Number":"US-11182011-0004","Region":"Arizona","divs":["sighting detailswhile viewing a rare meteor shower at 3 am a huge all black ship came out of nowhere right from the direction i was looking. it was freezing cold so i was walking backwards to my apartment trying to get a last glimpse of a shooting star when it happened. i was standing in the middle of my apartment parking lot and this ship flew slow and low right over my head. it made no noise whatsoever. it looked like 5 oval\\egg shaped sections all hooked together with the one in the middle bigger than the ones on the sides. it formed a kind of chevron shape. it was almost like it just came out of some kind of cloaking mode if there really is such a thing because it wasn't there one second and then bam there it was flying over my head. i could see it clearly as it was so low and the parking lot lights showed it's outline. it was all black and smooth all over with no lights or sound. it flew so slow that i didn't know why it didn't fall down. i lost sight of it as it passed over me and then my 2 story apartment building. i ran inside and through to my bedroom which had a sliding glass door that looks out the same direction it was flying. it came out of the direction that i heard was the best for viewing the meteor shower. i think it was heading west. it headed towards thumb butte in prescott flying right over the safeway market on white spar road. that's when it was gone from my view. it flew a straight line for the time i was watching it. it came out fast and high up but in a blink of an eye it was right over my head low and slow. there was no mistaking what it was and i was totally sober as i was getting ready for gallbladder surgery in the coming weeks. it scared the crap out of me and excited me at the same time. my husband was out of town working and i didn't even tell him about it for at least 2 weeks. i can still see it perfectly. it seems like it was just yesterday when it happened. i now am very uncomfortable looking at the night sky and do not watch meteor showers any more. there is no doubt in my mind that we are not alone. and if some people think we are that they are just plain stupid. i will be 62 years old in 1 month so i am not some dumb girl with an overactive imagination. thanks for listening."],"trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around January 28th 2000","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=34.519108,+-112.458776(33436)&iwloc=A&hl=en\"> mufon case (33436) map </A>","Date Submitted":"11/18/2011 02:27 UTC","Date of the Event":"01/28/2000 03:30 UTC","Object Flight Path":"Straight-line path","Tags":"City","Sighting Duration":"00:05:00","Viewing Distance":"21-100 Feet","Longitude":"-112.458776","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33436.html.txt","/var/www/straped/mufon/more/33436_submitter_file1__myufo1.jpg","/var/www/straped/mufon/org/33436.html"],"Object Features":"Appendage(s), Other","Country":"United States","Case Number":"33436","Latitude":"34.519108","Summary":"Huge ship flew very slow and low just above the trees."}