{"Latitude":"50.721371","Disposition":"Unresolved","Longitude":"-1.981149","map":"<A HREF = \"http://maps.google.com/maps?q=50.721371,+-1.981149(33438)&iwloc=A&hl=en\"> mufon case (33438) map </A>","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Tags":"City","Date Submitted":"11/18/2011 03:17 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"GB-11182011-0007","Sighting Duration":"00:02:10","City":"Poole","Object Shape":"Sphere","Object Features":"None","files":["/var/www/straped/mufon/html2text/33438.html.txt","/var/www/straped/mufon/org/33438.html"],"Weather Factors":"Unknown","Date of the Event":"06/21/2002 12:00 UTC","Case Number":"33438","Region":"England","divs":["Sighting DetailsMe and my lady friend went to a fish bar to eat a meal, it was her birthday, Midsummers day. 2002, she felt somthing and siad look up, pointing a little towards the East, We are on the South coast of England in a Coastal port town of Poole Dorset. I looked at where she was pointing, and we both held our Sternum, ( Chest) as if it was tight, ?? not sure why,We watched 3 lights, A little bigger than a penny, and just a little smaller than a golf ball, they seem to dance arouun at high speed, back forth up down. Stop, the 3 lights then I think went around each other, ?? Anticlocwise, Then Above us flying out to sea, hovering , back and forth.. Then with some noise,The Jet fighters came along and the lights Flash, took off upward. Hmm Now that sort of manouvering (sorry spelling problems) surley would have liquified a Human occupant ??, let alone the stucture, and close proximity of each other ?? Come on White house ?? !! we know and feel the pressance of a higher Inteligents, apart from the ((Inteligents)) !!! hear on the Surface, and well below the surface , not forgeting the <> who live Under the Oceans, & Seas. Forget the data stored on disk, books etc (Cave drawings) etc. How about the data stored within the mind, Whist we sleep. when we sleep, it is not only to reccover from tiredness but to Upload, ? and defrag, send energy back to energy,and receive a, well, reddyness for the next days events. I was a member of the SPR, Society for the psychical Reaserch. for a while aprox 20 miles away from where I live. The Mind (Brain) is not just a ,,, Organ,, Bio Electric Data Storage. ETC. I thin we ALL See and expirience the Visitors well, energy influence, especially whilst we are in Alpha, rarther than in REM. ?? Have fun, but be carefull, through this expirience called Life. Chri H Near Bournemouth Dorset England, (36? miles from Stone Heinge.??"],"trends":["There has been one other sighting in Poole","There were no other sightings in Poole on or around June 21st 2002"],"Country":"United Kingdom","Source":"MUFON","Summary":"Coming out of a seaside fish bar my lady said oh look, we both felt Sternum trouble, Above flying out to sea, hovering ,"}