{"trends":["There have been 15 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around November 17th 2011","This sighting has never been favorited.",""],"divs":["Sighting Detailsi had been sitting out side for about an hour waiting to see some meteors when i thought i got a glimps of my first ones but it was strange and not what i at all expected. i just so happend to be on the phone with a friend when it happend the time was 10:42pm central, 8 huge dimlly lit orange balls of light in a v-shape traveled across the night sky silently west to east. at first i was excited that i had seen my first set of the meteors. but after several hours of watching meteors after my first incounter i soon relized that what i saw was no meteor at all. so i began to research and have found countless cases of this same craft, it almost appears to have some type of cloaking device. i feel that the 8 balls of light i saw were the under lights to a much larger craft. if any one eles saw this please comment i would reall like to know what it is that we are all seeing out here. this lights i saw were barley visable, and the meteors i saw look just like shooting starts witch was nothing like this. i watch the craft travle from right above me in my back yard to the east horizon untill it was no longer visable. it was only visable for abot 10 to fifteen seconds."],"Date Submitted":"11/18/2011 06:27 UTC","files":["/var/www/straped/mufon/html2text/33439.html.txt","/var/www/straped/mufon/more/33439_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/33439.html"],"Viewing Distance":"Unknown","Case Number":"33439","Object Features":"Unknown","City":"O'Fallon","Disposition":"Insufficient Data","Country":"United States","Region":"Missouri","Object Flight Path":"Straight-line path","Summary":"watching meteor shower when 8 huge orange translucent lights in a v-shape traveled across the sky silently from west to east.","Tags":"City","Object Shape":"Boomerang, Chevron","Source":"MUFON","Latitude":"38.772132","Date of the Event":"11/17/2011 10:42 UTC","Log Number":"US-11182011-0008","Longitude":"-90.676712","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.772132,+-90.676712(33439)&iwloc=A&hl=en\"> mufon case (33439) map </A>","Sighting Duration":"Undisclosed"}