{"Latitude":"31.778662","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Region":"Texas","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/33441.html.txt","/var/www/straped/mufon/org/33441.html"],"Longitude":"-106.506539","Case Number":"33441","Viewing Distance":"Over One Mile","Date of the Event":"11/17/2011 06:30 UTC","Disposition":"Unresolved","Country":"United States","Log Number":"US-11182011-0010","Object Shape":"Bullet, Missile, Disc, Egg, Sphere","Date Submitted":"11/18/2011 12:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.778662,+-106.506539(33441)&iwloc=A&hl=en\"> mufon case (33441) map </A>","Object Features":"Unknown","Summary":"Really really bright , shaped like a sphere, sort of like a disc.. Dissapered In Less Than One Tenth Of A Second","divs":["Sighting DetailsMe & my friend sam was getting out of the car walking to the rec to go play basketball. While walking i seen the object from the side of my eye then i did a double take and it was gone. I didnt say anything about it to sam because i thought i was tripping. Then he said \"oh shit\" then iSaid \"did you see that too\" ? and we just kept talking about it because weve never seen an image like that or object like that before. Sam said he noticed the object because he was twisting his dreads and he seen it. The first thing i thought it was was a ufo automatically. It couldnt have been nothing else then I searched on google el paso ufo and we seen the same stuff. Sam said he seen it go into 3 different pieces. The only thing we remember is seeing the light glow and leave so fast , and it didnt leave a trail so it wasnt a shooting start or nothing. My feelings was like did i really see that or was i just tripping , i was thinking about it all night and I even told my teacher and she told me to report it , I reacted so fast to it because it happened so fast. I lost sight of the object because i turned away then turned back to the object in less then a tenth of a second then it was gone and me and Sam was just talking about that the whole day."],"Source":"MUFON","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around November 17th 2011"],"City":"El Paso"}