{"Summary":"Looks like air planes, but theres probably 5 to 10 every night that make no noise.","Weather Factors":"Unknown","Case Number":"33445","Object Features":"Unknown","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsIt started in October when we saw a light pass from the south to the east. I reported to another ufo site. After that we started watching and I got my binoculars, and we watched what looks like planes but pass right over us and you can not hear a sound, you can hear the planes but not these. They seem to follow the same path every night. Me and my husband went and parked by a open field to see if we could see better and they were all around the area, blinking to each other. I also check the plane radar and it shows no planes around. When they do pass over, I cant see that well it kind of looks like it is just a stick with lights on it flashing I cant see a tail or any thing else. When they pass over all the dogs in the neighborhood go crazy barking. But we don't hear anything. We live in a rural area. Its like they meet around here then go fly off. When we went to the store you can see them hovering around open pastures. I get very anxious when I see them, but it's exciting. We usually loose sight when they fly out of range. Last night Last night we saw one that was not blinking at all, fly above the tree tops, then flew behing the trees and we lost sight. There are powerlines across the street over where the dogs bark. I don't have a camera that I can get a picture with, I cant fing them on the screen. My husband has his camera and is trying to figure out how to work it, so maybe we can come up with something. I am not sure what they are and what is going on, but I would like to know, I am afraid to go out side alone now."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.04501,+-82.834098(33445)&iwloc=A&hl=en\"> mufon case (33445) map </A>","trends":["There have been 2 other sightings in Branford","There were no other sightings in Branford on or around November 17th 2011"],"City":"Branford","Region":"Florida","Sighting Duration":"05:00:00","Latitude":"30.04501","Log Number":"US-11182011-0013","Tags":"City","files":["/var/www/straped/mufon/html2text/33445.html.txt","/var/www/straped/mufon/org/33445.html"],"Country":"United States","Date Submitted":"11/18/2011 01:43 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Shape":"Flash, Sphere, Unknown","Source":"MUFON","Longitude":"-82.834098","Date of the Event":"11/17/2011 07:00 UTC"}