{"Weather Factors":"None, Does Not Apply","Date of the Event":"11/17/2011 07:15 UTC","Disposition":"Unknown","Tags":"City","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","divs":["sighting detailson november 17, at about 7:15 pm, i was driving west on us 50 towards versailles, in. as i was leaving the area of elrod, i saw through the leafless treetops, in a west\\southwest direction, some lights. my first thought was \"fireworks\" because they lit up, lasted 4-5 seconds, then went away. and seeing them through the trees gave them that \"sparkling\" effect. further down the highway i saw the lights again, only it was clear sky, no trees close by. this time i thought \"ufo.\" i turned left on a side road toward home that goes straight south for a couple of miles. there are a lot of fields interspersed with groves of trees. here i had a clearer line of sight to my right through the passenger window of my car. since i was driving on a narrow road with no shoulders to pull off, i had to keep glancing at the road and then to the sky on the right while trying to avoid an oncoming car plus the one that was riding my bumper because i was going so slow. one second i was seeing nothing, then suddenly, at about 15 degrees up from the horizon, i would glance to see a double row of lights, about 8-10 per row, that was slightly tilted. in another glance it would be gone. i heard nothing at the time since my car windows were closed. the bar of lights was about the width of a quarter if my arm was extended out. also, at about an index finger length away were at least 4-6 aircraft(possibly helicopters?) surrounding the ufo, of which only a strobe-like white light was seen, no sound as they seemed very high up. by the time i reached my driveway about 7 minutes later, the ufo was disappearing beyond the trees because the road had become hilly. i could still see a couple of the strobe-like white lights pacing it as it went further south out of my area. in all, i estimated that i saw the lights go on about 12 times."],"Country":"United States","Log Number":"US-11182011-0025","Region":"Indiana","Longitude":"-85.251904","map":"<A HREF = \"http://maps.google.com/maps?q=39.071999,+-85.251904(33458)&iwloc=A&hl=en\"> mufon case (33458) map </A>","Source":"MUFON","Case Number":"33458","Date Submitted":"11/18/2011 08:29 UTC","Summary":"saw double row of lights going on and off, slighted tilted, in WSW while driving west towards Versailles on US 50 about 7:15 pm","files":["/var/www/straped/mufon/html2text/33458.html.txt","/var/www/straped/mufon/org/33458.html"],"Object Features":"Unknown","City":"Versailles","Viewing Distance":"Unknown","Latitude":"39.071999","trends":["There have been no other sightings in Versailles","This sighting has never been favorited."]}