{"Longitude":"-77.957307","Region":"West Virginia","trends":["There have been 9 other sightings in Martinsburg","There were no other sightings in Martinsburg on or around November 18th 2011","This sighting has never been favorited.",""],"Disposition":"Insufficient Data","divs":["Sighting Details1. I was in my boyfriend's backyard near Martinsburg, West Virginia. I was taking pictures of the sky simply because it was a very beautiful blue. I had also been taking pictures of birds that were flying by. 2. I didn't see the object with my eyes but, when I uploaded the pictures I took, I realized that there was some weird object in one of the pictures. 3. When I first saw the object in the photograph I thought that it could possibly be a bird. However, there aren't any white birds in this area (except seagulls and I never saw a seagull) and the birds that were flying around the area around that time were plainly black and turning up as such in my other photos. I knew the object could not be a plane because I distinctly remember that there were no planes in the sky when I took the particular photo with the UFO in it. 4. I'm not sure what the object was doing because I didn't see it myself until I saw the picture. 5. I am curious about what turned up in the photograph I took. It may not be something out of the ordinary but I can't seem to think of what it could be because of the odd shape and bright coloration of the object. 6. I never gained or lost sight because I never saw it. For those interested, I posted the picture as an attachment. The object is on the right side of the photograph. The picture was not altered in any way before I attached it."],"Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/33452.html.txt","/var/www/straped/mufon/more/33452_submitter_file1__IMG_0340.JPG","/var/www/straped/mufon/org/33452.html"],"Date of the Event":"11/18/2011 02:45 UTC","Weather Factors":"Unknown","Latitude":"39.46251","Object Flight Path":"Undisclosed","Date Submitted":"11/18/2011 04:42 UTC","Summary":"ufo in picture; didn't see myself but it turned up in a photo i took of the sky","Viewing Distance":"Unknown","Case Number":"33452","Source":"MUFON","Tags":"City","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","City":"Martinsburg","Log Number":"US-11182011-0019","map":"<A HREF = \"http://maps.google.com/maps?q=39.46251,+-77.957307(33452)&iwloc=A&hl=en\"> mufon case (33452) map </A>","Country":"United States"}