{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.105953,+-91.208544(33454)&iwloc=A&hl=en\"> mufon case (33454) map </A>","Date of the Event":"11/18/2011 07:15 UTC","Latitude":"36.105953","Object Features":"None","Date Submitted":"11/18/2011 05:37 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"33454","Country":"United States","Object Shape":"Sphere","trends":["There have been 5 other sightings in Black Rock","There were no other sightings in Black Rock on or around November 18th 2011"],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting DetailsWas looking for reported enid-falling stars, and noticed a bright light moving from the southwest heading northeast. As it moved overhead I noticed it was as bright as the north star and was moving in a straight line. It was traveling as fast as a jet plane and I noticed that there were no blinking \"strobes\" as you would expect to see on Jetliners. So as it passed by I expected to hear the noise of the jet engines, there was none. It was very quiet outside with no wind blowing. This being strange to me I picked up my binoculars and focused on the object as it was moving away and all I could see was the light itself, I didn't see any wings or outside structures just a bright light, Even with the binoculars still didn't see any strobes blinking to clarify that it was a plane. I watched it for a few minutes as it moved out of the area, never heard any sound. I didn't see any other air traffic at the time I sighted the object. I have seen aircraft flying through all the time and could easily identify jetliners and small planes because of the blinking lights, and this was very unusual to me because I couldn't identify what it was with the binoculars, and the fact there was no sound."],"Longitude":"-91.208544","Tags":"City","files":["/var/www/straped/mufon/html2text/33454.html.txt","/var/www/straped/mufon/org/33454.html"],"Region":"Arkansas","Summary":"Starlike with no sound throughout sighting.","Log Number":"US-11182011-0021","Sighting Duration":"Undisclosed","City":"Black Rock"}