{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Log Number":"US-11182011-0030","Source":"MUFON","City":"Champion Heights","files":["/var/www/straped/mufon/html2text/33463.html.txt","/var/www/straped/mufon/org/33463.html"],"divs":["Sighting DetailsI turned onto Carroll St. NW in Champion, Ohio off of Old State Rd. enroute to my destination. As I rounded the first bend, right above the tree line were three bright white lights in a triangular shape. I said aloud to myself \"What is that? What is that?!\" To which my passenger replied, \"I was just about to say that!\" We had traveled down this dead end road many times before, and had never seen this! I continued on the side road around the next bend; the object remained hovering in place with it's three large lights about two to three blocks away. There was no sound (I had my window cracked open). I slowed the car down and told my passenger to get out the phone and take a picture to which they replied \"No! I'm freaked out!\" I stopped the car and put it in reverse. As I inched my way backward, the object dimmed the three lights until they faded and changed into six small bright white lights, still in the same triangular shape and it headed north very slowly among the treeline. I continued on to our destination just four houses away, no more than 200-300 ft., my passenger jumped out as soon as I pulled into the drive and ran to the house yelling \"I'll call you later!\" I backed out of the driveway and was still faintly able to see the lights between the trees on the bend. I headed back down Carroll St. around the bends. However, I was unable to keep sight of the object as I had to drive west before I was able to return to driving east or north. I turned east onto Old State Rd. until I came to St Rt. 45 in Champion. I continued to head north on St. Rt. 45 until I reached 305, before heading home. There was nothing in the sky above the houses or trees that even remotely looked like the object. There was one plane in the air that I could see at this time but was very high in altitude and moving along the basic flight paths. This incident transpired between 5:50pm and 6:00pm on November 17, 2011."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.289593,+-80.862177(33463)&iwloc=A&hl=en\"> mufon case (33463) map </A>","Disposition":"Unknown","Date of the Event":"11/17/2011 05:55 UTC","Date Submitted":"11/18/2011 10:36 UTC","trends":["There have been no other sightings in Champion Heights","This sighting has never been favorited."],"Region":"Ohio","Weather Factors":"Unknown","Longitude":"-80.862177","Latitude":"41.289593","Case Number":"33463","Object Features":"Unknown","Tags":"City","Summary":"Triangular Craft, 3 large white lights that dimmed to 6 smaller lights before moving from hovering postion.","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Triangle"}