{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33464.html.txt","/var/www/straped/mufon/org/33464.html"],"Summary":"One white light on one side, red light on the other side, no light on nose, moved left to right(red to white)very close no sound","Region":"Alberta","Object Features":"Wings","Source":"MUFON","Latitude":"50.045854","divs":["Sighting DetailsMedicine Hat Alberta, about 8:15pm first week of November 2010, city center, a thin boomerang shaped object about 70 ft in the air directly over my head, above the trees, was quiet, but somehow got my attention. The color of this object was so dark, the same color of the night sky, only it blocked out the stars light, as to see the faint shape but no detail except the two lights. On the \"right wing\" at the tip was a small white light and a faint red light on the tip of the \"left wing\" this crafts \"nose\" was pointed my direction. The white light got brighter, the craft started to move from left to right, not turning, as if it was looking at me while it faded away, about the size of a small airplane, no sound, no trail, then disappeared over a condo building. I waited around to maybe hear something, see it return but nothing. Initially I though it was a plane, until I heard an eerie silence for how close this object was and the way it flew, there is a military base 20 minutes from the city (maybe about 40 from where this happened) and I am aware of certain aircraft that move differently with very minimal sound, which is why I called my father who was in this military, told him what I saw, and he said \" you probably just saw a jet or plane too high up to hear it\". I left the conversation there as to not look like \" I'm starting to believe silly things\", but in all seriousness, never had such a stunning moment, where I literally stopped walking and seen something that big hovering over me, flying unusually, soundless and gone in less than 2 minuites."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Boomerang, Triangle","Tags":"City","Longitude":"-110.669207","Case Number":"33464","Date Submitted":"11/18/2011 10:55 UTC","Country":"Canada","trends":["There have been 3 other sightings in Medicine Hat","There were no other sightings in Medicine Hat on or around November 9th 2011"],"Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=50.045854,+-110.669207(33464)&iwloc=A&hl=en\"> mufon case (33464) map </A>","City":"Medicine Hat","Date of the Event":"11/09/2011 08:30 UTC","Object Flight Path":"Hovering then path","Log Number":"CA-11182011-0031"}