{"Object Shape":"Triangle","Case Number":"33462","Summary":"flying north to south, met two others formed triangle rotated 3 times right, 3 times left, pulsed 3 times pulsed 3 times","map":"<A HREF = \"http://maps.google.com/maps?q=33.74971,+-116.963908(33462)&iwloc=A&hl=en\"> mufon case (33462) map </A>","Viewing Distance":"Over One Mile","Date Submitted":"11/18/2011 09:50 UTC","Object Flight Path":"Path then hovering","Region":"California","City":"Hemet","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsI was working night security at the Diamond Lake Resv. in Hemet and was looking up at the night sky, as was my habit nightly. I was sweeping the sky using my high power binoculars, when I saw something dark, blotting out the stars, moving north to south about 30-40 degrees above the horizon, as I looked east. I am a very experienced person at night, as I have always been a graveyard person and out at night. I had been working security for about 2-3 years by this time and used binoculars on a nightly basis, while sitting in the dark at various locations. I just happened to sweep my binoculars south to north when something dark caught my eye, moving south. I quickly swept south and caught up with the dark object and followed it as it moved south almost directly in front of me from quite a distance away. It stopped just to the right of center and then 3 lights came on and I realized there were 3 of them, triangle shaped, with the tips of the triangle pointing up, long sides with a somewhat narrow bottom. Each full triangle was completely lit up (white light) and they were all three in a triangle formation, one at the top, one bottom left, one bottom right. As I watched all 3 of them, at exactly the same time, they did 3 rotations to the right at about 1 to 1.5 seconds per rotation, finishing in the straight up position(s) they started in, then stopped for a second and then did 3 rotations to the left at about 1 to 1.5 seconds per rotation. Again ending the 3 rotations in the straight up position. It was like they were each pinned in the middle, as there was only a rotation, no movement up down, left right, no wobble. They just turned 360 degrees, 3 times right, three times left. Then stopped for a second or so and then all 3 lit up triangles, pulsed 3 times in unison and then in a second or two, all 3 went dark at exactly the same time and immediately moved off quickly. One went north, one south and one straight up. I again was able to find and track the one headed north, but lost it in a few seconds among the stars. I could not find or track the other two. I should add that when I first saw this craft, blacked out moving south, I figured it was some kind of aircraft, not a UFO. As I tracked it, I saw no lights until all 3 came together in the triangle formation described. I was pretty well shock for the rest of the night, as I have never seen anything like this before (or after!) Vance H. Seibert"],"Country":"United States","Longitude":"-116.963908","files":["/var/www/straped/mufon/html2text/33462.html.txt","/var/www/straped/mufon/org/33462.html"],"Log Number":"US-11182011-0029","Sighting Duration":"Undisclosed","Date of the Event":"06/15/1998 12:00 UTC","Latitude":"33.74971","Tags":"City","trends":["There have been 11 other sightings in Hemet","There were no other sightings in Hemet on or around June 15th 1998"],"Object Features":"None","Weather Factors":"Unknown"}