{"City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=53.732868,+-127.638231(33466)&iwloc=A&hl=en\"> mufon case (33466) map </A>","Weather Factors":"Unknown","Longitude":"-127.638231","Date of the Event":"08/15/1974 03:40 UTC","trends":[],"Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/33466.html.txt","/var/www/straped/mufon/org/33466.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Country":"Canada","Latitude":"53.732868","Object Features":"None","Date Submitted":"11/19/2011 12:21 UTC","Tags":"City","Case Number":"33466","divs":["Sighting Detailsdriving early morning from vancouver bc to calgary ab.through Yoho national Park my wife told me to pull off the road so the bright lights could pass us.she saw it first when i pulled over.however, my car died, no lights,no radio.we were motionless for about 5 min. as it hovered and shone a single light on the face of one mtn. then to a second face, then a third. then it spread the beam of light over all three faces at once.after focussing for awhile it turned off the beam and ascended and gone in split second. the sky was cloudless full moon. the ufo had the shape of a cigar about the size of 2 footballfields and hovered approx. 500feet from the ground ,one half mile(approx.)away from us at a 60 degree angle on passenger side of me.my wife at the time were scared stiff for we had our infant daughter sleeping in the back seat.as it descended it affected my auto by shutting it down. i didn't even turn the car off. when it ascended and out of sight, the car started up without me turning the key. once in calgary, phoned the observatory to report. they got both our statements and said if they hear anymore from that area they would be in touch no calls."],"Log Number":"CA-11192011-0001","Viewing Distance":"501 Feet - 1 Mile","Summary":"ufo descended ,hovered,shon abeam of light on mtn face, 3 times . shut off light and ascended faster than a blink.my car thenstarted up without turning key.","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","Region":"British Columbia"}