{"Longitude":"-80.309403","Disposition":"Unresolved","Latitude":"26.683474","City":"Wellington","Country":"United States","Summary":"While driving in the car with the family, we saw three lights coming out of nowhere in the sky.","Date of the Event":"04/14/1999 12:00 UTC","Case Number":"33476","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Log Number":"US-11192011-0008","trends":["There have been 5 other sightings in Wellington","There were no other sightings in Wellington on or around April 14th 1999"],"Object Shape":"Circle","Source":"MUFON","Object Flight Path":"Stationary","Weather Factors":"Unknown","Date Submitted":"11/19/2011 10:47 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/33476.html.txt","/var/www/straped/mufon/org/33476.html"],"divs":["Sighting DetailsMy (now ex-husband) and our three sons were out driving around in our immediate area from our apartment to do a little house hunting. We were driving around looking for houses that were for sale because we were interested in buying a house. We approached a stop sign when my eldest son says to us \"What is that? What is that?\" With the 2 youngest boys in the backseat asleep, we didn't know what he was referring to so we asked him, \"What is what?\" He said \"Those lights\". Still sitting at the stop sign, we asked him where and when we looked up and out of the car window, we saw three luminous lights just hovering in the sky to the East of us. We sat there in awe of what we saw because these lights appeard to come from nowhere; there were no crafts of any sort visible that would have been emitting the lights. My husband said to me that it appeard as though the crafts were cloaked. Not knowing what the lights were, we decided to cut our house hunting short and go home, but first we needed to stop at the grocery store. We drove the 5 minutes or so to the grocery store and when we parked our car in the parked lot, we all got out and looked up because the lights were still hovering. We wacthed the evening news to see if there were any reports and the next night on the news, they issued a statement saying that lights were seen as far North as Jacksonville Florida, but that no one would say what they thought it was. When I watched the \"Fayetteville Incident\" program on TV yesterday, the lights he saw are exactly like the lights I saw and so I wnated to report my story to you. I no longer live in West Palm Beach, but my ex-husband does and as far as I know, neither one of us has ever seen lights like that again."],"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.683474,+-80.309403(33476)&iwloc=A&hl=en\"> mufon case (33476) map </A>"}