{"Disposition":"Unknown","Case Number":"33474","Date of the Event":"06/23/1975 11:00 UTC","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"11/19/2011 08:39 UTC","Tags":"City","City":"Houston","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Longitude":"-95.36221","Object Features":"Dome","Region":"Texas","Log Number":"US-11192011-0009","files":["/var/www/straped/mufon/html2text/33474.html.txt","/var/www/straped/mufon/org/33474.html"],"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around June 23rd 1975"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.769663,+-95.36221(33474)&iwloc=A&hl=en\"> mufon case (33474) map </A>","Object Shape":"Disc","divs":["Sighting DetailsI can't forget it. I hope by telling my story I can let it go. It only happened once in Houston, Texas. My youngest daughter was about 2 years old and whenever she saw an airplane she would point up and say, \"plane, mommie.\" My husband wanted us to drive out with him to see about getting a tire fixed or replaced on our convertible caddilac. It was a hot summer day, and my husband let the top down off the caddilac. We arrived at the Tire shop early it was after 10:00am, but I do not think after 12:00. I remember thinking it was early and not much traffic was at the tire shop. My husband parked the car in the parking lot in front of the tire building and we decided to stay in the car. After my husband left the car and went into the building a plane happened to be going by at some point. My daughter saw it and said, \"look plane mommie.\" I looked up and to my astonishment I saw about 7 or 8 bright lights in the sky. They looked circular from the distance and they were bright like a star, reflecting light. They were initally in some like of form as they moved closser in my direction, it seemed. Then suddenly they broke that formation and scattered about ramdomly it seemed. They hovered and darted from side to side. They moved from one spot to another and then hovered a bit. An airliner was going by and I said to myself, surely they are seeing this on their radat. I was in a state of bewilderment, I looked away for one instant to rub my eyes out of disbelief. However, I know what I saw and when I looked back up within an instant, the moving, darting, circular, hovering, lights were gone. I looked around and no one was looking, if anyone was around. I kept looking up at the sky to see if they returned but they did not. Then it occured to my that I could not be the only who saw the UFO's, sio I began to turn the radio station to hear about the sighting........to my surprize there were no sightings reported. When my husband returned to the car, I told him the story. He did not know how to respond at first. I was somewhat frantic and searching the radio for facts about recent sighting. There were none. Later that day when we returned home, I turned from station to station on television news and there was nothing. NASA was close and the plane had to have picked up the activity from the plans, I assumed so how come there is nothing about the sighting I witnessed? I had heard there was a cover up that began early in the sighting history in America, I now was beginning to believe that was true. My daughter is now 36 amd that happened when she was about 2 years old at the least and about 3 at the most, which means it was 1975 or 1976 when I saw this maurade of unidentified space crafts in the Houston sky. When I tried to tell my mother she refused to listen. So, I have not shared it unless I am in the presence of someone who has had some paranormal experience or seen a ufo. When I saw MUFON I was given the mind to share my experience. It is nothing I can prove, and it was so long ago, but I remember it vividly as if it was yesterday. This happened in the daylight......and the lights were very visible, it was awesome. IF anyone else saw these ufo's in Houston, Texas around 1975 ot 1976 please let me know. I would love to hear your story."],"Latitude":"29.769663","Summary":"In the year 0f 1975 or 1976, in Houston, Texas, I saw a number of ufo's flying in the sky. They stopped in the air and hovered, then darted from one spot to another, I rubbed my eyes and looked again and they were gone.","Sighting Duration":"Undisclosed"}