{"Tags":"City","Country":"United States","City":"McLean","trends":["There has been one other sighting in McLean","There were no other sightings in McLean on or around August 12th 2008","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-77.155163","Log Number":"US-11192011-0007","Object Features":"None","Summary":"7/08 Orb flies Behind airliners' tail, then goes back the way it came...","map":"<A HREF = \"http://maps.google.com/maps?q=38.951517,+-77.155163(33475)&iwloc=A&hl=en\"> mufon case (33475) map </A>","Case Number":"33475","Source":"MUFON","Date Submitted":"11/19/2011 09:39 UTC","Object Shape":"Sphere","Disposition":"Unresolved","Sighting Duration":"Undisclosed","divs":["Sighting Details I was directed by some super intelligent force to witness what I saw on a clear day right above my driveway, around 11:15 am in July of 2008, which was a 747 jet flying east overhead of my neighborhood, with one strange looking orb, silvery in color, flying right behind it. I kept looking back down at the ground, and up again, to see if my eyes were playing tricks on me, and looked back up, and it was still behind the jet. I then thought I needed to return inside because It was so strange I thought I was seeing things. When I went back outside several minutes later, I saw the orb again, this time going backwards the exact way it came,at the same altitude, like it was escorting the jet, and then returning to whereever it came from. It was going the same speed as the jet which was interesting, matching the speed, and separation.(150-200 mph) Lost sight of it over the western horizon becasue our neighborhood is on a hill with many trees which used to be an apple orchard. I don't see this kind of stuff every day,and thought I needed to make a record of it for MUFON. The object was going due east with the jet,under it and behind it,and then due west several minutes later. I called the FAA and of course they dint see it on their radar, and could not tell me the flight number of the plane I saw either. Does anyone else have a similar report?"],"Region":"Virginia","Viewing Distance":"501 Feet - 1 Mile","Latitude":"38.951517","Date of the Event":"08/12/2008 11:25 UTC","files":["/var/www/straped/mufon/html2text/33475.html.txt","/var/www/straped/mufon/more/33475_submitter_file1__orbinsky.jpg","/var/www/straped/mufon/org/33475.html"]}