{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.33727,+-79.841272(33478)&iwloc=A&hl=en\"> mufon case (33478) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-11192011-0010","Date Submitted":"11/19/2011 12:27 UTC","Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/33478.html.txt","/var/www/straped/mufon/org/33478.html"],"Summary":"Cigar shaped mettalic object sighted in sky.","Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-79.841272","Object Shape":"Bullet, Missile, Cigar","Object Features":"Window(s)","City":"McKeesport","trends":["There have been 7 other sightings in McKeesport","There were no other sightings in McKeesport on or around November 19th 2011"],"Viewing Distance":"Unknown","Disposition":"Unknown","Latitude":"40.33727","divs":["sighting detailshello, i thought i'd follow the phone message i just left with an email. my wife and i live in mckeesport, pa. this morning, at approximately 11:15--11:20 a.m., we were driving north on myer blvd. in mckeesport. i stopped at the stop sign at the intersection of myer and riverview and my eye was immediately drawn to a bright light visible in the sky directly ahead of me above the northern horizon. i saw that the light was reflecting from a metallic silver object, and i thought it was odd because it seemed so much brighter than the jets or planes i've seen before in the sky. my instant reaction was to think this was a conventional aircraft of some kind, and i watched it, thinking that in a second or two a wing structure would become visible as the craft moved toward the north-east. when no wing structure appeared after a few seconds, i called my wife's attention to the object. she immediately saw it at that point and was as puzzled by it as i was. the object appeared to be cigar shaped. it was metallic and silvery looking. there were no wings, propellers, lights, or markings visible anywhere on it. the object left no contrail, nor could we hear any sound coming from it (although a sound would have been hard to hear because our car's engine was running and our windows were not rolled down.) in the center of the aircraft appeared what looked like a series of rectangular windows. (my wife said she didn't see this feature.) it was moving in a slightly north-easterly direction at about the same speed as a conventional aircraft would move. with growing curiosity, i turned the car left and drove up riverview in order to track the object and keep it in sight. we watched it head into the north-east for a while, and then it suddenly vanished. i don't know if it flew behind the clouds. we suddenly were unable to find it in the sky. sincerely, (name and phone number moved to fi box) csm 11\\19\\11 12:49 cst flg"],"Country":"United States","Date of the Event":"11/19/2011 11:15 UTC","Case Number":"33478","Region":"Pennsylvania"}