{"map":"<A HREF = \"http://maps.google.com/maps?q=53.560306,+-113.543613(33482)&iwloc=A&hl=en\"> mufon case (33482) map </A>","City":"Edmonton","Country":"Canada","Object Shape":"Unknown","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around June 15th 1955","This sighting has been favorited 2 times.",""],"divs":["Sighting DetailsThis event happened in 1955 and I would have been 5 years old. We lived on an acreage north of Edmonton on the St. Albert Trail just across from present day Nelson Lumber. My Dad had been drinking and he and my Mom got into a fight. As it would happen, my Mom slept with my Siter (who would have been one year old at the time) and my Dad and I ended up on the fold-out couch in the living room. In the middle of the night I was awoken by my Dad's snoring and I sat up. I saw an entiy standing over us beside the bed and another one over by the living room door. I was terrified and dove under the covers and snuggled up to my Dad who did not wake up. I hid for about 5 minutes before peering out to see that they were gone. The next morning I told my parents that we had two giraffes in the living room. They just laughed and told me it was a bad dream. I accepted that. What I saw was quite vivid and I kept recounting what it was that I saw. I was not a believer in ufo's until 2 years ago when I had my first sighting. I am an Engineer and defintely understand what I saw. Since then I have had 3 more sightings that could only be ufo's, and many more which I could not definetly determine. The 4 have been reported to Mufon and Aufosg. I have done much reading on the suject and read as many sighting reports as I can. Some reports are real and some are fabricated stories. I am an avid fan of UFO Hunters and Ancient Aliens. It was during one of these episodes that I realized what I had seen. See attached. The entities that I saw were just like the attached except they did not have helmets or head dresses on."],"Case Number":"33482","Sighting Duration":"00:05:00","Date of the Event":"06/15/1955 12:00 UTC","Latitude":"53.560306","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Revelations / Contact / Egyptian God","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33482.html.txt","/var/www/straped/mufon/more/33482_submitter_file1__pl1_54400_3qtrvw_tr_t021.jpg","/var/www/straped/mufon/more/33482_submitter_file2__Egypt.Sobek.011.jpg","/var/www/straped/mufon/org/33482.html"],"Log Number":"CA-11192011-0011","Object Features":"Undisclosed","Date Submitted":"11/19/2011 01:07 UTC","Region":"Alberta","Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"20 Feet or Less","Longitude":"-113.543613"}