{"Sighting Duration":"Undisclosed","City":"Manchester","divs":["Sighting DetailsWe Followed what we thought must be an air-balloon in the night sky. Brightly lit, and the color of flame, we followed a spherical shaped object about the size of a golf ball held at arms length, as it moved silently through the sky, just above the tree tops. We pulled over to get a better look and to see if we could hear anything. The glowing object was hovering directly in front of us and we couldn't believe what we were seeing! This was NOT a helicopter, nor was it a hot air balloon! It hovered in front of us across the road for a few seconds and then my Son said \" Did you guys see that?!!\" all I saw was that it was gone, I must have blinked! My Son saw it speed away in what he said was less than an instant. It had to be quicker than a blink. We waited for a few minutes to see if it would return and nothing did. I've see countless plains at night as my home is directly under flight lines for Bradley Airport. I've seen countless helicopters and I'm familiar with their sound and appearance at night. There were NO blinking lights on the object. It moved in a straight line from east to west very slowly and just above the tree line. After hovering for a few seconds it was gone. None of us have seen anything like this and we do not claim to know what it was we were watching. It is our hope that others saw this as well and will also report to MUFON. Thank You for all your hard work. Perhaps one day we will have full disclosure. A.C. From Manchester CT"],"Latitude":"41.7786","Weather Factors":"Unknown","trends":["There have been 14 other sightings in Manchester","There were no other sightings in Manchester on or around November 19th 2011"],"Longitude":"-72.512201","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.7786,+-72.512201(33489)&iwloc=A&hl=en\"> mufon case (33489) map </A>","Date of the Event":"11/19/2011 08:10 UTC","Object Features":"Unknown","Disposition":"Unresolved","Case Number":"33489","Summary":"Three of us saw what we thought was an airballoon, due to the orange glow in the night sky.","files":["/var/www/straped/mufon/html2text/33489.html.txt","/var/www/straped/mufon/org/33489.html"],"Region":"Connecticut","Tags":"City","Source":"MUFON","Object Flight Path":"Straight-line path,Path then hovering","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Diamond, Fireball","Log Number":"US-11192011-0018","Date Submitted":"11/19/2011 09:05 UTC"}