{"Summary":"Additional info regarding Oct. 25 sighting over Read Mt., Roanoke, VA","City":"Undisclosed","trends":[],"Object Shape":"Oval, Sphere, Other","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsThis report is a follow-up to the sighting of Tues., Oct. 25 which was contained in my report regarding the multiple sightings on Sat., Oct. 22, 2011. (I have submitted information on all these sightings to the MUFON investigator by mail.) I have recently discussed this particular sighting with my next door neighbor, since she and her teenage son witnessed this event in front of our properties. I wanted to ask her if she saw what I saw that night. Because it was her first sighting of anything like this, she was visibly upset and was saying over and over \"This is weird, oh, this is just too weird!\", I did not want to upset her further. As we were standing in her driveway observing this object, she handed me back my binocs at one point when the \"craft\" was flying over our heads toward the southeast from Read Mountain. (I believe her realization that it was indeed a craft, not just lights, was the tipping point of her emotions, and that is why she handed me the binocs.) I looked through the binocs and saw that the large \"bright light\" we had been observing was really what I can only describe as an elongated dumbell shaped craft. On each end was a large, glowing, vivid cherry-red light. Stretched between them was an elongated oval that was a soft, tanish-yellow color, and in the middle of that oval was another smaller elongated oval that was a soft blue-white color. I know this sounds weird, but that's what it looked like to me...and she confirmed to me that was basically what she saw as well. [I personally believe that we were looking at the back side of the craft as it was flying away from us; and perhaps the soft, blue-white colored elongated oval in the middle might have been a long narrow window.] At one point, I handed her back the binocs because I too was in an emotional state. She watched it continue to fly across the valley in a southeasterly direction toward the Vinton area; she then stated, \"Oh, that's weird, it just dropped straight down very fast and disappeared!\" I was watching it fly across the valley without binocs, so to me, it looked like it just \"blinked\" out. Needless to say, my observation of several sightings over the past month have taken a toll on my desire to witness anymore. I have decided to limit the number of evening potty trips for my dog and carefully pick the time frame of each to avoid any possible sighting again. At this point, I refrain from looking out my front windows at night unless I really have to take my dog out to potty, and only do so once I think the sky is clear. I keep telling myself they are not going to bother me, but it's just to soon to feel comfortable just yet! I truly do not want to see anymore of these \"things\"!!"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.440313,+-78.648224(33485)&iwloc=A&hl=en\"> mufon case (33485) map </A>","Longitude":"-78.648224","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","Date of the Event":"10/25/2011 07:30 UTC","Latitude":"37.440313","Object Features":"Other","Region":"Virginia","Sighting Duration":"Undisclosed","Case Number":"33485","Country":"United States","Date Submitted":"11/19/2011 06:13 UTC","Log Number":"US-11192011-0014","files":["/var/www/straped/mufon/html2text/33485.html.txt","/var/www/straped/mufon/org/33485.html"],"Tags":"City"}