{"Country":"United States","Source":"MUFON","Date of the Event":"11/18/2011 01:10 UTC","Longitude":"-74.22637","Disposition":"Unknown","Summary":"a sphere or round spaped object very reflective with no visible tail or visible wings.","City":"Keyport","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date Submitted":"11/19/2011 10:42 UTC","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/33494.html.txt","/var/www/straped/mufon/org/33494.html"],"trends":["There have been no other sightings in Keyport","This sighting has never been favorited."],"Latitude":"40.452113","divs":["Sighting DetailsI was driving on the Garden State Parkway heading north around exit 117. The sky was very clear wich is unusual lately. It was at 1:10pm I was on my way to Newark Airport to pick up a client. I was running late and watching the clock. When I got around Lawerance Harbor I noticed an object that looked unusual, it was moving slow from west to east about a quarter of a mile off the ground. Yes, I too said its a hellocopter or a small plane, but I saw no tail or wings and it definitely wasnt a helocopter, although thats about the speed it was traveling. Ok it was a round or sphere shaped object and it looked like it was stainless steel or polished aluminium (highly reflective) but as I said I saw no tail wings or rotors. I watched it move west to east, it traveled at a steady speed and at a flat altitude toward the ocean. It seemed to to vanish when it got to the ocean but I cant say for sure because I was going north and it was going east but I was watching it, The best as I could and it seemed to dissappear. I have lived in this area my whole life. We have 3 major airports and an Air Force base all in a 100 mile radious or less. My house is about 30 miles south of NYC and we have planes and helocopters going over all the time. So I have some knowledge of whats in the sky around this area. I was just thinking about it and there is also a naval weapons station very close to where I had this sighting."],"Weather Factors":"None","Object Flight Path":"Straight-line path","Log Number":"US-11192011-0023","map":"<A HREF = \"http://maps.google.com/maps?q=40.452113,+-74.22637(33494)&iwloc=A&hl=en\"> mufon case (33494) map </A>","Case Number":"33494","Object Features":"None","Object Shape":"Sphere"}