{"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"00:25:10","City":"Elsa","files":["/var/www/straped/mufon/html2text/33495.html.txt","/var/www/straped/mufon/org/33495.html"],"Date Submitted":"11/20/2011 12:54 UTC","trends":["There have been no other sightings in Elsa","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=26.292169,+-97.990111(33495)&iwloc=A&hl=en\"> mufon case (33495) map </A>","Date of the Event":"11/10/2011 11:55 UTC","Object Flight Path":"Path with directional change","Case Number":"33495","Latitude":"26.292169","Country":"United States","Object Shape":"Star-like, Triangle","Log Number":"US-11202011-0001","Tags":"City","Source":"MUFON","divs":["Sighting DetailsIt was a beautiful night.There was no cloud cover and it was not a full moon yet.I was standing outside of my house observing Orions belt when to my right side i noticed two white lights blinking on and off.They were not pulsating or blinking on and off fast.They were like slowly blinking on and off. And every time they would do that there was a green light in the middle. The green light remained on at all times. The lights were coming from the south east and going on a western direction. We live close to the airport,about forty minutes away. But the last flight comes in at eleven at night. And it does not have flights again until five a.m. So this object was not an airplane. The object was not bobbing or moving up or down. It was just going in a straight line or path. AS the object was nearing the western horizon it changed directions and started to come back on an easterly direction. When i thought it was going to come back towards me, it started to go in a circle,towards the south,and head towards the west direction again. At this time I had to get a witness. At the beginning I did want to leave because I did not want to lose sight of it. But since it changed directions I ran inside the house and woke up my girlfriend. When she got outside with me I told her what to look for. When she saw it all she could say was ,that is weird. I am a big believer in ufos but this is the first time I have actually seen something that is unexplainable. After the lights completed the circle it continued going on an western direction. I lost track of it because it continued going west and there were trees and other buildings that obseructed my view. I felt euphoric during the sighting and I still feel excited, happy. I have never felt like this before. I want to share it with the whole world. My girlfriend does not believe in this. So I want share it with somebody. I cannot describe how I feel right now."],"Summary":"T object was traveling in a south westerly direction. There were two lights that were blinking. And every time they would blink off there was a green light in the middle. The green light was not blinking or pulsating.","Longitude":"-97.990111","Region":"Texas","Object Features":"Unknown","Disposition":"Unresolved"}