{"trends":["There have been 3 other sightings in Ahwatukee","There were no other sightings in Ahwatukee on or around November 19th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=33.34312,+-111.97833(33499)&iwloc=A&hl=en\"> mufon case (33499) map </A>","Weather Factors":"None","Object Flight Path":"Stationary,Path with directional change,Other","Sighting Duration":"Undisclosed","Summary":"Very large burning meteor/satellite like objects re-entering atmosphere at high angle then changed direction/speed..Objects then appeared solid and began controlled manuevers","Source":"MUFON","Date of the Event":"11/19/2011 07:03 UTC","Longitude":"-111.97833","Date Submitted":"11/20/2011 01:10 UTC","Object Shape":"Disc, Square, Rectagular, Other","Object Features":"Undisclosed","Region":"Arizona","Tags":"City","files":["/var/www/straped/mufon/html2text/33499.html.txt","/var/www/straped/mufon/more/33499_submitter_file1__2011-11-1919.02.38.jpg","/var/www/straped/mufon/more/33499_submitter_file2__2011-11-1919.02.51.jpg","/var/www/straped/mufon/more/33499_submitter_file3__2011-11-1919.02.56.jpg","/var/www/straped/mufon/org/33499.html"],"Viewing Distance":"Over 1 Mile, Unknown","Case Number":"33499","Country":"United States","divs":["Sighting DetailsCame home from the store. As a friend and I were exiting the car upon returning he noticed what looked like a spectacular meteor shower maybe 30-40 degrees above the horizon due south of where we were in Ahwatukee. Several (5-10) large objects were falling or re-entering the atmosphere at very steep angles, nearly straight straight down. They had long burning orange tails following the objects -what you would expect from a meteor or a satellite re-entering and burning up but I had never seen anything falling at such a steep angle or appear to be as large or as close (what looked like as close as 10-20 miles) as they were coming in. And it took some time. They were falling for a good 2-3 minutes before it got weird. After they were about 10-15 degrees above the horizon one of the objects appeared to change direction, not very much at first, then it just stopped moving for 2-3 seconds and took off at what looked like 90 degree angle extremely quickly. Then another one of the burning objects began similar behavior in a different direction. Around the time the objects began to appear solid and no longer looked like they were still on fire we noticed the sound of helicopters, maybe 4-5 coming in from the north. The helicopters didn't seem to be in formation but they were all traveling toward the direction of the objects. At this point 2-3 of the objects that were left ( the rest disappeared) appeared to be solid and well defined in shape and were now emitting greenish light from their surfaces. They were zig zagging somewhat randomly until all but one seemed to vanish. The last one then just seemed to hover for a minute or so. We were all pretty weirded out by the experience (neighbors and a few friends that were meeting us at the residence had gathered to watch the phenomenon) and decided to get back to reality and go back in the house. About 10min later I was curious to see if anything was still happening so I went outside to look in the same area of the sky and what do you know a fireworks show. No a real fireworks show, how convenient. Turns out it was for some event the casino was having more or less in the same general direction. Decided to go back inside. Another 5-10min past and decided to go outside again. Now it appeared that what looked like one of the solid green objects seen prior was just hovering there but the light from its surface was illuminating a small round cloud a few hundred feet above its surface which was then indirectly lighting the object. Had seen enough for one evening"],"Disposition":"IFO","City":"Ahwatukee","Log Number":"US-11202011-0004","Latitude":"33.34312"}