{"trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around May 17th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Country":"United States","Date Submitted":"11/20/2011 01:54 UTC","Region":"Nebraska","Object Shape":"Sphere, Triangle","Sighting Duration":"Undisclosed","Summary":"Observed objects thru binoculars and took photos of same","Case Number":"33498","City":"Omaha","files":["/var/www/straped/mufon/html2text/33498.html.txt","/var/www/straped/mufon/more/33498_submitter_file1__2Objects.jpg","/var/www/straped/mufon/more/33498_submitter_file2__ob2100zoom.jpg","/var/www/straped/mufon/more/33498_submitter_file3__ob2100zoomreverseBlkWhtautolvlmiddle.jpg","/var/www/straped/mufon/org/33498.html"],"Date of the Event":"05/17/2011 05:20 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"Other","divs":["Sighting DetailsI reported numerous Discs sighted back on June 22nd 2003 (see Nuforc.org). Since then I have constantly watched the sky with binoculars or naked eye and have seen numerous objects over the years. I dont have the best camera but decided to try and take zoomed in photos now and then of objects I have seen. The camera that took the photos in regards to this report is a Digital with zoom that uses a floppy disk for storage. I have debated wheather or not to file this report and submit the photos since I want to be absoultly sure that what is reported is accurate and not a waste of anybodys time. The only manipulation that I have done on the photos submitted is to invert color & or zoom in & or sharpen in order to try and get the best view possible of the objects. I would love if Mufon or someone could enhance them better. This was a clear sunny day late afternoon. Sitting on my deck looking up at approximately a 60 - 80 degree angle - approximately 5 or 10 degrees to the west of South. Offutt AFB is 10 - 15 miles to the SE. Millard Airport is 1 mile straight south. Omaha Eppley is 15 miles to the North East. I was a jet mechanic in the Navy and am quit familiar with military and commericial aircraft. I have learned the incoming and outgoing flight paths for the above facilities. I am guessing that the objects I observed and took photos of are approximately up around 30 - 40 thousand feet as they were hard to see with the naked eye but able to watch with binoculars and they still appeared to be distant. When I took the photos - I didnt know if the pictures would turn out or not let alone capture anything since the objects seemed so far distance. The most common factor in the photos is the small green circular light. I first noticed the triangular object (which was hard to distinguish its shape at the time) and took its picture which I was supprised to see the triangular shape and more important to see a cicular area on the bottom of the craft which appears to be some sort of propulsion emission. The two object photo - was one object then two, were there and then were gone. I know what I saw, I know what I took pictures of and I know what the pictures are showing; I know that the objects are not any type of commericial or military aircraft that I have ever seen before. No matter if you are a skeptic of UFO's or a believer in UFO's as I am - here are the pictures for you to view and decide for yourself what the objects are. Mufon or NuForc are encouraged by me to analyize these photos in depth because I would like to know what they decide the objects in the pictures might be. Mufon or NuForc are welcome to contact me for any additional questions or investigation."],"Log Number":"US-11202011-0004","map":"<A HREF = \"http://maps.google.com/maps?q=41.211585,+-96.116686(33498)&iwloc=A&hl=en\"> mufon case (33498) map </A>","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Tags":"City","Disposition":"Unresolved","Latitude":"41.211585","Longitude":"-96.116686"}