{"Log Number":"UA-11202011-0006","Sighting Duration":"00:00:10","Case Number":"33501","Summary":"Bumerang inside circle, reflactive metal, high speed over direct line, big object on low distance from earth, over our heads. About 7 people seen it. About 1990.","Object Shape":"Boomerang, Circle, Disc","Disposition":"Unresolved","divs":["Sighting DetailsWe were juniors and have sit near our house in coople - about 7 people. It was warm day with no clouds and many stars on the sky, so we were watching directly upstears. Because of our house is big - 30 metres high, we had no possibility to see behind the house. So object appeared directly over us. i have seen it firstly, cry to others and showed it to them with hand. All people seen it. Object was like bumerang inside circle. Bumerang was rotating over center axis inside circle. Object was from white metal like grey metallic color. It reflected light from Earth. Speed was very high - during 7-10 seconds it flyed over all sky and disappeared on horisont. I though, it could be even high technology apparatus, made by people, but very secret as for that time, as for now. It is hard to say size, but it was seen as about regular plate and the distance was maybe 500 meters. I should say, it is possible to make the same machine, that will fly, I was read several articles about such form of flying object in Hitler's projects, some machines, as people say, were built by UFO technology. And there is Chinese toys of that, they fly!!!"],"Date Submitted":"11/20/2011 05:13 UTC","Object Flight Path":"Straight-line path","Date of the Event":"07/01/1990 08:01 UTC","files":["/var/www/straped/mufon/html2text/33501.html.txt","/var/www/straped/mufon/org/33501.html"],"Object Features":"Wings","Source":"MUFON","Longitude":"33.410033","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=49.065783,+33.410033(33501)&iwloc=A&hl=en\"> mufon case (33501) map </A>","Latitude":"49.065783","Tags":"City","trends":["There have been no other sightings in Kremenchug","This sighting has never been favorited."],"Region":"Poltavs'ka","City":"Kremenchug","Weather Factors":"Unknown","Country":"Ukraine"}