{"Date of the Event":"04/14/2005 11:04 UTC","Latitude":"36.381424","City":"Bentonville","Country":"United States","Object Features":"Undisclosed","Region":"Arkansas","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","trends":["There have been 5 other sightings in Bentonville","There was one other sighting in Bentonville on or around April 14th 2005"],"Date Submitted":"04/14/2005 11:04 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsSighting Report: between 9:30 and 10:00 april thirteenth clear night good vision five witnesses of seven seperate events in a thirty minute time period. My wife and I don t smoke in the house, so we had gone outside to smoke. My daughter and her boyfriend had just come home from wal-mart and my son had come out to see the commotion made by the dogs when my daughter had got home so we were all outside. The first thing that we saw was firts noticed by Ryan( daughters boyfriend) he noticed what I thought at first was a satelite because of the high orbit it was in and no FAA lights to tell me that it was an aircraft. it came from the south moving toward the big dipper then sharply curved and disapeared as it approached the moon. I thought that was really wierd couldn t have been a satelite because of the curving trajectory. I blew that off and we started really looking closely at the sky when it lit up! a bright light that was nearly as bright as the moon then faded to a starlike point it then moved across the big dipper and reintensified a minute later really really bright. My neighbor had pulled up and she could see how excited we were about what was going on. Then the light faded and disapeared as quickkly as it had come. but then there was another statelite like spot in the sky moving toward where the other had just disapeared. it curved around as if avoiding something and then disapeared as well we counted seven high orbit starlike spots all moving in curving or changing directions all heading to and disapearing in the same vacinity near the big dipper. Really got my juiced up i Sat outside for hours after that and saw nothing else that evening...thie would have been seen from southern missouri through oklahoma and surrounding areas as we are located in extreme northwest arkansas"],"Object Shape":"Undisclosed","Summary":"Not Provided","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/3350.html.txt","/var/www/straped/mufon/org/3350.html"],"Longitude":"-94.205597","Source":"MUFON","Case Number":"3350","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=36.381424,+-94.205597(3350)&iwloc=A&hl=en\"> mufon case (3350) map </A>","Object Flight Path":"Undisclosed"}