{"Longitude":"-70.334492","Log Number":"US-11202011-0012","trends":["There have been 2 other sightings in Scarborough","There were no other sightings in Scarborough on or around November 20th 2011"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/33507.html.txt","/var/www/straped/mufon/org/33507.html"],"Case Number":"33507","Latitude":"43.590197","Region":"Maine","Object Shape":"Sphere","Object Features":"Undisclosed","divs":["Sighting DetailsWhen on the Scarborough beach at dusk on 11-20-2011 with my family I was taking digital pictures. There was some cloud cover and Jupiter was becoming quite visable to the left of us. I took a picture of my husband and son-in-law aiming the camera toward the right of the ocean. It was getting dark and we left the beach. When I arrived home about 15 minutes later I checked my pictures and saw a whitish, sort of glowing sphere in the picture over the ocean and the two family members. I had not seen the moon and looked at moon phases on the Internet learning that the moon would only be at 35% on the 20th and would not rise until much later. I have read many reports that cameras can \"see\" objects that the human eye can't perceive. (This was a third encounter with an unknown object for me; the other two being in Tecumseh, Michigan and Flint, Michigan.) There were seven family members on the beach to verify there was no moon. My husband and I have the picture. I don't have the capability to send it in this report, but I have dated the picture on my camera. I will be happy the share it with MUFON."],"Source":"MUFON","Country":"United States","Date of the Event":"11/20/2011 04:10 UTC","Weather Factors":"Unknown","Object Flight Path":"Unknown","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.590197,+-70.334492(33507)&iwloc=A&hl=en\"> mufon case (33507) map </A>","Disposition":"Unresolved","City":"Scarborough","Date Submitted":"11/20/2011 07:30 UTC","Summary":"On the Scarborough ME beach taking pictures with my family there was no moon, but when I looked at the digital picture there was a fairly large sphere in the sky above 2 family members."}