{"Object Shape":"Circle, Disc, Oval","Country":"Canada","Date of the Event":"06/26/2011 07:30 UTC","Log Number":"CA-11202011-0007","Weather Factors":"Unknown","Date Submitted":"11/20/2011 05:54 UTC","Source":"MUFON","Summary":"A hovering disk in the sky that did not move or make any noise","files":["/var/www/straped/mufon/html2text/33502.html.txt","/var/www/straped/mufon/org/33502.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.662306,+-79.379174(33502)&iwloc=A&hl=en\"> mufon case (33502) map </A>","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around June 26th 2011"],"City":"Toronto","Longitude":"-79.379174","Latitude":"43.662306","Region":"Ontario","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Stationary","divs":["Sighting DetailsI was taking my dog for a walk around the block. There is an elementary school that I was walking towards and as I crossed the street in front of it I caught something in the corner of my eye above the school yard. I knew that was odd to have something there so I looked up directly at it and it was a saucer shaped disk like, large something, hovering over the school yard. My dog seemed un-affected by it being there but I stopped in my tracks. It was so clear to me that it was an object that was un-identifiable (to me anyways) just hovering over the school yard that I pass every day. There was no lights coming from it, no noise, it kind of seemed like windows all around the side of it but I couldn't see inside the windows. There was nothing on top of the objust just litterally like a disk or a hockey puck that was blown up and hovering in the air! I stood there for several minutes trying to focus in on it and decide whether it was something that I could explain. When I was satisfied that I would not be able to explain what it was I started looking around for someone else to ask if they were seeing what I was seeing and literally no one was around, which was also odd to me because we live in a community that is pretty active with young families especially at around 7:30 p.m. on a bueatiful and clear summer evening. I got really scared and just ran home. As I was running I kept looking back at it to see if it was still there and it was there, doing nothing but hovering in the sky. The thought that was running through my head was that I couldn't be seperated from my dog and that I had to get my dog home. After I got home (to what was an empty house because my husband was working nights) I don't remember what I did at all for the rest of the evening. A weird thing (in my opinion) about this experience is that I didn't call my mom right away to tell her about this experience because she would have loved to hear about something like this. She is obsessed with ufo's and aliens and is the only reason why I am reporting this. I didn't remember any of this story until I was prompted by a conversation me and my mom where having the following tuesday."],"Object Features":"Unknown","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Case Number":"33502"}