{"Object Shape":"Other","Viewing Distance":"Unknown","Latitude":"49.903077","Summary":"Two clearly-observed, stationary lines of red pulasting lights. Left formation 45 degrees above horizon. Right formation 50-60 degrees above horizon. Clear sky. Higher object faded out first, then lower also.","Case Number":"33511","Region":"Saskatchewan","map":"<A HREF = \"http://maps.google.com/maps?q=49.903077,+-102.029075(33511)&iwloc=A&hl=en\"> mufon case (33511) map </A>","Object Flight Path":"Stationary","Tags":"City","divs":["Sighting DetailsI am a professional newspaper journalist in southeast Saskatchewan, Canada. I am also a professional biographer and published author. I have been a lifelong aviation enthusiast, and have taken 60+ hours of pilot training, many of those hours as pilot in command (solo) on three different aircraft types. I am the former owner of a flight simulation company that had customers in 65 countries. At 20:35 on Sunday Nov. 20, I decided to take the dog for a walk and get a copy of one of the newspapers I have been reporting for. Our town is small, about 700 population on the Canadian prairie. Tonight it is -18 degrees celcius, with a wind chill of -24. There are no clouds, the sky is crisp and clear, and visibility is unlimited. There is a recent fall of 4 inches of snow on the ground, so I did not want to be outside for long. I got the paper, (just a walk of about 200 yards from my back yard) and was on my way back to the house. As I have been studying the UFO phenomena in detail for a year now, as I was walking, looking down at the dog, I found myself thinking \"If you keep your eyes on the ground, you will never see anything.\" I looked up and did what I normally do on a clear night, started scanning the sky, admiring the brilliance of the stars in the frigid atmosphere. Then I saw it. In the northwest quadrant of the sky, at approximately 45 degrees above the horizon, there was a formation of lights. I assumed this would be a regional airliner coming from Regina. I stopped walking and concentrated on the formation. There were clearly four red lights in a line, with an impression of a raised elevation for the two middle lights. My immediate question was, \"Where is the green navigation light?\" There was none. The lights blinked on and off, from left to right. At no time were all four lights on together, but the rapid pulsing was giving the impression of a solid object behind the lights, although there was no texture visible. I decided to walk forward until a tree in my yard was p[lacing branches across my line of sight. I positioned myself to that the light formation was visible through the branches. I wanted to stand still, viewing the lights through something also stationary in order to assess relative movement of the lights across the sky. There was no movement. The lights kept pulsating in order, and I said out loud \"Bloody hell, it's hovering.\" I then noticed lights to the right of the first object. I hoped it might be an airliner so I could see it's movement relative to the unmoving position of the first. No chance, this was an exactly identical light formation. It was also motionless, showing the same characteristic of four pulsating red lights, blinking rapidly on and off from left to right. The second object was perceptibly higher in the sly, relative to the horizon. If the first was 45 degrees up, this was somewhere between 50 and 60 degrees. I watched these light formations for maybe 45 seconds, though it seemed longer. If I put my hand out at arm's length and opened a gap between thumb and forefinger, I would say the \"length\" of each formation was somewhere in the region of two millimeters. The gap between the objects would have been similarly perceived as a foot and a half. There was no sound, and no movement of the formations either across the sky or relative to each other. I did not feel any fear, just fascination. I decided I would run into the house and get my wife and daughter to see this, and no sooner had I thought that, than the higher object to the light simply faded out quickly. Maybe two seconds later, the lower object to the left similarly faded. They were gone. Aircraft? Not a chance. We are not on a major airway, and the only airliners that come over are typically from Regina which is 150km away to the west. Anything flying over us at altitude is normally above 30,000 ft. Light aircraft? no. In the total silence of the prairie, you hear aircraft before you see them at night, and besides, general aviation flying in this area is very rare at night. Would you fly for fun tonight at these temperatures in a Cessna, Piper, Cirrus, etc? I would not. Satellite? No. I have observed the sky enough times to know that a satellite would not appear as a line of four red pulsating lights, let alone two of them at the same time. I would also expect movement of a satellite. Meteor, comet, asteroid? No. Again, the sighting does not fit with these type of phenomena, which I have witnessed this summer as we saw increased meteor activity recently. Red lights, pulsating in sequence, dead still and silent in the clear night sky. Two sets of them at different elevations and positions, high above this little prairie town. I cannot say what these were, they must thus be in my mind unidentified. If we are moving into a new age of greater disclosure, then we can expect to see more of such sightings. As a reporter, I am not afraid to write openly in the newspapers about them. I have witnessed quite a few things in the sky over my 54 years on planet earth, and I only hope that we will get definitive answers long before my time is over. What I saw just over an hour and 15 minutes ago was impressive. While I might have my suspicions of what I witnessed, based on study and a process of elimination, I refrain from being so bombastic as to say this is anything other than most unusual in our skies, clearly unidentified, and in my opinion, most welcomed. I hope this report adds to the growing repository of first-hand witness testimony."],"Object Features":"None","Longitude":"-102.029075","Country":"Canada","Log Number":"CA-11202011-0016","Date of the Event":"11/20/2011 08:40 UTC","Source":"MUFON","City":"Wawota","trends":["There have been no other sightings in Wawota","This sighting has never been favorited."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33511.html.txt","/var/www/straped/mufon/org/33511.html"],"Date Submitted":"11/20/2011 11:02 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}