{"map":"<A HREF = \"http://maps.google.com/maps?q=38.546426,+-121.734277(33519)&iwloc=A&hl=en\"> mufon case (33519) map </A>","Weather Factors":"Rain, Light","divs":["Sighting DetailsMy wife, daughter and my one year old was driving to I-50 towards Vacaville CA. to drop off my daughter to my mom so she can help her grandma in cooking for Thanks Giving day this coming up week. We were driving West towards San Fransisco we were passing through the city of Davis it was very cloudy out side like it was going to rain but not a drop landed on my windows but very dark clouds my wife was sitting on my passenger side of the car and my daughter was sitting in the back. My wife was seeing something coming out of the bottom of this dark cloud and she said look at that light falling straight down towards that building my daughter seen it very clearly. I suddenly glanced to my wife's windows and saw a orb like bright very bright white and blue strip of light falling down from the cloud like it was going to hit the buildings but then suddenly it mad a quick turn left and up about a 45 degree straight up back to the dark cloud and gone it was so fast. We asked ourselves did you see that UFO that was amazing I was very excited my wife was very scared it was her first time seeing such things. But me and my daughter have seen these before and I have been seeing UFO's since I was a kid hovering on the cliff of my back yard in Daly City CA. But this was a sight to see man my wife and me was saying I wish I had a video of this WOW! that was Assume. I asked my wife now do you believe me now you have seen it with your own naked eyes? She was stun a little shaken and excited and she said yes. Everything just happened in seconds it was just to fast so I'm just writing this report on MUFON to know if anybody ells have seen this UFO over the City of Davis or Sacramento."],"Object Features":"Unknown","Region":"California","Sighting Duration":"00:00:04","Tags":"City","Case Number":"33519","Date Submitted":"11/21/2011 02:14 UTC","Source":"MUFON","Object Flight Path":"Path with directional change","Date of the Event":"11/20/2011 05:30 UTC","Log Number":"US-11212011-0006","Viewing Distance":"501 Feet - 1 Mile","City":"Davis","files":["/var/www/straped/mufon/html2text/33519.html.txt","/var/www/straped/mufon/org/33519.html"],"Country":"United States","Object Shape":"Circle, Disc","Latitude":"38.546426","Summary":"Peaking threw the clouds.","trends":["There have been 8 other sightings in Davis","There were no other sightings in Davis on or around November 20th 2011"],"Longitude":"-121.734277","Disposition":"Unknown"}