{"Object Shape":"Circle, Star-like","Tags":"City","Source":"MUFON","Case Number":"33527","Date Submitted":"11/21/2011 04:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.354163,+-105.296346(33527)&iwloc=A&hl=en\"> mufon case (33527) map </A>","Country":"United States","Sighting Duration":"Undisclosed","divs":["sighting details i was letting my dogs out for the morning outing (4:45 a.m. on 11\\20\\2011)when i looked up in the sky and quickly noticed a blue orb. before i could yell for my husband to come outside to look at this thing it suddenly dropped down silently and disappered behind some trees. two of my three dogs took off in the orb's direction and one of my dogs turned around to hide behind me. i knew that it could not be the moon as i could see the moon to my right. this thing was half the size of what the moon appeared to be that morning and i know it was not a star. the stars where somewhat covered by clouds. this orb was very bright, blue with a fuzzy or hazy outer layer. i kept looking for whatever it was but never saw it again. it went down behind some trees, and on the other side of these trees is a lake. this all took place between 7 to 10 seconds. i have lived here in this area for 10 years and have seen other strange lights, orbs and flashes of lights from unknown objects but this is by far the closest i have ever been to whatever it was."],"trends":["There have been 6 other sightings in Angel Fire","There were no other sightings in Angel Fire on or around November 20th 2011"],"Longitude":"-105.296346","City":"Angel Fire","Summary":"Blue orb with lighter blue fuzziness around main orb","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Disposition":"Unresolved","Object Features":"Unknown","Weather Factors":"Unknown","Latitude":"36.354163","Log Number":"US-11212011-0014","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/33527.html.txt","/var/www/straped/mufon/org/33527.html"],"Date of the Event":"11/20/2011 04:45 UTC","Object Flight Path":"Hovering then path,Straight-line path"}