{"map":"<A HREF = \"http://maps.google.com/maps?q=45.304489,+-121.745254(33520)&iwloc=A&hl=en\"> mufon case (33520) map </A>","Tags":"City","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Star-like","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/33520.html.txt","/var/www/straped/mufon/org/33520.html"],"Longitude":"-121.745254","Disposition":"Unknown","Log Number":"US-11212011-0007","Sighting Duration":"00:05:00","Case Number":"33520","divs":["Sighting Detailsi was at snowboarding camp in Mt. Hood, Oregon and i was staying in a cabin with about 10 other people. We had heard there was going to be a meteor shower that night so we decided to go watch for meteors at around 10 PM. After being outside for about 5 minutes, we saw what appeared to be 2 meteors. 7 of us were watching these 2 objects when they both changed directions at the same time. They both had made what i would guess to be a 110 degree turn, except they didnt \"turn\" they just abruptly changed directions without any curve in the flight pattern. When they changed direction they both sped up and were both out of sight within about 5-10 seconds. Before this they were moving at the same speed as all the other meteors in the sky. When we saw this we were all completely dumbfounded, 5 of us agreed that we had just seen a UFO while the other two described it as \"just a crazy meteor.\" I was very excited when i saw this because I had been a very big believer in ET's since i was very young, and i had always wanted to see a UFO."],"Object Flight Path":"Path with directional change","Latitude":"45.304489","Region":"Oregon","Object Features":"None","Summary":"2 red glowing objects in the sky suddenly changed directions at the same and flew away","Source":"MUFON","Date of the Event":"08/12/2011 10:00 UTC","Date Submitted":"11/21/2011 08:03 UTC","trends":["There has been one other sighting in Government Camp","There were no other sightings in Government Camp on or around August 12th 2011"],"City":"Government Camp"}