{"files":["/var/www/straped/mufon/html2text/33521.html.txt","/var/www/straped/mufon/org/33521.html"],"Object Features":"Unknown","Object Shape":"Other, Unknown","Viewing Distance":"101-500 Feet","Source":"MUFON","Region":"Nebraska","Country":"United States","City":"Valley","Tags":"City","Object Flight Path":"Hovering then path","trends":["There have been no other sightings in Valley","This sighting has never been favorited."],"Log Number":"US-11212011-0008","Disposition":"Unknown","Case Number":"33521","Latitude":"41.311028","map":"<A HREF = \"http://maps.google.com/maps?q=41.311028,+-96.346562(33521)&iwloc=A&hl=en\"> mufon case (33521) map </A>","Date Submitted":"11/21/2011 09:05 UTC","divs":["Sighting DetailsDriving to work i saw a bright light on the horizon, thought it was a star, but then i never remembered one being in that spot in the sky. i then concluded it was too bright to be a star, and it was changing colors like a twinkling star but so bright that no other star twinkled the same way. as i headed east towards valley it disappeared, thinking yeah... its a star, the clouds must have covered it up.it then appeared a mile north of its original location in a matter of minute keep in mind was never moving just hovering. as i got closer to valley it began to look like a cars headlights, there were two white lights close together, i realized it was hanging over my work place Valmont Irrigation Inc. i grabbed my phone to get a pic, but right then it changed its colors to a pulsating red. I pulled in to valmont with my eyes glued to it completly overhead. it started moving out slowly to the west, it resembled a helicopter in a way however the lights were spread apart like a square. i parked my car an watched it move out towards fremont, then i walked inside knowing this was strange."],"Date of the Event":"11/20/2011 09:05 UTC","Sighting Duration":"Undisclosed","Longitude":"-96.346562","Summary":"like a helicopter but not a helicopter","Weather Factors":"Unknown"}