{"Sighting Duration":"00:01:00","Latitude":"41.353108","divs":["Sighting DetailsLast winter or early spring I was walking in the Ansonia Nature center late at night as I sometimes do. I reported witnessing a conical-egg like craft landed there near the Nature Center pond several years ago. On this occasion, as I was returning home on the last leg of my walk through the woods at approximately 3:00am I was walking past a house on the outskirts of the woods. All of the sudden a dear runs frantically across the street in front of me maybe 20ft ahead and skids and falls in front of me as it had been spooked badly by something. I do not think that it was me that spooked the dear because if it had noticed me it would not have run literally right across my path. I thought this somewhat spooky - and I realize this is completely subjective - due to the weird quietness in the air like something is about to happen. I continued walking towards home and took up a path along the border of the farm belonging to the last house next to the woods. The path is next to the woods bordered by some open terrain and fields on the other side. While I was walking my eyes were at a soft focus not paying attention to anything in particular. Then all of the sudden my body instinctively(?) stopped and my eyes focused on an entity approximately 25 yards ahead slightly crouched in a very aggressive posture staring right at me. When I first saw the entity - and again this is entirely subjective - I already knew that it was an extraterrestrial alien of some kind without letting that thought occupy my mind as I was so involved in an instinctual stare down. Granted, there are so many other possible explanations, logically speaking, of course but I will elaborate on the strangeness of the encounter with this entity anyway, even if it was not of extraterrestrial origin. The entity glowed a dull grey-blue and if I remember correctly the moon was shining so there was some visibility as far as light is concerned. The strange thing was the entity uniformly glowed the dull grey-blue everywhere as if it were naked and had no cloths on. I mean if it were blue-grey skin due to the moonlight, the entire entity would not have been that color due to the fact that it should have been wearing clothing of some type if it were human. No clothing was noticed on the creature. I am not new to UFO and alien reports due to earlier sightings I have experienced and subsequent research, but the over-sized head, skinny legs and arms, large eyes were not present on this creature normally attributed to \"grays\". In fact the entity seemed much more human-like in form, athletic, intense, focused, at the ready, aggressive in posture. I did not notice any eyes on the creature in the grey-blue haze that was its form yet I could tell it was staring directly at me in a sort of stand-offish way like two animals in the wild that are infringing on each others terrain. After locking eyes or glances for three seconds as if I had stumbled upon this entity and it was surprised to see me there or as if it was waiting for me and that I had noticed it too soon and been too alert, the entity very athletically turned and ran full speed into the woods at about a ninety degree angle to the line connecting our paths. I heard the bushes rustle as the creature took off into the woods and also another sound to my immediate left that sounded like a dear going through the woods by the size of the sound as if it were chasing after the entity as the two paths sounded close or like they would eventually intersect when traveling at such a speed through the woods. Right after the entity took off dashing headlong into the woods I yelled at it as loudly and aggressively as I could. This is subjective again and is not really hard proof, but I sometimes get premonitions that I will encounter an ET entity in the woods and that we are sometimes on similar mental bandwidth or thinking channels and that if we were to meet there should be a designated location to do this. I had passed the designated location which I have thought about enough for it to be decided upon and familiar a location to meet at and I yelled at the creature as loud as I could to meet in the right spot (which of course may have been a little more boring of a scenario I later concluded) angered that the supposedly agreed upon location was ignored. Please pardon this craziness (or I feel crazy disclosing the experience in this way) I just thought I would add this anyway. I told a friend about the incident and she said it was just some random person walking in the woods at night and that it was nothing. This of course is very possible and could easily dismiss this incident away. But there was a strange energy to the encounter and locking stares on each other to the extent that I was nervous and didn't want to continue the path I was going because I had the sense like I might be ambushed by something. There was an extreme sense of tension, intrigue, and danger. I walk back in the woods at night somewhat regularly and dear stalk and approach me within 15-20 feet at times and all other kinds of sounds occur and I do not become scared even though I can't see anything at all but what the small dim flash light can show me. So this being the case, if it had been a real person, it would had to have been a very aggressive, intense, serious, one with a strange eerie aura about it to frighten me. And from the people that i have seen walking back in the woods during the day, what on earth would cause him to stare at me in an overtly aggressive manner for three seconds after I saw him and then run head long full speed into the woods. Crazy right? I went back to the spot the following day and looked at the spot where I thought the entity had approximately been and all along the path next to the woods there was very thick shrubbery, grass, trees, bushes, a tangled mess and I thought to myself, how on earth did this thing run full speed through this tangle. It seemed simply impossible to me. Right when I had decided to turn around to go an alternate route home instead of through the woods because I was nervous of an ambush and felt more safe going through a neighborhood with streetlights but I regretted for a moment not taking off after the creature myself. But as I said it would have been impossible to go through the thick bushes and foliage to do that. The strangest impression that I get from this incident is that when I locked eyes with the creature I felt like it had been waiting for me or was watching me and that I wasn't supposed to have seen it so soon so it was embarrassed or something and ran off. And when it ran off, and this is very important, it was not in a scared manner but a very regimented, sure, quick, escape type of way but in a way that let you know it meant business and wasn't scared or nervous but just needed to get out of the area and for some reason it did not belong there because I saw it. So I walked home the long way on a lit street through the neighborhood just going over the event and continually saying to myself that I was glad that I went the way I did, sure that if I had not I could have possibly been ambushed. How strange that if I saw simply another human I would have had these impressions and feelings especially since I regularly go back there and am used to the place at dark. It is just hard to believe than another human would have acted the way that this entity did. All I can do is report what I saw, which is shaky at best. Nevertheless, the sighting of the landed conical craft that I witnessed prior to this sighting a while back at approximately the same location in my mind lends credence to the feelings and impression that I have that this entity was something other than human."],"Object Flight Path":"Undisclosed","City":"Ansonia","files":["/var/www/straped/mufon/html2text/33534.html.txt","/var/www/straped/mufon/org/33534.html"],"Summary":"Encounter With Alien Entity","Object Shape":"Unknown","Disposition":"Hoax","Log Number":"US-11222011-0001","trends":["There has been one other sighting in Ansonia","There were no other sightings in Ansonia on or around February 25th 2011"],"Source":"MUFON","Date of the Event":"02/25/2011 03:00 UTC","Tags":"City","Case Number":"33534","Country":"United States","Weather Factors":"Unknown","Object Features":"Undisclosed","Region":"Connecticut","Longitude":"-73.070697","map":"<A HREF = \"http://maps.google.com/maps?q=41.353108,+-73.070697(33534)&iwloc=A&hl=en\"> mufon case (33534) map </A>","Date Submitted":"11/22/2011 12:59 UTC","Viewing Distance":"21-100 Feet"}