{"Longitude":"-120.013526","Region":"Nevada","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Fireball, Flash, Sphere, Star-like, Other","trends":["there have been no other sightings in lake tahoe ca\\nv","This sighting has been favorited 1 time."],"Date Submitted":"11/22/2011 01:26 UTC","Case Number":"33535","files":["/var/www/straped/mufon/html2text/33535.html.txt","/var/www/straped/mufon/org/33535.html"],"Summary":"Arc Light White/Blue Very High Speed Above Cloud Cover desending through clouds traveling North Turning Blood red Color Vanishing Slow rate of decent Speed however incredible.","divs":["sighting detailsnovember 20\\2011 @ 17:30 hrs pacific time. traveling alone northbound u.s.hwy 395 @ just north of china springs road\\douglas county,nevada. fyi:driving full sized pick-up truck with 100%,360 degree view. at the top of hill overlooking gardnerville,nv with line of sight view to my left is east peak nevada 10,000' elev, with lake tahoe basin on other side,the sun was starting to set, but do to partly high clouds not as bright as would be if clear skies. object was a blue\\white(re:arc welding arc)desending at slight angled path to north, starting above cloud cover then penetrating the cloud formation,at extreme speed that i could only estimate if object had been much much closer, cloud cover was about 10 miles west of my location. however i saw object above and through raincloud and come out bottom, lluminating inside of cloud, object continued north at very high rate but slight angle possible 10 to 20 degrees. object then before either going behind genoa peak 9,000' elev or into it, turned a red color (not orange\\red) described as like a road flare, then disapeared out of visual range or burned up, but at no time was there ever a trail, it was very clean looking, solid white\\blue arc turning red, the gone. could had been a meteor? ive seen meteors at night and they burn up long before getting to where i last saw it, and it was still light outside. i would think at the altitude i last saw it, it either recovered out of my visual range or it hit the ground on the west side of genoa peak or into lake tahoe on nevada side."],"Latitude":"39.129456","Tags":"City","Log Number":"US-11222011-0002","Sighting Duration":"Undisclosed","Date of the Event":"11/20/2011 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.129456,+-120.013526(33535)&iwloc=A&hl=en\"> mufon case (33535) map </A>","Disposition":"Unknown","City":"Lake Tahoe Ca/Nv","Object Features":"Other, Unknown","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change,Other"}