{"Disposition":"Insufficient Data","Weather Factors":"Unknown","Longitude":"-81.823016","Object Features":"None","Country":"United States","Log Number":"US-11212011-0017","Tags":"City","Case Number":"33530","Latitude":"26.452559","Object Flight Path":"Straight-line path","Date of the Event":"07/17/2006 02:30 UTC","Region":"Florida","Summary":"Large green orb, 4 ft. in diameter, skirted straight across the top of my roof","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around July 17th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.452559,+-81.823016(33530)&iwloc=A&hl=en\"> mufon case (33530) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/33530.html.txt","/var/www/straped/mufon/org/33530.html"],"Object Shape":"Sphere","Date Submitted":"11/21/2011 09:14 UTC","Source":"MUFON","divs":["Sighting DetailsI couldn't sleep. Went out and into my screened lanai, facing South and peering upward into the night sky when I saw an object just to my right at the end peak of my roof. It was a perfect green sphere, about 4 feet in diameter, dull in that it wasn't overly shocking to look at, but the green color was a vibrant, almost neon-like bright green. It traveled from the South end of my roof in a straight even direction, \"hugging the peak\" until it disappeared out of my view as it headed to the other end of the roof. It traveled slow at first then sped up in the last second it was in my view. The distance I was able to watch it travel was approximately 20ft., maybe a little less. I was also approximately 20ft. from the object. I ran through the house and out the front door to see if it continued to travel or had hit my neighbor's house. It was gone. I thought for a brief moment it could have been \"space junk,\" a meteor. But it didn't add up. No tail, it was flying perfectly straight, it was such a strange green color, and if it were \"space junk\" at the straight level it was traveling along my roof it would have hit the South end of my neighbor's house which sits higher than mine when it disappeared out of my view. On the same note, it would have had to clear the roof of the house next to mine on the South end of my property because it also sits higher than my house. I still can't explain it and I still go out often to check my roof line, and every year in July to see if it happens again. I have researched green orbs since but find either hokey video or stories that really don't sound truthful. I had an experience at 12 years old when I lived near Langley AFB that I can't explain to this day either. For a brief moment, as odd as it sounds, I thought that \"they\" found me and were checking on me. Honestly, when I couldn't make sense of the green orb intelligently and scientifically, that's truly what I thought. Okay, I know that sounds really out there, but I know what I experienced back in 1977 and I know what I saw July 17th of 2006. Just unexplainable."],"Viewing Distance":"20 Feet or Less","City":"Fort Myers"}