{"Summary":"Matched gray, clouded sky, dead silent, dead slow, virtually invisible","Latitude":"39.321539","map":"<A HREF = \"http://maps.google.com/maps?q=39.321539,+-84.589856(33547)&iwloc=A&hl=en\"> mufon case (33547) map </A>","Weather Factors":"None","Log Number":"US-11232011-0001","Longitude":"-84.589856","Object Shape":"Square, Rectagular","Region":"Ohio","Date of the Event":"06/10/1983 06:00 UTC","Object Features":"None","Source":"MUFON","Tags":"City","Disposition":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy friend and I were traveling in his car, and I, then he, spotted something approaching us from the left (north), and he pulled over and parked the car (residential area), and we got out and witnessed this object, which was barely visible in the low cloud ceiling So. Ohio gloomy sky. It practically matched the sky color, and was dead silent, dead slow, and big! It was a little less than half a football field long (100+ ft), and about 60 feet wide in kind of an oval rectangular shape. We both looked at each other and affirmed that we were both seeing it. It passed on over a nearly two minute, ultra slow pass over us, and the 400ft long open field to the south of the car and us. We spent some time discussing whether or not it could have been some Right-patt AFB (Dayton, Oh) skunk work craft, or extra-terrestrial in origin. I concluded that it was beyond our capacity to have a craft like that, so I am convinced that it was E.T. in nature. We never spoke about it to very many folks, and most of those were our age, and dismissed it without thinking we were crazy, but we have never made serious reports about it. He still remembers it like yesterday, as do I. It would probably require a hypnosis or such to extract the actual date. This took place about 4 miles North of our homes. I do not know what the upper profile of it was, because the bottom side which we saw was flat in appearance, and the degree to which it blended in with the sky made us unable to see any \"thickness\" as it approached, as well as after it was past being above us."],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/33547.html.txt","/var/www/straped/mufon/org/33547.html"],"City":"Cincinnati","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around June 10th 1983"],"Case Number":"33547","Viewing Distance":"101-500 Feet","Date Submitted":"11/23/2011 12:48 UTC","Country":"United States"}