{"Log Number":"US-11222011-0011","files":["/var/www/straped/mufon/html2text/33545.html.txt","/var/www/straped/mufon/more/33545_submitter_file1__DSC_1669.JPG","/var/www/straped/mufon/more/33545_submitter_file2__DSC_1686.JPG","/var/www/straped/mufon/more/33545_submitter_file3__DSC_1686a.jpg","/var/www/straped/mufon/org/33545.html"],"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around November 18th 2011","This sighting has been favorited 1 time.",""],"Latitude":"35.058945","Case Number":"33545","Longitude":"-106.515374","Weather Factors":"Unknown","City":"Albuquerque","Disposition":"Unknown","Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=35.058945,+-106.515374(33545)&iwloc=A&hl=en\"> mufon case (33545) map </A>","Tags":"City","Object Flight Path":"Path with directional change,Other","Viewing Distance":"Unknown","Date Submitted":"11/22/2011 09:03 UTC","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"11/18/2011 12:00 UTC","Summary":"Bouncing lights in the sky while watching Leonid metor shower","Source":"MUFON","divs":["Sighting DetailsI wanted to see if I could capture some photo's of the Leonid Meteor shower so I went to the end of a dark road which falls at the fence of Kirtland Air Force Base. I set up my camera and immediately noticed a \"star\" traveling from East to West at an exceptionally fast rate. All of a sudden it changed direction (to NE), I thought it was a plane at first, then realized it was traveling at a VERY high rate of speed. All of a sudden, it stopped and began bouncing around in the sky. The second \"UFO\" that I witnessed was mistaken for Mars until it began bouncing around in the sky as well. This is not the first time I have witnessed this. In June of this year myself, a friend, and her 12 year old daughter watched something bounce all over the place in the sky for more than an hour and a half. I have audio of that event (just our conversation and reactions). I have seen this a total of three times since June of 2011. The first time I witnessed these \"stars\" bouncing around in the sky I felt immediately awestruck, excited, and was in dis-belief that I was watching this happen. Then my excitement turned to fear, and eventually I was grateful to have seen what I saw. Following that sighting I was constantly looking to the night sky to see if I would witness another \"UFO\". I eventually stopped obsessing over it because it seemed like it wasn't going to happen. Then, a few months later I saw another one and was excited that it happened again and that I could show the \"proof\" to my friend who was skeptical of my first account. When I witnessed the same thing the other day I was very calm and determined to finally get some \"proof\" with my camera. All of these events cause me to have a slight fear of \"What if they know I'm watching and do something to me\", but I don't feel that I am in any kind of danger. I figure if something were going to happen to me it would have happened by now. I'm very intrigued, and just wonder what it is that is happening and what they are doing. *I have audio from the very first sighting if you are interested to hear it. It mostly has the reactions that my friend, her daughter and I were having while watching the \"star\" bounce around and change colors. *I have more pictures to submit if you are interested. They are just copies of the photo's but zoomed in and cropped."],"Country":"United States"}