{"Region":"Indiana","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around November 19th 2011"],"Country":"United States","Latitude":"41.058511","Disposition":"Hoax","Object Features":"Unknown","City":"Fort Wayne","Longitude":"-85.141206","Weather Factors":"Unknown","divs":["Sighting Details I had recently traveled to Fort Wayne (IN) to visit my cousin. after visiting a day he decided to take me to go the embassy theater. about a halve hour in to it i decided i needed a smoke break. I got out side and realized i left my smokes in the car a couple blocks away. the location i have yet to determine without the help of my cousin witch i have hid this from because he would not believe me if i did. I got in the car and checked the time 11:29 i lit my sig and proceeded to smoke when instantly a dark ominous shadow covered my car and the cars around me i tried to look up when instantly i froze unable to move or speak this happened until 11 34 i know because i could see the clock when i had the sensation of being moved i was pulled up strait through the car roof and in to this black mass some thirty feet in the air when i got to the black mass every thing went black for what seemed like an eternity when finally i could see these four legged creaters in black suites ripping my cloths i couldn't move on my own nor could i speak so i laid their hopeless when that was over o couple bigger ones cam in the room to look me over with hand held electronic devises they talked to each other in some weird language for a couple minuets before one looked at me with its big shiny black eyes and staired at me and spoke to me through my mind saying there there don't be scared we do not seek to hurt you only study you know go on and stay healthy we may have use for you yet right then i was in my car and it was 11:37 in have since awoke frozen and then blacked out every night since"],"Date of the Event":"11/19/2011 11:23 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.058511,+-85.141206(33541)&iwloc=A&hl=en\"> mufon case (33541) map </A>","Case Number":"33541","Log Number":"US-11222011-0007","Date Submitted":"11/22/2011 04:29 UTC","Viewing Distance":"21-100 Feet","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/33541.html.txt","/var/www/straped/mufon/org/33541.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"visiting cousin went to see show came out for a smoke brake got in car dark shadow over hovered over car i froze and was ubducted","Object Flight Path":"Unknown"}