{"Latitude":"33.972692","Case Number":"33552","Date of the Event":"11/12/2011 10:00 UTC","City":"Whittier","files":["/var/www/straped/mufon/html2text/33552.html.txt","/var/www/straped/mufon/org/33552.html"],"Disposition":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Other","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Date Submitted":"11/23/2011 07:50 UTC","Summary":"saw a translucent large shoe sole shaped posibly a biological? craft that traveled east to west","Object Features":"Patterned Surface, Other, Unknown","Sighting Duration":"Undisclosed","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.972692,+-118.01758(33552)&iwloc=A&hl=en\"> mufon case (33552) map </A>","Longitude":"-118.01758","Country":"United States","divs":["Sighting DetailsHi! Wow! I was dumping trash at 10pm pst. Just after it had briefly rained. I noticed a bright full or nearly full moon above. Just admiring the moon and the multitude of visible stars. As I looked straight up slightly east towards moon. My right eye caught an object flying higher than a small plane, much larger too. But below where high flying jets always approach LAX all the time. I lived here 30 years. Always looking for this shooting stars etc. This was NOT FROM THiS Earth! Not an airplane. Looked like a type of luminous jelly fish. Translucent. Perhaps the bright moon light covered this ufo with enough reflection to see what might not have been visible otherwise. I grabbed my cellphone, but fumbled trying to get a picture dammit! Im hoping someone else saw it too. It flew like a wavy butterfly but east to west very fast. Although it looked like it was just floating without effort. Like a jelly fish or butterfly. I searched the net for similar sightings. Found none quite like the one I saw. It could have been saucer shaped but the aura made it appear alive! Or lifelike. Im 60 years old and in excellent health and have great vision. No mistake. I was shook up for the next few days alot. Every night I'd go out prepared with camera and scope. Nothing since. It was so real and unearthly. Again on november 12 2011 pst 10 pm sharp. G.A. Calif."],"trends":["There have been 27 other sightings in Whittier","There were no other sightings in Whittier on or around November 12th 2011"],"Log Number":"US-11232011-0006","Object Shape":"Oval, Other"}