{"Date of the Event":"11/10/1970 03:30 UTC","Latitude":"40.572139","Region":"Illinois","divs":["Sighting DetailsI was a Security Officer on duty at the Pekin High School East Campus building on the hill. I was sitting on the bench by the entranceway which was glass doors and large windows,eating my lunch,around 3:30 AM when I looked out to the parking lot and noticed that one of the pole lights was larger than the rest.I thought that's weird.I thought that I would get a closer look so I laid my sandwich down and stepped up to the glass door.My breath started fogging up the glass making it harder to see the light so I opened the door and stepped outside while holding the door so that it would not close and lock me out.Immediately I noticed how quiet it was outside,the only sounds that I could hear was the sparse traffic on the main road below the hill.As I watched the light it began to dim out then was suddenly replaced by 4 or 5 large lights,like this,.....,and they started to pulsate in random order.I was shocked and thrilled because I recognized it ,to me,as a UFO and I was saddened because I had not investigated it closer as soon as I saw it.The red lights,as one,started silently moving to the left.I assumed it went behind some trees because it seemed that I could see branches between me an the lights.All of a sudden the lights were gone,no where to be seen,I looked all around moving my head.I was excited the rest of my shift,(3rd)and I was anxious? because I thought they would come into the building and I did not know what I would do.I reported it to my higher up,Cady,LT. and afterwards all the other officers laughed at me and made fun of me,on duty,boy was I mad at them."],"Weather Factors":"Unknown","Tags":"City","Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path,Straight-line path","City":"Pekin","Sighting Duration":"00:10:30","Log Number":"US-11232011-0005","Summary":"Large white,solid light dimmed out to be replaced by 4 or5 pulsating red lights.","Source":"MUFON","Longitude":"-89.637328","Disposition":"Unresolved","Object Shape":"Oval, Sphere, Unknown","Case Number":"33551","files":["/var/www/straped/mufon/html2text/33551.html.txt","/var/www/straped/mufon/org/33551.html"],"Object Features":"Unknown","Date Submitted":"11/23/2011 07:39 UTC","Country":"United States","trends":["There have been 7 other sightings in Pekin","There were no other sightings in Pekin on or around November 10th 1970"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.572139,+-89.637328(33551)&iwloc=A&hl=en\"> mufon case (33551) map </A>"}