{"Date of the Event":"11/23/2011 07:00 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Covington","Source":"MUFON","Summary":"Appeared to be a flaming object, but was not","files":["/var/www/straped/mufon/html2text/33565.html.txt","/var/www/straped/mufon/org/33565.html"],"Longitude":"-122.107883","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"33565","Log Number":"US-11232011-0019","Date Submitted":"11/23/2011 11:52 UTC","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsHappened to glance out the front window and saw an orangish object in the sky. Was not an airplane, or any other object I have ever seen. Went outside to get a better look. Appeared to be \"flaming\". Don't know how else to describe it, but it was not flaming like a meteor or something on fire. The object was above the tall trees, below a heavy cloud cover. The shape was somewhat squarish, and the best description I could give was it looked like a paper bag on fire floating in the sky, but the fire did not consume whatever the object was. I could see 4 or 5 reddish lines eminating from the center of the object to the rear. Wish I had had a pair of binoculars handy! It was very quiet and seemed to \"drift\" across the sky in a northerly direction. It most appeared like a scrap of paper one might see coming from a chimney, in color and the way it seemed to float, but was definitely not anything I have ever seen in my 56 years! It did not perform and acrobatics or zoom away and was alone....did not see any other aircraft in the sky. As far as my feelings, I was curious to see what it might be, but was not afraid in any way...it had a peaceful feeling to it....did not appear threatening in any way. I lost sight of the object as it went behind tall trees to the northeast. If I had been thinking I would have grabbed my cell phone and attempted to photograph."],"Object Flight Path":"Straight-line path","Latitude":"47.364198","Region":"Washington","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=47.364198,+-122.107883(33565)&iwloc=A&hl=en\"> mufon case (33565) map </A>","trends":["There has been one other sighting in Covington","There were no other sightings in Covington on or around November 23rd 2011"],"Disposition":"Unresolved","Object Features":"Undisclosed"}