{"Object Shape":"Circle, Cylinder, Disc, Oval","divs":["sighting detailsi was looking out my window towards the south\\south east sky when i noticed lights in the sky that seemed to be an airplane to me. after watching it for a few minutes i realized it was not an airplane or helicopter...this was approx 1:30 am est. as i watched it more, it would move up, move down, very quickly and precisely. it would hover, it was high up in the sky. after watching it for awhile i ran outside with a pair of binoculars to try to get a better visual on it. it seemed to be moving farther away from my sight. as i went outside to watch it i couldn't find it. so i went back inside to the window i was watching it from and it was still there, so after getting my bearings back down on where to look, i went back outside. as i looked up, it took off...as in, there was a streak of light, almost like a shooting start, but this was a straight path across the night sky. it went right across orions belt heading west. at that point i knew it was to be an unknown flying object. i like to look up at the night sky, and on clear nights like these you can see a lot of the stars. this is not the first time i had observed a ufo in the sky. i was just laying in bed watching tv and looked out the window when i noticed the strange lights. it appeared to me it was very high up in the sky, and after watching it make its maneuvers i realized it was not an airplane or helicopter. i was excited to see it in the sky and just watched it. this is not the first time i have seen objects in the sky that display this type of behavior."],"Weather Factors":"Unknown","Latitude":"41.087075","Object Flight Path":"Stationary,Other","Disposition":"Unresolved","Log Number":"US-11242011-0003","map":"<A HREF = \"http://maps.google.com/maps?q=41.087075,+-81.515325(33568)&iwloc=A&hl=en\"> mufon case (33568) map </A>","Tags":"City","Country":"United States","Date Submitted":"11/24/2011 02:35 UTC","Viewing Distance":"Over One Mile","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around November 24th 2011"],"Date of the Event":"11/24/2011 01:20 UTC","Case Number":"33568","Region":"Ohio","City":"Akron","Longitude":"-81.515325","Object Features":"Unknown","Sighting Duration":"Undisclosed","Summary":"Object in sky, watched it hover and zig zag some, then it left","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33568.html.txt","/var/www/straped/mufon/org/33568.html"]}