{"City":"Main Beach","Country":"Australia","trends":["There have been no other sightings in Main Beach","This sighting has never been favorited."],"Viewing Distance":"Unknown","Case Number":"3357","Longitude":"153.426912","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=-27.965038,+153.426912(3357)&iwloc=A&hl=en\"> mufon case (3357) map </A>","Latitude":"-27.965038","Object Features":"Undisclosed","Tags":"City","Date of the Event":"03/20/2005 02:38 UTC","Region":"Queensland","divs":["Sighting DetailsSighting Report: it was in september of 1990 i was 12 years old and living in a country town in australia called ORANGE. it was a cold clear night crisp as i had my window open and the doonar tight around me. i was laying in bed looking out to the east through my bedroom window. it was aproximately 10.00 pm. i had just turned off my television. and i saw a small light about half the size of my pinky nail at armslength. i thought it was a star or the moon. but it then started moving which i could tell against the stars. it began slowly moving, no flashing lights at that point, towards the north in a fairly level path about 2ft at armslength. thinking it was a plane i was shocked when the object stopped moving. i began to get frightenedand pulled the doonar up higher. i watched it stand still for a good 2-3 minutes. then it began to fade into other colours red and blue and white yellow green. it then began to move again in an erratic manner able to move the whole length of my window 6ft in a half a second it went up to the left then made a 45 degree sharp fall to theground. it slowly then moved behind my trres in theback yard and then shot back into my feild of vision. i watched this arobatic exhibition for a total of 10 mins untill it stopped hovered and then sped at an intense rateand shot out of my field of vision in an instant leaving upwards. that is not the end of it. waiting in anticipation everynight for a week, it was not a month later that i saw a similar object out my window again. this time it was larger and flew alot more slowly almost purposely over the horison. when it stoppped i became paranoid that it was watching me. and this was only heightened when i saw alight grow more intense from the base of the object it stood in position for a short time 2 mins the light turned off and then the object zipped into the air and out of sight as before. the story doesnt end there years later a friend and myself go to a psychic to get a reading. both of us skeptical ask for some proof of her fortelling she tells me about my psudenym \"RAOUL\" the name i use when i write any creative works (in honour of the late great hunter s thompson, raoul duke) but she also tells me of my ufo encounters and tells me exactly where i saw it and on the dates. she also tells me that i will have an encounter whilst driving, cant wait. both encounters happened on clear cold nights. both times the object moved in erattic patterns at speeds too fast for conventional aircraft helicopters and jets alike. there is no airport trafic in that part of the country. and the lack of blinking lits also points to it not being convetional craft."],"Disposition":"Unresolved","Summary":"Not Provided","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"03/20/2005 02:38 UTC","Object Shape":"Undisclosed","Object Flight Path":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3357.html.txt","/var/www/straped/mufon/org/3357.html"]}