{"Sighting Duration":"Undisclosed","City":"Newark","Log Number":"US-11242011-0014","Region":"Ohio","Latitude":"40.047098","Summary":"glowing red/orange square with rounded edges with small tail. Brief contrail","Object Features":"None","Object Flight Path":"Straight-line path","Case Number":"33580","Date of the Event":"11/10/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.047098,+-82.472682(33580)&iwloc=A&hl=en\"> mufon case (33580) map </A>","Object Shape":"Oval, Square, Rectagular","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33580.html.txt","/var/www/straped/mufon/org/33580.html"],"Tags":"City","trends":["There have been 16 other sightings in Newark","There were no other sightings in Newark on or around November 10th 2011"],"Weather Factors":"Unknown","Source":"MUFON","Longitude":"-82.472682","divs":["sighting detailswas standing outside with wife while she talked to neighbor. was looking up at sky like usual and actually saw it come into atmosphere(best i can describe)it showed up as if out of nowhere leaving a short\\brief contrail as it apparently entered atmosphere. it was square\\rectanglular but with rounded edges. it glowed a briliant red\\orange. this happened around 6:00 pm still very much light outside. it had a very small tail on it(i assumed it was a tail cuz it was in the back of the direction it traveled)the apparent tail could have just been part of craft as there was no diff in color and could see no distinction between tail and craft. after watching in amazement for maybe 45secs i pulled out my phone and snapped two pics then watched it until i could nolonger see it(about another minute and a half) it traveled in a straight line across the sky. after it had gone i looked at my pics and there was nothing on them. i do not believe it was a meteor or any kind of space debris nor was it a plane or helicopter. i live close to a small airport and see planes and heli's all day(as well as hear them)there was a small plane in the sky to the west of it and this thing was at least 5times the size of the plane.it was traveling from west to east away from plane. whoever was flying plane must have seen it."],"Date Submitted":"11/24/2011 10:46 UTC","Country":"United States","Viewing Distance":"Unknown"}