{"trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around November 23rd 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.43311,+-111.933575(33586)&iwloc=A&hl=en\"> mufon case (33586) map </A>","Object Shape":"Sphere","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33586.html.txt","/var/www/straped/mufon/org/33586.html"],"Disposition":"Unresolved","Date of the Event":"11/23/2011 09:15 UTC","Summary":"10 glowing red orbs move east to west","Longitude":"-111.933575","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"11/25/2011 01:22 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy friend called me at 9:40 p.m. last night from his house just north of Highway 60 in Tempe after seeing the first of these objects. He and his buddy were in the back yard having cigars when they noticed the first light. He described seeing a single glowing red light (like a red lantern) moving low across the sky in a very direct west to east path. They had no idea what they were seeing. The object was definitely not a commercial airliner since it 1) had no blinking navigation lights and 2) was not following the take-off pattern of the other planes that were in clear view. By the time he called me, he and his friend had watched a total of five \"orbs\" move across the sky in a period of about 25 minutes (some as singles, others in pairs). As we were talking on the phone, he exclaimed that he was seeing another trek across the sky and told me in what direction to look. I live about 3 miles to the north and west of him and could not see what he was describing. I jumped in my car and drove to his house. Upon arriving at 10:05, he ushered me through the house to the back yard and we were standing there no longer than 5 seconds before he looked up and said, \"THERE!\" Sure enough, a group of three of these glowing red orbs was moving in the same west to east path that they had watched the last six cross. I was stunned and immediately agreed that they looked like red lanterns. Their color and brightness were unwavering and they made absolutely no noise. I could not believe how large they appeared as they had to be very close--it even seemed they could have been flying directly above Highway 60 and at less than 1000 feet. As they moved farther east, my friend said, \"LOOK!\" and we saw a fourth coming from the west, following the others far behind. Then my friend said, \"Now watch, as they get far enough east, they flicker and then vanish.\" I watched in astonishment as each of the three in the first group, one by one, flickered out and then the fourth did the same when it reached the equivalent position in the sky. It did not appear that they flew behind clouds (as there were fewer last night than tonight) and that they had not disappeared beyond the horizon (they would have had to have traveled a much greater distance at that speed to go beyond the horizon). My friend (who knows planes) said that they appeared to be moving \"at about the speed of a Cessna 150\". Unfortunately, we could not get an accurate idea of the actual shape of the objects due to the glowing. My friend said the whole event made the hairs on the back of his neck stand up. I cannot say the same since I was just shocked at viewing the four that I did. If I had also stood there and watched the whole procession or had seen more come, I would have been equally creeped out. I did manage to get video footage on my iPhone but I have not downloaded it yet and I will have to edit the audio before posting it (thanks to the many expletives delivered by yours truly). The thought did cross our minds while watching, \"are we being invaded???\" After waiting for over an hour, we never saw another orb. We find it hard to believe that no one else saw the objects because they were so obvious in the sky. Just before making this post, I read a VERY similar account of a sighting TONIGHT from a witness nearby in Chandler. I cannot help but think that it could be the very same thing."],"Region":"Arizona","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Tempe","Object Features":"Unknown","Case Number":"33586","Latitude":"33.43311","Log Number":"US-11252011-0004","Country":"United States"}