{"Latitude":"26.129751","Tags":"City","Object Shape":"Circle, Fireball","Date Submitted":"11/25/2011 01:42 UTC","Date of the Event":"11/24/2011 06:25 UTC","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-80.317205","Object Features":"Unknown","divs":["Sighting DetailsThanksgiving evening. I received a phone call from a friend at 1825 ET. I get poor reception from Verizon on my cell phone in the house so I went outside to my driveway to talk. It was dark but the sky was clear. Looking to the Northwest approximately 30 degrees or so above the horizon I noticed a bright orange glowing light. It was probably the size of a couple of stars put together, or of an aircraft landing light in the distance. I watched it for a few seconds because it was not the color of an aircraft landing light. I also looked for strobe lights or aircraft navigation lights. THere were none. I have seen the space shuttle take off from my house near Ft. Lauderdale and I'd characterize the light as similar but this was orange, not white. The light moved across the sky and I ran to the door to the house to call my friend. He came out and we both watched it as it moved to the South. The light then seemed to hover in place on a magnetic heading of approximately 200 degrees. THe light then seemed to fade away as if it were moving off now directly away from us. I asked my friend if he thought it could be an afterburner from a fighter. He didn't think so because it was orange, not white. I would have to agree because it seems that an afterburner would not be visible if the aircraft was moving horizontally across one's field of vision. it would have to be flying away, especially as far away as the light seemed to be. I went back in the house. At 1842, just 17 minutes later, my friend called me back and I went back outside. It was bizzare but there was another orange fireball like thing in the same place moving in the same direction. This time I called for more of my guests and my wife, sister-in-law, and friend all came out. They all saw it and we watched it do the same thing as the previous one. Each even probably lasted about a minute or so. I should note that I am a 747 Captain for a major U.S. airline. I have been flying for 35 years and I have never witnessed anything like this. The lights were not aircraft lights. If anything this looked more like a very bright propulsion system or rocket exhaust but way off in the distance, thought it was very orange and circular. There was no contrail or exhaust trail, just a glowing orange ball. On both occasions we lost sight of the objects when they appeared to either change direction and fly directly away from us, or they just faded out, not sure which due to the distance."],"City":"Plantation","Log Number":"US-11252011-0006","Region":"Florida","Weather Factors":"None","Summary":"Orange like pulsing light moved across sky, hovered, then appeared to fade off into the distance. Seventeen minutes later another light flew almost the identical flight path and did the same thing.","trends":["There have been 6 other sightings in Plantation","There were no other sightings in Plantation on or around November 24th 2011"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.129751,+-80.317205(33588)&iwloc=A&hl=en\"> mufon case (33588) map </A>","Case Number":"33588","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33588.html.txt","/var/www/straped/mufon/org/33588.html"],"Country":"United States"}