{"Log Number":"US-11252011-0003","Weather Factors":"Unknown","Date of the Event":"11/04/2011 11:00 UTC","Object Shape":"Boomerang, Triangle","Case Number":"33585","Object Flight Path":"Hovering then path","Object Features":"Patterned Surface, Wings","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=44.27697,+-121.165321(33585)&iwloc=A&hl=en\"> mufon case (33585) map </A>","Viewing Distance":"101-500 Feet","Tags":"City","Summary":"Triangle with three blue ring lights in the body with a red light on right wing and a white light on the left wing.","files":["/var/www/straped/mufon/html2text/33585.html.txt","/var/www/straped/mufon/org/33585.html"],"trends":["There have been 4 other sightings in Redmond","There were no other sightings in Redmond on or around November 4th 2011"],"divs":["Sighting DetailsI was driving along highway 97, a two lane highway, in Eastern Oregon near Redmond late at night, around 11 or 12pm, when I saw a hovering light in the distance that looked at first like a plane. As a drove closer I could tell that it either was not moving or was moving towards me at a snails pace. The craft was off to the left hand side of the road 50 to 100 feet and up a few hundred feet off of the ground. It was hovering above a small grouping of trees. It was triangular shaped with a round-point nose, wings that cut off at the tip at about a 75 degree angle, with a boomerang style rear, as it cut in a bit into the body of the craft. There was some sort of patterning on the wings, perhaps paneling or seams but they protruded enough to cast shadows by its lights, making the pattern look to sit off of the body of the craft an inch or two. There were three blue ring lights arranged like the finger holes on a bowling ball, one at the tip and then two behind that one, they took up the majority of the body of the craft. Toward the end of the wings there was a white light on one side and a red light on the other. It was approximately the size of the average three bedroom, 50's ranch style house, or smaller, with the wing span wider than it was long. The craft hovered there as I drove by it and as I watched for it in the rear view mirror I saw it slowly move to the other side of the highway, so slow I could barely tell it had moved except for that it was on the opposite side of the highway. I stopped watching after that so I don't know the rest of it's path."],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Longitude":"-121.165321","Source":"MUFON","Latitude":"44.27697","Country":"United States","City":"Redmond","Date Submitted":"11/25/2011 12:51 UTC"}