{"Summary":"Leaving my brother's Thanksgiving, saw lights fly across night sky under clouds.","Latitude":"33.3139","map":"<A HREF = \"http://maps.google.com/maps?q=33.3139,+-111.83311(33582)&iwloc=A&hl=en\"> mufon case (33582) map </A>","Case Number":"33582","Log Number":"US-11242011-0016","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Teardrop","City":"Chandler","Tags":"City","Longitude":"-111.83311","divs":["Sighting DetailsOn the evening of November 24, 2011 I was walking to my car after visiting with my brother and his family. I looked up at the sky and noticed there was an orange tear drop shape crossing the sky. My brother and fiance both took notice and we watched as it crossed. My older brother is a retired Air Force technician who worked with A-10's and was skeptical at first. We looked for any form of landing or caution lights but saw none. The first object was moving across the sky from what appeared west-to-east and then shot off into the distance. Soon after, another object of same color and shape appeared along the same flight path. It was bright orange and looked almost like a comet. It followed what, from the ground, appeared to be the same path. As we watched, a group of people in a car pulled over to ask us if we saw the same thing. We answered that we were just then looking at it. We watched until it disappeared into the horizon. It hooked up into the sky, but seemed to fade into the distance as if it was going beyond our view. There was no sound and no trail that we could see. We did witness it flying what looked to be parallel to the clouds before they went through them. The clouds did lighten with the orange color. We didn't observe any pulsing or fluctuations. It was just a fuzzy solid orange. My fiance said she thought the top had two solid red lights with an orange bottom. However, I did not notice a difference. I took incredibly poor quality video with my phone, but need to send it to my e-mail to notice if I caught anything."],"Object Flight Path":"Straight-line path","Date Submitted":"11/24/2011 11:25 UTC","Date of the Event":"11/24/2011 08:45 UTC","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/33582.html.txt","/var/www/straped/mufon/org/33582.html"],"Region":"Arizona","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around November 24th 2011"],"Country":"United States"}