{"Latitude":"33.063525","Sighting Duration":"Undisclosed","Log Number":"US-11252011-0007","files":["/var/www/straped/mufon/html2text/33589.html.txt","/var/www/straped/mufon/org/33589.html"],"trends":["There have been 33 other sightings in Maricopa","There was one other sighting in Maricopa on or around November 23rd 2011"],"Weather Factors":"Unknown","Tags":"City","Disposition":"Unknown","Country":"United States","Region":"Arizona","Viewing Distance":"Unknown","City":"Maricopa","Source":"MUFON","divs":["sighting detailssighting date revised to 11\\23\\11. all other info is correct. we were watching a movie in the living room with the window blinds and back door still open. at approx. 10:45pm, while seated, my mother witnessed through the window a glowing orange fireball above the neighbor's roof. it appeared to be about the size of a full moon, but was too low and disappeared quickly. she ran outside to investigate and found it had moved far to the east, and was now about the size of a nickel held at arm's length. i did not see the initial fireball, but followed her outside directly because her reaction seemed so unusual. within seconds i observed the orange object to be aspirin sized at arm's length and moving quickly away from us in an easterly direction. within moments the object diminished in size until we could no longer see it. it appeared to be moving at a high rate of speed. we heard no sound. the entire event took 60-90 seconds. mom noticed it because it was bright, oddly out of place, and moving too quickly. it may be of note that we saw at least one helicopter in our field of view after the light disappeared, but the helicopter was easily identifiable and moving in a different direction. we are curious to know if anyone else saw this object."],"Case Number":"33589","Object Features":"None","Summary":"Maricopa Sighting Date Revised to 11/23/11.","Object Flight Path":"Straight-line path","Date Submitted":"11/25/2011 03:51 UTC","Longitude":"-112.023404","Date of the Event":"11/23/2011 10:45 UTC","Object Shape":"Circle, Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=33.063525,+-112.023404(33589)&iwloc=A&hl=en\"> mufon case (33589) map </A>"}