{"divs":["Sighting DetailsSighting Report: I m not sure what exact month it was..between Jan 1992 - June 1992. I know I was moving into my new house in Phoenix from California. My boyfriend at the time and myself were driving two cars full of personal items from California to Phoenix. We were traveling on Interstate 10 - near the Chuckwalla Prison (I remember do not pick up hitch-hikers signs)between 1:30-2:20 am. I remember seeing pretty bright-white lights up ahead, and though a plane was flying directly at me. They were very low, so I kept my eye on them. I was a pilot before, and I have an interest in all types of planes. Oddly, as I kept driving these lights didn t pass me - they just slowly got bigger. It probably took me 20 minutes or so to come up to them and by this point I was very intrigued as to why a plane heading TOWARD me could take so long - I thought it was flying sooo slow. As I came right up to it, it was very very close to the right side of the freeway. I pulled my car over to the shoulder and my boyfriend followed behind me. I didn t see another car coming or going for over an hour. We were parked in the dirt and I was looking out my windshield at this \"plane\", and it was very unusual. It seemed to be a flat or matte black color, and the shape was most like a triangle. It didn t have \"wings\" per se. The lights were white - no color. There were multiple lights, but I don t know how many. It was hoovering perfectly at around 200 feet off the ground. It was the size of a medium to larger jet. Except it was all plane - no wings. I looked for markings, doors or windows and I saw none. I was looking pretty straight up though..so I saw mostly the bottom of the craft. I still didn t think anything other than \"USAF\", but to get a better view I decided to open my \"moonroof\" up. Then I could really see well. I was looking some more..maybe 20-30 seconds when I suddenly realized that I heard a cricket...silence greeted my open moonroof. I then immediately looked down at the ground to see if there was any displacement of dirt (like a Harrier jet will do)...none. Dead silence and nothing. I couldn t wrap my brain arounf this and I think I got scared and didn t know what the heck this was. I think I went into a kind of shock, as I immediately put my car in gear and RACED away from there. 10 minutes later I pulled over at the next rest stop, by the Prison so I could ask my boyfriend (who followed me away) what he thought. We were both in shock, but he described exactly the same sighting...and asked me why I drove away? To this day I wished I had been braver, but my brain said RUN! What craft can do this?? Wish I knew."],"Region":"Arizona","Log Number":"","files":["/var/www/straped/mufon/html2text/3359.html.txt","/var/www/straped/mufon/org/3359.html"],"Object Features":"None","Weather Factors":"None","Source":"MUFON","Country":"United States","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.455557,+-112.072877(3359)&iwloc=A&hl=en\"> mufon case (3359) map </A>","Date of the Event":"03/01/1992 02:00 UTC","Disposition":"Unknown","Summary":"\"Hovering\" triangular craft near Chuckwalla Valley State Prison near Blythe, CA.","Case Number":"3359","Latitude":"33.455557","Longitude":"-112.072877","Date Submitted":"03/01/1992 02:00 UTC","Object Flight Path":"Stationary","Object Shape":"Triangle","Tags":"City","City":"Phoenix","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around March 1st 1992"],"Sighting Duration":"00:30:00"}