{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.48034,+-73.454117(33594)&iwloc=A&hl=en\"> mufon case (33594) map </A>","Longitude":"-73.454117","Tags":"City","Latitude":"41.48034","Date Submitted":"11/25/2011 01:00 UTC","Object Shape":"Sphere","Weather Factors":"Unknown","trends":["There have been 2 other sightings in New Fairfield","There were no other sightings in New Fairfield on or around November 24th 2011"],"Country":"United States","divs":["sighting detailswas driving home from my parents house after thanksgiving dinner around 9:25. they live on top of a mountain overlooking the eastern part of candlewood lake. i came over a rise about 1\\3 miles from the house and saw two red lights to the southeast about 20 to 25 degrees off the horizon. i drove about another 1\\3 mile to a clearing where i had clear view to the east, south, and west. that's when i saw more clusters of red lights to the south and west. they appeared to come straight at my position from the southwest and arced to the southeast and disappeared, coming the closest about one mile from my position. there were over 15 lights in loose clusters of 3 to 4 lights per cluster moving independently from oneanother. the lights were not attached to any solid object, i could see stars between the lights. the lights were about 20 times larger than navigation lights on airplanes. i observed them for about four minutes, during that time the lights were consistent in size and shape. they didn't pulsate, flicker, change color, or make any sound.their speed was roughly about 60 to 80 mph. after about three minutes of observing i called 911 and was connected to a brookfield ct dispatcher to see if anyone else was watching the lights. he said know one has. as i was talking to the dispatcher the last cluster of four lights were passing to the south of my position. at that time a private jet passed over my head at roughly 5000 feet, traveling from the south and going north. at that time the jets engines were the only mechanical sounds i was hearing. the night was crystal clear and the temperature was about 35 degrees. visibility was excellent almost to the horizon and there was no wind."],"Object Features":"None","files":["/var/www/straped/mufon/html2text/33594.html.txt","/var/www/straped/mufon/org/33594.html"],"Disposition":"Unresolved","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Region":"Connecticut","Date of the Event":"11/24/2011 09:27 UTC","Summary":"Saw red lights to the south on Candlewood lake","Log Number":"US-11252011-0012","Case Number":"33594","City":"New Fairfield"}