{"Disposition":"Unknown","Case Number":"33593","map":"<A HREF = \"http://maps.google.com/maps?q=33.6961,+-78.884614(33593)&iwloc=A&hl=en\"> mufon case (33593) map </A>","Log Number":"US-11252011-0011","Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.6961","Date Submitted":"11/25/2011 11:22 UTC","Longitude":"-78.884614","Date of the Event":"11/13/2011 11:28 UTC","Weather Factors":"None","Object Features":"Unknown","Source":"MUFON","Summary":"Strange object with green and clear lights moving around.","Object Shape":"Square, Rectagular","divs":["Sighting DetailsOur Condo is on the Atlantic Ocean, We were in bed at 11.30 PM When we heard a helicopter circling over and around in the ocean very close by our condo, At first I thought the ocean was roaring, I said to my husband \"is that the ocean\" he replied it was a helicopter .After a few minutes, after it kept circling, I got up and pulled the drapes, all our lights were off. but I looked at the clock and it was 11.30, I then looked up and saw the green lights of a strange object, I asked my husband to come and look , I said what is that, and he said he had never seen anything that looked like that. He is a retired Army pilot,and worked for Boeing for many years as test pilot for them. There were clouds around the object and occasionally they would out, a dnwe could see better. However we cvould never see the whole thing. From what we were able to see it looked to rectangler. We observed the object for 45 minutes, from 11.30 to 12.15 Pm. We tried to take pictures but all we got was orbs , large ones. We had no missing time. WE was not excited, or anything, just curious."],"Object Flight Path":"Hovering then path","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around November 13th 2011"],"City":"Myrtle Beach","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/33593.html.txt","/var/www/straped/mufon/org/33593.html"],"Region":"South Carolina"}