{"Region":"Illinois","Date Submitted":"11/25/2011 05:00 UTC","Case Number":"33597","divs":["Sighting DetailsI was sitting out on my deck in my back yard. My 8 year old daughter was playing jump rope in the driveway and she said to me, \"mommy the stars are moving.\" I got up to look and as I turned I saw a large object with four lights that looked like stars, turn counter clockwise toward the north slightly east and release an object that looked like a round white orb. I said to my daughter you are right you did see something move. I continued to watch the small object as it moved to the southeast. It moved slowly but faster than an airplane, which I then spotted moving from east to west. At this point my mother came outside and observed the smaller object moving toward the southeast as well. My daughter saw the most of the event. After the smaller object was ejected, I lost sight of the larger object just after it released the smaller object. It was sort of trianglar shaped but had 4 lights but the 4th light was the object released. I lost track of the smaller object as it disappeared past the trees and other buildings in the neighborhood."],"City":"Chicago","files":["/var/www/straped/mufon/html2text/33597.html.txt","/var/www/straped/mufon/org/33597.html"],"Object Shape":"Star-like, Other","Sighting Duration":"00:04:00","Longitude":"-87.623058","Country":"United States","Disposition":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Summary":"Larger craft that released a smaller object.","Date of the Event":"11/15/2011 06:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.881804,+-87.623058(33597)&iwloc=A&hl=en\"> mufon case (33597) map </A>","Tags":"City","Weather Factors":"Unknown","Log Number":"US-11252011-0015","Source":"MUFON","Latitude":"41.881804","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around November 15th 2011"],"Object Features":"Appendage(s), Unknown"}