{"Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=38.904682,+-77.25602(33600)&iwloc=A&hl=en\"> mufon case (33600) map </A>","files":["/var/www/straped/mufon/html2text/33600.html.txt","/var/www/straped/mufon/org/33600.html"],"Longitude":"-77.25602","Date of the Event":"11/25/2011 06:37 UTC","Log Number":"US-11252011-0017","Sighting Duration":"Undisclosed","City":"Vienna","Object Features":"Undisclosed","Object Shape":"Triangle","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Latitude":"38.904682","divs":["sighting detailsi was walking my dog in the tysons corner area. i saw an aircraft traveling east along an unusual flight path compared to other flights in the area. many flights approach national airport over the potomac river. this seemed to be cutting across north arlington. it's not entirely unusual but it caught my attention because i pay attention to flight paths ever since 9\\11. i'm reluctant to report this because the aircraft sounded like a conventional commercial jet although possibly not as loud. this made my think it was a small jet. so why am i reporting it? the object appeared to be triangular and had a single tiny red blinking light in the middle section although not at exact center. each corner of the aircraft had two lights stacked on top of each other. there were other lights but les prominent. here is a stick figure of what the aircraft appeared like: [link moved to fi section\\cms\\tg] put lights at each corner of an object like that...with a tiny red light blinking on the bottom...and that's what it looked like. the other thing about this was that the blinking lights were not as prominent as the permanent lights. so, it created a strange effect. i'm only reporting this in case anyone else saw it more clearly and wants to know there was a second person who saw it. to explain this report, it might be easy to find out landing times at national airport. this was spotted at exactly 637pm. it was probably a conventional aircraft."],"trends":["There have been 5 other sightings in Vienna","There were no other sightings in Vienna on or around November 25th 2011"],"Disposition":"IFO","Date Submitted":"11/25/2011 07:18 UTC","Case Number":"33600","Viewing Distance":"501 Feet - 1 Mile","Summary":"Triangle Object with red blinking light. Sounded like conventional aircraft.","Object Flight Path":"Straight-line path","Country":"United States"}