{"Tags":"City","Summary":"Constant Flashing light(s) of various colors in the SE sky.","Object Flight Path":"Stationary,N/A","Sighting Duration":"Undisclosed","Log Number":"US-11262011-0001","Region":"New York","Country":"United States","City":"New York","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 25th 2011"],"Disposition":"Unresolved","Case Number":"33610","Date Submitted":"11/26/2011 12:35 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/33610.html.txt","/var/www/straped/mufon/org/33610.html"],"Object Shape":"Flash, Star-like, Unknown","Date of the Event":"11/25/2011 10:55 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-73.806503","divs":["Sighting DetailsAfter opening my front door I looked up and saw a bright light flashing or pulsating can't be sure due to distance. I am sure it was out in space. however,it does night seem like a regular star nor sun light reflecting off of a satilite. it is stationary but due to rotation of the earth it appears to move. An airplane flew across the sky during the sighting of this object and even thought this object is further away it was brighter the the lights from the plane and also other stars appear far more dull and this object is by far closer to earth than any other stars I've seen. The sighting started at 10:55pm eastern NY time on the 25th of november 2011 and ended at 12:32am eastern NY time on the 26th of november because I'm going to sleep now. Its change in color is less than a second and has various colors. I would like to have someone confirm that its a planet or star or whatever it maybe. On my iphone I used an app named digital compass for iphone, to get its location 150 degree SE. latitude- 40.6900 N longitude- 73.7986 W."],"Latitude":"40.672388","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.672388,+-73.806503(33610)&iwloc=A&hl=en\"> mufon case (33610) map </A>"}