{"Date of the Event":"11/26/2011 01:15 UTC","Summary":"8-10 blinking pattern lights moving in correlation with each other slowly","City":"West Hollywood","Tags":"City","Latitude":"34.090062","Log Number":"US-11262011-0006","map":"<A HREF = \"http://maps.google.com/maps?q=34.090062,+-118.400344(33615)&iwloc=A&hl=en\"> mufon case (33615) map </A>","Longitude":"-118.400344","Object Shape":"Circle, Sphere","Viewing Distance":"Over One Mile","Country":"United States","Case Number":"33615","Disposition":"Unresolved","Date Submitted":"11/26/2011 05:08 UTC","files":["/var/www/straped/mufon/html2text/33615.html.txt","/var/www/straped/mufon/org/33615.html"],"divs":["sighting detailsi work twice a week doing night audit at a small boutique hotel in west hollywood, ca. i was at the front desk when my valet driver called me on the radio to come out side at around 1:15am. i walked out to the front of the hotel. the valet pointed to the sky and said what is that? it was a pretty clear night for la and at first i thought he was just showing me stars or passing bye planes or a satilite. but i looked closer and i saw about 8-10 single slow moving lights\\objects moving at a steady pace through the sky. the lights where white almost florecent and blinking in a pattern. right away it reminded me of a bunch of synchronized swimmers moving in all different kinds of directions. at first i thought the lights might of been a outline to something larger but the longer i watched them the more they moved in all different directions. it looked choreographed. i have never seen any sightings before in my life and i do believe in ufo's but am sometimes skeptical. i see airplanes and helicopters all the time especially in los angeles, this was nothing like i have seen before, it was very weird. i went back in to get my camera phone but i got side tracked with a guest and bye the time i went back outside they had passed. a guest had also commented on it while he was waiting for his car and actually first noticed the objects"],"Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Path with directional change,Other","Region":"California","trends":["There have been 7 other sightings in West Hollywood","There were no other sightings in West Hollywood on or around November 26th 2011"]}