{"Source":"MUFON","Log Number":"US-11262011-0003","Case Number":"33612","Object Shape":"Blimp, Bullet, Missile, Cigar, Cylinder, Oval, Sphere","Date Submitted":"11/26/2011 12:55 UTC","Summary":"Blimp like object with two large bright circle lights. One green one white.","Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"Unknown","City":"Baltimore","Country":"United States","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around November 25th 2011"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy boyfriend and I were traveling down 1-95 from gaithersburg to BWI airport. About a mile from BWI, neat elkridge exit we noticed a bright green light on the right. The object began heading towards us and literally slowed down and passed right above our car. I got a pretty good view of it through the sunroof. It was nothing i had ever seen before. it had no wings...at frist we thought it was a helicopter until we saw it above the car. It was pretty low was quite large and had two extremely bright, large lights coming from the bottom of the object. One light was bright green and one light was white. The lights never dimmed...they just had a steady glow (almost like a search light but they did not move). we could not hear any noise coming from the object and the best way i can describe the shape is like a blimp but much larger. It was flying in a strange path, changed directions a few times and our last sighting of it was when it gaines speed very quickly and we no longer saw it. We were both in shock and have been looking for answers on the interent all night."],"Viewing Distance":"21-100 Feet, 101-500 Feet","Disposition":"Unresolved","Date of the Event":"11/25/2011 08:45 UTC","Object Features":"Undisclosed","Longitude":"-76.609249","Latitude":"39.296035","files":["/var/www/straped/mufon/html2text/33612.html.txt","/var/www/straped/mufon/org/33612.html"],"Region":"Maryland","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.296035,+-76.609249(33612)&iwloc=A&hl=en\"> mufon case (33612) map </A>"}