{"Viewing Distance":"20 Feet or Less","Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-116.416009","map":"<A HREF = \"http://maps.google.com/maps?q=38.80871,+-116.416009(33611)&iwloc=A&hl=en\"> mufon case (33611) map </A>","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsIn 1989 at spring mountain youth camp located at Mount Charleston , Las Vegas , Nevada. I was involved in a vehicle accident where the assistant basketball coach \"Joe Sadovich\" who still works there today was driving a Beige chevy Suburban. I was in the front passenger seat, \"Joe Sadovich\" was driving on the camps main road \"Ries Road\" now named \"lucky Strike\" at that time it was partial dirt road. we came around one of the last curves to the left and a Being stepped out of the forest and into the road and \"Joe\" didnt see the being and struck the being at the last minute and dragged the being half way down the road and the suburban ripped off the Left foot of this being which I will Describe later then the suburban went over the side of the mountain. luckily the suburban came to a halt slamming into a tree suspended in the air by the ROOTS of a tree beneath the suburban between the wheels. upon me climbing back up to \"ries road\" I found the foot of the being to describe this foot it was nothing I ever seen before. it had three toes with sharp TALONS black as nails i can describe more upon request. after me another person out the suburban made it to the top of the road his name was \"TODD WEST\" todd went to eldorado high school in las vegas. i believe his first name was \"Theodore\" \"Todd\" for short. as tood made it to the top of ries road he asked me what happened and I pointed at the foot and said we must have hit what ever this foot belonged to. just then we heard a noise on the cliff side of ries road. i went to look for what made the noise as it sounded like something moving in the grass area. We found a being laying on its stomach attempting to crawl away it heard me behind it and it flipped over on its back while crawling on its stomach it had a similarity of a crocodile the way the back looked and the TAIL and the MOUTH when it flipped over I saw it had 2 HUGE BREAST the size of volley balls or bigger with a pattern on it that resembled the belly of a alligator or crocodile. it was female and had appendages that were similar to humans. when it realized i was there it crawled quickly toward the nearest tree and used the tree to support itself to stand on one leg with its back against the tree. this being looked at me and todd and began to cry with a voice that would sound like a child crying for help... i realized looking at this being standing on one leg balancing itself with the tree that it must be able to communicate some way. I instructed todd to do as I did and put down the sticks we were carrying as we were no match to fight this being even with it missing its left foot up to its calf. as we put down our weapons i communicated with it pointing at its foot and putting my back to the tree and asking it to sit down because it towered over us at 7-8 feet tall. three of my fingers wasnt equal to one if its fingers. it spoke had a loud voice. and as i asked it questions it asked me questions. this story gets deeper. because as we waited for help a teacher from camp left the camp to go home and found us on the road we all approached him the teacher and asked could he help by allowing us to put the being in his vehicle and we take it to the hospital. and he refused and said he would call someone when he got to the bottom of the mountain. well when night came coach \"Joe\" had made it to the top of ries road with the remaining few kids total of 5-6 kids and Joe. and asked for us to walk back to camp and i told joe that I wanted to stay with it because I never seen anything die and i wanted to be there with her because we hit her and to leave the scene would be a hit and run. he insisted and we left as he promised to get help for her the being he hit. the next day I was called into head coach \"SNIDER\" office to meet with a man in a black suit with black hat and was told to tell him what happened as i told the story and got to the part of describing the being this person in black interrupted me and said \"It was a deer\" and I replied excuse me i was there and it was no deer and i began to describe it again and he rudely interrupted again and said, \"YES IT WAS A DEER\" mister may i remind you that you are in custody and that we can keep you till your 26 so I replied it was a deer. mad because i was incarcerated to be rehabilitated and being forced to lie about the truth..."],"Sighting Duration":"Undisclosed","Date Submitted":"11/26/2011 12:50 UTC","Latitude":"38.80871","trends":[],"files":["/var/www/straped/mufon/html2text/33611.html.txt","/var/www/straped/mufon/org/33611.html"],"Case Number":"33611","Disposition":"Unresolved","Country":"United States","City":"Undisclosed","Object Shape":"Circle, Disc, Star-like","Summary":"must talk with someone","Region":"Nevada","Date of the Event":"01/17/1989 12:00 UTC","Log Number":"US-11262011-0002"}