{"Date Submitted":"11/26/2011 06:49 UTC","Sighting Duration":"Undisclosed","divs":["sighting detailsthis way this evening nov 26th, 2011 , sighting began at 5:44 pm made note of the time when my son's mother brought the light to my attention. after leaving a movie theatre in cherry hill nj and traveling down haddonfield rd in a southern direction, my son's mom pointed out a very bright white strobing light in the sky , fairly low and fairly fast. at this hour there was plenty of other air traffic in the area with philly intl just a short distance from where we live in cherry hill. it appeared to head in our direction from the south headed north. it was very bright. based on the possible speed and height it seemed that it could be a helo or small plane. position in the skyand rough distance would have put it just above haddonfield, a short distance from where we were. the strobing white light fast and suddenly banked east then hard west again (towards philly \\ philly intl), and again fairly low in the skybased on buildings and other air traffic. after banking west, the bright white strobe went out and 2 red strobing lights came on in a position rear of where the bright white light was. the red lights were smaller and not as bright and strobed simultaneously side by side. we were thrying to track it after turning onto marlton pike, rte 70, headed west with the lights off to our left , or south of our position. road traffic was heavy so we thought it safer to pull off to try and view and headed toward park dr. along the cooper river where we last spotted the red strobing lights head wsw. after pulling off and getting out of the car, the lights were out of sight at that point, but tons of other air traffic that looked nothing like what we had just witnessed. the speed was not inexplicably fast or erratic, but definitely faster than any other air traffic that was up there. the entire sighting lasted roughly 4 mins. this is our first reported sighting in this area. we have 2 others from 2008 when we lived in chestnut hill, a philly suburb."],"Weather Factors":"Unknown","Longitude":"-75.037671","City":"Haddonfield","Source":"MUFON","trends":["There have been no other sightings in Haddonfield","This sighting has never been favorited."],"Tags":"City","Summary":"Bright Strobing Lights Change Color and Pattern As Well Changing in Flight Path","map":"<A HREF = \"http://maps.google.com/maps?q=39.891502,+-75.037671(33621)&iwloc=A&hl=en\"> mufon case (33621) map </A>","Object Features":"None","Object Flight Path":"Path with directional change","Log Number":"US-11262011-0012","Case Number":"33621","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/33621.html.txt","/var/www/straped/mufon/org/33621.html"],"Country":"United States","Viewing Distance":"Over One Mile","Latitude":"39.891502","Date of the Event":"11/26/2011 05:44 UTC","Region":"New Jersey","Disposition":"Unknown"}