{"Case Number":"33625","Disposition":"IFO","Object Flight Path":"Stationary","Summary":"It is a translucent object seen through camera, not visible by bare eyes.","Tags":"City","Date Submitted":"11/26/2011 10:02 UTC","Region":"Florida","Source":"MUFON","Log Number":"US-11262011-0016","Sighting Duration":"Undisclosed","Latitude":"28.541116","files":["/var/www/straped/mufon/html2text/33625.html.txt","/var/www/straped/mufon/more/33625_submitter_file1__Luminous-1.JPG","/var/www/straped/mufon/more/33625_submitter_file2__Luminous-2.JPG","/var/www/straped/mufon/more/33625_submitter_file3__Luminous.JPG","/var/www/straped/mufon/org/33625.html"],"Date of the Event":"11/26/2011 08:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.541116,+-81.375836(33625)&iwloc=A&hl=en\"> mufon case (33625) map </A>","Object Features":"Unknown","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around November 26th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was taking pictures of the stars above the house. I looked through the screen of my Canon SX30IS and saw something, supposedly on the lens. I looked at the area of the sky on which it appeared to be superimposed and there was nothing on the sky so I cleaned the lens of the camera with a cloth and it did not go away. Then I looked again at the sky. To my surprise, there was nothing there, but the think appeared on the screen. Thinking that this was strange, I took 3 pictures, automatically (bracketed for aperture). This is one of the pictures, the three of them are separated automatically by a few seconds and the object appears stationary. I looked again at the sky after I took the pictures and the sky continued to look clean. I continued taking photos of other parts of the sky above the roof of the house (as in the pictures) and \"the thing\" did not appear in any other picture during the night. There is no light pole on that area of the house (front) that could be seen from that angle of view. There are airplanes passing by and I have taken pictures of airplanes in \"bulb\" mode and I know how they look inn this kind of photography. I plan to take more pictures of the same spot during this week for comparison purposes. The three photos contain EXIF data that can be examined with proper software."],"Longitude":"-81.375836","City":"Orlando","Object Shape":"Cone, Unknown","Country":"United States"}