{"map":"<A HREF = \"http://maps.google.com/maps?q=40.367253,+-74.383411(33633)&iwloc=A&hl=en\"> mufon case (33633) map </A>","Region":"New Jersey","Tags":"City","Summary":"Observed a circular, oval shaped from my position object with a solid band of white lights around it. One white light was brighter than all the rest. it would randomly blink red & greenish-blue lights around the sides of it. The underside was dark.","Sighting Duration":"Undisclosed","Date of the Event":"11/27/2011 01:30 UTC","divs":["sighting detailson november 27, 2011 at 1:30 am i was getting ready to retire for the evening and went to check the back sliding door to be sure it was locked. i noticed an extremely bright white light in the western sky. larger than all the other stars. we live in a flight path so at first i though it was an airplane. the \"airplane\" did not move (did not get any closer). the object appeared to be an oval shaped disk with what appeared to be a solid band of lights around it, with one light larger and brighter than the rest. i could make out the outline of the object and the underside appeared dark, almost black in the night sky. it would randomly blink red and greenish-blue lights. every so often i would see like short beams of light coming out at an angle from the underside. like a child would draw lines around a sun to depict rays. i made two other people observe this object. i stayed up for 1 1\\2 hours observing these lights (and disk shaped object) that never moved from its position and finally went to bed at 2:40 am. it was a perfectly clear night. my reaction was at first it must be an airplane, when it never moved and i went outside to get a better look and realized the shape of it i thought, this has to be a ufo. i started looking online to see if any other reports were posted anywhere. did find one in ohio. i tried to get a picture and a video of it on my cell phone but that did not work. a planet is not oval shaped and does not pulse colored lights. helicopters make noise. i kept going outside to try to get a better look and memorize what i was seeing. it scared me and excited me at the same time and i am very frustrated that so far no one else saw this. i would like to know what i was seeing."],"Case Number":"33633","files":["/var/www/straped/mufon/html2text/33633.html.txt","/var/www/straped/mufon/org/33633.html"],"Weather Factors":"None","Latitude":"40.367253","Disposition":"Unknown","Object Features":"Unknown","Source":"MUFON","City":"Monroe Township","Longitude":"-74.383411","Country":"United States","Object Flight Path":"Stationary","Log Number":"US-11272011-0005","Date Submitted":"11/27/2011 09:39 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc, Oval","trends":["There have been 2 other sightings in Monroe Township","There were no other sightings in Monroe Township on or around November 27th 2011"]}