{"Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Triangle","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/33634.html.txt","/var/www/straped/mufon/org/33634.html"],"Date Submitted":"11/27/2011 09:42 UTC","Weather Factors":"Unknown","Date of the Event":"11/26/2011 07:10 UTC","Longitude":"-118.333429","trends":["There have been 16 other sightings in Torrance","There were no other sightings in Torrance on or around November 26th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.842209,+-118.333429(33634)&iwloc=A&hl=en\"> mufon case (33634) map </A>","Object Features":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI had just started a fire in the backyard and was drinking coffee and observing the sky directly above me. It was a pretty clear night with minimal cloud cover. My wife and 10 month old baby were also outside. While staring at the starts above me, I noticed a fast moving triangularly shaped object moving very fast from west to east in a straight line. The object appeared solid with 1 dim white light at each corner. Had I not been observing the stars above me at the precise moment, I would not have noticed this object. If this object was not moving it would have appeared to blend in with the stars in its background. The object did not make any noise. There is a small airport near our house and we often get aircraft flying nearby. At the apparent altitude of this craft it should have been audible but was not. It was difficult to tell how big the object was because it moved so fast and was out of my view very quickly. I immediately pointed to the object when I noticed it and my wife glimpsed it as well. I have never seen an object move this fast, appearing to be low in altitude and not making any noise. Oddly enough, approx 10 minutes after this event, I noted a bright blue shooting star towards the south east that appeared to be falling downward instead of across the sky. It appeared to break into pieces as it fell, there was no audible sound. I initially thought it was a firework. I pointed it out to my wife but she could not turn quickly enough to see it (she was holding the baby). Initially we were trying to figure out what it could have been. Was unnerving since we could not think of an explanation."],"Tags":"City","City":"Torrance","Region":"California","Sighting Duration":"Undisclosed","Latitude":"33.842209","Case Number":"33634","Summary":"Fast moving triangle shaped object, straight line path from west to east, dimly lit white lights at each corner","Log Number":"US-11272011-0006"}