{"Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/27/2011 06:37 UTC","Summary":"Orange","Object Features":"Unknown","Source":"MUFON","Date of the Event":"11/25/2011 06:00 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.250859,+-84.239746(33643)&iwloc=A&hl=en\"> mufon case (33643) map </A>","Longitude":"-84.239746","files":["/var/www/straped/mufon/html2text/33643.html.txt","/var/www/straped/mufon/more/33643_submitter_file1__photo2.PNG","/var/www/straped/mufon/more/33643_submitter_file2__photo3.PNG","/var/www/straped/mufon/org/33643.html"],"divs":["sighting detailsme and some friends were out on a street corner in loveland ohio on a park bench next to tano bistro (i used a website with google maps to figure out our exact location, which was (location moved to fi box) cms 11\\28\\11 09:12 cst flg when we saw these 3 whitish-orange lights in a triangle formation starting to rise up from the horizon (south\\southeast) going really fast. i got my phone out and started taking video of the lights, when another formation of lights rose up, this time there were five lights, the same color, in a much larger, somewhat uneven triangle pattern (same direction). at this point people walking down the street, and eating outside at tano stopped what they were doing to watch it, many getting out their phones as well and recording it. there was at least one child next to me that was really scared. both sets of lights continued to rise up form the horizon, appearing to rise almost vertically, before vanishing as we watched, while passing overhead. i'm still not sure whether they were 2 separate craft with multiple lights on each, or 8 craft with one light each. i live in the area, and come to this spot all the time, and i've never seen anything like this in my life."],"Latitude":"39.250859","Case Number":"33643","City":"Loveland-Madeira Corridor","Region":"Ohio","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Teardrop, Triangle","Log Number":"US-11272011-0014","Object Flight Path":"Straight-line path","trends":["There have been 8 other sightings in Loveland-Madeira Corridor","There were no other sightings in Loveland-Madeira Corridor on or around November 25th 2011","This sighting has never been favorited.",""]}