{"Region":"California","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"3364","Object Flight Path":"Undisclosed","Latitude":"33.867514","Object Shape":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.867514,+-117.998118(3364)&iwloc=A&hl=en\"> mufon case (3364) map </A>","Date of the Event":"03/20/2005 02:28 UTC","divs":["Sighting DetailsSighting Report: Right now it is 6:15 pm. About 5-10 minutes ago I saw something in the sky from my window. I went out on my balcony to get a better look. It s somewhat cloudy now, and the sun is setting, so my view may have been distorted, but I believe I saw a rather large flying object in the sky almost directly above me. I can t say how big this object was as I cannot guess how far away it was from me, but I imagine it to be quite large. I couldn t see an actual object, but I could clearly see the lights on it. I will attempt to describe it now. It may sound confusing, but please bare with me. Assuming it was circular in a sense will make it easier for me to describe. At 12 o clock and 6 o clock, roughly, there appeared to be two rapidly blinking lights, constantly changing colors from purple to green to blue, etc. The two lights seemed to be in synch with one another, changing at the same time to the same colors. At 3 o clock and 9 o clock were two steady white (yellow?) lights that did not blink nor change color. These lights stayed in the same formation at all times, so that s what lead me to believe that it was a single object instead of four seperate objects. This is all conjecture, however. Assuming, however, that it is a single object, the location of these lights make me think it was circular in shape, or even square. I can t be sure as I didn t see the object itself, only the lights it emitted. I came inside to get my phone so I could call my friend who lives near by and ask him for his view of it. However, when I came back outside the object was gone. This is what bugs me the most about this sighting. My view is pretty clear for a great distance in all directions and as I said before, this object was positioned almost directly above me. I was inside for all of 10 seconds at most. For it to be gone when I came outside means it either turned off its lights, flew into a higher atmosphere, or flew out past my range of vision. If it did move, it must have been moving pretty damn fast to have escaped my field of view in such a short amount of time. I realize I live near LAX airport, and I m no stranger to seeing planes flying overhead. But this is unlike anything I ve ever seen. The size, the shape, the way it just disappeared - something doesn t add up about this. PS. Please forgive any typing errors. I m kind of shaken by this and I m typing fast, trying to get this down before my mind can obscure the few facts I have."],"City":"Buena Park","files":["/var/www/straped/mufon/html2text/3364.html.txt","/var/www/straped/mufon/org/3364.html"],"Country":"United States","Tags":"City","Log Number":"","Longitude":"-117.998118","Disposition":"Unknown","Object Features":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"03/20/2005 02:28 UTC","Summary":"Large circular craft with lights on it overhead","trends":["There have been 4 other sightings in Buena Park","There were no other sightings in Buena Park on or around March 20th 2005"],"Sighting Duration":"Undisclosed"}