{"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Region":"Texas","Date of the Event":"09/19/1979 12:00 UTC","Weather Factors":"Unknown","Latitude":"32.765563","Date Submitted":"11/27/2011 11:35 UTC","Longitude":"-94.340693","Object Features":"Dome, Window(s), Patterned Surface, Appendage(s), Louvres, Other","Summary":"sitting on patio, saw the evening star, then it was closer, 2 min. over us, slow 15 mph, followed in car for 10 min till lost behind tree tops, west to east, called air force base in bossier, airport in shreveport, it was big and slowed over us","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsI, a former college professor, retail manager, and my wife a sherrif dispatcher, and my 13 year old step daughter were sitting on the patio at sunset. My daughter came out the door with a towen around her, she had just goten out of the shower. I was sitting with my back to the western sky, she said look a flying saucer, excited. I turned and saw what looked to me like the evening star. I said that just the evening star, vensus. About two minutes later she said No! It's a flying saucer. I turned again and it had cover what seemed like have the distance to us, but it still didn't seem strange. I told her to go in and put her night gown on. She retured. She looked up and said look! look! I told you it was a flying saucer. I looked. What I saw was a ship out of fantasy fiction. I'm not a starwars buff but that is what it was and it was headed straight over the top of us. My perspective comes from looking up thru a clearing of 60 foot pine trees. It was arrow or wedge shape. It was decked, maybe four levels. It was lit up, with recessed lights. It did not emite lite to see but to be seen. or the lighting was a result of function, like a porch light. There were hatches and ports all over it and there appeared to be observation bays and window. It was slow when it passed overhead but it had to be traveling at astonding speed to cross the distance to us so quickly. The was no sound emitted at all. It appeared that it's intent was to slow on my block. Slow for what I can't guess. After it passed my daughter and I jumped in the car and followed for about ten miles before we lost sight of it. It never sped up again. I called barkstal afb in Bossier City, La. They knew nothing, nor did the shreveport airport. The next day there was a article in the Marshall texas newspaper of a man and his family who had wittnessed it from about 12 miles from our location, I called him and what he saw was the object at the time it was over my house. If I remember he discribed it as cigar shape. I saw this object from a distance of less than 150 feet, it was so close you had to turn your head to see it all. I was either man made or made by someone like man. Were it not for the size, speed, lack of evidence of propulsion, I would say it was man made. It could have be made of metals I know. But the phicis of it I can imagine. It was as big as a football field and lite up and I can't imagine that in the last 30 years I haven'g run into anyone else who saw it. Let me put this to you as simply as I can. I have mentioned this a few time but I don't like looking foolish. I'm a educated man, I'm a Christian and study phicis and philosophy. What I saw that night perplexes me because it does not fix anything I believe. My intellect says what I saw can't be explained. The best I can come up with as an explanation is the ideas found in membrane phusics. and multiple universe in the same time and place. This thing did not belong where it was and I wasn't meant to see it. Like a ghost flying throug my sky. It's always been perplexing for me. The only reason I'm reporting this to you is that I approaching the end of my life and I simply wanted this on the record so to speak. I've put togehter a composit on the computer it not perfect but It will give you the gereal idea of what my family saw. Please overlook the spelling and gramer, I'm tired and lazy tonight."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.765563,+-94.340693(33653)&iwloc=A&hl=en\"> mufon case (33653) map </A>","Source":"MUFON","Log Number":"US-11272011-0024","Country":"United States","Disposition":"Unknown","Case Number":"33653","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/33653.html.txt","/var/www/straped/mufon/more/33653_submitter_file1__31StarsPineddnight.jpg","/var/www/straped/mufon/org/33653.html"],"City":"Jefferson","trends":["There have been 2 other sightings in Jefferson","There were no other sightings in Jefferson on or around September 19th 1979","This sighting has never been favorited.",""],"Tags":"City"}