{"Case Number":"33658","Sighting Duration":"Undisclosed","Latitude":"38.920053","map":"<A HREF = \"http://maps.google.com/maps?q=38.920053,+-94.374136(33658)&iwloc=A&hl=en\"> mufon case (33658) map </A>","Disposition":"Unresolved","Weather Factors":"None, Windy","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsMy boyfriend,two children and I were driving east bound on highway 50,in the area of lees Summit passed Todd George road and noticed a large aircraft with several white lights in a triangular formation.it was flying at a very low altitude.it crossed from the south side of the highway above us headed northeast. We never seen a aircraft in that shape or size with several lights.i called my father a retired airforce man to explain what we were seeing for explanation. As we were talking to him via phone,the object stopped almost out of site and hovered for a few moments and turned on its side while still hovering and exposed what seemed like hundred or so bright stadium like lights.by this time we pulled off on to highway 7 and began to head back westbound on highway 50 as the object very quickly sped back towards us crossing over us again heading back southwest.we followed it bout 5 miles and decided to turn back around east bound in our original destination. I was shaking,my daughter was crying and my son was just reapeting\" oh my god\". My boyfriend who was driving and I were both in shock and disbelief as to what we were witnessing. My children kept saying its alien ship. As we were headed back home eastbound we kept it in our site from our back window,and as it traveled further southwest into the distance it seemed to disappear as quickly as it appeared.i continued to try and calm my children and talk on the phone to my father in just a state of panic and shock. My boyfriend and I couldn't get over how it just stopped dead in its path and turned sideways and so many bright lights appeared and how fast it traveled back.there is just no way it is man made. Im still in disbelief and shocked . I tried to take pictures on my cell phone right before I called my father.they are poor quality and show lights but lots of residue from windshield."],"Log Number":"US-11282011-0004","Longitude":"-94.374136","City":"Lee's Summit","Country":"United States","Tags":"City","trends":["There have been 52 other sightings in Lee's Summit","There was one other sighting in Lee's Summit on or around November 27th 2011"],"Viewing Distance":"101-500 Feet","Summary":"large triangle shaped bright lights hovering then moving fast with no sound","Object Features":"Undisclosed","Date of the Event":"11/27/2011 07:15 UTC","Region":"Missouri","Date Submitted":"11/28/2011 12:44 UTC","files":["/var/www/straped/mufon/html2text/33658.html.txt","/var/www/straped/mufon/org/33658.html"],"Object Shape":"Circle, Triangle","Source":"MUFON"}