{"Disposition":"Unknown","Date Submitted":"11/27/2011 11:14 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/33652.html.txt","/var/www/straped/mufon/org/33652.html"],"Date of the Event":"11/27/2011 08:00 UTC","Log Number":"US-11272011-0023","Region":"Texas","Object Shape":"Boomerang","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around November 27th 2011"],"City":"Houston","Weather Factors":"Unknown","Longitude":"-95.551951","Tags":"City","Country":"United States","Object Features":"Unknown","Summary":"Unknown Cresent Shaped Flying Object Seen Crossing the West Houston Skyline","Latitude":"29.782368","map":"<A HREF = \"http://maps.google.com/maps?q=29.782368,+-95.551951(33652)&iwloc=A&hl=en\"> mufon case (33652) map </A>","Viewing Distance":"Over One Mile","Case Number":"33652","Object Flight Path":"Straight-line path","divs":["Sighting Details1 & 2. My sister and I were standing in front of our home talking, suddenly I heard a low flying jet pass over our home and immediately looked up at the sky. The sky was completely clear with many aircraft circling, but, I immediately noticed an extremely large crescent -shaped object flying at what appeared to be a much higher altitude then the known aircraft. In comparison this craft was approximately 1.5-2 inches across, at least 4 times larger than any other discernible aircraft in the sky. 3. Neither myself, nor my sister have ever seen a craft such as this, nor have any idea of what exactly it was. 4. The object was emitting absolutely no light or sound, and at several points it appeared that areas of the craft appeared to vanish then reappeared. At one point, there appeared to be a very low intensity blue light that pulsed from the center of the craft and radiated out towards the tips of the wings. In effect it was as if the light was internal with-in the craft, but, the craft was covered in a smoked glass allowing it to emit and be seen. The craft appeared to be almost the color of the sky, similar to a dark-cloud coloration, possibly a light blue, gray or silver hue, but barely discernible from the color of the sky at the time. The speed at which the object traveled across the sky was at a much higher rate than any of the know aircraft in the sky. It was traveling from the west-southwest of Houston toward the east-northeast. 5. The object traveled out of our sight due to the surrounding trees."]}