{"Log Number":"US-11282011-0014","Latitude":"37.55434","Object Flight Path":"Path then hovering","Date Submitted":"11/28/2011 01:56 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Fremont","Object Shape":"Unknown","Country":"United States","Tags":"City","Source":"MUFON","Date of the Event":"05/29/2011 10:16 UTC","Summary":"Lights in the sky Alvarado/Fremont Blvd & 880","files":["/var/www/straped/mufon/html2text/33669.html.txt","/var/www/straped/mufon/more/33669_submitter_file1__20110529411.jpg","/var/www/straped/mufon/more/33669_submitter_file2__20110529412.jpg","/var/www/straped/mufon/org/33669.html"],"Case Number":"33669","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around May 29th 2011","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn Sunday May 29, 2011 10:16 p.m. of Memorial Weekend. I was going do the freeway 880 in Fremont, CA as the passenger and my husband was driving. I was \"playing\" with my new camera I had just purchased 2 days before and had been playing with it all weekend. What I mean by playing is just taking pictures of anything and everything in sight. We were driving home from a friends on hwy 880 heading southbound after spending the evening there in San Ramon, CA. As we were driving down the freeway, I was trying to take pictures of the traffic and night lights to see if I could get a clear pictures and changing the camera settings to see the best way to take night pictures. As were approaching the exit that we were going to take and I was looking out the passenger window toward the west and I saw what apppeared to be and what I thought at the time, a low flying air plane parallel with the freeway and the direction we were heading and flying at an angle downward. Just as I had seen this we were exiting the off ramp to the right. The exit goes for a long stretch straight with the freeway and then turns to a sharp right that ends with a stoplight. And at that moment I started to tell my husband \"Don't head into the intersection, cuz I think that plane is going to crash\" (as this is what it appeared to do) We stopped at the red light without entering the intersection. Just as we stopped at red light at the intersection, so did the so called plane, mid air, still going southbound as we were facing west at the stoplight waiting to turn left and go again in the same direction of the \"plane\". I thought it was a plane but as it hovered, I wasn't really sure because I really only saw 2 lights that were side by side. It was dark and the lights appeared as 2 motorcycle lights stopped at the light only they were hovered or parked about a telephone pole length above the actual street lights. I had my camera and took 2 snapshots. I tried to take more but only had time to take 2 because of the delay on my camera. I was telling my husband look, I think it is a UFO...It definitely isn't a plane because the way it is hovering\" But he wasn't listening because he thought I was trying to be funny and was only joking so when the light changed he kept going because he listens with the absolute same listening skills as most men. I got the camera home and a few days later downloaded to my computer and saw the 2 photos. In the photo, you can see a 3rd \"light\" that I didnt even see when it was happening. So this was definitely something unidentifyable but what it was, I am not sure. It was coming from the direction of the Hayward or Oakland airport but I have never heard of anything that flys and can actually hover like it was parked sitting there."],"Weather Factors":"Unknown","Longitude":"-121.980752","Region":"California","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.55434,+-121.980752(33669)&iwloc=A&hl=en\"> mufon case (33669) map </A>","Disposition":"Unresolved"}