{"Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.116966,+-115.163326(33664)&iwloc=A&hl=en\"> mufon case (33664) map </A>","Object Features":"None","Case Number":"33664","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"07/23/1966 12:00 UTC","Sighting Duration":"Undisclosed","Region":"California","Tags":"City","Latitude":"36.116966","Log Number":"US-11282011-0009","Summary":"Silver or white in color about the size of a penny or dime, very bright. County may be wrong.","files":["/var/www/straped/mufon/html2text/33664.html.txt","/var/www/straped/mufon/org/33664.html"],"Longitude":"-115.163326","Object Shape":"Oval","trends":["There has been one other sighting in Las Vegas","There were no other sightings in Las Vegas on or around July 23rd 1966"],"divs":["Sighting DetailsWe were driving to las vegas it was about two o'clock in the afternoon in the desert when one of the passengers noticed an object. It was the end of July, 1966. We were four in the car. I was the driver and second to see object race across the sky. It was traveling much faster than any airplane could fly. I stopped the car and we all got out. The object raced across the sky from one side of the horizon to the other in a second or two. Then it would come to a complete stop and pulsate, for sometimes 10 to 15 seconds, then in a blink of an eye it would travel across the sky and stop again, pulsating. A few times it would turn and fly from our view only to return in a matter of seconds in a different location, then stop and pulsate again. After 5-7 minutes of watching the object it finally sped off. We thought the newspapers in las vegas would have reports of the UFO from other people but we read nothing about it. We never reported it, we thought we would not be believed. That was the only time in my life I witnessed a UFO. I know it was not an airplane, rocket or any military object. Nothing on earth can travel at that speed then stop instantly and resume again. It seemed to start at full speed. Four of us witnessed it and all saw the same thing. It was a UFO."],"Date Submitted":"11/28/2011 01:48 UTC","Country":"United States","City":"Las Vegas","Weather Factors":"Unknown"}