{"Viewing Distance":"101-500 Feet","Region":"Utah","Tags":"City","trends":["There have been 8 other sightings in Cedar City","There were no other sightings in Cedar City on or around November 27th 2011"],"Sighting Duration":"Undisclosed","Summary":"Huge, boomerang (chevron) shaped flying object, looked like a misty cloud, in clear night sky, moved very quickly and silently, moving east to west","Weather Factors":"Unknown","Latitude":"37.683437","Object Shape":"Boomerang, Chevron","Case Number":"33665","Object Features":"Undisclosed","Date of the Event":"11/27/2011 10:30 UTC","divs":["Sighting DetailsI was in Cedar City, Utah, looking up at the stars on a clear night, November 27, 2011 at about 10:30pm. I saw what at first appeared to be a misty cloud, shaped like a boomerang (chevron describes it more accurately) moving quickly across the sky, from East to West. It was almost transparent, which is why I at first thought it was a mist. But, it was such a clear night, and there was no wind, and I realized quickly it couldn't be mist or a cloud, as it did not dissipate or change shape. It was not too far above my house, but it moved incredibly fast and made absolutely no sound. I tried to get a closer look, but it moved so quickly and seemed transparent, but I think it had several white, unblinking lights, but it moved so quickly I can't say for sure. An airplane that I had seen in the sky before I saw the object was much higher in the sky, going from South to North, and was still in the sky long after the object was out of my range of sight. I called my mom and dad and described the object, then I went online and typed boomerang shaped UFO and came across a picture that looked exactly like what I saw and a blog of someone who described what they had seen using the same language, that it looked like a misty cloud, and realized it must have been a UFO I saw. It's ridiculous to think that we are the only intelligent life in a universe with several billion galaxies, all of which contain planets, so I've never doubted aliens exist, but I've never gotten too excited or really believed stories of UFO sightings on our planet. I just have always figured that aliens probably have better things to do then spy on us. However, this experience I had tonight is amazing, absolutely breath-taking, and I wish everyone could experience the thrill of seeing this thing. That's why I've posted my story. Hopefully others will look up and see it!!!"],"Object Flight Path":"Straight-line path","City":"Cedar City","map":"<A HREF = \"http://maps.google.com/maps?q=37.683437,+-113.055803(33665)&iwloc=A&hl=en\"> mufon case (33665) map </A>","files":["/var/www/straped/mufon/html2text/33665.html.txt","/var/www/straped/mufon/org/33665.html"],"Longitude":"-113.055803","Source":"MUFON","Country":"United States","Disposition":"Unresolved","Log Number":"US-11282011-0010","Date Submitted":"11/28/2011 01:51 UTC"}