{"Sighting Duration":"Undisclosed","Disposition":"Unknown","Country":"United States","Case Number":"33662","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.389386,+-120.288335(33662)&iwloc=A&hl=en\"> mufon case (33662) map </A>","Latitude":"47.389386","Object Shape":"Chevron, Star-like","Longitude":"-120.288335","Tags":"City","Summary":"25 dark point chevron floated over me in my backyard after about 5 seconds it lite up as star points and five and four on each side started generating electricity between each other .","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33662.html.txt","/var/www/straped/mufon/org/33662.html"],"Date of the Event":"10/02/2010 11:07 UTC","City":"East Wenatchee","Weather Factors":"Unknown","trends":["There have been 3 other sightings in East Wenatchee","There were no other sightings in East Wenatchee on or around October 2nd 2010"],"Date Submitted":"11/28/2011 01:10 UTC","Object Features":"Other, Unknown","Log Number":"US-11282011-0007","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI just got done watching the news and went outside and laid down on my round ottoman when I noticed what looked like a flock of geese flying over in the dusk or not quite twighlight,it occured to me they were flying in a perfect formation so I got up and tried to look at them more closely... what I saw was a dark outline of a Chevron** floating over me around 1000-2000 ft up. I saw the outline of it and could see around 20 dark points on it all up and down the bottom of the chevron.... and then after about 5 seconds the points lite up as it floated by...I moved with it down the yard and looked at the 5 ends of the chevron on one side and four on the other had figures* on them what looked like they were standing or hovering on platforms on the ends and then they started moving what looked like electrical current back and forth between each other...and then after about 5 more seconds it just disappeared completely. WET610N * The figures were large looking abdominal creatures to far up to notice features on them but they looked like they were flying on platformed round disks on the ends of the top of the Chevron..They didn't look human more like the Birdmen of Mong on Flash Gordon but with different wide bodies & no wings and some had what looked like large Bird Heads, These figures were very large(10 feet high at least) ** The Chevron looked like was thin and not more than 15-20 ft wide from the bottom so thin I could see these figures on the top of it and between 100-300 ft long. I could also describe it as the 9 Diety Gods of the Underworld(Some had Large Bird Heads with upright bodies) on the ends of this Chevron but they were so far up they just looked like large dark figures standing up...some i could make out...needless to say I got an uneasy feeling outside when I went to lay back down outside, I had to come in and sleep inside and not go back out the rest of the night because I was scared of what I saw and nothing really scares me. I felt like whatever that was up there they were up to no good."],"Region":"Washington"}