{"Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","Latitude":"41.488593","Date of the Event":"07/04/2011 09:28 UTC","files":["/var/www/straped/mufon/html2text/33670.html.txt","/var/www/straped/mufon/org/33670.html"],"City":"Lakewood","trends":["There have been 8 other sightings in Lakewood","There were no other sightings in Lakewood on or around July 4th 2011","This sighting has never been favorited.",""],"Object Shape":"Boomerang, Fireball, Sphere","Date Submitted":"11/28/2011 02:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.488593,+-81.790711(33670)&iwloc=A&hl=en\"> mufon case (33670) map </A>","Country":"United States","Case Number":"33670","Object Flight Path":"Straight-line path","divs":["Sighting Details Before I describe what I saw, I'd like to inform you that I have always been a strong believer in aliens. I've been a Ancient Aliens watcher since the show started. About myself, I am a very intuitive person who's at the right place at the right time and sees things I'm not suppose to. I'm in touch with my 6th sense, my third eye is rarely closed. My boyfriend is the same way. That's the connection that we share. We've been talking about knowing there will be much more sighting in the near future with all the changes occurring in the atmosphere and universe. There is going to be a change of humans daily lives soon and I my theory to get this change to occur, people need to expand their minds and know that we are not the only ones out here. During and after the sighting I felt like we were purposefully contacted and telepathically communicated with the object but I cannot show any proof of that. it was on a spiritual level. Lakewood Ohio July 4th 2011. My boyfriend and I were setting off firecrackers, sparklers and poppers in the back parking lot of his apartment building. We saw many explosions in the sky from fire works. Living miles from Hopkins airport, I grew up looking at and hearing planes so I know what to identify in the sky. I just so happened to be filming and taking pictures of the setting off of firecrackers, with my digital camera. All of a sudden, I look up and see a glowing, flaming object coming towards me from the sky. At first I thought it was an ash from fireworks a nearby neighbor was setting off and expected the firey tone to fade away as it fell near the ground. But I noticed it wasn't falling to the ground, it was smoothly gliding in a straight line and the redish orange pulsating light wasn't fading. I looked over at my boyfriend and noticed he was looking at it too. We looked at each other with big eyes, without saying a word we both knew what it might be.The object glided past the above the building. It seemed so treetop close to the ground but about a football field and a half away. When we really focused on it, we both confirmed we heard a very faint humming noise. Now after the first time it passed us..we saw another one come from out of no where, same distance, same speed, noise...everything. I switched my camera to video mode and started filming. I filmed until my camera card was filled. Was it another one or did it take us back in time after the first time it appeared? Possibly the same one but us going back in time or possibly a second one. What I got on video, is not what I saw with my naked eye. I would look through the camera then I looked with my natural eye sight, without electronics. They looked different. The naked eye was more mystical, tinkerbell in a jar, the pulsating movements in the center of the glow almost looked like hyroglifics....it was much more detailed then what the camera captured. The camera had more light effects, a heavier pulsating glow and was the color red instead of a candle lit in a jar color. The objects shape appeared in the form of a pulsating sphere in both naked eye and camera though. At first I felt sketched out because I knew what to look for in a UFO and I was seeing all correct signs. After the event, I felt peaceful and pondered over what I saw for awhile. I felt as if I got a welcoming message of \"Hello, yes, we do exist and we will be here more, so prepare yourselves.\" I think it's clever for UFOs to roam around in the sky on a night where other lights occur in the sky. That way, if anyone sees it, people wouldn't think twice about what weird light they saw in the sky on the 4th of July. And that was one of the very few thing my boyfriend and I agree on. Now I'll have to go back and look at the times but for now, I'll share with you, my video and let you judge for yourselves."],"Region":"Ohio","Tags":"City","Longitude":"-81.790711","Log Number":"US-11282011-0015","Summary":"shape appeared in the form of a pulsating sphere","Weather Factors":"Unknown","Object Features":"Other","Sighting Duration":"Undisclosed"}