{"Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/33677.html.txt","/var/www/straped/mufon/org/33677.html"],"City":"Independence","Date of the Event":"11/27/2011 07:30 UTC","Case Number":"33677","Tags":"City","Weather Factors":"Unknown","Summary":"ufo sighting when driving in town from thanksgiving","Disposition":"Unresolved","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around November 27th 2011"],"Log Number":"US-11282011-0018","Object Shape":"Blimp, Boomerang","Object Features":"Undisclosed","Source":"MUFON","Latitude":"39.04584","Region":"Missouri","Object Flight Path":"Stationary,Hovering then path,Path then hovering","divs":["Sighting DetailsOk, I thought my eyes were going crazy because I was driving. I looked up and it was a blimp shaped object. I told my wife it was a blimp with lights. As were still driving closer to object. Than as we got closer it was not a blimp. It was something else that was hovering over the buildings as I was going down I -70 to my left that was hovering. All the cars were breaking to look at what we saw so I know we were not the only ones to see it. So it was turning doing a three sixty rotating in the air. My wife was going crazy saying that was a UFO. I thought it was a weird plane flying over the chiefs game or something, but it wasn't. It went south with us as we were driving. It was at a complete stop and was accelerating and stoping. As I Stoped off my brother we saw it flying and stoping again. We saw flashes in the sky that look like a war was going on and off like a war was going on. My wife was following the sky the whole time. You didn't hear no noise coming from the object. I say object because it was not a airplane with a couple of lights. It had a lot of lights when I first saw it. Than it went to like 6 even lights under it. It seemed like it was more than one object in the sky and it was flying all south in like circle making stops. No light emitted like the first time we saw just stoping. We was wondering if anybody else came forward with seeing this yesterday. I'm truly a believer after seeing that in the sky. It was different but scary at the sane time cause we had no clue what it was doing. It was over a fastfood place and other buildings."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.04584,+-94.43704(33677)&iwloc=A&hl=en\"> mufon case (33677) map </A>","Date Submitted":"11/28/2011 11:07 UTC","Sighting Duration":"Undisclosed","Longitude":"-94.43704","Country":"United States"}