{"Region":"Connecticut","Date Submitted":"11/28/2011 05:37 UTC","trends":["There have been 8 other sightings in Bristol","There were no other sightings in Bristol on or around July 3rd 2011"],"Log Number":"US-11282011-0018","Source":"MUFON","Object Flight Path":"Hovering then path","Viewing Distance":"20 Feet or Less","Summary":"Glowing Fire Ball Hovering Tree Top Level No Noise Hovers Moves Straight Then Takes Off And Dissapears","Longitude":"-72.951849","Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/33673.html.txt","/var/www/straped/mufon/org/33673.html"],"Sighting Duration":"00:00:40","map":"<A HREF = \"http://maps.google.com/maps?q=41.666286,+-72.951849(33673)&iwloc=A&hl=en\"> mufon case (33673) map </A>","divs":["Sighting DetailsI Was At Home Online, On My Laptop. I Just Poured A Fresh Cup Of Coffee, When All Of A Sudden I Heard A Bang. Thinking It Was FireWorks Because 4th Of July Is The Next Day And People Are Partying Early, Little Did I Know, It Was The Last Thing I Would Ever Expect. It Was About 9 P.M. Eastern Time, I Walked Outside In The Front Of My Home And It Was The Most Queit It Has EVER Been In My City, My City Is NEVER Queit! It Was Like A Creepy Ghost Town, Like Everything Just Went Mute For About A Minute. I Was Looking Around For FireWorks And All Of A Sudden I Noticed Something In The Upper Corner Of My Right Eye. I Noticed The Sky Wasnt Clear, Couldnt See One Star In The Sky And It Looked Really Dark Kind Of Smokey Grey. There Was An Orange FireBall Like Object, Hovering Right At The Top Of My Neighbors Tree Right Across The Street From My Home. At First I Thought It Was A Bird On Fire But I Thought To Myself...Wouldnt It Be Flying All Crazy? Then I Thought Its Kind Of Hovering Like A Floating Bag And A Floating Bag Would Melt If It Was On Fire. I Knew It Most Deffintly Wasnt A Plane Or Helicoptor Or Blimp Or Anything Ive EVER Seen Before, It Was So SurReal! So Lastly I Thought Its Just A Piece Of A FireWork That Flew Up Into The Sky But From Its Speed And How It Hovered And Looked Like It Was Fading In And Out And Getting Closer Then Moving Farther Out, I Knew It Was Deffintly A UFO. It Was Mostly Orange But Had A Yellowish White-ish To Haze To It. NO SOUND! It Slowly Moved In Almost Straight Path And Then Just Out Of No Where Vanished! It Was About A Total Of 35-40 Seconds, At That Moment I Was So Scared, I Had So Much Fear But Adrenaline Built Up Inside Me Because At The Same Time It Was Soo Creepy I Was So Interested. All I Had Was My Cell Phone Trying To Use It To Take A Picture & Video And I Couldnt Get It To Show Up On My Camera Because Of Lighting And It Was Late At Night. My GirlFriend Also Witnessed This With Me And Was VERY Scared While It Was Happening And She Wouldnt Leave The Porch Meanwhile I Was By The Side Walk Near The Road. I Spent The Whole Rest Of That Night Searching For It Again And Couldnt Find It, I Was So Dissapointed That I Didnt Capture Any Proof Except For What Me And My GirlFriend Saw. So I Started Telling My Mother And Sibling And On The Other Side Of My City Exactly Around The Same Time, Season, Clock And A Year Before, My Sister Said She Saw The Same Exact Thing I Described. I Then Posted What I Saw On FaceBook And Another Teenager Told Me They Saw The Same Exact Thing Around The Same Time At Another Part Of My City. So Far The Same Thing Was Spotted 3 Times At 3 Different Spots In My City. So I Decided To Google My City And UFO Reports And It Happens That Where I Spotted This UFO, That Part Of The City Has MANY MANY MANY Different Reports Of UFO Activity Going All The Way Back To 1950! All Different Shapes, Colors, Sizes, Events, Ufos Shaking Houses, All Were Spotted And Reported Within That Same Area. Also Around That Time Several Other Reports Around My City Was Reporting UFO Activity, Spotting, Following And Stalking People, I Started Adding Everything Up And Was More Than Positive I Know What I Saw. I Started Telling People And No One Really Believed Me But Alot Supported Me And Claimed Theyve Seen The Same Time After Time. Days And Days Later I Spend Searching To Spot This Again And Get Pictures And Proof And I Got Nothing. About 2 Weeks After This I Started Getting Very Stressed, Paranoid And Started Having Anxiety And Really Bad Panic Attacks And I Have Never Had Any Mental illness Experiences. I Put It On My Life I Know What I Saw, Make Me Take A Lie Detector Test, Whatever I Have To, To Prove What Me And My GirlFriend Saw Was Indeed A UFO! So Scary And Surreal!"],"Case Number":"33673","Object Shape":"Fireball","Latitude":"41.666286","City":"Bristol","Date of the Event":"07/03/2011 09:10 UTC","Country":"United States","Tags":"City","Disposition":"Unresolved"}