{"Latitude":"42.552813","Object Shape":"Unknown","Object Flight Path":"Undisclosed","City":"orangeville","divs":["Sighting DetailsMy friend and i were fishing on a local lake. We had been there since 3pm, at 745pm my friend casted out tward shore. I was casting about 30 yards to the right of him. I saw him twitch in the corner of my eye. He quietly said as he was staring tward shore \"There's and alien over there\" He immediately repeat \"there's an alien over there\" this time very loudly and began yelling at me to look. As this was happening I heard branches and sticks breaking just behind a few bushes at the edge of shore. I watched the woods in the direction that the sound was moving toward. The noises stopped and maybe ten to fifteen seconds later I saw what appeared to be a person with extremly long arms down to where i saw it's knees bending. A very large head, rounded at the top with a very pronounced chin. It was very skinny, skinny enough that if it was a person they were starving. There was no clothing visible, the legs and arms were also very skinny and no reproductive organs were visible. The way it walked reminded me of the old film of bigfoot almost perfectly. We started leaving the area. There is a small wooded peninsula directly adjacent to the direction that it had walked. as we passed it I was watching the woods closely and saw what appeared to be a face. Rounded at the top and with a pronounced chin it turned to follow our movement passed. It had large oval black eyes with a small mouth, grey skinned, and there was a notable crease running down its forehead. I couldn't see any nose of any kind. once we had passed We did not see it again."],"files":["/var/www/straped/mufon/html2text/33686.html.txt","/var/www/straped/mufon/org/33686.html"],"Date of the Event":"08/31/2011 07:45 UTC","Source":"MUFON","Region":"Michigan","Tags":"City","Case Number":"33686","Summary":"non-human sighting","Log Number":"US-11282011-0027","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Disposition":"Unknown","Longitude":"-85.51918","Object Features":"Undisclosed","Date Submitted":"11/28/2011 04:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.552813,+-85.51918(33686)&iwloc=A&hl=en\"> mufon case (33686) map </A>","trends":["There have been no other sightings in orangeville","This sighting has been favorited 3 times."]}