{"Log Number":"US-11282011-0024","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"27.666597","Country":"United States","trends":[""],"Object Features":"Other","Source":"MUFON","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=27.666597,+-81.512454(33683)&iwloc=A&hl=en\"> mufon case (33683) map </A>","Longitude":"-81.512454","files":["/var/www/straped/mufon/html2text/33683.html.txt","/var/www/straped/mufon/more/33683_submitter_file1__112211x-Original.jpg","/var/www/straped/mufon/more/33683_submitter_file2__112211xcontrast-brightnessadjusted.jpg","/var/www/straped/mufon/more/33683_submitter_file3__112211ycontrast-brightnessadjusted.jpg","/var/www/straped/mufon/org/33683.html"],"Date Submitted":"11/28/2011 02:01 UTC","Region":"Florida","divs":["Sighting DetailsFlight information withheld. The pictures taken were in flight of the sunset. Approximately 10 pictures were taken three caught something. The witness did not see the object only caught it on the camera by accident. The witness was sitting in a window seat and was taking pictures of the sunset with an iphone. In an effort to get more of the picture of the sunset, some of the photos were taken with the iphone camera tilted at an angle so that the photo would capture above the plane at angle. The area in which some of these photos were taken was physically impossible to see looking out the window. There was no flash used. Most of the photos came out fine accept for three. The photo with the three lights has approximately 12 surrounding smaller lights which appear to be reflective lighting. It is hard to see in the original photo. In an effort to capture it, we have included a photos with a brightness, contrast and zoom adjustment."],"City":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Tags":"City","Date of the Event":"11/22/2011 06:09 UTC","Case Number":"33683","Object Shape":"Oval, Other","Summary":"3 pictures taken from a Commercial Airline with a tilted iphone camera, something above the plane at an angle that would not have been seen without the camera"}