{"Log Number":"US-11282011-0025","Latitude":"39.009074","Date of the Event":"11/27/2011 07:00 UTC","Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"11/28/2011 03:10 UTC","Viewing Distance":"Unknown","Object Shape":"Circle, Other","Longitude":"-94.244019","map":"<A HREF = \"http://maps.google.com/maps?q=39.009074,+-94.244019(33684)&iwloc=A&hl=en\"> mufon case (33684) map </A>","Tags":"City","Region":"Missouri","files":["/var/www/straped/mufon/html2text/33684.html.txt","/var/www/straped/mufon/org/33684.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsI was smokinga cigarrette before the chiefs game was going to start aproximately 7pm on my back porch. I saw 5 lights with flashing lights beneath them moving towards me over the house behind mine. It was very slow moving from west to east. It came directly over me and then proceeded to change direction and head south from there at the same speed in the same formation. I called to my girlfriend who was in the AF for 4 years to come see it. She came out side while I snapped 3 pictures and I asked her\"if those were planes flying in formation\" to which she replied \"planes make a noise when they fly that low and that was not planes\". The craft seemed to move south and then continue to hover around south of us for at least 30 minutes. There was also a very bright light way hhigher in the sky that remained in the same place from 7pm until I went to bed at 12pm. This was a secondary light but much brghter and in the same exact plaec for 4 hours. Both were witnessed by mysel and my girlfriend. I physically felt fine. I dont drink so I was fully sober and not feeling any physical effects."],"trends":["There have been 28 other sightings in Blue Springs","There was one other sighting in Blue Springs on or around November 27th 2011"],"Summary":"Flew quietly over the house in front of me then changed direction","Disposition":"Unresolved","City":"Blue Springs","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"33684"}