{"Case Number":"33685","Longitude":"-86.081749","Viewing Distance":"101-500 Feet","Date Submitted":"11/28/2011 03:33 UTC","files":["/var/www/straped/mufon/html2text/33685.html.txt","/var/www/straped/mufon/org/33685.html"],"Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.484743,+-86.081749(33685)&iwloc=A&hl=en\"> mufon case (33685) map </A>","Summary":"Manchester,TN Orange/Amber Orb with flashing lights that came out of it. HWY 41","trends":["There have been 7 other sightings in Manchester","There were no other sightings in Manchester on or around October 14th 2011"],"Region":"Tennessee","Source":"MUFON","Object Features":"Unknown","Object Flight Path":"Hovering then path","Latitude":"35.484743","Log Number":"US-11282011-0026","Disposition":"Unknown","divs":["sighting detailsoct. 2011 about 9:30 at night on murfreesboro hwy\\ 41 there is a dark 6 mile stretch of road. we were heading from town (manchester,tn.) toward the interstate and a bp gas station(busy corner truck stop and market). we (3 of us in the car) have witnessed this 3 different times now within a months time. all 3 events each time took place about mid-way on this 6 mile stretch. around where some fields are. we witnessed a good size orange to amber colored orb hovering just above the treeline, it almost looked like a big orange star but stars do not hover above a treeline, that's what caught our eye, it's placement seemed odd. we take this road 5 times a week and noticed as we were driving up on it that it looked very out of place. i then pulled over on the shoulder of the road to get a better look. the orb hovered for a few seconds more and then seem to disappear or change into what looked like a white star like object, it moved through the sky very fluently and went over to what we thought was just a star (also pretty low in the sky), it connected to it and moved off as one. then it seemed to turn into a white flashing light object and began moving at a high velocity, we watched it until it moved out of our field of vision. the orange orb thing was almost like a portal or host that this object came out of or so it seemed? it was very amazing to see to say the least..."],"Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Tags":"City","City":"Manchester","Date of the Event":"10/14/2011 09:30 UTC"}