{"Case Number":"33688","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/33688.html.txt","/var/www/straped/mufon/org/33688.html"],"Disposition":"Unresolved","City":"Lucern Valley","Viewing Distance":"101-500 Feet","Date of the Event":"11/24/2011 10:35 UTC","Summary":"round sphere hovered (lit near virtical beams of light anound it)15sds(lights went out)moved and and did same thing","Sighting Duration":"Undisclosed","Object Features":"Appendage(s)","Latitude":"36.781281","divs":["Sighting DetailsMy friend has some property in Lucern valley,(N-E of Big Bear lake?)when his generator is off it is pitch black out there and you can see all the stars at night, It's off the main power and water grid and only a weekend get away place that I only go to once or twice a year. After thanksgiving dinner was over we all went to sleep fairly early, 630pm or so. There was still a fire in the pit but we were all fat and happy full of turkey and gravy etc. I woke up to hit the bathroom then looked at my cell to check the time, man only 10:30? (I thought to myself) I might as well stoke the fire and crack a beer may be then I can go back to sleep? So I grabbed some fire wood tossed it on, cracked the beer in my hand and tilted my head back to take a sip, AND THERE IT WAS IN FRONT OF MY FACE! I didn't know what to think or do, I was frozen in place shocked at what I was witnessing! It lit up these laser like bars that turned the thing from a sphere to a, sphere with a square looking lamp shade type look around it. The Glow from the bars changed the look from the A mid blue glowing color to a light blue lamp shade between these solid white bars of light. held that position for 10-15 seconds or more?. Then it moved away from from me so fast that I thought it disappeared? I was standing with big bear mountain at my right side. It then appeared at an unknown distance away and did the same thing again. I only reason I noticed it was because the bars lit up and made it more visible. Then it was more to my right. It then came back to me not so close but still to my right. same thing lit up 10-15 then back to sphere, went away to the right distance did the same thing, At this point I was checking the sky for a bigger ship that this might have come from when I looked to the first point I think it came from I think I was looking at the north star because it was the brightest thing in the sky. When I saw that it was going away from me I was more at ease with what was happening when I first saw this thing the hair on all of me stuld up! It zig zagged down the valley towards big bear mountain , I was on top of the adjacent hill so i saw that it was keeping the same elevation to the ground it looked as if it was mapping or scanning like an in atmosphere satilight. As it went down towards the valley it went UNDER THE SKYLINE AND I SAW AN EVEN BETTER VIEW OF IT AND IT WAS MORE SHARP TO MY EYES BECAUSE THE BACKGROUND WAS ALL BLACK AREA WITH A LIGHT HERE AND THERE. I watched this thing until i couldn't see it anymore i don't know when it was gone it was just gone. I watched it until it went to big bear peak. There were plane lights in the air that night but they were so far away and there flashing lights were only little specs like flashing stars compared to this thing that (I thought if at first sight If this thing lands I need some clean underwear), and hoped they would be friendly! Later i thought its only a probing thing still? The next night I couldn't even sleep the night through without waking in thought of getting up and seeing what ever it was again before i went back to the city. I could not take my eyes off the night sky thinking it might be behind me or further in front of me! i totally lost sleep over this all weekend my friends think ,what ever, but I was so stunned and focused in disbelief on this thing, I didn,t even yell Hea!"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.781281,+-119.409122(33688)&iwloc=A&hl=en\"> mufon case (33688) map </A>","trends":["There have been no other sightings in Lucern Valley","This sighting has never been favorited."],"Source":"MUFON","Object Shape":"Circle, Sphere, Square, Rectagular","Log Number":"US-11282011-0029","Tags":"City","Country":"United States","Region":"California","Longitude":"-119.409122","Date Submitted":"11/28/2011 09:10 UTC"}