{"Source":"MUFON","Tags":"City","Longitude":"-82.714537","Object Shape":"Flash, Sphere","Disposition":"Insufficient Data","Latitude":"28.252967","Object Features":"Unknown","Case Number":"33692","map":"<A HREF = \"http://maps.google.com/maps?q=28.252967,+-82.714537(33692)&iwloc=A&hl=en\"> mufon case (33692) map </A>","Object Flight Path":"Hovering then path","Summary":"Lighthouse Effect then flash Over Gulf","City":"New Port Richey","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33692.html.txt","/var/www/straped/mufon/org/33692.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-11292011-0001","trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around November 21st 2011"],"Region":"Florida","divs":["Sighting DetailsWhile sitting in my yard stargazing looking SW towards the Gulf around 8:30pm. I was waiting and hoping for some meteor activity. I have noticed a lot (4 in a week) of shooting stars lately between sunset and 10pm. It was a beautiful clear evening. I was looking at the same pulsing blue star that I have enjoyed for years when all of a sudden I saw a dim white glow about 15D SW of the blue star. I immediately switched my focus on that glow that gradually got brighter and brighter all while staying stationary. The glow got larger and brighter and then it flashed a brilliant white light that made me see spots as you would get from a camera flash at a short distance. After the flash it dimmed and got smaller and then at amazing speed it either headed south or plunged down. My depth perception was affected by the flash, I had to rub my eyes to get full focus back. I can only describe it as a lighthouse because of the way it faded in, flashed then faded out before it moved and disappeared. I have never seen a aircraft move as fast as this light did. Being the skeptic that I am, I immediately tried to debunk what I just witnessed. I have ruled out every feasible possibility. My first thought was that it was a spotlight from a helicopter but the rate of speed ruled that out. Then I thought it could be a meteor, but since it did not move for 10-15 seconds and then move at such a fast rate of speed ruled that out as well. My other thoughts of what it was just seem to irrational to admit to. It has been a week since the sighting and I have been watching the same area with nothing new to report. It was one of the few things that I can not explain."],"Date of the Event":"11/21/2011 08:30 UTC","Date Submitted":"11/29/2011 12:10 UTC"}