{"Longitude":"-94.047955","Source":"MUFON","divs":["Sighting Detailshave been seeing at night very bright lights in the sky east of my home when out on my deck with my dogs after dark. this one tonight was more due east of me and approximately one hour later has moved closer toward my home but slightly to the south, so it traveled in an hour south west. but the movement is gradual. It is very bright with bright lights shining off like one would draw a sunshine with the lines extending from the sun. But this one also has lights flashing as if around it's perimeter in green and red. It moves slightly up and down or seems to orbit around. Since late summer this is not the first time I have witnessed strange bright lights hovering. My husband has also seen them and being a navy man, says these lights are brighter than any stars he saw while out on the ocean. My property is rural, close to the area known as Chapel Hill bordering Lafayette, Johnson and Jackson county in Missouri. Just looked again about 20 minutes from the beginning of this report and object has moved a bit closer which would be west and still a bit south.I made my first report to the highway patrol late summer and described the light and it's movement. The dispatcher that answered after hearing my description said \"that is just how my husband described it when he saw it..drops down and was jerky moving\"."],"City":"Bates City","Case Number":"33693","Date Submitted":"11/29/2011 12:15 UTC","trends":["There has been one other sighting in Bates City","There were no other sightings in Bates City on or around November 28th 2011"],"files":["/var/www/straped/mufon/html2text/33693.html.txt","/var/www/straped/mufon/org/33693.html"],"Object Flight Path":"Path then hovering","Summary":"noticed very bright more than a starburst light while out on deck. Lights flashed with red and green and bright rays shooting off the object.. Was more east then within hour moved more toward my home but to the south a bit. watched for over hour .","Country":"United States","Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"Over One Mile","Region":"Missouri","Tags":"City","Log Number":"US-11292011-0002","map":"<A HREF = \"http://maps.google.com/maps?q=38.950508,+-94.047955(33693)&iwloc=A&hl=en\"> mufon case (33693) map </A>","Object Shape":"Star-like","Latitude":"38.950508","Sighting Duration":"Undisclosed","Disposition":"IFO","Date of the Event":"11/28/2011 12:00 UTC"}