{"Latitude":"44.792945","divs":["Sighting DetailsWhile having my bonfire talking to my friend I suddenly spot a large glowing white object within the clouds. As I look at it the white glowing object it immediatly jests off to the east in a straight line. My reaction: I got up out of my seat and ran to get a view of where it might be but I reacted to late. 15 mins later: My friend and I both hear a dog barking we didn't think to much of it at first. A short moment passes without much noise as we walk back to the house we hear some more dog barking but this time we hear a female human sound like falling and hurtingherself. So naturally I wanted to go help but my friend had a really unsettling feeling about this and urged me not to go. Well as we're talking about it we noticed a few low level noises all seemed ok until the screaming......... The sound of this screaming sounded like a dog yelping but morphed into what quite clearly was a woman. We're petrified by what we're hearing. Long yelping female gurgling choking coughing dogish humanish female very very loud screams. Me and my close friend now have problems sleeping and wish to god we never heard what we heard. Furthermore I asked around a little and I spoke with an older woman who also heard the very loud screams and said it was like nothing she has ever heard before in all of her days. I went to the station and made a report about it the officer was of course very dismissive."],"Object Shape":"Sphere","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","Longitude":"-93.595099","City":"Chaska","trends":["There have been 6 other sightings in Chaska","There were no other sightings in Chaska on or around October 22nd 2011"],"Country":"United States","Region":"Minnesota","Tags":"City","files":["/var/www/straped/mufon/html2text/33699.html.txt","/var/www/straped/mufon/org/33699.html"],"Source":"MUFON","Object Features":"Unknown","Log Number":"US-11292011-0008","Summary":"First saw ufo. Then dog bark turned into long yelping human dog yelping and then female screaming","Date Submitted":"11/29/2011 06:48 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"33699","map":"<A HREF = \"http://maps.google.com/maps?q=44.792945,+-93.595099(33699)&iwloc=A&hl=en\"> mufon case (33699) map </A>","Date of the Event":"10/22/2011 12:00 UTC"}