{"Object Features":"Window(s)","Object Flight Path":"Hovering then path","Log Number":"US-11292011-0018","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","trends":["There have been 4 other sightings in Greenville","There were no other sightings in Greenville on or around July 1st 1973"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33709.html.txt","/var/www/straped/mufon/org/33709.html"],"Case Number":"33709","Latitude":"33.432415","Date of the Event":"07/01/1973 12:00 UTC","Tags":"City","Region":"Mississippi","Summary":"Visiting ET's witnessed by 3 brothers 30 feet away.","Object Shape":"Disc","Longitude":"-91.033155","divs":["Sighting DetailsI was 4 years old and my two brothers were 12 and 14. We were moving some dirt around in the backyard of our home. My brothers remember hearing a screaching sound, which sent them running to the front yard to hopefully see a cool car speeding away. After their disappointment they returned to the back where we noticed, near the same time, a disk shaped ship hovering over the back of our next door neighbors house. I saw the door slide open and a short (3 foot tall) ape-like being walk out onto a narrow catwalk that appeared to encircle the ship. He walked a few steps to my right and kneeled down and opened a small door on the side of the craft. He used a small tool to make some type of adjustment, and closed the small door before returning inside. While he was out, a second being walked to the door and watched him. The second guy was taller, maybe 5 feet. They were both covered in thick brown hair, but well groomed. Both were wearing a coverall but not anything resembeling a space suit like our NASA guys wear. After the door slid back down, the ship started ascending at a slow speed. When it reached about 100 Feet, it ascended almost straight up and out of sight in 1 or 2 seconds. The beings made no audible communication between each other, and didn't pay any attention to the 3 boys silently staring at undoubtable proof of life on other planets. My brothers knew they were looking at alliens, I didn't. I knew I had never seen anything like this before, but I wasn't old enough to know what an allien was. My oldest brother and I remember almost all the details the same, but our middle brother is now schitzofrenic. His recollection is light years away from what really happened."],"Weather Factors":"Unknown","Country":"United States","Date Submitted":"11/29/2011 08:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.432415,+-91.033155(33709)&iwloc=A&hl=en\"> mufon case (33709) map </A>","City":"Greenville","Source":"MUFON"}