{"trends":["There have been no other sightings in Trooper","This sighting has never been favorited."],"Source":"MUFON","Region":"Pennsylvania","Longitude":"-75.391864","Weather Factors":"Unknown","City":"Trooper","divs":["Sighting DetailsSix adults and two small children were just finishing dinner at my sister's house in Trooper, Pa. when, at about 9 PM, my brother-in-law went out to the mailbox to check for mail. He came running back in excitedly yelling, \"Hurry, everybody come outside before you miss it\". We all went out on the front porch and looked up. There were about 12 bright lights, yellowish-white, flying in formation almost directly above us. They appeared to be fairly low (500-1,000 ft. high) in the sky and were absolutely silent and moving slowly. We observed them for about 5 minutes until they flew out of sight. I even went into the back yard where there was no noise and cupped my ear to the sky as the last one passed, but there was still no sound at all. I called 911 and reported the incident and the dispatcher said there was another report and the police were checking it out. He said they would call me back if they learned anything and, at about 11:15 that night they called me back to tell me there was a similar report from someone in Willow Grove, but that they still did not determine anything more. I contacted the Air Force and they suggested calling the FAA. The FAA suggested I contact MUFON."],"Log Number":"US-11292011-0014","Latitude":"40.148732","files":["/var/www/straped/mufon/html2text/33705.html.txt","/var/www/straped/mufon/org/33705.html"],"Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"00:05:00","Object Features":"Unknown","Summary":"Sighted between 8 and 12 bright lights flying in formation at what appeared to be between 500 & 1000 ft. high.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.148732,+-75.391864(33705)&iwloc=A&hl=en\"> mufon case (33705) map </A>","Date Submitted":"11/29/2011 03:57 UTC","Case Number":"33705","Date of the Event":"11/25/2011 09:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Object Shape":"Unknown"}