{"Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/33708.html.txt","/var/www/straped/mufon/more/33708_submitter_file1__ufo003.jpg","/var/www/straped/mufon/more/33708_submitter_file2__ufo004.jpg","/var/www/straped/mufon/more/33708_submitter_file3__ufo005.jpg","/var/www/straped/mufon/org/33708.html"],"Country":"United States","Date Submitted":"11/29/2011 07:31 UTC","City":"Richmond","Tags":"City","trends":["There have been 7 other sightings in Richmond","There were no other sightings in Richmond on or around November 23rd 2011","This sighting has never been favorited.",""],"Latitude":"37.915639","Sighting Duration":"Undisclosed","Case Number":"33708","Source":"MUFON","Region":"California","Longitude":"-122.319891","Log Number":"US-11292011-0017","Date of the Event":"11/23/2011 07:18 UTC","Weather Factors":"Unknown","Disposition":"IFO","divs":["sighting detailsnovember 23rd, 7:20-7:30, richmond ca. sky very clear, moon in last quarter. dogs wanted to go out. when i opened door i was shocked to see a craft hovering approx. 1\\4-1\\2 mile away and less than 1,000' altitude. i live 1 mile from the bay and it was inland, seeming to sit just above neighbor's trees, absolutely no sound. it was circular, like an air filter, was my first thought, had walls of white lights about 10-25' high--1\\3 as wide, like rectangular windows, very thin darker partitions between them. they went completely around, between 8 and 12 on visible side; a few red and one blue that mostly remained constant, very slight red flicker above and below. i ran in house to get camera [samsung sl502 on auto]and craft slowly started to move north when i returned one minute later, then veered nw, as if following bay shoreline. there were no shadows, no beamed lights from underneath, just the row of bright white windows, like an observatory, red on top flickering slightly, blue underneath. i posted pics immediately on facebook and sunday received an email with link to video taken in oakland on same night, november 23rd, that had just been put up: [youtube link moved to fi section\\cms\\tg] this is exactly what i witnessed, except for movement, and the rear light i saw was in front on their video. the dogs did not react and i sensed no malevolence. the pics will need to be enlarged. i was afraid camera didn't capture anything, but you will see it is same craft as in video, albeit more pix-elated."],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Shape":"Circle, Disc, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=37.915639,+-122.319891(33708)&iwloc=A&hl=en\"> mufon case (33708) map </A>","Object Features":"Window(s)","Summary":"Less than 1 mile away, under 1,000' altitude. White, a few red, one blue lights"}