{"Country":"United States","Date Submitted":"05/13/2005 03:15 UTC","Source":"MUFON","Summary":"Not Provided","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","City":"Roseville","Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.761074,+-121.282106(3370)&iwloc=A&hl=en\"> mufon case (3370) map </A>","Object Features":"Undisclosed","Latitude":"38.761074","Case Number":"3370","trends":["There have been 31 other sightings in Roseville","There was one other sighting in Roseville on or around May 13th 2005"],"Object Shape":"Undisclosed","Longitude":"-121.282106","Date of the Event":"05/13/2005 03:15 UTC","Viewing Distance":"Unknown","Log Number":"","divs":["Sighting DetailsSighting Report: In May of 2003 my wife and i took a Mexiacn cruise. after 3 days at see we where 2 or 3 miles off the baja coast. it was approx. 11:00 and we were standing on the back of the ship watching the stars. I noticed a object that seemed far off and was flickering. the object did not appear to move. i knew we were to far out for airplanes or anything else i could imagine. I have a 4 mega pixel digital camera so i took some pictures of the object. i took one without zooming for perspective from where i was standing. i then zoomed in at high res to see if i could get a close up of the object. i took several more pictures for contrast. i wanted to make sure that i was taking photos at the same spot and the camera was nt moving. after we returned home i examined the photos on my computer. i was shocked to find the close up photos were really strang. there were trails and strings of colors and it seemed like many objects moving in differeent ways leaving trails of colors. I have 4 photos of the same object and all 4 show different objects colors and formations. i would like to have these photos examined by someone who may be able to tell me what it was. I have not shown these photos to anyone but friends. We can not explain it. Please advise me on what I can do. I can email the photos if i can someone s email. I saw that you offer that service but i didn t see a email address. thank you. troy wallis."],"Weather Factors":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/3370.html.txt","/var/www/straped/mufon/org/3370.html"]}