{"Source":"MUFON","Latitude":"37.562992","divs":["Sighting DetailsSighting Report: Hello, I sent a pic to Dr Maacabee who in turn suggested I contact you with the info regarding the pic and the sighting we all had. On 4-25-05 my family and I moved some of our furniture from San Mateo Ca to Tucson Az and into our new house. Our permanent move is scheduled for early June. On 042605 myself, my wife and her friend decided to take a ride around our new neighborhood. We jumped into a jeep wrangler with the top off and began driving. We noticed a new \"chemtrail\" had just been \"laid\" The trail was placed West to East and although new it was beginning to dissipate. Approx 4 blocks from our house, our friend Jennifer, who was in the back seat said \"you better look up\". Looking up, we spotted an either luminous or self luminous object near the chemtrail. We stopped the jeep for a better look. With naked eye the object appeared to have some sort of protrubrance on it and it was difficult to make out the shape. It \"floated\" slowly in and out of the chemtrail. The chemtrail itself was moving with the wind, I believe in a North-easterly direction. The object \"followed\" the chemtrail. Having no camera I began phoning my sons who were in our new house with the idea of having them take pictures of the object. Getting no response from them we drove back to the house. As we drove in we found our sons were also outside watching the object. I retrieved a Nikon 5.1 digital camera from the house and snapped a shot toward the object, which was now \"downrange\" of the house and quite small. I put the camera on Zoom for the pic. The entire sighting lasted approx. 15 minutes. I have read and heard that chemtrails were \"laid\" at specific heights, so judging by this I would say that the object must have been quite large in size especially when it was viewed almost directly above us. I spent 4 years in the Air Force and 20 years as a San Francisco Police Officer. Although this makes me no expert, I am perhaps a little better observer of things. My opinion as I watched this object was that this was no bird or any other familiar or manmade object that I have observed.It appeared to us that this object was \"sampling\" the chemtrail. I have the photo and can send it to you. The shape of the object from the photo is really strange, not your typical UFO shaped object. I have read the statement on your page about pictures, but I am not sure how to send it via e-mail, let me know and I will do so. My only regret is not having my camera ready when I needed it, because I believe I could have gotten some outstanding shots when it was above us. I was stationed at two bases in Arizona, Davis-Monthan (Tucson), which was a Strategic Air Command Base, and Luke (Phoenix) which was at the time a Tactical Air Command Base, I was in the Air Police and I can tell you we saw and heard of very strange things. One of my duties was working the desk where I would field calls from citizens reporting UFO s, of course my instructions to them (since project blue book had been dismantled) was to call their local PD. So I \"know\" the deserts and the strange things that go on there. We will be back permanently next month with camera ready this time. To tell you the truth I dont think it will take much effort being in this area to get additional pics of more objects. Thanks Dan Baker The above number is only good until 050105 If needed for any reason I can be reached at my business line (anytime) at 1-877-274-3648"],"Country":"United States","Object Flight Path":"Stationary","Object Features":"Unknown","Region":"California","Longitude":"-122.325525","Object Shape":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.562992,+-122.325525(3371)&iwloc=A&hl=en\"> mufon case (3371) map </A>","Date of the Event":"04/26/2005 12:00 UTC","Sighting Duration":"Undisclosed","Log Number":"","City":"San Mateo","Weather Factors":"Unknown","Viewing Distance":"Unknown","trends":["There have been 6 other sightings in San Mateo","There were no other sightings in San Mateo on or around April 26th 2005"],"Date Submitted":"04/26/2005 12:00 UTC","Summary":"Not Provided","Case Number":"3371","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/3371.html.txt","/var/www/straped/mufon/org/3371.html"]}