{"Log Number":"US-11302011-0001","Date of the Event":"11/25/2011 11:45 UTC","Latitude":"37.859262","trends":["There have been no other sightings in Farnham","This sighting has never been favorited."],"Object Shape":"Unknown","Viewing Distance":"Unknown","Date Submitted":"11/30/2011 01:42 UTC","files":["/var/www/straped/mufon/html2text/33718.html.txt","/var/www/straped/mufon/org/33718.html"],"Country":"United States","Case Number":"33718","divs":["Sighting DetailsThis UFO sighting occured on a very clear but very dark northeastern night sky in rural Farnham Virginia on Thanksgiving 2011 (Thursday, November, 24th) at approximately 11:45 pm. My husband and I were watching the end of a movie, when I noticed a very bright light out of our window, which I initially thought was a star, probably Sirius. However, the star appeared to grow brighter and brighter. And then when we saw it move, we knew that this was neither a star nor an ordinary aircraft. The stationary sparkling light moved all around. We witnessed it dropping straight down, moving side to side in both directions, hovering, and ascending upwards and the back again to a stationary position. The light seemed to be more than one and grew so bright and randomly sparkly that it didn't seem like a sensible light for an aircraft. At the time, all I could think was that the blindingly bright pulsating lights like those would only impair a pilot's vision. My husband and I were so puzzled. We couldn't believe our eyes. We were both thinking the same crazy realization that we were witnessing something really significant, a UFO. We got our binoculars and stepped outside to make sure we were getting an unobstructed view. With the help of the binoculars, the large sparkling light now appeared to be a much wider horizontal band of bright, flashing, and pulsating sparkly lights that were so bright that the object behind and source of lights was hidden. Sorry for all the adjectives describing the lights, but these lights were not any ordinary lights, like from lightbulbs. I just remember a lot a pulsating light movement or random sparkling and perhaps hints of color in there too that I noticed but my husband did not. My husband describes the lighted object as slightly vibrating, fluttering or wobbling as it moved. I just noticed randomly pulsating movement of lights within lights giving off more light. The movement of the wide band of lights reminded me how Sirius gives off sparkle and color when you look at it with a naked eye, but one would have magnify that by at least 100 times. We were in awe. Then, to top it off, we witnessed a fallen star shoot off to the right. We immediately tried to get our video camera ready, but by the time we got our camera out of the cabinet and a tape ready to record, we returned to the back door to only find the lights were gone. My husband and I were amazed, and have to confess, a little unnerved by this experience, and so far have only shared what we witnessed with close relatives and now MUFON."],"Region":"Virginia","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.859262,+-76.566201(33718)&iwloc=A&hl=en\"> mufon case (33718) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Longitude":"-76.566201","Summary":"Hovering UFO with a multitude of horizontally band of blindingly bright sparkly lights appeared to move in unusual up and down, side to side movements.","City":"Farnham"}