{"map":"<A HREF = \"http://maps.google.com/maps?q=39.873303,+-75.088618(33717)&iwloc=A&hl=en\"> mufon case (33717) map </A>","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 3 other sightings in Bellmawr","There were no other sightings in Bellmawr on or around August 15th 2011","This sighting has never been favorited.",""],"Object Shape":"Bullet, Missile, Cigar, Cylinder, Square, Rectagular","Case Number":"33717","Region":"New Jersey","Latitude":"39.873303","Longitude":"-75.088618","Date of the Event":"08/15/2011 12:00 UTC","Weather Factors":"None","Summary":"Saw a large craft like object, no wings crossing road in south jersey","Source":"MUFON","Object Features":"Window(s), Other","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/33717.html.txt","/var/www/straped/mufon/more/33717_submitter_file1__ufo001.jpg","/var/www/straped/mufon/more/33717_submitter_file2__ufo2001.jpg","/var/www/straped/mufon/org/33717.html"],"divs":["Sighting DetailsI should have submitted this sooner. However, i didn't. Anyways, It was about 7pm, August 15th, 2011(still daylight, clear sky, and no clouds) and i was driving north bound on black horse pike in Bellmawr NJ. I pulled up to the light at wendys and i noticed what i thought was the front end of an airplane, about 75 to 100 yards in the air, crossing the black horse pike about a mile up ahead, going westbound. It was very low and big.I thought at first, wow, this plane is low, its gonna crash. But it continued. As it continued to cross it stopped, hovered for a few seconds, then proceded again. While looking at it, it didnt seem right... The front was rounded, but square, with no windows, but I noticed 3 or 4 windows on the side at the top, with more holes or exhaust ports on the side. It had a milky white color on the top half, and a dirty silvery metalic bottom. It was made of some type of metal, almost submarine like. As the back end came across, i was expecting to see a tail or tail wings, but there was no tail, just a little hump on the back end. It did not have any wings or rotar blades, it just drifted across the tree tops to the west and then it was gone. I was kinda taken back for a moment, like wow that was really freakin cool. I looked to the person in the car next me, to see if they saw what i saw. But they turned left and showed no interest. I serverd in the USAF as a Security Officer back in the late 90's and i have never seen a craft like this... To me it was a mix between a plane, a helicopter, a sub and a space shuttle rolled into one. The best way to describe its shape is, it looked like a flying metal loaf of bread... Very wierd, but cool..."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Flight Path":"Hovering then path,Path then hovering","City":"Bellmawr","Log Number":"US-11292011-0026","Date Submitted":"11/29/2011 11:36 UTC"}