{"trends":["There have been 7 other sightings in Nashua","There were no other sightings in Nashua on or around November 19th 2011"],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/33714.html.txt","/var/www/straped/mufon/org/33714.html"],"City":"Nashua","divs":["Sighting DetailsI was up very early soothing an infant. While lying on the couch I happened to notice what appeared to be an airliner jet pass by, which is very common for the area. I thought nothing of it at first, but then the object, which up to that point I could only make out as a series of blinking lights, abruptly started going in the opposite direction. Airplanes don't do that, I was thinking. I then observed the object move back and forth in a zigzag manner, then started strobing like a police car flashing, but only white light. Okay, weird. Itremained stationary while puting on this display. After about what seemed like a minute it became a very bright, single point of light which proceeded to move in an apparent straight line from south to north. It quickly went out of my line of sight and I had to run to a window at the opposite side of the house. I was able to get sight of it again and watched it for about another minute until it disappeared beyond the horizon. I was never scared. On the contrary, I was fascinated."],"Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Country":"United States","Region":"New Hampshire","Longitude":"-71.465156","Disposition":"Unresolved","Latitude":"42.769766","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.769766,+-71.465156(33714)&iwloc=A&hl=en\"> mufon case (33714) map </A>","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Weather Factors":"Unknown","Log Number":"US-11292011-0023","Date of the Event":"11/19/2011 05:50 UTC","Date Submitted":"11/29/2011 10:27 UTC","Case Number":"33714","Object Features":"Unknown","Summary":"Strobing light in sky. Moved straight like plane at first, then made zig zag maneuvers. Stopped strobing, became single bright white light moving from one end of the hoizon to the other, making abrupt minor course corrections."}