{"Object Flight Path":"Straight-line path","Longitude":"-91.884833","City":"Spooner","Date of the Event":"11/29/2011 05:55 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Sphere","trends":["There have been 5 other sightings in Spooner","There were no other sightings in Spooner on or around November 29th 2011"],"files":["/var/www/straped/mufon/html2text/33710.html.txt","/var/www/straped/mufon/org/33710.html"],"Tags":"City","Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsI was taking our three dogs for a walk down our drive way.I was headed west and say a large bright light off to my left.It was large and changing colors.I went back to the house as fast a possible to get my binocs and camera. went back out and watched it for a few more minn. then went in to the house and went up stairs to get a better look, as it was going out of sight. I knew it was a ufo when i first saw it,nothing casts a light like it did . it moved so slowly that it looked like it was standing still at first. Nothing could be that far away and be that big.The center was a large white ball shape that cast light off to its sides ,that must of been miles long.The light changed slowly, not like you see satellites at night change colors but slow.It just kept moveing w.sw. till it reached the tree line and i lost sight of it.MY feeling at the time were mixed.I knew that it was a ufo but my camera is a piece of crap. I text my friend in town to look for it . But she could not see it. I wass pissed ,becouse if i had taken the dogs out earlyer i would have gotten a better and longer look at it. And maybe I could have gotten on video like the last one i seen."],"Latitude":"45.829688","Case Number":"33710","map":"<A HREF = \"http://maps.google.com/maps?q=45.829688,+-91.884833(33710)&iwloc=A&hl=en\"> mufon case (33710) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-11292011-0019","Sighting Duration":"Undisclosed","Region":"Wisconsin","Summary":"round sphere,white, that cast changing colors of light to the sides ,very slow","Source":"MUFON","Date Submitted":"11/29/2011 09:13 UTC"}