{"Sighting Duration":"Undisclosed","Object Shape":"Cylinder","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Path then hovering","Longitude":"-119.919444","Log Number":"US-11292011-0025","Region":"California","Viewing Distance":"501 Feet - 1 Mile","Case Number":"33716","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.544444,+-119.919444(33716)&iwloc=A&hl=en\"> mufon case (33716) map </A>","Summary":"Late night UFO sighting in the hills, two witnesses.","Date of the Event":"11/29/2011 01:00 UTC","Date Submitted":"11/29/2011 11:18 UTC","Object Features":"Unknown","Latitude":"37.544444","City":"Midpines","files":["/var/www/straped/mufon/html2text/33716.html.txt","/var/www/straped/mufon/org/33716.html"],"Tags":"City","Disposition":"Unresolved","divs":["sighting detailsat about 1am in the morning my friend and i were sitting in his truck on a hill top in midpines, ca. we were both in deep conversation paying little attention to the darkness of the woods outside when i noticed some lights come around the mountain in the distance. at first it registered in my mind simply as a car coming around from the side of the mountain and i thought to myself \"oh, i didn't know the highway was right there\". interrupting himself in conversation, my friend then suddenly said \"look at that!\". he pointed towards the lights and i realized they were suspended in the air and actually flying\\hovering, moving in a weird up-&-down, side-to-side motion. the lights were orange that seemed to circle around the craft, or at least move from right to left down the side of the craft and a blue light that stayed in one place. completely shocked out of our minds, we both simultaneously opened our doors and got out of the car, not once looking away from the object. at this point it seemed to have stopped moving and was shining a light down into the trees below it (which seemed to be less than a hundred feet below). it remained there for the longest time, 10 or more minutes, so finally we had to get back into the car because it was freezing outside and we were shaking uncontrollably from the cold and the fear and excitement. by time we were in the car it seemed the object may have descended into the woods below because all i could see was a much dimmer version of the lights close to, or on, the ground. scared out of our whits, that's when we left."],"trends":["There have been no other sightings in Midpines","This sighting has never been favorited."]}