{"Object Features":"Dome, Patterned Surface, Other","Summary":"Disc shape with domes of lights rotating on top & bottom opposite directions","Region":"Arizona","City":"Mesa","Country":"United States","Tags":"City","Longitude":"-111.60491","Object Flight Path":"Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/33723.html.txt","/var/www/straped/mufon/org/33723.html"],"Date Submitted":"11/30/2011 11:31 UTC","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Disc","Latitude":"33.351439","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/30/2011 12:00 UTC","Log Number":"US-11302011-0006","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.351439,+-111.60491(33723)&iwloc=A&hl=en\"> mufon case (33723) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was sitting up in bed do soduku puzzel, hear and felt a low freguency loud hollow but strong vibrating sound (wauwn) pulsating very strong over house going east to west. I looked at clock next to bed it was 12:11, late to have anything flying around out there. I Thought,that doesn't sound like helicopter or plane which I hear coming from Williams Gateway airport. It was very low, I jumped up looked through blind two feet away from my bed and saw this hugh disc object with dome lights rotating opposite ways very vivid red orange color very clear in front of me in low in sky. I Thought I must be nuts I have never seen anything like this before in my life, I quickly shut off nightstand light to get better look pushed blinds away it was still there hovering, I very loudly yelled for my husband to get video camera and record it in the back yard. Now I'm blown away that it's just there and I am actually seeing this clearly! I grabbed my phone on nightstand and called my brother while it was still hovering telling him what I see and now I'm standing on back of small sofa and window edge to get better look because it now was getting lower and slowly moving away from me going west. I'm describing this and yelling it to my brother. I ran to backyard while My husband is filming it on camera but because he was moving he kept missing it. He did catch it on camera though. Then it got smaller and smaller, no sound and was gone west. When it left I got my ladder and brought it to the back yard to get a higher angle to see if I could see where it went or what. I called my brother and he said he was on his way over to my house from chandler, az. He arrived and we hooked camera up to television and all three of us watch it again and again."],"trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around November 30th 2011"],"Case Number":"33723"}