{"Log Number":"US-11302011-0008","divs":["Sighting DetailsI was on my way home from work that day and it was very cloudy all of a sudden. There were many different color clouds in the sky. I started taking photos while driving and when I got to the street lights along the way. I love looking at rainbows especially since I don't see them that often and when I saw these I noticed that there were two (one right behind the other). After I showed the photographs to a few people and not only thought they were odd, but that hey had never seen anything like that before. What I saw were two rainbows, they were not moving or anything, but they were in the clouds. They had what appears to be two headlights in front of one of the rainbow. By the time I reached home which was less than 30mins, they were nowhere in the skys, but there were still a lot of clouds."],"Date Submitted":"11/30/2011 01:02 UTC","files":["/var/www/straped/mufon/html2text/33725.html.txt","/var/www/straped/mufon/more/33725_submitter_file1__Picture018.jpg","/var/www/straped/mufon/more/33725_submitter_file2__Picture017.jpg","/var/www/straped/mufon/more/33725_submitter_file3__Picture016.jpg","/var/www/straped/mufon/org/33725.html"],"Country":"United States","Summary":"First I want to note that the object I saw and photograped was stationary and it first caught my attention because I was looking at the rainbows. There were two of them in the same place in the sky; one behind the other. b","Sighting Duration":"Undisclosed","Latitude":"38.638654","City":"Waldorf","Region":"Maryland","Object Shape":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.638654,+-76.903013(33725)&iwloc=A&hl=en\"> mufon case (33725) map </A>","Object Flight Path":"Stationary","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-76.903013","Date of the Event":"07/15/2011 06:31 UTC","trends":["There have been 3 other sightings in Waldorf","There were no other sightings in Waldorf on or around July 15th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Tags":"City","Object Features":"Unknown","Case Number":"33725","Viewing Distance":"Unknown"}