{"trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around August 8th 2011"],"Sighting Duration":"Undisclosed","Date Submitted":"11/30/2011 02:47 UTC","Tags":"City","Case Number":"33728","City":"Austin","Region":"Texas","Object Flight Path":"Other","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=30.241725,+-97.801876(33728)&iwloc=A&hl=en\"> mufon case (33728) map </A>","Log Number":"US-11302011-0011","files":["/var/www/straped/mufon/html2text/33728.html.txt","/var/www/straped/mufon/org/33728.html"],"Source":"MUFON","divs":["Sighting Detailsmy son and nephew and i were in a field when my son said whats that?? to the west there was an extremely bright orb. it slowly descended below the tree line. it appeared again at its previous location. it disappeared and reappeared very close to a passenger jet and a small twin engine plane.it disappeared again and appeared in the same location where it began. it then disappeared again. within minutes a very large black airplane flew directly overhead and i started to get concerned however my nephew said that it was a plane going back to fort hood after exercises. a few minutes later that black airplane circled back around over where we were and flew directly into the area where we observed the light. it circled around for a second time and flew again into the space where the light was. within a few minutes i realized that there were no planes taking off at abia because my house is directly in the path of planes headed west. in about 10 minutes 6 or 8 fighter jets flew directly over head and fanned out where the light was."],"Weather Factors":"Unknown","Latitude":"30.241725","Object Shape":"Sphere","Longitude":"-97.801876","Country":"United States","Date of the Event":"08/08/2011 12:00 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Summary":"extremely bright orb appeared to the west. slowly descended behind treeline. appeared again at its previous location. disappeared again and appeared by two airplanes. disappeared again and appeared in its original"}