{"Summary":"Not Provided","divs":["Sighting DetailsSighting Report: Walking outside I pointed out to my friend the three planets forming an arc around the moon. He looked up and then asked, \"Okay, but what s that?\" He directed my attention to a large V-shaped object smoothly moving across the sky, coming from the south and heading slightly toward the northeast. It was in the perfect shape of a V, sharp front point and very sharp tail points. It had no running lights and was barely visible. It seemed to be composed of numerous circular discs that had a slight glow, the color of the sky but just a tad brighter. The spaces between the discs were the same color as the night sky. There was no jet trail, but there were none from any other jets so the air at whatever altitude it flew must have been too warm. We waited until it reached the horizon to hear its engine. We never heard anything. This craft made no sound. Since it headed in the general direction of Edwards Air Force Base our assumption is that it might have been the next generation of stealth bomber. Its speed, in comparison with normal jet traffic flying at 30,000 feet, was almost identical. If it was traveling at that altitude, however, it would have to be 50% larger than a typical passenger jet."],"Longitude":"-118.361744","Region":"California","Date Submitted":"05/14/2005 08:00 UTC","Latitude":"34.090009","Sighting Duration":"Undisclosed","Case Number":"3372","Country":"United States","trends":["There have been 7 other sightings in West Hollywood","There were no other sightings in West Hollywood on or around May 14th 2005"],"Date of the Event":"05/14/2005 08:00 UTC","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3372.html.txt","/var/www/straped/mufon/org/3372.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.090009,+-118.361744(3372)&iwloc=A&hl=en\"> mufon case (3372) map </A>","Object Shape":"Triangle","Object Features":"Unknown","City":"West Hollywood","Log Number":"","Weather Factors":"None","Viewing Distance":"Unknown","Disposition":"Unknown","Object Flight Path":"Straight-line path"}