{"Log Number":"US-11302011-0003","divs":["sighting detailsat approx 9:17 pm i was traveling northbound i-5 approaching del paso exit i saw a craft shoot up from the ground and steadily rise up with a bright blue light, a shade of blue which i cant describe. it looked to be circular, but as it rose its lights made it look stealth bomber in shape. as it rose the lights changed to a green color then to a purplish pink. it then darted diagonal in multi directions and then went downward only to rise again. as the object entered my rear view mirror the colored lights were now a pale blue and it was hovering but making a small circle. it then dropped again and then i was out of view. this object was flying in\\ over a field and no other lights were present in the field. i called channel 40 news and there was no other reports. i was very excited to see an object of such beautiful lights, and was in awe as it went against all known physics. in my opinion, it could not have been man made. i knew immediately that it was not of this world or a remote control as it went too high, too low, too fast and too far. this happened before the fog came in so i got a clear view of it. i wanted to pull over to take a pic or video, but there was too much traffic on the freeway."],"Tags":"City","Source":"MUFON","Disposition":"Unknown","Region":"California","Viewing Distance":"20 Feet or Less","trends":["There have been 83 other sightings in Sacramento","There was one other sighting in Sacramento on or around November 29th 2011"],"Longitude":"-121.512239","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.62791,+-121.512239(33721)&iwloc=A&hl=en\"> mufon case (33721) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33721.html.txt","/var/www/straped/mufon/org/33721.html"],"Object Features":"Unknown","Summary":"northbound I-5, craft was to the right appeared circular but as it got closer appeared stealth like","Object Shape":"Disc, Triangle","City":"Sacramento","Date Submitted":"11/30/2011 06:37 UTC","Date of the Event":"11/29/2011 09:17 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Latitude":"38.62791","Case Number":"33721","Country":"United States"}