{"divs":["Sighting DetailsFirst of all, you should know that I have sightings every month, sometimes I have even six sights in a week. Because of that I borrowed a digital camera, so I can take pictures of something. Unfortunately the screen was broken so I wasn't able to see the focus but the camera did work. The day I borrowed the camera, I was in my house and I went to my backyard waiting for something to happen. It was about 7:00 PM when I went out, I waited for 10 minutes when the first UFO appeared I took several pictures (because of the screen broken I had to try a lot of shots). I'm used to the UFOs so I don't get scared anymore when I see them. But sometimes I really panic, I don't know why, and sometimes I feel peace. The object looked like a star, it was a point of yellow light. It was moving from South to North, it seemed to be pulsing. It never changed its speed or direction, but the intensity of the light changed from very strong to almost dissapear, it was random no secuence. I saw it for aprox. 2 minutes untill it disappeared on the horizon. 8 minutes later appeared another UFO about the same direction, and 15 seconds later another one appeared following a liitle faster with a slight different direction. Both were with the exact same description of the first one. I also took pictures. 20 minutes later appeared another one with direction from South-West to North-East exactly as the first one. Another one right after this one appeared from South to North. Also an airplane was crossing the sky at that moment. Then two UFOs came from South-West to North-East in slight different directions heading to same place. At some point of the sightings I called my mom so she can see them. I took about 80 pictures of the UFO with dgital zoom, because of the broken screen I only got one good picture. It's actually strange for me that at first look the object look like a point of yellow light in the pictures youo can see it's actual shape. It's an amorph solid with three differnt lights orbit around it. Pd. The digital photo I attached shows the UFO in the left upper corner"],"trends":["There has been one other sighting in Santa Tecla","There were no other sightings in Santa Tecla on or around December 6th 2010","This sighting has never been favorited.",""],"Region":"La Libertad","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Case Number":"33735","City":"Santa Tecla","Longitude":"-89.279393","Country":"El Salvador","Viewing Distance":"Unknown","Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=13.690343,+-89.279393(33735)&iwloc=A&hl=en\"> mufon case (33735) map </A>","Summary":"UFO flight in the sky, straight line","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"00:03:00","Log Number":"SV-11302011-0018","Latitude":"13.690343","Date of the Event":"12/06/2010 08:00 UTC","Object Shape":"Star-like","Date Submitted":"11/30/2011 11:02 UTC","files":["/var/www/straped/mufon/html2text/33735.html.txt","/var/www/straped/mufon/more/33735_submitter_file1__IMGP1581.JPG","/var/www/straped/mufon/org/33735.html"]}