{"Disposition":"Unknown","Longitude":"-119.240188","Date Submitted":"11/30/2011 07:38 UTC","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 4 other sightings in Lee Vining","There were no other sightings in Lee Vining on or around September 10th 2011"],"Summary":"Smooth, white object passed quickly behind mountain.","Country":"United States","Latitude":"38.02777","Case Number":"33733","Date of the Event":"09/10/2011 03:00 UTC","divs":["Sighting DetailsThis is the 2nd time I've seen what appears to be the same object. The first time it was traveling due south, this time due west. I spotted it just before it passed behind the mountain. The best way to describe the shape is to think of a Twinkie, but a bit narrower at the top, and the bottom is convex (rounded) instead of flat. It's white, with well defined edges. It doesn't look irregular, but appears to be engineered. I was standing at 7900' elevation looking south towards a nearby mountain (11,000+ ft) that forms part of the canyon I was in. The object caught my eye three or four seconds before it passed behind this mountain. It appeared to be moving fast. From where I stood, the summit of the mountain is not visible (I'm too close), so it's difficult to say if the object passed behind the mountain or over it. It moves in a straight line and doesn't appear to climb or descend. I almost didn't report this second incident (after reporting the first) because both events were rather unremarkable. Same mountain, but coming from different sides of it."],"Log Number":"US-11302011-0016","map":"<A HREF = \"http://maps.google.com/maps?q=38.02777,+-119.240188(33733)&iwloc=A&hl=en\"> mufon case (33733) map </A>","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/33733.html.txt","/var/www/straped/mufon/org/33733.html"],"Object Shape":"Other","City":"Lee Vining","Object Features":"Dome","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Weather Factors":"None","Region":"California"}