{"Summary":"4 white lights initially stationary: turned, flying closer; flew overhead very low, VERY slowly; no noise. Flew over building; disappeared before appearing on other side.","Country":"Canada","Date Submitted":"11/30/2011 11:31 UTC","Log Number":"CA-11302011-0020","map":"<A HREF = \"http://maps.google.com/maps?q=53.736518,+-127.646021(33737)&iwloc=A&hl=en\"> mufon case (33737) map </A>","Object Features":"None","Date of the Event":"11/28/2011 12:00 UTC","divs":["Sighting DetailsWas having a smoke outside of a non-smoking business premises and noticed 4 lights off to the southwest, The land there is flat and I wondered what the heck could those lights be in that area. They seemed one or two hundred yards away and no more than a hundred yards in the air, but it was dark and I had no terms of reference. I thought it might be float plane coming in to land but the lights didn't move. Then they seemed to turn a little to the north because the right hand two lights (vertically arranged) dimmed slightly, but again they didn't come any closer. Then the lights turned towards me and started moving. At that point I could see two flashing red lights between and even with the lower pair of 'headlights'. Again I assumed that it must be a float plane coming in to land (I was at a marina). But whatever it was moved incredibly slowly - much slower than a Sunday driver, maybe 15-20 mph - and flew almost directly over head - I'd guess at no more than a hundred feet up. I could not make out any outline of what it was - the lights didn't appear to reflect off of anything. But the strangest thing was that it was totally, totally silent. A helicopter or even an ultralight would make noise and float planes are loud. It went over the top of the single floor building, so I went inside and out the back (the north side) to see where it was going but it never showed up, as if it completely disappeared. I'd had one slow pint but was not remotely drunk. Just curious if anyone else noticed whatever it was. Thanks for your time."],"Longitude":"-127.646021","trends":[],"Object Flight Path":"Hovering then path,Path with directional change","Case Number":"33737","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33737.html.txt","/var/www/straped/mufon/org/33737.html"],"City":"Undisclosed","Region":"British Columbia","Tags":"City","Latitude":"53.736518","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Weather Factors":"Unknown"}