{"Object Features":"Unknown","trends":["There has been one other sighting in Greenwood","There were no other sightings in Greenwood on or around November 29th 2011"],"Longitude":"-94.351778","Region":"Missouri","Latitude":"38.858585","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Date of the Event":"11/29/2011 07:00 UTC","Object Shape":"Star-like, Other, Unknown","Country":"United States","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.858585,+-94.351778(33734)&iwloc=A&hl=en\"> mufon case (33734) map </A>","Log Number":"US-11302011-0017","Summary":"Had slight directional change, usually triangular, scarce long distance, left then came back twice","divs":["Sighting DetailsI was at a friends house outside smoking a cigarette when out of nowhere a very faint light just appeared below cloud cover. We stood there for about 30 minutes and watched it change directions in a triangular zig zag pattern. It would then hover for a few seconds and spin in one spot then move again. We stood there watching the \"orb\" do its thing for a minute asking ourselves what it was. We then thought nothing much of it and sat under the overhang just talking and I walked out to the yard to see if it was there and i caught a brief glimpse of the object traveling at a high rate of speed ascending out of the atmosphere into space i do believe. I went inside and about 10 minutes later i walked back out to my car and noticed that it had come back but in a different location in the sky. it was much lower this time and much brighter and discovered it had one large light in the center with three smaller lights around the center one in a triangular pattern. it was consistent in the same traveling path that it had before. I got my friends to come outside and look at it with me and we watched it for another 30 minutes and then it disappeared. My reaction to this was nothing other than just wondering what it actually was. I have had previous encounters with UFO sightings and am currently an amateur in researching the many unknown paranormal factors of our planet. i am convinced that this was a UFO of some sort and not a military aircraft of any kind. It was too high in the air for our aircraft to be piloted by man and had a much different flight pattern and speed than any manmade aircraft."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/33734.html.txt","/var/www/straped/mufon/org/33734.html"],"City":"Greenwood","Case Number":"33734","Date Submitted":"11/30/2011 10:41 UTC"}