{"Date Submitted":"11/30/2011 04:21 UTC","trends":["There have been 2 other sightings in Hercules","There were no other sightings in Hercules on or around May 15th 1997"],"Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-122.245402","Case Number":"33730","Source":"MUFON","divs":["Sighting DetailsMy children, an adult friend and I were camping out on the back lawn. It was a warm still evening. Very quiet - no city lights. We were looking up at the sky and from the horizon and passing directly over us was this HUGE, silent V shape of 5 lights. It made no sound and traveled in a straight slow line, directly over us. It took about a minute to pass completely and go on it's course. It looked like the Pheonix Light sighting. I cannot be sure of the exact month or day, but it was 1997. This was prob about 8:00 pm. My adult freind is a complete non-beleiver in UFO's and could not believe what we had all just witnessed. We were all silent and stunned at what we had seen. My kids (9 & 4) got scared and we all spent the night indoors. I'll never forget what I saw. I never saw anything in the paper about it -and I know that others must have seen it as well. This was the second incident within a period of about 2-3 weeks of lights in the sky. I will post a second report next. It was of random white lights about 25 degrees off in the distance moving WAY too fast and random to be explained by aircraft of any sort. It was also in Hercules."],"Weather Factors":"Unknown","City":"Hercules","Latitude":"38.002595","Object Features":"None","Tags":"City","Date of the Event":"05/15/1997 12:00 UTC","Disposition":"Unresolved","Region":"California","Log Number":"US-11302011-0013","Sighting Duration":"Undisclosed","Summary":"Very large V shaped, silent pass over UFO.","map":"<A HREF = \"http://maps.google.com/maps?q=38.002595,+-122.245402(33730)&iwloc=A&hl=en\"> mufon case (33730) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/33730.html.txt","/var/www/straped/mufon/org/33730.html"],"Object Shape":"Chevron"}