{"Weather Factors":"None","Latitude":"38.029501","Object Features":"Unknown","Source":"MUFON","Summary":"Pink misty Egg Shaped UFO hovers on top of roof.","Region":"California","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.029501,+-121.34245(33739)&iwloc=A&hl=en\"> mufon case (33739) map </A>","Date of the Event":"12/03/1999 06:30 UTC","Object Flight Path":"Stationary","Viewing Distance":"20 Feet or Less","City":"Stockton","Date Submitted":"11/30/2011 11:58 UTC","trends":["There have been 25 other sightings in Stockton","There were no other sightings in Stockton on or around December 3rd 1999"],"Object Shape":"Egg","files":["/var/www/straped/mufon/html2text/33739.html.txt","/var/www/straped/mufon/org/33739.html"],"Tags":"City","divs":["sighting detailsi was 9 years old, walking over to my neighbors house 2 doors down from my own early in the evening, a routine i did every single day. it was very dark outside, and the second i stepped onto the sidewalk, i saw a red\\pink egg shaped object about the shape of a minivan hovering silently on top of the house i was about to approach. it looked exactly like the red clouds that appeared later that night and earlier before the sun went down. the object seemed to be almost made out of light and fog, but also seemed extremely solid. i tried to scream, but i could not muster up a voice. i walked around the neighborhood staring at it making sure not to take my eyes off, and the object didn't budge or disappear. since nobody seemed to be noticing me in the middle of the street, i decided that it seemed that my friend was in immediate danger and that i should get as close to the object as possible and let them know there's an egg on their house. to approach the house and make a noise i had to knock on a door or a window which required taking my eye off the object for a second or 2. i decided it was worth the risk since my voice wouldn't work (probably due to nervousness), and i knocked on the door, jumped back to where i could see the object, and it was completely gone. at this point the sky seemed brighter, and my neighbors thought i had completely lost it. after this happened i felt compelled to not look into ufo's anymore until just this month."],"Longitude":"-121.34245","Case Number":"33739","Sighting Duration":"Undisclosed","Log Number":"US-11302011-0022"}