{"Region":"California","Country":"United States","City":"Desert Hot Springs","Case Number":"33740","Latitude":"34.033172","map":"<A HREF = \"http://maps.google.com/maps?q=34.033172,+-116.512487(33740)&iwloc=A&hl=en\"> mufon case (33740) map </A>","divs":["sighting detailslooking for others who have seen similar sighting: i am assuming this was some type of military experiment. i was the southern california desert driving south on winding a two lane highway west of palm springs at about midnight many years ago. i was laying in the backseat of a sedan looking out the rear window. the object caught my eye because it was moving and was so much brighter\\bigger than the stars in the sky. it was a round or spherical object emitting bright light in all directions (like a mini-sun). the light was bright white\\yellowish in appearance. the interesting thing was that several helicopters were circling the object, close enough to it that the helicopters were illuminated by it. only one chopper at first then several more joined it for a total of 5 or 6 then eventually only one helicopter remained. the object would move up and down and the helicopters would seem to follow. this happened for 10-15 minutes when eventually the object flew off into the desert. the object did not move quickly but sort of floated\\lumbered along. there was no engine noise i could hear. i saw a similar sighting on a tv show (that's incredible) years ago. wondering if it has ever been identified or explained. thanks."],"files":["/var/www/straped/mufon/html2text/33740.html.txt","/var/www/straped/mufon/org/33740.html"],"Log Number":"US-12012011-0001","Source":"MUFON","Longitude":"-116.512487","trends":["There have been 5 other sightings in Desert Hot Springs","There were no other sightings in Desert Hot Springs on or around December 25th 1983"],"Disposition":"Unresolved","Object Flight Path":"Hovering then path,Other","Object Features":"None","Weather Factors":"Unknown","Tags":"City","Date Submitted":"12/01/2011 03:21 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Date of the Event":"12/25/1983 12:00 UTC","Summary":"Bright (sun-like) object in night sky with helicopter(s) circling","Object Shape":"Circle, Sphere"}