{"Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=41.208322,+-77.188415(33743)&iwloc=A&hl=en\"> mufon case (33743) map </A>","Summary":"As if a star with personality and life in the sky that was playful and luring.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/33743.html.txt","/var/www/straped/mufon/more/33743_submitter_file1__-131.jpg","/var/www/straped/mufon/more/33743_submitter_file2__-129.jpg","/var/www/straped/mufon/more/33743_submitter_file3__-127.jpg","/var/www/straped/mufon/org/33743.html"],"Date Submitted":"12/01/2011 10:15 UTC","Longitude":"-77.188415","Country":"United States","Disposition":"IFO","Tags":"City","divs":["Sighting DetailsI received a phone call while I was doing dishes. My mother said um, look out side I just saw something you might want to see. In going outside I looked around the sky and in plain sight there is was! A star that had come to life. Had personality and spontaneity. Glowing in colors then back to a bright white. Aura at times was large and intense than a min later the object was a simple bright diamond. It seemed as is I could connect mentally some how finding this beautiful but inside I was kinda of frightened. My youngest daughter she is 6 was sitting with me as we watched this for over half an hour just dancing through the elevations. It would come pretty close then back off as if it were trying to blend in with the night sky. almost 7 years and a few months ago I saw a \"Beautiful\" sighting like this when I was driving home from my moms pregnant with my daughter that was watching it with me this past time. I took a few pictures of the sighting with my camera on a tripod! which means any kinda movement was captured for a split sec. We choose to come in when I felt like it was becoming to overwhelming. I dont truly know how to explain it but it was almost to sweet and playful that even my daughter was becoming way to comfortable with it getting closer. I chose to go inside. The next time we checked it was gone."],"Viewing Distance":"101-500 Feet","Latitude":"41.208322","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","trends":[""],"Date of the Event":"11/22/2011 06:30 UTC","Object Features":"Undisclosed","Object Shape":"Diamond, Star-like","Log Number":"US-12012011-0004","Case Number":"33743","Object Flight Path":"Path with directional change","City":"Undisclosed"}