{"files":["/var/www/straped/mufon/html2text/3374.html.txt","/var/www/straped/mufon/org/3374.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.055964,+-118.241925(3374)&iwloc=A&hl=en\"> mufon case (3374) map </A>","Log Number":"","Date Submitted":"04/03/2005 12:34 UTC","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around April 3rd 2005"],"Sighting Duration":"Undisclosed","divs":["sighting detailssighting report: on march 23rd while in miami beach florida during spring break week and wmc and m3. my friend and i were sitting out on the balcony of our ocean front room of the h.j. dezerland resort in miami beach, we witnessed some sort of ufo\\ light phenomenon occurring off the coast directly in front of us. the intense yellowish-orange light appeared over the water. it seemed to be getting brighter or the light was getting more intense and\\or it was coming closer to us. i asked him what is that? he replied,\"i don t know?\" i then told him that it was definitely something. meaning of a ufo nature. he nodded his head as we watched and observed. it was bright and directly in front of us but way out over the ocean. then, it would get dim and brighter and then dim. next, it went dim and was gone. now about 2 seconds later (almost instantly) it was back and with full intensity, but now it was at about 10 o clock not 12 o clock as it was before. then, it would do the same thing it was doing before. going bright and dim, back and forth again. then again, it went dim and boom there it was at full intensity but, now at between 2 & 3 o clock on the horizon. instantly. i took a few pictures of it with my cell phone camera. and i haven t tranfered them to my computer yet because i don t have the cable to do so. this all happened within about a 20 minute period and early in the evening at about 7:30-8:30 on a very good night sky."],"Source":"MUFON","Object Flight Path":"Undisclosed","Case Number":"3374","Viewing Distance":"Unknown","Date of the Event":"04/03/2005 12:34 UTC","Longitude":"-118.241925","Summary":"Intense yellowish-orange light, dims then intensifies then disappears and reappears","Latitude":"34.055964","Weather Factors":"Unknown","Object Features":"Undisclosed","Tags":"City","Country":"United States","City":"Los Angeles","Object Shape":"Undisclosed","Region":"California","Disposition":"Unknown"}