{"Date Submitted":"12/01/2011 06:43 UTC","files":["/var/www/straped/mufon/html2text/33742.html.txt","/var/www/straped/mufon/more/33742_submitter_file2__UFO-20111130-FlyRoute.jpg","/var/www/straped/mufon/org/33742.html"],"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Calvià","This sighting has never been favorited."],"Region":"Balearic Islands","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Shape":"Egg, Oval, Sphere","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.525638,+2.481519(33742)&iwloc=A&hl=en\"> mufon case (33742) map </A>","Weather Factors":"Unknown","Country":"Spain","Log Number":"ES-12012011-0003","Latitude":"39.525638","Date of the Event":"11/30/2011 06:03 UTC","Summary":"Dark object with blue or blue-whte blinking lights move in the sky en all directions.","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Object Features":"Dome","Longitude":"2.481519","Case Number":"33742","divs":["Sighting DetailsThe day was good and I sat with the computer to the balcony of my house. The apartment is on the top floor of a building of 5 floors in total. Suddenly I noticed a dark object static northwesterly a distance of 1.5 km from my point of view.The object was wobbling slightly and began a slight decline. At my side had the digital camera. I told my mom that there is a moving object in the sky, while I start a recording about 1 minute with the digital camera I told my mom to give me the video camera in order to obtain better images of the object. My mom handed me the camera, but the object disappeared behind the small hill. As I watched the object, I saw 3 white lights on it. The lights came on and off for 2 times. The area of the event is very close to the coast.This case is very unusual and strange to my, because the area where he was the object, is an air corridor and spend many commercial aircraft. This makes me think that the object in question is not human. That if any man has enough knowledge to make objects of this type will also have enough knowledge to not cause a plane crash playing a joke with potential witnesses."],"City":"CalviÃƒÂ ","Source":"MUFON"}