{"Tags":"City","Latitude":"41.433948","Region":"Pennsylvania","Log Number":"US-12012011-0005","divs":["Sighting DetailsAbout 40 years ago when I was about 14 (can't remember exactly) my mother & I were driving home from my grandfather's house in Scranton. It was early evening in summertime just after dark. We were on the Scranton Expressway heading east when we saw cars bumper to bumper pulled over. Then we saw three objects hovering low approximately 300 yards from the highway. Traffic slowed to a crawl watching these objects. They were golden in color and had some kind of appendage sticking out what I assume to be the front. We were totally awe struck by what we saw. There was no room to pull over so we kept going. I never observed the objects do anything but hover. When we got home we assumed it would be covered on the local news. It wasn't. I thought it would surely be covered in the Scranton Times newspaper. I searched the paper for days afterward but there was never any mention of it. There had to be at least fifty witnesses but I have never found anything more about it. This event stuck with my mother and I for a long time. My mother would sometimes look for objects in the night sky. In 1974 there was a UFO \"hoax\" nearby in Carbondale, PA. I quote hoax because my mother believed there was probably something to the story but was covered up. My mother was not the kind of person to believe in elaborate government conspiracies or anything but she truly believed, based on our experience there is something to the UFO phenomenon. Over the years I put it out of my mind almost afraid to talk about it. I figured people would either think I'm crazy or a liar. Things are different now. I have a lot of company. I have tried to find out more about what I saw but can't. I thought if I posted my account maybe someone else who was there that night might see it and add details I can no longer remember."],"Summary":"3 objects hovering low near the Scranton expressway about 1970","Object Features":"Appendage(s)","Date of the Event":"08/30/1970 12:00 UTC","trends":["There have been 28 other sightings in Scranton","There were no other sightings in Scranton on or around August 30th 1970"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.433948,+-75.668884(33744)&iwloc=A&hl=en\"> mufon case (33744) map </A>","Sighting Duration":"Undisclosed","City":"Scranton","Object Shape":"Disc","Viewing Distance":"101-500 Feet","Country":"United States","Date Submitted":"12/01/2011 10:29 UTC","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/33744.html.txt","/var/www/straped/mufon/org/33744.html"],"Longitude":"-75.668884","Case Number":"33744"}