{"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"33741","Longitude":"-84.824422","Date Submitted":"12/01/2011 02:32 UTC","Country":"United States","trends":["There have been no other sightings in Winston","This sighting has never been favorited."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.727253,+-84.824422(33741)&iwloc=A&hl=en\"> mufon case (33741) map </A>","divs":["Sighting DetailsWe just got home from visiting with friends about 11:45. I grabbed the dogs leash and took her out back for a short walk. It is a beautiful clear night so I was looking up at the stars when I noticed the object. It barely seemed to be moving. However I did observe it move to my left maybe an inch (from my point of view of course it could have been any actual distance) To the right, as well as both descend and ascend a short distance. It had red, green, blue lights as well as once brighter white light. It seemed to be either spinning, pulsating, or flickering the lights. By the way it is now 1:30am and this object is still within view if I step out onto my front porch. However it has slowly moved its way from seeing it straight off in front to about 45 degrees off to my right. My view of it I believe would be Southeast with it traveling South. My wife was a witness to this as well and she took digital pictures and at the advice of Tom Sheets (who I called on my cell) recorded digital video. i have attached a couple of these below."],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/33741.html.txt","/var/www/straped/mufon/more/33741_submitter_file1__DSC_0540.JPG","/var/www/straped/mufon/org/33741.html"],"Viewing Distance":"Unknown","Latitude":"33.727253","City":"Winston","Tags":"City","Date of the Event":"11/30/2011 11:45 UTC","Summary":"My wife and I saw a bright multi-colored object which seemed to be moving rather slowly in the night sky","Region":"Georgia","Log Number":"US-12012011-0002","Source":"MUFON"}