{"trends":["There have been 7 other sightings in Manheim","There were no other sightings in Manheim on or around November 19th 2011"],"Object Flight Path":"Hovering then path","Longitude":"-76.435417","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=40.222073,+-76.435417(33751)&iwloc=A&hl=en\"> mufon case (33751) map </A>","Date Submitted":"12/01/2011 12:37 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/33751.html.txt","/var/www/straped/mufon/org/33751.html"],"Source":"MUFON","City":"Manheim","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","divs":["Sighting DetailsMy son and I were traveling East towards Lititz Pa when we saw what we though was a hot air balloon in the distance. When we looked closer it was not But was the shape of a Balloon on top of another. It was light dull grey in appearance. We continued to watch from our car for a few minutes while driving. It was hovering and stationary. I than pulled over and parked my car to watch and it was gone. There was a steam trail straight up into the sky. Like what would be behind a jet. The trail went straight up until we couldn't see the end of it. We continued about what we were doing and later when we were leaving our destination approximately 5:00 we were traveling north and spotted lights in the sky the same shape as what the object was. When returning home we saw 2 of these lights. One to the SE and one to the West of our front porch. It was than dark and they appeared as stars. But shaped differently. I continue to keep my eye on them. About 7:00 I went outside with binoculars to see them better. The object to the West of me started to move sideways rapidly. I called my 14 yr old son out and he watched with me. The object was gone in a few seconds. I watched the one to the SE of us. It appeared to move west at a very slow rate. By morning they were gone. I did send another report seeing the same objects on 11-31-11"],"Summary":"Grey balloon shaped object","Weather Factors":"Unknown","Log Number":"US-12012011-0011","Object Shape":"Other","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Latitude":"40.222073","Tags":"City","Date of the Event":"11/19/2011 03:30 UTC","Case Number":"33751"}