{"City":"Hilton","map":"<A HREF = \"http://maps.google.com/maps?q=43.295046,+-77.786342(33756)&iwloc=A&hl=en\"> mufon case (33756) map </A>","Latitude":"43.295046","divs":["Sighting DetailsI was leaving the Topps supermarket in the village of Hilton, NY at about 5:05pm when a bright distant object in the South Western sky got my attention. Although likely several miles away, I noticed it looked like a pair of white lights, with one being slightly smaller and a bit dimmer than the other, but in tandem, or in very close proximity to each other. I observed it for about a minute and it remained stationary in the sky and the lights did not flash like any aircraft, but remained a constant brightness of white light. My impression was that it looked like I could make out the shape somewhat of a triangle, with one light larger and brighter than the other. It was too far away to be sure... I returned to my car to drive home, which is less than a mile away (a 2 minute drive), where I thought I might be able to get a better look through some binoculars, or possibly try to get a picture of it. When leaving the supermarket, I was able to see it through my drivers side car window up until I reached the road that I had to turn onto to get back home (Route 259 Southbound). It remained stationary the entire time. Once I turned onto my street (Sherwood Drive), I lost site of it. When I got home I had a clear line of sight to the area in the sky that the object was seen, but it was no longer there. I did see a aircraft at a much higher elevation passing above the area at 5:10pm."],"Object Features":"Unknown","Source":"MUFON","Log Number":"US-12012011-0016","Tags":"City","Date of the Event":"12/01/2011 05:05 UTC","Date Submitted":"12/01/2011 06:12 UTC","Summary":"Bright double light was stationary in South Western sky for 5 minutes.","Case Number":"33756","Region":"New York","Object Shape":"Star-like, Triangle","trends":["There has been one other sighting in Hilton","There were no other sightings in Hilton on or around December 1st 2011"],"Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/33756.html.txt","/var/www/straped/mufon/org/33756.html"],"Longitude":"-77.786342","Sighting Duration":"00:05:00","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown"}