{"Disposition":"Unresolved","Summary":"Move about 20 mph from Westminster to Garden Grove to Long Beach.","Weather Factors":"Unknown","Case Number":"33764","Object Features":"Dome","Log Number":"US-12012011-0024","Latitude":"33.757895","Object Shape":"Disc","City":"Garden Grove","Date Submitted":"12/01/2011 11:22 UTC","Source":"MUFON","Tags":"City","Longitude":"-117.956055","Country":"United States","divs":["Sighting DetailsI notice the glowing flashing white light silver disc shape hovering about 200 ft on Westminster and Magnolia at 6:40 pm when I stoped at a traffic light. The object was moving slowly north toward Anaheim, Ca. The silver matallic bright disc was moving slowly. You can see that it a silver metallic disc because it only 200 ft high with red flashing light. This is not the first time I seen a UFO. I saw a larger disc shape UFO back in July 2005 in Westminster, Ca. It was about 500 ft high hovering for 10 minutes. There was rotating light around the disc like red, white, blue, green, and orange. There was a bright light in the middle of the large UFO. Again 2 helicopter move toward this large object and it just took off in a second toward Seal Beach, Ca. I have no interest in UFO therefore it doesn't amaze me much. My only reaction is observe the object and tell my husband about it since he is the one that had an encountered with the third kind when he was a child. As I pulled into my community I seen the object heading toward Seal Beach, Ca. There is a naval base for submarine at Seal Beach about 10 mile from us and I sure there is Nuclear weapon underground there since my friend used to work at the naval base and that is what he told me. The helicopter was still circulating around Garden Grove for at least 10 minuters or so when I saw the UFO head toward Seal Beach. If anyone that was out in the street at 6:40 pm that night in Wesminster would seen the UFO since it flying so slow and low. I cannot take any picture because my 2 little boy was sitting in the back and my cell phone is in the back as well. Sorry."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.757895,+-117.956055(33764)&iwloc=A&hl=en\"> mufon case (33764) map </A>","Date of the Event":"12/01/2011 06:40 UTC","files":["/var/www/straped/mufon/html2text/33764.html.txt","/var/www/straped/mufon/org/33764.html"],"Object Flight Path":"Path with directional change","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around December 1st 2011"],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Region":"California"}