{"Date of the Event":"12/01/2011 06:45 UTC","Region":"Nebraska","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Case Number":"33762","files":["/var/www/straped/mufon/html2text/33762.html.txt","/var/www/straped/mufon/org/33762.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.812662,+-96.674379(33762)&iwloc=A&hl=en\"> mufon case (33762) map </A>","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsMy brother and I were heading home from Lincoln traveling east-southeast on Nebraska Highway 2. My brother says he looked over towards the southwest and saw a larger than normal light blink off. At first he thought he had caught a reflection of headlights off of the windshield but as he continued to watch he saw another light blink on followed by the first light blinking on again. He got my attention and I wanted to view the lights without worrying about driving off the road so I pulled onto the nearest gravel road and started heading south. The two lights were equidistant from each other and seemed to be drifting north-northwest slowly. We noticed three planes nearby, we could easily see their wing lights blinking in the sky. As we followed the country road south, first one light dimmed and then pulsed out then the other one. So we turned around and followed the gravel road back to the highway. We had no more than turned back onto Highway 2 (again headed southeast) when my brother shouted that the lights were back and brighter this time. So we again turned onto the next nearest road headed south. This time the lights were positioned further east of where they had been before. Just like before the lights would dim then brighten before they finally dimmed completely and then blinked out. Once again we turned around and headed back for Highway 2. We were back on Highway 2 just past Palmyra when once again the lights appeared and this time there were three bright yellowish orange lights that formed a boomerang shape. We watched for about three minutes as the outside lights would perform the brighten and dim pattern they had been doing previously while the center light stayed on and never dimmed or pulsed. After about three minutes the light on the left side dimmed quickly and went out, closely followed by the right one. The center light stayed on for about 30 more seconds before it too dimmed and went out. We did not see the lights again even though we continued to look for them for about 20 minutes."],"Summary":"Possible Boomerang Shaped Object in Southeast Nebraska","Date Submitted":"12/01/2011 10:32 UTC","Log Number":"US-12012011-0022","Latitude":"40.812662","Country":"United States","Weather Factors":"None","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around December 1st 2011"],"Object Shape":"Boomerang","Disposition":"Unknown","City":"Lincoln","Source":"MUFON","Object Features":"None","Longitude":"-96.674379"}