{"trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around December 1st 2011"],"Date Submitted":"12/02/2011 03:52 UTC","Object Flight Path":"Undisclosed","Longitude":"-119.766276","Date of the Event":"12/01/2011 01:50 UTC","Tags":"City","Weather Factors":"Windy","Object Features":"None","Sighting Duration":"Undisclosed","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.749627,+-119.766276(33767)&iwloc=A&hl=en\"> mufon case (33767) map </A>","Case Number":"33767","Summary":"White cigar shape hovering high above NE Fresno then disappeared. Reappeared illuminated then vanished before I could film it on my phone.","Disposition":"Insufficient Data","Source":"MUFON","Viewing Distance":"Over One Mile","Latitude":"36.749627","Log Number":"US-12022011-0003","divs":["Sighting Details On Thursday, December 01, 2011 at approximately 1350 hours, I was driving near the intersection of N. Figarden Loop near the European Grove in Northwest Fresno. In my periphery, I noticed a white sliver in the sky. I thought it was an airplane. I looked again but didn't see it. There were trees all around so I assumed it was an airplane flying beyond the trees. I WAS WRONG. I stared into the sky and saw nothing. My lady didn't see anything either. Then, it presented itself in the open sky. I was glad my lady witnessed it too because it's hard to articulate. It made no sound and seemed to hover above the city at an elevation slightly higher than airplanes. Based on what I saw, I estimate it to be about the size of about two football fields. It first appeared as a white cigar shape then it disappeared. About ten seconds later, it appeared again in the same location, but illuminated. I pulled out my smartphone to film it but before I could, it disappeared and was never seen again. I am also curious if anyone else saw this thing."],"Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/33767.html.txt","/var/www/straped/mufon/org/33767.html"],"City":"Fresno","Country":"United States"}