{"Weather Factors":"Unknown","Object Shape":"Sphere","Tags":"City","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around March 1st 1980"],"files":["/var/www/straped/mufon/html2text/33769.html.txt","/var/www/straped/mufon/org/33769.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI am reporting my first UFO sighting. At this time I was five years old. The weather was cool and crisp, so it was either early spring, or late fall of 1980, unfortunately I do not recall which one. The event occurred just west of I-435 on E 55th St in Kansas City, Missouri. My mother and I were in a chair under a blanket before bed time looking at the stars. On the same piece of property on it's north line is the far end of Brush Creek. Here the creek is tree lined. We were sitting there and suddenly, without have noticed anything previous a bright white orb appeared. Even at that age I noticed that it was very odd in the respect that although bright, it did not cast light on the trees and ground around it. The orb was larger than aspirin sized but smaller than a dime. This orb remained lit for nearly a minute. The light then went out. Without seeing any dark object, a few seconds later the orb reappeared 30-50 feet right of the position it had been previously. This time the orb appeared a deep dark crimson red, again casting no light. The orb remained lit for approximately the same amount of time it did originally. The light then went out and nothing more was seen of it. I remember discussing it with my mother, on how odd it was, and that it couldn't have been a helicopter as it made no noise at all. To this day, and in the past, my mother has no recollection of this event. My mother and I lived with my grandmother at this home. She was home, and inside at the time. I remember my mother and I telling my grandmother what we had seen. She too has never had any recollection of this event."],"Date Submitted":"12/02/2011 10:21 UTC","Viewing Distance":"101-500 Feet","Region":"Missouri","Longitude":"-94.514886","Country":"United States","Object Features":"None","Date of the Event":"03/01/1980 12:00 UTC","Summary":"Glowing orb","map":"<A HREF = \"http://maps.google.com/maps?q=39.028002,+-94.514886(33769)&iwloc=A&hl=en\"> mufon case (33769) map </A>","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Log Number":"US-12022011-0005","Latitude":"39.028002","City":"Kansas City","Case Number":"33769"}