{"Longitude":"-120.35515","Latitude":"36.145708","Object Flight Path":"Hovering then path","City":"Coalinga","divs":["Sighting DetailsWhile driving back home for Christmas break from San Diego to Hollister Ca, I stopped on a piece of property we own in a very secluded part of an unpopulated area to start a fire and get some rest before continuing north. Around 4 am I noticed an Orb straight above a Hill that hadn't been there before and it moved in a light circular pattern. I knew right away it was too bright to be a star but wasn't making a sound so it couldn't be a helicopter. I grabbed my i-phone and hoped it'd be able to catch it. Luckily it was the only object in the sky bright enough even though there where planets and thousands of stars out. After taking a couple short videos I became a bit uncomfortable being miles from the nearest human and out of cell distance for at least an hour. I got in my car and drove to the gate to lock it and leave but then when I got out from my car I saw the orb moving from the hill towards me, so I jumped in my car and left the gate open. I drove to the nearest house and parked outside but didn't want to alarm anyone at the easy risk of sounding like a crazy person. So I waited there knowing if anything happened I could honk my horn. I took a couple more videos of the orb which had followed me and soon decided to drive further to the next place I knew people lived and there was a land line. It followed me miles down the road where I stopped again. I took some more videos and felt a little less scared now. I had rationalized that if it was going to hurt me it would have already done it. I remembered that I needed to lock the gate so I reluctantly went back to lock it and the orb followed me back. Day was starting to break and I had drained the battery on my phone from all the videos but the orb continued to be visible during early morning after all stars disappeared. After I locked the gate I continued to drive home and look back every now and then but I lost the orb in the morning fog and never saw it again. As soon as I got home I told my parents even though I new it sounded crazy, I just felt I had to tell someone. They believed me because they knew I wouldn't lie about something like this. I'm a pretty skeptical person myself so I showed the videos to them and a couple friends. They didnt come out as good as I thought they would because the movement of the object was hard to see with my hand shaking and also on the I-phone the object appeared much smaller and less bright than in real life. I thought about reporting the sighting right away but didn't like the fact that already I was getting skeptical feed back from my friends and decided to stop telling people about it or showing the videos. But after hearing from many of the neighbors in that area, some very credible, that they had seen similar orbs, I decided to make this report."],"trends":["There have been 5 other sightings in Coalinga","There were no other sightings in Coalinga on or around December 11th 2010","This sighting has never been favorited.",""],"Date of the Event":"12/11/2010 12:00 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"A hovering orb appeared over me while camping in a very secluded part of our County. It moved in a slight circular pattern when stationed and continued to follow me for miles after I left my camp in fear.","Object Shape":"Sphere","Date Submitted":"12/02/2011 03:21 UTC","Log Number":"US-12022011-0004","Object Features":"None","Case Number":"33768","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/33768.html.txt","/var/www/straped/mufon/org/33768.html"],"Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.145708,+-120.35515(33768)&iwloc=A&hl=en\"> mufon case (33768) map </A>","Source":"MUFON","Region":"California","Tags":"City"}