{"Date of the Event":"11/27/2011 07:20 UTC","Sighting Duration":"Undisclosed","Region":"Missouri","Tags":"City","divs":["Sighting DetailsI am a police officer and was on duty the night of November the 27th in Lee's Summit, Missouri. I was at the intersection if 291 Highway and 150 Hwy when I noticed a round object with very bright white lights to my west. It would take a baseball held at arm's length to cover the object. The white lights had a blue hue to them and all of the lights were on the bottom of the craft. The lights were strobing, and there was no sound whatsoever. It was a clear night with no cloud cover, and the oject was very low, just above treetop level. I watched as it hovered, and filmed it with the dash cam on my patrol car for approximately 15 minutes, then finally turned the camera off because I didn't want to use up memory on the camera. I called dispatch, who got a good laugh out of it, but they wouldn't take me seriously. I requested a copy of the video when I arrived at the station and will forward that to MUFON when I get it. The object then moved to the west slowly at first, then sped up very quickly and was out of sight in a couple of seconds. I stopped at Quick Trip and several families came up to me and asked if I saw the UFO. I assumed that they would call in a report, but according to dispatch there were no other reports received. I am disturbed that something like this was not taken more seriously by my supervisor and looked into. I searched the internet and found Missouri MUFON, and decided to file an official report. I am a former Marine, have been a police officer for six years, and have never seen anything like this before. I am familiar with conventional aircraft, and this was not any type of normal aircraft. I saw a similar object on October 31 in the same location but did not file a report about it. This object was closer than the other one. I called another officer to come out and he saw the object, too. We both want to remain anonymous at this time. I am interested in helping investigate UFOs in this area."],"files":["/var/www/straped/mufon/html2text/33770.html.txt","/var/www/straped/mufon/org/33770.html"],"City":"Lee's Summit","Source":"MUFON","Country":"United States","Log Number":"US-12022011-0006","Disposition":"Unknown","trends":["There have been 52 other sightings in Lee's Summit","There was one other sighting in Lee's Summit on or around November 27th 2011"],"Latitude":"38.853154","Summary":"Round object with lights hovered over field then flew away very fast","Date Submitted":"12/02/2011 11:20 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.853154,+-94.396092(33770)&iwloc=A&hl=en\"> mufon case (33770) map </A>","Object Shape":"Sphere","Case Number":"33770","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Viewing Distance":"101-500 Feet","Longitude":"-94.396092"}