{"files":["/var/www/straped/mufon/html2text/33779.html.txt","/var/www/straped/mufon/org/33779.html"],"Source":"MUFON","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Case Number":"33779","Weather Factors":"None","Object Features":"None","Tags":"City","Log Number":"US-12022011-0015","Latitude":"45.827758","Date Submitted":"12/02/2011 08:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.827758,+-91.882953(33779)&iwloc=A&hl=en\"> mufon case (33779) map </A>","trends":["There have been 5 other sightings in Spooner","There were no other sightings in Spooner on or around December 2nd 2011"],"Disposition":"Unresolved","Longitude":"-91.882953","Date of the Event":"12/02/2011 05:20 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","City":"Spooner","divs":["Sighting Detailswhen i first saw it i was walking my dogs again. I looked south-west from were i was and noticed a very bright white light. I thought it might be a star but it was to bright and there are no planets in that direction that bright. i ran back to the house to get my camera and binocs. I got out to were i was an noticed it had moved a good distance. It was still whitish. But as i got my camera ready to try to video it,it started to change colors .For it being a cheep camera a coolpix L20 i didn't hope for much but i did get 48 sec.then 6 sec.When i could not see it in the camera anymore i watched it through my binocs for another 5-10 min. then went in to the houses second floor window and watched it till it went below the tree line, about another 5 min. IT changed colors from blue-white to yellow-orange to white to reddish orange. I felt happy as hell that my camera actually picked it up can't see but a faint light but on my 50 inch tv it looks a lot better.When i first saw it it had to be very close to me because as it headed s.sw. it got smaller and smaller.Not shure how to down load video to comp. ect I'm a comp dummy"],"Summary":"ufo seen the other night","Country":"United States","Region":"Wisconsin"}