{"Longitude":"-71.373477","map":"<A HREF = \"http://maps.google.com/maps?q=42.412291,+-71.373477(33777)&iwloc=A&hl=en\"> mufon case (33777) map </A>","Object Shape":"Other, Unknown","City":"Undisclosed","Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/33777.html.txt","/var/www/straped/mufon/org/33777.html"],"Viewing Distance":"Over 1 Mile, Unknown","Case Number":"33777","Date of the Event":"12/02/2011 03:30 UTC","divs":["Sighting DetailsOK I was sitting In my back porch with a friend around 3am smoking a cig. then all of a sudden he notices a \"star\" way brighter then the others that were up in the sky. So we watched it for awhile and it seemed very put. no movements what so-ever, Then All of a sudden around 3:30am or so, The \"star\" dimmmed very fast then brightened again but this time it seemed to be blinking rapidly. Now see, Im very sensitive when it comes to things like this. I was in shocked for at first, I thought it was nothing then we both saw the lights, We knew we had something here. The \"Star\" then after ten mins or so of the blinking, It started to move very slowly, but the thing we both notice was how it swayed from side to side, almost before every time it was going to move. Now by that time I instantaneously busted out in tears and my legs started to shake. I was very afraid, nervous, shocked, excited almost every felling you can think of. so after a hour or so of constant focus on this object, which has in the time span of 3:30-4:40 this \"Star\" has ascended, Descended, swayed and even looked like It zig-zagged in a falling motion but would stop and float back into a stationary postion.Another thing that chaught me off guard was that every timed It swayed There seemed almost like there were others things reacting to this star. For example, the First time we notice the movements or swaying of this \"Star' there was alot of shooting stars more then I have seen in one night and Then there was a orange \"UFO\" the appeared to the left of it almost same altitude as our \"Star\", But this object moved in a constant slow hover to the left and simply just dimmed away. So it is around 5am now and Im blown away now and my friend was very tired, so he had decided to hit the hay and I would stay and watch some more. I was so drawn to watch this I couldn't let it go. So I stayed out for another hour but what I noticed as I was out was around the sky there was more of them the the left and right but what almost seemmed miles away from eatch other, But they all seemed to be doing the same motion. They would sway and then drop very slowly then stop and sway and float back up.after seeing this I panicked and went back Inside and in the room to sleep. so Yea This is what I saw and well Im was blown away really. I always keep my eye in the sky but this, Lets just say I was not ready for this at all. I only wish there were more people to have witness this. This would have smacked people in the face with the truth. Wish I captured some footage but Im to broke for a camera or anythng at that matter but I know what I saw. And I felt you guys do to."],"Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Summary":"there was only one bright one but small orange spread across the sky","Latitude":"42.412291","Tags":"City","trends":[],"Log Number":"US-12022011-0013","Disposition":"IFO","Object Features":"Other, Unknown","Sighting Duration":"02:10:00","Date Submitted":"12/02/2011 05:29 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}