{"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.931868,+-121.695786(3377)&iwloc=A&hl=en\"> mufon case (3377) map </A>","Object Shape":"Undisclosed","divs":["Sighting DetailsSighting Report: Today June 10, at 8:45pm i saw somthing i cant explain. I went into my backyard to have a smoke and i was looking at the sky when i noticed what looked like a orangish-yellow orb in the sky. It was just hovering there, i could tell it wasnt moving becouse it was lined up with a street light. After watching this strange light for about a minute i noticed 2 more orbs, one on either side of it. They were in a row, equally spaced but on a slant. Like this: < < < They All three hovered there for about another minute, then the orb farthest to the right started slowling moving off in a straight line to the right. I looked back at the other 2 orbs and noticed they have both moved slightly to the right. At this point i have completely lost sight of the first orb that moved. Next the orb that was originally in the middle started moving slowly to the right the same as the last one did. I eventually lose sight of this orb also, The last orb followed and identicle path right untill i lose sight of it as well. I say i lost sight of them, but it was more like they just faded out or disapeared. Agian this sighting occurred in Brentwood, California at 8:45pm. If you need to contact me you can do so via email at SBenzler62@comcast.net. I am very interested to find out if anyone else in the area saw somthing similar. Thank you for your time. -Sean Benzler"],"files":["/var/www/straped/mufon/html2text/3377.html.txt","/var/www/straped/mufon/org/3377.html"],"trends":["There have been 5 other sightings in Brentwood","There were no other sightings in Brentwood on or around June 10th 2005"],"Object Flight Path":"Undisclosed","Date Submitted":"06/10/2005 08:45 UTC","City":"Brentwood","Disposition":"Hoax","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Summary":"Not Provided","Longitude":"-121.695786","Tags":"City","Latitude":"37.931868","Viewing Distance":"Unknown","Date of the Event":"06/10/2005 08:45 UTC","Object Features":"Undisclosed","Log Number":"","Weather Factors":"Unknown","Case Number":"3377"}