{"Region":"Oregon","Object Features":"Unknown","Log Number":"US-12022011-0014","Disposition":"IFO","City":"Salem","divs":["Sighting DetailsI had been cleaning gutters all day at work and was working on an atrium when suddenly I noticed a silvery white teadrop shaped object in the sky as I was rinsing down a gutter. I stopped and watched it and assumed it to be a very large balloon like the type used by car lots when thay are having a sale. It was about 3:35 pm in the afternoon. I looked away and looked back to make sure and watched some more and finally settled that this must be a balloon as it didn't seem to be moving under its own power but appeared to be slightly moving by wind alone. So in my mind this must be a balloon. I worked some more looked up and it was still visible. I watched yet again and was thinking about which car lot lost thier balloon. I turned to pick up the hose and switch it on looked back up and now there were three jet contrails in the sky with a jet visible where the object had been floating but the object was now gone. The jet and contrails continued south southwest the contrails stopped and then started again which I guess is caused by changing engine speed at high elevation. The jet continued away on its flightpath south. I thought it strange that this thing that I had observed and noted for several minutes and assumed to be a balloon should suddenly have a jet appear where it had been obviously visible and now the object was nowhere to be seen. I noted the time immediately after these events to be 3:43 pm when I actually thought to look at the time. I never heard noise from the balloon or jet which means it was very high up indeed. I would have been able to cover the object up with a bayer aspirin pinched in between my fingers."],"Country":"United States","Weather Factors":"None","Sighting Duration":"Undisclosed","Case Number":"33778","Source":"MUFON","Tags":"City","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around December 2nd 2011"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=44.882983,+-123.035498(33778)&iwloc=A&hl=en\"> mufon case (33778) map </A>","Latitude":"44.882983","Date of the Event":"12/02/2011 03:35 UTC","Object Flight Path":"Stationary","Object Shape":"Teardrop","Date Submitted":"12/02/2011 07:13 UTC","Summary":"Silvery white teardrop shaped balloon seen in Salem","files":["/var/www/straped/mufon/html2text/33778.html.txt","/var/www/straped/mufon/org/33778.html"],"Longitude":"-123.035498"}