{"Viewing Distance":"20 Feet or Less","Object Flight Path":"Undisclosed","Disposition":"Unresolved","trends":["There have been no other sightings in Campbellton","This sighting has been favorited 3 times."],"map":"<A HREF = \"http://maps.google.com/maps?q=48.00734,+-66.661149(33784)&iwloc=A&hl=en\"> mufon case (33784) map </A>","City":"Campbellton","Weather Factors":"Unknown","Date of the Event":"10/10/1991 11:00 UTC","Source":"MUFON","Date Submitted":"12/03/2011 01:17 UTC","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/33784.html.txt","/var/www/straped/mufon/org/33784.html"],"Longitude":"-66.661149","Region":"New Brunswick","Case Number":"33784","Object Features":"Undisclosed","Country":"Canada","Log Number":"CA-12032011-0001","Summary":"Two strange hooded teenagers (not sure exactly what they were).","Latitude":"48.00734","divs":["Sighting DetailsI want to tell you about a strange experience that took place at my house on Ramsay street in the fall of 1991. I believe it was the first weekend of October but I could be mistaken. It happened between 10:30 to 11pm. Earlier that night my parents had gone out to my aunts for the night. My friend \"K\" and I were the only ones home at the time. We had planned on going out to the clubs but first I wanted to finish my six pack. While sitting there watching music videos something in the window caught my attention. Across the street were two teenage boys, one was kneeling and the standing on the curb waiting for a drive. They both wore hoodee jackets with the hoods pulled up but I didn't pay much attention to them. About twenty minutes passed and they were still waiting for someone to give them a drive. At that point \"K\" slides open the little window open and shouted out loud \"you guys want me to call a taxi for you?\". They responded by coming over to the front door but before I got up to let them in I heard the door being kicked followed by the jiggling of the doorknob. For a moment I was worried the glass inside the door might crack. Entering the hallway I caught a glimpse of the taller guy but before I could get a good look at him he turned swiftly, bumping into his friend as they both ran away. I hurried outside to speak with them but neither of the two responded to my questions so I got fed up and went back inside for another beer. While I was in the kitchen \"K\" called to me \"they are in the window\". I returned into the room to see \"K\" talking though the glass to the boys in the hood. He asked them if they like to call someone. Suddenly the taller guy looked directly at us. We both saw his face. Whoa...what the ****? There is something really odd about this guys face. Aaaaah!!! This was not some sort of deformity either. I have met my share of shady looking characters but this fucker was something else entirely. Now that I think of it I don't think it was human. Not exactly sure what it is. All I saw was this broad grim faced thing with dark eyes and I don't recall seeing a nose. A rather menacing face to say the least. Now the adrenaline is pumping so I ran outside anticipating a fight. \"K\" tried to hold me back but it was too late. We both pursued them into the driveway. The two of them waited for us. Just as one of us attempted to get closer they would advance further into the yard. There is no fence. The Yard empties into a large field. It's just too dark to pursue them any further and I wasn't willing to take chances knowing there could be more of them. What ever they are. I do recall saying out loud \"this is private Property.\" and \"you are trespassing.\" These two bastards slowly made their way back with their hoods pulled up. The last we saw of them they were swiftly walking down Ramsay street. The remaining hours of the night was uneventful. What was really weird is how \"K\" no longer wanted to go to the pub crawl. instead he went home. We never spoke of the event until several years later. --------------------------------------------------------------------------- What is so strange about that night was everyone left the house before 10 O'clock. There was little to no traffic. The place was completely deserted just like an old western town. These hooded bastards had the perfect opportunity to do whatever they wanted. To this day I can not fathom what had transpired. I'm not sure is they were spirits or something else entirely. All I know is they tried to communicate with me but at the time I didn't take it as a friendly encounter. I felt threatened and scared like a wounded animal which made me want to lash out. Whatever the message was it clearly didn't get through to me. Now that I think of it they were also afraid of us too. The taller guy ran out of the porch as I entered the hallway. They both retreated into the yard as we pursued them. When I told them to \"leave\" they cautiously walked towards us being careful not to show their faces then swiftly made their way down the street. So weird!!!!! \"K\" and I never spoke about it for many years. One night there was a party at his place. We sat outback next to the bonfire when someone began telling ghost stories and \"K\" interrupted \"\"R\", remember those two guys we saw in the window?\".... He remembers, so it wasn't a dream."],"Object Shape":"Unknown"}