{"Viewing Distance":"Over One Mile","City":"Ellingham","Source":"MUFON","Tags":"City","Object Shape":"Fireball, Sphere","Date Submitted":"12/02/2011 08:14 UTC","Disposition":"Unknown","Latitude":"33.843771","divs":["Sighting DetailsI was driving south on Hwy 52 thru Effingham around 7:30 when I noticed to my left which would have been east, a few lights that appeared in different spots. The trees kept blocking my view so when I got to a town called New Hope, I pulled over where I had a good view of the sky. I was on the phone with my girlfriend at the time and was telling her what I was seeing as it was happening. While I was sitting in the car, they started again. A bright reddish-yellow light would appear and as that one seemed to turn off or disappear another one appeared which at arms distance, would have been a few inches apart. I counted 7 of these at this time but they weren't all lit at the same time. It seemed like they were synchronized in disappearing and reappearing. Each one would stay lit for a couple of seconds or so. I did see around 4 lights at the same time which told me it was more than one and not something that was traveling while blinking on and off. After that, I didn't see anymore so I started home which was only a few more miles. When I got on my road, I saw two more light up at the same time which were further south and at arms distance would have been about 8 inches apart but seemed further away towards the town of Lake City. They all had about the same magnitude in brightness, even the ones that were far away. I noticed a lot of airplanes in the sky while this was happening but all of them seemed to be much higher then the lights I witnessed and I also had my girlfriend go outside while still on the phone and listen for jets but heard nothing. What's strange is, I've seen the same thing happen close to same area over a year ago but was only around 3-4 lights but would light up as the one beside it would go out. Last night though, I ruled out fireworks because of how much area they covered. I have no idea how big these things were because I don't know how far they were away. I am always looking for ufos and see so many strange things but fail to document them. These were so bright that they had to have been seen by a lot of people so I felt the need to share my experience. I don't think they were flares either because when I saw the multiple display, I was looking right at them. They just appeared and disappeared and were stationary when they did so and seemed to be too low to the ground at times. This event I witnessed probably happened over a 20 minute period or more. Also, I almost forgot, but before I got to Effingham, looking out near the top of the windshield, I saw what appeared to be something burning up in the atmosphere, like what people would call a shooting star, but it had a green tail behind it as is faded out. It all happened so quickly and this was approximately 4-5 minutes before seeing the other lights. I just thought about that and not sure if they were connected. Seeing things burn up as they enter is not uncommon, but I've never seen one that had that greenish tail behind it. Might be a crazy December, hopefully."],"Weather Factors":"None","Object Flight Path":"Stationary,Other","Log Number":"US-12022011-0016","Date of the Event":"12/01/2011 07:30 UTC","Country":"United States","Case Number":"33780","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Ellingham","This sighting has never been favorited."],"Region":"South Carolina","files":["/var/www/straped/mufon/html2text/33780.html.txt","/var/www/straped/mufon/org/33780.html"],"Longitude":"-81.160794","Object Features":"Undisclosed","Summary":"Lights that appeared in different spots. As soon as one would","map":"<A HREF = \"http://maps.google.com/maps?q=33.843771,+-81.160794(33780)&iwloc=A&hl=en\"> mufon case (33780) map </A>"}