{"Summary":"First viewed as two parallel lines of lights moving south, three on each side.","Date Submitted":"12/02/2011 08:40 UTC","Longitude":"-75.623965","Sighting Duration":"Undisclosed","trends":["There have been 28 other sightings in Scranton","There were no other sightings in Scranton on or around November 30th 2011"],"divs":["Sighting Details I opened my bedroom window before getting into bed (about 11:20 PM) As I opened the window I discerned two parallel lines of lights staggered from each other with the two back ends closer to each other than the front ends. There were three lights on each line and one red light at the tail end . The other lights were yellow. The lights moved from north to south at a moderate speed. At first I dismissed the lights moving south to the Avoca Airport south of Scranton. As the group of lights passed directly in front of my line of sight they changed into a squat (almost square) rectangle. There were the same three lights on each side with the red in the back but now the center of the rectangle displayed in a random pattern and randomly blinking at least four more yellow lights. As it continued south it became triangular reminding me of a flying christmas tree. I feel this change of shape occured either because (the craft??) banked left or one of the front lites turned off. There was no sound except for a very light drone. I don't think this object was more than 8000 ft. high. IF it was a plane I should have heard the engines and it was the damndest assemblage of lights I ever saw on a plane."],"Country":"United States","Object Shape":"Square, Rectagular","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/33781.html.txt","/var/www/straped/mufon/org/33781.html"],"Case Number":"33781","Source":"MUFON","Disposition":"Unresolved","City":"Scranton","Latitude":"41.424564","Weather Factors":"Unknown","Date of the Event":"11/30/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.424564,+-75.623965(33781)&iwloc=A&hl=en\"> mufon case (33781) map </A>","Object Flight Path":"Straight-line path","Log Number":"US-12022011-0017","Tags":"City","Region":"Pennsylvania","Object Features":"Undisclosed"}