{"Case Number":"33785","Source":"MUFON","Longitude":"-85.314714","Tags":"City","Disposition":"Unresolved","Date Submitted":"12/03/2011 01:38 UTC","Country":"Canada","Weather Factors":"Unknown","Object Flight Path":"Stationary","City":"Undisclosed","Date of the Event":"12/03/2011 12:00 UTC","Viewing Distance":"Over One Mile","Summary":"bright hovering slightly pulsating yellow-orange light that disinegrated to nothing","divs":["Sighting DetailsAs I was looking north - northeast from my bedroom window just as I was about to go to bed, I saw a very distinct and very bright yellow light pulsating low on the horizon. I figured that it was an aircraft flying toward my direction, and I woke my wife to say that I was seeing the same type of light that I saw when I last reported to you. The object was moving slightly and pulsating, but like last time, the light faded very quickly and completely vanished. It did not go behind trees, nor did clouds cross my sight line with the object. Any aircraft that I've ever seen in the night sky does not suddenly fade and vanish that abruptly, and I have not ever seen any aircraft that bright in the night sky. There were no flashing lights, but this bright light did pulsate slightly before it faded to nothing. Any aircraft that I've seen change direction at least still shows flashing lights on its wings as it changes direction or angles, but that did not happen with this object, and as I said this light was far brighter than any aircraft I've seen in the night sky. This is my report, it occurred at 12:40 at night, December 3rd, 2011. Note that I live in a very rural and wooded area in otherwise very open agricultural and urban southwestern Ontario, Canada. This object appeared approximately 2.5 - 3 km north of Lake Erie, north of Port Bruce and south of Aylmer, Ontario. There is no tower or any other light that could explain what I saw, however I realize that the fact that this sighting was an almost exact replicate of what I saw and reported previously, it would lead anyone to think that there must be a human-source explanation for what I saw, and if so, I would really like to know what that could be."],"map":"<A HREF = \"http://maps.google.com/maps?q=51.258665,+-85.314714(33785)&iwloc=A&hl=en\"> mufon case (33785) map </A>","trends":[],"Latitude":"51.258665","Object Shape":"Star-like","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Log Number":"CA-12032011-0001","Region":"Ontario","files":["/var/www/straped/mufon/html2text/33785.html.txt","/var/www/straped/mufon/org/33785.html"]}