{"Log Number":"US-12032011-0011","Region":"New Jersey","divs":["Sighting DetailsPrompting this communication with you was a recent episode of the History Television Channel program \"Brad Meltzer's Decoded: UFOs.\" 42 minutes into the show the hosts interviewed a man identified as John Callahan, a former FAA Investigator who said he was Branch Manager of NAAFEC which was the former name of FAATEC located on property adjacent to the Atlantic City, NJ airport (ACY). He described interaction with some type of unidentified flying entity that was larger than several 747 aircrafts. Although no date was given within the TV program, he indicated the incident happened during the presidency of Ronald Reagan. Mr. Callahan's words rekindled memories of a similar incident I had in 1967-68 near ACY. I lived in Delaware at the time. A friend and I were on the way home after visiting Atlantic City. Our travel was on U.S.40, a highway that starts just west of Atlantic City, proceeds west through wooded terrain (the New Jersey Pine Barrens) near the city of Mays Landing, with the first segment of the highway ending at the NJ side of the Delaware Memorial Bridge. The night sky was totally clear and at some point within the route where there were no city lights, we were attracted to something huge and triangular over our heads. Knowing we were near NAAFEC, we naturally presumed the object was some type of craft originating from that facility and in no way questioned its legitimacy. Although my sighting was more than a dozen years before the one reported on the recent television program, my recollection of the 1967-68 event has a similarity. I am, therefore, reporting it to you thinking it may be one in a string of documented incidents near the experimental station that was NAAFEC. If you so desire, I shall be pleased to offer you any further information I can recall about what I experienced."],"trends":["There have been 3 other sightings in Hamilton","There were no other sightings in Hamilton on or around September 15th 1968"],"files":["/var/www/straped/mufon/html2text/33794.html.txt","/var/www/straped/mufon/org/33794.html"],"Summary":"Large triangular object above tree tops blocking out clear start-lit nighttime sky","Weather Factors":"None","Object Flight Path":"Straight-line path","Longitude":"-74.720353","Object Features":"Unknown","Date of the Event":"09/15/1968 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.454608,+-74.720353(33794)&iwloc=A&hl=en\"> mufon case (33794) map </A>","Object Shape":"Triangle","Date Submitted":"12/03/2011 02:23 UTC","Disposition":"Unknown","City":"Hamilton","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"39.454608","Case Number":"33794","Source":"MUFON"}