{"Weather Factors":"Unknown","Object Features":"Patterned Surface","City":"Blue Lake","Case Number":"33795","Source":"MUFON","Date Submitted":"12/03/2011 03:42 UTC","Summary":"bright pulsating sphere hovering on tree line and sky","Longitude":"-123.988922","Disposition":"Unresolved","Object Shape":"Sphere","Date of the Event":"12/02/2011 12:00 UTC","Region":"California","divs":["Sighting DetailsDecember 2 2011 6 pm (dark) me and my boyfriend went outside on our porch to smoke a cigarette when we noticed a bright light that i thought was the north star, soon realized the direction it was in was south. surprised boyfriend ran to get a phone to try and take a video as it started to jump around in all different direction light up and vanished through thin air. In astonishment we called the news channel KIEM 3 and we asked if anyone else seen the unidentified object. unfortunately no one reported anything so we hung up and went on with the rest of our night. Later that evening 12:00 pm looked in the sky and seen another two, looked to be sphere like object. One of the objects was located at the back foot of Orion and the other was located below the little dipper and to the right. these things were crazy never seen anything like it. Ive seen weather balloons before and satellites but nothing even can compare to these spheres shaped objects. so me and my boyfriend ran in the house grabbed my mom and her video camera and took a video on a camcorder . the objects would let you zoom in on the sphere and it was so hard to keep it in the screen it was shaking and jumping around. still taking video . my boyfriend grabbed his binoculars and was looking at the object. you could see so much detail it was bluish glittery field around the flying object and had red crater looking markings ,kinda looked like a \"jellyfish\" it honestly appeared to look like a bottom of a ship> and all the markings were like shimmering and wiggling looked like to have things actually crawling on it kinda creepy> called friends in Arcata CA, located 8 miles south of Blue lake that also seen the sphere moving around all erratically seriously kinda freaked out a little. some other people had to be looking in the sky and seen it too ."],"trends":["There has been one other sighting in Blue Lake","There were no other sightings in Blue Lake on or around December 2nd 2011"],"Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/33795.html.txt","/var/www/straped/mufon/org/33795.html"],"Viewing Distance":"Over One Mile","Log Number":"US-12032011-0012","map":"<A HREF = \"http://maps.google.com/maps?q=40.884023,+-123.988922(33795)&iwloc=A&hl=en\"> mufon case (33795) map </A>","Latitude":"40.884023"}