{"Object Flight Path":"N/A","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-92.498056","Object Shape":"Circle","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12032011-0010","map":"<A HREF = \"http://maps.google.com/maps?q=34.900556,+-92.498056(33793)&iwloc=A&hl=en\"> mufon case (33793) map </A>","Date of the Event":"12/02/2011 09:45 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI was driving home from a concert in my car, my mom was following behind me in her car. We were driving down HWY 300 about to turn on the Roland Cutoff. I was about 20 feet ahead of her but I could still see her behind me. The road was straight and this blue orb-like ball of light appeared out of the left of my view. I don't know how long it had been there but it was def. apparent. It was cloudy last night and the stars were not evident but this could be seen through the clouds. It didn't move and then all of the sudden it kinda disappeared and two smaller orbs (which were still fairly big) fall side by side straight down very quickly towards the ground. There was no descent like an airplane or even a helicopter. There were no extra lights like an airplane or helicopter beacon either. What was weird about it was the size of these orbs, the color, and the speed at which they fell. It looked like the law of physics were abnormal. I've seen many \"falling stars\", I don't think this was one of them. As they fell I could see them through the trees, but lost sight before they hit the ground. When the orbs fell there was no trail, no exhaust or smoke even though they fell through the clouds. My mom flashed her lights at me when I lost sight, signaling that she that. I was freaked out and just wanted to get home. when I was looking at the object at first it just baffled me but I knew the only option it could be was a falling star, I told myself falling stars have to be in transit they can't sit still. Once I answered that question I felt unsafe, and I didn't want to linger someplace where I was unsure what was going on. My mom however slowed down but never saw anything else. When she got home she asked if I saw that and I told her everything in front my dad and both out stories matched. some bushes along the roadside kept me from seeing the object as it went into the forest."],"Latitude":"34.900556","Region":"Arkansas","Summary":"orb like stationary then broke off into two and very quickly moved towards the ground.","files":["/var/www/straped/mufon/html2text/33793.html.txt","/var/www/straped/mufon/org/33793.html"],"City":"Roland","Date Submitted":"12/03/2011 02:05 UTC","Case Number":"33793","trends":["There have been no other sightings in Roland","This sighting has never been favorited."]}