{"City":"Port Huron","trends":["There have been 11 other sightings in Port Huron","There were no other sightings in Port Huron on or around December 3rd 2011","This sighting has never been favorited.",""],"Country":"United States","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=43.015123,+-82.439317(33792)&iwloc=A&hl=en\"> mufon case (33792) map </A>","Longitude":"-82.439317","Summary":"I was taking picture of the sky and when I put them into the computer I realized there were some strange lights and objects in the Pictures!","Region":"Michigan","Object Features":"Undisclosed","Log Number":"US-12032011-0009","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/33792.html.txt","/var/www/straped/mufon/more/33792_submitter_file1__075.JPG","/var/www/straped/mufon/more/33792_submitter_file2__074.JPG","/var/www/straped/mufon/more/33792_submitter_file3__062.JPG","/var/www/straped/mufon/org/33792.html"],"Tags":"City","Weather Factors":"Unknown","Object Shape":"Cylinder, Square, Rectagular, Star-like","Latitude":"43.015123","Case Number":"33792","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsI was taking pictures of the jet con-trails this morning around 9:45 AM out my front 2nd floor bedroom window. I was going back and forth between the front windows and the back windows of our house to get pictures of the Eastern and Western skies. The front windows face East and the back windows face West. At the time of taking the pictures, I was not aware of the objects or lights. I downloaded the pictures unto our computer and began adjusting the brightness and contrast to bring out the con-trails in more detail. That is when I noticed these objects and lights in the pictures! When I took some of these pictures, I held the camera without looking through the view finder, because I was getting to think that the neighbors would see me taking pictures of the sky outside my window, and wonder what the hell I was doing. So unfortunately, I was not looking out the window, but, just watching how I was tilting the camera upward to get a good shot of the sky. So, I was surprized to find that several shots had these strange objects and lights!"],"Object Flight Path":"Path then hovering,Unknown","Source":"MUFON","Date Submitted":"12/03/2011 12:22 UTC","Date of the Event":"12/03/2011 09:45 UTC"}