{"files":["/var/www/straped/mufon/html2text/33803.html.txt","/var/www/straped/mufon/org/33803.html"],"Summary":"looking over a ridge towards a mountain from my cabin","trends":["There have been 9 other sightings in Brunswick","There were no other sightings in Brunswick on or around December 1st 2011"],"Region":"Georgia","Disposition":"Unresolved","Sighting Duration":"00:05:00","Tags":"City","Longitude":"-81.470075","Object Features":"Undisclosed","Date of the Event":"12/01/2011 04:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.213084,+-81.470075(33803)&iwloc=A&hl=en\"> mufon case (33803) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Log Number":"US-12032011-0020","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Brunswick","Source":"MUFON","divs":["Sighting DetailsIt was early A.M. and I couldn't sleep, so I went out to the back porch to have a cigarette. I noticed the shape of the object first, because the lights were so different from anything else I had ever seen. The object was vertical, cigar-shaped with pulsing multicolored lights on surface. It was the border of lights that caused me to determine the shape of the object. It made no noise. It was much to large to be an airplane and there were no flashing red or white lights. I thought helicopter,except it was dead quiet and it was close enough that I would have heard a helicopter. It was the multicolored lights that made me realize it was a UFO. No commercial or private aircraft have light arrays like that. It moved very slowly from NE to SW, and I moved on the porch to get a clear view through the trees. As it appeared between the trees I got a very clear view of the object. I didn't see any more of a surface of the object like a wing or fuselage only the lights which, as I said, determined the shape to me. I had no feeling of dread or anything negative, except that I have never seen or experienced anything like this. The object made its way slowly across the horizon until it disappeared behind the house next door. It took a bit to believe what I was seeing, but I accepted it easily. Still I didn't relate it to anyone until the afternoon. It was unlike anything I have seen before."],"Date Submitted":"12/03/2011 09:31 UTC","Case Number":"33803","Latitude":"31.213084","Weather Factors":"Unknown","Object Shape":"Cigar"}