{"Object Shape":"Circle, Disc, Oval, Sphere","Region":"North Carolina","Source":"MUFON","Summary":"I saw through my window in the early evening a large(fast traveling) oval shape flying","Object Flight Path":"Straight-line path","Longitude":"-80.595213","Date of the Event":"12/03/2011 08:35 UTC","Case Number":"33809","Sighting Duration":"Undisclosed","Date Submitted":"12/04/2011 11:19 UTC","trends":["There have been 3 other sightings in Monroe","There were no other sightings in Monroe on or around December 3rd 2011"],"Latitude":"34.880817","divs":["Sighting DetailsI was sitting on the couch in our den last night watching TV. Right behind my TV is a large window without curtains etc; we live in the country. My wife was sitting to the left in the recliner. The night sky, that I saw through the window was dark; it was approximately 8:45pm. The object I saw was extremely bright and very large. It appeared to be solid,almost circular, more like a oval shape. It was traveling extremely fast. I only saw it for about 3 seconds; but definitely long enough to realize it was not a star, it was not a meteor(no trail). It disappeared in the clouds almost instantly; with no signs of light behind the clouds. After I saw the object, of course I was telling my wife while it happened; she was not sitting in the view of the object and did not see it. I went outside immediately to my back porch to see if there was anything else in the sky that was unusual. I did not see anything. About ten minutes later I did notice several airplanes in the sky that appeared to be flying same altitude, etc...more than likely..nothing. What I did find weird! I tried to call my brothers to tell them of my experience, and I had no signal on my cell phone; although my wife did. I have Verizon service and see has T-mobile..I called Verizon; using her phone and I was told there was outage in numerous area's in North Carolina..Might have been a coincidence! Then again, maybe it wasn't!"],"Viewing Distance":"Over One Mile","Log Number":"US-12042011-0004","Object Features":"None","City":"Monroe","map":"<A HREF = \"http://maps.google.com/maps?q=34.880817,+-80.595213(33809)&iwloc=A&hl=en\"> mufon case (33809) map </A>","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/33809.html.txt","/var/www/straped/mufon/org/33809.html"]}