{"Date Submitted":"12/03/2011 11:23 UTC","Date of the Event":"12/02/2011 12:00 UTC","trends":["There have been 2 other sightings in Ann Arbor Charter Township","There were no other sightings in Ann Arbor Charter Township on or around December 2nd 2011"],"Source":"MUFON","City":"Ann Arbor Charter Township","Tags":"City","divs":["Sighting DetailsWhile driving just before dark I spotted 3 large orbs floating in the sky and stationary. I could also see another bone some miles away and in the direction of my home. i called my wife and asked Her too look in the sky for an unusual object. She called me back about 5 minutes later and said she had seen it and it flew over our house. Our kids heard it and felt the house shake. I drove home and gathered the family and drove nearby to were two of the crafts were flying. After getting out of the van I was directly under one of them. The craft was at about 500 feet. I saw its belly and four large rectangular landing feet. We drove further to find more and thats when we ran across a woman parked at the Ann Arbor Airport. We thought she was watching them so i asked her from my car window. She was just talking on Her phone. i asked her to look uyp and She saw them. She seemed frightened and asked me if it was some kind of joke. We all watchjed them together for several minutes (7 of us. The woman and I exchanged phone numbers and went off dazed. An hour later I called Her because I was having doubts, or just could not understand what we saw, even though it was clearly so. I explained that more were still present and she packed her family up and husband and came to our house, just as she got here, one of the crafts passed over, this time there was an aircraft following it, then the aircraft pulled up straight vertical and backed off and flew back east. The airplane left a jet trail, the craft did not, about ten of us saw it. My family and a family we did not even know watching something that i am now sure will never allow me to be who I was before the event. I called 911 earlier in the night and they just shook it off, I called back later to ask if others called but was met with resistance and the 911 operator said, No others had called. I find it completely unbelievable that no others saw what i saw, I filmed the large orbs at the beggining but bthey are just white dots in black darkness. I took the time to fill this out for you in hopes that you may know if others saw the event that night....."],"Disposition":"Unresolved","Country":"United States","Log Number":"US-12032011-0022","Case Number":"33805","Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=42.276305,+-83.817525(33805)&iwloc=A&hl=en\"> mufon case (33805) map </A>","Longitude":"-83.817525","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/33805.html.txt","/var/www/straped/mufon/org/33805.html"],"Region":"Michigan","Latitude":"42.276305","Object Features":"Other","Summary":"orbs in the sky and after getting closer it apeared from another world"}