{"Latitude":"36.10574","divs":["sighting detailsi was on my way to the mall in concord, n.c. to do some christmas shopping . there were planes all over today as we approached concord. i dont know planes. this was very out of the ordinary to see though. i was driving back from concord, north bound on highway 52 in winston salem. just before you come up on the big courthouse on the left side of 52, i saw a big titanium colored disc with a green glow and a light fog or very very low clouds surrounding it. i dont know how to give an estimate of exact size. i like going to see the ship- uss carolina-. it was almost exactly that size. it had a thing on the bottom that resembled the bottom of a pop can. it was moving at almost a creep when i saw it to the right ahead of me in the sky. i'm not great with altitude, but it was the same height that helicopters fly when they give tours. it got my attention because it was a huge glowing thing crossing over the highway in front of me.... kinda forced me to notice it. it started flying from the east side to the west side of hw52. it went from 0 to 200 instantly with no noise. it sort of faded into a cloud\\mist over the city. i ride motorcycles a lot . ive seen my friends do 180 plus mph drive pasts on their bikes. this was a little faster. my wife was asleep in the passenger seat, and my daughter was asleep in the back seat. no body else saw it with me, and of course her first response when i woke her up was that i was joking. it was just very very strange. if we have technology like that as close as forsyth county, the plant making those things needs to open up a ton of jobs. it wasn't anything from north carolina in my opinion!"],"files":["/var/www/straped/mufon/html2text/33804.html.txt","/var/www/straped/mufon/org/33804.html"],"Summary":"BIG grey disc shaped object with green glow and no visible lights flew across the sky Fast for its size and silent, at a low altitude in front of me while driving.","Log Number":"US-12032011-0021","Weather Factors":"Unknown","Tags":"City","Date Submitted":"12/03/2011 10:13 UTC","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around December 3rd 2011"],"Sighting Duration":"00:00:04","Date of the Event":"12/03/2011 08:01 UTC","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Longitude":"-80.239576","Disposition":"Unresolved","Source":"MUFON","Region":"North Carolina","Country":"United States","Case Number":"33804","Object Features":"None","City":"Winston-Salem","map":"<A HREF = \"http://maps.google.com/maps?q=36.10574,+-80.239576(33804)&iwloc=A&hl=en\"> mufon case (33804) map </A>"}