{"Object Shape":"Circle, Fireball, Sphere, Star-like","Date Submitted":"12/04/2011 04:50 UTC","Object Features":"Unknown","trends":["There has been one other sighting in North Pole","There were no other sightings in North Pole on or around December 3rd 2011"],"City":"North Pole","map":"<A HREF = \"http://maps.google.com/maps?q=64.756211,+-147.342994(33808)&iwloc=A&hl=en\"> mufon case (33808) map </A>","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsTonight (Saturday, December 3rd, 2011) at about 4:30 pm 4 witnesses including myself were outside of our store when 2 of the witness looked at the sky and observed a bright orange fast moving light very far away and very bright, brighter than the north star, which was not out this night,and there were no other stars out. The 2 witnesses pointed out the observation to the 2 other witnesses which include myself. We were all stunned and captivated by this object none of us have seen before, which is especially rare since one of the witnesses works on the air force base near us, and has seen every possible aircraft that may have been in the sky, and could not identify this object we were seeing. We observed it for around 10-15 mins in which it changed directions, up and down and left to right very very far away and twinkling like a star except we knew it wasnt because of the movement and the distance. We were so captivated by the bright round orange light then it slowly disappeared into space. It was moving so fast in a small area and was so bright then just started to fade away as if it were travelling farther and farther into space until it was so far it was not visible to the human eye. It was quite amazing, i was really excited and hope to hear some information about it or find out what it was and maybe see it again in future! Thank you for letting me report this feel free to contact myself or any of the other witnesses reguarding this. Their contact information can be given upon request. Sincerely, Dawn"],"Country":"United States","Case Number":"33808","Date of the Event":"12/03/2011 04:23 UTC","Region":"Alaska","Summary":"Bright orange fast moving light","Viewing Distance":"Over One Mile","Longitude":"-147.342994","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33808.html.txt","/var/www/straped/mufon/org/33808.html"],"Log Number":"US-12042011-0002","Latitude":"64.756211","Sighting Duration":"Undisclosed"}