{"Sighting Duration":"Undisclosed","Date of the Event":"11/15/2011 04:26 UTC","Object Flight Path":"Stationary","Log Number":"US-12042011-0012","Weather Factors":"Unknown","Object Features":"None","Country":"United States","Region":"Massachusetts","Disposition":"Unresolved","Source":"MUFON","Longitude":"-71.853569","Object Shape":"Sphere","Summary":"orb over house lit roof","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/33818.html.txt","/var/www/straped/mufon/org/33818.html"],"Tags":"City","Date Submitted":"12/04/2011 05:43 UTC","divs":["Sighting DetailsMy wife and I awoke as usual at 4:20 am. While I was getting dressed, my wife went to the kitchen to make coffee. She noticed out the window that there was a spherical light, quite bright, over the roof(at an elevation of about 40 ft AGL)of a house on our street. The house is on the opposite side of the street, and 2 houses up. She was curious about the light and went to 3 different windows in the house to see it. She said that it was white, with a slightly yellowish crescent on the side. The sphere stayed stationary, but started to dim a little, but as it did, the roof under it got very, very bright. She watched as it just faded quickly out. At this point my wife became quite anxious and called to me. She told me about what she saw, and we both looked out the window for a while longer. We noticed that the person living in the house seemed quite animated, and was going from room to room, turning on and shutting off lights in the house. We have never observed any motion in that house so early in the morning. I went outside and continued looking for anything unusual, and toyed with the idea of knocking on the door of the house, but didn't want to start anything. I saw nothing additional. Afterwards, in daytime, my wife and I looked closely at the property and at every possible source of the light, but saw nothing that could account for what she saw. There is a road on a hill behind the house, but even with a spot light, it would be impossible to illuminate the roof facing our street from that angle. My wife is convinced that she saw something unexplicable. She is a person of impeccable character, level headed, and not prone to exaggeration or fantasy. I have made this report based on her eye-witness account because her first language is not english and she felt more comfortable with my writing it."],"Case Number":"33818","Latitude":"42.572445","City":"Fitchburg","map":"<A HREF = \"http://maps.google.com/maps?q=42.572445,+-71.853569(33818)&iwloc=A&hl=en\"> mufon case (33818) map </A>","trends":["There have been 8 other sightings in Fitchburg","There were no other sightings in Fitchburg on or around November 15th 2011"]}