{"City":"Dover","Case Number":"33812","Region":"Tennessee","Longitude":"-87.838357","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.487829,+-87.838357(33812)&iwloc=A&hl=en\"> mufon case (33812) map </A>","Tags":"City","Log Number":"US-12042011-0006","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWe observed lights in the sky on 21 September 2011 for about 15-20 minutes. Object had three lights in a triangular formation in the Northwestern Sky. I am located in Dover, TN and I was standing outside the back door of my home. Prior to seeing this I was inside working on my computer when I heard a call to come look at something in the sky. At first I thought it might be something from the near by military base but the object made no sound. We frequently have helicopters fly over and occasionally other military type crafts (Chinooks and other large transport style aircraft)but this did not look like anything we had ever seen before. As I stated before, the object had three lights in a triangular formation. It appeared to hover for several seconds and then it would move very fast but it would not make any sound. The object would move across and out of my line of sight and several minutes later it would appear in the sky again. For the most part it stayed over the tree line but on two occasions it appeared to come closer and was almost directly over my home. When it was closest to my home there was no sound and one light appeared to shine very brightly down on us. All of a sudden it flew away very fast without making any sound. When it was over us only the lights were visible. I could not see anything but the lights of the object. We did not know exactly what the object was but we were very curious. I managed to take two videos with my phone (sorry, I attempted to keep a steady hand but it was a little shaky due to my excitement). Unfortunately, I was unable to get my phone ready when the object was closest to me I was focused on looking up at the object. The flight pattern of the object appeared to be in a large oval shape. It completed this pattern several times during the 15-20 minutes we were outside. Eventually, the object went out of our line of sight and did not return. *Please note that the other witness observed the object longer and might be able to provide more details that I could not."],"Latitude":"36.487829","trends":["There have been no other sightings in Dover","This sighting has never been favorited."],"Disposition":"Unknown","Object Shape":"Triangle","Summary":"Observed lights in the sky over field in Dover, TN around 9:30pm on 21 September 2011","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date of the Event":"09/21/2011 09:34 UTC","Date Submitted":"12/04/2011 03:15 UTC","Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/33812.html.txt","/var/www/straped/mufon/org/33812.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Country":"United States"}