{"divs":["Sighting DetailsOn Wednesday November 30th I was driving around 8 pm and saw two out of place super bright stars to the nw. I thought nothing of them besides there size and luminosity and the fact they've never been there before. Also, I saw another craft to the east that appeared to be a net with its head lights on. (3 headlights) After leaving my destination around 11pm I notices that those bright \" stars \" were gone and now there was four to be what appeared jets with headlights on. One had blue green and purple lights, another purple and blue and the other two were blinking red and white. I tried to dismiss them as uavs or jets but their flight patters were bizarre. The would fly then completely stop and hover. They also appeared to be looking for something as they would turn their head lights on and off ( except the head lights ever pointed down or illuminated the ground). They would fly And cross paths the swoop around and comeback the direction the came ( think figure 8 flight pattern). I was intrigued and saw one coming from straight north and headed it off and parked at starbucks on memorial and MacArthur. As soon as it came closer i realized it was not near as high as a n\"jer and was only a few hundred feet up. It then stopped directly over my parked car. I felt as if I was being watched because this one hadn't stopped yet until it was directly over me. It looked similar to normal plane shape but looked areodynamically wrong. It made no noise what so ever. Dim lights illuminated the bottom and there appeared to be portholes on the side. It also had solid green and blue lights. It hovered over my car until another one from the nw came with its headlights on( it was silent as well). Then the both took off south and and flew back north. The other one was hovering over the east Tulsa exit on the kilpatrick turnpike. Blinking blue and purple. I called my friend to look ( he was about 10 miles SSE) he saw them immediately and became very excited. He lived very near remmington park casino and said he watched one hover over the race track there. It blinked purple and blue and change blinking speeds. Then he said later it took off. ODDITIES: The crafts made no noise. The could hover at will Low to ground Changes in blinking patterns and light color. Could speed up intstantly and change directions to fast to be physically feasible Headlights on and off Six of them. Two remained still while others were \"searching\" flying in a figure 8 pattern and sweeping back and forth Appeared to be super bright stars that could change colors at distance Stuck out like sore thumbs ALSO This is more than likely coincidence but my friend said he saw earlier that night a blue light that appeared to touch ground in the distance."],"Object Features":"Window(s)","Tags":"City","Case Number":"33811","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around November 30th 2011"],"Summary":"Looked like stars at distance. Headbeam. Multicolored light. Hovering. Appeared to be searching no noise","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date Submitted":"12/04/2011 03:12 UTC","City":"Oklahoma City","Longitude":"-97.507078","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"35.47369","Region":"Oklahoma","Log Number":"US-12042011-0006","map":"<A HREF = \"http://maps.google.com/maps?q=35.47369,+-97.507078(33811)&iwloc=A&hl=en\"> mufon case (33811) map </A>","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33811.html.txt","/var/www/straped/mufon/org/33811.html"],"Object Shape":"Cross, Star-like, Triangle","Source":"MUFON","Date of the Event":"11/30/2011 08:00 UTC","Viewing Distance":"101-500 Feet"}