{"Longitude":"-122.654594","City":"Langley","Latitude":"49.098755","files":["/var/www/straped/mufon/html2text/3382.html.txt","/var/www/straped/mufon/org/3382.html"],"Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"05/02/2005 11:26 UTC","Date of the Event":"05/02/2005 11:26 UTC","Sighting Duration":"Undisclosed","Region":"British Columbia","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Case Number":"3382","Weather Factors":"Unknown","Country":"Canada","Summary":"Not Provided","Object Shape":"Undisclosed","trends":["There have been 4 other sightings in Langley","There were no other sightings in Langley on or around May 2nd 2005"],"map":"<A HREF = \"http://maps.google.com/maps?q=49.098755,+-122.654594(3382)&iwloc=A&hl=en\"> mufon case (3382) map </A>","Viewing Distance":"Unknown","Tags":"City","divs":["Sighting DetailsSighting Report: On Thursday, April 28th 2005, I was sitting near the intersection of West Georgia and Granville Streets in the Downtown Core of Vancouver. This incident took place at approximately 8:40 pm. While I was consuming my dinner, 2 men were walking past me on the street, looking up in the sky, and commenting on \"how amazing\" something was. I ignored them for a few minutes, assuming that they might be tourists, but another gentleman came along who was fixated on something overhead. At this point, I looked up to see a black disc-shape object. It remained at the same altitude, which I estimate to be 1000 to 1500 feet. At this height, it was perhaps the size of a nickel at arms length. For about 10 minutes, it drifted very slowly in a northeasterly direction, still apparently at the same height. The sun was setting at this point, and the sky was getting very dark, and the object started to get smaller and climbing in altitude as it drifted over Coal Harbour and the North Shore mountains. There was never any sound generated by this object. It did not make any sudden directional changes. I could not determine the size of it from top to bottom because it was overhead mostly, but it certainly did not appear bulbous or balloon shaped."],"Log Number":""}