{"map":"<A HREF = \"http://maps.google.com/maps?q=34.066973,+-117.156414(33820)&iwloc=A&hl=en\"> mufon case (33820) map </A>","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33820.html.txt","/var/www/straped/mufon/org/33820.html"],"Longitude":"-117.156414","Source":"MUFON","trends":["There have been 10 other sightings in Redlands","There were no other sightings in Redlands on or around October 15th 2011"],"City":"Redlands","divs":["Sighting DetailsOn the afternoon of Oct. 15th I was working in my home in Redlands when one of my children came in very excited yelling that there was a \"red thing\" in the sky. So I went outside to see what this was and when I got to the driveway my oldest son was pointing up at about a 75 to 80 degree angle, very straight up when I saw a shiny red bullet shaped object hovering about 4-500 feet up. After letting my eyes adjust to the brightness of the sky, because it was a very bright and clear day, I could see a smaller grey round object hovering next to it at about the 11:00 position. This object really took me back because at first I was about to dismiss the whole thing as an aircraft or something till I saw what this was doing. It was spinning over like a basketball and it was colored white and grey. As it was doing this both objects were descending then ascending. Then they would stop and descend again. About that time I had to look for one of my children so I took my eyes off the object for about 10 seconds and when I looked back it was gone. I had asked my oldest some to watch for it while I went to find the camera but he said he did see where it went either. My Neighbor stood outside with us looking for it for a while but we never saw it again. All total me and two of my three sons saw this object, and to this day when I walk outside my house I still look for it. I was very hesitant to report this but after watching a show with some members from MUFON on it I feel much better about doing it now."],"Case Number":"33820","Object Shape":"Bullet, Missile, Sphere","Object Flight Path":"Hovering then path","Log Number":"US-12042011-0014","Weather Factors":"Unknown","Latitude":"34.066973","Country":"United States","Region":"California","Summary":"2 objects - red bullet and grey and white ball- witnessed over Redlands CA","Viewing Distance":"101-500 Feet","Date of the Event":"10/15/2011 02:00 UTC","Date Submitted":"12/04/2011 06:08 UTC","Object Features":"Dome, Patterned Surface, Other","Sighting Duration":"00:03:00"}