{"Date Submitted":"12/04/2011 06:37 UTC","Summary":"2 orange fuzzy orbs","Case Number":"33821","Longitude":"-70.887412","trends":["There have been 2 other sightings in Newburyport","There were no other sightings in Newburyport on or around November 12th 2011"],"Source":"MUFON","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["sighting details11\\12\\11 @ 10:01 pm, was arriving home after working 16 hours, day was very long and felt surreal. was getting out of my car, and all of a sudden my two neighbors who were up on porch told me to quikly look into the sky, and asked me what it was. i screamed \"it's a f'n ufo\" as the hairs were standing up on the back of my neck and i have no doubt in my mind what it was. i walked up stairs one flight to get a better vantage point. there were two basball sized orange egg shaped orbs with a yellow blurry pulsating glow around them. one quikly decended, acended, then quickly shot off. this was w\\ in 15 seconds of lying my eyes upon it. the other one was hovering strangely and pulsating. this was over the river, a couple hundred feet away. after hovering\\pulsating abot 60 seconds, it turned directions abruptly and the moved off, but slower than the other one did. i was trying to remain calm during the whole experience, so glad i saw this, but sad i could not get to my cammera quick enough. after the whole experience i was reenergied, even though i had ust had an extremely long day."],"Country":"United States","Weather Factors":"Unknown","Date of the Event":"11/12/2011 10:01 UTC","City":"Newburyport","Log Number":"US-12042011-0016","Tags":"City","Viewing Distance":"101-500 Feet","Object Shape":"Oval","Region":"Massachusetts","map":"<A HREF = \"http://maps.google.com/maps?q=42.82266,+-70.887412(33821)&iwloc=A&hl=en\"> mufon case (33821) map </A>","Latitude":"42.82266","Object Features":"None","files":["/var/www/straped/mufon/html2text/33821.html.txt","/var/www/straped/mufon/org/33821.html"]}