{"Country":"United States","files":["/var/www/straped/mufon/html2text/33823.html.txt","/var/www/straped/mufon/org/33823.html"],"divs":["Sighting Details On Dec 4 2011, at about 5:15 PM, My family and I were leaving the Sams Club on Airport Rd in Allentown Pa. I saw a man and women looking up at the sky, so I looked up to see what they were looking at. It was then I saw the 3 objects in the sky traveling in about a SW to NE direction, in a single line, with the last object slightly to the east of that line. At arms length the distance between the first and last objects was about 16 inches, and they seemed to be equidistant apart. At first I saw what appeared to be flames in an orange red color at the bottom center of the objects. This made me think these were hot air balloons I was looking at, but I could not see any gondola below the flames, and the flames seemed to go downward instead of upward. They were also moving much too fast to be balloons. As they got closer the flames started going on and off, when they were on you could see the surface of the object as a lighter grey color, but with no defined or sharp edges. They were circular in appearance, and the middle object appeared to wobble, even when no flame was emitted. When the flame was out, they appeared to look almost transparent grey-whitish in color. As they passed by, the second object moved closer to the first object, while the third object kept the same distance from the first. Then all flames stopped, and stayed out for the rest of the sighting. They then changed course to a slightly more easterly direction and seemed to vanish in the distance before I could get to my vehicle to get my camera. There were no other lights visible on these objects other than the flames, and no sound what so ever from them. I think the total time from when I first saw them at about 30 deg above the horizon to the SW until i lost sight of them at about 45 deg above horizon to the ENE was about 40 seconds. My wife saw some people taking pictures with their phones, but they left before we could ask the if they got anything they could see. Me and my wife were amazed that we actually might have seen something unexplained such as a UFO, but my 9 year old daughter was truly scared."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.652591,+-75.429755(33823)&iwloc=A&hl=en\"> mufon case (33823) map </A>","Sighting Duration":"Undisclosed","City":"Allentown","Region":"Pennsylvania","Log Number":"US-12042011-0018","Date of the Event":"12/04/2011 05:15 UTC","Case Number":"33823","Latitude":"40.652591","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle","Summary":"I saw 3 unknown objects traveling approximately SW to NE In Allentown Pa","Longitude":"-75.429755","Object Features":"None","Source":"MUFON","Object Flight Path":"Path with directional change","Date Submitted":"12/04/2011 08:03 UTC","Tags":"City","Weather Factors":"Unknown","trends":["There have been 45 other sightings in Allentown","There was one other sighting in Allentown on or around December 4th 2011"]}