{"Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/33838.html.txt","/var/www/straped/mufon/more/33838_submitter_file1__UFO.JPG","/var/www/straped/mufon/org/33838.html"],"Summary":"I witnessed an Organic looking floating and hovering object. It moved right changing colour and shape. I was able to capture photos of movement as well as shape changing and colour changing.","Viewing Distance":"101-500 Feet","Object Features":"None","Source":"MUFON","City":"Kingston","map":"<A HREF = \"http://maps.google.com/maps?q=44.239422,+-76.481404(33838)&iwloc=A&hl=en\"> mufon case (33838) map </A>","trends":["There have been 10 other sightings in Kingston","There were no other sightings in Kingston on or around July 10th 2009","This sighting has never been favorited.",""],"divs":["Sighting Details I was at a cottage in the 1000 islands region near Kingston, Ontario and experienced seeing something very abnormal in the sky. I was sitting on a dock over looking a lake when the object appeared from across the lake and moved towards the dock. The object can only be described as an organic looking connected formation of lights that hovered about 100 feet above the lake. The object moved towards my location initially then moved to the right slowly, while at the same time it changed shape and colour. I remember seeing red, purple, green ,orange and blue. The object's reflection could clearly be seen in the dark lake. At one point the object even seemed to form a face and arms. It was not a craft or ship of any time was certainly not man made. But it was clearly glowing and and a defined image. It kept moving right before it dropped below the tree line and disappeared. There were two other witnesses with me, and one of my friends was able to capture several photos (7-12). I have attached one of the photos that I have, and if you think that this is something interesting I can get the other photos by contacting my friend. It was nothing like I have seen or heard of before. It was not a fire work because it hovered for several minutes before vanishing. I was a little bit frightened when viewing the objects but my friends were laughing and kept saying, \"It's not going to hurt us.\" They didn't seem to be afraid at all. Any information of this sighting would be greatly appreciated. Thanks"],"Log Number":"CA-12052011-0011","Date Submitted":"12/05/2011 04:31 UTC","Object Shape":"Other, Unknown","Weather Factors":"Unknown","Country":"Canada","Region":"Ontario","Object Flight Path":"Hovering then path","Latitude":"44.239422","Case Number":"33838","Sighting Duration":"00:08:10","Date of the Event":"07/10/2009 12:00 UTC","Longitude":"-76.481404"}