{"Date of the Event":"09/08/2011 07:50 UTC","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33837.html.txt","/var/www/straped/mufon/org/33837.html"],"Case Number":"33837","Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"12/05/2011 03:32 UTC","divs":["Sighting DetailsSo I've seen a real UFO or \"flying saucer\" shaped object a couple weeks prior, and been out at night that summer since looking for more. Theres a creek down the street to where my first sighting took place, and around the creek is trees and forests. Thought I'd go down there since that is the area where the flying saucer of my first sighting seemed to materialize hoping I'd catch more. Didn't really know how lucky I'd be but it was worth a shot. Around 1900 hours I begin my trek to the creek. Scanned the skies and horizons around me, all I can see are \"airplanes\". Thought to myself, \"the skies seem a little too busy... I dont think these are airplanes...\" but to give rationalism the benefit of the doubt, let's just say they really were airplanes. So for a while nothing but \"airplanes\". And one airplane behaving suspiciously caught my eye, seemed to be going VERY very slow, almost hovering and coming slightly off towards me from NorthWest-ish (..i want to say?) So to keep myself from being silly I assume it is an airplane, it is then I look the opposite direction of the \"airplane\". And saw a sphere like object hovering over the trees in the distant horizon. It was orange in color, the same exact color of our orange street lights, so naturally, that is the first thought of rationalism that came to my mind. \"It's a HUGE street light!\" i presumed. This sphere was about the width of, maybe, two pine trees off in the horizon it sat. So immediately the second thought that came to mind was a hot air ballon. Something that big, hovering, of course it's a hot air balloon... \"at this hour???.. in the dark???.. can't see the electric lines! Why would somebody be flying a hot air balloon in the dark running the risk of hitting power lines???\" I questioned myself. Every inch of it was glowing orange, it lit up the trees surrounding it with orange light from its glow. And of course, common sense told me, they don't make street lights that big, nor do i think that is a hot air balloon. So I knew then, that this was what I set out to find. So I keep starring at it, and about 5 - 10 mins of hovering, it starts to move. It moved slowly and deliberately, towards me but slightly off of my direction. And what seemed to be very far away from me at first off in the horizon, only took maybe 30 secs. to maybe a minute to get to within maybe .. .. I want to say 40 - 60 ft. away from me on the opposite side of the creek. My view was constantly obstructed by trees when it began its flight path. The only time I got a clear view of it was when it was hovering over tree tops in the horizon. I think that it changed its elevation and direction because the height of the horizon is significantly higher then the height i was at, and from the direction it began its flight path to where I last saw it, through the trees, the object was very close to me. Even seemed like it was going to cross the creek at one point as it flew closer and closer, gradually moving closer to the creek. I eventually lost sight of the object and can no longer see any kind of orange light anywhere whatsoever, even through the trees. So that is where my sighting ends. But the same time I lost sight of the orange sphere, an \"airplane\" flew out of the tree tops above in the sky, in the same exact spot where I lost sight of it, around the same exact elevation of the object and headed east. An airplane with strobe lights and all, flying pretty low in elevation making no noise whatsoever, slowly going east. Now, I'm not going to jump to silly conclusions, but I will say that is one helluva coincidence."],"Region":"New York","Summary":"Arrived at site, maybe,... 10 - 15 mins. before actual sighting. Scanned skies and horizons, nothing but","map":"<A HREF = \"http://maps.google.com/maps?q=42.986788,+-76.143048(33837)&iwloc=A&hl=en\"> mufon case (33837) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Circle, Oval, Sphere","Object Features":"None","Latitude":"42.986788","Longitude":"-76.143048","trends":["There has been one other sighting in Nedrow","There were no other sightings in Nedrow on or around September 8th 2011"],"City":"Nedrow","Log Number":"US-12052011-0010"}