{"Date of the Event":"06/01/2011 07:00 UTC","Latitude":"31.444437","Object Features":"Undisclosed","Tags":"City","Disposition":"Unknown","Date Submitted":"12/05/2011 07:53 UTC","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Summary":"purple light appeared roughly 1 mile traveled a short distance disappeared and reappeared in a different place at the same time","Case Number":"33839","files":["/var/www/straped/mufon/html2text/33839.html.txt","/var/www/straped/mufon/org/33839.html"],"Country":"United States","Region":"Alabama","City":"wagarville","trends":["There has been one other sighting in wagarville","There were no other sightings in wagarville on or around June 1st 2011"],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.444437,+-88.019186(33839)&iwloc=A&hl=en\"> mufon case (33839) map </A>","Log Number":"US-12052011-0012","divs":["Sighting DetailsI was at my friends house which is about a quarter mile from mine standiing in the yard tossing around a football when I caught a light out of the corner of my eye. It appeared only for a moment just long enough for me and one other to see it. About an hour later we see it again. Only this time about six or seven people including myself see it. I saw it first and I screamed for everyone to look. it was a violet looking light that looked about the size of the light on a cell phone tower if you was looking at it from about a mile away. It appeared to drift along a bit then disappeared and reappeared at the exact same time but in a different place. if there was two cell phone towers side by side the distance between the lights is about how far it traveled when it reappeared. I have seen a number of things that seemed unusual in the sky that I didn't put much thought into but this was absolutely amazing. I have never seen anything like it even though it was just a light. It was faster than anything I have ever seen. I haven't seen anything since that night despite staring at the sky almost everyday. I am now a firm believer that ufo's are in our skies."],"Longitude":"-88.019186","Source":"MUFON","Object Flight Path":"Path with directional change"}