{"files":["/var/www/straped/mufon/html2text/33841.html.txt","/var/www/straped/mufon/org/33841.html"],"Summary":"I looked above the Gravel Pit and 2 orange orbs shuffled in and over the pit. They sort of bounced around eachother, one hit the other and they disappeared.","Tags":"City","Case Number":"33841","Date Submitted":"12/05/2011 08:19 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 9 other sightings in Fairbanks","There were no other sightings in Fairbanks on or around July 20th 2011"],"Longitude":"-147.708459","map":"<A HREF = \"http://maps.google.com/maps?q=64.844278,+-147.708459(33841)&iwloc=A&hl=en\"> mufon case (33841) map </A>","Country":"United States","Viewing Distance":"101-500 Feet","Object Features":"None","City":"Fairbanks","Object Shape":"Oval, Sphere","Latitude":"64.844278","Disposition":"Unresolved","divs":["sighting detailsi was at a bonfire just off the gravel pit on the left hand side. the fire was between myself and the pit, a lil to the left of me. i was looking at the stars and saw two orange orbs, very close together sort of dart in from the trees, headed away from the river on the opposite\\to the left of the pit. like it came from the badger rd. northpole area. they came in to about the center of the pit. they shuffled and bounced around eachother while still going in the same direction. one of the orbs \"shuffled\" in place in the center while the other went past, up, and looped around to the other one, hitting it. it seemed like they were chasing eachother and the other one missed the first stopping and came back around. after the one hit the other they just vanished. they didnt blaze, dart, or fly. they stayed were they were and were just gone. the whole thing lasted maybe 30 sec. and i think one other person may have seen something as well. i was in a group of about 10-20 people, the objects made absolutely no noise. i thought it was strange but kind of dismissed them, until about 2-3 weeks later. my boyfriend was checking the rants and raves section of craigslist and came across a strange article. the \"man\" who posted the note said that he lived, or was in the badger rd. area a few weeks prior and saw 2 strange objects. he said that they were small orbs that glowed a bright orange\\yellow color. he said he saw them move from his area and head back toward the river\\fairbanks direction. it aslo said that he thought they were possibly fighting. unfortunately the add was removed before i could reply and i have no idea who this person was. i found this very coincidental and i could not ignore what i saw."],"Date of the Event":"07/20/2011 12:00 UTC","Region":"Alaska","Source":"MUFON","Log Number":"US-12052011-0014"}