{"Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was driving over the timuquana bride on the westside of jacksonville, fl, between Blanding blvd and highway 17. At aproximately 8:15 at night on december the 1st of 2011, I observed an aparant dark triangle about the size of a plane, with 3 uniform lights, one at each corner of the triangle, but with NO flashing FAA lights. I am quite used to seeing many jets and planes regularly, as I live in close proximity to Naval Air Station Jacksonville, and this was not a plane. It was flying at an altitude of maybe 300-400 feet, at a speed of 40-60 miles per hour. I noticed it aproaching from the north, which was to my left as I was headed east on 103rd street and almost on the bridge. The triangle slowly flew overhead to the south and I lost sight of it through the trees as I began to cross the bridge. After that,I headed south on highway 17 towards NAS Jacksonville and scanned the sky for the object, but could not see it. It was only overhead for a matter of 5-10 seconds, but that was long enough for me to tell that it wasn't like anything I've seen before. Even if it was a plane, since it was headed towards NAS Jax, it should have been visible as I neared the base, but it was nowhere to be seen. It was moving too slow, low, and silently to be any kind of jet or airplane and as I said there were no colored or flashing lights, only 3 equally sized, round, white lights at each of the 3 corners."],"Source":"MUFON","Object Features":"Unknown","Tags":"City","Region":"Florida","Case Number":"33847","Date of the Event":"12/01/2011 08:15 UTC","Disposition":"Unresolved","Longitude":"-81.506854","Log Number":"US-12062011-0003","Country":"United States","Date Submitted":"12/06/2011 02:28 UTC","Object Flight Path":"Straight-line path","Summary":"driving over bridge, large triangle w/ 3 lights flies slow and silent from left to right, lost sight in trees, then disapeared.","files":["/var/www/straped/mufon/html2text/33847.html.txt","/var/www/straped/mufon/org/33847.html"],"Latitude":"27.673297","map":"<A HREF = \"http://maps.google.com/maps?q=27.673297,+-81.506854(33847)&iwloc=A&hl=en\"> mufon case (33847) map </A>","trends":[],"Sighting Duration":"Undisclosed","Object Shape":"Chevron, Triangle","City":"Undisclosed","Weather Factors":"Unknown"}