{"Viewing Distance":"21-100 Feet","Date Submitted":"12/05/2011 09:41 UTC","Latitude":"34.418594","Region":"Georgia","Log Number":"US-12052011-0016","map":"<A HREF = \"http://maps.google.com/maps?q=34.418594,+-84.423833(33844)&iwloc=A&hl=en\"> mufon case (33844) map </A>","Summary":"1986--Spotted UFO in Jasper, GA very close hovering about 3 ft above ground within 2 minutes","Case Number":"33844","Date of the Event":"09/22/1986 06:00 UTC","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/33844.html.txt","/var/www/straped/mufon/org/33844.html"],"Longitude":"-84.423833","Object Features":"None","Object Shape":"Disc, Triangle","Country":"United States","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Jasper","There were no other sightings in Jasper on or around September 22nd 1986"],"City":"Jasper","divs":["sighting detailsi was 11 years old in the bed fixing to get up to go to school. my mom woke me up all upset saying she dreamed of a tornado. she woke up and looked outside and saw a ufo. she said it was low on the ground making a beeping noise like it was in trouble and changed colors. suddenly it took off. i laughed at her and said, \"yeah right\". i got up and looked out the window. it was back! i saw it too! my body was in complete shock and couldn't move. i saw that it was about 3 feet hovering above the ground, and it looked like a triangular shape. it was a solid white color for a few seconds. it didn't make a noise when i saw it. it was next to our big tree and mail box about 3 feet above ground on our dirt\\gravel road (back then it was very remote). then it changed colors from white to red or red to white and took off and dissappeared within a second! i got the courage to go outside to try and find evidence. i couldn't find anything and went back in the house. i know it had to be something (either something from the government, a real ufo, time travelers, or who knows). i still think about it till this day. i'm 100% sure it wasn't an airplane, and i didn't see this in the air. also this ufo was not that big and could almost fit in my dining room. i didn't hear a sound with it which doesn't make sense because it should have broken the sound barrier when it disappeared. till this day, i have never seen a ufo since then, and i still think about it. also why did it come back when mom said it left? i feel that it wanted me to see it. i really want answers."]}