{"Source":"MUFON","divs":["sighting detailsi was driving east towards excelsior springs on 69 highway at about 9:55am on tuesday morning (11\\29\\11), driving at around 60 mph. it was a bright, sunny day, not really a cloud in the sky at the time. at least not the area and view that i had, from my vanage point. i was north and east of liberty a few miles. i was moving on a downhill of roadway, on a long stretch of road ahead of me, heading basically east, towards poorboy's convenience store. just to the north of poorboy's is the airport on the north side of 69. i noticed a fairly large airplane seemingly coming in to land at the airport. generally i see only very small planes land at the airport, so that grabbed my attention more than usual. after i saw the plane coming in to land. i looked to the sky to the north and east of the airport landing strip, and something quickly grabbed my attention. i saw what was a fairly large object in the sky. it was approximately 1000 feet up from the ground, give or take and i would say between a mile and two miles from me. it was what i term a \"dull\" white in color, not bright or glowing at all, and the closest thing i can compare it to would be a blimp, only there was no carriage underneath, just white in color, and a blimp like shape to it. i saw it initially for maybe just over a second, two seconds tops, then looked to the road, to make certain, i was still in my lane, slowed down a bit, then i looked back to the area to see if it was still there, and it was. it appeared to be just sitting there, no movement that i could distinguish. i observed it for another 4 to 6 seconds i would say. it seemed to again just be sitting there in the sky. i was seeing it apparently at an angle, not head on, or directly from the side. it was oblong, and rounded in shape. i went under a railroad bridge overpass, and lost my view for about a second or so, then the northern sky came back into full view. i was searching the area that it was in previously, and it was gone from the area of the sky i had seen it in just a second or so before. there were absolutely no clouds in the sky at the time, clear blue sky. i had a huge view of the entire northern sky, as well as west of me, and east for quite some time after the sighting. i panned all around, and there was nothing. it was just seemingly gone. nothing but blue sky as far as the eye could see. not even a plane, or a bird in the air, seemingly from my view. no clouds, nothing, didn't seem to be anything that i could have mistaken in any way, shape or form to explain what i saw. it just seemed that what i saw was a white, blimp shaped object, that seemingly just disappeared. that's the best that i can describe it. my reaction after i couldn't find the object anywhere in the sky, or along the horizen, was \"where the heck did it go?\" to the rational mind, if it is a craft, plane, balloon, anything you can think of that could have been there to view, whether commercial, private, or military, it would have been still visible in the sky, somewhere. this was completely gone. i have excellent vision, no contacts, no glasses. there were no glares on my windows from the sun light, nothing on my windows to cause be to misidentify as an object off in the distance. it was simply there, and then it was gone. i wish now, in hindsite that i would have pulled over and stopped to view it more, but i still would have had to take my eye off of the object to pull over. i was locked on it, as i was driving and just expected it to be there still after i got past the overpass and trees that blocked my view momentarily."],"Viewing Distance":"Over One Mile","Region":"Missouri","Log Number":"US-12062011-0010","Object Shape":"Blimp","Weather Factors":"Unknown","Tags":"City","City":"Excelsior Springs","Longitude":"-94.2544","Object Flight Path":"Stationary","Country":"United States","Case Number":"33854","Latitude":"39.34008","files":["/var/www/straped/mufon/html2text/33854.html.txt","/var/www/straped/mufon/org/33854.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.34008,+-94.2544(33854)&iwloc=A&hl=en\"> mufon case (33854) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Disposition":"Unresolved","Summary":"Blimp Shaped Object, White in color, Large Northeast of Liberty, Northwest of Excelsior Springs Hovering","Date of the Event":"11/29/2011 09:55 UTC","Date Submitted":"12/06/2011 06:19 UTC","trends":["There have been 2 other sightings in Excelsior Springs","There were no other sightings in Excelsior Springs on or around November 29th 2011"]}