{"Sighting Duration":"Undisclosed","trends":["There have been 8 other sightings in Ottawa","There were no other sightings in Ottawa on or around December 6th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change","Tags":"City","Weather Factors":"Unknown","Case Number":"33858","files":["/var/www/straped/mufon/html2text/33858.html.txt","/var/www/straped/mufon/more/33858_submitter_file1__V-C221.jpg","/var/www/straped/mufon/more/33858_submitter_file2__V-1A56.jpg","/var/www/straped/mufon/org/33858.html"],"Latitude":"41.336876","map":"<A HREF = \"http://maps.google.com/maps?q=41.336876,+-88.834833(33858)&iwloc=A&hl=en\"> mufon case (33858) map </A>","Object Features":"Unknown","Date of the Event":"12/06/2011 07:05 UTC","Viewing Distance":"Unknown","Summary":"Saw 4 circular lights in scattered formation, formed into single line then into triangle","Log Number":"US-12062011-0013","City":"Ottawa","Date Submitted":"12/06/2011 09:36 UTC","Region":"Illinois","Country":"United States","Source":"MUFON","Longitude":"-88.834833","Object Shape":"Circle","divs":["Sighting DetailsAround 7pm December 6th 2011 I walked outside to my deck to smoke a cigarette, I put the cigarette to mouth and I looked up to the north I saw 4 scattered lights. In 1 minute time the lights were directly over me, then formed a straight line. I grabbed my phone to take pictures. Then 3 of the 4 lights formed a triangluar shape, circular lights. The lights were bright yellow in the center and a darker orange around the edge of the lights. The 3 lights stayed together while the 4th one stayed behind and was consistent in speed. There was no sound and as the lights were in straight formation above me, the neighborhood dogs started to bark excessively. The lights were heading south. The whole experience lasted 2 to 3 minutes. The lights were just gone, no flickering or change in direction. So the lights came from the north, heading south. Scattered at first, as is moved south all lights formed a straight line. As it continued south the first 3 lights changed formation into a triangle while the 4th stayed behind but maintained speed."],"Disposition":"Unresolved"}