{"Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"07/13/1987 12:00 UTC","Object Features":"None","Date Submitted":"12/07/2011 01:23 UTC","Latitude":"39.748214","Log Number":"US-12072011-0004","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around July 13th 1987"],"Summary":"thought the sun was following us except it was reddis orange.","divs":["Sighting Detailsme and my fiance and our two children were traviling in our car to vist my sister in colorodo springs from omaha ne. the kids in the back seat my son in his car seat. we saw a moose in a cornfield it was big didnt know a moose would be in this teritory, im looking at the sky ,but there is this globe like the sun except for the color . I tell my man to look at it it seems like its folowing us on the right hand side of me. my man says its the sun ,ive never seen the sun that color that time of day before .we keep on driving, i remember lots of lighting .Then it stopped the clouds went away .the ball is still keeping up with us .then i see the sun and tell my man look theres the sun ,it was white like it always is but it was on his left side of the car. he says youre right ,so what is that as we look at the orange ball thats been following us.we keep driving then it seems to be on the ground on his left we are getting closer its as big as a stadium we get excited cause were getting closer and anxious to see what it is. he says see if the kids are awake so they can see it .As i turned it seemed like slow motion the kids were asleep. When i turned back it was gone!! I asked my man man what happened to it? He said he did'nt know. we looked behind us all around no ball we were further down the road. We said the first gas station we came to we would ask So we stopped at a gas station and asked what that big round orange thing was just out side denver.they didnt know what we were talking about. I looked at my watch and our watches were a hour behind and we had already ajusted our watches in the car for the time diffence. so we said on the way back home we would go past it,but the was nothing. so when we got back to omaha my man told me to call offuit air base project blue book.I did even though they said P>B>B was no longer working,thely still put me through to a dept, which took alot of information.My man did not want to talk because he was an attorney. After this things got really weird a man that said he was a dr. came to my hospital room and said he wanted to hpnotize me,but my dr. and nurse never saw or heard of him before.when i got home from the hospital a women called to make an appointment with this dr. and I said no, and she was very insistant so I hung the phone up, And she called back saying I better!! come in,I unplugged the phone. then one morning I awoke to find a black thing like a man but with a long heaad like a shadow but solid in my hallway I could not belive my eyes iI turned to look next to me to see if my man was awake and he was just starring at it.It ran down the stairs,you could hear the stairs creak.I laid down and asked did you see that he said yeh and we said at the same time a black shadow we were scared to move,then i said the kids! they were in the room across from us both bedroom doors were open,he jumped up an ran in to chec on the kids,i stayed in the bed still scared.then i got up and we went through the whole house nothing. we had double locks on the door so you had to have a key to get out the doors were locked. we could tell that when it hit the landing on the stairs it diappered.I have always wondered about this and will never forget it,someone please tell me something ."],"City":"Denver","Object Shape":"Circle, Fireball, Sphere","Object Flight Path":"Stationary,Path with directional change,Other","files":["/var/www/straped/mufon/html2text/33863.html.txt","/var/www/straped/mufon/org/33863.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.748214,+-104.981903(33863)&iwloc=A&hl=en\"> mufon case (33863) map </A>","Region":"Colorado","Disposition":"Unresolved","Case Number":"33863","Longitude":"-104.981903","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown"}