{"Longitude":"-116.985821","Summary":"3 stars interacting with each other","Tags":"City","Log Number":"US-12072011-0006","Date Submitted":"12/07/2011 03:36 UTC","files":["/var/www/straped/mufon/html2text/33865.html.txt","/var/www/straped/mufon/org/33865.html"],"Object Shape":"Cylinder, Diamond, Star-like","Weather Factors":"Unknown","Region":"California","Object Features":"Louvres","trends":["There have been 41 other sightings in El Cajon","There was one other sighting in El Cajon on or around December 5th 2011"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"El Cajon","Object Flight Path":"Stationary,Straight-line path,Path then hovering","Latitude":"32.789478","map":"<A HREF = \"http://maps.google.com/maps?q=32.789478,+-116.985821(33865)&iwloc=A&hl=en\"> mufon case (33865) map </A>","divs":["Sighting DetailsClear night. I observed 3 stars in a triangle formation. then one moved and I thought its two stars and one plane... then the other two moved and I knew it was not a plane. the first star that moved was larger then the other two. I oberved the other two moving around the big one.. almost like they were playing. I watched in the cold clear night for almost 1 hour. I was at a gasoline station. I asked the attendant to come out of the store and look at what im seeing. I said.. to him \"I cant be the only one to see this\". we stood watching for about 10 min then he had to return to the store. Over the next hour there were many customers who also observed the lights. At one point they appeared to be getting closer or lower.. So much that I was able to see that the larger one was not a star.. It was a craft. It was very bright and seem to be pulsating light. or reflecting a light in a pulsing manner. I spoke to several people while the activity was ongoing. one person told me that he and his friend have been observing the light for over an hour and that it was only one.. He said that he saw the other two come from behind a mountain and travel across the sky and join up with the single one. I saw the three..and one from star to craft."],"Date of the Event":"12/05/2011 10:10 UTC","Case Number":"33865","Viewing Distance":"Over One Mile","Country":"United States","Source":"MUFON"}