{"Date Submitted":"12/07/2011 03:08 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Summary":"Was leaving a friends property & while closing his gate, looked up & spotted the first object moving eradically. I later spotted a second object.","Country":"United States","Case Number":"33876","Tags":"City","Object Features":"Dome, Window(s)","Latitude":"48.235756","files":["/var/www/straped/mufon/html2text/33876.html.txt","/var/www/straped/mufon/org/33876.html"],"Disposition":"Unresolved","Longitude":"-116.575978","Sighting Duration":"Undisclosed","divs":["Sighting Details I was leaving a friend's property, & while closing his gate, I looked up & spotted the first object moving eradically(up & down-back & forth), in front of a hillside known as Gold Hill. I pretty much knew it was a UFO from the time I first noticed it. The object appeared to be yellowish-orange in color & sometimes turning to a reddish color. My son had just called me to come pick him up from trick or treating(it was Holloween night). I went to town & picked him up & drove back out to the road my friend lives on, & the object was still in the same area. I wanted my son to see it too. We then left that area & went home(approximately 5 miles away). After arriving at our house, I told my mother about it & she came outside & saw it too. It was pretty cold outside, in the 30's, so she went back inside. I also went inside to get my camera. I was excited to see it since it had been about a year from the time I had my last siting, & couldn't wait to see if I could get some good photos of it. I went back out to start taking pictures. Approximately an hour had passed from the time I first noticed the first object, when I noticed the second object rising up from behind Gold Hill, right where a beacon light is located. That's the one I took most of my pictures of. That one was only by the hill for a few minutes, & then it made it's way over towards the first object where it stayed for the rest of the time I was outside. I finally went back inside at about 2:30 AM because my fingers were almost numb from the cold. The objects were still there when I went inside. I managed to get 9 pictures, 7 of which are fairly good. When I say they're fairly good, I mean that they're good enough to see a shape. I took the pictures from my bedroom balcony. I've been watching the sky more often since that night hoping to see another one so maybe I could get some better photos. I would like to be contacted by someone that could analize my photos & possibly blow them up with me present so I could get a better view of them. I'm afraid that if I try to do it, I might delete them & lose them. My camera is a new one, & new to me, so I'm not real familiar with it yet. It is a pretty good digital camera."],"Source":"MUFON","Date of the Event":"10/31/2011 12:00 UTC","Region":"Idaho","Log Number":"US-12072011-0013","Viewing Distance":"Unknown","trends":["There have been no other sightings in Sagle","This sighting has never been favorited."],"City":"Sagle","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=48.235756,+-116.575978(33876)&iwloc=A&hl=en\"> mufon case (33876) map </A>","Weather Factors":"Unknown"}