{"Object Shape":"Sphere","trends":["There have been 7 other sightings in Fortville","There were no other sightings in Fortville on or around June 29th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.937922,+-85.845815(33874)&iwloc=A&hl=en\"> mufon case (33874) map </A>","Region":"Indiana","Summary":"UFO over cornfields in rural, low populated area","Case Number":"33874","City":"Fortville","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/33874.html.txt","/var/www/straped/mufon/more/33874_submitter_file1__IMG00035-20110629-1629.jpg","/var/www/straped/mufon/org/33874.html"],"Country":"United States","Tags":"City","Date Submitted":"12/07/2011 12:59 UTC","Disposition":"Unresolved","Longitude":"-85.845815","Date of the Event":"06/29/2011 04:28 UTC","Log Number":"US-12072011-0011","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"39.937922","divs":["sighting detailsi was traveling home from work in the car alone, coming from muncie along sr 67 heading toward mccordsville. it was june 29th, 2011 at 4:28 pm. it was still daylight and mostly sunny conditions all day. it wasn't 'rush-hour' per say, but, there was a steady number of cars on the road. i had just passed the town of fortville (heading wsw) and off to the right (wnw), at about 30 degrees above the horizon, maybe 300 to 400 feet above the ground, and around 500 to 600 yards in the distance, i saw what appeared to be a stationery, hovering craft\\object. i was traveling about 40 miles an hour, and i realize that some objects might be moving toward you etc that might make an object appear to not move, however, the object did not gain size or lose it (that would indicate movement from my perspective). i then thought this must be a balloon, but it was in the middle of corn fields in the middle of nowhere, and, would have had to be a very large balloon. i'm also aware of what a hot-air balloon would like like from this perspective, as some have travelled around this area before, and it was nothing like that. it appeared a dull metallic grey in color, spherical or even square (distance prevented definition of edges?), and also looked to slightly be disturbing the atmosphere immediately around it. at this point i took my phone camera, rolled done the passenger window, and waited to get an opening in the immediate tree line in order to take a picture. i did not stop my vehicle as there were cars traveling behind me and i just didn't think to try and pull over to the shoulder. when there was a break in the tree line, the object appeared to still be in the very same location, and i took a picture. i continued driving towards home. i have included the picture along with this report. i also have not reported it until now because family and friends were ridiculing the photo and the event. the more however i look at the photo and zoom in on the object, the more i am convinced there wasn't a reasonable explanation for what it could have been."],"Object Features":"None"}