{"Weather Factors":"Unknown","Latitude":"35.090451","Summary":"three white lights coming from the direction of airport but it didn't take off from the airport and it was over the freeway traveling south to north.","Disposition":"IFO","Date Submitted":"12/08/2011 01:24 UTC","City":"Albuquerque","Log Number":"US-12082011-0007","divs":["Sighting DetailsJust dropped son off at work when I noticed that an airplane was coming from the west towards the airport. It flew past the airport and it slowed down and descended to level off over the freeway. It was traveling too slow to be an airplane. But faster than a baloon or zeppelin. I've always wanted to see a UFO again but this one scared me. I was very frightened and I couldn't take a picture because the trafic around me was going too fast for me to stop. I kept telling myself that it was an airplane but when it passed me there were not any other lights like on an airplane. No red or blue lights. Two helicopters were searching for something on the ground on the west side of town from the direction of where the UFO came. The UFO seemed to be in the form of a straight line. The lights were evenly spaced. The outer lights blinked but not at the same time and the lights were not headlights from an airplane. They weren't that bright. After I arrived at home which would have been about 10 minutes later, I looked up into the sky and noticed a huge com trail and that the helicopters were still actively searching for something about 10 or 15 miles or so from downtown Albuquerque. My estimations may be incorrect. I looked on the internet to see if there are any airplanes with that type of lights but could not find any. I then looked up on Youtube and realized that the lights of the UFO were the same as witnessed in Arizona. I'm still pretty shaken up and my blood pressure went up. I have a headache and still very scared."],"files":["/var/www/straped/mufon/html2text/33888.html.txt","/var/www/straped/mufon/org/33888.html"],"Object Shape":"Cigar","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around December 7th 2011"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.090451,+-106.648497(33888)&iwloc=A&hl=en\"> mufon case (33888) map </A>","Source":"MUFON","Case Number":"33888","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-106.648497","Object Flight Path":"Path with directional change,Path then hovering,Other","Region":"New Mexico","Date of the Event":"12/07/2011 10:15 UTC","Object Features":"Unknown"}