{"Disposition":"Unresolved","Summary":"Large dull black craft descended from within and then out of a misty cloud directly into my line of sight. Absolutely silent. No lights whatsoever.","Object Features":"Patterned Surface","divs":["sighting detailsi was out for a late evening walk in an area of lee's summit, mo, known as john knox village. i was walking north parallel to pryor road and as i ascended a small hill i happened to look up. there was an object descending and coming towards me which at first i took to be a small plane on a very dangerous downward trajectory. after a moment, i realized this very dark, lightless, craft (i can't think of what else to call it), was no plane at all. it was surrounded by a cloudy mist which seemed rather strange considering the night was cold and very clear. it seemed to be descending into my line of sight. it was, and this is the most startling thing, i think, absolutely silent. more than silent, it was almost as if it were surrounded by a vacuum of some sort. it descended into my line of sight at maybe 70 to 100 yards distant and perhaps 50 to 70 yards off the ground. i couldn't see the entire craft (again, i don't know what else to call it), but what i could see looked vaguely triangular and i could make out lines on it; straight lines running along it, so i knew it was something manufactured, not organic in any sense. it descended closer to me and lower to the ground when i spooked and turned around and walked quickly southward with my back to it. it was moving east to west along chipman road, very close to a shopping center. i can't possibly be the only person who saw this thing, it was practically on the ground. it moved effortlessly through the sky, drifting almost downward which is why my first impression was that it was a plane about to crash almost directly in front of me. it moved, as best as i can describe it, rather like the puck moves on an air hockey table. it was traveling no faster than 15 or 20 miles per hour and was semi-concealed in a whitish mist. it was, i must reiterate, absolutely silent and showed no indication of battling wind resistance or of having any visible means of locomotion. i wish i had not spooked so quickly and had taken a longer and more careful estimate of what was quite literally right in front of me. again, i can not give any definitive description of the size or shape of the craft, it was partially obscured by a mist\\fog\\cloud that it seemed to be moving along within. the experience lasted somewhere around 10 seconds before i turned away from it. this may be a silly and erroneous sort of thought, but i had the distinct impression that it had moved itself into my line of sight deliberately; almost as if it were showing itself to me. at no point did i feel menaced or threatened, in fact, the whole encounter had an almost playful feel to it, as if they or it or whatever wanted me to see it. i can not describe the trajectory otherwise as it descended quite deliberately into my immediate line of sight. this occurred approximately two and one half hours before this posting, so it is fresh in my mind."],"Country":"United States","Case Number":"33887","Source":"MUFON","Region":"Missouri","Viewing Distance":"101-500 Feet","Tags":"City","Latitude":"38.926272","Weather Factors":"Unknown","City":"Lee's Summit","Sighting Duration":"Undisclosed","trends":["There have been 52 other sightings in Lee's Summit","There were no other sightings in Lee's Summit on or around December 7th 2011"],"Date of the Event":"12/07/2011 10:25 UTC","Object Shape":"Triangle","Date Submitted":"12/08/2011 01:08 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/33887.html.txt","/var/www/straped/mufon/org/33887.html"],"Longitude":"-94.412455","Log Number":"US-12082011-0006","map":"<A HREF = \"http://maps.google.com/maps?q=38.926272,+-94.412455(33887)&iwloc=A&hl=en\"> mufon case (33887) map </A>"}