{"Date Submitted":"12/07/2011 08:47 UTC","Date of the Event":"12/07/2011 05:09 UTC","Sighting Duration":"Undisclosed","divs":["sighting detailsi picked up the grandkids from the sitter and was getting them in the car. i was about to close the passenger side door of the car when my 7 1\\2 year old grandaughter, in the back seat passenger side, said, \"look, the moon is moving.\" so i looked up (up and to the east)and explained that it was the clouds that were moving fast past the moon which looked almost full but not quite. then, i noticed a large, maybe circular, kind of fuzzy edges, but not sure, shadow below to the left of the moon. it appeared to be moving back and forth when all of a sudden, it shot across the sky, still behind the moving clouds, to the right (south) then down then south like a zorro elongated \"z\" and then disappeared behind heavier clouds. after that i thought i may have seen a very distant airplane further to the south in a break in the clouds by virtue of the lights and movement. my grandaughter immediately said, \"what was that? a big bird, a shooting star?\" i couldn't believe she saw it, too and i told her that i saw it and was excited because i had never seen anything like it. she even said that maybe it was an alien ship and i said it does seem like a ufo. we talked about how all of a sudden there were no clouds by the moon anymore, only to the south. anyway,.......my bad....she is terribly upset and frightened now, thinking it's an alien ship. now, we are hoping it was santa practicing his run....this was amazing and highly unusual and i may have dismissed it if she didn't see it, too. (names moved to fi box) cms 12\\07\\11 20:31 cst flg"],"Log Number":"US-12072011-0018","City":"Crystal Lake","Country":"United States","trends":["There have been 7 other sightings in Crystal Lake","There were no other sightings in Crystal Lake on or around December 7th 2011"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33881.html.txt","/var/www/straped/mufon/org/33881.html"],"Region":"Illinois","Object Shape":"Sphere, Other, Unknown","Case Number":"33881","Summary":"while looking at clouds passing the moon, a large shadow appeared below and behind clouds, hovered slightly back and forth then shot to the south behind misty clouds then disappeared. Both Grandaughter and myself observed at same time.","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.240216,+-88.371025(33881)&iwloc=A&hl=en\"> mufon case (33881) map </A>","Object Features":"Unknown","Object Flight Path":"Hovering then path","Latitude":"42.240216","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","Longitude":"-88.371025"}