{"trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around December 6th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33886.html.txt","/var/www/straped/mufon/more/33886_submitter_file2__sighting-01.jpg","/var/www/straped/mufon/org/33886.html"],"Summary":"Single stationary pulsating orb above the foothills of Boulder CO","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.010502","Object Shape":"Sphere","Date Submitted":"12/08/2011 01:02 UTC","divs":["sighting detailswalking home from university of colorado campus. looked up while about to cross the street and saw a glowing, pulsating, white\\yellowish orb above boulder's flatirons (foothills). this orb appeared to be identical to much other footage i have seen of such things, however it appeared by itself whereas the majority of other footage seems to include more than one orb. i viewed the object for about 10 min total. i decided to go onto the rooftop of a nearby building to get a better view, but when i did so, the angle of that location, the orb, and the foothill between caused the orb to be obscured from my view. i went to my car to drive up and over to the foothill, but had very little gas so i decided to just go home. in addition, my phone was about to die and i had no other device with which to record; i thought going to that length, it would have been pretty upsetting to have my phone die on me and not be able to document anything. i know the orb was not astronomical in nature. i am familiar with the night sky, and while it was early evening at the time, i could very clearly see jupiter near the moon. if the object were a normal star or planet, i conclude that it is very unlikely to have been brighter, and appearing larger than jupiter especially at dusk. i know the object was not a man made air craft because it remained stationary in the sky for a period of about thirty minutes, and there were airplanes in the sky at the time which were clearly very different in appearance. in addition, the way this orb pulsated was unlike any man made craft i have ever seen. it may be worthwhile to note that the orb appeared over park land, the map i included shows an approximate range of where i thought the object appeared."],"Log Number":"US-12082011-0005","Case Number":"33886","Object Flight Path":"Stationary","Date of the Event":"12/06/2011 05:20 UTC","Source":"MUFON","Object Features":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.010502,+-105.276945(33886)&iwloc=A&hl=en\"> mufon case (33886) map </A>","Country":"United States","Longitude":"-105.276945","City":"Boulder","Region":"Colorado","Tags":"City","Sighting Duration":"Undisclosed"}