{"Object Features":"Unknown","Case Number":"33885","Disposition":"Unresolved","Latitude":"42.43344","Object Flight Path":"Hovering then path,Path with directional change","Longitude":"-123.291617","divs":["Sighting DetailsThe very first time an event occured I was visiting my mother in the next county over and my Husband called my mothers phone and asked me to go outside and wanted to know if i could see the same thing.When i made it to the front porch I had a very clear veiw of the whole night sky and thier was a dime sized looking orbing moving strangly across the sky.It was very bright and looked as if it was just a star, so initially i just dismissed the occurance as a satalite or something of that nature. The next time I saw the Object it was barely dusk. I saw what i thought was a very bright star on the horizon.The Object seemed like it was getting bigger and moving closer, but my husband and I were driving down a winding road, so i stayed will my initial thoughts on it being a bright star. Until it looked as if it were right on top of us following our car down the road...I got this feeling like whatever it was knew i saw them. I told my husband I thought i was seeing the weird orb again but by the time he looked we thought it was gone,so he had me open the sun roof and it was directly above our car., as soon as he noticed it also it changed course and dissapered into the mountains. This third and last time my husband and i were coming home just after dusk driving down I-5 on the way back home we were coming down the mountain back to our home and I s=again saw this bright Light but did not think it was the same thing...Until we got closer i started to watch it move this time i was ready and got one picture off before my camera quit working ,i had my husband pull to the side of the road at the bottom of our driveway so i could take a picture on my digital camera,we were sitting still with my arm rested and the oobject also looked to be stationary at the time of the photo,but when i looked at the pic it looked like it was a strand of christmas lights or something. thanks for your time in reading and if there was any info you would like to know i left out please contact."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.43344,+-123.291617(33885)&iwloc=A&hl=en\"> mufon case (33885) map </A>","Viewing Distance":"Unknown","Date of the Event":"09/28/2011 12:00 UTC","Weather Factors":"Unknown","Log Number":"US-12082011-0004","Sighting Duration":"Undisclosed","City":"Grants Pass","trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around September 28th 2011","This sighting has never been favorited.",""],"Tags":"City","Object Shape":"Sphere","Summary":"My family and comunity has been seeing unusual glowing orbs...with we know are not planes!","Source":"MUFON","Date Submitted":"12/08/2011 12:57 UTC","files":["/var/www/straped/mufon/html2text/33885.html.txt","/var/www/straped/mufon/more/33885_submitter_file1__158.JPG","/var/www/straped/mufon/more/33885_submitter_file2__159.JPG","/var/www/straped/mufon/org/33885.html"],"Region":"Oregon"}