{"Date Submitted":"12/07/2011 08:20 UTC","files":["/var/www/straped/mufon/html2text/33880.html.txt","/var/www/straped/mufon/org/33880.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.785286,+-124.130948(33880)&iwloc=A&hl=en\"> mufon case (33880) map </A>","Log Number":"US-12072011-0017","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Oval, Triangle","Weather Factors":"Unknown","Object Features":"Unknown","Disposition":"Unresolved","Latitude":"40.785286","Date of the Event":"12/05/2011 12:00 UTC","Country":"United States","trends":["There have been 12 other sightings in Eureka","There were no other sightings in Eureka on or around December 5th 2011"],"Sighting Duration":"00:03:00","Longitude":"-124.130948","divs":["sighting detailsmy girlfriend awoke me early monday morning, about 6:30 am, it was still dark outside. i could hear the urgency in her voice and i quickly leapt out of bed. i went out back to see what she was looking at, and there was a bright yellowish greenish light in the sky just above the treetops to our south. i went back in to grab the binooculars as it seemed fairly far away. it first appeared to be static, but withing seconds looked as if the lights were pulsing and changing shape, and sometimes just completely shutting off, with a faint outline of the dark object, and a single dim red light in the center. fairly soon after watching it, it hovered\\floated slowly out of view. then the following evening, after we had finished up the work day, my girlfriend was on the back porch, having a smoke, and i hear her again calling for me to come quick. it was a little after 6 pm and i went for the binoculars again, and got a good view of it. this time the object appeared to be yellow-orange and the light was more in the shape of an oval. it may have been slightly closer this time, but it seemed larger thand just the outline of the light. then it acted the same as before, shutting the bright light on and off. when the light was off, even though it was dark you could still make out a faint outline of the object, hard to tell the shape though. creepy."],"Region":"California","City":"Eureka","Object Flight Path":"Hovering then path","Case Number":"33880","Tags":"City","Summary":"Yellow Lights sighted twice southeast of Eureka, California","Source":"MUFON"}