{"City":"GALLERIA MALL/RICHLAND/MO","Date Submitted":"12/08/2011 06:11 UTC","Object Shape":"Flash, Sphere, Star-like","Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Viewing Distance":"N/A","Region":"Pennsylvania","Log Number":"US-12082011-0014","Summary":"STRANGE INTENSE COLORFUL FLASHING LIT UP SKY/POWER OUTAGES OR FLICKERING LIGHTS/WITNESSES SAW BALLS OR STAR LIKE OBJECTS IN SKY WHITE/GREENISH VERY BRIGHT","divs":["sighting detailsthis all began last night when around 8 pm, while in the kitchen our lights began to flicker. we thought nothing of it. weather maybe? then at 11pm while watching a movie, my boyfriend & i noticed from the window that there was something weird w the sky, despite the blinds being completely closed. we opened them and witnessed the densely cloudy\\snowy sky, become incredibly illuminated 2 separate times, by bright organge\\green and mostly blue flashes of lights. like lightening but with out the bolt. just light. it had been a very cold snowy day, the sky at this time was extremely cloudy and dense there is no way this could have been siren lights or a plane or helicopter. there was about a 5 min lapse between our 2 sightings of the flashing lights. the 1st lasted about 10 seconds. the 2nd was just quick. we camped out on our porch waiting for more but never saw any more. we heard others on our block from their windows screaming \"come look, it is happening again\" this was from about 11-1130pm est.also, after the 2 light occurrances we'd witnessed, sirens went off each time, but for a very brief period of time. however, over the hill across from our apt, the sky was dark gray and cloudy with the exception of a portion in the trees on the hill - it looked like how headlights illuminate a foggy night, you cannot see the individual 2 headlights but rather you see a bright white illumination coming your way. it was mostly stationary and broad. but sorta shifted from right to left at one point. very slowly. almost unnoticeable. again this was not a beam or singular light, but a white glowing on the hill through the pine trees. my boyfriend and i immediately posted our experience, albeit small and explainable, online via facebook. immediately there were responses of other witnesses from all over our small western pa town. one friend, said she had been closing up at work at the mall around 9pm and the entire department store went pitch black. the local mall is about 20 minutes from my home. ironically the mall is also within a few miles of the military base and a small local airport. my boyfriend works very close to the airport and when he left work that evening at about 445pm he said a certain road was closed off, and there was a detour. there was a fire truck and policeman directing traffic. on this particualr day, we had our 1st real snow\\winter occur. however, he saw no real reason why a road was closed or why there would be officials directing traffic. the roads were not good but they were not horrible. people from all over town responded on facebook saying they had flickering lights or a power outage in their homes or business. my mother had called me telling me when going home from work she witnessed a slew of police and fire engines driving like mad in one direction towards a main street that is located between the mall and where i live. here are a couple of posts from my facebook newsfeed of individuals who actually saw some crazy stuff in the sky!! i have given them this link and have urged them to report their stories as mine pails in comparison to what they witnessed. \"about 11 pm my husband went to the gas station in moxham. but then called home to tell us about \"flashes\" of freaky rainbow colored lights. of course we laughed at him and told him to shut him up, but then we looked out the window... it was as if there were a stage light from overhead with a lens that would change colors with each flash of light. we saw red, then orange, yellow, then green. it would flash blue a little longer than the other colors. richland direction looked really bright and towards moxham it was very dark grays and black. the lights did seem the brightest looking up through the gully towards walters ave\\ galleria direction (where the mall and military bases are located).it was so bright it was like daylight. if you find out what it was, please post it because had we not seen this ourselves, we wouldn't have believed it. my husband said also said he and his friend saw the colored lights earlier along with 2 silver balls of light. it was only when it the flashing colorful sky happened, that he decided to call and tell me.\" \" so -- good to know im not crazy and that others saw this..i was headed home from work late last night & i was talking to my boyfriend on my cell & i abruptly stopped & was like \"woah what is that?\" i saw blueish like flashing coming from the sky. i thought maybe it was cops or an ambulance siren but there was none around. i was on the highway and would have seen them. then, what i thought at 1st was a shooting star,came straight down on the right hand side of 219 (highway) and descended into the woods. when it came closer it was a bright green ball of light. it was strange & i thought \"i am crazy\". lol\" unfortunately no one was able to capture anything on video or a picture."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.212192,+-77.189895(33898)&iwloc=A&hl=en\"> mufon case (33898) map </A>","Object Features":"Undisclosed","Case Number":"33898","Country":"United States","files":["/var/www/straped/mufon/html2text/33898.html.txt","/var/www/straped/mufon/org/33898.html"],"Tags":"City","Date of the Event":"12/07/2011 12:00 UTC","trends":["there have been no other sightings in galleria mall\\richland\\mo","This sighting has never been favorited."],"Weather Factors":"Unknown","Longitude":"-77.189895","Latitude":"41.212192","Sighting Duration":"Undisclosed"}