{"Longitude":"174.76499","Latitude":"-36.850712","files":["/var/www/straped/mufon/html2text/33890.html.txt","/var/www/straped/mufon/more/33890_submitter_file1__IMG_1329.JPG","/var/www/straped/mufon/more/33890_submitter_file2__IMG_1330.JPG","/var/www/straped/mufon/more/33890_submitter_file3__IMG_1335.JPG","/var/www/straped/mufon/org/33890.html"],"Sighting Duration":"Undisclosed","Case Number":"33890","Tags":"City","Disposition":"Unresolved","Log Number":"NZ-12082011-0009","trends":["There have been 51 other sightings in Auckland","There were no other sightings in Auckland on or around December 8th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path,Path with directional change","Summary":"Bright light stationery, disappeared, reappeared moving and then descending","Country":"New Zealand","divs":["Sighting DetailsI am currently in Auckland, New Zealand for 6 weeks and I am staying in a 7th floor apartment in the central city. Thought I'd check out what stars I could see from my window so did a google for star software and found and opened Yoursky and set it up for Auckland horizon view southwest. Looked out the window and saw a bright light in the sky (with long rays due to my eyes being temporarily short sighted from hyperbaric oxygen treatment) and thought probably not a plane. No other stars visible and light just starting to fade. Thought I'd take a couple of photos on 20x zoom with my Canon G11 and was surprised at that zoom it was a round sphere so thought it was maybe a planet. Checked software and figured must be Venus. OMG looked out window 20 minutes later and it wasn't there. 10 minutes later thought I saw same light a little dimmer moving across sky and then suddenly diving straight down behind the building. Tried taking another photo of sky to show no light but camera had trouble focusing due to lack of light. Finally managed to take photo with manual settings and wider zoom, now dark. Photos attached showing sphere above 13 storey building opposite my apartment, first with flash on 20x zoom, second with no flash 20x zoom, third with no sphere taken at wider zoom in dark. The sphere is near to the left hand mast on top of the building in first 2 photos."],"Date Submitted":"12/08/2011 04:47 UTC","City":"Auckland","map":"<A HREF = \"http://maps.google.com/maps?q=-36.850712,+174.76499(33890)&iwloc=A&hl=en\"> mufon case (33890) map </A>","Region":"Auckland","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","Object Features":"Unknown","Source":"MUFON","Date of the Event":"12/08/2011 12:00 UTC","Viewing Distance":"Unknown"}