{"Disposition":"Unknown","Case Number":"33895","Object Flight Path":"Path with directional change","Log Number":"US-12082011-0011","Longitude":"-80.077178","Tags":"City","files":["/var/www/straped/mufon/html2text/33895.html.txt","/var/www/straped/mufon/org/33895.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.937183,+-80.077178(33895)&iwloc=A&hl=en\"> mufon case (33895) map </A>","Weather Factors":"None","Region":"Florida","Viewing Distance":"Over One Mile","Latitude":"26.937183","Date Submitted":"12/08/2011 04:57 UTC","divs":["Sighting DetailsMy wife and I went to the beach on Monday afternoon...it was a beautiful afternoon and we decided to hang down there for the last couple of hours of sunlight. My wife usually takes her binoculars with her, She checks out the boats and hopes to see things like manatees and dolphins. I noticed a contrail out over the ocean WAY up there. It appeared to be a commercial jet. Now commercial jets around here are not unusual. We're on the glide path to Palm Beach International Airport and they usually break the coast around here at about 5000 feet. (I know it's 5000 feet because the last time I flew back here and we went over our house and I checked the altitude thing on the screen of my seat.) But this one was at cruise altitude, 35-40,000 feet. I pointed it out to my wife who looked at it through her binoculars. She looked at it and said \"what's that behind the jet?\" So I looked up and there was another object basically on the same path as the jet about 4 inches (from our perspective)behind it. I took the binoculars to look at it. It did not have a contrail which led me to beleive it wasn't as high as the COmmercial jet. I thought at first it might be a small private jet. But I could not see any wings or tail, and the back third of the object was glowing a burnt orange. I watched through the binoculars for a couple of minutes. It was on a straight path. THEN it started to turn to the left and THEN it just disappeared. THERE WAS NO SOUND. But then again we couldn't hear the Commercial jet that preceeded it either. I'm not saying this is extraterrestrial. But since I have no idea what it was I'd say it was a UFO. My wife just read this and she said it looked to her like a squid without tentacles and glowing at the back end. Any ideas?"],"Source":"MUFON","City":"Jupiter","Country":"United States","trends":["There have been 14 other sightings in Jupiter","There were no other sightings in Jupiter on or around December 6th 2011"],"Object Shape":"Cylinder","Summary":"Object, very high, looked through binoculars and it was not an airplane","Object Features":"None","Sighting Duration":"Undisclosed","Date of the Event":"12/06/2011 04:00 UTC"}