{"map":"<A HREF = \"http://maps.google.com/maps?q=42.941089,+-85.717848(33901)&iwloc=A&hl=en\"> mufon case (33901) map </A>","Weather Factors":"Unknown","Object Shape":"Unknown","divs":["Sighting DetailsIn 2007 my mother told me that she had been abducted by aliens. I was the only person she has talked to about her experience, because I was the only one who believed. So this is her amazing story. My mother awoke one night around 12am in a paralyzed state, she looked over and seen a dozen or so pairs of red eyes, small and beady.but she said at first that was all she could see was their eyes, she said the rest of their bodies were almost invisible. Only visible enough to distort the view behind them. She said then that some of them came up to her and began poking her, with their three fingered hands. One of the creatures breathed in her ear, as she said it sounded like what movies typically depict them as sounding. After that the paralyzing feeling lifted, so she got up to walk to the bathroom, hoping she was just dreaming, but all 12-15 small creatures followed her to the bathroom, and then to the kitchen and back to her bedroom, She said they never said anything the whole time they were following her. but they were still semi-see through, and floating behind her as she walked room to room. after she got to her bedroom, she laid down and seen that there was a light in the backyard, so she leaned over to she where the light was coming from, and that is the last she remembers till the next morning, when she woke up. She doesn't remember falling back asleep. Which my mother has had insomnia for years and has always had trouble falling asleep, and staying asleep. She never lost sight of them,the whole time all this was happening. But they were gone when she woke up the next day. my sister shared a bed with my mom at that time and was never woken up or disturbed during the whole event. My mother has nothing to gain from making up such a story, if anything it has caused people to look at her like she is crazy. But upon researching the type of small humanoid she seen, i found many abduction victims reported the same semi-see through creature with read eyes, and is the size of a small child"],"trends":["There have been 5 other sightings in Wyoming","There were no other sightings in Wyoming on or around September 27th 2007"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-85.717848","Source":"MUFON","Object Flight Path":"Path then hovering","Latitude":"42.941089","Log Number":"US-12082011-0018","City":"Wyoming","Tags":"City","Date of the Event":"09/27/2007 12:00 UTC","Case Number":"33901","files":["/var/www/straped/mufon/html2text/33901.html.txt","/var/www/straped/mufon/org/33901.html"],"Region":"Michigan","Summary":"My mother was abducted by aliens, Small, with red","Date Submitted":"12/08/2011 07:27 UTC","Country":"United States","Object Features":"Appendage(s)","Viewing Distance":"20 Feet or Less"}