{"Tags":"City","Region":"Florida","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date of the Event":"10/24/2011 12:00 UTC","Disposition":"Unknown","City":"Pace","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/33900.html.txt","/var/www/straped/mufon/org/33900.html"],"Object Shape":"Egg, Oval, Sphere, Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=30.632103,+-87.145624(33900)&iwloc=A&hl=en\"> mufon case (33900) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"12/08/2011 07:22 UTC","Log Number":"US-12082011-0017","Summary":"First thought was aircraft. It was NOT a plane. It was very bright on the botton and glowed red in a translucent manner on the upper part of craft. Shaped like a hot air ballon or light bulb.","Country":"United States","Longitude":"-87.145624","Source":"MUFON","Case Number":"33900","trends":["There have been 4 other sightings in Pace","There were no other sightings in Pace on or around October 24th 2011"],"divs":["Sighting DetailsI was outside my home, smoking an evening, after dinner cigar. I live on a flight path going into Pensacola FL airport. I glanced to the NE at a very bright light. At first I thought it was an inbound commercial aircraft, with the landing spotlights on. It was SO BRIGHT. As it got closer, I could see it was VERY bright on the bottom but the top portion was red. Glowing red, almost translucent. It was also quite large. I thought of a bright red, clear ruby, shaped like a hot air balloon but it was moving way fast. I watch it disappear into the distance. (in a SSW direction)I was beside myself trying to think of what it could have been. I keep looking in the direction it went and tryed to decide if I should call 911 or the Sheriffs Dept. I decided against that. I then returned to where I had been sitting (on the diving board of my swimming pool) when I notice another bright light coming from the same direction and the same altitude. I'll be damned if it wasn't another one EXACTLY like the first one that had just disappeared. It was like an instant replay of the first one. It also disappeared into the distance. It is very difficult to measure the total time but I think it was possibly 15 minutes from start to finish. There were NO commercial aircraft at that time and this thing was TOTALLY silent. This all really confused me because my brain could not tell me what I was looking at. I have let over a month pass before reporting this but I just can't get it out of my mind. What the heck did I see? It was a clear, cool, calm, beautiful evening. It was shaped like a incandesent light bulb. With the bottom, screw in part VERY bright, white light, with the upper glass part, glowing bright red and translucent."],"Latitude":"30.632103"}