{"Object Flight Path":"Hovering then path","Date Submitted":"12/08/2011 07:44 UTC","Region":"Kentucky","Latitude":"37.859248","trends":["There has been one other sighting in Clay City","There were no other sightings in Clay City on or around May 29th 2011"],"City":"Clay City","divs":["Sighting DetailsI was camping out on my friends farm on the night of Saturday May 28th, 2011. At around 1am on that Sunday morning I was sitting outside my tent by the fire. I was alone. The night was incredibly clear, I could see the dust of the Milky Way Galaxy and millions of stars. I am an avid star gazer and am familiar for the most part with their locations and how they should appear. I was looking up at the stars a lot that night because it was so clear and they were so beautiful away from the city lights of Lexington where I live. At this time( around 1am) I observed nearly directly overhead a huge, bright object. At first I thought it was Venus, but it seemed too large, bright and round-like, the edges were nearly clear and also wasn't where Venus should be located that time of year. I could not take my eyes off of it for about 45 seconds to 60 seconds. I had no idea what I was looking at, it made no noise, it did not move as if it was a plane or helicopter, it was stationary. I felt a strange connection with the object, this I am really unable to describe. Almost as if it were only me and the object out there and not the handful of friends that had gone off into the woods to hike around that night. Also almost as if it were watching me. As I began to consider I was perhaps looking at a UFO it abruptly shot off to the right and after about 2 seconds disappeared completely. This to me was the most baffling part. It was no meteor, meteors don't hover for half a minute and while they do disintegrate it is relatively gradual in comparison with how this object just vanished from such brightness. And when it disappeared it was still overhead so it certainly did not go behind the treeline. There was not a single cloud in the sky that night so it didn't vanish into the clouds. For something so bright, that seemed like Venus because it did not move, to suddenly vanish into the air intrigues me to this day. A plane sometimes appears very bright when approaching but then as it nears your perspective of it changes and you will notice blinking lights etc. Not to mention it will not disappear on a clear night. When it vanished I ran trying to spot it again, it was gone, it literally just blinked out like someone turned the lights off, I know what I saw, it was not man made. I know of no aircraft that can hover, then move so rapidly into another direction, and most importantly vanish seconds later on a clear night away from city light pollution. Had it been man-made and for some reason they just turned off the lights(unlikely), the moon was bright enough that it would have still reflected off of it. I have always been a little curious about UFO's, but after I saw this several months ago I have found myself researching UFO's nearly everyday. I cannot stop thinking about what I saw. It is a situation where when I describe it to someone else they dismiss it as one of the things I have mentioned already; a star, a meteor, an aircraft or just look at me like I am crazy. I am a senior in college, I certainly don't want to go around telling people this story and having them believe too many hours of homework have taken their toll if you get my drift. But I was there, I am 27 years old, I've seen all of these things before(planes. meteors, planets), and it was something else. There is no agenda in my sharing this experience, I don't want attention or something. I just feel that your organization could appreciate what I saw and it makes me feel better being able to discuss it to someone who in turn doesn't think I am crazy. Again, I know what I saw. I hope this helps you, it has helped me in sharing it. Also I wanted to mention I have a camera phone but it had died earlier the day before when I arrived at my friends farm and had it not been dead there was not enough time to grab it and take a picture. I didn't want to let this thing out of my sight."],"Sighting Duration":"00:02:00","Tags":"City","Date of the Event":"05/29/2011 01:00 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/33903.html.txt","/var/www/straped/mufon/org/33903.html"],"Country":"United States","Case Number":"33903","Longitude":"-83.918532","Weather Factors":"None","Source":"MUFON","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.859248,+-83.918532(33903)&iwloc=A&hl=en\"> mufon case (33903) map </A>","Log Number":"US-12082011-0020","Object Shape":"Sphere, Star-like","Viewing Distance":"Unknown","Summary":"Witnessed a Venus like object(thought was Venus but seemed to bright and spherical) hovering high in the sky, then shot off to the right and dissapeared."}