{"Object Flight Path":"Unknown","Date Submitted":"12/08/2011 09:39 UTC","Date of the Event":"11/11/2011 12:23 UTC","Summary":"I was taking photos of what I thought may have been 'chemtrails'. Upon viewing photos later that day, I noticed things that I could NOT SEE with my eyes while I was photographing the sky.","Longitude":"-80.3458","divs":["sighting details1. i was at the park with the kids and i saw what i thought were chemtrails so i started to photograph them to show to my friend for his opinion. 2. i was going back through the pictures after returning home, and noticed a pink flash of light. i emailed the photos to my friend, who examined them thoroughly, using a huge hdtv to zoom in, and he told me i should report this. 3. i thought it must be a ufo, seeing as it is unidentifiable thusfar. 4. according to my photos, it seems to have moved significantly in aprox. six seconds between the two photos, and in the first one it's a little white circle or saucer looking shape, but the second photo it's in a different spot and it's casting a bright pink light from it. 5. i just want to know the truth. 6. i never knew it was there until i got home, which stinks because i'd have loved to been aware and had the opportunity to further photograph this object. here is a link to the google map of where i took these pics. http:\\\\maps.google.com\\maps?um=1&ie=utf-8&q=robert+e+minsky+gym+34953&fb=1&gl=us&hq=robert+e+minsky+gym&hnear=0x88deea3a4ccbe49d:0xd90708a2eee0f25d,port+st+lucie,+fl+34953&cid=0,0,4613978981690610015&ei=wnthtvc1mjgetge54ez6ba&sa=x&oi=local_result&ct=image&ved=0cagq_bi"],"City":"Port St Lucie","Source":"MUFON","Tags":"City","Case Number":"33911","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.279593,+-80.3458(33911)&iwloc=A&hl=en\"> mufon case (33911) map </A>","files":["/var/www/straped/mufon/html2text/33911.html.txt","/var/www/straped/mufon/more/33911_submitter_file1__IMG_20111111_122358.jpg","/var/www/straped/mufon/org/33911.html"],"trends":["There have been 15 other sightings in Port St Lucie","There were no other sightings in Port St Lucie on or around November 11th 2011","This sighting has never been favorited.",""],"Country":"United States","Region":"Florida","Latitude":"27.279593","Viewing Distance":"Unknown","Object Features":"None","Disposition":"IFO","Log Number":"US-12082011-0028","Object Shape":"Cylinder, Disc, Fireball, Flash, Unknown","Sighting Duration":"Undisclosed"}