{"Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Hoax","Object Shape":"Sphere","Object Features":"Other","Summary":"I saw a beam of light then there were theselittle guys being supported by these orbs that were scanning the surroundings.","Log Number":"US-12082011-0027","Case Number":"33910","divs":["Sighting DetailsI went outside to smoke a cigerette around 11:30 at night. I then saw a black object hovering in the sky and I rushed to grab my cell phone to try to record it. For some strange reason my cell phone wouldnt work. I looked up and noticed a beam of light shooting out with orbs straight to the ground with theses tall skinny beings. I wanted to go inside but something was prohibiting me too. Now the orbs were what I would think to be scanning the area while the beings seemed to be instructing them with some black device. Then they made their way towards me and I was beside myself. Now there was one that was slightly taller and seemed to be in charge and somehow communicated with me telipathicall, saying that they mean no harm and that they have been studying man for centuries. Now one of the orbs scanned what I can explained as a scanner like you would see in a science fiction movie. They were examining me for about 5 to 10 minutes and wanted to go inside but pleaded with the one I was talking to not to go in to protect my family. The strangeast thing happened! He seemed to do a slight bow of respect and slowly walked off my porch and left!"],"Latitude":"28.658458","files":["/var/www/straped/mufon/html2text/33910.html.txt","/var/www/straped/mufon/org/33910.html"],"Date Submitted":"12/08/2011 08:50 UTC","City":"Altamonte Springs","Date of the Event":"12/07/2011 11:30 UTC","Region":"Florida","Source":"MUFON","Viewing Distance":"20 Feet or Less","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Longitude":"-81.394248","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.658458,+-81.394248(33910)&iwloc=A&hl=en\"> mufon case (33910) map </A>","Tags":"City","trends":["There have been 4 other sightings in Altamonte Springs","There were no other sightings in Altamonte Springs on or around December 7th 2011"]}