{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"None","Summary":"More of an orb-like object","Weather Factors":"Unknown","trends":["There have been 8 other sightings in Rio Rancho","There were no other sightings in Rio Rancho on or around July 12th 2011","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/33926.html.txt","/var/www/straped/mufon/more/33926_submitter_file1__DB2.JPG","/var/www/straped/mufon/more/33926_submitter_file2__DB3.JPG","/var/www/straped/mufon/more/33926_submitter_file3__DB4.JPG","/var/www/straped/mufon/org/33926.html"],"Latitude":"35.226601","Country":"United States","divs":["Sighting DetailsI like taking pictures. I've always believed that if you take just one photo of the sky results of the photo or anything to argue with would be minimal at best. So, I've always made it a habit of taking photos in sequence. In that way enabling me to decide whether or not something belongs or doesn't belong. I took approximately 4 to 5 photos of a clear area somewhat to the left of the sun and clouds. In the very last photo there is an orb-like object. It doesn't appear to be moving- if it was, I couldn't tell. It definitely is not a glare from the sun. I also took other photos on other days, and noticed glowing lights that didn't belong. And in those sequence of photos, you can see that the object is moving. If I ran my photos from left to right in sudden sequence, you can see that the glowing light is moving. It's only obvious. I understand that there are people out there faking pics, but I can tell you that isn't the case with mine. You are more than welcome to look at them and study them any way you feel that is necessary. I'm not reporting that I saw a ufo. I'm reporting exactly what I've filed my pics under- \"Doesn't Belong\". But if it doesn't belong, and it can't be explained, then I personally would have no choice but to say it was a ufo. But I'm not the expert, that may be for you to decide. And at the same time, it doesn't take a rocket scientist to tell me what it is or isn't. If you're interested please call me. If not, I'll just put these on \"Facebook\" and share them with others. I'm 53 years old, and I definitely do not have time for games, here. If you guys are legit, or just out there treating this stuff like tabloid material, I will know based on how you respond. I also saw what I have no choice but to assume was a satellite being maneuvered until it came to a complete stop. And to this day, that object what I think is a satellite is still there. I would like for you to confirm that for me as well, if you don't mind. I thank you for your time. Jack Menendez"],"Longitude":"-106.642042","Date of the Event":"07/12/2011 12:00 UTC","Region":"New Mexico","Date Submitted":"12/09/2011 12:51 UTC","Case Number":"33926","Object Shape":"Circle, Oval, Unknown","City":"Rio Rancho","Object Flight Path":"Stationary","Log Number":"US-12092011-0007","map":"<A HREF = \"http://maps.google.com/maps?q=35.226601,+-106.642042(33926)&iwloc=A&hl=en\"> mufon case (33926) map </A>","Source":"MUFON","Tags":"City"}