{"City":"San Antonio","Longitude":"-98.490878","Date of the Event":"10/13/1998 09:00 UTC","Case Number":"33928","Object Flight Path":"Hovering then path","Sighting Duration":"00:02:00","Source":"MUFON","Summary":"Glowing sphere, with several smaller glowing spheres circling it, descended and then off left.","Country":"United States","Object Features":"None","Latitude":"29.433702","divs":["Sighting DetailsThis was taken around 9pm on what used to be the outskirts of San Antonio. There was cloud cover, so the sky was dark and easy to notice this object slowly dropping out of the clouds. It seemed to have one central glowing ball and three to four smaller versions that rotated around the lower half. I was on a hill and you can see the tree line below on the first photo. By the time the second photo was taken, it begins to disappear into the tree cover. No sound, very silent. These were the only two photos I could get focus on before it was out of sight. My apologies for the prints on the film. NOTE: This area is also less than two miles away from an Army installation, Camp Bullis. My first thought was it was a helicopter turning toward me because of the sudden, direct bright light and decent from the cloud cover. It was in no way frightening, however it was a heart-pounding experience to say the least; seeing something you can't explain with rational thinking. I'm hoping this post might facilitate others to comment if they were in this area in 1998."],"Weather Factors":"Unknown","Object Shape":"Circle","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=29.433702,+-98.490878(33928)&iwloc=A&hl=en\"> mufon case (33928) map </A>","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around October 13th 1998","This sighting has never been favorited.",""],"Tags":"City","Region":"Texas","Date Submitted":"12/09/2011 01:44 UTC","files":["/var/www/straped/mufon/html2text/33928.html.txt","/var/www/straped/mufon/more/33928_submitter_file1__Image0001.jpg","/var/www/straped/mufon/more/33928_submitter_file2__Image0002.jpg","/var/www/straped/mufon/org/33928.html"],"Log Number":"US-12092011-0009","Disposition":"Unresolved"}