{"City":"Portland","Viewing Distance":"Over One Mile","Case Number":"33922","Object Shape":"Flash, Star-like","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/33922.html.txt","/var/www/straped/mufon/more/33922_submitter_file2__DSC_0561.JPG","/var/www/straped/mufon/org/33922.html"],"Object Flight Path":"Hovering then path","Object Features":"None","Weather Factors":"Unknown","divs":["Sighting DetailsThis is the third time in six months that me and my fiance have noticed a strange color changing light in the sky. This time we ran inside and I got my HD vid camera and she got her Nikon SLR and we got some shots to share. This is something that is WAY brighter than everything else in the sky. This is also bigger than all the stars in the sky. The object seems to pulse different colors, blue,green,purple,white,gold,orange & red. Portland is usually full of clouds but this night is a cold & clear one. This typically stays for a couple hours but I have to go to bed and get up early for work. A couple months ago when this appeared, we saw it the next morning back between the radio towers from our point of view. It has moved slowly from side to side many times. Please let us know if we are just seeing a planet or maybe the space station or something? I am not very good with astronomy so maybe it's nothing, but it sure sticks out like a sore thumb, it just looks out of place. Any feedback would be great, cause it's a little creepy."],"Date of the Event":"12/08/2011 10:05 UTC","Date Submitted":"12/09/2011 02:23 UTC","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=45.552265,+-122.768313(33922)&iwloc=A&hl=en\"> mufon case (33922) map </A>","Summary":"Again, 3rd time in 6 months, same location","Latitude":"45.552265","Country":"United States","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around December 8th 2011","This sighting has never been favorited.",""],"Sighting Duration":"01:15:00","Source":"MUFON","Longitude":"-122.768313","Log Number":"US-12092011-0003","Tags":"City"}