{"Date Submitted":"12/09/2011 10:31 UTC","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","divs":["Sighting DetailsHigginsville, NY. As I stepped out from under my porch, I notice directly above me two aircraft. The first aircraft had static lights that were triangle shaped, the second aircraft was absolutely directly behind the first, and had a box-shaped array of lights. I deliberately noted that I could see the background sky between the 2 objects. I then ran into the house to notify family, who came running out to the front of the house, which we then saw only 1 object (or a cluster of lights that only seemingly would look like 1 aircraft). Although I previously saw the distinction of 2 aircraft with the sky between the two, by the time we all ran out we only saw 1 cluster of lights. What they remarked on was that there were an unusual number of solo blinking lights around the yellow'ed clusters of lights. There had to be about 5 blinking white lights following the cluster of yellow lights. The cluster of yellow lights and accompanying white lights continued from E to NE, at a slight inclination. The fact that there were unusually # of single white lights following this small cluster of yellow lights as it head toward the Syracuse, NY airport was indeed a fact to mention."],"trends":["There has been one other sighting in Sylvan Beach","There were no other sightings in Sylvan Beach on or around December 8th 2011"],"Log Number":"US-12092011-0016","files":["/var/www/straped/mufon/html2text/33935.html.txt","/var/www/straped/mufon/org/33935.html"],"Date of the Event":"12/08/2011 07:30 UTC","Object Shape":"Flash, Square, Rectagular, Triangle","Summary":"Two objects, first one triangle-shaped lights, other square sharped.","Weather Factors":"Unknown","Longitude":"-75.72871","City":"Sylvan Beach","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.200547,+-75.72871(33935)&iwloc=A&hl=en\"> mufon case (33935) map </A>","Country":"United States","Viewing Distance":"Over One Mile","Case Number":"33935","Latitude":"43.200547","Region":"New York"}