{"Country":"United States","Region":"South Carolina","Log Number":"US-12102011-0010","Object Features":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.001608,+-78.908256(33949)&iwloc=A&hl=en\"> mufon case (33949) map </A>","Date of the Event":"11/20/2011 12:00 UTC","Source":"MUFON","Summary":"ufo being chased by usaf f-16's with afterburns on high","Sighting Duration":"Undisclosed","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/33949.html.txt","/var/www/straped/mufon/org/33949.html"],"Case Number":"33949","Tags":"City","Disposition":"Unresolved","Date Submitted":"12/10/2011 02:52 UTC","Weather Factors":"Unknown","City":"Loris","trends":["There have been no other sightings in Loris","This sighting has never been favorited."],"Viewing Distance":"101-500 Feet","Latitude":"34.001608","divs":["Sighting Detailsfor approximately one full week in november, i watched these events each night. it started as i sat on my steps to smoke, and saw a grouping of three (3) very bright lights at a distance about a 20 degree level from the horizon. at first i thought they were landing lights on a commercial jet. however, as i watched it did not move either forward or reverse. i watched for approximately 25 - 30 min. and called my fieind out to see what she thought of it. we watched for about 10 minutes, then came inside. about an hour later, we heard two air force jets go over very low to the ground. i wasn't even thinking about anything with reference to the item we had seen earlier. i looked in that direction as we closed the door and saw that the lights were no longer there. about 15 - 30 minutes later, i heard the faint sound of a jet at high speed. having spent a few years in viet nam, i rocognize the sounds of high speed aircraft. i ran to the front door, and out into the front yard. just as i looked up i saw a light go by at a very high speed. almost immeadiately, an f-16 ( i think) with afterburners burning and glowing went over. then next his wing man off to the left of his flight path and also glowing went over. as they disappeard over the trees my first thought was, WHAT ARE THEY DOING WITH AFTERBURNERS ON? i thought it was kind of a w written rule that you couldn't light them over residential areas. two days later i could not sleep and got out of bed at 5 a.m. i went out and sat on the steps, looked to the north, and there again were lights in the same spot. i knew it wasn't landing lights because of the time. commercial flights here don't begin until 6 a.m. i watched it until i got tired, then went inside to make coffee."],"Longitude":"-78.908256"}