{"map":"<A HREF = \"http://maps.google.com/maps?q=30.468862,+-97.789255(33940)&iwloc=A&hl=en\"> mufon case (33940) map </A>","Object Features":"Unknown","Date of the Event":"02/16/2011 10:00 UTC","Country":"United States","Region":"Texas","Summary":"A huge diamond shaped craft that was silent and bright.","Sighting Duration":"Undisclosed","Object Shape":"Diamond","Longitude":"-97.789255","Viewing Distance":"101-500 Feet","City":"Austin","Tags":"City","Source":"MUFON","Latitude":"30.468862","Disposition":"Unresolved","Date Submitted":"12/10/2011 10:21 UTC","divs":["Sighting DetailsThis past February I was with 3 friends at my house at El Salido and Blazing Star Tr. Late on a Saturday I went with one of my friends to his house to pick something up while my other friend stayed at my house. On our way back (going north on Anderson mill rd towards Fm620) my friend pointed ahead of us at a light and was in awe trying to figure out what it was. When I first saw it, it looked like a meteor or something on fire like a plane was coming down really fast towards us. But it was big and very bright almost like the moon but yellow glowing. We finally got closer as we approached Anderson mill and FM620. Still trying to make a normal explanation for what I was seeing, but I wasnt convincing myself of anything but a helicopter or something on fire. Once we got to FM620 ready to take a right east we stopped because it was stationary and about 500 feet or so ahead of us but at a distance to where I still was having trouble figuring out what it was, I could see blue and red flashing lights as well as a yellowish orange light as if something was burning or a flame. We were at the stoplight and I looked around our stoplight was green, no one was moving (4-way light) and it seemed as if they were all focused on the strange object. I rolled down the windows and my friend and stuck our heads out the window to get a better look. I could not hear anything it was complete silence and I had a very eire feeling. Still trying to comprehend the object it started to move slowly and it was directly above us and for the first time I could get a good look at what I was seeing. I was shocked and in awe as if I was watching the movie Independence day when I saw a massive diamond shaped craft, that appeared to be about 7 to 10 planes wide, I cant really give a good estimate but it seemed bigger than anything I had ever seen fly. What confused me the most was that the harder I tried to look at it, it seemed to be almost see through like having some cloak or some kind of camoflage, but you could still see the shape and size, but also the clouds and stars behind it. Also as we slowly turned right at the stoplight going east the object moved very slowly over us and to the south at literally like 10 to 30 miles an hour, it was moving very slow. We were going towards El Salido about to take a left towards my house and I could see the object moving over the CVS nearby and the object looked very thin and it almost made no sense because of how massive the craft was. We continued on our way how as the craft continued its path south. When we first saw the craft on Anderson Mill rd, I had called my friend on the phone who was at my house and told him to go outside cause I thought a metor or a plane was about to crash. Once he was outside I told him to look to the Southwest and look just above or at the tree line, as I'm on the phone just speaking out of my mind in awe, confusion, and disbeilef, my friend spotted a airplane going south and mentioned to me he saw a plane. As I was trying to explain to him where to look he said \"Woah man, I just followed that plane and it just flew above a huge ball of light,\" (as he described) and he said it was barley above the tree line and about 5 times or so the size of the plane he saw from where he was. He continued to look at the object but he to from a distance could only see a bright light as we did from a distance. Once the object went towards CVS he lost it in the tree line. Looking back on the subject I was so upset with myself for not filming it because my friend next to me had an iphone which i did not think to grab as if something was not allowing me to think to film it. (my phone did not have a video or camera on it) Once we got backed to my house we discussed what we saw, tried to call a couple of news stations, but they all thought we were crazy, and tried to find something that matched the description of what we saw online. My friend and I aslo sketched what we saw which was a diamond shaped craft with lights on the bottom. As we searched UFO images I came across this one that struct me in particular, because you can see right through it and besides a blue and red light where some of the yellow lights are on the top strip. It is pretty much the exact same object I saw that night."],"files":["/var/www/straped/mufon/html2text/33940.html.txt","/var/www/straped/mufon/org/33940.html"],"trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around February 16th 2011","This sighting has never been favorited.",""],"Case Number":"33940","Weather Factors":"Unknown","Log Number":"US-12102011-0004","Object Flight Path":"Stationary,Hovering then path"}