{"Date of the Event":"03/11/2011 08:00 UTC","divs":["Sighting DetailsMy Brother and one another of my employees witnessed these bizarre events which took place on my companies property from the time from the Japan Sunami March 11 to the preeceeding supermoon March 19. It first looked like a really bright moon in the close sky that elongated, split in two and started putting on a display of different shapes, right over my cabin. It would come into the forest mid tree level and we have several pictures of it coming thru the cabin window and the end of it formed a perfect human like hand and swiped my brothers face. we have several clear close up pictures Then it flashed inside the cabin we have a really bizzarre photo of what happened. The one guy is totally freaked out , he was severly injured and hospitalized for 3 months after being attacked by it in the cabin [all of his front teeth knocked out and a stroke. My brother left vowing to never go back there, but is back there now. They believe it's strong spirits with a very strong electrical energy. One interesting point is that. We have 176 first hand photos, including the one bizzarre encounter with my brother in the cabin. They land is a humic bog with a high electromagnetic signature coming from the ground, The are is also called the Gateway Unincorporated. only 3 photos submitted, it came day or night, it was phenominally bright. No one else in the area that we talked to has ever seen it. Pics taken with a Nikon Cool pix."],"Case Number":"33955","Longitude":"-121.130817","map":"<A HREF = \"http://maps.google.com/maps?q=51.770176,+-121.130817(33955)&iwloc=A&hl=en\"> mufon case (33955) map </A>","Object Shape":"Circle, Fireball, Flash, Oval, Star-like, Teardrop, Unknown","Weather Factors":"Unknown","Latitude":"51.770176","Source":"MUFON","Date Submitted":"12/10/2011 10:31 UTC","files":["/var/www/straped/mufon/html2text/33955.html.txt","/var/www/straped/mufon/more/33955_submitter_file1__DSCN3871.JPG","/var/www/straped/mufon/more/33955_submitter_file2__DSCN3866.JPG","/var/www/straped/mufon/more/33955_submitter_file3__DSCN3867.JPG","/var/www/straped/mufon/org/33955.html"],"Object Features":"None","Summary":"High energy entity coming out of the sky and down into the forest, flying all over and make many different shapes, reminds me of something from Disney","Country":"Canada","Log Number":"CA-12102011-0014","Tags":"City","Region":"British Columbia","City":"Forest Grove","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Forest Grove","This sighting has never been favorited."],"Viewing Distance":"20 Feet or Less","Disposition":"Unresolved"}