{"Country":"United States","Log Number":"US-12112011-0004","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.220558,+-118.248671(33959)&iwloc=A&hl=en\"> mufon case (33959) map </A>","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"12/03/2011 09:02 UTC","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Other","City":"La Crescenta","files":["/var/www/straped/mufon/html2text/33959.html.txt","/var/www/straped/mufon/org/33959.html"],"Date Submitted":"12/11/2011 08:23 UTC","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"34.220558","divs":["Sighting DetailsWhile traveling east on Honolulu in La crescenta Ca I noticed what I thought was a very bright star 3 seconds later I thought it was a helo because it was about a mile away hovering or going very slow headed west. seconds later red and white flashing lights came on in sets at 100-200 feet from one another. I came to a stop and observed what looked like a jet as it passed over head. As it passed over I noticed that the jet was only one third the size of the area that it was blocking from my view, Stars and Radio towers mostly. The Jet looked like a picture you would show a person who has never seen one before, just a basic outline of a jet aircraft slightly pointed nose, wings a little swept back. Right after I lost sight of the object as it flew slowly behind me I did a U-turn, I was in the far right lane, two lanes on each side of the street so it was a very fast U-turn. The object went from near to far [15+miles in one second and was gone with a faint red streak across the sky and a kinda weak flashbulb effect in the direction it was headed. The event lasted 15-20 seconds. I was stoped and facing west along with another driver stoped as he was driving west when the object flew over. We looked at each other and shruged. This took place last saturday while driving to my brothers house in La Crescenta Ca from Tujunga Ca, about 4 miles to catch the last half of the fourth quarter Pack Ten Championship game between Oregon and UCLA. Arround Nine PM."],"trends":["There has been one other sighting in La Crescenta","There were no other sightings in La Crescenta on or around December 3rd 2011"],"Disposition":"Unresolved","Case Number":"33959","Summary":"I thought star, helo, then jet and last other. As I was stoped it flew over and i saw what I thought looked like a picture of a jet on the belly of a dark object.While traveling","Longitude":"-118.248671","Object Features":"Other"}