{"map":"<A HREF = \"http://maps.google.com/maps?q=40.558048,+-123.108656(33968)&iwloc=A&hl=en\"> mufon case (33968) map </A>","Viewing Distance":"21-100 Feet","Longitude":"-123.108656","Source":"MUFON","Summary":"Very,very bright!","Latitude":"40.558048","Case Number":"33968","Object Shape":"Fireball, Sphere","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was sitting on the n. side of my house talking on the phone wirh a friend I haven't talked to in years.I was looking at what I thought (to the N.)was a airplane with its' landing lights on,coming towards me.I did not get excited until it was about 50-100 ft. over me and it was so bright I could'nt tell what it was. It made no noise. It lit up the forest floor.It emitted fangs of pure white light and I had to put up my hand to shade its' glare.I followed it down the side of my house and was waiting for it to emerge from the branches of my trees overhead and it had vanished. That is the second one of the summer. The first one was further away put it observed the 2nd ones flight characteristics. The 1st one was busted observing us(humans) until I noticed it and it moved on.All are silent and glow white.The 1st one acted like a star until I looked at it .then it moved to the S.,it turned S. over my property.About 2 monthes ago I accidently dropped a tree onto my power lines and as I was looking at the lines with a Vol. fireman ,another one was watching us until we looked at it and it tried to hide from our view by ducking behind line of sight tree braches. It zigged and zagged all over the place. I went to see where it had gone and it was gone. So that is 3 Iv'e seen and 1 for a Vol. fireman. If it our Govt., why would the waste their time obseving civlians? I've had a total of 4 in my life. The 1st one really scared me,but not anymore. To me unless they screw with me they are like any other form of technology,albiet highly advanced.If anyone out there wants to buy me a battery for my cam-corder I'd eventually score some hardcore up-close flying mechanism for history!!"],"Object Features":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/33968.html.txt","/var/www/straped/mufon/org/33968.html"],"Date of the Event":"07/18/2010 09:20 UTC","City":"Hayfork","Date Submitted":"12/11/2011 08:56 UTC","Region":"California","Disposition":"Unresolved","trends":["There has been one other sighting in Hayfork","There were no other sightings in Hayfork on or around July 18th 2010"],"Log Number":"US-12112011-0013","Weather Factors":"Unknown","Country":"United States"}