{"Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/33970.html.txt","/var/www/straped/mufon/org/33970.html"],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.128152,+-118.345199(33970)&iwloc=A&hl=en\"> mufon case (33970) map </A>","Case Number":"33970","Date Submitted":"12/11/2011 10:02 UTC","Longitude":"-118.345199","City":"Los Angeles","Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around December 11th 2011"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Cylinder","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Date of the Event":"12/11/2011 05:35 UTC","Summary":"Dark, silent, cigar shaped craft flew over Los Angeles, near Barham and 101.","divs":["sighting detailswe were on our deck waiting for the stars to come out and looking up when we saw a cigar shaped, dark grey, silent craft move across the sky in a straight path. it had no lights at all. so it wasn't a plane or helicopter or anything the faa would regulate. we know where the planes land and take off for bob hope international and it was not anywhere near that area. if it hadn't been for the little bit of light left from the setting sun we would've never seen it. we immediately knew it wasn't anything we'd ever seen before. it was just after 5:30pm in los angeles. near the 101 and barham. it went from the southwest to the northeast. it went directly over universal studios and through their big beacon\\spot llights. when it passed through the light it refracted it and looked like something moving in water, not light! it was moving too fast to be a blimp. it was completely silent so it wasn't a helicopter. they pass over the house often and are so loud they rattle our windows. it was a cylinder shape. it flew with the longer side leading and the short ends were up and down. and the craft was at a slight angle from where we saw it. upon seeing the craft we were not scared or frightened. just excited and bewildered. we lost sight of it as it continued on its path towards the northeast. our deck faces straight west with partial views of the north and south. so once the craft went beyond universal studios we could no longer see it."],"Tags":"City","Object Flight Path":"Straight-line path","Log Number":"US-12112011-0015","Latitude":"34.128152"}