{"Tags":"City","Object Shape":"Sphere","divs":["sighting detailsi went outside to check some food i was cooking on my grill at exactly 8:00pm. i noticed that it was much brighter than earlier because the moon was visible in the ne sky (the cloud cover had mostly cleared). as i was looking northward to see how much the cloud cover had cleared, i noticed a bright orangish light become visible over\\between some houses to the nnw of mine. the light was intensely orange, but not like a flare or roman candle, roughly roundish in shape, and initially was about the size of a pencil eraser held at arm's length (roughly a quarter-inch in diameter). it initially attracted my attention because it was much brighter than the usual planes and helicopters that fly overhead, and because of the odd color which was unlike the usual air traffic. the light appeared to arc upwards and towards me before moving parallel eastward, visible above two houses across the street, then gained altitude and disappeared (growing smaller until not visible) at an angle upwards and to the north. it was visible for approximately two minutes, moving at a slow, steady pace. as the light moved eastward, it became more yellow-orange in color (though orange was still the primary color) and seemed to strobe slightly or perhaps flicker like flame. when i first saw the light, i watched it for 20-30 seconds before backing up on my deck to the door and yelling for my wife to come see it too. she arrived promptly and was able to view it for approximately 45 seconds. we went back in the house at 8:04pm after spending roughly 60 seconds after it disappeared watching to see if anything else became visible. after thinking about it overnight, i suppose the object could have been a chinese lantern. the light \"flickered\" but never looked like flame and seemed a lot brighter than a candle relative to its distance, but i suppose it could have been a glow inside a paper bag. the apparent direction (southeast, east, then north) could have been an illusion and the actual direction more of a straight eastward arc with the light burning brightly at first (thus larger), then lessening (thus seeming to move northwards). however, if so the launch was pretty much a failure (the lantern would have risen in one neighborhood and burned out in another a mile or so apart)."],"files":["/var/www/straped/mufon/html2text/33978.html.txt","/var/www/straped/mufon/org/33978.html"],"Sighting Duration":"Undisclosed","Case Number":"33978","Date Submitted":"12/12/2011 11:30 UTC","Country":"United States","Log Number":"US-12122011-0004","trends":["There have been 8 other sightings in Belton","There were no other sightings in Belton on or around December 11th 2011"],"Source":"MUFON","City":"Belton","Latitude":"38.816983","Longitude":"-94.524148","Disposition":"Unresolved","Object Features":"None","Date of the Event":"12/11/2011 08:01 UTC","Summary":"Bright Orange Light Seen Over Belton Neighborhood","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.816983,+-94.524148(33978)&iwloc=A&hl=en\"> mufon case (33978) map </A>"}