{"Country":"United States","Region":"Virginia","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/33976.html.txt","/var/www/straped/mufon/org/33976.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.733075,+-76.574932(33976)&iwloc=A&hl=en\"> mufon case (33976) map </A>","divs":["Sighting DetailsI first spotted what looked like a huge flock of birds in north-west sky that were traveling east. Something was odd about the \"flock\" as what appeared as grey chevron shapes started glowing and morphed into spheres randomly, then the \"flock\" seemed to grow in number as they came closer. I pointed it out to my husband and he saw it to. We were both gob smacked and then noticed another smaller swarm appear from the north and join the original swarm. They were glowing at different rates, appearing to spin, almost like reflections of the sun on the surface. We kept saying it can't be birds it doesn't make sense. They hovered above us for about a minute, long enough for us to pray the \"Our Father\" prayer, we weren't scared just curious. As the swarm flew above us we knew it wasn't a flock of birds. They were very high up in the sky, at the elevation of an airplane. Most were traveling in a straight line together in a formation, while some were switching places with others zig-zag within the \"flock\". They went to the east and began to disappear at the rate of about 20 crafts per second. To me it seemed they ascended up into the atmosphere out of our view. Then they were gone."],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Tags":"City","City":"Suffolk","Latitude":"36.733075","Summary":"swarm-fleet of 50+ morphing glowing sphere ufos","Object Features":"Undisclosed","trends":["There have been 4 other sightings in Suffolk","There were no other sightings in Suffolk on or around December 11th 2011"],"Date of the Event":"12/11/2011 09:40 UTC","Case Number":"33976","Longitude":"-76.574932","Date Submitted":"12/12/2011 10:17 UTC","Log Number":"US-12122011-0002","Object Shape":"Chevron, Oval","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed"}