{"Case Number":"33971","Region":"Georgia","Sighting Duration":"Undisclosed","Date of the Event":"11/30/2011 10:30 UTC","Country":"United States","Log Number":"US-12112011-0016","trends":["There have been 4 other sightings in Milledgeville","There was one other sighting in Milledgeville on or around November 30th 2011","This sighting has been favorited 1 time.",""],"divs":["Sighting DetailsAt approximately 10:00pm EST, my teenage son was alarmed by the sight of a colorful, star-like object that was moving at incredible speeds. He had already observed it for about an hour before coming to me. When I first saw it, I was shocked because I had never seen anything like this in my lifetime. After only a couple minutes of looking at it, I immediately grabbed my digital camera and took 2 videos and then several pictures. I went inside and downloaded the images and I took some time to crop the photos and zoom in on them. My son and I were surprised that after all that time, the object was still out there so I took more pictures of it. After looking at the second set of pictures, the object was either gone or no longer visible. These pictures have been cropped - absolutley no editing other than that and I have all the originals. I do have video from that night as well that I will provide if needed. A friend suggested that I download the pics and video on this website. I was and still am astonished. So after that I made sure to look in the area, every night, to see if 'it' would come back and to my amazement, lastnight, it did which I will be detailing in my next report."],"Latitude":"33.086373","Object Flight Path":"Path with directional change","Source":"MUFON","Date Submitted":"12/11/2011 10:09 UTC","City":"Milledgeville","Disposition":"Unresolved","Object Shape":"Star-like","Summary":"star-like object, flickering, multi-colored, moving at incredible speeds, stayed in general vicinity, visible to 4 witnesses for over 2 hours","files":["/var/www/straped/mufon/html2text/33971.html.txt","/var/www/straped/mufon/more/33971_submitter_file1__004.JPG","/var/www/straped/mufon/more/33971_submitter_file2__008.JPG","/var/www/straped/mufon/more/33971_submitter_file3__007.JPG","/var/www/straped/mufon/org/33971.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.086373,+-83.224579(33971)&iwloc=A&hl=en\"> mufon case (33971) map </A>","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Object Features":"Dome, Unknown","Longitude":"-83.224579"}