{"Object Features":"Unknown","Date of the Event":"12/10/2011 12:00 UTC","Country":"United States","Case Number":"33987","Tags":"City","divs":["Sighting DetailsEver since I witnessed something strange in the sky on November 30th, I have been looking in that area to see if it would come back and to my shocking disbelief, it did. On December 10th, a quick glance into the Eastern sky and I knew that 'it' was back. I immediately grabbed my digital camera and took video and photo's. This time I used a trash dumpster to be sure that my camera was absolutely steady. I observed it for 4 hours until I was just too tired to stay up anymore. The object moves at incredible speeds, has an erratic path, yet stays in the same vicinity. From the ground it can be easily mistaken for a star but if you look at it for a few seconds, you can see it moving with no apparent directional pattern, just extremely fast.The pictures that I am attatching to this report have been cropped for easier viewing, no other editing and i do have all the originals. The video is absolutely raw footage and doesnt really do justice to what I am trying to describe but it is the shortest video I have thus far so that is why I am attatching it. At this point I now have a collection of hundreds of pictures and several video's from two sightings, in the same location, from what appears to be the same unidentified object."],"Object Flight Path":"Path with directional change","Log Number":"US-12122011-0013","Viewing Distance":"Unknown","Summary":"appears star-like from the ground, moving erratic pattern, stays in one vicinity, 2nd sighting, same area, 2 witnesses","Source":"MUFON","Latitude":"33.081783","City":"Milledgeville","Longitude":"-83.225649","Object Shape":"Star-like","trends":["There have been 4 other sightings in Milledgeville","There were no other sightings in Milledgeville on or around December 10th 2011","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.081783,+-83.225649(33987)&iwloc=A&hl=en\"> mufon case (33987) map </A>","files":["/var/www/straped/mufon/html2text/33987.html.txt","/var/www/straped/mufon/more/33987_submitter_file1__033.JPG","/var/www/straped/mufon/more/33987_submitter_file2__12-10-20111159pm030.JPG","/var/www/straped/mufon/org/33987.html"],"Disposition":"Unresolved","Region":"Georgia","Date Submitted":"12/12/2011 05:49 UTC"}