{"map":"<A HREF = \"http://maps.google.com/maps?q=43.964755,+-70.530383(33999)&iwloc=A&hl=en\"> mufon case (33999) map </A>","Tags":"City","Latitude":"43.964755","Date of the Event":"04/15/1994 12:00 UTC","Weather Factors":"Unknown","Summary":"Eye Contact With Alien, Attempted Abduction, Physical Contact","Region":"Maine","Sighting Duration":"00:05:00","Source":"MUFON","trends":["There have been 3 other sightings in Casco","There were no other sightings in Casco on or around April 15th 1994"],"Object Features":"Undisclosed","Date Submitted":"12/13/2011 02:18 UTC","Viewing Distance":"Unknown","Country":"United States","Disposition":"Unresolved","City":"Casco","divs":["Sighting DetailsWhen I was a child I suffered from extreme night terrors. I thought there was something taking me in the night. I would awake to blinding light and then I'd wake a second time, as if I were having a dream inside a dream. These terrors kept on for most of my childhood. It wouldn't happen every night, but once or twice a month. My family moved north when I was 8, after years of brutal nightmares the new environment seemed to calm my mind. This didn't last long though. More frequently I felt as I I were being taken by the white lights. I pleaded with my parents to believe me but they didn't. They had no answers either. One of the nights I woke before the white lights. I was laying in my bunk bed, my brother on bottom and I m top. I was looking at the glow in the dak stars I had on my ceiling when, in an instant I was blinded by this white light. I felt fear come over me and I couldn't scream for help. I helplessly watched my door creek open. There it was. The night person I was dreamin about. It didn't look at me, it looked around for a second and walked toward the bunk beds. I remember trying to scream but I couldn't. I couldn't breathe or move. It walked up besides he bunk beds, inspecting my brother. I tried to scream and got nothing. It looked up at me with snap of its head. Almost like it was surprised I was looking at it. As if I startled it. It stretched it's hand out to my face as if to grab me. I fought my fear and managed to ball up a fist and try to hit it. I did, but barely. I tapped it, just barely touching it. It recoiled its hand and sidestepped away, out the door. In the morning I told my family. They laughed and said I have new friends. I kept this to myself until now. My family can back up my story. Only 3 people outside my family know this. I'll take a lie detector any day."],"Log Number":"US-12132011-0002","Object Shape":"Unknown","Longitude":"-70.530383","Case Number":"33999","files":["/var/www/straped/mufon/html2text/33999.html.txt","/var/www/straped/mufon/org/33999.html"],"Object Flight Path":"Undisclosed"}