{"Disposition":"Unresolved","Viewing Distance":"Unknown","Region":"Oregon","Object Flight Path":"Unknown","Object Shape":"Cylinder, Egg, Oval, Teardrop","Object Features":"Patterned Surface","City":"Seaside","map":"<A HREF = \"http://maps.google.com/maps?q=46.001024,+-123.916338(34004)&iwloc=A&hl=en\"> mufon case (34004) map </A>","Log Number":"US-12132011-0007","trends":["There have been 5 other sightings in Seaside","There were no other sightings in Seaside on or around May 9th 2011","This sighting has never been favorited.",""],"Case Number":"34004","Longitude":"-123.916338","Date of the Event":"05/09/2011 09:30 UTC","Tags":"City","Date Submitted":"12/13/2011 04:18 UTC","Summary":"I saw a bright light and took photos of what appeared to be a UFO.","Latitude":"46.001024","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34004.html.txt","/var/www/straped/mufon/more/34004_submitter_file1__DSCN0462.jpg","/var/www/straped/mufon/more/34004_submitter_file2__DSCN0479.JPG","/var/www/straped/mufon/more/34004_submitter_file3__DSCN0482.JPG","/var/www/straped/mufon/org/34004.html"],"Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was vacationing with friends in Seaside, Oregon at a house on the ocean from May 5th-10th. On the last night there -- May 9th -- I first noticed a strange slanted beam of light after dusk -- 7:11 pm to be exact. The light was focused, not diffuse, and lasted about five minutes. I took 13 photos of the beam from it's brightest to fading completely over the five minutes. That same night, at 9:48 pm, I noticed in the same vicinity a bright white glowing light, which appeared brighter that a fishing boat and did not glide across the horizon as fishing boats do. The light appeared stationary. I slid back the window, stuck my camera out in the dark and just started shooting one photo after another. I shot nine photos in two minutes and what appeared on camera is not what I saw. While all I ever saw was a bright white glowing egg shaped light, the photos each reveal something entirely different. The first photo shows a horizontal cylinder of glowing white light with a while line of light hovering above. At the top of the photo appears a brownish object with two red lights. I did not see that. The second photo is a long squiggly line of glowing white light. Two other photos have similar squiggly glowing white lights in different formations. The fifth photo is the most interesting to me. When blown up there appears to be a triangular patterned craft hovering over a glowing triangular light below, with a tube of black appearing to connect the two. The brownish object with red lights is hovering above. The other photos show the simple glowing oval shaped light. Believing I took photos of nothing but a speck of white light on the horizon, I didn't really pay attention until a few hours later when I reviewed the photos I took that day. That's when I realized what I witnessed. My friends -- not serious believers in ufos -- were convinced when the saw the photos, several of which are very similar to those in the book \"Examining the Earthlight Theory: The Yakima UFO Microcosm.\" My reactions were total excitement and regret that I did not look at the photos I took sooner. I would have taken many more."]}