{"Country":"United States","Object Flight Path":"Path with directional change","Tags":"City","Region":"Georgia","files":["/var/www/straped/mufon/html2text/34005.html.txt","/var/www/straped/mufon/org/34005.html"],"Latitude":"33.777738","Disposition":"Unresolved","Date of the Event":"08/20/1967 08:45 UTC","Summary":"observed beam light which then","Viewing Distance":"101-500 Feet","Case Number":"34005","Source":"MUFON","Longitude":"-84.291222","map":"<A HREF = \"http://maps.google.com/maps?q=33.777738,+-84.291222(34005)&iwloc=A&hl=en\"> mufon case (34005) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"12/13/2011 05:40 UTC","City":"Decatur","Log Number":"US-12132011-0008","divs":["Sighting Detailsobserved a strange \"beam shaped\" light, directed downward at about 35 to 40 degrees. Once we had focused our attention on the object it turned instantly ,the light turned off, and it headed straight towards us. At that point you could see a huge,gray-ish object materializing.When fully materialized we could see that it was about the size of four [4] shopping malls in size,that is to include the parking lots. It passed slowly over head,about 500 to 700 ft. above the deck. Lights could be seen,through what must have been windows,and three or four levels to the craft were clearly visable. We were absolutely mesmerized,and could not take our eyes off this thing until it was completely out of sight. Which took about 15 to 20 minutes. We were standing beside Mercer Rd.in Decatur,GA. during the twilight hour in late August of 1967 when this occured. I remember the three of us KNOWING that this thing somehow knew that we had observed it,that's when it abrutly turned,the light went out and it began to materialize. Afterwards we told our parents. The parents of my two \"friends\" who also witnessed the object,thought we were \"crazy,lying,or smoking pot.\" To the contrary my mother decided to call the sheriffs department,who informed her of other reports of a similar nature. I also remember a small newspaper article,on the back page of course,reporting the incident a few days there after. Reporting the sighting to our parents taught me that most people will think you're completly over the edge if you mention UFO's. After all, this took place in 1967. In recent years,however given the number of TV shows,news reports,etc...I feel more comfortable coming foward with this story. In the past I was very carefull about who I talked with on the subject of UFO's. Although I've remained absolutely fascinatied with the subject.In closing I'd like to say they're many verses in the Bible that speak of things like,UFO's,other beings in the universe etc... that I would be happy to share ,if anyone is interested i.e... has anyone considered the star of Bethlehem that led the magi to the nativity.STARS DON'T MOVE,but UFO's do,at least the one I saw did."],"Object Features":"Window(s)","Object Shape":"Oval","trends":["There have been 7 other sightings in Decatur","There were no other sightings in Decatur on or around August 20th 1967"],"Weather Factors":"Unknown"}