{"map":"<A HREF = \"http://maps.google.com/maps?q=42.318695,+-85.162453(34003)&iwloc=A&hl=en\"> mufon case (34003) map </A>","Object Shape":"Cigar, Cylinder, Disc","divs":["Sighting DetailsI was video taping a white cigar shaped craft flying in a straight line. I was standing in my back yard after getting the kids off the bus around 4:30 eastern time. When I went to review the footage I took, I noticed a few seconds into the video a dark grey disc shaped craft flies through the frame at a great speed! I was very excited to have gotten more than one craft on film at the same time. The white cigar shaped craft I see almost every day fly over my house.( only on a clear day ) These craft do not give off any vapor trails like the rest of the plains that fly in the area. It's cold this time of year and every plane low or high in the air gives of some sort of trail. I've taken several photos of these craft and can not see any wings or tail rutter. At a quick glance in the sky, they do look like plains. My personal opinion on these ones is that there some sort of military drone or unmanned vehicle. The other grey disc craft would be a first for this area in a long time for me!"],"Summary":"Video taping 1 cigar shaped craft, when another grey disc flys through the frame","City":"Battle Creek","Date Submitted":"12/13/2011 03:54 UTC","Region":"Michigan","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12132011-0006","Latitude":"42.318695","Disposition":"Unresolved","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34003.html.txt","/var/www/straped/mufon/org/34003.html"],"Weather Factors":"Unknown","Sighting Duration":"00:03:00","Case Number":"34003","Object Flight Path":"Path with directional change","trends":["There have been 15 other sightings in Battle Creek","There were no other sightings in Battle Creek on or around November 22nd 2011","This sighting has never been favorited.",""],"Longitude":"-85.162453","Date of the Event":"11/22/2011 04:30 UTC","Country":"United States"}