{"trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around September 24th 1972"],"Log Number":"US-12132011-0004","Date of the Event":"09/24/1972 12:00 UTC","Disposition":"Unresolved","Object Flight Path":"Stationary","Summary":"Bright light in sky resembling a star but was not and 6 objects came out","divs":["Sighting DetailsIn the Fall of 1972, Indianapolis, Indiana around 7pm our family was driving to meet friends, when we saw a lot of people out on their sidewalks looking up at the sky. We pulled over and I got out and witnessed what looked like a huge bright glowing star but it was not a star it was too large. We continued on to our friends house and there were people still out watching this object in the sky. Maybe an hour later we watched as 6 glowing objects came out of the large object lined up 3 on each side. They all came out at the same time. Then they formed a V shape formation and dispersed to where I do not know. We watched the large object remain stationary for another couple of hours until the 6 object came back and lined up the same way as they came out and all go in the large object all at once and then disappear into a cloud that was not there earlier. We were all agasp and excited and called the then popular Radio Station WIFE. The lines were jammed with other callers and we never got through. The next day the news reported the UFO's as a weather balloon."],"Object Features":"Unknown","Region":"Indiana","Case Number":"34001","Source":"MUFON","Date Submitted":"12/13/2011 10:49 UTC","Weather Factors":"Unknown","Latitude":"39.740664","Sighting Duration":"Undisclosed","City":"Indianapolis","Country":"United States","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/34001.html.txt","/var/www/straped/mufon/org/34001.html"],"Tags":"City","Object Shape":"Oval","Longitude":"-86.21261","map":"<A HREF = \"http://maps.google.com/maps?q=39.740664,+-86.21261(34001)&iwloc=A&hl=en\"> mufon case (34001) map </A>"}