{"divs":["Sighting DetailsI was driving home at night in the dark on my road which is very rural in the Shenandoah Mountains. While driving home I noticed two very bright lights low in the air. One off to the right of me and one off to the left. I guess what made me notice them was that they moved very little if at all, they seemed very large and low in the sky. They seemed like stars that were literally right there close and low in the sky. I assumed maybe they were helicopters or a small aircraft. But that idea slowly disappeared after I noticed these objects tend to hover and that they didn't seem to make noise. The one to the left seemed to move more and farther distances. The one on the right seemed to hover more. The road is very rural and winds through the valley between two mountain ranges. At times I would go around the bend and my view would be obscured, then I would drive further and the hovering light would be right in front of me or close by off to the right. At one point I mentioned it to my 15 year old daughter who was in the car with me and she said she had noticed it up in the sky even before we had turned on our road. Both of us wondered what it was because it didn't appear to move, just hovered. When we got to our driveway, I pulled in and shut everything off and rolled the windows down because I wanted to hear if there was an engine noise or a propeller noise from a helicopter or a small plane. There was nothing but silence. It was very close. Maybe the distance of 2 to 3 football fields away. If it was making a noise we definitely would have heard it. It was completely silent. Then I drove down my driveway which winds through the woods and lost sight of it for a period of time. When I entered the house I went directly to my bedroom and got my binoculars, went outside on the porch and it appeared that the unidentified object was hovering directly in front of me over the field in the valley behind my house. I would say no more than 3 football fields away. I looked through the binoculars and saw a very large, bright light. If it wasn't dark I feel like I would have been able to see the actual object better but I really could only see a very bright light. I texted my boyfriend who was in a neighboring town on the other side of the Massanutten Mountain. He called and said he had been watching what appeared to be a hovering light above the mountain range. We got off the phone and I tried to take a photo which did not work out since it was so dark and I don't have a good enough camera. Ten minutes later he called back again, this time from his friends house and his friend saw it and said he thought I should report it to the local sheriffs office. I called and they sent someone out to see if they could find it. By that time it had travelled in a straight path, slowly and disappeared out of my view. The sheriff's dispatch called me back and said that they were unable to locate the lights and that they had called the FAA and there were no aircraft known to be in this area at that time. My feelings started out as simple curiosity and then developed into a bit of fear. Eventually, after it slowly disappeared I was experiencing bouts of nervous laughter. Meanwhile my fifteen year old was very nervous and upset and scared. She wanted to get back in the car and leave the house."],"Tags":"City","Longitude":"-78.437756","Country":"United States","Date of the Event":"12/13/2011 06:30 UTC","Object Features":"Unknown","Object Shape":"Unknown","City":"Fort Valley","Sighting Duration":"Undisclosed","Log Number":"US-12132011-0009","Region":"Virginia","Weather Factors":"Unknown","Latitude":"38.82132","trends":["There have been no other sightings in Fort Valley","This sighting has never been favorited."],"Date Submitted":"12/13/2011 08:06 UTC","Summary":"Siting started on the drive home from work and continued at home.","files":["/var/www/straped/mufon/html2text/34006.html.txt","/var/www/straped/mufon/org/34006.html"],"Case Number":"34006","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.82132,+-78.437756(34006)&iwloc=A&hl=en\"> mufon case (34006) map </A>","Object Flight Path":"Hovering then path"}