{"Date Submitted":"12/13/2011 08:47 UTC","divs":["Sighting DetailsI was photographing with my Nikon 5100 DSLR camera for christmas lights night photography.The night on Dec 12, 2011 was very cloud and there was not a star visible in the sky. I did not notice anything unusual in the sky because I was focussing on taking pictures of the Christmas lights. But when I came home and transferred my pictures from the camera's SD card to my laptop, i saw 3 pictures that displayed the UFO. First picture which displayed the UFO was taken at 8:26:37s pm(shows UFO on upper left). 2nd and 3rd pictures are at 8: 29:27s pm and 8:29:45s (18 seconds apart) which indicate the movement of the UFO from right side to the upper left within the 18 second time duration. From what I can conclude with the picture is that it seems to be a big big spaceship and you can clearly see that it is resembling the orion stars in disguise. You can also see the shape of the UFO from the pictures when you zoom it. I still have the pictures just the way they were taken in my SD card and I have in no way modified any pictures. I am presenting it just the way it is.Attached please find the pictures and let me know if you need more information. I can be reached via email. Thanks, Sameer"],"Object Shape":"Cigar","Log Number":"US-12132011-0013","Latitude":"32.857513","files":["/var/www/straped/mufon/html2text/34010.html.txt","/var/www/straped/mufon/more/34010_submitter_file1__DSC_1447.JPG","/var/www/straped/mufon/more/34010_submitter_file2__DSC_1451.JPG","/var/www/straped/mufon/more/34010_submitter_file3__DSC_1452.JPG","/var/www/straped/mufon/org/34010.html"],"Disposition":"Unresolved","Case Number":"34010","City":"Dallas","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around December 12th 2011","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Summary":"3 lights seen in the photograph resembling Orion in disguise","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=32.857513,+-96.765578(34010)&iwloc=A&hl=en\"> mufon case (34010) map </A>","Tags":"City","Region":"Texas","Date of the Event":"12/12/2011 08:26 UTC","Object Features":"Other","Longitude":"-96.765578","Source":"MUFON"}