{"Object Flight Path":"Path with directional change","Disposition":"Unknown","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/3401.html.txt","/var/www/straped/mufon/org/3401.html"],"trends":["There have been 10 other sightings in Norcross","There were no other sightings in Norcross on or around June 14th 2005"],"divs":["Sighting DetailsSighting Report: Sunday, June 12, 2005, app. 6:30 PM. The dewpoints were high because TS Arlene had just come through the area and the enormous cumulo-nimbus clouds were moving slowly due north, following Arlene s remaining center. There were huge breaks of sky and I often watch as passenger jets come into the area from the northeast on their way to Hartsfield Airport. I can sometimes make out the logos on their tails as they are relatively low at that point of their final approach. On this afternoon, I was watching what seemed to be a 737 or Airbus coming over and then, suddenly I saw an object moving lower than the plane (but not much lower) directly from due East to North of East. It made a wide swath as it turned. It was black but appeared metallic as it reflected the sun. It almost looked like a huge chair! Wierd! It did not seem to be a balloon as it appeared to move of its own accord and not float. This object appeared to be very large, maybe as big as a house. The crew of the plane MUST have seen it as they flew by it and over it on their approach to Atlanta airport. I know that they must have seen it. PLEASE let me know if there were any reports of anything odd on Sunday around 6:30 - 6:45PM by any jet crews approaching ATL! I am VERY sure that I saw something very odd. As it moved away to the North, it disappeared into the clouds. I estimate that it was 1,000 feet high. Thank you."],"Region":"Georgia","Case Number":"3401","Log Number":"","Source":"MUFON","Date Submitted":"06/14/2005 06:45 UTC","Tags":"City","Date of the Event":"06/14/2005 06:45 UTC","Longitude":"-84.205221","Weather Factors":"Unknown","Summary":"Black, small chair- or tophat-shaped object in sky lower than commercial jet, made wide-slow-smooth arc","Country":"United States","Sighting Duration":"00:04:00","Viewing Distance":"Over One Mile","City":"Norcross","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.946713,+-84.205221(3401)&iwloc=A&hl=en\"> mufon case (3401) map </A>","Latitude":"33.946713"}