{"Object Flight Path":"Path then hovering","divs":["Sighting DetailsFirst seen over Gallatin Road near military cemetery. I was driving down Gallatin away from downtown and saw the object out of the corner of my eye. I slowed the car and watched the object come out of a thunderhead cloud, hover for a few seconds and then turn upside down and go back into the cloud. The contrast of the white object against the black cloud made it stand out. I knew it was an oddity as soon as I saw it because of the maneuvers it made and the fact that it entered the storm cloud. I was very shaken by the sighting and actually pulled off the road and called a friend to tell her exactly what happened. I felt nervous the rest of the night and had a hard time sleeping. I saw what I believe is the same object about two or three weeks later in roughly the same area in the middle of the day. The sky was completely clear of clouds. I saw the object directly overhead and it had the same features (or lack of features) as described above. It flew overhead at what looked like a relatively normal rate of speed and then rapidly accelerated. It was gone so fast it looked like it disappeared into nothing. I've had no other sightings since then."],"Sighting Duration":"Undisclosed","Log Number":"US-12132011-0018","Date Submitted":"12/13/2011 11:53 UTC","Object Shape":"Cigar","Viewing Distance":"Unknown","Region":"Tennessee","Latitude":"36.23867","Date of the Event":"09/15/2011 12:00 UTC","Tags":"City","Disposition":"Unknown","Summary":"White cigar shaped craft","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around September 15th 2011"],"Country":"United States","Case Number":"34015","City":"Nashville","files":["/var/www/straped/mufon/html2text/34015.html.txt","/var/www/straped/mufon/org/34015.html"],"Longitude":"-86.730613","Weather Factors":"Heavy","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.23867,+-86.730613(34015)&iwloc=A&hl=en\"> mufon case (34015) map </A>"}