{"Date Submitted":"12/14/2011 04:08 UTC","Object Flight Path":"Straight-line path","Log Number":"US-12142011-0001","map":"<A HREF = \"http://maps.google.com/maps?q=36.783701,+-119.412432(34016)&iwloc=A&hl=en\"> mufon case (34016) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-119.412432","Object Shape":"Circle, Disc","trends":["there have been no other sightings in diamond bar \\ brea \\ oran","This sighting has never been favorited."],"divs":["Sighting DetailsI was driving down the 57 fwy SB from San Dimas area heading towards Orange County. I observed a blue-white glowing disk appear out of nowhere. I noticed it because the object seemed enormous. It was either big or somewhat close. It appeared and maybe hovered for a second before it took off at what seemed to be an impossible speed heading south in a perfectly straight line. It took off so fast that it had a triangular trail following it. Only thing i can compare the trail to is what maybe a Star Trek or Star Wars ship looks like as it jumps into lightspeed. I was in the military and I've seen supersonic aircraft and this was unlike anything I've ever seen. It was so fast I can't really put words to it. The object seemed to have a glowing blue ring inside what appeared to be a white glowing surface. This is the first time I've ever seen much less reported anything of this nature in my life. The speed of this object is what led me to believe that it wasn't a conventional aircraft. I can't stress enough how fast this thing darted across the entire sky and disappeared. About 5-10 minutes later as I connected from the 57 fwy SB to the 22 fwy WB that I saw a much higher object do the same maneuver. The direction was west. This object was too high for me to see if there was color in addition to the white glowing surface. This object to shot across the entire length of the visible sky in virtually no time and disappeared. The reason I noticed this object is because I couldn't take my eyes off the sky because of what I observed the first object do. These observations were shocking to me. I literally stared at the sky the entire way home afterwards hoping to catch another glimpse of the unbelievable events."],"Source":"MUFON","Date of the Event":"12/13/2011 09:15 UTC","Object Features":"Other","Case Number":"34016","files":["/var/www/straped/mufon/html2text/34016.html.txt","/var/www/straped/mufon/org/34016.html"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Disposition":"Unresolved","Country":"United States","City":"Diamond Bar / Brea / Oran","Summary":"Blue-white disk-shape object appeared out of nowhere and took off faster than anything I've ever seen including military fighter jets.","Latitude":"36.783701","Region":"California"}