{"Viewing Distance":"Unknown","Tags":"City","Region":"Georgia","Object Features":"None","Sighting Duration":"00:00:10","Date Submitted":"12/14/2011 11:04 UTC","City":"Alpharetta","map":"<A HREF = \"http://maps.google.com/maps?q=34.033106,+-84.252413(34027)&iwloc=A&hl=en\"> mufon case (34027) map </A>","Date of the Event":"12/14/2011 09:57 UTC","divs":["sighting detailsat 9:50 pm, 12\\14\\11, i connected a call to my girlfriend for about 9 minutes. near the end of the conversation, my right eye caught a low flying, brilliantly bright, white object traveling silently across the sky towards my house. the mere size of the object caught my attention immediately because it was the size of golf ball held out at arms length against the sky. i had absolutely no conclusion as to what the object was at the time. it was without a doubt not an airplane because it made no sound, its shape resembled nothing of an airplane and there were no flashing lights or any visible solid features whatsoever. the object was rounded at the front (like a bullet). it had a trail of equally bright white light behind it that was not flickering or waving. it was moving perfectly silent and perfectly straight. after several seconds, the object's vibrant light turned off like a switch. i was confused because it went away so quickly (5-8 seconds). afterwards i felt very peaceful. honestly, it was an awe-inspiring experience. i lost sight of it once the light was gone."],"trends":["There have been 3 other sightings in Alpharetta","There were no other sightings in Alpharetta on or around December 14th 2011"],"Object Shape":"Bullet, Missile, Flash, Oval, Teardrop","files":["/var/www/straped/mufon/html2text/34027.html.txt","/var/www/straped/mufon/org/34027.html"],"Longitude":"-84.252413","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","Latitude":"34.033106","Summary":"I was talking to my girlfriend on the cell phone in my backyard when over in the top right corner of my vision I saw a large rounded bright light, with a trail of equally bright light catching up with it. Absolutely huge. Turned out like a light.","Object Flight Path":"Straight-line path","Source":"MUFON","Case Number":"34027","Log Number":"US-12142011-0012"}