{"Date Submitted":"12/15/2011 05:17 UTC","divs":["Sighting DetailsI was outside sitting in my Lawn chair Monday night at 6:30pm just enjoying the night air and trying to get some relief from the kids as I am a single Father. I do this every night that conditions allow and at the same general time. I waited for nearly 15 minutes to see them again, but I was not really in the mood for the visit. I have a feeling they can sense this, so I closed my eyes and took several deep breaths as to slow my heart rate. I was starting to focus better in my mind and heart. With my eyes still closed I began to.... Well... Pray. Yes I know this sounds a bit odd, but that's the truth of it and that's what I do when I'm alone and things are quiet. Seconds passed and I felt them, from a distance. I opened my eyes and the first orb was to my left which is due South. The orb was visible through the trees, but was physically right at the tree tops and moving slowly towards my position due North. The intensity of the object was great and constant as it hovered towards me nearly at the edge of the tree line and out into the open. I'v seen this sight before, but every time is like the first. It Never gets old. The thought then crossed my mind that another one was watching me so I took a visual and mental note as to the exact location of the first object, then I turned to find the other one. Right away I was able to locate the position of the second Orb directly over my head at about 5000 feet up, dimly illuminated and slowly hovering towards the South. I thought out loud the words \"there you are my friend\" and immediately upon thinking this the object intensified in illumination at least 10 fold. This was just a bit frightening because as the object illuminated, He also grew in size as if instantly appearing overhead some 3000 feet closer in less than a second. Both objects were Illuminated to the same intensity and so I took my high powered LED Flashlight and flashed one time at the object overhead. The Object in-turn flashed one time. I then flashed Two times. Then the object in-response flashed back two times and then folded in on itself and completely disappeared. I then turned my attention on the first object which was now appearing in open sky and very low. I took my flashlight and shined on it one time and the object immediately folded in on itself and disappeared."],"Latitude":"29.959996","Object Features":"Undisclosed","Object Shape":"Circle, Flash, Sphere, Star-like","Date of the Event":"12/12/2011 06:30 UTC","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34039.html.txt","/var/www/straped/mufon/org/34039.html"],"Object Flight Path":"Straight-line path","Country":"United States","Source":"MUFON","Region":"Louisiana","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Longitude":"-90.068752","Case Number":"34039","City":"New Orleans","map":"<A HREF = \"http://maps.google.com/maps?q=29.959996,+-90.068752(34039)&iwloc=A&hl=en\"> mufon case (34039) map </A>","Log Number":"US-12152011-0011","Summary":"Two brilliant white orbs of light respond to me","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around December 12th 2011"]}