{"files":["/var/www/straped/mufon/html2text/34037.html.txt","/var/www/straped/mufon/org/34037.html"],"Case Number":"34037","Weather Factors":"Unknown","Object Shape":"Sphere, Triangle, Unknown","Viewing Distance":"Over One Mile","Object Features":"Unknown","Tags":"City","Region":"North Carolina","Country":"United States","Date of the Event":"12/11/2011 09:31 UTC","Date Submitted":"12/15/2011 03:29 UTC","Summary":"Saw star like object moving SW pass another then the other joined,as the 2 passed on each side of yet another aparrent star it joined an followed.Then the objects hovered as a triangle shape for almost an hour.","Log Number":"US-12152011-0010","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.617355,+-79.835044(34037)&iwloc=A&hl=en\"> mufon case (34037) map </A>","Longitude":"-79.835044","trends":["There have been 3 other sightings in Asheboro","There were no other sightings in Asheboro on or around December 11th 2011"],"divs":["Sighting DetailsI was sitting outside in my front yard enjoying the quiet after having a cookout with freinds.I had a fire going in an outside fire pit we have in our patio area. I was leaning back in my chair looking at the stars when I saw 1 small star begin moving.As it passed another star of equal size that star also begin moving.The 2 kept moving and passed another star of equal size right down the middle.That star followed forming a diamond formation.The 3 then stop an stayed in a diamond formation for at least an hour in the South east direction. I thought maybe it was a satelite moving when I saw the first object. The objects appeared to be small stars not moving at all to begin with.When the first one starting moving was what caught my attention.Then as it passed another star that had been completely still it joined an followed side by side with the first one.This really got my attention.Then the 2 passed another star on each side of it.This star was of equal size an brightness to the first 2.It followed trailing them in a triangle pattern.The entire group stopped in an area Southeast of my home.It remained there for at least an hour.The only thing that changed was they would appear to blink occassionally like the light was going dim. I don't really know how I felt,ezcept exicted that I was really seeing something strange.Afterward I felt like if I mentioned it to anyone they would think I was crazy,So I've only told 1 close friend about it an he thinks I must have been drinking.So I want be telling anyone else about it unless I happen to get some kind of proof or video.I tried to take pictures but I only have a very limited digital camera but nothing came out on it.So it was a waste. I lost sight of the objects when clouds moving in a north east direction coverd the area passing by.After the clouds passed there was only 1 object there.After a short time it started moving in a North east direction an actually caught up to the cloud that had passed an disappeared behind it."],"City":"Asheboro","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"35.617355"}