{"Region":"Tennessee","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.096548,+-82.807372(34033)&iwloc=A&hl=en\"> mufon case (34033) map </A>","Object Shape":"Other","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"34033","Object Flight Path":"Stationary","Longitude":"-82.807372","City":"Greeneville","divs":["Sighting DetailsI was taking a picture of the pretty night farmland at night.The dark mountains and the blue sky with the lights of the farm houses lit up here and there. It was a beautiful scenic shot. When I looked back on the back of the camera to see what I'd gotten and if I wanted to try another angle,...there was a 'pink drape' hanging down close in the air.Because I have hundreds of pictures over the past three years in this entire viewing area, I was amazed but not surpried when something was there but the object was something I hadn't exactly gotten before.I have however, gotten three other 'cloaking or shields' in the last two months.One was a huge triangle of lkight over the mountain and the other two look like a thick bed sheet doubled over hanging in the air.(You can see the fold where the back on one side is off from the front.)I showed that to the 'local' mufon guy) I didn't see the object with my eyes so by the time I saw it on the camera it wasn't there.I don't know how or where it disappeared.However,I then took pictures of the night view in the oposite direction and got the neighbors double lighted two lampposts in their drive.The first came out perfect and then the next I got a very strange contortion of lighting...It formed a thin see through substance in the form of a tent and the top folded over like a four fold envelope. Both of these images can be seen on the local Sky Watchers facebook sight.There are about eighteen people who joined together to share the stuff we see. Several of us have cameras and we are getting a lot ogf the same stuff as far as various bright lighted 'balls' in a lot of colors.Sometime alone other times joined with one to five others.For the 'pink drapoe' I am the only one to see it...(actually I didn't even see it...the camera picked it up)So the answer below to witness is not how many are seeing the other things...That is at least ten I'm not sure how to attach the photos.If you have more than four or they don't match the descriptions above,delete them and get back with meI haven't sent the other 'shields or 'cloaking' as I'm not sure these are going to go through(not too computer savvy)"],"Date Submitted":"12/15/2011 09:52 UTC","trends":["There have been 9 other sightings in Greeneville","There were no other sightings in Greeneville on or around December 7th 2011","This sighting has never been favorited.",""],"Log Number":"US-12152011-0005","Tags":"City","Summary":"Pink demensional ?'drape' in air","Weather Factors":"Unknown","Date of the Event":"12/07/2011 12:00 UTC","Latitude":"36.096548","Disposition":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/34033.html.txt","/var/www/straped/mufon/org/34033.html"],"Object Features":"Unknown"}