{"trends":["There have been no other sightings in Granite Bay","This sighting has never been favorited."],"City":"Granite Bay","Viewing Distance":"Unknown","Date Submitted":"03/20/2005 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsSighting Report: I was in the US Air Force, stationed at Shreveport La. in the early 1950\"s. I was a gunnery Sgt, on a B-29. We flew many training missions up and down the East Coast, on several occasions, something would follow our course, it appeared to be a big light glow. but it seemed to have control. We, the crew members would follow and discuss the appearences, I asked our Pilot on one occasion, a Major, if he would make a report, his response, \"if I made a report I would not get another promotion\" He was a carrier Officer. I was living off base, we had an early morning training mission, had to be at the base at 6:30 AM., as I left the house I saw a flying object that was not one of ours. I looked up and saw this Flying object, coming toward my direction, it was at about 1000 feet altitude, completely silent, cigar shaped, about as long as a foot ball field, port holes every 10 or 15 feet, it came in slow and silent, when it was almosst overhead, it turned, pointed it s nose slightly up and flew off in the direction of the air base and vanished. I got into my car, went to the base, and checked with the guard at the expermintal hanger. Told him I wanted to have a look inside, I reached for the door handle, and he said, \"Sarge. if you open that door,I will blow the s--it out of you\" he was serious, I then told him I saw something in the air and said I wanted to know if we had anything like that in our hanger\" his eyes got as big as silver dollars and he said he saw it also. I asked him to describe what he had seen, he described the exact same object that I had seen."],"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/3404.html.txt","/var/www/straped/mufon/org/3404.html"],"Region":"California","Date of the Event":"03/20/2005 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.763234,+-121.163836(3404)&iwloc=A&hl=en\"> mufon case (3404) map </A>","Country":"United States","Log Number":"","Latitude":"38.763234","Object Features":"Undisclosed","Summary":"Not Provided","Longitude":"-121.163836","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"3404"}