{"Object Shape":"Circle, Sphere","Latitude":"34.892562","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Object Features":"None","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Case Number":"34049","Disposition":"Unresolved","trends":["There have been 11 other sightings in Barstow","There were no other sightings in Barstow on or around June 15th 1972"],"Region":"California","divs":["Sighting DetailsMy self and my brother's girlfriend had gone to the store for my parents, about two miles away. We lived in the Mohave Desert. We were returning and about a half mile from home, we observed a silver, round object descending from the sky. At first we were just curious as to what it was. It then descended straight for us. We just looked at each other and said \"What the heck is that?\" I pulled the car over to the side of the road as I believed it would run into us. It hovered above the car at about the heigth of a telephone pole. It was round, emitted a silver glow, and about the size of a house, if a house were round. It had no windows and made no sound. It hovered above the roof of the car for about 45 seconds. We were so scared that we couldn't speak. I believed it was going to abduct us or something. When it was finished, I believe, observing us, it simply rose slowly into the sky until it got very high, then diagonally darted, in the blink of an eye, out of sight. I rushed home and told my parents what we had just occured. My mother then got out her telescope, (many people in the desert had them) and stayed out until about 2:00 am looking for it until my father made her come in. Of course she saw nothing. We lived in a pretty desolate part of the desert so there were no other vehicles in the area. It was a bright sunny day and the sun was not in our eyes. I have never heard of any sighting of this nature since that time."],"Date of the Event":"06/15/1972 12:00 UTC","Log Number":"US-12162011-0003","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.892562,+-117.102681(34049)&iwloc=A&hl=en\"> mufon case (34049) map </A>","Longitude":"-117.102681","files":["/var/www/straped/mufon/html2text/34049.html.txt","/var/www/straped/mufon/org/34049.html"],"Date Submitted":"12/16/2011 07:23 UTC","Summary":"A friend and myself driving back from store. Object hovered over car.","Sighting Duration":"Undisclosed","City":"Barstow","Viewing Distance":"21-100 Feet"}