{"Date of the Event":"12/15/2011 10:58 UTC","Latitude":"32.016092","divs":["Sighting DetailsWe were sitting outside our condo in Tybee Island in a residential complex (not beach front). My husband and I walked towards the street to investigate 3 police cars making a trafffic stop. It was loud and we heard their raidios. We saw their flashing blue lights through the trees. Since nothing really happens here- it is a relatively quiet community (especially during the winter) we wanted to see what the commotion was about. So it was nothing but police being bored making a stop- we turned around and started walking past back to our condo at the end of the complex. We caught the sky because it was so bright and pretty. I always am attracted to orion. So that is what I always find myself looking at and I asked my husband to look up at how pretty it was here (we just moved!) So we were looking up at the pretty stars and I was looking at orions belt as usual and two very dark fast greyish black objects barely visible in the shape of a boomerang caught our eyes. The first one flew to the south very fast, then I asked him if he saw what I did. Then another craft appeared and darted in a criss coss pattern and gave off an off white glow and disappeared. We thought they may have been bats (a ufo isn't the first thing we wanted to settle on as an explanation) but there was no flapping and they were too high up and too big to be a bat and bats don't reflect light like that and disappear into nothing (since it was a clear sky). It was very beautiful. And almost unnoticeable. Im glad we saw it! I've never seen anything like this before."],"Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Longitude":"-80.848738","Summary":"2 black/grey boomerang shaped moving at high speed crossing paths","Region":"Georgia","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.016092,+-80.848738(34046)&iwloc=A&hl=en\"> mufon case (34046) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/34046.html.txt","/var/www/straped/mufon/org/34046.html"],"trends":["There have been 2 other sightings in Tybee Island","There were no other sightings in Tybee Island on or around December 15th 2011"],"Object Shape":"Boomerang","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Features":"None","Case Number":"34046","Sighting Duration":"00:00:10","Date Submitted":"12/15/2011 11:50 UTC","Source":"MUFON","City":"Tybee Island","Log Number":"US-12152011-0019"}