{"Country":"United States","Object Flight Path":"Stationary,Other","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around December 15th 2011"],"Disposition":"IFO","Object Shape":"Star-like","City":"Omaha","divs":["Sighting DetailsAt approximately 9pm staring out of my back porch viewed star like object changing colors (blue, green, red, white). My back porch faces due South, the object was viewed East at approximately 25 degrees from horizon. The object appeared stationary but has moved to approximately 45 degrees in the sky by 10:30pm. I zoomed in on the object with my camera, confirmed the colors changing in a constant pattern but the picture was fuzzy. Zooming in on the object only verified the colors, couldn't distinguish shape or any other features. At first glance it'd appears to be a star but after a few moments of observation you notice the color changes which seems odd. Took one picture while zoomed in on the object or star but it just appears as a large dot on the digital camera screen. I'm thinking this might just be a star, but seems strange; my wife thinks i'm crazy! I always look at the stars at night time and it seems out of place, the object is still in plain sight and flashing colors as of 10:41pm."],"Tags":"City","files":["/var/www/straped/mufon/html2text/34045.html.txt","/var/www/straped/mufon/org/34045.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.198886,+-96.222976(34045)&iwloc=A&hl=en\"> mufon case (34045) map </A>","Region":"Nebraska","Date Submitted":"12/15/2011 11:42 UTC","Source":"MUFON","Summary":"Approximately 9pm viewed star like object changing from blue to green to red to white, been in the sky for the past 2 hrs","Sighting Duration":"Undisclosed","Longitude":"-96.222976","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-12152011-0018","Object Features":"Undisclosed","Case Number":"34045","Weather Factors":"Unknown","Latitude":"41.198886","Date of the Event":"12/15/2011 09:00 UTC"}