{"Sighting Duration":"Undisclosed","Object Features":"Unknown","Tags":"City","Source":"MUFON","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/34044.html.txt","/var/www/straped/mufon/org/34044.html"],"trends":["There have been 12 other sightings in Fairless Hills","There were no other sightings in Fairless Hills on or around December 9th 2011"],"divs":["Sighting DetailsOn Fri December 9th 2011 around 9:30 PM I was driving from Levittown PA heading toward the Oxford Valley Mall area in Fairless Hills, when a bright orange steady light caught my eye as I was driving up a steep hill. It caught my attention because it was much brighter than any star in the sky, yet it seems far away since it was close to the horizon and moving slowly. It was too orange-yellow and orange-red to be an aircraft landing light (which I've seen many times since I live over the flight path of Philalphia International Airport and Ewing NJ Airport). The light in getting progressively brighter as it approaches my location. Now I'm intrigued because it's so bright and the light hue is abnormal, so I pulled over in the CVS parking lot after watching it for about a minute while driving. After about a minute, its overhead (out of my sight) so thats why I pulled over and got out of my car at CVS on South Oxford Valley Rd. I've seen both commercial aircraft and military aircraft flying at night for many years around here, and I've been an aviation buff for 30+ years. I can tell you that the light that I saw was too bright to be landing lights, too yellow-orange-red to be aircraft lights, not navigation lights, and not afterburners on a military jet for one simple reason.......the light was intense coming AND going. Landing lights would have disappeared as it flew AWAY from me. Afterburner flames can only be seen with intensity as the plane is flying AWAY from me. This glowing light was clearly visible and steady the entire time (strongest in intensity when directly overhead), with fluctuating blend of colors orange (mainly), yellow and red. The red was not a regular pulsating red light you see on planes. Instead the red appeared intermittently and around the edges of the glowing orange-yellow light. The most striking effect was a \"heatwave\" effect. The edges of the light were blurred and the intensity seemed to \"warble\" at random, as if the image of the light was being distorted by heat or magnetism. There was no detectable sound as it flew overhead. I was trying to hear for the whine of a jet engine......nothing. I flew nearly directly overhead (approx 85 degrees from horizon). I tracked it as it flew in a near linear path and it disappeared about a minute later due to distance and light cloud cover. The whole tracking of the light took about 2 minutes, from horizon approaching to horizon departing. Anybody out there see the same thing? Any clues as to what this was?"],"Viewing Distance":"Over 1 Mile, Unknown","City":"Fairless Hills","Disposition":"Unresolved","Object Shape":"Circle, Fireball, Sphere, Star-like","Country":"United States","Case Number":"34044","Log Number":"US-12152011-0017","Date of the Event":"12/09/2011 09:30 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.167936,+-74.847999(34044)&iwloc=A&hl=en\"> mufon case (34044) map </A>","Weather Factors":"Unknown","Latitude":"40.167936","Longitude":"-74.847999","Summary":"Bright light was brighter than any stars got progressively brighter as it flew overhead and faded as it went into clouds. Main hue was orange, with yellows & random subtle reds with a HEATWAVE distortion.Light remained strong coming, overhead, & leaving","Date Submitted":"12/15/2011 10:20 UTC"}