{"Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-12162011-0013","trends":["There has been one other sighting in Enon","There were no other sightings in Enon on or around June 1st 1963"],"Latitude":"39.881434","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.881434,+-83.896604(34059)&iwloc=A&hl=en\"> mufon case (34059) map </A>","divs":["sighting detailsseems like it was a spring day, as it was not extremely hot. we didn't need to wear jackets either. my mother, brother 8 and myself 10 would walk to the nearest woods, which was 1\\4 mile south of where we lived. we would talk and bond holding hands. all of a sudden we both looked at mom and back to the ship and back to mom. she looked at both of us and said never to repeat the incident, for no one would believe us. i dont even remember telling our grandparents which we lived with at the time. the object was a long cigar shaped object with one end pointed. there were no windows, lights or any sound emitting from the object. all of a sudden, as if it knew it had been spotted, went from a horizontal position, hovering above the woods, to almost a vertical position, somewhat in a slow motion movement. it thrust out into space, without a noise, or any sign of emissions. only leaving the impression of a dot until it was gone. all we could do at that point was laugh histerically in some state of shock. needless to say, we didn't go any further. we walked back home and never talked of it again. i have only recently talked with a couple other believers. forty eight years later."],"City":"Enon","Longitude":"-83.896604","Date Submitted":"12/16/2011 06:41 UTC","Object Features":"Undisclosed","Tags":"City","Object Shape":"Bullet, Missile, Cigar","Date of the Event":"06/01/1963 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/34059.html.txt","/var/www/straped/mufon/org/34059.html"],"Disposition":"Unresolved","Region":"Ohio","Case Number":"34059","Summary":"Hovered 50 ft above woods horizontally, turned up vertically and shot straight into space leaving only a dot of the rearend."}