{"Object Flight Path":"Stationary","Country":"United States","Object Features":"Unknown","Disposition":"Unresolved","Source":"MUFON","City":"Undisclosed","Latitude":"36.780921","map":"<A HREF = \"http://maps.google.com/maps?q=36.780921,+-119.413632(34052)&iwloc=A&hl=en\"> mufon case (34052) map </A>","trends":[],"Log Number":"US-12162011-0006","Weather Factors":"Unknown","divs":["Sighting DetailsWas at my boyfriend's house in Vista, CA (north San Diego County). Had back pain and woke up about 3 a.m. & had coffee. Went outside to have a smoke and was stargazing. STARLIKE, then PLANET-LIKE Noticed 2 unusually bright \"stars\" on opposite sides of the sky that aroused my curiosity, for they appeared to be pulsating and getting brighter and larger at times. They were unusually low in the sky (for stars) as well. At varying intervals they would both illuminate around their edges and reveal their definite circular shape. Sometimes they almost looked like planets with an eclipse, with the light source behind them. CHANGED POSITION IN THE SKY Over the course of 2 hours the objects changed position in the sky, as well as distance from me. One started out low, then gradually higher. Other other was higher and got lower as time passed. PROJECTED 2 V-RAYS OF LIGHT At various times, both of these objects brightened and simultaneously projected 2 rays that looked like an upside down V. To clarify this, there were 2 rays projecting downward at 30-45 degree angles. I was taken aback by the synchronicity of the two objects. When one would illuminate and project the rays, I would turn my head to the other and see the same thing happen to the other one. NOISE A lot of the time there was a very soft, high-pitched beeping (key of C?) that seemed to be everywhere, sort of like when a neighbor goes to work and their clock radio alarm goes off while they're gone, and it goes on and on and on...... The sound appeared to be surrounding me instead of being from a definite source that I could turn my ear to. I was so engaged with the lights that I ignored the sound after a while. Don't know how long the sound lasted. Could have been someone's alarm. OTHER BRIGHT OBJECTS IN A ROW There were other bright blinking lights that appeared to be in formation very low in the sky, that I was also watching, but focused on the 2 main ones. WITNESS Shortly after first observing I had to wake my boyfriend up out of a dead sleep to come see, just to make sure I wasn't hallucinating! He staggered out with his glasses half asleep and did say, \"You mean that bright star that's blinking with the streaks coming out of it? It's probably a planet.\" He went back to bed just before it did the illuminated circle thing! I even have a secondhand telescope I just bought in the trunk of my car, but didn't know how to set it up so I didn't want to fuss with it and miss the light show! I'm getting that puppy set up tonight --just in case! Feel free to call if you need clarification on anything."],"Tags":"City","Region":"California","Date Submitted":"12/16/2011 11:00 UTC","Case Number":"34052","Object Shape":"Circle, Star-like","Viewing Distance":"Over One Mile","Summary":"At first appeared to be pulsating stars on opposite sides of the sky, then illuminated with clear circle shape like an eclipse, simultaneously projecting 2 rays downward like an upside down V. Watched for 2 hours!","Sighting Duration":"Undisclosed","Longitude":"-119.413632","Date of the Event":"12/16/2011 03:30 UTC","files":["/var/www/straped/mufon/html2text/34052.html.txt","/var/www/straped/mufon/org/34052.html"]}