{"Latitude":"40.697199","Object Shape":"Unknown","Source":"MUFON","Date of the Event":"12/15/2011 04:45 UTC","Region":"New York","Sighting Duration":"Undisclosed","Date Submitted":"12/16/2011 10:08 UTC","Disposition":"Unresolved","City":"Lindenhurst","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.697199,+-73.37386(34051)&iwloc=A&hl=en\"> mufon case (34051) map </A>","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/34051.html.txt","/var/www/straped/mufon/org/34051.html"],"trends":["There have been 3 other sightings in Lindenhurst","There were no other sightings in Lindenhurst on or around December 15th 2011"],"Case Number":"34051","Weather Factors":"Unknown","Tags":"City","Log Number":"US-12162011-0005","divs":["sighting detailsi was looking out of my bathroom window when i noticed an strange blinking red lite. i watched it as it hovered at about 4:45 over what seemed to be sunrise highway which is a 1\\2 mile from my house. the lite slowly started moving east then stopped and hovered a while before slowly moving in a westerly direction yet never moving too far away. i realized early on that this lite was actually two lights and it was blinking from left to right. i ran in to get my phone to see if i could get it on video or get some stills but was unable to see it in the view finder. i went outside to my car to get my ipod as it has a better video recorder but still couldn't catch it. as i was outside watching this lite my food was being delivered and i showed the guy what i was looking at. he found it strange as well so i saw my neighbor and pointed it out to him and we both asked how whatever it was could be sitting up there without falling out of the sky because it wasn't moving most of the time it was up there. i went back inside with my food and at this point i'd been watching my new friend for almost an hour. i called news 12 long island but they said there wasn't anything they could do. i called mufon and got the number of an investigator in ny and called him. i spoke to him while still watching this lite now slowly moving west. at around 6:05 the object was moving in a northern direction and was still visible behind the treeline in the distance about 2 miles away as it slowly moved beyond my sight. i've seen many things in the skies here on long island and clearly there's some major activity that needs immediate investigation. i want to know what's been flying through our skies!!!"],"Summary":"Watched blinking red lite for over an hour. The lite hovered, moved east, then hovered and moved west.","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Longitude":"-73.37386"}