{"Sighting Duration":"Undisclosed","Case Number":"34053","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/34053.html.txt","/var/www/straped/mufon/more/34053_submitter_file1__044.JPG","/var/www/straped/mufon/more/34053_submitter_file2__047.JPG","/var/www/straped/mufon/more/34053_submitter_file3__048.JPG","/var/www/straped/mufon/org/34053.html"],"Disposition":"Unresolved","City":"Gray","Date of the Event":"10/16/2011 04:02 UTC","Viewing Distance":"101-500 Feet","Summary":"I was taking photos of crow on the edge of corn field. I got home to delete photo's and noticed something shinny in the background. Where I was there didnt notice with the naked eye.","Object Shape":"Disc","Longitude":"-70.34208","Log Number":"US-12162011-0007","Country":"United States","trends":["There have been 3 other sightings in Gray","There were no other sightings in Gray on or around October 16th 2011","This sighting has never been favorited.",""],"Region":"Maine","Source":"MUFON","Latitude":"43.889557","Object Flight Path":"Stationary","Date Submitted":"12/16/2011 12:20 UTC","Weather Factors":"Unknown","divs":["sighting detailsi was coming back from my sons birthday party in gray, me. it was exactly 4:03pm. i used a i phone camera with no zoom. so it took a good photo of the whole field. i had take many of photo's of the same area and even seconds before and after this luminous object appeared with in seconds. and it was gone in the next frame. i zoomed in and looked at it closely. there was no planes in the area. the sun was soon to set. the crows were quiet at the time. the sun was shining bright. the time i was there, i didn't see or hear anything unusual. i didn't see the object until i got home to delete my photo's. that is when i noticed something shinning in front of the tree line. there was no house or truck there. those don't disappear in seconds! i have never seen a ufo up-close. i even looked on google map to see a road where it was. i was 425.665 yards away.in one photo you can see a crow in the sky. size of a dot from where i was standing. i used a measuring map online. it took me this long to crop and see the photo's myself. i hope someone can analyze these. i also am a photographer and have a keen eye. when the sun hit the object, the front shape is all that shows up. i also been studying ufo\\abductions since 2005. so i know the shapes and what they can do. etc. please let me know what you find out after. thank you:) write to me in my email and let me know. as you can see in the photo's the time is 4:03pm. all taken with in 1 minute. *photo numer 41, 44 is before it appears *photo 47 is the ufo *photo 48 is right after"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.889557,+-70.34208(34053)&iwloc=A&hl=en\"> mufon case (34053) map </A>"}