{"Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Douglasville","There were no other sightings in Douglasville on or around May 15th 1995"],"Latitude":"33.770747","Longitude":"-84.679471","Region":"Georgia","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.770747,+-84.679471(34064)&iwloc=A&hl=en\"> mufon case (34064) map </A>","Log Number":"US-12162011-0018","Case Number":"34064","Date Submitted":"12/16/2011 10:58 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting Details On the night of the sighting, it was cool and nice outside. My step-mom was sitting in as bay window, with windows and blinds open, on our house watching TV in her and my dads room. My step-sister was sitting in the living room with the windows and the blinds open, both step-mom and step-sister letting the night air in. Both parties sitting next to open windows were on the same side of the sighting. My father and I were located in my bedroom and were playing a video game. My blinds and window was also open due to the nice night. the air was cool and the skys were partly cloudy. As my dad and I were playing the game, we were destirbed by lots of neighborhood dogs barking and gathering in the street. The dogs were congragating near a light post located approximatley 75 to 100 feet from my bedroom window and directly in front of the house. We paused the game and began watching the dogs. After a few minutes, my dad left the room and went to his room to retrieve a pair of bynoculars to get a closer look at the dogs. I had a pair in my room and I retrieved mine as well. When my dad returned to my room, we turned the TV off to darken the room and began trying to focuse on the pack of dogs. The part of the whole ordeal seemed strange becsuse some of the neighborhood dogs that were gathered would normaly not get along. We began to focuse in on the dogs. We noticed the dogs were barking while looking up into the sky. We talked about why they might be behaving like this for a few moments then began to look towards the sky, to the right of the house, when all of the sudden a bright light from up above burst in through the window causing my father and I to fall backwards onto the floor. Prior to the light, my dad and I were on our knees looking out the window. When we came to and regained our sight. We were laying on the floor next to each other. Now we both understand that our bynoculars would have magnified the light, but I know the light was bright to begin with. I looked back out the window and caught a glimps of a craft in the air that appeared to slowly floating away. The craft floated behind a cloud or into some type of fog and disapeared for good. When we regained our composure, we went into the living room and said \"did you see that\" to my step sister. She stated \"what are yall talking about\". We stated \"the dogs and the bright light\". She stated \"no\" and went back to watching TV. We left the living room and went to my dads room where my step-mother had been sitting in the bay window watching TV. We asked her the same questions and she stated she had heard the dogs earlier but had not observed any type of flash or light. My dad and I looked out the bay window real fast and realized that the dogs were gone. My dad and I went outside of the residence and walked to the neighbors house. The neighbor was outside working in and around his gargage. We asked him if he had observed anything and he stated no. He did state that his dog had ran off earlier, but the dog had returned sometime earlier. After investigating the situation for sometime, my dad and I concluded that all the dogs that we had observed were back at their homes and that people had observed the dogs acting funny but had not observed the light. The part of the incident that still puzzles my dad and I is the fact that what seemed to take a few seconds, like looking at the dogs, seeing the light and coming to on the floor had apparently taking some time because everyone stated they had observed anbd heard the dogs ealrier but not recently when asked. We thought that the flashj happened and a few seconds later we were up and asking about the incident. We dont remember the, as people stated \"some time\" went. The dogs had been home for \"somne time\", we heard the dogs \"earlier\", we observed the dogs \"earlier\". there is time missing and neither my dad or I remember what happened during the missing time. P.S. I am an investigator at a local police department and this has puzzled my to this day."],"Object Features":"Undisclosed","Object Shape":"Disc","Tags":"City","Country":"United States","City":"Douglasville","Date of the Event":"05/15/1995 12:00 UTC","files":["/var/www/straped/mufon/html2text/34064.html.txt","/var/www/straped/mufon/org/34064.html"],"Summary":"Bright Light, strange k-9 activity, missing time line","Viewing Distance":"501 Feet - 1 Mile"}