{"Tags":"City","Object Shape":"Cylinder, Flash, Sphere, Star-like","City":"Laramie","Source":"MUFON","Country":"United States","Region":"Wyoming","trends":["There have been 5 other sightings in Laramie","There were no other sightings in Laramie on or around December 15th 2011"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.323374,+-105.600443(34062)&iwloc=A&hl=en\"> mufon case (34062) map </A>","divs":["Sighting Details I stepped outside my house to take the garbage out. I have pretty frequently seen what look like star-like objects that hover around and sometimes change direction or shoot off at fast speeds, so I've taken the habit of watching fairly frequently for them. There's an empty field next to my house on the West end of town which allows for pretty clear star gazing. I was looking up in the Western sky and spotted one of these star-like objects was hovering around, changing color and intensity. I started to look around and noticed some airplanes and a shooting star. As I was looking around I noticed a very large bright orange sphere to the North of me. It surprised me because it seemed to appear out of nowhere and I had probably been outside for ten minutes at this point. As I watched it flashed and expanded into a long cylinder shape, horizontally. It stayed orange but seemed to almost radiate. It was intense in color and brightness, but almost seemed to have a softness to it, nit like street lamps. It appeared to just be on the outskirts of town, which is less than a mile from me, but it was really hard to judge distance, I must know it looked big. Shortly after it changed size it began to move in my direction. I tried to stay and watch but it scared me and I went inside my house. I had an eerie feeling that it noticed me, which made me quite unnerved, but it could have just been the surprise as it appeared out of nowhere. After about ten minutes I went back out to see if it was still there. I could not immediate spot it. After scanning the sky I noticed a bright orange sphere much higher in the sky, directly overhead and appearing to be similar. I watched it for awhile not noticing any movement. I went out several more times throughout the night not seeing anything else."],"Case Number":"34062","Latitude":"41.323374","Date Submitted":"12/16/2011 10:08 UTC","Object Flight Path":"Hovering then path","Summary":"Bright orange object above town","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-105.600443","files":["/var/www/straped/mufon/html2text/34062.html.txt","/var/www/straped/mufon/org/34062.html"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Unknown","Date of the Event":"12/15/2011 06:30 UTC","Log Number":"US-12162011-0016"}