{"map":"<A HREF = \"http://maps.google.com/maps?q=52.945456,+-106.448974(34063)&iwloc=A&hl=en\"> mufon case (34063) map </A>","Viewing Distance":"Unknown","Object Features":"None","Case Number":"34063","Date of the Event":"06/07/2011 07:15 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Region":"Saskatchewan","City":"Undisclosed","Summary":"found hair sample","Sighting Duration":"01:02:07","Country":"Canada","divs":["Sighting DetailsI was drinking my coffee, I woke up tired that morning. I went outside after hearing my dog barking. She was tangled in the bushes behind our fence. The manner was unlike she could tangle herself. The knot was high up in the bushes. I untangled the dog and then went back inside and got another cup of coffee. As I was coming down the basement steps i saw some hair on the bottom step. It was blonde and looked like it had been cut and left there. I have a sample of this hair to this day. Shortly after I began drawing a picture, what i imagined in my head of the being who left the hair on my bottom step. I have \"memories\" of this being, and being intimate with her on several occasions. I use quotations because they do not feel like memories. They are somewhat clouded and dream like, though vivid at times. I do not have the means to have this hair that was left verified as extraterrestrial. I am seeking you're help with this problem. I am not altogether clear on whether this is fantasy or real incidents happening to me. The being is a blonde woman around my age. Almost human in every aspect but for the larger than usual eyes which are almond shaped yet human like and blue. Please get back to me and give me an address to send these hair samples to."],"Disposition":"Unresolved","Longitude":"-106.448974","Date Submitted":"12/16/2011 10:38 UTC","Source":"MUFON","Latitude":"52.945456","Log Number":"CA-12162011-0017","trends":[],"Tags":"City","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/34063.html.txt","/var/www/straped/mufon/org/34063.html"]}