{"Object Features":"Window(s)","Source":"MUFON","City":"Burns","map":"<A HREF = \"http://maps.google.com/maps?q=43.595461,+-119.045883(34067)&iwloc=A&hl=en\"> mufon case (34067) map </A>","Country":"United States","Date Submitted":"12/17/2011 01:42 UTC","Longitude":"-119.045883","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Weather Factors":"None","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/34067.html.txt","/var/www/straped/mufon/org/34067.html"],"Case Number":"34067","Log Number":"US-12172011-0002","Region":"Oregon","Tags":"City","Object Flight Path":"Hovering then path,Path then hovering","Summary":"wilderness of Oregon. Large saucer, very close, witnesses suffered memory loss.","divs":["Sighting DetailsI apologize that this is second hand, but my family member who experienced this never wished it reported. Now it can be. I hope that it might be associated with other events in the area about that time, providing added proof that something DID occur in the area of the Maheur National forest, NW of Burns Oregon at that time. The month is correct (Oct), the day could have been any day during deer season. My Aunt, Uncle and a large group of friends were camped at Morgan Springs in the Malheur National forest. It was dark and the days hunt over. As usual everyone was around the fire. This was rugged country. I've been to this spot in the 70's and 80's. Very hard to find and to get there with vehicles. Theirs was the only group at that site. Let me state that my Aunt was the national chairman of a prestigious real estate concern. Listed in Who's Who, very successful, logical and level headed. She was walking around the group with a tray of snacks. She stated that it soundlessly glided into view just above the tree tops. These would be large Ponderosa pines. It stopped, hovering, not directly overhead but about 50 Feet away at a 45 degree angle, about 100 ft above the ground. About half the craft was visible, saucer shaped, she estimated it to be at least 100 ft wide, but I don't recall how thick it was. Everyone freaked out, women screamed, men yelling, some went for their hunting rifles. She said it was so close and so obvious what it was, that nobody said anything like \"what is it\". Everyone knew. There were \"windows\", for lack of a better term. I don't recall if they were visible as it came into sight or not. I think she said they appeared after it stopped to hover. A yellow light was visible, apparently eminatting from the crafts interior. She said the shapes of more than one humanoid body was visible and movement was easily discerned with the yellow back light. No features were seen as no light was directed in to the craft from the outside. She said that the movements were fluid, natural, but seemed uncharictoristic of normal human movement. Proportions were odd as well. She said they seemed to be curious about them, moving to get diffent looks into the campsight. At this point, only a few seconds have passed. She was a camera buff and she dropped the tray and ran to the camping vehicle to get her 35mm. She had to load it and said she may have been inside the camper for 3 minutes max. When she emerged, camera in hand, the entire group was still and calm. The craft gone. Some of those that hadn't left the fire area were again seated. A couple of the group that ran were slowly walking back. Two men with hunting rifles were stone still and seemed catatonic for another couple of minutes. She asked what happened, where the saucer went, etc. Slowly, she started to get responses, simple ones, like \"what\"? Soon, they regained their wits. She was frantic, demanding answers... they all, including her husband, acted like she'd lost her mind. They had no explanation or memory of why some were away from the fire, holding guns or unable to recall the tray of snacks being dropped by her as she ran for her camera. She was incredulus, and being a strong willed, confident woman, she demanded answers and insisted her story was true and it was THEY who were daft. It got heated. Her husband, my uncle, finally felt embarrassed enough to demand her silence and in the coming days she agreed, at his request, to NEVER tell this story. To my knowledge, I am the only one she told. obviously, she believes the metal skin of the camper protected her from whatever caused the memory loss to the others. Her and my uncle are the greatest people I've ever known. I need no additional proof. I simply believe her. Hopefully, if any other events took place in that area, this will add weight to their accounts. The biggest hole in my story is that I am unsure of the year. She told me this story in the early 70's I and can't recall how many years previously the event happened. Sorry about that. Good luck with your efforts, hope we all get concrete proof one day soon."],"Disposition":"Unknown","Latitude":"43.595461","trends":["There have been 8 other sightings in Burns","There were no other sightings in Burns on or around September 30th 1968"],"Date of the Event":"09/30/1968 07:10 UTC"}