{"Summary":"Mountain camping, bright light directly 4 inches from my face and then it sped off into space and hovered for 15 + minutes and faded","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/34070.html.txt","/var/www/straped/mufon/more/34070_submitter_file1__P1010011.JPG","/var/www/straped/mufon/more/34070_submitter_file2__P1010010.JPG","/var/www/straped/mufon/org/34070.html"],"Latitude":"44.071862","Country":"United States","Object Features":"Unknown","Object Shape":"Circle, Unknown","Date of the Event":"05/05/2002 12:00 UTC","Date Submitted":"12/17/2011 02:36 UTC","Log Number":"US-12172011-0005","trends":[""],"divs":["Sighting DetailsMy boyfriend, me, and 2 friends were hiking in the Idaho Panhandle near Ball Lake. We all laid down to sleep under the stars about 10 pm or so. I dont remember the exact timebut it was dark. I couldnt sleep because I was too cold so a couple hours passed and I was the only one awake. I was in my sleeping bag in an inchwrom like position with stomach facing the ground, huddled up trying to get warm when I lifted my head up after hearing something only to find a flashlight-type light staring into my face about 4 inches from my face. At first I thought someone was shining a bright light into my face but then I reallized the size of teh light was too big to be a standard flashlight. My eyes were wide in disbelief. It stayed there for about 5 seconds, maybe more, just looking at me and I at it and then took off so fast in an archlike path but straight up where it produced a pink like glow as it reached a certain point. It got there faster than anything I have ever seen. Once it was up there (it was a clear, starfilled night sky), I woke my boyfriend up and excitedly told him to look up in the sky and see the light that was literally right in front of my face not seconds earlier. He shrugged it off saying it was a comet and nothing more. I repeatedly told him no, it absolutley wasnt. He didnt think much of it and rolled back over to sleep while I watched the light over a period of about 15 minutes which over that period of time, it faded in intensity of light. At first I had a moment of surprise and then I realized this was not normal, for a light to be shining in my face and a small bit of fear crept in. It was then that it took off up into the sky at lightning speed. I let the site of the object go after I knew it was fading over time and tried to get some sleep. I finally fell asleep only to wake in the morning to tell the others of my story and to have my boyfriend discredit and make fun of me while I was doing so. It made me mad, that I was not taken seriously."],"Source":"MUFON","Longitude":"-114.732581","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Region":"Idaho","Case Number":"34070","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.071862,+-114.732581(34070)&iwloc=A&hl=en\"> mufon case (34070) map </A>","Viewing Distance":"20 Feet or Less, Over 1 Mile","Tags":"City"}