{"Object Features":"Undisclosed","Region":"Manawatu-Wanganui","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3407.html.txt","/var/www/straped/mufon/org/3407.html"],"Country":"New Zealand","Case Number":"3407","map":"<A HREF = \"http://maps.google.com/maps?q=-40.352306,+175.608214(3407)&iwloc=A&hl=en\"> mufon case (3407) map </A>","Viewing Distance":"Unknown","Latitude":"-40.352306","Disposition":"Insufficient Data","Log Number":"","Weather Factors":"Unknown","City":"Palmerston North","Summary":"Not Provided","Sighting Duration":"Undisclosed","Longitude":"175.608214","divs":["Sighting DetailsSighting Report: I went out side for a cigarette and I noticed a bright light (brighter then anything other star in the sky) flashing pinkish red, white and teal green in the sky. It took under a second for the colours to change from red to white to green. I watched the object for about 5 minutes, it occasionally moved side to side and at one point i saw a small whiteish ball come off then merge back into the flashing object. It appeared to stay in the same location so I went in side to grab the binoculars. When I came back the object had moved further away in a southern direction. I looked at it through my binoculars and it appeared to have a slight haze around it whereas the other stars I looked at in the sky did not. At this point it appeared to be moving side to side and up and down, but when I looked at it though my binoculars it appeared to be somewhat still. At this point I was lying on the ground trying to stabilize my binoculars. I moved out of site of the object for about 30 seconds and by the time I returned the object was gone. The object was sighted in the west not far above the horizon. I attempted to take some photos with my phones digital camera (Sharp GX-15) they show the objects location in the sky."],"Object Shape":"Undisclosed","trends":["There has been one other sighting in Palmerston North","There were no other sightings in Palmerston North on or around March 20th 2005"],"Date Submitted":"03/20/2005 02:14 UTC","Date of the Event":"03/20/2005 02:14 UTC","Object Flight Path":"Undisclosed","Tags":"City"}