{"files":["/var/www/straped/mufon/html2text/34080.html.txt","/var/www/straped/mufon/org/34080.html"],"Object Shape":"Triangle","Date Submitted":"12/17/2011 07:32 UTC","Object Flight Path":"Straight-line path","Latitude":"30.212334","Longitude":"-97.776296","Log Number":"US-12172011-0015","Summary":"Very large Triangle shaped object crossed the road in front of us.","Object Features":"None, Unknown","Sighting Duration":"Undisclosed","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around December 16th 2011"],"Disposition":"Unresolved","Weather Factors":"Unknown","Region":"Texas","Date of the Event":"12/16/2011 10:00 UTC","Case Number":"34080","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=30.212334,+-97.776296(34080)&iwloc=A&hl=en\"> mufon case (34080) map </A>","divs":["sighting detailsdecember 16th approximately 10:00 pm, my wife and i were driving home from seeing a movie. as we pulled on to the street that we live on, we noticed a very large triangular object about to cross over our street approximately 2 blocks in front of us. it appeared to be about 100 feet in the air, and it was moving very slowly as it meandered through the sky in front of us. it was very large, metallic, and appeared to be a black or dull finish that did not reflect much light. it was outlined with lights. most of the lights were white, although there may have been some blue or green lights mixed in. one of the first things that struck us as odd was that with our windows rolled up, it seemed to be making no sound. we rolled our windows down and could hear only a very light hum \\ rumble. it was first spotted to the left of us, crossed over and continued to our right. all along moving slowly in one direction. we took a right at the next street available in an attempt to get a better look. we did see it again for just a moment. we then lost it in the trees, and it seemed to be gone. we drove around for a short distance hoping to spot it again, but it was no longer visible. at no time did we feel threatened, nor did we experience interruption in the operation of our vehicle, the radio, the lights ...etc...we then drove home."],"City":"Austin","Tags":"City","Source":"MUFON"}