{"Object Flight Path":"Path with directional change","Case Number":"34082","Source":"MUFON","divs":["Sighting DetailsMy wife and I were outside in the backyard enjoying our firepit when I noticed a bright light traveling from the mountains to the east. I thought it was an airplane preparing an approach for landing at DIA, but, the light got brighter and did not have any colored lights on the bottom. I pointed it out to my wife and as we watched, the bright light changed directions and went north, rather quicklyly. As it went north the light dimmed quickly to a small glow and the size of the light shrank to the size of the visible stars and then poof, it was gone. Total length of sighting was maybe 1 minute 30 seconds. We live in Arvada, CO and are used to seeing lots of plains as they approach DIA occassionly from the west. I thought it was a plane at first, but it was too bright and the light too big and it changed directions way to fast, ewat then north. Then I thought it was a satelite but they don't change directions on a tight line????? Was cool seeing something that makes no sense. BTW, I am reporting this 25 minutes after seeing it."],"City":"Arvada","Date Submitted":"12/17/2011 08:53 UTC","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=39.806804,+-105.080684(34082)&iwloc=A&hl=en\"> mufon case (34082) map </A>","Log Number":"US-12172011-0017","Viewing Distance":"Over One Mile","Longitude":"-105.080684","Country":"United States","Disposition":"Unresolved","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around December 17th 2011"],"Sighting Duration":"Undisclosed","Object Features":"None","Latitude":"39.806804","Region":"Colorado","Weather Factors":"Unknown","Date of the Event":"12/17/2011 06:19 UTC","files":["/var/www/straped/mufon/html2text/34082.html.txt","/var/www/straped/mufon/org/34082.html"],"Summary":"Sitting by firepit, bright object traveling east then changed direction and went north. Was very bright then dimmed and vanished. Not a plane and not a satelite. familiar with both, in DIA landing approach lain in Arvada, CO","Tags":"City"}