{"City":"Scituate","Sighting Duration":"Undisclosed","Summary":"saw three lights moving north to south then they faded away.","Country":"United States","Date of the Event":"12/17/2011 08:20 UTC","Latitude":"41.843595","Longitude":"-71.635998","Date Submitted":"12/17/2011 11:22 UTC","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.843595,+-71.635998(34084)&iwloc=A&hl=en\"> mufon case (34084) map </A>","Viewing Distance":"101-500 Feet","Tags":"City","Source":"MUFON","divs":["sighting details myself and my brother were outside havin a smoke and like always we were lookin up. without a sound in the sky from behind the roof of the house a light no more then a 200yrds away at about 500ft agl appeared. first it was just one reddish orange light with a red light inside it and a yellow light just above it. as we moved toward it across the yard two more came into sight. the three lights were either three independent objects or one large v shaped craft. if it was one object given how far i was from it, i would have to say it was larger then a football stadium. it was moving north to south at i would think no more then 50mph and after about 5 to 10 seconds the first light kinda faded away. the other two lights when they got to the same point in the sky were the first light disappeared they faded away in the same way the first light did. this took place on 12\\17\\11 at about 20:20 with little to no cloud cover. the only sound i could hear was a jet that just took off at t.f green airport about 7 or 8 miles to the south east of were i was when it all went down. the plain i heard flew through the flight path of the object no more then a minute after it disappeared."],"Log Number":"US-12172011-0019","Region":"Rhode Island","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/34084.html.txt","/var/www/straped/mufon/org/34084.html"],"Object Flight Path":"Straight-line path","Object Features":"Unknown","Case Number":"34084","trends":["There has been one other sighting in Scituate","There was one other sighting in Scituate on or around December 17th 2011"],"Disposition":"Unresolved"}