{"Case Number":"34091","Date of the Event":"12/16/2011 08:08 UTC","trends":["There have been 5 other sightings in Norfolk","There were no other sightings in Norfolk on or around December 16th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.018994,+-97.349202(34091)&iwloc=A&hl=en\"> mufon case (34091) map </A>","divs":["Sighting DetailsOkay i was out back in the open garage smoking a cigaret. but i haven't just seen one iv seen like 4 just in the past month at least just the ones i can make out but iv seen what my friend says is the silver lining but the very first one i saw i was with a friend and me and him were walking out back and their it was i new right away what it was because i am a major UFO junky i wanna be a ufologist when i get older. but the first one i saw was a triangular one with white lights at etch corner and a orange light in the middle i cant remember the 2 or but the 3rd time i saw what think is a mother ship because it was huge and their was other little UFOs coming out the bottom and one just shooted across the sky over my head but the 4th sieting was today just a few hours ago but it was what i think the normal kind of UFO with a dome and a oval body it was letting out little red orbs from the bottom of it and the first one that came out shoot back into the sky and the second just came out and diapered and a could see a beam of light shining out from under it just like every other one and their were a lot other little one that would line up in a line and just shine a light on one another and blink like they were communicating and i think thats the silver lining. i think some one should serestly give me a call and come out here for a couple of days because every day their at-lest one or 2 UFOs out here."],"files":["/var/www/straped/mufon/html2text/34091.html.txt","/var/www/straped/mufon/org/34091.html"],"Source":"MUFON","Latitude":"42.018994","Date Submitted":"12/18/2011 12:14 UTC","Object Features":"Dome","Sighting Duration":"Undisclosed","Longitude":"-97.349202","Country":"United States","Object Flight Path":"Stationary","Log Number":"US-12182011-0007","Viewing Distance":"501 Feet - 1 Mile","Region":"Nebraska","Object Shape":"Circle, Cylinder, Saturn-like, Other","City":"Norfolk","Weather Factors":"Unknown","Summary":"orbs came out of it","Disposition":"Unresolved","Tags":"City"}