{"map":"<A HREF = \"http://maps.google.com/maps?q=41.86614,+-88.107013(3411)&iwloc=A&hl=en\"> mufon case (3411) map </A>","Case Number":"3411","trends":["There have been 5 other sightings in Wheaton","There were no other sightings in Wheaton on or around April 9th 2005"],"Sighting Duration":"Undisclosed","Country":"United States","City":"Wheaton","Weather Factors":"Unknown","Disposition":"Unknown","Region":"Illinois","Longitude":"-88.107013","files":["/var/www/straped/mufon/html2text/3411.html.txt","/var/www/straped/mufon/org/3411.html"],"Summary":"Not Provided","Date of the Event":"04/09/2005 11:21 UTC","Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Log Number":"","Latitude":"41.86614","Object Shape":"Undisclosed","Date Submitted":"04/09/2005 11:21 UTC","divs":["Sighting DetailsSighting Report: Last night , April 8, 2005 around midnight I went out to our balcony(we live in a 6th floor apartment, it was very clear, quiet & no wind. Something caught my eye at about a\"10 o clock\" angle, it was a perfect rectangle shape, but nothing else was visible. At first I thought it was one of those white styrofoam planes but just a wing, except it wasn t windy. Then I realized it was all white light, moving much faster than a plane, making no sound. It stayed on a straight course, but the scariest part was the way it changed angles. Staying on a straight course this rectangle would randomly (and very quickly) change angles. first left then right, then right again so it was going backwards! Very deliberate and quick movements, stopping at a different angle each time, this still disturbs me because I know a plane cannot make these quick moves, let alone fly sideways or backwards. In a matter of about 10 seconds it was moving so fast that it disappeared into cloudless night sky. But not towards the horizon like a plane would do, it almost appeared to go up a bit as it disappeared! I have no idea how high it was, it seemed like about the altitude of a small plane, but if it was that high it must be the length of a football field. I would love to know if anyone else saw this. Please let me know, thank you. -Kier"],"Source":"MUFON"}