{"Latitude":"39.772216","Object Flight Path":"Undisclosed","City":"Indianapolis","map":"<A HREF = \"http://maps.google.com/maps?q=39.772216,+-86.155604(3414)&iwloc=A&hl=en\"> mufon case (3414) map </A>","Summary":"Not Provided","Object Features":"Undisclosed","Log Number":"","Viewing Distance":"Unknown","Country":"United States","Case Number":"3414","Source":"MUFON","Date Submitted":"05/19/2005 02:45 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around May 19th 2005"],"Weather Factors":"Unknown","Object Shape":"Undisclosed","Tags":"City","Date of the Event":"05/19/2005 02:45 UTC","Longitude":"-86.155604","divs":["Sighting DetailsSighting Report: It was in 2001,march,on a clear night,approximately 11.30,I and a fellow worker were in the guardhouse at Reilly chemical company, talking.I stepped outside while my friend sat down in his chair,and i started to get in the company vehicle, which was still running, when a soft popping sound caught my attention. Looking up, there hovering above the truck was a elongated shape resembling a football. I called out to chuck to come outside for a minute, as i wanted someone other than myself to see it. Chuck stopped in the doorway and his jaw dropped. I slowly stepped to the truck directly under the object.Looking up at it I could see what appeared to be lines [very faint,I should point out] going both vertically and horizontally around the object. It was lit up with a soft glow that seemed to iminate from inside of it, almost like a soft white light bulb. there were no visible markings on it. I did notice that for something that big and bright it seemed to cast no shadow on the ground or the truck. After what seemed to be four or five minutes, it began to move slowly in a southerly direction, following high tension wires in the plant.It was completely quiet and made no noise as it moved.Chuck and I watched as it slowly made its way south [through a 45 acre site]untill it vanished suddenly.I might add that I have since retired from my job and am on disability. I have a lot of questions that I would like for someone to answer for me.I have been in the Army Security Agency, spent eight years as a special deputy for the county of Marion, state of Indiana, and have flown on numerous planes. Nowhere have I ever seen such a craft, either before or since."],"files":["/var/www/straped/mufon/html2text/3414.html.txt","/var/www/straped/mufon/org/3414.html"],"Region":"Indiana"}