{"files":["/var/www/straped/mufon/html2text/34195.html.txt","/var/www/straped/mufon/org/34195.html"],"Case Number":"34195","Object Features":"Unknown","Log Number":"GB-12182011-0107","Object Shape":"Other","trends":["There have been no other sightings in Prestwich","This sighting has been favorited 1 time."],"Sighting Duration":"Undisclosed","Date Submitted":"12/18/2011 01:46 UTC","Region":"England","Country":"United Kingdom","Weather Factors":"Unknown","divs":["Sighting DetailsManchester, England, night time. I was in a parked car with another person when I noticed two points of white light like bright stars moving slowly at the same speed in a parallel straight-line heading which I believe to be about north-west, one ahead of the other. I thought maybe it was two aircraft I opened the car window and leaned out to get a better view. I then noticed almost directly above me was a third, similar light which formed an equilateral triangle with the other two. One light was leading and the other two following, both the same distance behind. All appeared to be at the same altitude and the distance between them appeared to be rigidly fixed, in other words they were moving as a unit but in the darkness I couldn't see any interconnecting structure between them. I couldn't hear any sound from this. The lights didn't noticeably flicker, shimmer or illuminate anything. I told the person with me what I was seeing but they weren't able to get a clear view from their position. I watched the lights continue with no change of speed or direction until they had all disappeared over the treetops about half a mile away. I couldn't get the strangeness of what I'd seen out of my mind so the following morning I called the Manchester airport and was put through to the Watch. I reported what I'd seen and was told that there was no aircraft activity in that area at that time. They were not able to offer any explanation."],"Summary":"Three points of white light in a horizontal equilateral, triangle formation passed slowly and silently overhead on a straight line heading.","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","Date of the Event":"06/01/1983 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.530891,+-2.306735(34195)&iwloc=A&hl=en\"> mufon case (34195) map </A>","Tags":"City","Longitude":"-2.306735","City":"Prestwich","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Latitude":"53.530891"}