{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/34194.html.txt","/var/www/straped/mufon/org/34194.html"],"Weather Factors":"Unknown","Log Number":"US-12182011-0106","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"12/17/2011 06:45 UTC","Disposition":"Unresolved","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.842991,+-81.157994(34194)&iwloc=A&hl=en\"> mufon case (34194) map </A>","Longitude":"-81.157994","Date Submitted":"12/18/2011 12:34 UTC","Object Shape":"Sphere","Summary":"Thought I was looking at a huge star till it started to move. When I would pinpoint it again for a better look it would move again. Saw with binoculars not a plane, satellite, helicopter, or planet. Husband and child witnessed also.2 retuned at 11pm acend","Latitude":"33.842991","Region":"South Carolina","divs":["Sighting DetailsI was sitting on my porch looking at the early evening sky when I noticed a huge star. At least at first I thought it was a star till it started moving. It was very large and a very bright white light. It was just behind a tree line which is what made me really notice the movement. I would get a clear view of it then it would almost play peek a boo with you. Still unsure of what I was seeing I got my husband to clarify that it was moving. Still thinking at this point it was a plane or helicopter I grabbed my high power binoculars to look for the classic blinking lights. Instead I saw the huge white light no pulsing but the white light was surrounded by a greenish blue color not visible with the necked eye. I obseved this strange left then right up than down flight of this object for over an hour till it was no longer visible. Let me just say right now that I have watched this same sky my whole life! I know ever star, planet, satellite, plane, comet, helicopter, and shooting star. THIS WAS NOTHING LIKE I HAD SEEN IN MY LIFE!!!! On the other hand it was something I have waited my whole life to see. Later around 11pm I again went outside out of pure curiosity to gaze at the sky. In the same general direction as the first encounter there were 2 moving almost in tandome this time. One was way way way up in the atmosphere and almost did look like a satellite. The second object was following behind the first and seemed much bigger and brighter. I continued to watch them clime into the heavens until neither was visible. Planes don't do that and satillites follow a clear flight path. I am not the only one seeing these strange moving lights in SC!!! Last night an hour before my first sighting a woman in Polk county Florida had also seen something similar. I had posted on Earth Sky on Facebook trying to get a logical answer. THEY tried to tell me it's Venus. Ummmm I know Venus and sorry it does not move left to right up then down. When I stated that in my post they never replied again. Like I stated before I KNOW this sky!!!! That was not suppose to be there!"],"Viewing Distance":"Unknown","Source":"MUFON","Case Number":"34194","trends":["There have been no other sightings in Greenville is 30 to 45 mi","This sighting has never been favorited."],"City":"Greenville is 30 to 45 mi"}