{"Object Shape":"Other","Date Submitted":"12/18/2011 03:42 UTC","Case Number":"34197","trends":["There have been no other sightings in Los Alcázares","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Log Number":"ES-12182011-0109","map":"<A HREF = \"http://maps.google.com/maps?q=37.74362,+-0.849814(34197)&iwloc=A&hl=en\"> mufon case (34197) map </A>","Object Features":"Appendage(s)","Date of the Event":"12/14/2011 12:00 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsI was at an outoor social event when someone pointed out a strange flying object approaching from the distance. Witnesses agreed that it looked like a giant golly doll. It appeared to be black with some red on the lower parts. After it had passed about half a mile away from us it became apparent that it was tall and thin in profile. At least 8 people saw it and nobody in the group offered any plausible explanation as to what it was and none noticed any sound from it. After it had passed its side profile became apparent - it was like a vertical rectangle. It continued on straight-line course apparently at a steady altitude of perhaps 500-1000ft before it went out of sight beyond buildings in the distance. A lot of more people must have seen it. If I only seen the front view of it I would have thought it was a strange-looking helicopter or balloon but the lack rotors and this side profile with no tail and the lack of audible sound somewhat negates the helicopter theory and as for it being balloon and thin side profile makes me think doubtful about that. Somebody must know what it was."],"Region":"Murcia","Summary":"This airborne golly-shaped object was seen by at least 8 people.","Source":"MUFON","Country":"Spain","files":["/var/www/straped/mufon/html2text/34197.html.txt","/var/www/straped/mufon/org/34197.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"Undisclosed","Longitude":"-0.849814","City":"Los AlcÃƒÂ¡zares","Latitude":"37.74362","Tags":"City"}