{"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/34196.html.txt","/var/www/straped/mufon/org/34196.html"],"Object Features":"None","divs":["sighting detailson 12\\17\\2011 at approx 0605hrs i was warming up my vehicle getting ready to babysit for a friend. as i was in reverse pulling out of my driveway i noticed a light, i looked out of the passenger side window and did not notice a vehicle headed in my direction. i immediatley noticed to my right and as i continued to pull out of my vehicle right ahead of me approx 100 ft just above the tree line a triangle shaped ufo. the ufo appeared to have been coming from the right as i first saw it and changed its direction to the left flying strait ahead from where i sat in my vehicle. at first before it changed its direction i only noticed a bright white light. after the direction changed i could see the entire bottom which had one bright white light on the front and two in the back and one red flashing light in the middle of the two white lights in the back. i heard no sound emitting from this aircraft and only noticed it because of the light. it did not appear to be at a fast pace. i did not notice it speed up or slow down. it continued on its path in the same pace. i then turned on a road heading in the same direction and tried to keep a visual with it on my left but lost sight of it. in my mind i tried to debate it, i see planes in this area all of the time but they fly at a much higher altitude and i could still hear them. this craft was very low just above the tree line with no sound and a flashing red light. this lasted about 2 min."],"Disposition":"Unresolved","Date Submitted":"12/18/2011 03:07 UTC","Summary":"Triangle Ufo Spotted in Hopewell VA","Weather Factors":"Unknown","Longitude":"-77.307608","Country":"United States","Region":"Virginia","trends":["There have been 2 other sightings in Hopewell","There were no other sightings in Hopewell on or around December 17th 2011"],"Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Date of the Event":"12/17/2011 06:05 UTC","City":"Hopewell","map":"<A HREF = \"http://maps.google.com/maps?q=37.277914,+-77.307608(34196)&iwloc=A&hl=en\"> mufon case (34196) map </A>","Log Number":"US-12182011-0108","Case Number":"34196","Object Flight Path":"Path with directional change","Latitude":"37.277914"}