{"Object Features":"Unknown","Disposition":"Unknown","Case Number":"34205","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["Sighting DetailsI normally would never do this, but I feel as though these things should be reported in some way, for the simple purpose of recording them. To begin, I have recently become attuned to certain aspects of ESP (unintentionally). I mention this because seeing this object brought on a familiar psychological reaction that would normally come with intense concentration on a fellow human or object. The mere sight of this object made me drawn to it; where I had to observe it relentlessly. This was before I realized it was a UFO. I was gazing up at the stars on a clear, cold night when I noticed an especially bright light. It had the appearance of a star, when viewed from a distance, though there was a certain glow and aura emitting from it. Having caught my eye, I positioned myself in a vantage point that allowed me to monitor slight movements of the object (by contrasting it with a nearby rooftop in my line of vision). After a few minutes, I determined that the object wasn't a plane due to it's weird vertical and horizontal hovering motions. The nearest airport that would require a plane to hover for an extended period such as this was over 60 miles away. There seemed to be a small trails of light coming from the object, forming what looked to be a boomerang type shape (or a rounded mountain top). The light trails would taper off on each respective end of the boomerang. The trails themselves gave off a spectral rainbow glow (this glow is what caused the object to catch my eye in the first place). The object slowly moved out of my view, so I went outside my apartment for a better vantage point. I re-spotted the hovering light and continued to observe it. After a few minutes, I decided to run into my apartment and grab my camera. Returning outside no more than 30 seconds later, the light was completely gone. For some reason, I knew this would happen. The instant I walked inside the feeling that I had felt left me and I knew the object would be gone upon my return. I checked around the rest of the sky and there was no trace or sign of the light. The total time of observation was approximately 10-15 minutes, while the object itself had already been hovering in the sky when it was spotted. I've never seen or have expected to see a UFO before this sighting."],"Summary":"UFO Sighting in the Upstate this Morning","Object Flight Path":"Hovering then path","Date of the Event":"12/19/2011 01:45 UTC","trends":["There have been no other sightings in Clemson","This sighting has never been favorited."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.683438,+-82.837365(34205)&iwloc=A&hl=en\"> mufon case (34205) map </A>","Sighting Duration":"Undisclosed","Region":"South Carolina","files":["/var/www/straped/mufon/html2text/34205.html.txt","/var/www/straped/mufon/org/34205.html"],"Country":"United States","Longitude":"-82.837365","Weather Factors":"None","Latitude":"34.683438","Log Number":"US-12192011-0002","Object Shape":"Boomerang, Star-like","Date Submitted":"12/19/2011 02:44 UTC","City":"Clemson"}