{"Object Shape":"Undisclosed","Date of the Event":"06/16/2005 11:20 UTC","City":"Lexington","Case Number":"3420","Object Features":"Undisclosed","Summary":"Not Provided","Disposition":"Insufficient Data","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.041784,+-84.496426(3420)&iwloc=A&hl=en\"> mufon case (3420) map </A>","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around June 16th 2005"],"files":["/var/www/straped/mufon/html2text/3420.html.txt","/var/www/straped/mufon/org/3420.html"],"Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsSighting Report: Sighting By April Tipton Field Investigator for MUFON of Kentucky. Sighting took place June 14,2005 at aprx 10:10pm lasted about 2 minutes. Temp was about 68 degress. Atmospheric conditions were partly cloudy. I had stepped outside to my car, when I looking southward I noticed a brightly lit object that appeared to be hovering above my nieghbors house, I then saw that it was moving, but very slowly due north. I did at first think that this was a conventional aircraft, but upon taking note of how large and low flying it appeared to be realized that this was something out of the ordinary. The objects altitude was no more that 1000ft. The object was very large and at least several hundred feet long and at least 200-300ft across. It appeared to be light from within. Color was yellow and orange and appeared to pulsing, as it went over top of me I noticed that there was no sound at all and the object appeared to more cylindrical than round. I came back into the house to retrive my video camera and when I came back out noticed that the object was still there. I began to film the object and did so until the object was out of sight. I then went to review the footage and noticed that upon doing do that the camera had been subject to some sort of interference. The footage before the event was fine and I made a recording after and it to was also just fine. I then contacted the local airport and was put in contact with air traffic control who said that there was nothing at the altitude at the time of the sighting and was told in fact nothing was on the radar at the time. Also was told that the only aircraft who would have been in the area would have our 2 life flight helicopters. I then proceeded to contanct the local police department to see if anyone had contacted them about this and was told that they had recieved no other calls. Call with any questions"],"Weather Factors":"Unknown","Tags":"City","Region":"Kentucky","Date Submitted":"06/16/2005 11:20 UTC","Latitude":"38.041784","Sighting Duration":"Undisclosed","Log Number":"","Longitude":"-84.496426"}