{"Longitude":"-76.698302","Date Submitted":"12/18/2011 11:37 UTC","Source":"MUFON","Region":"Maryland","City":"Severn","Object Features":"Unknown","Date of the Event":"12/18/2011 07:05 UTC","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.137053,+-76.698302(34203)&iwloc=A&hl=en\"> mufon case (34203) map </A>","Object Shape":"Cone, Star-like","divs":["Sighting DetailsI was driving on Quarterfield road in Severn Maryland when I noticed on my left about 7 orange lights hovering in the sky. It looked like an upsidedown cone with an orange dim light coming out of the bottom of it, changing in brightness slightly every few seconds. It stretched from the treeline to high in the air. It looked very similar to the big dipper. (3-4 orange dots in a row then 4 in a diamond shape) After a few minutes it slightly changed shape and was more in a line again. I kept driving and managed to get under it and it disappeared entirely until I drove back the other direction and they were visible again. I drove down Telegraph road and took a short video of it through the trees, then pulled down past Severn Run where it looked to be hovering over that general area with people standing in the field under it looking up at it. A few seconds after that it was gone again. (I assume it passed over us like when I drove under it)"],"trends":["There have been 3 other sightings in Severn","There were 2 other sightings in Severn on or around December 18th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34203.html.txt","/var/www/straped/mufon/more/34203_submitter_file2__IMG_0834.PNG","/var/www/straped/mufon/org/34203.html"],"Country":"United States","Latitude":"39.137053","Log Number":"US-12182011-0114","Case Number":"34203","Summary":"5-7 Cone-like orange lights overing over severn maryland in a line","Object Flight Path":"Hovering then path,Path then hovering","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}