{"Longitude":"-80.20496","Latitude":"36.101211","Case Number":"34213","Disposition":"Unresolved","Country":"United States","Log Number":"US-12192011-0010","Summary":"Debating with the kids whether it's an airplane or helicopter when in front of it (helicopter) we noticed another set of lights and It dissapered into no where.","Object Shape":"Unknown","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around November 11th 2011"],"City":"Winston-Salem","Date of the Event":"11/11/2011 07:28 UTC","files":["/var/www/straped/mufon/html2text/34213.html.txt","/var/www/straped/mufon/org/34213.html"],"Region":"North Carolina","Weather Factors":"Unknown","Object Features":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Source":"MUFON","Date Submitted":"12/19/2011 05:13 UTC","divs":["Sighting DetailsThe kids and my mom had just pulled up in the driveway at home that night after PTA when one of my daughters spotted a helicopter and stated it was an airplane. After a few seconds of debate she realized she saw the propellers. Ahead of the craft I noticed a new set of lights that reminded me of an airplane but before I could say, \"See child, There's an airplane\", it had descended down (above the trees) super fast and disappeared into nothingness.\" Within an instant I realized at that speed it was destined to crash, also I realized it couldn't be a plane at that speed. How did it dissapear? And did I just see that? Before I could open my mouth my mom said, \"Did you see that?\" I replyed, \"Did we both really just see that?, So you just saw that, what did you see?\" I asked to varify my sighting. \"It just dissapeared\",she remarked. I couldn't believe it took twenty-two years to see another UFO. This time it was so quick it was unbelievable. If my mom had not have caught those lights in her periphial vision in just enough time to see the lights dissappear from her view before even making out what we were looking at... I don't know if I would have believed my own eyes and mind. I'm pretty sure the helicopter pilot saw it because they were approaching from above opposite direction. I couldnt believe mom finally got a chance to see one. One oppertunity missed her in 1996 when my dad, mom, and brother who was on his way to a Mlitary Acadamy, were driving down to Clinton,NC. My dad said maybe she wasn't meant to see it because she never once turned her head while the incident was taking place. They were on the highway and quite unusually their were just two cars, them and a green van. He noticed that the car was keeping exact pace with them. In the back seat was my brother. Ironically, I suppose in the van the father was driving, the mother the passenger and a boy around the age of ten or twelve was in the back seat. The parents in the van never once turned their heads to look over at my father. However he noticed when he would pick up speed so would they. As so when he declined speed, so would the other vehicle as to keep alolngside of the vehicle. The boy in the backseat smiled mockingly and stretched only his neck, but a good twelve inches. My daddy said he then stepped on the gas and they did not persue. My dad swears on Poppa's (his own father's) grave that what he told me was the truth. When I was twelve in the fall of 1989, while standing on my front porch next to the Dixie Classic Fairgrounds staring into the sky, spotting the North Star, Big and Little Dipper, I noticed there were two North Stars. One brighter than the other. Except one of them was not in positon of the North. After spending a few wandering moments pondering on how this was not that North Star but that one was. And trying to figure where this Star came from, I thought I would turn around reach my head into the door and call my father quickly who was sittng just two feet from the door. But I knew I couldn't turn my head because that wasn't suppose to be there. Before I could open my mouth to say Daddy, come here, the craft made three immediate quick movements in the sky. A very wide precise triangle path as it dissappeared into the atmosphere opposite the direction of the sky it was in. I found it amazing the speed at which it could abruptly change directions. Out of this world, literally!"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.101211,+-80.20496(34213)&iwloc=A&hl=en\"> mufon case (34213) map </A>","Viewing Distance":"21-100 Feet"}