{"Viewing Distance":"Unknown","Object Shape":"Sphere","Region":"Maryland","Sighting Duration":"00:12:00","City":"Severn","files":["/var/www/straped/mufon/html2text/34218.html.txt","/var/www/straped/mufon/org/34218.html"],"trends":["There have been 3 other sightings in Severn","There were 2 other sightings in Severn on or around December 18th 2011"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.141423,+-76.696622(34218)&iwloc=A&hl=en\"> mufon case (34218) map </A>","Weather Factors":"Unknown","Tags":"City","Case Number":"34218","Country":"United States","Latitude":"39.141423","Log Number":"US-12202011-0001","Object Flight Path":"Path with directional change","Longitude":"-76.696622","divs":["Sighting DetailsAt home in Severn area, family member noticed something strange occuring outside and alerted everyone in home (six adults at a dinner party). It was about 0650 pm. When we got outside, facing south, saw a line of bright orange glowing objects moving moving from west (right) to east (left) ascending from beyond the treeline. They flew rapidly across the sky, with most appearing to ascend until they disappeared from view. One or two would continue on an easterly trajectory vice the steeper ascent and fade from view. There was a group of about 10-12, then a pause of a few seconds, then a 2nd group of similar size flew the same route in about the same pattern and speed. We began to go back inside, when after a pause of about 60-90 seconds a 3rd group repeated the display. Most of the shapes were evenly spaced, but occassionally one would slow down and the gap would close. After calming down I rang a neighbors doorbell so that they could see what was happening. By the time he came out, he witnessed the last of the objects as it faded from view on the easterly trajectory. All together the event lasted about 12 minutes. We did not get video or pictures of the objects, but they were very similar to those noted in another submission I saw on this site in the Severn area on 18 December, with an accompanying video. However, the objects we saw did not appear to hover, but moved continuously, evenly spaced, but with some randomness in speeds. They were all equal in size and dimension, and emitted a low buzzing sound What ever they were was strange to me and my family, I have never witnessed anything like it and I am a 22 year Air Force veteran's wife. I think that there is something unexplaineable that occured on December 18th 2011 in the skies in Severn."],"Date of the Event":"12/18/2011 06:50 UTC","Disposition":"Unresolved","Summary":"Saw 3-series of evenly spaced lights, ascending from beyond site line of neighborhood homes. Bright orange circular lights on an ascending flight path most disappearing from view.","Date Submitted":"12/20/2011 12:54 UTC","Object Features":"Unknown"}