{"trends":["There have been no other sightings in S.E. OF WIND RIVER CANYON","This sighting has never been favorited."],"divs":["sighting details while driving a semi truck hauling a lowboy trailer w\\acaterpiller d-8 dozer in july 1978about 730 mt time my wife noticed a star in sky at about 45 degrees inclination to the north east. looking to east i could see the moon well up and looking to s.west sun was setting . sun was about 3\\4 below horizon. when i looked back to north east at my wifes excited urging i saw to my amazement the star we had seen was now moving toward us and appeared to be growing larger. the meteor,i thought was getting much bigger until neared snall mountain directly in front of us at about 5000 ft agl\\above groud leve theobject stopped and hovered for about 30 sec then landed on th side of the mountain i just mentioned im assumeing it landed but it could hav been hovering behind mt. but it did not wobble at all this object was \\im estamating\\ 5000-10000 ft in diameter 1-2 miles ive never seen anything this large that was capable of moving under its own power fyi im a licenced commercial pilot and used to be a certified flight instructor. in 1988 i stopped flying because i could only pass medical for private pilot not for commercial because my depth perception had detearated im 65 now as i write this back to sitting after it appeared large object had landed nothing happened for about 2 min then about 6 very small silvery objects that looked like alifting body type aircraft no real apparent wings shapped like a spear point came out of object made one orbit around large object and flew towaed n.w. at what i would guess at mach 2+ its been so many rears since we saw this ive become dulled to the excitment i felt this \\what i now call a ufo\\ if any one would look at a nasa photo of the sun and its corona u would seen almost an identicle picture of what we saw that day i want to make sure its understood that this all took place in full daylight on a clear almost cloudless day there were over 35 vehicles stopped with us on north bound side of road with about 10 vehicles stopped on south bound side there were 8 peopl that i talked to on my side of hwy that took 8mm movie of all or part of this sighting i esamate that 100+ people witnessed this eventwhen objet departed it climbed about 5000ft hovered for a few sec then accelerated back allong its approach path from its hover position until it sisappeared to space took about 30 sec fyi this is first time ive told any one except for 3 or 4 friends and of cource tey didnt belive oh yes later the next day i called flight service and the faa said they had no radar contact with any craft at that time of day in that area the faa would not tell me about any other reports this was a long time ago so it may not be of much interest"],"Object Shape":"Fireball, Sphere","Date of the Event":"07/08/1978 07:30 UTC","Country":"United States","Tags":"City","Case Number":"34228","Disposition":"Unresolved","Weather Factors":"Unknown","Date Submitted":"12/20/2011 07:25 UTC","Source":"MUFON","Region":"Wyoming","Object Features":"Other","Latitude":"43.077928","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"00:30:00","Summary":"EXTREMELY LARGE OBJECT OVER ONE MILE DIA. DECENDED FRM ORBIT? LANDED/APPROX 7 SMALL OBJECTS EXITED LGE OB. FLEW N.W. AT HI SPEED 5MIN LATER RETURNED TO LGE OB MADE 1 ORBIT OF LGE OB ENTERED LGE OB /LGE OB ASCENDED 5000 FT HOVERED THEN HOVERED ---","map":"<A HREF = \"http://maps.google.com/maps?q=43.077928,+-107.281124(34228)&iwloc=A&hl=en\"> mufon case (34228) map </A>","City":"S.E. OF WIND RIVER CANYON","Log Number":"US-12202011-0010","Longitude":"-107.281124","files":["/var/www/straped/mufon/html2text/34228.html.txt","/var/www/straped/mufon/org/34228.html"],"Viewing Distance":"Over One Mile"}