{"Source":"MUFON","divs":["Sighting DetailsFor the second night in a row I observed a multi-lighted (sequentially flashing red, blue & white edge lights and a white center light) object hovering in the western sky very near my house. I live about 5 miles from the Gulf of Mexico and this object, on Dec. 17, 2011, was quite a way out over the water. I first saw it at around 7:00 pm and observed it for about 15-20 minutes. At 8:00 pm I went out to look for the object again but it was no longer there. Last night (Dec. 18, 2011) I went out at 6:17 pm to see if the object had returned and there it was! It was much closer to my house this time and much brighter. I remained outside observing the object for approximately 15 minutes (I took pictures with my iphone on both nights). I went back to the house and retrieved a pair of low power binoculars. They helped to more clearly see the flashing multi-colored lights. At 7:00 pm I again went out to check on the object. It was still there, however, it had moved much further out over the water of the Gulf. I returned to my house after 5 minutes of observation. At 8:00 pm I again went out to see the object, but it was no longer there. This is not my first sighting. When I was 16 y.o. I witnessed, on a clear September night in Massachusetts, an object that flashed across the sky, stopping instantly, then changing directions several times, then flying off at unbelievable speed. I am now a 66 y.o. retired Healthcare Administrator."],"Object Features":"None","City":"Seminole","files":["/var/www/straped/mufon/html2text/34221.html.txt","/var/www/straped/mufon/org/34221.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.858484,+-82.792971(34221)&iwloc=A&hl=en\"> mufon case (34221) map </A>","Date of the Event":"12/18/2011 06:17 UTC","Case Number":"34221","Log Number":"US-12202011-0004","trends":["There have been 8 other sightings in Seminole","There was one other sighting in Seminole on or around December 18th 2011"],"Latitude":"27.858484","Object Flight Path":"Stationary","Object Shape":"Unknown","Tags":"City","Longitude":"-82.792971","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Summary":"Multi lighted UFO seen hovering near the shoreline in Seminole Florida","Date Submitted":"12/20/2011 09:53 UTC","Disposition":"Unresolved","Country":"United States","Region":"Florida"}