{"map":"<A HREF = \"http://maps.google.com/maps?q=30.634157,+-96.327307(34220)&iwloc=A&hl=en\"> mufon case (34220) map </A>","Summary":"not r/c helicopter moved randomly but possible in patern, unusual natural movements","Source":"MUFON","Date of the Event":"10/10/2010 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/34220.html.txt","/var/www/straped/mufon/org/34220.html"],"City":"College Station","Latitude":"30.634157","Country":"United States","Case Number":"34220","Tags":"City","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Longitude":"-96.327307","Region":"Texas","Object Flight Path":"Path with directional change","Date Submitted":"12/20/2011 02:32 UTC","divs":["sighting detailslate night after a college football game, i have three videos on my iphone and can be see on youtube titled [title redacted\\cms\\tg] with the username [username redacted\\cms\\tg]. friends were at my house with the normal drinking amount for any college student of age. it was later in the evening around 2 am so it was 10-10-10 at that time. my friend noticed a bright light that did not look to far but at the time to far to think anything of. then another light appeared and they seem to move aroun each other in no manner a human operating a flying electronic copter could possible maneuver, and really what pro rc flyer is out on a saturday at 2am flying his plane. although since my posted video on youtube i am starting to see more actually rc planes fly astound the same area with the same colors in my video. after witnessing that makes me believe that they might be doing that to settle the media, because there is a clear diference in the movements and smooth flow the lights saw compared to the rc planes flying around. check out the youtube videos and witness for yourself."],"trends":["There have been 10 other sightings in College Station","There were no other sightings in College Station on or around October 10th 2010"],"Disposition":"Unknown","Log Number":"US-12202011-0003","Object Shape":"Circle"}