{"Object Shape":"Bullet, Missile, Cigar, Flash","Source":"MUFON","Country":"United States","divs":["sighting detailsi went out my front door this morning (0625 hrs) to look at the sky before my shower since this is when alot of activity has been happening (alot of \"strange\" orbs have been appearing within this last week right before dawn). i noticed 2 bright red orbs flying across the sky from ne to sw (from the cupertino quarry\\san jose area towards morgan hill). as it flew by my condo and off towards morgan hill i noticed that it appeared as if the orbs were \"attached\" to each other, but spaced apart at about the size of a chopper. the first orb stayed solid red, and the back orb flashed solid red at 1 second intervals. it had a chopper sound to it, and made navigational curves (not quite turns, but curving to change directions). as i watched it, i was looking specifically for white or blue lights thinking it might just be a chopper, but no other lights ever appeared, even with the navigational direction change. after it left my viewing area, i noticed that pacing behind it was a sjpd chopper about 45 degrees above it, and about 1000 feet behind. (we see alot of police chopper activity at night, so i know what their bird looks like.) it just paced at the same speed and was folloing the object. i didn't have time to get the digi camera or video cam out, so i just watched."],"Case Number":"34224","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-121.941366","Date of the Event":"12/20/2011 06:25 UTC","Object Flight Path":"Path with directional change","Latitude":"37.2647","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"12/20/2011 11:25 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.2647,+-121.941366(34224)&iwloc=A&hl=en\"> mufon case (34224) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/34224.html.txt","/var/www/straped/mufon/org/34224.html"],"Summary":"2 Red Balls of Light, Back on Flashing","City":"Campbell","Region":"California","trends":["There have been 7 other sightings in Campbell","There were no other sightings in Campbell on or around December 20th 2011","This sighting has never been favorited.",""],"Object Features":"Unknown","Log Number":"US-12202011-0007"}