{"Source":"MUFON","Weather Factors":"Unknown","Case Number":"34233","files":["/var/www/straped/mufon/html2text/34233.html.txt","/var/www/straped/mufon/org/34233.html"],"Disposition":"Unresolved","Date of the Event":"12/20/2011 10:00 UTC","Date Submitted":"12/21/2011 12:02 UTC","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around December 20th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.986515,+-93.260606(34233)&iwloc=A&hl=en\"> mufon case (34233) map </A>","Summary":"Starlike, flashing three corners - Red, Blue, Green, Yellow, white in the middle.","Object Features":"Unknown","Log Number":"US-12212011-0001","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI first saw the object at 10:00 PM, CST, It is SSE of my position hovering in the sky. I'm approximating above Minneapolis, MN. At first glance I thought it was a bright white star until I noticed it flashing Red on the left, green on the left and yellow on the bottom. I rushed for my binoculars (10 x 50) and viewing it with the the flashing lights are much more pronounced. It's 10:40 PM now and it's still there. It's position is about half way between the Orion star group and the horizon. For all I know it could be in orbit but, it's not moving like a satellite tracking across the sky. It's 10:45 now and it's still there. It's tracking with Orion. It could be in geosynchronous orbit maybe. Several planes were flying toward from it from the west but veered off. Three that I noticed. There is airplane activity nearer the ground, to far away to tell what type, I think there's a small airport near Fridley, or Crystal, MN. It's almost out of view of my window now. I'm pretty sure it's in orbit now, still tracking with Orion, still flashing different colored lights. It must be huge if it's in orbit and I can see lights flashing with my binoculars."],"City":"Minneapolis","Tags":"City","Region":"Minnesota","Longitude":"-93.260606","Object Shape":"Star-like, Triangle","Latitude":"44.986515"}