{"Country":"United States","Summary":"Huge Black Triangle UFO with Red, White, and Green Alternating, Pulsating Lights at Corners Hovering Over Elkridge","City":"Elkridge","Source":"MUFON","Object Features":"None","Weather Factors":"Unknown","Log Number":"US-12212011-0002","Date of the Event":"12/20/2011 11:08 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","divs":["sighting detailsi know what i saw is a ufo. i was driving eastbound down marshalee drive in elkridge, md tonight towards montgomery road (on 12\\21\\11) a little after 11:00pm (probably 11:08pm) next to timbers at troy golf course. i was the only car on the road until half way through my sighting. out my windshield over a large parking lot to my left i see a huge basketball sized shiny black triangle craft that was not a helicopter with randomly alternating red, white, and green lights on the corners and i slowed my truck to about 15 mph. the lights seemed to be purposely changing to deceive the eye as it was hard to follow the craft. the ufo also had a box-shaped structure behind it which followed its every move and looked as though it was connected to the triangle facade. the ufo was extremely low to the ground, i would say roughly 500 feet. as i drove towards the object and sped to about 30 mph, i reached down for my cell phone then looked up and saw the object seem to change shape to become very skinny, almost in the form of a sideways view of the traingle, then the craft rocketed across my windshield in three seconds finishing to a floating stop (changing directions from left to right in my perspective). the craft relocated unbelievably quickly. the ufo then hovered over route 100 east and at this time our pace was about 1\\4 mile before the exit to get on route 95 south as marshalee drive runs directly parallel to rt. 100. the craft followed me side-by-side like it was tracking me until two cars got closer behind me. the ufo then changed it's path to relocate back to marshalee drive over top of my truck when i got almost to the left bend of the road to head towards montgomery road. i bent my body over the passenger's seat to track the ufo and caught a quick glimpse of the object before it dissapeared in mid air. this sighting lasted no more than one minute and it appeared the people in the cars behind me also saw the craft because they were driving under the speed limit about three car lenghts behind me. i have always wanted to see a ufo and i am absoultely convinced that what i saw tonight was the product of an unidentifiable flying object. no object build by man could travel the way that triangle object moved. either the goverment knows what appeared in the maryland skies tonight or that was an alien craft or maybe santa is real. my money is on the government running missions with aliens."],"Case Number":"34234","Date Submitted":"12/21/2011 01:00 UTC","Latitude":"39.203776","map":"<A HREF = \"http://maps.google.com/maps?q=39.203776,+-76.769332(34234)&iwloc=A&hl=en\"> mufon case (34234) map </A>","files":["/var/www/straped/mufon/html2text/34234.html.txt","/var/www/straped/mufon/org/34234.html"],"Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Elkridge","There were no other sightings in Elkridge on or around December 20th 2011"],"Longitude":"-76.769332","Region":"Maryland","Object Shape":"Triangle","Disposition":"Unresolved","Tags":"City","Viewing Distance":"501 Feet - 1 Mile"}