{"Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"12/18/2011 07:30 UTC","Country":"United States","Case Number":"34230","Disposition":"Unresolved","City":"Seminole","Object Flight Path":"Hovering then path","Tags":"City","divs":["Sighting DetailsI was walking with a friend and his dog at night about 7pm or so on Sunday, Dec.18, 2011, when about a block from returning home I noticed some stars above, not a whole lot, but did notice a star moving horizontally. It didn't move fast or far horizontally, but slow. I decided to get my cell phone and zoom in to take a picture, then also captured in video. I was astonished to see how this star was moving erratically side to side, up and down, disappearing and glowing. Well it may have been about 15-20 minutes that my friend and I was just watching the object when I went home to get my jacket and someone else to look at what we were looking at. It was another 10 minutes before we went home and about 10 minutes later we sought to see this object again, but by now it was farther out at a distance and hard to get a visual as we did previously. In addition, at the very same time on Monday, I notice that same star in within the same area and after a half hour or so, it moved away far into the distance."],"Summary":"Saw unusual star moving horizontal stopped to get a picture & video zoomed in a much as cell phone would allow.","map":"<A HREF = \"http://maps.google.com/maps?q=27.867345,+-82.786454(34230)&iwloc=A&hl=en\"> mufon case (34230) map </A>","Latitude":"27.867345","Longitude":"-82.786454","trends":["There have been 8 other sightings in Seminole","There was one other sighting in Seminole on or around December 18th 2011","This sighting has never been favorited.",""],"Object Features":"None","Viewing Distance":"Unknown","Object Shape":"Circle, Disc, Sphere, Star-like","Region":"Florida","Sighting Duration":"Undisclosed","Log Number":"US-12202011-0012","files":["/var/www/straped/mufon/html2text/34230.html.txt","/var/www/straped/mufon/more/34230_submitter_file1__2011-12-18_18-53-19_50.mp4.jpg","/var/www/straped/mufon/more/34230_submitter_file2__2011-12-18_18-40-44_611.jpg","/var/www/straped/mufon/org/34230.html"],"Date Submitted":"12/20/2011 10:03 UTC"}