{"Object Shape":"Cone, Flash, Sphere","Longitude":"-85.319364","files":["/var/www/straped/mufon/html2text/34244.html.txt","/var/www/straped/mufon/org/34244.html"],"Case Number":"34244","Log Number":"CA-12222011-0005","divs":["Sighting DetailsI was outside my construction trailer guarding the HydroOne site. It is a 230 KV transformer site. I was working as a security guard, guarding a 55 acre site. The site is surrounded by a mond or tiny hill, fields, and a dirty road. It was 0813 p.m. when i first heard a whirling noise over a Hydropole. Immediately i realized it as a strange object. The object looked like a sausor or conical shape whirling and coming down from east to west with a height of over 100 to 200 feet. Immediately i took my Sony DigiHI8 camera and filmed the object. The object travelled east to west, then hit and travelled through the hydro lines, and then flew towards north where my trailer is situated, passed again by descending the hydro lines of over 100 feet and came and hit the trailer and a loud bang is heard. The object pulsated and gave beams of light and flew away towards east. After i checked the video footage in slow motion it appeared the object has passed into the trailer. When it passed into the wooden trailer the light appeared like a mushroom. I was shocked and amazed what that tiny object could be. Is it a probe? or exterrestrial craft or how can it pass through 430 volts hydro lines and enter the trailer from roof and fly away?. After it flew away i zoomed the camera as much as i can and the video came very good. The video is very stable because of the old Sony DigitalHi8 camera. ** Please analyze my video and let me know what it is. I have observed this phenomenon on this site more than once. I do not want anything but only my name. Thanks. Narendra."],"Summary":"It appreared suddenly whirling and descending, passed through hydro lines, and hit the construction trailer and entered it and cameout and flew away. The object is about 1feet. Video taken with a Sony DigiHi8 camera with date time stamp.","Weather Factors":"Unknown","Date Submitted":"12/22/2011 09:28 UTC","Tags":"City","Source":"MUFON","Viewing Distance":"20 Feet or Less","Date of the Event":"01/26/2009 08:13 UTC","Region":"Ontario","Country":"Canada","Object Features":"Patterned Surface, Wings","Sighting Duration":"Undisclosed","City":"Undisclosed","Object Flight Path":"Undisclosed","Disposition":"Unresolved","Latitude":"51.256465","map":"<A HREF = \"http://maps.google.com/maps?q=51.256465,+-85.319364(34244)&iwloc=A&hl=en\"> mufon case (34244) map </A>","trends":[""]}