{"Latitude":"37.02403","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34247.html.txt","/var/www/straped/mufon/org/34247.html"],"Source":"MUFON","Case Number":"34247","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Date Submitted":"12/22/2011 03:52 UTC","Summary":"glowing very very brightly. Very rapid movement abruptly south then an immediate take off upwards out of sight.","Country":"Portugal","Log Number":"PT-12222011-0008","Weather Factors":"Unknown","Object Features":"None","Tags":"City","Region":"Faro","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","divs":["Sighting DetailsI was driving home on a semi busy road here in the algarve Portugal, which is surrounded by mountains. The mountains are not large like the ones in British Columbia but large none the less. I saw a very bright light which the only other thing that high up could have been is the front end of an airplane with the front headlight pointed exactly towards where I was driving behind other cars heading home. There is an airport not to far away in the city of faro, which is where I was leaving. Being here a while now I can generally tell the flight patterns and with this wide open sky I can differ from certain types of planes and helicopters.. Anyway.. This particular light I saw was near dusk and lower than any normal star and brighter than normal. I was mentioning the mountains before because that is what I am using as a reference. The light was not much higher than the mountain and I kept my yes on the road but constantly looking at the light which I noticed it move a bit back and forth. It was basically almost straight ahead of me at this point about 5 miles ahead or so when suddenly it veered at a super speed and still lit about a mile south or so then instantly took off upwards and it was gone. The catch is that I've now seen it 3 night in a row. Today I got off work at 3pm and did some errands reached home here about 6. I saw it again tonight and when I came inside to grab something the light which I've seen now for the last few night was basically in the same sort of area and when I came back outside it was gone. I know it was what I saw the last few nights because of the location. This week I am going to purchase a good night vision video camera because with this big open sky that I have above me I would like to get some get some great video of this. If you have any questions please feel to call my cell phone or email me. With the phone numbers that I left you do not include area codes, just the straight numbers. Thanks."],"Date of the Event":"12/22/2011 12:00 UTC","Longitude":"-7.931573","City":"Faro","trends":["There has been one other sighting in Faro","There were no other sightings in Faro on or around December 22nd 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.02403,+-7.931573(34247)&iwloc=A&hl=en\"> mufon case (34247) map </A>"}