{"Object Shape":"Cigar, Cylinder","Case Number":"34245","Weather Factors":"Unknown","Disposition":"Unknown","Longitude":"-74.646172","Latitude":"40.518412","Source":"MUFON","City":"Hillsborough","Viewing Distance":"Unknown","Summary":"Cigar/Rod shaped UFO moving rapidly across sky with no sound and HUGE in NJ !","Sighting Duration":"00:00:30","Object Features":"None","Region":"New Jersey","Log Number":"US-12222011-0006","divs":["sighting detailslast night(dec.20th)in hillsborough, nj, my husband and i were outside on the porch at approximately 1:25 am, and something caught my eye. it was definitely rod\\cigar shaped, moving quickly across the sky. it looked like a thin cloud layer, but it was a definite structure, and completely silent. it appeared to be huge from our observation..with arm's length out straight, it appeared about 2 inches tall from top to bottom. it was headed southwest-ish, and went between jupiter and orien. it was about as high as jupiter was in the sky at the time. i have witnessed ufos before around here, but never seen anything like this!! unfortunately, it went by too fast, and we were not able to get any pictures or footage. i am thankful my husband had also seen it, so i know i wasn't imagining it! we lost sight of it after a few seconds due to some cloud coverage. my husband also claims afterward, he had a ringing sound (like crickets) in his ears. i did not experience that myself. we definitely felt it was not man made..there was no mistaking this for a plane!!"],"Date of the Event":"12/22/2011 01:25 UTC","Date Submitted":"12/22/2011 11:10 UTC","Object Flight Path":"Straight-line path","Tags":"City","files":["/var/www/straped/mufon/html2text/34245.html.txt","/var/www/straped/mufon/org/34245.html"],"Country":"United States","trends":["There have been 8 other sightings in Hillsborough","There were no other sightings in Hillsborough on or around December 22nd 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.518412,+-74.646172(34245)&iwloc=A&hl=en\"> mufon case (34245) map </A>"}