{"Object Shape":"Sphere","Source":"MUFON","Viewing Distance":"Over One Mile","Region":"Texas","Log Number":"US-12222011-0001","files":["/var/www/straped/mufon/html2text/34240.html.txt","/var/www/straped/mufon/org/34240.html"],"Tags":"City","Case Number":"34240","City":"Greenville","Longitude":"-96.113305","Latitude":"33.098839","Country":"United States","Date of the Event":"01/25/2008 09:00 UTC","trends":["There have been 7 other sightings in Greenville","There were no other sightings in Greenville on or around January 25th 2008"],"Summary":"My boyfriend and I saw a very bright sphere hovering to the South East East from our apartment patio. It was there for about 2-3 weeks.","map":"<A HREF = \"http://maps.google.com/maps?q=33.098839,+-96.113305(34240)&iwloc=A&hl=en\"> mufon case (34240) map </A>","Object Flight Path":"Stationary","divs":["sighting detailsmy roommate and i went out to sit on our apartment patio to smoke. we immediately both saw a glowing sphere in the sky southeasteast of greenville, tx. it was about half the size of the moon when full. if you held your finger and thumb up where it was about an inch and a half in diamter. it did not move but had very unusual glowing coloring, king of changing color of yellow\\red\\gold sometimes showing an aura that was dark red around the sphere, then sometimes it looked bluish white. it did not pulsate but the colors changed, making it appear to twinkel. it was a little hard to look at it because it was so bright. we watched it for about 2 hours; the next night it was there again. the 2nd night we watched it for 3 hours. it was there every night for 2-3 weeks. it never moved at all but its glow did change and the shape changed a little due to the aura that was around the edge. the aura changed shape but was definitely a different color that the sphere inside of it. we tried to find out on the dallas metroplex tv media if anyone else had seen it; they did report it on wfaa channel 8 evening news, but they never said whether it was determined to be a known object or not. later i found out through talking to people here in greenville that they saw it as well, and apparently it was visible 50 miles away in dallas, according to wfaa. i don't of anyone ever explaining what this object was, but it was like nothing i have ever seen and we could not take our eyes of it. i could not stay up late enough each night to see where it went or if it just disappered."],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"None","Sighting Duration":"03:00:00","Date Submitted":"12/22/2011 01:19 UTC"}