{"Source":"MUFON","Weather Factors":"Unknown","Region":"California","City":"Los Angeles","Disposition":"Unresolved","Log Number":"US-12232011-0004","files":["/var/www/straped/mufon/html2text/34258.html.txt","/var/www/straped/mufon/org/34258.html"],"Summary":"Long expanding blue colored trail that slowly then quickly expanded then disappeared after a quick flash.","Latitude":"34.238703","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.238703,+-118.520198(34258)&iwloc=A&hl=en\"> mufon case (34258) map </A>","Date of the Event":"12/23/2011 06:30 UTC","Sighting Duration":"Undisclosed","divs":["sighting detailsi was driving up interstate 5 in southern california around the northridge area around 6:30am today december 23rd, 2011. i could see in the distance what at first i thought was a meteor almost directly in my sight path. it reminded me of when someone locks up their brakes and leaves 2 distinct solid trail marks. but these trail marks were an unsual glowing blue parrallel to each other. both trails started to expand slowly and suddenly moved rapidly in a straight line. both lines were a solid color that did not fade at either end. then there was a quick blink\\flash and instantly the solid lined blue trails instantly disappeared. i have seen meteors before but this was nothing like it. there is no way i'm the only one to see it because it was in the sight path of a lot of commuters. the whole event lasted probably about 15 seconds. my jaw just dropped and was dumbfounded about what had just happened for the next few hours. this isn't the first time i've seen strange lights in this area."],"Object Shape":"Flash, Unknown","Case Number":"34258","Object Features":"Unknown","Object Flight Path":"Straight-line path","Country":"United States","Date Submitted":"12/23/2011 05:29 UTC","Viewing Distance":"Over One Mile","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around December 23rd 2011"],"Longitude":"-118.520198"}