{"Latitude":"38.308304","trends":["There have been 17 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around December 22nd 2011"],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Longitude":"-77.45594","Object Shape":"Triangle","Case Number":"34254","Summary":"Triangular Shaped Craft Over Stafford, VA","Object Features":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.308304,+-77.45594(34254)&iwloc=A&hl=en\"> mufon case (34254) map </A>","divs":["sighting detailsi was asleep and woke to a buzzing sound and snapping of static electricity in my room and around me. the buzzing sound seemed to be in the room with me. i looked at the clock and it as 5 am (12\\22\\2011) -- stafford, va. i went to the window and looked upward and saw a large dark traiangluar shaped craft slowly passing overhead in a south to northern direction. there was a bright white light on each corner and the craft traveled with one point forward. a red blinking light could be seen on the bottom of the craft. the craft seemed to be making no noise whatsoever but creating a hum in my bedroom and lots of static electricty (my hair stood on end). i woke my mom and she looked out the window to see it hovering over the trees about 270 feet away (about 10' over the trees). i figure the width of it as it passed overhead and over the trees was about twice the size of the back (widht of the homes behind my home) or about 120 ft. i didn't get a photo though had my cell phone with me. i didn't have my video camera battery charged. but charging it now in case there is a repeat. odd thing. my dog, boomer, a 125 lb yellow lab slept through this even though i was up and yelling at mom to take a look, etc. the dog never acts this way... very vigilant... but he kept quiet or stayed asleep. i could do a sketch. so could my mom. i could map the path it took while in my view to a great degree of accuracy."],"Object Flight Path":"Straight-line path","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34254.html.txt","/var/www/straped/mufon/org/34254.html"],"City":"Fredericksburg","Date of the Event":"12/22/2011 05:00 UTC","Date Submitted":"12/22/2011 11:44 UTC","Tags":"City","Log Number":"US-12222011-0015","Region":"Virginia","Sighting Duration":"Undisclosed"}