{"Object Features":"Other","City":"New York","divs":["Sighting DetailsI am normally a skeptic regarding UFO's and generally am the first to explain away some event. However I have spent the whole night looking for explanations and I can't seem to find anything or any additional reports. I live in New York City in Midtown Manhattan. I was sitting on top of my rooftop just hanging out with my friend while she smoked a cigarette. All of a sudden we both saw these dullish lights start fading into view at about 65-75 degrees in the sky. We kind of blew it off due to the fact that there was some slight cloud cover. It was whitish light in small blotches similar to the lights over Phoenix sky several years ago that I saw on the news. Suddenly a small orb seems to shoot out around the object and made a very quick and sudden movement then faded from view. This object looked like a star moving...or some sort of small craft. Then about 15 minutes passed while we waited and tried to figure out a way to take some pictures or video. We have no way to take night photos or video because we both only had an iphone and blackberry. Then a bright flash came down from the sky above the Alliance building in NYC sort of like a meteor . It looked like it was falling into the city but may have fallen past the city line but it really was a bright bright white ball that didn't have a tail. Then about 5 minutes later the circular shaped dull lights started to fade into view directly above our heads high in the sky. They were fairly bright at this time, and extremely obvious. They stayed in place for about 15 minutes but would occasionally shine in and out, changing the overall shape. Sometimes it would appear as a circle, sometimes it would appear as a circle with a small tail. It almost appeared as a set of constellations in the sky. It was actually incredibly beautiful, and we keep checking the news in hopes that other people were watching skyward. We checked later to see if there was some event that took place in the city but there is nothing that can explain what we saw. We know there is the Ursa Minor meteor shower at peaks tonight, but that would only explain one part of the phenomenon we experienced. To add, several planes were scrambled and passed over the general area in the sky. Two non commercial jets and a high altitude plane that came out of nowhere. However this is NYC and it can get really busy with planes during the holiday season. This still doesn't explain the lights. Afterwards we just felt like we had experienced something really life changing and actually we both felt a bit scared. We are not really sure who else to bring this information to because this is our first time doing something like this, but we are sure of what we saw. We have gone back outside to see if the lights have come back but its now raining and impossible to see anything. We will check again tomorrow night."],"Date of the Event":"12/22/2011 08:30 UTC","Region":"New York","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around December 22nd 2011"],"files":["/var/www/straped/mufon/html2text/34255.html.txt","/var/www/straped/mufon/org/34255.html"],"Object Shape":"Sphere, Star-like, Other","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Case Number":"34255","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Longitude":"-73.985647","Log Number":"US-12232011-0001","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.762915,+-73.985647(34255)&iwloc=A&hl=en\"> mufon case (34255) map </A>","Latitude":"40.762915","Summary":"Multiple lights in circular pattern shining above NYC followed by bright object falling","Source":"MUFON","Date Submitted":"12/23/2011 01:32 UTC","Disposition":"Unresolved"}