{"Region":"Washington","City":"Yakima","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Star-like","trends":["There have been 15 other sightings in Yakima","There were no other sightings in Yakima on or around December 23rd 2011"],"Latitude":"46.613267","Object Flight Path":"Path then hovering","Viewing Distance":"Over One Mile","Tags":"City","Summary":"Five bright objects moving NW to SE then hovered just SW of my home for appx ten minutes. More appeared then disappeared one by one.","Object Features":"Unknown","Date Submitted":"12/23/2011 05:35 UTC","Longitude":"-120.537679","Case Number":"34257","map":"<A HREF = \"http://maps.google.com/maps?q=46.613267,+-120.537679(34257)&iwloc=A&hl=en\"> mufon case (34257) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/34257.html.txt","/var/www/straped/mufon/org/34257.html"],"Log Number":"US-12232011-0003","divs":["sighting detailsat 12:30 am, i exited my house into the backyard to let my dogs out to go potty and out of corner of my eye i saw 5 lights in the sky. i took my cell phone out to take a picture and ran back into house to notify my partner to come outside and witness this event. then we went outside to the front of the house and they were still there hovering. right after we got out there, more of them appeared... close to ten of them. they were all hovering but some were stationary and others moved around slightly in relation to the others. they formed shapes like a big dipper shape. then they started disappearing. when there were three left, the three formed a triangle shape. an additional lone object approached the hovering ones. the hovering ones disappeared, and the approaching one was nearer to us than the hovering ones had been. my partner had no coat on and was desperate to get warm and went in the house. then the last object disappeared so i went back into the house. i knew it was ufo objects because i saw two of these same objects just two months ago and we looked at some documentaries about ufo sightings to see what other people were seeing at night, and the bright star- like objects were exactly what we saw both today and two months ago. in both cases, the objects approached within a few miles of our residence and flew over\\ hovered until disappearing. first, i felt shock to see what i was seeing... like i couldn't believe it but it is was real. i felt afraid and nervous that something bad may happen to my family. i wondered what they were doing and why. i did not like not knowing. it was confusing. i took a digital image of the objects when i first saw them in the back yard... then both my partner and i took numerous short videos of them in the front yard. i can send these but it's late and i need to get some sleep... but would be glad to send them maybe later today or tomorrow. they were made on cell phone, but may be useful."],"Date of the Event":"12/23/2011 12:00 UTC","Sighting Duration":"Undisclosed"}