{"Summary":"8 to 10 UFO's flew past our house.","Weather Factors":"Unknown","Log Number":"US-12232011-0008","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Fireball","Date of the Event":"12/23/2011 06:17 UTC","divs":["Sighting DetailsI walked out my front door this evening to go Christmas shopping and when I walked out the front door, I saw a large glow eye level coming around from the South of my house moving to the Northwest. It was moving parallel to the ground, elevation about 200ft. above ground for about a half mile then going much higher in the air,almost straight up. When I looked up into the sky in the direction it was going, I saw three lights evenly spaced in a triangle shape. The center light of the three was pointed to the North. At that point of time I opened the front door and shouted at my two boys and wife to come see this. By the time they got out side, their was between 8 to 10 more of these fire balls flying the same path. It was then I called (911) and spoke with the dispatcher explaining to him what we were seeing. At first when I was speaking to him, I told him I didn't know what they were, then I said they maybe flairs, but I believe I finally told him that they weren't, after seeing them all running parallel with the ground and taking the EXACT same path, at the triangle light much higher up. It was as if they were flying into it. The dispatcher asked me what direction they were from what intersection. I told him and he said he would have somebody check into it. I spoke with him at 6:17pm. Haven't ever seen anything like this, and no more activity since this happened. By the time I had gotten off the phone they had all disappeared. This was pretty exciting, and amazing!"],"Tags":"City","Object Features":"None","Longitude":"-97.801369","Case Number":"34262","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.752113,+-97.801369(34262)&iwloc=A&hl=en\"> mufon case (34262) map </A>","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34262.html.txt","/var/www/straped/mufon/org/34262.html"],"Latitude":"32.752113","Sighting Duration":"Undisclosed","City":"Weatherford","trends":["There have been 9 other sightings in Weatherford","There were no other sightings in Weatherford on or around December 23rd 2011"],"Source":"MUFON","Date Submitted":"12/23/2011 09:27 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering"}