{"Region":"California","Tags":"City","Viewing Distance":"101-500 Feet","Date of the Event":"12/22/2011 12:00 UTC","Country":"United States","Disposition":"Unresolved","Date Submitted":"12/24/2011 06:13 UTC","Object Shape":"Cigar, Triangle","Log Number":"US-12242011-0002","Object Features":"Undisclosed","Source":"MUFON","divs":["sighting detailsthe date was 12\\22\\11 time was between 12:00-12:20am i was in the passenger seat and we were leaving elk grove we got on i-5 north heading towards downtown sacramento. we were about four miles from where the freeway merged with 50\\80 and it happened to be a clear night, i looked to my right and saw five red orbs in the sky. the orbs were not blinking at all just solid red glowing balls. i have been on this freeway thousands of times and never seen anything like it. i assumed it must have been a tower or something that i had just not seen before. the light also seemed to be moving but i could not be positive since i was in a vehicle at the time. the lights were in a semi triangle\\ cigar shape. i lost sight of the objects as we merged onto 50 and exited the freeway onto broadway. another thing that was weird about 5 min later when we got to my house my coworkers car died the randomly started up again about 10 min later. she took her car to the mechanic and he could not find anything wrong with her car. the next night when i left work around the same time which happened to be a clear night i looked to see if i could see the lights again and there was nothing there."],"files":["/var/www/straped/mufon/html2text/34266.html.txt","/var/www/straped/mufon/org/34266.html"],"Latitude":"38.585822","Weather Factors":"Unknown","Summary":"5 Red Orbs in the sky","Sighting Duration":"Undisclosed","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around December 22nd 2011","This sighting has never been favorited.",""],"Longitude":"-121.49121","map":"<A HREF = \"http://maps.google.com/maps?q=38.585822,+-121.49121(34266)&iwloc=A&hl=en\"> mufon case (34266) map </A>","City":"Sacramento","Object Flight Path":"Stationary,Path with directional change","Case Number":"34266"}