{"map":"<A HREF = \"http://maps.google.com/maps?q=64.786596,+-147.906061(34267)&iwloc=A&hl=en\"> mufon case (34267) map </A>","files":["/var/www/straped/mufon/html2text/34267.html.txt","/var/www/straped/mufon/org/34267.html"],"Longitude":"-147.906061","Object Features":"Unknown","Latitude":"64.786596","Country":"United States","Log Number":"US-12242011-0003","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI live approximately 10 miles sw of fairbanks center city along the chenna river where it joins the tanana river. I was up early this morning becuase I did not plug in my vehicle and it is 15 below at this time. I went outside my cabin at 0200 hours to plug in my Jeep. It is a crystal clear night and I always take the time to observe the sky when it is clear. As I was outside, I noticed something that I have not seen before. It seemed to be a bright orb like object that was either flikering or pulsating blue and red lights. It seemed like it was hovering over the tanana river. It was kinda jerky in movement. It would hover with that jerky like motion for a while, then would clearly move. When I say clearly move, what I mean is that may cabin is surrounded by tall spruce trees, and as it would move I would have to relocate to see thru the trees. It would move and then hover with that jerky like motion. Not a sound. clearly pulsating blue and red lights. Initially it scared the crap out of me once I realized that I could not rationalize what I was looking at. I went inside, locked my doors, and turned on my outside lights. after about ten minutes, I went back outside and it was still in the same general area, doing the same thing I observed before. As I write this, it is 0246 hrs and it is clearly still out there. It seems to be over the river at a angle of about 20 degrees above the horizon. I tried to call the state Mufon Rep that lives about fifty miles from here in Nanana but did not have any luck. I then called the assistant state rep and was able to leave a message as I was observing the object. There was a second object noticed in a different location, but I focused on the one that I was able to clearly see. The Fairbanks International Airport is a few miles accross the river and I observe aircraft on a regular basis and am familiar with there flight patterns and charactoristics. This was no aircraft. The last time I went outside to check, I did see a obvious aircraft flying at a higher altitude. They are still there."],"Case Number":"34267","Summary":"Bright Object pulsating blue and red lights, hovering, moving, hoveriong over Tanana River Fairbanks","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Fairbanks","Object Shape":"Sphere","Tags":"City","Region":"Alaska","Date of the Event":"12/24/2011 02:00 UTC","Disposition":"Unresolved","Date Submitted":"12/24/2011 06:52 UTC","Weather Factors":"Unknown","trends":["There have been 9 other sightings in Fairbanks","There were no other sightings in Fairbanks on or around December 24th 2011"],"Object Flight Path":"Hovering then path"}