{"Date Submitted":"03/20/2005 02:25 UTC","Summary":"Not Provided","Tags":"City","Object Shape":"Undisclosed","Latitude":"43.040002","divs":["Sighting DetailsSighting Report: Something just flew over my damn house! I was outside on the porch with my son when an orb like object passed over my home. It was only there for a split second, but it was no damn plane. I am a deeply religous man, but what I saw today has no explanation. It was not a standard aircraft, it was almost circular with 4 or 5 lights, bright lights, the craft blended in with the dark sky, but those lights, they stuck out like sore thumbs. A couple of them were blinking if I remember correctly. It was big from what I saw, about the size of a commercial airliner. It was pretty low down, and as I said before it was there for only a second. It caught my eyes and I thought it was a plane or what not, but that thing was not human. I always laughed at those cooks on TV who reported UFO sightings, but I saw this with my own eyes. It seemed to just float above me for a split second then it was gone. I really wish I could explain it, I m sure there is some sort of explanation. I just know that I have never seen anything like it. I am a grown 45 year old man with 2 kids and a wife, I can vouche that my mind is stable. My 12 year old son saw it too and he recommended that I tell the news about it. I tried calling the local news but they pretty much called me a qwack and hung up on me. I know you are a respectable news agency and that hopefully you will believe my story. This whole fiasco happened about half an hour ago. Hopefully you get other reports or can confirm that it s just some sort of new air craft, but I am sure that what I saw was not human. It is cloudless outside, so i m sure it wasn t that. It happened around 7:45 to be exact, March 19th."],"Country":"United States","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-87.904754","Source":"MUFON","City":"Milwaukee","Date of the Event":"03/20/2005 02:25 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.040002,+-87.904754(3427)&iwloc=A&hl=en\"> mufon case (3427) map </A>","Case Number":"3427","Log Number":"","Viewing Distance":"Unknown","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/3427.html.txt","/var/www/straped/mufon/org/3427.html"],"trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around March 20th 2005"],"Region":"Wisconsin"}