{"City":"Springdale","Region":"Arkansas","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","trends":["There have been 4 other sightings in Springdale","There were no other sightings in Springdale on or around December 24th 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsAt around 8:30pm my wife and I observed between 7 to 8 fireball like lights in the sky above Northwest Arkansas(Springdale,Ar) on Dec 24th, 2011. The first light was maybe a mile or so in front of the second set of three, then a 4th and 5th and then a 6th and 7th came from the west. They traveled East for a few seconds then began to turn upwards and south and faded quickly. There are no airports in that direction and we couldn't hear anything (ie a helicopter or plane) they were low enough that had they been a plane or helicopter we should've been able to hear engine noise. They also flew in the same flight path, they were in a straight line and then the set of three split into a triangle pattern before fading away. They were all red and flew in a straight line. The objects were round but in the pictures you can't see it too well, didn't have time to set up the tripod or set the settings for night pictures. I have a video of about a minute or two that's shows them better."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/34285.html.txt","/var/www/straped/mufon/more/34285_submitter_file2__IMG_0497.JPG","/var/www/straped/mufon/org/34285.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.168894,+-94.1731(34285)&iwloc=A&hl=en\"> mufon case (34285) map </A>","Country":"United States","Date of the Event":"12/24/2011 08:30 UTC","Source":"MUFON","Log Number":"US-12252011-0006","Summary":"7 fireball like lights in the Sky flying West to East the South again. They came in waves so to speak, 1 then a set of three and then in 2 sets of 2.","Latitude":"36.168894","Longitude":"-94.1731","Viewing Distance":"Over One Mile","Sighting Duration":"00:05:00","Object Shape":"Fireball, Sphere","Disposition":"Unresolved","Case Number":"34285","Date Submitted":"12/25/2011 12:08 UTC","Tags":"City"}