{"Log Number":"US-12252011-0009","Date of the Event":"12/24/2011 09:30 UTC","Object Features":"Unknown","Source":"MUFON","City":"Boise","Region":"Idaho","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.621471,+-116.208596(34288)&iwloc=A&hl=en\"> mufon case (34288) map </A>","Viewing Distance":"Unknown","Disposition":"Unresolved","Case Number":"34288","files":["/var/www/straped/mufon/html2text/34288.html.txt","/var/www/straped/mufon/org/34288.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy husband and I were outside on our deck hot-tubbing around 9:30pm MST on Christmas Eve. We like to star gaze and and watch planes fly overhead in the night sky. My husband noticed a bright red light high in the sky approaching from the east. He thought it was an airplane from the speed of its movement, but it had no sound or additional white blinking lights that we usually see on planes. It was just a single red sphere of light. It then stopped moving and hovered in the air. The night sky was very clear and the stars were quite abundant, and this object looked and twinkled like another large star except it was RED. It was a very vivid red, similar to laser light. The brightness of the color would fade some, then return to a brighter red, but in a random pattern that made it seem to pulsate. After staying stationary for a few minutes, it then moved in a northwestern direction which seemed towards us, as the size appeared to increase. Then it stopped again, hovered and pulsated for a longer time, maybe 10 or 15 minutes. We both were tossing around ideas what it could be, anything from a satellite, military craft from the nearby Air Force base, or even Santa Claus since it was Christmas Eve! As we were discussing this, I had the feeling that it was drifting closer to us which made me feel very uncomfortable, although my husband seemed merely curious. As we left the hot tub, we noticed the object was moving slowly again, returning towards the east where it came from. We went into the house but continued to observe the object from the backdoor. After another 10 minutes or so, it quickly picked up speed and flew away until we could no longer see it. Total duration of this event was roughly 35 minutes."],"Object Shape":"Sphere, Star-like","trends":["There have been 69 other sightings in Boise","There were 2 other sightings in Boise on or around December 24th 2011"],"Longitude":"-116.208596","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"43.621471","Summary":"Moving, then hovering, bright red star-like light","Tags":"City","Country":"United States","Date Submitted":"12/25/2011 04:30 UTC"}