{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/34281.html.txt","/var/www/straped/mufon/org/34281.html"],"Date of the Event":"12/24/2011 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.424406,+-105.076057(34281)&iwloc=A&hl=en\"> mufon case (34281) map </A>","Summary":"ME AND MY SON SAW SETS OF 3 RED PULSATING LIGHTS RISE STRAIGHT UP FROM THE GROUND.","Longitude":"-105.076057","Country":"United States","Source":"MUFON","trends":["There have been 18 other sightings in Loveland","There were no other sightings in Loveland on or around December 24th 2011"],"Sighting Duration":"Undisclosed","Log Number":"US-12252011-0002","divs":["Sighting DetailsAT 730 PM ON 12-24-2011 MY SON AND I WERE COMING HOME FROM THE STORE AND AS WE TURNED ON 42ND IN LOVELAND, CO. WE SAW THREE RED LIGHTS HOVERING OVER THE FOOTHILLS ALL AT DIFFERENT ALTITUDES. THEY WERE MUCH BIGGER THAN STARS AND STARTED MOVING IN DIFFERENT DIRECTIONS BUT CAME BACK CLOSE TOGETHER LIKE A TRIANGLE AND HOVERED AGAIN.THEY HOVERED FOR ALMOST A MINUTE THEN FADED OUT OF SIGHT. ABOUT FIFTEEN SECONDS LATER EITHER IN FRONT OF OR IN THE FOOTHILLS WHICH IS ABOUT 3 MILES FROM MY HOUSE, 3 MORE RED LIGHTS ROSE STRAIGHT UP FROM THE GROUND AND DID BASICALLY WHAT THE FIRST THREE LIGHTS DID BUT TIME WE WATCHED THES THREE LIGHTS FOR 3 TO 5 MINUTES. THE LIGHTS ALSO FADED OUT LIKE THE OTHER ONES BEFORE. AGAIN LIKE 15 SECONDS LATER THREE MORE LIGHTS ROSE STRAIGHT UP FROM THE SAME AREA BUT THIS TIME TWO OF THE LIGHTS WERE REALLY CLOSE TOGETHER AS THEY WERE RISING AND THE OTHER LIGHT WAS TO THE SOUTH LIKE A HALF A MILE IS HOW FAR IT LOOKED. THESE THRE ROSE UP THEN HOVERED FOR A COUPLE MINUTES THEN THEY ROSE UP HIGHER THAN ALL THE REST AND AS THEY WERE RISING THEY STRETCHED OUT HORIZONTALLY ABOUT A MILE APART AND PROCEEDED TO FLY WEST OVER THE MOUNTAINS TILL I COULDNT SEE THE LIGHTS ANYMORE. AT THAT TIME I PHONED A FRIEND WHO LIVES ONLY A MILE FROM THE FOOTHILLS AND SHE COULD SEE THREE RED LIGHTS AND THE LIGHT THAT WAS FURTHEST SOUTH WAS BRIGHTER THAN THE OTHER TWO BUT WERE DEFINITELY RED. TODD M. ALBRIGHT"],"Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"40.424406","Object Shape":"Sphere","City":"Loveland","Case Number":"34281","Tags":"City","Region":"Colorado","Date Submitted":"12/25/2011 12:15 UTC","Weather Factors":"Unknown","Viewing Distance":"Over One Mile"}