{"Region":"New York","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Brewerton","There were no other sightings in Brewerton on or around December 24th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.245682,+-76.122817(34299)&iwloc=A&hl=en\"> mufon case (34299) map </A>","divs":["Sighting DetailsI saw a yellowish to orange light that appeared star like traveling low in the sky moving east to west while driving with my wife to a friends house.it was a totally clear sky with stars. I stopped at a stop sign then we saw a second light following ,thinking they were helicopters i turned the engine on the truck off to listen to the sound there was silence as they continued west. my wife wanted to go so i continued about a block to my friend house still watching the lights as i drove i went in to call my friends out to see the lights. one was still there but further away and much higher in the sky {note i was traveling east all the while} Gary and Diedra saw the odd star like light immediately, it seemed to have stopped. as we watched on a commercial jet was coming in from the north at a lower altitude, before the jet came inline with the light it started to move again, suddenly it shot to the sky at a great speed and disappeared. Brewerton NY 7:30- 8:00 PM 12-24-11"],"Summary":"I saw a yellowish to orange light that appeared star like traveling low in the sky moving east to west while driving with my wife to a friends hous","Date of the Event":"12/24/2011 07:30 UTC","Object Flight Path":"Straight-line path","Object Shape":"Star-like","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/34299.html.txt","/var/www/straped/mufon/org/34299.html"],"Longitude":"-76.122817","Log Number":"US-12252011-0020","Date Submitted":"12/25/2011 08:17 UTC","Country":"United States","Case Number":"34299","City":"Brewerton","Tags":"City","Latitude":"43.245682","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile"}