{"Object Shape":"Undisclosed","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.203892,+-94.554677(3429)&iwloc=A&hl=en\"> mufon case (3429) map </A>","Region":"Missouri","Disposition":"Insufficient Data","Source":"MUFON","Date of the Event":"05/31/1997 05:45 UTC","Case Number":"3429","Latitude":"39.203892","Date Submitted":"05/31/1997 05:45 UTC","Summary":"Not Provided","trends":["There have been 8 other sightings in Gladstone","There were no other sightings in Gladstone on or around May 31st 1997"],"divs":["Sighting DetailsSighting Report: This sighting was in June of 1997 at Longview lake in Kansas City. About 5:45 am I was fishing with a friend who pointed out a spherical object hanging above the trees. It was a clear morning the sun was just rising over the tree line. I d just shut off my lantern. I was about 100 yards away when I first saw it but I moved to within 50 yards of the object. A perfect silver ball, about three meters in diameter. It did not make a sound. I approached the tree line to get a better idea of what it was and it moved over the top of us with instant speed, like when you move the light of a flashlight on a wall. Then it moved again at a sharp diagonal angle away from us. What was three meters became the head of a pin and than dissappeared, instantly. My friend and I told a couple of people about it and were ridiculed so we stopped telling the story altogether. I spoke to my dad (retired Air Force Staff Sergeant) who told me he , not only believed me but had also seen \"objects\" on many occations while he was in the service. He was also told never to discuss this outside of his security clearance. So I regret that I cannot tell you the stories that he told me. Please contact me, I ve waited a long time to tell this story to someone who might care."],"City":"Gladstone","files":["/var/www/straped/mufon/html2text/3429.html.txt","/var/www/straped/mufon/org/3429.html"],"Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-94.554677","Weather Factors":"Unknown","Log Number":"","Viewing Distance":"Unknown","Tags":"City","Object Features":"Undisclosed"}