{"City":"Feasterville-Trevose","Date of the Event":"12/25/2011 08:30 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"12/25/2011 10:49 UTC","Object Flight Path":"Straight-line path","Region":"Pennsylvania","Object Shape":"Oval, Sphere","trends":["There have been 3 other sightings in Feasterville-Trevose","There were no other sightings in Feasterville-Trevose on or around December 25th 2011"],"Source":"MUFON","Latitude":"40.146187","Summary":"4 Orange/Red Orbs traveling from the North West to the South East in a straight line then blinked out and vanished AGAIN!","Object Features":"Unknown","Case Number":"34305","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-75.001625","Log Number":"US-12252011-0026","Country":"United States","files":["/var/www/straped/mufon/html2text/34305.html.txt","/var/www/straped/mufon/org/34305.html"],"divs":["sighting detailsdriving home with my wife from a christmas dinner at my brothers we decided to look at christmas lights. at exactly 20:30 hours i told her to pull the car over quickly. she was unaware of what was going on until i told her to check out the orbs in the south east sky. the orbs were pulsating and moving at the speed of a cessna 150 which was about 120 mph. they were in a straight line. the first 2 were about a 1\\2 mile apart traveling in a straight line and no sound. the second set were about 2 miles behind the first two heading in the same direction and about the same speed. they started to pick up speed and the first two orbs just blinked out (vanished) and when the second set approached the same area also blinked out. we just looked at each other and couldn't believe it happened again. this is the third time in since september 16th that this has happened with the vanishing orbs. we keep looking around at the sky thinking that they would maybe reappear but they never reappeared. this is becoming very concerning to the both of us. what is going on?"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.146187,+-75.001625(34305)&iwloc=A&hl=en\"> mufon case (34305) map </A>"}