{"files":["/var/www/straped/mufon/html2text/34307.html.txt","/var/www/straped/mufon/org/34307.html"],"Country":"United States","Log Number":"US-12252011-0028","Date of the Event":"08/05/2011 07:30 UTC","Object Shape":"Circle, Fireball, Oval, Sphere, Unknown","Summary":"Glowing looking sphere and at the same time shining.","Object Features":"Patterned Surface","Longitude":"-77.481722","Object Flight Path":"Straight-line path","Source":"MUFON","Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=39.044957,+-77.481722(34307)&iwloc=A&hl=en\"> mufon case (34307) map </A>","Disposition":"Unresolved","City":"Ashburn","Viewing Distance":"21-100 Feet","Sighting Duration":"00:00:04","trends":["There have been 11 other sightings in Ashburn","There were no other sightings in Ashburn on or around August 5th 2011"],"Case Number":"34307","Latitude":"39.044957","Weather Factors":"Unknown","Tags":"City","Date Submitted":"12/25/2011 11:23 UTC","divs":["Sighting DetailsI was jogging one day from ashburn to leesburg on th bike trail. It was about seven thirty at night. I was listening to music when something talked to me through my mind. It told me to look to my right. As i turned to my right i saw this bright glowing ufo and at the same time it was shining. It was hovering maybe 50 to 100 feet in the air and about the same distance away from me. As i looked at it i had stopped and took off my earphones and just stared in amazement. The ufo was hovering without moving at all and was about 100ft to 150ft in length. It was right in front of me. It only let me look at it for 3 to four seconds. Then it blinked so fast it fanished streight in the deriction i was jogging. It was quick i knew it was'nt out of this world. My heart was pounding and i was scared. I was'nt sure what i saw but it was amazing. I then jogged quicker and faster like as if i was running. I did'nt know if it was there to get me or just let me see it with my own eyes. As i ran home i then believed 100% there is other life in the universe."]}