{"trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around"],"Region":"Missouri","Object Features":"Undisclosed","Country":"United States","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unresolved","Object Shape":"Undisclosed","Case Number":"3431","map":"<A HREF = \"http://maps.google.com/maps?q=38.633352,+-90.192294(3431)&iwloc=A&hl=en\"> mufon case (3431) map </A>","Summary":"Not Provided","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"","Longitude":"-90.192294","Date Submitted":"Unknown","Tags":"City","Date of the Event":"Unknown","City":"St Louis","Latitude":"38.633352","divs":["Sighting DetailsSighting Report: My wife and I were headed to the grocery store near our home in St. Louis when she happened to look up (from inside the car) and she noticed a peculiarly shaped object moving in a peculliar way. I immediately parked the car in the store lot and got out to take a look. At 5:55pm (I looked at my watch immediately at the moment I saw it) I realized it was not an airplane shape or movining in any manner I have ever seen a balloon or aircraft move. It had a dark shape that was at first oblong with no other discernable details. It was really high and moving slowly from what appeared to be the southeast of the Sun. I have never seen anything like this before and I was very much disconcerted by the experience. I continued to view this object for about 15 minutes when it got smaller and smaller and then disappeared behind the clouds. I can only guess that it must ve been around 40 thousand feet where the lower storm clouds were in that evening rolling over the sky around 10 mph. It finally faded from view and it lasted for about 15 minutes. I m certain what it was not an aircraft because it had no wings, no blinking lights - just an ominous free-floating dark, oblong shape that moved strangely through the sky."],"files":["/var/www/straped/mufon/html2text/3431.html.txt","/var/www/straped/mufon/org/3431.html"]}