{"Object Flight Path":"N/A","Latitude":"43.515568","divs":["Sighting DetailsOur family took a drive to see the huge display's of lights on houses. We stopped at one. My kids got excited and poked there heads out the van window. I grabbed my I phone and stared to snap photo's using the passenger mirror! With all the lights and music,of course I didn't either see with the naked eye or notice a cluster of three lights in the sky behind us in the mirror. I was taking many with seconds. These were taken about a minute long. There was no other abnormal sounds. No weather conditions. No moon or stars. I download my photo's today, being so busy with the Holiday. I clean out some of my bad takes. To my surprise again, I looked at the photo's to see something that didn't belong there. Behind us there it was bright as day. Perfect 3 cluster lights. I read on these before. I'm sure the lights attracted the UFO. I have 4 photo's of the UFO and one before where it is not there.Please scrach my kids faces before publishing. Thank you."],"Tags":"City","Date of the Event":"12/11/2011 07:16 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","City":"Saco","Summary":"My family and I drove over to see a house full of lights. I thought it was so cute my kids sticking there heads out to see. I took photos useing my iphone. I took them in the mirror. I download my photo's and seen a cluster of 3 white lights together","Region":"Maine","Country":"United States","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-12262011-0005","Case Number":"34313","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/34313.html.txt","/var/www/straped/mufon/org/34313.html"],"Longitude":"-70.459993","Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=43.515568,+-70.459993(34313)&iwloc=A&hl=en\"> mufon case (34313) map </A>","trends":["There have been 2 other sightings in Saco","There were no other sightings in Saco on or around December 11th 2011","This sighting has never been favorited.",""],"Date Submitted":"12/26/2011 10:58 UTC","Object Shape":"Circle, Other"}