{"divs":["sighting detailslast night my wife and i went to bed shortly before 10 pm. at 10, my wife got up and went to the window of our upstairs bedroom. she observed a glowing object in the southern sky. it faded out. i got up and went to the window and a second object appeared. it was about 40 degrees above the horizon, and it appeared to be moving from north to south. it was much larger than a star and its surface was covered with twinkling red\\yellow\\orange lights. it had an irregular outline. we watched this object for a couple of minutes, and then it also faded out. a third object then appeared. i got the camera and started getting dress to go on the downstairs south patio. the third light faded, and a fourth appeared. i went on the patio and took a nice picture of this object shortly before it faded. we are near holloman afb, and we have seen the strings of orange flares which the air force uses. these were distinctly different. the picture shows two objects one above the other. they are connected by a fuzzy irregular tubular structure. i concede that the lower object could be a burning smoking fragment sloughed off of a main flare, but, if so, then it is like no flare that i have ever seen before. also, these were close enough and bright enough that we should have seen the supporting parachute. i hope to see them again. the camera is a panasonic dmc-zs3 in the sports scene mode and 12x zoom."],"trends":["There have been 2 other sightings in Ruidoso","There were no other sightings in Ruidoso on or around December 25th 2011","This sighting has never been favorited.",""],"Region":"New Mexico","Date of the Event":"12/25/2011 10:00 UTC","Case Number":"34316","Date Submitted":"12/26/2011 12:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.364957,+-105.65631(34316)&iwloc=A&hl=en\"> mufon case (34316) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Lights Over Ruidoso","Log Number":"US-12262011-0008","Latitude":"33.364957","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Other","Viewing Distance":"Unknown","Tags":"City","Longitude":"-105.65631","City":"Ruidoso","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/34316.html.txt","/var/www/straped/mufon/more/34316_submitter_file1__122511UFO.JPG","/var/www/straped/mufon/org/34316.html"],"Object Features":"None"}