{"map":"<A HREF = \"http://maps.google.com/maps?q=45.562805,+-122.62042(34317)&iwloc=A&hl=en\"> mufon case (34317) map </A>","Object Features":"Other","Region":"Oregon","Disposition":"Unresolved","City":"Portland","Object Flight Path":"Straight-line path,Other","Viewing Distance":"Over One Mile","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around December 23rd 2011"],"Case Number":"34317","Longitude":"-122.62042","Source":"MUFON","divs":["Sighting DetailsWhile standing in Fernhill park on my lunch break, talking on the phone, looking at the sky and stars, which is typical for me when the weather allows, I observed a large, glowing, bright white object appear to fall or decend from the sky in the east. It happened very quickly, about as fast as it takes to watch a shooting star and it reminded me of watching the same, although I know this was no shooting star or meteor, which I have seen plently of. I first noticed the object at about the level of the tree line, it quickly decended out of sight & I had the thought that it had landed somewhere. The object was roughly one and a half to two times the size of the airplanes that were flying nearby. I am unable to accuratly judge the distance that it was from me, but I am assuming it was a few miles or more, considering the size relevant to the nearby airplanes that I am sure were further away than it. I felt amazed and somewhat in shock at seeing this, so much so that I commented to the person I was talking to on the phone \"I don't know what I just saw, but I know that wasn't normal\" I then proceded to explain the phenomenon I had just witnessed while continuing to watch the sky for another appearance, which was not forthcoming. This occured on the evening of December 23rd between 5:15-5:20pm and I continued to watch the sky until 5:35 when I had to return to work."],"Summary":"Standing in the park on my break I observed a large, bright white glowing object decend & appear to land at an unknown distance","Log Number":"US-12262011-0009","Latitude":"45.562805","Object Shape":"Fireball, Sphere","Date of the Event":"12/23/2011 05:20 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/34317.html.txt","/var/www/straped/mufon/org/34317.html"],"Tags":"City","Country":"United States","Date Submitted":"12/26/2011 12:59 UTC"}