{"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet, 101-500 Feet","Tags":"City","files":["/var/www/straped/mufon/html2text/34315.html.txt","/var/www/straped/mufon/org/34315.html"],"City":"Newmarket","Disposition":"Unresolved","Date Submitted":"12/26/2011 11:35 UTC","Country":"Canada","Log Number":"CA-12262011-0007","Sighting Duration":"Undisclosed","Date of the Event":"02/04/2009 06:09 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Latitude":"44.057771","divs":["Sighting Details AT 1809 p.m. on Feb 4th 2009 i was at Hydro One 55 acre construction site guarding it sitting in the driver seat of my car and observing.Suddenly i have noticed a tiny flying object over the hill reaching towards the transformer area. I immediately sensed it a very tiny object and grabbed my SonyDigital Hi8 camcorder. The craft had white luminous light it first touched the lower Hydro line an then reached the higher hydro line touching it. Then it slowly moved towards the transformer and hovered over for few minutes. It also beeped a total of 9 times and emitted dark sphere beam as it beeped.Then the light intensity increased tremendously like mercury and it hovered overhead. The dog in the nearby house was heard barking couple of times as it hovered. (The house owner reported the dog died later). It slighly ascended and hovered static for sometime and beeped. 2 faint lights were seen at the back in some distance and altogether they made as triangle.(please watch the video). You can also hear my voice in excitement. Later it moved above my head and gradually vanished towards Easterly direction. 3 years passed still it is fresh in my memory. I was shocked and excited. This is my 2nd such sighting out of 4 total sightings including one UFO crash. I have submitted one video 2 days back of the sighting in 2009 where the UFO hit my construction trailer. I have 2 more videos of the sightings on different dates which i will submit later after seeing your response. Please analyze this video and let me know. Thanks. Please put my name on the video. Regards."],"Object Shape":"Circle, Flash, Sphere, Star-like, Other","Object Features":"Other","trends":["There have been 6 other sightings in Newmarket","There were no other sightings in Newmarket on or around February 4th 2009","This sighting has never been favorited.",""],"Source":"MUFON","Case Number":"34315","Summary":"Tiny UFO with bright light, hovering, luminates, beeps, glows, radiates.","map":"<A HREF = \"http://maps.google.com/maps?q=44.057771,+-79.449955(34315)&iwloc=A&hl=en\"> mufon case (34315) map </A>","Longitude":"-79.449955","Region":"Ontario"}