{"Date Submitted":"12/26/2011 09:05 UTC","Region":"Florida","Case Number":"34327","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=27.672317,+-81.511284(34327)&iwloc=A&hl=en\"> mufon case (34327) map </A>","Viewing Distance":"20 Feet or Less","Log Number":"US-12262011-0019","Longitude":"-81.511284","Latitude":"27.672317","Weather Factors":"Unknown","Object Flight Path":"Other","Disposition":"Unresolved","Country":"United States","Date of the Event":"12/18/2011 09:30 UTC","Summary":"metal like bird with like belt that had green beam that inspected our cruise ship in the carribean ocean","Source":"MUFON","Object Shape":"Other","divs":["Sighting Detailswe were on a cruise that left maimi,fa. second day out we were in the carribean ocean. after dinner we went to the top deck and was looking over the side of the ship six of us noticed a metal-like bird that was flying like a hummingbird but looked like a hawk that had a metal belt with a green beam shining on the ship below our deck it flew up, over and you could see the wings flapping really fast but looked like something out of a transformers movie . the bird-like thing was about maybe 15 feet away from us flew up to our deck side ways, shot out past us right in front of the ships FILR camera on side of back ship then disappeared. it was about 9:30 at night the sky was crystal clear you could see every star in the sky .there was no land beside us or anywhere around . everyone could not believe it. would a real bird stop and check out a boat it doesnt make sense this bird and i mean bird wasnt normal we were so close we could see the wings moving they were like metal. i cant find anything on the net about this somebody has to seen something like this. six people all seen this this is real what is it .is it something the goverment has or did we really see a bird that was not from here what was it looking at this really has all of us puzzled"],"Tags":"City","Object Features":"Wings","City":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/34327.html.txt","/var/www/straped/mufon/org/34327.html"]}