{"Region":"Florida","Date Submitted":"12/26/2011 03:53 UTC","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34320.html.txt","/var/www/straped/mufon/org/34320.html"],"Country":"United States","Disposition":"Unresolved","Case Number":"34320","Log Number":"US-12262011-0012","Object Flight Path":"Stationary,Hovering then path","Object Features":"Unknown","Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=28.490393,+-82.523418(34320)&iwloc=A&hl=en\"> mufon case (34320) map </A>","Date of the Event":"11/11/2011 07:30 UTC","Latitude":"28.490393","divs":["Sighting Details11-11-11 It was a clear night 360 degree view of the Universe from where I live.Every night I look and marvel at the skies.This particular night,I had just arrived at home.As soon as I got out of the car, I noticed a bright light that seemed to be \"out of place\". I looked to my South and saw a very large, dull amber colored sphere. At first I thought is was a I then looked to my North and witnessed the North star,trying to make a comparison of the two.There are tons of sattelites encircling all of the time, but for some reason 3-4 sattelites went off course and made a beeline toward this object.The sattelites appeared to be taking pictures of the sphere, and all of a sudden, the sphere starting shooting beams towards the sattelites. Meanwhie,other unidentifiable aircraft(2 planes)began to hover to the East of me, not making a sound. The sattelites in succession started backing up. The sphere began to glow brighter,let off a sonic boom and went out like a light. I fell to my knees in disbelief.The sattelites hovered in the same area for 30 minutes, then continued their regular paths.I'm so glad that I had other people to witness this marvelous event as well."],"City":"Spring Hill","Longitude":"-82.523418","Viewing Distance":"Over One Mile","trends":["There have been 12 other sightings in Spring Hill","There were no other sightings in Spring Hill on or around November 11th 2011"],"Summary":"saw large amber light hovering;3-4 satellites beelined to light;object shot beams at sattelites and light made sonic boom sound and dissapeared"}