{"map":"<A HREF = \"http://maps.google.com/maps?q=40.419516,+-111.76295(34335)&iwloc=A&hl=en\"> mufon case (34335) map </A>","Tags":"City","Weather Factors":"Unknown","Object Shape":"Disc, Sphere, Triangle","Date of the Event":"12/24/2011 12:00 UTC","Summary":"Small orange triangles, and large Bright white oval objects","Object Features":"Window(s)","files":["/var/www/straped/mufon/html2text/34335.html.txt","/var/www/straped/mufon/more/34335_submitter_file1__IMG_1618.JPG","/var/www/straped/mufon/more/34335_submitter_file3__UfoSightingMaps.jpg","/var/www/straped/mufon/org/34335.html"],"trends":["There have been no other sightings in Cedar Hills","This sighting has never been favorited."],"Date Submitted":"12/27/2011 03:28 UTC","Source":"MUFON","Country":"United States","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Latitude":"40.419516","Sighting Duration":"Undisclosed","Longitude":"-111.76295","Case Number":"34335","divs":["Sighting DetailsMy wife and I were driving home from my sisters house when I saw a light in the sky. I pointed it out to her and she pulled into the neighborhood we were driving past and stopped the car. We both got out of the car and observed 3 orange object that at first looked like an orb, but as they flew closer to us that were shaped like a small triangle, no larger than 5 feet in diameter. We were coming from the north towards us in a southern direction, and were at differing altitude, from 100 to 500 feet off the ground. We took a few pictures then thought they might be Chinese lanterns. As we turned to get back in the car we saw two very bright lights, in a South-South East direction. They were further off, more than a mile. We drove over to a nearby park to get a better look at them. When we got out of that car there we took a few more pictures of them, they were both stationary for more than 2 minutes, then one began to move around, then away from the stationary one toward the North. They were oval, and a very bright white light. We wondered if we could see them from our neighborhood which was at a higher altitude and looked over the valley. Se we drove home and found that we could see them very well from there as well, about 5 miles further away. We went to our neighbors home and told them about it. They wanted to see them, so both of our families got in our cars and drove over to the neighboring golf course to see them. They were still there. In all we saw 4 bright white objects, moving around a stationary object that was on the top of the mountain on the other side of the valley. We observed them for over 15 minutes, taking a 2 minute video as well. During that time we could see airplanes coming into the SLC airport, and these lights were much brighter than them, larger, and made no noise. within 5 minutes after leaving the gold course we heard two helicopters fly by, very unusual at night here, especially Christmas Eve night. I went back tonight to confirm that the stationary light is in fact something on the top of the mountain over Saratoga Springs, though we do not know why the objects were flying around it. The still picture taking in Highland gives a very clear observation of their shape. And the video shows their movement, the extreme brightness when they would first appear, and the random flashes, as well as the methodical less bright flashing."],"City":"Cedar Hills","Region":"Utah","Log Number":"US-12272011-0004"}