{"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.731443,+-80.306403(34338)&iwloc=A&hl=en\"> mufon case (34338) map </A>","Case Number":"34338","Tags":"City","files":["/var/www/straped/mufon/html2text/34338.html.txt","/var/www/straped/mufon/more/34338_submitter_file1__phonepics426.jpg","/var/www/straped/mufon/org/34338.html"],"Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Triangle","City":"New Brighton","Summary":"Saw two bright lights in distance, got closer, lights went out and could see side lights, black triangle flying over","Latitude":"40.731443","Region":"Pennsylvania","Longitude":"-80.306403","Log Number":"US-12272011-0007","Source":"MUFON","Country":"United States","divs":["Sighting DetailsI was driving home from my boyfriends house and once I got to about two miles from my home I saw two lights in the sky, one was very much brighter than the other and appeared to be twinkling different colors. At first I thought they were Venus and Jupiter because the news said you would be able to see them in the night sky. I kept my eye on them and about two minutes later I approached a stop sign in a very dark area. I stopped and grabbed my phone to take a picture, and I could clearly tell there was one object in the sky in front me. The bright lights were off now, but I could see about 10 small white lights along the side of the object. At the intersection, you can only turn left or right, and straight in front of you is a small grassy embankment with a few homes and farmland behind it. I turned left toward home and kept driving because I was scared. I got about 500 yards from the intersection still looking at the sky, when I saw an object moving very slowly above me, going toward the adjacent hillside. It was a black triangle, with a small white light at each corner, and a small red light in the middle. I kept my eye on it til it went over the hillside, only slightly above the trees. I got to my home within the next minute and sat out in my car for a few minutes in the dark. No other objects were in the sky, and the night was rather overcast, so I couldn't even see the stars. When I came home I started researching UFO's and was pretty scared to see that these Black Triangles have been seen many times before. The Pittsburgh Int'l Airport and the 911th Air Wing are near me, so I am used to helicopters, planes, and large military cargo planes in the sky, but I have never seen anything like this. Also, my friends and I like to stargaze, and are familiar with other moving objects like meteors and satellites."],"Object Features":"None","Weather Factors":"Unknown","trends":["There have been 2 other sightings in New Brighton","There were no other sightings in New Brighton on or around December 26th 2011","This sighting has never been favorited.",""],"Date Submitted":"12/27/2011 06:56 UTC","Sighting Duration":"00:06:00","Date of the Event":"12/26/2011 11:37 UTC"}