{"Longitude":"-74.897489","Object Shape":"Disc, Fireball, Oval","Log Number":"US-12262011-0022","Summary":"saw 7 lights following one another in a mostly straight line. flew across the sky for about 3-4 minutes and one by one disappeared as they had appeared one by one.","Sighting Duration":"Undisclosed","Date Submitted":"12/26/2011 11:23 UTC","Viewing Distance":"21-100 Feet","Source":"MUFON","Latitude":"39.975108","map":"<A HREF = \"http://maps.google.com/maps?q=39.975108,+-74.897489(34331)&iwloc=A&hl=en\"> mufon case (34331) map </A>","Tags":"City","Case Number":"34331","divs":["Sighting DetailsI was out on my front porch with my sister and it faces the north and east. I saw what at first assumed was a plane because i see them all of the time. I immediately noticed the object was a bright orange color that has no definite shape other than being smallish and round-oval. as soon as i noticed the color of the object, i then saw another similar object come into view right behind the first one. it all happened pretty quick, but i was saying to my sister as I'm trying to figure out exactly what it is I'm seeing, Kate, what the heck are those things? As I'm saying that another identical object comes into view behind the first two. Then another, then another, totaling 7 of these identical orange lights flying in a line, one after the next, moving in the direction of West to East. It seemed each one came out of nowhere to join the line. They made no sound as they moved across the sky in line formation, they didn't change colors or anything like that, they stayed orange. They were approximately 10-20 feet between each one. They flew across the sky and one by one disappeared as they flew up to what seemed like a higher altitude. We had called our whole family out to witness these lights and not one person could come up with an idea for what we saw. It was pretty incredible, strange and scary all at the same time. I think we will definitely remember this Christmas in my family!"],"Disposition":"Unresolved","Date of the Event":"12/25/2011 09:15 UTC","Object Features":"Unknown","Region":"New Jersey","Country":"United States","trends":["There has been one other sighting in Mt Laurel","There were no other sightings in Mt Laurel on or around December 25th 2011"],"Object Flight Path":"Straight-line path","City":"Mt Laurel","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/34331.html.txt","/var/www/straped/mufon/org/34331.html"]}