{"Latitude":"37.437903","files":["/var/www/straped/mufon/html2text/34339.html.txt","/var/www/straped/mufon/org/34339.html"],"Sighting Duration":"Undisclosed","Region":"Virginia","Weather Factors":"Unknown","Tags":"City","Summary":"dixie cups connected to one another with a sphere beneath it.","map":"<A HREF = \"http://maps.google.com/maps?q=37.437903,+-78.650204(34339)&iwloc=A&hl=en\"> mufon case (34339) map </A>","Source":"MUFON","Object Flight Path":"Stationary","Longitude":"-78.650204","Date Submitted":"12/27/2011 10:01 UTC","City":"sab","Object Shape":"Unknown","divs":["Sighting DetailsOn this Day as mentioned, I as well as my wife saw this craft and it was not an aberration. We have a set of binoculars set up in our studio which has always been focused on breeding ospray. The set up is at the base of a set of stairs which lead down to a lower level art studio. When upstairs visiting,i would quickly peek at them as i entered or left her personal space. This day,past the nest, I clearly saw this hovering object as high as an airplane. I immediately notified my wife who in her amazement, watched this object. Now this is the peculiar issue....As she looked at it, and I stood by, i noticed it was completely invisible to the naked eye. Completely. It should have been easily seen with the naked eye for i had low power binoculars. I would then peer into the binoculars to see it once again. It was obviously cloaked to the naked eye...simply astonishing. We watched it for around fifteen minutes just hovering in place, not moving but maybe slightly rotating. then poof, it vanished. I went home and searched the internet and to my amazement, saw the identical craft someone else had actually photographed in the past. It appeared to be three conical shapes connected together which looked like a megaphone set up with a semi-sphere attached below it the object was bright silver."],"Object Features":"Other","trends":["There have been no other sightings in sab","This sighting has never been favorited."],"Date of the Event":"08/15/2010 12:00 UTC","Disposition":"Unresolved","Case Number":"34339","Country":"United States","Viewing Distance":"Unknown","Log Number":"US-12272011-0008"}