{"divs":["Sighting DetailsSighting Report: May 19, 2005, At about 21:00 hours, I saw and heard at least 5 {five} military aircraft chasing or following an orange glowing light. It looked like a fireball, and made no discerneable sound. The orange light was not like any aircraft light I have ever seen in 43 years of living. I was a paratrooper in the Army, and I was a civil service employee at a military base right across the street from the military airport. Iv e either flown in, and or jumped out of every kind of aircraft you can think of. What I saw last night, does not fit the description of anything Iv e ever seen before. And like I said, at least five fighter jets were chasing or folowing this thing. I was home alone last night, so my wife didn t see it. But two weeks ago, on our way home from playing Bingo, we both saw the same strange light, minus the fighter jets. Now is there any government agency who could or would tell me what I saw? I know they know because they were chasing it! Should I report this to the FBI? I do not wish for this report to remain confidential. I DO want it to be known to everyone! I want to know what the hell I saw!!! If they were escorting some new classified secret aircraft,...fine. If they will just tell me that, then I won t ask any more questions. If not,... I want the world to wake up, and pay attention! Someone please contact me ASAP!"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.499488,+-91.857098(3433)&iwloc=A&hl=en\"> mufon case (3433) map </A>","Source":"MUFON","Case Number":"3433","Region":"Missouri","Object Features":"Undisclosed","Summary":"Not Provided","Viewing Distance":"Unknown","trends":["There have been no other sightings in Licking","This sighting has never been favorited."],"Longitude":"-91.857098","Object Shape":"Undisclosed","City":"Licking","Tags":"City","Disposition":"Insufficient Data","Log Number":"","Date Submitted":"05/20/2005 09:20 UTC","Date of the Event":"05/20/2005 09:20 UTC","Latitude":"37.499488","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/3433.html.txt","/var/www/straped/mufon/org/3433.html"],"Sighting Duration":"Undisclosed"}