{"Longitude":"-117.156015","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"32.718559","Date Submitted":"12/27/2011 06:29 UTC","Object Shape":"Circle, Fireball, Sphere, Star-like","Log Number":"US-12272011-0016","Country":"United States","Disposition":"Unresolved","Object Features":"Undisclosed","Date of the Event":"12/26/2011 12:00 UTC","City":"San Diego","map":"<A HREF = \"http://maps.google.com/maps?q=32.718559,+-117.156015(34349)&iwloc=A&hl=en\"> mufon case (34349) map </A>","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around December 26th 2011"],"files":["/var/www/straped/mufon/html2text/34349.html.txt","/var/www/straped/mufon/org/34349.html"],"Weather Factors":"Unknown","Summary":"Lights glowing over a mountain, that change intensity and number of light, they multiply","Region":"California","Case Number":"34349","divs":["sighting detailson dec26 at about 11 pm me and my girl friend and a friend went to up to mount soledad, which is in la jolla ca, we brought my telescope up there and pointed it to the north east direction where there is a mountain range approx, 15 miles north east of mount soledad. this mountain is believe part of poway\\romona but i'm not sure exactly what the mountain is called. in the middle of this mountain is a canyon space that you can see right through and in this canyon area approx 100 ft about the canyon there are a row of light that point at a angle up above the mountain tops but it starts in this canyon. these lights are glowing orange and will change there glow from being very dim to all of a sudden very bright in a perfect row, when i look in my telescope i can see many more glowing lights circling each other and making triangular patterns. these lights have been there multiple nights. i have seen them twice with my telescope which is a meade 4501. these lights seem to turn off and on at all different times, sometimes only 4 with be bright then only one then all 4 but what is weird is that they will have little glowing balls spinning around the original 4, these are not planes i have lived in san diego my whole life and i actually live in the flight path, where i'm looking it is approx 15 miles north of the flight path like i said these lights have been there for multiple nights so i def think we have a chance to investigate"],"Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering"}