{"Weather Factors":"Unknown","Date of the Event":"12/25/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/34345.html.txt","/var/www/straped/mufon/org/34345.html"],"Viewing Distance":"101-500 Feet","Region":"Idaho","Tags":"City","Latitude":"48.292958","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-116.557007","Case Number":"34345","map":"<A HREF = \"http://maps.google.com/maps?q=48.292958,+-116.557007(34345)&iwloc=A&hl=en\"> mufon case (34345) map </A>","divs":["Sighting DetailsFive of us family members went outside for a smoke during our Christmas day dinner when one of us noticed what only can be desribed as a spherical candle flame moving silently across the sky. It was maybe the size of a car?, and close but moving slowly and no light change. It hovered briefly then continued. We saw it from a couple different angles as it moved and my son and nephew who are in their 20's said it looked like a mini hot air balloon, but we all concurred that was not the case as it moved in a straight line except for the occassional hovering. After it stopped and hovered for a second time it went in a 90* turn from a hover-stop and that's when we all looked at each other and really knew that was a UFO! I personally have had other encounters, but 2 of the others were totally non-believers of anything out of the ordinary and they were blown away by this. After it took off then it was gone and we went inside."],"Date Submitted":"12/27/2011 03:37 UTC","Summary":"There were 5 other family member witnesses. Looked like a very large candle flame in a sphere, no sound slowly moving across the lower sky.","Object Shape":"Sphere","Source":"MUFON","Log Number":"US-12272011-0014","Object Features":"Other","trends":["There have been 5 other sightings in Sandpoint","There were no other sightings in Sandpoint on or around December 25th 2011"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Sandpoint","Disposition":"Unresolved"}