{"Source":"MUFON","Object Features":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.986348,+-94.667372(34340)&iwloc=A&hl=en\"> mufon case (34340) map </A>","Date Submitted":"12/27/2011 11:06 UTC","Date of the Event":"12/25/2011 10:30 UTC","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around December 25th 2011"],"Latitude":"38.986348","divs":["Sighting DetailsAt approximately 10:30 PM on 12-25-11 my son came running into the family room urging my wife and I to look out the back of our house which faces West. We looked out and saw innumerable lights off in the distance moving from North to South along a relatively straight path. We proceeded out onto the deck and continued to observe these lights. As they moved to the South, they then appeared to head more West and appeared to climb and then disappear rather rapidly one by one. As we looked to the North, more lights continued to appear. This was a constant stream that we saw for at least 10 minutes, lights disappearing into the sky to the South and West and more lights appearing from the North. I would estimate that several hundred of these objects passed by during this time all taking the same path before turning to the West and up into the sky and disappearing. I had grabbed my cell phone on the way out to the deck and tried to record the objects but the quality is not great. In fact, some of the objects which I could see with the naked eye did not appear on the camera screen while others did. I am attaching the video clip. There are some Christmas lights from a few nearby houses along the bottom of the screen, not to be confused with the moving lights which appear much smaller. We could not make out any sound from these objects."],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Summary":"Innumerable lights moving north to south 10:30 PM 12-25-11 Overland Park KS area","files":["/var/www/straped/mufon/html2text/34340.html.txt","/var/www/straped/mufon/org/34340.html"],"Object Shape":"Unknown","Object Flight Path":"Path with directional change","Case Number":"34340","City":"Overland Park","Log Number":"US-12272011-0009","Region":"Kansas","Country":"United States","Longitude":"-94.667372","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}