{"Case Number":"34350","Tags":"City","Disposition":"Unresolved","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/34350.html.txt","/var/www/straped/mufon/org/34350.html"],"Date Submitted":"12/27/2011 07:28 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.236447,+-80.839127(34350)&iwloc=A&hl=en\"> mufon case (34350) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Date of the Event":"12/27/2011 06:40 UTC","divs":["Sighting DetailsMy daughter and I were observing the night sky through our telescope. We were about to go inside and eat dinner and wrapped up the scope. Before we went in, we were looking at stars above us,searching for Polaris. As we were looking we seen a very bright star. But this star started to move in a north direction. It was steady bright just like a star and it was not a plane. It was very very high.It traveled in a north direction for about 15 - 20 seconds then seemed to fade and then in a milisecond it turned and headed back in the same direction. Bright, steady and for about 10 - 15 seconds. Then turned again, on a dime, flew back again on its original path north,then faded behind the trees in my yard. Then several minutes after that, as we were trying to deduce what we just witnessed, my daughter looks directly above us and there appeared to be the same object traveling now to the east for about 20 seconds until we could not see it any more. We were blown away because we know what planes, choppers and other common aircraft look like. We of coarse tried to bebunk it so that we were not tricking ourselves. If I were to describe it in my own words, it looked like a very bright star packed his bags, got up out of his space and decided to go fly, forgot something and turned around ( not in a circle mind you ) came back to get whatever he forgot, got it and then turned again the same as before and left town ! We were not drinking, smoking or anything of that nature. Just a dad and his pal, looking at the universe !"],"Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-12272011-0017","City":"Charlotte","Summary":"bright star like light traveled north faded then turned instantly,returned then turned again north","Object Features":"Unknown","Longitude":"-80.839127","Latitude":"35.236447","trends":["There have been 68 other sightings in Charlotte","There was one other sighting in Charlotte on or around December 27th 2011"],"Country":"United States","Object Shape":"Star-like"}