{"files":["/var/www/straped/mufon/html2text/34353.html.txt","/var/www/straped/mufon/org/34353.html"],"Source":"MUFON","Log Number":"US-12272011-0020","map":"<A HREF = \"http://maps.google.com/maps?q=43.639802,+-88.727532(34353)&iwloc=A&hl=en\"> mufon case (34353) map </A>","Region":"Wisconsin","Disposition":"Unresolved","Country":"United States","Object Features":"Unknown","Object Shape":"Star-like","Summary":"Watched as a starlike object made triangle with other stars, then arched away","Sighting Duration":"00:01:00","Case Number":"34353","Date Submitted":"12/27/2011 10:24 UTC","Latitude":"43.639802","trends":["There have been 6 other sightings in Waupun","There were no other sightings in Waupun on or around December 27th 2011"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsI don't normally go out looking for UFO's but tonight I had a premonition to go look at the stars. I had an experience in the same area on December 16th with red and white pulsating lights and I hoped to see those again, to determine what they might be. I took a drive out into the country. We live in a semi-rural area and I drove to a much more rural area where the stars are quite plentiful. I drove out into the country, taking back country roads, taking note of stars and the constellations as best I could. I started heading back on CTH TC, going due west and I saw two light stars just above the horizon, about 45 degrees. My attention was diverted to driving for a moment and then looked at those stars again. I saw THREE stars this time, and all three of them made a perfect triangle. They were very bright, with the bottom \"star\" being the brightest of the three. It was so odd because I kept thinking, \"There were only two stars there a moment ago and now there are three.\" I looked to see whether the stars were blinking or flashing like planes in the sky, but there was no flashing, only a solid bright white light. Just when I was getting used to the bright triangle shape in the sky (about 5 seconds, perhaps), the bottom most \"star,\" the one that hadn't been there moments before, began to move in an arch between the two other stars above it, and it moved in a southeasterly direction. I could see the other two stars get lighter in intensity and the bright star which was moving began to fade a bit as it moved across the sky. As it came approximately directly over my vehicle (and hence, I couldn't see it anymore), it faded from view. I tried to tell myself it was a satellite or a plane, but it just didn't look like that. It looked like a star that moved. A bright star that moved, and it made the two stars near it bright, until it passed by. I can't explain that. I watched those two stars for quite some time afterwards and they didn't seem to do anything different than twinkle normally. This was no shooting star and I could see no evidence of anything else moving (like a satellite would) after it faded out. Something strange I did notice was there were a lot of planes that seemed to fly directly \"between\" those two stars, including one that made a triangle with them. These planes had flashing lights that looked like regular aircraft. Perhaps that was a normal flight path but it just seemed so odd to see three or four planes fly between those two stars like that. There was a sliver of a moon and I identified Venus in the SW horizon and Jupiter above me. This was not a planet but a moving \"star.\""],"City":"Waupun","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"12/27/2011 06:35 UTC","Longitude":"-88.727532"}