{"Country":"Canada","Disposition":"Unresolved","Latitude":"44.308385","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Peterborough","There were no other sightings in Peterborough on or around December 24th 2011"],"Longitude":"-78.320244","Log Number":"CA-12282011-0001","Object Flight Path":"Straight-line path","Object Features":"Dome, Window(s), Wings","Tags":"City","files":["/var/www/straped/mufon/html2text/34356.html.txt","/var/www/straped/mufon/org/34356.html"],"divs":["Sighting DetailsI was across from our local coffee shop when I heard this rumble above me, similar to the sound of a Harley idiling. When I looked up I seen what was an all white medium size plane,flying low in the sky. The only way to describe it, is like a Harley Fat Boy. It was all white and had 3 thick black lines on its underbelly, fat wings , came out from the side of the plane with its wing tips up, but not too high. Their were no visible call numbers or writing of any kind on it. A fellow walking towards me heard the sound thru his head phones and stopped to see where it was coming from. we both watched it for about 2 minutes. By the time I took out my binoculars to get a better look it was gone, poof sound and all. How can something flying that low and loud, suddenly disappear, sound and all. We waited 5 minutes for it to reappear out of the low cloud cover but it never did. I walked thru the park watching the sky for another 15 minutes but it never returned. I can see loosing it in the cloud cover but how could such a rumble and a whole plane disappear like that. Back to the Harley point again , when they are touring down the street we can sometimes hear them for blocks, but this sound was gone immediatly as was the low flying plane. The gentleman with me stood there waiting with me, and left scratching his head when it disappeared. Any ideas folks?"],"Object Shape":"Other","City":"Peterborough","Date of the Event":"12/24/2011 12:00 UTC","Weather Factors":"Unknown","Source":"MUFON","Summary":"Don't really know what to call it, but it looked like a plane, that disappeared.","map":"<A HREF = \"http://maps.google.com/maps?q=44.308385,+-78.320244(34356)&iwloc=A&hl=en\"> mufon case (34356) map </A>","Viewing Distance":"101-500 Feet","Case Number":"34356","Region":"Ontario","Date Submitted":"12/28/2011 12:09 UTC"}