{"Date Submitted":"12/27/2011 08:43 UTC","Longitude":"-111.863246","Object Shape":"Square, Rectagular","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/34351.html.txt","/var/www/straped/mufon/org/34351.html"],"Log Number":"US-12272011-0018","Disposition":"Unresolved","Date of the Event":"12/25/2011 08:30 UTC","City":"Chandler","divs":["Sighting DetailsAt approximately 8:30 to 8:40 p.m. on Dec. 25, 2011, I was standing and looking out at the sky from my ground floor apartment patio, talking on the phone. I saw a light grey, roundish, filmy substance moving toward me from the southeast, traveling northwesterly. The substance appeared to be unsolid - possibly gaseous. I had absolutely no idea what it could be as I had never seen anything like that before in my life. It grew larger as it approached and then took the shape of a craft. It was an oblong, six-sided craft with rounded ends. I saw a dull light grey and metallic-looking craft - my husband saw gray and black. It moved slowly, perhaps no more than 20 mph and no less than 10 mph. It moved very smoothly and as it continued to approach I noticed two appendages protruding from the closest end to me. They appeared to be something like very long antenas pointed downward. I was describing what I saw to the person I was talking to on the phone. Then I yelled for my husband to come out and he saw it as well. The craft moved steadily and was completely silent. There were no exterior lights. The end farthest from me had windows and they seemed to contain one small golden light in each window. I think there were 4-6 windows. The craft flew over the parking lot and was approximately 300-500 ft. in altitude and approximately 300 ft. away from me at the closest point. It was hard to tell how high it was or how far away but it was very, very close. My husband said he wished he would have had a flashlight to shine on it because it probably would have reflected. My husband saw geometric shapes on the outside bottom of the craft. This was not writing, but black, wide lines that appeared to be more for functionality. My husband ran into the apartment and out the front door and out through the back parking lot to watch it. I went out the front door straight to the west. The craft soon went back to the original shape of a roundish, unsolid object. I saw the craft for about 30 seconds - my husband saw it for about 10 seconds. During and after the sighting I felt very peaceful and loving. During the sighting I was also very excited and all I could say was, \"Oh my God!\", over and over again. This sighting was in Chandler, AZ."],"Summary":"Unknown craft appeared and flew over us.","Sighting Duration":"Undisclosed","Latitude":"33.249899","map":"<A HREF = \"http://maps.google.com/maps?q=33.249899,+-111.863246(34351)&iwloc=A&hl=en\"> mufon case (34351) map </A>","Viewing Distance":"101-500 Feet","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around December 25th 2011"],"Source":"MUFON","Weather Factors":"Unknown","Case Number":"34351","Region":"Arizona","Object Features":"Window(s), Appendage(s)","Tags":"City","Country":"United States"}