{"Longitude":"-91.830533","Disposition":"Unresolved","Object Shape":"Fireball","divs":["Sighting Details1. Where were you and what were you doing at the time? Cascade Township park. Myself and several close friends were participating in a outdoor NERF gun war-game called ZOMB, wherein 80-150+ people engage in a \"zombie apocalypse\" survival game. 2. What made you first notice the object? Our \"squad\" was moving along the perimeter of the park closest to I-96. My friend Jason was the first to notice the lights and point them out. We looked NE across the park to see 8 orange glowing UFOs paired off in a staggered formation about 30-40 degrees above the horizon. As we looked across the highway at the Gerald Ford International Airport we saw searchlights moving across the sky over the airport. 3. What did you think the object was when you first noticed it? My first impression based on the pulsating glow of the objects was that of aerial flares. However the night was breezy and if the objects had indeed been flares they would have been drifting in the wind. 4. Describe the object and its actions and motions in detail. The 8 objects remained stationary, paired off at equal distance from each other in their staggered formation. No downward fall or drift with the wind currents. The objects were completely silent. (I don't know who else in the park that night may have noticed the phenomenon although it was clearly visible for at least 5 minutes.) 5. Describe your feelings, reactions and actions, during and after sighting the object. I was the most excited, I kept asking everyone around me \"Are you seeing this? Tell me you're seeing this.\" the sighting was verified by the 5 other people that made up our small 'squad' which included several of my closest friends. I was frustrated because I had brought a camera to the event but had left it locked in my car for fear of it being lost or damaged during the course of the game. (The image included is a approximation of the event superimposed on a screenshot from the Google road cam.) 6.How did you lose sight of the object? The objects disappeared one by one over the course of 45 seconds to a minute, I personally witnessed at least two of the objects disappear as we continued moving along the perimeter of the park. By the time we came to a halt, the objects had all vanished."],"City":"Grand Rapids","Region":"Arkansas","Log Number":"US-12282011-0008","Country":"United States","trends":["There have been no other sightings in Grand Rapids","This sighting has never been favorited."],"Weather Factors":"Unknown","Source":"MUFON","Case Number":"34363","Object Features":"None","Date Submitted":"12/28/2011 10:04 UTC","Viewing Distance":"Over One Mile","Tags":"City","Date of the Event":"10/15/2009 12:00 UTC","Summary":"Formation of 8 paired, glowing orange lights, steady but pulsating slightly","Latitude":"35.20679","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.20679,+-91.830533(34363)&iwloc=A&hl=en\"> mufon case (34363) map </A>","files":["/var/www/straped/mufon/html2text/34363.html.txt","/var/www/straped/mufon/more/34363_submitter_file1__UFOsighting.jpg","/var/www/straped/mufon/org/34363.html"],"Object Flight Path":"Stationary"}