{"Date of the Event":"12/28/2011 10:29 UTC","files":["/var/www/straped/mufon/html2text/34367.html.txt","/var/www/straped/mufon/more/34367_submitter_file1__map.jpg","/var/www/straped/mufon/more/34367_submitter_file2__1.jpg","/var/www/straped/mufon/more/34367_submitter_file3__2.jpg","/var/www/straped/mufon/org/34367.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.011974,+-116.879508(34367)&iwloc=A&hl=en\"> mufon case (34367) map </A>","City":"Ramona","Tags":"City","Longitude":"-116.879508","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"US-12292011-0003","Region":"California","trends":["There have been 3 other sightings in Ramona","There were no other sightings in Ramona on or around December 28th 2011","This sighting has never been favorited.",""],"Object Features":"None","Case Number":"34367","Object Flight Path":"Path with directional change","Country":"United States","Date Submitted":"12/29/2011 03:09 UTC","Source":"MUFON","Summary":"UFO circled and shone spotlight on my parked car when overhead","Weather Factors":"Unknown","divs":["sighting details1. driving from the 67 to san vicente rd at 10:30pm 2. noticed lights at 67\\dye rd intersection. 3. at first i believed them to be a plane, but as i drove closer i realized that the lights were circling. 4. object was triangular with one red and one green light in the rear and one white light\\spotlight in the front. it circled over a farming area multiple times while i was driving through the area. the object was completely silent and after i stopped my car to watch it further, as it passed above me it shone its spotlight at my car. 5. i felt very scared and called my boyfriend and had him talk to me while parked and as i was driving home. he recorded our phone conversation as i was describing what i saw. 6. i was frightened after the light shone into my car and drove away while on the phone. i looked in my rearview mirrors but could no longer see the object. attachments: - map of area including points labeled 1, 2, and 3. red circles indicate approximate flight path. - drawing of what i saw at point 2 on map. this is when the object was closest to me and i could make out the triangular shape nearly directly above me. - drawing of what i saw at point 3 on map. this is when the object shone its light at my car. the light was directed at my car and then moved past it as the object passed over me."],"Latitude":"33.011974","Object Shape":"Triangle"}