{"City":"New York","files":["/var/www/straped/mufon/html2text/34364.html.txt","/var/www/straped/mufon/org/34364.html"],"Weather Factors":"Unknown","Object Features":"Unknown","Log Number":"US-12282011-0009","Region":"New York","Disposition":"Unresolved","Source":"MUFON","Object Shape":"Circle, Fireball, Star-like","Tags":"City","Summary":"2 Bright lights flying and stopping before disappearing","Date Submitted":"12/28/2011 11:30 UTC","Sighting Duration":"10:00:00","divs":["sighting detailsit was christmas eve, me and my family were outside smoking in the cold. i seen that my neighbors were outside as well. they walked over with their 3 young kids and asked if we were outside looking at what was in the sky. we didn't know until they came over to show us two bright orange red objects in the sky flying next to each other, then stopping. i took my iphone out to record them and bought a good 25 sec of them before going inside to get the rest of my family to show them so they didn't think me and my cousins were crazy. my neighbor had told me that their were a lot of people pulled over on the main road near my house looking at these objects. they then disappeared, until a half hour later another one came along doing the same thing, flying and stopping, flying and stopping. very strange, and i am one not to fall for ufo stories or what not. i uploaded my video to youtube, and submitted it to many blogs and sites so i can get more of an understanding from people who study this stuff. i would love to hear your input on this. here's the video, i don't have it available to upload, here's the youtube link [link moved to fi section\\cms\\tg]] i would love for you guys to post it to get some feedback from people, and maybe someone else in my area seen this as well. thanks again, [name removed\\cms\\tg]"],"Longitude":"-73.955742","Viewing Distance":"N/A","Case Number":"34364","Latitude":"40.681497","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.681497,+-73.955742(34364)&iwloc=A&hl=en\"> mufon case (34364) map </A>","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around December 24th 2011"],"Object Flight Path":"Path with directional change","Date of the Event":"12/24/2011 09:30 UTC"}