{"Weather Factors":"Unknown","Date Submitted":"12/28/2011 09:55 UTC","Source":"MUFON","Region":"Florida","Viewing Distance":"N/A","Object Flight Path":"Path then hovering","trends":["There have been 10 other sightings in Destin","There were no other sightings in Destin on or around May 13th 2010"],"Case Number":"34362","City":"Destin","files":["/var/www/straped/mufon/html2text/34362.html.txt","/var/www/straped/mufon/org/34362.html"],"Object Shape":"Star-like","Country":"United States","Object Features":"Undisclosed","Log Number":"US-12282011-0007","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.398324,+-86.491083(34362)&iwloc=A&hl=en\"> mufon case (34362) map </A>","divs":["Sighting DetailsOn the night of May 13, 2010 at about 9PM, my companion and I were sitting on the beach in Destin, FL just behind Pompano Joe's restaurant on old Hwy 98. We were taking in the waves and watching the stars. My attention was focused on one 'star' that was moving. We had just watched the launch of Space Shuttle Atlantis from Cape Kennedy earlier that day and having seen the ISS, satellites, etc. move overhead in the past, it appeared to be about the same size and speed. I thought this may be the shuttle going overhead - until I realized it was traveling from South to North...definitely not a typical satellite orbit from West to East. As we continued watching for about 5-10 minutes, it was directly overhead when it stopped - dead stopped. No sounds were heard except a slight breeze and the waves. My companion and I looked at each other and exclaimed to each other, \"NO WAY\". We stayed on the beach another 45 minutes but the object did not move, change brilliance, or anything else noticeable. We had nothing to visually record this event so we gave up craning our necks to watch. There were no other observers around to discuss this with. Being a physicist all my life, I always had reservations about such sightings, etc. until that night."],"Latitude":"30.398324","Longitude":"-86.491083","Date of the Event":"05/13/2010 09:00 UTC","Sighting Duration":"01:00:00","Summary":"Not Provided","Tags":"City"}