{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/34368.html.txt","/var/www/straped/mufon/org/34368.html"],"Longitude":"-74.641722","Region":"New Jersey","Source":"MUFON","Case Number":"34368","Summary":"\"V\" shaped craft seen in Hillsborough, NJ, 2nd sighting in 3 days!!","trends":["There have been 8 other sightings in Hillsborough","There were no other sightings in Hillsborough on or around December 25th 2011"],"City":"Hillsborough","Date of the Event":"12/25/2011 12:00 UTC","Log Number":"US-12292011-0004","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.518712,+-74.641722(34368)&iwloc=A&hl=en\"> mufon case (34368) map </A>","Sighting Duration":"00:00:30","Latitude":"40.518712","Date Submitted":"12/29/2011 09:15 UTC","Object Shape":"Boomerang","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","divs":["sighting detailsit was the night of christmas eve\\christmas morning at approximately 12:50 am, and my husband and i were out on the porch watching the sky, since we had seen a cigar\\rod shaped craft three days prior, and all of the sudden, i spotted an object that looked \"v\" shaped, with no actual lights that i could see, but again (like the last sighting) looked hazy and cloud-like (but a definite structure), and was following the same path as the last object we saw!! it looked huge..3 inches across from side to side, when measured with fingers, and again, completely silent. it was moving pretty fast, so the sighting didn't last long, and again wasn't able to get any pictures or video. since this is our second sighting within 3 days, i'm wondering if we are in a flight path of some kind?! i also wanted to make a correction from my last report..i said the object was seen between jupiter and orion, but i have come to learn what we were looking at was not jupiter, since jupiter is to the right of orion, and this was seen to the left of orion from our view. i'm a tad bit freaked, but i am watching now every night!! i would like to request ken pfeiffer as my field investigator, since i had spoken to him last week about the first sighting, if possible. thank you for your time."],"Object Features":"None"}