{"Longitude":"-79.251579","divs":["Sighting DetailsOne day my wife and I had just got home from grocery shopping,and as we got out of the car,for some reason,we both looked up at the same time and turned and looked at each other with disbelief...what we saw was a cigar-shaped UFO that looked like two chrome links of sausage touching together.We both watched it move from horizon to horizon,north to south,but when it got about a quarter of the way we also saw a jet,military most likely,trying to catch up to the UFO.It was easy to tell that the afterburners were on by the trail behind it! we watched this fruitless effort until we couldn't see it any longer.We took the groceries inside and put them away,neither of us saying a word.Then my wife says \"Lets go back out and see if we can see anything else!\" So we went back outside and as sure as I am breathing,we saw somthing coming from the south,in a direct line reverse of what we had previously seen.They at first looked like two black dots with a ball of light ahead of them.as they got closer,we could see that it was the same UFO,only this time being followed by two jets!I would say each crossing took about a minute and a half,more or less.We never spoke of it for a few years to each other or anyone else.We did a couple of years later and were scoffed at so we never brought it up again."],"Disposition":"Unresolved","Log Number":"US-12292011-0012","Tags":"City","Summary":"My wife and I saw a cigar-shaped fly over us twice!","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"12/29/2011 08:08 UTC","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Blairsville","There were no other sightings in Blairsville on or around July 8th 1994"],"Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/34376.html.txt","/var/www/straped/mufon/org/34376.html"],"Source":"MUFON","Object Features":"None","Object Flight Path":"Straight-line path","Object Shape":"Cigar","City":"Blairsville","Date of the Event":"07/08/1994 12:00 UTC","Case Number":"34376","map":"<A HREF = \"http://maps.google.com/maps?q=40.43843,+-79.251579(34376)&iwloc=A&hl=en\"> mufon case (34376) map </A>","Country":"United States","Latitude":"40.43843"}