{"Log Number":"US-12292011-0014","divs":["Sighting DetailsI was on I-70 in Missouri heading west, about the 46 mile marker on 12-29-11 around 4:40 pm. There are many radio towers with flashing lights in the area so I thought the object was a tower until I got closer. There was no tower but an object hovering no more than 50ft south of the highway roughly at the same height of the top of said towers. It was pointed east, parallel with the highway. As I got closer, I could tell it was a b2 bomber and I was waiting for it to fly by. As I drove closer I could tell, it wasn't moving at all. I drove under the object and was able to get a clear view of the outline, definitely a b2 bomber shape, but I have never seen one hover. The car next to me noticed, I saw them trying to take pictures. There was traffic so I did not stop. I drove a mile or so to the next exit and turned around. As I drove back, heading east, I could see in the distance, the object had not moved, it was still there. When I got within a half a mile, it took off at the speed I assumed it should be moving, only perpendicular to the the direction it had previously been facing. I headed south over a huge field and trees until I lost sight of it. The sky was overcast but there was plenty of light to see it fly for a few miles. I did not have a chance to get a photo. There was a lot of traffic, I know the cars around me saw it, many slowed down to look. If anyone else reports, I would love to know if the stories corroborate."],"trends":[],"Date of the Event":"12/29/2011 04:40 UTC","Summary":"It looked like a b2 bomber with one light on the tip of each wing that flashed","Country":"United States","Longitude":"-91.823833","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=37.972553,+-91.823833(34378)&iwloc=A&hl=en\"> mufon case (34378) map </A>","City":"Undisclosed","Disposition":"Unresolved","Object Shape":"Other","Source":"MUFON","Date Submitted":"12/29/2011 08:26 UTC","Object Features":"Wings","Viewing Distance":"101-500 Feet","Tags":"City","Region":"Missouri","Weather Factors":"Unknown","Case Number":"34378","Latitude":"37.972553","files":["/var/www/straped/mufon/html2text/34378.html.txt","/var/www/straped/mufon/org/34378.html"]}