{"Date Submitted":"12/30/2011 10:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.947912,+-118.374349(34389)&iwloc=A&hl=en\"> mufon case (34389) map </A>","Sighting Duration":"05:56:25","Object Features":"Unknown","trends":["There have been 4 other sightings in Inglewood","There were no other sightings in Inglewood on or around December 30th 2011"],"Disposition":"Unresolved","Country":"United States","Region":"California","Latitude":"33.947912","Case Number":"34389","Source":"MUFON","Date of the Event":"12/30/2011 05:56 UTC","Object Flight Path":"Straight-line path","Object Shape":"Circle, Oval, Star-like","City":"Inglewood","Longitude":"-118.374349","Summary":"I was going to work when i saw i light in the sky that was not an airplane.","Tags":"City","files":["/var/www/straped/mufon/html2text/34389.html.txt","/var/www/straped/mufon/org/34389.html"],"Log Number":"US-12302011-0004","divs":["Sighting Details I always really wonder if we were alone in the universe but now i seem to have got the answer no....we are not alone in the universe. my dad told me about an event that happend to him in the 60's this event took place in redondo beach c.a it was about 10:50 p.m he was outside when out of no where there was a huge super bright light hovering over him his sister and a couple of friends the circle shaped object made a wooa wooa sound and that it was going in a circle clolck wise. This was at a top of a hill top where the house was at.The light left to the side really fast and them it was a small dot in the sky then came back to them really fast big and bright again they called their dad and hen he finally came out the object went up and was gone. the next day they reported it to the news who road a story about the insident. when i woke up to go to work about 5:30 am friday i went outside to my truck to warm it up i was there with my next door neighbor when i was talking to him about how it still like night i was looking at the sky when i notice a ball like shape in a 45 degree angle it was bright like a star an moving in a staight line. we both saw it them we said that it coulnt be an airplane because we saw airplane too an they had a flasing ligh red and blue we live by the airport path so i know an airplanes looks. This was not an airplane this shape was going from right to left then like at 6:00 am we saw another identical shape go from the front of us to the back to the horizon this was real and i know we are not alone."],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile"}