{"Object Flight Path":"Straight-line path","Object Features":"None","Summary":"3 orange orbs or fireballs fly in formation over Seattle (Capitol Hill/Madison Valley) last night December 26, 2011 at around 2:17 AM.","Case Number":"34385","Sighting Duration":"Undisclosed","Date of the Event":"12/26/2011 02:17 UTC","City":"Seattle","Region":"Washington","Longitude":"-122.328611","Latitude":"47.6092","files":["/var/www/straped/mufon/html2text/34385.html.txt","/var/www/straped/mufon/org/34385.html"],"Object Shape":"Fireball","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.6092,+-122.328611(34385)&iwloc=A&hl=en\"> mufon case (34385) map </A>","Date Submitted":"12/30/2011 01:50 UTC","Source":"MUFON","Log Number":"US-12302011-0001","divs":["Sighting DetailsLast night, as I was walking the dog, I noticed a single orange light coming towards me from the southwest and traveling overhead to the northeastern part of the sky. At first I thought it was some kind of low flying plane or helicopter, but it was fuzzy in appearance and flaring outward in all directions. It moved slowly. Soon afterwards it flew directly over me, and behind the cloud deck off to the northeast. Next about 20 seconds later, I saw two more orange lights traveling in formation, heading on the same course as the first object. The two objects appeared from the same direction, same course, same speed, and same altitude, flying in a single file pattern. As I tried to get a closer look at them, I noticed that each was a fuzzy, glowing, light orange ball or orb. They did not appear to have any solid noticeable center, and their outlines were faint and semitransparent (almost halo-like). These objects made no sound at all, had no beacons or flashing lights on them, and just seemed to float along. Their speed would be equivalent to a small plane or helicopter. They were not moving very fast. But these lights were definitely not aircraft. I have no idea how large they may have been or how far away they actually were. What is interesting is that when the objects were directly overhead, I noticed a slight wobble and floating movement (unconventional propulsion), in which one of objects moved slightly away from the other one, slowing down for a moment and then speeding up again to meet back in formation with the other object. After a few seconds they continued to travel at the same speed towards the northeast. My thoughts were that these two strange orange orbs were following, or catching up with the first orange orb."],"Weather Factors":"Unknown","trends":["There have been 110 other sightings in Seattle","There was one other sighting in Seattle on or around December 26th 2011"],"Viewing Distance":"Unknown","Disposition":"Unresolved"}