{"map":"<A HREF = \"http://maps.google.com/maps?q=39.392911,+-76.608055(34384)&iwloc=A&hl=en\"> mufon case (34384) map </A>","City":"Towson","Summary":"3 LIGHTS STATIONARY ON HORIZON IN FORM OF TRIANGLE AND FADED OUT ONE BY ONE. ABOUT 100 TO 300 FT APART FOR EACH LIGHT.","Case Number":"34384","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting details1. i was comming from york. pa on 695 e and i was in the towson\\ parkville area going about 70 mph. i happened to look to the left on the horizon which the overpass i was on crosses joppa road which seems to be on a hill and noticed 3 lights in perfect distance in the sky. the lights seem to be a triangle when you directly look at it. i glanced again and noticed it was still there, i looked again since 695 was heavy and noticed the bottom light go out and then the top and left bottom light go out. it lasted from 1 minute to 2 minutes. then it was gone. 2. i looked over to the left because i noticed a brighter light. 3. i first thought that it might have been a helicopter hovering and turned on its search light but there was no path of light. and then i noticed two other lights stationary and seem to have equal distance. 4. i couldn't tell if it was an actual object it only appeared to be form an object due to the placement of the lights. the lights when out from botom r, top, and then bottom left. there was no discoloration in the middle that i noticed but then i was driving also. 5. i felt that these lights seemed out of place and it appeared to be equal distance apart and big in the sky. i kept looking to see if it was an aircraft or helicopter. after the sighting i felt i witnessed something out of the ordinary but i cannot conclude what i had seen. i called my wife and friend and told them about the event i witnessed. i wanted to stop and take a picture but 695 was too busy with speeding traffic. 6. i lost sight of the object as i drove past but the lights appeared to be going out."],"files":["/var/www/straped/mufon/html2text/34384.html.txt","/var/www/straped/mufon/org/34384.html"],"Country":"United States","trends":["There have been 4 other sightings in Towson","There were no other sightings in Towson on or around December 26th 2011"],"Region":"Maryland","Object Shape":"Triangle","Disposition":"Unresolved","Longitude":"-76.608055","Object Features":"Unknown","Date of the Event":"12/26/2011 07:30 UTC","Object Flight Path":"Stationary","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-12292011-0020","Date Submitted":"12/29/2011 11:49 UTC","Latitude":"39.392911","Weather Factors":"Unknown","Tags":"City"}