{"Date of the Event":"12/30/2011 05:45 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Maryland","Sighting Duration":"00:05:00","divs":["sighting detailsrunning in a country store left home at 5:45am noticed red and white lights in the distance thinking it was a new tower when i pulled in parking lot it kept coming closer, slowly passing over i saw a square shaped object with white and red lights on each corner saw something of rings maybe, on the bottom or circles for design, engine i'm not sure could also see the rim of the side. higher than the trees going toward the dam in a southwesterly direction i got the store manager then the cashier came out we watched it slowly going away. we were surprised how close with no noise, and the shape being square it seemed odd looked up on the internet and saw others saw something close to what i'd seen. 12\\30\\11 just at dawn no sunshine yet sky was light enough to really make the object stand out i didn't have zoom on my phone camera"],"Country":"United States","Source":"MUFON","Disposition":"Unresolved","Date Submitted":"12/30/2011 06:32 UTC","City":"Baltimore","trends":["There have been 65 other sightings in Baltimore","There was one other sighting in Baltimore on or around December 30th 2011"],"Summary":"white and red lights a mile awya seemed like a new tower but it slowly flew in a line was square got a store manager and cashier we watched it go slowly sw direction seemed to have rigs on bottom saw sides as sun was comming up metal odd shape for flying","Object Shape":"Diamond, Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=39.649247,+-76.700728(34396)&iwloc=A&hl=en\"> mufon case (34396) map </A>","Log Number":"US-12302011-0010","Object Features":"Other","Case Number":"34396","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-76.700728","Latitude":"39.649247","files":["/var/www/straped/mufon/html2text/34396.html.txt","/var/www/straped/mufon/org/34396.html"]}