{"Region":"Mississippi","trends":["There have been 4 other sightings in Ocean Springs","There were no other sightings in Ocean Springs on or around December 30th 2011"],"Date Submitted":"12/30/2011 09:23 UTC","Weather Factors":"Unknown","Source":"MUFON","City":"Ocean Springs","Latitude":"30.41581","Disposition":"Unresolved","Sighting Duration":"00:00:20","divs":["Sighting DetailsAs I got out of my car to go inside of my house my eyes caught something to the south that made me look. At first I didn't see anything but clear dark night sky. Suddenly my eyes caught a soft white glow moving behind the neighbor's treetop. It was bizarre I had no idea what I was looking at. It was moving across the sky in a straight line. I almost couldn't see it but it had a soft white glow. I thought it was a fast moving cloud in the night sky but no other clouds are visible, clear skies. And I have never seen a cloud move that fast. The shape reminded me of a bomber but with no wings. It did have a very prominent \"tail\" like a bomber would. I heard no sounds from its direction. I watched it fly across the horizon for about 20 seconds and then it was gone behind the treeline, moving east. It might sound crazy but it really looked like a ghostly image. I also thought it might be some kind of a cloud but it kept its shape the entire time I watched it. It could have been a smoke cloud from someone's fire but I've never seen smoke in such a shape or moving so fast and in a direct flight path when I felt no wind."],"Longitude":"-88.819646","Summary":"White, cloud-like, soft white glow, vaguely bomber plane shape with no wings but with tail","files":["/var/www/straped/mufon/html2text/34402.html.txt","/var/www/straped/mufon/org/34402.html"],"Object Features":"Other","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.41581,+-88.819646(34402)&iwloc=A&hl=en\"> mufon case (34402) map </A>","Date of the Event":"12/30/2011 07:50 UTC","Country":"United States","Viewing Distance":"Unknown","Case Number":"34402","Object Shape":"Other, Unknown","Object Flight Path":"Straight-line path","Log Number":"US-12302011-0016"}