{"Case Number":"3440","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"05/19/2005 02:41 UTC","Tags":"City","Log Number":"","Viewing Distance":"Unknown","Disposition":"IFO","divs":["Sighting DetailsSighting Report: On Wednesday, 18 May 2005 at approximately 2000 hours (8PM) I exited the library on Holloman Air Force Base and noticed a large bright semi-circular spot in the sky. It appeared to be approximately 5 times bigger than the largest stars that are usually present. The moon was out and to my right when viewing the object. No stars were yet visible. It was still light out. The object reflected white light like a star and remained stationary. It did not appear to be completely circular. I entered my vehicle and drove home (approximately .5 mile away) watching the object the entire time. I am familiar with the jets on base and did not see any of them in flight. Once home I watched the object until about 2010 hours and entered my home. I exited to view the object some more around 2020 and observed that the object was gone. It was considerably darker now and stars (much smaller) were present. I called the USAF Security Forces Police station (of which I am a member) to report the sighting and they related to me there was a previous caller that also reported the same. The sky was clear before and after the sighting. I know this is near an Air Force base; however I feel this was not a conventional aircraft due to the stationary nature and its apparent size. -Christopher R. Ahumada, SSgt, USAF 49th Security Forces Squadron Patrolman"],"Date Submitted":"05/19/2005 02:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.851387,+-106.102219(3440)&iwloc=A&hl=en\"> mufon case (3440) map </A>","Object Features":"Unknown","Weather Factors":"None","Latitude":"32.851387","files":["/var/www/straped/mufon/html2text/3440.html.txt","/var/www/straped/mufon/org/3440.html"],"Object Shape":"Sphere","Source":"MUFON","City":"Holloman AFB","trends":["There have been no other sightings in Holloman AFB","This sighting has never been favorited."],"Summary":"Not Provided","Longitude":"-106.102219","Object Flight Path":"Stationary","Region":"New Mexico"}