{"files":["/var/www/straped/mufon/html2text/34418.html.txt","/var/www/straped/mufon/org/34418.html"],"Summary":"A large U.F.O. quietly glided over my head, cloaking against clouds and the light from the half-moon","Longitude":"-105.087335","Region":"Colorado","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was standing on the sidewalk downtown Old Town Arvada, and while talking on the phone I was looking at the clouds as visible by the half moon that night. One cloud caught my attention because it appeared to be shape shifting. As I continued to observe and look for a clarification, it appeared that the cloud wasn't moving, but an object was gliding under the cover of the clouds. Denver has very large low hanging clouds. This object would be estimated to be 1000 feet wide or larger. It appeared for 30 seconds from the time I saw it overhead until it vanished quietly in the night sky. My conclusion was that this craft was only seen because of the contrast from the low hanging clouds and the half moonlight creating a difficulty to cloak itself. It had no lights of any kind, and I heard no sounds from the night sky. To place a comparison, there were Jets flying so high that night that were barely visible, but yet a sonic roar across the sky could be heard. I have a professional background in the field of observations and inspections, so I have a very skilled and trained eye with a phenominal reputation for accuracy and intergity. I am always searching for the truth, and would be willing to speak with MUFON an my eyewitness account. This sighting date and timelines I can look up by my trail of texting friends that night."],"Disposition":"Unresolved","Source":"MUFON","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around November 3rd 2011"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.798386,+-105.087335(34418)&iwloc=A&hl=en\"> mufon case (34418) map </A>","Date Submitted":"12/31/2011 01:52 UTC","Log Number":"US-12312011-0002","Country":"United States","Case Number":"34418","Object Flight Path":"Straight-line path","Date of the Event":"11/03/2011 08:55 UTC","Object Shape":"Triangle","Object Features":"Patterned Surface","City":"Arvada","Latitude":"39.798386","Weather Factors":"Unknown"}