{"Object Shape":"Other","Region":"Arizona","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsMy friend & I left Flagstaff, AZ heading south towards Phoenix on I-17 @ about 1:20pm. At 2pm I was in the far left (fast) lane & joked with my friend about the Sedona 'wanna-be' \"Hollywood\" sign on the mini-mountain to my right. My friend said \"that's the landmark just prior to the exit we needed to get off of. He told me to move over to the far right lane. At that moment my car radio went to static. Since I needed to pay attention to the traffic & move to the far right lane I asked him to tune the radio while looking at it. I looked up in to my rear view mirror only to see 5 white compact cars behind me. I mentioned that it was odd asking him \"where did all of the traffic go?\" All 5 cars passed me on the left. I noticed all 5 cars had Nevada plates. A few seconds later I saw a freeway sign that said Kingston - 50 miles. I asked my friend \"isn't Kingston near Laughlin, NV?\" I came to a crest of freeway only to view Laughlin which bordered Bullhead City, CA. At that point I realized I was now heading West on I-40. Freaked out, I pulled over & we both paced the side of the road trying to figure out how we got there. We got back in the car & turned around heading East on I-40 & came upon a van. I honked & my friend asked the driver what time it was. It was 5:30pm, 3 hours & 20 minutes had passed. To this day, I've heard 3 other stories of missing time on this stretch of road, one of which was from a trucker. Truckers had to log there time & miles. This confirmed we were not crazy. It's been nearly 18 years since this incident. Neither of us experienced any physical or psychological trauma. I would like to know if anyone else can't relate to what happened to us or explain it. I'm still curious. Thank you."],"City":"Sedona","Latitude":"34.87776","files":["/var/www/straped/mufon/html2text/34414.html.txt","/var/www/straped/mufon/org/34414.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.87776,+-111.75431(34414)&iwloc=A&hl=en\"> mufon case (34414) map </A>","Disposition":"Unresolved","Case Number":"34414","Sighting Duration":"Undisclosed","Date of the Event":"02/01/1994 02:10 UTC","Date Submitted":"12/30/2011 11:06 UTC","Log Number":"US-12302011-0022","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around February 1st 1994"],"Object Features":"None","Longitude":"-111.75431","Summary":"There was no UFO sighting. A missing time event occured","Source":"MUFON","Tags":"City","Object Flight Path":"N/A","Viewing Distance":"N/A"}