{"trends":["There have been 24 other sightings in North Myrtle Beach","There were no other sightings in North Myrtle Beach on or around October 18th 2007","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Case Number":"34415","Date Submitted":"12/30/2011 11:34 UTC","Object Features":"Unknown","divs":["sighting detailshad arrived at a restaurant\\bar on the beach in north myrtle beach, south carolina at the corner of 17th ave south and ocean blvd. at about 7:00 or so on october 18th, 2007 and had been there for less than an hour (and less than two beers) when several of us noticed several lights out over the ocean. i \\ we did not really think much of it at first until the light began to pulsate and move. at times there would be one light (starlike in color and shape) then it would disappear and then reappear enlarged and orange in color. the orange color would disappear and then two, three or four lights would appear and pulsate from a small silver dot to an orange orb. after a half hour or so the lights took off at about 45 to 60 degree angle heading north and then west over the land then took a southern heading at a speed too fast to be an airplane or helocopter. not quite the speed of a shooting star but similar. one clown in the crowd said that it had to be a boat out over the water shooting off flairs!!! - i really wish that was the case.....i am here to tell you that ufo's exist i know what i seen and i am more concerned than excited. i wish that i had taken the time to have written down and documented the event at the time that it had happened four years ago. i did not know who to tell or where to document my sightings until now while flipping thru the channels and finding a show called ufo's over earth and did a google search for mufon the host of the show."],"Country":"United States","Tags":"City","Latitude":"33.824986","Date of the Event":"10/18/2007 12:00 UTC","Log Number":"US-12302011-0023","Weather Factors":"Unknown","Region":"South Carolina","Object Shape":"Circle, Star-like","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.824986,+-78.676486(34415)&iwloc=A&hl=en\"> mufon case (34415) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34415.html.txt","/var/www/straped/mufon/more/34415_submitter_file1__UFOSightingsMultipleLights(2)NMB10-18-07008.jpg","/var/www/straped/mufon/org/34415.html"],"Longitude":"-78.676486","Summary":"From 1 to 5 lights intermittantly on and off from a point of silver light to a glowing orange color hovering over the ocean","City":"North Myrtle Beach","Viewing Distance":"Unknown","Source":"MUFON"}