{"Case Number":"34421","Object Flight Path":"Hovering then path","trends":["There have been 3 other sightings in Mattoon","There were no other sightings in Mattoon on or around August 20th 2002"],"Object Features":"Unknown","Tags":"City","Disposition":"Unresolved","Country":"United States","Log Number":"US-12312011-0005","Summary":"UFO sighting in Mattoon, IL","Date Submitted":"12/31/2011 02:21 UTC","divs":["Sighting DetailsIt was a lovely middle August evening, and I was home playing a game of cards with my mother while also watching the television sporadically. At the time we lived in a low income housing project set up like a very long cul-de-sac of duplex apartment buildings. The sun had just set and we were enjoying our card game when the cable service went out. I thought to myself, \"Ah, this is just a random cable outage\", and didn't really give it a second thought. Then around 5 or 10 minutes after the cable went out, the power went out as well. It was a clear night, so it wasn't an outage from a thunderstorm and we rarely get brownouts, let alone blackouts even in the height of summer. I decide to carefully work my way through the dark house and get a look out the kitchen window. At this time I was beginning to become a litte more concerned because this was becoming a rather unusual circumstance, as the entire neighborhood and surrounding area as far as I could see was pitch black. About 5 minutes or so passed from the time the power in the apartment went out to when it came back on, but all of the street lights in the area remained out as well as some of the homes visible across the small field. Some of the housing project tenants were outside talking to each other, most likely about the outage and I never did go outside myself to get a real good look around (regrettably). I went back to my bedroom and looked out the windows to see if I could see any type of lights on anywhere in those directions to figure out how widespread this outage was. As I looked out the southward facing window in my bedroom, I noticed a light in the sky towards the southeast that seemed very out of place. I had always been fascinated by the night sky for as long as I could remember and was very good at telling the difference between stars, planets, comets, planes, helicopters, satellites, etc, and the light in the sky resembled none of the above. I even opened my window to listen outside to see if there was any noise coming from the direction of the light in the sky, just to be positive that it was not a helicopter searchlight and I could discern nothing audible coming from that way. This just confirmed my initial thoughts that this didn't fit the appearance a helicopter searchlight, because there is a visible shaft of light that comes down in the direction it is pointed, and this object was just a stationary sphere of light hovering in place. I wasn't able to very accurately gauge the distance away from my apartment that this object was, but it was roughly a mile or two away at the most and around about a mile up in the air possibly. From my perspective, it was around 45-55 degrees above the horizon. It was larger than a star by roughly tenfold, but it didn't shine much brighter than one. I watched the light just sit in one place for at least 45 minutes, maybe an hour at most. The whole time that I am watching it, I am pleading to my mother to come and see this light so that I can have at least one other witness to corroborate this event. Finally, I was able to convince my mother to come and observe the light through the window. No more than a minute or so after my mother got to the window and observed it as well, the light just accelerates towards the northwest directly over the apartments at an unknown, but very high rate of speed and was long gone before I even had a chance to get to another vantage point. I wasn't able to see whether or not it was ascending as it shot off in the northwesterly direction, so I have no clue where it headed after that initial rapid acceleration. I really wish I had owned a camera or camcorder at the time, I would have loved to have recorded this occasion in another location besides my still vivid memory of the event. Maybe someone besides me and my mother witnessed this as well and had the privilege of filming it, but I won't get my hopes up."],"City":"Mattoon","Latitude":"39.481636","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Shape":"Sphere, Star-like","Weather Factors":"Unknown","Sighting Duration":"01:00:00","Date of the Event":"08/20/2002 08:00 UTC","files":["/var/www/straped/mufon/html2text/34421.html.txt","/var/www/straped/mufon/org/34421.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.481636,+-88.401821(34421)&iwloc=A&hl=en\"> mufon case (34421) map </A>","Region":"Illinois","Longitude":"-88.401821","Source":"MUFON"}