{"Object Shape":"Cigar","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path,Path with directional change","Country":"United States","Case Number":"34431","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34431.html.txt","/var/www/straped/mufon/org/34431.html"],"Region":"Missouri","Date Submitted":"12/31/2011 04:18 UTC","Tags":"City","trends":["There have been 10 other sightings in St Joseph","There were no other sightings in St Joseph on or around December 15th 2011"],"Weather Factors":"Unknown","Log Number":"US-12312011-0015","Longitude":"-94.786644","Object Features":"Window(s)","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=39.829062,+-94.786644(34431)&iwloc=A&hl=en\"> mufon case (34431) map </A>","divs":["sighting detailsi'm in saint joseph, and last night i saw a ufo around 7:40pm. it was very low (under 1000ft) off the ground, and it slowly flew overhead, heading north eastish. from what i could see, it was cigar shaped. it had 2 lights, a green one at the front and an orange one at the back. i know it wasn't a plane, because it was travelling in the direction of the green->orange light. it probably went about 5-10 miles, then it started changing directions. first it would move left, then right, then forward, then back. and it was moving without making the turns a regular aircraft would make. probably watched it for about 10 minutes or so (unfortunately it was too far away to get any pictures or video of). when it was flying overhead, there was another low flying plane about 500-1000 ft above\\behind it, however it took a different path, and both plane\\ufo went in different directions. the ufo lights i saw for some time, however the plane went out of sight within a couple of minutes, however the ufo lights continued to move back\\forward\\left\\right."],"Date of the Event":"12/15/2011 07:45 UTC","City":"St Joseph","Latitude":"39.829062","Summary":"Cigar shaped object flew overhead, flew in a straight line, and ascended. Then it moved left/right/forward/back for some time."}