{"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Longitude":"-88.938792","Date of the Event":"08/25/1961 12:00 UTC","Tags":"City","Country":"United States","Latitude":"38.030692","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/34433.html.txt","/var/www/straped/mufon/org/34433.html"],"Case Number":"34433","Region":"Illinois","divs":["Sighting DetailsThis happened to me when I was a six year boy. In late August in 1961, my mother and I went to my grandparents house out in the country. This is a few miles out of our home town. They were out of town on a trip, so I went with my mother out there to feed the dogs and water the inside plants. This was late in the evening just before dusk. I was outside playing while she was in the house. I was looking to the north across the road and I saw a silver disk shaped object coming toward me. It flew over the house and towards the back. There is a driveway between the garage and barn. It came down and hovered between them. It was hovering about 15 to 20 feet from the ground. It was silver in color with a dome and round windows. I could hear a humming sound. I watched it for a few minutes, then started walking towards it. About that time my mother was looking out the window and saw me moving towards the craft. She came out the back door and yelled for me to stop and began coming towards me. As she approached me, the disk began to rise back up slowly into the sky. It then flew off towards the east and was gone. This was just the beginning. A short time later I had a man in black experience. Through the years my family and I have had several encounters. We never told this to people because of what they might say. I am getting older now and I think it's time to speak out."],"Object Features":"Dome, Window(s)","Sighting Duration":"Undisclosed","Log Number":"US-12312011-0017","trends":["There have been 3 other sightings in Benton","There were no other sightings in Benton on or around August 25th 1961"],"Summary":"Hovered near me for a few minutes","City":"Benton","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=38.030692,+-88.938792(34433)&iwloc=A&hl=en\"> mufon case (34433) map </A>","Date Submitted":"12/31/2011 06:11 UTC","Object Shape":"Disc"}