{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.834145,+-76.181526(34448)&iwloc=A&hl=en\"> mufon case (34448) map </A>","Summary":"Glowing red ball of light that hovered, then went down slowly.","Viewing Distance":"Over 1 Mile, Unknown","Region":"Virginia","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around January 1st 2012"],"Weather Factors":"Unknown","Object Features":"Unknown","Tags":"City","Case Number":"34448","Object Shape":"Circle, Disc, Fireball, Flash, Saturn-like, Sphere","Date of the Event":"01/01/2012 12:00 UTC","divs":["Sighting Details228 Coventry Road: I was coming back from a new years eve party. I was getting out of the car to go inside (in the passenger seat), and when I looked out my passenger side window, there it was. I yelled for my mom to look because she was getting out of the car as well. We both darted behind the car, and stood in our drive way completely mesmerized by the motionless, hovering, ball of red light. After about 5 or 10 second of watching, the hovering ball of light slowly lowered. It didn't zig zag or anything, simply just lowered. The SECOND it began to lower, the quiet neighborhood all at once became loud with every single dog barking. It was so weird because they all started barking at the exact same time, when it started lowering. It was like it was rehearsed. It went below the trees after about 15 or so seconds of watching it. Since I couldn't see the light anymore, I ran inside and immediately called my boyfriend to see if he could see it (he was on Iroquois Road)and he went outside and said yes, he could see it. He told me it was red, pretty small and looked like a glowing red star (Which is odd because it was HUGE when my mom and I saw it) And he said it was going up at an extremely fast pace. He told me he lost sight, but said he'd keep an eye on it, and I never heard anything more of him. I've spent so many hours of my life watching alien shows,and I never thought I would actually be the one entering my report to MUFON myself. This is a sighting I will never forget. It's changed my life."],"Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/34448.html.txt","/var/www/straped/mufon/org/34448.html"],"Date Submitted":"01/01/2012 12:57 UTC","City":"Virginia Beach","Country":"United States","Latitude":"36.834145","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-01012012-0004","Longitude":"-76.181526"}