{"Case Number":"34444","Summary":"Thought it was the front of a jet coming down from the sky...waited for it to crash in our little lake and it completely disappeared. Unbelievable!","Country":"United States","Longitude":"-77.287457","Sighting Duration":"00:01:00","Weather Factors":"Unknown","Tags":"City","Latitude":"41.727081","trends":["There have been 4 other sightings in Wellsboro","There were no other sightings in Wellsboro on or around June 3rd 2011"],"Disposition":"Unresolved","Date Submitted":"12/31/2011 11:25 UTC","Object Flight Path":"Undisclosed","Date of the Event":"06/03/2011 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.727081,+-77.287457(34444)&iwloc=A&hl=en\"> mufon case (34444) map </A>","Region":"Pennsylvania","Object Shape":"Cone, Triangle","Log Number":"US-12312011-0028","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/34444.html.txt","/var/www/straped/mufon/org/34444.html"],"Source":"MUFON","City":"Wellsboro","Object Features":"Other","divs":["Sighting DetailsI was talking to my daughter on the phone around 9 p.m. On June 3, 2011. I was sitting sideways on my sofa and looking out the large window in my living room. The moon was in the left upper side of the window, the sun had just set and there were those silvery, grayish clouds that seem to follow the sunset. Our house is across the road from a small lake and I was looking at the moon, the sky and the water. Please note that it was still daylight and the sky was blue above the sunset. Suddenly from the upper left corner of the window came an object that I instantly thought was the entire nose cone and part of the body of a jet that was falling from upper left to lower right. I quickly realized that the cylindrical back part was flat and not broken off from a larger part as I had thought. I yelled out to my daughter on the phone that I had to hang up. I waited for it to crash either into the hill behind the back of the lake or crash into the lake itself. I braced myself for an enormous explosion. All at once it disappeared into thin air. I could not believe my eyes. I called our local radio station to no avail. I eventually reported it to an airport 65 miles away."]}