{"Sighting Duration":"Undisclosed","City":"Albuquerque","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34446.html.txt","/var/www/straped/mufon/org/34446.html"],"Object Features":"Other","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","Object Flight Path":"Path with directional change","Region":"New Mexico","Date Submitted":"01/01/2012 12:24 UTC","Latitude":"35.069613","Case Number":"34446","trends":["There have been 129 other sightings in Albuquerque","There was one other sighting in Albuquerque on or around December 31st 2011"],"Object Shape":"Circle, Egg, Fireball, Oval, Sphere","Longitude":"-106.645488","Weather Factors":"Unknown","Tags":"City","Summary":"Green/White UFO traveling north at an impossible speed and then turned direction to go west where it flew from sight.","divs":["sighting detailsi was driving home at night at about 8:15pm, going about 35mph, and was slowing to stop at a red light. i was the first car in my lane with two vehicles on either side of me. as i slowed to a stop my passeger abruptly asked \"whats that?\" i immediately spotted the greenish white object sailing through the sky going north. the object appeared to be comet like, in that it had a tail. the object emitted a glow around itself that was brighter than all the objects around it. i was facing west as i witnessed the object moving north. the object traveled about 1\\4 of a mile north (from when i spotted it) and then it turned west, with the tail curving as well. the movements of the object were smooth and precise. the object, which was traveling incredibly fast, made no noise. after the object turned west i watched it as it faded from sight in the distance. the object was about 400 ft in front of me and was about 200 feet in the air. the object, in reference to street lights, was big because it was the same size as the streetlight (which i was about 3 car lengths away from) even though the object was about 400 feet away from the light. while i was watching the object i thought for a moment that it could be a missile of some sort, but the object was round, glowed greenish white, and made no noise. my feelings while watching the object were somewhat astonishment and surprise. i did not feel scared, or experience paralysis. i have seen many planes and helicopters, but this object was like nothing i have ever seen before."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.069613,+-106.645488(34446)&iwloc=A&hl=en\"> mufon case (34446) map </A>","Date of the Event":"12/31/2011 08:15 UTC","Source":"MUFON","Log Number":"US-01012012-0002"}