{"Tags":"City","Date Submitted":"01/01/2012 01:21 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.958575,+-82.454068(34450)&iwloc=A&hl=en\"> mufon case (34450) map </A>","Source":"MUFON","Latitude":"27.958575","Summary":"Two Twinkling Starlike objecting hovering over Tampa,FL NewYears eve","Date of the Event":"12/31/2011 10:30 UTC","trends":["There have been 105 other sightings in Tampa","There were 4 other sightings in Tampa on or around December 31st 2011","This sighting has never been favorited.",""],"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Star-like","Object Flight Path":"Stationary,Hovering then path,Other","files":["/var/www/straped/mufon/html2text/34450.html.txt","/var/www/straped/mufon/more/34450_submitter_file1__iPhonemap.jpg","/var/www/straped/mufon/more/34450_submitter_file2__iphonecompass.jpg","/var/www/straped/mufon/org/34450.html"],"City":"Tampa","Log Number":"US-01012012-0006","Disposition":"Unresolved","Sighting Duration":"02:00:00","Country":"United States","Region":"Florida","Longitude":"-82.454068","Case Number":"34450","divs":["sighting detailsi was over at few friends of my family. we were outside playing pool. i seemed to be the only one to notice this object everyone else was to busy to notice anything. i was not drinking on new years. there had to be more than one person to see it in the tampa area not just me. i looked to the south-southwest about 170-176 degrees and saw an starlike object just barley over the treetops. first i thought i was seeing things because i just got off work and i was tired. so i rubbed my eyes a few times and it was still there. slowly but barley hovering to left and right. also up and down. it was twinkling white blue and green. it moved up higher behind the treeline later on. it was there for two hours in that general vicinity. i looked towards the south west and saw another star like object twinkling in a amberish\\red color it was doing the same things. there were inbound aircraft in the area but they did not move or look like this object did"]}