{"Latitude":"39.701733","Disposition":"Unresolved","Object Shape":"Fireball","Weather Factors":"Unknown","Case Number":"34456","Date of the Event":"01/01/2012 12:00 UTC","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=39.701733,+-82.426822(34456)&iwloc=A&hl=en\"> mufon case (34456) map </A>","City":"Bremen","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in Bremen","There were no other sightings in Bremen on or around January 1st 2012"],"Tags":"City","divs":["Sighting DetailsI was leaving from a NYE gathering with a large group of people shortly after midnight, yes, sober, mix of adults and children. One fella pointed up on this particularly clear night and said \"look at that!\" we all saw orange-red 'fireball's\" coming over the treetops in a perfect line, faster than an airplane or a helicopter, but slow enough it looked deliberate. At first we saw two, then a third and a fourth. They sped their way from the south headed northwest and we ran up a small hill for a better view, two of us pulled out our phones trying to capture this, but nothing would show on the screens. One guy yelled for another adult to come out to watch. The fourth ball of light bobbled in a short up& down fashion. As they crossed our viewing area, the third ball seemed to wane in color and eventually disappear from sight. When we thought they had all passed, maybe a minute had gone by, two more came from exactly the same direction- heading in the same direction. It was commented as odd that their flight pattern was so close, low and without a single sound! Since we were leaving anyways, I got in my car and drove to the very top of the ridge, that is all farm land and pulled over to watch the last two fly overhead (as the visibility stretched probably 20miles in that direction.. Tho as the third ball had done, the last two disappeared from sight. I felt queasy and like my body siddenly weighed 10x's more than ot does, & my son immediately complained of a major headache and started vomiting within the next 10minutes. There were about 10 of us that witnessed this. Cool stuff. (((Happy new years!)))"],"Country":"United States","files":["/var/www/straped/mufon/html2text/34456.html.txt","/var/www/straped/mufon/org/34456.html"],"Source":"MUFON","Log Number":"US-01012012-0012","Longitude":"-82.426822","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"6 fiery balls moving in a line across the sky moving northwest","Date Submitted":"01/01/2012 01:59 UTC","Viewing Distance":"501 Feet - 1 Mile"}