{"map":"<A HREF = \"http://maps.google.com/maps?q=38.235807,+-86.524498(34466)&iwloc=A&hl=en\"> mufon case (34466) map </A>","Date Submitted":"01/01/2012 05:23 UTC","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface, Appendage(s)","Weather Factors":"Unknown","City":"EVANSVILLE","Latitude":"38.235807","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34466.html.txt","/var/www/straped/mufon/org/34466.html"],"Date of the Event":"01/01/2012 02:35 UTC","Region":"Indiana","Log Number":"US-01012012-0022","Object Shape":"Chevron, Sphere, Star-like, Triangle","Longitude":"-86.524498","Summary":"IT WAS HEADING STRAIGHT AT ME VERY LOW FROM NORTH TO SOUTH 500 YDS TURNEDON ITS SIDE HOVERED HEADED DUE WEST VERY BRIGHT SMOOTH LIGHTNING WHITE RODS HUES OF RED INTO DISTANCE STOPPED TWINKLED AND FLASHED PULSATING FADED OUT HEADING TWARDS MT.VERNON, INDIA","divs":["Sighting Detailsi HAD JUST DROPPED MY WIFE OFF AT THE HOUSE AND WAS RUNNING MY FRIEND DAVE HOME, HE LIVES IN FOXFIRE APTS. i DROPPED MY BUDDY OFF AND WAS STOPPED AT THE LIGHT AT LLYOD EXPRESSWAY, HEADING SOUTH TO NORTH, JUST AS I CROSSED THE INTERSECTION THERE IT WAS, AT FIRST I THOUGHT IT WAS AN AIRPLANE AS IT APPROACHED IT GENTLE TURNED TO ABOUT A 30 DEGREE. AT THIDS POINT IT WAS VERY CLOSE TO ME, IT REALLY CAUGHT ME OFF GUARD MY GOD I WISH I COULD HAVE TAPED IT OR FILMED THE OBJECT. THIS BABT WAS BIG AND IT SEEMED TO JUST GLIDE THE SUPER BRIGHT LIGHT RODS ON THE CRAFT I COUNTED 6 WERE BRILIANT AND LUMINATED IN A DISTINT PATTERN AS IT BANKED AND CHANGED DIRECTIONS NO MORE THAN A COUPLE HUNDRED FEE OFF THE GROUND, LESS THAN A COUPLE HUNDRED YARDS RIGHT IN FRONT OFF ME. i COULD SEE IT PLANE AS DAY. THIS OBJECT HAD SOME SERIOUS MASS TO IT, IT MADE NO SOUND AND HAD NO VISIBLE EMISSIONS TRAIL. iT FLEW LOW AND STAYED LOW WHAT BELEW MY MIND IS AS IT FADED OUT OF SITE IT STOPPED DID A QUICK DAZZLE AND DISAPPEARED IN THE DISTANCE TWARDS mT.VERNON iN. IT WAS NO HELICOPTER OR PLANE IT WAS AMAZING ICANNT GET IT OUT OF HEAD WHERE DID IT COME FROM AND WHAT WAS IT DOING?"],"Case Number":"34466","trends":["There have been 27 other sightings in EVANSVILLE","There were no other sightings in EVANSVILLE on or around January 1st 2012"],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Country":"United States"}