{"Longitude":"-81.586872","Date of the Event":"08/01/2009 07:21 UTC","Tags":"City","Summary":"Huge triangles with red lights that change random colors when,stationary","Region":"Ohio","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.4453,+-81.586872(34465)&iwloc=A&hl=en\"> mufon case (34465) map </A>","files":["/var/www/straped/mufon/html2text/34465.html.txt","/var/www/straped/mufon/org/34465.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsI first seen the object in 2009 after I was leaving a friend house gettin a tattoo. I looked up in the sky & seen a blinking light the size of a quarter & I thought it was a star. But I thought about it & I told myself stars aint that big but I decided 2 let it go. But I just kept on seeing it... I have seen up to11 of them... They hover around every single day silently for 2 years now like they are plotting in something.... But u guys can give me a call & I can explain a whole lot of more details & if you guys can come out here you can see for yourself... I can show u all they setup points & fly around spots. I see them through my binoculars I even seen an invisible one. It flew over my head in broad day light on my,way 2 work. At first it was a glowin light from a distance just hovering but then it started to fly over me thats when u noticed it was 2 blinking lights on a invisible shell.. It was invisible in the light but u can still see. Please call me (216)956-4144 THANK YOU IM READY TO PROVE EVERYBODY WRONG BECAUSE I DIDNT USE TO BELIEVE NOW IM A BELIEVER BECAUSE MY EYES DONT LIE & NEITHER DO MY FAMILY & FRIENDS EYES LUE EITHER"],"Latitude":"41.4453","Case Number":"34465","Disposition":"Unresolved","Object Features":"None","City":"Cleveland","Object Shape":"Boomerang, Sphere, Triangle","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around August 1st 2009"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"01/01/2012 05:20 UTC","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-01012012-0021"}