{"files":["/var/www/straped/mufon/html2text/34472.html.txt","/var/www/straped/mufon/org/34472.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Longitude":"-80.598481","Case Number":"34472","City":"Cocoa Beach","divs":["sighting detailson dec 31 at approximately 2000 hours myself (ex law enforcement, officer military and current firefighter) and two other witnesses were sitting on the 8th floor balcony facing southeast of the hampton inn in cocoa beach. we were watching people shooting of fire works and having fun before the new year. approximately 4 miles away in a south direction in the area of patrick airforce base we observed a bright red\\yellow light that appeared to look like a rocket shoot up from the area of the ocean front (atlantic). the object at first went up at a 45 degree angle heading west. at first we thought it might be a flair but we noticed the object getting higher in altitude and gaining speed. living in the cocoa beach area and near nasa we have seen all typs of rockets and shuttles lunch. the object we observed made no sound,no military escort witch they normally do have when lunched from nasa. the object continued to gain altitude and head west until it was out of sight. the object hade all indications of a rocket launch but the nasa launch site is 20 miles east of where we observed the object. i contacted patrick air base and they stated they do not launch from there site nore do they launch from the water. we did not have our cameras with us to take a video. from my experience from being in the military and a dod contract firefighter, i have observed missile and rocket launches of all typs. what we observed was something i have never seen in my life. there has been no chatter about the object online or in the news as of today jan 1st 2012. this is my first ufo encounter i have observed."],"Date Submitted":"01/01/2012 12:08 UTC","Object Shape":"Fireball, Other","Region":"Florida","Summary":"rocket typ object from ocean heading west over land.","Tags":"City","Latitude":"28.321707","Object Features":"Other, Unknown","Log Number":"US-01012012-0028","map":"<A HREF = \"http://maps.google.com/maps?q=28.321707,+-80.598481(34472)&iwloc=A&hl=en\"> mufon case (34472) map </A>","trends":["There have been 10 other sightings in Cocoa Beach","There were no other sightings in Cocoa Beach on or around December 31st 2011"],"Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"12/31/2011 12:00 UTC","Source":"MUFON"}