{"Viewing Distance":"Unknown","Country":"United States","Object Shape":"Sphere","Date of the Event":"12/31/2011 09:00 UTC","Case Number":"34470","files":["/var/www/straped/mufon/html2text/34470.html.txt","/var/www/straped/mufon/org/34470.html"],"Object Flight Path":"Hovering then path","Sighting Duration":"00:01:00","Object Features":"Unknown","divs":["Sighting DetailsOn new years eve 2011, i was on vacation with family in a condo park. We were traveling on a golf cart at exactly 9pm when i looked up at the sky. I always look at the stars at night, especially here in Florida where they are more visible compared to back home where i live. I pointed out (4 other people) a reddish orange ball of light in the sky. It seemed to be hovering in the sky to the right of orion's belt in the western sky. I then located Jupiter, Mars, Sirius and Betelgeuse, the brightest objects i could think of. This object was none of them. I never took my eyes off of the object. I wanted to know what this thing was. We were traveling north at approx. 10 miles per hour. The object seemed to be moving very slowly to the south. No noise, no aircraft lights. The object looked twice as big as Jupiter does in the sky. I work at an airport and can say for sure that this was not a commercial airplane. It seemed to move very slowly to the south for approx. 20-30 seconds and then dimmed out to nothing, just vanished. There was sea fog in the area at the time, so i dont know if the object vanished into thin air or thick fog. I was very excited to have seen this object. We arrived to our destination about 10 seconds after the object disappeared. We were talking about it and found that another group of people (3) had seen it as well from their golf cart. I have never before seen anything out of the ordinary in the skies. I feel that the object may have been a ufo, since i have found no other explanation. I periodically scanned the night skies until 1am, but never saw the object again. I hope others have seen the same thing to help verify my sighting."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.958775,+-82.449058(34470)&iwloc=A&hl=en\"> mufon case (34470) map </A>","Longitude":"-82.449058","City":"Tampa","Date Submitted":"01/01/2012 10:18 UTC","Source":"MUFON","trends":["There have been 105 other sightings in Tampa","There were 4 other sightings in Tampa on or around December 31st 2011"],"Latitude":"27.958775","Log Number":"US-01012012-0025","Weather Factors":"Unknown","Region":"Florida","Summary":"red-orange starlike orb in florida sky new years eve 2011","Disposition":"Unresolved","Tags":"City"}