{"Object Flight Path":"Other","Date of the Event":"12/31/2011 08:00 UTC","Object Shape":"Boomerang","Country":"United States","Source":"MUFON","divs":["Sighting DetailsWe were driving back to our party from a store and stopped at a red light. A blinking object cAught the corner of my eye so I stretched forward to look and saw this VIVID blue and white blinking object. It was boomerang shaped. The whole object switched from all bright neon blue to bright crisp white over and over and was swirling around in the sky doing figure 8 shapes almost. Instantly I yelled at my aunt who was driving \"what is that ?!\" and she saw it and said \"oh my god look at the way it's fully changing colors!\" it really freaked us out cause we've Never seen anything like this before the colors were so crisp and it wasn't a helicopter or anything like that it was a UFO the way it was swaying in the air and completely changing colors, I wish I had a video of it but I was on my phone calling my family back at the party and I yelled \"GO OUTSIDE! LOOK SOUTH!!\" and they all ran out and saw it even the neighbors next door (who were already outside) were all staring at it too! Before we got back to the house they said it disappeared and so we only saw it while driving but we all described it the same way. I would love to know if anyone else saw what we saw last night!"],"trends":["There have been 16 other sightings in Fontana","There were no other sightings in Fontana on or around December 31st 2011"],"Date Submitted":"01/01/2012 02:07 UTC","Disposition":"Unresolved","Log Number":"US-01012012-0030","Latitude":"34.101254","Region":"California","files":["/var/www/straped/mufon/html2text/34479.html.txt","/var/www/straped/mufon/org/34479.html"],"Summary":"Boomerang shaped, fully changing colors from neon blue to bright white","Weather Factors":"Unknown","Object Features":"None, Unknown","Sighting Duration":"Undisclosed","Case Number":"34479","Longitude":"-117.433968","map":"<A HREF = \"http://maps.google.com/maps?q=34.101254,+-117.433968(34479)&iwloc=A&hl=en\"> mufon case (34479) map </A>","Tags":"City","Viewing Distance":"Over One Mile","City":"Fontana"}