{"Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"38.312912","City":"Napa","trends":["There have been 10 other sightings in Napa","There were no other sightings in Napa on or around January 1st 2012"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsJust after midnight on new years eve I stood on my deck overlooking Napa Valley watching the lights of the city. From the north came a yellowish red glowing light. I fly and know the what an airplane looks like in the dark. I called my wife out to look as this light began to slowly silently make a turn to the west and back north then stop to hover about two thousand feet high. I had good reference points by the hill tops. There was no other aircraft lights in the sky at that point. Something appeared to drip from the craft red in color and stayed lit half way to ground. Second drip was less bright. Craft a few seconds later lights went out ascraft loosed to fall from sky. About 1000 feet below marking lights of and aircraft appeared going west. Lights of this aircraft different then others I have seen being spaced well apart Two outer in red with four whit between them. No noise. This craft was seen by others on dec. 16,2011 over Napa"],"Date Submitted":"01/01/2012 01:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.312912,+-122.290939(34474)&iwloc=A&hl=en\"> mufon case (34474) map </A>","Tags":"City","Log Number":"US-01012012-0030","Region":"California","Date of the Event":"01/01/2012 12:00 UTC","Longitude":"-122.290939","files":["/var/www/straped/mufon/html2text/34474.html.txt","/var/www/straped/mufon/org/34474.html"],"Country":"United States","Case Number":"34474","Weather Factors":"Unknown","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Summary":"Redish orange flew slowly suoth down napa valley just above hill tops apx. 1,000 ft. Made slow 180 turn to west and stopes to drop two glowing objects light went out carft seemed to fall. Aircraft was seen turning away well below"}