{"divs":["Sighting DetailsI stopped by a family friend's house for new years eve with my girlfriend. We had another party to attend so we left early about 10:25pm EST. As we were walking down the driveway toward the car I noticed a red glowing light in the sky. It seemed very unusual because it was floating way to low to be a plane and was also much lower than I see helicopters typically fly in my area. I gave the object the benefit of the doubt thinking it may just be a helicopter coming at us from head on. Yet as I continued to watch the object and as it got closer to us is when it became definitive that this object was flying way to low to be a helicopter. In addition to the low altitude this object was flying at, there were no FAA lights on the object and this object made absolutely no noise as it slowly made its way past us. It was just a glowing red orb. The object's distance from us was about a block over and about 100 yards or so above the tree tops. The object flew in a North to South direction. While watching the object the two of us had an eerie feeling because of how out of ordinary it was. The object was moving slow enough that I was able to get out my girlfriend's camera and take a video of the object. Unfortunately, the video does not do the sighting justice. What you can notice from the video is the color of the object (bright glowing red) and that there is no sound from this object. What you cannot tell from the video is how slow the object was traveling and how low the object was to the ground. I zoomed in and out in the video so that is why the object appears larger and smaller. We were able to watch the object until it was so far away it went out of sight. The entire time of the sighting the speed of the object never changed and it did not change its flight path."],"Case Number":"34483","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"01/01/2012 03:36 UTC","Log Number":"US-01012012-0034","City":"Middletown","Region":"New Jersey","Longitude":"-74.10868","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34483.html.txt","/var/www/straped/mufon/org/34483.html"],"Date of the Event":"12/31/2011 10:26 UTC","Object Features":"Unknown","trends":["There have been 4 other sightings in Middletown","There were no other sightings in Middletown on or around December 31st 2011","This sighting has never been favorited.",""],"Summary":"Silent glowing red orb/light moving slowly across the sky","Latitude":"40.422381","map":"<A HREF = \"http://maps.google.com/maps?q=40.422381,+-74.10868(34483)&iwloc=A&hl=en\"> mufon case (34483) map </A>","Object Shape":"Fireball, Sphere"}