{"Case Number":"34481","trends":["There have been 5 other sightings in Kingston","There were no other sightings in Kingston on or around November 30th 2011"],"Tags":"City","Object Flight Path":"Path then hovering,Other","Source":"MUFON","Sighting Duration":"00:05:00","Log Number":"US-01012012-0032","files":["/var/www/straped/mufon/html2text/34481.html.txt","/var/www/straped/mufon/org/34481.html"],"Country":"United States","Date of the Event":"11/30/2011 12:00 UTC","Summary":"appeared from direction of lenior city, tn. looked like a helo at about 2,000 feet. crossed left to directly accross from me on other side of tn river. decenced into floating hover above 2nd hill then went down behind hill.","Region":"Tennessee","Object Features":"Other","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.736658,+-84.462862(34481)&iwloc=A&hl=en\"> mufon case (34481) map </A>","City":"Kingston","Longitude":"-84.462862","Object Shape":"Cigar, Oval, Teardrop","Weather Factors":"Unknown","Date Submitted":"01/01/2012 02:52 UTC","divs":["Sighting Details while sitting on porch, at about 1900 e time, watching the sky and river, west of loudon, tn... I noticed a helo off to my left decending tword a line of hills on the other side of the tennessee river from my house. it sruck me as strange, that the color was yellow and a lack of running lights. there was no sound and as it went into a hover above the 2nd hill to the right, it tended to slip back and forth in a foating motion. beside the yellow glowing color, a small green light appeared on the front of the 30ft. long elipse. the craft must have been twisting as it floated above the trees of the 2nd hill about a qtr to a half mile from me becuse a green light appeared to go off and on at the front. a road accended from left to right at this side of the hills and as i watched ,cars could be seen, running between kingston and loudon on that road. the sky was clear and aircraft could be seen in transit between various cities in e tennessee. i was waiting on my wife to return home so i could drive to knoxville. as i watched, the craft started to decend in the verticle behind the hills. no spotlight was seen and no running lights observed. i used to in air control and have years of experince observing aircraft and the sky, i don't think this was a helo. My wife returned and i went to knoville."],"Latitude":"35.736658","Viewing Distance":"501 Feet - 1 Mile"}