{"map":"<A HREF = \"http://maps.google.com/maps?q=35.380172,+-119.010302(34485)&iwloc=A&hl=en\"> mufon case (34485) map </A>","Viewing Distance":"Over One Mile","Longitude":"-119.010302","Object Shape":"Blimp, Fireball, Flash","Date Submitted":"01/01/2012 03:48 UTC","Region":"California","Disposition":"Unresolved","Case Number":"34485","Summary":"Bright red light speedily closing in on the city, flickering, then dissapearing all together.","Weather Factors":"Unknown","Tags":"City","Country":"United States","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around January 1st 2012"],"Latitude":"35.380172","divs":["Sighting DetailsI had just finished watching the countdown to 2012 on TV and decided to step outside to hear and watch the chaos of the college-inhabited suburbs of Bakersfield, Ca. Out in the distance I noticed a red-orange light coming from the far South East. I turned away thinking it was just an airplane but it soon caught my attention again as the speed was too fast for a plane. It was far too high and did not move vertically like a helecoptor so I gave it my full attention. When it finally got close to the town the speed slowed and it made a large circle that took about 20 seconds to complete. This happened a few times, then it began to take off the way it came flickering in and out of color as it did. Before it could get out of the city limits though, it flickered one last time and did not come back on. The sighting made me take a few steps back in awe. I have never seen anything like it, and am quite controversial to UFO sightings, my mind has changed in the new year."],"Sighting Duration":"00:03:00","Date of the Event":"01/01/2012 01:00 UTC","City":"Bakersfield","files":["/var/www/straped/mufon/html2text/34485.html.txt","/var/www/straped/mufon/org/34485.html"],"Log Number":"US-01012012-0036","Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"Unknown"}