{"Sighting Duration":"Undisclosed","Region":"North Carolina","Source":"MUFON","Object Flight Path":"Straight-line path","Object Shape":"Star-like","Object Features":"Unknown","divs":["Sighting DetailsI was sitting inside watching New Years eve special on tv, my daughter had been on the porch cleaning her bunny cage, then came back in, as she did a orange light caught my eye I said 'what the heck is that' and bent over to look closer...still couldn't figure it out so mentioned to my kids about it, only one got up with me as they were focused on the tv music performance, but she and I went to the porch and saw the orange star-like through the trees. We both were amazed, and trying to figure out what they could be. We noticed Venus on the other side of the sky and noted it was smaller and dimmer than the orange light on the other side of the house, near the lower left side stars of Orion. We decided it was not a star as it was rising very slowly, too slowly to be a plane or fireworks. So slowly I likely would not have even noticed it was moving had it not been orange and so bright. Then suddenly at about 25 degrees above the horizon it disappeared, there was no flash or explosion like fireworks would have made and again it had been rising too slowly for 3 or 4 minutes (from just 5 or 10 degrees above the horizon when I first saw it) before disappearing. We watched for about 30 seconds to one minute, then it reappeared in the same spot, with another one exactly like it slightly higher and to its left. Then they both started rising again very slowly...steadily. After 2 or 3 more minutes. I had time to run inside and get my camera to take 2 photos, My daughter tried to take 2 on her iphone too both lights disappeared again without any flash, sound, or explosion. At about 45 degrees above the horizon for the first one and maybe 50 degrees up for the 2nd higher one, they just winked out. They seemed very far off from us, but we heard no sounds. We both watched for several minutes but they did not reappear, and we checked for the next hour or so but never saw the lights again. Our pictures were so dark, nothing could be seen. After lightening and turning the contrast all the way up on the computer the photos would show the outline of the trees in the foreground but not the lights. I am an artist, and painted what we saw the next morning, as the photos didn't turn out. The painting shows the final moments when both lights were seen at the highest point nearing Orion's stars. The first one had risen from the horizon of mountains off in the distance to a mid point,through the trees in the foreground... then winked out then came back with the second one before both started rising up to that final highest point at about 45 degrees up."],"Country":"United States","Weather Factors":"Unknown","Date of the Event":"12/31/2011 11:30 UTC","Summary":"one star-like but bigger brighter orange light rising slowly from horizon to about 15 degrees, then disappeared, reappeared with another both rose slowly to about 45 degrees then disappeared","trends":["There have been 2 other sightings in Weaverville","There were no other sightings in Weaverville on or around December 31st 2011","This sighting has been favorited 1 time.",""],"Viewing Distance":"Over One Mile","Tags":"City","Case Number":"34494","Longitude":"-82.561945","Log Number":"US-01012012-0045","City":"Weaverville","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34494.html.txt","/var/www/straped/mufon/more/34494_submitter_file1__UFOSpaintingByGingerStrivelli12-31-11.jpg","/var/www/straped/mufon/org/34494.html"],"Latitude":"35.74081","map":"<A HREF = \"http://maps.google.com/maps?q=35.74081,+-82.561945(34494)&iwloc=A&hl=en\"> mufon case (34494) map </A>","Date Submitted":"01/01/2012 04:39 UTC"}