{"Viewing Distance":"101-500 Feet","Region":"Pennsylvania","Longitude":"-75.002159","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/34496.html.txt","/var/www/straped/mufon/more/34496_submitter_file1__20111106-145852.png","/var/www/straped/mufon/org/34496.html"],"trends":["There have been 2 other sightings in Feasterville","There were no other sightings in Feasterville on or around January 1st 2012","This sighting has never been favorited.",""],"Log Number":"US-01012012-0047","Object Shape":"Circle, Fireball, Sphere","Sighting Duration":"Undisclosed","Summary":"We observed a (what looked like) a firey pulsating ball moving in a straight path above our heads with no sound. 6 other people observed it and we all agree it was not a flare firework plane or lantern. Very unusual.","Source":"MUFON","Case Number":"34496","Date Submitted":"01/01/2012 05:15 UTC","Country":"United States","City":"Feasterville","Object Features":"None, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.151099,+-75.002159(34496)&iwloc=A&hl=en\"> mufon case (34496) map </A>","Object Flight Path":"Straight-line path","Latitude":"40.151099","Tags":"City","Date of the Event":"01/01/2012 12:00 UTC","divs":["Sighting DetailsWe observed a (what looked like) a pulsating fire ball moving in a straight path above our heads with no sound. We had gotten done watching numerous fireworks in the area and celebrating the new year when we observed what looked like a Circular Ball Pulsating with flames in the near distance. It continued on a straight path above our heads and then headed off southeast until it was too small to see. There was no trail or other light emanating from the ball. In my opinion the apparent size with my eyes was about basketball sized. I fell like if there was an airplane the same distance it may have looked like the same size if not a bit smaller but i can not be sure as Im not completely sure of how high it was in the air although I believe it to be less then 500 feet. I was also standing outside with 5 other people who all experienced the same object in the sky. We all agreed that it did not look anything like a lantern airplane or any kind of flare or firework. It was a very strange experience and completely unexplainable to us."]}