{"Country":"United States","Tags":"City","Source":"MUFON","Date of the Event":"01/01/2012 03:30 UTC","trends":["There has been one other sighting in Gila","There were no other sightings in Gila on or around January 1st 2012"],"Latitude":"32.963327","Disposition":"Unresolved","Summary":"Possible UFO in distress","divs":["Sighting DetailsI had just awakened from sleep, rolled over to get my glasses, and happened to look out my North faceing window in my bedroom whenin the North sky over the mountains in the Gila Wilderness, there appeared an EXTREMELY bright, silvery, white light comeing in from above. The streak of light was not a straight streak like a meteor but had a wobble to it, like the object was spinning. It was EXTREMELY bright, like a stroke of lightning with with a slight silvery look about it. It was about the same width as a match head held at arms length. The total lingth of the path of light was approximately the width of two hands and seemed to slow down a bit the lower it got to the mountains. At the end of its flight path, it ended in an EXTREMELY bright white flash, that lit up most of the mountain range just West of the Turkey Creek camp ground which is about 10 to 15 miles away from our trailer. About 1 minute later there was a brillient flash of light straight overhead and slightly to the North of our position. Where we live, we have a totally unobstructed view of the mountains of the Gila Wilderness. Turkey Creek is well known locally as a UFO Hotspot as many lights of unknown origin have been seen in that area for several years. It is a quiet, remote area and requires a 4-wheel drive vehicle to safely get there. If more information is required, just let me know, and I will supply to the best of my ability."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.963327,+-108.575711(34492)&iwloc=A&hl=en\"> mufon case (34492) map </A>","City":"Gila","Object Features":"Unknown","Object Shape":"Fireball, Flash, Star-like","files":["/var/www/straped/mufon/html2text/34492.html.txt","/var/www/straped/mufon/org/34492.html"],"Case Number":"34492","Region":"New Mexico","Date Submitted":"01/01/2012 04:19 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-01012012-0043","Longitude":"-108.575711","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile"}