{"Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Stationary","Object Shape":"Circle, Fireball, Sphere","Date of the Event":"12/31/2011 05:15 UTC","Date Submitted":"01/01/2012 06:54 UTC","Region":"Florida","trends":["There have been 105 other sightings in Tampa","There were 4 other sightings in Tampa on or around December 31st 2011"],"divs":["Sighting DetailsIt was 5:15pm New Years Eve, Tampa in Seminole Heights. I let our dogs out & I sat on our back deck looking at the trees & sky facing the east. A bright white dot appeared suddenly appeared to the east about seventy degrees from horizon line. I watched it for about 30 secs & it didn't move at all. I quickly grabbed the binoculars from right inside the door, always looking up:). I looked back to the same spot & didn't see it any longer. I looked through the binoculars & found it, I focused & another 30 secs or so passed then another appeared. Another two minutes passed, my arms stared to tingle, the second one just disappeared as it had appeared. The first one still hadn't move any further away & in the same spot. I looked away couldn't see anything with my naked eye, I then found the original again through binoculars & watched for another minute or so & it seemed to start to slowy get smaller. It lasted for about 5or 6 minutes total. Both of the objects were round & seemed to pulse with a bright fire like yellowish glowingness. I only felt happy & thankful to see these orbs...I waved, said hi and wished they'd come on down."],"City":"Tampa","Tags":"City","Longitude":"-82.454788","Object Features":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/34499.html.txt","/var/www/straped/mufon/org/34499.html"],"Case Number":"34499","Sighting Duration":"Undisclosed","Summary":"Glowing orbs to the east in Tampa","Log Number":"US-01012012-0050","Latitude":"27.956635","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.956635,+-82.454788(34499)&iwloc=A&hl=en\"> mufon case (34499) map </A>","Source":"MUFON"}