{"Object Shape":"Triangle","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/34493.html.txt","/var/www/straped/mufon/org/34493.html"],"Sighting Duration":"Undisclosed","Date of the Event":"12/12/2011 12:00 UTC","Summary":"flowing orb sightings in kansas","trends":["There has been one other sighting in Tonganoxie","There were no other sightings in Tonganoxie on or around December 12th 2011"],"Weather Factors":"Unknown","Latitude":"39.08853","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.08853,+-95.027592(34493)&iwloc=A&hl=en\"> mufon case (34493) map </A>","Object Features":"Undisclosed","Longitude":"-95.027592","Case Number":"34493","Region":"Kansas","Date Submitted":"01/01/2012 04:24 UTC","Tags":"City","divs":["Sighting DetailsFor almost a year exactly I have been seeing glowing light orbs. First one I was lying in bed and saw a very bright \"new\" planet that I head never seen before pursue my window. I laid there a long time wondering what it was. When I turned to ask my husband to look it vanished. Several Weeks later I could see it out my other bedroom window and it too vanished when I tried to wake my husband to see it. On and of for months a would see it. Then December 2011, a couple Weeks before Christmas my soon was driving us home in the dark. I was playing solitaire on my phone. He turned onto our street and said, \"OMG!\"and above a hill that is usually covered with cows were 3 light orbs in a triangle pattern.Before I could switch the camera on my phone one light went left, one went right, and the other went up. This was around 7pm on a Thursday night. Christmas morning around 5am my ambitious children woke up and upon entering my room to wake me saw the 3 orbs in a triangle again and closer to the house. The orbs left before I awoke. We have not seen any since and I have kept this quiet until these recent sightings. This was the first time someone beside myself has seem these."],"Object Flight Path":"Other","Log Number":"US-01012012-0044","City":"Tonganoxie","Disposition":"Unresolved"}