{"City":"Route 27","Latitude":"31.14203","Date Submitted":"01/01/2012 07:45 UTC","Object Shape":"Fireball","Region":"Florida","Date of the Event":"01/01/2012 07:00 UTC","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Stationary","Log Number":"US-01012012-0052","Tags":"City","Case Number":"34501","files":["/var/www/straped/mufon/html2text/34501.html.txt","/var/www/straped/mufon/org/34501.html"],"Disposition":"Unresolved","Object Features":"Unknown","Viewing Distance":"Unknown","Longitude":"-85.883979","Country":"United States","trends":["There have been no other sightings in Route 27","This sighting has never been favorited."],"divs":["sighting detailsi went to meet my parents for dinner in clermont and am from kissimmee. last night my dad meet some neighbors on a hill to watch all the fireworks from the theme parks and all saw several orange fireballs in the sky almost above them around the same distance a jet would be. i've seen some ufo's before (zig zag across the sky and crazy bright lights) so i believed him and am mindful of it. before i left i looked things up on twitter and youtube and saw a small response to what he saw last night, with a few videos posted and posts on twitter about it. when i left it was dusk and saw a bright orange looking fireball to the east, to me it looked around the downtown area or past it, but it was low and the trees easily blocked it until i was up on a hill. as i continued to drive down 27 to reach 192 i saw it a few more times above the trees. i stopped once and got out google sky and checked, it was not a star, and no other stars were visible along the same level. i may have also saw another one to the south-west, but wasn't sure and couldn't look in two directions at once while driving. compared to the photos i saw on twitter\\videos on youtube, it is a similar object in the sky."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.14203,+-85.883979(34501)&iwloc=A&hl=en\"> mufon case (34501) map </A>","Summary":"Stationary Fireball in Sky two days in a row"}