{"Object Flight Path":"Straight-line path,Path with directional change","divs":["sighting detailsstarted approx 2230 12\\31\\11 while shooting fireworks on roadway nothing above 100ft. son in law commented on two red lights in sky moving from ssw to north northeast, these occurred over 10 to 20 mins (1st 8 orbes) nothing for 45-50 mins then 6 more (0100 01\\11\\12) moving ssw to northeast (one orb passed directly over head (my home) no sound at all). most orbs traveled in pairs at about the speed of a commercial airline. please call, i can not explain all details or have someone come by. these orbs where not fireworks!!! too fast and too high. most orbs traveled under the cloud cover with some traveling thru or above clouds. of the tandems one pair of the last 6 orbs, one orb broke from the tandem and headed westerly (90 degree change of direction) lighting was round reddish in color mostly solid non pulsing, however an orb would seem to flicker or pulse during the latter occurrences we thought it was space debris coming thru atomsphere, however, no tail for reentry. secondly, thought drones of some sort, alvin calender airfield is south southeast of hammond (approx 50 + air miles) no flashing lights as on a airliner. puzzled as to what we where seeing, did not feel threatened. the orbs traveled beyond line of sight (increased distance)"],"Longitude":"-90.49758","Latitude":"30.45767","Date Submitted":"01/01/2012 10:10 UTC","Summary":"14 red orbes traveling ssw to n to nne, one traveled directly over house no sound, one broke from tandem to travel westerly","Sighting Duration":"01:50:00","files":["/var/www/straped/mufon/html2text/34507.html.txt","/var/www/straped/mufon/org/34507.html"],"Log Number":"US-01012012-0055","Weather Factors":"Unknown","City":"Hammond","Source":"MUFON","Case Number":"34507","Disposition":"Unresolved","Object Features":"Unknown","Region":"Louisiana","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","trends":["There have been 5 other sightings in Hammond","There were no other sightings in Hammond on or around December 31st 2011"],"Date of the Event":"12/31/2011 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.45767,+-90.49758(34507)&iwloc=A&hl=en\"> mufon case (34507) map </A>","Object Shape":"Circle, Sphere","Country":"United States"}