{"City":"Riverside","trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around January 1st 2012"],"Object Flight Path":"Hovering then path","divs":["sighting detailsat aproxamently 0005 hours on the date of 01\\01\\2012 my father, sister and i stepped out to watch fireworks the the nighbors were setting of for new years. we were looking to the west and noticed what we thought was a flare that was shot off, there are hills just west of us....it was not a flare as i have seen theme plenty of times. the object was redish orange in color and was like a fire ball and appered to just float. it gave off no nosie nor did it emit any rays beams or have a tail. for about 10 secands or so it just hoverd over the hills, then it slowy moved to the north looking like it was floating, it moved about 200-350 feet to the north as it moved it never changed shape or dimmed or got any brighter. it then just stoped and disspared it was a constent glowing pulsateing...it had no vissable structure and i nither of us could notuce any windoews or any other lights that it may have had. prior to the event for about 2-3 hours my two outside dogs were wimpering and barking non-stop trying to get into the house...all the other dogs in the nighb orhood were barking non stop as well. my min-pin who stays inside did not want to get out of my arms. after the abject dissapered my dogs and all the nighborhood dogs setteled doen aise from just barking at the fire works and gun shots. my father, sis amd i were not affected by the object..other then thinking wtf is that. sight was lost of the objsect when it just appered to just dissapear."],"files":["/var/www/straped/mufon/html2text/34503.html.txt","/var/www/straped/mufon/org/34503.html"],"Log Number":"US-01012012-0054","Sighting Duration":"Undisclosed","Tags":"City","Summary":"Looked like a flare from a flare gun...it was redeish orange and appeared to glow and pulsate.","Disposition":"Unresolved","Date Submitted":"01/01/2012 09:11 UTC","Case Number":"34503","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Fireball, Star-like","Region":"California","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.919033,+-117.413994(34503)&iwloc=A&hl=en\"> mufon case (34503) map </A>","Country":"United States","Source":"MUFON","Date of the Event":"01/01/2012 12:00 UTC","Object Features":"Undisclosed","Longitude":"-117.413994","Latitude":"33.919033"}