{"files":["/var/www/straped/mufon/html2text/34508.html.txt","/var/www/straped/mufon/org/34508.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.827766,+-100.529612(34508)&iwloc=A&hl=en\"> mufon case (34508) map </A>","Summary":"Bright orange light over tree tops, craft passed over us, had windows on bottom.","Log Number":"US-01012012-0056","Latitude":"31.827766","Case Number":"34508","Object Features":"Window(s), Wings","Source":"MUFON","Date Submitted":"01/01/2012 10:19 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","City":"Coke","Weather Factors":"Unknown","Country":"United States","Region":"Texas","trends":["There have been no other sightings in Coke","This sighting has never been favorited."],"Object Shape":"Cigar","Date of the Event":"01/01/2012 07:05 UTC","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI came outside to see why the dogs where barking, they stopped when I opened the door, very typical. =) I live in the country where city light dont effect my wonderful view of the stars. So I stood on the ramp to the porch and was looking around when I noticed a very bright orange light over the horizon, right over the tree line. I thought it might had been a helicopter because of how it was hovering, so I opened the door to tell my 7yo son to come look, since he likes to watch and listen to them go by. But as it got closer I noticed it had no sound, as it past directly over us I saw it in good detail. It was cigar shaped, I couldn't tell the color as it was dark. Neither of us saw wings but there were 2 sets of 2 white lights on each side of the craft. They flashed but a lot slower that airplanes lights do, it had 3 oval window like things on the very bottom and their was a soft yellow light coming through them. I told my son that I didn't think it was helicopter, and it kind of looked like an airplane, my creative son said it was a space craft looking for us. It continued on without sound, I didn't watch it very long after as it is really cold and I had to get my son inside. After an online search showed no airplanes or anything like this I decided maybe I should report it in hopes of maybe someone else seeing it or having a similar account, or even knowing what it was. Thanks =)"],"Disposition":"Unresolved","Longitude":"-100.529612"}