{"Longitude":"-122.672827","files":["/var/www/straped/mufon/html2text/3450.html.txt","/var/www/straped/mufon/org/3450.html"],"Object Flight Path":"Hovering then path","Region":"Oregon","Source":"MUFON","Case Number":"3450","Disposition":"Unknown","Object Features":"Unknown","Weather Factors":"None","Date of the Event":"05/01/2005 12:30 UTC","divs":["Sighting DetailsSighting Report: UFO spotting 12:45 AM May first, Portland Oregon: I live in what is known as the Pearl district of Portland, a kind of wanna be hi-so area full of expensive apartments, lofts, gallery spaces, restaurant etc. Right in front of my apartment building is a park where there s almost always somebody walking their dog. Coming home from work just now I noticed a well dressed man with his dog in the park staring up into the sky with an expression of wonder and concern, turning and looking at me he said \"There s three strange lights up in the sky\" and when I stopped and looked sure enough right where he pointed there they were. Three dim but definite reddish lights, two were right above each other, the third above the two and off to the upper right. They resembled stars in their size and over the course of several minutes the upper two would fade and dim out, then reappear at intervals, independent of each other. Finally they faded for good with the upper right one moving off to the west in the process, the other one just did a stationary fade leaving the bottom light which then faded in and out as well then vanished. They seemed to be a high altitude but as I had no way of establishing scale it s impossible to tell. The gentleman expresses his gratitude at my stopping and telling him what I was seeing as it mirrored his own perceptions and relieved him as he was concerned that he was \"seeing things\". He also told me that he had been watching them for about 5 minutes before I appeared and they had seemed both lower and brighter."],"Date Submitted":"05/01/2005 12:30 UTC","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=45.527462,+-122.672827(3450)&iwloc=A&hl=en\"> mufon case (3450) map </A>","Sighting Duration":"Undisclosed","Summary":"Three reddish lights hovering in a trianglar configuration","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around May 1st 2005"],"Latitude":"45.527462","Object Shape":"Star-like, Triangle","City":"Portland","Tags":"City"}