{"Country":"United States","Log Number":"US-01012012-0055","Case Number":"34504","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.762033,+-95.36825(34504)&iwloc=A&hl=en\"> mufon case (34504) map </A>","Date of the Event":"12/31/2011 11:30 UTC","Object Shape":"Circle, Sphere","divs":["Sighting DetailsLast night around 11:30-11:45 just before midnight 2012 a party of five of us witnessed a UFO in Houston, TX in the SE side of the city. We were on the balcony patio of my apartment with a great view of the sky looking to the west from the SE side of Houston in La Porte. It had 6-7 bright lights in the shape of a circle spinning around in all directions not just from left to right. It also had a spotlight that seemed to extend about 20ft out from it that would come on at random times. It was going all the way up to the fog and flying fast across the SE area. The lights were changing from red, blue, green, gold, and white. It was amazing. I was looking thru my telescope viewfinder and could see the lights clearly spinning in formation in a perfect circle but there was nothing in between the lights or the center of the aircraft. We had binoculars as well. Five of us saw it and a friend of my girlfriend at another house was looking at it and may have gotten video. I'm going to see if it comes out again tonight. Never seen anything like it. It was either some amazing very large remote controlled device or a real life UFO. But based on the fast darting speed, nothing seen in between the lights or in the center and that it hovered at times in one place and went up to the clouds it had to be out of this world. I hope it comes again because I have my camera ready. It was only there several minutes, went down in the horizon and a few moments later came back up for several more minutes. The lights spun left to right and up and down and at angles. It was nuts! I can't find any remote controlled devices like that anywhere online. It wasn't a jet, plane or helicopter. I see those all the time around here. Also, based on how plane's look in the sky from our patio this thing could have been as big as a plane or slightly bigger."],"Tags":"City","Weather Factors":"Unknown","Latitude":"29.762033","files":["/var/www/straped/mufon/html2text/34504.html.txt","/var/www/straped/mufon/more/34504_submitter_file1__UFO12-31-11.jpg","/var/www/straped/mufon/org/34504.html"],"Longitude":"-95.36825","Disposition":"Unresolved","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around December 31st 2011","This sighting has never been favorited.",""],"City":"Houston","Date Submitted":"01/01/2012 09:27 UTC","Summary":"UFO spinning in all directions with 6-7 lights with a spotlight beaming going all the way up to the clouds and down again","Source":"MUFON","Viewing Distance":"Over One Mile","Region":"Texas","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}