{"Latitude":"29.282693","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Fireball, Sphere","City":"Ocala","Longitude":"-82.24655","Log Number":"US-01012012-0058","Source":"MUFON","Viewing Distance":"Over One Mile","Disposition":"Unresolved","trends":["There have been 21 other sightings in Ocala","There were no other sightings in Ocala on or around January 1st 2012"],"files":["/var/www/straped/mufon/html2text/34513.html.txt","/var/www/straped/mufon/org/34513.html"],"Weather Factors":"Unknown","Date of the Event":"01/01/2012 08:05 UTC","divs":["sighting detailsthis was the third and fourth time i have seen this ufo, and was able to film them. i have seen the same object at least two other times. the first time we noticed the object, it was earlier in 2011 (may or april) at around midnight. it pulsated and lit up and wobbled, wiggled back and forth and went every which way for about 10 minutes. we even reported it to marion county sheriff department. by the time the sheriff arrived, the object disappeared into the west. around 12\\15\\12 i was sleeping with my window open. at about 5 am i was awoken by a bright light pulsating above our neighbor's house. i was very scared and told myself it wasn't really happening, but as i thought about it more and looked up, it very much so was there and real. so i got up, went to my window and looked at the object for about 3 minutes making sure of what i saw. i then went into the bathroom and made sure my eyes were adjusted to the light. when i returned it was still there, it was really close and stayed about another 2 - 3 minutes. the object was similar to the object(s) i have seen prior but much closer, brighter and active. after that event, i decided to purchase a hd video camera that would capture the object at night. i then checked the sky more frequently at times i had seen it prior and making sure it wasn't a star,planet or other identifiable object. then on 12\\26\\11, at about 8pm i walked out of my house and looked to the western sky where i have seen the object(s) before and to my amazement, there was the\\a pulsating light above the horizon. i right away ran inside and grabbed my video camera and captured the light in the night sky. i was very nervous, so the video wasn't the best, but i did capture as much as i could. the light hung around for about 5-7 min moving in different direction and then slowly disappeared going west towards the gulf of mexico. six days later on 1\\1\\12 i decided to check the sky at the time i have been seeing it, like i do regularly now, and it again was in the western sky. being less scared this time i grabbed my camera and videoed it, about 5 min, till it disappeared to the west the same direction it always goes."],"Case Number":"34513","map":"<A HREF = \"http://maps.google.com/maps?q=29.282693,+-82.24655(34513)&iwloc=A&hl=en\"> mufon case (34513) map </A>","Object Features":"Unknown","Date Submitted":"01/01/2012 11:49 UTC","Region":"Florida","Summary":"Strange Pulsating Light in Western Sky Over Central Florida (4th time in 6 months)","Object Flight Path":"Hovering then path,Path with directional change"}