{"Weather Factors":"Unknown","Object Flight Path":"Stationary","Date Submitted":"01/02/2012 01:54 UTC","Object Shape":"Sphere","Viewing Distance":"21-100 Feet, 101-500 Feet","divs":["sighting detailsi was driving home @ around 10:15 p.m. last night 1\\1\\2012 on i-75 heading northbound. when i was 1 mile south of the miami gardens drive exit i looked up and there were 10-13 red orange orbs hovering stationary over the road about what seemed to be 100 miles up. at first i thought they were red paper lanterns, but it was clear to me after observing them for several seconds that they were not anything common. others had pulled over to look @ theses things. i wanted to call the fhp offive in \"plantation\" to report them and to find out if anyone else had seen them. instead i came online to find where i could report this sighting. please let me know if anyone else has reported this. it happened and it was real. i am a healthy 35 year old male with no history if insanity or phsycological issues. this was real. this is the first time i have seen this with my own eyes. what is going here? if there are government experiments or actual ufos we need to be told. this was real. i do not have a cell phone so i could not take any pictures, but others had pulled over to look at them so i'm hoping they had taken pictures of these red orange orbs. i hope you have recieved other reports such as mine. again...this happened last night @ around 10:15 p.m. over i-75 (northbound) 1 mile before \"miami gardens drive\" exit. i wrote the number of witnesses to be 7. there were others pulled on the side of the road but i cannot give you an exact number, i did not pull over. i drove in slow lane looking up @ these orbs and noticed other cars pulled off to the side and peopel looking observing."],"Object Features":"None","Summary":"Driving home on I-75 @ around 10:15 p.m. About 10-13 Red orange orbs about 100 ft above I-75 before 1 mile before you arrive @ Miami Gardens drive exit. \"Believe it!!!\" Other pepole had pulled over to look @ them. It was real!!!!!","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Undisclosed","Case Number":"34525","map":"<A HREF = \"http://maps.google.com/maps?q=32.159615,+-82.900303(34525)&iwloc=A&hl=en\"> mufon case (34525) map </A>","trends":[],"Date of the Event":"01/01/2012 12:00 UTC","Log Number":"US-01022012-0011","Disposition":"Unresolved","Country":"United States","Longitude":"-82.900303","Latitude":"32.159615","Region":"Georgia","files":["/var/www/straped/mufon/html2text/34525.html.txt","/var/www/straped/mufon/org/34525.html"],"Tags":"City"}