{"Log Number":"US-01022012-0012","Case Number":"34526","Date Submitted":"01/02/2012 02:13 UTC","Disposition":"Unresolved","Region":"Washington","Viewing Distance":"Unknown","Latitude":"47.42742","Summary":"Saw 6-9 Very bright lights in the sky snapped a photo and you could tell the lights were all part of the same object. It was gone in a blink.","files":["/var/www/straped/mufon/html2text/34526.html.txt","/var/www/straped/mufon/org/34526.html"],"trends":["There have been 4 other sightings in Wenatchee","There were no other sightings in Wenatchee on or around December 31st 2011"],"Object Flight Path":"Undisclosed","Object Features":"Unknown","Date of the Event":"12/31/2011 10:30 UTC","Country":"United States","City":"Wenatchee","Longitude":"-120.308429","Object Shape":"Disc, Sphere, Star-like, Triangle","Weather Factors":"Unknown","divs":["Sighting DetailsA friend was driving up Washington to western and he saw the very bright lights and they went from blue to green to white he pulled in the driveway ran inside and grabbed us and we went outside and saw 6-8 very bright lights all of a sudden the white lights started going up (because they had been still) and then it was like we blinked and they were gone. Then a bit north of those lights we say a super bright red light. Oh the pic I got was right before the lights were gone. The lights started moving up I grabbed my phone got the pic and then the lights were gone. The red light kind of floated up and that is when I noticed the sound of the military jets it sounded like there were two of them. I tried taking a pic of the red light but the pics turned out black. The red light went straight up. I left the house to come immediately and by the time I had gone from the corner of Washington and western to the corner of cherry and lambert my girlfriend called me and said the red light was back and then was gone the same way the first one took off."],"Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=47.42742,+-120.308429(34526)&iwloc=A&hl=en\"> mufon case (34526) map </A>","Tags":"City"}