{"Date of the Event":"01/01/2012 10:30 UTC","files":["/var/www/straped/mufon/html2text/34536.html.txt","/var/www/straped/mufon/org/34536.html"],"Latitude":"31.414888","Date Submitted":"01/02/2012 09:16 UTC","Longitude":"-103.49822","map":"<A HREF = \"http://maps.google.com/maps?q=31.414888,+-103.49822(34536)&iwloc=A&hl=en\"> mufon case (34536) map </A>","divs":["Sighting DetailsOn 01-01-2012 at approximately 2220 my wife went to the store to buy our baby some milk. I sat at my home with my 5yr old son playing my xbox and waited for her to return. While i was waiting i heard a car approaching my home honking it was now approximately 2230. I looked out of the window and saw my wife jump out of the car, she was yelling \"hurry come out here\". I then ran out of my house as my son followed. When i got outside in the front yard where my wife was she then point in the sky and said \"look\". I stood in amazement at the object in the sky. It was huge. From what i could tell this object appeared to be at least a football field big. It formed a semi-circle in the night sky. There were six buring lights spaced a good distance from each other in the sky that formed a semicircle. The object was moving west at first towards our location. The object then appeared to begin to move North away from our location. The lights were moving together as one. When the object began moving north, the lights began to fade out one at a time. All the lights had pretty much faded when the object was already traveling north away from us. All of the lights were almost gone execept the last two lights they were dimmed almost all the way but they were still visible if you would focus on them. At this time a truck passed by our house slowly. The vehicle then went in reverse and a man asked \"did you just see that\" He told me he had been watching it from a nereby store parking lot. My wife didn't even end up at the store to get the milk before she raced home so i could see the object, so she again left to get milk. I then went outside in the back yard to turn off the christmas lights, so i could continue to observe the sky hoping i would see something else. At approximately 10 minutes after the sighting, i saw 3 jets coming from the west towards the location of the sighting. There was also 2 jets that were coming from the south towards the location. I then watched the jets in amazement because the jets appeared to have there afterburners on. After a few minutes of observing the sky i noticed the jets had left the location of the sighting and were moving west. Later my wife and I were inside the house dicussing what we had seen. I then relized that was she had seen since the beginning was completely different from what we were seeing together. She had seen basically the whole craft. I only saw a semicircle. I only saw part of it. We then went out of the house back to where we had seen the obect. This is were i realized that there were no stars in the sky during this incident, even though at this time the sky was clear and full of stars."],"Case Number":"34536","Log Number":"US-01022012-0022","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","trends":["There have been 2 other sightings in Pecos","There were no other sightings in Pecos on or around January 1st 2012"],"Object Shape":"Circle, Fireball","Region":"Texas","Tags":"City","Weather Factors":"Unknown","City":"Pecos","Summary":"The object had red-orange lights that was heading west but changed direction and went north."}