{"divs":["Sighting DetailsI try to travel down Ward Parkway on Christmas Eve every year and view the Chritsmas lights on the houses along Ward Parkway. My ending point is the Plaza in midtown Kansas City. Traveling north on Ward Parkway towards the Plaza lights, I approached an intersection,stopped at the light on red started driving when the light turned green. As I started driving north I noticed a church on the right with cars parked outside the church on the curb running parallel to the church. I looked up and saw a rectangular object with strobe lights flashing on the left of the rectangle and I could barely see the white strobe light flashing on the far right of the triangle because of the trees.The center strip had an orange glow .The trees were obstructing some of the view, and the street lights were blending in with the lighted object. This object was as wide as two traffic lanes and about two to three hundred feet above the top of the trees. I immediatly thought it was a traffic helicopter but soon realized it was hovering. I had the moon roof shield open and watched this object go over my car over the top of the trees, and as i looked to the rear of my car at the object I soon realized I could still see the orange glow and thought then the glow was coming from under the object.I immediatly thought of turning around and following the object as it moved southeast , but soon realized Ward Parkway is one way for both sides. I really did not know what to think. I would also mention there were people across from the church on the road going east and west standing on the curb or sidewalk. I do not know if they were waiting for the traffic to move so they could cross the street to go to the church, or were watching this rectangular object. This experience is strange in that I did not really put all the information together until I got home. I know there is a plane service that you can rent to view the Plaza lights by air and thought that was what I had seen. But what I saw was a lot lower in altitude towards the ground. I had the radio on listening to Holiday music, and I am not sure if there was any sound from the object. I am glad I had the courage to inform you of this occurance,I could not hold it in any longer without telling someone!"],"Date of the Event":"12/24/2011 08:05 UTC","Date Submitted":"01/02/2012 07:15 UTC","Log Number":"US-01022012-0018","Object Flight Path":"Hovering then path","Country":"United States","Tags":"City","City":"Kansas City","Longitude":"-94.601142","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.993619,+-94.601142(34532)&iwloc=A&hl=en\"> mufon case (34532) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around December 24th 2011"],"files":["/var/www/straped/mufon/html2text/34532.html.txt","/var/www/straped/mufon/org/34532.html"],"Summary":"White strobe light on each end of rectangle with orange glow in center between strobe lights","Case Number":"34532","Source":"MUFON","Disposition":"Unresolved","Object Features":"Unknown","Region":"Missouri","Object Shape":"Square, Rectagular, Triangle","Latitude":"38.993619"}