{"Region":"Texas","files":["/var/www/straped/mufon/html2text/34530.html.txt","/var/www/straped/mufon/more/34530_submitter_file1__ORBUFO.jpg","/var/www/straped/mufon/more/34530_submitter_file2__CIGARUFO.jpg","/var/www/straped/mufon/org/34530.html"],"Object Shape":"Cigar, Sphere","Country":"United States","Viewing Distance":"20 Feet or Less","divs":["sighting detailsmy wife,son, & i just returned from picking up our suv from getting an oil change. when as soon as we pulled up into the driveway, i noticed something unusual in the sky. as my wife got out of the suv and i got out of the other car, she began to reach for our son in the carseat, when all of a sudden i noticed this strange black\\greyish ball just hovering in the sky. from my perspective, it was in the same direction of the moon. i asked my wife, \"what is that?!\" i got her attention, and she said \"what?\" looking at me. i said, \"look! look there, do you see that black ball?\" she says \"yeah, i see it.\" and i said, \"what the heck is that? it's just sitting there!\" i turn around quickly to grab my smartphone from the carseat, and as i look back, the object was gone. after that happened my wife took our son inside, but i stayed outside to try and find it. i turned around slowly 360 degrees and the object was nowhere to be found. as i was looking around i spotted what appeared to be a jet at a higher altitude off to the far left and it looked like it was using its afterburners. as soon as i looked back at the jet seeing that it was even further, i noticed an object that looked like a long black line, almost cigar shaped, heading in the same direction as the jet, but at a lower altitude, and as i watched it, it seemed to disappear right in front of me. then it just completely vanished out of site. the attached photos have been manipulated to show what i saw, and are in no way geniune photos of the actual ufo's. i was unable to capture the ufo at the time of viewing, but i used the photos to give a view of what i saw."],"Summary":"Mid-day Dark hovering objects over Kyle TX","Date of the Event":"01/02/2012 02:10 UTC","Latitude":"29.968121","Date Submitted":"01/02/2012 04:36 UTC","Disposition":"Unresolved","City":"Kyle","Longitude":"-97.841035","Object Flight Path":"Stationary,Straight-line path","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"None","Weather Factors":"Unknown","Tags":"City","Case Number":"34530","trends":["There has been one other sighting in Kyle","There were no other sightings in Kyle on or around January 2nd 2012","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=29.968121,+-97.841035(34530)&iwloc=A&hl=en\"> mufon case (34530) map </A>","Log Number":"US-01022012-0016"}