{"Object Flight Path":"Path with directional change","Case Number":"34535","Tags":"City","Summary":"Large copper colored orb, running silent, directional s turn, traveled n/e to s/e out of sight, other known aircraft present.","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/34535.html.txt","/var/www/straped/mufon/org/34535.html"],"Region":"Florida","Date Submitted":"01/02/2012 08:32 UTC","Latitude":"28.891364","Longitude":"-81.301455","map":"<A HREF = \"http://maps.google.com/maps?q=28.891364,+-81.301455(34535)&iwloc=A&hl=en\"> mufon case (34535) map </A>","City":"De Bary","Weather Factors":"Unknown","Date of the Event":"01/01/2012 07:00 UTC","Source":"MUFON","trends":["There have been 3 other sightings in De Bary","There were no other sightings in De Bary on or around January 1st 2012"],"divs":["sighting detailsi will preface by stating that i am a retired police officer, and commonly stargaze and, in the process, always view a lot of air traffic near and over my home in the evenings. i was not under the influnece of any substance at the time of the observation. it is noted that the nearest airport to my location is orlando-sanford int'l. upon randomly opening my back door looking out to the southern sky after dark, i noticed the (questioned) object right away. at least two (known) small aircraft with common running and landing light gear (as well as \"sound\") were in the area, thus gaining my focused attention to the object. i immediately proceeded outside my home and exited a screen enclosure to reduce my view obstruction. i categorize this object as \"out of the ordinary\". it was a large orb-like object, bright copper\\bronze color, traveling north\\northeast from the northern area of the st. john's river branch west of i-4 causeway. it ran totally silent, in acute contrast to the aforementioned aircraft in the area. it did not blink, pulse, or otherwise display any color variation whatsoever. it appeared larger (about the size of 2-3 common police helicopters, but without the distinct engine noise of same) as it proceeded closer to my point of observation. as it continued its path, the object made a left 30 degree arcing turn followed by a 60 degree arc to the right (an \"s\" configuration if you will). it proceeded in a southeasterly direction and faded out of sight. the object maintained a constant altitude of approx.400 to 600 feet. at the time of the event, i had no immediate access to a multimedia device and just wanted to maintain visual contact for as long as i could. after the event, i elected not to immediately report the sighting, as i was compelled to re-evaluate the event and make other comparisons before i determined in my mind that the orb was genuinely anomolous."],"Object Features":"None","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Log Number":"US-01022012-0021"}