{"trends":["There have been 2 other sightings in Camp Hill","There were no other sightings in Camp Hill on or around April 9th 2005"],"Tags":"City","files":["/var/www/straped/mufon/html2text/3454.html.txt","/var/www/straped/mufon/org/3454.html"],"City":"Camp Hill","divs":["Sighting DetailsSighting Report: April 2, 2005, Camp Hill, Pennsylvania, 10:15-10:45 pm. Clear skies (belt of orion and big dipper visible), planes flying also visible. Looked up and saw the sky was very clear and traced the belt of orion and big dipper (the only stars I recognize). Observed bright blue-red colored glowing object in sky close to belt of orion in the western edge of sky across from street. I watched it for several minutes. I then went into my house and asked my roommate to come look at the skies as they were so clear. We went out and looked. I saw the object was still there. We went back in and got binoculars (not real powerful). We focused on the object and it was glowing and changing colors and appeared to quickly jump. I went to 211 south 19th street (my dad s house) and asked him to come look. we took turns looking through binocular. Ed went into my house (213) to get a camcorder to record it. The battery was dead so we hooked up electric and brought it out. The object was still there. Dad realized the \"jumps\" were our binoculars moving but we realized the objects were stationary and glowing multiple colors. Ed began to film and I noted the time and location on the tape as the clock was not on EST. Ed filmed the object. I then noticed two other lesser, but glowing, similar objects. I asked Ed and my dad to look. They saw the objects also. There were planes flying and other flying lights (planes farther away) so we knew these were not planes. We filmed them all for about five minutes. We quit and I came in to file this report. We are not alien searchers nor wackos looking for UFOs. You are welcome to view the film. I think they are low earth orbiting satellites (although I must confess I don t know what they d look like in the sky but that seems the most logical explanation) but decied to send this to you anyway. Thanks!"],"Viewing Distance":"Unknown","Summary":"Not Provided","Latitude":"40.239812","map":"<A HREF = \"http://maps.google.com/maps?q=40.239812,+-76.919974(3454)&iwloc=A&hl=en\"> mufon case (3454) map </A>","Longitude":"-76.919974","Object Flight Path":"Undisclosed","Object Shape":"Undisclosed","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"","Object Features":"Undisclosed","Disposition":"IFO","Date Submitted":"04/09/2005 03:08 UTC","Region":"Pennsylvania","Source":"MUFON","Case Number":"3454","Date of the Event":"04/09/2005 03:08 UTC"}