{"Object Flight Path":"Straight-line path","Tags":"City","files":["/var/www/straped/mufon/html2text/34549.html.txt","/var/www/straped/mufon/org/34549.html"],"City":"Moab","Date Submitted":"01/03/2012 02:20 UTC","Viewing Distance":"Over One Mile","Country":"United States","Summary":"2 red-orange balls of light 5x bigger 1x greater in magnitude than Jupiter","Object Shape":"Circle, Fireball, Sphere, Star-like","Latitude":"38.557596","Object Features":"Unknown","Case Number":"34549","divs":["Sighting DetailsI spent my New Year's Eve, bringing it in with the Universe, near Birthing Rock(near Moab, Utah). It was awesome, such a clear night, The Milky Way was beautiful. Orion, Perseus, Sirius, Polaris,,, Jupiter, were all magnificent. I saw 3 meteorites and right before midnight the Moon set. One of the best NEW YEARS, Ever!!! Then on my way back I came around the corner towards Moab, and there they were. Two orange lights. I don't know what they were, but they were ascending slowly and to the east of Ursa Major.They weren't helicopters.They were orange-red, about 5 times larger than Jupiter and 1 magnitude brighter than Sirius that night. I would have to guess about 2,000 - 3,000 feet above Sand Flats. I called the local law enforcement dispatch and asked if their deputies were reporting anything. I reassured her that I am not crazy, haven't had alcohol in months and I don't do drugs and as a matter of fact I used to work for this law enforcement agency. She suggested they were fireworks.. I advised her they were not fireworks, the light was constant and had been there for 4 minutes. Then, one faded in about 5 seconds, the other faded about 30 seconds later at the same rate as the first."],"trends":["There have been 13 other sightings in Moab","There were no other sightings in Moab on or around January 1st 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Longitude":"-109.58407","Region":"Utah","map":"<A HREF = \"http://maps.google.com/maps?q=38.557596,+-109.58407(34549)&iwloc=A&hl=en\"> mufon case (34549) map </A>","Source":"MUFON","Log Number":"US-01032012-0006","Date of the Event":"01/01/2012 12:00 UTC","Weather Factors":"Unknown","Sighting Duration":"00:04:00"}