{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"Florida","Case Number":"34545","Date Submitted":"01/03/2012 12:47 UTC","trends":["There have been 10 other sightings in Winter Park","There were no other sightings in Winter Park on or around January 2nd 2012"],"files":["/var/www/straped/mufon/html2text/34545.html.txt","/var/www/straped/mufon/org/34545.html"],"Summary":"Large white glowing orb takes off in Winter Park, FL","Source":"MUFON","divs":["sighting detailswhile giving my friend a ride home at approximately 11:45pm, a light caught my eye from in between some trees. as i continued to drive, from within a opening among the trees i saw what i can only describe as a perfect sphere that glowed a brilliant white. the sphere quickly got brighter and an aura seemed to have appeared, and just as quickly as i notice it the sphere sped off into nothing, leaving a trail of light that looked as if it receded back into where ever the sphere went. i smacked my friend and asked if he saw it; staring at his cell phone, alas he did not. it shook me. the whole event probably lasted only 3 or 4 seconds, but it was not something i can forget. it gave me a feeling of anxiety and fear instantly, and it made time seem to slow down. it's exit was so dramatic, i was sure my friend had seen it too. i can only gather it lasted that short because i didn't have time to alert my friend before it was gone. the most peculiar part of this was the feeling it gave me, because it was almost like it's departure was in reaction to my seeing it. the moment i saw it, it was the biggest thing in the sky by far, and the way it left quickened my pulse and triggered my fight\\flight response. for reasons i'm still not sure of yet, the first thought in my head was \"god, i'm not ready.\" i'm still trying to figure that out. i don't know if i thought it was there for me, or that i was terribly frightened. but that's what i remember feeling. truly an unforgettable experience."],"Date of the Event":"01/02/2012 11:45 UTC","Latitude":"28.60323","Object Shape":"Sphere","Object Flight Path":"Undisclosed","City":"Winter Park","map":"<A HREF = \"http://maps.google.com/maps?q=28.60323,+-81.331465(34545)&iwloc=A&hl=en\"> mufon case (34545) map </A>","Country":"United States","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-81.331465","Log Number":"US-01032012-0002","Object Features":"Dome"}