{"Weather Factors":"Unknown","Object Shape":"Circle, Other","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=31.530735,+-83.835454(34558)&iwloc=A&hl=en\"> mufon case (34558) map </A>","Object Features":"Other","Country":"United States","Date of the Event":"12/31/2011 10:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-83.835454","Case Number":"34558","Log Number":"US-01032012-0015","Tags":"City","Latitude":"31.530735","divs":["Sighting DetailsAs we were traveling on Hwy 520 through Tifton, GA traveling towards Valdosta, GA(very dark travel)we had been admiring the Christmas decorations through a very small town and just as we passed this town and was back on the dark roads I just happen to look up and notice 7 lights in a curved line, except 2 that were side by side lowest to ground, then 1 light after the two side by side ones, about powerline distance from the ground. It initially appeared to be near a powerline, but as I continued to drive, it was clearly not a part of the powerline. I could not stop looking in its direction and I was driving, I yelled and said \"do you see that\" repeatedly. I knew that they were not normal lights! Witnessed by me and another(scared them)very defined, soft red-orange lights. As I was looking back in my rear view mirror I saw one quickly float away and then we were out of view as if they all vanished. I am not a UFO tracker, this is just something I wanted to share because it was something like I'd never seen before. I thought maybe fireworks, but the lights were there like a strung chrismtas decor (which it was totally not)and it was to defined and glowing, nothing visible to see any connection. The formation was almost like the side of the McDonald's \"m\" and it was not a bulb type glow. The only thing is that I wish I would have taken a picture, but I do believe that by the time I would have had access to my phone or a camera it would have been gone after I saw it vanish. As we continued to travel I was a bit shakened and continued to look around in the sky hoping to see it again. FYI, this was a dark rural area with very few vehicles and much land for farming. As we'd continued I also saw a bright white light, I thought that from the distance it caught my eye that it was a planet, well we got a little closer and I shared that maybe that was a helicopter, however, it had no sound... I am totally freaked out by this time... this was about 30 minutes apart and they were not similar at ALL, totally different. The white lights (2) looked as if it was under a helicopter, but again no sound and you could hear anything on that dark road, and it hovered as if it was still. The sky was so clear I think that I saw every star in the constellation that night, I even saw a falling star. But the lights I can not explain. Maybe the military was testing... I don't know. I just know that it was creepy."],"Source":"MUFON","City":"Sylvester","Disposition":"Unresolved","Date Submitted":"01/03/2012 01:04 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Summary":"about 7 lights in a curved line accept 2 that were side by side about powerline distance from the ground, witness by me and my daughter (scared her)","trends":["There has been one other sighting in Sylvester","There were no other sightings in Sylvester on or around December 31st 2011"],"files":["/var/www/straped/mufon/html2text/34558.html.txt","/var/www/straped/mufon/org/34558.html"],"Region":"Georgia"}