{"Object Features":"Unknown","Log Number":"US-01032012-0016","Object Flight Path":"Path with directional change","Summary":"Witnessed oval/egg-shaped gold/amber UFO in vicinity of Route 9 in Middletown.","Date of the Event":"09/03/2000 07:00 UTC","Source":"MUFON","trends":["There have been 15 other sightings in Middletown","There were no other sightings in Middletown on or around September 3rd 2000"],"divs":["sighting detailsit was a warm labor day weekend, and i was the lone passenger in a friend's topless jeep, traveling southbound on route 9 in middletown, en route to an engagement with friends. when we were approximately 1 mile north of the randolph rd. exit, i noticed a glowing light above the jeep, traveling in the same direction (keep in mind, the top was off the jeep). the light was a gold\\amber, and encompassed the entire object, which was egg\\oval in shape. the light did not flash or emit a beam of any sort. there was also no noticeable vapor or sound (though we were on the highway, and it would have been difficult to discern sound). i realized this was no reflection, nor was it a conventional aircraft of any sort. its shape was distinct, and the entire object glowed. we began exiting on to the randolph road ramp (exit 11), which is a very long ramp that circles around and eventually travels north before ending at randolph rd. ironically, the object circled around in the same direction as the ramp (as if following us), but was now off to our left, beyond xavier high school, but probably not beyond route 17. as we approached the end of the ramp, i told my friend what i was witnessing. he immediately looked up to his left, and saw the object for a couple of seconds, before the object completely disappeared (as if someone turned off a light). it was dark at this time, and we did not notice any object after the light disappeared. we both were totally creeped out, and had the distinct feeling that whatever intelligence was controlling this object was aware of us and \"heard\" me tell my friend about its existence (thus the disappearing act). to this day, i feel as though the object was following us, as it only made the sharp right hand turn after we had already done so when exiting the highway (explaining why it was now to our left once we reached the end of the ramp). because this incident occurred over a decade ago, i may not have the date entirely correct. but i do remember it was labor day weekend, and i did file a hard copy report with mufon shortly after the incident. i'm only rehashing it today because there is a very similar report from someone (submitted on 1\\3\\2012), which recently occurred on the same highway in the same town."],"Longitude":"-72.645166","Case Number":"34559","files":["/var/www/straped/mufon/html2text/34559.html.txt","/var/www/straped/mufon/org/34559.html"],"Country":"United States","Date Submitted":"01/03/2012 02:10 UTC","Region":"Connecticut","Object Shape":"Egg, Oval","Tags":"City","Disposition":"Unresolved","Latitude":"41.540199","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.540199,+-72.645166(34559)&iwloc=A&hl=en\"> mufon case (34559) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Middletown"}