{"Date Submitted":"01/03/2012 09:56 UTC","Tags":"City","Object Features":"Unknown","Case Number":"34557","Summary":"Me and my brother witnessed a glowing gold blimp, flew into the clouds, never came out.","Region":"Connecticut","trends":["There have been 15 other sightings in Middletown","There was one other sighting in Middletown on or around November 16th 2011"],"Object Shape":"Blimp, Bullet, Missile, Oval, Teardrop","Weather Factors":"Unknown","Date of the Event":"11/16/2011 06:30 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.553053,+-72.632235(34557)&iwloc=A&hl=en\"> mufon case (34557) map </A>","Longitude":"-72.632235","Viewing Distance":"Over One Mile","Source":"MUFON","Object Flight Path":"Straight-line path","Disposition":"Unresolved","divs":["Sighting Details It was about a week after my birthday, it coul've been november 16th. Me and my brother were on our way to work, he was driving on route 9 north. I looked to the left in the sky, and saw this thing that looked like a gold blimp, shaped like a teardrop turned sideways. it was glowing like a bulb, and that made the exterior seem fuzzy, it was moving in a straight direction northbound in the sky, it seemed to be moving slow, almost stationary, it seemed like it was huge from where i witnessed it. It entered the clouds, I was waiting for it to exit the other side of the cloud, but it never did, I did'nt see it again. My brother said it dissapeared, but I saw it enter the clouds, and my brother was trying to drive to. I've never seen a blimp fly that high, and fly into clouds like that, it also had like a metallic glow to it, like it was reflecting sunlight, but it was a cloudy out. I told my other younger brother about it, and he said his coworkers witnessed something similar, that entered the clouds and came out the same spot it entered in the clouds, almost like a car shifting in reverse, but they witnessed it a week later."],"Log Number":"US-01032012-0014","City":"Middletown","Latitude":"41.553053","Country":"United States","files":["/var/www/straped/mufon/html2text/34557.html.txt","/var/www/straped/mufon/org/34557.html"]}