{"Disposition":"Unresolved","Region":"Connecticut","Summary":"On October 30th at around 3:45AM, I was laying in my bed, i was starring at the stars in the sky, there was no noise because no one in Middletown had electricity, because of the snow storm we got. A glowing yellow disc flew across my field of vision.","Log Number":"US-01032012-0012","Date Submitted":"01/03/2012 09:14 UTC","Date of the Event":"10/30/2011 03:45 UTC","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/34555.html.txt","/var/www/straped/mufon/more/34555_submitter_file1__IMG_20120103_091005.jpg","/var/www/straped/mufon/org/34555.html"],"City":"Middletown","trends":["There have been 15 other sightings in Middletown","There were no other sightings in Middletown on or around October 30th 2011","This sighting has been favorited 1 time.",""],"Longitude":"-72.640365","Weather Factors":"Unknown","Case Number":"34555","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=41.550433,+-72.640365(34555)&iwloc=A&hl=en\"> mufon case (34555) map </A>","Latitude":"41.550433","divs":["Sighting Details It was October 30th 2011, right before 4am, sunday morning. The entire town of Middletown did'nt have electricity, because of the unexpected snow storm we got. I had just woken up, and I was just laying in bed starring at the sky and stars, I must have been starring at the sky for about 30 to 40 minutes, when a large glowing yellow disc, flew across my field of view, from my left to my right, across the sky, I could'nt keep following it with my eyes because my neighbors house was blocking my view. I quikly sat up in bed, because I knew what I saw, It was clear, and just by the way it was moving, I knew it was'nt normal. It moved straight across the sky, but it made a sudden left to right move, as if it were trying to avoid something in the sky. From where I witnessed it, it was bigger than a softball, but smaller than a basketball. It seemed like it was high in the sky, but it wasnt covered by clouds, so it was'nt higher than a mile or so. I could clearly make out a perfect circle inside another circle, with a dot in the middle, it was glowing yellow, like a bulb. It was a quite night, because no one had electricity. I did'nt hear a pin drop, and I know I should've heard something, because when I see a plane miles high in the sky, I can still hear a plane moving through the clouds. The disc was flying lower than a plane would, but no sound at all, no trails, and just by the akward movement, I know it was'nt something normal. I would have to say if it looked like the size of a mini basketball from where I was, and it looked like it was no higher than 2 miles in the sky, then it had to be large. I was able to look at it for at least 2 seconds, I did'nt have time to take pictures, but I drew out a sketch of what I saw that nite. If we had electricity, then I would have never witnessed this, because i normally don't lay in bed starring at the sky after waking up. I have thought about what I saw alot, it was'nt a fire fly, because it was way too cold, not a plane or helicopter, because I did'nt hear a sound, and not a reflection of a car driving by, because i did'nt hear any cars at the time, and there were trees knocked down around my streets for anyone to drive. It was moving fast, but I think I could've followed it with my finger if I could. My friend told me I should look online, to check to see if anyone else witnessed it, but I did'nt feel like I had to, because I know what I saw, and don't think anyone had a better view than me."],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Disc, Saturn-like","Tags":"City","Object Flight Path":"Path with directional change"}