{"Weather Factors":"Unknown","Country":"United States","Date of the Event":"12/31/2011 07:05 UTC","files":["/var/www/straped/mufon/html2text/34565.html.txt","/var/www/straped/mufon/org/34565.html"],"Disposition":"Unresolved","Region":"North Carolina","Date Submitted":"01/03/2012 04:39 UTC","Object Shape":"Square, Rectagular","Summary":"Rectangle shapes traveling at high speed with redish glow all around craft and 1 white light in center of craft. all traveling in same direction from west to east northeast","Sighting Duration":"00:11:00","Source":"MUFON","Longitude":"-80.892536","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around December 31st 2011"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was outside in my back yard at 7:05pm Dec31 2011 and saw what looked ke a sat or ISS of toward the horizon, I told my wife to come look. We watched the first one fly over and I told her that that isn't what I thought it was. I looked up and saw another one a few seconds later then another and another. Then we saw a bigger object, same color of lights and shape, just bigger. I t had a small object flying all around it, It also looked as if it may have been changing shape. After about 11 mins of seeing these lights. There were no more and the other lights were out of sight. I worked in Air and Missile defense systems and know my way around aircraft of all types. What we saw was nothing that I have heard rumors of or have seen ever. If you guys have any theories or explanations please let me know cause my wife is a little \"freaked out\" after seeing what ever it was we saw that night. They all flew in the same pattern and direction, trajectory was a little different for each one. I could not get a pic and didn't think to get the camcorder, Im still kicking myself in the arse! Thanks for what you guys do Brian"],"Viewing Distance":"Over One Mile","Object Features":"Unknown","Case Number":"34565","map":"<A HREF = \"http://maps.google.com/maps?q=35.119117,+-80.892536(34565)&iwloc=A&hl=en\"> mufon case (34565) map </A>","Latitude":"35.119117","City":"Charlotte","Log Number":"US-01032012-0022","Tags":"City"}