{"Object Features":"Dome","Latitude":"38.645961","Date Submitted":"01/03/2012 04:29 UTC","Date of the Event":"12/28/2011 05:30 UTC","divs":["sighting detailsi saw the orbs for three consecutive nights starting 12\\28. initially i saw about 5-6 of them at 5:30 pm on 12\\28; went inside to get my dogs and when i returned last then ten minutes later the quantity of the orbs had doubled! it was so exciting watching them move around in a circular pattern and i was engaged in the energy that emanated from them. later that same evening at about 8 pm i saw the orbs but this time they were much further away and their shape seemed to be less defined as if they were almost translucent. the first sighting of the orbs they had a dome like circular shape and they were very bright. i'm not afraid of ufo's and i thanked them for showing themselves! on 12\\29 and 12\\30 i saw the orbs around 8 p.m. and they were high up in the sky and the shape almost translucent with the quantity being maybe 10 or so. on or about 12\\21 or 12\\22 i saw what i would describe as a meteorite or shooting star. it happened so fast and it had a long tail and disappeared into the dark skies. that may have been at my 5:45 walk with the dogs or at about 9:30 pm. the meteorite appeared to be traveling northwest from what i recall although i'm admittedly directionally challenged! thank you for your research."],"files":["/var/www/straped/mufon/html2text/34564.html.txt","/var/www/straped/mufon/org/34564.html"],"Sighting Duration":"Undisclosed","Log Number":"US-01032012-0021","Region":"California","Case Number":"34564","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.645961,+-121.121148(34564)&iwloc=A&hl=en\"> mufon case (34564) map </A>","Object Flight Path":"Other","Source":"MUFON","Summary":"They were circular, white orbs that were swirling around in a circle.","Disposition":"Unresolved","City":"Folsom","Country":"United States","Object Shape":"Circle","Longitude":"-121.121148","trends":["There have been 8 other sightings in Folsom","There were no other sightings in Folsom on or around December 28th 2011"]}