{"map":"<A HREF = \"http://maps.google.com/maps?q=45.705938,+-121.544215(34577)&iwloc=A&hl=en\"> mufon case (34577) map </A>","divs":["Sighting DetailsI was heading east on my motorcycle on 30th Street towards I5 about 5:50 PM, It was a clear, dark evening with stars visible. I saw a ufo hovering near the highway southeast of Lane Comm. College near the Bonneville Power station towers near Goshen, OR. It appeared to be a triangle shaped craft. I was on my motorcycle so I pulled over halfway down the 30th St. Hill to get a better look. It appeared to be hovering, then it began moving slowly to the west. I noticed a small ball of white light paralleling its course, slightly higher and farther to the south. The larger craft was approximately 1000 feet high. There were three white lights; two on the rear of the triangular shape, one near the front at the narrowest, leading edge. I first thought it was a plane because there was a pulsating red light coming from the top and a yellowish light in the center bottom, but then I realized that all three of the bright white lights were pointed towards the ground, not forward, like landing lights would normally be positioned. The three lights shining straight down washed out the detail of the silhouette of the ufo but I could make out that it was delta shaped. I heard no noise from either object. It disappeared over the trees after about two minutes time."],"Date of the Event":"01/03/2012 05:50 UTC","Latitude":"45.705938","Weather Factors":"Unknown","Object Features":"Wings","Viewing Distance":"501 Feet - 1 Mile","Summary":"triangular ufo with lights hovered over electric station near I5, then moved westerly direction paralleled by small orb","Object Shape":"Triangle","Country":"United States","Log Number":"US-01032012-0031","Disposition":"Unresolved","Date Submitted":"01/03/2012 11:30 UTC","trends":["There have been no other sightings in Hood River","This sighting has never been favorited."],"Case Number":"34577","Tags":"City","files":["/var/www/straped/mufon/html2text/34577.html.txt","/var/www/straped/mufon/org/34577.html"],"Region":"Oregon","Object Flight Path":"Hovering then path,Straight-line path","Sighting Duration":"Undisclosed","City":"Hood River","Longitude":"-121.544215","Source":"MUFON"}