{"Country":"United States","Object Shape":"Star-like","Latitude":"40.659947","Weather Factors":"Unknown","Date Submitted":"01/03/2012 08:30 UTC","Date of the Event":"12/31/2011 07:15 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Disposition":"Unresolved","City":"Kearns","Region":"Utah","Object Features":"Undisclosed","Case Number":"34571","files":["/var/www/straped/mufon/html2text/34571.html.txt","/var/www/straped/mufon/org/34571.html"],"Longitude":"-111.996328","Tags":"City","trends":["There have been 2 other sightings in Kearns","There were no other sightings in Kearns on or around December 31st 2011"],"Summary":"One large light ascend, hovering, dropping. Several smaller lights ascending, descending, changing directions in formation","divs":["sighting detailsi was taking out the garbage when i saw the lights appearing over the tree tops. i called my wife and kids out the front door to watch. she went back inside for a video camera and we watched the show from the front door. the vids are posted on youtube. they didnot look like airplanes or helicopters. in fact an airplane flys by in the video clearly showing a contrast to the moving lights. i also called my friend who lives elswhere and he went outside his front door and watched the event from his house. there was one big white ball light that seemed to be accompnied by smaller red\\orange lights. the white light hovered while the orange lights moved around in paths sometimes in formation. sometimes three sometimes four orange lights at a time would move about and change directions completely unlike an airplane or helecopter. they could fly in formation or break apart from eachother. sometimes they would disappear into space sometimes they would just go dark. more red\\orange lights would appear to take their place. the whole event lasted about 20 minuets or half an hour. in the end the large white light dropped below the treetops taking the smaller orange lights with it. my wife and i where completely excited and wonderous of what we had just seen and recorded. my others around the world have posted the exact same thing over the next few days. here is a link to the vids [youtube link moved to fi section\\cms\\tg]"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.659947,+-111.996328(34571)&iwloc=A&hl=en\"> mufon case (34571) map </A>","Log Number":"US-01032012-0028","Source":"MUFON","Sighting Duration":"Undisclosed"}