{"Tags":"City","files":["/var/www/straped/mufon/html2text/34578.html.txt","/var/www/straped/mufon/org/34578.html"],"Object Features":"Unknown","Disposition":"Unresolved","City":"Santa Ana","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Summary":"two metallic stationary objects double cruising altitude of comm. jets, not touching but close together, one rectangular and reflective, other not so rectangular and dull.","map":"<A HREF = \"http://maps.google.com/maps?q=33.748857,+-117.78443(34578)&iwloc=A&hl=en\"> mufon case (34578) map </A>","Sighting Duration":"00:05:00","Object Shape":"Oval, Square, Rectagular","Longitude":"-117.78443","divs":["Sighting DetailsIn Tustin Ca on chrsitmas eve day, 8:30 am while painting Grecian column structure in backyard swimming pool area, my painting partner placed a ladder looking up to do so. And said, \"What are those things?\" I looked up in the direction he was telling me, and saw nothing, and told him i didnt see anything. With in two min. i placed my ladder on the structure, an looked up the ladder rails like a rifle sight, and instantly saw these two metallic rectangular-ish objects stationary close together but not touching. I called out excitedly, \"I see them! i see them!\" i looked for approx. a minute, noted the rectangular shape slight metallic glint when sun hit it. The other one had no reflection. My partner asked, \"Are we seeing a ufo?\" I said if its still there in five minutes, this could be trouble. This was the end of our sighting. What is strange to me is Im an avid fan about anything ufo. I watch Ancient Aliens, UFO Hunters, Sightings, Destination Truth, Ghost Adventures, Ghost Hunters and such. Ive never seen, felt, or heard a ufo. With as much interest as I have, I felt a little strange looking at it and felt possibly whatever I was looking at, knew I was looking at it. This lead me to return to my work and for some reason never looked up after the five minutes, or the two hours we were there for work. Told my family on christmas day and the possibility that it could be sky lab and shuttle, or something like that. We fly RC airplanes and are constantly plane spotting and identifying aircraft. These two stationary objects were twice as high as cruising comm. aircraft, but still in naked eye visibility. This could be a totally explainable sighting, but I still felt compelled to say something to somebody."],"trends":["There have been 17 other sightings in Santa Ana","There were no other sightings in Santa Ana on or around December 24th 2011"],"Viewing Distance":"Over 1 Mile, Unknown","Latitude":"33.748857","Log Number":"US-01032012-0032","Date of the Event":"12/24/2011 08:30 UTC","Object Flight Path":"Stationary","Date Submitted":"01/03/2012 11:54 UTC","Case Number":"34578","Region":"California"}