{"Region":"South Carolina","Latitude":"33.50038","Longitude":"-81.954197","Date of the Event":"01/04/2012 01:29 UTC","Summary":"Star like object flashing , changing directions rapidly","Sighting Duration":"00:20:00","Object Flight Path":"Path with directional change","Date Submitted":"01/04/2012 02:18 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"US-01042012-0005","City":"North Augusta","Viewing Distance":"Unknown","trends":["There have been 7 other sightings in North Augusta","There were no other sightings in North Augusta on or around January 4th 2012"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/34584.html.txt","/var/www/straped/mufon/org/34584.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.50038,+-81.954197(34584)&iwloc=A&hl=en\"> mufon case (34584) map </A>","Object Features":"Unknown","Country":"United States","Tags":"City","divs":["Sighting DetailsI was in and out since 12 pm (aprox) observing any meteors that might be passing. About 1:29 pm I noticed an object flashing above the tree line. I am out often at night and I have observed planes, satelites etc...this was different. I observed the starlike object flash off and on...with seconds between flashes. when it was not flashing it was not observed. The object occationally and randomly changed directions with some of the flashes. That is to say it would flash then appear up from where it had been. Flash--down from where it had been...it also moved diagonally left and right between some flashes. The movement appeared random. ( But all within a distinct area above the tree line) Twice the object flashed and seemed to be behind a small cloud that reflected the flash...the reflection was three times the size of the original object, hazy and lasted a good second...fading away instead of seeming to turn off and on the way it had before. The object stayed in the same location appox 10 minutes. Disappeared for several minutes and reappeared in the same location. It flashed for 5 to 6 minutes more before it stopped. The stop was sudden and even though I searched the night sky I did not see it anywhere else. My husband observed the object with me for a good 5 minutes. ( He went inside due to the \"intense\" cold of the night. 25ish degrees)"],"Case Number":"34584","Object Shape":"Star-like"}