{"Case Number":"34588","Object Flight Path":"Straight-line path","City":"Vero Beach","map":"<A HREF = \"http://maps.google.com/maps?q=27.644323,+-80.394004(34588)&iwloc=A&hl=en\"> mufon case (34588) map </A>","Log Number":"US-01042012-0009","Region":"Florida","Date Submitted":"01/04/2012 08:27 UTC","files":["/var/www/straped/mufon/html2text/34588.html.txt","/var/www/straped/mufon/org/34588.html"],"Longitude":"-80.394004","trends":["There have been 14 other sightings in Vero Beach","There were no other sightings in Vero Beach on or around January 3rd 2012"],"Object Shape":"Fireball","Tags":"City","Latitude":"27.644323","Disposition":"Unresolved","Date of the Event":"01/03/2012 09:25 UTC","divs":["sighting detailsi officially saw my first ufo!.... i was walking my dogs in the back yard, and i thought someone shot off a roman candle from across the water from the other neighborhood. it was a brilliant orange\\amber orb with color flickering. it made no sound at all and was very beautiful. it was about 300-400 feet above me and i followed it till it disappeared to the east. a few seconds later another orb followed the same exact path rising from out of the tree line area across the water like the first one did. i couldn't get over how close it was and how quiet it was. i kept thinking it might be a helicopter with a spotlight, but the object was flickering\\glowing and totally silent as it passed overhead and then faded into the east. i was very excited and thrilled when i was watching this event, i was not scared but amazed how brilliant and bright in color the object was. i kept squinting my eyes trying to focus on the object to make out what it really was, but the object was to bright."],"Object Features":"None","Viewing Distance":"101-500 Feet","Country":"United States","Sighting Duration":"00:04:00","Summary":"Vero Beach Sighting...I officially saw my first UFO!.... I was walking my dogs in the back yard, and I thought someone shot off a roman candle from across the water from the other neighborhood.","Weather Factors":"Unknown","Source":"MUFON"}