{"divs":["Sighting Detailsat about 5am I went to the back of my home and attempted to see if I could see the forecasted meteor shower. However when looking to the north of my position, I saw with the eye (no glasses) an object far off and not to high from the horizon ( I assume) and was sparkling. My pinky could cover the sighting from my position, so, don't know how far away or big the object was. Because it was cold when I viewed it with a Bushnell 7x15x35 binoculars it was hard to see clearly because of it being cold and I was shaking. However, I was able to distinclty see the colors of random, no pattern flashing of white, red, green, and yellow (as I tried to remember). I have viewed many aircraft and choppers (retired military) and know that lights can be blinking red or white, and alternately, however, these where flashing randomly, not in a pattern, and they were not pulsating. However the colors were very identifiable, crisp and clear, even from my distance. I went out several times on the third time to check I wore glasses, and could see the colors even more clearly. I went back outside for a look at 6am, and the object was gone. -------------------------------nothing follows---------------------------"],"Disposition":"Unresolved","Date Submitted":"01/04/2012 06:20 UTC","Viewing Distance":"Over One Mile","Object Features":"Unknown","Summary":"veiwing meteor shower with Binocculars, saw interesting lights.","Case Number":"34587","trends":[],"Date of the Event":"01/04/2012 05:00 UTC","Sighting Duration":"01:00:00","files":["/var/www/straped/mufon/html2text/34587.html.txt","/var/www/straped/mufon/org/34587.html"],"Tags":"City","Country":"United States","Object Flight Path":"Stationary","Log Number":"US-01042012-0008","Source":"MUFON","Region":"Florida","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.674197,+-81.509374(34587)&iwloc=A&hl=en\"> mufon case (34587) map </A>","Latitude":"27.674197","Longitude":"-81.509374","Object Shape":"Unknown","City":"Undisclosed"}