{"Summary":"Light in night sky that changed colors hovering then moved then vanished followed by second white orb then lots of planes","files":["/var/www/straped/mufon/html2text/34580.html.txt","/var/www/straped/mufon/org/34580.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.841392,+-104.813803(34580)&iwloc=A&hl=en\"> mufon case (34580) map </A>","Latitude":"38.841392","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Date of the Event":"01/03/2012 07:10 UTC","City":"Colorado Springs","Date Submitted":"01/04/2012 12:37 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsDriving from Limon, Co to Colorado Springs, Co observed light in distance, SW in-line, appeared that is, in-line with highway 24. About 10-15 degrees above horizon. Multi-colored with no pattern of lights and unclear if they were same lights always on or cycling colors. We were driving towards Colorado Springs and object was far off towards Colorado Springs. Object appeared to hover, we guess just East of Colorado Springs. Then it moved slowly in what appeared a North direction and downwards like a landing plane but extremely slow. Way to slow to be a plane. We observed one plane in the sky to the South of us a few miles but no other aircraft visible and we compared the plane to the object and it was completely different. It did not appear to be a helicopter either as we have seen many of those before and this did not have any of the characteristics of a helicopter. As we watched it we were driving but we could tell it was moving extremely slow and hovering then it started dropping downwards, straight down and just above the horizon it stopped and simply vanished. At this point we were about 45 miles from Colorado Springs and had been watching the object about 20 minutes. As we scanned the sky we started to see aircraft appear. These were easy to identify as planes, in facts jets, as they moved very fast but had typical aircraft flashing lights on and maneuvered like an aircraft. No sudden drops or rises in their path and they turned gently like you would expect a plane and again, the lights on these were clear and easy to match to planes we have seen before. I would guess fighter jets based on their movements and speed. We observed these jets appear from the SE, E, N, and NE. 5 in total and they all flew into the area we last saw the object that vanished. They circled the area in wide gentle arcs then they flew off in different directions. 2 stayed behind and continued to circle the area between Pueblo, Colorado Springs and South of Denver. (This is a guess based on the paths we saw them fly) They did this for about 15 - 25 minutes. As we were watching the 5 jets come in then circle and fly off and then watch just the 2 jets we saw to the N of Colorado Springs a bright white orb like object in the sky. It flashed like lightning would but it was just an orb, way off in the distance, and was only there for a second. Unable to explain either one. The second could have been a natural something, but it was not stormy. Scattered clouds but mostly clear sky. The first object we could not figure out. Did not match any plane we have ever seen, nor helicopter we have ever seen. We have seen thousands of these fly at night as we have lived by an airport for 10 years. This first object hovered in place and moved way to slow to be a fixed wing craft and did not behave like any helicopter. Lastly, it just vanished followed within seconds by 5 jets appearing in the area from different directions. Must remain anonymous...."],"trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around January 3rd 2012"],"Case Number":"34580","Log Number":"US-01042012-0001","Country":"United States","Tags":"City","Object Features":"Unknown","Disposition":"Unresolved","Region":"Colorado","Longitude":"-104.813803","Object Flight Path":"Hovering then path","Source":"MUFON","Weather Factors":"Unknown"}