{"Object Features":"None","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=42.103441,+-88.335226(34590)&iwloc=A&hl=en\"> mufon case (34590) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/34590.html.txt","/var/www/straped/mufon/org/34590.html"],"Object Shape":"Unknown","Date of the Event":"01/04/2012 07:15 UTC","Disposition":"Unresolved","Latitude":"42.103441","Source":"MUFON","trends":["There have been 9 other sightings in Elgin","There were no other sightings in Elgin on or around January 4th 2012"],"Summary":"Bright Light descending rapidly.","Case Number":"34590","Sighting Duration":"Undisclosed","Longitude":"-88.335226","Weather Factors":"Unknown","Region":"Illinois","City":"Elgin","Viewing Distance":"Unknown","Log Number":"US-01042012-0010","Tags":"City","Date Submitted":"01/04/2012 10:42 UTC","divs":["Sighting DetailsLet me begin by saying that I am an avid sky-watcher. The area I live in (western suburbs of chicago) I see multiple objects in the sky at night. I am also someone who believes unless there is an overwhelming observance with extreme visual evidence that there is more than likely a logical explanation. most of the objects i see at night I would most likely classify as satellites. while some of them have acted interesting to say the least, no observance or sighting has ever blown my socks off, until last week! I was returning from picking my wife up from work so it was about 5:15 Chicago time, and visually it was about dusk, so it was still plenty of light with darkness setting in. We simultaneously saw a bright light descending in the sky rapidly, then broke of in to two, and disappeared, to which I exclaimed Holy s&*$! My wife then said \"what was that!? I couldn't explain it. I have since been leaning towards the explanation of it being a meteorite. Based on its path which was almost directly down at close to a 90 degree angle, and the fact it was fairly light out, it would not be like any meteorite I have ever scene, but as far as logical explanations, that would have to be what it was. Case solved! Until this morning, again with my wife, thank god. Driving my wife to work at 7:15 am, we both witness something that i cannot find a logical explanation for. Headed west on rt 72 near elgin Il, out of the front window and slightly to the right which is south, we saw a burst of light similar to that of a camera flash. this light descended straight down as if on a rope rapidly. In my opinion and these are all estimations, the light descend from the elevation of about 3000 ft to about 100 ft in a fraction of a second and was gone. If my wife hadn't immediately reacted to the sighting I would have absolutely thought I had imagined it. i know this is not a triangle vehicle doing loopedy loops in the sky but it is something I cannot explain. what also is intriguing to me is it proximity to our last sighting, in the same general area. it will continue to puzzle me thus the reason i share this story. It is the first time i have ever posted on this sight. Keep your eyes to the skies my friends."]}