{"Date Submitted":"01/04/2012 11:54 UTC","Tags":"City","Longitude":"-73.8329","files":["/var/www/straped/mufon/html2text/34592.html.txt","/var/www/straped/mufon/org/34592.html"],"Region":"New York","Object Shape":"Star-like","Summary":"3 arm star shape glowing brightly and moving low and silent 30 foot diameter","trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around January 4th 2012"],"Date of the Event":"01/04/2012 06:25 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting Detailsfrom albany ny: i was outside 6:15 to 6:30am looking for any meteor shower activity and taking my dog out. it was early dawn and the sun hadn't risen yet. i saw what appeared to be a plane in the distance. i am in the flight path of planes departing albany airport. the object was traveling north to south i'd say 30 degrees in the horizon. i thought it might have been a twin engine plane by the span of lights. i watched the object get closer and i noticed the object didn't climb but moved straight like a helicopter closer and closer. then i noticed no flashing light and no sound. just a smooth constant slow movement closer and closer. i realized it was something i've never seen before. i just observed and studied the object and it looked to me like 3 brightly colored arms attached in the center spread out equally like a 3 pointed star. the object was 500-1000 feet in the air i suppose. it was so close and i was ready for the object to pass overhead but a tree in my yard blocked my view and that's how i lost sight of it. it should have passed over me and i was sort of frustrated that it didn't. it just dissappeared from sight but it wasn't an illusion and this wasn't imaginary. i honestly did see this."],"Log Number":"US-01042012-0013","Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","City":"Albany","Case Number":"34592","Object Flight Path":"Straight-line path","Object Features":"Appendage(s)","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.666745,+-73.8329(34592)&iwloc=A&hl=en\"> mufon case (34592) map </A>","Latitude":"42.666745"}