{"Object Flight Path":"Straight-line path","Date of the Event":"01/04/2012 04:39 UTC","Log Number":"US-01042012-0025","Source":"MUFON","Summary":"three white lights in triangle formation silent until 75 feet away descending at slow speeds towards no airport or open fields then it vanished","Case Number":"34605","City":"Philadelphia","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around January 4th 2012"],"Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=39.984518,+-75.207585(34605)&iwloc=A&hl=en\"> mufon case (34605) map </A>","Longitude":"-75.207585","Latitude":"39.984518","Tags":"City","files":["/var/www/straped/mufon/html2text/34605.html.txt","/var/www/straped/mufon/org/34605.html"],"Object Features":"Unknown","Disposition":"Unresolved","Date Submitted":"01/04/2012 08:31 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Unknown","divs":["Sighting DetailsI was preparing myself to go hunting the morning of january 4th 2012. I walked outside to see if my hunting buddy was ready to go we was'nt sure if we were going because of how cold it was going to be. He is my neighbor directly next door. I stood on my front steps drinking my coffee and smoking a cigarette. I looked through his front door to see if i see him but his lights were off so i figured he wasn't ready yet so i decided to stay outside and wait for him. I strangly noticed how warm it was out when the temperature was around 15 degress farenheit and i did'nt have a hat or gloves on. i proceeded to sit on my railing on my front patio for about a minute or two. I stood back up then walk over two the front of my door just standing there drinking my coffee and smoking my cigarette. At about 4:39 a.m. i noticed lights appearing from up the street approaching from behind the houses on my side of the street. As the light were getting closer i noticed the craft was descending at the first instant i though it was a plane but i realised i did'nt hear any noise so i figured the the engines did not work and it was about to crash but as soon as it got directly across the street from my house i heard a low airplane sound normally like you'll hear when there real high but this thing was just above roof about 10 feet there was a white light in front like it would have been landing gear lights or something than it was two white wing lights one on each side i did'nt really focus on the look of the object because like i said i thought it was a plane about to crash and it did not register to me the characteristics of hand so i walk to the corner of my street in the same path it was traveling to see because like i said i thought it was going to crash and the way it was traveling there's no airport in that direction especially that close for it to be descending that low so when i got top the top of the block it was gone. Now i was standing in the middle of lancaster ave that's a busy street and when i walked in the street i was so fixaded on trying to relocate the object i didnt even look for cars coming i just walked in the street looking up and around. Now the strangest thing was that i stayed outside on the steps so i could tell my friend what i saw and i was outside until 5:30 a.m. now i was outside in 15 degree weather with no hat or gloves on and i was not cold i get cold very easily and i was out there for an hour and i did'nt bother me after i went in the house i came back out to talk to my friend at 6:30 a.m. before he took his daughter to catch the bus for school and be out there for two minutes i was freezing i needed gloves and a hat. I never thought i would see one but i know what i saw and it wasn't no airplane or helicopter no blimp ballons nothing of that nature i live in the ghetto and theres no reason for military flights to be flying over my neighborhood and also it was traveling so slow that if it was a plane with no engine running it would have dropped out the sky like a rock. the person i was going hunting with was awake and he didnt hear anything so if it was a plane or helicopter he would have heard it."],"Country":"United States","Viewing Distance":"21-100 Feet"}