{"Summary":"Appeared high in sky like a bright planet however no planets in that area of sky.","Source":"MUFON","Region":"Texas","Object Shape":"Circle, Star-like","Weather Factors":"Unknown","Case Number":"34600","Longitude":"-99.160192","City":"Cross Plains","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Cross Plains","There were no other sightings in Cross Plains on or around December 30th 2011"],"Date Submitted":"01/04/2012 03:11 UTC","divs":["Sighting DetailsThe object first appeared as bright planet however none identified in area of sky. I tried to use my go-to telescope to identify it as a planet but my telescope did not recognize the object as anything defined in its database. At first it was stationary and appeared high in southern sky and in same proximity as the moon during that time of the evening. It slowly descended in a northernly direction. The object then hovered to the west of my ranch for 30 minutes and occasionally moved in a quick, abrupt fashion, both up and down and side to side. I would describe the object as orb like, with bright red and orange glow. My property is located in the BMOA (Brownwood Military Operations Area)and I routinely see jet fighters and helicopters performing exercises in the area. During these events there is much noise from the engines. This object made no sound as it moved. Te craft slowly traveled to the west which is in the same direction of Dyess AFB in Abilene, Texas. The object again appeared the following night, December 31st approximately the same time in the evening (8pm) and acted in a similar fashion. I do not believe the object to be a weather balloon as it was giving off its own light not reflecting light from another source. The object seemed to hover above the tree line about 150- 200 feet. No other aircraft in the area at the time either military or civilian. I tried to use my call phone camera to take pictures however the craft was about a half mile from my location and therefore nothing appeared in the pictures which i took."],"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Features":"None","Disposition":"Unresolved","Latitude":"32.135049","Date of the Event":"12/30/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.135049,+-99.160192(34600)&iwloc=A&hl=en\"> mufon case (34600) map </A>","files":["/var/www/straped/mufon/html2text/34600.html.txt","/var/www/straped/mufon/org/34600.html"],"Object Flight Path":"Hovering then path,Straight-line path","Log Number":"US-01042012-0020","Tags":"City"}