{"files":["/var/www/straped/mufon/html2text/34601.html.txt","/var/www/straped/mufon/org/34601.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Log Number":"US-01042012-0021","Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-117.253584","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.850108,+-117.253584(34601)&iwloc=A&hl=en\"> mufon case (34601) map </A>","Date Submitted":"01/04/2012 05:23 UTC","Summary":"Driving bus north on la jolla blvd at bird rock ave, saw orange orb coming towards me, stopped bus to get out and look, brite object pulsated and went out, saw round grayish round object moving fast","Region":"California","Date of the Event":"01/03/2012 07:42 UTC","City":"San Diego","Disposition":"Unresolved","Case Number":"34601","divs":["Sighting DetailsI am a bus operator for San Diego Transit and was was driving down La Jolla Blvd. North bound at approx 7:40. I am believer in UFOs and constantly look to the sky's while driving the bus at night. I see airplanes and helicopters all the time while driving. What's interesting is that I always look for the orange orb as opposed to the brite airplane lights. As I'm driving I observe what appears to be a orange glow in the sky. La Jolla Blvd has round about circles in this area so as I look up and make the turns the glow comes in and out of view because of trees and buildings. I the think to myself that it's one of those Chinese Lanterns until I realized it was coming towards me as opposed to floating. This is our of character for me but against company policy I pulled the bus over at a bus stop located at Bird Rock Ave. even tho there was no one at the stop. I stepped off the bus and took off my hat and watched the glow. It looked like the orange orb that I have heard so many UFO enthusiast talk about. As I watched it travel south it it seemed to disappear and re-appear as the glow pulsated out and then back. I then look north and saw a plane that appeared smaller the the orb. Seconds later it went out again but this is when I observed the object. Even tho the glow went out I could still see a round grayish object moving at a high rate of speed southbound. I watched it as it flew and realized I needed to get back on the bus and did not wait for it to vanish from my site."],"Country":"United States","Latitude":"32.850108","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around January 3rd 2012"],"Tags":"City","Object Shape":"Circle, Sphere"}