{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.091297,+-94.510641(34602)&iwloc=A&hl=en\"> mufon case (34602) map </A>","Object Shape":"Sphere, Star-like","Case Number":"34602","Object Features":"Unknown","Date of the Event":"01/03/2012 05:55 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-94.510641","trends":["There have been 11 other sightings in Joplin","There were no other sightings in Joplin on or around January 3rd 2012"],"Date Submitted":"01/04/2012 06:31 UTC","Log Number":"US-01042012-0022","Country":"United States","City":"Joplin","divs":["Sighting DetailsI pulled into the parking lot at Fred and Reds to get dinner. Still in car I happened to look up in the sky ( I don't know why) to the east, out of my drivers side window. I saw a bright light which looked alot like something I have seen about 4 times since early Dec. 2011. It was still, just hovering there, not moving.I observed it for a couple of minutes. All of a sudden 3 objects that looked like blinking bright lights (sort of starlike) came out of the big light and darted around all over erratically to the north,staying fairly close to each other and then they went up higher, not real high though, but were still blinking.There were a few clouds and I observed them to move in and out of the clouds and then they stopped where they were visible and stood still.They were spaced apart but not really level with each other, still blinking. I then observed the original large light(which was to the south, and lower in the sky) to move and start floating slowly in a downward motion toward the ground until it had to be getting close to the treetops because I could no longer see it from my view because of bldgs. and trees in the way.I kept watching the smaller ones they were still blinking and sitting still and (I think I may have then seen what appeared to be an airplane? come flying past near those objects) when I got out of the car and went into the restaurant.When I came out about 30 min. later they were gone.I know what an airplane looks like in the sky.What I saw , an airplane can't do.But today when I was telling about the incident to my Mom and sister, I remembered the airplane, but it was vague. Weird.I was thinking at first that what I saw must be a star or a planet. There weren't that many stars visible,besides, it was bigger than a star,and much lower in the sky, but the few stars that were out, were up really high,where they usually are and this bright light was way, way below compared to the star or two I could see. It was just after dark.I looked over to the west to see what the sky looked like that way.....there was still a faint bit of light,with clouds, I guess from the sunset? I don't know, it was kind of pinkish, but that light was not in the eastern sky where I was looking.This is the 4th time I have seen a bright light like this since early Dec. 2011, however, this is the first time I have seen objects shoot out from it and put on a show. I figure I was meant to see it for a reason, just don't know the reason? Hopefully someone else saw this happen as well. I did not report the other sightings. My sister and mother who are aware of the other sightings suggested I report this to you. Thanks for listening."],"Latitude":"37.091297","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Region":"Missouri","Summary":"saw a bright light hovering still...3 objects shot up and away darting then stood still blinking....the large light then started to float slowly towards the ground until it was out of sight","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/34602.html.txt","/var/www/straped/mufon/org/34602.html"],"Tags":"City"}