{"Object Features":"Unknown","Country":"United States","divs":["sighting detailswent out to blanket the horses and collect some kindling for the woodstove when i looked at the moon and the pretty ring around it. to the west and north of the moon from my vantage point was what looked like a bright planet, and i remarked to myself that it might be venus, and that she was really big and bright so close to the moon. and then it moved. it approached my position and hovered just a little west of the back of my property. it executed slow and graceful figure eights and other patterns, almost as if it were swimming in the sky. it was a light yellow\\gold color, and i noticed as it moved that it would occasionally emit what looked like white sparks of light from its surface. i went to the house to get my sony handycam and as i did so, the object moved in the direction i went, keeping the distance between us relatively the same. when i came back out, it was still there, and i took several really bad videos of it that i will upload as soon as i can. some friends came over while i was checking out the video and i hurried them outside to the site i'd seen the object. it was still there. it displayed the same behavior with them that it did when i first noticed it and will . several planes came into the area and the object became still while they passed. none of the planes seemed to notice the object. just went back out and looked. it's still there!"],"Longitude":"-122.127105","map":"<A HREF = \"http://maps.google.com/maps?q=40.136089,+-122.127105(34614)&iwloc=A&hl=en\"> mufon case (34614) map </A>","Region":"California","Date Submitted":"01/05/2012 12:12 UTC","Latitude":"40.136089","Tags":"City","Log Number":"US-01052012-0001","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"01/04/2012 08:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Diamond, Star-like","Summary":"Starlike Object Hovering, Moving in geometric patterns, figure eights, for over an hour and is still there as I write this","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 6 other sightings in Red Bluff","There were no other sightings in Red Bluff on or around January 4th 2012"],"Disposition":"Unresolved","City":"Red Bluff","Case Number":"34614","files":["/var/www/straped/mufon/html2text/34614.html.txt","/var/www/straped/mufon/org/34614.html"],"Sighting Duration":"Undisclosed"}