{"Disposition":"Unresolved","Log Number":"US-01052012-0005","divs":["Sighting DetailsIn the doorway of my apartment while smoking, I looked to the stars as I always viewed them as beautiful. Noted a extra large starlike object which illuminated the sky and a ray shining downward from the object, lasting 7 to 10 minutes. Then the ray stopped beaming from the starlike object. It had me so mesmerized I couldn't turn away,then I became frighten because I have viewed other sittings in the past, once in the same town, (though that siteing noted a different shape and appearance) the other siteing was in in New York. I contacted you all once before, but after you questioned me and I attempted to share this info. with a family member, I was afraid my family would think I was losing it, so I threw out the paperwork you sent me . For you all had asked for a drawing of my encounter or viewing of my siteing of approx. 30 years ago in Rochester, New York. sorry about this but it was somewhat frightening to me and made me questioned myself, \"Had I actually viewed these things?\" Now that the questionable siteing are more frequent (twice in last couple of years), seeing strange illuminations in the sky, I can't help but wonder if a ufo has invaded our planet. Prayerfully, no harm shall come to us. If it's ok, I like to continue to report if indeed I view any additional siteing's. And yes, I had my glasses on. A question you proposed to me before. Thanks for viewing my info."],"Date Submitted":"01/05/2012 01:31 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.3735,+-121.946017(34618)&iwloc=A&hl=en\"> mufon case (34618) map </A>","files":["/var/www/straped/mufon/html2text/34618.html.txt","/var/www/straped/mufon/org/34618.html"],"City":"Vacaville","Summary":"very bright light w/beam shining downward, above the hills in vacaville, ca.","Country":"United States","Object Flight Path":"Stationary","Longitude":"-121.946017","Tags":"City","Object Shape":"Star-like","Object Features":"Unknown","trends":["There have been 10 other sightings in Vacaville","There was one other sighting in Vacaville on or around October 10th 2011"],"Region":"California","Date of the Event":"10/10/2011 12:00 UTC","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"38.3735","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"34618"}