{"Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Date Submitted":"01/04/2012 11:46 UTC","Summary":"Turn out of subdivision, observed big, lower hovering amber/gold light, drove closer, light turned off, HUGE black object appeared hovering, then moved w/o sound E/NE","divs":["sighting detailsi was pulling out of my subdivision stonebridge crossing, turned east on virginia ave when i saw a low hovering amber\\gold blow about 100 - 200 feet above the trees. the light first appeared round then looked to flowing like it had a tail. initially i thought the home builder had a balloon floating in the air, but there were no stings or flags coming down to a fixed point on the ground. the light was no blinking and way too big for a helicopter and was no way an airplane b\\c was too low to the ground a stationary. on the night of the event it was cold out, with low cloud cover. as i approached the stop light at virginia and lake forest blvd i noticed the light had moved a little bit for where it was orig. stationed. once i stopped at the light, the object's light turned off and a huge black triangle shaped object appeared with no lights, no sign of any engines, blades, etc., and made absolutely no sound. i had all my windows down and sunroof so i could clearly make out the dark object hovering there completely still. the black object hovered high enough to not reflect any ground lights, but low enough to not reflect any light reflecting off the low cloud cover. the object was blacker than the night sky that would appear between the cloud cover as the clouds raced eastward. it hovered there for about 15 - 20 seconds and then moved in a straight line east\\north east with out a sound; completely stealth. i could make out the black object as it moved east\\northeast because it was darker than the sky and the clouds. once the light turned green i crossed lake forest blvd traveling east, raced down the small hill and up to the top of the hill where i had a great view of the sky and the area the object traveled, but it was no where in sight. the object traveled on a complete straight path, like it was flying on a perfect flat plane with no swaying. it's like object put out a mast and sailed with the wind in a complete straight path with no wavering or sound. i couldn't believe what i saw and tried several drive to several hill tops that give me a clear view of the night sky and the huge object was no where to be seen. what i saw that night has bugged me for months and months and i'd love to know what i saw that night. whatever it was defined all logic and any technology i'm aware of."],"Log Number":"US-01042012-0033","map":"<A HREF = \"http://maps.google.com/maps?q=33.205636,+-96.635512(34613)&iwloc=A&hl=en\"> mufon case (34613) map </A>","Weather Factors":"Unknown","Case Number":"34613","Latitude":"33.205636","Object Shape":"Triangle","Object Features":"None","Region":"Texas","Country":"United States","Longitude":"-96.635512","files":["/var/www/straped/mufon/html2text/34613.html.txt","/var/www/straped/mufon/org/34613.html"],"City":"McKinney","Object Flight Path":"Stationary,Hovering then path,Straight-line path","trends":["There have been 30 other sightings in McKinney","There were no other sightings in McKinney on or around February 12th 2011"],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Date of the Event":"02/12/2011 10:30 UTC"}