{"Viewing Distance":"Unknown","Region":"Cordoba","Country":"Argentina","Log Number":"AR-01052012-0003","Latitude":"-30.854811","Object Features":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/34616.html.txt","/var/www/straped/mufon/more/34616_submitter_file1__018.JPG","/var/www/straped/mufon/more/34616_submitter_file2__017.JPG","/var/www/straped/mufon/org/34616.html"],"Object Shape":"Square, Rectagular","Longitude":"-64.525749","Object Flight Path":"Unknown","Disposition":"Unresolved","Case Number":"34616","Source":"MUFON","City":"Capilla del Monte","Date Submitted":"01/05/2012 01:06 UTC","Weather Factors":"Unknown","Summary":"Caught 2 metallic-like objects with my camera above Mount Uritorco in Argentina","Date of the Event":"12/19/2011 07:22 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=-30.854811,+-64.525749(34616)&iwloc=A&hl=en\"> mufon case (34616) map </A>","divs":["sighting detailsi was walking through the town of capilla del monte, in central argentina on 12\\19\\11. i was taking photos of the \"cerro uritorco\" a famous mountain in the cordoba de sierras mountain range. i took five photos of the mountain as i walked towards the downtown area. the last photo i took was at 7:22 pm local time. approximately the same time i took the photo, i had a very strange sensation in my chest\". it was very noticeable, almost like a nervous feeling in the stomach, but it was centered above my sternum. i did not see anything abnormal. when i returned to my hotel and downloaded the photos, in one of the pictures (taken at 7:22pm), i observed two metallic objects, directly above each other to the left of the mountain face. one is very small, but square-shaped when zoomed in on. the second is very large, but blurry, towards the top of the photo. there were no planes, helicopters or birds at the time the photo was taken. in fact, i had not seen a plane or helicopter at all during the day. im attaching two photos, the first, contains the anomalies, the second, is the photo i took four minutes before."],"trends":["There has been one other sighting in Capilla del Monte","There were no other sightings in Capilla del Monte on or around December 19th 2011","This sighting has never been favorited.",""]}