{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.876418,+-76.375942(34619)&iwloc=A&hl=en\"> mufon case (34619) map </A>","City":"Portsmouth","divs":["Sighting DetailsI had returned home on Dec.19,2011 at 19:30 hrs est. and started unloading a few groceries into my garage.In the process of doing that I look into the sky and noticed what appeared to be a small group of three circular cloud or misty like objects hovering about 150 to 250 feet in the air at about a 60 degree elavation.It appeared a bit unusaul at first and I was about to continue unloading items when a fourth object appeared moving in a zig zag pattern leaving a bright orange trail behind it until it moved into close proximity of the other three objects.They hovered for about one minute and then began rotating in a clockwise direction at about 20 to 30 feet apart at equal distance from each other.I would not have paid much attention had I not noticed the fourth object arrive.I watch them rotate in a circular pattern and the merge into one object which appeared to spin then break up into four object again and repeat the process over again. I tried to determine what it was and looked around to see if anything could be causing it. I was convinced it was nothing like search light or anything else that was making what I was witnessing. I walked toward the oject and they huddled together and moved away. The closer I got to them the more they moved away I was amazed and curious. I looked around to see if I could find a neighbor to confirm what was happening and no one appeared to be home so I proceeded to my house to awaken my son to witness this event. He proceeds outside and I said observe this and see what happens when I approach them . He watched and his exact words were that is really creepy. This continued for about 30 minutes from when I first noticed them. They continued as we went inside as tempeture was 45 degrees outside.Intering into the house he said they were UFO 's I said ,I have work on submarines,aircraft carriers,airplanes and heliocopters and I don't know what they were but I have never seeen anything like what we had seen. It started to rain about 15 minute after intering the house I went back outside to check on them and they were gone.I had made an attemt to photogragh them with my cell phone but having a lower grade cell phone the attempt photogragh them was not successful."],"Tags":"City","Weather Factors":"Unknown","Date of the Event":"12/19/2011 07:30 UTC","Longitude":"-76.375942","Summary":"4 hovering objects rotating in a circle merging into one object separating and repeating the same process over and over. process","files":["/var/www/straped/mufon/html2text/34619.html.txt","/var/www/straped/mufon/org/34619.html"],"Case Number":"34619","Sighting Duration":"Undisclosed","Object Features":"None","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Log Number":"US-01052012-0006","trends":["There have been 2 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around December 19th 2011"],"Disposition":"Unresolved","Object Shape":"Circle, Oval, Sphere","Viewing Distance":"101-500 Feet","Date Submitted":"01/05/2012 01:45 UTC","Country":"United States","Latitude":"36.876418","Region":"Virginia"}