{"Log Number":"US-01052012-0007","Case Number":"34620","Source":"MUFON","Object Features":"None","Country":"United States","divs":["Sighting DetailsOn New Years Eve I was reading a book at midnight when at five after I received a phone call from my sister. Grabbing my cup of coffee, I went outside to talk. (I was in Richmond Hill looking South-SouthWest) As I was watching all the rockets and such going off, I noticed one orange ball flying up at a 325 (est) degree angle. I told my sister it looked as if someone had fired an Army flare. It didn't explode but kept going up, then went in a horizontal plane to the East. I went further into the yard to watch and noticed another orange ball shooting up at a 45 degree (est) angle heading to the West. It just stopped and hovered while the first one also stopped and hovered. I then noticed there were two more orange balls above the first two creating an image of a lopsided box. I had not seen them arrive. The topmost ball semed to have two shallow elipses (one top, one bottom). They did not pulse or anything and had no tails while shooting upwards. They hung there; occasionally moving up, down or sidewards but maintaining their positions for the period of time it takes to smoke an entire cigarette plus a few more minutes. They appeared from my position to be the size of an aspirin and an Eisenhower dollar would have covered the entire scene. They appeared at around the 2300 mark looking South. They all seemed to fade from view within a minute or so. Perhaps heading South? I had no camera avilable, but wrote down the details immediately afterwards."],"Region":"Georgia","Longitude":"-81.303443","files":["/var/www/straped/mufon/html2text/34620.html.txt","/var/www/straped/mufon/org/34620.html"],"Summary":"Four globes. Two stationary, bottom two approaching from opposing directions. Hovered for about 7 minutes and faded from view.","Tags":"City","Disposition":"Unresolved","Latitude":"31.938265","Sighting Duration":"Undisclosed","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=31.938265,+-81.303443(34620)&iwloc=A&hl=en\"> mufon case (34620) map </A>","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Date Submitted":"01/05/2012 03:27 UTC","trends":["There have been no other sightings in Richmond Hill","This sighting has never been favorited."],"Object Flight Path":"Other","City":"Richmond Hill","Date of the Event":"01/01/2012 12:00 UTC"}