{"Region":"California","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Disc, Sphere","Disposition":"Unresolved","Date of the Event":"01/04/2012 07:15 UTC","City":"La Quinta","Country":"United States","Latitude":"33.665599","trends":["There have been 3 other sightings in La Quinta","There were no other sightings in La Quinta on or around January 4th 2012"],"Tags":"City","divs":["Sighting DetailsI HAVE SEEN UFO'S BEFORE BUT NEVER TOOK OUT A CAMERA. BUT LAST NIGHT I DID!!!! IT LAST TOO LONG FOR ME TO STAY OUT AND SEE OR OBSERVE HOW IT TOOK OFF - THAT'S USUALLY THE BEST PART! SUPER FAST - FASTER THAN THE BLINK OF AN EYE. I FIRST SAW 9 UFO'S IN 1975 RIDING PASSENGER IN MY HUSBAND'S CAR ON THE FWY OF IDAHO. I WORKED AT AN ABC NEWS STATION AND SAW THEM IN THE SKY AFTER WORK. AFTER A WHILE ONE DROPPED FROM THE SKY AND HOVERED ABOVE THE LAND FOR A FEW SEC.S AND THEN TOOK OFF SO FAST AT A 45 DEGREE ANGLE INTO SPACE - SO FAST YOU COULDN'T SEE IT AFTER IT SHOT OFF!!! I HAD 2 SIGHTINGS THAT SAME YEAR (75) BUT A WHOLE 25 YEARS LATER IS WHEN I STARTED SEEING THEM AGAIN? WHY ME I HAVE NO IDEA, BUT IN SAN CLEMENTE, CA. BEFORE MOVING HERE TO THE PALM SPRINGS AREA, WE BOTH SAW A HUGE AMOUNT OF UFO'S ONE NIGHT THAT WE EVEN HAD A NEIGHBOR SEE THEM TOO! BUT IT WAS NEVER IN THE PAPER SO WE NEVER SPOKE OF IT - THAT IS UNTIL TODAY. I NEVER USUALLY SEE THE SAME TYPE OF UFO REPEATEDLY JUST DIFFERENT TYPES AND THEY DO DIFFERENT THINGS EACH TIME TOO. YOU CAN CALL ME - INTERVIEW ME - I DON'T CARE BUT I NEVER USUALLY SPEAK ABOUT THIS TO ACQUAINTANCES OR FAMILY AND FRIENDS BECAUSE OF FEAR OF RIDICULE. BUT I DO REMEMBER THE 1ST UFO'S - THE 9 IN FORMATION IN IDAHO THAT I TOLD THE NEWS DIRECTOR AT ABC AND THE VERY NEXT DAY AFTER TELLING HIM HE FOUND AN ARTICLE IN THE PAPER OF OTHERS SEEING MY (EXACT) SAME DESCRIPTION \"IN ALL THE WESTERN UNITED STATES SEEING 6 OR NINE RED, WHITE AND BLUE, MAYBE GREEN, LIGHTS IN THE SKY\" JUST AS I HAD TOLD HIM THE DAY BEFORE. HE WAS FREAKED OUT NEEDLESS TO SAY!!! I KNEW THEY WERE REAL FROM THAT DAY ON. P.S. I EVEN HAVE A DAUGHTER IN NAVY INTELLIGENCE WHO WAS STATIONED IN GUAM YEARS AGO WHEN SHE AND A FELLOW NAVY GIRL WERE OUT TO EAT AT A RESTAURANT. OUT OF THE WINDOW THEY SAW 2 UFO'S OUT THE WINDOW - SHE SAID, WARBLING? LIKE THEY WERE GOING TO CRASH BUT DIDN'T - ZOOMED OVER THE RESTAURANT AND THEN BACK OVER THE RESTAURANT AGAIN AND SHORTLY TOOK OFF BUT NEITHER GIRL EVER REPORTED TO THEIR CHIEFS. SHE KNOWS MORE ABOUT \"THEM\" THAN I DO. P.S. I DID TAKE A VIDEO LAST NIGHT BUT I DO NOT KNOW HOW TO ATTACH IT."],"Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/34628.html.txt","/var/www/straped/mufon/org/34628.html"],"Weather Factors":"Unknown","Sighting Duration":"01:00:00","Date Submitted":"01/05/2012 11:37 UTC","Source":"MUFON","Longitude":"-116.236287","Log Number":"US-01052012-0013","map":"<A HREF = \"http://maps.google.com/maps?q=33.665599,+-116.236287(34628)&iwloc=A&hl=en\"> mufon case (34628) map </A>","Object Features":"Unknown","Summary":"1 OBJECT I HAVE VIDEO","Case Number":"34628"}