{"Disposition":"Unresolved","Latitude":"36.930755","Object Features":"None","Date of the Event":"12/30/2011 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.930755,+-95.251827(34632)&iwloc=A&hl=en\"> mufon case (34632) map </A>","Country":"United States","Summary":"Slanted solid thick white line that dropped/fell into silver something that darted farther 3x looking like round black shape to a dot.","City":"Welch","Object Shape":"Cylinder, Other, Unknown","Case Number":"34632","divs":["Sighting DetailsMy daughter (18), son (15), and I left our house to go to the store which is about 35 to 45 minutes away. 5 miles with turns south, east, then south again, we go east one more mile before turning south onto the long stretch of dirt road that leads us to Hy-way 10. The road before we make that last south turn has some trees and a house with other out buildings on the corner where we turn south. When we made the turn going south I noticed what I thought was a low, slanted, thick, white jet stream. As I'm driving I realized that what I thought was a jet stream was not getting longer or dissipating. Then I saw that there was not a plane or jet at either end. I said to my kids, \"Look at that white line in the sky. I thought it was a jet stream but I can't find a jet.\" But of course, no one was paying any attention to me. She was listening to her i-pod in the front seat and he was playing his PCP in the back seat. I tapped on her arm to get her attention and then this was the conversation and what happened during it. I said, \"Look at that weird jet stream\", she said, \"where?, and I said, \"there!\", she says, \"where?\" I yelled, \"There (pointing), right there, are ya blind?\" Then at that time it kinda dropped or fell like a leaf tilting back and forth causing it to reflect a brilliant silver just like the mercury inside a thermometer. I said,\"What the h***? Look at what it's doing, look, what is it? Look at that s***! No way! Do ya see it?\" she said, \"No, where is it?\" At some point, I don't know when, I had attracted my sons attention to. Then, I did not see it either. I said, \"It's gone! Where is it? Where did it go?\" I looked to the south and saw a black round shape about the size of a quarter at an arms length. I said, \"There it is! Right there. See that black thing? My silly daughter still can't find it. She said, \"Where?\", My son reached his arm over the front seat and pointed. He said, \"There, there it is. Now do you see it\"? I said, \"To late. It's gone. No it isn't, look!\". Now it had zipped south then west and was about the size of a dime this time. Then I said, \"It moved again, it's gone again, it's gone, you missed it. You have got to be blind as a bat!\" My son pointed again and said, \"No, look a little bit right. It's really little now.\" He was right, there it was. It had zipped south, and a bit west again. Now it was about the size of a pea. I don't remember if my daughter wound up finding it or not. I really don't understand why she could not find it at first. I think I'm gonna make my son sit in the front from now on. lol! Just joking. Any way, we lost sight of it for good after that. For the first couple of days after that I thought about it off and on. Then thought about it more and more trying to make sense of the white line that I first thought was a jet stream, or trail. Now I can see a big difference between the white line and a jet stream. Jet streams will sometimes, swell, take on different shapes, grow longer in front, fade or dissipate at their end. The white line did none of these. It was wider than a jet stream. It did not get longer or shorter. It was a pure white color, a solid white that had straight edges, not the rolling puffy looking edges. Now I think about it all the time. It all happened so fast after the white line showed itself to be something other than a jet stream. It was an extremely shocking and unexpected experience!!! If you try to contact me please dial the number 2 times in a row so I will know to pick up. I don't answer my phone if I don't recognize the phone number due to past stalking incident. You can also text me and let me know your going to call or you can email me to set up a time when you would like to call. Thanks for your time."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/34632.html.txt","/var/www/straped/mufon/org/34632.html"],"Viewing Distance":"Over 1 Mile, Unknown","Region":"Oklahoma","Tags":"City","Weather Factors":"Unknown","Log Number":"US-01052012-0017","Object Flight Path":"Stationary,Hovering then path","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Welch","This sighting has never been favorited."],"Date Submitted":"01/05/2012 05:35 UTC","Longitude":"-95.251827"}