{"Date of the Event":"01/05/2012 06:45 UTC","Latitude":"31.61638","Object Shape":"Circle, Sphere, Star-like","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.61638,+-84.148148(34638)&iwloc=A&hl=en\"> mufon case (34638) map </A>","Source":"MUFON","Tags":"City","Sighting Duration":"00:02:00","City":"Albany","Summary":"i saw an extremely bright white object appear directly overhead with no sound. it moved very slow, changed flight pattern multiple times, had no sound, it dissapeared behind the tree line.","Disposition":"Unresolved","Date Submitted":"01/05/2012 08:56 UTC","divs":["Sighting DetailsI was standing in my back yard right outside my door on my patio. I was getting ready to grill dinner. the grill was alredy lit. I had been looking at the stars because it was a perfectly clear sky. I was looking at one of the brightest objects in the sky besides the moon that night and then noticed an object moving threw some pine tree limbs that was very bright, this thing was brighter that the brightest stars out tonight, I continued to watch the object move because i am familiar with aircraft and the way their flight characteristics and the light was not blinking, i new it was sonething i'd never seen before ,then the object started changing it's flight pattern by making a turn and it also moved from side to side slightly. the object was a perfect round ball of pure white light. I could not hear any sounds of aircraft. since it was moving so slow i ran in the house to get my mother and she also saw the object. i ran inside to get her, it only took a few seconds to get back to viewing the object. by the time she got outside it was no longer directly above me it was moving away from the house and we both said it looked to be getting lower and then dissapered behind the tree line. that's the last we saw of this object. there was heavy airplane traffic afterwards in the area that i noticed because i stayed outside for awhile afterwards to grill pork chops.I could hear the planes as they went by and they where even higher that the object. i think the object may have been visible before i noticed it because i was so close to my house that it bloked some of my field of view behind me. This is why i only saw it appear directly above me and then flew out of sight. my eyes where frozen to the sky when i saw it, i almost tripped over the top to the grill sitting on the patio. i walked out into my yard as it whent away kind of following it to get a better view. i was able to see the object perferctly clear with nothing in the way after i walked out into my yard because there are no trees where it ended up flying. we lost sight when it seemed to get lower and ferther away and dissapeared behind the tree line."],"Object Flight Path":"Path with directional change,Other","trends":["There have been 7 other sightings in Albany","There were no other sightings in Albany on or around January 5th 2012"],"Country":"United States","Weather Factors":"Unknown","Region":"Georgia","Log Number":"US-01052012-0023","files":["/var/www/straped/mufon/html2text/34638.html.txt","/var/www/straped/mufon/org/34638.html"],"Object Features":"Unknown","Longitude":"-84.148148","Case Number":"34638"}