{"Region":"Connecticut","map":"<A HREF = \"http://maps.google.com/maps?q=41.764167,+-72.4375(34640)&iwloc=A&hl=en\"> mufon case (34640) map </A>","Country":"United States","Summary":"2 Triangle Craft - Moving over RT 85","Viewing Distance":"101-500 Feet","Case Number":"34640","Object Shape":"Triangle","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsI was on my way home from work, around 8:10PM EST driving on RT 85 eastbound towards my home when I saw a 3 light tipped triangle cross the road over the tree tops. I was on the phone with my mother at the time, and stated that I saw some weird lights. It was enormous, easily larger than a commercial large passenger air craft if it was within 100 feet of the tree tops. There were no visible lights other than the 3 bright white exterior lights on each of the 3 tips of the triangle. You could not see through the object, and the sky was clear. As soon as the first trangle was out of sight, not more than 2 seconds behind it, I saw a second identical triangle pass along the same path. If I was eastbound on 85 both passed me going left to right. At the time I saw the second light I was literally so blown away I was yelling into the phone. I got off the phone and by the time I got to my home, with wide open sky I could see nothing. As stated before, the triangles both were enourmous and identical, no blinking lights, no sound. As I saw the second triangle I rolled down my window. If it were commercial aircraft, it would have been so close and so low there would have to have been audible noise. It was completely silent outside save the noise of my vehicle on the road."],"Longitude":"-72.4375","Tags":"City","Object Flight Path":"Straight-line path","Log Number":"US-01052012-0025","Source":"MUFON","Date Submitted":"01/05/2012 09:12 UTC","Latitude":"41.764167","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/34640.html.txt","/var/www/straped/mufon/org/34640.html"],"Date of the Event":"01/05/2012 08:10 UTC","Sighting Duration":"Undisclosed","City":"Bolton","trends":["There has been one other sighting in Bolton","There were no other sightings in Bolton on or around January 5th 2012"]}