{"Object Features":"Unknown","Summary":"incredibly bright flashing multicolored lights, split into 2 objects, then merged","divs":["Sighting DetailsWe were outside sitting on the porch at 8:45 p.m. smoking a cigarette. It's been my habit for the last few weeks to check for a particular star as it comes into view over the treetops around that time every night. I look for it every night because it's always the brightest star in view over my house. I saw it in its usual spot, but then I noticed another, brighter star that was twinkling through the trees a little to the east of my star. As I focused on it, I realized that it wasn't twinkling ... it was flashing. My husband was out with me and I called his attention to it. I asked him if it was the space station (which I thought MY star was) but as we watched it, it flashed brighter with multicolored lights. Red, blue, green, yellow, orange. We got up and walked out into the yard, thinking to see it better through the trees. It hovered the whole time ... but would raise and lower a little bit, but randomly. It wasn't a trick of the eye, though. We noticed at the same time. Then I saw it split into two lights, twinkling different colors. The second, new one raised up from the first only slightly and hovered a few seconds, before merging back into the first. That's when I went in to get the camera. I called my friend in Carl Junction to ask if she could see it from her house. I told her which direction, she went outside and almost immediately spotted it. She described to me exactly what I was seeing ... the flashing, multicolored lights, the slight rising and falling ... it was like nothing any of us have ever seen before. She also started filming from her vantage point. I filmed ... I don't know ... 30 minutes or so over the course of an hour, and got several very clear still shots. This object followed a track across the sky -- but slower than all the rest of the stars, I think. I have no idea what this object is ... it could very well be the space station. But I would like a very thorough explanation and demonstration as to why this thing broke apart, merged, and flashed so many different colors for so long. It was like nothing I'd ever seen before."],"Country":"United States","Source":"MUFON","Date of the Event":"01/05/2012 08:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.092127,+-94.507611(34646)&iwloc=A&hl=en\"> mufon case (34646) map </A>","Date Submitted":"01/05/2012 11:46 UTC","Latitude":"37.092127","Longitude":"-94.507611","files":["/var/www/straped/mufon/html2text/34646.html.txt","/var/www/straped/mufon/org/34646.html"],"trends":["There have been 11 other sightings in Joplin","There was one other sighting in Joplin on or around January 5th 2012"],"Log Number":"US-01052012-0031","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Star-like","Region":"Missouri","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"34646","Sighting Duration":"Undisclosed","City":"Joplin"}