{"Summary":"UFO #1 Northwestern Sky very colorfull hovering, Ufo #2 moved in from the east across Evansville looked like a plane then all of a sudden it stopped, those 2 tracked north slowly over 1 hr! Ufo 3 over Henderson Ky. UFO 4 over east sie. jets everywhere!","Object Shape":"Circle, Cross, Disc, Oval, Star-like","Date of the Event":"01/05/2012 06:50 UTC","Tags":"City","Weather Factors":"Unknown","Country":"United States","Log Number":"US-01052012-0029","map":"<A HREF = \"http://maps.google.com/maps?q=37.986879,+-87.573892(34644)&iwloc=A&hl=en\"> mufon case (34644) map </A>","Object Features":"Undisclosed","Region":"Indiana","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around January 5th 2012"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Date Submitted":"01/05/2012 10:48 UTC","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34644.html.txt","/var/www/straped/mufon/org/34644.html"],"Longitude":"-87.573892","Latitude":"37.986879","divs":["Sighting DetailsMy friends and I (10) have just witnessed what we believe is the most historical UFO out break ever witnessed in Southwestern Indiana. The Event lasted over 1 Hr. There still out there as Im Typing this, TV, RADIO, LAW ENFORCEMENT are all notified! Ufo1 spotted at 6:50 you don't need pictures , there are already pics of these - very colorful, UFO 2 much to our surprise at first looked like a jet in a normal flight until it stopped on a dime looks exactly like #1 about 1 mile apart, stationary!My friend and I continued to or destination, the 2 ojects were Northwest of Evansville and were making there presents known. Just to keep it in line it 's now 7:00 pm. We continued in and ask our friends to check it out, we all agree on what we saw. Military Planes? keep streaking across the sky leaving vapor trails, at the same elevation but keeping distance. After my experience the other day, I ask my friend if he wanted to stay I was going home to be with my family, He also was good to go. We were heading south twards the Ohio River and bam there was #3 across the river look like it was over Henderson just like the other 2, and maybe 5 miles northeast #4 just like 1,2,3. Just before dropping my buddy at his home, we took a few minutes to regroup in a parking lot that is located in an ideal location to look out over the City of Evansville. One after another objects were crossing the sky, 4 orbs emmitting multi-colors hovering (7:45pm), I dropped my friend and headed home. I spoke with a Mufon member a couple days ago, I was to talk with him, last couple days been trying to get a grip after my encounter a couple days ago, Having may good friends around to witness what we did tonight, unbelieveable I never dreamed in all my days. I'm going back out side, with camera and video, let's see what I get."],"Case Number":"34644","Viewing Distance":"Unknown","City":"Evansville"}