{"Object Features":"None","Object Shape":"Triangle","Region":"Indiana","Date Submitted":"01/06/2012 01:37 UTC","Sighting Duration":"00:00:08","Date of the Event":"01/03/2012 07:20 UTC","Case Number":"34648","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34648.html.txt","/var/www/straped/mufon/org/34648.html"],"Source":"MUFON","Latitude":"38.277481","Country":"United States","Longitude":"-85.734151","map":"<A HREF = \"http://maps.google.com/maps?q=38.277481,+-85.734151(34648)&iwloc=A&hl=en\"> mufon case (34648) map </A>","trends":["There have been 2 other sightings in Jeffersonville","There were no other sightings in Jeffersonville on or around January 3rd 2012"],"Tags":"City","City":"Jeffersonville","divs":["Sighting DetailsOn the night of Jan.3rd 2012. I was watching the ISS and Tiangong space stations flyovers at 7 & 7:15pm. A few minutes later, I caught a small flash from the western sky. It was easy to see the first faint star-size light coming at me. But then I notice two more lights, one on each side of the first and further behind. 2 seconds has gone by, I now know that it's not planes off in the distance, flashed headlights from traffic, of fireworks. Now it has shape, a triangle, but longer in front. Another second goes by, and I am trying to see a form, but it's like looking thru water. The star light behind the object is being bent around it. Only a slightly dark silhouette is moving thru the sky. 4 seconds have past now, and I have a clear view at maximum azimuth. Now I need to figure out, How high is it? My first impression was Low Earth Orbit. But this thing is moving fast, 2X the speed of the space stations I saw earlier. Now I'm lowering my guess, because what I see is huge. Possibly 2 miles long and 1 mile wide. The cloak made it hard to determine attitude, could have 100 miles up, or maybe just 20 miles up. After following it down range for another 4 or 5 seconds, it appeared to be up higher, around 100 miles. I saw a video that was taken in Georgia during the summer of 2011. It was taken using night vision goggles in front of a camcorder. He captured the famed flying triangle flying in L.E.O.. In the video, you first see a jet 10 miles up, then by luck he catches the lights of the triangle at 100 miles up,and it is still bigger than the plane. That would be one huge piece of hardware, viewed from 10 times the distance.? I'd have to say that's probably what I saw too, the shape looked the same. I have been watching satellites for 3 years. Evenly with the coolest apps for smartphones, I still see unknown satellites. Also saw a 90 degree turn in Feb 2011. But this one was AWWWWWWWESSSSSSOME!"],"Object Flight Path":"Straight-line path","Summary":"Saw cloaked large triangle in L.E.O.","Log Number":"US-01062012-0002"}