{"Region":"Michigan","Country":"United States","Tags":"City","Date of the Event":"01/05/2012 08:00 UTC","Viewing Distance":"Unknown","Date Submitted":"01/06/2012 09:38 UTC","divs":["sighting detailsalmost every night looking into the west to south\\westerly direction ive been observing what at first looks to be a bright star or planet. but after looking up witch star or planet it is, there are none in its currebt location. if you watch it long enough, you will see that it changes its postion every ffew minutes, and also sometimes has smaller less bright orbs come to and from it. some of these orbs i have filmed flying right over me. the night in question, i just so happened to be going to work this night and was driving in the direction of the craft. this is what truly got me to believe it was something in our atmousphere. i shot video of it from an easterly positon and then i drove around it and shot some video and photos from the west side of it. it seemed to be station over the goguac lake area, if i was to guess. this object is out almost every night, and will change its position all through the night. by 5 am the next morning it was still out, but was in a northerly position more over the downtown area. at this time there are no planes or any conventional craft out at this time."],"Object Flight Path":"Stationary,Hovering then path,Path then hovering","files":["/var/www/straped/mufon/html2text/34654.html.txt","/var/www/straped/mufon/org/34654.html"],"Log Number":"US-01062012-0006","Disposition":"Unresolved","Source":"MUFON","Case Number":"34654","Latitude":"42.324295","Weather Factors":"Unknown","trends":["There have been 15 other sightings in Battle Creek","There were no other sightings in Battle Creek on or around January 5th 2012"],"Object Shape":"Star-like, Other","Longitude":"-85.154393","City":"Battle Creek","Summary":"A bright sem i-staionary object that looks like a bright star but isnt. It changes its position every few minutes.","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.324295,+-85.154393(34654)&iwloc=A&hl=en\"> mufon case (34654) map </A>","Sighting Duration":"01:00:00"}