{"Longitude":"-79.01726","map":"<A HREF = \"http://maps.google.com/maps?q=35.768523,+-79.01726(34662)&iwloc=A&hl=en\"> mufon case (34662) map </A>","Sighting Duration":"Undisclosed","Object Features":"Other","Log Number":"US-01062012-0012","Source":"MUFON","Tags":"City","Disposition":"Unresolved","divs":["Sighting DetailsWhile staying at a hotel in North Carolina, I went outside to take my dogs for a walk. I was observing a strange, star-like object in the sky when I saw a very large disc-shaped ship come down, apparently, from that \"star\". It had huge beaming yellow and white lights from all sides and it was descending very slowly in a straight path down until it was at my eye level. After watching this I went inside the hotel room, let my dogs in, got my camera and went back outside. I wanted a picture of it. To my dissapointment, it was gone. So I decided to take pictures of the strange star. When I looked at the pictures on my computer I was amazed that I had indeed taken a picture, unknowingly of what I believe to be that disc-shaped ship. Although, it was completely invisible to the naked eye, the camera was able to pick up on it. I went outside again and took more pictures and I was able to get 2 more photographs of it. Look in between the trees for a solid yellow, half-circle, 3 dimentional shape on the first picture. Please note that the digtal pictures attatched to this report are raw and have not been cropped or edited."],"Date Submitted":"01/06/2012 12:13 UTC","Viewing Distance":"21-100 Feet","Case Number":"34662","files":["/var/www/straped/mufon/html2text/34662.html.txt","/var/www/straped/mufon/more/34662_submitter_file1__205am005.JPG","/var/www/straped/mufon/more/34662_submitter_file2__239003.JPG","/var/www/straped/mufon/more/34662_submitter_file3__239007.JPG","/var/www/straped/mufon/org/34662.html"],"City":"Undisclosed","Region":"North Carolina","Object Shape":"Disc","Object Flight Path":"Other","Summary":"While observing a strange star-like object, I saw a disc shaped, gigantic ship with white & yellow lights beaming off the sides. The ship came straight down from way up high in the sky to my eye level. I rushed inside to get my camera","Date of the Event":"12/29/2011 02:05 UTC","Latitude":"35.768523","Weather Factors":"Unknown","Country":"United States","trends":[""]}