{"files":["/var/www/straped/mufon/html2text/34661.html.txt","/var/www/straped/mufon/org/34661.html"],"Object Shape":"Boomerang","City":"Breckenridge","Object Flight Path":"Straight-line path","Case Number":"34661","Date Submitted":"01/06/2012 11:03 UTC","divs":["Sighting DetailsOn approx. this date above my wife and I were sitting on the back deck of our house when from the southeast a boomerang shaped object came over head. We were both shocked. I would say it was as big as a 747 jet flying low enough to look about 6 inches across if you were mesuring with a ruler. Maybe that way you could get a heighth . There was no sound , flying very, very slow with what looked like heat around it. It was a clear night and the shape was as easy to see as the trees aorund the area. It flew over straight going north west. Some ask how we saw it at night. Now that is a dumb question. On a clear night you can see the outline of trees, houses, or what ever. The point is 2 weeks later we saw the same shape coming out of the south but much, much higher, glowing a golden color and traveling very fast. It again went straight over our house. But then again,2 weeks after that the same object came out of the southwest , higher again this time and traveling so fast I could just barely catch that it was the same object. I looked on line about the Kaufman County UFO that someome took a daylight photo of and it is the same shape. But then again we saw an object that flew straight over the house from the north to south about a year ago that the wings were swept back just a little. It was harder to see but was a little higher than the fisrt object we saw but was slow, no lights, and no sound. My wife and I asked ourselves why we have seen these over the house and I guess it is because we sit out and star gaze.Just to let you know though. I do not belive in little green men. I do believe that the US has been able to do alot more than they will ever say. Look at what Germany was doing during WWII. I would love to know what they are though. I think the American people can handle antything. Thanks for your time."],"Tags":"City","Country":"United States","trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around October 15th 2008"],"Region":"Texas","Date of the Event":"10/15/2008 08:00 UTC","Object Features":"Wings","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.757274,+-98.917012(34661)&iwloc=A&hl=en\"> mufon case (34661) map </A>","Longitude":"-98.917012","Sighting Duration":"00:01:00","Log Number":"US-01062012-0013","Viewing Distance":"N/A","Latitude":"32.757274","Summary":"A boomerang abject passed directly over my house, very large, 90 degree shaped wings, no sound, heat haves coming off wings","Disposition":"Unresolved"}