{"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was 23 yrs old at the time and was walking home to a friend of mine and his parents house who were kind enough to let me stay with them. I was almost midnight and I was walking west on the north side of Yucca Junior High just a few houses away from where I was going. I believe the street is Tilden. There were two people walking towards me (a little bit older couple .. walking east) approx 20 feet in front of me .. when all of a sudden a very large (larger than a full moon) slightly egg shaped object flew over at about a 75 degree angle coming from the southwest headed northeast ... glowing a very strange lumenecently white light with absolutely no sound. When I saw it .. of course I was \"Awwed\" and a dumbstruck and totally gawking at it while it passed over head. It crossed the sky in no more than 5 seconds. It was hard to tell just how big it was or how high up it was, but I'm guesstimating a couple of thousand feet maybe. I could have been as big as a football field and higher up or smaller and lower down. Dimension and height were just not decernable. I started to ask the people who were in front of me now (within 5 feet by now) if they saw that .. but they were looking at me like I was crazy and obviously I figured they never even saw it or they wouldn't have been looking at me; Instead they'd been looking up at it, so I didn't bother saying anything to them. I just continued walking totally amazed at what had just happened to me. I'm 57 yrs old now and although some other things have happened to me in my life (I will not go into) this has been the only prominent sighting I have had. I live in Amarillo TX and am always going back and forth to Roswell on a regular basis (weekly, monthly) so I always keep my eye to the sky. Over the years I have spoken with many 'ol timers and have heard many strange stories. I even met a man who was in the Airforce(stationed at Roswell)at the time of the '47 crash and he told me \"It happened and he knew the nurse personally who saw the greys\" .... So that's my story after 34 years I decided to share it with you. What it comes down to is everyone is a skeptic untill you see one close up for the first time and then you KNOW something IS GOING ON ! SEEING IS BELIEVING ! ...... thankyou .. B A"],"Sighting Duration":"Undisclosed","Log Number":"US-01062012-0016","Summary":"Figured it's time to tell what I saw in Roswell .. approx summer of 1976","City":"Roswell","Object Flight Path":"Straight-line path","Date of the Event":"08/01/1976 12:00 UTC","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/34666.html.txt","/var/www/straped/mufon/org/34666.html"],"Source":"MUFON","Object Shape":"Egg","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around August 1st 1976"],"Object Features":"None","Date Submitted":"01/06/2012 02:24 UTC","Country":"United States","Case Number":"34666","Weather Factors":"Unknown","Longitude":"-104.516374","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.400586,+-104.516374(34666)&iwloc=A&hl=en\"> mufon case (34666) map </A>","Disposition":"Unresolved","Latitude":"33.400586"}