{"Date Submitted":"01/06/2012 05:22 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.599178,+-117.580879(34672)&iwloc=A&hl=en\"> mufon case (34672) map </A>","Longitude":"-117.580879","Country":"United States","City":"Coto De Caza","Date of the Event":"01/05/2012 07:30 UTC","divs":["sighting detailsfinished watching a tv program, i had an impulse to go outside and look towards the east into a clear night sky while looking at the stars. this was highly unusual since i had not done so for quite a long time. i noticed one particular light that did not appear as a star in a usual way. looking at it, it was pulsating multiple colors, orb-like and somewhat bigger than the surrounding stars. it did not move as i was looking at it. it was also lower in the sky that the other stars in that view of the sky. i then went inside for binoculars, 7x35mm, to get a better look and asked my girlfriend to come outside for her impression and view of it, as well. she saw it, looked through the binoculars, and observed the same as i did. the circular edges were fuzzy and it was an indistinct, orb shape but the colors kept changing in an unnatural way. these colors were brighter and deeper in color\\range than a more natural, star-like manner. my reaction was that it was interesting, definitely a ufo to me and to her, but i was not able to spend more than about 10 minutes looking at it. we went back inside. about 30 minutes later, i went outside again to see if the object still appeared or had moved. not to my surprise, the object was nowhere in the sky and had disappeared."],"Log Number":"US-01062012-0022","Summary":"Object, orb-like and stationary glowing multiple colors unlike a star and somewhat bigger.","Object Flight Path":"Stationary","Case Number":"34672","Disposition":"Unresolved","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Coto De Caza","There were no other sightings in Coto De Caza on or around January 5th 2012"],"Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Latitude":"33.599178","Region":"California","Object Shape":"Sphere, Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/34672.html.txt","/var/www/straped/mufon/org/34672.html"]}