{"map":"<A HREF = \"http://maps.google.com/maps?q=18.022548,+-63.070235(34673)&iwloc=A&hl=en\"> mufon case (34673) map </A>","Object Flight Path":"Path with directional change","Region":"Sint Maarten","divs":["Sighting DetailsOne night on a small Caribbean Island (18.05 N, 63.12 W)there was one (of the regular) blackouts. I was with a lady-friend at her house(she is from Argentina). Both of us divorced and with minor aged children, visited each other regularly. 10 mins before the event we (only) went outside as it was very hot that evening in the house. Exactly at the time mentioned, both of us lying on the hood of my car, I observed a dark dull disc-shaped object appear directly overhead flying East to West. I stared at it for a few seconds and it flew slowly westward, I spoke out to her and lifted my arm to point to it but she had already seen it too and exclaimed, in Spanish: \"look at that....space vehicles\". I was overjoyed because I have had more observations but this one was finally with a witness. The object was clearly disc-like, no lighting but it could have had an inner glow in the center which was deep bronze like. The rest of the vehicle was very dark, it was a moonless night and as it went it blotted out the visible stars. As soon as she spoke the following event occured; another object appeared and it was the same size in my eyes and it must have been flying directly below or above the other one because it appeared to have been slingshot like on an elastic band and it oscillated back and forth a few times (while in the same forward motion) to and from the other unit and then like it locked into position - for us to the left of the other one and together they flew side by side without wavering westward into the sky towards the horizon where they disappeared into the haze in the distance. Our bodies on the hood of the car were aligned with our heads due East and our feet towards the West. The roof of the house was East as well as a range of Hills, we did not notice the event untill the objects were directly overhead. No sound or noise accompanied this event. My lady-friend is a level-headed English school-teacher who never before believed in these type of events. I have been an observer to several more events like this one in past times..therefore I do not get excited anymore. I sometimes do try to attract attention by waving at them. The flightpath of these objects observed would have brought them near the island of Puerto Rico (Vieques), they must also have flown directly over the Airport of this small Island (Juliana Airport)."],"Sighting Duration":"00:00:22","Longitude":"-63.070235","Date Submitted":"01/06/2012 05:24 UTC","Disposition":"Unresolved","Country":"Sint Maarten","Date of the Event":"11/11/1993 11:11 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"AN-01062012-0023","trends":["There have been no other sightings in Philipsburg","This sighting has never been favorited."],"City":"Philipsburg","Case Number":"34673","Object Shape":"Disc","Tags":"City","Summary":"Dark burnished bronze colored discs","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/34673.html.txt","/var/www/straped/mufon/org/34673.html"],"Latitude":"18.022548"}