{"divs":["Sighting DetailsI saw an object, around or the night before Christmas eve 2011, over the south SF bayarea near Fremont's Automall.My home is near the 880 freeway and Automall. The craft was difficult to see and at first I thought maybe it was an owl but it did not move anything like wings and if it was gliding it did not seem to lose altitude. It moved in a straight line. It seemed to disappear at times and I saw a faint outline of the leading edge, either crescent shaped or triangular. I finally decided it was translucent, not being sure if it was obscuring the stars. It was headed almost due south. I am a pilot so I am somewhat familiar with bearing and altitude estimation. I suspected this object at about a thousand feet, but then perhaps it was higher. Size was difficult to gauge. At night it is recommended to look at an object at a slight off center angle and the more I tried to look straight at it, the more difficult it was to see, It finally disappeared. The constellation Orion was south east of the object and it was about 11pm. I make no estimate of speed, but I think it was in view from the time I noticed it almost directly overhead until I lost sight of it maybe 45 seconds to a minute. There were no lights, only the faint outline."],"Object Features":"Other","Log Number":"US-01072012-0002","Weather Factors":"Unknown","Case Number":"34683","Date of the Event":"12/23/2011 12:00 UTC","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around December 23rd 2011"],"Region":"California","files":["/var/www/straped/mufon/html2text/34683.html.txt","/var/www/straped/mufon/org/34683.html"],"Latitude":"37.511666","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.511666,+-121.967452(34683)&iwloc=A&hl=en\"> mufon case (34683) map </A>","Longitude":"-121.967452","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Translucent crescent/ chevron-triangle object","Date Submitted":"01/07/2012 02:31 UTC","Viewing Distance":"501 Feet - 1 Mile, Unknown","City":"Fremont","Country":"United States","Object Shape":"Chevron, Other","Tags":"City","Object Flight Path":"Straight-line path"}