{"Longitude":"-79.911995","City":"Homestead","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Weather Factors":"Unknown","divs":["Sighting DetailsI was walking up the hill to my apt. when I noticed a huge light in the sky. I looked ay it almost the whole time I was walking. This was about 6:15 pm, when I reached my alley I saw my neighbors standing by our bldg. I stopped to talk to him in which I hadn't said anything about what I saw just yet. We talked for about five minutes and the light moved to a very visible position as the line of sight was blocked by another building in the alley. I then said,\"the northstar is the brightest star in the sky, isn't it\" he said yeah, then I told him to look up and I said , what the heck is that? We stood there trying to understand what it was then about two minutes later I saw out of the corner of my eye another object just as bright as the northstar moving at a stead pace then I said look do you see that as I pointed to it. He looked and was like whoa! What's going on. We watched it slowly ascend, getting dimmer and dimmer til it disappeared. Then about 5 minutes later he saw behind us the same type of object flying apparently the same speed doing the same as the second object. We were out there for a half an hour then I went and got my other neighbor and she was amazed. We then seen a few jets circling for about an hour going in the direction of the very bright object. We were excited at all of this as we believe in this subject matter. We know about the reptilians and the anunnaki. Finally, another one of my friends called me on the other side of the neighborhood called me and I told him to go out the house and look towards west homestead and before I could say another word he said oh shut I definitely see it, its turning colors. The air force came to see what it was and I know if they come its definitely something unknown. I have five siblings who were in the air force three who were in for twenty or more years. They told me of things they saw growing up and while in the airforce. My mother witnessed one in Pittsburgh that was witnessed by the whole neighborhood and it was close to the houses. I know about this stuff and it was an exciting two hours. I've seen many and I even had a visit from the ashtar command when I was a child, I remember like it was today! Please get back with me as I have some video footage on my phone about it. They aren't hiding anymore."],"Date of the Event":"01/06/2012 06:15 UTC","Object Features":"Unknown","Date Submitted":"01/07/2012 05:39 UTC","Viewing Distance":"Over One Mile","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.405902,+-79.911995(34685)&iwloc=A&hl=en\"> mufon case (34685) map </A>","trends":["There have been no other sightings in Homestead","This sighting has never been favorited."],"Latitude":"40.405902","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"super bright light , brighter than north star with 2 more flying opp. direction","Tags":"City","files":["/var/www/straped/mufon/html2text/34685.html.txt","/var/www/straped/mufon/org/34685.html"],"Case Number":"34685","Disposition":"Unresolved","Log Number":"US-01072012-0004","Object Shape":"Circle, Fireball, Sphere"}