{"map":"<A HREF = \"http://maps.google.com/maps?q=40.393076,+-91.126202(34689)&iwloc=A&hl=en\"> mufon case (34689) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"01/06/2012 10:44 UTC","trends":["There has been one other sighting in Hancock","There were no other sightings in Hancock on or around January 6th 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Case Number":"34689","Source":"MUFON","Object Flight Path":"Unknown","Region":"Missouri","divs":["Sighting DetailsI was on my way home from work driving west and about to turn North onto my road when I looked over to the small air strip to my left and notice that about a hundred feet behind it and approximently a hundred feet up was a bright circular object hovering. The object was huge bigger than a basket ball and it was blinking like a strobe light. I then turned onto the dirt road so I could get a better look at it. It looked to be blinking like a flash from a camera. It would flash right to left. It was brighter than the sun or any star I have seen. It made my head and eyes hurt just looking at it. The object didn't seem to be moveing, just hovering above the trees. Like it was watching. I know that I look over at the airstrip on a regular basises because in the distance you can see the city lights at night. But there has never been any lights other than the small light attached to the small hanger for the airstrip and the city light over ten miles away. There is nothing but country and farms between the two. So, it was a shock to see such a bright orb or object there. There was no planes in the area that I am aware of, nor do we have any light houses in the area to make a light that bright. There was no sound, no red or blue lights to signal a plan or helicoper. Just a huge light blinking light a stobe light. After about 5 minutes I just started to drive down the road to go home. My eyes still hurt from last nights experience. I told my stepdad and husband of what I saw. I wish they would have been with me."],"Date Submitted":"01/07/2012 12:13 UTC","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Longitude":"-91.126202","Country":"United States","Summary":"Large white light blinking like a strobe light. Bright as the sun hurt to look at.","Object Shape":"Circle, Flash, Star-like","files":["/var/www/straped/mufon/html2text/34689.html.txt","/var/www/straped/mufon/more/34689_submitter_file1__cms3514.png","/var/www/straped/mufon/org/34689.html"],"Tags":"City","Log Number":"US-01072012-0007","Latitude":"40.393076","City":"Hancock"}