{"Object Features":"Unknown","Log Number":"US-01072012-0001","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"01/07/2012 01:59 UTC","files":["/var/www/straped/mufon/html2text/34682.html.txt","/var/www/straped/mufon/org/34682.html"],"divs":["sighting detailsat 2:45 pm on 1\\5\\2012, i was driving east on michigan avenue in lansing, mi when i looked up out my front windshield and saw a reflective object in the sky. i continued to watch the object as it was heading nw coming from a se direction. i turned north onto waverly road and continued to watch the object realizing that it had no lights, wings, tail, no chem trail or sound and did not waiver from its path. it appeared to be a cigar shaped, white, reflective object. during my 30 minute lunch hour from work, i was able to visibly observe over 5 commercial jet liners that were clearly at 30,000 ft or higher and flying from w to e or e to w. there were chem trails everywhere yesterdaythe object that i observed did not have any chem trail. lansing has an airport north off of waverly road and the object did not seem the least bit interested in the airport. in fact, i watched the object continue on its slow and steady path nw until it was a white speck--perhaps heading in the northern illinois direction. i was disappointed that it went out of view so quickly, but i am also with the feeling that it will not be the last time we will see them. it almost seemed to be on a mission heading somewhere directly."],"Date of the Event":"01/05/2012 02:45 UTC","Country":"United States","Tags":"City","Region":"Michigan","Longitude":"-84.548685","Object Flight Path":"Straight-line path","Disposition":"Unresolved","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around January 5th 2012"],"Latitude":"42.740615","Case Number":"34682","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.740615,+-84.548685(34682)&iwloc=A&hl=en\"> mufon case (34682) map </A>","Object Shape":"Cigar","Viewing Distance":"Unknown","Summary":"Cigar shaped craft--no noticeable lights, tail, wings or chem trail","City":"Lansing"}