{"map":"<A HREF = \"http://maps.google.com/maps?q=41.882246,+-87.81182(34690)&iwloc=A&hl=en\"> mufon case (34690) map </A>","Log Number":"US-01072012-0008","Source":"MUFON","divs":["Sighting DetailsI saw a glowing white orb at 11:25 (26?) AM going over Forest Park, IL. From the bottom of the orb was either a beam of light or a gas emission moving like a pendulum from left to right. I thought maybe this was an lost kite (reflecting the sun) with a tail, but it never changed its glow and the beam coming from the bottom would have been the thickest kite tail I've ever seen. It was came from the west and went almost directly east (slightly southeast) in a striaght path. It did not dip or change altitude. Frankly, I think it was moving slightly against the wind. No sound. The orb was higher than a jet leaving O'Hare. I am familiar with jets and helicopters, and live along the flight path of air traffic. It does cross my mind that this could have been a reflective balloon or kite, but those don't move in a deliberate path and do change altitude. Also the glow or reflection never flickered, like a reflection does. Kite tails and balloon strings don't move like a pendulum usually, do they? I suppose if they're weighted it's possible. But this orb was so high up, and the lightbeam or gas emission from the bottom was thick and visible, not thin or narrow and twisty like string or a tail. It was a stiff, pendulum-like motion. Here is the weirdest coincidence: Two minutes before the sighting I had a strong urge to go outside. Prior to that something popped into my mind telling me I was going to see a UFO today. I went outside to smoke, and was thinking about sharing this feeling with my S.O., but I was like, \"Naah. What if I am wrong? Don't be weird.\" At that moment a jet was going west to east and a moment later I saw the orb. Just like that! I honestly can't explain why I felt like this sighting was going to happen right before it happened, and I feel like - this is crazy - that the UFO was letting me know it was there. I had the entire feeling while watching the object, and the whole thing lasted about a minute or less. It was out of sight more quickly than a departing jet. I was really paying attention to it moving by, and towards the end of the sighting I wanted to grab my binoculars inside and I went for them. I swear to you, it communicated to me that it would be out of sight by the time I returned. And it was. I looked for a good long time but it was gone."],"City":"Forest Park","Region":"Illinois","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/34690.html.txt","/var/www/straped/mufon/org/34690.html"],"Date of the Event":"01/07/2012 11:25 UTC","Case Number":"34690","Sighting Duration":"Undisclosed","Longitude":"-87.81182","Date Submitted":"01/07/2012 01:41 UTC","trends":["There have been 15 other sightings in Forest Park","There was one other sighting in Forest Park on or around January 7th 2012"],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Object Shape":"Sphere","Country":"United States","Summary":"White Orb Emitting Lightbeam or Gas From Bottom","Object Features":"Appendage(s)","Latitude":"41.882246","Tags":"City"}