{"divs":["Sighting DetailsReport of UFO Sighting -- January 5, 2012 Note: This account was created the day after (Jan. 6, 2012) the night of the sighting. Where: Bedford, Indiana. Time: Approximately 7 PM. Witness: Reporter, alone, 66 yr old male; retired secondary school teacher Testimony: I had returned home after having dinner with friends at a local restaurant. Despite it being January, the night was not particularly cold, and the sky was spectacularly clear. After parking the car, I stood in my driveway looking at the stars. It occurred to me that if there was any night that one might have the chance to see a UFO, this was that kind of night, and I actually thought, I wish I could see one now. Not two minutes passed after that thought when I clearly saw a row of star-colored and star-sized lights passing almost directly overhead, traveling due west. The right hand half of the row was dimmer, and some of the individual lights were not visible, but those on the left hand were all distinctly visible. Though I did not have the presence of mind to count them, I know the left half was surely showing more than 4 lights, and probably six, but the right half showed only two; only the one furthest from the midpoint was particularly distinct. As I kept my attention focused on the row of moving lights, I tried to detect any sound the phenomenon might be making, but there was nothing out of the ordinary; it seemed to be completely silent. At the same time, I saw that the row of lights was not a straight line but that they were arranged in a wide L or flying wing configuration. The phenomenon moved steadily at an unchanging high rate of speed and altitude to the west, and as the distance between us increased, suddenly the full complement of lights became visible, an equal number on the left and right. At no time did any of the visible lights change position in relation to one another, nor did they blink or strobe or change colors. The phenomenon was in my field of vision for approximately three seconds and was then instantly not visible, possibly because it passed below the tree line or below the roof line of my car shelter. After a few minutes, I went into the house feeling elated and after a few more minutes decided to call one of the people I had been having dinner with and tell him about the sighting. This I did, but since I have brought up the subject of UFOs and my belief in their existence before, I am not sure how seriously any of my friends take my report of this event. Note: Bedford, Indiana is apparently almost directly beneath major east-west and north-south commercial flyways. The reporter has had very frequent opportunity to see both high altitude and medium altitude airline overflights, and also nighttime overflights of small to medium-sized commercial aircraft making descent approaches almost directly over his home on the way to Louisville, Kentucky. This event was nothing like those overflights in either sounds (or lack of sound) and sights. Additionally, all the low-altitude flyovers come in from the west and make a banking right turn over Bedford to approach Louisville. They do not approach from the east and then simply pass over Bedford at low to medium altitude. Impressions: Although the lights were clearly in a flying wing arrangement, the actual craft in front of them was almost invisible. I actually got the impression that a piece of the night sky was moving across my field of vision. If I had not had the row of lights to focus on, I doubt I would have even noticed its passage. Because of the phenomenons silence and speed, I simply could not get a good impression of its altitude and physical size, though it seemed to me that it was quite large; certainly as a wingspan, it would be remarkable, and the greater the altitude, the more remarkable the size. The next day, I took a ruler to the spot where I was standing, and holding it out at arms length, estimated the object measured 3 to 4 across at arms length. Several high-flying commercial aircraft were overhead at the same time as this sighting, but in comparison, they were mere points of strobing lights, and they were visible for minutes rather than seconds. The gradual revelation of the individual right hand lights, and the nearly instant disappearance of the entire row as the phenomenon sped westward suggests to me that one must be very fortunately at the exact proper angle of observation in order to detect this type of UFO at all. Comments: Although I have been interested in UFO reports for many years, I do not spend much time actually watching the skies to spot them in transit. Usually, I only do so a few minutes at a time, such as this one when I was simply pausing on the way from the car shelter to the back door of my house. Therefore, considering the very narrow window of opportunity here, either this was an extremely unlikely coincidence (Im watching just as it is passing by), or these things are really quite commonly in the skies above us though we simply dont notice them. My overall interpretation of this experience is that although it was an extraordinary encounter with a remarkable piece of technology that has highly secret military capabilities, this is very likely a man-made craft. I am still waiting for the unequivocable alien encounter."],"Latitude":"38.871718","trends":["There have been no other sightings in Bedford","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","City":"Bedford","Tags":"City","Region":"Indiana","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Boomerang","Disposition":"Unresolved","Summary":"Fixed relationship lights in a flying wing configuration.","Object Features":"Undisclosed","Source":"MUFON","Date of the Event":"01/05/2012 12:00 UTC","Date Submitted":"01/07/2012 02:32 UTC","Log Number":"US-01072012-0011","map":"<A HREF = \"http://maps.google.com/maps?q=38.871718,+-86.50681(34693)&iwloc=A&hl=en\"> mufon case (34693) map </A>","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/34693.html.txt","/var/www/straped/mufon/org/34693.html"],"Case Number":"34693","Longitude":"-86.50681"}