{"Latitude":"35.233787","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around January 7th 2012"],"Region":"North Carolina","Date of the Event":"01/07/2012 07:00 UTC","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.233787,+-80.841457(34697)&iwloc=A&hl=en\"> mufon case (34697) map </A>","City":"Charlotte","Longitude":"-80.841457","Object Shape":"Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34697.html.txt","/var/www/straped/mufon/org/34697.html"],"divs":["Sighting DetailsI went outside to put a steak on the grille at my south Charlotte home tonight at 7:00 this evening and saw the lights that were as described above. I always look up when I go outside because I like to see the moon, stars, etc., and am also a pilot and interested in aircraft. I called my wife out to see them. There were two sets of 4 lights, each set with the 4 lights moving in a box formation with 3 or 4 other single lights that followed the first 8 lights. The altitude was simialr to a low-flying airplane the speed was constant. The group was travelling roughly south to north and the turned toward the east. They were orange in color and looked like small hot air balloons when the gas is fired at night, except the light was constant (unlike a hot air balloon) but had a flickering quality, like something was burning inside a translucent shell. My first thought was balloons, but they would have been too small for the distance and moved as if powered (not like drifting with the wind), but there was no sound coming from them. My next thought was powered hang gliders or ultralights, but there was no sound. We live about 15 miles as the crow flies from Charlotte-Douglass airport. There was a passenger jet airliner in the area as is typical, but it was to my back as I stood viewing the lights and high enough to not drown out other noises in the area. If the objects made any sound it had to be low volume."],"Object Flight Path":"Path with directional change","Country":"United States","Case Number":"34697","Weather Factors":"Unknown","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"01/07/2012 10:14 UTC","Log Number":"US-01072012-0015","Summary":"10-12 Glowing objects travelling S to N, then E, low altitude, silent in Charlotte, NC","Sighting Duration":"Undisclosed"}