{"Country":"United Kingdom","Viewing Distance":"21-100 Feet","trends":["There have been 3 other sightings in King's Lynn","There was one other sighting in King's Lynn on or around December 18th 1992"],"map":"<A HREF = \"http://maps.google.com/maps?q=52.75798,+0.406654(34707)&iwloc=A&hl=en\"> mufon case (34707) map </A>","Log Number":"GB-01082012-0009","Tags":"City","Source":"MUFON","Date of the Event":"12/18/1992 11:45 UTC","divs":["sighting detailsi was driving a vehicle delivering the last pizza for the night. 2345pm! observed on housing estate some quarter-mile in sky, a very large looking star. blush-silver four points. slowed vehicle to stop and switched off engine, ( a automatic-procedure for one whom ran a ufo-group and had seen three other ufos.) watched star-form for about two-minutes, then it the star suddenly went-out vanished! wound down drivers window on van to see any further phenomena? i was quickly rewarded\\ observed in the very clear crisp night sky a oval-craft some forty feet in length and ten=ft from base to dome-aperture at top. i watched from the van as it moved less than 5mph, clearly observed the following happen, some eighty-ft in the air. bright clear night a few celestial stars. the craft was a rusty red colour the hull reminding one of metal just removed from a furnace and \"cooling-down\"! there was no audible sound whatsoever, and as i watched for a further minute i then saw an array of orange-lights, \"or to be more precise\" exhaust-ports! switch on, they revolved slowly around the base in a clockwise-fashion observing from underneath. then by way of some unknown emission from these ports a portal began to emerge. i clearly saw spacetime becoming a mirrored-flux, a shaking of space and thence the very slow moving craft entered into this created flux and dissapeared. so i have come to the conclusion that\\ the large-star shape i first observed some ten-minutes earlier was in fact an opening time portal or gate into our world. created by this craft which i then saw some minutes later and thence watched it create another time-portal in front of mine eyes! i have had two previous encounters with ufo craft less than twenty-ft away, and other out of world experiences. i am now arranging to see a regressionist to be put under and the result videoed\\audioed and thence posted to u-tube!"],"City":"King's Lynn","Latitude":"52.75798","files":["/var/www/straped/mufon/html2text/34707.html.txt","/var/www/straped/mufon/org/34707.html"],"Object Features":"Dome, Other","Date Submitted":"01/08/2012 09:32 UTC","Region":"England","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"encounter with oval-craft witch crated time-portal/gate in front of my eyes less than eighty-ft away in airspace.","Case Number":"34707","Object Flight Path":"Straight-line path","Longitude":"0.406654","Object Shape":"Oval, Star-like","Disposition":"Unresolved"}