{"Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34706.html.txt","/var/www/straped/mufon/org/34706.html"],"Longitude":"-76.888446","Date of the Event":"01/06/2012 08:25 UTC","Region":"Pennsylvania","Case Number":"34706","Weather Factors":"Unknown","City":"Harrisburg","Disposition":"Unresolved","Log Number":"US-01082012-0008","divs":["Sighting Details We live Midtown Harrisburg,PA My friend and I decided to go for a walk . Right after leaving I looked to the West for just a second and I saw a bright light that blinked at me. Then I told him Look at that light he replied :that is an airplane,. When I first saw it I thought it was a flying saucer. I told him lets just wait a few minutes and see. We waited for 5 minutes and the light was still there very slowly moving West. He went to get his coffee and I stayed in the spot and observing the light. 15 minutes later he returned and the light was still there. We even went Downtown walking and on the way there we continued to see the light (25 minutes walk) . By now farther West. This thing was (extremely bright) and it was (extremely far away). I estimate at least 9 miles away. At least 5000 feet above ground. Because it was very bright it appeared to be closer and consequently lower. The duration of the sighting was of at least 45 minutes. I did not have any out of the ordinary feelings what so ever. We lost sight of it when we where Downtown. By the time we started to walk back, it was gone. But this things was around for a long ,long guys I would say 45 minutes. It was oval,the color of the light:pure white, changing to light orange, light copper and light red for short periods of time. Blinking once in a while. I could also see commercial airplanes far away in the distance near it . But their light was very yellow and much much duller, and smaller than the light from this object.In fact I saw one airplane very close to us,, I think it was approaching Harrisburg.. and the light was still duller and yellower compared. now you may have an idea of what I mean when I say (bright) and huge. Because to be that far and that high.. this thing must of being HUGE."],"trends":["There have been 26 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around January 6th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.268664,+-76.888446(34706)&iwloc=A&hl=en\"> mufon case (34706) map </A>","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Oval","Tags":"City","Sighting Duration":"Undisclosed","Summary":"It appear to be at least 7 miles and very very high. I would say an altitude of at least 3000 feet. But it looked closer bacause it was extremely bright and big.","Object Features":"Undisclosed","Date Submitted":"01/08/2012 07:48 UTC","Latitude":"40.268664"}