{"Object Shape":"Square, Rectagular","Sighting Duration":"00:00:25","Country":"United States","Object Flight Path":"Straight-line path,Other","Object Features":"Window(s), Patterned Surface, Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.762499,+-111.883847(34709)&iwloc=A&hl=en\"> mufon case (34709) map </A>","Disposition":"Unresolved","Log Number":"US-01082012-0011","Date Submitted":"01/08/2012 10:50 UTC","trends":["There have been 73 other sightings in Salt Lake City","There was one other sighting in Salt Lake City on or around January 6th 2012"],"Source":"MUFON","divs":["Sighting DetailsI was smoking a cigarette at a buddys home in the Sugar House district of Salt Lake City, when all of a sudden lots of noise could be heard from the sky, characteristic of the sounds associated with aircraft, except much closer. I looked up in the sky and saw an object in the night sky so large and different looking from anything Ive seen, I wonder how it got off the ground to begin with. It travelled as if hovering, while moving in a steady quick-paced fashion. The event was probably over and done with in 30 seconds or so, but it was enough time for me to make out multiple and distinguishable colored rectanglular lights on the bottom of this object. At the same time I believe more traditional aircraft (helicopters) were close by, but my eyes were all on the single biggest craft. I felt fearful looking up and for the first time in my life not having an idea what was flying above me. I rushed back in to tell my friends after the craft passed beyond the roofline and my visibility, and got some strange looks. I worried a little bit about how I might handle the situation of being abducted for a while. On my way back home, I heard what sounded like a foghorn, which struck me as unusual here. I dont know whether what I saw was extra-terrestrial or top secret, but whatever it was, people dont know about it."],"Date of the Event":"01/06/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/34709.html.txt","/var/www/straped/mufon/org/34709.html"],"Longitude":"-111.883847","City":"Salt Lake City","Case Number":"34709","Summary":"Very large solid object that I didnt know what was flying above me.","Region":"Utah","Latitude":"40.762499"}