{"Tags":"City","Disposition":"Unresolved","Latitude":"41.129518","Source":"MUFON","City":"Grove City","trends":["There have been 5 other sightings in Grove City","There were no other sightings in Grove City on or around January 7th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Undisclosed","Date of the Event":"01/07/2011 10:04 UTC","Sighting Duration":"Undisclosed","Log Number":"US-01082012-0012","Date Submitted":"01/08/2012 01:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.129518,+-80.094672(34710)&iwloc=A&hl=en\"> mufon case (34710) map </A>","Longitude":"-80.094672","files":["/var/www/straped/mufon/html2text/34710.html.txt","/var/www/straped/mufon/more/34710_submitter_file1__DSC_0256.jpg","/var/www/straped/mufon/more/34710_submitter_file2__DSC_0257.jpg","/var/www/straped/mufon/more/34710_submitter_file3__DSC_0259.jpg","/var/www/straped/mufon/org/34710.html"],"Summary":"there were 30 or more traveling southward perpendicular to the road I live on. approximation 1 mile away traveling just above the trees in a snake like motion up and down glowing orange","Object Shape":"Fireball, Oval","Country":"United States","Region":"Pennsylvania","Viewing Distance":"Over One Mile","Case Number":"34710","divs":["Sighting DetailsFor some reason the thought of UFOs jumped into my head on my way home from the grocery store Jan 7th 2012 at about 9:45pm. As I turned left onto my road in the distance I saw them. this orange orb broke into three similar size orange orbs. the primary one did not move and the other two shot away from the primary object and about 45 degree angles. the orbs then leveled off and travel south one behind the other paralleled to the ground. so I sped up my car almost wrecking it as I pulled into my driveway, I went as fast as I possibly could and ran inside to tell my wife so she could also see. as I explained what thoughts I had and what I saw she said the thought of UFOs had entered her too she didn't know why. At the same moment of her strange thoughts she said she heard a scratching nose at the window and had just let the dog right minutes before I got home to see what it was. the orange orbs unfortunately had gone before she could see them. As I explained to her what I saw more began to appear and there were 30 or more traveling southward perpendicular to the road I live on. approximation 1 mile away traveling just above the tree line in a snake like motion up and down glowing orange. this lasted about 15 min. I took photos with my Nikon D300. For the conditions I had to shoot the photos with I think they came good enough to portray the event. a passing motorist also saw the event."],"Weather Factors":"Unknown"}