{"Region":"Florida","Tags":"City","files":["/var/www/straped/mufon/html2text/34718.html.txt","/var/www/straped/mufon/more/34718_submitter_file1__006.JPG","/var/www/straped/mufon/more/34718_submitter_file2__007.JPG","/var/www/straped/mufon/more/34718_submitter_file3__008.JPG","/var/www/straped/mufon/org/34718.html"],"Longitude":"-80.401499","divs":["Sighting DetailsOn January 7, the at about 7:25 PM, I was exiting my home with my children, waiting on my wife to finish getting ready for a birthday dinner party of my niece's. The wife took a lot longer than expected, and the moon was full and rising over the neighborhood roof tops toward the East to slightly NE at this time of year. I decided to take a still photo of it with my I-phone 3G, with my younger 8 year old Daughter and my 5 year old Son near by. Soon as the camera function booted up and view finder engaged, I pointed it at the Moon, but imediatly noticed a bright blue glowing small orb below and toward the left about a 7:00 O clock position below the Moon. It was about 15-20 degrees out from the the Moon disc. It was only visible through the electronic view finder of the I-Phone, but not to the naked eye. It was stationary in relation to the Moon. I moved the camera around to see if it could be a lens refraction from the neighborhood lights, but it stayed put in relation to the moon. I looked around to see if anybody had blue lights around, like Christmas lights, but non observed. I kept looking at the part of the sky where it appeared in the view finder, but no orb, no bright stars, or planets were any where nearby. I then being aware that electronic cameras, can see wave lengths of light not seen by the naked eye, I proceeded to photo graph it. Upon engaging the zoom function on the still camera function, to draw the orb close in the view finder for a closer photo, I saw what appeared to be electrical, charge, or static like texture to the orb, like static on a off channel on older analog TVs, and rapid dancing Gold, silver, yellow and pinkish or rose electrical sparking or arcing around the edges of the orb disc. like those Tesla balls you would purchase at Sharper Image novelty electronic stores with the Frankenstein style electrical plasma charges dancing all around a glass globe. I then proceeded to take stills and engage my video function as well, but the video function lacks the zoom capability of the still function. Now the one neighbor, I have near by, the father of a girl my daughter plays with, and my children and Wife also came over to look at it through the view finder. I attempted to use my Wife's I-Phone to also view it, but her's, also the same make model and style, bought at the same time and place as mine didn't show the object. Even both held side by side pointing at the spot of the orb. We had to go to our party on Miami Beach. so a stopped photos and film. As we were on our way to 79th St Causeway on Miami Bch. I hit a red light at 826 and Bird Rd. I rolled the window down engaged the camera, and used it to relocate the object still in it's position. Guess the time was about 8:00 or 8:20 PM. We arrived at the Trio's on the Bay at 1601 79th St. Causeway, North Bay Village, Miami, Fl. 33141. at 8:50-9:00 PM. I stepped out of the car and turned on the camera again, sure enough it was still in it's original position. Seemed not as bright from this location. Now I thought if I just traveled 35-40 miles and it is still in its relative original position, this thing has to be very high or outside of the planet's atmosphere. I continued to take photos, using references and other sources, like passing aircraft, buildings, palm trees, etc. for references, and film clips of the object both in front of and on the dockside deck of the restaraunt till my battery got low about 10-10:30 PM. Had to shut my phone down to save. I also attempted to use other family member's I-phones and other camera type phones to view the object. Only one other I_phone in the group of 4 camera phones seemed to see the object. Older Black Berry and flip phones did not see it when engaged for camera mode. Periodically through out the night till we left at 11:45-11:50 PM, I engaged the phone briefly to observe the object. It was there till till we were leaving, then upon one last view attempt with almost dead battery, I noticed it was gone!!!!! By now the moon was directly overhead to slightly toward the west. Mary Margaret Zimmer of MUFON has my complete collection of still shots and 4 video clips of the object downloaded in her computer today January, Sunday 8th at 1:45 PM, she will be following up with the video evidence!!!!"],"Date Submitted":"01/08/2012 06:14 UTC","Date of the Event":"01/07/2012 07:20 UTC","Log Number":"US-01082012-0018","Object Flight Path":"Stationary","Disposition":"Unresolved","City":"Miami","Source":"MUFON","Viewing Distance":"Unknown","Country":"United States","Summary":"Blue glowing orb not visible to the naked eye, but through the view finder of smart phones.","Sighting Duration":"Undisclosed","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around January 7th 2012","This sighting has never been favorited.",""],"Object Shape":"Sphere","Latitude":"25.701036","map":"<A HREF = \"http://maps.google.com/maps?q=25.701036,+-80.401499(34718)&iwloc=A&hl=en\"> mufon case (34718) map </A>","Object Features":"None","Case Number":"34718","Weather Factors":"Unknown"}