{"divs":["sighting detailsi was taking the dog out last night when i saw a very bright ball of orange\\yellow light which appeared just above the crest of a hill south of the house. it was about 11:00 to 11:30 on a moonlit night with some wispy clouds in the sky. as the lights came closer i could see that they were on an aircraft and i thought it might be on fire and might crash. i then realized it was on a straight course towards the house and didn't appear to be in distress. as the object and the lights came closer i could see that they were attached to an aircraft of some kind and as it came above the valley just south of the house i could hear a droning sound like that of a plane far off in the distance. but it was nothing if compared to the deafening noise a commercial aircraft of such size and so close by would make. i saw the object from below as it passed over the house in a northwesterly direction. it appeared to be a very large black matte or dark grey flat object with a shape between a square and a diamond. it was much bigger than the house. i couldn't see any distinguishing marks on the lower part, but the lights were very bright--the brightest i've ever seen and the colors were very vivid. they seemed to be both orange and yellow at the same time, but in no discernible pattern. there was a light on each point of the object, but there may have been 2 more. i remember thinking that the shape was odd in some way--it's wasn't easy to find a frame of reference to describe it. it also happened very quickly and i was a little frightened by what i was seeing. i couldn't hear any sounds until the craft was very close by and they faded quickly as it moved northward and out of sight. i'll try and draw a picture of what i saw, but it will be very difficult. the angle of viewing wasn't straight forward and i'm not an artist."],"Region":"New York","Summary":"Large diamond-shaped matte black aircraft with extremely bright flamelike lights flying at low altitude","Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around January 7th 2012"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.715543,+-74.003673(34717)&iwloc=A&hl=en\"> mufon case (34717) map </A>","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date Submitted":"01/08/2012 04:03 UTC","Country":"United States","City":"New York","Date of the Event":"01/07/2012 11:20 UTC","Object Shape":"Diamond, Square, Rectagular","Object Flight Path":"Straight-line path","Longitude":"-74.003673","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34717.html.txt","/var/www/straped/mufon/org/34717.html"],"Weather Factors":"Unknown","Latitude":"40.715543","Case Number":"34717","Log Number":"US-01082012-0017"}