{"Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=32.904292,+-97.603361(34728)&iwloc=A&hl=en\"> mufon case (34728) map </A>","City":"Springtown","Object Shape":"Boomerang","Date Submitted":"01/08/2012 10:00 UTC","trends":["There have been 5 other sightings in Springtown","There were no other sightings in Springtown on or around January 5th 2012"],"Longitude":"-97.603361","Weather Factors":"Unknown","Region":"Texas","files":["/var/www/straped/mufon/html2text/34728.html.txt","/var/www/straped/mufon/org/34728.html"],"Country":"United States","Source":"MUFON","Tags":"City","Date of the Event":"01/05/2012 01:05 UTC","Log Number":"US-01082012-0028","divs":["Sighting Details2 days before there was an earthquake in Okla. 1 day before I felt a tremor at my house. We live in the country in a rural area. That night i was watching T.V. and heard a slight rumble, so I went outside on my back porch. I noticed a light to the northwest just above the tree line, behind our neighbors house. I thought it might be a helicopter with a spot light. The light began to rise and hover, coming toward me. The object was about 100' directly over me, when I realized it wasnt anything man-made. It was about the size of a B 52 bomber. It was a boomerang shape with a huge white glowing light in the front, on the bottom was 2 triangle shaped lights, one was red and one was green. Both were blinking in alternating pattern. The triangle shaped lights that were red and green were unlike any lights Ive ever seen. The sound it made was a quiet rumble, unlike any engine sound Ive ever heard. When it was directly over me, it hovered for about 15 seconds, which scared me to death. I jumped under the porch in fear. Then realized I had to see more. I came back out to see it start to move over our house toward the east, I ran inside the house to wake up my wife, who was asleep and didnt get up. I went back outside and watched it go over my inlaws house and hover over a gas well across the street. still heading East, it disappeared over the trees. I saw something shoot across the sky to the north and never seen it again. when this occurred my feelings were excited and horrified. While the UFO was over me, I felt frozen, like I couldnt move a muscle. Since the incident, I am still having unbelievable fears and excitement, which are undescribable. I would love to talk with anyone who has had a similar experience or has knowledge in this area."],"Case Number":"34728","Object Features":"Patterned Surface","Latitude":"32.904292","Summary":"Witnessed a bright light come towards me whenover me it hovered,saw blinking red and green triangles on boomerang shaped ufo","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Disposition":"Unresolved"}