{"Summary":"Not Provided","Case Number":"3472","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around April 5th 2005"],"Country":"United States","Object Features":"Undisclosed","Region":"Texas","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Austin","Object Shape":"Undisclosed","Source":"MUFON","Longitude":"-97.733201","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=30.276313,+-97.733201(3472)&iwloc=A&hl=en\"> mufon case (3472) map </A>","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/3472.html.txt","/var/www/straped/mufon/org/3472.html"],"Object Flight Path":"Undisclosed","Tags":"City","Latitude":"30.276313","Date Submitted":"04/05/2005 02:59 UTC","Date of the Event":"04/05/2005 02:59 UTC","divs":["Sighting DetailsSighting Report: tuesday march 22nd. bike riding I was in a large field used for jogging and biking. I had gone out to document the various types of con-trails. there was a light haze in the sky caused by the con-trails. looking staight up I witnessed a silvery ball of light moving accross the sky from the southeast to the northwest. the wind that day was from the northwest and headed toward the southeast. I fixed my digital video camera on the object and for three minutes I caught the image on film. It had a steady pace and seemed to move in a straight line toward the end of the sighting the object stopped moving. at this point I panned over to another part ofd the sky of a second and when I returned the object was gone. later I went back and viewed the tape. a week later when I took the time to look at the rest of the tape of the con-trails I found another completely different object in another part of the sky at the same time. this object was captured by complete accident and was not seen until later. This object was in the far north horizon and appears to be of oval shape and bright sliver in color. I have downloaded this onto my computer yet I am still learning how to operate the digital video programs. I am willing to share this with you all if you would like. please let me know and if you may have any questions feel free to contact me at my e-mail or telephone. -thank you for your attention, rene."],"Sighting Duration":"Undisclosed"}