{"map":"<A HREF = \"http://maps.google.com/maps?q=40.240015,+-74.487421(34729)&iwloc=A&hl=en\"> mufon case (34729) map </A>","trends":["There has been one other sighting in Hightstown","There were no other sightings in Hightstown on or around November 27th 2011"],"Object Features":"Undisclosed","Disposition":"Unresolved","Case Number":"34729","Object Shape":"Star-like, Other","Latitude":"40.240015","divs":["sighting detailsi was driving home from the outlets in jackson, nj with my friend ryan one night in november 2011, when i saw something strange in the sky. we were coming through millstone, an area with expensive houses and some fields. we were on a long straight road, probably 2 miles long. it was a very clear night, the moon was partially out so much was visiable. being someone who is fascinated with the earth and its mysteries, i look up at the sky often. so when i saw this object was perplexed because i know what helicopters, airplanes, birds, stars, etc. look like in the sky. this was none of these. at first i thought it was a very bright star. but as we approached it i could see a blinking light right next to it. we got closer and closer to it and as we did i could see that it was very low to the ground for anything that would be flying in the sky. we actually parked on the side of the road when we were the close to it. we could see that is was only a few hundred feet in the air, lower than that altitude that helicopters fly. it was totally still and making no noise at all. it was shaped like a stop sign, but only had five or six sides. there was one white light in the middle surrounded by four-six multi-colored lights. they were green, blue, red\\orange, and yellow. we looked at it was a few minutes, questioned each other on what the hell it could be, then took off because we knew it wasnt anything we had ever seen. as we left the seen i kept looking behind me to see if it had made a move, but it stayed still the entire time. i grew up in this area and i know everything around here, this was something else. however, what freaked me out even more is when happened a few weeks later...."],"Log Number":"US-01082012-0029","Weather Factors":"Unknown","Summary":"5-6 sided stationary UFO over house in Mercer Co, NJ","Region":"New Jersey","Source":"MUFON","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Date Submitted":"01/08/2012 10:24 UTC","City":"Hightstown","Date of the Event":"11/27/2011 09:30 UTC","Country":"United States","Tags":"City","Longitude":"-74.487421","files":["/var/www/straped/mufon/html2text/34729.html.txt","/var/www/straped/mufon/org/34729.html"]}