{"Disposition":"Unresolved","divs":["Sighting DetailsI was driving back home to Knoxville after dropping my child off at her mothers. It was a very clear night and I was scanning the sky as I often do under favorable circumstances. I was just turning my head forward from glancing at Venus to my left and then I noticed a star above the trees ahead. There was oncoming traffic coming up the other side of the hill that I was ascending, so my attention was briefly drawn to switching to my low-beams, while also noticing the light from the other cars headlights reflect off of the power lines on the left-hand side of the road. Precisely at that moment, the star(which was directly ahead and to the right of the power lines) suddenly increased a little in brightness while changing to a pale orange color. It then ascended straight up, getting exponentially faster as it went, and changing to a pale blue color, and disappeared. Immediately afterwards, the oncoming vehicle came into view and I had to turn my attention back to driving. Now I have driven this road hundreds of times, day and night, and in all conditions, with oncoming traffic on any given stretch including this one, and never have I seen any normal lights play such a trick on my eyes, so now I start contemplating what I saw. There is almost always air traffic within a few miles, because the airport and Air National Guard base are close by. But, I am probably more familiar with different types of aircraft than the average person. My father was in the Air Force for twenty years and I have been to a few air shows and to the Wright-Patterson Air and Space Museum a number of times. This was no conventional man-made aircraft. I know the experience was brief, but I know what I saw.(?) I also remember feeling as if, when the light brightened, it wanted me to see it. I havent been able to quit thinking about it, so I must tell someone. Who better else to tell?"],"Tags":"City","Sighting Duration":"Undisclosed","Summary":"While driving North, I noticed what I first thought was a star. It was white, then seemed to grow brighter and pale orange and fade to blue as it ascended very rapidly and dissappeared.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.763372,+-83.961249(34736)&iwloc=A&hl=en\"> mufon case (34736) map </A>","Object Flight Path":"Straight-line path","Log Number":"US-01092012-0004","Latitude":"35.763372","Date Submitted":"01/09/2012 05:44 UTC","Longitude":"-83.961249","Object Features":"Unknown","Viewing Distance":"Over One Mile","Region":"Tennessee","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/34736.html.txt","/var/www/straped/mufon/org/34736.html"],"trends":["There have been 2 other sightings in Maryville","There were no other sightings in Maryville on or around January 5th 2012"],"Weather Factors":"Unknown","Date of the Event":"01/05/2012 06:55 UTC","City":"Maryville","Case Number":"34736","Source":"MUFON"}