{"Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"01/08/2012 10:30 UTC","divs":["Sighting DetailsAs I approached Moretown about 10:30 pm, heading north on Rte 100 I saw a yellowish light in the distance. At first I thought it was the top of a radio tower on top of a hill somewhere. As I got closer to town I realized there is no tower anywhere close by. I was getting closer to the object and I could make it out better as I kept driving. When I got into Moretown I could tell that the object was moving very slowly through the sky, only about 300 feet above the ground. I started driving up the hill to my home and when I got to the top and the view wasn't obscured by trees I pulled over and opened my window. The object was flying very low yet I could not hear any noise. The shape was almost diamond-like or trapezoidal. It almost looked like 2 helicopters were flying one in front of the other, really close, but I would have been able to hear them so close to the ground. It was a big dark object but it had several yellow lights underneath and also a red light. It kept flying and eventually flew over the area of my car. Soon I lost sight of it over the trees. I got home and searched online and someone reported a similar sighting about a couple days ago over interstate 91."],"Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Summary":"As I drove up the hill to my house I saw a large object flying slowly about 300 feet above ground. I was diamond/trapezoidal shaped with several yellow lights. I pulled over and it flew over my car into the distance.","Disposition":"Unresolved","Latitude":"44.266389","Longitude":"-72.725556","Tags":"City","Region":"Vermont","Log Number":"US-01082012-0032","files":["/var/www/straped/mufon/html2text/34732.html.txt","/var/www/straped/mufon/org/34732.html"],"trends":["There has been one other sighting in Moretown","There were no other sightings in Moretown on or around January 8th 2012"],"Country":"United States","Case Number":"34732","Date Submitted":"01/08/2012 11:46 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.266389,+-72.725556(34732)&iwloc=A&hl=en\"> mufon case (34732) map </A>","City":"Moretown","Object Shape":"Triangle, Other"}