{"Region":"Florida","Sighting Duration":"00:00:11","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34734.html.txt","/var/www/straped/mufon/org/34734.html"],"City":"Gainesville","divs":["Sighting DetailsFirst, we would like to apologize for taking so long to report this. After we saw it, we spent a year talking about it and collecting the info we had. We didn't report it because, well, who would believe it? We didn't even tell our families about it and probably won't. I mean, if my friend had told me about it, I wouldn't have believed it either and I trust him explicitly. My brain wouldn't have allowed me to believe such a tale, so I would have presumed he was mistaken about what he actually saw and thought little of it. This is why reporting it never seemed like a good idea to us. Let's just say my attitude has changed recently, and now I feel I owe it to the world to share what we saw for better or worse, so here goes. It was my first day of retirement from a company I had been employed by for 12 years. It was Monday, January 3, 2011 on the NW side of Gainesville near Publix on Main Street. After relaxing all day, a good friend of 10 years dropped by to hang out for a while and catch up from the holidays. My back yard features a beautiful panoramic view of the eastern sky with a small 80 foot tree line about 60 yards away or so. The sky features air traffic going to and from south Florida as well as local air traffic from GPD, Shands, and Gainesville Airport. Planes, helicopters, and falling stars are seen regularly, so it's a great place to just hang out and look up. Around 7pm, we decided to go out back for a smoke. As we faced due east, My friend was staring up at the sky, while I was directly to his right staring off into the neighborhood while running my mouth about something. It was around 48-50 degrees and crystal clear. A cold front had moved in so there was no haze, no fog, no moon, and we both had coats on. At 7:09, it happened. My friend was staring up at the sky, and in the exact spot where he was looking, a small, somewhat upright, equal triangle with slightly rounded edges just materialized out of nowhere at least 30,000 feet or so up (cruising altitude for planes). It had 6 - 10 larger green and white lights underneath and 3 smaller half-oval white lights in the middle of each side. The body of the craft was dark. A split second after he saw it, it descended straight down - only the full bottom of the craft visible - then swooped at the end and leveled off in less than 4 seconds. Again, it fell tens of thousands of feet and leveled off at a low altitude in less than 4 seconds - easily less than 400 feet. I estimate it at 150 feet altitude or even less. Unreal. At the end of the descent, as it began to swoop and level off, my friend suddenly grabbed my left arm tightly as gasped \"LOOK!\" while pointing to the east. I expected a falling star or something. As soon as I looked up over the tree line, the first thing I saw was a fuzzy, white, cloudy...thing... surrounded by a strange watery substance - it was like a mirage - moving closer to us. As it cleared the tree line, it became clear what it was: it was a cloaked triangle and it was creeping towards our direction at 10mph. It looked to be about 50' long along each side, but it could have been a bit bigger or smaller - it's very hard to be sure as there's no frame of reference for what we saw. This thing didn't waiver, tilt, or wobble at all - it was dead still moving only forward. Although the cloaking had a somewhat wavy nature about it, it wasn't vibrating or moving either. Everything about this craft was dead still except for the slow forward movement. We had a prefect, unobstructed view of this craft for a full 5 to 7 seconds before it disappeared over the trees in the middle of my block behind my house. It was a cloaked triangle craft. There was a fuzzy, whitish, haze in the front middle and along the leading edges. I also saw some rounding in the back of the fuzzy white where it met the cloaking. It wasn't light - it was a faint white. We could completely see through the craft, but not the white fuzzy stuff. When the craft passed in front of the stars, the stars jiggled. When the craft fully passed, the stars were dead still again. I'll never forget the feeling of just how still the stars are after seeing them jiggle. Wow. The cloaked triangle had no visible lights of any kind while cloaked - at least none that we could see. We had a clear view of the bottom, the right side, and the front tip of the craft, but never had a view of the back side, the left side, or the top. Although I heard no sound, my friend described it as, and these are his words, \"it sounded like it was pushing the air out of the way\". It was hovering absolutely straight and forward west-southwest at approximately 10mph. The entire event lasted around 11 seconds. After it passed, we were left in disbelief. It was the most incredible thing we had ever witnessed - absolutely as gorgeous as it was mysterious - and it was RIGHT IN FRONT OF US. Not high up in the sky or off in the distance, but RIGHT THERE! Unreal. The greatest thing I have ever seen in my life. In the year after the sighting, my friend and I spoke about it from time to time, gathering the details of the experience, and separating what we were certain of from what we merely thought we saw. Everything I've included here is what we are certain of. Both of our phones were inside the house when we saw this, so we were unable to get video or pics since it happened so suddenly. I also spent time during that year trying to find other reports of the same craft. I googled \"Cloaked Triangle\" and \"Camouflaged triangle\", checked reports at MUFON, and never found anything except a video of a cloaked triangle emitting a vapor trail which was suspect and definitely NOT what we saw. Then, the morning after the anniversary of the sighting this past week, I decided to add \"Gainesville, FL\" to my search and, to my utter shock, found a report at the NUFORC site from someone who saw the exact same craft in the exact same city on the exact same night as we did - Jan 3, 2011 in Gainesville, FL. This changed everything for me and is why I now feel it's my duty to report what we saw. The only difference was they saw it a half hour before we did. Since we saw it descend, this means one of three things: Either there were two crafts, or the craft they saw went back up and descended back down over my neighborhood, or they were mistaken about the time by 30 minutes or so. But the description was identical right down to it \"pushing air out of the way\". Although we saw a somewhat blueish hue, we presumed it was simply colors from the night sky being refracted and left it out of this report since we weren't certain about it. We would love to talk to that other witness and will ask NUFORC to pass on our contact info if they'd like to share stories. Should anyone report the same craft to MUFON, they can share my email address as well. I want to know more about all of this, believe me. We have made video and audio interviews about this and my friend made a drawing of the triangle in it's un-cloaked form 2 days after we saw it, which I now have. We'd be happy to share all of this with MUFON if they are interested."],"Viewing Distance":"21-100 Feet, 101-500 Feet, Over 1 Mile","Case Number":"34734","Object Flight Path":"Straight-line path,Other","Source":"MUFON","Log Number":"US-01092012-0001","Summary":"A triangle (equal with slightly rounded edges) appeared out of thin air, made an impossibly fast decent, stopped on a dime, then hovered slowly forward over the middle of my block.","Object Shape":"Triangle","Date of the Event":"01/03/2011 07:09 UTC","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around January 3rd 2011"],"Longitude":"-82.326467","Latitude":"29.691531","Date Submitted":"01/09/2012 02:33 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.691531,+-82.326467(34734)&iwloc=A&hl=en\"> mufon case (34734) map </A>","Weather Factors":"Unknown","Object Features":"Other"}