{"Summary":"Giant Flying rectangular wharehouse divided in 3-5 rectangular sections, the top being smaller than the bottom 10 rectangles, but they were all the same length.","Object Shape":"Square, Rectagular","City":"NEW CANEY","Date Submitted":"01/09/2012 05:15 UTC","Region":"Texas","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/34735.html.txt","/var/www/straped/mufon/org/34735.html"],"Viewing Distance":"21-100 Feet","Country":"United States","Date of the Event":"12/20/2011 12:00 UTC","Latitude":"30.202066","Longitude":"-95.246426","divs":["Sighting DetailsMy TV went out and I had just died in the Oblivion 4 game I was playing, so I decided to go to bed, but before I went to bed I decided to put out our 4 boston terriers. As soon as I walked outside in my backyard with them and I saw the object heading right at me. Very long the length of a football field but the width was I'd say about 40 feet long, very rectagular shaped flat front divided in 3 sections top section all lit up in white neon lighting had five smaller rectangle shapes, middle and bottom had the same with larger rectangles but all the same in length, the object had a flat nose and a flat back. The object made no noise it came from the east just about 50 ft above the treetops heading West. The bottom of the ship was pitch black with neon white light outlining the ship. I've seen blimps and know what they sound like this was no blimp and it was moving way to quickly to be one and made no sound. The whole sighting lasted less than 30 seconds and it was gone. It cleared the treetops in my backyard flew right over me and my house heading west lost sight of it when it flew over the house. I felt kind of awestruck seeing the object, but the next day I had trouble with my equalibrium and fell in the kitchen. Not one of our dogs left the porch while the object was flying over, but when it passed they all went out in the yard."],"Source":"MUFON","trends":["There have been 7 other sightings in NEW CANEY","There were no other sightings in NEW CANEY on or around December 20th 2011"],"Disposition":"Unresolved","Sighting Duration":"00:00:30","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.202066,+-95.246426(34735)&iwloc=A&hl=en\"> mufon case (34735) map </A>","Log Number":"US-01092012-0003","Tags":"City","Object Features":"Patterned Surface","Case Number":"34735"}