{"Weather Factors":"Unknown","Country":"United States","Object Shape":"Flash","Disposition":"Unresolved","trends":["There have been 4 other sightings in Hamilton Township","There were no other sightings in Hamilton Township on or around December 13th 2011"],"City":"Hamilton Township","Summary":"Flash of light over my house","Source":"MUFON","Region":"New Jersey","Object Features":"None","files":["/var/www/straped/mufon/html2text/34730.html.txt","/var/www/straped/mufon/org/34730.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsOnly a few weeks after my friend and I witnessed a stationary UFO over a house in East Windsor, NJ, I witnessed another phenomenon. It was evening time, I remember I was playing a video game. I stopped for a minute to eat a pumpkin muffin. I put the rest of it down on my comforter and made some crumbs. I admit I'm lazy a lot so normally I would have played my game some more then go brush them off later...no biggie. For some reason I thought to myself, go brush them off now. So I curled my heavy comforter up and walked out of the back door so I could brush the crumbs off on the ground. I went through the door and closed it behind me. It was very dark out, but a clear sky. The second that I turned around and faced the door, and lifted my blanket in the air with my left hand, I saw a long flash of light wizz horizontally right over my house. This thing was a long streak of light and it seemed like it went into something, (which I couldn't see), and vanished. It was so low to my house it was scary. It was lower than this big tree that's right across the street from me. What it felt like to me was it was like \"they\" were spying on me and didn't expect me to come outside and high-tailed it out of there. And by the way, I've seen many meteors come into the atmosphere, some far up in the sky and some as close as this thing I saw.....this was not a meteor."],"Longitude":"-74.697414","Date Submitted":"01/08/2012 11:03 UTC","Date of the Event":"12/13/2011 07:30 UTC","Log Number":"US-01082012-0030","Sighting Duration":"Undisclosed","Latitude":"40.20505","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.20505,+-74.697414(34730)&iwloc=A&hl=en\"> mufon case (34730) map </A>","Case Number":"34730"}