{"Summary":"Saw a roundish orange disc low in the sky turn multiple colors with no noise then hover and rapidly ascend above commercial flights and disappear.","Object Flight Path":"Path then hovering","Log Number":"US-01092012-0015","divs":["sighting detailscarl, i have never sent anything or reported anything on an ufo in my life. however, i do believe in et. has anyone besides me reported a sighting over jacksonville , fl? i'm hoping you cover duval county but didn't see it listed on the flmufon web page. about 10:10pm 01\\07\\2012 i took my dogs out for some business and was facing southeast at the 3:30 to 4 o'clock position and noticed an orange disc above the old channel 30 television tower. it had no strobe on and was very slowly closing my position appearing slightly up positive but actually not changing altitude. it continued on a northern course as i watched through the tree limbs about 3 to 4 minutes then it appeared to hover about 1 min turn bluish and then back to orange. as i watched, it stopped any forward motion and started an ascent about 10:17. in order to track or see the target i went to my front yard and noticed the object was still ascending and was high in the sky at about the 11:00 o'clock position well above the trees. it was still orange and i noticed the strobe of 2 commercial flights being slightly white. the object still had no strobe and at that position started north across the clear sky. at that time i saw what looked like very bright blue and reddish flashing coming from the craft. watching the craft at altitude i could still see the north bound commercial flight strobe but the object just disappeared. i have 23 years of service from helicopter crewman in the army to navy aircrew in s-3 vikings and p-3 orion antisubmarine aircraft. my wife also witnessed part of this."],"Object Shape":"Disc, Egg","map":"<A HREF = \"http://maps.google.com/maps?q=30.342084,+-81.653471(34747)&iwloc=A&hl=en\"> mufon case (34747) map </A>","Date of the Event":"01/07/2012 10:10 UTC","Latitude":"30.342084","files":["/var/www/straped/mufon/html2text/34747.html.txt","/var/www/straped/mufon/org/34747.html"],"Object Features":"None","Case Number":"34747","City":"Jacksonville","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around January 7th 2012"],"Weather Factors":"Unknown","Sighting Duration":"00:11:00","Region":"Florida","Viewing Distance":"Unknown","Tags":"City","Disposition":"Unresolved","Country":"United States","Longitude":"-81.653471","Date Submitted":"01/09/2012 04:05 UTC","Source":"MUFON"}