{"files":["/var/www/straped/mufon/html2text/34748.html.txt","/var/www/straped/mufon/org/34748.html"],"Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.968167,+-108.572511(34748)&iwloc=A&hl=en\"> mufon case (34748) map </A>","Region":"New Mexico","Log Number":"US-01092012-0016","trends":["There has been one other sighting in Gila","There were no other sightings in Gila on or around January 4th 2012"],"City":"Gila","Source":"MUFON","Date Submitted":"01/09/2012 04:29 UTC","Summary":"Numerous lights visible above Turkey Creek Campground","Date of the Event":"01/04/2012 03:30 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Other","Object Features":"Unknown","Longitude":"-108.572511","divs":["Sighting DetailsI arose at approx. 03:30 in the morning, got dressed and went into the kitchen to start the coffee pot, looked out the window in our dining room that faced the Gila mountains in the Gila Wilderness area, and noticed a large, very bright, Strob-like light moving northward directly over the Turkey Creek camp ground area. This light was different from an aircraft type Strobe in that it flashed twice, then about a 1 second of no flash, then another 2 flashes, and so on for about 2 minutes, then it ceased flashing and disappeared. At the same time I noticed other lights in the same area, I seem to remember about 6 to 8 strobing lights, 2 were bright solid lights, moving at different directions and speeds with various altitude changes. I wondered if they might have been military aircraft, but, even with looking through binoculars, no wings, red or green nav lights, or anything else that would identify aircraft was seen. No sound at all. I estimate they were more than 10 miles away, and were about the size of an average star as seen with the unaided eye, with the exception of the very bright double strobing light which was approx. the size of Venus, but much brighter! Most of the single strobing lights were moving in fast circles with major altitude changes. I have questioned individuals I am familiar with, but noone so far witnessed this sighting other than me. Needless to say, I was transfixed at this sight and watched for about 5 minutes when they all went out and disappeared! I have no idea as to what I saw, but they were real, and they were moving as described. Once again the Turkey Creek Camp ground was busy, however, the time since this sighting has been very quiet, except for the various commerecial aircraft that travel through this area on a regular basis."],"Weather Factors":"Unknown","Object Shape":"Star-like","Case Number":"34748","Viewing Distance":"Over One Mile","Tags":"City","Latitude":"32.968167"}