{"City":"Oswego","Object Flight Path":"Stationary","Latitude":"41.687341","Object Shape":"Circle, Sphere, Triangle","Case Number":"34743","divs":["sighting details my 12 yr old and i witnessed stationary lights in the sky again above oswego, il. it was the same place and time of day as our november 10, 2011 sighting. we noticed them both days at 3:25pm in the western sky. the sun was getting lower in the sky and there were scattered clouds, though the sky was mostly sunny. the conditions were very similar to our sighting in november. two lights were at the lower cloud level and seemed to be attempting (poorly) to blend in with the clouds. one light appeared to the lower right (west) of the sun and the other was farther to the right (slightly northwest). we only saw them for a minute and then lost them and had to keep driving. when i got to our home, about a mile away, i got out our sony handycam and caught at least one light on it at about 4:00 pm. the stationary light was in the clouds directly to the west, to the right of the setting sun. the lights were lower and bigger than the airplanes that were present before and after. i focused in on one light and it appeared almost a triangular shape with fuzzy edges and it was a glowing reddish-pink on the top point, white in the center and green on the bottom two points. the video is shaky but if you pause on it you can really see the colors. to the naked eye, the lights were bigger than the size that stars look, closer to the size that jupiter looks right now from our area. these lights were stationary, not airplanes, as i was also watching and comparing them to airplanes higher in the atmosphere with their contrails. there were no large planes at that level in the sky, all were much higher. there were no helicopters or small planes in the area when the lights appeared. the lights are not venus or conventional aircraft or the space station or weather balloons, as some have suggested to me. they are stationary and fairly close to the ground. also, a dark helicopter flew by about 20 minutes after the light was filmed. right after the events our wii froze and wouldn't turn off, has never happened before, and our cell phone wasn't responding when we wanted to play songs, which also hasn't happened before. at the time i was just so satisfied that i had caught one of these lights on camera. but as the week has gone on i am finding myself unnerved about what these are and what they're doing. i cannot think about anything else. i'm also extremely frustrated with the complete denial\\dismissal of the general population. my 12 year old, who spotted the lights the first time, and saw the lights both times, wants to forget that it happened and is slipping into denial. i don't blame my 12 yr old, at that age it must be hard to accept. if you live in the area and want to check it out, watching from orchard road in oswego would give you the best view. i'm guessing they'll show up again on mostly sunny days, when there are some low, thin clouds in the western and slightly northwestern sky. so far they have all been to the right of the sun. make sure to begin watching at about 3:15 pm at about 40 degrees above the horizon, or at about the level of the sun."],"Date Submitted":"01/09/2012 01:12 UTC","Weather Factors":"Unknown","Region":"Illinois","Country":"United States","trends":["There have been 6 other sightings in Oswego","There was one other sighting in Oswego on or around January 3rd 2012","This sighting has never been favorited.",""],"Longitude":"-88.368422","Disposition":"Unresolved","Summary":"Unknown Stationary Daytime Lights In Western Sky","Object Features":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.687341,+-88.368422(34743)&iwloc=A&hl=en\"> mufon case (34743) map </A>","files":["/var/www/straped/mufon/html2text/34743.html.txt","/var/www/straped/mufon/org/34743.html"],"Sighting Duration":"Undisclosed","Date of the Event":"01/03/2012 03:25 UTC","Source":"MUFON","Log Number":"US-01092012-0011"}