{"Date Submitted":"04/27/2005 03:53 UTC","Case Number":"3474","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around April 27th 2005"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.811785,+-96.760243(3474)&iwloc=A&hl=en\"> mufon case (3474) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/3474.html.txt","/var/www/straped/mufon/org/3474.html"],"Summary":"Egg shaped object near football field","Sighting Duration":"Undisclosed","divs":["Sighting DetailsSighting Report: This is not my sighting but my brothers and a couple of other friends. The year was 2001 and my brother was throwing a big party for his son s (my nephew)1st birthday. I was working at Speedzone at the time and he had invited me and I had the feeling that something special was going to happen. Unfortunately I had to work so I couldn t go. So at the party my brother and a couple of friends (8 of them ) were having a good time eating, drinking, and celebrating. But later on in the night after the party was over, most of them were to drunk to drive home so they spent the night over. At about 4:30-5:00 in the morning, one of his friends got thirsty and went to the kitchen to get something to drink. My brother had a house that had a big field and a high school football stadium in his backyard and you could see all this through his kitchen. And when he turned around he saw something that he knew was not a plane. So he woke everyone up and they all ran to the backyard. What they saw was a strange egg shaped object that looked like it was floating on water. It had windows and bars that ran across it like an \"X\". Every now and then then object would spin and when it did, it would shine of a light but the light would only go so far so it looked more like a forcefield. They all watched in amazement as this object hovered and they were all hypnotized by it and all though there were plenty of cameras in the house, no one wanted to go inside because they wanted to see what it would do next. Then out of the right side, they saw what they thought was a plane but the light dimmed out when it got close to the U.F.O and reappeared, but when it reappeared it turned from one big light to alot of little \"globes\" with what looked like mist around it. Then they saw they \"globes\" go inside the U.F.O and the U.F.O stayed around for an extra 5 minutes before leaving. The next day when my brother told me about it I didn t believe him because i was always the one who believed in U.F.O s and he didn t so I figured that he was joking me but everyone told me the same story and even the dogs were acting \"different\". Later that night he threw a cookout and this time I got to go and I had a feeling that we were being \"watched\" and I was \"drawn\" to this one \"star\". I told my brother I thought it was a U.F.O but since his eyes are not good as mine, he couldn t tell. Then all of a sudden all saw the \"star\" move slowly from one location to the other them stop. I knew it had to be a U.F.O. but my brother didn t believe me."],"Disposition":"Unknown","Latitude":"32.811785","Object Shape":"Egg","Source":"MUFON","City":"Dallas","Tags":"City","Date of the Event":"04/27/2005 03:53 UTC","Country":"United States","Weather Factors":"Unknown","Longitude":"-96.760243","Region":"Texas","Object Flight Path":"Undisclosed","Log Number":""}