{"Summary":"Very clear. Saw stationary light. Several minutes later another light rose stright up to almost level with the stationary light then later began to move in an arc off to the north east.","Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","Object Features":"Wings","Disposition":"Unresolved","Case Number":"34759","divs":["Sighting DetailsMy father and I had just visited with my mother, in her nursing home, and were on our way to pick up fast food and then go to his home on the near south side of Indianapolis. It was around 7:00 pm 1-9-12. The sky was very clear and the moon very bright. We were talking about how beautiful the full moon looked and the fact that it was hard to see the stars when in the city. We were driving north then turned west. After turning west, still talking about the way the stars look like out in the country, we noticed a bright spot a little south of direct west. It seemed to be way to high to be a light on a tower or building. We drove 12 to 14 blocks west discussing what it might be, even stopping at a red light and watching it, commenting on how it never moved. While at the stop light, a jet flying very low passed in the distance to the west of us moving from the south to the north. It was WAY lower than the light. The jet was close enough to make out the details of the shape. The \"light\" seemed to both of us to not cast any beam of light but to just be in the shape of a lighted upside down V. Dad commented on the fact that the Indianapolis airport was to our south west and it might be a helicopter but I thought it was farther west than the airport and it just stayed too still. It was so far away it just looked like a VERY bright star. We turned left (south) and had gone another 2 blocks when another light appeared rising straight up to almost level with the first light. It looked like the same size and brightness. We pulled into a fast food place, bought sandwiches and sat there a minute or two watching both lights just hang there. We drove home (maybe 5 minutes) with the lights to our back. When we pulled up at dad's house my car was parked facing west and we sat there for maybe 2 minutes, watching, noting that the second light had not moved. The second light then began to move and we got out of the car and stood on the street watching. The second light moved east and in a wide arc. It was still somewhat south of us but as it reached a point a little south east of us the arc got a bit tighter and it was then headed north east. It passed to the east of us and when it did we got a clearer look at it. It was still so high that we could not make out real details but it had a longish shaped body and was blunt on both ends. There were 4 yellowish, round, lighted areas on the back end stacked 2 on top of 2. There were 2 white lights on the front, about the same size as on the back, sitting side by side and the wings were boomarang shaped with a smaller light-blue light near the tip of each wing. None of the lights blinked. The wings seemed to not come out the side of the body but be on top of it. It moved very fast and there was no sound. It dissappeared into the north east within seconds. The origional light was still in the same place when I went to bed at 10:00 pm but was gone at 5:00 am when I got up for work. I don't think me or my dad were frightened in any way. We just felt puzzeled."],"City":"Indianapolis","Date of the Event":"01/09/2012 07:00 UTC","Longitude":"-86.123964","Log Number":"US-01102012-0004","Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=39.739271,+-86.123964(34759)&iwloc=A&hl=en\"> mufon case (34759) map </A>","Weather Factors":"Unknown","Tags":"City","Date Submitted":"01/10/2012 10:42 UTC","Region":"Indiana","Object Flight Path":"Stationary,Path with directional change","files":["/var/www/straped/mufon/html2text/34759.html.txt","/var/www/straped/mufon/org/34759.html"],"Latitude":"39.739271","Sighting Duration":"01:00:00","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around January 9th 2012"]}