{"Log Number":"","Date Submitted":"05/24/2005 03:03 UTC","Sighting Duration":"Undisclosed","Date of the Event":"05/24/2005 03:03 UTC","divs":["sighting detailssighting report: i am wondering if there was any kind of unusual aircraft testing going on may 21, 2005? my husband and i were at the drive-in, preparing to watch (the irony of it) star wars iii. it was around 8:45 pm or so,with a clear evening sky, and the first sign we had was of what looked like a bright white light. my husband pointed it out, and thought it might be a weather balloon. a few minutes later, in approximately the same spot, i saw an extremely bright light, only it looked like a burst of light or flame. then, from that initial light, came a stream of smoke or vapor, which then led to a second light which seemed to be on fire. from that second light, then came a stream of smoke or vapor, leading to a third light. i have never seen a separation of rocket stages in person, but from videos i have seen, that is the closest description that i can give. only this was no where near a space center. this took place above the horizon in the west\\southwest and lasted about 30 seconds altogether. we do have an air force base on our town outskirts, but this is not anything like their normal flight patterns or aircraft. i would love to know if anyone else saw something similar?"],"Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.454766,+-99.729724(3475)&iwloc=A&hl=en\"> mufon case (3475) map </A>","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Summary":"Not Provided","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around May 24th 2005"],"Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Undisclosed","City":"Abilene","Latitude":"32.454766","Longitude":"-99.729724","files":["/var/www/straped/mufon/html2text/3475.html.txt","/var/www/straped/mufon/org/3475.html"],"Country":"United States","Case Number":"3475"}