{"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=-32.296281,+115.779098(34757)&iwloc=A&hl=en\"> mufon case (34757) map </A>","Summary":"Black Triangle that Emitted a Blue Glow With 3 Yellow-Orange Lights that Emitted a Blue Glow","Date of the Event":"04/05/2011 08:00 UTC","City":"Cooloongup","Object Shape":"Triangle","divs":["Sighting Details1. Where were you and what were you doing at the time? I was outside Ready To Pack Up the camera I was in my Backyard and the time was exactly 8:00pm, I had Just Finnished Filming The Stars and I put my Sony Handycam 8mm on Stanby. 2. What made you first notice the object? I was Facing East and I had my camera and my Tripod Infront of me. I was just looking about at the different Constellations and In the right corner of my right eye I saw a yellow light. 3. What did you think the object was when you first noticed it? At First I though it was a plane due to the colour, but when I turned my head to the right facing South and Looked at the object. 4. Describe the object and its actions and motions in detail. When I first got a look at the object. It was a massive Black Triangle with 3 yellow-orange sorta dimmed out lights on it. As it flew from South To north Directly over me. As it was Directly over me a Blue-ish glow Appeared and Radiated around the edges of the craft. The Craft was massive. If the moon was directly above me it would have covered it. It made no noise and it didn't even create a draft. 5. Describe your feelings, reactions and actions, during and after sighting the object. My Initial Reaction was nothing I froze in shock and I had major Goosebumps all over my body I just looked at it as it flew over me with my mouth open. After it went off into the distance I was soo over Joyed I'd seen it I yelled out \"I Saw a Triangle\" a Couple of times. 6. How did you lose sight of the object? It went off to the north. And just got smaller as it went into the distance"],"Case Number":"34757","Date Submitted":"01/10/2012 05:59 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Longitude":"115.779098","Country":"Australia","Weather Factors":"Unknown","Region":"Western Australia","Disposition":"Unresolved","Object Features":"None","Log Number":"AU-01102012-0002","Source":"MUFON","trends":["There have been no other sightings in Cooloongup","This sighting has never been favorited."],"Latitude":"-32.296281","files":["/var/www/straped/mufon/html2text/34757.html.txt","/var/www/straped/mufon/more/34757_submitter_file1__Triangle.png","/var/www/straped/mufon/org/34757.html"],"Tags":"City"}