{"Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/34761.html.txt","/var/www/straped/mufon/more/34761_submitter_file1__ufo1.JPG","/var/www/straped/mufon/more/34761_submitter_file2__ufo2.JPG","/var/www/straped/mufon/org/34761.html"],"Date Submitted":"01/10/2012 12:13 UTC","Object Features":"Unknown","Summary":"Attention grabbing flash and erratic flight","Country":"United States","Object Shape":"Cigar","Log Number":"US-01102012-0006","Case Number":"34761","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Oswego","Disposition":"Unresolved","Longitude":"-76.466187","divs":["Sighting DetailsI was driving south from Oswego to Fulton on rt 481 with my wife and dog. A very bright shining aircraft appeared a mile away directly above the highway ahead of us. I slowed down and we watched it until my wife said \"What is that? It looks like a cigar.\" I didnt have my glasses so I could not see in full detail, but I could see that it was a bright white object that moved more erratically than other aircraft I have seen (I build model planes so Im familiar with most types). The object started moving south and blending in with very distant clouds and eventually we could not see it. We continued driving and 10 seconds later my wife said \"Wait, its coming back at us.\" I pulled over and it was now moving north and was situated further east than when we first saw it. It was probably surveying the small airport in that area. We found a camera and took some vid and pics. There was not one sound despite its close proximity. The absence of engine noise was most alarming to me, coupled with its erratic flight and high steady speed. The 2 pics are high megapixels, but one is slightly zoomed. The object is in the approximate center, quite small. It can be zoomed quite nicely in photoshop. The video is alright but low res."],"Date of the Event":"01/07/2012 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Oswego","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.413001,+-76.466187(34761)&iwloc=A&hl=en\"> mufon case (34761) map </A>","Object Flight Path":"Hovering then path","Latitude":"43.413001","Region":"New York"}