{"Date Submitted":"01/10/2012 05:50 UTC","Case Number":"34768","Weather Factors":"Unknown","Tags":"City","Country":"United States","Longitude":"-76.055554","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Denver","Summary":"two objects. One red pulsating small orb, one large black disk.","map":"<A HREF = \"http://maps.google.com/maps?q=40.176285,+-76.055554(34768)&iwloc=A&hl=en\"> mufon case (34768) map </A>","files":["/var/www/straped/mufon/html2text/34768.html.txt","/var/www/straped/mufon/org/34768.html"],"trends":["There have been no other sightings in Denver","This sighting has never been favorited."],"Object Features":"None","Object Shape":"Disc, Sphere","divs":["Sighting DetailsI was at my Sister's house for Christmas day. It was about 8:30 PM and my Sister was preparing the Christmas evening meal. I popped outside for a cigarette and about 1 minute later my Mum joined me. Maybe 1 or 2 minutes later Mum was looking up at the sky and noticed an orange glowing orb. She pointed it out to me and asked me what it was. I looked and seeing a pulsating orange orb assumed it must have been a Chinese lantern. This is how I responded. 'that's just a Chinese lantern\" I responded. As I continued watching the light something caught the corner of my eye. I looked at whatever had captured my attention and quite clearly saw a large black disk moving on exactly the same trajectory as the orb except in front of the orb. I exclaimed to Mum that the orb was not what she needed to be looking at but the large black disk preceding it. She looked but could not see what I could. The Disk and orb were moving at a steady speed and in the same direction. There was no noise emitted from either craft. The black disk was difficult to make out against the darkness of the night but was unmistakable (in case you are wondering Mum had cataracts at the time so could not make out poorly defined objects e.g. Black on black. She has since had the cataracts removed). Mum saw the orb without problem, obviously. They both followed a straight line trajectory. As mum didn't see the disk she just seemed amazed that she had seen an orange orb. Personally if I had not seen the disk I would have put it down to a Chinese lantern. When I realised that a big black disk was flying across the sky I was blown away. I have always been sceptical about UFO sightings but this nailed it home as convincing evidence in my mind. As to whether it was ET or a home grown version of fantastic technology I don't know. I just know that I saw what I saw and feel obligated to report it. I don't like talking about this other than with close, trusted family or friends. There is a large amount if ridicule that accompanies this subject and I do not enjoy being ridiculed. unfortunately I did not have a camera capable of filming this event. The experience probably lasted about 45 seconds to 1 minute."],"Object Flight Path":"Straight-line path","Region":"Pennsylvania","Latitude":"40.176285","Log Number":"GB-01102012-0013","Date of the Event":"12/25/2009 08:20 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed"}