{"Source":"MUFON","Region":"Texas","Date of the Event":"12/28/2011 04:15 UTC","Log Number":"US-01102012-0009","Viewing Distance":"Over One Mile","Object Shape":"Diamond, Triangle, Other","Sighting Duration":"02:00:00","Longitude":"-99.899903","City":"Undisclosed","divs":["sighting detailsmy wife and i live on 40 acres near terlingua, tx. approximately 4:am i woke up and could not go back to sleep. i got up and dressed to step out and have a smoke. off to the west\\sw, i saw a bright pulsating object about 35 degrees off the horizon. the lights were red and blue. they were very distinct. i watched with great curiosity trying to rationalize what i was witnessing for quite some time. (about 15 minutes) i then went in the rv and got my binoculars. it was then that i saw the true shape of the craft. it was very similar to a top or diamond. the lights seemed to be pulsating from the center of the craft. i stood and stared at this object for about another 5 minutes or so, then i saw it drop lower on the horizon, then move to the right for about 30 seconds, then move back to the left. after about another 20-30 seconds, it moved back to a center point between the left and right positions, and rose back up. approximately 60 seconds after it had moved back into it's original position, i saw a quick flash in my peripheral vision. i looked over to the north east and witnessed another craft of some type, only smaller than the first (or farther away...i don't know) this second object was also pulsating the same colors as the first. at this point i tried to wake my wife. she would not get up. i watched the two objects hover for about another 5 minutes, then i went back into the rv. i sat in awe, trying to figure out what i had just witnessed. i went back out side about 30 minutes later, and both craft were gone. the purpose of this letter to to inform you that there have been multiple sightings down here, and they are still happening, almost on a nightly basis. some people have gotten pictures. we have witnessed this in different directions over the past year. sometimes to the east, sometimes to the south...this particular event was the closest i have seen... respectfully submitted,"],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/34764.html.txt","/var/www/straped/mufon/org/34764.html"],"Latitude":"31.978399","Date Submitted":"01/10/2012 02:50 UTC","Country":"United States","Disposition":"Unresolved","Case Number":"34764","Tags":"City","Object Features":"Undisclosed","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=31.978399,+-99.899903(34764)&iwloc=A&hl=en\"> mufon case (34764) map </A>","Summary":"HOVERED FOR APPROX 30-40 MINUTES THEN DROPPED AND MOVED LEFT TO RIGHT"}