{"trends":["There has been one other sighting in Hamtramck","There were no other sightings in Hamtramck on or around January 8th 2012"],"Summary":"5 orbs spread into a crossshape then 3 vanished and other two orbs rotated around eachother","Sighting Duration":"Undisclosed","Latitude":"42.392815","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Log Number":"US-01102012-0016","Viewing Distance":"Over One Mile","Longitude":"-83.049644","Date Submitted":"01/10/2012 06:52 UTC","Case Number":"34771","divs":["Sighting DetailsSunday morning i went outside to watch the clear sky and around 12:21P.m. I noticed 1 orb to the north i got my phone out and looked into the sky and it was gone then i seen two appear and then another 3 appear they were at first rotating in a circle.(imagine a start that has 5 points and the star was spinning and all you would see were its points.) Then the orbs spread out into a cross shape and started moving.I was able to take my phone out and press record. Sadly for some strange reason it was almost dead and I was able to record 9 secs before my battery darned and my phone turned it's camera recorder mode off. Good this is that you can see these orbs in the video but there quick appearing and disappearing. My camera phone has a 5megapixle camera so its quality is good,but you need to stop video to see clear details. I don't have a cord to upload into my computer so please contact me and ill send the video over my phone for you to see. Back to the story,after my phone died i watched for 2 more minutes as three disappeared and last two rotated around one another. i have reported one other thing on this website and the mufon investigator is kinda in contact(i have new phone so i can be called now, old one was broken and just got new one last week) but we haven't talked yet because my phone was broken. so i had to get a new one. i can send the video i got over a text massage"],"files":["/var/www/straped/mufon/html2text/34771.html.txt","/var/www/straped/mufon/org/34771.html"],"Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Date of the Event":"01/08/2012 12:21 UTC","Tags":"City","Object Shape":"Egg, Sphere","Region":"Michigan","Object Features":"Undisclosed","City":"Hamtramck","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.392815,+-83.049644(34771)&iwloc=A&hl=en\"> mufon case (34771) map </A>"}