{"Region":"Texas","Object Shape":"Undisclosed","trends":["There have been 7 other sightings in Humble","There were no other sightings in Humble on or around June 12th 2005"],"Disposition":"Unknown","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsSighting Report: In 1960, I had enlisted in the Ohio Army National Guard and was sent to Fort Jackson, S.C to finih my Advanced Infantry Tactics school. In the fall of 1960, our company was in the open outdoors cleaning our equipment when someone noticed 3 cigar shaped objects in the sky overhead. They were motionless and yet they maintained an equal distance from each other. They were to the eyes, silver mettalic and solid forms. There was no blurring of their outlines and according to our \"\"aircraft identifican\" cards indicated that if they B-52 bombers, they would be about 40-50 thousand feet above us. Two things that come to my mind that was unusal, first, they remained overhead for so long that we returned our weapons to the armory late that afternoon. They became of no further interest to usthat day. Secondly, the next morning at our company roll call formation, the Copany Commander addressed us and told us that we \"were not to talk or discuss what we had seen\" the day before, and if contacted by any one about what we saw that we were to refer the person to the Post Company Commanding General. I have since looked for the sighting on any program or listing of sightings, but have never found this sighting. In order for our company commander to tell us what he did, the incident must have stirred up interest in areas other than Fort Jackson. If you have information about this sighting, I d really like to hear from you."],"Case Number":"3477","Date Submitted":"06/12/2005 09:37 UTC","Date of the Event":"06/12/2005 09:37 UTC","Viewing Distance":"Unknown","Latitude":"29.998831","map":"<A HREF = \"http://maps.google.com/maps?q=29.998831,+-95.262155(3477)&iwloc=A&hl=en\"> mufon case (3477) map </A>","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/3477.html.txt","/var/www/straped/mufon/org/3477.html"],"Log Number":"","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"Not Provided","City":"Humble","Tags":"City","Longitude":"-95.262155"}