{"Viewing Distance":"Unknown","trends":["There has been one other sighting in St Johns","There were no other sightings in St Johns on or around April 18th 1998"],"divs":["Sighting DetailsMy friend and I were driving West between Concho, AZ and St. Johns, AZ. About halfway between, We stopped so my friend could pee. While stopped, we noticed 2 lights to the south moving parallel to the road, seeming to move together as if they were connected by a bar that appeared to be diagonal to the horizon. One light at each end. No blinking lights or anything that resembled an airplane. There was no sound. It seemed to be moving slowly. As it moved along side us, it would move forward then suddenly dart backward, both lights maintaining the same distance from each other diagonally. It kept doing this over and over. It would dart forward then dart backward about half the distance it had moved forward. It seemed to be very big, although how big, I couldn't say. It also seemed to be very low. It was right on top of the horizon from our perspective. It moved past us a little so we got back in the car and drove with it. It stayed along side us for probably about a minute while we drove then suddenly darted across the road in front of us and sped away so fast that within about a second it was no longer visible."],"Sighting Duration":"00:02:00","Weather Factors":"Unknown","Summary":"two lights appearing to be linked diagonally moving in tandum","Object Flight Path":"Path with directional change","Object Features":"Unknown","Log Number":"US-01102012-0015","City":"St Johns","Longitude":"-109.46302","Object Shape":"Unknown","Region":"Arizona","Date Submitted":"01/10/2012 06:40 UTC","Latitude":"34.510176","Case Number":"34770","map":"<A HREF = \"http://maps.google.com/maps?q=34.510176,+-109.46302(34770)&iwloc=A&hl=en\"> mufon case (34770) map </A>","Country":"United States","Source":"MUFON","Date of the Event":"04/18/1998 10:30 UTC","files":["/var/www/straped/mufon/html2text/34770.html.txt","/var/www/straped/mufon/org/34770.html"],"Tags":"City","Disposition":"Unresolved"}