{"City":"Cheyenne","Log Number":"US-01102012-0021","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","trends":["There have been 17 other sightings in Cheyenne","There were 3 other sightings in Cheyenne on or around January 10th 2012","This sighting has never been favorited.",""],"Tags":"City","Case Number":"34776","Object Shape":"Circle, Saturn-like, Star-like","Object Features":"None","Longitude":"-104.805389","map":"<A HREF = \"http://maps.google.com/maps?q=41.146254,+-104.805389(34776)&iwloc=A&hl=en\"> mufon case (34776) map </A>","files":["/var/www/straped/mufon/html2text/34776.html.txt","/var/www/straped/mufon/more/34776_submitter_file1__uforightsideofVaporTrail.jpg","/var/www/straped/mufon/org/34776.html"],"Sighting Duration":"00:20:00","Latitude":"41.146254","divs":["Sighting DetailsI was at work. I went out on the West loading Dock. I noticed A jet with a long vapor Trail aound 9:50AM. Right beside it was this white (I would say a craft of sorts). I watched it for about 10 min off and on. It looked like a star at night (like Saturn but not has bright or big. It did not glimer like a Jet window would in the sun light. When I first saw it, I thought it was a Jet. I believe it was higher than the jets that I saw. The sky was a clear day bright blue. I do not beleive it was a ballon, We at times launch them for fun. This object did not wave like a ballon does. Looked like about half the size of one of the Jets. I used 7' fence post to see if it was moving it was not. I called someone over I work with, when I pointed to it He also saw it. Then I got someone in the Store, He also saw it too. I left my job for a short break in my truck. When I got back 15 min later it was gone. I believe I saw a craft that was not man made. I was very excited to see something you do not see everyday Photo Note: I took a photo with a cell phone 2 mp really does not look very good or even there"],"Source":"MUFON","Object Flight Path":"Stationary","Summary":"White Star seen Hovering West of Cheyenne, Wy - With two jets passing by at 10 AM","Date Submitted":"01/10/2012 08:41 UTC","Date of the Event":"01/10/2012 09:50 UTC","Region":"Wyoming","Viewing Distance":"Unknown"}