{"Weather Factors":"Unknown","Log Number":"US-01102012-0023","files":["/var/www/straped/mufon/html2text/34778.html.txt","/var/www/straped/mufon/org/34778.html"],"Sighting Duration":"Undisclosed","Object Features":"None","Latitude":"37.811756","Longitude":"-89.020124","Region":"Illinois","Tags":"City","Object Shape":"Triangle","Country":"United States","Date Submitted":"01/10/2012 09:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.811756,+-89.020124(34778)&iwloc=A&hl=en\"> mufon case (34778) map </A>","Date of the Event":"01/10/2012 06:30 UTC","divs":["Sighting Details I was driving through town (three blocks from my house) when I noticed some lights that seemed to be very low. My first thought was an airplane but then I saw that it was a triangle shaped object. I was on a side street, so I stopped the car to take a better look. I could see a distinct triangle shape, with three light on the bottom of the object. The lights were white, red, and green, and the object itself was a dark black. Even though it was night I could still see the outline and the fact that it was a solid object. It was flying from north to south, and moving kind of slowly. I was excited about seeing it and I do remember just being in awe over how it looked. I did look at the time on my cell phone and it was exactly 6:30 pm. I watched it until 6:32 until I lost sight of it. I came straight home afterwards and a friend sent me a text saying that she had just heard on her scanner that a military helicopter was in trouble and making an emergency landing at our airport. (About 4 miles from my house) The scanner reported that the military helicopter had 3 people aboard, and was having engine trouble. (it landed safely) The helicopter flew directly over my house in route to the airport, and I thought it was odd that this happened right after I had spotted the triangle object."],"Disposition":"Unresolved","City":"Herrin","Summary":"While driving through town I noticed very low lights so I slowed down to look, and then saw it was a triangle shaped object.","Source":"MUFON","trends":["There has been one other sighting in Herrin","There were no other sightings in Herrin on or around January 10th 2012"],"Viewing Distance":"Unknown","Case Number":"34778","Object Flight Path":"Straight-line path"}