{"Disposition":"Unresolved","Viewing Distance":"Over One Mile","trends":["There have been 3 other sightings in Trout Lake","There were no other sightings in Trout Lake on or around December 31st 2011"],"Date of the Event":"12/31/2011 10:00 UTC","Longitude":"-121.521057","Sighting Duration":"Undisclosed","Date Submitted":"01/11/2012 12:25 UTC","files":["/var/www/straped/mufon/html2text/34785.html.txt","/var/www/straped/mufon/org/34785.html"],"Case Number":"34785","Object Features":"Unknown","Country":"United States","Object Shape":"Flash","Latitude":"46.001033","Source":"MUFON","City":"Trout Lake","Region":"Washington","Weather Factors":"Unknown","Log Number":"US-01112012-0006","divs":["Sighting DetailsMy husband and I were outside at about 10pm on New Years Eve just looking at the stars in what happened to be a completely clear sky that night. My husband was the first to notice it, and he quickly pointed out a red-orange orb hovering above the trees probably at least a mile from where we live. The object hovered in the same area for a few moments and than began to quickly flash from one bright color to another. I dont remember the exact sequence of the colors, but I do remember that it was quite bizarre and unlike anything I had ever seen. It was not the typical blinking of lights commonly displayed by aircraft. We were only able to watch the object for a few moments before it disappeared behind the trees and we lost sight of it. This sighting was entirely different than a UFO we had observed a few years prior in the Vancouver, WA area where there were three red lights in a triangular formation hovering directly above our vehicle. It was about 9:30pm, and we were driving on a country road with no other vehicles around at the time of this sighting. We literally stopped directly under the object which was no more than 100-200 yards above us. As soon as we stopped the UFO ascended more quickly than I have ever seen anything move in my life. The object was completey silent the entire time."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.001033,+-121.521057(34785)&iwloc=A&hl=en\"> mufon case (34785) map </A>","Object Flight Path":"Stationary,Other","Summary":"Red-Orange Orb hovered in the clear sky for a minute than began flashing different colors.","Tags":"City"}