{"divs":["Sighting DetailsRight after a Christmas Party at school some of us were leaving, just a few friends and me stayed longer. We sat down to the ground. They started to talk, while I've focused on this beautiful night sky. I remember this night as it was yesterday. I've always watched the sky and I am into Astrophysics since I'm alive. I know the nightsky and am easily able to tell what lights are stars, which ones are satellites, aircrafts, etc. I saw a bright light. First I thought it was a satellite, but it was even brighter than those I've seen before. It hasn't moved at all and there wasn't any sound. I kept focusing on that light. I just wanted to know where it came from and what it was. Suddenly it started to get brighter, maybe thicker. I started to feel strange. I coulnd't think anything. There was something like a compression in my ears. It didn't hurt and I didn't feel uncomfortable at all. I tried to turn over to my friends, but I couldn't. It felt like anything wanted me to watch. Maybe it was myself, somehow. So I kept looking. This bright object suddenly splitted into 3 smaller starlike ones. They were obviously taking positions. After a few seconds it seemed like they'd reached the final form. It was a triangle. I can not tell, if it was one big objects or 3 small ones. I prefer saying it were multiple objects. They abruptly flew away with such high speed, that I'm totally sure, that this thing, whatever it was, wasn't human technology. After this encounter, I sat up and took a look at my friends. They were sitting about 3 meters far away on a bench. I asked them if they saw the sky and a big bright 'star'. They negated and told me they were inside for about 2 minutes and have told me that before. I can't remember, I couldn't here them. It was one of my strangest encounters and though it's been a few years since that night, I remember everything very clearly. I have never told anyone before. I hope that someday I might get an answer for all these things I've seen."],"Date Submitted":"01/11/2012 09:11 UTC","Object Features":"Unknown","trends":["There have been no other sightings in Schwalmtal","This sighting has been favorited 1 time."],"Disposition":"Unresolved","Longitude":"6.27939","Country":"Germany","map":"<A HREF = \"http://maps.google.com/maps?q=51.21649,+6.27939(34780)&iwloc=A&hl=en\"> mufon case (34780) map </A>","Viewing Distance":"Unknown","Case Number":"34780","City":"Schwalmtal","Source":"MUFON","Tags":"City","Log Number":"DE-01112012-0001","Date of the Event":"12/22/2003 08:00 UTC","Summary":"One big bright obejct splitting into 3 smaller starlike ones","Object Shape":"Star-like, Triangle","Region":"Nordrhein-Westfalen","Weather Factors":"Unknown","Sighting Duration":"00:08:00","files":["/var/www/straped/mufon/html2text/34780.html.txt","/var/www/straped/mufon/org/34780.html"],"Latitude":"51.21649","Object Flight Path":"Hovering then path"}