{"Object Flight Path":"Path with directional change","Summary":"2 CIGAR SHAPED UFO WITH APPARENT BLACK HELICOPTER","Country":"United States","divs":["Sighting DetailsAround 6pm January 11, 2012 I witnessed something unknown in the sky. I was leaving my apartment to get gasoline for my car. As I was walking out of the building I glanced left towards the sky and saw something insane. In the sky there were 2 huge cigar shaped objects. They were like huge skinny rectangle objects. Both had what looked like 5 flashing orange lights coming from square windows or something or the sorts. The one cigar shaped ufo was slowly turned round and round counter clockwise. The cigar shaped ufo to the right of the first one seemed to move towards the rotating ufo and then it crossed a path in front of it. Now what appeared to be a black helicopter was hurrying around both of the ufos. I have no idea what it was doing? Inspecting? The whole event of my witnessing this took place under 30 seconds because I ran back to the apartment to have my mother and son come out and look at the phenomenon. I was scared to death! As soon as we all came outside to look everything was gone. Last week I witnessed a star light object hovering in the sky in Peoria, IL. Is there something going on in the Illinois? Anyone else from Illinois witness anything bizarre in the sky?"],"Region":"Illinois","Log Number":"US-01112012-0017","Date Submitted":"01/11/2012 07:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.703648,+-89.407312(34797)&iwloc=A&hl=en\"> mufon case (34797) map </A>","Case Number":"34797","Tags":"City","Latitude":"40.703648","City":"Washington","Sighting Duration":"00:00:30","Source":"MUFON","Object Features":"Patterned Surface","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 5 other sightings in Washington","There were no other sightings in Washington on or around January 11th 2012"],"Date of the Event":"01/11/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/34797.html.txt","/var/www/straped/mufon/org/34797.html"],"Longitude":"-89.407312","Object Shape":"Cigar"}