{"map":"<A HREF = \"http://maps.google.com/maps?q=42.431967,+-82.964196(34799)&iwloc=A&hl=en\"> mufon case (34799) map </A>","trends":["There have been 2 other sightings in Harper Woods","There were no other sightings in Harper Woods on or around January 11th 2012"],"Log Number":"US-01112012-0019","Source":"MUFON","Viewing Distance":"Over One Mile","Tags":"City","Object Shape":"Circle, Sphere, Star-like","Latitude":"42.431967","divs":["Sighting DetailsOn Jan. 11, 2012 I went into my backyard with my dogs at 6:52am so they could do their business. I always look up into the sky looking for planes or possibly a ufo. I never was lucky enough to see anything until this morning. I was looking in the eastern sky and saw what I thought was a star at first. Then I noticed it was moving in a southeast direction. So I thought it was a plane, but it didn't have any port or starboard lights. It had been moving for about 6 to 7 seconds when all of a sudden it changed into a very big glowing orb. The size change was about 20 times its orignal size when I first saw it. It was still heading southeast when it disappeared. The whole sighting lasted 15 - 20 seconds. I kept watching for a while after that. But it never re-appeared. It was the most exciting expirence I've ever had except for when I was in the Navy in the South China Sea Gulf of Tonkin in 1973. That's when I saw my first ufo. I had been trained to spot all kinds of planes and I was on watch between 00:00 and 04:00. I spotted a bright white light doing a zig zag pattern then it shot across the sky zig zaged again and shot back where it had started and then shot off into space and disappeared. That's why I know what I saw was not a plane on Jan. 11, 2012"],"City":"Harper Woods","Date Submitted":"01/11/2012 10:45 UTC","Object Flight Path":"Straight-line path","Longitude":"-82.964196","Weather Factors":"Unknown","Date of the Event":"01/11/2012 06:52 UTC","files":["/var/www/straped/mufon/html2text/34799.html.txt","/var/www/straped/mufon/org/34799.html"],"Summary":"I saw a star like object at first then it became a large glowing orb","Region":"Michigan","Object Features":"Unknown","Case Number":"34799","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States"}