{"Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Object Shape":"Circle, Triangle","Source":"MUFON","Longitude":"-122.327031","Case Number":"34796","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around January 10th 2012"],"Latitude":"47.61115","City":"Seattle","Disposition":"Unresolved","Date of the Event":"01/10/2012 07:50 UTC","files":["/var/www/straped/mufon/html2text/34796.html.txt","/var/www/straped/mufon/org/34796.html"],"Summary":"3 lights in triangular shape moved from east to west making no sound","Sighting Duration":"00:02:00","Region":"Washington","divs":["sighting detailsat approximately 7:50pm on 01\\10\\12 from my backyard in the mt. baker neighborhood of seattle, i witnessed three lights in the shape of a triangle flying in a straight path from east to west. i live right in the path of sea-tac airport, so i am well familiar with planes of all types flying overhead, at all altitudes. this was definitely not a plane. i was unable to determine whether it was one triangular shaped object with lights on all 3 points, or 3 smaller objects flying in that formation. i will say, however, that right as it was leaving my field of vision it appeared one of them was separating from the other two. there was no noise whatsoever. the object(s) was moving far faster than any balloon or chinese lantern could, but nowhere near as fast as a meteor or shooting star. it took about 1-2 minutes to travel from directly overhead to the horizon (i lost sight of it when it went past beacon hill). late in 2011 (i dont remember the exact date) i witnessed a smilar event, except it was moving from north to south. i am hoping others witnessed this event and let me know, first of all so i know im not crazy, and secondly because it definitely seems to me like something is going on here in seattle. i was quite jittery after seeing this, and truly wish i had been able to take a video of the event."],"Log Number":"US-01112012-0016","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Date Submitted":"01/11/2012 06:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.61115,+-122.327031(34796)&iwloc=A&hl=en\"> mufon case (34796) map </A>","Object Features":"None"}