{"files":["/var/www/straped/mufon/html2text/34802.html.txt","/var/www/straped/mufon/org/34802.html"],"Weather Factors":"Unknown","City":"Samsula-Spruce Creek","Tags":"City","Viewing Distance":"21-100 Feet","Source":"MUFON","Latitude":"29.011344","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-81.056827","trends":["There have been no other sightings in Samsula-Spruce Creek","This sighting has been favorited 1 time."],"Disposition":"Unresolved","Date of the Event":"01/12/2012 12:00 UTC","Region":"Florida","Log Number":"US-01122012-0003","Sighting Duration":"Undisclosed","Object Shape":"Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=29.011344,+-81.056827(34802)&iwloc=A&hl=en\"> mufon case (34802) map </A>","Date Submitted":"01/12/2012 01:20 UTC","Object Features":"Patterned Surface, Other","Country":"United States","Summary":"Driving home and it flew right over the car. Less than 50 feet from the ground.","divs":["Sighting DetailsI was traveling from I75 and got on SR 44 in the Deland, FL area heading east to go home to Ponce Inlet, FL. I had just gotten off the phone with my partner, and past through a green light where I notice a ploiceman parked off the road where SR44 crossed it. He was off to the left, with his lights off. the light was gree, so I proceeded. Around the 1 st bend of the road I noticed 3 deer all looked like does. Then the raod curved a couple of time and became straightened. It has been only about 2 mins since I crossed the green light area. I on approach to the light I was going 70mph but slowed down to 60 MPH when I saw the police. Then sped up to 70mph. So when I past the light my radio was off windows up no sound. This object flew right over the driver's side of the car. Less than 50 feet off the ground . It was moving about 80MPH . I noticed the large white light in the back of it, (it was not that bright) and it had a large red light on top. It was black or very very dark grey, I noticed it cause the moon shined on it when it turn a little in front of me, by this time it was less than 50 yard from the card keeping distance. The side of it looked like a bunch of entangled piping, it was 30ft no mor than 50ft long cylandracal cigar shape, ther was nothing smooth on the surface from what I saw. It sped up and moved to the left side of the road and then the right. Soon it was hovering over the woods to my right and then it moved quickly to the left side of the car again. Then it looked as though it slowed down and was heading back to me, then it went to the left again heading to the city and it hoovered there for a moment and crossed the road to the right. By this time it was right over the treetops. It looked as though it was about to land. i could not follow it any longer."],"Case Number":"34802"}