{"Weather Factors":"Unknown","Object Shape":"Cigar","Date Submitted":"01/12/2012 03:56 UTC","Sighting Duration":"Undisclosed","Country":"United States","City":"Ridgeland","Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=32.479041,+-80.982462(34806)&iwloc=A&hl=en\"> mufon case (34806) map </A>","files":["/var/www/straped/mufon/html2text/34806.html.txt","/var/www/straped/mufon/org/34806.html"],"Object Features":"Undisclosed","Disposition":"Unresolved","divs":["sighting detailsi was wide awake and walking out to my vehicle to respond to a structure fire at 1:23am and noticed a very large slow moving cigar shaped craft that was moving very slow right above the tree tops, no more than 300 to 400 feet away from me and made no sound. the sky was clear and the moon was almost full, so when i grabbed my night vision gen3 monocle it was hard to see the craft clearly, but i could see no wings only the fuselage. the body of the craft or fuselage was abnormally long and appeared to be at least twice the length of any aircraft i've ever seen and i've dealt with many different aircraft as i was once in the usaf's crash rescue team. it did not have standard aircraft light markings, its lights seemed backwards... the red blinking\\pulsating light was on the front and it had 2 white dimmer lights on the rear. within a minute it was across my yard and into a very large open field area and as i left my house en route to the emergency call i looked to my left across the field and it was gone. it should have been very visible at the slow speed it traveled which was almost a hover or landing speed. i have seen many military aircraft over the years and emergency medical life flights come over my house very low, but nothing like this and you can hear them for miles, this thing was silent. also no other aircraft in the area."],"Case Number":"34806","Summary":"cigar shape slow moving above tree tops","Latitude":"32.479041","Source":"MUFON","Object Flight Path":"Straight-line path","Tags":"City","Date of the Event":"01/12/2012 01:23 UTC","trends":["There has been one other sighting in Ridgeland","There were no other sightings in Ridgeland on or around January 12th 2012"],"Longitude":"-80.982462","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-01122012-0007"}