{"Source":"MUFON","Date of the Event":"01/09/2012 09:30 UTC","Disposition":"Unresolved","Viewing Distance":"Unknown","Country":"United States","Date Submitted":"01/12/2012 03:26 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Log Number":"US-01122012-0015","files":["/var/www/straped/mufon/html2text/34815.html.txt","/var/www/straped/mufon/org/34815.html"],"Weather Factors":"Unknown","City":"Tulsa","Sighting Duration":"Undisclosed","Region":"Oklahoma","Case Number":"34815","divs":["Sighting DetailsApproximately 9:30p.m. traveling East bound Hwy 40. I noticed a pulsating red light that I thought was an airplane. Moving south to north. I did no more than blink. The object had moved straight backward along what seemed to be a straight line. This object was directly forward of my line of sight while looking out the windshield first. After it moved, I had to turn my head where my chin was over my left clavicle. The object hovered for a split second. It then moved toward me covering what would seem a great distance in a matter of seconds. It banked toward the hwy crossing the river. Approaching me, I hunched over the steering wheel and slowed down because it was moving fast. I saw a black triangular shaped craft. It was this shape that the red and blue lights made. It was non-reflective to any external lighting from the highway lights. The lights did not shine but were of a softy glow. I got such a adrenalin rush to what I was seeing that tears came to my eyes. I had to tell someone. I looked around and there were no other cars or trucks around me or coming from the other direction. I almost was as if this thing knew it. And was not afraid to show itself to me. I lost track of it because it flew directly over my vehicle."],"Summary":"Black triangle shape with two red and 1 blue light, non-reflective surface","Latitude":"36.156762","map":"<A HREF = \"http://maps.google.com/maps?q=36.156762,+-95.984745(34815)&iwloc=A&hl=en\"> mufon case (34815) map </A>","Longitude":"-95.984745","Object Shape":"Triangle","Tags":"City","Object Features":"Unknown","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around January 9th 2012"]}