{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-01122012-0011","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around January 11th 2012"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Washington","Date Submitted":"01/12/2012 06:55 UTC","divs":["sighting detailsi live on a lake under a set of mountains just west of mt. baker south\\southeast of bellingham washington reed lake\\cain lake. i walked out to my porch which i frequent often, and it faces west looking over the lake up to the mountains. on the top of the mountain just at tree line were three balls of light, clearly larger then any star. being a helicopter pilot, and knowing the specific routes flying over my house i new these lights were not a plane. also i no for a fact there is no tower or structure that would be on top of the mountain there... the lights were in a triangle formation for about a minute or two. then they slowly formed a straight line with a little space in between the three. blinked three times, or pulsated three times and dissapeared... i was left with a amazing feeling of joy and wonder. during the event i was stuck stareing at the lights, not able to break away and grab my camera which would of been the first thing i normally would of done? after i came inside and told my girlfriend hesitantly. she could tell i felt wierd."],"City":"Bellingham","Country":"United States","Object Shape":"Triangle, Other","Summary":"three balls of light in triangle formation, then floated into straight line and pulsated.","map":"<A HREF = \"http://maps.google.com/maps?q=48.66419,+-122.324324(34810)&iwloc=A&hl=en\"> mufon case (34810) map </A>","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/34810.html.txt","/var/www/straped/mufon/org/34810.html"],"Date of the Event":"01/11/2012 07:28 UTC","Object Features":"None","Longitude":"-122.324324","Case Number":"34810","Latitude":"48.66419","Disposition":"Unresolved","Source":"MUFON"}