{"Log Number":"ZA-01122012-0012","Source":"MUFON","Tags":"City","trends":["There has been one other sighting in Westville","There were no other sightings in Westville on or around January 12th 2012"],"City":"Westville","Object Flight Path":"Straight-line path","Summary":"Huge boomerang shape spotted just off angle of Saturn - witnessed by 2","Country":"South Africa","Disposition":"Unresolved","Region":"KwaZulu-Natal","divs":["sighting detailsat about 7:30pm, i was standing on our deck (wooden structure)looking at venus low on horizon, and looked up and saturn was slightly to right of straight up. i called my wife dawn to have a look as they were so bright. as i pointed out saturn, we both saw the materialisation of a very large boomerang shaped flying vehicle. i suspect it to have been at a height of 25000 feet (i served in airforce, so i have a good eye for heights). if my estimate is right, then the vehicle must have been in excess of 5 kilometers wide! it was definitely not an aircraft. the vehicle was surrounded in a luminous white light, and the material of the vehicle was not easily identifiable - just looked dark silvery (could be the low light and height). it had blue and red lights showing two blue and one red. it faded into sight (the air was very clear - not a cloud or vapour in sight), and moved at a speed i'd judge as about 1,500 km\\hour for a distance of approximately 75 kilometers, then faded out to nothing. my wife could not believe her eyes. i have seen other craft before over the years. this observation was too quick for me to get a camera to photograph it, so the report is only verbal. i commented earlier to my wife that the air had a peculiar vibration, but cannot say if the two were connected in any way - it was just strange that there was this vibration in the air that was quite distinct for about an hour before our sighting."],"Latitude":"-29.791258","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/34811.html.txt","/var/www/straped/mufon/org/34811.html"],"Date Submitted":"01/12/2012 02:38 UTC","Longitude":"30.913084","Case Number":"34811","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date of the Event":"01/12/2012 07:30 UTC","Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=-29.791258,+30.913084(34811)&iwloc=A&hl=en\"> mufon case (34811) map </A>","Object Shape":"Boomerang"}