{"Case Number":"34822","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Summary":"Second Encounter after April 1996 Nevada Encounter...Some Months Later","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unresolved","Longitude":"-116.415519","Source":"MUFON","Date Submitted":"01/12/2012 11:32 UTC","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/34822.html.txt","/var/www/straped/mufon/org/34822.html"],"divs":["Sighting DetailsAfter the 1996 April Nevada encounter making alien eye contact not knowing what had happened truly made me wonder and look up at the skies in a remarkably different way. I had become one of they whom actual know, not they whom wonder... Yet everyone in my life whom I told of the event which were few Id actually come to share it with, believed me because they know the true kind of person I am. Yet, seeing is believing. They can hear words or read text, but seeing is more than believing. Its not only feeling the truth, its knowing the truth. It is just so hard for people to understand what I truly saw that night at 11:00 pm to 8:30 am. unless they were me or I had digital video. What I still dont understand is how the night passed to day upon that 3 minute hill... I lost 9 hours of real time while I was driving and observing this craft. It boggles me still and I wonder how is it possible. How do they use or manipulate time and space spinning in one spot to gather the energy to excel at speeds greater than thought. Yet the simple fact is that all I know is I was driving down a 3 minute hill and night turned to day when the craft spun before it took off at 45 degrees and exited our atmosphere. So, some months had passed all all went to rest. I had this fireball inside me it seemed. I just wanted to tell someone that would take my experience and use it for some kind of truth or scientific research. I was afraid, for years I was afraid to speak or even let anyone know that the anonymous report I made was even me. Heck, I had a kid to raise and being a single father I had a lot to lose. I was writing music getting global distribution and I was afraid. Not only that but its not something you want your employer to find out. You know, what if they think your crazy or something and terminate you while trying to raise a kid all on your own. Then later finding out the report I filed as anonymous was published in UFO MAGAZINE, I was really scared. My uncle had found it and only in knowing my story revealed it to my mother whom gave it to me. Thats how I found out. Not by any other means but the story. Its been several years now leading to this and I have decided to file these following reports and this is one of them. It has been 15 years now since the 1996 encounter. This stuff is all over the web and I feel safer now to disclose this information...It was September at around 11:00 pm at night 1996. It was 5 months since Id seen the craft in that canyon. Id ever since been having these radical dreams. Dreams of people, places, events, catastrophes, even seeing through animals eyes hunting. I dreamed a lot before but whatever happened to me multiplied it. I had no idea of what to think. Everything had seemed to go to rest though. There was a calm finally inside me. I was freed just to know. I had let go of it. My mind had let go and my heart. Then one night out of the blue... Yeah out of the blue... Im laying in bed at around 11:00 pm at night and all is silent in the streets. Im living near six mile canyon at the time. Im trying to get to sleep because I have to work in the morning. I hear this noise in the silence. Rattle tap tap whirl whirl ring wring beep beep beep Rattle Rattle...Its in the distance far about a quarter mile off. I didnt think much of it. I opened my eyes for a few seconds then closed them. Then it became louder and more apparent it was something different than Id ever heard. For some reason immediately I remembered the incident. It was right on my mind. The noise got louder and was maybe a few streets away. I thought, is that a clunker car? No, cars slow down and speed up I realized. This noise was turning street corners holding steady without slowing down nor speeding up at a very rapid speed. Then it was in my neighborhood. I recognized the streets it was turning and it was coming fast towards my location. Rattle Rattle tap tap beep beep beep rattle whirl beep whirl beep...It turned then onto my street. This thing wasnt slowing down what so ever turning street corners. Im still laying down quite frightened and my blinds are closed. My sons mom comes in from the living room and she knew the whole experience for what I had told her and she said What the heck is that? I replied, I dont know what it is but Im not looking at it! She answered Dont look at it! Whatever you do, dont look at it! Im going back in the living room! Screw this! She said. I laid there, it came right outside our bedroom window. It stayed for a few minutes. I felt paralyzed. I wanted to say something to her. I felt like I needed help. I could not move my mouth. I could not move my entire body. Rattle Rattle Tap Tap Whirl Whirl Beep Beep Beep...It had a hold of all my energy. As soon as I thought about the UFO I saw 5 months prior, I mean when that thought entered my mind...the thing took off...It went up every street it came down in a matter of seconds...and was gone. All that was left were dogs barking in the entire neighborhood...and I must have finally dozed off, and awoke to my alarm to go to work. I later thought maybe it was a probe or am I just crazy? But she heard it too, and so did the DOGS!!"],"Sighting Duration":"Undisclosed","Region":"Nevada","Country":"United States","Latitude":"38.80382","trends":[],"Log Number":"US-01122012-0021","Object Features":"Unknown","Date of the Event":"09/15/1996 12:00 UTC","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.80382,+-116.415519(34822)&iwloc=A&hl=en\"> mufon case (34822) map </A>","City":"Undisclosed"}