{"files":["/var/www/straped/mufon/html2text/34820.html.txt","/var/www/straped/mufon/org/34820.html"],"Country":"United Kingdom","Object Features":"Undisclosed","Region":"","Source":"MUFON","Longitude":"-1.939184","Viewing Distance":"Unknown","Log Number":"GB-01122012-0020","Weather Factors":"Unknown","Date Submitted":"01/12/2012 08:03 UTC","trends":["There have been no other sightings in Redditch, Worcestershire.","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=52.278842,+-1.939184(34820)&iwloc=A&hl=en\"> mufon case (34820) map </A>","Latitude":"52.278842","Object Shape":"Disc","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Summary":"a short tunnel of orange light","Date of the Event":"01/12/2012 06:40 UTC","divs":["Sighting Details I was on my way to visit a friend in my car,and was within 250 yards of our meeting venue he was sat in his car while stationary. I was travelling about 25mph and suddenly noticed this orange light in a clear night sky moving towards me at about 0640 hours. It caught my attention because of its colour and appeared to be a short beem or tunnel of light and was accompanied by a second same colour object both to the left of the upper section of my windscreen. At first site I thought it to be an aircraft,but the lights were dull orange and I live within 2 miles of a major airline and know the lighting mechanics of these It only lasted a 20 seconds as they came directly over the left of the vehical, and I was trying to strain to see and slowed down to veiw them without causing a danger to other traffic users,which on looking into my rear veiw mirror was 0 On meeting with my friend ,he immediatly spoke of what he saw from his parked vehical ,and noted that there were 4 object to his veiw, he was sitting at 90 degrese to the lights,parked in a church gateway and had a more pararamic view then I,he stated they had the colour of orange. The objects were not visable on contacting my friend as we were now looking into the direction they were moving and the street lighting obscured our veiw of the night sky. I reckon that they were travelling in a southerly direction,at a moderate speed."],"Sighting Duration":"Undisclosed","Case Number":"34820","Tags":"City","City":"Redditch, Worcestershire."}