{"Country":"United States","files":["/var/www/straped/mufon/html2text/34821.html.txt","/var/www/straped/mufon/org/34821.html"],"Sighting Duration":"00:01:00","Date Submitted":"01/12/2012 10:24 UTC","Disposition":"Unresolved","trends":["There have been 3 other sightings in West Melbourne","There were no other sightings in West Melbourne on or around December 31st 2011"],"Case Number":"34821","City":"West Melbourne","Longitude":"-80.67832","Summary":"a slient fire ball that went from east to west, about an hour later came back in same flight path from west to east and 45 minutes later on the same path opposite direction","Latitude":"28.046006","divs":["sighting detailson new years eve 2011 around 2045 i was enjoying a backyard campfire with friends. the sky was very clear and we are in the flight pattern for a flight school in the area, so there are always small planes flying. on this particular night i had not seen any planes, which i assumed was because of the holiday. i was sitting facing south, when in the corner of my eye i saw movement in the sky. i turned to look and there was a bright orange fire ball moving steadily and silently across the sky in an arch. it had no trail, no sound, no edges, and no changes, but it was glowing. i watched it until it went out of sight into the tree line. i didnt say anything to the friends i was with. i thought it was a chinese\\japenese lantern made somewhat like a hot air balloon, as i have seen on tv. i continued on with my evening and about 45 minutes later it was back, going in the same path opposite direction as before. this time i said something to the group, and we all agreed it look like a lantern. i am a firefighter, who lives by the kennedy space center and have never seen anything like this before. as the sister of a pilot i am always looking up in the sky, and any movement catches my eye. the eerie part of this was the lack of sound."],"Log Number":"US-01122012-0020","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Object Features":"None","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.046006,+-80.67832(34821)&iwloc=A&hl=en\"> mufon case (34821) map </A>","Object Flight Path":"Straight-line path","Date of the Event":"12/31/2011 08:45 UTC","Tags":"City","Object Shape":"Circle, Fireball"}