{"Weather Factors":"Unknown","Log Number":"US-01132012-0004","Object Features":"Dome","Longitude":"-114.183977","Object Shape":"Circle","Sighting Duration":"00:17:00","trends":["There have been 14 other sightings in Parker","There were no other sightings in Parker on or around January 12th 2012"],"Object Flight Path":"Hovering then path","City":"Parker","divs":["sighting detailsi was on a walk around the southern end of our rv park on jan 12, 2012. i know the exact time of this event because i timed it. i timed it because i just left the man that was hired to clean my carpet. i was waiting for it to dry. the exact time was 4:11 pm. sevral minutes later i ran into a friend and we chatted for 3-4 minutes (at most). i then continued on my walk. the total distance of this walk is a little less than 1\\2 mile. the route is fairly rectangular. as i was walking along the highway, i was hit by a very strong reflection in the sky off to the south west. i had completed about 80% of the distance of the route. i could see it was about 700-800 hundred feet above the river. it was silver with a dome that had brassy portholes on it. it was about 40-50 feet in diameter. it began to slide slowly to the south. i watched it for about a minute, maybe a few seconds longer before accelerated and disappeared. when i arrived back home, it was 4:33 pm. i was missing about 20 minutes. this is exactly one year from the date that i am missing at least 1\\2 hour on a routine drive into parker, az. this ufo matches the first abduction that has been uncovered through hypnosis in 1955 in new jersey and is covered more thoroughly in my blog."],"Case Number":"34826","map":"<A HREF = \"http://maps.google.com/maps?q=34.207678,+-114.183977(34826)&iwloc=A&hl=en\"> mufon case (34826) map </A>","Date of the Event":"01/12/2012 04:18 UTC","Region":"Arizona","files":["/var/www/straped/mufon/html2text/34826.html.txt","/var/www/straped/mufon/org/34826.html"],"Tags":"City","Country":"United States","Latitude":"34.207678","Summary":"I observed a silver colored UFO with dome and brass colored ports hovering over the Colorado River while on a walk around our RV park. I am missing 20 minutes of time.","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"01/13/2012 11:32 UTC","Source":"MUFON"}