{"divs":["sighting detailsas i drove east on us80 i noticed the object suddenly appear to the northeast and pulled over to observe it at the clive exit. it appeared to be triangular with the point downwards. it was black or dark colored and just hovered over what appeared to be empty mountain ranges. after observing it for 10 minutes i determined that it was hovering as its size and position relative to the horizon was unchanged. i then resumed driving east on 80 and after a few minutes i saw the color change to be blue\\white and seemingly larger. i could then see thge valley over which it seemed to be hovering and noticed a white factory building just to the west of where it hovered. i heard no sound when i pulled off to observe it and the highway was not busy so i was able to hear without any audible interference. this was a very strange thing to see as it was hovering at quite high altitude without and movement that i could discern for over 20 minutes. a few minutes (maybe 5) after i saw the color change to blue\\white, it was gone, although i was not looking at it when this occurred but was looking at it seconds before. when the color changed it looked larger or closer and the details where more clear and it looked like an upside down conical shape blueish in color with white highlights"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.708546,+-113.117482(34830)&iwloc=A&hl=en\"> mufon case (34830) map </A>","Weather Factors":"Unknown","Summary":"As I drove east on US80 I noticed the object suddenly appear to the northeast and pulled over to observe it at the Clive exit","Case Number":"34830","Source":"MUFON","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/34830.html.txt","/var/www/straped/mufon/org/34830.html"],"City":"Clive","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Clive","This sighting has never been favorited."],"Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"01/13/2012 08:20 UTC","Log Number":"US-01132012-0008","Disposition":"Unresolved","Tags":"City","Date Submitted":"01/13/2012 01:54 UTC","Object Features":"Other","Region":"Utah","Object Flight Path":"Stationary","Latitude":"40.708546","Country":"United States","Longitude":"-113.117482"}