{"Country":"United States","Region":"South Carolina","Tags":"City","Latitude":"34.051966","trends":["There have been 22 other sightings in Columbia","There were no other sightings in Columbia on or around January 1st 2012"],"Object Features":"Unknown","Object Shape":"Circle","City":"Columbia","Log Number":"US-01132012-0011","Source":"MUFON","Object Flight Path":"Path with directional change","Date Submitted":"01/13/2012 06:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.051966,+-81.123649(34833)&iwloc=A&hl=en\"> mufon case (34833) map </A>","Weather Factors":"Unknown","Summary":"I thought it was a balloon at first, it was VERY high in the sky and moved erratically.","files":["/var/www/straped/mufon/html2text/34833.html.txt","/var/www/straped/mufon/org/34833.html"],"Disposition":"Unresolved","Case Number":"34833","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"01/01/2012 08:30 UTC","divs":["Sighting DetailsA little after 8:30 p.m. on January 1st, 2012 I was looking out my window, watching fireworks. I noticed a strange object in the sky. At first I thought it was a balloon with a light or fire in it because of how it was moving. Then it struck me that no balloon could have a fire in it as this one seemed to have. It was a steady, yellow light with a reddish corona around it. It had a red corona around it. From my view, it passed behind some tree branches, so the corona was likely enhanced by those, but the corona was present before it moved behind the tree. It moved from East to West in the sky and seemed to be in the direction of Fort Gordon, though I do not believe it was far enough away to be over the base. I looked around to see if anyone was near me who could also see it, but no one was outside at the moment. It suddenly picked up with incredible speed and moved out of line of sight because my roof was in the way. I went out back of my condo to see if I could view it anymore and the object was gone. It did not move in a straight line, but more like a balloon in the wind or like a dragonfly's flight path. It was erratic and jumpy, though always moved in the same general direction, East to West. The object did not move like any man made aircraft."],"Sighting Duration":"Undisclosed","Longitude":"-81.123649"}