{"Disposition":"Unresolved","Latitude":"39.958695","trends":["There have been no other sightings in Broomall","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Case Number":"34831","Tags":"City","Object Features":"None, Patterned Surface","divs":["Sighting DetailsI had pulled up in front of my dentist's office, where I had an appointment for a cleaning. At exactly 9:15am, I opened my door, and, as I began to rise from the seat, looked up because there was an SUV next to me. I saw the cylinder immediately. The sky was bright blue and relatively cloudless, as strong winds were blowing that day, and it had hit a period of momentary clearness where I was. Because I had seen a cylinder in October, I was reluctant to admit that one was intruding on the day again, but quickly had to. Absolutely smooth \"fuselage\", pure white, with a thick black band around the mid-section. (The one I had seen in October had the band at the first third of the body.) Again, I heard no sound, although I was mindful of wind gusts all around. Bob Gardener and I will be speaking soon about the October sighting...and a couple of uncomfortably odd things that have happened to me since...but he has taken on another's case load, and I understand he is swamped. However, I did email him briefly just now that I would be filing this. My feeling on seeing this one was, as in the first one, exhasperated, again because I was in a hurry to get a list of things done, and knew this would have to be addressed. However this time, there was a definite tinge of apprehension. I lost sight of the object when it had flown to such a distance that I couldn't see it."],"Object Shape":"Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=39.958695,+-75.351153(34831)&iwloc=A&hl=en\"> mufon case (34831) map </A>","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-01132012-0009","Object Flight Path":"Straight-line path","Longitude":"-75.351153","Date of the Event":"01/13/2012 09:15 UTC","Date Submitted":"01/13/2012 02:19 UTC","Summary":"White cylinder with broad black band around mid-section; seemed slightly slower than airplane; straight line flight","Region":"Pennsylvania","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","City":"Broomall","files":["/var/www/straped/mufon/html2text/34831.html.txt","/var/www/straped/mufon/org/34831.html"]}