{"City":"Akron","Date of the Event":"01/13/2012 09:15 UTC","Weather Factors":"Unknown","Country":"United States","Date Submitted":"01/13/2012 10:04 UTC","Object Shape":"Sphere","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/34837.html.txt","/var/www/straped/mufon/org/34837.html"],"Tags":"City","divs":["sighting detailsreporting from west akron ohio. event occured at 9:15pm on january 13, 2012. it is completely overcast here and there is a very low cloud ceiling this evening. i was in my mothers home and saw out of her window facing east an unusual colored orange ball in the sky about a hundred feet up and in front of her home. i dashed out the door to get a better look and saw the orange ball in the sky on a steady path, blinking. it took off to the north\\ northeast and followed a steady path. as i was watching the orange blinking light in the sky, about fifty feet in front of me and coming out from the middle of two condominium buildings, an orange orb came into view, about six to ten feet off the ground. travelling at about twenty miles per hour. it went up into the sky when it reached the edge (about fifteen feet away) of a garage and took what looked like a path behind the first ball. it did not blink but when it got up in the sky, i would say at about a thousand feet, it let off a small star from its right side. it had a white glow around it and an orange color inside. they ascended over portage country club. both objects, for a moment, were visable together on the same path then disappeared into the cloud cover. i was quite close to the second orb, about fifty feet away. the combined sightings lasted approximately three minutes. i am a lifelong ufologist."],"Region":"Ohio","Log Number":"US-01132012-0015","Latitude":"41.101442","Longitude":"-81.574761","Summary":"I saw an orange light out of the window...went outside to see a blinking orange light in the sky and saw an orange orb come from between two buildings fifty feet away just above ground level , and rise into the sky behind the orange light","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around January 13th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.101442,+-81.574761(34837)&iwloc=A&hl=en\"> mufon case (34837) map </A>","Object Features":"None","Case Number":"34837"}