{"Source":"MUFON","Object Features":"Other","Viewing Distance":"20 Feet or Less","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=31.973529,+-99.892943(34832)&iwloc=A&hl=en\"> mufon case (34832) map </A>","trends":["There have been no other sightings in Lopeno, Texas","This sighting has never been favorited."],"Date Submitted":"01/13/2012 04:24 UTC","Latitude":"31.973529","Region":"Texas","Tags":"City","divs":["Sighting DetailsOn a Friday night in the Fall of 1964, the witness, a Spanish teacher at Zapata High School, left the school shortly after midnight following a football game. As he was responsible for handling the funds generated by the concession stands, he remained at the school counting money until around midnight. Traveling in his 1990 Ram Charger truck, the teacher drove south-southeast along U.S. Highway 83, headed toward an RV park where he lived, located about 30 miles from the high school. He had driven approximately 17 miles and was near coordinates 26.755153, -99.113982, about 3 miles north of Lopeno, Texas. The time was approximately 1 a.m. In his rear view mirror, he noticed a bright light swooping down out of the sky and moving toward his vehicle. The object looked like a slightly curved row of bright, multicolored flashing lights - and \"sparks of light\" or fire were emanating from underneath the object as it moved toward his position. The witness' first thought was that it was an airplane in distress, and that it was going to crash into him. He slowed his vehicle down to around 50 mph. He noticed 3 or 4 other vehicles zoom past him as if in haste to leave the area. In moments, the object was rapidly approaching his truck. Frightened, the witness came to a full stop and turned his engine off, at which point the object also stopped and hovered about 10 feet directly above the hood of the truck, where it remained for approximately 30 seconds. During this time, the witness said he saw a slightly-curved row of approximately ten large lights, evenly spaced, each perhaps 24 inches in diameter. The lights were very bright and were blinking on and off in a regular pattern. The predominant colors were orange, blue, and white. The bright lights made it difficult to see the shape of the rest of the object, which was indistinct. There were no other surface characteristics and there was absolutely no sound. The witness was extremely scared and nervous, but after the object hovered above his hood for about 30 seconds, it suddenly zoomed straight up into the sky and was gone in a second. The speed at which it moved was extremely fast. The witness found no physical traces on his vehicle or person, and suffered no ill effects other than momentary fear. He observed no electromagnetic anomalies. There were no other witnesses. The witness traveled this same route every work day until 1997 and never had any other sightings. He told nobody about it, except for his wife, because he was afraid of being ridiculed."],"Weather Factors":"Unknown","Summary":"18-ft.-diameter object with semi-circular arrangement of blinking lights swooped down, followed truck, and hovered 10 feet above hood.","Country":"United States","Date of the Event":"10/07/1994 01:00 UTC","Case Number":"34832","Log Number":"US-01132012-0010","Longitude":"-99.892943","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path then hovering","City":"Lopeno, Texas","files":["/var/www/straped/mufon/html2text/34832.html.txt","/var/www/straped/mufon/more/34832_submitter_file1__zapata.jpg","/var/www/straped/mufon/org/34832.html"],"Sighting Duration":"00:15:00"}