{"Object Flight Path":"Undisclosed","Object Shape":"Cigar","Longitude":"-86.573577","Disposition":"Unresolved","Source":"MUFON","City":"Undisclosed","Date of the Event":"01/14/2012 03:41 UTC","Latitude":"35.522691","Region":"Tennessee","Date Submitted":"01/14/2012 07:07 UTC","Country":"United States","Object Features":"Undisclosed","Sighting Duration":"00:05:00","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsI was right around the corner from my house at a little market when I first spotted this object. It looked like it was barely moving and lower than where a plane would be. I jumped in my car and drove home fast, ran in grabbed my camera and yelled to my husband hurry come look at this. It made no sound what so ever, it looked very white and cigar shaped, when I first spotted the object it was flying much lower and extremely slow if at all, then it went straight up, and continued to move slow (enough time for me to capture this video) and then took off in about 2 sec across the sky out of my vision. Later on we heard what sounded like a jet or 2 heading in that direction. Sorry it's a bit shaky I was excited and also I couldn't see the object on the camera screen so I used the tree branches as a reference. Just lucky I caught it at all! Very excited about this! I did get overly excited and tried to switch the camera to picture mode because I wasn't sure it was able to capture it in video mode (I could not see the object on my screen) and I just wanted some sort of proof. The pictures didn't come out that great it looks like a long dot even though I was zoomed in all the way, plus this thing was gaining speed and poof it was gone!"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.522691,+-86.573577(34848)&iwloc=A&hl=en\"> mufon case (34848) map </A>","Weather Factors":"Unknown","Summary":"UFO Jan. 14, 2012 3:41 PM in TN.","trends":[""],"Log Number":"US-01142012-0008","files":["/var/www/straped/mufon/html2text/34848.html.txt","/var/www/straped/mufon/org/34848.html"],"Case Number":"34848"}