{"Summary":"in the mountians looking for gold right befor dark ben led to go deeper into the mountians","divs":["Sighting Detailswas lead into matilija canyon to were i found a spot to park there i saw a bright oarnge orb a realy big one fly over head past me then strate over to a mountian. then it droped out of the sky. strate down. but befor it disaperd behind the mountian it slowed down then gone. its the same mountian that iv seen many times ships comeing and going from there. a month ago i saw giant clods comeing from the north heading south. must have been a mile or two long all in a row going realy fast disapire at that same mountian. i never seen that befor i realy dont know what to do any more its like im a berdun to them like im spying on them and they dont like it any more after what i saw in matilija canyon last night i suddunly got realy sick infact every time i see them lately i ended up in the hostpital over cristmas and new years for bleeding and they cant find the cause of why but new years was in i,c,u for two days. i think its when i see them i loose track of time then get realy sick and bleed in side. i realy wanted to get abducted to have them take me. i dont understand why they havent i gess"],"Case Number":"34846","Country":"United States","Latitude":"34.45011","Disposition":"Unresolved","Date of the Event":"01/07/2012 12:00 UTC","Tags":"City","Source":"MUFON","Log Number":"US-01142012-0006","Object Flight Path":"Path with directional change","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.45011,+-119.241439(34846)&iwloc=A&hl=en\"> mufon case (34846) map </A>","Viewing Distance":"101-500 Feet","Object Shape":"Unknown","trends":["There have been 20 other sightings in Ojai","There were no other sightings in Ojai on or around January 7th 2012"],"Region":"California","files":["/var/www/straped/mufon/html2text/34846.html.txt","/var/www/straped/mufon/org/34846.html"],"City":"Ojai","Sighting Duration":"01:00:00","Date Submitted":"01/14/2012 04:22 UTC","Weather Factors":"Unknown","Longitude":"-119.241439"}