{"Viewing Distance":"Unknown","divs":["Sighting DetailsThe Brunswick news had an article on the front page thurs morn that an object was spotted in north fla over the island heading north! It was seen by many people from fl to ST Simons island where it finally made a turn and went down into the marsh! Coast guard and civil air pAtrol went but couldn't find anything! Witnesses said when it went down there was an explosion! Like an airplane! Air traffic said there was no traffic in that area at the time of the incident! Law enforcement officials saw the object as well as many others! They said it must HAV been a meteorite! Only problem with that is it wasn't traveling very fast and witnesses said it had blinking light on the tail! I didn't see it but it sounds like somthing fidget! Why didn't they find anything? It was traveling horizontal for 50 miles or who knows and when it got over ST Simons isl it turned and went down in a area where there's miles of marsh and creeks! I don't know what it was but it was unidentified! That's for sure! Call Camden co Georgia sherrifs off n ga! Their deputies watched it according to the newspaper! So did people from n fl to ST Simons isl ga! Sounded pretty interesting to me! I BELEIVE this is the year we will get some real answers to the big question! A little alien told me that! Lol!"],"Object Features":"Undisclosed","City":"Undisclosed","Region":"Georgia","Date Submitted":"01/15/2012 12:06 UTC","Date of the Event":"01/11/2012 09:09 UTC","Country":"United States","Weather Factors":"Unknown","Object Shape":"Fireball, Sphere, Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.160475,+-82.903763(34857)&iwloc=A&hl=en\"> mufon case (34857) map </A>","Summary":"The object was spotted in n fl and was observed until it crashed 50 miles away around ST Simons island ga","files":["/var/www/straped/mufon/html2text/34857.html.txt","/var/www/straped/mufon/org/34857.html"],"Object Flight Path":"Undisclosed","Latitude":"32.160475","Source":"MUFON","Case Number":"34857","Log Number":"US-01152012-0002","trends":[],"Longitude":"-82.903763","Tags":"City","Sighting Duration":"01:00:00"}