{"Longitude":"-73.041557","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Cylinder","Log Number":"US-01142012-0009","Latitude":"41.495051","Date Submitted":"01/14/2012 07:26 UTC","Object Features":"None","trends":["There have been 6 other sightings in Naugatuck","There were no other sightings in Naugatuck on or around September 20th 2011"],"Tags":"City","Weather Factors":"Unknown","Country":"United States","Case Number":"34850","map":"<A HREF = \"http://maps.google.com/maps?q=41.495051,+-73.041557(34850)&iwloc=A&hl=en\"> mufon case (34850) map </A>","Viewing Distance":"Over One Mile","Date of the Event":"09/20/2011 12:00 UTC","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/34850.html.txt","/var/www/straped/mufon/org/34850.html"],"divs":["sighting detailsmy husband and i were having a bon-fire when i looked up at the sky as i often do when i saw two clouds that should have been linked together and thought that was strange. hen a mist\\light shined down in a cone shape and i begged my husband to look up \"for the love of god look up\" i said. he saw it too and was amazed. 2 minutes of looking at this light and it disappeared as quickly as it came. i couldn't shake the feeling something\\one was behind me. my dog wouldn't stop looking into the woods. i was scared. the following week i had a dream or what i thought was a dream, it was the cloud in reverse. i awoke at the back door looking up. i closed the door and locked it thinking i was safe. a year later i feel something on my neck, it feels like dried skin, i pick at it for days until i finally get twezzers and pull. something, white plastic about 1\\2 inch long, cone shaped, comes out of my neck! before i can look at it close, i drop it on the floor never to be seen again. i believe, i've always believed. i just believed that it would happen to other people, not me. so much for that."],"Summary":"Cone shaped cloud/mist coming from sky where there should have been clouds","Region":"Connecticut","City":"Naugatuck","Disposition":"Unresolved"}