{"Case Number":"34865","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34865.html.txt","/var/www/straped/mufon/org/34865.html"],"Weather Factors":"Unknown","Log Number":"US-01152012-0010","Region":"Massachusetts","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Date Submitted":"01/15/2012 11:03 UTC","Summary":"Saw what we thought was a car coming out of sky toward us - woke up 3 hours later miles away feeling drugged.","Longitude":"-71.795948","Latitude":"42.518089","Object Features":"Undisclosed","Country":"United States","Object Shape":"Unknown","trends":["There have been 9 other sightings in Leominster","There were no other sightings in Leominster on or around October 1st 1974"],"Disposition":"Unresolved","City":"Leominster","divs":["Sighting DetailsMy highschool boyfriend and I were driving on a very rural wooded road. There were no houses near where we were, or any other streets. We hadn't seen any other cars. We hadn't done drugs, nor had we been drinking. We suddenly noticed what I thought at first to be a car coming toward us from the sky, just touching the tops of the trees, and then going through the trees. I remember shouting. Then it was 3 hours later and we were downtown, approximately 5 miles away. I felt as though I was waking up from a drugged sleep. I looked at my boyfriend and he was driving as though he was in a trance. I asked what time it was, and he told me it was 11pm, over 3 hours from seeing \"the car\" coming through the trees, and I suggested he drive me home. We never spoke about what happened until 15 years later when we met up again. We sat and had coffee and reminisced. When he was leaving he suddenly stopped and said \"Do you remember that night...\" and I knew what he was talking about. I said yes. We stared at each other, and then he left. I don't know what this was, but I would like to find out. I was 17 when it happened, and I'm now 55. I still clearly remember seeing the lights coming toward us, and I remember vaguely something in the road in front of us. I remember both of us shouting. I would like to remember more."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.518089,+-71.795948(34865)&iwloc=A&hl=en\"> mufon case (34865) map </A>","Object Flight Path":"Straight-line path","Date of the Event":"10/01/1974 07:30 UTC","Tags":"City"}