{"Object Shape":"Blimp, Egg, Fireball, Oval","Sighting Duration":"Undisclosed","Region":"Saskatchewan","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=55.450565,+-107.90363(34864)&iwloc=A&hl=en\"> mufon case (34864) map </A>","Date Submitted":"01/15/2012 08:36 UTC","files":["/var/www/straped/mufon/html2text/34864.html.txt","/var/www/straped/mufon/org/34864.html"],"Longitude":"-107.90363","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"08/13/2001 01:30 UTC","Summary":"Oval shapped fire ball hovering over tree line across a lake then slowly hovering towards my friends and I. Hovering almost above us making noise then morphing into a plane.","Country":"Canada","Latitude":"55.450565","divs":["Sighting DetailsI know I am filing an old report but it is one of the best UFO sightings that i have seen. One August night in the summer of 2001 some friends and I decided to take a walk to the local beach to watch the annual meteor shower. We had been laying on the sand for about 30 minutes or so when I decided to sit up and adjust the pillow i was using, upon looking across the lake i noticed a oval shaped ball of orange hovering just above the tree line, I then informed my friends saying \"hey look what the hell is that?\" We all sat up and watched as this ball of orange hung above the trees in the distance. After about 5 minutes or so of watching and trying to guess what it was it got bigger and that's when we realized holy crap this UFO was making its way over the lake towards us. At the site of this new direction the UFO was taking we all stood up and gathered our things, waiting to see what would happen. It slowly drifted towards us which seemed about 5 minutes to cross the lake and positioned itself about 15 meters from the shore line of the beach. It was bigger now, went from about a pea size in the distance to an egg sized oval closer to the beach. The UFO color was different too it was now changing numerous colors, had a metallic luster to it and appeared to be spinning. By this time i was in a panic state of mind as it was not my first UFO and i was already well versed in UFO sightings and abduction stories. So we moved a little bit up the beach just about 2-3 meters and by this time my friend decided it would be a good idea to flash our high powered flashlight at it, so she stood there aiming a very bright beam of light at it. This made me even more paranoid of the consequences of trying to make contact with a UFO I was yelling at her \"Shut off the light its moving closer\" and it was moving closer as we kept backing away, though it appeared close enough to shine a light upon our flashlight didn't get reflected off it's surface. Another few minutes went by when we noticed that this UFO was emitting white light into the water, we could see flashes in the water reflection and beams streaming down from the vessel and that's about the time we started to hear a strange sound. The other friend of mine says \"Look shut up Dani and listen can't u hear it, it's making techno noises!\" We all went quiet and sure enough this UFO was emitting a whirring pulsating sound, \"Neeerroo Neeerroo Neerroo\" over and over again that's all we could hear and it got louder too as it came closer to the shore line. This was my breaking point I was freaking out and my friends wanted to stay, but i managed to convince them to leave so we ran into a yard about 10 meters up the beach then to the street in front of the yard where we stopped under a street lamp to catch our breath. When suddenly a really loud huge plane flew over the house and over us. My friend then said \"oh my god it morphed into a plane\" and I believe it did for the following reasons Size, light color and lack of insignia. This plane was too big for Northern Saskatchewan as we do not live near any major airports, our airports are only functional for small planes such as air ambulance. The three lights underneath were only white and were in a line under the middle of the plane, and there was no visible markings on it. Further more why would a plane that size fly so low when the airport is about 2 miles from where we were. My most impressive sighting to date and this happened the summer i turned 16, I still think about what would have happened but I am very glad that we did not make the abduction list!"],"Object Features":"Wings","Source":"MUFON","Case Number":"34864","City":"ÃƒÂŽle-ÃƒÂ -la-Crosse","trends":["There has been one other sighting in Île-à-la-Crosse","There were no other sightings in Île-à-la-Crosse on or around August 13th 2001"],"Log Number":"CA-01152012-0009","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Tags":"City"}