{"Object Features":"Window(s)","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=32.364268,+-89.395548(34866)&iwloc=A&hl=en\"> mufon case (34866) map </A>","Weather Factors":"Unknown","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Date of the Event":"01/14/2012 09:45 UTC","trends":[],"Disposition":"Unresolved","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Cigar, Disc","Country":"United States","divs":["sighting detailsme, my husband, & two children were traveling in our car at approximately 9:45p from memphis, tn heading into marshall county, ms on january 14, 2012. from the time i got in the car, i mentioned to my husband that there were a lot of stars in the sky. i told him it looked weird. i also saw several bright blinking stars that seemed to change colors (primarily red) & move around. my husband didn't think anything of it. he said they were probably airplanes. i was convinced it was something more going on, so i kept my eyes looking outside the passenger's window while he drove. then suddenly this large white\\grayish cigar-disc shaped object with windows appeared out of nowhere right above the trees. it was as big as an airplane and was very close as if it was heading for our car. it appeared right above the trees on the side of the highway. i screamed to my husband and kids that were sleep in the back seat, \"oh my god! do you see that?\" by the time he took his eyes off the road to look up, it was gone. it was moving so fast. he caught the tail end of it. he said he saw something bright & white, but he assumed it was a cellphone tower. he's a big skeptic, but i know what i saw & it was very disturbing. i'm scared to drive my car at night now out of town. something is going on out there. i know i'm not the only one that could have seen it. there were several cars on the highway at the time."],"Case Number":"34866","Summary":"UFO spotted near Marshall County, MS on January 14, 2012","Source":"MUFON","Date Submitted":"01/15/2012 11:31 UTC","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/34866.html.txt","/var/www/straped/mufon/org/34866.html"],"Latitude":"32.364268","Longitude":"-89.395548","Log Number":"US-01152012-0011"}