{"Viewing Distance":"20 Feet or Less","divs":["Sighting Details I have liver disease. Six years ago I had a dozen orbs bring me back from the brink of death. They performed an operation on my liver that involved the use of magnetism. They magnetically drew toxins, or maybe even scar tissue from my liver. I saw them with my naked eye. My liver was shutting down, and I have my medical file that reflects a 180 degree turn in my health. My liver enzymes were going off the chart, and returned into the normal zone, after my encounter. Again, I HAVE MY MEDICAL FILE that reflects a miracle which any doctor in the world will tell you would be impossible without treatment. It ultimately reveals an instance of Divine Intervention. It is documented. I cannot fake blood-work. Three years ago, while working on a manuscript recounting my orb experience, my daughters bought brand new digital cameras. Having seen orb videos on Youtube, with some claiming to see faces in the orbs themselves, I sent my daughters on an \"Orb Hunt\". They simply shot photos of empty rooms in our home, as well as their school, and even a local street church called \"The Gathering Place\", in Regina. I have several photos that ARE definitely communication from these Entities. One in particular is the HOLY GRAIL. And, I do not mean \"The Holy Grail of UFO photos\". I mean much, much more than that. It is a message that I have taken over three years to decipher, as it is SO encoded with communication! It is a photographic representation of the Nature of Reality. It is not just \"a\" message from God. It is \"THE\" message from God. I have determined that these Entities act as our Guardians. They work for God. Some call them Guardian Angels. Regardless, the communication that I have discovered encoded into this photo pass three Truths that prove that they are of Divine Origin: Truth #1: The communication is made in symbolism, therefore they are in a Universal Language. Truth #2: The symbolic images found within the orbs themselves are too detailed for a human being to make. They are multidimensional. They communicate their message when upside-down or spun onto their sides. As an artist myself, I do realize that NO ONE could EVER design an image to the degree of complexity displayed in these orbs. Truth #3: Because the encoded images in the orbs ARE multidimensional, THEY CANNOT BE ALTERED. If you alter one hair in one image, you ruin another image when the picture is inverted, or tipped on its side. This is a VERY, VERY important aspect to this communication. It is a message that simply defies corruption. It will never change over the course of history. It is perfect. Heres what happened. My eldest daughter was taking some random shots in our home, and she was about take one in my living room, but I wanted to get out of the shot. I was drinking a tea, and I put my cup down and stood next to her while she took the photo. There were SO MANY orbs in this particular shot, that I simply chalked it up to dust. I studied other photos in depth, before studying this shot, as I felt it was defective. I thought the other photos blew my mind. But, when I finally got around to deciphering the \"Holy Grail\", It was then that I truly \"lost it\"! The very first photo I studied was basic. It seemed to depict an Angel. It was blurry, but it was definitely visible. In hindsight, I realize that I was being \"guided\" through the process by an unknown force. The images seemed to get more complex as I studied them. It was like I went from reading a \"Dick and Jane\" picture book to a Stephen Hawking scientific journal. Here is a simple example of symbolism encoded into the setting of the photo itself: The living room cna be spliced PERFECTLY down the center. The left side symbolizes the \"Physical Realm\". The right side represents the \"Spiritual Realm\". The Left side is predominantly blue and green. \"Blue and green should never be seen.\" It is a symbolic reference to being incarnated into the physical world. Nearly all the orbs in the photo (except one, for another symbolic reason) are located on the right side of the image. This reflects the message that the orbs are \"Positive Entities\". They only do positive actions. They do not do anything negative. They work for the \"Good\". The symbolic imagery gets deeper and deeper. There is a stereo speaker in the shot on the right side of the photo. This speaker is \"speaking\". It is where the two brightest orbs appear, and these two orbs are overflowing with symbolic imagery. However, the speaker has imagery in the form of vapor (ectoplasm perhaps?), that actually depicts an image of Christ carrying a baby. this same image is reflected in a Hubble telescope photo of the \"Cone Nebula\". It is unnerving, until you understand my interpretation. It is Divine Communication that we MUST take seriously. I have determined that my daughter and I MUST have been guided to create this image, as even the living room itself is RIFE with encoded meaning. We did NOT stage this shot. It was a random occurrence. It reinforces the concept that there is NO SUCH THING as coincidence. You will see that the image reflects an intelligent design that could NOT have been staged. Even if I had staged the setting, I certainly did not digitally alter the image by adding the orbs. They chose to appear at that PRECISE moment to capture that PRECISE image for their very PRECISE message! If a picture is worth a thousand words, and a symbol is worth a thousand pictures, then this one digital image has greater communication than the Bible. I use that comparison, because if Im correct (and I am), this image will REPLACE the Bible. I will send the original Holy Grail (copyrighted), along with some other copyrighted orb photos that add weight to my theory. I simply cannot give you enough information at this time that speaks any better than the images themselves. I would love to be interviewed at length. My evidence defies criticism. No one could fake this photo. NO ONE!"],"Date of the Event":"01/24/2009 05:37 UTC","Summary":"I sent my two daughters on an orb hunt with new digital cameras for evidence for my book..","map":"<A HREF = \"http://maps.google.com/maps?q=50.463377,+-104.628265(34869)&iwloc=A&hl=en\"> mufon case (34869) map </A>","Object Features":"Other","Longitude":"-104.628265","Case Number":"34869","Disposition":"Hoax","Weather Factors":"Unknown","Latitude":"50.463377","Sighting Duration":"00:00:01","Date Submitted":"01/15/2012 01:02 UTC","Region":"Saskatchewan","files":["/var/www/straped/mufon/html2text/34869.html.txt","/var/www/straped/mufon/more/34869_submitter_file1__Brainiac.jpg","/var/www/straped/mufon/more/34869_submitter_file2__JinninSpeaker.png","/var/www/straped/mufon/more/34869_submitter_file3__Dragon.jpg","/var/www/straped/mufon/org/34869.html"],"Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Circle","City":"Regina","Country":"Canada","Source":"MUFON","Log Number":"CA-01152012-0014","trends":["There have been 10 other sightings in Regina","There were no other sightings in Regina on or around January 24th 2009","This sighting has never been favorited.",""]}