{"files":["/var/www/straped/mufon/html2text/34873.html.txt","/var/www/straped/mufon/org/34873.html"],"Source":"MUFON","Tags":"City","trends":["There has been one other sighting in Elko New Market","There were no other sightings in Elko New Market on or around January 15th 2012"],"Summary":"was in the car with my cousin and we saw the light in a reflection of a window. saw two lights collide become one and then slowly went above the tree line and then desend and it was completly silent.","Disposition":"Unresolved","Log Number":"US-01152012-0018","Date of the Event":"01/15/2012 04:20 UTC","Region":"Minnesota","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.564686,+-93.326889(34873)&iwloc=A&hl=en\"> mufon case (34873) map </A>","Date Submitted":"01/15/2012 05:51 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Circle","Longitude":"-93.326889","Object Flight Path":"Path then hovering","Latitude":"44.564686","Case Number":"34873","Weather Factors":"Unknown","divs":["Sighting DetailsMe and my cousin were in the car around 4:25 am to go to adoration for her mom who was out of town for the weekend. We had just parked the car when she asked me if i was seeing what she saw. She noticed the lights in the reflextion of the window in front of us because the thing was happening behind us. She saw it first and told me that it was two lights and it looked like they did a little dance and then collided. When i saw it, it was a huge red glowing flame electrical circle right above the tree line. We were outside and it was silent. My first thought was it could have been a helicopter because they hover, but i heard nothing. The light was BIG and it had a hole in the middle of it. It lasted about a minute but it seemed for a while. It slowly descended toward the tree line in a downward line and then we lost it in the trees. My feelings during this were....as if i was being watched. I remember holding my breath and then once it was done just being in a state of confusion and disbelief. I never really believed in UFO sightings because i just thought people could make really good video's. But this my friends.....was something that made me lose sleep and ill never forget that."],"City":"Elko New Market"}