{"Viewing Distance":"Unknown","Object Flight Path":"Path then hovering","Region":"North Carolina","Latitude":"35.081954","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","Date Submitted":"01/15/2012 04:51 UTC","trends":["There has been one other sighting in Indian Trail","There were no other sightings in Indian Trail on or around January 14th 2012"],"City":"Indian Trail","Object Features":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/34870.html.txt","/var/www/straped/mufon/org/34870.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.081954,+-80.667365(34870)&iwloc=A&hl=en\"> mufon case (34870) map </A>","divs":["Sighting DetailsI was out on my porch when I noticed a star formation that didn't seem familiar. I started to loo closely at it which formed a triangle shape. I know their are many stars that can create the seem effect but I noticed something strange. It had two more lights which sat between the point light and the bottom two lights. As I noticed that I could see the bottom right light start to glow into an orange color. This light began to pulsate brighter and dimmer as the lights begin to drift up higher. I could see some sort of dark undertones that made it look solid. I also could see a plane flying towards it. The plane actually some how flew begind the the lower light of the object. As I tried to to stare at it more intently I could see a small light hovering from the top to the middle of the object. Then as my mind began to think this might actually be a ufo a flying lighted object struck right in front of the object. It kind of made me jump because in the back of my head I had been rationalizing that this was my mind playing a cruel joke on me. I went inside and told my sister that I had just seen a ufo. I went back outside and the lights were gone. Note: Right before all this happened I had seen a large orange cloud that freaked me out cause it looked like fire was burning under it. For a second I thought the neighborhood across the street was on fire. It almost look like smoke it was a cloud."],"Log Number":"US-01152012-0015","Source":"MUFON","Longitude":"-80.667365","Weather Factors":"Unknown","Date of the Event":"01/14/2012 10:30 UTC","Object Shape":"Sphere, Star-like, Triangle","Summary":"Second UFO Encounter (A triangle shaped ship and strange \"shooting star\")","Case Number":"34870"}