{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Date of the Event":"06/15/2005 09:00 UTC","Tags":"City","divs":["Sighting DetailsWe where driving north on Ocean Ave. In Monmouth beach. Exactly where the Sea Wall starts I saw a huge Diamond shape hovering over the shoreline. It had dense clouds around it, as if they produced them themselves. We could see Red,Yellow and White lights flash in around the center, corners of the Diamond shoe. Them they flashed around the whole perimeter. We saw one beam of white light. Then so quickly it shot out right in front of our car then right back to the shoreline. Others saw this as traffic came to almost a full stop. We all drove slowly watching the object follow us. It stayed over the shoreline as we drove. As we entered Sea Bright it stopped, then in a blink of an eye it shot straight out over the ocean. My Husband and I went to the Cove Restaurant. Thats where we were going for dinner when we saw the UFO, I have no doubt that was what it was. Neither does my husband. When we got to the Restaurant, our friend was the Manager. That night her bartender didnt show up and she was stuck filling in. So we ended up having dinner at the bar. As we told her what we has just seen. People started coming in, it was fairly quite that night. A family of 5 and a single woman overheard our recount of the story and both of them ( the Family and the single woman) both said they saw it also. They defiantly did because the little girl said she saw it shoot over the road and the shoot back over the shoreline. She said she saw it stop for a second in front of a Silver Car. We where driving a Silver BMW. She didnt hear me tell Michelle, the Manager that part. She came in AFTER I had told Michelle that part.this is my third experience with UFOs. After my first experience when I was 22. Im 44 now. I would wake in the middle of the night at the same time for months. Thats a whole other story. But that one is hard to repeat as most think Im nuts. All I can say is, there is NO WAY you can pull out of the Holland Tunnel and end up at exit 145 on the GARDEN STATE PARKWAY. you should exit into Hoboken and then get onto the NJ Turnpike. Two hour had gone by when we realized we where on the Parkway. I would Ike to add that since my first encounter, I have had some odd health issues and visions. Like I said, its hard to talk about. People think i am nuts. Oh, I do, every once in a while wake up unable to move for about fourth seconds. And when that happens, I have two spots on each hand, like when you get a blood test. They are in the same place on each hand. I would be happy to tell all three stories if you think they would help."],"Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Case Number":"34877","Weather Factors":"Unknown","Date Submitted":"01/15/2012 06:17 UTC","Object Features":"Other","Summary":"My Husband and I saw the diamond like object over the shoreline.flashing lights, clouds emmited. Followed us as we drove down Ocean Ave.Then abrubtly apeared in fron of our car, then shot back to shoreline. OTHERS SAW THIS","Log Number":"US-01152012-0022","Longitude":"-73.981526","Sighting Duration":"00:08:00","Latitude":"40.330388","Region":"New Jersey","Country":"United States","City":"Monmouth Beach","map":"<A HREF = \"http://maps.google.com/maps?q=40.330388,+-73.981526(34877)&iwloc=A&hl=en\"> mufon case (34877) map </A>","files":["/var/www/straped/mufon/html2text/34877.html.txt","/var/www/straped/mufon/org/34877.html"],"Object Shape":"Diamond","trends":["There have been no other sightings in Monmouth Beach","This sighting has been favorited 2 times."]}