{"Date of the Event":"01/14/2012 06:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.090213,+-74.075284(34886)&iwloc=A&hl=en\"> mufon case (34886) map </A>","Longitude":"-74.075284","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Point Pleasant","There were no other sightings in Point Pleasant on or around January 14th 2012"],"Log Number":"US-01162012-0001","Object Features":"Unknown","Disposition":"Unresolved","Source":"MUFON","City":"Point Pleasant","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/34886.html.txt","/var/www/straped/mufon/org/34886.html"],"Case Number":"34886","Country":"United States","Latitude":"40.090213","Viewing Distance":"Unknown","Object Shape":"Star-like","divs":["sighting detailsi was sitting on the back deck smoking a cigarette, looking at the stars as i normally do. i noticed this small star-like light moving through the sky, i believe the direction is west to east. it appeared to be a dim bluish white light. i thought it was nothing special, just a satellite. after about a minute it got really bright and changed colors to a yellowish orange light as if a plane had come out of the earths shadow into the sun only if it was a plane it would have to be going east to west to accomplish such a feat. a couple of seconds later what appeared to be similar to a jets afterburners come on at which point it picked up speed and a couple of seconds later dissappeared in the eastern sky right before reaching orions leg\\belt section. also to note there was the ever so slightest separation between the object itself and its \"tail\". my only reaction was to tell my girlfriend and she posted about it on facebook. she also went outside so i could show her the path. this happened ony a minute after my sighting and after i showed her the path i ran back inside due to air temp. apearently there were to more objects criss crossing along that same path within minutes of my sighting that she had seen and described to me as if they had followed or were searching for the object i had seen."],"Date Submitted":"01/16/2012 02:20 UTC","Summary":"I was watching what I thought was a satellite move through the sky when it suddenly picked up speed and dissapeared","Region":"New Jersey"}