{"divs":["Sighting DetailsI'm living on the 4th floor in an apartment house. At 7:50am today i was watching outside my kitchen window to observe some strange thing's going on in a neighbour house. While watching i recognized something like an Orb or a Sphere appearing behind that building i was looking at. It was ascending behind that building. From my distance it was the size of a small pill, like Aspirin or so. I do not now the actual distance, but i think it was more then 2 miles away. I think so, because on the opposite side of my position (in my back so to speak) we have the biggest german airport (Frankfurt), and this airport is about 3 miles away, linear distance. I use to watch aircrafts landing and starting all the time and i know what they look like in the dark and in the twilight and i know their flightpaths. I also used to work over at the airport for several years, therefore i do know that my sighting was NO common aircraft, nor a Helicopter! So i know that there are NO civilian flightpaths and i never watched an aircraft in that direction i was looking at (I am living in this appartment for about 4 years now). The actual size of the craft was maybe the size of a smaller passenger jet, when i compare it to the aircrafts that can be watched every minute coming in over at the airport. It was at first just hovering over(behind) that appertment building, stood still for about a minute, then it slowly started moving to the west. It was glowing and sparkling in all kinds of colours. I took my binoculars to get a closer look on it. I could't see any fixed shape, it looked round to me, like a ball or a sphere. The outlines were dizzy because the lights were glowing and pulsating so bright. The pulsating and blinking had no special pattern, it blinked in the 'back', then in 'front', the top and so on in no specific order or pattern. UNLIKE an AIRCRAFT. There were no specific position light's like on an airplane or helicopter. It was just covered in changing, flickering, blinking, pulsating lights. No trails, no sound to it. Couldn't take photo of it, it was too far away. After a couple of minutes watching, i yelled for my girlfrind who was in the bathroom. By the time she showed up, the craft was behind a tree that's right in front of our house, so we couldn't see it anymore. I was a bit dissapointed and went to the bathroom myself after a minute waiting. Shortly after that my girl told me to come back because she saw it, too. It showed up again, passed the tree and dissapeared again behind a chimney of another house. unfortunatelyl i didn't have the chance to see it appearing behind the trees, i wasn't fast enough going back into the kitchen. We went outside the house into the yard immediately to see if it is still somewhere in the skies, but it was gone. My girl is also pretty sure that this was no common aircraft (Just for your information, my girl is a non-beliver, she's very very sceptic). She was very confused and excited about it. So i will start observing this direction in the sky a little bit more now. Maybe i will be lucky to see more unknown flying objects. Greetings from Germany!"],"Date Submitted":"01/16/2012 03:46 UTC","Latitude":"50.069573","map":"<A HREF = \"http://maps.google.com/maps?q=50.069573,+8.487227(34888)&iwloc=A&hl=en\"> mufon case (34888) map </A>","Longitude":"8.487227","Viewing Distance":"Over One Mile","Summary":"Bright sparkeling Object","Weather Factors":"Unknown","Case Number":"34888","Object Features":"Unknown","Object Flight Path":"Hovering then path","Log Number":"DE-01162012-0002","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34888.html.txt","/var/www/straped/mufon/org/34888.html"],"Object Shape":"Circle, Sphere","Country":"Germany","Region":"Hessen","Date of the Event":"01/16/2012 07:50 UTC","Disposition":"Unresolved","City":"Hattersheim am Main","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Hattersheim am Main","This sighting has never been favorited."]}