{"Date Submitted":"01/16/2012 04:50 UTC","Date of the Event":"01/11/2012 11:00 UTC","Object Shape":"Circle, Cylinder, Disc","Log Number":"US-01162012-0003","Latitude":"38.74588","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Source":"MUFON","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.74588,+-87.325016(34889)&iwloc=A&hl=en\"> mufon case (34889) map </A>","Region":"Indiana","Disposition":"Unresolved","Country":"United States","Case Number":"34889","Summary":"Blue,White,Red Flashing Object","Object Features":"Dome","trends":["There have been no other sightings in Ragsdale","This sighting has never been favorited."],"divs":["Sighting DetailsI have seen the objects I am about to describe many times before, but I only recently felt compelled to write about them. Every time I think about it, it sends chills up and down my spine. I feel strange connection to this object; I feel as if it is always watching me. Im not sure when my initial encounter with this specific object occurred, but it had to be at least two years ago. I do recall talking to my girlfriend on the phone at night, gazing into the night sky as we converse about this and that. A flashing red, blue and white object (in that order) that seemed to me to be a peculiar star. I paid some attention to this star as I conversed with my girlfriend, when suddenly the light split in two. I watched in awe as the light that branched off from the initial light had been observing, like an act of mitosis, and it began to slowly circle the light it spawned from. I then began to explain to my girlfriend what I had experienced, and I told her to hold on while I switched my phone to the camera mode. During this time, the second light had vanished, but the initial light was still there! Every picture I took came out very fuzzy. I then proceeded to record a video of this peculiar light, but I could not even tell that the light was flashing in the video. I went in to get my fathers video camera; it was better quality than my phone camera. In the time it took me to get my dads recorder, the light had vanished. The light would reappear frequently, but I have yet been able to figure out a pattern in which it appears. The light has only split like a cell undergoing mitosis a few times after that; most of the time it just appears, hovers, then vanishes mysteriously. The most recent time it split was January 7, 2012. Once again, I was unprepared with the encounter with the familiar, peculiar flashing object in the sky. It seemed to me that it knew when I was not looking, as that was when it would ALWAYS disappear. I always feel an incredible rush of fear when this object appears; its almost as if this object the fear within me, as I did not choose to be scared, but the scared feeling consumed and overwhelmed me. I have had some near death experiences that did not horrify me as much as this object has. I would not write this report if I did not believe every word of it was true. I consider myself to be a rational person, but this object has really confused and awed me. I hope this report is of some value to you. I will write a new report if anything else happens."],"Tags":"City","Longitude":"-87.325016","Weather Factors":"Unknown","City":"Ragsdale","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/34889.html.txt","/var/www/straped/mufon/org/34889.html"]}