{"Region":"California","Longitude":"-121.297199","Case Number":"34885","Source":"MUFON","Object Shape":"Star-like","Log Number":"US-01152012-0030","Date of the Event":"01/15/2012 12:00 UTC","Summary":"quick ascending blue light.","map":"<A HREF = \"http://maps.google.com/maps?q=38.764961,+-121.297199(34885)&iwloc=A&hl=en\"> mufon case (34885) map </A>","Country":"United States","Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around January 15th 2012"],"Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Date Submitted":"01/15/2012 11:59 UTC","Sighting Duration":"Undisclosed","Latitude":"38.764961","divs":["Sighting Detailsme and my friend were hanging out at a place we like to call \"the spot\" its a business street that ends in a court with a bike trail attatched to it and we were hanging at this business just up the street a little and after he said he had to go so he dropped me off at my car that was parked at the court near the bike trail and i got inide turned it on sat for just a minute or two to let it warm up and my friend left. so by myself noone around and approxamately little after 12 maybe close to 12:10 a.m and i put my car into gear started to make the u turn to leave and as im turn about half way through the turn i look into the sky above a building and in that second i saw a star like light bigger then a star and blue like an LED light come from nowhere it seems like and went straight up and dissapeared in a single second maybe less. from my point of view in my car if i held my hand up to the spot in the sky where it happened it would have only been a fore finger length long it traveled. then as i drove away i felt such unnatural fear in my body for no reason at all and i was concious of me being scared and couldnt realize why it was just not normal at all. as soon as i saw it i did think that it was a ufo purely because i know that kinda thing doesnt happen often especially in my town all we got is helicopters here. but even through my fear i drove home and just went to sleep."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/34885.html.txt","/var/www/straped/mufon/org/34885.html"],"City":"Roseville"}