{"Longitude":"-95.921479","Summary":"Driving with my mother on the highway when we saw a silent boomerang shape of white lights. Windows were down on the car.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy mother and I were driving southeast on Hwy. 290 towards Houston, Tx. We were surrounded by farm fields on a clear dark night. We were a few miles from the small town of Waller, which is about 20 miles from Houston. I was driving and there were almost no other cars on the road. My Mother said, \"What is that?\" and I looked out her window to see a boomerang formation of large white glowing lights. It looked unlike anything I'd ever seen. I turned the rearview mirror up so there would be no possible reflections on it and asked her to lower her window for an unobstructed view. She did that and they were still there. I slowed down and, as we watched, the long arm of the boomerang (5 spherical lights) would lose one light as the short arm gained one light--simultaneously. I found this very odd and this action was repeated at least three times with a period of stability (about 30 sec. to several minutes )in between these changes. All the lights glowed steadily, were pure white, had somewhat fuzzy edges, and made no sound whatsoever. The boomerang configuration continued at a steady unwavering path across the sky, with periodic formation changes as described above, until suddenly all lights took off high into the sky in a NW direction. The boomerang shape was constant as they shot off silently and super fast. As far as I know, I removed all variables or complicating factors regarding clear vision of the lights without any reflections on glass, mirrors, metal in the car or even eyeglasses. I did suggest that we stop along the road to watch more intently but my Mother was terrified and begged me not to do it, so I didn't. I was in my early twenties and my Mother was in her early 50's at the time of the sighting. At the time, we regarded the lights as separate objects but, in retrospect, they could have been part of a very large craft. If so, as it banked then that might explain the loss of a light on the long arm of the V shape while the short arm gained a light at the same time. The lights were never in the form of an equilateral triangle. At no point could we see any outline of a large craft either. The space between the lights were dead black as was the sky in general. The size of the configuration was extremely large."],"Object Flight Path":"Path with directional change","Case Number":"34896","Viewing Distance":"Unknown","Log Number":"US-01162012-0010","City":"Waller","Date Submitted":"01/16/2012 02:57 UTC","files":["/var/www/straped/mufon/html2text/34896.html.txt","/var/www/straped/mufon/org/34896.html"],"Source":"MUFON","trends":["There has been one other sighting in Waller","There were no other sightings in Waller on or around September 15th 1971"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.062458,+-95.921479(34896)&iwloc=A&hl=en\"> mufon case (34896) map </A>","Object Shape":"Boomerang, Sphere","Object Features":"None","Latitude":"30.062458","Country":"United States","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"09/15/1971 12:00 UTC","Region":"Texas"}