{"City":"Kitchener","Case Number":"34894","Disposition":"Unresolved","divs":["Sighting Detailsme and my witness who also seen everything that i saw were in a park where it was already turning night time still a lil bit of light far out i was looking towards the nearest hospital from the view we were at and suddenly i saw a object jus jump up from some where near the hospital and then stay up in tha sky so i thought it was a helicopter but then i notice a light that was spinning around the belly of the object and then drop back down and within 1-2 mins appear flying out not too far from where i seen it towards the sky as if it was goin out into space. and the next one appeared near some woods near the hospital and was heading towards the other object but this one didnt have a light it looked like an outline of a car(best description)without the wheels jus like the 1st one. Now seeing the first one i told my witness do u see that at first he didnt see but once it was flying away he saw it . so now about 10 after witnessing the 2 objects i noticed to my far left side that more lighting were apearring now these lightings appearred in a form like a triangle there were 6 of them. Once they came into a closer view than tha other 2 i told my witness\" do you see that?! are you seening what im seening?! are we really seeing this with our eyes?! now remember we are in a park and its outside in an suburban area where its really quite at night. so once they came into closer view i shouted out F-you ufos and was giving it the middle fingers and suddenly the first odject turned its lights down to me now i know its gonna sound a bit werid but thats what happened. Ask your self when has something in the sky at night ever put its lights at you. and immediately i was in shock because that lights appear right as i was yelling. Me and while this was happening they didnt make a sound the distance between me and then object i would saw would be like looking at a building with about 10-20 or floors my best guess now what hit me the most was that they didnt make a sound now anything thats close would make a sound but this didnt the other 5 objects just followed it. i pulled out my phone n tired to take a shot for evidence but not appeared just a black screen not even a light or anything so i put it away it was a crap camera on it now all of these things apearred like they were going in the same direction out into space and the 6 objets were no travelling fast or anything but really slow. we watched them fly away now. as soon as they went off into the sky we headed away and were talking to each other about what we saw not 1 or 2 but 8 objects. to this day i still remember what i saw that night the experience what incredible seeing this"],"Tags":"City","Object Shape":"Square, Rectagular, Unknown","Object Flight Path":"Hovering then path,Other","Weather Factors":"Unknown","Source":"MUFON","Log Number":"CA-01162012-0009","Summary":"the 1st one had a red light going around the belly 3rd ufo turned its lights at me","Latitude":"43.439851","Longitude":"-80.472087","Date of the Event":"11/18/2010 08:10 UTC","Country":"Canada","Object Features":"Other","Region":"Ontario","trends":["There have been 15 other sightings in Kitchener","There were no other sightings in Kitchener on or around November 18th 2010"],"Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/34894.html.txt","/var/www/straped/mufon/org/34894.html"],"Date Submitted":"01/16/2012 01:19 UTC","Sighting Duration":"08:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=43.439851,+-80.472087(34894)&iwloc=A&hl=en\"> mufon case (34894) map </A>"}