{"Longitude":"-77.638876","map":"<A HREF = \"http://maps.google.com/maps?q=38.038748,+-77.638876(34904)&iwloc=A&hl=en\"> mufon case (34904) map </A>","Latitude":"38.038748","Tags":"City","Country":"United States","Case Number":"34904","Date of the Event":"01/03/2012 06:45 UTC","files":["/var/www/straped/mufon/html2text/34904.html.txt","/var/www/straped/mufon/org/34904.html"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path","Object Features":"Dome","Source":"MUFON","Summary":"Hovering star like light that changed into a blue/white ring with oval disk in the middle cusing us to see a house that isn't there","City":"Partlow","divs":["Sighting DetailsOn January 3rd at about 6:45 P M my wife came home from work and as she shut our gate she noticed a large lite hovering over our field. She proceeded down our driveway to about half way to our house and stopped her car and cut the engine and lights and got out to see if this light was making any noise which it wasn't and watched as it hovered towards our house. She drove to the house and came in to tell me that i needed to check out this weird light that she had seen. I went out without shoes or a coat and by that time the light had moved behind our house and looked to be about a half a mile behind the house and it was hovering behind the trees in our back yard. This evening was extremely clear with the moon being full or almost full with no clouds visable. I watched the light for a while and went in to get a coat and shoes and came back out to watch the light again which hadn't moved in about 10 to 15 minutes. I asked my wife to get my spotlight which she did and i blinked it three times at this light and the light dimmed down to where it almost disappeared and then lit back up to the original size. My wife told me not to blink the spotlight at it since it may come back and i told her i wanted it to come back so i could get a better look at it and she said she was going in the house which she did.At that time i moved farther into out back yard to try to get a better view of the light and i blinked the spotlight at the hovering light again and it dimmed down again and lit up again just as before. About this time a large dark shadow went over head which caused me to jump and sart to move towards the house and at that time my wife opened our back door and told me again not to blink my light at the light object. I told her to get her car keys so we could follow this thing to get a better look at it and to try to dertermine the distance. She didn't want to but she reluctantly got her keys and we started to follow this light and as we left our driveway her dash in her car started to make rattling noises and i jokingly told her if we were UFO freaks we would think the light was messing with her car and she stated that it hadn't made that noise before. We watched and followed this object for 4 mile and made a right turn to head in the direction of the light and we came to a red car heading in our direction, but parked on the other side of the road with a man standing behind it looking up in the sky in the direction we were coming from and i told her to stop but she wouldn't. I looked at this guy as we passed and he seemed to be zoned out with a blank look on his face and he never looked at us as we past him just kept looking up. We stopped at a stop sign about 100 yards past this guy and i got out to look back to see what he was looking at but saw only the moon and stars and the light object was still ahead of us. We watched the light for a few minutes and then the car came up behind us and we made another right turn to try to get closer to this light and this car followed us a little way and then turned off. We went around a right turn and a cayote ran across the road which she thought was a dog but i told her it was a cayote.We travel another 2.4 miles and came to another bend in the road to the right and this light object was above a two story white house with a black roof facing us.this house was in a field that looked to be at least 150 yards from us.Now this house was well lit from the bright moonlight and this light object was behind the house and to the left of it hovering just above the tree line.She stopped the car in the turn and i told her to move up just in case anyone came up behind us but she said that she could see if anyone came in the mirror.We watched the light and i got my spotlight and blinked it at the light three times and again it dimmed down but this time we must have been closer because as it dimmed down it changed into a blue white ring and i looked into the center of the ring and with the moon light shining down i saw a oval disk in the center of the ring and i asked her if she was seeing this and she said she was.At that time the ring blinked out and we couldn't see it. I said that that mother F'er blinked out and was gone and just as i finished the statment it lit up again to the far right side of the house and was at a farther distance. We followed this light for about another mile and a half to a hill top and watched the light object move over the trees towards the Route 208 bridge over Lake Anna. My wife said she was tired and wanted to go home so we turned around and proceeded home after travel a few miles i looked out the back window of the car and the object was in the center of the rear window and joking agian i told her that this thing was following us and we went a little farther and i looked again and could still see it and i remembered thinking that i was glad we were getting close to the main road.We turned on the main road and went home without seeing the object again.As we entered our house i looked at the clock and thought it's 10 minutes to eight.My wife went upstairs and i went back to watching tv. She came down a little later and we spoke breifly about the strange sighting we had had. Over the next couple of days i felt strange but didn't think alot about it.I asked a few associate that live in the area if they had seen the light objject and none had but another associate had seen this light object about a month before and four of them watched it for an hours as it slowly hovered out of sight. I checked for reports of the sighting but found none.We got busy that week and weekend but the next week i kept thinking about this object and on the night of the sighting i had asked my wife how far she thought we had followed this thing and she said about 4 miles,so on my way home January 11th i decided to run the route and check the mileage.I followed the route and and it was about 4 miles to where we saw the guy looking up in the sky behind his car and i turned right at the stop sign and past where the cayote had crossed the road and travel to the right hand bend in the road and looked to my left for the field and house but there wasn't a 150 yard field or house so i figured that it must be a little farther down the road but from there on there is no more fields on the left or any houses that looked like the one i saw that night. I travel the road twice thinking i had missed it but it's not there. I asked my wife what the house looked like and she stated that it was a large house light in color with a dark roof and i told her it wasn't there and that i wanted her to drive there with me. On Sat. the 14th in the late afternoon we drove to the site and i watched as she remembered where the guy was and where the cayote was and as we approched the right hand bend she stated that this was the spot and as we came around the bend she was as shocked as i that there isn't a two story white house there, there is a small clearing with a horseshoe driveway with the main diveway in the center going back to a tree farm. There is no 150 yard field or house but she stated that the hardwood tree line was the same. Where we saw the field is full on 20 to 25 ft pine trees that cover about 150 yards to the hardwood tree line.I asked her what she thought and she stated that that was very strange.We headed home and i asked her about the sighting which we hadn't discussed in detail before which now seems strange since it was so unusal.I asked her if she remembered me asking her if she was see this and she said yes and i asked what she saw and she said she saw a blue light as the bright light dimmed down. I asked her if she had seen the oval metalic craft in the center of the ring and she said no, but she stated that she had told me to get back in the car and i told her i hadn't gotten out of the car and she said that when she told me to get back in the car i told her that i was trying to get out of the light. As she said this i remembered standing in front of her car facing her headlights and trying to block the lite with my arm. I had no memory of this until she made the statement.We both saw the house and field that night as well as the light object but we have no explaination as to why it's not there now. If this isn't our military equipment then it's from somewhere else. I did finally find another report of the light object that the reporter said turned into a donut shape on January 6th which was three nights after our sighting.On two trips to this sight while trying to remember everything about the sighting i have gotten a dull headache which takes about 15 minutes to go away. Maybe the other reporter of this sighting is having the same issue.I'm like everyone else i've read reports like this and though they were interesting i wasn't 100% believing in them. But after having this experience i can understand how it sounds so unreal and why the facts don't relate totally to their experience. Whatever this thing was had the ability to alter our perception of reality and to cloud our memory of the event. I focused that night to remember all the details as possible as we were viewing this sighting but it still had the power to fool us into see a field and house that aren't there.This is the truth as we saw it and we can't explain it!"],"trends":["There have been no other sightings in Partlow","This sighting has never been favorited."],"Date Submitted":"01/17/2012 11:06 UTC","Region":"Virginia","Weather Factors":"Unknown","Log Number":"US-01172012-0003","Object Shape":"Disc, Oval"}