{"Tags":"City","Disposition":"Unresolved","divs":["Sighting DetailsWhile going out for a smoke at 4:45 am Jan 16, 2012 I spotted a very bright, flickering star-like object approximately 15-20 miles to my north hovering est 3000 ft, depending on size. Due to it's brightness and changing intensity I knew it wasn't a star. There are no other visible stars in that section of sky at that time. However, I waited until now just to make sure it wasn't there again today before filing this report. I stayed out for about 20 minutes keeping an eye on it. It varied in intensity the whole time. At it's brightest it almost took on a shape similar to (only thing I can think of) the Capitol bldg in D.C. That was very vague though due to it's distance. Because it was so cold I went back inside, peeking out the front door occasionally to make sure it was still there. Went back out around 5:20 and watched it for another 10 minutes. I had noted a location my 1st time out, above a tree across the street. The 2nd time out I saw that it had drifted slightly north above the next tree in the same front yard. About an inch worth if holding a ruler up. It had gone in a perpendicular direction to the rotation of the rest of the night sky. Rather than twinkling like a star, it flickered quickly and constantly changed it's intensity. There were no other aircraft visible the whole time and it was a cloudless sky. Since it was so cold and I was getting sleepy (and wanted to see the end of The Longest Day on tv) and it didn't seem to be in a hurry to go anywhere, I gave up watching and eventually went to sleep."],"Date of the Event":"01/16/2012 04:45 UTC","City":"Fremont","files":["/var/www/straped/mufon/html2text/34903.html.txt","/var/www/straped/mufon/org/34903.html"],"Sighting Duration":"Undisclosed","Latitude":"37.563813","map":"<A HREF = \"http://maps.google.com/maps?q=37.563813,+-122.016494(34903)&iwloc=A&hl=en\"> mufon case (34903) map </A>","Source":"MUFON","Country":"United States","Object Features":"Unknown","Longitude":"-122.016494","Case Number":"34903","Object Shape":"Star-like","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"01/17/2012 07:32 UTC","Region":"California","Object Flight Path":"Hovering then path","Log Number":"US-01172012-0002","Summary":"flickering bright star-like object hovering for 45 minutes observed","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around January 16th 2012"]}