{"divs":["Sighting Details I was driving northbound on I-25 and around 5-6 pm, when I saw a triangle of three red lights, two of which were blinking, above the freeway seeming to be moving east to west. It was absolutely silent. There were no other identifying markers lights or patterns like a helicopter or any other type of aircraft Ive ever seen, and I work near the Sun port. At first I didnt believe what I was seeing, but I kept my eye on it as best I could whiole driving on the freeway at 70. I lost sight of it as i followed the freeway into a gentle left turn. Ive checked with a pilot friend of mine and he says it doesnt sound like anything hes ever seen, and hes flown just about everything with wings. If anyone else in Albuquerque saw that thing, early evening on January 12 th, please hit me back. OH yeah, KOAT Channel 7 news, reported people saw a a meteor in their 10pm broadcast, HAH. Meteors dont have blinking lights on them...Ive SEEN meteors! Today, January 17th, I saw on you tube, that someone had videoed the object, same day same time."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.144953,+-106.57251(34909)&iwloc=A&hl=en\"> mufon case (34909) map </A>","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Summary":"three red lights, 2 blinking, one steady never blinking.","Tags":"City","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around January 12th 2012"],"Object Flight Path":"Straight-line path","Date of the Event":"01/12/2012 05:20 UTC","Region":"New Mexico","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/34909.html.txt","/var/www/straped/mufon/org/34909.html"],"Case Number":"34909","Country":"United States","Log Number":"US-01172012-0008","Source":"MUFON","Latitude":"35.144953","Longitude":"-106.57251","Object Features":"None","Date Submitted":"01/17/2012 05:03 UTC","Disposition":"Unresolved","City":"Albuquerque"}