{"files":["/var/www/straped/mufon/html2text/34906.html.txt","/var/www/straped/mufon/more/34906_submitter_file1__scottsnewphotos392.JPG","/var/www/straped/mufon/more/34906_submitter_file2__elohimpic001.jpg","/var/www/straped/mufon/more/34906_submitter_file3__mothermarry001.jpg","/var/www/straped/mufon/org/34906.html"],"Object Features":"Unknown","Region":"California","Log Number":"US-01172012-0005","City":"Littlerock","divs":["Sighting DetailsIm a freelance photographer and have been for 30 years now and i was going outside to take some pics of the sky about 3 months ago because it was a beautiful day but when i got to my back yard i saw something i didnt know what it was. So i started taking pics of it. I have had allot of sightings since i was very young. When i was 8 and my brother was 9 we where both walking down a country road when the whole SKY turned white over us. The next thing we remember is running home as fast as we could. 2hours had passed and we where only 100 feet from our house. We never knew what happened to us that day. I also have a photo of a UFO over Palmdale California as well. For some strange reason i have been drawing and writhing things down for a year now about humans and life here on Earth. Im going to write a book about the human CODE and our origins. Can Someone Please help me understand whats going on?"],"Country":"United States","Object Shape":"Other, Unknown","Object Flight Path":"Stationary","Viewing Distance":"21-100 Feet","Latitude":"34.53749","Disposition":"Unresolved","trends":["There have been 3 other sightings in Littlerock","There were no other sightings in Littlerock on or around September 10th 2011","This sighting has never been favorited.",""],"Date Submitted":"01/17/2012 12:58 UTC","Weather Factors":"Unknown","Date of the Event":"09/10/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.53749,+-117.966822(34906)&iwloc=A&hl=en\"> mufon case (34906) map </A>","Summary":"I went outside to take some photographys and when i got to my back yard there it was about 30 feet away hovering","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"34906","Longitude":"-117.966822","Source":"MUFON"}