{"map":"<A HREF = \"http://maps.google.com/maps?q=47.65691,+-117.319871(34911)&iwloc=A&hl=en\"> mufon case (34911) map </A>","Viewing Distance":"21-100 Feet","Log Number":"US-01172012-0010","Region":"Washington","Object Features":"Other","Date of the Event":"08/31/2002 01:00 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThis was a terrifying event for me. I contacted a relative when I got home in the middle of the night and she got me the name of someone here in Spokane who supposedly \"handled UFO incidents\". When I called him he asked me what happened and when I started to tell him he said, \"Yeah right, so you were chased by lights\". And then he hung up on me. So, I have been very reluctant to speak to anyone of authority regarding this event. Here I am, 10 years later, ready to tell anyone who wants to listen. I didn't realize this forum existed or I would have reported this event sooner. On approximately August 31, 2002, I was traveling back from Portland, OR to my home in Spokane WA. I had gone back to pick up some items I had not brought with me during my move from Portland to Spokane. The main hwy leading into Spokane from Portland is 90 and I believe it changes into 2 at some point. I was approximately 30 miles (I would have to go back there to be absolute on this) outside of Spokane when this incident occurred, driving in my car, alone, and wide awake. There are huge \"boulders\" on the immediate right side of the hwy. The boulders are really what the hwy is carved through. It's more like a \"wall\" of rock to the right side of the left lane going straight up approximately 20 ft. I would have to go back there to be more accurate on that. As I came around a little bend in the Hwy my attention was drawn to the top of the boulders on the left side. There was a huge object just laying on the top of the boulders, almost sideways.The predominant lights I remember were white, red and blue. There were many circles of round lights flashing sequentially with smaller circles of light traveling in the opposite direction within those circles. I was traveling at a speed of approximately 60MPH so I couldn't stop but my first thought was, \"What kind of roadwork is being done here in the middle of the night?..and on a boulder?\" As I look back it seems my mind was trying to place the object into a framework or context I could understand. With in a couple seconds after passing that place in the hwy where I had looked up to see the object, I saw 3 white lights in my rear view mirror. One of them traveled quickly to the back of my car, about 4 ft off the ground and I thought at first it was a motorcycle traveling at a high rate of speed that was going to crash into the back of my car. As soon as it reached the very back of the car it just \"blinked\" off as though someone had turned the light off. At the same time there were 2 other lights the same size traveling just as quickly to the left and right hand sides of the car but when they reached the back door level, the one on the left side, or the boulder side, just seemed to go straight up the boulder. The one on the right side did the same thing but as there are no boulders on the right side it just flashed off to the right and blinked off. They were basketball size and shape, maybe a little larger. There was absolutely no sound at all. I didn't have the radio on and my window was partially open as I like fresh air when I drive. The one light that came up behind my car did so several times. I was watching it and them in my mirror, my side mirror and over my shoulder. Every time they would start someways behind me and then travel so quickly towards the back of the car I was sure they would crash into me but they never did. I realized they were not motorcycle lights. Motorcycles cannot travel up a boulder or off the left side of the highway or almost hit the back end of my car repeatedly and then just disappear. I was utterly panicked. I felt like a rabbit being chased by wolves that were toying with me. There were no other cars traveling on that hwy during this time which lasted approximately 7-8 minutes. I didn't know what to do other than speed up and try not to crash my car as I couldn't take my eyes off them because I really believed something bad was going to happen to me. Then further down the hwy I saw a semi pulled into a gravel \"pit-stop\" nestled into the boulders on the right side of the road. I passed the truck and pulled in front of it skidding to a stop to ask for help. When I opened my car door and tried to get out I literally fell down to my knees and screamed \"motorcycles are chasing me\" to the driver of the semi who was standing in front of the truck. I simply didn't know what else to say because how could I explain what I saw. I must have looked so terrified that I actually scared him because he wouldn't approach me. He looked back down the hwy as I did and there was absolutely nothing coming. No lights, no cars, nothing. I told him, when I could get up, that I was trying to get home to Spokane and he said to follow him and he would honk his horn at the the Maple St. Bridge exit. I knew how to get there, it was just a few minutes on the same road but I didn't want to be on that road alone. So I followed him and kept watching for those lights in the mirrors and over my shoulder but they simply never appeared again. A couple days after the incident my mother located a retired air force colonel in the Spokane area who had been involved somehow in the UFO community. I do not recall his name. (He was not the same person I reached to report this incident to, who hung up on me.) I called him and we had a couple conversations. He told me he was well aware of UFO sightings by the air force when he was active and ALSO, that people routinely called the police in the area that this incident occurred with reports of strange lights. When I called the police to report seeing lights, just to hear their response, I was told no one had called in a report about anything like that on that evening or any other evening so I don't know if what he said was the truth or if the police were telling the truth. So I have sat with this incident over 10 years now and have told just my mother, 2 friends, the Colonel and the other person who hung up on me. I know what I saw and what I experienced. No one can take that away from me. This was not something I can find any explanation for other than I actually saw a UFO sitting on the boulders and then 3 lights came out of it and chased me for some reason. I have joked to my friends and mother that I was not interesting enough for them to take me. THANK GOD FOR THAT!!!! I have recounted this incident as clearly as I can. The images of the large object on the boulders and the 3 lights are burned into my memory like it happened last night. Thank you for this forum."],"Latitude":"47.65691","files":["/var/www/straped/mufon/html2text/34911.html.txt","/var/www/straped/mufon/org/34911.html"],"Weather Factors":"Unknown","City":"Spokane","Object Shape":"Circle, Unknown","Object Flight Path":"Stationary,Other","Longitude":"-117.319871","Case Number":"34911","Disposition":"Unresolved","Summary":"on Hwy 90 passed large object w/flashing lights sitting on top of boulders on left of car, then pursued by 3 \"lights\" basketball sizedfor several miles","trends":["There have been 41 other sightings in Spokane","There were no other sightings in Spokane on or around August 31st 2002"],"Date Submitted":"01/17/2012 05:20 UTC","Source":"MUFON","Country":"United States","Tags":"City"}