{"Weather Factors":"Unknown","Region":"West Virginia","Latitude":"39.33359","Object Flight Path":"Undisclosed","Date of the Event":"04/11/2005 12:00 UTC","Object Shape":"Undisclosed","Tags":"City","divs":["Sighting DetailsSighting Report: March 21st, 2005 @ 9:28pm at the corner of Sam Mason rd. and Route 11 my husband and I both witnessed a UFO above the house at that intersection. It was mostly clear skies, some clouds but not many. We were travelling North on Rt. 11 towards our turn onto Sam Mason, we were about 200 feet from our turn when I first noticed it. It was similar to the Air Force Stealth Fighter but without the points at the ends, there was flatness instead, and also 3 times as large as a Stealth Fighter. It was hovering above this house just above the treetops about 50 feet above the roof.There were two lights on the underside of it ,one on each \"wing-tip\", they were not blinking. The lights on our planes usually blink. Anyhow, as we drove closer, it rose higher and flew north into the clouds, it disappeared within seconds. There was no engine noise whatsoever. About a week or so later we saw a different UFO also driving home. The time was 9:28pm. It was a red glowing light that flew from east to west and then south effortlessly and within seconds. We watched it until we couldn t see it anymore. We didn t experience any \"missing time\" in either case."],"Log Number":"","Date Submitted":"04/11/2005 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.33359,+-78.053796(3491)&iwloc=A&hl=en\"> mufon case (3491) map </A>","City":"Bunker Hill","Summary":"Not Provided","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-78.053796","Disposition":"Insufficient Data","Country":"United States","trends":["There have been no other sightings in Bunker Hill","This sighting has never been favorited."],"Case Number":"3491","files":["/var/www/straped/mufon/html2text/3491.html.txt","/var/www/straped/mufon/org/3491.html"],"Source":"MUFON","Object Features":"Undisclosed"}