{"Object Features":"Undisclosed","Date Submitted":"01/17/2012 08:52 UTC","Object Shape":"Sphere","City":"Big rock","Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-87.767687","files":["/var/www/straped/mufon/html2text/34918.html.txt","/var/www/straped/mufon/org/34918.html"],"Sighting Duration":"Undisclosed","Log Number":"US-01172012-0017","divs":["Sighting DetailsSunday between 0915 and 0930 AM myself and a friend observed a red tailed hawk circling above us screeching and acting erratically. The hawk was very verbal and raising her body to a point where she was stalling midair then she would recover and circle us once again. While watching this I commented to my friend that I had never seen a hawk act that way. He also said the same. Looking at the hawk I saw two white dots racing along a a modest speed, roughly the speed of a say F-4 Phantom at twenty or Thirty thousand feet, I say this because I have observed the latter and this experience I had a hard time judging the size of the obejects so I am at a best guess trying to guess size and altitude. Both white round shapes flew in formation with each other for at least forty seconds. the object on the right took a ninety degree turn, excelerated and vanished. The object on the left continued straight for at least two to four seconds and vaninshed in a straight line both objects were on a northwest heading. I asked my friend what the hell is that, do you see those, he replied yes, he said I don't know. We had some more what the hell are they comments and then we both said where did it go? We turned and looked back almost straight up and looked for the hawk, my friend said where the hawk go, I said it was right there, but it was gone. Both of us looked at the sky around us and I said to my friend look theres five more of those. I asked him are the gulls from the river and he said he thought that they were to high. I said to him why would birds glint sun light like a mirror, he said he didn,t think they were birds. As this conversation was happening we were observing the five white objects, identical to the first two in shape, size and altitude. They were flying in a five star formation, same speed and unequal distance from each other, not a tight or precise formation. They flew twoard us on a northwest heading. We observed them for twenty to forty seconds, when they started to circle each other some turning left some right. They did advance forward in their flight path at the same speed for maybe ten seconds, prompting me to ask my friend if he thought they were birds. His response was no and that birds don't shine like a mirror. All five objects then resumed their original formation and continued northwest on the same path as the first two, excelerated and vanished from right to left. We both looked at each other and laughed, I asked my friend was that strange or what. He said we probably ought not to tell anybody as they would think we had started drinking. I am a retired Army Aviator and have many experiences in aviation, flying and aerodynamics. I don't know what I saw but I can tell you after careful consideration they were not gulls or any other type of birds. The hardest thing I find myself struggling with is at what altitude and what size and speed were they traveling. Thank you, Brian"],"Date of the Event":"01/15/2012 09:20 UTC","Tags":"City","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Big rock","This sighting has never been favorited."],"Case Number":"34918","map":"<A HREF = \"http://maps.google.com/maps?q=36.566192,+-87.767687(34918)&iwloc=A&hl=en\"> mufon case (34918) map </A>","Region":"Tennessee","Latitude":"36.566192","Summary":"Seven round white objects viewed at altitude and moderate to high speed","Country":"United States","Source":"MUFON","Viewing Distance":"Unknown"}