{"files":["/var/www/straped/mufon/html2text/34923.html.txt","/var/www/straped/mufon/more/34923_submitter_file1__LaConchita2RinconMapped.jpg","/var/www/straped/mufon/org/34923.html"],"Case Number":"34923","Disposition":"Unresolved","Summary":"very high elevation jet with thick red contrails extemely fast followed by slowly falling green glowing orbs","Sighting Duration":"Undisclosed","Object Features":"None","Viewing Distance":"Over One Mile","Date Submitted":"01/18/2012 01:20 UTC","Latitude":"34.404704","Tags":"City","Log Number":"US-01182012-0001","map":"<A HREF = \"http://maps.google.com/maps?q=34.404704,+-119.514876(34923)&iwloc=A&hl=en\"> mufon case (34923) map </A>","divs":["Sighting DetailsI was driving home from working all day in Thousand Oaks and traveling Northbound on the 101 freeway in California. I was driving along the stretch of freeway that is no more than 50 feet from the Pacific Ocean. The view of the ocean and Channel Islands is completely un-ubstructed from houses or trees, but there was a terrific sunset with a marine layer creeping in on the horizon, so the Channel Islands were not as imedietly apparent like they would be on a clear day. What drew my attention away from what I would ussually be looking at during this point of my freeway drive home(the great waves at Rincon Point) was a spiraling con-trail on the edge of the horizon that was in clear contrast compared to the milky sunset transpiring. Cant remember if the sun was still up, but the time was right around 5:00pm pst and i wundered from where they were doing this launch, and did it fail or something? The trail cut off right where the marine layer stopped and there was nothing but clear skies above....so thats why i thought something must have gone wrong because i would have expected it to contiue and be connected to it's maker. Then all of a sudden at about a 45degree angle from my car window vantage point, i noticed a Jet. Then i really noticed the jet, and how high in elevation, but how large at the same time it was. Nothing about this jet screamed UFO but it was hauling butt along the skyline and looked to be performing some slight s turns that looked very controlled. The Contrails from the jet disipated very fast...maybe 10-20 times the jets body length, but at the jet's tail i could tell these trails were extremely thick and seemed like a double or tripple width contrail and where a dark reddish color. I thought this could be because of the orangy sunset going on. As soon as the Jet left my vantage point from my car driver side window which took 1or 2 minute tops, I started wundering if this was ejected from a sub,San Nicholas Island,or simply a plane coming over the horizon from overseas. Thats when i noticed I noticed two very bright glowing balls that where about midway from the marine layer and the coastline, and maybe 1000 feet of the ocean level, or just about where i first noticed the jet(at 45degrees) The reason i was looking out there again and not trying to stretch my head out the window and keep watching the jet overhead was because i wanted to see the relationship of the trail to the Islands to see if it could have come from our outer island San Nicholas which is never visable from our shores,but i never made that calculation due to seing the bright glowing green balls which took all my attention. I had to keep my eyes on the road, but my second look at the glowing balls gave me enough time to notice they were very slowly falling in the direction of the sea. Not nearly as fast as a freefall would be, no matter what it's distance out to sea, or elevation could have been, so i'd say it was more of a slow deliberately decent. The freeway took a sharp turn inland about this same time, and no longer offered the view i needed to keep viewing. I did'nt react or feel like i thought i would given such an occurance...it almost felt like a normal everyday thing, especially when i started asking myself all the questions like \"why did'nt you pull over?\" \"why did'nt you look longer?\" \"why did'nt i try to flag some other drivers down and point to the horizon and see if they saw it too?\" \"Why did i not at least look at my car clock to find out the exact time?\"(i always do that immedietly whenever something wierd happens) My only explanation for my lack of excitedness and panic is that maybe i thought the message i was seeing would mean something to me, or become more explosive visually, but it did'nt, or i was'nt able to watch it close or long enough due to the crazy trafic at the time. I measured the distance of the freeway where i was seeing this on a mapping sevice and it was about 3 miles , and i was traveling around 75 to 80 mph and with the flow of traffic which was very congested, so potentially there are hundreds of people who if looking out at the ocean could not have missed the jet or the orbs I Hope this Helps anyone who might have also seen this out there, and am very excited to see if there were some details or later happenings that i missed."],"Date of the Event":"01/16/2012 12:00 UTC","Country":"United States","Object Flight Path":"Stationary,Other","Weather Factors":"Unknown","City":"Carpinteria","Longitude":"-119.514876","Region":"California","Object Shape":"Sphere","Source":"MUFON","trends":["There have been 5 other sightings in Carpinteria","There were no other sightings in Carpinteria on or around January 16th 2012","This sighting has never been favorited.",""]}