{"Object Flight Path":"Undisclosed","Source":"MUFON","Case Number":"3492","Log Number":"","Viewing Distance":"Unknown","Latitude":"34.149448","map":"<A HREF = \"http://maps.google.com/maps?q=34.149448,+-118.248555(3492)&iwloc=A&hl=en\"> mufon case (3492) map </A>","Date of the Event":"06/20/2005 03:40 UTC","Longitude":"-118.248555","Country":"United States","Disposition":"Unresolved","divs":["sighting detailssighting report: this took place on march 10 1990 on a clear ski night at 11 pm in gyumri, armenia. the object appeared to be about 200-300 yards high and its size was greater than the wingspan of 2 airbus planes. the object was metallic\\dark and shaped like 2 saucers on top of each other. the top part was a little more dome chaped and bottom more flat-like. its shape, although it was visible even without the lights (moon-light), was \"outlined\" by lights and there were additional lights on the bottom half of the disc that were multicolored (projector-like). it had not cast a single light in the direction of the land when i had seen it. it was a cold night winter was just starting to end with snow and frost everywhere still. this had happened only about a year and change after the devastating earthquake in armenia, and i had heard from otherw who had said they d seen ufo s in that area on different days. another day (summer of that same year) people had reported seeing a ufo that had hovered in the midst of the day in the air for a long time (20-30 minutes) the presence on the ufo that i had seen was very impressive and its unmistakably un-earthly, non-human make was eminent. after i had noticed it, it hovered in the air for perhaps 30 seconds then took off in one direction and up, stopped for a second and took off high into the air and became smaller than a star in seconds and disappeared. if you have questions please do not hesitate to contact me"],"trends":["There have been 13 other sightings in Glendale","There were no other sightings in Glendale on or around June 20th 2005"],"Weather Factors":"Unknown","City":"Glendale","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/3492.html.txt","/var/www/straped/mufon/org/3492.html"],"Summary":"Dark Metallic Saucer over Gyumri, Armenia","Date Submitted":"06/20/2005 03:40 UTC","Object Shape":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Region":"California"}