{"Longitude":"-122.357257","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Fireball, Sphere","Weather Factors":"Unknown","Object Features":"None","Latitude":"40.594948","trends":["There have been 39 other sightings in Redding","There was one other sighting in Redding on or around January 17th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.594948,+-122.357257(34933)&iwloc=A&hl=en\"> mufon case (34933) map </A>","Log Number":"US-01182012-0011","Object Flight Path":"Path then hovering","Country":"United States","Date of the Event":"01/17/2012 08:00 UTC","Viewing Distance":"101-500 Feet","Summary":"two bright silent orbs/lights seemed to be moving then hovered ascended/slowly faded out","Region":"California","files":["/var/www/straped/mufon/html2text/34933.html.txt","/var/www/straped/mufon/org/34933.html"],"City":"Redding","Case Number":"34933","divs":["sighting detailsmy aunt and uncle and i were on collyer drive heading toward country oaks drive. when i noticed two red lights in the sky. at first i thought it was the lights on top of antennae but realized there were none in that direction. that direction being north towards shasta lake city. i then asked my aunt and uncle \"what is that\" and they replied \"i dont know, what is it?\" as we turned down country oaks drive the lights seemed to be moving with us, getting closer to each other in relation and closer to us. almost to the point were it seemed like it was an airplane gliding in for a crash landing or something. but again there were no blinking lights or any green lights on whatever it was. we finally stopped the car on mica ct. where we had a good view and to our surprise no sound at all. and they just seemed to hover there and then slowly faded\\ascended to nothing. it was also slightly cloudy\\overcast out. almost seemed as if they went up into the clouds. or just slowly went out. the whole experience had all of us slightly uneasy and had the adrenaline going. as we all had a feeling it was a ufo. neighbors up the street also had seen it and were outside there house as it was happening. and asked us if we were seeing what they were seeing. after they disappeared we did not see anything else.."],"Date Submitted":"01/18/2012 03:16 UTC","Tags":"City"}