{"trends":["There have been 8 other sightings in Gulfport","There were no other sightings in Gulfport on or around January 11th 2012","This sighting has been favorited 1 time.",""],"Tags":"City","Country":"United States","City":"Gulfport","Case Number":"34931","Disposition":"Unresolved","Summary":"My girlfriend and i witnessed a very loud and unknown jetlike sound.","Object Flight Path":"Unknown","Weather Factors":"Unknown","Region":"Mississippi","divs":["Sighting DetailsMe and my girlfriend were watching television tuesday night after work when we started to hear a loud low rumble, like fighter planes. I immediately jumped off the couch and ran onto our 3rd story balcony, where i saw nothing but the sound was incredibly loud. I was scared we were being bombed or something. After 5 minutes or so of me and my girlfriend searching for what it was, we decided it was not a conventional plane departing from the airport within five miles of our house, but something we have never heard before, almost like a moan or scream of some kind. it sounded like jet planes were hovering above our apartment, i know that we arent the only people to hear this. I called keesler air force base at exactly 11:10(i have images from my phones call logs documenting the following) and informed them that there was a loud aircraft like noise hovering over our house, and that we were wondering if we should be worried or not. The man who picked up the phone said he would check and be right back. When he returned, he confirmed that there was nothing unusual going on in the area, and that he could connect me to the radar center if id like, so i agreed. The guy at the radar center said that he didnt show anything, but didnt even ask me where i lived? I was immediately transferred back to the original guy i spoke with, and when he informed me there is nothing else he could do, i said thank you and hung up. I know for a fact im not the only person that heard those noises, in gulfport that night. we live in an apartment complex!"],"Date of the Event":"01/11/2012 11:05 UTC","Longitude":"-89.044445","Latitude":"30.399752","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.399752,+-89.044445(34931)&iwloc=A&hl=en\"> mufon case (34931) map </A>","Source":"MUFON","Date Submitted":"01/18/2012 11:09 UTC","Object Features":"Unknown","Log Number":"US-01182012-0009","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/34931.html.txt","/var/www/straped/mufon/more/34931_submitter_file1__photo-3.jpg","/var/www/straped/mufon/org/34931.html"],"Object Shape":"Unknown"}