{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.101192,+-77.573312(34939)&iwloc=A&hl=en\"> mufon case (34939) map </A>","Object Shape":"Flash, Sphere, Star-like","Latitude":"44.101192","Tags":"City","Date Submitted":"01/18/2012 08:56 UTC","Case Number":"34939","Weather Factors":"Unknown","Region":"Ontario","Disposition":"Unresolved","trends":["There have been 2 other sightings in Trenton","There were no other sightings in Trenton on or around January 18th 2012"],"Log Number":"CA-01182012-0017","divs":["Sighting DetailsMy family was heading home from a movie heading west on Hamilton rd. Then myself and my wife noticed a strange light high in the sky sharply changing direction unlike any of the aircraft in the sky at the time. Once witnessed I stopped the car to get a better look. The object had very brights pulsing white and red, moving quickly up and down a large distance, along with sharp movements left and right. Lights were not like any aircraft I've seen, and there were aircraft in the area at the time to compare it to. We then proceeded down the road to get a better vantage point and observe for a while. As we moved to a better location we witnessed its sharpest movement straight down and then ascend slightly. Once at a better vantage point, we witnessed the object drop closer to the horizon as well as sharply moving left and right. The object eventually dropped below the horizon and never appeared again. The object appeared to be a fair distance away to the West with very bright pulsing lights."],"Longitude":"-77.573312","Date of the Event":"01/18/2012 07:30 UTC","files":["/var/www/straped/mufon/html2text/34939.html.txt","/var/www/straped/mufon/org/34939.html"],"Source":"MUFON","Summary":"Pulsing red and white lights with sharp changes in direction. Up, Down, Left, Right","City":"Trenton","Country":"Canada","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed"}