{"trends":["There have been 3 other sightings in Little Elm","There were no other sightings in Little Elm on or around December 17th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.168359,+-96.934095(34938)&iwloc=A&hl=en\"> mufon case (34938) map </A>","Region":"Texas","Date of the Event":"12/17/2011 12:00 UTC","Latitude":"33.168359","divs":["sighting detailsabout 5 weeks ago i was sitting on my front porch and noticed a bright light right above a house one block down from me. i didn't think anything at first, then after while i noticed it moving staight up and the definitely got my attention. i started watching it every night including tonight. it usually appears betweem 6:00 - 6:30pm every night only it is really high up. after it first appears, then i started seeing smaller, not so bright, i think cigar sharped crafts filling the sky. i believe that the larger crafts are dropping them off and then later picking them up. about 2 weekthey ago i went out to the front yard and looked straight up and there was a second large, bright light like the first one i saw. if i could stay up later than 11:00pm or so i would see more. 1. i was sitting on my front porch 2. the brightness of the craft made me notice it 3. maybe a tower with a light. i really didn't pay attention until it started moving up an down. 4. when the larger objects appears, they are coming down from really high up. they eventually come to a complete stop for about 30 seconds then move again and come to a complete stop. they repeat this for about an hour or 1 1\\2 hours. then they ascend an more or less hover. sometimes jets fly very close above it or below it and it will back off for about 5 minutes and then come right back forward. they are always in sight. 5. at first i was totally shocked and excited. the first thing i did was run into the house and tell my family. they all said i was crazy and won't even talk to me about it. i tried to find a group that would interested (on the internet). i emailed \"realufos\", but never got a response back so i finally gave up. then a fried told me to go to \"mufon\". now i am kinda of used to it, but i am still bewildered. i go out and sit on the front porch every night and watch what they are doing. 5. i haven't lost sight of them. when i get through with this i am going outside to see what is going on. i have been asking myself, am i the only one seeing all of this. you are welcome to call me if you have questions. i don't have a good camera because if i did believe me i would have taken pictures."],"Object Flight Path":"Path with directional change","Country":"United States","Source":"MUFON","Object Shape":"Boomerang, Cigar, Cylinder, Triangle, Other","City":"Little Elm","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"Seeing crafts (more) than one for about 5 weeks","files":["/var/www/straped/mufon/html2text/34938.html.txt","/var/www/straped/mufon/org/34938.html"],"Log Number":"US-01182012-0016","Longitude":"-96.934095","Object Features":"Unknown","Date Submitted":"01/18/2012 08:44 UTC","Viewing Distance":"Unknown","Case Number":"34938"}