{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Latitude":"40.424824","Region":"Colorado","City":"Greeley","files":["/var/www/straped/mufon/html2text/34932.html.txt","/var/www/straped/mufon/org/34932.html"],"Weather Factors":"Unknown","Object Features":"Unknown","Disposition":"Unresolved","Sighting Duration":"00:30:00","Log Number":"US-01182012-0010","Case Number":"34932","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsI was in a car going west back home on highway 14 from a few miles east of Ault Colorado and the highway curved to SW and that is when I started to see these light orbs and they looked like they were above Greeley and we were about 45 minutes north of Greeley so I assume that they were pretty far from the car. I noticed it because I thought it was a airplane but doesnt have blinking lights. I was on the passenger side in the front and thought that this was just an airplane at first but ten minutes later there were two bright white orbs hovering about 1000+ feet in the air then a third one appeared out of nowhere and then one started to dim so much that I could barley see it. This was right after sunset but there was still light in the sky from the sun. After a few minutes a fourth one appeared and then a fifth one but then it disappeared after a few seconds and it never came back. The remaining four just continued to hover and change color and altitude then one disappeared and there were three left. The highway curved again and went straight west instead and South West and I had a hard time looking at them so my little brother started watching them from the back seat and there were still three for another five minutes or so. Then one of them started to go to a really low altitude, it looked like it was 100 feet from the ground or less but then again we were at least a mile or more away. The UFO that went to a really low altitude turned a dark reddish yellow and hovered there for a few minutes and we thought that it was picking somebody up. When I saw these UFOs I was really excited and felt a rush even though we were at least a mile or more away and when I was trying to watch the really low altitude UFO I felt like screaming in joy because I knew it was NOT a plane because planes do not go that low. The low hovering UFO started to go back to a higher altitude and the glow changed back to a bright whitish-blue. Then after a few minutes they started disappearing one by one first with two left over then one and then that one completely disappeared and we were back in Fort Collins by that time."],"Date of the Event":"01/15/2012 05:20 UTC","Longitude":"-104.704782","Date Submitted":"01/18/2012 01:01 UTC","trends":["There have been 19 other sightings in Greeley","There were no other sightings in Greeley on or around January 15th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.424824,+-104.704782(34932)&iwloc=A&hl=en\"> mufon case (34932) map </A>","Source":"MUFON","Summary":"I was in a car watching it from far away and there were up to 5 light orbs dimming and brightening going up and down","Object Shape":"Oval, Sphere, Star-like"}