{"Country":"United States","trends":["There have been 5 other sightings in Manhattan","There were no other sightings in Manhattan on or around January 19th 2012"],"Summary":"LARGE unseen object going SLOW towards west very close to ground VERY LOUD","City":"Manhattan","Log Number":"US-01192012-0006","Object Flight Path":"Straight-line path","Source":"MUFON","Object Features":"None","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.185508,+-96.569349(34955)&iwloc=A&hl=en\"> mufon case (34955) map </A>","files":["/var/www/straped/mufon/html2text/34955.html.txt","/var/www/straped/mufon/org/34955.html"],"Date of the Event":"01/19/2012 11:55 UTC","Region":"Kansas","Longitude":"-96.569349","Object Shape":"Other, Unknown","Disposition":"Unresolved","Date Submitted":"01/19/2012 09:01 UTC","Tags":"City","Latitude":"39.185508","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsAbout 5 or 6 people were outside the wal-mart parking lot last night, I think some of them were employees on break. I was walking to my car to put my groceries in and all of a sudden i heard this BIG rumbling noise coming from the sky. I thought it might of been some kind of aircraft and looked up to see it (please keep in mind last night was CLEAR! there was NO cloud coverage) and I didnt see a thing! I could hear a BIG craft going slowly over the parking lot. It sounded like it was RIGHT OVER us but I didnt see anything. The people on their break were also looking up at the sky and it looked like they couldnt see what it was either - but I know they all heard it. I felt a little bit warmer when it passed right above, and somehow calmer, like I wasnt scared like I was before it did. Its hard to explain it. I tried to record the sound with my cell phone but it kept turning off the whole time - no matter how many times I tried to turn it on. after it was pretty much gone all the people outside went back inside but I stayed to see if I could see what it could have been - maybe look at some lights that might come off of it and as soon as I couldnt hear it anymore I saw 2 jets racing towards whatever went over the parking lot. Around the same time I heard several sirens going West as well. Could this have been something flying towards ft. riley - which is in that direction? And if it was HOW could it have flown so slowly? It took about 3 and a half minutes for it to get just barely over Manhattan - which isnt that big of a town. Im still a little spooked and just want to know if ANYBODY else heard it?"],"Sighting Duration":"00:03:30","Case Number":"34955"}