{"Case Number":"34953","Longitude":"-118.464528","Latitude":"34.305","Date Submitted":"01/19/2012 07:53 UTC","divs":["Sighting DetailsMyself and a friend went outside to go to the store we stopped in the driveway to comment on how clear it was and how many stars we could see. As we were facing south east we both suddenly saw a pencil shapes bright white solid light shot across the sky from west to ,east in less than a second in a perfectly straight line. than made a sharp right angle turn than up it went as fast as it went across. My friend livers a top a plateau that has a view of the whole valley. We had never seen anything move that fast. There was no sound we could hear and it seemed to be much higher than the planes in that area. We have both seen many shooting stars, comets missiles ,fighter Jets etc nothing moves as fast as this.. we are in our 40s and 50s and both saw the same thing . The whole event lasted about second or less. I've waited my whole life to see something like this what a great night!"],"Tags":"City","Date of the Event":"01/19/2012 01:10 UTC","Weather Factors":"Unknown","Country":"United States","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=34.305,+-118.464528(34953)&iwloc=A&hl=en\"> mufon case (34953) map </A>","Log Number":"US-01192012-0004","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Summary":"Myself and a friend went outside to go to the store we stopped in the driveway to comment on how clear it was and how many stars we could see. As we were facing south east we both suddenly saw a pencil shapes bright white solid light shot across the sky","Sighting Duration":"00:00:01","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around January 19th 2012"],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/34953.html.txt","/var/www/straped/mufon/org/34953.html"],"Source":"MUFON","City":"Los Angeles","Viewing Distance":"Over One Mile","Region":"California"}