{"Region":"","Date of the Event":"01/18/2012 08:40 UTC","City":"San Juan","Country":"Commonwealth of Puerto Rico","Tags":"City","Summary":"Huge Triangular UFO Sighting in San Juan Puerto Rico","map":"<A HREF = \"http://maps.google.com/maps?q=18.475364,+-66.101442(34956)&iwloc=A&hl=en\"> mufon case (34956) map </A>","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/34956.html.txt","/var/www/straped/mufon/more/34956_submitter_file1__whatwesaw2012.JPG","/var/www/straped/mufon/org/34956.html"],"Date Submitted":"01/19/2012 10:09 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-66.101442","Weather Factors":"Unknown","Log Number":"PR-01192012-0007","Source":"MUFON","Case Number":"34956","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Latitude":"18.475364","Object Features":"Unknown","divs":["sighting detailsit was between 8:40 - 8:45 pm. i was on my apartment with my wife watching tv. we live on the sixth floor. we usually see alot of air traffic since the international airport is very close by and we're used to watch planes flying around. i was looking to the outside and i saw these three huge gold\\copperish lights in the distance along with two blinking\\pulsating red lights (one on top and one under the ship). i told my wife to take a look since the lights configuration didn't like the regular airplanes we use to see at night. she confirmed that it was a very different light configuration and the flight path, while being close to the regular path for other planes it was somehow different. the flight speed seemed to be very slow compared to other planes we've seen flying past by. i kept watching and the object began to turn. i was amazed of it's size. it was a little bigger than a 787. while the object was turning its cruising speed was very slow. slower than the commercial airplanes we've seen fly by. i could easily see it was triangular. the three huge lights formed the triangular shape while on top and above of the object on its center you could easily see a big red pulsating light. both red lights pulsated at the same time while the other lights fixed. i tried to follow the object for as long as i could but other buildings blocked my view. it was the biggest ship i have ever seen flying."],"trends":["There have been 12 other sightings in San Juan","There were no other sightings in San Juan on or around January 18th 2012","This sighting has been favorited 1 time.",""]}