{"Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Dome","Date of the Event":"10/16/2011 12:00 UTC","Longitude":"-95.118264","Weather Factors":"Unknown","Log Number":"US-01192012-0005","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Unknown","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.537732,+-95.118264(34954)&iwloc=A&hl=en\"> mufon case (34954) map </A>","City":"Webster","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/34954.html.txt","/var/www/straped/mufon/more/34954_submitter_file1__IMG_1200.JPG","/var/www/straped/mufon/more/34954_submitter_file2__IMG_1157.JPG","/var/www/straped/mufon/org/34954.html"],"trends":["There have been 3 other sightings in Webster","There were no other sightings in Webster on or around October 16th 2011","This sighting has never been favorited.",""],"Summary":"Wings Over Houston UFO sighting","Latitude":"29.537732","divs":["sighting detailsi was at the wings over houston airshow on october 16, 2011 photographing the various aircraft taking part in the aerial demonstration. i was shooting with a canon xsi dslr with a 75-300mm lens. i did not notice anything out of the ordinary while shooting that day. on january 18, 2011 i was showing the airshow photos to a coworker when we spotted an object in a photo with a f-4 phantom. i had not seen this object previously during my brief post airshow review of the photos. im not sure if anyone else noticed the object at the airshow. the lens was clean and no dirt was present on it. i have compared the image to other images with aircraft flying at a distance in the background and they do not match. object does not match any other the vintage or cirrent type aircraft that were present at the airshow. there were 2 p-51s in the distance while the f-4 was performing its demonstration but the object doe not seem to match them either. i work as an aerial observer\\photgrapher and also worked in aviation in the marine corps for 12 years. this does not appear to be a manmade aircraft in my opinion. i have attached the digital photo that was taken that day of the airshow and i have also attached a photo that has aircraft in the front and distance of the photo for a comparrison."],"Object Shape":"Disc","Date Submitted":"01/19/2012 08:58 UTC","Case Number":"34954"}