{"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Region":"Selangor","divs":["sighting detailswe were on our way to port klang from kula lumpur driving on a small highway road at ~4:30am when i (the passenger) noticed 2 disc shaped objects hovering stationary in the sky at a 30degree pitch off the horizon. one was within a mile of us and the other was behind it about a mile and a half. they were exaclty alike in size and shape and seemed to be coordinating a 2 vessel observation. they just stayed still in the same relation to each other and emitted the same color patterns. the top half glowed a greenish\\blue pastel color and the bottom half a yellow\\orange pastel. it was still dark so we could see them very well. they were very large crafts and i would guestimate ~300 feet diameter. we pulled to the side of the road and got out of the car to observe. we thought maybe they were tower lights or something but as the sun rose we could still see them and there was nothing even close to the crafts. after 2 hours they were still there and we could still faintly see them as the morning went on. the 2 crafts maintained their positions until they went out of eyesight range due to earth rotation. we never saw them move in 2 hours and when we arrived at our destination even the company security guards were watching them trying to figure out what they were. my personal feelings were that of amazement, being an engineer i couldn't figure out an explanation for an aircraft that didn't need lift to fly. you have to move to create lift. also, why didn't they care if we saw them? obviously it was not a experimental military excersise. they didn't seem to care that thousands of people on the ground were looking at them, there was no fear or concern of military (human) intervention. i to this day am totally puzzled as to why they were elevated over the malaysian jungle in the middle of nowhere. it also made me feel a bit scared, small and helpless due to their boldness. i had the feeling they could have done whatever they wanted."],"City":"Port Klang","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=3.004169,+101.413376(34966)&iwloc=A&hl=en\"> mufon case (34966) map </A>","Latitude":"3.004169","files":["/var/www/straped/mufon/html2text/34966.html.txt","/var/www/straped/mufon/org/34966.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Longitude":"101.413376","Date of the Event":"01/15/2008 05:00 UTC","Object Features":"Dome","Object Shape":"Disc","Summary":"We were traveling early in a car from Kuala Lumpur to Port Klang in Malaysia when we noticed 2 large disc shapes hovering in the sky","Country":"Malaysia","Date Submitted":"01/19/2012 02:21 UTC","trends":["There have been no other sightings in Port Klang","This sighting has never been favorited."],"Log Number":"MY-01192012-0017","Case Number":"34966","Weather Factors":"Unknown"}