{"Tags":"City","divs":["Sighting DetailsTo Whom it may concern: this note is not to report a sighting, but to clarify one. I was just checking in on a report I made in 2009 and found it on your site. the case was given a number.... #22524 I would like to emphasize the lights I saw were not flares! First of all, Rutland is due west of West Lebanon, about 60 miles away, with lots of terrain in between. I stated in my report that I was in WEST LEBANON looking EAST. Even if these lights had been flares, they were low to horizon. Even looking westerly, towards the Rutland area, I would not have been able to see lights due to topography, to say nothing of the size of a flare, verses distance, and size of lights we saw. Again, the lights we saw did not waiver, have trails or drop, as flares would. I would seriously like to speak in person to Mr. Steve Firmani, State Director of Mufon, to find out exactly how he based his conclusion. I also want to note, that I am very disappointed in the way this research was conducted. One would think the investigator should have interviewed, in person, to get the facts, and see location of sighting and details to make sure information is complete. Respectfully, Jane"],"Object Flight Path":"Stationary","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Lebanon","There were no other sightings in Lebanon on or around November 19th 2009"],"Object Shape":"Sphere","City":"Lebanon","Disposition":"Unresolved","Latitude":"43.638189","Date Submitted":"01/19/2012 12:39 UTC","Date of the Event":"11/19/2009 06:15 UTC","Summary":"round orange/yellow lights only - blinked on and then off in straight line at slight upward angle. did not move.","map":"<A HREF = \"http://maps.google.com/maps?q=43.638189,+-72.31902(34961)&iwloc=A&hl=en\"> mufon case (34961) map </A>","Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/34961.html.txt","/var/www/straped/mufon/org/34961.html"],"Log Number":"US-01192012-0012","Longitude":"-72.31902","Case Number":"34961","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"New Hampshire","Country":"United States"}