{"Disposition":"Unresolved","Object Shape":"Fireball, Flash, Sphere, Star-like","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Date Submitted":"01/19/2012 01:03 UTC","Case Number":"34963","files":["/var/www/straped/mufon/html2text/34963.html.txt","/var/www/straped/mufon/org/34963.html"],"Longitude":"-79.899158","map":"<A HREF = \"http://maps.google.com/maps?q=33.384688,+-79.899158(34963)&iwloc=A&hl=en\"> mufon case (34963) map </A>","Object Flight Path":"Stationary,Path with directional change,Path then hovering","divs":["Sighting DetailsLooking north from the property I noticed 4 to 6 flashing star-like objects in the northwest. They were moving to the east. It was a clear, chilly moonless evening. Very light wind. My wife, in her 40's, my son and daughter, in their 20's, and myself in my 50's, witnessed these events after I called them outside. As they went at about 10 degrees elevation from our vantage point on the horizon, when they had reached due north, an orb about the size of an aspirin lit up in a reddish orange color. It was located in the north east atmabout 15 degrees elevation. It stayed lit between 2 to 4 seconds, then disappeared. The starlike objects headed to that general area and gained a slight altitude. They then finally went out of sight in a northeasterly direction behind the tree line. We never heard any sound connected with these craft. After this, there were military aircraft which could be seen and heard flying in that area and later all over the skies. There were either 2 or 4 jets involved traveling in pairs. My daughter left in fear to go home to her husband. My son was amazed and loved what he was seeing. We, my wife and I, had previously told them of these lights that we have seen two times before. This is my first time reporting to this site and the first time our children saw the lights with us."],"Date of the Event":"01/18/2012 08:15 UTC","Latitude":"33.384688","Object Features":"Unknown","Viewing Distance":"Over One Mile","Summary":"4 to 6 starlike flashing crafts heading west to east then a reddish-orange orb illuminates and goes out.","Tags":"City","Region":"South Carolina","trends":["There has been one other sighting in St. Stephen","There was one other sighting in St. Stephen on or around January 18th 2012"],"Source":"MUFON","Log Number":"US-01192012-0014","City":"St. Stephen"}