{"Object Flight Path":"Straight-line path","Country":"United States","City":"Granite Falls","Object Features":"Window(s), Patterned Surface","Latitude":"35.785151","Sighting Duration":"Undisclosed","Object Shape":"Disc","Source":"MUFON","Summary":"disc. shaped craft moving very slow no sound very low.","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","trends":["There have been 2 other sightings in Granite Falls","There were no other sightings in Granite Falls on or around October 10th 1979"],"divs":["Sighting Detailswas with my mother years ago going to get a freind 2 spend the night. i was 14teen mabe 15teen we saw lights 2 the south 2 beams like thay were lookin for somthin. mom seen it and started sayin is that a ufo i told her no it was a helicopter lookin crops as people would put plants out n the woods u no? any way got 2 my freinds house i went n heard mom screming got my freind and went outside looked up and a disc was right over the car.she said it put a beam of light down on her i didnt see that but i did see the disc. it was huge mabe the size of a walmart scared the crape out of me went next door where my freinds brothers lived just across the street 2 get them 2 come out. thay saw it also there was a scatingring across the street people allways out side smokeing no one this time i looked.the parking lot and all would have fit inside dont realy remember color of outside but on the very outside edge looked like windows. had a dome top with windows also and had a red light looked like it was inside was making a reflection like a police car light would if it was on the dash the light kept going aroundthe windows would reflect it.very long time ago just thought id tell that im 47 but even though ive. notseen a bigfoot i dont pokefun of people that do any more. buy theway this happend n sawmills nc."],"Region":"North Carolina","Case Number":"34979","files":["/var/www/straped/mufon/html2text/34979.html.txt","/var/www/straped/mufon/org/34979.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.785151,+-81.492872(34979)&iwloc=A&hl=en\"> mufon case (34979) map </A>","Log Number":"US-01192012-0030","Date of the Event":"10/10/1979 06:30 UTC","Weather Factors":"Unknown","Date Submitted":"01/19/2012 05:43 UTC","Longitude":"-81.492872","Tags":"City"}