{"Region":"","files":["/var/www/straped/mufon/html2text/34977.html.txt","/var/www/straped/mufon/more/34977_submitter_file1__328267_10150587713498125_715338124_10863193_2032155686_o.jpg","/var/www/straped/mufon/org/34977.html"],"Date of the Event":"12/18/2011 08:15 UTC","Disposition":"Unresolved","Object Shape":"Fireball, Square, Rectagular","Object Features":"Undisclosed","City":"Whitecraig","trends":["There have been no other sightings in Whitecraig","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United Kingdom","Summary":"4 different sightings in one week. I.blue fireball shot over house. 2.yellow, cream pearl like light floated over house.3 bright light, blink then vanish. 4 star like object that dropped silver tears.","Log Number":"GB-01192012-0028","Latitude":"55.902042","map":"<A HREF = \"http://maps.google.com/maps?q=55.902042,+-3.044052(34977)&iwloc=A&hl=en\"> mufon case (34977) map </A>","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsFrom November through December there seemed to be a lot of activity over the east-mid lothian. The first thing I saw was a blue ball streak across my house then take a upward turn into the clouds and vanish. It left a sparkle trail behind it. I thought at first it was a firework, but it was silent and flew horizontally for a few hundred feet before turning skyward and moving off through the clouds. The next sighting was a gold coloured ball moving toward the pentland hills. It appeared to land then take off and return the way it had come, moving toward the south. I took a photo of this, which I will post here. The next incident was a cream glow like a pearl light bulb which floated in a random pattern across the roof of my house. My friend witnessed this with me, but was not interested. As I was very excited about this third sighting in such a short time, I felt a bit silly that she was so nonplussed. I waved at it and shouted come back. Obviously it never. Another friend turned up and I told her about my encounter, when suddenly I heard a voice in my head, say come outside, were back. I jumped out of my chair telling my friend I heard them say come outside, and sure enough, there it was moving in the exact same manner and same place. I was awestruck. The next one is strange as it is a star that I have been watching for a while. It moves far quicker across the horizon than the rest of the stars, moving about 20 degrees in half an hour. I got the telescope out for a look at saw what appeared to be a red,blue and green plasma ball. I thought maybe mercury looked like this, but when looking at it without the telescope it appeared to drop molten silver looking tears that then flew off. I was with several other people at the time and we all witnessed this. A few weeks went by with no sightings, then two in the same day. I was collecting my child from youth club at about 7.30 on a Tuesday evening, when a bright light appeared in the sky. As this is a flight path, my mind registered it as a normal plane, as i glanced up I caught it move with excessive speed across the sky,stop blink once, then vanish. Other parent watched it too. Later that night I was outside in the garden thinking about what I had been witnessing lately, wondering if it was experimental craft from the military. So I asked out loud, if you are alien show me something, right at that moment, a light appeared, again I just assumed it was a plane coming into view, but then it got really bright, as big as a street lamp in the sky, then started to fade, as it faded i saw a grey rectangular shaped object. Then it vanished as if it had never been there at all. This whole episode has made me feel like i have been going crazy, but other people in the area assured me they have been experiencing the same phenomena. Since then nothing."],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Longitude":"-3.044052","Case Number":"34977","Date Submitted":"01/19/2012 05:32 UTC","Source":"MUFON"}