{"files":["/var/www/straped/mufon/html2text/34988.html.txt","/var/www/straped/mufon/org/34988.html"],"Object Flight Path":"Stationary","divs":["sighting detailsi was preparing to enter the costco of brooklyn on thursday, the 19th of jan. 2012, when i saw multiple (10 to20) bright lights in the noontime sky over the new york harbor. they seemed to appear out of thin air and were shinning very very clear and bright. the lights were so bright that they naturally caught my attention. i first thought they must be silver mylar balloons reflecting the sunlight, but they did not move like balloons. they did not bob and flit around like a ballon in the sky would normally behave. they appeared out of thin air brightly and steadily, hovering in place till they disappeared. the sky was clear and cloudless. some were very high up and they were spread out over a wide 1\\2-1 mile area, which would not be the case if they were balloons that had been released from one location. i stood watching the lights for seven minutes or so waiting to see how they would leave. they simply stopped emitting (or reflecting light) and disappeared. it was a very strange event. i was prepared to declare them balloons but clear evidence of that never came in. so being true to the word, these were ufos."],"Longitude":"-73.94484","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.65678,+-73.94484(34988)&iwloc=A&hl=en\"> mufon case (34988) map </A>","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Case Number":"34988","Source":"MUFON","Object Features":"Unknown","Date Submitted":"01/19/2012 09:52 UTC","Tags":"City","Latitude":"40.65678","trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around January 19th 2012"],"City":"New York","Object Shape":"Circle","Region":"New York","Weather Factors":"Unknown","Summary":"I saw multiple (10 to20) bright lights in the noontime sky over the New York harbor. They seemed to appear out of thin air and were shinning very bright. They hovered in place till they disappeared. Some were very high up.","Disposition":"Unresolved","Log Number":"US-01192012-0038","Date of the Event":"01/19/2012 12:00 UTC"}