{"divs":["Sighting DetailsI was driving directly north bound on Powerline Rd. & was passing Sample Rd. at the time. I was just in or near Deerfield Beach as this object in the sky grabbed my attention. At 7:40pm EST I saw a what looked & was behaving like a missile like object going up into the sky. It caught my attention because it had just emitted an orange-yellow like emission leaving a trail behind it as it was ascending. It was far too high and large to be any flare light, so that question is answered. I kept my eye carefully on it as I saw it change its flight pattern & no longer gave the appearance that it was ascending. It then gave off a more faint yellowish-whitish glow afterwards. I no longer saw the object & it's dark right now so can't say anything much about that. It may have become too faint after that point. The only reason why I decided to post here is because there are no active military bases any where near where I live. It did not make any sense. I wish there was a way to debunk this. Could a jet engine appear like this in the sky were it possibly had an engine explode & it still be able to maintain itself in flight? It was a very strong emission, enough to grab my attention while driving. I'm not typically 'looking' for things in the sky so just don't know what to make of it. Oh, there was a helicopter in the sky just afterwards, but this is also common for south Florida so wasn't sure if it was a coincidence or not..... As I type there's a helicopter with a search light shining down. A common happening. My feelings on this are more like I just want to know the answer since seeing something like this is not normal. I might see if I can reach the nearest airport (it's a small private one in boca rating) to the incident & see if there's any logical explanation."],"Object Features":"Unknown","City":"Deerfield Beach","Region":"Florida","Summary":"Missile like object emiting yellow-orange trail then changes direction & appearance","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=26.322072,+-80.090636(34984)&iwloc=A&hl=en\"> mufon case (34984) map </A>","Tags":"City","Longitude":"-80.090636","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date of the Event":"01/19/2012 07:40 UTC","Weather Factors":"Unknown","Latitude":"26.322072","Object Shape":"Bullet, Missile, Circle, Star-like","Source":"MUFON","Log Number":"US-01192012-0034","Case Number":"34984","trends":["There have been 7 other sightings in Deerfield Beach","There were no other sightings in Deerfield Beach on or around January 19th 2012"],"Country":"United States","files":["/var/www/straped/mufon/html2text/34984.html.txt","/var/www/straped/mufon/org/34984.html"],"Date Submitted":"01/19/2012 08:35 UTC"}