{"Disposition":"Unresolved","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=34.033903,+-117.313654(34981)&iwloc=A&hl=en\"> mufon case (34981) map </A>","City":"Grand Terrace","Date of the Event":"01/17/2012 12:00 UTC","Longitude":"-117.313654","Sighting Duration":"Undisclosed","Case Number":"34981","Country":"United States","Log Number":"US-01192012-0032","Object Features":"Unknown","Weather Factors":"Unknown","Object Shape":"Circle","Latitude":"34.033903","divs":["Sighting DetailsI was driving on the 10 freeway when I noticed there was a blimp in the sky. I was at the interchange when it had turned around and headed north away from the direction I was traveling. When I got off the freeway I noticed in the distance two orange lights heading towards me. when they had passed my car I noticed they were hovering. I turned my car around and headed towards them. I was next a bunch of power lines. They were right above my car. They were hovering but instead of going north they were slightly moving south. There was nothing that I could see between the objects. For some strange reason, I wasnt scared. I almost dont believe what I saw. It is hard for me to even fathom what they could have been. I know that they had nothing to do with the blimp I had seen. I watched the blimp turn and go the other direction. These two objects stayed the same distance apart the whole time and there was nothing between them. I thought to myself that they may have observed the blimp but when I went to fill this form out, one of the options were power lines. The street I turned down has a power plant on it. Maybe it had to do with the power lines. Whatever they were, they were right above my car. I rolled down my window and looked up, looked around to see if anyone else was around me to witness this and also noticed there was no sound. I drove from it feeling a bit nervous, looked back and they were moving west and I lost sight of them because of an apartment complex. I went to grab my mom and drove around with her to look for them but they were gone."],"files":["/var/www/straped/mufon/html2text/34981.html.txt","/var/www/straped/mufon/org/34981.html"],"trends":["There have been no other sightings in Grand Terrace","This sighting has never been favorited."],"Tags":"City","Source":"MUFON","Summary":"I witnessed 2 orange lights","Date Submitted":"01/19/2012 06:57 UTC","Region":"California"}