{"Log Number":"US-01202012-0004","Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path,Path then hovering","divs":["Sighting DetailsMy husband and I were driving down the interstate at about one oclock a.m. on Oct.27, 2011. We live out in the country and I like to look at the stars at night. On that night the sky was really clear cause it was cold outside and there really wasnt very many clouds that night if there was any. while I was look out the window a \"star\" caught my eye, I was watching it closely, and thinking to myself \" is that a star? that looks to big to be a star! and it looks pretty low for a star\" but I didnt say anything to my husband. I just kept watching it. After a moment it started to dim out, and now Im kinda like WTF. Then I started to freak cause it got bright again and this time it was bright then before...did I mention that it was just hanging there in the same spot this hole time..So Im yelling at my husband, who is driving ,\"pull over! pull over! you have to see this there is something going on!\" Just when I thought it couldnt get any weirder BAM theres two now! the second one lights up out of nowhere straight to the right of the first one. Im freaking out more and continuing to scream at my husband, Just as we were pulling off the interstate...BAM again! a third one pops out and its above the first two now they look like a perfect triangle! We stopped right off the ramp and got out of the car it just sat there and since we lived pretty close we ran to the house and grabbed a witness..my mom.I had ran in side and said anyone want to come see some UFOs? she kinda smiled and said sure!So went right back up the road and there they where after a few minutes they stared to fly but it was like they were hooked together cause they stayed in the same triangle formation as the flew over top. after they went pass more came and went and after about a half an hour there were at least 10 bright orbs just hanging out by the horizon once they were all over that way they would get bright and dim and bight and dim...it was late and I was tired so we went home...I did not have a video camera and my phone camera is crappy so the only evidence I have is my word and I would never lie about something like that."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-85.303568","Tags":"City","trends":["There have been no other sightings in Pendelton","This sighting has never been favorited."],"Date of the Event":"10/27/2011 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.462288,+-85.303568(34996)&iwloc=A&hl=en\"> mufon case (34996) map </A>","Region":"Kentucky","Summary":"three orbs brighter then stars flew in a perfect triangle","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/34996.html.txt","/var/www/straped/mufon/org/34996.html"],"Country":"United States","Date Submitted":"01/20/2012 01:40 UTC","Object Shape":"Sphere","Object Features":"Undisclosed","City":"Pendelton","Latitude":"38.462288","Case Number":"34996"}