{"trends":["There have been 15 other sightings in Port St Lucie","There was one other sighting in Port St Lucie on or around January 19th 2012"],"Disposition":"Unresolved","Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=27.289594,+-80.335717(34993)&iwloc=A&hl=en\"> mufon case (34993) map </A>","Object Shape":"Fireball","Tags":"City","Summary":"Red orb with red trail shot white light out back","Source":"MUFON","Log Number":"US-01202012-0001","files":["/var/www/straped/mufon/html2text/34993.html.txt","/var/www/straped/mufon/org/34993.html"],"Viewing Distance":"Unknown","Case Number":"34993","Date of the Event":"01/19/2012 07:30 UTC","Object Flight Path":"Straight-line path","Object Features":"Unknown","Latitude":"27.289594","Country":"United States","divs":["Sighting DetailsI was standing in my front yard in Port Saint Lucie, FL smoking a cigarette because I do not smoke in the house. A bright red-orange light caught my eye. I do not want to say which direction because I am not 100% sure if it was exactly south or south east. At first I thought it was an airplane but it did not appear to have lights like an airplane. Instead it seemed to be a glowing ball. After focusing on the object I noticed a red trail behind it like you would see on a comet. This made me think it was a meteor something similar. However, the most shocking thing happened that I find difficult to describe. A white light begin to shoot from the back end of the object. (I say back because it exited the object from the opposite end of the direction it was heading) The light shot from the object and traveled down the length of the red tail. It did not stem from the object like light from a flashlight stems from the flashlight itself but rather after it was shot from the object it traveled detached. The white light was shot a number of times from the red orb. The sight was very perplexing and almost fearful due to the unknowns surrounding what it could be. The white light then stopped and it was just the red orb and the red tail again. Shortly after the white light stopped, the red tail disappeared. The object traveled for a few seconds more then disappeared as if it went behind a cloud. I thought that it was clear skies but it was dark out so I can't say for sure. However, the stars could be seen near where the object disappeared so I watched and waited for it to reappear hoping to see the trail and the white light again. However, it never reappeared. It was like it disappeared or the light went out. I immediately went inside to check online for any events such as meteor showers happening but couldn't find anything so I went back outside to look at the sky for anything strange. Within a few minutes a police officer came down my street shining its spotlight. The officer talked to some kids walking down the street but I was too far away to catch what the conversation was about. The cop then continued on shining the spotlight from the car as if looking for someone. About 10 minutes later a helicopter flew by extremely low and it too had its spotlight on but it is unclear if the police and the red orb were related in any way. It all happened around 7:40 pm eastern standard time. I checked periodically throughout the night for anything in the sky but it is now 12:00 am and no cops or strange objects have been seen since."],"Date Submitted":"01/20/2012 12:01 UTC","City":"Port St Lucie","Weather Factors":"Unknown","Longitude":"-80.335717","Region":"Florida"}