{"Log Number":"US-06262005-0006","divs":["Sighting DetailsI was sitting in the house and looking out the window at the time, when I noticed two small lights which I at first thought were part of a helicopter but as they moved apart and in different directions I immediately realized this was not normal. While I was watching the two small lights something really large came toward me from the opposite direction (from my right) two small lights were on my left. These small lights were in view for approx. 20 minutes. The large object was in view for approx. 15 minutes. The large object was kind of oval but could have been a cylinder with what looked like lights along the side of it (might have been portals)... My only feeling was amazement and I actually pinched myself to make sure I was wide awake and I also moved around the house to see if I could see it from other windows and I could. I was not about to go outside though. As soon as I saw it, it stayed at approx. above the trees (30 to 50 ft)and hovered. When it left it moved very slowly and took it 5 to 10 minutes to completely dissapear from my view. It went straight out away from me (North)."],"files":["/var/www/straped/mufon/html2text/3499.html.txt","/var/www/straped/mufon/org/3499.html"],"Summary":"Saw two small lights...at first thought they were part of a helicopter...looked at lights from various windows in the house and they were still there.","Disposition":"Unknown","Object Shape":"Cylinder","Weather Factors":"Unknown","Tags":"City","Object Features":"Other","Source":"MUFON","Latitude":"38.389239","Date Submitted":"01/31/1980 12:00 UTC","trends":["There has been one other sighting in Sadieville","There were no other sightings in Sadieville on or around January 31st 1980"],"Region":"Kentucky","Longitude":"-84.537442","Sighting Duration":"Undisclosed","Date of the Event":"01/31/1980 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=38.389239,+-84.537442(3499)&iwloc=A&hl=en\"> mufon case (3499) map </A>","City":"Sadieville","Case Number":"3499"}