{"Latitude":"26.616245","Date Submitted":"01/19/2012 10:21 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.616245,+-80.053093(34990)&iwloc=A&hl=en\"> mufon case (34990) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy wife and I were driving northbound on I-95 when we sighted an orange flame-like circular orb just above the interstate street lights and the buildings in the distance to the WEST. At first it looked like it might have been just an antenna, but the light grew brighter and larger as we continued to look at it. Very quickly, we knew this was something strange we had never seen before. The light started to move slowly across the interstate and began to change shape. It started to resemble something like a missile or a comet that had a pronounced fire-like body and tail. As it made its way across the interstate, for a few moments I thought we had lost it, but immediately we could see the same shape as before, only now it was a very dim white outline in the sky. It looked like a cone-shaped comet with a long tail. I could not believe what we were seeing so I took out my cell phone to try and record it. It looked like it was moving very slow, but by the time my cell phone began to record, the light made its way across the interstate and was now EAST of I-95. Slowly it began to dim and get smaller, resembling a star. It looked like it stopped moving, so I put my phone down and stopped recording it. The weirdest thing is that the moment I put my phone down and looked up again, it was gone. When I tried to play back the video on my phone to see what it looked like, my phone said \"OOPS! your camera will not open. Please try again later.\" and the video I recorded on my cell phone would not and still will not play despite rebooting it. Whatever we saw, I know it was something we had never ever seen before."],"Tags":"City","Case Number":"34990","trends":["There have been 9 other sightings in Lake Worth","There were no other sightings in Lake Worth on or around January 19th 2012","This sighting has never been favorited.",""],"Country":"United States","Object Shape":"Bullet, Missile, Cone, Circle, Fireball, Star-like","Summary":"Bright orange fire-like trail drew attention to object, slowly diminished to a white star-like floating east-bound until disappearing","files":["/var/www/straped/mufon/html2text/34990.html.txt","/var/www/straped/mufon/org/34990.html"],"Object Features":"None","Source":"MUFON","Longitude":"-80.053093","Disposition":"Unresolved","Viewing Distance":"Unknown","Region":"Florida","Object Flight Path":"Hovering then path","Log Number":"US-01192012-0040","Date of the Event":"01/19/2012 07:40 UTC","City":"Lake Worth"}