{"City":"Undisclosed","Summary":"Orange Orb Travelling from Evergaldes Area Heading East, Transforming, And Vanishing","Date of the Event":"01/19/2012 07:40 UTC","files":["/var/www/straped/mufon/html2text/35008.html.txt","/var/www/straped/mufon/org/35008.html"],"Disposition":"Unresolved","Longitude":"-81.509694","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-01202012-0013","Source":"MUFON","Region":"Florida","trends":[],"Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Unknown","Weather Factors":"Unknown","Tags":"City","Country":"United States","Date Submitted":"01/20/2012 01:32 UTC","Object Shape":"Cylinder, Star-like","Latitude":"27.671457","map":"<A HREF = \"http://maps.google.com/maps?q=27.671457,+-81.509694(35008)&iwloc=A&hl=en\"> mufon case (35008) map </A>","divs":["Sighting DetailsMy boyfriend and I were traveling to Wellington, FL last night heading North on Florida's Turnpike. I was looking ahead and noticed a rather large orange orb moving slowly, less than 400 feet from the ground. It was traveling eastward and suddenly stopped moving. Apparently the orange light was at the front of the craft. This orange large light suddenly tuned off, but we could both still see the outline of something with a long fiery looking trial. It aimed upwards at that time and rose to a very high altitude, then hovered at the higher altitude and continued to transform into something we could not see the shape of. It also was observed at that moment to have a red flashing light which was very small as compared to the large orange orb. We got off the exit and pulled over to watch it. As the form of the ship shifted to something indiscernible in shape, we focused on the firey emanation that seemed to power it, which suddenly dimmed down. At that moment of the dimming, we then saw three short spurts of what appeared to be some orangey luminous energy emanating out of the back of the craft. They looked light pyramids of light to me. One, then two then three. Then all dimmed and all we could see what a light chem, vapor or energy trail. We drove and followed it but it suddenly transformed into what appeared to be a star then traveled rapidly upward in a curvy s-type manner straight up then turned toward the south at a rate of speed beyond comprehension, and vanished. During this entire event, my boyfriend who was driving, attempted to take video with his I-Phone, but the phone, which was on before the sighting, would not initiate and continually shut down over several attempts. Immediately thereafter if you looked westward toward the everglades last night, where the object we saw was initially traveling from, you could clearly see another very large white light which looked like venus, but was very very low to the ground."],"Case Number":"35008"}