{"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Longitude":"-80.135342","Object Shape":"Cone, Fireball","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/35015.html.txt","/var/www/straped/mufon/org/35015.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.061498,+-80.135342(35015)&iwloc=A&hl=en\"> mufon case (35015) map </A>","Date Submitted":"01/20/2012 04:49 UTC","trends":["There has been one other sighting in Hobe Sound","There were no other sightings in Hobe Sound on or around January 19th 2012"],"Summary":"object entering atmosphere. heat trial. changed direction.","Tags":"City","divs":["sighting detailsi was on my house deck playing with my dog after dinner. a clear, quiet and windless south florida evening. i looked to the north. observed what initially appeared to be a bright yellowish light moving from north to south. it appeared to be a great distance away. frequently commercial airliners on flight paths to pbi, ftl or mia can be observed heading south in that general area and i didn't give it much thought. but then i noticed a yellow\\orange heat trail behind the object as if an object was entering the atmosphere and generating extreme heat. i thought i was observing space trash re-entering the atmosphere and incinerating. but it seemed to be moving too slow. the object appeared to be at a very high altitide and there was no engine noise observed. the trail behind the object grew longer as it continued heading north to south to the east of my position (over the ocean) and seemed to be descending and slowing down. the heat trail diminished and the object appeared as a glowing yellowish light again. the object appeared to slow down and then the shocker: it appeared to turn to the east and also appeared to be ascending again. no heat trail. and no more southerly movement. and after several more seconds, the light seemed to turn redish for a moment and then just disappeared. it didn't disapate. it just wasnt there any more. i knew i had seen something remarkable, but i just don't know what it was. i'll save my speculation for discussions with friends, but thought it might be worthwhile to report this sighting here."],"Source":"MUFON","Disposition":"Unresolved","Case Number":"35015","Sighting Duration":"00:02:00","Date of the Event":"01/19/2012 07:45 UTC","Region":"Florida","City":"Hobe Sound","Latitude":"27.061498","Log Number":"US-01202012-0021","Object Flight Path":"Path with directional change"}