{"map":"<A HREF = \"http://maps.google.com/maps?q=28.211737,+-82.692974(35017)&iwloc=A&hl=en\"> mufon case (35017) map </A>","Viewing Distance":"Unknown","Country":"United States","Region":"Florida","divs":["Sighting DetailsI sighted an apparent small UFO Flotilla last night, outside my home. It was sometime after 9PM. I went outside to bring a book to my fathers house. I was in a hurry, and so didnt have my cell phone with me. As I was getting into my car, I saw two reddish lights across the street in the sky. I figured it was just the usual air traffic, and so decided to ignore it- unless something else happened. The odd reddish color was intruiging. As I turned the car around to leave the driveway, I saw two more lights (for a total of four.) All the same reddish color. They looked like embers from a fire: you blow on a dying fire, and you get this same color. At this time I decided it was not the usual air-traffic, and stopped the car halfway on the sidewalk, turned off the engine, and opened the door to look. I then noticed that one of the lights in the first pair of lights suddenly vanished. That was it. I knew it was something unusual. They were flying in strange patterns, drifting right, but not in a straight line, the way that airplanes do. For fun, I started to wave my hand in a friendly manner, and yelled, \"Hello, welcome to earth!\" Why the heck not? Give em a friendly greeting, I say. As if on cue, the left side of the sky was filled with them. Well over ten. In a semi-narraow band appearing to be above the treeline (from my angle), but they must have been much higher. It was like when you see an ant in the kitchen: and then all of a sudden, you see ten ants where there was just one. They were all flying in typical UFO patterns as seen in the 1950s Utah footage, and also the NASA UFO-footage shown by David Sereda. They flew to the right, blinking off and on, into and out of existence, almost, and all with the same reddish color. By the time I recovered my bearings, I counted only nine, but Im sure there had been more before I realized I should count them. The whole thing lasted about two minutes. Slowly, one by one, they disappeared, until only the original pair was left, then just one, then nothing. While all this happened, I noticed some flashes coming from across the street to the right: I figured it was camera flashes, and was glad someone else was seeing the damn things. Turns out I was correct. I finally got into my car, and drove to my parents house. I decided to keep an eye out for anyone else who might have seen them. Along X Street, the street where I had first seen the camera flashes coming from, I saw a woman in the darkness, standing on her lawn. I stopped my car, rolled down the window, and asked, \"Did you see the lights?\" She said yes. Turns out she knows me: it was a woman named X, who is the friend of my former neighbor, X. X said, \"They looked like meteors\", but I said, \"No, meteors streak across the sky and fizzle out -these were drifting to the right, and were moving upwards, and popping in and out.\" At that, X got a creeped out expression on her face. X then said, \"I got a call from my daughter- she was driving and says she saw fifteen of them.\" I asked where her daughter lived, and she said on X (my address, also), and that she was driving on X when she saw them. X confirmed she attempted to take some pictures, and I told her I had seen the camera flash. At my parents house, i was telling my father about what had happend, when I saw single light of the same reddish color. We were standing on the front lawn. Whereas from my previous angle at my house, they had appeared to be above the horizon, here this one drifted across the center of the sky. If drifted by us, truning slightly to the left, then vanished. Later on, back at home, I saw three more: 1) The first, a solitary light, appeared to the left of my house, where I had first seen the flotilla. I called my neighbor over, and he noted the red color. It vanished after about 1 minute. 2) Another appeared directly across from my house, and then vanished after 20 seconds. By now it was 9:40 PM or so. Although I saw many planes, etc., I saw no other objects with the strange red color. I came inside about 10:15PM or so, so it all lasted less than an hour. All had the same distinctive, reddish, ember-like color. 3) Much later, after 2am, while driving back from Walmart, I saw another light, not reddish this time: it was whitish, flying in the opposite direction. It was starting and stopping, hovering, and then moving at high speeds. When I made a U-turn to follow it, it took off to the left. I watched it until I couldnt see it anymore. Addendum: that night on FOX 13 news at 10pm or 11pm, they said that NASA and the military had launched a defense satellite from Cape Canaveral earlier that night. It was carried on a rocket, and contained a scanning and imaging system. No idea if this was the cause or somehow related to this UFO appearance. sincerely, X"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/35017.html.txt","/var/www/straped/mufon/org/35017.html"],"Date Submitted":"01/20/2012 06:32 UTC","Object Features":"Unknown","Latitude":"28.211737","Log Number":"US-01202012-0023","Summary":"Witnessed apparent flotilla of ember-colored lights, 1/19/12, approx. 2 mins.","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-82.692974","trends":["There have been 18 other sightings in New Port Richey","There was one other sighting in New Port Richey on or around January 19th 2012"],"Tags":"City","Case Number":"35017","Object Flight Path":"Path with directional change,Path then hovering","Object Shape":"Sphere","Source":"MUFON","Date of the Event":"01/19/2012 09:15 UTC","City":"New Port Richey"}