{"Disposition":"Unresolved","Source":"MUFON","Tags":"City","Object Flight Path":"Path with directional change","Object Shape":"Triangle, Unknown","Longitude":"-80.352237","Date of the Event":"01/20/2012 09:45 UTC","Region":"Florida","Log Number":"US-01212012-0002","Summary":"15 amber lights in linear trajectory over Kendall, FL","Latitude":"25.674884","files":["/var/www/straped/mufon/html2text/35027.html.txt","/var/www/straped/mufon/org/35027.html"],"Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Kendall","There were no other sightings in Kendall on or around January 20th 2012"],"divs":["sighting detailsi went outside to smoke a cigarette after dinner and saw what i could best describe as \"ember\" lights in the sky. very similar to the color of when you blow on a camp fire. these lights were slow moving in a linear fashion. there was no sound, and they were traveling wnw. after the first appeared, i initially mistook it for a standard plane, however there were no running lights, or no flashing blue\\red lights, just the solid ember light. they were emitting their own light and a vague outline of a equilateral triangle could be mad out, however it was a bit obscured. the odd part was that all air traffic was very distant, and these lights were moving linear. i counted 15 in total, however there may have been more before i stepped outside. they had absolutely no sound and no ill effects on the surroundings. after the lights, there was a fast moving jet (possibly military) that followed their exact path. i asked my girlfriend to step out when i saw them. neither of us have ever seen anything like it before. i lost sight of the crafts when they passed over our apartment complex. roughly 15 minutes after the fast mover, all air traffic resumed as normal. note: the time listed is within 10 minutes of actual viewing time."],"Date Submitted":"01/21/2012 12:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=25.674884,+-80.352237(35027)&iwloc=A&hl=en\"> mufon case (35027) map </A>","Weather Factors":"Unknown","Case Number":"35027","Object Features":"Unknown","City":"Kendall"}