{"Weather Factors":"Unknown","Log Number":"US-01202012-0027","divs":["Sighting DetailsMy wife and I walked outside to walk our dog. We walked over to our fence facing due north. We were looking in the sky and to the north-northeast a very bright green \"meteorite\" was falling vertically to the ground. It is a path that was inside our atmosphere and not just skirting it. It left a burn line from about 30 degrees in elevation to about 15 degrees in elevational view. After it burned out, about 4 seconds later an orange orb lit up and just hovered there. It appeared about 5 degrees below where the meteor stopped being visual. It then began heading to the south, just glowing orange at first, then it developed a pulse, then mimicked airplane lights as it flew out of sight due to the forest across the road. This happened at 11:06 pm. The skies were clear and there was no moon in the sky. There was no sound involved with the sighting. I have since purchased a night vision camcorder. I could not believe we were seeing another one so soon after the last one I reported just yesterday to this site."],"Object Features":"Unknown","Source":"MUFON","Case Number":"35021","trends":["There has been one other sighting in St. Stephen","There was one other sighting in St. Stephen on or around January 19th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.353295,+-79.93121(35021)&iwloc=A&hl=en\"> mufon case (35021) map </A>","Object Flight Path":"Hovering then path,Path then hovering","Sighting Duration":"Undisclosed","Country":"United States","City":"St. Stephen","Tags":"City","Region":"South Carolina","Viewing Distance":"Over One Mile","Object Shape":"Fireball, Sphere","Date of the Event":"01/19/2012 11:06 UTC","Latitude":"33.353295","Date Submitted":"01/20/2012 10:12 UTC","Longitude":"-79.93121","Disposition":"Unresolved","Summary":"Green colored meteorite falls vertically then orange orb appears and flies out of view.","files":["/var/www/straped/mufon/html2text/35021.html.txt","/var/www/straped/mufon/org/35021.html"]}