{"files":["/var/www/straped/mufon/html2text/35039.html.txt","/var/www/straped/mufon/org/35039.html"],"Log Number":"US-01212012-0014","Summary":"Bright orange/reddish objects ascending straight up then following a staight horizontal path very slowly","Tags":"City","Date Submitted":"01/21/2012 07:13 UTC","Region":"Michigan","Viewing Distance":"Unknown","Object Shape":"Egg, Oval","Disposition":"Information Only","Object Features":"None, Unknown","Latitude":"42.327534","trends":["There have been 17 other sightings in Westland","There were 3 other sightings in Westland on or around July 4th 2008"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.327534,+-83.393681(35039)&iwloc=A&hl=en\"> mufon case (35039) map </A>","divs":["Sighting DetailsI was at the Westland Festival for the fireworks with some friends. We live very close to the park where they have the festival so we just walk there. My old sub division has a sidewalk which leads to a path to John Glenn Highschool which is right across the street from the fireworks. So after the fireworks were over, we go down that path to go back to my sub division. There is a couple baseball diamonds on the path. I had some old fireworks that I blew up on the path and afterwards we were hanging out on the bleachers out there. While Im looking out for fireworks in the sky I notice that theres something strange ascending I can see it come up from far away from behind a building and it was moving really slow. It starts to head my way so I point it out and ask my friends what it is. They have no explanation for it either. Its sort of just gliding through the sky very slowly and it flys over our heads and behind us until we cant see it anymore because the treeline blocks our view. Well I look in that direction that it came from and theres another ascending and it follows the exact path that the other one did. Once we cant see it anymore another one is rising up like they had perfect syncronization and its coming towards us, so I stop some teens walking down the path and ask them what they think it is and they dont have a clue either. So when I cant see it anymore heres another one rising up and I tried to record it on my phone but it didnt work because it was dark outside. This keeps on happening im not sure exactly how many there were but I know there were at least 6. They all follow the exact same path fly at the same speed and glow the same color. I couldnt make out any shapes but the appeard to be oval and they just stayed a solid reddish orange color and were perfectly silent. If I had to guess how big they were its hard to say, but probably about 15ft across and im guessing the altitude is about 3-4x the tree lines height. I know that they werent balloons with candles, flares, fireworks or planes. I grew up near Selfridge Airbase so I know what planes and choppers look like at night and how they move and they dont even compare to what we saw that night."],"Date of the Event":"07/04/2008 11:30 UTC","Object Flight Path":"Other","City":"Westland","Longitude":"-83.393681","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"35039","Source":"MUFON"}