{"Sighting Duration":"Undisclosed","Object Shape":"Circle","Source":"MUFON","Object Features":"None","City":"Kansas City","Date Submitted":"01/21/2012 02:26 UTC","Tags":"City","Date of the Event":"01/16/2012 05:15 UTC","Region":"Missouri","Weather Factors":"Unknown","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around January 16th 2012"],"Object Flight Path":"Path with directional change","divs":["Sighting DetailsAs reported to ASD by phone: \"I was leaving a restaurant at 85th and Wornall Rd. in Kansas City at 5:15 p.m. and was looking at some very strange egg-carton like clouds when something shiny caught my eye. I saw a cluster of approximately 25 perfectly round silver metallic speheres flying to the east of my position at 45-degrees off the horizon and at least 1,000 feet altititude. The sun was setting and shone off of these spheres. The objects were in a large circular shotgun pattern, but as they moved away from me they got closer together and into a tight formation. They then moved into the strange clouds and dissapeared from view. It would take a garbage can lid held at arms length to cover these objects all at once at the point where I first saw them. These objects moved silently in a type of wave, undulating through the sky. The objects were definatley NOT birds. I have spent a lot of time in the wilderness and am a hunter, and these were not like snow geese, Canada geese, or any type of bird Ive ever seen. Ive also never seen conventional aircraft like this. I was alone and did not have a camera with me, but from now on plan to have a camera on my person at all times. I am college educationed, own and operate two businesses and am not prone to halucinations. Ive never seen anything like this and would like to know what they were.\""],"Viewing Distance":"Unknown","Country":"United States","Case Number":"35035","Disposition":"Unknown","Longitude":"-94.594996","files":["/var/www/straped/mufon/html2text/35035.html.txt","/var/www/straped/mufon/org/35035.html"],"Latitude":"38.974257","Log Number":"US-01212012-0010","Summary":"25 Metallic Spheres Flying Over Kansas City","map":"<A HREF = \"http://maps.google.com/maps?q=38.974257,+-94.594996(35035)&iwloc=A&hl=en\"> mufon case (35035) map </A>"}