{"Date Submitted":"01/21/2012 10:31 UTC","Object Flight Path":"Other","City":"Battle Ground","map":"<A HREF = \"http://maps.google.com/maps?q=45.785104,+-122.567153(35044)&iwloc=A&hl=en\"> mufon case (35044) map </A>","Object Shape":"Star-like","Region":"Washington","Weather Factors":"Unknown","Latitude":"45.785104","Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unresolved","Tags":"City","Source":"MUFON","trends":["There have been 5 other sightings in Battle Ground","There were no other sightings in Battle Ground on or around June 3rd 2008","This sighting has never been favorited.",""],"Date of the Event":"06/03/2008 08:17 UTC","Longitude":"-122.567153","files":["/var/www/straped/mufon/html2text/35044.html.txt","/var/www/straped/mufon/org/35044.html"],"Case Number":"35044","Sighting Duration":"00:05:00","Summary":"3 lights in the distance moving very fast & agile, preforming strange maneuvers.","divs":["Sighting DetailsIt happened roughly 4 years ago, in 7th grade. So I dont remember the details very well. I was on the computer at night in my house within our neighborhood. Then my sister & brother came to me & said that there are UFOs in the sky. We went to the top the the stairs in the house to look through a window which was above the stairs. As we looked south towards Vancouver WA, there where 3 star-like lights floating in the very far horizon. They moved in synch with each other as if at an air show, moving around strangly & quickly. Amazingly, all 3 lights even combined together into one & back apart! They couldnt have been any normal aircraft because of how quickly they moved, & how quickly they changed direction. I lights dissapeared after a few minutes. Sometime after the event, I was at school & told my story. A guy in my class said his dad works in the airforce, he said his dad told that they got calls reporting lights in the sky. They said it was F22 Raptor testing. But I doubt it because the lights where very quick & agile, & even combined. We video-taped the event, but the video was poor-quality, therefore you couldnt see anything & it was useless. I recently made a rough picture to show what it looked like. Im curious if anyone else saw it or what it could have been."],"Object Features":"Unknown","Log Number":"US-01212012-0019"}