{"Region":"Texas","Object Shape":"Disc","Tags":"City","Longitude":"-95.393109","Case Number":"35069","files":["/var/www/straped/mufon/html2text/35069.html.txt","/var/www/straped/mufon/org/35069.html"],"City":"Houston","Latitude":"29.919328","divs":["Sighting DetailsMy mom, sister and myself were watching T.V. when we heard a low but distinct hum. Thinking it was the goodyear blimp, my sister and I looked out of the back window of our home only to see a U.F.O rotating very slowly above our house and moving in a straight line over our neighborhood. It was very low as if I could hit it with a rock. We yelled for our mother to come over to see it but she thought we were making it up. My sister and I watched the bright lights of blues, reds and greens flicker and spin on the bottom of the craft. The object itself was dark but because of the illumination we could see that it was as big as four houses. We were not scared but facinated as we watched it glide past the horizon. To this day we still share this memory. About 20 years later I was talking to a friend who grew up in the same neighborhood and when I told him about the experience we had had, he went flush because after narrowing down the time frame he too had experienced something that he had not shared with anyone. He states that that exact same night, some sort of tiny, hairless creature had apparated into his room, scared the mess out of him then disappeared. I know this sounds like a story but I have witnesses. I swear that this is true!"],"Summary":"It looked like a giant Simple Simon game flipped-over. It was round and spinning slowly","Disposition":"Unresolved","Log Number":"US-01232012-0008","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around March 14th 1980"],"Object Flight Path":"Straight-line path","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.919328,+-95.393109(35069)&iwloc=A&hl=en\"> mufon case (35069) map </A>","Date Submitted":"01/23/2012 02:20 UTC","Date of the Event":"03/14/1980 08:00 UTC","Country":"United States","Viewing Distance":"21-100 Feet"}