{"Object Features":"Undisclosed","Case Number":"35061","Date Submitted":"01/22/2012 10:26 UTC","Country":"United States","Disposition":"Unresolved","divs":["sighting detailsi had been jogging\\running around a .5 mile circular road in the over 55 senior mobile home community that i moved into in 1996. i saw this what seemed to be tricked out blimp type craft made up to look like the space ship from close encounters of the third kind (the movie) and thought that that was what it must be. it was shaped just like a blimp but glowing a beautiful mellow yellow\\orange with a line of lights on the top, on the bottom, and at the mid-line. it made no sound whatsoever. i stood still watching it for at least a good 5-10 minutes as it silently moved off into the distance and disappeared. i am still under the impression that this thing was some sort of tricked out blimp on the way over to the disney world\\universal studios\\epcot area. i thought that i had heard something on the radio(or possibly tv news) to the affect that such a craft had been created by disney for promotional purposes. now, many years latter i am not real sure about that part.when i asked someone in the park if he had seen the space ship he started to ridicule me with the usual kind of taunt that one might encounter with the suggestion that i was crazy. i was very impressed with the glow of this thing and how the entire blimp like craft just seemed to glow this very beautiful orange color. i never bother to check the local newspapers or news reports to see if this was in fact some sort of fantastically tricked out blimp being used for promotional purposes by the attractions in orlando. i would very much like to know what this craft was."],"files":["/var/www/straped/mufon/html2text/35061.html.txt","/var/www/straped/mufon/org/35061.html"],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"Florida","Object Shape":"Blimp","trends":["There have been 2 other sightings in Ormond Beach","There were no other sightings in Ormond Beach on or around January 3rd 1997"],"City":"Ormond Beach","Summary":"I saw this glowing blimp type craft at night while out running.","Latitude":"29.314162","Longitude":"-81.090307","Log Number":"US-01222012-0016","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Source":"MUFON","Date of the Event":"01/03/1997 09:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.314162,+-81.090307(35061)&iwloc=A&hl=en\"> mufon case (35061) map </A>"}