{"files":["/var/www/straped/mufon/html2text/35079.html.txt","/var/www/straped/mufon/org/35079.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.093219,+-83.354469(35079)&iwloc=A&hl=en\"> mufon case (35079) map </A>","Object Flight Path":"Straight-line path","Object Shape":"Square, Rectagular","City":"Adel","Weather Factors":"Unknown","Country":"United States","Date Submitted":"01/23/2012 07:59 UTC","Latitude":"31.093219","Log Number":"US-01232012-0018","Case Number":"35079","Viewing Distance":"21-100 Feet, 101-500 Feet","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Summary":"I was walking small dog, looked north up highway, it was just above tree tops, watched as it moved very very slowly northwest, when out of sight ,heard rumble then complete silance as during sighting.","Tags":"City","divs":["Sighting DetailsI took my little dog out for a walk late, I like to look at the stars as I am in the country. While at the end of my driveway I looked north, up the highway and saw a large narrow object hovering but as I watched, it was really moving very, very slowly just above the tree tops. I looked and my dog was not noticing it at all, no reaction as there was no noise. I am hear of hearing for high pitch but the dog was not interested so I say no noise at all. I kept thinking I should hear a hum, with it up in the air with no wings or propellers. It was a narrow rectangle shape. Gray, with a small redish lighted done on top and a amber small light. Across the area I was looking at were 3 or 4, I am not sure of number now as I was more impressed with the big round cicle white lights, that I thought of as engines or something, there were no flames, or waves of air, that I could tell but they were the whitest white I have ever seen...I am an artisan and now no lights or color white look white to me but rather have a dull yellow or amber tint. The large white circles were also next to an area that seemed to be black vertical bars or vents on about a third of the entire rectangular area to the left. The lights on top had low ilregular flashes within them, nothing like the lights on planes. No light projected in any fashion on to road or trees. I did not feel fear, just wander and curious, I could see the sky around it, sides and below. I tired to judge the size and posistion by the tree tops, width of the two lane highway and it's dirrection of movement. It seemed to be as wide as the highway it not a bit more, even as high as the pine tree it was close to. There was no wind movement of the tree as it crossed over them. I just stood there and watched it, as I figured to run in and get the camera, it would be gone; also to get my car keys to follow I figured the same. After it reached the forrest edge on my left side, I just walked slowly toward my house, trying to figure if the AFBase to the southeast of me might have any hoover craft, trying to think of what it could have been, when I hear a deep rumble rather like the trains sometime have but it was a short sound then total quiet again. I went in and just went to bed, I guess I was in wonder or shock, and then the next day or two, there was an unusal amount of jet flights and even for two nights helochopers with bright green and red lights on their runners that didn't blink flying around my area. Two days after I looked online for a place to report it and could not get any of the links with MUFON of GA to work so told my son, who lives above Atlanta, about it. He is the only one I have talked to about it, I am a mature adult and have only seen one other thing when I lived in north GA which was a white ball like a star take a 45 degree turn in the night sky, my younger son was with me then. I'm still haveing trouble finding the right box in my mind to put this, as I can not relate any thing I know to it. That is other than Science Fiction and this thing was real !!!! I still feel no fear to walk my dog and watch the sky but man, What was it ???"],"Date of the Event":"01/06/2012 12:00 UTC","Object Features":"Dome, Louvres","Region":"Georgia","Longitude":"-83.354469","trends":["There have been 2 other sightings in Adel","There were no other sightings in Adel on or around January 6th 2012"],"Source":"MUFON"}