{"divs":["Sighting DetailsI was standing on a outdoor deck overlooking the Chesapeake Bay smoking a cigarette. I was looking towards the south, south east when I noticed a large bright orange object relativly low in the sky 10-15 miles from me. I first thought the object may have been the planet Mars understanding Mars position and that at this time Mars was supposed to be very large and bright. At first it acted as a planet should and remained in position. The object did appear to twinkle some but I chalked that up to atmospheric conditions. Several minutes later (5-10) the object began slowly moving to the north. As it moved to the north it's brighness began to fade changing into a barely visible flashing red and white color then eventually disappearing. The object appeared over again several times almost in the same area repeating the same actions. A few times during this period as the bright object moved away and slowly dissapeared it was replaced by another bright orange object which would again move away in the same direction. At one point in my observation a helicopter with no lights on flew directly over my position and toward the object (n.w to. s.e). I lost track of the helicopter when I went into the house to tell other people what was happening. My initial reaction was of dis-belief. However as I stood and watched this occur over and over for at least a half an hour I thought it had to be something other than a planet or a plane, comet or helicopter. Eventually the object moved away, faded out and never returned.I have stood on that same porch many times looking over the bay and at the sky. I have seen many planes flying at night and have worked for an airline and know what a plane flying at night looks like. I know how planets act and they don't usually move away then reappear. Only one other person in my group had the chance to view this and saw pretty much what I described. After the sighting I (we) did not go into any details with the others in our group because as can be expected they were skeptical. I just left it at that and then later reviewed my photographs and decided to contact MUFON to help determine what this may have been."],"Region":"Maryland","Longitude":"-76.490643","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Summary":"Large orange object entered the sky then moved away several times","Latitude":"38.984915","files":["/var/www/straped/mufon/html2text/3507.html.txt","/var/www/straped/mufon/more/3507_submitter_file3__Map.jpg","/var/www/straped/mufon/org/3507.html"],"Disposition":"Unresolved","Object Features":"Undisclosed","trends":["There have been 14 other sightings in Annapolis","There were no other sightings in Annapolis on or around June 25th 2005","This sighting has never been favorited.",""],"Date of the Event":"06/25/2005 12:00 UTC","Case Number":"3507","Object Shape":"Undisclosed","Tags":"City","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","City":"Annapolis","Log Number":"US-06272005-0004","Date Submitted":"06/25/2005 12:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.984915,+-76.490643(3507)&iwloc=A&hl=en\"> mufon case (3507) map </A>"}