{"map":"<A HREF = \"http://maps.google.com/maps?q=40.353115,+-86.562198(35089)&iwloc=A&hl=en\"> mufon case (35089) map </A>","Object Shape":"Triangle","trends":["There have been 3 other sightings in Frankfort","There were no other sightings in Frankfort on or around December 20th 2011"],"divs":["Sighting DetailsIt was around 11:00 pm when I arrived home and had to feed our dog. We Live in country southwest Clinton County. I noticed a bright light looked that looked like it was gliding but had no sound. It stoped in mid air for maybe 2 minutes and continued in a straight path heading Northeast. The Object was shaped like a triangle with three lights one at each corner. It was a clear night and it wasn't flying very high at all but yet it was completely silent. It gave me an errie feeling as I watched it fly over the field right next to our house. I ran in the house and out the back to the patio area facing North so that I could continue watching it. It was close and I remember thinking why isn't this thing making a noise? It was silent. The lights appeared to be round. They were not blinking. The object continued in a straight path towards the Northeast until I could no longer see it. It never sped up or slowed down except for the one time that it hovered. It was just gliding at a slow speed."],"Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Date Submitted":"01/24/2012 01:40 UTC","Summary":"Just got home, noticed light moving slow, kept watching 3 lights, triangle shaped. It stopped and continued in straight line. It was completely silent . wasn't very high at all. Gave me an errie feeling.","Tags":"City","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Case Number":"35089","files":["/var/www/straped/mufon/html2text/35089.html.txt","/var/www/straped/mufon/org/35089.html"],"City":"Frankfort","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Undisclosed","Log Number":"US-01242012-0004","Date of the Event":"12/20/2011 12:00 UTC","Country":"United States","Region":"Indiana","Latitude":"40.353115","Longitude":"-86.562198","Sighting Duration":"Undisclosed"}