{"Date Submitted":"01/24/2012 01:02 UTC","Weather Factors":"Unknown","Object Shape":"Cigar, Oval","Source":"MUFON","Date of the Event":"09/15/1978 12:00 UTC","Object Features":"Dome","Region":"Nebraska","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.33874,+-95.94723(35088)&iwloc=A&hl=en\"> mufon case (35088) map </A>","files":["/var/www/straped/mufon/html2text/35088.html.txt","/var/www/straped/mufon/org/35088.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path then hovering","Sighting Duration":"04:00:00","Latitude":"41.33874","Log Number":"US-01242012-0003","Summary":"Italy , 1978, bright Tequila Sunrise color. No sound no emissions, Lost 4 hours time.","divs":["Sighting DetailsI was in the United States Army, 4th of the 6th Infantry Berlin Brigade. Also a NATO Commando. I was in Vicenze on an IRF, ( Immediate Reaction Force ) Mission. ON perimiter guard on a hill over lookiing Vicenza Italy. It was approxamately midnight. A friend and I were on the same guard watch. We decided to have a look over the side of the hill we were on to look down on the City of Vicenze Italy. As we approached the edge, we noticed a massive object in the sky over the city. It was , like I said, a Tequila Sunrise color. It glowed and made no sound. By the time we recovered and looked back up, our full 4 hour guard shift was over. We had no explanation for it and were punished with an article 13, a usual punishment for leaving post at the time. We never spoke of it again. This isn't the only incident I've experienced . I have had many before and after this. But what is odd is that since that particular incident I have had what I call a perpetual De Ja Vou. It's very eerie. I don't sleep well , I feel the need to stay conscious to protect my family. Sincerely Brian K Conrad"],"Tags":"City","Disposition":"Unresolved","Longitude":"-95.94723","Case Number":"35088","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around September 15th 1978"],"City":"Omaha"}