{"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"01/24/2012 09:00 UTC","Source":"MUFON","Object Features":"Undisclosed","Disposition":"Unresolved","divs":["sighting detailsi was driving home on swamp road after leaving bucks county community college around 9pm on 1\\24\\2012 when i observed what first looked like a low flying plane the size of a small jetliner due to its 3 white lights. it appeared to be turning about 30-40 degress. it seemed to be running parallel to swamp road. i thought it was odd, it is not in the flight path for mercer county airport, nj. as i drove closer, i thought that it could not be a plane but a helicopter because it was flying way too slow! it was about 300 - 500 ft it the sky, no more than 1\\2 mile away. within the 3 lights there seemed to be interior lights with the structure. i have never seen anything like it. i came to a stop light and rolled down my window as it was passing to take a listen to it ... it was not a jet or a helicopter, it sounded like a electronic humming fan or turbine blades ... i was on a aircraft carrier for 5 years ... no plane i have ever heard. i came home and googled ufo bucks county after remembering sighting years ago. [link moved to fi section\\cms\\tg] ... this looks like what i saw but from more of a side view and it was not that high in the air ... the 3 lights were white not red. the strange thing is that mufon had a meeting at bccc on 1\\24\\2009. i have never seen anything like it. i love it."],"Date Submitted":"01/24/2012 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.247463,+-74.991911(35119)&iwloc=A&hl=en\"> mufon case (35119) map </A>","Object Shape":"Triangle","Tags":"City","Longitude":"-74.991911","trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around January 24th 2012"],"Sighting Duration":"Undisclosed","Summary":"3 white lights turned like a plane but was moving too slow ... interior lights within diamond or triangular structure","Region":"Pennsylvania","Log Number":"US-01242012-0034","Case Number":"35119","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/35119.html.txt","/var/www/straped/mufon/org/35119.html"],"City":"Newtown","Weather Factors":"Unknown","Latitude":"40.247463"}