{"Region":"Massachusetts","Object Shape":"Diamond","Object Features":"Other","trends":["There have been 4 other sightings in Seekonk","There were no other sightings in Seekonk on or around January 24th 2012"],"Latitude":"41.828412","Case Number":"35111","Object Flight Path":"Straight-line path,Path then hovering","City":"Seekonk","Tags":"City","Source":"MUFON","Log Number":"US-01242012-0026","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Summary":"A single black diamond shape in a straight line path","Country":"United States","Date Submitted":"01/24/2012 06:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.828412,+-71.32023(35111)&iwloc=A&hl=en\"> mufon case (35111) map </A>","divs":["Sighting Details1. Where were you and what were you doing at the time? I was pulling up my vehicle to Benny's parking lot, nose of vehicle facing Benny's Store front. I exited vehicle facing Benny's, stretched a little and adjusted my pant legs (they were wet) and got ready to go inside... 2. What made you first notice the object? I heard a bird and turned to the direction (off to my left, slightly up) to see it, noticed several black-ish birds flying in a small flock, The birds were heading toward my left & I watched them switch direction... As they switched direction and headed off behind me in a diagonal projectory..I noticed another black thing flying along. In my thoughts, I was wondering why this bird was flying slower than the rest..observed it..realized it wasnt a bird at all. 3. What did you think the object was when you first noticed it? A bird slightly above the flock of birds, just flying slower than the rest. When my eye singled it out and noticed its shape wasnt a bird, I also noticed object was bigger than the birds I had seen. The object stood out, just before & as the birds switched direction. the object stayed on a straight path. The birds flew off in a diagonal path. 4. Describe the object and its actions and motions in detail. The object turned out not being a bird at all, but a diamond shape, dimensional, flat black in color. Its projectory did not follow the birds diagonally after the birds switched direction. It continued on flying (smoothly) toward my left, over my head, then on to my right side and kept going towards and over the adjacent parking lots. When it flew as far as (what seemed) Price Right & Soveign Bank (Taunton Ave) parking lot, it stopped and hovered. At this point, the UFO was tiny to my eye & I decided to go in to Benny's. When exiting Benny's (It was short, because Benny's didnt have what I was looking for) I looked back to the last place I seen the UFO hover & it was still there, but appeared to now be moving...I watched it until I could not see it anymore due to distance. During the sighting, the object did not make any sound what so ever. It was distinctively diamond shaped. I saw a slight almost transparent potrusion off the diamond's point (pointing the direction it was going)It was stiff & not floppy, like a balloon string or anything like it. I could barely see this part of the UFO. I did not see this part of the UFO when it was overhead. There was no glare on this object, but you could see a dimension to the shape. It was not a flat bottom to this object. It moved smoothly across the sky and did not flutter, waver, bob, or nothing like that. Just straight and smooth. There were other people pulling into a parking space, but I dont think they seen it or knew what I was looking up at. 5. Describe your feelings, reactions and actions, during and after sighting the object. Calm, amazed, fascinated, surprised, excited, calm again. 6. How did you lose sight of the object? Lost sight of it due to distance."],"Longitude":"-71.32023","files":["/var/www/straped/mufon/html2text/35111.html.txt","/var/www/straped/mufon/org/35111.html"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"01/24/2012 04:20 UTC"}