{"Sighting Duration":"Undisclosed","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around January 21st 2012"],"Disposition":"Unresolved","Viewing Distance":"Unknown","City":"Colorado Springs","Object Shape":"Unknown","Latitude":"38.911097","files":["/var/www/straped/mufon/html2text/35112.html.txt","/var/www/straped/mufon/org/35112.html"],"Longitude":"-104.716897","divs":["Sighting DetailsAt approximately 6:50PM on Saturday January 21, 2012 I looked out my west facing master bedroom window from the northeast side of Colorado Springs. I saw a bright object in the sky to the southwest of me. I at first thought it was a star, but noticed it was much brighter and somewhat larger than a typical star. I next thought it was probably Venus, which I still have some lingering thoughts that it was, but then I noticed something odd. The clouds that were closer to the object were getting scanned by what looked like a search light moving in a circular fashion towards the clouds around the object. I thought perhaps a ground based search light, but I was unable to see any beam emanating from the ground, and there were no planes or helicopters in the vicinity at the time. I later observed a plane cross under the object further out in the distance. I did grab my video camera and recorded the object from my second floor master bedroom window at first, but I was unable to get a good shot of the cloud scan so I moved outside for a bit to record and see if I could capture the event better. I was able to see the light scanning the clouds faintly on the video, but as the cold settled in, I retreated inside and about 10 mins after that the object was no longer visible in the sky either from outside or my master bedroom window on the second floor. I still feel that I was viewing Venus and the search light was just a coincidence even though I couldn't trace a beam and the circular patter was strange. I am posting this report as I have doubts about what I saw and I am wondering if anyone else reported a similar event. I do have the video footage and would be happy to have it looked at by a MUFON investigator if they feel the need to see it."],"Date of the Event":"01/21/2012 07:00 UTC","Object Flight Path":"Stationary","Source":"MUFON","Case Number":"35112","Tags":"City","Date Submitted":"01/24/2012 06:54 UTC","Summary":"I believe I mis-identified it, but there were a few factors that make me question what I saw.","Region":"Colorado","Country":"United States","Log Number":"US-01242012-0027","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.911097,+-104.716897(35112)&iwloc=A&hl=en\"> mufon case (35112) map </A>"}