{"Region":"Texas","Latitude":"30.500453","Summary":"It was triangle shaped , moving slowly about 500 feeet above me my heart was pounding","Object Flight Path":"Path with directional change","City":"Ozona","Log Number":"US-01242012-0032","trends":["There have been 2 other sightings in Ozona","There were no other sightings in Ozona on or around November 28th 0002"],"Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Source":"MUFON","Country":"United States","Object Features":"None","Tags":"City","divs":["Sighting DetailsI had just clocked in for work so I know it was 5:30am, I'm always there before sunrise.I stepped out of the meeting room, where the time clock is and I don't know why I just looked up, and there it was moving less than 5 miles an hour in an easterly direction. It was Completely silent, and it was as big as a football field. I could tell how big it was because it was a clear morning and the stars were shining and as I looked up I couldn't see the stars, I could only see them further over past the outline of this triangle shaped ship. It was only about 500 feet above me as I watched it in awe as it moved slowly east, then in an instant it streaked across the sky so fast that I couldn't hardly follow it with my eyes. Afterwords I felt like I had worked a whole day, my adrenaline must have been pumping hard while I was looking at this thing. It only lasted a few seconds but seemed like longer it was like everything was in slow motion while I was walking and looking up and then all of a sudden it just picked up speed and streaked away towards the north east."],"Longitude":"-101.148869","Case Number":"35117","Date of the Event":"11/30/0002 05:35 UTC","Sighting Duration":"00:00:30","Date Submitted":"01/24/2012 08:30 UTC","Object Shape":"Boomerang, Chevron, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=30.500453,+-101.148869(35117)&iwloc=A&hl=en\"> mufon case (35117) map </A>","files":["/var/www/straped/mufon/html2text/35117.html.txt","/var/www/straped/mufon/org/35117.html"]}