{"Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-01242012-0025","Longitude":"-87.192986","Date of the Event":"01/24/2012 11:26 UTC","Object Flight Path":"Straight-line path","Summary":"It appeared to be tracking the airplane I was looking at.","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/35110.html.txt","/var/www/straped/mufon/more/35110_submitter_file1__StrangeContrailByAnAircraft-12-3-2011.jpg","/var/www/straped/mufon/org/35110.html"],"Latitude":"33.849837","Weather Factors":"Unknown","Date Submitted":"01/24/2012 06:17 UTC","trends":["There have been 5 other sightings in Jasper","There were no other sightings in Jasper on or around January 24th 2012","This sighting has never been favorited.",""],"divs":["sighting detailsi was out in my driveway at 11:26am today 01\\24\\2012. i looked up and saw an airplane (very high up, so i couldn't make out the plane's body, but assumed it was a large plane due to the large contrail) heading west from birmingham, alabama, and was thinking of the contrail it was leaving. the reason for this is because on december 3, 2011, i took a photo of an odd contrail with evenly spaced ripples, and i had never seen anything like it before (i will provide the picture of the contrail from dec. 3rd). back to today, i was looking at the plane, and that's when i noticed a larger object behind, and just slightly lower in the horizon trailing the plane. i wouldn't have thought to much about it if the sun hadn't reflected off of the object as i was looking at it. this object was definitely larger, and did not have any form of contrail behind it and it was keeping up with the airplane. i watched this for about 3-4 minutes until they both went behind the trees in my front yard, so i went to the end of my driveway (about 45ft), and i was able to see the airplane, but not the object anymore. it never crossed my mind to get a camera, but i got my phone and called my brother in kansas city, mo at 11:36am to tell him. as i was on the phone with him, i noticed an airplane heading east towards birmingham, al. (also pretty high up), and i noticed the object again. this time i was only able to see the object for about 15-20 seconds, and then it just disappeared, but the airplane was still in view. this is the second time i've seen something strange, and the first time both myself and my mother saw something in kansas city, mo back in 2008 that was unexplainable to us. i wish i could see this again to prove i'm not crazy, but this was the most exciting thing for me since seeing the other object in 2008. again, i am posting a picture of a strange contrail that i saw back on december 3, 2011. it's different from any other contrail i've seen, and i used to live close to whiteman afb in missouri."],"Sighting Duration":"Undisclosed","Case Number":"35110","Tags":"City","City":"Jasper","Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=33.849837,+-87.192986(35110)&iwloc=A&hl=en\"> mufon case (35110) map </A>","Source":"MUFON","Disposition":"Unresolved","Object Shape":"Cigar, Cylinder"}