{"trends":[],"Date Submitted":"01/25/2012 01:08 UTC","Latitude":"40.638645","Tags":"City","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/35123.html.txt","/var/www/straped/mufon/org/35123.html"],"Date of the Event":"01/03/2010 03:30 UTC","Region":"Illinois","City":"Undisclosed","divs":["Sighting DetailsMy friend and I were scoping out a house where the occult practices from a fairly good distance, about 100 yards off. There was a field near by where cows are kept to feed on the field during the winter, and they were dead quite. So was everything else in the valley. Not a single sound. Except for a demonic roar, that was multi-pitched, and would come from about a hundred yards off about every other minute or so. We didn't really care though.....because we suspected we were well camouflaged and it was late enough at night to evade, which we had already done that night, if necessary. We were overlooking an embankment about 15 yards apart from each other. He was ahead of me. I was looking at him to get the go ahead to move because our presence was already known there. he suddenly froze, then started sprinting in my direction. Under his breath he told me to run, and run we did, for about 1.5 miles. Along the way we could hear the multi-pitched voice call to its buddies, and they would call back, in their multi-pitched voices. When we finally got out and got to have a cigarette, he told me what happened. The house we were checking had company. As ----- was checking out the house, a 8.0 to 8.5 foot tall cloaked being came to the window and looked directly at him. He said he froze from it's stare, and then saw it make a go for the door of the house. He made for it when that happened and we both ran. He said the thing wasn't human, and wasn't very happy.....We didn't speak an entire word on the ride back. The feeling down there is death, and you have to accept it to face these guys. worst trepidation of my life...no joke. When we got back to __________, his eyes started to bleed. They bleed for about the next full day. Couldn't really find anything on the internet to collaborate this experience, but we did meet another group of 2 from the area that had the same exact thing happen to them, eyes bleeding and all. I have suspect evidence to believe that it was reptilian, from the near abduction instances from the triangles down there, and other personal witness of reptilians in the area."],"Sighting Duration":"00:00:30","Log Number":"US-01252012-0004","Viewing Distance":"Unknown","Longitude":"-89.393408","Country":"United States","Weather Factors":"Unknown","Summary":"7 foot tall cloaked being, reptoid.","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Case Number":"35123","Disposition":"Unresolved","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.638645,+-89.393408(35123)&iwloc=A&hl=en\"> mufon case (35123) map </A>"}