{"Latitude":"33.885638","Date Submitted":"01/25/2012 10:46 UTC","Sighting Duration":"00:00:07","Tags":"City","Date of the Event":"01/24/2012 01:00 UTC","Object Features":"None","Source":"MUFON","Object Flight Path":"Straight-line path","City":"Manhattan Beach","files":["/var/www/straped/mufon/html2text/35127.html.txt","/var/www/straped/mufon/org/35127.html"],"Object Shape":"Sphere","Case Number":"35127","Country":"United States","Region":"California","Longitude":"-118.41002","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Log Number":"US-01252012-0008","Weather Factors":"Unknown","Summary":"White orb moving east to west in skies over LAX","trends":["There have been 2 other sightings in Manhattan Beach","There were no other sightings in Manhattan Beach on or around January 24th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.885638,+-118.41002(35127)&iwloc=A&hl=en\"> mufon case (35127) map </A>","divs":["Sighting DetailsAt approximately 13:00 I was unloading my car with supplies for the office. I happened to gaze north into the beautiful blue skies over LAX when a white spherical object caught my eye, about 30 degrees above the horizon, moving fast from east to west. I will liken the speed of the object to what you might expect of a fighter jet on mission. At first I considered it might be a balloon, but the speed was tremendous and the trajectory was straight line to the horizon and unwavering. The size of the object appeared to the eye as about the size of a very small spherical pill. The color was white, but had a metallic quality, as the sunlight seemed to reflect off the surface and I caught a glint or two. Because the object was so small I did not want to take my eyes off it for fear of losing it. Keeping my eye on the object, I backed to the door of my office and called for some of my colleagues to come out. They came but too late, as the object disappeared from view behind the roof line of a house. I tried to anticipate it's emergence on the other side of the house, but it never showed. I ran a little further down the street to see if I could re-acquire the object, but alas, it was gone. Neat little mini-sighting."]}