{"trends":["There has been one other sighting in Tamarac","There were no other sightings in Tamarac on or around January 24th 2012"],"Latitude":"26.204279","Source":"MUFON","Country":"United States","Case Number":"35125","Object Flight Path":"Stationary","City":"Tamarac","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","Object Shape":"Oval","Longitude":"-80.248548","Summary":"Observed stationary metallic object to SE approx 1/2 mile high/watched for several minutes","Log Number":"US-01252012-0006","files":["/var/www/straped/mufon/html2text/35125.html.txt","/var/www/straped/mufon/org/35125.html"],"divs":["sighting detailsi walk my dogs each morning at approx 6-6:30-7:00am. while returning home, wed stopped, and i was enjoying the early morning light\\cloud patterns...light clouds, lots of clear sky. when i looked up, and back toward my home, sse direction, i noticed a stationary, ovoid appearing object. it just remained in the same spot, no movement. this area is near the local airport, and im quite used to seeing jet\\planes\\helicopters, also police helicopters. this was definitely not an aircraft im familiar with. even without my glasses, i could tell it seemed to be metallic\\silvery-grey, in color,couldnt tell the size, due to distance, but it was large enough to discern clearly, even at the distance given. the sun was just coming up, and highlighted it. although i didnt want to, i had to get home,but i watched it for at least 5 minutes, and it didnt alter its position, remained totally stationary. when i looked up again, after reaching my home, in the same general area of the sky, it was no longer there, or at least was not visible to me."],"Date of the Event":"01/24/2012 06:45 UTC","Date Submitted":"01/25/2012 08:22 UTC","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.204279,+-80.248548(35125)&iwloc=A&hl=en\"> mufon case (35125) map </A>","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}