{"Summary":"Large, Bright Yellow Stationary Object low in sky. No other discernable lights. Airplane was to the right of it at same height and was moving and audible as if checking out the object","map":"<A HREF = \"http://maps.google.com/maps?q=43.404542,+-70.705093(35122)&iwloc=A&hl=en\"> mufon case (35122) map </A>","files":["/var/www/straped/mufon/html2text/35122.html.txt","/var/www/straped/mufon/org/35122.html"],"Sighting Duration":"Undisclosed","Case Number":"35122","divs":["Sighting DetailsI was preparing to leave work and went outside to check my text messages on my cell phone, it doesnt work inside the building, and while I was out there I recalled being told there could be northern lights visible from the recent solar activity so started to scan the sky. When looking around I saw a large bright yellow object over to the west by the airport, but it wasnt moving. I then saw what I know was a plane a little ways off to the right of the object. My first thought was that is a UFO and the plane which appeared smaller was investigating it. Then I told myself I was being dramatic but I continued watching because the object was curious and I again started questioning what my eyes were seeing so I took a picture and a short video clip with my phone. The plane continued on but the large object appeared to be in the same spot as it was when I first noticed it just glowing brightly. Then it almost seemed to have moved closer in an instant but there was no audible noise as there had been with the plane. I became embarassingly and increasingly nervous about it seeming to move closer and went back into the building to collect the rest of my belongings. When I came back out the object was gone. And I have to admit I felt a bit relieved. I did notice when driving past that the airport strip was lit up and there was activity going on which is unusual to see at night at this particular airport. I would have written this off as my imagination being overactive if I hadnt checked your site and seen that someone to the North of me reported seeing what I saw at about the same time. Now Im wondering exactly what it was that we both were seeing so I thought I should share my story if it will help identify what that was. There could be a valid explanation...or not. P.S. My picture and clip wont attach to this form but if someone from Mufon would like to email me with an email address I think I can attach them that way. Thank you."],"Latitude":"43.404542","trends":["There have been 4 other sightings in Sanford","There were no other sightings in Sanford on or around January 24th 2012"],"City":"Sanford","Tags":"City","Object Features":"Unknown","Longitude":"-70.705093","Log Number":"US-01252012-0003","Date Submitted":"01/25/2012 01:03 UTC","Weather Factors":"Unknown","Region":"Maine","Date of the Event":"01/24/2012 06:25 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path then hovering","Country":"United States","Disposition":"Unresolved","Object Shape":"Fireball"}