{"Tags":"City","files":["/var/www/straped/mufon/html2text/35129.html.txt","/var/www/straped/mufon/org/35129.html"],"Case Number":"35129","Region":"Michigan","divs":["Sighting DetailsI am a bit of a stargazer I frequently take time to observe the stars and night skies to watch for strange objects or just look at the stars. One night in either late August or mid September, I do not remember the date clearly. I had a sure feeling I was going to see something strange in the skies and had only been observing for about 5 minutes when I looked to the east and noticed a very bright orange light simply appear headed north moving at a rapid speed and low altitude the light brightened then the light simply faded like someone blowing out a candle the light just stopped shining, not even 3 seconds after seeing this another light this one being white brightened and appeared at a higher altitude above where the orange light was, this light was moving south, and also moving at a high speed and also faded away in less than 4 seconds. I am not sure what I saw that night but I found it strange how quickly they both appeared within about 15 seconds of eachother and the way they faded in and out intrigued me. rather than seeing a steady light move in from the horizon like a conventional aircraft they simply appeared then dissapeared mid-sky. normally I would disregaurd this sighting but I figured I would report it since I saw two in succession both lights fading in and out both moved in a straight line the Orange light headed north appearing first at a lower altitude. about the same altitude you would see a helicopter flying at yet there was no noise, and rather than dissapearing from sight the light faded away. The white light then appeared seconds after, higher in the sky moving in the opposite direction south also fading in and out of sight mid-sky rather than dissapearing over the treeline making no noise. I know these were not comets or meteors for they moved north and south rather than east to west. I am 17 and often skeptical about UFO reports but to this day this sighting remains my most mind boggling observation."],"Viewing Distance":"501 Feet - 1 Mile","Summary":"BRIGHT orange light appeared/dissapeard headed from south to north followed by white light above headed from north to south","Date of the Event":"09/16/2011 10:30 UTC","Disposition":"Unresolved","Country":"United States","Object Shape":"Sphere","Longitude":"-82.526839","Weather Factors":"Unknown","Latitude":"43.052572","Source":"MUFON","Log Number":"US-01252012-0010","trends":["There have been no other sightings in clyde","This sighting has been favorited 1 time."],"Object Flight Path":"Straight-line path","Date Submitted":"01/25/2012 11:23 UTC","Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=43.052572,+-82.526839(35129)&iwloc=A&hl=en\"> mufon case (35129) map </A>","City":"clyde","Object Features":"Unknown"}