{"Object Flight Path":"Path with directional change,Unknown","Longitude":"76.730039","City":"Ketti Ooty","Country":"IN","Tags":"City","files":["/var/www/straped/mufon/html2text/35124.html.txt","/var/www/straped/mufon/org/35124.html"],"trends":["There have been no other sightings in Ketti Ooty","This sighting has never been favorited."],"Object Shape":"Star-like","Case Number":"35124","Summary":"Star like object moving randomly in the night sky","Latitude":"11.387753","Object Features":"None, Unknown","Date of the Event":"03/01/1980 07:00 UTC","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Unknown, N/A","Date Submitted":"01/25/2012 04:44 UTC","divs":["Sighting DetailsI dont remember the exact year, but it was sometime between 1980 & 82. I was a student in the St.Georges Homes, boarding school in Ketti,in the 6th or 7th grade and about 11 or 12 years old. in the Nilgiris District of Tamil Nadu India. There were about 400 students in school those days and we used to have movie shows once a month in the Dining Hall which also was used as the auditorium. One evening as we were waiting for the movie show to begin, three or four of my classmates were together playing, when suddenly one of us, I do no remember who, pointed up to the sky and said \"Look!!! A satellite in the sky\", and so all of us stopped playing and looked up at the sky and for the next 15 or 20 minutes had the most singular experience. We all thought it was a satellite in the begining. But then we noticed it was not moving in a straight line. It just appeared to be randomly moving in the sky. It appeared to us that it went near certain stars. Meaning it would go near a star and stop, then it would go near another star and stop for a few seconds. This went on for some time as we watched. It was a clear cloudless night and we could see all the stars clearly. So the constellations were also clearly visible. There was this line of three stars, and it went near the first star and one of us said out loud, what if it went to the next star in line, and lo and behold, this moving star slowly moves to the second star in the line, next we said, what if it went to the third star, and it went again, this went on for may be the next 15 minutes or so, this moving star would go near every star we wanted it to go to. By then the movie show had begun and we had to go into the auditorium. We were too young to realize the seriousness of what we had experienced. We never spoke of this to anyone else. Ever since Once in a while I always looked up at the night sky, hoping to see this object again. Never saw it again. As I grew older I later learnt that the distances between the stars are so enormous and as per the laws of physics, it would be impossible for anything to travel so quickly between these distances and in reality the stars are not really in line etc..But what still bothers me is that, how this thing was able to do what we wanted it to do and how did it make us feel that it was doing what we wanted it to do? How did it communicate with us?? I met one of my friends who was with us that night about 25 years after I left school, and he asked me..Do you remember that star??"],"Sighting Duration":"Undisclosed","Region":"","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=11.387753,+76.730039(35124)&iwloc=A&hl=en\"> mufon case (35124) map </A>","Log Number":"IN-01252012-0005"}