{"map":"<A HREF = \"http://maps.google.com/maps?q=32.379629,+-81.663166(35131)&iwloc=A&hl=en\"> mufon case (35131) map </A>","Tags":"City","City":"Brooklet","Source":"MUFON","Weather Factors":"Unknown","Case Number":"35131","Object Features":"Wings, Unknown","Date Submitted":"01/25/2012 01:21 UTC","files":["/var/www/straped/mufon/html2text/35131.html.txt","/var/www/straped/mufon/org/35131.html"],"Date of the Event":"01/25/2012 01:46 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-81.663166","Summary":"Looked as if it was a Boomerang or triangle in shape.","Log Number":"US-01252012-0012","Country":"United States","Latitude":"32.379629","Object Flight Path":"Path with directional change","Object Shape":"Boomerang, Triangle","trends":["There have been 2 other sightings in Brooklet","There were no other sightings in Brooklet on or around January 25th 2012"],"Region":"Georgia","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsIt was getting close to Two AM and I stepped outside to smoke a cigarette. I always look up at the stars when I go outside because the sky is so clear and they are always so bright. Well I look up to the North West and I see what looks to be an Aircraft of some sorts because immediately I saw its blinking lights but what was odd was it had headlights on. Then when I looked in front of it at first I thought I was seeing a bright star visible through the beam of light but then that light was moving ahead of the Aircraft and was making a sharp cut from heading Northeast to East. The light on the craft in front didn't and when it made its cut to the East I was able to see an outline of it and it appeared to be boomerang in shape and it had lights on the inside of the wings and none on the outside and those didn't blink either. I continued to watch it being followed by the Aircraft behind it until the Craft just slowed almost to a stop immediately and as soon as the Aircraft from behind got to where the craft was almost hovering it took off with the Aircraft from almost not moving to the same speed of the Aircraft that had not slowed down. Then they moved as one as if they were supposed to.They continued in this fashion until the disappeared over the tree line. What was shocking was neither craft made any noise and they were low enough to where I should of heard something but I didn't. I am an open minded person but also I am very rational in thought so I tried to discredit this with all I had before I could accept I just saw something truly unusual. But I really cant explain what it was. I am also upset that no one was there to see it with me to maybe even help me understand what it may of been but I really was astounded by this Craft flying above."]}