{"Weather Factors":"Unknown","Sighting Duration":"00:00:10","Viewing Distance":"21-100 Feet","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3513.html.txt","/var/www/straped/mufon/org/3513.html"],"divs":["Sighting DetailsMy children and one of their friends were with me in the car as we were driving home in our subdivision to our house. As I turned the corner I saw the object moving slowly above the treetops of several houses out of my driverside window. It was 24-48 feet above the treetops and very large. I was able to see the object completely to know it was not a plane or anyother object I have ever seen in my life. It was a solid triangular shaped object that was illuminating a bright whitish silver light and had a bright blue glow aroung the perimeter of the object for about 5-6 feet out. As soon as I yelled at the kids my daughter looked and screamed and then object increased its speed flying over the treetops and across the sky heading west. My heart started beating so fast, I never in my life thought something like that really existed. It was low enough that I know what I saw. There is no mistake about what I saw. I came straight home and when we got out of the car to come inside our house all the dogs in our subdivision were barking. When the object increased its speed and flew across the treetops out of view there was no sound no movement of the treetops, nothing. I lost sight of the object after it flew west over the treetops."],"Summary":"Solid White Glowing Triangular Shaped Object","Date Submitted":"12/27/2005 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.226595,+-93.217376(3513)&iwloc=A&hl=en\"> mufon case (3513) map </A>","Disposition":"Hoax","Date of the Event":"12/27/2005 09:10 UTC","Longitude":"-93.217376","Object Features":"None","Latitude":"30.226595","Case Number":"3513","Tags":"City","Country":"United States","Log Number":"US-06272005-0010","Region":"Louisiana","City":"Lake Charles","trends":["There have been 16 other sightings in Lake Charles","There were no other sightings in Lake Charles on or around December 27th 2005"],"Object Shape":"Triangle","Object Flight Path":"Other"}