{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/35136.html.txt","/var/www/straped/mufon/org/35136.html"],"Sighting Duration":"04:00:00","Disposition":"Unresolved","Date of the Event":"07/20/1988 02:00 UTC","City":"Rockford","divs":["Sighting DetailsOn this night I had some buddies of mine over for a visit. I live in the out skirts of town in the open country farm area. There were four of us there. It was a very nice warm summer night. I had my guitar out side and plugged into an amp and was playing some tunes for my friends. We were having some beer's and just enjoying the night since it was the weekend. The sky was very clear and the stars were all around. My friends had been there going on about six hours and it was getting to be about 2:00 a.m. in the morning. My mother and step father were out of town and I was staying home alone. We had dairy cows at that time and grew corn. The sky was still clear and all of a sudden the wind started blowing as if a storm was approaching but there wasnt any clouds as we could see. The cows in the barn started acting funny and making noise, like some thing was bothering them. One of my friends then said he was ready to leave because he didnt want to get hit with that storm he thought was comming and needed to get home. So he looked up at the sky and said. That's so strange because he did'nt see any clouds or anything but the the way the wind was acting it should have looked stormy. But he got in his car then pulled out of my long drive way we have and drove off. Well right after he left my other two friends decided they were gonna leave also. As they were pulling out of the drive I noticed something big and dark above one of the three corn bins we have and was just hovering above it. I quickly started flashing the house lights on and off to get them to come back and to look at what I was seeing but they never even noticed the thing and just drove off honking the horn good bye. I then turned my attention back to the object and started to walk towards the corn bin were it was hovering. I noticed it was very large and was triangle shaped. it looked bigger than the corn bin. It had some lights kinda pulsating around it. I thought what the heck. I had a beer in my hand as I walked up to it,( no I wasnt drunk ), I was seeing this thing. The beer was in my right hand because im right handed and always use that hand. Just as I was staring at this thing, BAM! this light hit's me like a spot light, very bright. I can't see anything now. Just that light. After I was hit with that light all I remember was the light going back up into the UFO and it just took off like very fast and was gone. Now this is the strange part. This all happened at around 2:00 a.m. and was dark outside of course. But now as im standing there the sun is comming up and it's just becomming dawn. And the beer I was holding was now in my left hand and I swear that I never switch it. Seem's four hours had passed and I dont remember what happened in between. I feel I was taken aboard or something, and then put back down. I have had bad dreams since then and always about being on some strange table being looked at by aliens. I just wanted to share this story since I feel maybe this may have happened to some one else perhaps and to let them know they are not alone. Thank you very much for reading my report. C. M. from Illinois.."],"trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around July 20th 1988"],"Viewing Distance":"21-100 Feet","Date Submitted":"01/25/2012 03:46 UTC","Longitude":"-89.089205","Case Number":"35136","Object Shape":"Triangle","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-01252012-0017","Summary":"UFO sighted and possable abduction.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.280571,+-89.089205(35136)&iwloc=A&hl=en\"> mufon case (35136) map </A>","Region":"Illinois","Tags":"City","Country":"United States","Latitude":"42.280571"}