{"divs":["Sighting DetailsI looked up in the sky over my head one day in August 2007 and the sky was clear with large cumulus clouds. I spotted a contrail coming from a craft or UFO. The UFO was heading straight up at an angle to my left at about 11 oclock. At the time I spotted it, it was probably under 20,000 ft altitude. It was a conical shaped craft that was a little bigger than what you would see on the top of a saturn 5 rocket. The shape was probably a little more skinny than the saturn 5 module. The best way I can describe it is to say it was similar to the Mcdonnell Douglass Delta Clipper. It had a polished metallic appearance exterior and the sunlight would flash off of its reflective skin as it moved. Its speed was not too fast or too slow but about what you see commercial jets flying at. The contrail was a white continuous stream with clear and crisp white rings at a constant frequency (donuts on a rope). I saw these rings popping out of the exhaust of the UFO and it was maybe 1 every 1-3 seconds Id say -not too fast or too slow. The rings appear like actual rings unlike some of the photos I've seen on the internet about this subject. I kept watching this craft as it increased in altitude to probably above 60k feet where I couldnt see it any more. Also, to the right I saw 2 other ufos that were of the same shape and design which were ascending at a similar speed to the first. They appeared to the upper right or at the 1 oclock position of me and these were at a lower altitude at first (staged lower from the first ufo). However, these two which looked like they were side by side had no exhaust whatsoever that I could see. Again I kept watch of these 2 ufos until I could not see them as they disappeared into the upper atmosphere traveling at a steep angle opposite of the first ufo."],"Date of the Event":"08/20/2007 12:00 UTC","Summary":"3 conical shaped ufos with 1 ufo having a \"donuts on a rope\" contrail","Region":"Indiana","Sighting Duration":"Undisclosed","Case Number":"35148","Object Features":"Other","City":"Avon","Latitude":"39.77838","trends":["There have been 3 other sightings in Avon","There were no other sightings in Avon on or around August 20th 2007"],"Log Number":"US-01252012-0029","Country":"United States","Object Shape":"Cone","Source":"MUFON","Date Submitted":"01/25/2012 10:20 UTC","files":["/var/www/straped/mufon/html2text/35148.html.txt","/var/www/straped/mufon/org/35148.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.77838,+-86.343592(35148)&iwloc=A&hl=en\"> mufon case (35148) map </A>","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-86.343592","Viewing Distance":"Over One Mile"}