{"City":"Statesville","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting Details Around 6:45 pm on 1-19-2012, I was coming home from work. I noticed 20 plus round bluish orbs fly horizontally across the sky. They were flickering. They almost looked like fireworks. I heard no sound. I called my wife who was already in doors to come outside. She observed them also. They gradually spread apart and began moving around in small circles and disappeared slowly. This event took around 5-6 minutes before they all vanished. Shortly later, my wife and I were at the dinner table eating. We heard a low humming or rumbling outside. My wife actually heard or noticed the noise first. She stated, \"What is that?\" \"Go outside and see!\" I went outside as my wife followed behind me. I immediately looked north. I saw an object that I could not make out at first, not very far from me. It was in the sky but was flying fairly low for an aircraft. I asked my wife, \"Is that a jet?\" It could not be a jet flying so low and hovering slowing like it was. It did not fly like one at all. It was above tree top level and way above the houses in our subdivision. It appeared to hover and made no major noise, just a low hum. It was in the shape of a triangle. As it came closer,the body of the craft appeared to be very dark, almost transparent. It had a bright red blinking light on the bottom of the craft. It had three white lights on each end. That is how we made it out to be a triangle and while lights on each tip. It had a dark shadow also like something was there. It looked like an invisible triangle with a red blinking light on the bottom. It appeared to be in a turn as it seemed to notice us. It turned around and moved over toward us. It was still low but over tree top level. It was pretty big. As the object did a complete circle around our area of the neigborhood we notice an identical craft descend out of the sky. It seemed to have come from no were. It was flying and descending from a higher altitude from the southwest going north toward the first craft we saw. We became very scared at this point. We were frightened by the first but became very scared when we saw the second craft. I thought there may be some type of invasion honestly. We ran back toward the house until the second craft passed on. The craft met up with the other craft and they began to fly off in a straight path toward Highway 40 which is in view from our house. They did not change directions anymore. I watched them for 10-15 minutes. They flew over Highway 40 toward the north. They flew over a few manufacturing buildings that are in view across the interstate. I watched them until all I could see were the red blinking dome lights on them. They eventually faded out of view as they flew further on. Those red blinking lights were so bright they could be seen for over a mile away. My wife and I have been nervous for the past several days. It has been 6 days since we had this sighting. I did not notice anyone else outside that may have seen it. I immediately contacted MUFON NC. I just need to talk to someone. My wife and I are still frightened by it but have come to terms with it. I have told my family members only. 1-25-2012 at 9:34 pm."],"trends":["There have been 5 other sightings in Statesville","There were no other sightings in Statesville on or around January 19th 2012","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/35144.html.txt","/var/www/straped/mufon/more/35144_submitter_file1__DSC04045.jpg","/var/www/straped/mufon/org/35144.html"],"Tags":"City","Latitude":"35.782409","map":"<A HREF = \"http://maps.google.com/maps?q=35.782409,+-80.854667(35144)&iwloc=A&hl=en\"> mufon case (35144) map </A>","Object Shape":"Sphere, Triangle","Viewing Distance":"101-500 Feet","Log Number":"US-01252012-0025","Object Features":"Dome","Country":"United States","Date Submitted":"01/25/2012 09:37 UTC","Summary":"Trangle Shaped Craft with Red Pulsating light on bottom center of craft","Source":"MUFON","Sighting Duration":"01:30:00","Date of the Event":"01/19/2012 07:30 UTC","Region":"North Carolina","Disposition":"Unresolved","Case Number":"35144","Weather Factors":"Unknown","Longitude":"-80.854667"}