{"Disposition":"Unresolved","Log Number":"US-01252012-0027","Object Features":"Unknown","Region":"Illinois","Case Number":"35146","divs":["Sighting DetailsOn this night I had some buddies over for a visit. I live on the out skirts of a town called Belvidere in Illinois, out in the open country farm area's. There were four of us there. It was a very warm summer night. I had my guitar outside and plugged into an amp and was jamming some tunes for my friends. We were having some beers and just enjoying the night since it was the weekend. The sky was very clear and the stars were all around. My my were there going on about six hours and it was getting to be around 2:00 a.m. in the morning. My mother and step father were out of town and I was staying home alone. We had dairy cows at the time and a corn field on our farm. The sky was still very clear but wind started blowing as if a storm was approaching but no signs of clouds anywhere. The cows in the barn started acting funny pacing and making mooing noise's, as if something was spooking them. One of my friends decided to leave because it was late and he didn't want to get caught in the storm that he thought was coming. So he looked up at the sky puzzled and said, \" That's strange how there are no clouds around and looks and feels stormy \". He then said, \" Later Dude's!\", and drove off. Just after he left my other two friends said they were gonna take off also and started pulling out my drive way witch is kinda long before you get to the main road. As they were pulling out I noticed something dark and big just kinda hovering over one of our three Corn bin's. I quickly ran to the porch light switch and started flickering the lights so my friends would see what I was seeing but they didn't notice the thing and just honked the car horn and yelled, \" Later Man \". So I then put down my guitar and still had a beer in my right hand, and no! I wasn't drunk. I was really seeing this thing, and started walking up to the corn bin thinking, what the heck. I saw it was very large and black in color and was like a triangle shape and it had some lights going around it on the three tips of the shape and one on the bottom that seemed to be getting brighter as I watched it. Then just like in a second, a bright white light came out from the bottom and was blinding me from seeing. Then the next thing I knew the light was going back up to the object and then it took off in a flash like a match blowing out. The next thing is even stranger. It was like 2:00 a.m. and dark outside when this was occurring but when I was able to focus my eye's from after that brightness, the sun was coming up and it was Dawn and going on around 6:00 a.m.? And the beer I was holding in my right hand was now in my left hand.? I swear, I never switched them. I don't know why there was four hours missing and don't remember anything from the time I saw the object to the time it just took off. I had bad dreams after that some nights about being on a table in a strange place and seeing these beings with big black eye's just looking at me on this table. I wake up sweating and scared. I thought I would share this now because it has always been on my mind and this site gave me this chance to tell it. Thank You so much for reading my report. Chuck M. from Belvidere, Illinois..:)"],"Country":"United States","Sighting Duration":"04:00:00","Latitude":"40.634605","Object Flight Path":"Hovering then path","Summary":"UFO Sighted and possible abduction!","map":"<A HREF = \"http://maps.google.com/maps?q=40.634605,+-89.393728(35146)&iwloc=A&hl=en\"> mufon case (35146) map </A>","Longitude":"-89.393728","Tags":"City","files":["/var/www/straped/mufon/html2text/35146.html.txt","/var/www/straped/mufon/org/35146.html"],"Date Submitted":"01/25/2012 09:47 UTC","Object Shape":"Triangle","City":"Undisclosed","Viewing Distance":"21-100 Feet","Date of the Event":"07/20/1988 02:00 UTC","trends":[],"Weather Factors":"Unknown","Source":"MUFON"}