{"Summary":"Pipe shaped craft with lights on each end. There was another single 3rd light to the left","Longitude":"-88.894028","Log Number":"US-01252012-0024","Object Flight Path":"Stationary","Disposition":"Unresolved","Sighting Duration":"00:00:40","Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in Kenton","This sighting has never been favorited."],"Date Submitted":"01/25/2012 06:17 UTC","files":["/var/www/straped/mufon/html2text/35143.html.txt","/var/www/straped/mufon/more/35143_submitter_file1__IMG_20110309_154103.jpg","/var/www/straped/mufon/org/35143.html"],"Country":"United States","Case Number":"35143","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=46.485499,+-88.894028(35143)&iwloc=A&hl=en\"> mufon case (35143) map </A>","divs":["Sighting DetailsNovember 17th, 1990 at approx 6pm (or shortly before) in Houghton County (in the U.P.) Michigan, in the location east of Golden Glow Road and south of M-28 and west of the Jumbo River. It was dusk and the ski was still light. No clouds visible and it was light enough that we did not need a flashlight to see where we were walking. My dad and I had been deer hunting that evening. At dusk, my dad came to get me from my blind and then we headed back towards my dads blind, to take the main trail out of the woods. As soon as we came to the clearing just about 50 ft from my dads blind, there were 3 bright lights hovering just above the treeline above my dads blind and to the right. Between the two lights to the right, looked like a pipe shaped craft with the bright lights at each end. To the left looked to be another free standing light, just as bright as the other two. The lights were as bright as car headlights and seems to be shining towards us. My dad then brought his rifle up to look at them through his scope. Just then, the lights slowly dimmed and when out. The craft seemed to have completely vanished, without ever moving. There was no sound, no wind and no clouds. We could still clearly see the sky. Later, as we approached out vehicle, we could hear a jet fly nearby. We are not sure if they were looking for what we had just seen."],"Latitude":"46.485499","Source":"MUFON","City":"Kenton","Date of the Event":"11/17/1990 05:55 UTC","Weather Factors":"Unknown","Object Shape":"Cigar","Object Features":"Unknown","Region":"Michigan"}