{"Log Number":"US-01252012-0023","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.583786","files":["/var/www/straped/mufon/html2text/35142.html.txt","/var/www/straped/mufon/more/35142_submitter_file1__06202010063.jpg","/var/www/straped/mufon/more/35142_submitter_file2__290820114704.jpg","/var/www/straped/mufon/more/35142_submitter_file3__240120125763.jpg","/var/www/straped/mufon/org/35142.html"],"divs":["Sighting Detailssince june 20th ive been seeing and photographing a ufo disc shaped object in broad daylight. it started while i was in my backyard smoking a cigarette when i got a strange but powerful urge to look up and i saw something silvery moving through the clouds then i decided to take a few pictures and in one of the pics there it was i thought at first it could have been a bird so i take more pics this time i made sure the sky was clear when a plane was passing by i took a couple of pics, clearly all i saw was the plane but going back to the pic i saw a second object next to the plane and i zoom and see it is clearly a disc, this continued and still happens i also had many sightings where i would see it and take pictures but there would be nothing i have about 60 photos and 170 sightings. jan 18 2012 i observed this disc hovering over new york harbor and on jan 24 2012 i was in central park and i got the same strange powerful urge to take pictures and i did not see the object only when i looked at the picture there it was"],"Country":"United States","City":"New York","Source":"MUFON","Object Features":"None","Tags":"City","Date of the Event":"01/18/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.583786,+-74.071712(35142)&iwloc=A&hl=en\"> mufon case (35142) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"01/25/2012 06:14 UTC","Case Number":"35142","Sighting Duration":"Undisclosed","Region":"New York","Longitude":"-74.071712","Object Shape":"Disc","Object Flight Path":"Stationary","trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around January 18th 2012","This sighting has never been favorited.",""],"Summary":"ufo disc hovering over new york harbor"}