{"Disposition":"Unresolved","Country":"United States","Object Features":"None","Summary":"Orb / Fireball craft emitting red beam down into water","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=27.999913,+-82.688255(35151)&iwloc=A&hl=en\"> mufon case (35151) map </A>","Date Submitted":"01/25/2012 11:32 UTC","trends":["There has been one other sighting in Safety Harbor","There were no other sightings in Safety Harbor on or around January 19th 2012"],"Log Number":"US-01252012-0031","Date of the Event":"01/19/2012 07:45 UTC","Tags":"City","Case Number":"35151","Object Flight Path":"Stationary","Sighting Duration":"00:02:00","Latitude":"27.999913","files":["/var/www/straped/mufon/html2text/35151.html.txt","/var/www/straped/mufon/org/35151.html"],"Longitude":"-82.688255","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Fireball, Sphere, Star-like","divs":["Sighting DetailsThis is our 4th positive sighting of these orbs in the past 3 years with 3 of the 4 seen over water. At 7:45 pm we noticed the orb hovering around 500-1000 foot above Safety Harbor and emitting a red cone shaped beam of light down at the water. We live very close to several airports both private fields, international, Coast Guard and an Air force base so we are very familiar with air craft and helicopters of all shapes and sizes. This orb had no navigation lights only an amber glow masking its actual shape and size. I have found these and other craft are attracted to green lasers and actually carry one with me and once I confirmed the object was not an aircraft with required legal lighting I painted the object with my laser. The object appeared not to like the attention and turned red for a second and then went dark but the object was still there for a couple more seconds as my laser would reflect off its surface then it disappeared in an unknown direction. The orbs are always silent and seem to be trying to camouflage them selves as conventional aircraft, stars or lights. I personally believe they hide in the water during the day and come out from dusk till dawn."],"City":"Safety Harbor","Region":"Florida"}