{"Date Submitted":"11/30/1992 12:00 UTC","Viewing Distance":"Unknown","Object Shape":"Bullet, Missile, Oval","Longitude":"-90.453154","Weather Factors":"Unknown","Date of the Event":"11/30/1992 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/3516.html.txt","/var/www/straped/mufon/org/3516.html"],"Object Flight Path":"Stationary,Straight-line path","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Case Number":"3516","divs":["Sighting DetailsMy son & i were traveling interstate 55 between mcComb & Magnolia Ms. Late afternoon on a Sunday. As we were headed south it came over the trees to our left ahead of us in plain sight, then it just stopped dead still, We slowed down almost to a stop when my son who was about 11 or 12 at the time began screaming for me not to stop. I speeded up & we went under it & I rolled down my window to hear if any sounds & there was none at all, It also had few tiny twinkling lights in few spots. It was a dull grey in color and large I'd say football field size maybe. After we went under it & got passed it a ways I slowed down again & pulled to side of road & looked back & as we were looking to see what it was doing it just left in a high rate of speed(like a flash) Still no sound what so ever. We then came home called our local very small airport & they said they saw nothing on radar, Then we called local sheriffs office & reported it, They said no other calls came in... But strange thing is we were on an interstate highway & we noticed we were the only car north & south, No others in sight.. We have been bothered by this sighting all these yrs wondering why we only saw it..."],"Summary":"traveled over trees & stopped, no sound","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=31.243787,+-90.453154(3516)&iwloc=A&hl=en\"> mufon case (3516) map </A>","Source":"MUFON","City":"McComb","Log Number":"US-06282005-0003","Latitude":"31.243787","Object Features":"Unknown","trends":["There has been one other sighting in McComb","There were no other sightings in McComb on or around November 30th 1992"]}