{"Viewing Distance":"Unknown","Source":"MUFON","City":"Florence","map":"<A HREF = \"http://maps.google.com/maps?q=34.79981,+-87.677251(3517)&iwloc=A&hl=en\"> mufon case (3517) map </A>","Object Shape":"Undisclosed","Log Number":"US-06282005-0004","trends":["There have been 7 other sightings in Florence","There were no other sightings in Florence on or around October 9th 1970"],"Sighting Duration":"Undisclosed","Region":"Alabama","Longitude":"-87.677251","Tags":"City","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/3517.html.txt","/var/www/straped/mufon/org/3517.html"],"Date of the Event":"10/09/1970 05:29 UTC","Country":"United States","Case Number":"3517","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"10/09/1970 05:29 UTC","Summary":"Observed silver triangular with rounded edges, varicolored lights on one side, for seven minutes while riding with my father on long straight road, went under object,it was hovering, looked straight up at bottom of it, no sound, about 200 feet high.","Latitude":"34.79981","divs":["Sighting Details 1.Co.Rd. 14, Lauderdale Co. Alabama, riding home with my Dad from work and school. We came around a curve and onto long stretch of road called Oakland stretch (5 miles of straight road)2. saw flashing varicolored lights on one side. 3. Didn't know what it was so watched it closely.4. The object never moved the entire time but hovered over a power line and street light about 200 feet high. As we got closer became very interested and watched intently. When became very near asked Dad to stop car so could observe more closely but he would not although he did see it also. I was 21 at the time and in college. We drove directly under the object which appeared to be the size of a medium size house. I rolled down window and looked straight at bottom of object which was silvery metallic with flashing varicolored lights on one side (the one facing East). The object emitted no detectable sound. There was a line on bottom which was square shaped but with rounded edges. I implored my Dad to stop,saying \"What the Hell is that?\" Had no camera with me. He would not stop--don't know why, maybe scared. He is now 78 and still remembers it clearly as I do. 6. Went around curve in road. Moonless night but street lamp reflected off bottom of object. Object in full clear view for about 7 minutes and still there when we went around curve and proceeded out of sight. I was at the University of Alabama in 1972 and Stanton Friedman came to speak there and I went to the meeting, but did not report the sighting because I was shy of becoming involved. I did not raise my hand when he asked people to indicate if they ever had a sighting--later regretted not reporting so am doing so now. What could it have been? It was close, real, seen by myself and father for about 7 minutes, drove right under it, I could not think of anything terrestrial that it could be unless secret weapon or aircraft of government--doubted this seriously. I treasure the memory in a way but wish I had had a camera there with me."]}