{"Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI came outside onto my screened-in front porch to sneak a cigarette (I've been trying to quit). While out there, I was just pacing when I noticed an object in the sky off in the distance. My first thought was that it looked like a planet, though it was considerably too close to be a planet. Suddenly, I saw the orb-like object jet to the right and then back to the left. My heart began racing and I stood there watching this object continue this erratic pattern of movement... back and forth, while steadily moving up farther into the sky. When I could no longer see it from where I was standing (it had moved northeast and my view was obstructed by the roof over my porch) I ran outside to the other side of my house. Some people on the beach set off some fireworks (low grade kind you can buy in any store around here) which shot into the sky a distance equal to 4 or 5 two-story houses. I use this as a reference because despite the fireworks, the object was an even farther distance and did not seem to relect any light from the fireworks. At that point the object seemed to move a bit faster steadily moving into the night sky over the beach until my view of the object was obscured by clouds. The only other things I can say about this object are: 1. There was no sound coming from the object. 2. The object was shaped like an \"orb\" (completely round)and seemed to blend in with the sky. There was a slight soft outline, but other than that there were no lights. I got the impression that the object was a matte or dark metal because it did not reflect anything and it blended almost seamlessly into the sky. 3. It was a night sky and partly to mostly cloudy. If anyone saw this as well or if anyone has questions, please feel free to contact me."],"City":"Kill Devil Hills","Object Features":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/3519.html.txt","/var/www/straped/mufon/org/3519.html"],"Object Flight Path":"Undisclosed","Date Submitted":"06/27/2005 09:26 UTC","Longitude":"-75.67601","trends":["There have been 3 other sightings in Kill Devil Hills","There was one other sighting in Kill Devil Hills on or around June 27th 2005"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.030723,+-75.67601(3519)&iwloc=A&hl=en\"> mufon case (3519) map </A>","Date of the Event":"06/27/2005 09:26 UTC","Source":"MUFON","Latitude":"36.030723","Log Number":"US-06282005-0006","Weather Factors":"Unknown","Viewing Distance":"Unknown","Summary":"Erratically moving orb disappears behind clouds in night sky.","Object Shape":"Undisclosed","Case Number":"3519","Region":"North Carolina"}