{"Region":"Arizona","Log Number":"US-06282005-0007","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around June 26th 2005"],"Viewing Distance":"501 Feet - 1 Mile","City":"Scottsdale","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-111.920172","divs":["Sighting DetailsMy boyfriend and I had just finished dinner when the phone rang, we almost didn't answer.It was our neighbors who told us to come outside and look at the lights in the sky. We went into the backyard and at first I saw nothing at all. So I went into our front yard to get a better look from around the tall trees.That's when I saw these lights just floating in the sky.I yelled at everyone I could see it, then my neighbors told me to come in their back yard. WE all just stood there in awe trying to come up with every explanation.I thought maybe it could be a helicopter chasing someone down, but it made no noise at all.It was very bright.It would go from left to right then very far down to very high up,then descend back down again.Sometimes it would just stay put for a while.It changed colors from blue to green red and white, sometimes it was all the colors at the same time. Our neighbors had seen a few others before they called us out, they said it was like they were playing with each other.I got in my car and left to drive towards it a little more, so I could get around all the trees.I had lost it.Should have stayed home, because my boyfriend and the neighbors said a few more came out then it was just the one again.Then they got scared because they thought it was coming towards them,they went in the house. I never grabbed for my video camera or my digital camera.My neighbor was trying to get it on his camera phone but it would not show up.I wish I had got out the camera! I waited for it last night but no luck seeing it. I got this website off our local news.I am trying to find out if others have reported the same lights that night. I think it was flying near the Indian Reservation near us. I live in south Scottsdale, we were facing East.Near Arizona Casino."],"Object Shape":"Diamond, Teardrop, Triangle, Unknown","Latitude":"33.49543","Date of the Event":"06/26/2005 09:45 UTC","Case Number":"3520","Date Submitted":"06/26/2005 09:45 UTC","Country":"United States","Tags":"City","Disposition":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/3520.html.txt","/var/www/straped/mufon/org/3520.html"],"Summary":"very bright lights red, blue, white, and green could not make out a shape maybe triangler or round","map":"<A HREF = \"http://maps.google.com/maps?q=33.49543,+-111.920172(3520)&iwloc=A&hl=en\"> mufon case (3520) map </A>","Object Flight Path":"Stationary,Path with directional change,Other","Weather Factors":"None"}