{"Summary":"3 orbs & huge black oblong ship","Case Number":"3524","Region":"Oklahoma","Latitude":"35.4755","map":"<A HREF = \"http://maps.google.com/maps?q=35.4755,+-97.511338(3524)&iwloc=A&hl=en\"> mufon case (3524) map </A>","City":"Oklahoma City","Tags":"City","Weather Factors":"None","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around November 30th 1987"],"Country":"United States","files":["/var/www/straped/mufon/html2text/3524.html.txt","/var/www/straped/mufon/org/3524.html"],"Date Submitted":"11/30/1987 12:00 UTC","Date of the Event":"11/30/1987 12:00 UTC","Log Number":"US-06282005-0011","Source":"MUFON","Object Features":"Other","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting Details1. I was with my pastor, two evangelists, and my pastor's agnostic niece. We were driving from LA to CO to visit my pastor's family and celibrate new years. We were on the highway in Oklahoma city (if I remember correctly) It was between maybe 8 and 10 pm. 2. My pastor and I both saw three orbs moving irratically in front of us in the sky. I asked, \"WHAT ARE THOSE?\" They were opaque yet transparent at the same time, swirling colors, zipping, zig zagging. I looked to the right, above us, and there was a HUGE black thing with lots of tiny lights. It was completely silent. My first thought was, \"mercy, its as big as a football field!\" 3. The pastor, the two evangelists, and myself were gaping in awe at the orbs and the huge ship on the right, in the sky. In unison we all said, \"are those ufo's???\" 4. It appeared to be flying very low, perhaps at the same altitude as the goodyear blimp? It was hovering, moving foward VERY slowly. I looked at the traffic around me and saw others had also seen it and their jaws were dropped as well. We were travelling NW, and the three orbs were directly in front of us just up of the horizon, and the big black ship was on our right. The main thing was the three orbs, swirling colors that seemed transparent, but weren't were what got our attention. 5. I was in awe. As a new convert, and fundamentalist, it was perplexing, as I had nothing to relate it to. I wanted the pastor to pull over. I was drawn to the orbs and the ship. I wanted to savor the experience. We all were in awe at first, but my pastor insisted that they were demon ships and started praying and stepped on the gas. When we arrived in Colorado Springs, the Pastor and all of us exclaimed what we had seen, and we all marvelled. I was very dissappointed that they were perceived as \"demon\" ships. I didn't sense or feel anything negative whatsoever. On the contrary, I was very drawn to them, without any fear. 6. My pastor kept on driving and wouldn't stop so I have no idea how long those flying things were up there. It seemed we saw them at least for several minutes, with no indication of them dissappearing. Final Note: Both my pastor and myself were both active duty Air Force at 6the time, stationed at Barksdale AFB, LA. Although I am no longer a part of that religious organization, it was an experience I never forgot. I apologize about forgetting the exact date, but it was somewhere around Dec 27 - 29, 1987. There was a program about UFOs, and I wasn't paying attention until I heard the word, \"football field\" and the memories flooded back. I find it interesting that someone else used that exact same description as I had. All I know is somewhere out there, there are four people that were in the car with me, that witnessed this event, as well."],"Object Shape":"Sphere, Other","Longitude":"-97.511338"}