{"divs":["Sighting Details3 bright orange glowing lights moving in all directions, then very low, and rising up, and vanishing. I was at my house, far away from the observed lights, at least 10 miles, but they were very clear. I noticed them because they were so bright, and it appeared as though they were changing directions oddly. I went back out and they had disappeared, only to reappear again. I am not positive how long they were there before I noticed them, but they stayed for about 15-20 minutes, until they rose up to a higher altitude and seeminglt vanished, and then did not return to sight. However, when the lights did go off, I could see faintly the object moving, like a faint star, scross the sky where the light had been. the lights faded a few times, and reappeared, but the final time they did not return. I thought it was helicopters, but they were moving fairly quickly closer together and farther apart, up and down, and the lights did not flash like a helicopter, it was mostly a consistent glow."],"Date Submitted":"01/26/2012 01:56 UTC","Tags":"City","Disposition":"Unresolved","Object Features":"Unknown","Date of the Event":"01/25/2012 12:00 UTC","Country":"United States","Region":"Utah","Source":"MUFON","Summary":"3 bright orange glowing lights moving in all directions, then very low, and rising up, and vanishing","Case Number":"35254","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around January 25th 2012"],"Latitude":"40.769499","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.769499,+-111.882357(35254)&iwloc=A&hl=en\"> mufon case (35254) map </A>","Object Shape":"Circle, Unknown","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/35254.html.txt","/var/www/straped/mufon/org/35254.html"],"City":"Salt Lake City","Longitude":"-111.882357","Log Number":"US-01262012-0080"}