{"Object Flight Path":"Path then hovering","Source":"MUFON","Log Number":"CA-01262012-0070","Longitude":"-81.325979","Disposition":"Unresolved","divs":["Sighting Detailsthe sparkling was like the sparks from a fire when the little burned bits fall back to the ground and burn out , my kids also stood a watched\"look at the star mommy\" trying to explain that it's not a star lol. so four of us saw it. two adults and two kids. ages 4 and 3 , 26 and 31. not the first time we see one. another instance i can think of is we saw one again at this address this summer it directed itself in front of our front door at this address again this time it also stopped and hovered for a long time , maybe 10 min or so , this one was silver none reflective unknown identity but it was sort of oval shaped with white light emitting from exterior and it also had a sort of reactor or propulsion system that was on only one side of it and it also had this type of fire sparkle looking stuff... again staying there long enough for me to get great detail.. didn't have a camera with me this time wish i would have because it wasnt more then 100 feet from me up over the front of my house. could see enoty inside but not enoug to distinguish it, i really hope they coe again and take me for a ride yehaa ;) peace namaste"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/35256.html.txt","/var/www/straped/mufon/org/35256.html"],"Tags":"City","Latitude":"48.48511","Region":"Ontario","Object Features":"Dome","City":"Timmins","Date of the Event":"01/25/2012 12:00 UTC","Case Number":"35256","trends":["There have been 5 other sightings in Timmins","There were no other sightings in Timmins on or around January 25th 2012"],"Summary":"standing from child's bedroom window before bed time and observed a glowing pulsating yellowish white light , stood there long enough to take two pic's but neither turned out then it faded away quickly with a light sparkle like from a fire when....","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Country":"Canada","Date Submitted":"01/26/2012 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=48.48511,+-81.325979(35256)&iwloc=A&hl=en\"> mufon case (35256) map </A>"}