{"City":"Livermore","Weather Factors":"Unknown","trends":["There have been 20 other sightings in Livermore","There were 8 other sightings in Livermore on or around January 24th 2012"],"files":["/var/www/straped/mufon/html2text/35268.html.txt","/var/www/straped/mufon/org/35268.html"],"Region":"California","divs":["sighting detailsi had walked out on to my front stoop to smoke a cigarette & heard a strange noise not unlike a jet engine but whirring instead of that linear scream. then the object came into view from behind, in-between my home & the two story home to the right(there was never any question of what it was); it looked like a black disk with a silver seven pointed pentagram on the domed\\bubbled bottom with several randomly appearing rectangle red lights & one bar shaped light at the end of each point outlining the circle. i was instantly very happy, kind hearted, sexually aroused to a flash erection, loving & appreciative of life(not my usual but has not left yet) the object continued across the street, over the high school drive-way then did a 1\\4 circle curve out of my sight behind a very small hill. i felt like my dog died for a split second, saw a white strobe for about four flashes from the other side of the hill & have felt a bit high on life with a touch of horney anxiety. for a few days now & a reaccuring thought that a 'reunion' is approaching. it only seemed to take..maybe 30 seconds but my cig. had burned away & out completely. unfortunately i was much too passive and \"love drunk\" to think of looking at the time again but it seemed a good deal quieter & i felt amazing like that \"oh thank 'god' it's the perfect gift right on time let's f**k to celebrate\" feeling if that makes sence? i was silent for a-while, finally told my friend today & he said \"report it\" so here."],"Date of the Event":"01/24/2012 08:30 UTC","Case Number":"35268","Latitude":"37.661444","map":"<A HREF = \"http://maps.google.com/maps?q=37.661444,+-121.795127(35268)&iwloc=A&hl=en\"> mufon case (35268) map </A>","Log Number":"US-01262012-0018","Object Flight Path":"Path with directional change","Source":"MUFON","Longitude":"-121.795127","Disposition":"Unresolved","Sighting Duration":"00:07:00","Tags":"City","Country":"United States","Summary":"Walked out front to smoke passed me @45° angle from back 30yrds off ground felt calm & grateful","Object Features":"Patterned Surface, Other","Viewing Distance":"21-100 Feet","Object Shape":"Circle, Disc, Sphere, Other","Date Submitted":"01/26/2012 02:48 UTC"}