{"Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-06282005-0013","Country":"United States","Date of the Event":"11/30/1970 12:00 UTC","Longitude":"-92.666267","Date Submitted":"11/30/1970 12:00 UTC","Region":"Arkansas","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/3526.html.txt","/var/www/straped/mufon/org/3526.html"],"Object Features":"Dome, Window(s)","Viewing Distance":"Unknown","Summary":"HUGE luminicent silver disc w/multi-colored lights around upper dome","map":"<A HREF = \"http://maps.google.com/maps?q=33.20763,+-92.666267(3526)&iwloc=A&hl=en\"> mufon case (3526) map </A>","Weather Factors":"Unknown","Tags":"City","divs":["Sighting Details I have no way to prove this, and I've told only a few people over the years. After all, who would believe me? I am 49 years old, and saw what I KNOW now to be a UFO, when I was about 15 years old. I can still see the disc in my mind's eye, as if it happened only recently. I'm guessing that it was close to 9:00 P.M. when it occurred. I was driving home from a church choir rehearsal(I had been driving since I was about 11 years old. This was not uncommon in rural south Arkansas), and not really thinking about anything in particular. The road we lived on had several rolling hills. As I topped the first in a series of three of these hills, I screamed as I saw a very, very large luminescent silver disc that filled the sky in front of me. Our home could have fit inside of it several times over! It seemed to hang suspended in the air at a 45 degree angle, and made no sound. I kept on driving but my eyes never left this sight. On top of the disc was a smaller dome-like area surrounded by multi-colored lights. The color was like nothing I had ever seen. It is difficult even now to describe. I know that it was silver, but it also had another quality about it. I can only describe it as a \"glow\". Even that does not adequately describe it. As I continued to drive toward home, the next hill I ascended blocked my view for a moment. When I reached the top of the next hill, the object had disappeared. It had only been a matter of seconds since it left my view! I was terrified, and raced to tell my parents what I had seen. I was truly afraid, and very convinced that this \"flying saucer\" had literally landed in our yard. (We lived on a 7 acre tract) In my haste to get inside the house, I skinned my knee jumping out of the car. The pain of the scrape was nothing compared to the fear I was feeling. When I told my mother what I had seen, she laughed at me, and tried to explain it away by telling me that it must have been \"only a weather balloon\"! Nothing I described to her even came close to changing her mind. I have been a nurse for the last 25 years, and work in a local Emergency Room. I am a wife, mother and grandmother. For all intents and purposes, I live an ordinary life. The memory of that night remains fresh in my mind. I know how insane this would sound to most people, so I have kept it mostly to myself, telling only a few people over the years."],"Case Number":"3526","trends":["There have been 7 other sightings in El Dorado","There were no other sightings in El Dorado on or around November 30th 1970"],"Latitude":"33.20763","Object Flight Path":"Stationary","City":"El Dorado","Object Shape":"Disc"}