{"Longitude":"-105.349526","Region":"Texas","Weather Factors":"Unknown","Tags":"City","Object Features":"Unknown","Source":"MUFON","Date of the Event":"01/17/2012 07:24 UTC","Date Submitted":"01/26/2012 08:18 UTC","Disposition":"Unresolved","Summary":"Observed starlike-light that vanished, then reappeared, then faded to an egglike shape before disappearing again","Log Number":"US-01262012-0018","Latitude":"31.182743","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy girlfriend and I were roadtripping from Los Angeles to Florida, taking the I10 east for the majority of the trip. At approximately 7:24am, about 50 miles east of El Paso, I observe a bright white light to the north of I10. The sun had been up for about an hour and at first I assume the light I am seeing is a star or the sun's reflection on an aircraft. After maybe 7-10 seconds of me looking at the light, it blinks out, leaving an empty blue sky. I look away from the northern horizon for about 3 seconds (long enough to see that my girlfriend is sound asleep in the passenger seat) before looking back to see another bright white light, this one much further east but at roughly the same altitude and intensity as the first light. I stare again for maybe 8 seconds before the light begins to fade in a circular motion, from the bottom upward - as if the light were rotating around the object - from a bright white to a dullish silver, to a dark grey, to a faint egg-on-its-side silhouette before completely vanishing again. This entire process lasted 3-4 seconds at most. For the next several minutes, I search the skies in vain as the lights do not make a reappearance. I also noted two nearby jet streams, one almost directly under the first light (from my perspective), and a second much further to the east of both sightings. Aside from the jet streams, the sky was as clear as could be. I will not even attempt to estimate the distance we were from the lights, but they appeared to be at the approximate height you would expect to see a commercial aircraft, and about the size and intensity of a bright star. After about 5 minutes of trying to process what I'd just witnessed, I text my father an entire blow-by-blow of the experience. My girlfriend wakes up about 10 minutes after the sighting and immediately comments that I appear shaken up; after telling her the story, she is upset that I did not wake her up during the sighting. I tell her that the entire event lasted 20-30 seconds at most and that I did not know (and still don't) what I was witnessing until after it had happened. We watched the skies carefully for the rest of the morning. This region of Texas along I10 is fairly desolate and we did not see any other aircraft for several hours after the event. While I am a little disappointed that my first UFO sighting can only best be described as a \"bright white light,\" I am truly dumbfounded as to what I saw in the northern skies over west Texas that morning."],"City":"Sierra Blanca","Object Shape":"Egg, Star-like","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=31.182743,+-105.349526(35277)&iwloc=A&hl=en\"> mufon case (35277) map </A>","files":["/var/www/straped/mufon/html2text/35277.html.txt","/var/www/straped/mufon/org/35277.html"],"Object Flight Path":"Stationary,Path then hovering,Other","Case Number":"35277","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 2 other sightings in Sierra Blanca","There were no other sightings in Sierra Blanca on or around January 17th 2012"]}