{"City":"Lee","Date Submitted":"01/26/2012 05:04 UTC","Object Features":"None","Case Number":"35272","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/35272.html.txt","/var/www/straped/mufon/org/35272.html"],"Object Shape":"Sphere","Region":"New Hampshire","Sighting Duration":"00:05:00","Weather Factors":"Unknown","Object Flight Path":"Stationary","Log Number":"US-01262012-0022","Date of the Event":"01/23/2012 02:00 UTC","Summary":"Outside my house above tree in backyard there was a ball of light. No structure looked like energy. Very close to me","Latitude":"43.123056","trends":["There have been no other sightings in Lee","This sighting has been favorited 1 time."],"divs":["Sighting DetailsThis past saturday morning approx 2am I went to let my dog out in the backyard. She did her business but ran to the other side of the house. I called her and she didn't come so I toll approx 8-10 steps toward the rear of the house and my attention was drawn to a light just above the trees in my backyard. I looked up at this light thinking it was a police light but as I kept looking there was no other light except this blue. Very strange light almost bright and dull if that makes sense. I watched this ball of light which was only above the trees and in clear view for what I would say was five Minutes. Not one movement or sound from the object the blue light was steady and there were yellow lights in it shining through the blue. The only thing the light did was sort of flash which scared me terribly and I ran back inside the house. I crept over to my window to look from my bedroom and the ball of light was gone. I have been overcome with fear since and I haven't slept during darkness since. I have also woken up suddenly in the days since with no explanation of how I got there. I cannot understand any of this and I am terribly frightened of what I stumbled upon. I must stress I was never threatened by the light and it never interacted with me however I believe that I interrupted whatever it was doing. I have contacted multiple people to try and figure out what happened with no luck as of yet."],"Tags":"City","Longitude":"-71.011389","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=43.123056,+-71.011389(35272)&iwloc=A&hl=en\"> mufon case (35272) map </A>"}