{"Source":"MUFON","Log Number":"US-01262012-0023","Longitude":"-94.274962","Object Features":"Unknown","City":"Fayetteville","Object Flight Path":"Stationary,Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/35283.html.txt","/var/www/straped/mufon/org/35283.html"],"Viewing Distance":"Unknown","Region":"Arkansas","Date of the Event":"01/23/2012 08:15 UTC","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Case Number":"35283","Weather Factors":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.101945,+-94.274962(35283)&iwloc=A&hl=en\"> mufon case (35283) map </A>","Latitude":"36.101945","Tags":"City","Date Submitted":"01/26/2012 10:32 UTC","trends":["There have been 21 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around January 23rd 2012"],"Country":"United States","Summary":"Starlike light hovered and moved strangely then gradually traveled to the horizon","divs":["Sighting DetailsOn Monday January 23, 2012 while heading home to Fayetteville from Farmington, Arkansas, I noticed a bright star like light in the SW sky. The time was about 8:15 p.m. more or less. Initially the light was about 30-40 degrees above the horizon. I first noticed it when I turned on Hamestring Rd. where I stopped my car completely, rolled down my window and watched it. It looked stationary and appeared to be about the height most aircraft. I kept driving and stopped not far down the road and rolled down my window again to view the light. It looked as if it might have been traveling horizontally very slowly. However, it was hard to tell if it was because there was an airplane flying in its vicinity and that may have given me the impression that it was moving. The light was very bright and resembled a planes landing light, but was more star like. In fact when I first saw it I thought that it was a plane but I was wondering why it wasnt moving. I have seen airplanes and helicopters with their landing lights on so I know how they can appear starlike, especially if they facing you and are heading in your direction. I continued driving on to John Garrison Rd. all the while keeping the light in my sight. When I pulled into our driveway, the light was still in my sight in the SW. I took a couple of bags inside and grabbed my binoculars (I didnt get my camera because at this point I thought it was probably something ordinary) to better view the object. I went back outside immediately and stood by the field next to my house to study this light. Between when I first noticed the light while I was driving and when I arrived in my yard with my binoculars about five minutes had passed. For what seemed like 10 minutes I watched this light, which appeared to hover or remain in the same spot in the sky, and considered the possibility of it being Venus or some other planet. For at that time I ruled out the possibility of it being aircraft because an aircraft could not stay in the sky in one spot for that long and I could hear no noise coming from this light. The next explanation that made the most sense would be a planet. This light looked similar to Venus at its brightest but with obvious differences. It was similar in that it was in the same spot where Venus usually is,it appeared to twinkle (it would dim and brighten slightly) and it seemed to be still. It was different in that it was more intensely bright seemed to be larger, and was a yellow-orange color, while Venus is more white. After about 10 minutes of observing this light, I ruled out the possibility of it being a planet. It started to move slowly and strangely. It would randomly move in a contained space around itself in various directions. It barely moved from where it had originally been hovering. At first I thought that I might have been mistaken about its movements but I saw it repeat these strange movements over a period of about 5-10 min. This is when I thought \"What planet or craft does that?\" Sometimes the light would move in said manner and sometimes it would remain stationary. Throughout the time I was watching the light, it was gradually moving toward the west. It was only apparent that it was moving because the longer I watched it the farther away it got. You could not tell it was moving away unless you studied it for a few minutes. I watched it until it was almost over the horizon. I then headed inside because you could hardly see it anymore. The farther away it got the dimmer it became and it began to take on a reddish tint. Throughout the sighting I would look at the light through my binoculars and it just looked like a yellow-orange dot, not quite round like a circle in shape. While this light was in the sky , I could hear dogs barking in the direction of the object. As it got lower in the sky and farther west, the dogs barking quietened but I could still hear the dogs farther to the west barking. The whole time I was watching the light I kept thinking \"What is that?\" and when it began to move unusually, I thought, \" Thats incredible!\". I kept running through explanations in my head for this light but I couldnt come up with any that didnt have flaws. I have never seen any light move, behave or look like this one. Does Venus move across the sky in that short amount of time. What else could move the way this light moved? There was a lot of air traffic in the vicinity of the light (including airplanes and jets) for the duration of the sighting. The light didnt really seem to react to these. I was very curious and excited during the sighting. The entire sighting from the time I first saw the light to when it was barely visible on the horizon lasted approximately half an hour, from around 8:15 p.m to 8:45 p.m. I did not attempt to record the light on video or take photographs mainly because I didnt want to go inside and miss this light doing something out of the ordinary. Furthermore, it wouldnt have shown up very good in photographs and had I taken a video it probably would have been shaky as there was nothing to rest the camera on. This sighting leaves me with a lot of questions. I cannot come up with an explanation. I am surprised that there arent more reports from the area on this light. Im sure that other people saw it as well."]}