{"divs":["Sighting DetailsI was sitting on my front porch listening to the radio, facing the south. At about 9:48 pm local time, I looked up and saw a very bright light in the sky travelling approximatly from SSW to NNE. At first I thought it was an Iridium flare as it was as bright as one of them, but it never diminished in brightness. It travelled about the speed and distance of the Iridium satellites I have seen, but it was travelling in a different path from the parallel paths I have seen them go. I ran into the house and grabbed some binoculars. It appeared to be circular with lines (rods?) radiating out every 30 degrees each about the same length of the radius of the object itself. It was travelling at variable speed and occasionally curving in its movement. There were no flashing lights as would be seen on an aircraft. I followed it with my binoculars as long as I could until it went out of sight to the NNE. Whatever it was, it looked like it had to be in space. It was about five times larger than satellites I have observed. It was not a meteor. I have never observed anything like it. I am the Episcopal priest in Texas City, Texas. 38 years old"],"Object Features":"Appendage(s)","Source":"MUFON","trends":["There have been 3 other sightings in Texas City","There were no other sightings in Texas City on or around June 28th 2005"],"Date Submitted":"06/28/2005 09:48 UTC","Object Flight Path":"Path with directional change","Case Number":"3528","Sighting Duration":"Undisclosed","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.383845,+-94.9027(3528)&iwloc=A&hl=en\"> mufon case (3528) map </A>","Tags":"City","Object Shape":"Disc","Summary":"Extremely bright variably moving object","Viewing Distance":"Over 1 Mile, Unknown","City":"Texas City","files":["/var/www/straped/mufon/html2text/3528.html.txt","/var/www/straped/mufon/org/3528.html"],"Weather Factors":"None","Latitude":"29.383845","Disposition":"Unknown","Country":"United States","Date of the Event":"06/28/2005 09:48 UTC","Log Number":"US-06282005-0015","Longitude":"-94.9027"}