{"Object Shape":"Sphere","Sighting Duration":"00:06:00","City":"Magalia","Longitude":"-121.620596","Summary":"sky was glowing really bright. It was supposed to be the evening of heavy solar flares. We were sitting on the couch and I saw this really weird colored blue/green bright bright orb, behind the trees. I hollared at Dorothy to come see. She freaked out.","Tags":"City","files":["/var/www/straped/mufon/html2text/35285.html.txt","/var/www/straped/mufon/org/35285.html"],"Case Number":"35285","Object Flight Path":"Hovering then path","Viewing Distance":"Over One Mile","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.812562,+-121.620596(35285)&iwloc=A&hl=en\"> mufon case (35285) map </A>","divs":["sighting detailssitting on the sofa looking out the window there was a bright fog type area. it was supposedly the time of solar flares, and then walking over to the window i saw this orb that was a blue\\green very very bright behind the trees. i yelled at my wife to come see. she freaked out and told me to get a camera and get pics. she wanted to try to get closer to it. she jumped in the car with the video camera but the trees are thick and she went down the hill which she should have driven up the hill. she said she pulled the car over to take a picture but the light was so bright it was like after you have a camera flash. she could not see well for about an hour. her eyes were very blurry. she took a picture but only got the bright white light. she could not get in a position to take a picture of the blue. i got one but it was long distant. i wish i could blow it up somehow. maybe i will go to walmart and see if we can blow up the picture. it was really unnerving. after she went close to it she felt nausea and couldnt see well."],"Source":"MUFON","trends":["There have been 7 other sightings in Magalia","There were no other sightings in Magalia on or around January 24th 2012"],"Weather Factors":"Unknown","Object Features":"None","Latitude":"39.812562","Date Submitted":"01/27/2012 02:31 UTC","Region":"California","Date of the Event":"01/24/2012 04:24 UTC","Country":"United States","Log Number":"US-01272012-0001"}