{"files":["/var/www/straped/mufon/html2text/35294.html.txt","/var/www/straped/mufon/org/35294.html"],"Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"01/27/2012 08:04 UTC","Country":"United States","divs":["Sighting Detailswalked out to get my dog from the backyard . i noticed a bright light out of the corner of my eye.looked up and seen a large fireball like object.the object was moving about the speed of an airplaine.the object was radiating fire from all sides this was a round object.there was no tail or fire trail i observed the object for 10-15 seconds. at this point the fireball began to wobble slightly about 4-5 times just enough to make it look kinda blury.right after it wobbled a few times it change directions slightly maybe 10-15 degree's at an upward direction. it apeared to increase in speed and looked smaller as it vanished out of sight in just a few seconds.my sister and her daughter pullep in there car as i was watching the object.they both seen it right after it wobbled and shot of out of sight. i am not sure what i have just seen do not think it was a metior or space junk. there was no tail and this thing took off very fast and looked to gain altitude and was out of sight in nothing flat.feeling confused at this point hope someone else saw this thing whatever it was."],"Longitude":"-88.568257","Summary":"large fireball no tail moving fast wobbled a little and shot off gone in seconds.","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.020581,+-88.568257(35294)&iwloc=A&hl=en\"> mufon case (35294) map </A>","trends":["There has been one other sighting in Monticello","There were no other sightings in Monticello on or around January 27th 2012"],"Tags":"City","Weather Factors":"Unknown","Latitude":"40.020581","Case Number":"35294","Region":"Illinois","Object Shape":"Fireball","Date of the Event":"01/27/2012 12:00 UTC","Disposition":"Unresolved","Log Number":"US-01272012-0010","Object Flight Path":"Path with directional change","City":"Monticello"}