{"Log Number":"US-06292005-0001","Object Features":"Unknown","Region":"Kentucky","Summary":"E.T. message given to me","Country":"United States","City":"Union","Date Submitted":"06/30/2004 12:00 UTC","Sighting Duration":"00:00:03","Viewing Distance":"20 Feet or Less, Unknown","Case Number":"3529","Object Shape":"Other","divs":["Sighting DetailsWhen I was driving to work around 11:15 pm a thought came in my mind that asked me \"Would you like to see me?\" I was in the middle of no were alone. I just had this feeling that this was from God so I said \"sure I would like to see you\" but in the back of my mind I considered that it could be something else. Nothing else happened right then so I shrug it off and continued to drive to work (I am a security guard) . I started my shift. Around 2:00 or 3:00 a.m. another thought came in my mind like the first that asked me if I wanted to make up a story about God coming to see me. I thought for a second yes but I know that that was not my thought, that some how that thought was also put in my head at the same time (this sounds strange but I am telling you the truth I think it was a test to see if I was honest)and I over rode the thought and said \"NO I can't do that to God\". I looked out the window and noticed a large grasshopper sitting on the fence about 12 feet away from me. As I looked at the Grasshopper an E.T. fadded in between me and the grasshopper only about 6 feet away just outside the window (I got a really good look at him)and gave me a message then fadded back out. He said the message was from God. I later gave the message to a local church and tried to get them to help me figure out what had happened but they wouldn't help me. They said that they thought I was crazy (they referred me to a mental hospital). That really hurt, here I was going to the only place I thought I could count on for help with something spirit related and they said that. I would like to add that since this has happened I have never thought more clearer and my memory has imporved five times since. I have also noticed that I understand Bible and am currently figuring out its mysteries. I believe that I have indeed seen Jesus. I am willing to take a lie detector test and any other test to prove that I am telling the truth about this. While this was happening to me an intence fear overtook my whole body. The E.T. said that this is a side effect of the way that they comunicate and don't be affraid. I have noticed that they can give you a long message in a very short amont of time. Since this has happened I have had a couple of these visit mostly at night in my sleep where they have downloaded a bunch of information about the Bible in my head. Now I know when they are around because of this intence fear when they comunicate, but they have not showed there self since this first visit (I would be able to explain better in person about this fear and what it means). I would give you the message myself but I was told by them not to give out the message because I messed up and accidently changed it when I keep trying to get help from the church. I will tell you what churches I gave the message to so you can get a copy of it if you like. I would like to add that I have no doubt that this was indeed Jesus. Yeshua. This was an important event and I hope you give me some consideration. Thanks Carl"],"Object Flight Path":"Stationary,Other","files":["/var/www/straped/mufon/html2text/3529.html.txt","/var/www/straped/mufon/org/3529.html"],"Tags":"City","Longitude":"-84.809996","map":"<A HREF = \"http://maps.google.com/maps?q=38.932486,+-84.809996(3529)&iwloc=A&hl=en\"> mufon case (3529) map </A>","Latitude":"38.932486","Date of the Event":"06/30/2004 12:00 UTC","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"None","trends":["There have been 2 other sightings in Union","There were no other sightings in Union on or around June 30th 2004"]}