{"Case Number":"35290","Longitude":"-120.548841","divs":["Sighting DetailsI was living in oregon at the time and my house was secluded in a densly wooded area about 5 minutes out of town. I was staying up late playing my xbox. It was around 3 O clock A.M. when suddenly my house lost all electricity. At that time, my house and every room in it including rooms with closed doors became very brightly lit. So bright i could barely see my hands in front of me. I heard my mom yell very loudly \" what the hell is going on\". i was still sitting on my couch next to a window covered by curtains. Out of curiosity i moved the curtains back to take a look outside. I remember very clearly seeing a very brightly lit disk-shaped object hovering about 30 - 50 feet above my house. It looked metallic and had 5-10 white lights around the edges. They did not pulse. It also had 1 red light in the middle on the bottom of the craft that pulsed emanating a bright glow resembling a flare. When it continued its path it moved in a zig-zag formation at a slightly higher elevation above the tree-tops. It traveled at a very fast speed stopping for a second everytime it traveled in a straight line and then changing direction. I saw it move for about 5 times in a zig zag formation before it sped off in one straight direction at a very high speed and it was gone in the blink of an eye. The most strange and most important and memorable detail of the craft to me personally, was the fact that it left odd tracers as it moved. It was as if it disapeared and reapeared in another spot in the sky leaving tracers that followed it slowly and as soon as the tracers cought up with the craft the craft began moving again. This type of craft and the way it moved eerily reminded me of a supposed nasa file that was captured by a orbiting satelight. In this file the very similar-looking craft came from earth at a very high speed and hovered a few feet next to the satelight and then taking off into space and leaving the strange \"tracers\" as it came from earth and as it took off into space. I do not know if the file was real or hoax but seemed legit to me. Real or not though the craft in the file i am refering to seemed almost identical to the craft i saw that early morning in oregon. Also one last detail, about 5-10 minutes after i saw this craft, a black helicopter or at least looked black in the night sky, flew over our house at a good speed very low over our house and traveled in the direction i saw the ufo travel to. Helicopters are not seen commonly in the town i lived in. Especially not low flying helicopters and especially not at 3 in the morning so i found this very odd as well."],"Tags":"City","Date of the Event":"08/13/2007 03:47 UTC","Object Flight Path":"Path with directional change,Path then hovering","Country":"United States","Summary":"disk shaped,brightly lit","Sighting Duration":"00:01:10","Weather Factors":"Unknown","Region":"Oregon","files":["/var/www/straped/mufon/html2text/35290.html.txt","/var/www/straped/mufon/org/35290.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.812293,+-120.548841(35290)&iwloc=A&hl=en\"> mufon case (35290) map </A>","Viewing Distance":"21-100 Feet","City":"sweethome","Source":"MUFON","Object Shape":"Disc","Object Features":"Undisclosed","Latitude":"43.812293","Log Number":"US-01272012-0006","Disposition":"Unresolved","trends":["There have been no other sightings in sweethome","This sighting has never been favorited."],"Date Submitted":"01/27/2012 01:44 UTC"}