{"Tags":"City","Date Submitted":"01/27/2012 03:04 UTC","Sighting Duration":"00:00:10","files":["/var/www/straped/mufon/html2text/35292.html.txt","/var/www/straped/mufon/org/35292.html"],"Date of the Event":"01/25/2012 05:30 UTC","Object Flight Path":"Straight-line path","Region":"New York","Viewing Distance":"101-500 Feet","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around January 25th 2012"],"Log Number":"US-01272012-0008","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Longitude":"-73.94367","divs":["Sighting DetailsThis event happened on January 25, 2012 and I was looking out my bedroom window at approx 5:30 pm. There was a reflection of a very bright star which caught my attention as I love the night sky. The reflection of the star was seen off of a window of a neighbors house but the dark round object appeared 3 feet beyond the neighbors house so it could not have been the star that caused the light. When I first saw it I thought it was aviation (helicopters) doing a search but there was no sound or other light emitting from the object. The object was very dark in color, darker than the night sky which was a dark blue and round like a circle. There was no shininess to it. The motion of the object was traveling very quickly in a straight path. Then a gradually brightening white light started emitting from the object. The white light got so bright I could see my driveway light up with all the light and then just as quickly shut off and there was no more light or object. During this, my reaction was excitement that I had finally seen a UFO!! I was observing the objects and its actions with complete attention."],"City":"New York","Summary":"Dark round object","Latitude":"40.65733","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.65733,+-73.94367(35292)&iwloc=A&hl=en\"> mufon case (35292) map </A>","Country":"United States","Case Number":"35292","Object Shape":"Circle"}