{"Object Flight Path":"Hovering then path,Path with directional change","Latitude":"47.415682","Viewing Distance":"21-100 Feet","Object Features":"Unknown","Summary":"SMALL BALLS OF LIGHT","Region":"Washington","Sighting Duration":"00:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=47.415682,+-120.293126(3530)&iwloc=A&hl=en\"> mufon case (3530) map </A>","Date Submitted":"06/29/1993 06:00 UTC","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/3530.html.txt","/var/www/straped/mufon/org/3530.html"],"Longitude":"-120.293126","Case Number":"3530","Object Shape":"Sphere","Date of the Event":"06/29/1993 06:00 UTC","divs":["Sighting Details1. SITTING IN A HOT TUB TALKING TO MY SISTER-IN-LAW, JEANNE. 2. A REFLECTION, IN THE WINDOW, OF BRIGHT MAGENTA LIGHT AND THE LOOK ON JEANNE'S FACE. 3. A HOOVERING BALL OF MAGENTA LIGHT. 4. THE FIRST ONE HOVERED OVER A CHERRY TREE FOR A FEW SECONDS THEN FLEW OFF FLYING TOPOGRAPHICALLY FOR ABOUT 3 MILES THEN UP INTO THE CLOUDS. ALL THIS WITHIN A FEW SECONDS. AS IT FLEW FASTER IT CHANGED COLOR TO A WHITE LIGHT. THEN ANOTHER CAME OUT OF THE CHERRY ORCHARD FROM A DIFFERENT PLACE ABOUT 300 YARDS AWAY AND DID THE SAME EXACT FLIGHT. THE THIRD CAME UP IN YET A DIFFERENT PART OF THE ORCHARD AND FLEW ALONG THE COLUMBIA RIVER SEVERAL MILES AND THEN UP INTO THE CLOUDS. ALL THREE WENT TO THE SAME PLACE BUT TOOK DIFFERENT ROUTES GETTING THERE. 5. WE TOLD EACHOTHER THAT WE WERE GOING TO STAY QUIET. NO ONE WOULD BELIEVE THIS. IT WASN'T UNTIL YEARS LATER THAT WE DECIDED TO TELL PEOPLE. IT WAS AMAZING HOW MANY OTHER PEOPLE AROUND HERE HAVE SEEN UFO'S. 6. THEY FLEW OUT OF SIGHT INTO A CLOUD MASS. I WOULD LOVE TO DRAW A PICTURE FOR YOU BUT I CAN'T WITH THIS COMPUTER."],"Source":"MUFON","Log Number":"US-06302005-0001","Disposition":"Unknown","City":"East Wenatchee","Weather Factors":"Unknown","trends":["There have been 3 other sightings in East Wenatchee","There were no other sightings in East Wenatchee on or around June 29th 1993"]}