{"Viewing Distance":"Unknown","Tags":"City","Date of the Event":"01/27/2012 07:35 UTC","Date Submitted":"01/28/2012 01:41 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-121.812344","Disposition":"Unresolved","Summary":"Another video shot of a ufo going arcoss the western sky around 7:35pm. over the Monterey Bay area.","divs":["Sighting DetailsOutside my back yard around 7:35 pm, videoing the moon facing the west over the Monterey Bay I was setting up my trypod with the video camera and turned it on. I notice something in the view finder going arcoss the moon. This was fantastic Just by luck \" Again\"; I looked up at the moon and wasnt able to see anything just throught the video camera that was set on night set..I did notice other airplains to the far North East of the area. I tried to follow the UFO and tried to zoom in but mistakenly turned the zoom back to normal and lost the UFO from the shot. All of this took about 15 sec. After about an hour I went back into the house to review the video. The video shows the UFO comming up from the South and going North it was bright white in color it moved very fast then changed direction going upward for a short time then it changed direction again by this time I was trying to zoom in and as the video camera was moving around I lost the UFO. The video looks pretty good....Over the past years I been able to video other UFOs similar to this so far this makes the 5th one. Mufon has some of my videos & Photos, but cannot release them to the public yet. Im completing my book to show to the public all of my photos and videos of UFOs for the past 45 years...Sorry Ive been holding back....."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.62726,+-121.812344(35309)&iwloc=A&hl=en\"> mufon case (35309) map </A>","Log Number":"US-01282012-0010","Latitude":"36.62726","Country":"United States","Object Features":"Unknown","City":"Seaside","Region":"California","trends":["There have been 6 other sightings in Seaside","There were no other sightings in Seaside on or around January 27th 2012"],"Source":"MUFON","Case Number":"35309","files":["/var/www/straped/mufon/html2text/35309.html.txt","/var/www/straped/mufon/org/35309.html"],"Sighting Duration":"Undisclosed","Object Shape":"Unknown"}