{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Melbourne","Object Shape":"Unknown","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around January 29th 2012"],"Weather Factors":"Unknown","Latitude":"-37.807887","Object Features":"Unknown","Log Number":"AU-01282012-0011","divs":["sighting detailsowing to a hot night i woke early (just before 5am) and went outside to get some cool air. while there i looked at stars and noticed what appeared to be a satellite travelling from ssw to nne, passing through a band of high level cloud to the north and reappearing on the other side of it, lower towards the horizon. (there were patches of mid and high level cloud - less than 1\\10 cover.) a few minutes after that, i noticed a flashing red light to the wsw, moving ese. my initial thought was that it was a high altitude jet, but: (a) the lights were flashing irregularly, and a couple of times increased to be around one-quarter the size of a full moon; (b) the object appeared to slow down or pause for several minutes (judged against the background stars), and then resume speed; (c) the object changed direction (towards se motion); and (d) i don't know any flight paths in that direction (we are ~20km from melbourne's airport, so are accustomed to low level air traffic). after a few minutes the light was no longer visible, in approximately south direction, or slightly west of south."],"Longitude":"144.97046","Case Number":"35310","Country":"Australia","Region":"Victoria","Tags":"City","Source":"MUFON","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/35310.html.txt","/var/www/straped/mufon/org/35310.html"],"Date Submitted":"01/28/2012 02:04 UTC","Date of the Event":"01/29/2012 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-37.807887,+144.97046(35310)&iwloc=A&hl=en\"> mufon case (35310) map </A>","Summary":"High altitude flashing light varying in speed and direction of travel","Disposition":"Unresolved"}