{"Object Features":"None","Longitude":"-73.243039","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Star-like","Latitude":"10.47532","Region":"Cesar","divs":["Sighting DetailsI was buying some fast food with my wife, while we were waiting I was looking up trying to figure out the name of a star. I have a software installed on my phone that tells me the name of name of any celestial object only by pointing at it, which I did and I couldnt find the name. To my surprise, this star started to move towards another star, it moved for around 10 to 15 seconds and then stopped when it was pretty \"close\" to the second star, hovered there for 5 seconds and then vanished. My wife and I were pointing to the sky and we were excited to see something like this, but to my surprise people around us didnt even looked at the sky. I kept looking to the sky and a minute of two we saw two more stars one going east west and the second west east direction. The crossed when they were just below orions belt from my point of view and kept flying until they dissapeared in the horizon. I called a friend of mine and he was able to see one of the stars moving. A minute later I saw a plane and I could compare it to what I saw and the lights were totally different, and I dont know how to say this in english but the plane took around 3 minutes to move a very small portion of the sky and these lights covered from side to side in about a minute."],"Sighting Duration":"Undisclosed","Date Submitted":"01/28/2012 08:21 UTC","Country":"Colombia","Tags":"City","files":["/var/www/straped/mufon/html2text/35317.html.txt","/var/www/straped/mufon/org/35317.html"],"Source":"MUFON","Case Number":"35317","Date of the Event":"01/20/2012 07:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=10.47532,+-73.243039(35317)&iwloc=A&hl=en\"> mufon case (35317) map </A>","City":"Valledupar","Log Number":"CO-01282012-0017","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"Hovering light the size of a star that moved for 15 secs then hover again for a couple of secs vanished","Disposition":"Unresolved","trends":["There have been 2 other sightings in Valledupar","There were no other sightings in Valledupar on or around January 20th 2012"],"Weather Factors":"Unknown"}