{"Tags":"City","Summary":"A bright steady light was seen in the sky traveling southwest to northeast","Viewing Distance":"Over One Mile","Country":"United States","Date of the Event":"06/30/2005 09:30 UTC","Disposition":"Unknown","Source":"MUFON","City":"Columbia","divs":["sighting detailsi was sitting in the kitchen last night messing with the computer when my wife, who was outside smoking at the time, stuck her head in the door and said, \"come here, i see a ufo.\" my first thought was that it would be an airplane. i went outside and saw a yellowish-white steady light that was about the same intensity and size as a bright star travelling across the night sky going from southwest to northeast and appeared to be approximately 10,000 feet high and going about the same speed as a jet aircraft would. i first thought \"airplane\" but noticed that it had no strobe lights and no green\\red nav lights. the intensity of the light stayed steady as it passed over and off into the distance which would not typically be the case if it were aircraft landing lights that i saw. my wife said that the object appeared to be in a lazy zig-zag motion, and i saw this too but only after she mentioned it so this may have just been the power of suggestion. i took no photos or video of the event, the thought never even crossed my mind to do so."],"Case Number":"3532","trends":["There have been 22 other sightings in Columbia","There were no other sightings in Columbia on or around June 30th 2005"],"Object Features":"Unknown","Object Shape":"Star-like","Date Submitted":"06/30/2005 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.01021,+-81.030314(3532)&iwloc=A&hl=en\"> mufon case (3532) map </A>","files":["/var/www/straped/mufon/html2text/3532.html.txt","/var/www/straped/mufon/org/3532.html"],"Sighting Duration":"Undisclosed","Longitude":"-81.030314","Weather Factors":"None","Region":"South Carolina","Latitude":"34.01021","Object Flight Path":"Path with directional change","Log Number":"US-07012005-0001"}