{"Weather Factors":"Unknown","Longitude":"12.347731","Source":"MUFON","Tags":"City","Summary":"Cigar stationary on Vatican City for 2 minutes then great acceleration with rising curve on the left","files":["/var/www/straped/mufon/html2text/35327.html.txt","/var/www/straped/mufon/org/35327.html"],"Object Flight Path":"Stationary,Path with directional change","Viewing Distance":"Over One Mile","trends":["There have been 4 other sightings in Rome","There were no other sightings in Rome on or around February 11th 1982"],"Log Number":"IT-01292012-0004","City":"Rome","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=41.965265,+12.347731(35327)&iwloc=A&hl=en\"> mufon case (35327) map </A>","Case Number":"35327","Date of the Event":"02/11/1982 02:15 UTC","Disposition":"Unresolved","Region":"Lazio","divs":["sighting detailsmy mother and i were talking in front of the house, when looking up towards the dome of the vatican city we saw a flying object that at first glance seems to assert the good year blimp was flying over that in those years in rome. i became aware that he was not sustained. he was a cigar-shaped object is dark gray above the town still exactly the vatican. his sizes was presumably double the church of st. peter. we flats at a distance of about 7 kilometers from the vatican. he continued to sit still at an altitude of 500\\600 meters from the ground alleged no windows and no lights were visible. the day was clear and there was about 2 minutes foschia.trascorsi the object begins to move slowly south, then with a frightening acceleration, rising by a sharp bend on the left disappearing on the horizon. this acceleration was to make me understand that it could be a flying object on earth. me and my mother in the face quard stunned and we wondered what it was. i was pervaded by a quiet and without certainty, glad i had the evidence that other non-terrestrial civilizations certainly exist. although, now, many years passed, from happening, the memory is sharp."],"Latitude":"41.965265","Country":"Italy","Date Submitted":"01/29/2012 05:29 UTC","Object Features":"None","Sighting Duration":"00:02:00"}