{"Date Submitted":"01/29/2012 10:56 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been no other sightings in Orland","This sighting has never been favorited."],"Log Number":"US-01292012-0006","Viewing Distance":"101-500 Feet","divs":["Sighting Detailsaround the first week of December 2010, my wife and I were heading home from Bangor when the radio got real stat-icy. As I leaned forward to adjust the channel, commenting to my wife that it was strange, An object caught my eye over the treeline. I said to my wife \"look!!\" and she said \"what the f**k!!\"\" I slowed the Jeep to a crawl, fascinated. What we saw was a pie shaped \"object\" traveling from west to east, right above the treeline. It was very close, about 500ft from us, maybe 75-100ft above the trees....and it was big. As it crossed in front of us, the \"front tip of it would be on one side of the road over the tree line while the \"back\" was still over the treeline on the other side of the road. It was a dull grey in color with lights shining on the underside. I could see the underside front, side and back as it passed. There were no lights on the side or back. There were some sort of... \"protrusions\"...on the sides and back(kind of like you'd see on a ship), and had what appeared to be barnicals the size of 5 gallon buckets and kelp hanging off the back. It was moving so friggin slow, I thought how the hell is that thing in the air?? There was no sound from it, no exhaust,there was no disturbance of the vegetation as it passed over it...no trees swaying, anything like that. All I could think was that thing had been under water for a long time. As it passed over the eastern treeline I sped up the jeep hoping to regain another sight advantage point, but it was just...gone. The radio came back in clear and that was it. I can't tell anyone what it was but I certainly tell them what it wasn't. It wasn't a plane, helicopter,kite,balloon,rocket,cloud,sunspot,boat none of that. I am a practical man and that incident changed the way I think of UFO. I would love to go under hypnosis and recount the incident."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.574961,+-68.729077(35329)&iwloc=A&hl=en\"> mufon case (35329) map </A>","Case Number":"35329","Object Features":"Appendage(s)","Object Flight Path":"Straight-line path","Country":"United States","Weather Factors":"Unknown","City":"Orland","Latitude":"44.574961","Tags":"City","Region":"Maine","Date of the Event":"12/10/2010 03:30 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/35329.html.txt","/var/www/straped/mufon/org/35329.html"],"Summary":"A pie shaped object crossing rd tree top high","Longitude":"-68.729077","Disposition":"Unresolved"}