{"divs":["Sighting DetailsMy girl friend and me were in the mountains just out side of Ukiah Oregon on some old logging road camping out for the weekend.I was standing by my car loohing up at ths stars and how bright thay seem to be that night. I notice this one star it seemed to dwarf evething else in the sky it was much to big.I was thinking that it might be a communication satellite. I was looking between two pine trees kind of like a goal post.I watched it for about 10 min and it hadnt changed position and was not moveing with the staes. That when this bright light tock off like a bat out of hell this thing was moving so fast that it looked like a tracer across the sky then just disappear.Then it shows up just off to my left like someone had turned a bright light on. It stayed stationary for about 5 min then just like the first time it started all again first tracer then disappared.Then poped back up in the same place I had seen it the first time. I watched this light do this for about 20min back and forth right to left.I to my girl friend to come and check this out.I told her to look between these two pine trees at that bright light up there.Just I said that it took off I said look over there as I pointed it will show up over. She gave me this look I told her Ive been watching this for 20 min it just keeps going back forth. then from out of nowhere one more shows up. So now theres one on are right side and one to the left.That when thay started putting on a show.For 10 min thay started crisscring thats my lady started packing everthing up so we could the hell out of there it freaked her out that much.About two weeks later Iwas talking to a friend I told him what we seen. He started telling me that hed seen the same thing and new smoe other people that seen this thing.Around the same place back up behind Ukiah."],"Date Submitted":"01/29/2012 11:08 UTC","Log Number":"US-01292012-0007","files":["/var/www/straped/mufon/html2text/35330.html.txt","/var/www/straped/mufon/org/35330.html"],"Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=45.13403,+-118.932482(35330)&iwloc=A&hl=en\"> mufon case (35330) map </A>","Object Features":"Other","Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Source":"MUFON","Country":"United States","City":"Ukiah","trends":["There have been no other sightings in Ukiah","This sighting has never been favorited."],"Date of the Event":"05/17/2011 10:12 UTC","Sighting Duration":"Undisclosed","Case Number":"35330","Longitude":"-118.932482","Summary":"A bright light that move so fast it left a tracer then disappear then reappear this went on for 20 min then one more show up","Region":"Oregon","Tags":"City","Latitude":"45.13403","Viewing Distance":"Unknown"}