{"map":"<A HREF = \"http://maps.google.com/maps?q=40.046516,+-83.033552(35336)&iwloc=A&hl=en\"> mufon case (35336) map </A>","Tags":"City","Date of the Event":"01/01/2012 12:00 UTC","Disposition":"Unresolved","City":"Columbus","Object Flight Path":"Stationary","Region":"Ohio","Object Features":"Unknown","Object Shape":"Fireball","Longitude":"-83.033552","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around January 1st 2012"],"files":["/var/www/straped/mufon/html2text/35336.html.txt","/var/www/straped/mufon/org/35336.html"],"divs":["sighting detailsi was driving home from a new years party. i was designated driver. i had just passed the 315\\270 interchange driving on 315 north. i looked up in the sky to look at the stars while sitting at a light. i looked out the window to my left and noticed a fire in the sky. i could clearly see the flames. the object didnt move in any direction just hovered in the sky. at first i thought it was a plane on fire or a meteor, but the fact that it didnt move in any direction made me wonder why it wasnt falling. i showed the fire to my passenger who also describe it as a fire just kind of hovering there. i started driving when the light change to green and kept obvserving it until i was too far away and some trees obscured my view. the object just hung there for at least 5 - 6 minutes that i could track. for some reason i cannot get this image out of my mind. i would like to know if it was a plane on fire, or a meteor or something else. do you know of anyone else that might have witnessed this? do you know of where i can find out if this was a plane? this is not the first time i have seen strange lights, just the first time i have reported it. if you have any questions, please feel free to contact me."],"Country":"United States","Case Number":"35336","Sighting Duration":"Undisclosed","Log Number":"US-01292012-0012","Weather Factors":"Unknown","Date Submitted":"01/29/2012 04:28 UTC","Latitude":"40.046516","Summary":"Saw a hovering fire in the sky that didnt move","Source":"MUFON","Viewing Distance":"Unknown"}