{"divs":["sighting detailsexact location as address can not be found via google. 38 02' 43.52\"n 94 26'51.13\"w at 911' elevation. it was already dark out, and i was outside performing a chore that i had to wait on. i was listening to a recording on my phone\\mp3 player and was just observing the sky in front of me. just a few degrees above my virtual horizon (a tree line 1.43 miles away at an altitude of 863\"). i observed a light appear then disappear. it did not move in any direction. it was just there for about a second and then it was not. i am very familiar with this horizon, and knew that this was out of place. i had already observed aircraft flying in and out of this area and this was nothing like that. it did not come into this area of the sky, it just appeared. for over an hour i observed, in an approximate heading of 75.64 degrees and at a very good distance, this object appear for no longer than two seconds then disappear. i witnessed this over a dozen times. each time it appeared at varying heights and locations with varying intensity. it was red on top and white on the bottom. all occurring within a small window of the sky. the closest known thing i could equate it to was fireworks in the distance. it would have had to have been the exact same firework fired off each time. my wife observed this object twice independently and once with me. after doing a bit of research i learned that at my altitude the full horizon spans nearly 70 miles. depending upon the objects altitude it could have been even further away. at no time were either of us disturbed, or uncomfortable about what we were seeing."],"Tags":"City","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"Orb: Red on top, white on the bottom","Country":"United States","City":"Lake St Louis","files":["/var/www/straped/mufon/html2text/35331.html.txt","/var/www/straped/mufon/org/35331.html"],"Date Submitted":"01/29/2012 11:55 UTC","Longitude":"-90.793391","Object Features":"Unknown","Latitude":"38.791174","Date of the Event":"01/26/2012 06:20 UTC","Region":"Missouri","trends":["There have been 3 other sightings in Lake St Louis","There were no other sightings in Lake St Louis on or around January 26th 2012"],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Other","Case Number":"35331","Log Number":"US-01292012-0008","map":"<A HREF = \"http://maps.google.com/maps?q=38.791174,+-90.793391(35331)&iwloc=A&hl=en\"> mufon case (35331) map </A>"}