{"Log Number":"US-01292012-0013","Sighting Duration":"00:01:30","Date of the Event":"01/28/2012 12:00 UTC","Case Number":"35337","Latitude":"33.74359","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was with a friend driving on the 22 west freeway in Garden Grove, CA. It was about 7:00 on a Saturday and we were heading to a friends house. I first noticed the object because it was very bright and appeared much larger than an airplane. The object slowly moved from the south to the north, then it started going from the north to the south, all the way across the sky. It was disk-shaped and had white a band of lights that seemed to be spinning around the outside edge of the object, and had 1 stationary red light on top. The object would rotate as it was moving and you could see the band of light going sideways at times. After it moved across the sky it ended being very low and the formation of lights that looked like a band in the sky actually seemed to spell something out in lights. It wasn't English writing that I could read but it looked like some kind of encryption. I almost thought maybe it could have been a blimp... but it moved FAR too fast and changed its flight path in the sky. I lost sight of the object because we were driving away from it on the freeway."],"Summary":"Disk Shaped UFO over 22w freeway/Brookhurst","Weather Factors":"Unknown","Country":"United States","Region":"California","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around January 28th 2012"],"Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"01/29/2012 05:18 UTC","City":"Garden Grove","map":"<A HREF = \"http://maps.google.com/maps?q=33.74359,+-118.0037(35337)&iwloc=A&hl=en\"> mufon case (35337) map </A>","files":["/var/www/straped/mufon/html2text/35337.html.txt","/var/www/straped/mufon/org/35337.html"],"Object Shape":"Disc","Object Features":"Unknown","Disposition":"Unresolved","Longitude":"-118.0037","Tags":"City"}