{"Sighting Duration":"00:00:45","Summary":"Black Triangle UFO, 80ft wide, gliding at about 15mph under 100ft altitude...","Date Submitted":"01/30/2012 05:04 UTC","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsAfter arriving home from dinner late night with my friend, we happened to look up into the sky while still in the parking lot in Montego Bay apartments, we both witnessed a black triangular craft that was silently and very slowly gliding through the sky at low enough altitudes that, if I were a kid with a sling shot I could have easily hit the craft with a rock. The craft was approximately 80ft long on each side and appeared to have a matte or satin black coating on its surface, it also seemed to have smaller circular outlines on each corner on the bottom of the craft, making a total of three circular outlines about the size of a tire, and on the left and right side of the craft there appeared to be ventilation shafts, one square shaft on each side about 5'x5' in size, and this is assuming from the direction of travel that these are the left and right side of the craft. This craft had no apparent light emitting from its surface, as if it had turned whatever lights it had off in order to not draw any attention to its self, like a USAF stealth bomber, except this craft had absolutely no markings on it whats so ever to identify it, and this is from the bottom view of it obviously. No noise or any type of sound was made or heard from this craft, it moved completely and surprisingly silent, not even the type of wind turbulence that you would hear from cars driving fast or airplanes landing was heard, although the ambience around the neighborhood seemed to quiet down while it passed overhead, almost as if it was somehow pushing the air out of the way, then gently placing the air back after it passed by, giving you the feeling that it was never really there, even a paper airplane could have made more noise than this craft. The craft was traveling at about 20mph from NE to SW over the apartment complex, which is an oddly slow speed for such a big craft to be traveling, which obviously was not using lift to fly like a conventional airplane, especially at an altitude of under 150ft, but this was only while we witnessed it, which was less than a mile or about half a minute. I waved bye to the craft while it flew away into the night..."],"Case Number":"35345","Tags":"City","Source":"MUFON","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around September 14th 2010","This sighting has been favorited 1 time.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=26.611996,+-81.863237(35345)&iwloc=A&hl=en\"> mufon case (35345) map </A>","Country":"United States","Longitude":"-81.863237","Weather Factors":"Unknown","Region":"Florida","Object Shape":"Triangle","Log Number":"US-01302012-0002","Date of the Event":"09/14/2010 10:00 UTC","Latitude":"26.611996","Object Features":"Patterned Surface, Louvres, Other, Unknown","files":["/var/www/straped/mufon/html2text/35345.html.txt","/var/www/straped/mufon/more/35345_submitter_file1__ROUGH.jpg","/var/www/straped/mufon/org/35345.html"],"Object Flight Path":"Straight-line path","City":"Fort Myers"}