{"Summary":"trangle aircraft but it was thick like a wedge 3 white bright lights 1 small red flashing in the center on the bottom, 2 big white lights on the back","Source":"MUFON","files":["/var/www/straped/mufon/html2text/35343.html.txt","/var/www/straped/mufon/org/35343.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.312343,+-86.492138(35343)&iwloc=A&hl=en\"> mufon case (35343) map </A>","City":"Andalusia","divs":["Sighting Detailsthis happened the summer 08 i was going to see my girlfriend. as i was almost in carolina community i look out to my left an saw a trangle aircraft flying very slow it was about 7:30pm it was geting dark but was still daylight anyway i got a good look at it. it was a trangle ~ wedge with 3 white bright lights on each corner an small red blinking light in the center an was silver not black like others ive been reading about flying at the hight of about 2 an half power poles. i was watchig it as i was driving it crossed the road right over my car it was dangerous but as it did i had my head out the window looking up at. as i came to the little store i had to turn at it was going the same direction as this road but a little to the left i lost sight of it behind the trees it was at a higher altitude now than when it came over me. an this is when i seen that it was more of a wedge with two white lights on the back. i just really want to know what i saw. its all true. happened in alabama right outside andalusia."],"Object Shape":"Triangle, Other","Sighting Duration":"Undisclosed","Date Submitted":"01/29/2012 11:48 UTC","Region":"Alabama","Object Flight Path":"Straight-line path","Longitude":"-86.492138","Tags":"City","Country":"United States","Viewing Distance":"20 Feet or Less","Case Number":"35343","trends":["There has been one other sighting in Andalusia","There were no other sightings in Andalusia on or around July 16th 2008"],"Object Features":"Other, Unknown","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"31.312343","Date of the Event":"07/16/2008 07:44 UTC","Log Number":"US-01292012-0019"}