{"Disposition":"Unresolved","Summary":"Clear skies. Saw 2 orb-like objects close to the horizon, right above the tree line. They moved around each other then disappeared. Saw two jets going in opposite directions afterwards. As if dropped by one of the jets, an orb appeared near the trail.","Latitude":"36.587932","Date Submitted":"01/30/2012 02:59 UTC","Viewing Distance":"501 Feet - 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/35351.html.txt","/var/www/straped/mufon/org/35351.html"],"divs":["Sighting DetailsAround 2:30pm I walked outside to smoke a cigarette and enjoy a cup of coffee. I was watching the beautiful clear skies when I saw what looked like two white objects moving around each other near the trees. They didn't seem to be that far away, and I didn't think much of it. I think they were just two pieces of paper floating around each other in the distance. The wind, however, was very calm. The objects then disappeared. ( I figured they had fallen to the ground. When the objects floated around each other, the spherical figure twisted as if the object was showing a thinner side - like if you turn a piece of white paper and the thin side is facing you. ) Above the area where I spotted this activity around the tree line, high in the sky, two jets appear. (This is about 5 minutes after the first two objects disappeared). The two jets were flying perpendicular to one another, yet they weren't meeting one another at any point. I focused my attention on one of the jets, and watched the trail it left. This was a normal trail, one that dissipated into the air. Strangely enough, a white orb appeared next to the trail. It looked as if it remained stationary, and the plane continued in it's normal path. Did the plane drop a white sphere? I didn't see the sphere come out of the plane, and I didn't see the sphere come out of the trail. It just appeared next to the trail, and looked as if it were stationary. It disappeared with the trail. Do airplanes drop white spheres that remain stationary? I would like some kind of explanation as to what it could be. The first two objects were probably trash, but spotting this orb appearing at a different location shortly after the first two disappeared has made me question whether or not the first two objects were really trash."],"Longitude":"-82.141854","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.587932,+-82.141854(35351)&iwloc=A&hl=en\"> mufon case (35351) map </A>","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"01/30/2012 02:37 UTC","Region":"Tennessee","Log Number":"US-01302012-0008","Case Number":"35351","Weather Factors":"Unknown","Object Features":"Unknown","Country":"United States","trends":["There have been 20 other sightings in Bristol","There were no other sightings in Bristol on or around January 30th 2012"],"Object Shape":"Sphere","City":"Bristol","Tags":"City"}