{"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"09/01/1992 12:00 UTC","Log Number":"US-01302012-0010","Summary":"Huge dark triangle shaped UFO with white lights","City":"Coal Valley","map":"<A HREF = \"http://maps.google.com/maps?q=41.432356,+-90.456545(35353)&iwloc=A&hl=en\"> mufon case (35353) map </A>","trends":["There has been one other sighting in Coal Valley","There were no other sightings in Coal Valley on or around September 1st 1992"],"Latitude":"41.432356","Date Submitted":"01/30/2012 03:20 UTC","Longitude":"-90.456545","Object Flight Path":"Straight-line path","Case Number":"35353","Viewing Distance":"21-100 Feet","Source":"MUFON","Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/35353.html.txt","/var/www/straped/mufon/org/35353.html"],"divs":["sighting detailsthis happened many years ago but is still fairly vivid in my mind and is the only time i have ever seen a ufo. i was driving at night on interstate 74\\280 in between coal valley and the 74\\80 interchange in the illinois side. it was a heavily wooded area on both sides of the interstate and there were no cars on the stretch of road besides me. the first thing i noticed was what appeared to be stadium lights off behind the trees to one side and wondering how i didn't know there was a stadium over there, since i'd grown up in that area. out of the corner of my eye i noticed that the 'stadium lights' disappeared behind taller trees for a little bit and then suddenly reappeared much closer than they had been initially, which caught my attention. when i looked back, the lights were now coming over the interstate and i could make out the gigantic triangle shape (i'm talking football field size, at least). it was moving very slowly (think blimp) and i couldn't hear any sound coming from it. engine and road noise may have covered a hum but there was no significant noise (i hear planes and helicopters over engine and road noise all the time). it seems like there was 1 white light on each corner and 1 white light centered on each side and there seemed to be a 'mist' around it, or possibly it was entering clouds, but seemed to be much too low for that to be possible. i cannot remember for sure it if was a partly cloudy night or not but i do remember determining its shape at one point by seeing the stars that it blocked as it passed in front of them. i'm not sure of color but it had to be very dark. it floated slowly over my truck until it disappeared behind the trees on the other side of the interstate. something else to note, prior to this incident, if someone had told me this same story that i am now telling, i would have been sure they were nuts and never believed it. i also cannot believe that i did not pull over and stop. all i remember is leaning forward looking up at it (because by the time it was crossing the interstate it was basically directly above my truck) and feeling complete awe mixed with almost fear and general unease. i just kept driving, asking myself over and over again in my head 'what was that?' and trying to rationalize it. there is nothing to this day that i can think of that it could have been. it was the most amazing crazy thing that has ever happened to me."],"Weather Factors":"Unknown","Object Shape":"Triangle","Country":"United States","Region":"Illinois"}