{"Source":"MUFON","Date Submitted":"01/30/2012 05:25 UTC","trends":["There have been 7 other sightings in Cherry Hill","There were no other sightings in Cherry Hill on or around December 24th 1974"],"Region":"New Jersey","Object Shape":"Unknown","City":"Cherry Hill","Log Number":"US-01302012-0012","Object Features":"Undisclosed","divs":["Sighting Details I was driving north on an interstate highway located just east and roughly parallel to the lower part of the NJ Turnpike. It was a day or two before Christmas, 1974, around 12-1 am in the morning. I had the entire road to myself, it seemed, as no other carlights were in sight in either direction. I may have been a half hour or so into New Jersey from the Delaware bridge. I was in the left lane when whatever it was ran up from my left and out from the sizable median separating us northbounders from the southbound lanes. The median sloped down out of sight, and so there was no warning of its heading my way and I didnt see it until it was on the road. It almost immediately stopped, while in the left-most lane, right in front of me, as it spotted my car approaching. It quickly stopped, faced me, and stood erect, acting like a deer frozen for a moment in the headlights. The expression on its face seemed one of shock, like what was I doing there? I reciprocated, but was busy trying to slow down without losing control. I had a good look at it, perhaps for 2-3 seconds, before it turned in the direction from whence it had come, and scampered off back into the median -- down, out of sight once again. It seemed thinner and more gangly than a human, possible taller, but it may have only seemed tall due to its relative thinness coupled with the relatively long arms and legs compared to its torso. It had no clothes; its entire body was a uniform dull white, or perhaps a light shade of gray. The head was hairless and thin as well -- not like any human head Ive ever seen. Though it faced me and was naked, I recall no other physical features. It seemed quite surprised to see me, judging by the expression of its eyes and mouth, as if it were a wild animal entering a road for the first time. I had a passenger, a priest, bumming a ride to NYC, lying down in the back seat, sleeping. I was heading home to NY from college for winter break. It seemed so surreal after it happened that I only shared the experience with my wife, already in NY, the next day, and pretty much forgot about it, as I regarded it as an oddity that would remain unexplained. It wasnt until a few years ago that I read about greys, etc. I now suspect thats what it was."],"Summary":"Spindly, naked, white/gray humanoid, but definitely not human, ran in front of my car.","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Sighting Duration":"00:00:10","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.935433,+-75.020781(35355)&iwloc=A&hl=en\"> mufon case (35355) map </A>","files":["/var/www/straped/mufon/html2text/35355.html.txt","/var/www/straped/mufon/org/35355.html"],"Country":"United States","Longitude":"-75.020781","Date of the Event":"12/24/1974 12:00 UTC","Latitude":"39.935433","Case Number":"35355"}