{"Summary":"on a september night wile in a defined backyard.. the stars were bright so i decided to give everyone a tour of the stars. seeing i use to give cubscouts tour of stars in planatarium a couple people who witnessed with. me one asked what was the star that.","trends":["There have been 5 other sightings in Wareham","There were no other sightings in Wareham on or around September 15th 1995"],"Tags":"City","Log Number":"US-01302012-0020","Sighting Duration":"12:01:00","Weather Factors":"Unknown","Source":"MUFON","Region":"Massachusetts","City":"Wareham","Longitude":"-70.705772","Date Submitted":"01/30/2012 09:33 UTC","Country":"United States","Date of the Event":"09/15/1995 01:00 UTC","divs":["Sighting DetailsWile sitting in defined backyard in a place called onset beach the stars were bright so i asked everyone there did they know there stars so i decided to give tour starting with big dipped oil dipped northstar. in cubscouts i ran the planatarium. so started the tour when someone trying to be funny says what's that star over there blinking beuitiful colors sitting still in the sky. so i says being funny at the time replied spaceship oh no mothership to be exact so e e eryone laughed it off but i knew exsactly what it was. i stopped the tour quickly rapped up the yard event and headed home i knew on e i got home it would disappear but when i got home i sat in the house for about15 minutes before asking my girlfriend to come outside. i told her i was going to show her something and for her.to tell me what was in the sky. well its night time and ofcourse she's half blind , cool now noone will ever beleive mey girlfriend is half blind ,she says let me go in the house and get glasses. that's when it dealt got had. when she returned she looked in the sky i couldn't and a shiney object appeared speeding almost light speed flew maybe a mile above us came almost right over our head speeding leaving a long streak of light behindy girlfreind took off , ran back into the house and it took me 45 minutes to find her shivering under the couch i told her that it was ok and we wouldn't go back out. I always heared u.f.o stories but never thought i would exsperience anything such as this . as she fell asleep saying that our tv was picking up strange channels that we never gotten before i knew we were being invaded but i have a I'm from Missouri aditude you got to show me for me to believe trust me I'm no esotel by far. i stayed up and watched them allnight just flying around capecod ma. the next day i built enough courage to call the meteare news papers to let them know we are intact being visited .i told the paper to watch the sky and i told him to film because i was told by him that cameras need special night lords to record so told him i know you have one to record. the night came and it was worse than the first night .i also had half the neighborhood out watching with me. we desired to post on the roof of my house.well it turned I to more of a party Gusn. a sighting until early that evening before anyone got to open a bearcan one flew exsacty rite over us and that's when i seen it actually for the first time . it was triangle shape about the size of five school bussess and it skipped through the sky it was flipping left to right wile skipping that continued through the night leaving everyone witnessing in who k and scared then through the clouds way above i saw the biggest craft i ever sees in my life exstend from one cloud to the next and i was so happy now i had witnessess and i knew my news paper guy got that footage , it was an eve t that wouldn't go unnoticed at a bail concert .i"],"Disposition":"Unresolved","Object Shape":"Disc, Square, Rectagular, Triangle","Viewing Distance":"20 Feet or Less","Case Number":"35363","files":["/var/www/straped/mufon/html2text/35363.html.txt","/var/www/straped/mufon/org/35363.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.758606,+-70.705772(35363)&iwloc=A&hl=en\"> mufon case (35363) map </A>","Object Features":"Unknown","Latitude":"41.758606"}