{"Date Submitted":"01/31/2012 11:45 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","City":"Ballyhale","Longitude":"-7.196883","Date of the Event":"10/15/2011 11:30 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=52.45907,+-7.196883(35367)&iwloc=A&hl=en\"> mufon case (35367) map </A>","Log Number":"IE-01312012-0002","divs":["Sighting DetailsI live outside of town so have a pretty good view of the skies apart form one security light in a business way down the road. I was letting my dog out to pee on a clear starry night and was looking up at the constellations from my back door as my dog was doing its business. When a moving object caught my eye. It was very high up and looked to me like a satellite moving across the sky from north to south. I kept watching it as I have done so since I was a kid. It seemed to fade and a bit on its straight course and I was tracking where I thought it would be again and it appeared. I had stepped out into the garden at this stage to get a clearer look. It faded maybe twice and was at around 15 degrees away from directly overhead when it just lit up all of a sudden. It was like someone had switched on a flood light. I thought this very very strange as I have watched satellites over the years and never seen them change in intensity. This got really bright for a split second or two, becoming the brightest star in the sky. I thought that maybe a satellite had burned up in the atmosphere, but in a split second it went back to the original duller tone of what looked like a satellite. It kinda freaked me out because the light gave me the feeling of being caught seeing something you shouldn't have. Strange but true. It continued on the same path and then faded out of view."],"files":["/var/www/straped/mufon/html2text/35367.html.txt","/var/www/straped/mufon/org/35367.html"],"Weather Factors":"Unknown","Object Shape":"Disc, Sphere","Region":"County Kilkenny","trends":["There have been no other sightings in Ballyhale","This sighting has never been favorited."],"Source":"MUFON","Disposition":"Unresolved","Tags":"City","Summary":"Saw light in sky which I thought was satelitte until it lit up","Latitude":"52.45907","Object Features":"Unknown","Case Number":"35367","Country":"Ireland"}