{"divs":["sighting detailsmy son and i walked out of our house around 6:03pm, so i could smoke a cigarette. i pointed to him up in the sky all the planes that i saw, because i thought there were a bunch flying in the same area. then i looked straight ahead, over a house across the street from us. i stared at a huge bright ball of light, and noticed it wasn't moving. so i pointed it out to my son. we walked closer in the direction of the light. we stood outside and looked at the light for approx. 10min. for the first 5min, the bright light was blinking very fast and wasn't moving in the sky at all. it was also very close to the ground. then after the 5min, the bright light started to slowly move sideways across the sky and at the same time the light dimmed. then after moving alittle ways across the sky slowly and not going up\\down in the sky, it moved super fast across the sky. also the light pattern changed. while it was moving fast, we noticed green, red & yellowish\\white blinking lights. around 6:10pm is when we could no longer see the light object b\\c it was behind trees. we stood outside for another 5min and saw nothing."],"Date of the Event":"01/30/2012 06:05 UTC","Date Submitted":"01/30/2012 07:18 UTC","Weather Factors":"Unknown","Country":"United States","Log Number":"US-01302012-0017","Object Flight Path":"Hovering then path","Summary":"saw big bright circle light over house","Object Features":"Dome","Region":"Pennsylvania","Latitude":"39.774579","Object Shape":"Circle","trends":["There have been 4 other sightings in Hanover","There were no other sightings in Hanover on or around January 30th 2012"],"Longitude":"-76.995638","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"00:10:00","Viewing Distance":"21-100 Feet","City":"Hanover","map":"<A HREF = \"http://maps.google.com/maps?q=39.774579,+-76.995638(35360)&iwloc=A&hl=en\"> mufon case (35360) map </A>","files":["/var/www/straped/mufon/html2text/35360.html.txt","/var/www/straped/mufon/org/35360.html"],"Tags":"City","Case Number":"35360"}