{"Date Submitted":"01/31/2012 02:23 UTC","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-90.792632","Source":"MUFON","Tags":"City","divs":["Sighting DetailsWe were taking star photography pictures at Argyle Lake State Park, north of Colchester IL. We first noticed the object as it was very bright orange traveling across the sky, not in any way related to an airplane or meteor or satellite. We had no real explanation when we first saw it. There was an airplane travelling roughly parallel to the object heading ENE. When looking at the pictures back at home, we realized there was a second object on the other side of the airplane. Our explanation as of now is maybe F16s escorting an airplane? Orange could describe the afterburner. However there was no sound what soever which makes it not likely. We also thought maybe low orbit satellite, but 2 identical in the same path roughly makes that unlikely. The objects were moving in a straight line at a constant speed, rather fast. It overtook the speed of the airplane and kept going ENE. I am not a believer in conspiracies, UFOs, etc. and I am always debating them. HARRP, Chemstrails, all of that is BS and bogus. Then this happened, and I hate this feeling of not being able to explain it. I'm trying to find some explanation and I don't have one. I was awestruck, and just didn't know what to say really. I'm happy I was able to take pictures of it. The object just kept going on its' path and lost it as it passed over the horizon."],"files":["/var/www/straped/mufon/html2text/35368.html.txt","/var/www/straped/mufon/more/35368_submitter_file1__pic3.png","/var/www/straped/mufon/more/35368_submitter_file2__pic4.png","/var/www/straped/mufon/more/35368_submitter_file3__pic5.png","/var/www/straped/mufon/org/35368.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.426431,+-90.792632(35368)&iwloc=A&hl=en\"> mufon case (35368) map </A>","Latitude":"40.426431","Object Features":"Unknown","Log Number":"US-01312012-0003","Date of the Event":"01/30/2012 07:48 UTC","Case Number":"35368","Viewing Distance":"Unknown","City":"Colchester","Summary":"A pair of very bright orange light traveling at a constant speed in a straight line.","Region":"Illinois","Weather Factors":"Unknown","Object Shape":"Sphere","trends":["There has been one other sighting in Colchester","There was one other sighting in Colchester on or around January 30th 2012","This sighting has never been favorited.",""],"Country":"United States"}