{"Date of the Event":"01/30/2012 12:00 UTC","Date Submitted":"01/31/2012 02:31 UTC","Region":"Nebraska","Object Flight Path":"Hovering then path","Tags":"City","Object Shape":"Disc","Longitude":"-96.746325","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/35369.html.txt","/var/www/straped/mufon/org/35369.html"],"Viewing Distance":"101-500 Feet","City":"Beatrice","Log Number":"US-01312012-0004","Latitude":"40.253926","Summary":"Pulsating lights in the sky over Southeast Nebraska","Disposition":"Unresolved","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Unknown","Country":"United States","divs":["Sighting DetailsWe were leaving Beatrice going north out of town on our way to Walmart when my son pointed out the front window a little to the left and said \"mom what is that\". At first I thought it was the gas yard towers just to the North, as it wasn't moving and the lights seem to be the same size. As we pulled into the parking lot, the object began to move north and seemed to get a little higher. I didn't know what it was. We couldn't see an object, just lights that were blinking on and of an they seemed to be going around in some sort of big circular pattern. We heard no noise at all and we were both out of the car looking at it. The lights reminded me of those fireworks that crackle on the way down. The lights were comeing off and on rapidly, almost sparkling. We decided to follow it down hwy 77. It was on the East side of the highway and seemed to be gaining speed. I couldn't keep up with it. Before I realized it I was driving 80 miles an hour and had gone almost 8 miles. I came back to my senses and decided to turn around and go back home. It was picking up a lot of speed and as we were waiting to make a u-turn back, it crossed over the highway and went West. We watched it until the lights were too faint to see. It was moving extremely fast and fairly low to the ground. Not as high as a jet airplane. My son tried to film it on his small camera phone several times but the lights didn't show up when we played it back. It really bothered me. On the first video, the lights were bright, and he was pointing right at it. I don't understand how it could have not shown up on the play back. The first thing I said to my son was \"no body is ever going to believe us\". We were both pretty shaken up over it. When we got home, I immediately got online and ordered a replacement charger for my video camera and have decided to keep it in my car from now on. I know someone else had to have seen this! It was too obvious. I wish I could find someone who has so we don't feel so crazy."],"trends":["There have been no other sightings in Beatrice","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.253926,+-96.746325(35369)&iwloc=A&hl=en\"> mufon case (35369) map </A>","Case Number":"35369"}