{"Case Number":"35371","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.684198,+-73.84627(35371)&iwloc=A&hl=en\"> mufon case (35371) map </A>","Object Flight Path":"Straight-line path","Log Number":"US-01312012-0006","Latitude":"40.684198","Region":"New York","Object Shape":"Disc","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Summary":"Early Tuesday morning, at dawn, I saw an object with strobing reddish lights drift slowly behind some trees around Woodhaven Blvd. It gave me a headache.","divs":["Sighting DetailsI was listening to music until about 5am, on Tuesday morning, January,31st. I was going to bed a little after 5am when I heard a loud buzz coming from behind my house. I looked out of my bedroom window(facing east)to see what was making that strange buzzing sound, when I saw a flat, slow moving object, with reddish strobing lights traveling in a straight path(north to south)a few hundred feet behind neighborhood trees. At first I thought it might be a conventional aircraft because I live near JFK, but quickly realized it was not anything Id ever seen before. I observed the silvery, gun metal colored object for about 15 seconds when it suddenly disappeared (blinked off). I immediately felt a headache coming on. I went to bed and a few seconds later I heard the buzzing sound again. I went to the window a second time, and observed the same object, but this time it was further to the south, and had ceased making the buzzing sound. It slowly drifted out of my field of vision and I went back to bed. I awakened at about 12:30 with a headache."],"City":"New York","Longitude":"-73.84627","Source":"MUFON","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around January 31st 2012"],"Disposition":"Unresolved","Date Submitted":"01/31/2012 03:12 UTC","files":["/var/www/straped/mufon/html2text/35371.html.txt","/var/www/straped/mufon/org/35371.html"],"Tags":"City","Date of the Event":"01/31/2012 12:00 UTC","Object Features":"Other"}