{"map":"<A HREF = \"http://maps.google.com/maps?q=32.35723,+-95.297652(35377)&iwloc=A&hl=en\"> mufon case (35377) map </A>","Sighting Duration":"00:19:00","Longitude":"-95.297652","Summary":"ORANGE-YELLOW ROUND ORB W/PULSATING RED/BLUE/GREEN LIGHTS LIKE A DISCO LIGHTS/HOVERING & SLOWLY MOVING AWAY 1-1-12 PM","Object Shape":"Circle, Fireball, Star-like","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around January 1st 2012","This sighting has never been favorited.",""],"Source":"MUFON","City":"Tyler","Date of the Event":"01/01/2012 07:30 UTC","Country":"United States","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/35377.html.txt","/var/www/straped/mufon/more/35377_submitter_file1__100_1823.jpg","/var/www/straped/mufon/more/35377_submitter_file2__100_1828.jpg","/var/www/straped/mufon/more/35377_submitter_file3__100_1829.jpg","/var/www/straped/mufon/org/35377.html"],"Object Features":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","Region":"Texas","Date Submitted":"01/31/2012 11:29 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Log Number":"US-01312012-0011","divs":["Sighting DetailsMy mom and I were traveling home from Church that night. It was New Years Day night and also Sunday so we had Church. As I was traveling south from Tyler, TX towards Frankston, TX, I noticed a weird light in the sky. It was a different color than the planets and stars that we are used to seeing and that is what caught my attention about this light. The stars and planets are all bright white colored and this was a distinct orange-yellow color. However, at first I thought that maybe it was the North Star because of the location of it, it seemed to be closer to the ground and very, very bright. We made a right turn to go home and saw the object again from a different angle and it seemed to not be as bright as before and more yellow-orange than it was before too. The object was so intriguing and fascinating to me that I felt compelled to check it out more so I dropped my mom off at home and then took my camera to the marina to get a better look at it. When I got to the marina the object had moved over accross the lake and was hovering over the other side of the shore. There were alot of people out shooting fireworks so occasionally I would hear and see fireworks accross the lake underneath where the object was hovering. It looked like a orange yellow ball that was pulsating or blinking colors kinda like disco lights flash. I would see red and blue colors flash inside of this orange yellow ball. I got out my camera right when I got there and took some still pictures and then decided to do a video. It was very cold and my hands were shaking so I am afraid the video may not have come out that well, but it does show the object when I used the zoom on my camera to show more detail of the object and then I would zoom out to show where the object was in relation of the lake and the lights on the lake. The part of the video where you dont see anything but black is when I was trying to get a plane to show up on the video but all the planes I saw were so small compared to this orb that I couldnt get them to show up. The purpose of that was to show the difference between this orb and a plane. I stayed for a while and the object just slowly moved away from where I was until it was just a little spec of light hoving over the horizon. My battery kept going dead so I didnt get to film it all. I felt excited that I got the object on video. I really think it was not a plane because planes are not round, and it moved too funny to be a planet or a star. Weird. P.S. I have tried repeatedly to send my videos but I guess the video files are too big and they wont allow me to submit my report. I will send stills instead."],"Case Number":"35377","Latitude":"32.35723","Disposition":"Unresolved"}