{"Summary":"UFOs ascended to a hieght of approximately 35K ft., decended beyond the mountains which are only at about 3K ft Circled by jet @ high rate of speed - sky was clear, temp at about 82F .","Tags":"City","files":["/var/www/straped/mufon/html2text/35372.html.txt","/var/www/straped/mufon/more/35372_submitter_file1__Jet-CloudCirclesoverNawsChinaLake.jpg","/var/www/straped/mufon/org/35372.html"],"City":"Ridgecrest","Date of the Event":"01/19/2012 11:20 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.631616,+-117.667767(35372)&iwloc=A&hl=en\"> mufon case (35372) map </A>","Object Flight Path":"Path then hovering","Case Number":"35372","Country":"United States","Date Submitted":"01/31/2012 05:54 UTC","Object Features":"Unknown","trends":["There have been 11 other sightings in Ridgecrest","There were no other sightings in Ridgecrest on or around January 19th 2012","This sighting has never been favorited.",""],"Object Shape":"Circle, Cylinder, Disc, Sphere","Latitude":"35.631616","Region":"California","divs":["Sighting Details I have never contacted MUFON in the past. I had heard of your organization through a National Geographic sponsored event. I believe 99% of all sighting are either mis-identification, military secret technology or ? With that statement in mind, Im an Applications Engineer by profession. I call-on military bases including Edwards AFB, 29 Palms Marine Base, Ft. Irwin and Naws China Lake in Ridgecrest. While returning home from the Trona Area after visiting Searles Valley Minerals, I took the cut-off which is the Trona road. An isolated 22 mile cut-off back to Highway 395 to Red Mountain. On this stretch of road at or about the cross street of Randsburg wash (military road), I witnessed a jet, possibly an F16 circling at tremendous speeds. Quite frankly, I didnt know our aircraft had the capability to turn in such a way. Propulsion on a straight-away I have seen many times & turns as well, but not such tight turns at the speed it was traveling. It was also creating the tight circle smoke plumes that was being generating. Myself and 2 other automobiles stopped as well - as I was having electrical \"flashing\" on my dashboard electronics & pulled over(this is a brand new truck). The view was such a unique site. Several sonic booms were heard during this flight process in a very tight circle. I started to take pictures of the circular patterns as they criss-crossed in a spiral upward motion from about 12K ft to almost 30K feet in approximation. The jet paused mid-air, and dropped to the lower altitude similar to a Harrier jet & began the spiral once again. This time, their were glowing circular objects going straight up in the middle of the plumes. They werent weather balloons, in the traditional sense, as they would stop mid-air, descend and then accelerate at a high rate of speed upward & then stop as the jet came closer. This happened over the China Lake \"Echo\" range which is a communications and radar jamming system. The coordinates seemed to be somewhere above the area of 35 degrees 33 08.32\" X 117 degrees, 26 38.77\" in approximation. I was able to capture photos of the circling jet, plumes of smoke and upon initial review, couldnt pick up the circular objects, which seemed to fade-in and out with an almost reflective mirror quality. I thought initially it could be weather balloons made of a highly reflective Mylar, as most balloons are produced this way. Balloons do have the capability to travel by radio control, so I am not so naive to think and understand that side-to-side and up-n-down movement would not be possible with our current technology. The speeds however & dead stopping in mid-air at a rate that the jet could not match left me thinking it might be something else. Upon careful review and clicking on the depth of field clarification on my hTC cell phone picture I was able to see very clearly the 7 each circular objects. These objects were witnessed by other vehicles that had stopped, they too were taking pictures with their cell phones. The day was clear, the temp about 83F, mid-day at about 11:20AM. I have a mountain view in the background of the pictures as a contrast. The circular objects went up and down a few more times, stopped at a certain elevation (approximately 12K ft) and ascended straight-up & excellerated to a point of vanishing. The miliatry jet, seemed to attempt to follow, then travelled in a excellerated speed at almost a verticle climb. The aircraft dissapeared from view into the stratosphere."],"Source":"MUFON","Sighting Duration":"11:20:00","Disposition":"Unresolved","Longitude":"-117.667767","Log Number":"US-01312012-0007"}