{"City":"Pathfork","map":"<A HREF = \"http://maps.google.com/maps?q=36.75163,+-83.443743(35385)&iwloc=A&hl=en\"> mufon case (35385) map </A>","divs":["Sighting DetailsI was outside sitting at my picnic table late that evening. When I noticed a strange black cloud about 50 foot in diameter and shaped like a sphere came up over a low ridge line about half a mile away. This cloud was traveling south and following 5 very large black birds that never moved their wings..just glided along. The birds had a wing span of about 16 feet and slender long bodies for their size. At first I thought the small black cloud was a puff of smoke coming from the strip mine after blasting the hill side or smoke from a large piece of heavy equipment up on a higher ridge behind the lower ridge. The black cloud seemed to drift along and dropped down lower after clearing the top of the smaller ridge. This black cloud was about 60 feet above the black birds trailing behind them and was following their direction toward me on a downward path until I lost sight of them and the cloud against the dark background of the ridge. 30 seconds went by until the black cloud reappeared closer to us. I told my wife to grab the camera to take pictures of this strange cloud while I watched were it is going. I never saw the 5 strange black birds after I lost sight of them, just only the black cloud. My wife got the camera and as soon as she took the picture the flash of the camera caused the black cloud to immediately changed direction and sped off at an incredible speed. My wife took a second picture as fast as she could but did not get the black cloud in the second one. Once we looked at the pictures on the digital camera we were shocked that exactly where the black cloud should have been was this strange craft with another even larger craft higher up that was traveling in the same direction that was not visible to us. In the pictures I estimated that the craft was 12 feet in diameter at it's base and 16 feet high 3 sided bell shaped craft with a dome shape bottom."],"files":["/var/www/straped/mufon/html2text/35385.html.txt","/var/www/straped/mufon/more/35385_submitter_file1__UFO001.jpg","/var/www/straped/mufon/more/35385_submitter_file2__UFO002.jpg","/var/www/straped/mufon/org/35385.html"],"Summary":"Small black cloud following 5 odd black birds.","Sighting Duration":"Undisclosed","Object Shape":"Other","Country":"United States","Date of the Event":"09/05/2009 07:40 UTC","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-83.443743","Latitude":"36.75163","trends":["There have been no other sightings in Pathfork","This sighting has been favorited 1 time."],"Viewing Distance":"101-500 Feet","Case Number":"35385","Object Features":"Window(s)","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Date Submitted":"02/01/2012 04:57 UTC","Region":"Kentucky","Log Number":"US-02012012-0004"}