{"Weather Factors":"Unknown","City":"Prospecthill","Object Features":"Other","Sighting Duration":"Undisclosed","Log Number":"IE-02012012-0005","Date of the Event":"07/24/2011 12:00 UTC","trends":["There have been no other sightings in Prospecthill","This sighting has been favorited 2 times."],"Object Flight Path":"Hovering then path","Region":"County Dublin","files":["/var/www/straped/mufon/html2text/35386.html.txt","/var/www/straped/mufon/more/35386_submitter_file1__Myufo.png","/var/www/straped/mufon/org/35386.html"],"Object Shape":"Triangle","Latitude":"53.403741","Summary":"Shaped like a Boomerang. 3 lights under wings, Black solid, turned light reflected.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=53.403741,+-6.311666(35386)&iwloc=A&hl=en\"> mufon case (35386) map </A>","Country":"Ireland","divs":["Sighting DetailsSitting on my Balcony, during the summer clear day some cloud, but warm. I looked out over my balcony as I always do, and looked down to the right of me up the road. There were two people walking down towards me. I noticed a whirlwind a little further away, across from the park, were what caught my eye were two black dots at first. Thinking some one was flying a kite. I watched closer and to my amazement they were not kite's not birds not planes nothing I have ever seen. They were shaped like what I would discribe as a boomerang shaped object or objects as there were two of them. One was a little smaller and seemed to be looking at some thing. The other was larger in shape and was what looked like leading up into the sky. Hovering for the other small ship. As it turned or flipped, as they did, the sunlight reflected off its solid black shape. They were following what looked like a pattern and kept raising up hovering as they ascended up up up the smaller one following slowly behind. I watched this for about 15mins they just disappeared up out of view into the sky I could no longer see them."],"Date Submitted":"02/01/2012 06:12 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"35386","Longitude":"-6.311666","Disposition":"Unresolved","Tags":"City"}