{"Country":"United States","Object Shape":"Circle, Disc, Oval, Sphere","trends":["There have been 7 other sightings in Chino","There were no other sightings in Chino on or around January 28th 2012","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/35389.html.txt","/var/www/straped/mufon/more/35389_submitter_file1__CIMG0215.jpg","/var/www/straped/mufon/more/35389_submitter_file2__DSC_3579.jpg","/var/www/straped/mufon/org/35389.html"],"Region":"California","Summary":"Sarted off as a bright white glowing double decked disc then morphed into or released a green sphere with a yellow center.","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Case Number":"35389","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was at the children's museum in chino California at a birthday party. the party was just ending it was around 4 pm i was talking to my wife's cousin when this bright lite kinda flickered it wasn't high up in the sky cause i barely look up just over the two story building it seem to be a way's away cause it looked small but my wife's cousin was also taking picture's, i don't know what kind of camera he had but it had a five to six inch lens on it so i told him to take some pictures he took a total of six pictures all with in maybe thirty seconds you can see the object moving away and up from us till we finally lost it. He then shows me the pictures on the cameras screen they looked very small till he zoomed in close and wow is all i could say i was very excited about the whole event, i was the only one so i had him send my wife the pictures through Facebook my wife emailed them to me the next day, my wife's cousin said he left the option of zooming in on the pictures i sent you zoomed in pictures on file CIMG215.jpg and the originals on file DSC_3579.jpg... the only reason i seen it is because i'm always looking up and was in the marines for a while till i got hurt in the early nineties so know that wasn't a plane helicopter even though the Ontario airport is only five or so miles away that actually made me think about the airspace there's no way it was a civilian aircraft the big airlines fly by just a little higher than object..send me an email or call me to know i\"m not just wasting my time..cause i have lots more..thank you"],"Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Date of the Event":"01/28/2012 04:00 UTC","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","City":"Chino","map":"<A HREF = \"http://maps.google.com/maps?q=34.014398,+-117.691781(35389)&iwloc=A&hl=en\"> mufon case (35389) map </A>","Date Submitted":"02/01/2012 12:26 UTC","Log Number":"US-02012012-0008","Latitude":"34.014398","Longitude":"-117.691781"}