{"Object Shape":"Star-like","Latitude":"37.947979","Object Flight Path":"Path with directional change","Summary":"10 bright redish orange ufos","Disposition":"Hoax","Longitude":"-122.060796","Object Features":"Unknown","Source":"MUFON","Date of the Event":"07/01/2005 01:15 UTC","Case Number":"3538","Sighting Duration":"00:04:15","Viewing Distance":"Unknown","Country":"United States","Weather Factors":"Unknown","City":"Pleasant Hill","Region":"California","Log Number":"US-07032005-0003","trends":["There have been 2 other sightings in Pleasant Hill","There were no other sightings in Pleasant Hill on or around July 1st 2005"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.947979,+-122.060796(3538)&iwloc=A&hl=en\"> mufon case (3538) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/3538.html.txt","/var/www/straped/mufon/org/3538.html"],"divs":["Sighting DetailsI had just gotten back from the Movie Theater with my roomate , we went to the balcony of our apartmet to smoke a cigarrete.As usual I am always looking at the sky at night , I am a great admirer of stars and the moon. All of a sudden I saw this 6 bright redish orange flying objects , they were the size of the stars ,they were coming from down the horizon on the left size of the sky .They were flying close together but not in a linear ,ascendent and descendent directions ,there was also a helicopter flying at the same time on the sight!.I imediatelly told my roomate of what I was seing , he asked me what are those things as we stared at the objects.We started losing sight of them when the light went across our building , that's when 4 more appeared following them from the half of the sky , same colors , and were flying in the same direction of the previous 6 ones! I have never seen something like that in the sky but I knew right of way that they were UFOS! My roomate had always been skeptical about this subject but now he thinks that there's definately something out there! Unfortunately I didn't have a camera handy to record the sight ,I was so excited that I didn't even think about the camera!"],"Date Submitted":"07/01/2005 01:15 UTC"}