{"Region":"Maine","Date of the Event":"09/01/2011 05:00 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path","City":"Pembroke","Weather Factors":"Unknown","Case Number":"35391","Date Submitted":"02/01/2012 01:52 UTC","Longitude":"-67.161944","files":["/var/www/straped/mufon/html2text/35391.html.txt","/var/www/straped/mufon/org/35391.html"],"trends":["There have been no other sightings in Pembroke","This sighting has been favorited 1 time."],"Summary":"While on patrol I observed a disc shaped object the color of silver light streak across the open, blue, sky.","map":"<A HREF = \"http://maps.google.com/maps?q=44.953611,+-67.161944(35391)&iwloc=A&hl=en\"> mufon case (35391) map </A>","Viewing Distance":"Over One Mile","Country":"United States","Tags":"City","Object Shape":"Disc","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsI was leaving my patrol area at Pleasant Point for fuel. Driving south on U.S. route 1, in the town of Pembroke, Maine, I looked up into the blue sky and oberved a disc the color of silver light streaking across the sky in a westwardly direction. It traveled as if on a rail, in that its path seemed fixed and unwavering. I described its movement as a skipping motion because it seemed to be pulsing. I believe the pulsing gave the impression of a skipping motion. Maybe it was doing both. The speed was unbelievable. Ive observed many different types o planes etc, having grown up right next to what used to be called Pease Air Force Base, I attended air shows, my father was an aircraft mechanic, as a child I observed a jet fighter glide no more than fifty feet above my home in Portsmouth, NH. before it crashed into a neighboring apartment building (Check the facts. It happened), and in all my years Ive never seen anything so unmistakingly unidentifiable as that ship the color of silver light - streaking across the open blue sky. Birds, insects, planes, even men, fly, and none are capable of cutting through the sky like the object I observed. At aire shows the speeds at which jets move can be appreciated due to how short a distance the observer is allowed to ejoy the show from. Yet, even at the air show - when the jets fly some distance away - they appear to be moving at a slower rate. This past September, the object I observed was a good distance away - maybe a mile or more - and still its speed was impossible. You may ask: \"If it was going so fast, how did you get such a good look at it?\" All I can say is this: When the the human mind observes something entirely new to its senses, it locks onto it, and the entire world seems to slow down as all of the brilliant details stand out like flames and brand themselves into your memory. In the state of Maine we are not supposed to have mountain lions. The game wardens service says they do not exist up hear. Well the people up this way see them. I saw one run across the street in front of my cruiser, and although it crossed the street a few graceful bounds, my mind locked onto what I was seeing for the very first time and allowed me to record details that might be missed amid a more common event. So, anyway, that is my report. Ive seen things before, but always had doubts about what I really saw. I have no doubts about last September."],"Log Number":"US-02012012-0009","Latitude":"44.953611","Sighting Duration":"Undisclosed"}