{"Date of the Event":"12/15/2011 07:30 UTC","Summary":"small, alternating green & white lights with hummingbird-like movement","map":"<A HREF = \"http://maps.google.com/maps?q=35.999643,+-78.894269(35393)&iwloc=A&hl=en\"> mufon case (35393) map </A>","Case Number":"35393","Date Submitted":"02/01/2012 07:58 UTC","Object Shape":"Star-like, Unknown","Latitude":"35.999643","Weather Factors":"Unknown","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around December 15th 2011"],"Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-78.894269","Log Number":"US-02012012-0011","Tags":"City","City":"Durham","Source":"MUFON","files":["/var/www/straped/mufon/html2text/35393.html.txt","/var/www/straped/mufon/org/35393.html"],"divs":["sighting detailsi was walking the dog one week night mid-dec 2011 & got to the end of the driveway. i looked down the street to my right (north east direction) and noticed an odd light in the tops of a group of about 6 pines trees about 1\\4 mile away. they are in the back yards of some houses. no one else was out on my street. it was dark and the night was clear, temp about 45 degrees. the light was small, alternating white and green, and it flited among the tops of the pine trees. at first i thought it was a plane, then maybe some kids out with a toy, but that wasn't it. the movements reminded me of a hummingbird or bumblebee. i couldn't see it distinctly given the distance and i was not wearing my glasses. i watched for about 2-3 minutes trying to figure out what it was. i had never seen anything like this before and i have lived in this neighborhood for 4 years. after about 3 minutes it took off behind the pine trees, up and away from me, apparently in a pretty steady line until i lost sight of it. now every night i always glance down to the pine trees hoping to see it again, but no luck so far."],"Country":"United States","Object Flight Path":"Hovering then path,Path with directional change","Region":"North Carolina","Object Features":"Unknown","Sighting Duration":"Undisclosed"}