{"Log Number":"US-02012012-0021","Object Features":"Other","Date of the Event":"02/01/2012 07:55 UTC","Source":"MUFON","Date Submitted":"02/01/2012 10:23 UTC","trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around February 1st 2012"],"City":"San Antonio","Latitude":"29.608709","Tags":"City","Country":"United States","Object Shape":"Fireball","Weather Factors":"Unknown","Case Number":"35400","Disposition":"Unresolved","divs":["Sighting DetailsNote: Witness is a MUFON Field Investigator and Star Team member. Driving pick-up truck home from work at 7:55 pm on Wednesday, Feb. 1, 2012, traveling north on Hwy 281, passing between the exits for Brook Hollow and Thousand Oaks, facing due north, when suddenly a very large and extremely bright white \"fireball\" with a long yellow tail streaked into view passing directly in front of me from west to east and descending at a very shallow angle. The object was close enough that I could make out some detail in the long yellow tail behind it which looked like flames. From my viewpoint, the object appeared to be just beyond Loop 1604 and paralleling the loop from west to east. Loop 1604 was about a mile north of my position when the object came into view. The object was about the size of a penny when my hand is held at arms length with the thumb and index finger extended. The object appeared to be very low, maybe 800 feet of altitude and was descending at a very shallow angle of about one unit down for every ten units forward. It was traveling at a very high rate of speed, much faster than the commercial air traffic that is common in this area as these jets set up for landing at San Antonio International about three miles to the south of my position when I first saw it. I estimate that it was within my field of vision for about 7 seconds before it passed out of view behind buildings to my right. My first impression was that it was a very bright meteor and I kept expecting it to burn out, but it did not lose any intensity while within my view. My next impression was that it was so bright that it looked like burning magnesium, but did not have any other colors associated with it other than the flaming yellow tail. My last impression was that I fully expected to come around the buildings and see that it had hit the ground somewhere between Hwy 281 and Universal City about 7 - 8 miles to the east. I drove up to the interchange at 1604 and 281 and watched to the east for a few minutes but did not see any sign of the object or a possible impact. I called 911 to report this incident because I expect that this object had to have hit the ground somewhere to the east of 281 unless it burned up immediately after passing out of my view."],"Summary":"Bright white light with long yellow trail streaked W to E descending toward Universal City, TX.","map":"<A HREF = \"http://maps.google.com/maps?q=29.608709,+-98.496394(35400)&iwloc=A&hl=en\"> mufon case (35400) map </A>","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-98.496394","Sighting Duration":"00:00:07","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/35400.html.txt","/var/www/straped/mufon/org/35400.html"],"Region":"Texas"}