{"Object Shape":"Circle, Fireball, Star-like","trends":["There has been one other sighting in Noonday","There were no other sightings in Noonday on or around February 1st 2012"],"divs":["Sighting DetailsI was leaving Church in Tyler, TX and made a detour to Flint, Tx to run an errand and was leaving Flint, TX on HWY 346 heading West toward Noonday,TX. I noticed a large yellow-orange orb or ball of light in the sky to the west of me as I was traveling west on HWY 346. It appeared to be hovering like a star but it was not the color of a star of planet which is a bright white color, this thing is a yellow-orange color. I watched it off and on as I was driving and would lose sight of it due to being behind trees and houses, etc. It was still in the sky to the west of me when I reached HWY 155 to turn left to go to Noonday. While in Noonday, I turned left to head towards home and saw it again in the sky straight ahead which was west and I was going west so it was straight ahead. It looked like it was still about 45-50 degrees in the sky at that time but it looked like it was going further away from my position. I went to the marina to get a better look and hopefully take a picture of it but by the time I got to the marina, the yellow-orange ball was too far away to show up in my camera. It had moved accross the lake and even further than that until it was just a little orange spec in the sky above the horizon. The sighting started while driving at around 8:20pm and continued until just after 8:30pm when I lost sight of the orange ball. It was going west when I saw it last. I am dissapointed that I didnt get any pictures this time like I did last time. The orange ball didnt linger around the lake like it did before on 01-01-12."],"Latitude":"32.235636","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.235636,+-95.406657(35404)&iwloc=A&hl=en\"> mufon case (35404) map </A>","Region":"Texas","City":"Noonday","Date Submitted":"02/02/2012 01:02 UTC","Case Number":"35404","Date of the Event":"02/01/2012 08:20 UTC","files":["/var/www/straped/mufon/html2text/35404.html.txt","/var/www/straped/mufon/org/35404.html"],"Tags":"City","Longitude":"-95.406657","Disposition":"Unresolved","Sighting Duration":"00:10:00","Source":"MUFON","Object Features":"Unknown","Summary":"Yellow-orange orb/with pulsating lights hovering-moving slowly over horizon","Log Number":"US-02022012-0001","Object Flight Path":"Hovering then path,Straight-line path","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"Unknown"}