{"Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.224947,+-72.615117(35406)&iwloc=A&hl=en\"> mufon case (35406) map </A>","City":"springfield MA","Weather Factors":"Unknown","Source":"MUFON","Latitude":"42.224947","Longitude":"-72.615117","trends":["There have been no other sightings in springfield MA","This sighting has never been favorited."],"Disposition":"Unresolved","Case Number":"35406","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/35406.html.txt","/var/www/straped/mufon/org/35406.html"],"Object Shape":"Circle","Date of the Event":"02/02/2012 06:31 UTC","Region":"Connecticut","Sighting Duration":"Undisclosed","Object Features":"None","Date Submitted":"02/02/2012 04:25 UTC","Log Number":"US-02022012-0003","divs":["Sighting DetailsTHIS DAY for me personally was a day of thriving and defeating obstacles. I was on foot from a friends home heading homeward. Sun had set. I was passing through the Enfield town green, and stopped at the fountain in front of our Town Hall to sit as I do often here. I looked skyward into a clear cloudless sky. Most immediately I saw a \"star\" shift, and watched close. It stayed still for a short time, and then streaked spacebound or I think. What I saw was a brief flash of light in shape of a line, then nothing. FROM MY VIEW, the line was approx 500 ft. I continued my walk home. Stopping as routine at the Veterans Memorial on the town green. I circled the memorial leaving 4 signs I burned into wood at the base of the Memorial. \"Poverty's End\" \"Building World\" and \"Community\". Leaving a childs size leather coat in red white and blue on the flagpost I then found a place to sit. My focus now up, I see three or maybe more of the same starlike objects, it seemed as if they were patrolling the town green. I watched for possibly one half hour but I wasnt thinking in digital time so I may be inaccurate. I continue on and watched them as I walked the last mile home. They seemed to follow me I cant be sure, but it felt like it. I then had a brief jolt of fear shoot through me. Then thought this is ok, you will sleep tonight and wake tomorrow. I gave a last glance skyward as I opened the door. Bumping my chest in a sign of respect, I went to my room and thrived. I have to add this: I do not remember many dreams after being involved in a head on collision. This night I remember vividly what I saw in my sleep. I will only say here, three things were most prominent: NATURE FLIGHT AND TIME."],"Object Flight Path":"Stationary,Hovering then path","Summary":"Star like. Blended with stars to perfection."}