{"trends":[],"Sighting Duration":"Undisclosed","Object Shape":"Sphere, Other","Object Features":"Appendage(s), Other","Date of the Event":"02/02/2012 02:05 UTC","Case Number":"35418","Date Submitted":"02/02/2012 07:36 UTC","City":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-02022012-0015","Country":"United States","Source":"MUFON","Disposition":"Unresolved","Summary":"Weird shape almost like barbell appendage-multiple objects","map":"<A HREF = \"http://maps.google.com/maps?q=35.524801,+-86.579147(35418)&iwloc=A&hl=en\"> mufon case (35418) map </A>","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/35418.html.txt","/var/www/straped/mufon/org/35418.html"],"Latitude":"35.524801","divs":["Sighting DetailsAt Sharp Spring Park in Smyrna TN on February 3rd 2012 at between 2:05 and 2:10pm. It was a warm bright sunny cloudless deep blue sky. I saw an unusual looking object as I exited my car to go walking. At first I thought it was a balloon that perhaps an elementary school nearby had released. It got my attention because it was flying in an unusual pattern. It would hoover than it would go slow and then it would move quickly. As I stared at it I could see a blinking white to yellowish light. It went behind some trees so I moved to get a better look. Then another one appeared of the same type and description flying in the same direction. Seconds later a third one appeared and they were then all traveling at a high rate of speed. Suddenly from west there appeared a whole swam of objects with flashing light. They were all white and flying at a high rate of speed. They had rapidly flashing lights and almost looked like a swarm of birds because of the chaotic pattern or grouping of objects. They went from directly overhead to over the horizon in about 6 seconds or less. They were not planes or birds. I was amazed because I have never seen anything like this except for the films of UFO sightings in Mexico where you have a large swarm of objects. I tried to shoot a picture with my iphone but was too nervous to get a shot off in time. It was absolutely amazing. I go to the local airshow all of the time in Smyrna and I have never seen anything close to what I saw. The swarm of objects were a cluster of about 11 to 14 objects traveling in a group and heading I think west. I'm not good with directions."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Longitude":"-86.579147","Region":"Tennessee"}