{"Date of the Event":"01/30/2011 09:30 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.056649,+-95.78838(35414)&iwloc=A&hl=en\"> mufon case (35414) map </A>","Region":"Oklahoma","City":"Broken Arrow","Date Submitted":"02/02/2012 03:53 UTC","Disposition":"Unresolved","Tags":"City","Object Features":"Unknown","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/35414.html.txt","/var/www/straped/mufon/org/35414.html"],"Case Number":"35414","Latitude":"36.056649","Object Shape":"Triangle","trends":["There have been 5 other sightings in Broken Arrow","There were no other sightings in Broken Arrow on or around January 30th 2011"],"Object Flight Path":"Path with directional change","Log Number":"US-02022012-0011","Longitude":"-95.78838","Summary":"2 sets of 2 UFO's popped up over horizon immediately about 4 minutes apart, flew very slowly moving NE, approx 10,000 feet, absolutley no sound, very strange lights","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["sighting detailsi was standing on my front porch about 9:30 pm looking toward the south\\southwest and suddenly 2 craft popped up over the horizon in formation, at approximately 10,000 feet moving very slowly toward the northeast. they both had strange lights that were orange and red, i guessed the shape to be somewhat triangular. they were moving much slower than any aircraft i have ever seen and i had 31 years of service between the us navy and department of defense and have seen many aircraft in my day. the only aircraft i have ever seen moving that slow have been helicopters and these were not helicopters! the light pulsated in an unusual fashion. i watched them as they moved almost directly over my house and proceded to the northeast. then a second pair exactly like the first popped up over the horizon in the exact same location as the first pair and passed in the exact same direction. i asked my wife to come out and see and she was somewhat amazed. i continued to follow the 2nd set of craft as they moved to the northeast and by the time they were beyond my house the 1st set vanished and a few minutes later the 2nd set vanished, abruptly. the entire event took approximately 10-12 minutes. as i stated, there was absolutely no sound and i find that highly unusual for craft of this size and at that altitude to make no noise. skies were very clear and we have excellent views of stars. i've never seen a ufo but i do believe they are out there and i do believe that these were ufo's."]}