{"Date Submitted":"02/02/2012 11:34 UTC","Date of the Event":"12/31/2011 12:00 UTC","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.779286,+-78.636834(35427)&iwloc=A&hl=en\"> mufon case (35427) map </A>","Latitude":"35.779286","Viewing Distance":"Unknown","Case Number":"35427","Disposition":"Unresolved","Country":"United States","Tags":"City","Summary":"Bright orange oval shape moving steadily through sky above trees, then slowed down, then sped up, then slowed, then stopped and hovered, then slowly got smaller and smaller in shape until it was too small to see anymore.","Object Features":"None","divs":["Sighting DetailsI was jogging in the street at night when I saw a bright orange oval shaped object moving steadily through the sky right above the tree line. It made no noise. It was moving steadily (about the speed of an aircraft seen from far away), but then it slowed down for a little while, then sped up again, then slowed down again. It then stopped and hovered in the same place above the tree line. After maybe 20 seconds, it then slowly and steadily got smaller and smaller in shape until it was a pinpoint and then too small to see anymore (in other words, at least from my perspective, it disappeared). The whole event took about 2 minutes, I would say. Also, right about the same time the object started to decrease in size, some fireworks started going off in the neighborhood nearby (it was new year's eve). I described the event to a friend of mine who is a pilot, and he said it could only be described as a UFO."],"Object Shape":"Oval","Weather Factors":"Unknown","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around December 31st 2011"],"files":["/var/www/straped/mufon/html2text/35427.html.txt","/var/www/straped/mufon/org/35427.html"],"City":"Raleigh","Sighting Duration":"Undisclosed","Log Number":"US-02022012-0024","Object Flight Path":"Path then hovering","Source":"MUFON","Longitude":"-78.636834"}