{"Region":"Virginia","Case Number":"35424","divs":["sighting detailsat approx. 8:17 p.m.(tonight - february 2, 2012 - i spotted 5 very bright white lights with a smaller red flashing light above each, heading in a south westerly direction. at first sighting, they seemed to be in a diamond pattern with a tail, as they continued to move further away, the formation turned to a y. by this time it was 8:22 pm. then i glanced to my right (west) and spotted one brilliant white light. at that time i decided to grab my telescope. this brilliant white light remained stationery and constant; and was about 1,000 ft. above a mountain range approx. 9-10 miles from my residence. i continued to view it both with the telescope and with my naked eye. through the scope it appeared to have red\\blue and white light emitting. after approximately 18 minutes, it began to descend slowly and within 3 minutes it had dropped below the treeline."],"Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Other","Tags":"City","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.357843,+-79.667797(35424)&iwloc=A&hl=en\"> mufon case (35424) map </A>","Source":"MUFON","Log Number":"US-02022012-0021","Longitude":"-79.667797","Sighting Duration":"Undisclosed","Date of the Event":"02/02/2012 08:17 UTC","trends":["There have been 13 other sightings in Bedford","There was one other sighting in Bedford on or around February 2nd 2012"],"Summary":"At approx. 8:17 p.m.(tonight - February 2, 2012 - I spotted 5 very bright white lights with a smaller red flashing light above each, heading in a South Westerly direction. At first sighting, they seemed to be in a diamond pattern with a tail, as they co","Latitude":"37.357843","Viewing Distance":"Over One Mile","City":"Bedford","Disposition":"Unresolved","Date Submitted":"02/02/2012 10:09 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/35424.html.txt","/var/www/straped/mufon/org/35424.html"]}