{"map":"<A HREF = \"http://maps.google.com/maps?q=39.789111,+-89.642738(35432)&iwloc=A&hl=en\"> mufon case (35432) map </A>","City":"Springfield","Date of the Event":"01/29/2012 07:40 UTC","Sighting Duration":"Undisclosed","Case Number":"35432","Object Features":"Unknown","Region":"Illinois","Source":"MUFON","Disposition":"Unresolved","Log Number":"US-02032012-0003","divs":["Sighting DetailsWalking directly east on the sidewalk about 2 blocks from my house. My kid and dog were with me. We commented on the fair weather. It was a warm, breezy, hazy evening. I pointed back to the southwest and commented on the pretty moon. It had a beautiful pinkish aura and was perfectly cresent shaped. I then referred to the constellation Orion the Hunter, more to my south. It was bright and I could see all stars that I know of in the constellation, even the glow of his scabard, sweeping down from his belt could be seen, the tip of it was very bright. Sometimes it is hard to see every star in Orion and I thought that when we got past the tree that was blocking my view, I would be able to see both stars that mark his feet. A tree blocked his left foot from my right-sided view. My kid was chatting away about \"ya mom, Orion is the easiest constellation to see from the midwestern US......\". Right at that point in time is when I saw 3 giant pink orbs of light come into my view, directly into and below the star of Orions left foot. I stop and point. \"Look at that!\" Then is see about 5 or 6 more orbs of light. Dumbstruck, I freeze taking in what looked to me like 7 or 8 orbs of light that were in a V shaped flying pattern. The front orb of the V was pointing right at Orion's left star foot and began to move across the sky from my right to left. Another orb of brighter light joins them to form almost a perfect V of 9 lights and maybe a smaller dimmer one coming in. They were not flashing lights, more like a pulsating light. Most looked pinkish to me but, a few looked brighter and more yellow, though smaller. The ones flying in were smaller and very bright white until they got closer to the formation, joined it and then got more yellow. As it began to move, I was just astounded at what I saw as it stretched out across the width of Orions starred feet and it looked enormous! I was shouting \"Look, look, look at that!!\" The UFO had stopped almost dead on top of the feet stars of Orion and I realized that I was seeing the most enormous object I have ever seen in my lifetime. So, from my orientation, it spanned tip to tip between Orion's feet and after picking up the other couple of white then yellow orbs, started to move again! I am shouting \"Look at the lights, they are over his feet! Look, look they're moving! See, See?!\" I wanted for my kid to see this too! The UFO accellerated and kind of streaked off into the night sky and disappeared from my view. It had a pinkish glow and it went fast, leaving a beautiful pinkish trail of sparkly light that just kind of faded. It was beautiful. The whole sighting was probably about 30 or 40 seconds max. After it was gone, I kind of looked around, you know, to see if there were any car lights or lights or anything that could have been reflecting in my view. I wasn't wearing glasses. All is quiet, no cars,no people. We kept walking east, toward our block. I dismissed my kids suggestions that maybe I had seen a plane, or helicopter or jet fighter. I didn't hear anything. What I saw was none of those things. What I saw was so enormous, it is almost scary and that is why I keep referring to Orion's feet. That really gave me something to scale this object on and WOW! The thing that strikes me the most about this sighting is that the UFO was 3 dimensional to me. It was not just a flat set of big, bright dots in the sky. It was not as if I was looking thru holes punched in paper or at stationary stars. It was 3 dimensional. I have tried to draw it and I am no artist so it just ends up looking like a V with circles drawn inside of it. Too bad! I did some internet research and saw videos that are very similar to what I saw, some very recent. It is my Hope that this post helps someone else that may have ever had a similar experience. Thank you!<:"],"Object Shape":"Circle","Weather Factors":"Unknown","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around January 29th 2012"],"files":["/var/www/straped/mufon/html2text/35432.html.txt","/var/www/straped/mufon/org/35432.html"],"Summary":"V shaped pattern of round, pulsing lights. 5 or six pink and then 2 yellow and 2 white that flew in joined the formation, then changed to pink.","Date Submitted":"02/03/2012 01:20 UTC","Longitude":"-89.642738","Country":"United States","Object Flight Path":"Hovering then path,Path then hovering","Latitude":"39.789111","Viewing Distance":"Over One Mile","Tags":"City"}