{"Object Features":"Appendage(s), Wings, Unknown","files":["/var/www/straped/mufon/html2text/35431.html.txt","/var/www/straped/mufon/org/35431.html"],"Country":"Australia","Tags":"City","divs":["sighting detailsi was at home suburbs of melbourne, australia, (23 july 2009) taking photos of a new moon which was setting in the west just on dusk. i used a tripod and timed shutter on several shots. the camera was a sony alpha digital slr with a 300mm lens zoomed to infinity. settings were iso 400, o ev, f\\5.6, 2.5. i didn't notice anything at the time either through the lens or in the sky. last saturday i was looking through the photos and noticed the ufo in the last shot, taken 1min 10sec after the previous one. i hadn't viewed these shots on the computer screen until now. the object was clearly in the shot, it's hard to miss! when i first saw the object i immediately thought it was a massive ufo. the shot is focussed on the moon and the object is also in fairly good focus. i sent the picture to a photographer who assured me it was not an artefact of the camera. he also advised that the technical aspect of the shot makes the object an \"enormous distance\" away which makes it an enormous object. the object is extremely wide, seemingly much wider than long. i've seen shots of the iss in relation to the moon at a distance of 220 miles above the earth - this seems much, much bigger, though the distance is difficult to know. it has pointed 'wings' with a vertical pair of red lights close to either end and another pair of reds lights in the middle. in between each set of red lights are 3 white lights that appear to be higher on the object than the red lights. it is an unusual shape, seemingly curved between each set of red lights. examining the photo it appears that the object is travelling to the south-east, towards the bottom left of the photo. this is demonstrated in the pixel trail as well as the slight difference in distance between the left to middle red lights, which is longer than the middle to right red lights. i instantly knew that my camera had caught something big but spent a week examining, thinking, researching, ruling out camera defect, plane, other known aircraft. amazed that i'd had this shot on my computer for 2.5 years without knowing. also amazed at the minuscule chances of capturing an object like this by accident. i haven't lost sight of it - the photo's on my desktop!"],"Summary":"Extremely large UFO found in a photo I took of the moon.","Region":"Victoria","Latitude":"-37.806977","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Other","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"AU-02032012-0002","Source":"MUFON","Longitude":"144.97176","Case Number":"35431","Date Submitted":"02/03/2012 12:08 UTC","City":"Melbourne","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=-37.806977,+144.97176(35431)&iwloc=A&hl=en\"> mufon case (35431) map </A>","trends":["There have been 40 other sightings in Melbourne","There was one other sighting in Melbourne on or around July 23rd 2009","This sighting has been favorited 1 time.",""],"Date of the Event":"07/23/2009 06:53 UTC"}