{"Latitude":"37.77547","trends":["There have been 6 other sightings in Manteca","There were no other sightings in Manteca on or around April 15th 1978"],"Log Number":"US-02032012-0005","Date Submitted":"02/03/2012 03:24 UTC","City":"Manteca","Longitude":"-121.270685","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.77547,+-121.270685(35434)&iwloc=A&hl=en\"> mufon case (35434) map </A>","files":["/var/www/straped/mufon/html2text/35434.html.txt","/var/www/straped/mufon/org/35434.html"],"Case Number":"35434","Date of the Event":"04/15/1978 12:00 UTC","Object Flight Path":"Path with directional change","divs":["Sighting DetailsSitting on porch. (ON A SUNDAY in APRIL) Facing Stockton. Dog in lap. Dog gets animated. Couldn't keep her in lap, so put her inside. Ten minutes later, to my left, something flashed into the sky. I looked, and it seemed like it had stalled or slowed down. It was a huge thing. There was a white light on top, and two white lights on each side that were slightly smaller. There was a blueish- purple under belly that would be consistent with a saucer bottom. The under belly went from the small white lights on each side of the thing. The bigger white light on top made the thing almost look like a triangle, but the under belly gave it the saucer shape. I couldn't see a body on the craft inbetween. Maybe because it happened fast, or because it was dark out. It was a very clear, still night. So, when I saw this craft enter the sky it just appearead. No noise at all. It went north for about 4 seconds very clearly. It was quite close, maybe 1-2 miles from me, but huge. I watched it leave a short trail that evaporated quickly. It was strange that the trail was the same color as the under belly. Then it turned so fast, shot North east, but a little bit skyward, as soon as it turned and shot it looked like it went through the sky, because it just dissapeared completely. Leaving also the blueish-purple trail. I have listed this report with the national reporting in Washington state. I would love it if someone from the Stocton area would look into the archived news articles. I never got to see what they said. Maybe there's another witness, or witness testimony in the article that might match mine. I just wish I was clearer on the year. (my nephew was sitting next to me and saw everything also) I was around 12 then, and this has stuck with me my whole life. I don't really know yet if I've been cursed or blessed with this in my life. I remember seeing it as if it was 5 minutes ago. I wish everyone knew the truth. I have pondered the fact that the dog picked up the thing 10 full minutes before it showed up, and that a machine that hears what a dog can might pick these things up, or validate a video. I think they are using sound to navigate, and the dogs are hearing it. OK ..All done. I know people read this stuff and think \"WACKO's\", but if you told me to recant my experience or die, I'd laugh in your face and let you shoot me. Amen, and good will to all. I hope we are all on the same universal page SOON."],"Object Features":"Dome","Summary":"It was a Sunday in April- 1978, maybe 1979. In Stockton record paper on monday- allot of witnesses. Definately a ship. Haunted me my whole life. Awesome to see advanced technology in action.","Country":"United States","Region":"California","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Disc"}