{"Case Number":"35449","files":["/var/www/straped/mufon/html2text/35449.html.txt","/var/www/straped/mufon/org/35449.html"],"Weather Factors":"Unknown","Object Shape":"Star-like","Disposition":"Unresolved","Tags":"City","City":"Ripon","Latitude":"43.84538","Region":"Wisconsin","Summary":"White Star Light Over Ripon, WI","divs":["Sighting DetailsWas going out at around 5:36am to start my car before work and looked up into the sky to see stars as well as a much brighter object moving slowly directly above me. The object looked about 5 times bigger than a star and was moving east. I walked along my house as it moved trying to look for any flashing lights, etc. and concluded there where no flashing lights of any kind only a bright star like light. The object did seem to wobble from side to side as it moved instead of a straight point to point movement. I felt in awe because of military experience I have seen many planes, helicopters, and this was definitely none of them. There was absolutely no sound of any kind. The total experience lasted a total of 5 minutes as it kept moving till it was completely out of sight. The object did move slowly as a plane would move but was to low and to bright to be a plane considering there was no noise or flashing lights. Did not grab a camera since I would not have had enough time to put the battery in and start shooting video before it was gone, though I did have a cellphone I didn't not take a picture since the quality when have been beyond poor, I did however note the time."],"Date of the Event":"02/02/2012 05:36 UTC","Source":"MUFON","Object Features":"Unknown","Log Number":"US-02032012-0018","Date Submitted":"02/03/2012 03:18 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.84538,+-88.832527(35449)&iwloc=A&hl=en\"> mufon case (35449) map </A>","Country":"United States","Longitude":"-88.832527","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Ripon","There were no other sightings in Ripon on or around February 2nd 2012"],"Object Flight Path":"Straight-line path"}