{"Latitude":"33.575283","Disposition":"Unresolved","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around January 31st 2012"],"Log Number":"US-02032012-0018","Country":"United States","Object Features":"Unknown","Summary":"UFO Sighting at Rose Mofford Park over West Phoenix, AZ on 01-31-2012 at 3:30pm, 6 muted color orbs, cloaked surface","Weather Factors":"Unknown","Longitude":"-112.113283","Date of the Event":"01/31/2012 03:30 UTC","files":["/var/www/straped/mufon/html2text/35448.html.txt","/var/www/straped/mufon/org/35448.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cross","Tags":"City","Case Number":"35448","Object Flight Path":"Straight-line path","Region":"Arizona","Date Submitted":"02/03/2012 02:53 UTC","divs":["sighting detailson january 31st 2012, at 3:30 pm i decided to go from my home to clear my mind at a large park about two miles away from my home (very peaceful place). i was at rose mofford park located at 9833 n. 25th ave. phoenix, az (on 25th avenue just north of dunlap). this park generally has many people playing sports in the afternoon and some people having lunch or relaxing during the day. at that time of the day i had walked buy two full soccer games involving preteens and kids. i decided since i wanted peace and sunlight that i would avoid the soccer fields and go on the way to the running track area, which i did. i proceeded to lay down on the grass on the outside of the track on its west side. it was completely cloudless that day which is very typical of phoenix. i was affixed at looking into the sky as i did when i was a child... like looking at the clouds and guessing what they might resemble. that was my state of mind at the time. i soon noticed a small dot in the sky that could have not bee a plane by any stretch of the imagination. i looked a little deeper and thought it couldnt be a bird... no bird would ever fly so high alone that it was nothing more than a tiny black dot (size of a pin head or smaller). i chose to ignore that dot and decided to gaze at the whole sky rather just out of relaxation. i widened my gaze and the whole viewable sky and immediately came across something out of place... a formation of 6 semi transparent or muted color orbs forming a slightly unorganized cross system. one orb was a darker gray color and was bigger than the others, this orb was off center (top left of the cross intersection). this system of orbs moved slowly across the sky (as if quietly cruising) as one unchanging group. none of the orbs moved independently of the others. they moved as one system. in between the orbs it appeared just as the rest of the sky or completely transparent. i was baffled, but not surprised or skeptical to see this. this is the second time ive seen a truly unmistakable alien craft or ufo in the sky and dont regularly go looking for them at all. even my choice to go to the park to clear my mind in the middle of the day like that was absolutely out of character (been at leased a whole year since i did that type of thing). to debunk any skeptics, yes i was here when phoenix lights occurred but was not an eye witness in any way. for the record, that event doesnt & didnt cross my mind during this sighting. that event was never fresh in my mind since i had no personal attachment to \\ experience with it. with that said, the phoenix lights event has no bearing on my current experience. i was not looking for this sort of thing,... it just happened! my belief system as for phoenix lights is this: i believed it was true and happened physically as well as that it was a real space craft driven by either our govt or other intelligent species from within our galaxy. as said before, i actually was not an eye witness of the phoenix lights, but from all videos and said descriptions of the sighting from eye witnesses, this ufo that i saw had \\ was using what appeared to be the same type of cloaking technology where i could see the normal sky in between the orbs. also, this ufo appeared much higher in the sky and didnt form a chevron like the phoenix lights one did. in a nutshell, i 100% without a doubt know i saw an alien or possibly top secret government craft that was cloaked and peacefully traveling over west phoenix that day on junuary 31st, 2012 at 3:30pm in the afternoon. hopefully others might have seen it as well and can confirm it with me. i now fully believe that they are and have been here as well as everywhere among us for all of our known history. with an open and intelligent fact based \\ logical mind, you can still see them if you pay attention and simply accept that truth. they are physically here! maybe we are their experiment and future?... they may need us perhaps more than we need them!!"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.575283,+-112.113283(35448)&iwloc=A&hl=en\"> mufon case (35448) map </A>","Source":"MUFON","City":"Phoenix","Sighting Duration":"Undisclosed"}