{"Tags":"City","Object Flight Path":"Path with directional change","Region":"Pennsylvania","Disposition":"Unresolved","Latitude":"40.062036","Case Number":"35451","City":"Philadelphia","Source":"MUFON","Viewing Distance":"Unknown","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around December 21st 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsI went out on my deck to cover my grill up from cooking earlier at about 11 pm. After covering my grill I looked up to check out the stars. I'm a advid sky watcher so I looked east over my roof to look at the stars because there was a few clouds in the area and this area was clear. As I was looking I saw what looked like a star moving so as I stared at it and thought it was a satalite at first but then noticed it was five lights and had appeared to look like a formation. As I watched it move I yelled to my wife in the living room to come out to see this. I was very excited to see this, I've seen objects before. She didn't make it fast enough but I noticed as it neared the haze of the clouds it had a shape of a V. One light at the point and two on each angle, This was trianular shaped object moving slower than a commercial aircraft and made no sound. I don't know the altitude but seemed to be around the same as the clouds. As it turned North it disappeared into the haze of the clouds.I would not have noticed this object except for staring at this one point in the sky because it blended so well with the stars. The lights on the object were the same brightness as the average stars in the sky.Like I said I've seen objects before that I can't explain and I know aircraft well and satalites and this was unusual. I would like to know if anyone else saw this. I don't call the police because I did this once years ago and they didn't take me serious and I know what I saw.This is why I turned to you guys. Feel free to contact me if you have any questions. Thank you"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.062036,+-75.027924(35451)&iwloc=A&hl=en\"> mufon case (35451) map </A>","Date of the Event":"12/21/2011 11:05 UTC","Summary":"Slowly heading NW and slight turn to the North then disappeared into the haze of the clouds and made no noise","Sighting Duration":"00:01:30","Date Submitted":"02/03/2012 08:10 UTC","Longitude":"-75.027924","Weather Factors":"Unknown","Object Shape":"Triangle","Log Number":"US-02032012-0020","Country":"United States","Object Features":"Other","files":["/var/www/straped/mufon/html2text/35451.html.txt","/var/www/straped/mufon/more/35451_submitter_file1__Object.jpg","/var/www/straped/mufon/org/35451.html"]}