{"Object Flight Path":"Straight-line path","Summary":"One red light low in the sky to the east-southeast - over El Cajon , CA - not an aircraft","Case Number":"3545","trends":["There have been 2 other sightings in Santee","There were no other sightings in Santee on or around July 4th 2005"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/3545.html.txt","/var/www/straped/mufon/org/3545.html"],"Date of the Event":"07/04/2005 09:03 UTC","Object Features":"None","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.838383,+-116.973917(3545)&iwloc=A&hl=en\"> mufon case (3545) map </A>","City":"Santee","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Shape":"Star-like","Tags":"City","Longitude":"-116.973917","Region":"California","Log Number":"US-07052005-0001","Date Submitted":"07/04/2005 09:03 UTC","Latitude":"32.838383","divs":["sighting detailsi was in my backyard with my telescope (41x mag, 60mm refractor, f\\15) and a pair of 10x50mm binoculars to look for this very object(s) as seen last 4th of july at the same time in the same general area of the sky. i first spotted it a 9:03pm (sprint time on my cell phone) at approximately 123-degrees magnetic bearing from my location at approx. 7-degrees elevation. it was a bright, steady red light, comparable in brightness to that of the red navigation light on a small general aviation aircraft, of which there were two or three in the south pattern at gillespie field airport at the time. the color of red seemed slightly deeper than standard navigation light red. the object was moving very slowly but steadily from south to north and ascending slightly. after about 5 minutes, it began to flicker a bit. the flickering progressed with time to where at 9:15pm it was flickering as if a flame being blown by wind. no regularity to the flickering. at 9:17pm, the light flickered out as if it was a flame source that ran out of fuel. i watched it through the telescope as the last glimmer of its light flickered out...and it was gone. last bearing, 107-deg magnetic, 12-deg elevation. (based on alignment with polaris(north star) and subtracting local magnetic variation of about 14-deg.) its appearance through the telescope gave no more details than looking at a bright star through the telescope. there was no smoke trail visible as i might expect from a burning flare. flares can leave a smoke trail in the air that their own light will illuminate. there was no parachute or balloon visible that might have been illuminated by the light of a flare. no falling sparks visible. the 9pm local airport weather reports: montgomery fld - clear 64\\56 75% nw6 29.97r gillespie fld - clear 66\\55 68% calm 29.97r ramona - clear 59\\53 80% w6 29.98r winds aloft forecast for san 050600z (forecast period begins 2 hours after the event, but should be close): 3000 feet -- 320deg @ 7kts 6000 feet -- 280 @ 12 -- +22deg c 9000 feet -- 250 @ 17 -- +18deg c 12000 ft -- 250 @ 21 -- +11deg c 18000 ft -- 310 @ 09 -- -4deg c 24000 ft -- 270 @ 16 -- -17deg c 30000 ft -- 270 @ 24 -- -33deg c 34000 ft -- 280 @ 35 -- -41deg c 39000 ft -- 290 @ 34 -- -51deg c 45000 ft -- 290 @ 27 -- -63deg c 53000 ft -- 280 @ 14 -- -70deg c my guess is that this was some sort of smokeless flare or other high intensity red flaming device carried aloft by one or more black helium ballons. it may have been launched from the vicinity of grossmont college and carried to the east by light winds to over el cajon where it extinguished. last year i saw two such objects simultaneously, for the same duration, on the same date, at the same time, in the same general area of the sky. and those objects appeared and behaved the same. someone's pulling a prank."]}