{"Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Shape":"Sphere","Weather Factors":"Unknown","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around February 3rd 2012"],"Country":"United States","Longitude":"-77.033456","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"02/03/2012 08:20 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Log Number":"US-02042012-0005","files":["/var/www/straped/mufon/html2text/35463.html.txt","/var/www/straped/mufon/org/35463.html"],"Date Submitted":"02/04/2012 02:17 UTC","Region":"Washington","Tags":"City","Disposition":"Unresolved","Case Number":"35463","divs":["Sighting DetailsI let the dog outside at about 8pm and a light was in the sky towards the west of my house. I thought it was a bright star at first. Then the clouds started to move in and the light was under the cloud cover. Then I thought that it might be a rescue helicopter looking for someone in the Puget Sound, but this object didn't make any noise. This is the second time in a few weeks that this type of object has been here. It pulsated bright white to blue then to a reddish color then slightly green to a blueish green.It slowly moved to the west and was very bright then dim and the bright again. I kept saying that this must be a helicopter but it didn't seem to fly like a helicopter.It flew in relatively a straight line but would stop and hover,then become bright,From my vantage I watched this for an hr and a half. In this time frame it went from over the sound to the horizon and disappeared.Not sure exactly what it was, but thought it should be reported. Hope this helps, Thank You. Ps, I tried to take a video with my phone but it wasn't showing up very well!"],"City":"Washington","Summary":"Bright light that at first thought was a star, then clouds showed it was under the clouds. Bright pulsating light.","Latitude":"38.896782","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.896782,+-77.033456(35463)&iwloc=A&hl=en\"> mufon case (35463) map </A>"}