{"Viewing Distance":"Over One Mile","Region":"Oregon","divs":["sighting detailsat home in the early morning hours of feb 4 2012, my nephew and his wife returned from a family function and advised m of a strange multi-colored object in the sky.i expectd to see a star, planet or satellite. i went outside to try to see what they had described and observed a distant self illuminating multi color light-emitting object in the sky west\\southwest of monmouth oregon. the object was very distant, but clearly not a star or planet or other natural body. the sky was very clear, and once i had advised my sister to come outside to see it for herself, we decided to drive in the direction of the object to see if we could get a better view of it outside of the city proper and away from light pollution. the object exhibited some movement, but remained visible the entire time. we drove down highway 99, and followed airlie rd. to maxwell creek rd.we pulled over several times and shut the lights of the vehicle off, and through binoculars obseved what appeared to be a spherical craft with a constant bright white light, and randomly displayed green, red and blue lights. it moved back and fourth several times in a small area, but seemed to be hovering steadily at it's location. at this time we decided not to drive any farther from home, deciding that the object was getting bigger as we drove in it's direction, but not much. on our return drive home, my sister observed it disappear, not move off or fly away, just vanish. overall, six people we know of saw this object as it stayed in the sky for over a hour and a half between the hours of 1:15am and 2:30am the morning of february 4 2012. cell phone camera shots were not able to catch the object in a decent photo."],"Sighting Duration":"Undisclosed","Object Shape":"Flash, Oval, Sphere, Star-like, Unknown","Country":"United States","Log Number":"US-02042012-0006","Weather Factors":"Unknown","Date Submitted":"02/04/2012 03:55 UTC","Summary":"Self Illuminated Non Ballistic motion UFO West/Southwest of Monmouth-independence Oregon on Feb. 4 2012","Date of the Event":"02/04/2012 01:15 UTC","Object Flight Path":"Stationary","Latitude":"44.866228","map":"<A HREF = \"http://maps.google.com/maps?q=44.866228,+-123.435938(35464)&iwloc=A&hl=en\"> mufon case (35464) map </A>","Longitude":"-123.435938","Object Features":"Unknown","City":"Falls City","trends":["There have been no other sightings in Falls City","This sighting has never been favorited."],"Case Number":"35464","files":["/var/www/straped/mufon/html2text/35464.html.txt","/var/www/straped/mufon/org/35464.html"],"Tags":"City","Disposition":"Unresolved","Source":"MUFON"}