{"Case Number":"35468","Object Flight Path":"Stationary,Hovering then path","Latitude":"42.227298","Object Features":"Unknown","Longitude":"-121.782259","Country":"United States","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Region":"Oregon","Log Number":"US-02052012-0001","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.227298,+-121.782259(35468)&iwloc=A&hl=en\"> mufon case (35468) map </A>","Viewing Distance":"Over One Mile","divs":["sighting detailsi have been seeing a ufo every night now since 2\\2\\2012. i look up for ufo's once in a while but i haven't till recently i had a feeling to look out my kitchen window and i saw what i think is a ufo. i stand out on my deck by my side door and from there the craft seems to hover in a 240 degree westerly direction. it seems to be in our atmosphere to me. it had white, blue and some red light somehow coming off the object, looking at it with my binoculaurs almost seemed like it had electricity shooting from it which seemed to be how the light was emmiting from it, not sure. i think it could be hovering over keno which is the next town over. i could not really dtermine an actual shape but it seemed it could be spherical, diamond and or saucer shaped but not sure too far away. the last time it showed up 2\\4\\2012 at 7:40 pm to 7:58 pm. im in my house watching t.v. or working on science projects. i lost sight of the object due to a free-way over pass blocking my view when the object seems to go down towards earth. my video is not great but you have to watch out for the street light and a big rig truck wich passes by leaving streaking lights, just focus on the little light in the center of the screen, this is the object."],"Source":"MUFON","Date of the Event":"02/04/2012 07:40 UTC","Date Submitted":"02/05/2012 12:31 UTC","trends":["There have been 19 other sightings in Klamath Falls","There were no other sightings in Klamath Falls on or around February 4th 2012","This sighting has never been favorited.",""],"City":"Klamath Falls","Summary":"i keep seeing a ufo every night for 20 minutes","files":["/var/www/straped/mufon/html2text/35468.html.txt","/var/www/straped/mufon/org/35468.html"],"Object Shape":"Unknown"}