{"Country":"United States","Weather Factors":"Unknown","Date Submitted":"02/05/2012 01:12 UTC","City":"South Elgin","trends":["There have been 2 other sightings in South Elgin","There were no other sightings in South Elgin on or around February 4th 2012"],"Object Features":"Unknown","Longitude":"-88.305929","Date of the Event":"02/04/2012 11:37 UTC","Latitude":"41.972865","Object Flight Path":"Path then hovering","Region":"Illinois","divs":["Sighting DetailsI was in my driveway with a 60mm refractor that I just acquired this afternoon. I had just finished cleaning the optics and decided it was time for a star test. Everything was perfect. I had been looking at Mars, orion nebula and Sirius. I noticed a red light coming in over the tree tops, about 20 degrees over the horizon from my vantage point. I thought it was a plane and I decided to track it with the scope. I had a 25mm eyepiece in the draw tube. To my surprise the object was completely round, or so it appeared. It was a very bright reddish-orange color and appeared to pulsate in intensity as it flew from north to south. I tracked the object for well over a minute. I thought it might be some sort of blimp but the light was very intense. As it headed south and became smaller in my eyepiece it seemed to stop or hover in the distance. This object made no sound. I am used to tracking aircraft with my scopes and I never tracked anything like this, nor have I ever witnessed a craft like this. There were no flashing lights on the craft. Unlike the other aircraft in the area this one was totally different. As it flew south I noticed a commercial jet coming in from the west and wondered if the pilot had noticed the craft as well."],"Source":"MUFON","Summary":"Observed Bright reddish-orange light while stargazing","Object Shape":"Circle","Log Number":"US-02052012-0005","Case Number":"35472","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/35472.html.txt","/var/www/straped/mufon/org/35472.html"],"Viewing Distance":"Over One Mile","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.972865,+-88.305929(35472)&iwloc=A&hl=en\"> mufon case (35472) map </A>"}