{"Object Shape":"Egg, Sphere","Region":"District of Columbia","Object Flight Path":"Straight-line path","Summary":"Heard jet like sound looked up saw it travle left to right looked as if it just came through the atmisfear leaving a light trial going toward Washington Captial .","Latitude":"38.896232","Longitude":"-77.031596","divs":["Sighting Details I was going to the store for my mother @ about 7pm on southern ave. when i heard jet like sound. I looked up to see a dark grayish egg like object moving kinda quietly through the air. It looked like aburnet bricket from a BBQ flying through the air, leaving a trial but its shap was that of a foot ball a little fatter inthe middel. Their was a jet sound but not as loud an a after sound, the swishing of the air after it pased over head.I could see the burn on the object the little red hot spots in the frount a lessor amount toward the back. Their was no lights,windos or anything that I could say some one could look out of, or running lights for safty. It scared me so bade I ran back home as fast as I could . I have never saw anything close or near like it,but I know what something sounds like moveing through the air, I live right near andrews airforce base,an have ben to lot of air showes up front an pearsonal. So I do no what the after sound sounds like after the jets ingens sound has stopped an the swashing sound of the air makes after the object has passed by."],"Log Number":"US-02052012-0020","Country":"United States","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around September 15th 1963"],"Date of the Event":"09/15/1963 12:00 UTC","Date Submitted":"02/05/2012 01:47 UTC","Object Features":"Undisclosed","City":"Washington","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.896232,+-77.031596(35488)&iwloc=A&hl=en\"> mufon case (35488) map </A>","files":["/var/www/straped/mufon/html2text/35488.html.txt","/var/www/straped/mufon/org/35488.html"],"Disposition":"Unresolved","Case Number":"35488"}