{"Source":"MUFON","Case Number":"35492","divs":["Sighting Detailswe were heading west on county road G12 toward wilsons island state park around 9:00 p.m. to fish at the river. We saw a bright light directly in front of us. Couldn't judge the distance yet. Assumed it was a airplane just turning to land, as it was 20 miles north of epply airport. We kept heading straight as this road is about 5 miles long before it makes a slight right curve then straight again for another 2 miles. It is surrounded on both sides by farm fields. it's flat because it is old river bottom. A few farm yards along the road. After the slight curve and straight again is when we first thought it was strange because only now did it seem to be not moving. At the beginning of state ground (Wilsons island on the left, De Soto bend on the right) it turns forested on both sides. We slowed the car to about 5 m.p.h. and went directly under the object. I looked out the window and directly up. It was not a airplane but was a machine of some kind but DID NOT make any noise. It didn't seem to be moving. There are trees about 50 feet on both sides of the road so with the road I would estimate it's 150 feet between the trees and the object was well over the trees on both sides. I would guess it was 20 to 30 feet above the trees. Mostly old growth cottonwood around 80 to 100 feet tall. I ducked back in the car and the other person asked what it was and I said \"I don't know\" and we just went on. We turned left into the gates of wilsons but don't remember looking back. We went to the south west river access which has a fairly open view of the sky towards Omaha and I didn't see any airplanes headed there to land. It is strange that I didn't get out and get a better look because I don't remember being scared. I don't understand why I can't better describe it. After all these years I still remember heading towards it, looking up and seeing it, no noise, and just driving away, like it was no big deal? Another note about that night was the town of Missouri Valley had a huge main transformer blow and the town was without power over night. Missouri Valley is about 15 miles from Wilsons Island."],"Object Shape":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Unknown","Latitude":"41.248785","City":"Omaha","map":"<A HREF = \"http://maps.google.com/maps?q=41.248785,+-96.041029(35492)&iwloc=A&hl=en\"> mufon case (35492) map </A>","trends":["There have been 4 other sightings in Omaha","There were no other sightings in Omaha on or around June 15th 1994"],"Region":"Iowa","Summary":"saw bright light while traveling a long straight road.","Longitude":"-96.041029","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/35492.html.txt","/var/www/straped/mufon/org/35492.html"],"Date Submitted":"02/05/2012 02:49 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"Unknown","Date of the Event":"06/15/1994 12:00 UTC","Object Flight Path":"Stationary","Log Number":"US-02052012-0024"}