{"files":["/var/www/straped/mufon/html2text/35491.html.txt","/var/www/straped/mufon/org/35491.html"],"Tags":"City","Date Submitted":"02/05/2012 02:47 UTC","trends":["There have been 11 other sightings in Florence","There were no other sightings in Florence on or around January 14th 1977"],"Source":"MUFON","Latitude":"34.201593","City":"Florence","Summary":"quietly came over the tree tops","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Log Number":"US-02052012-0023","Date of the Event":"01/14/1977 12:00 UTC","Weather Factors":"Unknown","Longitude":"-79.761552","divs":["sighting details i was about 1977, i was on my way home from a friend home across the north carolina state line . i was driving a 1966 chevelet station wagon with the windows up and i suddenly notice an flying object coming across the tree tops and it was perfectly timed to fly directly over my car. what was so strange that it did not make one sound, lights were flashing so when i figured it has flown over the car their was a large field directly to my right so i look over to see what it was but i did not see anything. this happen in about 4 second. from it speed it should been visible in the field so when i look forward my headlight were so bright that i could see about 3\\4 mile down the road and that all i rememeber, but the next day which was on a sunday, i was awaking by my father checking the car because it had caught fire and burned. what i did't understand is i did't have any fuel in it. it was on empty. i think whatever it was that night put a device in there to torch the car. i have been visit twice more in my life time starting from about 3 years old another was about 12 years old which involved my father which he is still trying to get me to explain. i remember a cream white light not like a light bulb which was surrounded by a perfect blue fading light had me suspended and i came down from the ceiling and land on my father but i didn;t see what done it but what ever had me was not moving like humans. it was moving like a robot would left to right."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.201593,+-79.761552(35491)&iwloc=A&hl=en\"> mufon case (35491) map </A>","Viewing Distance":"21-100 Feet","Object Shape":"Circle, Disc","Country":"United States","Case Number":"35491","Region":"South Carolina","Object Features":"Other"}