{"Date of the Event":"02/03/2012 07:15 UTC","Log Number":"US-02052012-0027","files":["/var/www/straped/mufon/html2text/35495.html.txt","/var/www/straped/mufon/org/35495.html"],"Date Submitted":"02/05/2012 03:11 UTC","Summary":"Objects seen in Two Locations along BQE. 1st at Tip of Manhatten and then Hovering over Varrazano Bridge","City":"New York","Object Features":"Unknown","Object Shape":"Diamond, Flash, Oval","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around February 3rd 2012"],"Longitude":"-73.9611","divs":["Sighting DetailsI'm Driving toward Staten Island on the BQE (Brooklyn Queens Expressway). I've just past the Hamilton Avenue Exit in a section known as the Gowanus. I'm driving in the right lane, Parallel to the East River by the Southern Tip of Manhattan, where the Ferry's Launch. When I notice two Diamond shaped Lights Lulling over the River. Helicopters and Planes are flying by, it's 7:00pm. I'm driving, its Bumper to Bumper traffic and I'm looking to my right at these diamond shaped lights. There not moving. There's two of them, just sitting there above the River. It's like they're Floating in the Air. When all of a sudden, One at a time, the Diamond's Blink - Out. Like someone has a camera and just shot a picture with the Flash going off. The Diamonds are no more. Now its some sort of a Dark Sky colored Craft with an Oval shaped Dome on top with Green,White and Red lights blinking in succession around the Oval. I've just past the Prospect Expressway exit, continuing on the B Q E . I'm coming up to the 36th street Exit, all the time watching the oval green,white and red blinking lights, when the two objects start to rise up in the air. Slowly at first, then they rise at an enormous speed and Disappear in the heavens. I've just past the 36th street exit, on the B Q E when the traffic loosens up and I'm driving at 45mph. Then I notice, traffic slowing down to a stand still. The police are up ahead diverting Traffic to the left. There's a Car Accident near my Exit. I get-off at the 6th Avenue Exit. Again, I notice those Diamond Lights Floating off to the right. There are 2 to my immediate right and One in between these two High-Rise Buildings by the 6th Avenue Exit. Again, helicopters are flying by along with Planes. Cause of the traffic accident, there are Helicopters with their search beams on illuminating the Vehicles involved with the traffic accident.With all this going on, the three Diamonds are Lulling above the Copters. Its like they we're there watching the procedure of the police, Ambulance and the Helicopters. The helicopters are flying by them, below them and above them and they don't notice these Three diamond Lights in the Vicinity. All of a sudden, two of the Diamonds Blink-out & turn into the Dark Ovals with the Green,White and Red Blinking lights. They Rise in the air, straight up and Disappear at an enormous speed. The third Diamond, I observe, the one in between the Buildings starts moving toward the Verrazano Bridge. Where it links up with five other Diamonds floating above the Bridge. It takes a position equalateral to the others, Forming a Chevron Shape , above the Verrazano Bridge. Now I can see a total of six Diamonds, Not moving. They're just there, above and to the Right of the Bridge. I'm now waived on by the Police and immediately get off the B Q E at the 6th Avenue exit. The Exit is around 500 ft. from the Accident scene. I drive down the Ramp and make a Right onto 6th Avenue. The Diamond Lights in the Sky are Now out of my View. Looking back , It looked just like the Lights Seen in Phoenix . That Bowed Light above the City. I've seen these Diamonds on two other occasions in the past 3 months."],"Latitude":"40.701662","Case Number":"35495","Country":"United States","Sighting Duration":"Undisclosed","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.701662,+-73.9611(35495)&iwloc=A&hl=en\"> mufon case (35495) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path","Tags":"City"}