{"map":"<A HREF = \"http://maps.google.com/maps?q=30.16665,+-97.692757(35507)&iwloc=A&hl=en\"> mufon case (35507) map </A>","Case Number":"35507","Date of the Event":"02/05/2012 09:25 UTC","Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/35507.html.txt","/var/www/straped/mufon/org/35507.html"],"Longitude":"-97.692757","Log Number":"US-02052012-0038","Object Flight Path":"Other","Tags":"City","Summary":"Witnessed a very bright glowing orb descend on an arc-like path to ground","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMe, my neighbor and his 10 year old son had just finished watching the super bowl at my house. As we were standing out front of my house, looking south as we talked, a very bright green, almost laser-like green orb appeared out of nowhere at about 40 degrees in the horizon, traveling from the east to the west. The orb continued on an arc-like path toward the ground. Two houses down is a two story home and we lost sight of it as it fell. This object had no trail behind it, just a very bright green orb. Less than a half-mile from my home to the south is a Raytheon Space and Air Systems complex and it appeared to have fallen exactly at this place. My neighbor was looking away but his son and I saw the whole thing. This happened at approximately 9:30 p.m.. I am regularly seeing strange objects in the sky in north Texas but this is the first time I have reported any of them and it is the first time I have ever seen an object like this. There is no doubt in my mind that this object came down to the ground somewhere either on the Raytheon property or very close to it just south of my house."],"Weather Factors":"Unknown","Latitude":"30.16665","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/05/2012 11:09 UTC","City":"Austin","Disposition":"Unresolved","Region":"Texas","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around February 5th 2012"],"Source":"MUFON"}