{"Source":"MUFON","Summary":"Very similar to Brazilian UFO video of 1/12/12","Log Number":"US-02052012-0040","Date of the Event":"01/14/2012 12:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Sphere","City":"Pacific Grove","Country":"United States","files":["/var/www/straped/mufon/html2text/35509.html.txt","/var/www/straped/mufon/org/35509.html"],"Case Number":"35509","trends":["There have been 6 other sightings in Pacific Grove","There were no other sightings in Pacific Grove on or around January 14th 2012"],"Tags":"City","divs":["sighting detailslooking out of my bedroom window, i see across the southern and western most point of monterey bay in california. i see trees, the ocean, the mountains across the bay and a lighthouse from my sliding glass doors that lead from the bedroom to the deck. my wife and i have each had a sighting within the last year and a half. both were accompanied by our power browning out. my sighting of mid january this year is very similar to a video that was posted 1\\12\\12 at the website, \"the truth behind the scenes.\" this was filmed in brazil. yet, the lights looked at times almost exactly like those i witnessed. at first, i thought that someone had left their christmas lights up and perhaps a wind chime on my deck was reflecting them. the main reason i speculated this was that these lights appeared to be about a half dozen in a line, separated much like christmas lights on a string. and these lights were different colors. they also would appear for perhaps a minute, then go away for a similar period of time, only to repeat this many times. the entire sighting probably lasted at least twenty minutes. and this \"string\" of lights always was slanted at about 30 degrees to the right from straight down. if on a clock face and these lights made up the big hand, they would have pointed to the four. i tried to wake my wife, but she seemed as if she could not wake up. these lights would appear and disappear and i imagined that they might be a reflection from a spinning wind chime. however, looking the next day, there are no chimes in that area of our deck. after a considerable amount of time, they disappeared and did not reappear with the regularity they had been. then, very suddenly there appeared very bright yellowish lights just behind the trees that looked like they could be a low flying plane going down the beach to the south. however, there was no sound. if it were a plane, i would definitely have heard it as it was really quite close. i see planes approaching our airport all the time. they always approach from the same direction, which is also the direction these lights came from. and i always hear them when they are much farther away than these lights were. last but not least, as soon as this last object flew by, the lights in the room dimmed to a glow for just a few seconds. however, they looked just as they did when my wife saw her uso. at that time, oct of 2010, the brownout effect lasted almost an hour. i hesitate to report this due to our location and the many government facilities located in our area, such as the naval postgraduate school, the defense language institute, the monterey institute for international studies, and the fact that this is the home town of the u.s. secretary of defense, leon panetta. consequently, i suspect there is a better than average chance that if the government wants to clandestinely show off some new equipment, it is not unreasonable to assume it might show up here. i would not have made this report if not for that video i observed that looked so much like what i saw."],"Region":"California","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"36.624837","Longitude":"-121.906722","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.624837,+-121.906722(35509)&iwloc=A&hl=en\"> mufon case (35509) map </A>","Date Submitted":"02/05/2012 11:40 UTC"}