{"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cigar, Other","Date Submitted":"02/05/2012 06:27 UTC","Latitude":"46.001567","Disposition":"Unresolved","Summary":"coming home on US 12 at around 2am saw to my left, hovering about 500ft a long row of pulsating lights that suddenly rotated at a 90 angle.","divs":["Sighting DetailsIn November of 1998 I left my parents house to go home at around 1am. My younger brother had died a couple weeks before and I was going to spend the night with my mom who was severly depressed but my husband called to say our son was ill so I decided to make the hour and a half drive home. About 10 minutes into my trip home, I noticed an extremily bright, white light in the sky coming from the basic direction of where I was going. The road I was on was desolate and there was no other traffic so I found myself watching this light as I was driving. At first I thought is was a plane with it's front light coming toward me for I knew it was way too bright to be a star or planet. I noticed though that it was staying in the same place for the entire time I was driving on the back roads. It made me feel very uneasy but at the time I didn't know why. Coming off the main road I was taking, I started down a 5 lane highway going east. I saw the light was getting closer but that it was also growing dimmer. I knew there was no way that it was a beacon or tower for I had been steadily watching this light for 45 minutes. As I was coming closer to my exit I could see that this object was actually a row of bright pulsating lights of red, orange, yellow, blue, and green. I just remember being completely confused and fearful for as I stared at this object I almost drove into a ditch. Braking completely, I stopped on the side of the road just watching this thing trying to comprehend and understand exactly what it was I was seeing. As I watched for aprox. 1 minute the object suddenly started to rotate at a 90 degree turn. Whereas it was a horizontal object, it was now becoming vertical. This motion completely terrified me. I just knew immediately that what I was seeing was something unnatural and just the sheer unusualness of what it what doing scared me enough that I looked away, slammed on the accelerater and flew down my exit. I regret this decision for I have spent the last 14 years wondering what else this object did after I sped away, as well as what the object was to begin with. On my way home after seeing this I turned on the radio right away, flipping through stations, sure that I would hear something about what I saw. Even though there were no other cars that I remember seeing I was sure that someone, anyone must have been awake to see this object as well. When I got home I ran in the house to tell my husband what I saw and he immediately thought it was a helicopter or an airplane. I wanted him to drive back that night with me to see if it was still there but because of our son being sick we didn't. I read every line, everyday in the newspaper hoping to see that someone else had seen and reported it so that I could also come forward. But of course nothing. I know for a 100% fact that what I saw WAS NOT a conventional aircraft. I am not some crackpot looking for attention for I don't want any. I am a married woman with 6 children, no psychiatric problems, was not drinking or doing drugs, and was not tired or hallucinating the night I saw this. The main reason I have come forward after all this time is because of a UFO documentary that I was watching recently where I saw an incident in Texas where a man saw an object hovering in the sky. As a matter of fact when I saw the re-enactment of his object rotating at a 90% angle it kind of took my breath away for I am certain that what I saw was the same object. The one he saw split in two after becoming vertical but I don't know what the one I saw did because of my unfortunate decision to flee and not continue to watch. This incident is something that has bothered me for many years and it's frustrating to me that I don't know what it was to this day."],"trends":["There have been no other sightings in Walla Walla","This sighting has never been favorited."],"Tags":"City","Longitude":"-102.644909","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.001567,+-102.644909(35500)&iwloc=A&hl=en\"> mufon case (35500) map </A>","Case Number":"35500","Sighting Duration":"00:45:00","Region":"Michigan","City":"Walla Walla","Log Number":"US-02052012-0031","Country":"United States","files":["/var/www/straped/mufon/html2text/35500.html.txt","/var/www/straped/mufon/org/35500.html"],"Date of the Event":"11/15/1998 02:00 UTC","Object Flight Path":"Stationary","Object Features":"Unknown"}