{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsI was in my downtown Los Angeles loft looking out of my giant 12ft. windows. The sky's are perfectly clear on this Superbowl Sunday. I noticed what at first looked like a white balloon floating upwards in the distance. As I continued to watch this object, i noticed that it would stop and hover and then change directions as if something was guiding it. At one point it stopped and hovered then began to ascend directly upwards near a cloud. Then suddenly, another orb appeared however, it was flashing or blinking. As they moved closer to each other, several other orbs began to suddenly appear from out of nowhere. I couldn't believe my eyes. They all seemed to be communicating with each other while moving close to each other. I then noticed several birds, both black and white that were flying up near the orbs. The birds seemed to follow and notice the presence of the orbs as they would fly in the same direction of the orb as it moved about. I was able to record what I saw however, the video quality is very poor as I was using my nearby iPad2."],"Case Number":"35501","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Latitude":"36.781321","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/35501.html.txt","/var/www/straped/mufon/org/35501.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.781321,+-119.413932(35501)&iwloc=A&hl=en\"> mufon case (35501) map </A>","Region":"California","Longitude":"-119.413932","Object Features":"Unknown","City":"Undisclosed","Log Number":"US-02052012-0032","Weather Factors":"Unknown","Date Submitted":"02/05/2012 06:50 UTC","Tags":"City","trends":[],"Date of the Event":"02/05/2012 12:00 UTC","Source":"MUFON","Country":"United States","Summary":"White orb flying and changing directions, then joined by at least six others that where solid white/bright or flashing white.","Object Shape":"Oval, Sphere"}