{"Disposition":"Unresolved","Tags":"City","Latitude":"36.267591","trends":["There have been 2 other sightings in Gentry","There were no other sightings in Gentry on or around February 2nd 2012"],"Source":"MUFON","Object Features":"None, Unknown","Log Number":"US-02052012-0033","Date Submitted":"02/05/2012 07:54 UTC","Longitude":"-94.48114","map":"<A HREF = \"http://maps.google.com/maps?q=36.267591,+-94.48114(35502)&iwloc=A&hl=en\"> mufon case (35502) map </A>","City":"Gentry","Region":"Arkansas","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path,Path then hovering","Object Shape":"Boomerang","Case Number":"35502","Summary":"hovered. descended behind roof. moved off toward northeast.","Date of the Event":"02/02/2012 08:30 UTC","Sighting Duration":"00:02:20","files":["/var/www/straped/mufon/html2text/35502.html.txt","/var/www/straped/mufon/org/35502.html"],"Country":"United States","divs":["Sighting Details We were coming up our driveway roughly around 8:30 at night when we saw three distinct orange lights in a formation that looked like orion's belt head on. We shocked, so we neglected to take picture or film until afterwards. We thought it was and airplane at first. We (my son and I) stopped the car to see if there was any movement. There was absolutly NO movement whatsoever. At the distence we were, if the object were an airplane we would have at least seen a little bit of movement, even if it were coming at us head on. The object appeard to be hovering. as we continued up our driveway, the object dipped behind our roof. When we got to our car port, my son asked to be let out of the car. He then went to our back yard to get a better view. He told me that the object was descending and flying toward the northeast. He described the object as looking almost like a boomerang and flying smoothly, although not nearly as fast as a normal airplane. He said the object made absolutly NO noise. This is what made me relize that this was probably not an airplane, since as low as this object was there would have definatly been at least a low roar. My son said that he didn't feel scared, but he did have a bit of an eerie feeling. He described it as being in wonder of what the object was. He explained that the object had started moving when he got to where he could see it. He told me that it had started to move off toward the northeast and began to drop in altitude. When he told me this my suspicions began to rise again that this object was an airplane coming in for a landing, but he also told me that this object was changing direction irradically. We lost sight of the object when it disappeard behind the tree line. I feel sure it wasn't a helicopter as it had three lights in a boomerang formation. The object also shared few characteristicts with a plane. My son told me that from the side the three lights were almost lined up, the middle light barely being in front of the other two. We see lots of planes and we know how they behave, and this behaved nothing like one, nor looked like one. Our dogs normally bark if an airplane is going overhead, and our dogs didn't even notice this flying object. This object was different than anything we've ever seen, and felt that it needed reported."]}