{"map":"<A HREF = \"http://maps.google.com/maps?q=40.519772,+-74.645392(35513)&iwloc=A&hl=en\"> mufon case (35513) map </A>","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 8 other sightings in Hillsborough","There were 4 other sightings in Hillsborough on or around February 5th 2012"],"Summary":"strange light in sky that moved and changed direction","Disposition":"Unresolved","Country":"United States","Source":"MUFON","City":"Hillsborough","Latitude":"40.519772","Longitude":"-74.645392","Log Number":"US-02062012-0004","Date of the Event":"02/05/2012 11:45 UTC","Viewing Distance":"21-100 Feet","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Case Number":"35513","Object Features":"Unknown","Region":"New Jersey","divs":["Sighting DetailsMy wife was driving my truck home on Amwell Road traveling east when I noticed a glowing light out the front windshield of my truck. I aways watch the sky night and day and am very familiar with aircraft. This immediately looked strange to me , like a flare glowing orange. I said to my wife \"what is that\" and knew it was close because the perspective was moving very quickly to the drivers side of the truck threw the windshield. By the time she had time to look it was out of my line of sight ,but she was able to look out the driver side door window and see it. We pulled off into the parking lot of the Hillsborough High school and exited the truck to see if we could observer the object again. To our surprise the object, which seemed to be going the opposite direction of us was now traveling towards us. It could of been going in our direction the whole time but it would have been traveling slower then us because we over took it. When I stepped out of the truck and saw it again it did not appear to make any sound. I went back to the truck and turned it off and grabbed my camera to take some video. I took a couple of quick videos but is hard to make out with no perspective in them . My wife also used her cell phone to take a picture and a quick video. The object seemed to gain altitude and then went from a fussy glowing ball to small pin of light before disappearing into the night sky. I am very familiar with aircraft, stars, planets, meteors, and hoax chinese lanterns. This was not any of them. It did not appear to be an aircraft of any type either. It seemed to be a flare or light behind a cloud, but there where no clouds. It was also very close because the way it was seen from the windshield (far off objects do not travel across your field of vision that quick). I am sending 2 quick videos of the object and a quick video of some aircraft in the area. I am also wondering if any body else observed this"],"files":["/var/www/straped/mufon/html2text/35513.html.txt","/var/www/straped/mufon/org/35513.html"],"Date Submitted":"02/06/2012 01:27 UTC","Object Shape":"Fireball, Sphere"}