{"Region":"California","Log Number":"US-02062012-0007","Summary":"Large Cloaked Mothership, with surrounding cloud cover, directly below the moon","Tags":"City","City":"Long Beach","Country":"United States","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around February 5th 2012"],"Case Number":"35516","Weather Factors":"Unknown","Date Submitted":"02/06/2012 02:50 UTC","Object Shape":"Circle","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-118.182992","Date of the Event":"02/05/2012 10:30 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/35516.html.txt","/var/www/straped/mufon/org/35516.html"],"divs":["Sighting DetailsI was in North Long Beach, I was watching Battlefield LA, and on facebook literally writing a post about some kind of alien invasion scenario happening, before I finished writing I got a call from my buddy in San Diego telling me to go outside and check out the moon ( things seem to happen synchronistically like this), I went outide with my ex-wife, but didnt notice the circular object he was describing, my problem, I was looking at too small of a radius, after about 3 minutes I realized the cloud formation he was describing was in a larger area than where I was looking. It was completely translucent, but the perfectly circular clouds made its shape very clear, it was a giant perfectly formed donut cloud,with a huge open center. Very similar to the moscow and romania ufo sightings, but less dense and defined, with a much larger center and a thinner but larger radius of surrounding clouds.My ex-wife stayed outside watching it while I ran inside to get my dad. It was gone when I came back outside, and left a larger trail of clouds behind it. Also after the circular cloud dispersed I noticed a small UFO light ( probe or individual craft) where the center of the cloud previously was. The light was moving to fast and was too high up to be a plane, it wasn't flashing either. After that returned inside because activity ceased. The clouds lost there circular shape and drifted off, but they retained a perfect circle for the 10 minutes I observed it, and at least 15 minutes before my observation, by my friend in San Diego."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.858105,+-118.182992(35516)&iwloc=A&hl=en\"> mufon case (35516) map </A>","Latitude":"33.858105","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary"}