{"Region":"Indiana","Object Shape":"Sphere, Triangle","Object Flight Path":"Straight-line path","Object Features":"Unknown","Sighting Duration":"00:20:00","Country":"United States","Longitude":"-85.976667","Case Number":"3551","Viewing Distance":"Over One Mile","Date Submitted":"07/06/2005 10:30 UTC","Summary":"Dissappearing orange light, and more.","Latitude":"41.681994","Tags":"City","City":"Elkhart","files":["/var/www/straped/mufon/html2text/3551.html.txt","/var/www/straped/mufon/org/3551.html"],"Disposition":"Unknown","divs":["Sighting DetailsMy friend and I had decided to take a quick cruise on our motorcycles at about 10:15 pm. At approximately 10:30 we were coming up on the final turn onto our road. My friend was ahead of me. He made the turn, as I came up to it, I thought I saw an orange light out of the corner of my eye directly North of us. But, when I looked up, nothing was there. I looked back down, and saw my friend had shut his bike off in the middle of the street. I pulled up and asked him what he was doing. He said, \"Did you see that?\" I said, \"The orange light? Yeah, I saw it for a split second, but it was gone.\" He said that when he turned on our road he could see it for about a full second, and it simply disappeared. We made our way back home, and stood around in the driveway talking about what we had seen. About 5 minutes later (10:36 pm or so) we saw the light again. It was low enough to get lost behind some trees. It was about as large as if you held a pea out at arms length, and very bright. We ran out to the road to re-aquire the light. We watched it for about 30 seconds, it was North of us, heading south, right at us. It didn't seem to be traveling very fast. Then, like before, it disappeared. It didn't look like something was simply 'turned off.' It looked as if the light caved in on itself. We went inside to grab the video camera, sure that the light would return. We went back outside, and waited. We didn't see the orange light again, but, at about 10:45 pm to our disbelief we saw what appeared to be a triangle with a solid red light at each corner. There was no sound, and no flashing lights. It was traveling SE at a pretty high speed. Assuming it's altitude to be around 30,000 ft. I would say it was moving at about 500-600 mph, and would be much larger than an airliner. At this point, we realized the battery for our camera was dead. 30 seconds later, it was only visable as a small red speck in the sky, that faded to nothing. A few minutes later, my friend was in the garage, and I was standing just outside of it. I glanced over our house, and saw what I thought to be a very bright star. I looked away, thinking to myself I didn't remember seeing a star that bright in that position in the sky. I looked back and noticed it was moving north, slowly. As it moved it was dimming. By the time I yelled at my friend, and he ran out, it was about half as bright as it was origionally. We watched it slowly move north and fade in intensity for about 20 seconds. Before it was totally faded out, we observed a 'core', something solid the ligt was coming from. It simply was not visable once the light had dimmed completely. We were scared through each of these observations. I am unsure of what, but, there is definitely something going on out here. This is not the first time that I have seen strange things in the sky in recent months. I have seen things by myself, as well with one or two witnesses (my room mates)."],"trends":["There have been 12 other sightings in Elkhart","There were no other sightings in Elkhart on or around July 6th 2005"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.681994,+-85.976667(3551)&iwloc=A&hl=en\"> mufon case (3551) map </A>","Log Number":"US-07072005-0001","Date of the Event":"07/06/2005 10:30 UTC","Source":"MUFON"}