{"Sighting Duration":"00:20:00","Country":"United States","Object Flight Path":"Straight-line path,Other","Disposition":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Case Number":"3552","Region":"Illinois","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/3552.html.txt","/var/www/straped/mufon/org/3552.html"],"Tags":"City","trends":["There have been 2 other sightings in St. Louis","There were no other sightings in St. Louis on or around July 5th 2005"],"Summary":"From N.W. to S.E. A huge fire ball Drifted across the sky then dissapeared. 5 minutes later 5 lights drifted from S.E to N.W.","Object Features":"Other","Date of the Event":"07/05/2005 12:00 UTC","Date Submitted":"07/05/2005 12:00 UTC","Log Number":"US-07072005-0002","map":"<A HREF = \"http://maps.google.com/maps?q=38.610543,+-90.337189(3552)&iwloc=A&hl=en\"> mufon case (3552) map </A>","City":"St. Louis","Latitude":"38.610543","divs":["Sighting DetailsI just got home from Work. The time was 11:34 P.M. I got out of my car and noticed how unusually illuminated the sky was. I was way to captivated by the stars to take my eyes off of them. I observed the sky mostly to the N.E. direction because that was the most illuminated by the stars. 5 to 10 minutes into my star gazing i saw a fireball go from the N.W. direction in a straight path to the S.E. I had my suspicion that it may be something burning in the earths atmosphere, but held my suspicion due to the size, speed, and the fact that I never witnessed this before. Approximately 5 to 10 minutes later I saw 5 brightly lit, but unusually illuminated objects fly from the S.E. to the N.W. They seemed to have more of a \"glow in the dark effect\". There was absolutely no sound and the light seemed to have a mirage effect, kind of like when cool air meets hot air. I had a really hard time determing the size or distance of these objects. They flew close togeather but moved so erratically seperate from each other i had little doubt that these lights were not one object but 5 seperate entities. I don't know what i saw. I just wanted to report this to mufon just in case someone else notified you of this sighting. When i seen the objects I got excited ran in my house and tried to wake my wife up to observe the lights. She did not wake up. so i walked out the back door and continued to watch the lights until they seemed to just disapear. This all happened so fast i did'nt know what the hell to do. This experience changed my life dramatically."],"Longitude":"-90.337189","Object Shape":"Boomerang"}