{"divs":["Sighting DetailsMonday Feb 4, 2012. I was getting ready for work when I looked out the back window (facing south). It was 4 AM and I was going to check the weather outside. I noticed a faint star moving along the horizon and then it started to ascend at an angle towards the east. It was moving like a skater would when he pushes off with one skate and then coasts to a stop. Then another pulse of energy and a coast to a stop. Then I noticed 2 more in the sky doing the same type of motion. I watched them for about 5 to 8 minutes. This is my 5th confirmed sighting in the last 2 years. Just then a brighter light lifted off from what appeared to be the International Airport located near Leduc,south and west of me. This I though may be an airplane and was wondering if the ufo's would react to it. To my amazment the bright white light started moving straight up an in less than one second it arced over my location, flying over top of Sherwood Park, headed north. As it flew over my house it changed from white to red and was gone. I have seen these things before, but as single entities. Seeing so many at once I felt vulnerable and frightened."],"Weather Factors":"Unknown","Longitude":"-113.2705","Sighting Duration":"00:10:00","Country":"Canada","Case Number":"35520","map":"<A HREF = \"http://maps.google.com/maps?q=53.521865,+-113.2705(35520)&iwloc=A&hl=en\"> mufon case (35520) map </A>","Region":"Alberta","Latitude":"53.521865","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/35520.html.txt","/var/www/straped/mufon/org/35520.html"],"Summary":"4 UFO's south of Sherwood Park searching or observing","Viewing Distance":"Unknown","Date Submitted":"02/06/2012 08:02 UTC","Disposition":"Unresolved","Log Number":"CA-02062012-0011","Object Features":"None","Date of the Event":"02/06/2012 04:00 UTC","Tags":"City","City":"Sherwood Park","Source":"MUFON","trends":["There have been 21 other sightings in Sherwood Park","There were no other sightings in Sherwood Park on or around February 6th 2012"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}