{"Country":"United States","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around September 18th 2011"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.691495,+-98.490108(35528)&iwloc=A&hl=en\"> mufon case (35528) map </A>","divs":["Sighting DetailsI was relaxing out on the patio, just sitting and taking in the view. I live in a midrise apartment building on the third floor, in a hilly area of San Antonio. My balcony faces the south and I enjoy sitting and just looking at the hills and the sky. One night, I believe it was around the middle of September of 2011, I noticed a search light panning the sky; I am guessing it was around 11pm or so. The light was going back and forth only about 15 degrees horizontally, just sort of lighting up a cloud formation; it was an interesting cloud but I cant recall its features. I just sat there and whatched to cloud slowly shifting its shape as the light scanned through it back and forth. After about 10 minutes or so, a bright sphere just appeared out of nowhere off to my right and at about the same elevation as the clouds. The area it came from was cloudless as the night was only partly cloudy. The objest was a creamy white and kind of blue green as I remember; it was about half the size of a BB in my perspective. The object appeared travelling at a very high rate of speed, made kind of a semi-circular loop and zipped into the middle of the cloud that the search light was panning (painting?). The object then just dissappeared as fast as it appeared, the entire incident (the orb or whatever) lasted only about a second, if that. What was really odd was that immediately after the object dissappeared into the cloud, the search light ceased. I was not freaked out at seeing what to me was obviously an unidentifiable object in the sky (no aerospace technology I am aware of can manuever like that), I just thought it was kind of cool, like seeing a random shooting star. What was eery, and what I had failed to consider until immediately afterwards, was the search light ...it was horizontal, not vertical, and there was no platform, no manmade or other structure for it to be fixed to unless it was on a helicopter, but it was too powerful and broad of a light path to be mounted on a helicopter. This would have had to been a full size light, the kind used to light up the sky at a big sales event or something. I leaned over my balcony at that point to see just where the light had be coming from and wondered ***??? Now THAT was strange. There was no-where, at least that I could determine, that this light could have emanated from. My conclusion was that the UFO or whatever it was, was anticipated and the light in the sky was giving it a vector, showing it where to go. It has been months since this happened and I have not observed a horizontal search light since. I stated above that there was a plane overhead but I cant say I remember one, which is due mostly to the fact that I live under a very busy flight path for the San Antonio Airport, jets are always going overhead. Let me be clear: I have always whatched the skies, even as a child, thats just something I do; I know the difference between a man-made (not to include classified and secret) air ship and an anamoly, I also know a meteorite when I see one ...this was niether. It had a smooth flight path, was bright but not too bright, it appeared, swooped around and into the cloud and vanished, all in the blink of an eye. And just where did the spot light come from??? If I had known about this organization back then, I would have reported it immediately, while it was still fresh in my mind."],"City":"San Antonio","Weather Factors":"Unknown","Log Number":"US-02062012-0015","Longitude":"-98.490108","Summary":"A small bright sphere appeared out of nowhere, made a semi loop and disappeared into a cloud that was being hilighted by a horizontal search light.","Object Features":"None, Unknown","Disposition":"Unresolved","Region":"Texas","Date of the Event":"09/18/2011 11:30 UTC","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Path with directional change","Sighting Duration":"00:10:00","Case Number":"35528","files":["/var/www/straped/mufon/html2text/35528.html.txt","/var/www/straped/mufon/org/35528.html"],"Date Submitted":"02/06/2012 05:33 UTC","Latitude":"29.691495","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown"}