{"Object Flight Path":"Stationary,Hovering then path","City":"Springfield","files":["/var/www/straped/mufon/html2text/35536.html.txt","/var/www/straped/mufon/org/35536.html"],"Date Submitted":"02/06/2012 10:18 UTC","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Country":"United States","divs":["Sighting DetailsWhile walking my dogs to the park on the morning of February 5 2012 at 10:17am I observed 4 spheres hovering high in the sky. While taking a break from walking my dogs and trying out my new app on my Iphone (Flightware) to track GA and commercial aircraft at the various airports i fly out of (i'm an avid and longtime pilot), I noticed a Citation heading north over Springfield Massachusetts. To see how acurate the application was, I was able to track all it's flight information, heading, speed, altitude, orgin and destination. In my field of vision of the aircraft, something else caught my eye. At what i beleive was well above 25k Ft i obdserved a very large glowing orb stationary in the southwest sky (initially mistaken for a planet or a star in the moring sky-CAVU conditions). On the large glowing opaque sphere, i noticed what looked like a darker (black) band around the center. Seconds later a smaller orb appeared out of thin air directly next to it, then another, then another and possibly several hundred feet ahead, yet another glowing sphere ( 4 total). The orb closest to the larger craft, started a slow and steady orbit around it for one full and complete orbit to only join the craft (looked like it must have either joined or was absorbed by the larger craft). Seconds later, in unison all three remaining craft started a slow and steady acceleration to the southwest until it was out of my sight. I made notes, and times of the event and wrote down any and all details. I also checked all air traffic in the area and there where no flights regestered on that path or altitude (flightware application). No aircraft where in the area. These where not stars, planets, helicopters or mylar balloons. These where controlled craft. I'm submitting my report in hopes that there where other witnesses."],"Date of the Event":"02/05/2012 10:17 UTC","Disposition":"Unresolved","Latitude":"42.106183","Longitude":"-72.588621","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.106183,+-72.588621(35536)&iwloc=A&hl=en\"> mufon case (35536) map </A>","Log Number":"US-02062012-0023","Weather Factors":"Unknown","Region":"Massachusetts","Object Features":"Undisclosed","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around February 5th 2012"],"Summary":"witnessed 1 large sphere in the sky along with 3 smaller orbs hovering, then moving across the sky at high altitude","Source":"MUFON","Case Number":"35536","Tags":"City"}