{"Summary":"I thought it was a comet. I was shaped like a tear drop and sped across the sky. I saw bright purple and red. Finally, it disappeared and before it did do, it left what looked like purple fireworks.","Object Shape":"Egg, Teardrop","Sighting Duration":"00:00:30","Viewing Distance":"Unknown","Case Number":"35535","Region":"New Jersey","Log Number":"US-02062012-0022","Date of the Event":"02/03/2012 10:00 UTC","Weather Factors":"Unknown","Latitude":"39.363646","Country":"United States","City":"Atlantic City","files":["/var/www/straped/mufon/html2text/35535.html.txt","/var/www/straped/mufon/org/35535.html"],"Object Features":"Unknown","divs":["Sighting DetailsI was in my apartment on the 8th floor in the living room facing my window. The object fled across the sky so fast and the colors were so bright, I couldn't help noticing it. When I first saw it, I shouted to my husband- \"It's a comet!\" I thought it was a comet because I saw a tail as well. It sped across the sky shining bright purple and red colors. Before it disappeared, it left behind what looked like fireworks. I got up to look out the window at a closer range, but I could see nothing. My first reaction was to call 911 and see if others had reported seeing it. The operator said no reports had been made. Then I called the local TV station- TV 40 and asked if they had had any reports, and if the weather dept. knew of any activity, or meteors in the area. They checked and said no- that there had no been any reports of meteors or other activity. I realized a comet or meteor could not be seen by the naked eye, so I was puzzled. Yesterday, Feb. 5 I called the air force and left a message about what I had seen and to inquire if there had been any reports about meteors to their knowledge, but have not heard back. I made a rough drawing of the object, but I do not have a scanner in order to forward it to you at this time. I'll keep the drawing on file if you wish to see it."],"Date Submitted":"02/06/2012 08:58 UTC","Object Flight Path":"Path with directional change","Longitude":"-74.422618","map":"<A HREF = \"http://maps.google.com/maps?q=39.363646,+-74.422618(35535)&iwloc=A&hl=en\"> mufon case (35535) map </A>","trends":["There have been 15 other sightings in Atlantic City","There were no other sightings in Atlantic City on or around February 3rd 2012"],"Disposition":"Unresolved","Source":"MUFON","Tags":"City"}