{"Object Features":"Unknown","Weather Factors":"Unknown","Tags":"City","Log Number":"US-02062012-0017","City":"Joplin","Latitude":"37.009232","Region":"Missouri","trends":["There have been 11 other sightings in Joplin","There were no other sightings in Joplin on or around February 5th 2012"],"Summary":"A triangular object with an estimated 3 bright white lights that blinked off and on. Object hovered for a few seconds, then darted off to the left very quick, and then completely disappeared.","Date Submitted":"02/06/2012 07:06 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date of the Event":"02/05/2012 11:25 UTC","divs":["Sighting DetailsMy friend and I were just leaving a friends house after the Super Bowl. We pulled out of his driveway, and that is exactly when him and I saw the light hovering over the woods about less than a mile away from us in the West. We started driving South, down the road, which intersects Reinmiller Road. Right when we reached the end of the road it darted off to the left extremely fast. We tracked it for just a few seconds before it disappeared. So then we thought maybe it was a helicopter, so we drove further down Reinmiller to see if there was any sight of it, but no, there wasn't any sight of it. It was gone. There were no lights in the sky. Then we thought it was maybe a airplane that had flown into cloud cover, but then we told each other that it was a clear night; just stars in the sky. I've had one sighting similar to this, this past summer in July. I don't exactly like to talk about it, due to people never believing me. But what I saw last night was very interesting. It was weird how the object went to the left for about 10 seconds and then completely disappeared. We couldn't exactly tell what color it was, but noticed it was more triangular shaped and it had about 3 lights on it that blinked off and on. The lights were a bright, white color. This recent sighting was the most convincing of the 2 total sightings I've had in Joplin. I always hope that someone else saw what I saw that night, because it's very annoying when no one seems to believe you."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/35530.html.txt","/var/www/straped/mufon/org/35530.html"],"Object Shape":"Triangle","Object Flight Path":"Hovering then path,Straight-line path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.009232,+-94.443672(35530)&iwloc=A&hl=en\"> mufon case (35530) map </A>","Longitude":"-94.443672","Source":"MUFON","Case Number":"35530"}