{"divs":["Sighting DetailsAt about 6:23 pm I,and a friend was looking toward the south at Venus, Jupiter and Orion, enjoying the view. I noticed what I thought was a dim satellite about 1 degree above Saiph in Orions foot. I pointed this out to my friend. The object was moving like any other satellite. It appeared to be moving from the Southeast toward the northwest and traveled about 1 degree before it faded out. This object was very dim, about magnitude 4 or so, although it may have been brighter but for the almost full moon. Then the object faded from view. Immediately, as this object faded, another starlike object about magnitude -2 or so appeared below Saiph. I told my friend that the object we were seeing did not belong there. It was brighter than Sirius. It did not move. As I watched in disbelief, another smaller object appeared (again about magnitude 4 or so) about a half degree away from the bright object and moved slowly away, toward the northeast. The objects then both faded away together. As an amateur astronomer, I know the sky with some detail. What I saw was not a star, planet,airplane, helicopter, or satellite. I am reporting this in the hope that others also witnessed this event. Thanks,"],"trends":["There have been 22 other sightings in Olympia","There were no other sightings in Olympia on or around February 6th 2012"],"Tags":"City","Disposition":"Unresolved","Object Features":"None","Summary":"observed starlike object about 2 degrees below Saiph in Orion. Object did not move but two much smaller objects were associated with the main object. Main object was as bright as Jupiter.","City":"Olympia","Longitude":"-122.89905","Sighting Duration":"00:03:30","Region":"Washington","files":["/var/www/straped/mufon/html2text/35538.html.txt","/var/www/straped/mufon/org/35538.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=47.037552,+-122.89905(35538)&iwloc=A&hl=en\"> mufon case (35538) map </A>","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"02/06/2012 06:23 UTC","Latitude":"47.037552","Viewing Distance":"Unknown","Object Shape":"Star-like","Log Number":"US-02062012-0025","Case Number":"35538","Object Flight Path":"Stationary","Date Submitted":"02/06/2012 10:33 UTC"}