{"trends":["There have been 4 other sightings in North Miami Beach","There were no other sightings in North Miami Beach on or around January 7th 2012"],"Object Shape":"Cylinder, Fireball","Region":"Florida","Date Submitted":"02/06/2012 10:28 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/35537.html.txt","/var/www/straped/mufon/org/35537.html"],"Log Number":"US-02062012-0024","Longitude":"-80.154806","Disposition":"Unresolved","Object Flight Path":"Straight-line path","City":"North Miami Beach","Summary":"My boyfriend & I were witness to this sighting, we have never seen any aircraft that looked like this object.","Latitude":"25.934329","divs":["sighting detailsmy boyfriend & i live on a 7th floor condo a couple of miles from the beach, our balcony faces southeast. on this particular saturday just about 6:30 pm the weather was so nice we had turned off the a\\c and opened all the windows and balcony to let some fresh air in. we had the tv on sitting on the couch with our balcony to our left. i don't to why but, we both looked outside to the sky at the same time, which is strange considering we were sitting on the couch really just watching tv. we both spotted this white round light which had a long white bright tail, both of us exclaimed \"wow!\", it was so bright it actually lit up the sky (clouds) as it travelled south east over the ocean. after about 5 seconds it disappeared. we were left wondering what it was. we are very used to air traffic and recognize the blinking lights from airplanes but, this was a light with a long tail, quite large. to add to this mystery on the following night, again taking advantage of great weather... my sister, boyfriend & i were sitting outside on our balcony. we were telling her the story, again around the same time (6:30 pm), actually we were pointing in the same direction of where we saw this thing the night before and just as we are pointing up at the sky, my sister says \"what's that???\" and we all see this smaller round object and it streaks accross the sky again in the same general direction. this one was a lot smaller. was this a meteor, it certainly looked like it could have been, but what are at the chances of seeing something 2 nights in a row? after the weekend i return to work and tell a co-worker what happened. she tells me that her & her husband were on the beach on saturday night and they saw a large white light and thought it was a falling star and she \"made a wish\". i would sure like to know if others may have seen the same thing we saw..."],"Source":"MUFON","Date of the Event":"01/07/2012 06:30 UTC","Country":"United States","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=25.934329,+-80.154806(35537)&iwloc=A&hl=en\"> mufon case (35537) map </A>","Tags":"City","Case Number":"35537"}