{"divs":["Sighting DetailsI observed a star-like large object near the star(s) Saiph or Rigel, unsure of which one, in Orion. It was slightly larger in size than this star and equally as bright. It was moving very slowly and then it quickly faded into a very tiny light, the size of a satellite passing in the sky, and then quickly disappeared. I observed the object for a few more seconds once the light had become small in size and then it was gone from my sight. It's general slow direction was from roughly E to W. I noticed the object as I was looking up at Jupiter, then Orion and other stars. It simply caught my eye as not being part of Orion. I first thought that I was seeing the headlight of a large jet, as I live near a Naval Air Base and often see large passenger jets flying between Seattle, WA and Vancouver, BC. However, I listened for quite a while for any jet noise and heard nothing. There was also very little (5%) sky cover at the time of my observation. However, when the light got so small suddenly, like a satellite, I questioned what I was observing. I am a bit of a skeptic when it comes to UFO's and have never seen any object in the sky that I can't explain. I am not quick to jump on a UFO band wagon without a large amount of proof. Tonight when I googled what I saw and read that others had posted a similar observation, I decided to post this sighting. This is the first and only time I have ever questioned any sky observation and deemed it potentially unexplainable. I do believe in the potential and overall likelihood of life outside of our planet and solar system. After tonight, I am very anxious to find out if what I saw was an airplane or a perhaps as satellite that was reflecting light from the moon? I would be much more excited to know that I actually saw a UFO!"],"City":"Friday Harbor","Disposition":"Unresolved","Case Number":"35543","Object Features":"Unknown","Latitude":"48.50309","Log Number":"US-02072012-0002","Longitude":"-123.0521","Weather Factors":"Unknown","Region":"Washington","files":["/var/www/straped/mufon/html2text/35543.html.txt","/var/www/straped/mufon/org/35543.html"],"Object Flight Path":"Stationary","Date of the Event":"02/06/2012 06:30 UTC","Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=48.50309,+-123.0521(35543)&iwloc=A&hl=en\"> mufon case (35543) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Circle, Star-like","trends":["There have been no other sightings in Friday Harbor","This sighting has never been favorited."],"Country":"United States","Date Submitted":"02/07/2012 12:42 UTC","Summary":"Bright light in Orion near the star(s) Saiph or Rigel, that quickly faded to a tiny pin-prick and disappeared","Tags":"City"}