{"files":["/var/www/straped/mufon/html2text/35549.html.txt","/var/www/straped/mufon/org/35549.html"],"divs":["Sighting DetailsSince about Saturday 2-4-2012, i have noticed aroud 645-7 a odd acting \"star\" compared to all the other stars i can see, this one seems to eminating some sort of multiple color rapidly. I cannot tell distance, but the best way to describe is the star effect used on lights with cameras. Althgouh the peaks the shoot out of the \"Star\" seem like some sort of reaction to moisture in the air. However, this object is always in the same spot. Even as the moon has moved the object is stationary. I can be sure of this because of how my apartment is situated. The moon always is stuck between the backdrop inbetween these two house. So i use it for reference points. Yesterday as i was looking at it, i could not stop. I found mysel fout there with no jacket for about 25-30 mins before i went back in side. I have noticed some other reports on here of something similar. Just find it interesting. Id take a picture but the camera phone will not do it justice, id need a super hi def recorder. If anyone lives in Rhode Island see if you can spot it tonight, im pretty sure it will be there. So it is possible it is simply a star that I hadnt noticed, but it still is worth the mentioning."],"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.990875,+-71.523219(35549)&iwloc=A&hl=en\"> mufon case (35549) map </A>","Case Number":"35549","Date of the Event":"02/06/2012 07:00 UTC","Country":"United States","Date Submitted":"02/07/2012 12:12 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-71.523219","Latitude":"41.990875","Summary":"3 days this has been there, it looks like a star eminating tons of typical star like features","Region":"Rhode Island","Log Number":"US-02072012-0008","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","City":"Woonsocket","Disposition":"Unresolved","trends":["There have been 10 other sightings in Woonsocket","There were no other sightings in Woonsocket on or around February 6th 2012"],"Tags":"City"}