{"Summary":"Round, 150-200 ft diamater, luminated different colors of lights,fast, no noise","Latitude":"32.978657","map":"<A HREF = \"http://maps.google.com/maps?q=32.978657,+-115.530267(3554)&iwloc=A&hl=en\"> mufon case (3554) map </A>","files":["/var/www/straped/mufon/html2text/3554.html.txt","/var/www/straped/mufon/org/3554.html"],"Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Disposition":"Unknown","Case Number":"3554","City":"Brawley","Region":"California","Date Submitted":"08/31/1992 12:00 UTC","Longitude":"-115.530267","Sighting Duration":"Undisclosed","Object Features":"Dome","Date of the Event":"08/31/1992 12:00 UTC","Object Shape":"Disc","Country":"United States","Weather Factors":"Unknown","Log Number":"US-07072005-0004","divs":["sighting detailsi was 12 years old i went night fishing with my brother and 4 friends ages ranged from 12 to 18 years old. we walked about 3 miles out of town it was around 9-10pm. it was very quiet and dark, my 2 friends and i left to a different fishing spot while my brother and 2 friends stayed in the same fixhing spot like 1\\4 of a mile apart from we were.while we were fishing a round object with bright lights with different colors out of nowhere stoped very fast across the road approx 400 yards away from us (very close)and it hoverd low over a field 200ft of the ground for 1 min. it dropped around 50ft so fast and hovered with no noise for 2 min we did not speak to each other we just stared at the object i was asking my self what is that i never seen any thing so fast.and i had a feelimg as if somthing was after the object. after it hovered it left so fast that i remember seeing streaks of lights behind it. after the object left my friends and i began to walk back to my brother and my other friends, as we approached my friend alex he asked us \"did you see that shit\" i was scared and wanted to go home my friends were acting as if they were no scared but i think they were. my mom picked us up down the road from we were at earlier and we told her right away. we got home and i told my dad with exitement becuase i was not scared any more. ever since that day i have had special interest and researched ufo's."],"trends":["There have been 4 other sightings in Brawley","There were no other sightings in Brawley on or around August 31st 1992"],"Tags":"City","Source":"MUFON"}