{"Source":"MUFON","Latitude":"35.136356","Weather Factors":"Unknown","Region":"Oklahoma","divs":["sighting detailslet me say first i thought my report was submitted, but it didn't send. on january 18th between the times of 20:20 and 20:30, i was out on my back deck with my girlfriend and our daughter. i saw a cigar shaped object with two orange\\yellow lights. the lights appeared large and one was in the mid front of the object and one was toward the mid back. the object moved quickly on a very flat trajectory as if on a line. we watched the object as it went across the sky from the southeast to the northwest. the object was low in the sky at about 500 feet or less. it made no sound. the object behind it did make a lot of noise. a jet appeared to be chasing this object. the jet was as low and on the same flight path as the object. the jet was about a half a mile to three-quarters of a mile behind the object. it was so loud and low all the dogs and coyotes in the area started howling. we watched as the jet continued off to the northwest toward the cites of pocola, ok and fort smith, ar. as for the size of the object i can only say it appeared as large as the aircraft behind it. my girlfriend observed the same object with me but she said to her the lights appeared more red and there appeared to be four lights in back that did not blink. i wanted to report her sighting too as we witnessed it together but saw differences in the lights on the object. my daughter is only three as she was just frightened by all of the animals howling."],"Object Shape":"Cylinder","Longitude":"-94.532166","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","City":"Cameron","Object Flight Path":"Straight-line path","Object Features":"None","trends":["There has been one other sighting in Cameron","There were no other sightings in Cameron on or around January 18th 2012"],"Case Number":"35559","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.136356,+-94.532166(35559)&iwloc=A&hl=en\"> mufon case (35559) map </A>","Date of the Event":"01/18/2012 08:20 UTC","Date Submitted":"02/07/2012 11:22 UTC","Summary":"A cigar shaped object with two orange/yellow non blinking lights was being persued by a jet","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/35559.html.txt","/var/www/straped/mufon/org/35559.html"],"Log Number":"US-02072012-0017"}