{"Weather Factors":"Unknown","Date Submitted":"02/07/2012 06:14 UTC","Date of the Event":"02/02/2012 05:50 UTC","Object Flight Path":"Path with directional change,Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.883244,+-87.620868(35552)&iwloc=A&hl=en\"> mufon case (35552) map </A>","Viewing Distance":"Unknown","Case Number":"35552","Latitude":"41.883244","Region":"Illinois","files":["/var/www/straped/mufon/html2text/35552.html.txt","/var/www/straped/mufon/org/35552.html"],"Longitude":"-87.620868","Object Shape":"Disc, Fireball, Oval, Sphere, Other","Country":"United States","Source":"MUFON","Object Features":"Unknown","City":"Chicago","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"US-02072012-0011","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around February 2nd 2012"],"divs":["sighting detailsi went outside to move my car from the driveway to the street when i saw a low flying light between the 2 houses across the street. for the first second i thought it was going to be a plane on the runway pattern getting ready to land at midway a few miles away, but i noticed that the light was an unusual orange\\red color that i can't even recreate, as i never saw anything that color before. it went from a south to north direction, like the runway pattern was, for about 3 seconds, then it started to head in a east to west direction at an uneven hover and as it moved toward me, as i was looking at it from a west to east position, i noticed that it slowly started to ascend as it got closer, then it went directly upward, at the same time it was doing this, i notice a plane on the very runway pattern i described earlier getting ready to land. the oject first appeared below the treeline and now at this point it was above and moving higher, i backed up toward my car and unlocked it and opened the door. i second later i looked down for a second and when i looked up it was gone. the object glowed with bright light and it was orange\\red in color, but a shade i never seen in my life. it was round, but slightly elongated at the sides. it was quite low flying as i could see it between the two houses quite well."],"Tags":"City","Summary":"Orange/red light slightly long on the sides, round on the top and bottom low flying change direction and ascend."}