{"Region":"Rhode Island","Object Shape":"Triangle","Country":"United States","Object Flight Path":"Straight-line path","Tags":"City","divs":["sighting details so mt bro and i were outside smokin a butt when we saw it. i was facing west when it came out from behind the house. at first i only noticed one light, kind of an orange orb with a red light inside of it with a yellow beam of light coming out of the top of it. it was at tree top level. i looked at it for a second waiting to see flashing lights like on a normal aircraft when i realized it was right there in front of me no more then 100ft away from us.we began running across the yard when i noticed that the light was one of three lights on a large triangle that had to be bigger then a football field. my heart wass pounding out of my chest and we were both kinda slack jawed looking at it. it moved from north to south along side the house when we both noticed a large misty green opening in the sky. it looked like a hanger door with frame work inside it floating in the sky. and yes once the triangle was inside the green opening it all vanished. i know it sounds crazy but we both saw the same thing, i was in the army for six years working on hellacopters on an army\\airforce airfield. i've seen a lot of aircraft in my time in iraq. if someone could get in touch with us we could tell our story much better then i could ever type it."],"Source":"MUFON","Sighting Duration":"00:00:20","Summary":"my bro and myself were no more then 100ft from it as it went by","Longitude":"-71.626666","Viewing Distance":"21-100 Feet","trends":["There has been one other sighting in Scituate","There was one other sighting in Scituate on or around December 17th 2011"],"Log Number":"US-02082012-0009","City":"Scituate","Case Number":"35568","Weather Factors":"Unknown","Date of the Event":"12/17/2011 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.816614,+-71.626666(35568)&iwloc=A&hl=en\"> mufon case (35568) map </A>","Date Submitted":"02/08/2012 12:54 UTC","Latitude":"41.816614","files":["/var/www/straped/mufon/html2text/35568.html.txt","/var/www/straped/mufon/org/35568.html"],"Disposition":"Unresolved","Object Features":"None"}