{"Longitude":"-111.899602","Date Submitted":"02/08/2012 01:45 UTC","Object Shape":"Disc, Sphere","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/35561.html.txt","/var/www/straped/mufon/org/35561.html"],"Country":"United States","Region":"Utah","Case Number":"35561","map":"<A HREF = \"http://maps.google.com/maps?q=40.787789,+-111.899602(35561)&iwloc=A&hl=en\"> mufon case (35561) map </A>","Log Number":"US-02082012-0002","Disposition":"Unresolved","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around February 5th 2012"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Source":"MUFON","City":"Salt Lake City","Latitude":"40.787789","Object Flight Path":"Stationary","Summary":"2 types of UFO in 1 night, 5 witnesses - orange orb and flashing lights - Utah","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was just after a Birthday dinner when I was standing outside with a couple of my friends, my fiance, and mother. While staring up at the moon I noticed that below it and to the right was a small row of lights that was staying in one place but tilted to the right. They kind of pulsated and changed colors from blue, to green, to red, to white, and that was how I distinguished it wasn't any kind of star. I immediately pointed it out to everyone around me when I noticed the exact same set of lights tilted in the exact same way a mile or so to the right of that. We had sat there and stared back and forth for quite some time at these lights that were completely still but randomly changing colors of all sorts, we decided to finish our journey home and keep an eye on the sky. We figured that maybe we could distinguish if it happened to be a floating satelite or some kind of plane if we traveled to the other side of the city and checked it out there. We were pulling up on the street to my house which is a very slow quiet street and the moon happened to be right in front of me, so I figured it was safe enough to take a glance and see if I saw the same lights when much to my surprise I saw much more than that, we saw a hovering orange light that seemed MUCH closer in the atmosphere. This bright orange orb glowed, lightly pulsated, and was also stationary. My mother was never able to see the slanted flashing lights because she didn't have her glasses (3 other people including myself saw them), but this orb stood out more than anything else in the sky, it was pretty hard to miss. All of us were in such shock that I immediatly stopped the car in the middle of the road and slammed it in park to get out my camera phone when we watched it fade out as if it was taking off into the atmosphere. Those stationary lights also remained in the sky for an hour or 2 before also disappearing. I tried to get any kind of footage but they would not show up on my camera. All of us are completely shocked and have been obsessed about finding out more information. Apparently these orange orb UFO's are pretty common and I have found footage of what I have seen by searching \"orange orb ufo\".. I linked a video I believe looks almost exactly like what we saw"],"Tags":"City","Date of the Event":"02/05/2012 07:06 UTC"}