{"Log Number":"US-02092012-0004","Longitude":"-77.030756","Object Flight Path":"Path then hovering","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around February 8th 2012"],"divs":["Sighting Details1. i was on my way home from work i look up and see 3 lights. at first i just thought they were stars and dismissed them but not even 10 secounds later i relize its night threre is cloud cover i cannot see any stars at the time i look back up the light on the far left shoots straight up and the one on the far left seems to \"collide\" with the one in the center and then that one got larger and started glowing red and orange. and about this time military helicopters and jets start filling the sky. 2. i first noticed the object becouse i was looking at the stars and it seemed a little to large to be a star. 3. i thought it was a star 4. the first object flew straight up the object in the middle stayed still and the last one collided with the one in the middle 5. i was in awe i stoped walking and just watched it for about 20 min counted all the planes that flew by and wondered what the \"excuse\" would be in the local news 6. after about 20 min i started walking again keeping my eyes on it i think the clouds may have shifted or something because it seemed to fade away"],"Date Submitted":"02/09/2012 01:12 UTC","Latitude":"38.905082","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.905082,+-77.030756(35577)&iwloc=A&hl=en\"> mufon case (35577) map </A>","City":"Washington","Summary":"saw three lights in sky then over 20 military planes/helicopters going to the lights","files":["/var/www/straped/mufon/html2text/35577.html.txt","/var/www/straped/mufon/org/35577.html"],"Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Object Shape":"Triangle","Region":"Washington","Tags":"City","Case Number":"35577","Date of the Event":"02/08/2012 07:31 UTC"}