{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Weather Factors":"Unknown","Object Features":"None","Country":"United States","Object Shape":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.063142,+-83.830374(35570)&iwloc=A&hl=en\"> mufon case (35570) map </A>","divs":["Sighting DetailsWas driving down the street when I looked up and saw 3 extremely large, irregular flight path contrails. As there are many contrails around here, I wouldn't have thought much about them- except that they were so large and on a very irregular flight path. No type of aircraft that would leave a contrail that I am aware of flies in that manner........and it looked very strange. In addition, they appeared to be significantly lower than most contrails one sees on a regular basis. Observing these while driving, I then noticed there were 2 jets at an apparently very high altitude (you couldn't see the jets- just the contrails they were making) following these very large, irregularly shaped contrails from way above . Then I turned to look at the other end of the very large, irregularly shaped contrails, and there were 4 additional jets following the same irregularly shaped contrails (a total of 6 additional contrails in addition to the irregularly shaped 3 contrails.) The \"regular\" contrails of the 4 jets (which you could see the planes that were making them- so they were significantly \"lower\" than the other 2 \"regular\" contrails) were very close together- as though \"flying in formation\". It was very unusual, and 3 people personally witnessed these, as well. In total, there were 9 contrails- only 6 that appeared on a \"normal\" flight path (not in a \"convoluted\" manner). The 3 convoluted contrails were headed South to North. In addition, this morning at 7:35 a.m., I noticed there was 1 convoluted, very large contrail going from East to West,but there was only 1, and I saw only 1 other \"normal\" contrail following that flight path(in a \"normal\" straight line through the convoluted contrail)- so i didn't think too much of it until i saw the 3 this afternoon. Then when I saw a UFO report in Lansing, MI (pretty much West of here), I was wondering if there might be some type of connection..........There is no need to contact me, as this is all the info I have, but thought it might be of some use in the event there are other reports of strange sightings in this area."],"trends":["There have been 17 other sightings in Flushing","There were no other sightings in Flushing on or around February 8th 2012"],"Date Submitted":"02/08/2012 05:28 UTC","Summary":"3 extremely large, convoluted contrails on irregular path","Region":"Michigan","Tags":"City","City":"Flushing","Latitude":"43.063142","Disposition":"Unresolved","Case Number":"35570","Longitude":"-83.830374","files":["/var/www/straped/mufon/html2text/35570.html.txt","/var/www/straped/mufon/org/35570.html"],"Date of the Event":"02/08/2012 02:20 UTC","Log Number":"US-02082012-0011"}