{"Date of the Event":"02/09/2012 12:00 UTC","Tags":"City","Date Submitted":"02/09/2012 01:12 UTC","Country":"United States","Longitude":"-86.560729","Weather Factors":"Unknown","City":"Rossville","Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/35574.html.txt","/var/www/straped/mufon/org/35574.html"],"Object Shape":"Circle, Oval, Star-like","trends":["There have been no other sightings in Rossville","This sighting has never been favorited."],"Region":"Indiana","Source":"MUFON","Log Number":"US-02092012-0001","Object Features":"Dome","Summary":"Saw stealth bomber shaped plane with regular flashy lights low to ground circling the area (horizon) near one of 3 ufos. The most prominent ufo just hover and veered from left to right and up and down and glowed blue green.","divs":["Sighting DetailsGot home from work around 11:45. Noticed blinky human craft in sky. Ive seen them every night and saw another ufo 2 nights ago but did not report it. I them stepped out of my car and literally stood outside freezing for an hour observing 1 of 3 ufos. They had very bright green lights with some kind of orange flashing lights. I used binoculars but I could only make out these two lights. There were 3 of these each in seperate parts of the sky. Something is going on for sure. Saw stealth bomber shaped plane with regular flashy lights low to ground circling the area (horizon) near one of 3 ufos. The most prominent ufo just hover and veered from left to right and up and down and glowed blue green. Also I was a little bit alarmed by the howling of every animal in my neighborhood all at once every couple of minutes. The way the brightest ufo seemed to maneuver was akin to evading some type of attack, perhaps from the obvious human crafts I saw circling around the sky. That is only a theory however. I will report more if I keep witnessing this. Also nothing changed, I just had to go inside because I was freezing to death."],"Case Number":"35574","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Latitude":"40.387835","map":"<A HREF = \"http://maps.google.com/maps?q=40.387835,+-86.560729(35574)&iwloc=A&hl=en\"> mufon case (35574) map </A>"}