{"divs":["Sighting DetailsI went out to put something in the mail box when I saw a bright white light in the sky above my neighbors house off in the distance. I looked at it for a second and it changed to a bright orange color and started to pulsate. I went inside to get my mom and her boyfriend and they both saw it for at least 5 minutes then when back inside. I continued to look at the object taking several pictures on my cell phone. It wouldn't stay in one spot, but hover around some, ascending and descending and pulsating for at least 30 mins. A few times it completely flickered off and back on again. After about 30-45 minutes it went below my field of vision behind my neighbors house. When I looked at the pictures I had taken, I noticed, besides the UFO, another green light higher up in the sky, which was not visible to the naked eye but showed up in the pictures."],"Latitude":"26.084475","Object Features":"Dome","Region":"Florida","files":["/var/www/straped/mufon/html2text/35578.html.txt","/var/www/straped/mufon/more/35578_submitter_file1__IMG_20120207_203858.jpg","/var/www/straped/mufon/more/35578_submitter_file2__IMG_20120207_202810.jpg","/var/www/straped/mufon/more/35578_submitter_file3__IMG_20120207_210245.jpg","/var/www/straped/mufon/org/35578.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"02/07/2012 08:15 UTC","Object Shape":"Diamond, Disc, Egg, Oval, Saturn-like, Sphere, Star-like, Other, Unknown","Summary":"Long, quiet, hovered stationary sometimes ascending and descending","Country":"United States","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around February 7th 2012","This sighting has never been favorited.",""],"Date Submitted":"02/09/2012 01:37 UTC","Log Number":"US-02092012-0005","Object Flight Path":"Stationary,Other","Sighting Duration":"00:40:00","City":"Fort Lauderdale","Source":"MUFON","Case Number":"35578","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=26.084475,+-80.362832(35578)&iwloc=A&hl=en\"> mufon case (35578) map </A>","Longitude":"-80.362832"}