{"files":["/var/www/straped/mufon/html2text/3557.html.txt","/var/www/straped/mufon/org/3557.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.982531,+-86.108264(3557)&iwloc=A&hl=en\"> mufon case (3557) map </A>","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsNote: The exact date of the event is a bit unknown to me, I can only remember that it was 5 or 6 years ago near the end of Summer. Somewhere between 10 and 12 p.m. on a relatively isolated road somewhere near the Carmel, IN Mejier (which is where we were headed) my twin brother, father, and I had an encounter with a large, floating triangular shaped object. In our station wagon with our dad driving we were seated in the back of the vehicle. My brother initially spotted the object coming to the left of our vehicle. It matched our velocity and followed directly above our vehicle for fifteen minutes or so. It made no sound and had red, white, and blue lights on its three tips (we both made note of this thing in particular). I couldn't see significantly above this craft as it was directly above us, but I had the impression it was pyramidal in shape (looking back I swear I saw another light on the top of the object when it left us but my brother saw no light). It followed us just above the tree tops, which I estimate was probably 20-30 feet above our car (possibly even less it was incredibly close to our car). My perspective of it was massive (it covered a good portion of the sky above our vehicle) but its size was probably about three to five times our car's size. It gently rolled back and forth very slightly between the left and right windows of our car; allowing us to see it above our car while we were inside of it. The object seemed to hover more toward where my brother and I were sitting in the center of the car. My father, as he was driving, never looked up to see the object. It seemed odd to me that he didn't look up, but we never actually arrived at a place where he could or would stop the car. The purpose of this object has always been baffling to me, but it seemed distinctly interested in our vehicle and ours alone. Another odd thing I noticed when we were driving is that there didn't appear to be any people near our vehicle (on foot or in other cars). The only other vehicle I possibly I spotted was probably a mile behind us. When we approached the nearby Mejier the object veered away (back to the left, the direction it came from), I never saw it rise a significant height but it seemed to move off to the horizon. My brother and I tracked it as long as we could until it looked like a multiple colored star in the distance. It remained stationary and I eventually assumed that this was in fact a star and not the object itself. We may have mistaken this star for the object in the distance as we lost sight of it, or it may have remained stationary for some reason at that point. We looked back in that direction when we came out of the Mejier and the light remained, and I assumed it was a star."],"trends":["There have been 10 other sightings in Carmel","There were no other sightings in Carmel on or around August 4th 2000"],"Sighting Duration":"00:15:00","Latitude":"39.982531","City":"Carmel","Date of the Event":"08/04/2000 12:00 UTC","Viewing Distance":"20 Feet or Less, 21-100 Feet","Object Features":"Other","Object Shape":"Triangle","Case Number":"3557","Tags":"City","Log Number":"US-07082005-0002","Longitude":"-86.108264","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"08/04/2000 12:00 UTC","Summary":"Triangular craft with red, white, and blue lights on its tips","Source":"MUFON","Region":"Indiana"}