{"Object Shape":"Fireball, Sphere, Star-like","divs":["Sighting DetailsI was near Sand Lake with my friend Jeff, we had set up a pop-up blind earlier in the day (very near a sea osprey preserve) in hopes of scoring a big buck. After midnite we walked from the back side of my grandfather's property to the area near where we had put the blind. The area of the osprey preserve is roughly the size of a football field and it is wide open wetland inside of that area. It is surrounded by trees. As Jeff and I came in through the trees we were about 50 feet from the open area, when we saw what we thought were 2 sets of headlights. I shined my spotlight at them, and Jeff got angry, because we thought they were the DNR(Department of Natural Resources), which spells trouble for two hunters in the middle of the night. As soon as I spotlighted what we thought were ATVs the lights moved faster than anything I have ever seen, through the trees right up to twenty feet in front of us and hovered, at head leval. We were both armed with full magazines, with our guns aimed at the light that was directly in front of each of us. We were paralized standing for approx. 10 minutes. We got a good look at them, but they are difficult to describe. They were the size of a volleyball and seemed to be melting neon light, pink,purple,deep blue,and green. And as I said we couldnt move at all. I remember being stuck like that for what seemed like two minutes, but to Jeff seemed more like ten minutes. It let go of us at the same time and we fell down, and clawed dirt trying to get away, until we both had a big tree at our backs. As we were on the ground the lights had moved with us, still maintainig the 20 foot distance from us. Then all at once it ascended so fast you almost couldnt see it doing it, like in the blink of the eye. This really happened. Jeff was former military with security clearance and he said that it was not man made, and had never seen anything like it.-Fred Babcock"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/35587.html.txt","/var/www/straped/mufon/org/35587.html"],"Summary":"Very close encounter witnessed by myself, and honerable ex-military","Source":"MUFON","Region":"Michigan","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.299802,+-85.516774(35587)&iwloc=A&hl=en\"> mufon case (35587) map </A>","Longitude":"-85.516774","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Viewing Distance":"20 Feet or Less","Tags":"City","City":"Sand Lake","trends":["There have been 2 other sightings in Sand Lake","There were no other sightings in Sand Lake on or around November 14th 2006"],"Date of the Event":"11/14/2006 12:00 UTC","Latitude":"43.299802","Log Number":"US-02092012-0014","Weather Factors":"Unknown","Object Features":"None","Date Submitted":"02/09/2012 09:20 UTC","Case Number":"35587"}