{"Tags":"City","divs":["Sighting DetailsMy sighting starts when I was in my living room sitting on my couch which faces away from the main window over looking my front yard. I got up to get something from the kitchen when I noticed something odd-looking out the window. I moved closer for a better look when I realized whatever this was, wasn't normal. So I walked outside onto my front porch to get a better look. The first thing I saw was a large triangle with red and white lights. The red lights blinked every so often. The sides of the triangle weren't flat, they were thicker and more cylindricle, but it was deffinitly still a triangle. I think noticed that there were two others just like it. The first one flew diagnaly down my street to a cellphone tower you can see from my porch. The other flew parallel to it and the third flew over my home. I looked back up the street and a few minutes later another flew down my street. At first I thought this might be just a weird airplane flight pattern or something explainable. But what made me realized that it could be something else, was the fact that a few minutes, the first two ships flying parallel came together by the cellphone tower. The one that i first noticed went straight toward the water tower and a few minutes later, the one that flew parallel came over top of it and they hovered right on top of each other for several minutes. I never saw how they left because i started to notice something else. Ever few minutes another would come down the street, all from the same direction, but each one would get a little closer and closer to the tree tops. I also saw stars move. It sounds crazy, but they moved. They looked like normal stars. Bright, un-moving, un-blinking, and they didn't have that unnatural light that satilites do. You could stare at them for a while and they would just seem like normal stars. But then, two started to move. It wasn't particularly fast but it was brisk. Unlike the triangle ships, they would go in all different directions. Once they started to move some would blink white and others would stay a solid glowing white. After this, I lost count of how many triangles and stars I saw. I saw one triangle that was practicly in the treetops of my neighbor across the road. If I had heard or saw the treetops move, i would believe that they were deffinitly in the treetops. I didn't see where this one came from but it was accending into the sky at a very slow rate. Next,and i still have no idea why i did this, i did try to signal them. I turned off the porch light and the main light over my landing. I think turned my porch light on then off three times. I did this twice. I didnt feel any fear or hesitation when i did this. It felt like the normal thing to do, like i should do it. It was a few minutes later that i noticed one of the starts was unusually close to me. It was around the perimiter of my yard and it blinking white until it came across this one big tree next to my drive way. It then started to blink red. It was almost as if it was facing me, or at least my home, while it flew around the back side of my house. No other star had ever blinked red. After this i started to feel like there was a pressure on my chest and it became slightly more difficult for me to breath. I started to get scared so I went back inside after about another two minutes. I would have believed this was a freak flight pattern for planes if it wasn't for the amount of ships I saw (I estimate no less then a dozen), the star-ships, the two that came together, and the one that cirlced my home. I've always thought that life on other planets existed, that it was logical. I never really thought to much about UFO's though, which really added to the shock of seeing this. Of course i felt absolutly no shock, fear, or confusion until after I went back inside. While i was outside, it just felt comfortable until after the red blinking star ship disapeared behind my home. This occured for about 20 minutes between 7:20-7:40pm (approximetly), on Thursday February 9th, 2012."],"Object Flight Path":"Straight-line path","Case Number":"35589","Region":"New Jersey","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/35589.html.txt","/var/www/straped/mufon/org/35589.html"],"Longitude":"-74.574722","Log Number":"US-02092012-0016","Source":"MUFON","Latitude":"40.847778","Object Shape":"Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.847778,+-74.574722(35589)&iwloc=A&hl=en\"> mufon case (35589) map </A>","Object Features":"Other, Unknown","Summary":"About a dozen or so ships and star-like things filled the sky around my home.","trends":["There have been no other sightings in Randolph","This sighting has been favorited 1 time."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date of the Event":"02/09/2012 07:20 UTC","Country":"United States","Date Submitted":"02/09/2012 09:55 UTC","Weather Factors":"Unknown","City":"Randolph"}