{"divs":["Sighting DetailsWilliamston Mi, around 730 at night, girlfriend and I were on our way to the gym. Avid sky watcher, whenever I can I look to the stars. It was a pretty clear night, she was driving and I was staring out the front passenger window. I noticed two star like lights that were parallel to eachother moving at about the same speed as us. They were about 3-4 inches apart from ground level. They flashed at the same time, and moved at the same rate. When we came to a stop sign I pointed out the two lights to my girlfriend. Now the lights were directly in front of us. Suddenly another light appeared, now there is three flashing lights in a triangle formation all about three to four inches apart. As we continue to watch, the three lights flashed again, only when they flashed back on there was about six to ten lights in a cluster around the original three. As they flashed they separated from the cluster. Almost like they all flew in different directions. Eventually we lost sight of objects behind trees. Myself and my girlfriend both agreed that we've never seen anything like this, and its probably a once in a lifetime situations. It was pretty cool to say the least."],"Summary":"many small star sized lights","Object Features":"Unknown","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/35585.html.txt","/var/www/straped/mufon/org/35585.html"],"Longitude":"-84.277154","Latitude":"42.692654","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.692654,+-84.277154(35585)&iwloc=A&hl=en\"> mufon case (35585) map </A>","City":"Williamston","Region":"Michigan","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-02092012-0012","Case Number":"35585","Date of the Event":"02/08/2012 07:30 UTC","trends":["There have been 2 other sightings in Williamston","There were no other sightings in Williamston on or around February 8th 2012"],"Date Submitted":"02/09/2012 08:43 UTC","Object Shape":"Diamond, Flash, Triangle","Object Flight Path":"Straight-line path,Path with directional change","Tags":"City","Source":"MUFON"}