{"Disposition":"Unresolved","Object Features":"Other","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"02/09/2012 04:17 UTC","trends":["There has been one other sighting in Buena","There were no other sightings in Buena on or around January 27th 2012","This sighting has never been favorited.",""],"Region":"New Jersey","Viewing Distance":"Over One Mile","Log Number":"US-02092012-0008","map":"<A HREF = \"http://maps.google.com/maps?q=39.516265,+-74.9588(35581)&iwloc=A&hl=en\"> mufon case (35581) map </A>","divs":["Sighting DetailsI was working in my shop in my back yard and heard a low flying jet plane flying over. There is a lot of military and commercial traffic over my house and I went out to take a look at the aircraft. I could not see the jet yet but could hear it, and as I was looking in the sky for the jet I noticed a bright white light moving to the south east of my position. The light was as bright as the sun but very small, silent and about three to five miles from my position. It was moving from clear blue sky towards clouds to the south. I was facing east at the time. I ran to get my camera and just caught it before it moved into the clouds fully, I tried to set up a second shot but it was too late as the object moved into the thick of the clouds. Other than the clouds to the south the sky was completely clear bright and sunny. I then looked at the picture and barely saw the object on the LCD screen, but when I zoomed into the object it was very different from what I expected to see. I expected to see a plane and not the object that I was looking at, it also seemed to have three points of light and not just one as I observed. I was actually very excited by the picture, but remembered to also take a picture of the military jet as it passed over. It seemed to be on approximately the same course as the object but flying very low as they sometimes do. I have the original picture and all of the exif data from the camera. I hope that this report helps!"],"Longitude":"-74.9588","City":"Buena","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/35581.html.txt","/var/www/straped/mufon/more/35581_submitter_file1__IMG_5078.JPG","/var/www/straped/mufon/more/35581_submitter_file2__Zoomedandcropped.JPG","/var/www/straped/mufon/org/35581.html"],"Summary":"Bright white light larger than a star moving south east from my position, from clear sky towards clouds","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Circle","Case Number":"35581","Date of the Event":"01/27/2012 05:08 UTC","Latitude":"39.516265","Country":"United States"}