{"Summary":"Saw 1 object that was circular in shape. It had a silver or gray ring around a very big bright white light.","Object Shape":"Circle","divs":["Sighting Details I saw what I first thought was a plane because we live near the airport & see planes all the time. It flashed across the sky very fast & my first thought was that I've never seen a plane move that fast before. Then I realized it wasn't a plane. I saw an extremely bright circle of light. It stopped in the sky & I could see a silver or gray ring around it but no lights were on that part of it. The whole center was a bright white light. It moved quickly, hovered, moved around in a circle & then looped around & hovered again. After it hovered at the last spot, it's light intensified & then it just disappeared. - It did not accelerate out of sight or drop down - It was just gone. There was no noise. I was very excited to be witnessing it. Afterwards I felt tense & kind of aggitated & my stomach muscles are still tight. I KNOW what I saw but today I questioned in my mind how I could have witnessed something like that. I also have a sense of loss & have cried for no reason that I can think of...."],"Case Number":"35596","Date of the Event":"02/08/2012 12:00 UTC","Sighting Duration":"Undisclosed","Log Number":"US-02092012-0023","trends":["There have been 13 other sightings in Traverse City","There was one other sighting in Traverse City on or around February 8th 2012","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Traverse City","Tags":"City","Disposition":"Unresolved","Longitude":"-85.631502","Country":"United States","Source":"MUFON","Object Features":"Other","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.735072,+-85.631502(35596)&iwloc=A&hl=en\"> mufon case (35596) map </A>","Region":"Michigan","Latitude":"44.735072","Weather Factors":"Unknown","Date Submitted":"02/09/2012 11:40 UTC","files":["/var/www/straped/mufon/html2text/35596.html.txt","/var/www/straped/mufon/more/35596_submitter_file1__sighting282012.jpg","/var/www/straped/mufon/org/35596.html"]}