{"Object Shape":"Triangle","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/35590.html.txt","/var/www/straped/mufon/org/35590.html"],"Longitude":"-88.697306","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=32.3674,+-88.697306(35590)&iwloc=A&hl=en\"> mufon case (35590) map </A>","divs":["Sighting DetailsMy sister and I were coming back from town at 5:33 December 24, 2011 we were just sitting in the car talking. And everytime I'm out at night I always look out for UFOs because I am a strong beliver in those type of things. Then I see an object from a far that doesnt have the color patterns a normal plane has, so I asked her if it was a UFO and she said I don't know but keep watching it so I did. As we got closer I kept getting the feeling that it wasnt a plane. We just basically were riding along with it for maybe 5 mintutes. And my sister was driving and trying to watch the obect at the same time. So she was swerving in the road and I took my eyes if the craft for 2 seconds to make sure we wernt going to crash and it had changed shape it now had red and white lights along the edge instead of green ones. And as soon as that happend my sister started crying and saying a few curse words, and I felt completely nauseous and scared. Then the craft picks up speed turns left and by this time it was pretty much right above us but a little more to the left like over this empty field along that road and it was hovering and underneath it were three bright rectaguler white lights. Since it was hovering we drove past it then we qucikly turned aroun on the nearest road and within two mintues the craft was gone. And I have no idea how sincce it was hovering when we passed it and the sky was very clear that night. Then at midnight the next morning i woke up vomiting. Also three nights before witnessing the object i had a dream about witnessing one. and I would love to know if it was a coincidence or not."],"Object Features":"Unknown","Latitude":"32.3674","Date Submitted":"02/09/2012 09:58 UTC","Country":"United States","Tags":"City","trends":["There have been 3 other sightings in Meridian","There were no other sightings in Meridian on or around December 24th 2011"],"Case Number":"35590","Log Number":"US-02092012-0017","Viewing Distance":"501 Feet - 1 Mile","City":"Meridian","Sighting Duration":"00:15:41","Date of the Event":"12/24/2011 05:34 UTC","Weather Factors":"Unknown","Summary":"Triangular craft eith at first green lights around each edge then after the change red lights along the edge and at the very bottom the were three bright white rectangles","Source":"MUFON"}