{"Date of the Event":"02/07/2012 07:38 UTC","Weather Factors":"Unknown","Tags":"City","Date Submitted":"02/09/2012 11:13 UTC","Summary":"I've noticed a bright hovering object that comes many nights over my home since the 26th of Jan.2012.","files":["/var/www/straped/mufon/html2text/35595.html.txt","/var/www/straped/mufon/more/35595_submitter_file1__DSCO2840.JPG","/var/www/straped/mufon/more/35595_submitter_file2__DSC02836.JPG","/var/www/straped/mufon/more/35595_submitter_file3__DSC02841.JPG","/var/www/straped/mufon/org/35595.html"],"Case Number":"35595","Disposition":"Unresolved","Object Features":"Unknown","Latitude":"35.769263","Source":"MUFON","Object Flight Path":"Stationary","Country":"United States","Log Number":"US-02092012-0022","Region":"North Carolina","divs":["Sighting DetailsOn the night of Feb.7th 2012 I went outside to look at the full moon. I noticed a very bright object to the North-West that seemed to hover and flicker as if spinning. After watching for about 5 minutes all of a sudden a 'fire ball' shot from this object. I went inside to get a camera to try to photograph this object. I had was a Sony Sure Shot 8 meg. to try to get a picture. I took several as I tried to zoom in closer to this bright light. To my surprise when I downloaded the pictures to my computer I was amazed to see that one of the pictures looked like some type of craft,round in shape with a bulging center,the color of the Center was green. There were clouds in the area but I was still able to get a nice photo. This object hovered as if 'hanging around' for several hours and just disappeared. I wasn't scared as I have met several people in this field and I just wanted to document this object. I am told that I live in a 'Hot Bed' for anomalous activity, so I am always looking up when time permits. I am happy to report that looking up and paying attention seems to have paid off with this strange photo. I have no idea what it is,but I do know it is not a plane,remote toy,hot air balloon,etc. Hopefully someone else is paying attention in my area or better still someone can take my uploaded photo and decipher this object. I really don't think we are alone in this world as I have witnessed many strange anomalies in my area for the past several years. Is this some type of craft,satellite? I don't have the answers,but for those who are sky watchers I hope you enjoy. Peace and Blessing's, Starr"],"Longitude":"-79.01736","Viewing Distance":"101-500 Feet","Object Shape":"Fireball, Star-like","trends":[""],"map":"<A HREF = \"http://maps.google.com/maps?q=35.769263,+-79.01736(35595)&iwloc=A&hl=en\"> mufon case (35595) map </A>","City":"Undisclosed","Sighting Duration":"03:00:00"}