{"Case Number":"35593","Region":"Florida","Object Features":"Undisclosed","Log Number":"US-02092012-0020","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.672897,+-81.509114(35593)&iwloc=A&hl=en\"> mufon case (35593) map </A>","Object Shape":"Cylinder, Diamond, Disc, Fireball, Sphere, Star-like, Triangle","Longitude":"-81.509114","Viewing Distance":"20 Feet or Less, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/35593.html.txt","/var/www/straped/mufon/org/35593.html"],"Date Submitted":"02/09/2012 11:10 UTC","Tags":"City","Summary":"mulitple","Latitude":"27.672897","Sighting Duration":"Undisclosed","trends":[],"Disposition":"Unresolved","Date of the Event":"01/01/1970 12:00 UTC","Country":"United States","City":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI doubt if my information would really be of use to anyone. Though someone writing a new book might find it of value. My mother, sister and I have all seen more ufos than can be listed here. Differnt shapes, sizes and throughout our lives. One, my mother saw human men in street clothing staring down out of a window. I saw this ufo as well as did my sister and father. As is commonly reported, we each have differing memories. This went on throughout my childhood and followed me into adulthood until I was about 34. I recall one night that ended my visitations when I was in bed asleep. I awoke, paralyzed and found the room bathed in blue light. These small creatures that to me looked a little like trolls or something surrounded my bed. Then a tall creature appeared and I recall remembering him and thought \"you again\". The next thing I knew, I was floating over my bed after he directed the smaller ones to take me. I rose over my bed, floating as they guided me through the double glass doors off my bedroom, out on the balcony which was shielded by bullet proof glass for sound abatement. There was no way for anyone to get off that balcony without breaking the glass. Yet, I passed through it, hovering over the parking lot over which was a saucer shaped craft. I was amazed that in downtown Mission Viejo, California that no one took notice. The next thing I knew, I was in a room bathed in intense white light with several of the tall creatures around me. They did something to me, taking a sample of sperm (I am transgender). Suddenly, they seemed concerned and the one I recognized came in and they told him something. He was upset though there were no outward signs. It was like I knew what he was thinking and he was MAD! He told the others they couldn't use me anymore. I was full of both joy and wanted to rub it in. I remember thinking to them ha ha! You won't be bothering me anymore. The next thing I remembered I was back in my room in my bed. While I've seen many more ufos, I can't report anymore abductions. I can't speak for my mother or sister. But since my mother now lives here within 70 miles of me, we visit frequently and she's told me many stories. I thought this might be of some value. I didn't bother filling out much of this form as it seemed irrelevant."]}