{"Region":"South Dakota","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"02/09/2012 08:50 UTC","Case Number":"35597","files":["/var/www/straped/mufon/html2text/35597.html.txt","/var/www/straped/mufon/org/35597.html"],"Date Submitted":"02/09/2012 11:59 UTC","City":"Lead","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Latitude":"44.354784","Longitude":"-103.786927","Object Flight Path":"Hovering then path,Path then hovering","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was alone at my parents house in the Black Hills of South Dakota a little after 8:40 PM on Thursday, February 9th. I was watching television when the dog began to act anxious, which I interpreted as a need to relieve herself. I let her out onto the back porch but she did not run off into the trees or leave my side. I stepped out from under the porch roof because I saw light emanating from the area, above the canyon, behind my parents house. I saw two spheres, one blue and one green, that I, at first thought, were vehicles moving around on the hill about a mile away from the house on the far side of the canyon. After a few moments I realized that the angle was wrong and the lights were too high in the sky and too close to be on the ground. The trees behind our house obscured my view and I could not tell what they were in the distance. We live in a very secluded area and when you stand outside you can hear the sound of engines if there are trucks or snow mobiles but there was absolutely no sound, which was very unsettling. I brought the dog back in and went up into the tower at the house to use the telescope to try and see what these were. With the telescope I struggled to keep focused on them and I could not pick out any distinguishing features. They still just looked like fuzzy, floating, glowing discs or spheres. They then moved behind the cover of the roof and and went downstairs again to watch them through a window. The dog was still quite uneasy and was staying very close to my leg. The lights had crossed from being across from the eastern corner of the house to the western end. The blue light was slightly higher than the green. They appeared to come lower and closer to the house and then move away and over the a hill. The wind was quite powerful up here today so it is very hard to say whether not they were moving against the wind or faster than reasonable. I am at a loss as to what I saw. I have never had an experience like this before and I am a devout skeptic, however I am stumped and a little freaked out. I would much prefer a reasonable explanation to having seen an alien craft. I would even prefer an experimental aircraft or something."],"Object Features":"None","Object Shape":"Circle, Oval, Sphere","Source":"MUFON","Log Number":"US-02092012-0024","trends":["There has been one other sighting in Lead","There were no other sightings in Lead on or around February 9th 2012"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.354784,+-103.786927(35597)&iwloc=A&hl=en\"> mufon case (35597) map </A>","Summary":"I witnessed two hovering glowing spheres, one blue and one green, in the canyon behind my parents house. They hovered and drifted."}