{"Sighting Duration":"Undisclosed","Longitude":"-85.831758","trends":["There have been 6 other sightings in Goshen","There were no other sightings in Goshen on or around February 4th 2012","This sighting has never been favorited.",""],"Object Features":"None","Log Number":"US-02102012-0006","Object Flight Path":"Stationary","Country":"United States","Date of the Event":"02/04/2012 09:54 UTC","Region":"Indiana","Object Shape":"Circle","Viewing Distance":"Over One Mile","divs":["Sighting DetailsOn February 4, 2012 (and according to my very short video's time 2154 eastern time) I went to get my phone that was sitting near the living room window, it was then when I noticed a group of red lights outside on the eastern side of the town. I informed my wife of the sighting and run outside to the back porch. She soon followed behind me with camera on hand. The group of red bright solid lights were all spread across the horizon not flying anywhere (more like peppering the sky), no particular formation, but seemingly hovering for a minute or two before start ascending straight up in unison. No engine or other sound was heard .There was an overcast and soon after the start of the ascend they disappeared behind the clouds. We noticed that they must have been at different altitudes since they disappeared at different intervals with the closest one to us, last. The encounter lasted around 2 minutes. However, I don't know how long they were there before I noticed them. So I cannot tell if they had descended thru the overcast and sat there for a while and went back up. Or if they had been flying under the overcast and sat there before a saw them, then ascended thru the overcast. All I know is when I spotted then, they were not ascending or descending, they were hovering spread thru the horizon. The reason I know they were spread thru the horizon is that the closest one to us was bigger than the other farther away. My wife brought the digital camera with her but I was unable to take pictures because the camera kept on trying to focus on the tall tree in front of us and it did not let me take the picture in spite of the fact that I press the shutter button many times. I had my IPod touch and starting videotaping. I could not see anything thru my IPod's screen so I assumed that for some reason it wasn't recording so I stop (came to find out later, it had recorded some). The expletive you hear is me frustrated with not been able to document the event. I counted from this very short video and from what I recall at least 10 of the red bright lights. The event is driving us crazy. I sent an email to the local paper asking if someone else reported them to the local or county authorities but I have not received any response. Last, a word on the video. It's better if you viewed on a computer monitor with lights off. Where the video stops you can count the other lights, keep in mind some of then are not visible due the tall tree in front of the lights."],"Summary":"Sighting of a group of (approximate 10 or more lights) hovering red lights at different altitudes","Disposition":"Unresolved","Tags":"City","City":"Goshen","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"02/10/2012 07:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.589922,+-85.831758(35603)&iwloc=A&hl=en\"> mufon case (35603) map </A>","files":["/var/www/straped/mufon/html2text/35603.html.txt","/var/www/straped/mufon/org/35603.html"],"Case Number":"35603","Latitude":"41.589922"}