{"Weather Factors":"Unknown","Region":"South Carolina","Object Features":"None","divs":["Sighting DetailsAs I was driving home on the night of the sighting, I observed a bright light in the sky, like a star but lower and brighter. It was still in the same place an hour later when I arrived and when I asked my husband to come outside to see something, he immediately told me that he had noticed it as well. It stayed in the same part of the sky for several hours, but it moved quickly from side to side and seemed to come towards us and then recede. We noted that it was in the opposite direction from the Air Force base. I initially thought it was a star or satellite, or perhaps an airplane but its movements ruled out all of those possibilities. I do not know how long it stayed there as we went indoors shortly thereafter. A few weeks later I asked a friend about weather balloons and if they were ever launched from the Air Force base. He wondered why I would ask such a thing and when I told him of our experience, he verified that others had also seen and reported the sighting and that he'd read about it in the newspaper. The interesting thing is that my husband and I saw the same thing in the same part of the sky a few years ago. I was not frightened but simply amazed, both times. I have mentioned this only to a few friends and relatives, one of whom directed me to the MUFON website."],"Country":"United States","Case Number":"35615","Date of the Event":"01/15/2012 12:00 UTC","Viewing Distance":"Over One Mile","City":"Charleston","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.778586,+-79.922132(35615)&iwloc=A&hl=en\"> mufon case (35615) map </A>","Latitude":"32.778586","Summary":"A star--like light darted from side to side and forward and back.","Longitude":"-79.922132","files":["/var/www/straped/mufon/html2text/35615.html.txt","/var/www/straped/mufon/org/35615.html"],"Log Number":"US-02102012-0017","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around January 15th 2012"],"Date Submitted":"02/10/2012 10:56 UTC","Sighting Duration":"Undisclosed","Object Shape":"Star-like"}