{"Date Submitted":"02/10/2012 05:12 UTC","Disposition":"Unresolved","City":"Milton Keynes","Object Flight Path":"Straight-line path","Sighting Duration":"00:05:00","Object Features":"None","Country":"United Kingdom","Region":"England","files":["/var/www/straped/mufon/html2text/35610.html.txt","/var/www/straped/mufon/org/35610.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=52.045031,+-0.747772(35610)&iwloc=A&hl=en\"> mufon case (35610) map </A>","divs":["Sighting DetailsOn way home from work i noticed two bright orange lights towards the south of milton keynes between the houses. as i walked around the corner and took another look they seemed to be a bright unusual orange glow, not like a plane or anything i have seen in the sky before. as i walked up hill i kept looking back and noticed another. 3 perfectly spaced almost in a s formation. thought may be aircraft but as i got further up the hill toward the hub area of central milton keynes i couldnt help but keep looking back. then i noticed one dirctly above me, very high, as i looked back toward the three lights i had noticed first i saw 3 more in exactly the same \"s formation\" between the high level one on its own and the first group. perfectly spaced, no sound from engines or rotas, just almost hanging in the air, as i looked up at the single light it moved into the clouds and the lights dimmed and i could make out a grey ball like object then it either gained hight so couldnt see or went into the cloud cover. as i looked back the other six had gone. where or how so quick i do not know as i had a wide range of view of sky from central milton keynes to brickhill woods. aside from this i saw a grey almost transparent object about the size of a people carrier moving low over the main rail station oly 10 mins after seeing the lights. never seen anything like this before. am almost in shock at the moment. be great to know if anybody else witnessed this."],"Weather Factors":"Unknown","Log Number":"GB-02102012-0012","Summary":"group of lights moving slowly in s type formation south to north","Longitude":"-0.747772","Source":"MUFON","Latitude":"52.045031","Case Number":"35610","Date of the Event":"02/10/2012 06:10 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","trends":["There has been one other sighting in Milton Keynes","There were no other sightings in Milton Keynes on or around February 10th 2012"],"Object Shape":"Saturn-like, Sphere, Star-like","Tags":"City"}