{"divs":["Sighting DetailsHi! This sunset sighting differs in that most of the orb pictures are usually round! Leaving some to believe a possible reflection, lense flare, or glare! This will defy that logic! WHY! Because close examination will exhibit a HALF ORB! Notice the \"grove in the half orb* which is visible in all three consective decending pictiures. There were 5 in sequence. But i could only upload 3. So i chose the 3 that show the widest spread in a few seconds of quick picture shoot. There were more pix of it falling. The BROKEN UNIFORM ORB WITH THE GROVE! Cannot be confused with a reflection or feedback of something \"round!\" Unlike the usual round orbs. I have a similar posted pix of an orb, white splitting in half posted!. Another orb transforming into four orbs, over a very sharp clear picture of a line chemtrail. Gives clarity to the immediate area. Proving it's not a blurry glich. So i feel this sequence of thre broken half orbs over Whittier, give more proof of the odd anomalies. The direction angle never changed. Please look closely at the exact formation of the cracked area, as it is consistant to the other falling sequential pictures. G.A. from Whittier!"],"Sighting Duration":"Undisclosed","Longitude":"-118.030724","files":["/var/www/straped/mufon/html2text/35620.html.txt","/var/www/straped/mufon/more/35620_submitter_file1__2012-02-03_17-04-34_712.jpg","/var/www/straped/mufon/more/35620_submitter_file2__2012-02-03_17-04-03_78.jpg","/var/www/straped/mufon/more/35620_submitter_file3__2012-02-03_17-03-58_125.jpg","/var/www/straped/mufon/org/35620.html"],"Object Shape":"Other","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Case Number":"35620","Latitude":"33.985089","Object Features":"Patterned Surface","Region":"California","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"02/11/2012 10:29 UTC","Log Number":"US-02112012-0005","Summary":"This is a rare haf orb! And is falling sequential pix","map":"<A HREF = \"http://maps.google.com/maps?q=33.985089,+-118.030724(35620)&iwloc=A&hl=en\"> mufon case (35620) map </A>","Object Flight Path":"Straight-line path","City":"Whittier","Country":"United States","Date of the Event":"02/03/2012 12:00 UTC","Tags":"City","trends":["There have been 27 other sightings in Whittier","There were 2 other sightings in Whittier on or around February 3rd 2012","This sighting has never been favorited.",""]}