{"Tags":"City","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Case Number":"35627","Object Flight Path":"Path with directional change","Latitude":"33.620858","Summary":"Saw three \"meteor like\" objects that fluidly changed direction.","Country":"United States","trends":["There have been 13 other sightings in Peoria","There were no other sightings in Peoria on or around February 9th 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/35627.html.txt","/var/www/straped/mufon/org/35627.html"],"Region":"Arizona","Source":"MUFON","Log Number":"US-02112012-0012","map":"<A HREF = \"http://maps.google.com/maps?q=33.620858,+-112.251726(35627)&iwloc=A&hl=en\"> mufon case (35627) map </A>","Object Shape":"Fireball","City":"Peoria","Sighting Duration":"Undisclosed","Date of the Event":"02/09/2012 12:00 UTC","Date Submitted":"02/11/2012 06:36 UTC","Longitude":"-112.251726","divs":["Sighting DetailsI was with a group of friends at Cold Stone (ice cream restaurant). We had just left the restaurant and were standing in a circle talking in the parking lot. I was facing southeast when I was the first to notice the object in the sky. At first glance it just appeared to be a shooting star but it was moving very slowly and then it clearly changed directions. I told everyone to turn around (there were 4 of us total). We watched the object for a few seconds when we noticed that a second object had appeared below the first. They were both \"drifting\" back an forth.At this point I pulled my iphone out and frantically began trying to film them. When I started filming a third object appeared (as can be seen in the video I uploaded). The video makes it hard to see, but all three of the objects had a short tail and were slowly drifting or \"dancing\" back and forth. I was freaking out and inadvertently drawing a lot of attention (as can be heard in my video). There were other witnesses in the parking lot, a couple of ladies are seen asking us what they were in the video. Before I started filming, another group of people wrote off the objects as being, \"just meteors\". The objects clearly were not meteors. They disappeared one at a time and just seemed to burn out or fade away. Roughly 3 minutes after the incident there was a fireworks show about 30 degrees west and much much lower to the ground than the lights had appeared. I do not think the sightings were related to the fireworks, they lasted too long and did not behave like any fireworks I have ever seen, they were also long gone by the time the fireworks started and were in the completely wrong part of the sky. Roughly 10-15 minutes after the event, I was driving due north when a row of 3 fighter jets flew straight past me heading in the exact direction that the lights had been seen. We were relatively close to Luke Air Force Base, but jets rarely fly directly over the city, and they were low and fast. At the same time as the jets flew past me, a helicopter flew directly overhead going northwest (not toward the event). I do not think the helicopter was related to the event, but I have suspicions that the jets might be."],"Weather Factors":"Unknown"}