{"divs":["sighting detailsdecember 25th, 2011, around 10:30 pm, i was driving home, heading down woodbury\\glassboro road, about to turn right onto rt. 47 (delsea dr.) my wife said \"oh my god, what is that?\" then i looked up and seen about 10 orbs floating in a formation across the sky. i briefly slowed down to observe them, but then quickly turned into the nearest parking lot and jumped out of the vehicle. i took a few photos and a couple short videos with my wifes digital camera. there were numerous cars pulled over along the road observing the event as well, then another car stopped next to us and were asking \"what's going on?\" the red glowing orbs appeared to be floating in a formation type pattern, then they began to disappear a few at a time, leaving some behind, then they disappeared as well. they seemed to either fly away, or just turn invisible...was hard to tell. many of the orbs turned away and disappeared very quickly, so i only captured a couple objects on video. the pictures i have on the other hand are quite interesting. a few other objects appeared after i uploaded the photos and zoomed in closely, these we did not see during the event. we have not disclosed these photos or videos to anyone but close family and friends, and after numerous people said we should contact someone...well, here we are. hope to hear from you soon, i would love to get the photos looked at by a professional, so we can be certain what is on there. give thanks for your time and consideration. j.a.g."],"Case Number":"35621","Object Features":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Glassboro","There were no other sightings in Glassboro on or around December 25th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Tags":"City","Latitude":"39.706555","Summary":"Driving home christmas night, my wife and I saw numerous orbs of light in the sky","Object Shape":"Boomerang, Cylinder, Sphere, Other","Date of the Event":"12/25/2011 10:30 UTC","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-75.111045","City":"Glassboro","Date Submitted":"02/11/2012 11:18 UTC","Log Number":"US-02112012-0006","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.706555,+-75.111045(35621)&iwloc=A&hl=en\"> mufon case (35621) map </A>","Region":"New Jersey","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/35621.html.txt","/var/www/straped/mufon/more/35621_submitter_file3__DSC02090.JPG","/var/www/straped/mufon/org/35621.html"]}