{"Date Submitted":"02/12/2012 12:06 UTC","Source":"MUFON","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Summary":"Saw object with four lights dash across the sky. Driving home from work saw same object trail my vehicle while seeming to hover. In a dash the object fell like a shooting star and went into the water like it was absorbed. I thought it was a comet","Disposition":"Unresolved","Case Number":"35636","Region":"Florida","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/35636.html.txt","/var/www/straped/mufon/org/35636.html"],"divs":["Sighting DetailsI was driving home from work on the south end of Boca Grande Island when I saw what looked like a shooting star stop in the sky. It showed four lights once and then not again.I made a few assuming thoughts in my head thinking it was talking to me and continued driving. Almost the time I made it to the only bridge off the Island, the object appeared again in my 3 oclock position. as I was looking out the passenger side of my vehicle I felt as if it was communicating with me. I kept driving and the object, having four lights in the distance, began to appear as what seemed to be a comet heading right towards the road. I was afraid that it was going to cause an explosion and veered off the road. At this time the object looked as if it fell into the water. There were very small waves, like I threw a rock, but not much larger, and I thought \"wow\" it was trying to scare me. It did."],"Country":"United States","Object Flight Path":"Hovering then path","Latitude":"26.731981","map":"<A HREF = \"http://maps.google.com/maps?q=26.731981,+-82.262104(35636)&iwloc=A&hl=en\"> mufon case (35636) map </A>","Object Shape":"Fireball, Flash, Star-like","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Boca Grande","There were no other sightings in Boca Grande on or around January 13th 2012"],"Log Number":"US-02122012-0001","Longitude":"-82.262104","City":"Boca Grande","Tags":"City","Date of the Event":"01/13/2012 12:00 UTC"}