{"Case Number":"35637","Summary":"perfectly sphere shaped solid object with highly reflective metal surface","Country":"United States","Object Flight Path":"Hovering then path","Disposition":"Unresolved","City":"St Louis","files":["/var/www/straped/mufon/html2text/35637.html.txt","/var/www/straped/mufon/org/35637.html"],"Object Shape":"Sphere","Region":"Missouri","Weather Factors":"Unknown","Date Submitted":"02/12/2012 01:12 UTC","Longitude":"-90.405801","Latitude":"38.4533","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around February 2nd 2012"],"Tags":"City","Log Number":"US-02122012-0002","Sighting Duration":"00:01:00","Source":"MUFON","Date of the Event":"02/02/2012 12:00 UTC","divs":["Sighting DetailsLeaving the Cracker Barrel restaurant with my Mom, step Dad, friend and friends son in my step dads truck, my Mom hit me and said look over there. I look to where she was pointing and spotted a perfectly spherical shaped craft with a highly reflective surface. It look to be between two and two half miles away from are position. We were driving down Heimos Industrial Park Drive looking west. The object was hovering between Meramec Bottom Road and Lemay Ferry. We watched the object hover for about 1 minute and right as the object started to move down, we past in front of a building high enough to block are view. As soon as we past by the building the object was gone and no where to be seen. We stopped the vehicle stepped out and took a look around in hopes to see it and get a picture or video but was unsuccessful. For what I could tell was this object was quiet large do to the fact how big it looked for the distance it was from are location. Also could tell it was no balloon or air craft. It was way to round and a smooth surface that reflected the sun very well. Also a balloon or air craft would not move down and then just disappear in just a few seconds time. I know others in the area have had to seen this object. It was a very clear, sunny, cold day without a cloud in the sky. Any object in the sky this reflective would catch anyone's eye."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.4533,+-90.405801(35637)&iwloc=A&hl=en\"> mufon case (35637) map </A>","Viewing Distance":"Over One Mile","Object Features":"None"}