{"Source":"MUFON","Region":"California","Object Shape":"Unknown","Date Submitted":"02/11/2012 08:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.189533,+-118.321653(35630)&iwloc=A&hl=en\"> mufon case (35630) map </A>","Object Features":"Dome, Window(s), Unknown","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Date of the Event":"07/11/1954 03:00 UTC","Log Number":"US-02112012-0015","Country":"United States","files":["/var/www/straped/mufon/html2text/35630.html.txt","/var/www/straped/mufon/more/35630_submitter_file2__IMGP0135.JPG","/var/www/straped/mufon/org/35630.html"],"Tags":"City","Longitude":"-118.321653","Sighting Duration":"00:15:00","trends":["There have been 39 other sightings in Burbank","There was one other sighting in Burbank on or around July 11th 1954","This sighting has never been favorited.",""],"City":"Burbank","Latitude":"34.189533","Disposition":"Unresolved","divs":["sighting detailsthey appeared as little old man when i was 7. then showed me a sick body down in the bed. they told me this incarnation would be rough and gave me an option, saying they would protect me from all ills. if i would not despair and commit suicide, and live the life, i would attain a great status. what that is\\was, i have no idea, but i opted to stay in the body. i put up with my parents drinking, fighting, various illnesses-scarlet fever, etc. at death's doorstep within leukemia, but they had promised me help, and i had full faith in them.i had my only son at age 40 and suffered renal failure a year after. they saw me thru' this with 6 litho-tripsies, two episodes of pneumonia, etc. in '79 while living here with mother, they spoke into my 3rd eye:\" awake! awake! we are mad at you!\" i took this to mean i needed to take a special mate to pass on a very special genetic code, one passed on from my father to me by \"the aliens\", but it frightened him to near death! i did leave, found my mate, and we had our son! before i left ark i was visited by them...without seeing them, but hearing odd synthenic sounds, was paralyzed, lifted from my bed, taken in full body up thru' the roof and through a spectrum of black with incredibly fast speed thru' what i can only describe as stars. then, a blackout! some \"protector\", at my left...i begged to return. he (he?) re-turned me, and i could feel my head touch my pillow. were they strenghtening me for my journey from ark to pa ? i trusted them implicitly! in '92 i had the chance to see four of them coming thru' my window! i slept midroom while husband slept front room! i still have this 11x12 inch rendering. i am sorry to have skipped around so. these are not bad experiences borne of horror! i beg for you to know this!! i am a woman of 65, and think of nothing other than kindness from my \"little old man\". after all, they came to me at age 7! if it were all a dream, would i have recalled it all these decades? how many amoung you can have vivid recall of a dream that visited you at age seven? my best to all! protect the planet,take care of the young, and plant trees!!!!p.s. my only sketch '92 \"strangers in the night\" will not reproduce. this is not a joke."],"Object Flight Path":"Straight-line path,Other,Unknown","Case Number":"35630","Summary":"first happened when i was 7; then on regular basis most of my life.IN different forms. Mostly experiences are positive and rewarding!"}