{"Summary":"Large orb seen ascending just north of Mount Hood as seen from vancouver.","Tags":"City","Disposition":"Unresolved","Object Features":"None","Country":"United States","divs":["Sighting DetailsJust got on highway 14 out of downtown vancouver at about 10:45-10:50. I see in the distance on the eastern horizon just north of mount hood the top 20% of an orange glowing orb which at the time looked like a comet with an a arced tail. I quickly pulled off of highway 14 and turned into the parking lot at Beaches restaurant an ran out to the walking path on the waterfront of the Columbia river. The orb was out of my sight for about 2 full minutes. When I saw it again I could now only see the bottom 30-35% of the orb as it was rapidly ascending into the sky. From that point it was only 30 seconds before the whole thing disapeared as if behind a curtin. It was a mostly cloudless night and there were the ever present airplanes landing at the Portland airport across the river. I thought it must have been the moon at first but the orb raised into the sky and disapeared much quicker than the moon ever moves. It was in the same part of the sky as mount hood as seen from vancouver or portland. I am sure any news weather cam that was trained on mount hood at the time would have caught it. I was able to snap two pictures of the orb in the sky from the walkway directly behind beaches restaurant. The orb can be seen as a semi circle in the pictures not to be confused with the two full circles of light in the pictures which are lights on the restaurant. I have lived in Vancouver, WA. my whole life and I have seen thousands of aircraft land at PDX. I have witnessed many things in the sky here including a Chinese kite with flashing LED lights directly over my neighborhood that has been reported to MUFON as a UFO. But from the moment I first saw it I was sure that this was unlike anything I have ever seen before."],"Region":"Washington","Sighting Duration":"Undisclosed","Latitude":"45.647458","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=45.647458,+-122.657756(35639)&iwloc=A&hl=en\"> mufon case (35639) map </A>","Log Number":"US-02122012-0004","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Unknown","Case Number":"35639","City":"Vancouver","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around February 11th 2012","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/35639.html.txt","/var/www/straped/mufon/more/35639_submitter_file1__ORB.jpg","/var/www/straped/mufon/org/35639.html"],"Date of the Event":"02/11/2012 10:50 UTC","Date Submitted":"02/12/2012 03:26 UTC","Object Shape":"Circle","Longitude":"-122.657756"}