{"trends":["There have been 12 other sightings in Leeds","There were no other sightings in Leeds on or around January 20th 2011","This sighting has been favorited 2 times.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=53.775321,+-1.559841(35644)&iwloc=A&hl=en\"> mufon case (35644) map </A>","Date of the Event":"01/20/2011 07:15 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/35644.html.txt","/var/www/straped/mufon/more/35644_submitter_file1__P1030415.JPG","/var/www/straped/mufon/more/35644_submitter_file2__P1030420.JPG","/var/www/straped/mufon/org/35644.html"],"Viewing Distance":"Over One Mile","Latitude":"53.775321","Date Submitted":"02/12/2012 09:00 UTC","City":"Leeds","Weather Factors":"Unknown","Country":"United Kingdom","Sighting Duration":"Undisclosed","Case Number":"35644","Object Shape":"Fireball, Sphere, Star-like","divs":["Sighting DetailsWhen I was closing the front door after coming home from work, I noticed a bright orange light in the sky, it looked quite a long way away but was very bright. I've seen plenty of helicopters and planes flying over crossflatts park over the years and even satellites being moved and this thing was nothing like anything I have ever seen before. Looking towards Leeds it moved slowly from left to right, I watched it for a few minutes and then ran upstairs for a better view from the attic and grabbed my HD video recording camera. Even on 16x optical zoom it was still quite a distance away because on maximum zoom it was still just a bright spherical object. It was a very pale orange colour and appeared to slowly shift colour from fleshy pink to pale orange. It made no sound at all, when ive watched police helicopters searching for people from a distance you can at least hear their engines echoing while theyre in the air. The object was moving in the opposite direction that incoming planes use when they're coming in to land at the Leeds and Bradford airport. The strangest thing was that it would sporadically stop dead in the sky and then carry on moving. And at one point it was to the east in the direction of crossflatts park then dissapeared and reappeared NNE in the direction of Leeds city center, so there were either two of them that flew identical paths in the sky or the same thing that moved very fast in the blink of an eye. When looking carefully at the recorded video I was able to save individual frames and zoom in on the object. On closer inspection it appeared to be be sphere with small bumps clustered around it. Either clustered bumps or a sphere with lights of various intensity on it, making it look like it was clustered with smaller objects. And it also looked like a ball of fire because you can make out what looks to be sparks or flames licking off of it. The most bizzare thing is that i didnt just lose it from focus, on closer inspection of the video on the pc, the object actually skips through the sky a short distance then quickly does a U-turn and dissapears at an alarming rate in the opposite direction. A second or so after it leaves, there is a faint noise almost like the crack of a sonic boom. I have seen Iridium flares, chinese lanterns, search helicopters and plenty of planes over the years but none of them looked like what i recorded. (I have uploaded the original large MTS file that my camera generated. Without converting it, the only media player that I can watch it with is VLC media player. Hopefully you will be able to take a closer look at the object and perhaps enhance the video. Fortunately it was a very clear night with only the moon out.)"],"Longitude":"-1.559841","Summary":"I observed a slow moving bright ball of fire, recorded it moving for a few minutes, it moved then stopped and skipped across sky and sped off at high speed","Source":"MUFON","Log Number":"GB-02122012-0009","Region":"","Tags":"City","Disposition":"Unresolved","Object Features":"None"}