{"Viewing Distance":"Over One Mile","trends":["There have been 47 other sightings in Sedona","There were 2 other sightings in Sedona on or around July 12th 2009"],"Source":"MUFON","City":"Sedona","Country":"United States","Date of the Event":"07/12/2009 12:00 UTC","Object Shape":"Unknown","divs":["sighting detailsbell rock, courthouse butte and lee mountain sit outside our patio. that is our view 254\\7. (unless fog) this day was clear and beautiful out. i was sitting in dining room working on the computer on a sat\\sun. in my left periphial, i saw what i thought was a white flying bug about to get into my eye. then i determined it was in the arizona room and continued to focus on my work without checking. something made me look up and a second later, i turned to look again and this little whitish thing was flying outside between the slats of the horizontal wooden blinds. i got up and went out to the patio and realized it was a humonoid figure without a powerpack of any sort and it flew from the left (from my perspective) from the far left of lee mountain and between, courthouse and even more pointedly, between what is known as ufo rock and lee mountain. ufo rock is to the right of llama trail if you are looking at lee mountain from the trail perspective. my bf's mom came out and she asked what i was looking at, she saw it too, but (i don't know if she would come out and state that she did) it moved very intended without sways, dips. it did not descend or ascend, very horizontal path and went into the mountain side... just before the rock formation known as rabbit ears. it may have had sound, but from where we were outside, no sound and it looked very humanoid without a powerpack. i thought it was cool, cause i am pretty open to the possibility of what there is for us to learn about other life forms within our earth or outer space. i didn't tell a whole lot of people, as my bf's family at the time were very private."],"Longitude":"-111.75421","Case Number":"35648","Object Flight Path":"Path with directional change","Region":"Arizona","Sighting Duration":"Undisclosed","Summary":"Off White Humanoid flew from where Lee Mtn starts and btwn Lee Mt & CrtHse and into Lee Mtn","Log Number":"US-02122012-0013","Latitude":"34.87874","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=34.87874,+-111.75421(35648)&iwloc=A&hl=en\"> mufon case (35648) map </A>","files":["/var/www/straped/mufon/html2text/35648.html.txt","/var/www/straped/mufon/org/35648.html"],"Object Features":"Other","Date Submitted":"02/12/2012 04:58 UTC","Tags":"City","Weather Factors":"Unknown"}