{"Summary":"It was big, Bright, and fast. Unbelievably fast!","Longitude":"-84.602088","Sighting Duration":"00:01:01","trends":["There have been 7 other sightings in Kennesaw","There were no other sightings in Kennesaw on or around February 12th 2012"],"City":"Kennesaw","map":"<A HREF = \"http://maps.google.com/maps?q=34.039609,+-84.602088(35653)&iwloc=A&hl=en\"> mufon case (35653) map </A>","Country":"United States","Region":"Georgia","Tags":"City","Log Number":"US-02122012-0016","Date Submitted":"02/12/2012 08:48 UTC","Date of the Event":"02/12/2012 07:15 UTC","Case Number":"35653","Object Flight Path":"Straight-line path","divs":["sighting detailsit was approx. 7pm 2\\12\\2012 my fiance an i were coming home from visiting a friend.we were coming up our street i believe this would be east,as we got about 150-200 ft. from our driveway right above us out of nowhere was this big bright light headed in the same direction we were.it was about 500ft above tree level.maybe a little more.it was the brightest thing iv'e ever seen. it was a pale yellow, green ,white light.it was very big.it was going faster than anything iv'e ever seen.it wasn't a meteor, it wasn't a jet, and it wasn't a falling star.as it passed and went ahead it appeared to disappear. but it could have been going so fast that we just got the imprecision that it disappeared.that's how fast it was.there is a small airport near my house. this was nothing that came from there. there were some air plains in the sky, but they were so high all we could see were the lights blinking. we saw the air plains after we got out of the car standing in the driveway, in shock of what we had just seen.i'm still trying to comprehend what i just saw. it was so bright and so fast. it was amazing!all i can say is if it was a shooting star, it crashed to the ground to the east of kennesaw ga. and i haven't heard anything yet.there was no sound. and i know this, because i was smoking a cig. and i had my window cracked."],"Disposition":"Unresolved","Object Shape":"Other, Unknown","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Latitude":"34.039609","files":["/var/www/straped/mufon/html2text/35653.html.txt","/var/www/straped/mufon/org/35653.html"],"Weather Factors":"Unknown","Source":"MUFON"}