{"Country":"United States","Latitude":"37.119621","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/35655.html.txt","/var/www/straped/mufon/org/35655.html"],"Region":"Utah","Case Number":"35655","map":"<A HREF = \"http://maps.google.com/maps?q=37.119621,+-113.595137(35655)&iwloc=A&hl=en\"> mufon case (35655) map </A>","Log Number":"US-02122012-0018","Date of the Event":"11/10/2010 10:00 UTC","trends":["There have been 5 other sightings in Hurricane","There were 4 other sightings in Hurricane on or around November 10th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:05","Summary":"chevron shape grey apearance with attatched grey orbs on rear of craft","Source":"MUFON","divs":["Sighting DetailsI was outside at my home and it was late in the evening around ten oclock. There were some clouds scattered around. the stars are bright and I take walks at night and look at the stars and enjoy the walks. Off in the distance the only lights in the area are from walmarts parking lot. which is about 200 feet from where I live. Above the parking lot lights in the sky are some clouds slightly lit up from them. I noticed some movement and looked in the clouds above walmart. I first thought it was a flock of birds flying in a V shape. Then I saw it was too large and saw the light from the parking lot reflect its flat grey apearance> It was V shaped with maybe four orbs of the same grey color attatched to the back side of the v shape. It was also very brick like in shape. It was boxy not very aerodynamic in nature. It had a patern of something like a grid patern on its underside. I could easily draw the craft if I was ordered to duplicate it. A month later or so I saw something of the same nature flying the same way and the same direction, it also had the same patern grid underside and grey apearance. I lived in a city that was close to the bottom of the state of Utah and these objects flew or glided up state along state 9 hwy. These object flew low and flew into the cloud cover and also had no lights at all. They had a flat grey apearance as though they did not want to be seen because that is a good was to avoid being seen by not having a relective body or lights. They made so sound. They had no contrails and theyre speed was aprox., 90 to 120 I think. That is all I can recount."],"Longitude":"-113.595137","Object Shape":"Chevron","Disposition":"Unresolved","Tags":"City","Date Submitted":"02/12/2012 10:43 UTC","City":"Hurricane","Object Features":"Dome, Patterned Surface, Other"}