{"Object Features":"Appendage(s), Wings","Object Flight Path":"Straight-line path,Other","Latitude":"41.085433","Region":"Indiana","City":"Fort Wayne","Source":"MUFON","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around July 10th 2005"],"Case Number":"3568","Date Submitted":"07/10/2005 11:30 UTC","Object Shape":"Oval, Other","Weather Factors":"None, Does Not Apply","Tags":"City","Viewing Distance":"Unknown","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=41.085433,+-85.131521(3568)&iwloc=A&hl=en\"> mufon case (3568) map </A>","Longitude":"-85.131521","Date of the Event":"07/10/2005 11:30 UTC","files":["/var/www/straped/mufon/html2text/3568.html.txt","/var/www/straped/mufon/org/3568.html"],"Country":"United States","divs":["Sighting Details Skywatching on open porch area in back yard with a friend. We were playing our digerydoo. I had put mine down and we were starring up at the sky. The sky was clear and we could see plenty of stars. The ufo came into my line of sight as it moved overhead, I was surprised to see this and said 'look at that\" as I pointed to where I was looking. He did not see it as it was gone in 5 seconds. It flew in a straight line and seemed to be self luminous ,giving off a pinkish orange light and had what looked like wings that I clearly saw vibrating. The object came into my view when I first noticed it.I first thought it looked like an organic form as the wings were more vibrating than flapping. I was very surprised and pleased to have seen it,and actually said outloud. \"can you make another pass again or a return trip in the opposite direction\" The object simply vanished from my sight. As MUFON IN ASD I was very happy to have seen this. It is the second time I have had a sighting from my back yard. The first being in 1999. I am also a part of the ICCRA. we have been to some crop circles lately, so the next day we were looking on the internet for the latest designs in England. We found one at Silbury Hill had just been reported on July 9. The design is very similar to the shape of the ufo that I had seen. Roger Sugden ASD"],"Sighting Duration":"Undisclosed","Log Number":"US-07102005-0008","Summary":"self luminous football shapewith wing like appendage moving straightline to nw"}