{"files":["/var/www/straped/mufon/html2text/3571.html.txt","/var/www/straped/mufon/org/3571.html"],"Date of the Event":"07/11/2005 10:53 UTC","Country":"United States","Log Number":"US-07122005-0001","Sighting Duration":"00:00:10","Weather Factors":"Unknown","Latitude":"40.484977","Tags":"City","trends":["There have been 2 other sightings in Steamboat Springs","There were no other sightings in Steamboat Springs on or around July 11th 2005"],"divs":["Sighting DetailsMy girlfriend and I were laying down at the base of Steamboat mountain to look for satellites and shooting stars. Had spent about 20 minutes tracking various satellites when we both noticed almost instaneously, 2 vaguely (triangular?) shapes moving quickly South to North along the same general backround as the milky way. The shapes were about three times the size of the satellites we were tracking and about half as bright. both objects were side-by-side and moving significantly faster than the satellites we were tracking. once we had adjusted to their flight path, a 3rd similar object came from the west and \"met up\" with the other 2 objects in a diagonal path. we tracked the 3 objects for another second or so before they were sufficiently to the North that we could not see them anymore. Total viewing time was approx 8-10 seconds. There were no observable lights or fluctuations in the flight path. We both talked about the experience for about 10 minutes and agreed that they were not satellites (larger and faster moving), birds (uniform speeds and trajectories) or airplanes (no lights, sounds and faster)."],"Region":"Colorado","Summary":"3 objects noted flying south to north","map":"<A HREF = \"http://maps.google.com/maps?q=40.484977,+-106.831716(3571)&iwloc=A&hl=en\"> mufon case (3571) map </A>","Object Features":"None","Case Number":"3571","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-106.831716","Source":"MUFON","Object Shape":"Triangle","City":"Steamboat Springs","Object Flight Path":"Straight-line path,Path with directional change","Disposition":"Unresolved","Date Submitted":"07/11/2005 10:53 UTC"}