{"files":["/var/www/straped/mufon/html2text/35769.html.txt","/var/www/straped/mufon/org/35769.html"],"Region":"Florida","trends":["There have been 7 other sightings in North Port","There were no other sightings in North Port on or around November 30th 1978"],"Date of the Event":"11/30/1978 12:00 UTC","Log Number":"US-02132012-0108","Case Number":"35769","Country":"United States","divs":["Sighting DetailsI'm a trained aviation weather observer who is familiar with both civil and military aircraft and a wide variety of meteorological phenomena. @27degrees 03'21.84\"N 82 degrees 14'59.49\" W, after sunset in late November or early December of 1978 I was with a friend at that approximate location. It was long enough after sunset that there was complete darkness. The night was clear and visibility was unrestricted, also at that time the moon was not in the sky. At about 270 degrees (west) I noticed a line of red and orange lights blinking in a \"chase\" pattern low on the horizon moving from the south to the north. There were other aircraft in the sky during this time period displaying the normal red, white and green anti-collision lights, none of the aircraft were in the immediate vicinity of the sighted phenomena. The object (?) made absolutely no noise and neither changed altitude nor appeared to change its' course. I observed it until it was lost from sight by distance. Due to the darkness I was unable to determine the shape of the object. What I can say is that it was definitely not a fixed wing or rotary winged aircraft as it was completely silent. Due to the darkness both distance and altitude were impossible to accurately estimate. For years I told myself that maybe it was a blimp with some sort of light array attached to it, however a blimp would still have displayed anti-collision lighting and the horizontal stabilizer at the rear of a blimp would have interfered with the light pattern. When I pointed out the object to my friend, even he was taken by the fact that it made no noise and after it went out of sight he admonished me to never speak of this again with him. My feeling about this has always been one of curiosity, I would love to know what it was that I observed."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.046174,+-82.226375(35769)&iwloc=A&hl=en\"> mufon case (35769) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","City":"North Port","Weather Factors":"Unknown","Tags":"City","Longitude":"-82.226375","Summary":"Red and orange \"chase\" pattern of lights","Object Features":"None","Object Shape":"Other, Unknown","Viewing Distance":"Unknown","Date Submitted":"02/13/2012 11:52 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Latitude":"27.046174"}