{"Object Features":"Unknown","Object Flight Path":"Stationary","Date Submitted":"02/13/2012 12:30 UTC","Object Shape":"Triangle","Longitude":"-68.432001","Weather Factors":"Unknown","City":"Ellsworth","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.555355,+-68.432001(35772)&iwloc=A&hl=en\"> mufon case (35772) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-02132012-0111","Summary":"My husband and I witnessed three giant white lights in a triangle formation with 1 red smaller light in the center.","Latitude":"44.555355","Case Number":"35772","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy husband and I were driving on the Bangor Rd, heading into Ellsworth. While driving bright lights caught my eyes to the right but well in front of me. I thought at first that there was a fire in the distant tree line, or perhaps I was seeing a cell tower or even a low flying plane. I watched these lights and noticed they were NOT blinking the way a tower or plane would. I brought what I was seeing to the attention of my husband. We both began questioning what we were seeing. I told him to get the video camera (we had just come from a sporting event), and although he had tried to record it, the camera kept saying the lense cap was on (which it was not). As we approached it more, it was evident how HUGE these lights were. The object was far too low to be a plane and none of the lights blinked. There were 3 White lights in the shape of a triangle, with a smaller red light in the center. We knew it couldn't be a plane because 1) the lights didn't blink 2) There was NO noise coming from the lights, and we were pretty close to it. The object simply hovered in the sky while we drove by it. We could not see any \"craft\", simple the lights and blackness. We could not pull over to try to get a better look, because we were traveling in a LONG line of traffic, and the roads were a sheet of ice. I had tried to slow down and was almost rear ended. We crested the hill, and then we could no longer see the object. We didn't go back later that night because my husband had to get to work, and the roads were so bad. The next day, I drove back to the area where we saw the lights. There are NO cell towers at all in this area. (I had thought perhaps there might have been a new tower I wasn't aware of). The only towers that are in that general area are on Bald Mountain. While you can somewhat see those towers from the road, the lights they give off appear very small, they are all red, and they blink. This object had 3 SOLID WHITE LIGHTS that I could only visually compare to basketball size... which would make them HUGE in reality, and 1 sold red light that would be comperable to softball size (again, this would be huge, porportionately). Again, solid lights, no blinking, and it made no sound. My husband was in the passengers side and had a little better look, and he said there appeared to be a light trail of smoke or mist following it. After doing some research, the picture of the Belgian Triangle sighting is about as close to what we saw as I can get."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/35772.html.txt","/var/www/straped/mufon/org/35772.html"],"Date of the Event":"02/11/2012 09:35 UTC","Region":"Maine","trends":["There have been 3 other sightings in Ellsworth","There were no other sightings in Ellsworth on or around February 11th 2012"],"Country":"United States"}