{"Case Number":"35770","Weather Factors":"Unknown","trends":[],"City":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsI don't really know how to explain what is going on around here. I just know that I'm starting to get a bit fearful of what I've been seeing and hearing over the span of several months. It all started with a green laser I purchased some months back. Actually, its been over a year now. To make a years worth of stories short, I, along with a select few have seen bizarre lights and unusual craft in the sky do amazing things including Laser-to-UFO and UFO-to-Laser communication. Without fail, these craft show up every night I beckon them except on heavily overcast nights like last night which was also too cold to go out. I had gotten the kids to bed around 9:30 and started feeling drowsy at around 10:45 so I went to bed. Suddenly, I awoke with a jolt. I immediately thought a jumbo jet was taking off and flying directly over my house. I thought to myself \"My God that's loud! taking forever to go away\" as I tried to go back to sleep, but the rumbling was just too loud. Frustrated, I staggered over to the front door which faces East and opened to see where all that noise was coming from. The sky was heavily clouded and the roar of what seemed to be a dozen 747's was just slightly 45 degrees from the horizon North North East of my position at about 500+- feet out. I could tell that it was moving extremely slowly away from my position. As I stood in the jam of the door, I began to get a feeling of fear and dread as I knew this sound was not of a typical aircraft that I am familiar with. At that moment tiny drops of hail began to fall. The sound of the craft took a little over an hour to completely fade in the distance (around 3:30am). Very slowly, everything started to settle down and the air was calm and quiet again, But I cant forget that sound."],"Source":"MUFON","Region":"Louisiana","Log Number":"US-02132012-0109","Summary":"Intense and Massive Object heard but not seen!","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, Unknown","Tags":"City","Object Shape":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"02/13/2012 12:10 UTC","Country":"United States","Date of the Event":"02/13/2012 02:24 UTC","Object Features":"Other","Latitude":"31.247523","map":"<A HREF = \"http://maps.google.com/maps?q=31.247523,+-92.143824(35770)&iwloc=A&hl=en\"> mufon case (35770) map </A>","Longitude":"-92.143824","files":["/var/www/straped/mufon/html2text/35770.html.txt","/var/www/straped/mufon/org/35770.html"]}