{"Date Submitted":"02/13/2012 08:30 UTC","Viewing Distance":"Unknown","Region":"South Carolina","Summary":"Large orange orb - no parabolic trajectory or engine- glided past us and flew into outer space","divs":["Sighting DetailsMy and three friends were camping outside of Beaufort, VIC, Aussie. At around 5 in the morning (2009) we all witnessed an orange orb traveling through the sky, starting about 30 degrees above the horizon. It had not sound. I do not know which cardinal direction it was traveling, but it first appeared to our left (coming from behind us). It seemed to be moving slower than an airplane and had no parabolic trajectory. It seemed to either be very close as it passed by, (yet with no sound) and moving relatively slowly....or, if it was further away than we perceived, it would have also been dramatically larger than we thought. It is difficult to tell exactly how far away it was....but it was clearly a glowing orange sphere, with no trail. We then watched for approximately another 20 to 30 minutes as it slowly disappeared into the darkness of space. It obviously was not a plane since it did not fly towards the horizon or follow the curvature of the earth...we also know it was not a flare of some sort since it obviously was not launched..it flew at an angle of about 20 degrees upwards from the horizon, and gradually curved up into the blackness of the night. A good 20 minutes later, it was still a tiny spec in the sky...eventually we lost it when it became too small to see with the naked eye."],"Source":"MUFON","Tags":"City","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=32.439211,+-80.667809(35785)&iwloc=A&hl=en\"> mufon case (35785) map </A>","Weather Factors":"Unknown","Country":"United States","Longitude":"-80.667809","Date of the Event":"01/26/2009 05:00 UTC","Object Features":"Undisclosed","City":"Beaufort","trends":["There have been 2 other sightings in Beaufort","There were no other sightings in Beaufort on or around January 26th 2009"],"files":["/var/www/straped/mufon/html2text/35785.html.txt","/var/www/straped/mufon/org/35785.html"],"Disposition":"Unresolved","Latitude":"32.439211","Case Number":"35785","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"AU-02132012-0025"}