{"Object Shape":"Other","trends":["There have been 3 other sightings in Crowley","There were no other sightings in Crowley on or around June 15th 2005"],"Region":"Texas","Sighting Duration":"Undisclosed","City":"Crowley","Disposition":"Unresolved","Latitude":"32.517589","divs":["Sighting DetailsI and another individual entered my back yard on our way inside the house for supper when something caught my attention. I looked to the east out my yard and witnessed a strange orange glow. I asked my friend if he saw it as well and yes he did. I was not certain what this was but think it may be a natural event until the end of my siting. We stood and watched the glow for a couple of minutes to see if anything changed. When nothing changed my friend went inside while i stayed out. I felt compelled to keep an eye on whatever it was. I was glad i did.After about another 3 minutes or so the large orange glow started to changed. It began to shrink in size and to desribed what it looked like, i would say it was like a vacum trying to suck in smoke. The mass of orange shrank slowly over abount 2 minutes until it was very small and far in the distance. When it reached the smallest of points it was no longer orange but merely a white spot in a blue sky. After becoming so small and having changed color it flickered a few times and flashed quickly before blinking out. I was slightly worried about what i saw and what others would say, so about a year later i asked the other witness if he recalled seeing it and after several minutes of talking he finally said he had but not to bring it up again. He was afraid he would be taken as crazy. Total time observed was about 5 minutes."],"Tags":"City","Viewing Distance":"Unknown","Case Number":"35781","map":"<A HREF = \"http://maps.google.com/maps?q=32.517589,+-97.479801(35781)&iwloc=A&hl=en\"> mufon case (35781) map </A>","Source":"MUFON","Date of the Event":"06/15/2005 12:00 UTC","Object Features":"None","Object Flight Path":"Stationary","Log Number":"US-02132012-0029","files":["/var/www/straped/mufon/html2text/35781.html.txt","/var/www/straped/mufon/org/35781.html"],"Longitude":"-97.479801","Date Submitted":"02/13/2012 05:45 UTC","Weather Factors":"Unknown","Summary":"observed glowing orange spot in otherwise clear blue sky","Country":"United States"}