{"Country":"United States","Sighting Duration":"00:05:00","Date of the Event":"07/13/2005 01:01 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Summary":"Not Provided","Longitude":"-93.996576","map":"<A HREF = \"http://maps.google.com/maps?q=30.9202,+-93.996576(3578)&iwloc=A&hl=en\"> mufon case (3578) map </A>","Object Shape":"Undisclosed","files":["/var/www/straped/mufon/html2text/3578.html.txt","/var/www/straped/mufon/org/3578.html"],"trends":["There has been one other sighting in Jasper","There were no other sightings in Jasper on or around July 13th 2005"],"Log Number":"US-07132005-0001","Disposition":"Unknown","Object Features":"Undisclosed","divs":["sighting detailsi stepped out on the back deck w\\ my dogs at approx 12:45-1 am, i keep binocs handy(i'm a bird watcher), as i looked up at the stars i noticed an unusual light(s). i was raised in an air force family, seen and been around planes all my life (44 yrs. old now). we are not on any normal flight path of any large planes, and planes do not use landing lights(varied in color)at 35,000ft, nor are they doubled (like a car). the object did not move at all, so i was ingrossed in what i saw, it was most unusual, so i went to get my husband, by then, it had almost disappeared from sight. i swear i saw something similiar in 1977, woke up my entire family that night, they too saw 'it'. i know i'm not crazy or drunk (don't drink!) we live in jasper county,tx,usa, part of the area where the last shuttle exploded over us coming into the atmoshpere, the explosion shook our house. i'm an educated, intelligent individual, and i have absolutely no explanation to what i just witnessed. tomorrow my family will purchase a telescope with the hopes of future spottings. i know in my heart what i saw tonite. i'm glad to have somewhere to share my thoughts, especially to those that believe as i do. sincerely, kay jean ruckel"],"Date Submitted":"07/13/2005 01:01 UTC","Viewing Distance":"Unknown","Region":"Texas","City":"Jasper","Tags":"City","Source":"MUFON","Latitude":"30.9202","Case Number":"3578"}