{"files":["/var/www/straped/mufon/html2text/35794.html.txt","/var/www/straped/mufon/more/35794_submitter_file1__ovni-chelo.jpg","/var/www/straped/mufon/org/35794.html"],"Longitude":"-118.318607","City":"Los Angeles","Latitude":"34.053062","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around February 13th 2012","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Log Number":"US-02142012-0003","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.053062,+-118.318607(35794)&iwloc=A&hl=en\"> mufon case (35794) map </A>","Source":"MUFON","Weather Factors":"Unknown","Summary":"Looked like an airplane on fire followed by bright white arches","divs":["Sighting DetailsReported on behalf of my wife, who was driving westbound on Olympic Blvd. at about 6:55 pm today. While stopped at the traffic light at 4th ave., her attention was diverted to what she believed was an airplane on fire. She witnessed this object at her 2 o'clock position [roughly North] and at about 50 degrees up. She immediately called me to report the event and I felt an unusual extreme distress on her voice. I totally felt she was actually witnessing an airplane on fire, she is definitely not the kind of person prone to imagine things. As we were on the phone -not ten seconds later- she witnessed what she described as 4 lights chasing the fiery object. She described these as 'arches', similar to a child-drawn bird, slightly larger than the first object and EXTREMELY bright [magnesium white]. She now observed that the apparent fire on the first object looked more like sparks trailing it. The traffic light changed and she had to move. She stopped at the next traffic light where she realized she had lost view of the fiery object. However, she managed to see one of the white glowing arches starting to release sparks. In retrospect, she feels this object was turning into another 'fiery' one. She lost view of all objects by the next traffic light. By the time she arrived home, she sounded just like every honest UFO reporting witness, i.e., believing she saw a 'plane on fire', then realizing she's seen something quite different. The image provided is just an illustration I did by drawing the reported details to the intersection where the event started."],"Tags":"City","Object Shape":"Bullet, Missile, Cigar, Cylinder","Case Number":"35794","Country":"United States","Date Submitted":"02/14/2012 03:30 UTC","Date of the Event":"02/13/2012 06:54 UTC","Region":"California","Object Flight Path":"Straight-line path,Path then hovering","Disposition":"Unresolved","Object Features":"Other"}