{"Country":"United States","Disposition":"Unresolved","Longitude":"-116.204846","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 69 other sightings in Boise","There was one other sighting in Boise on or around February 13th 2012"],"divs":["Sighting DetailsAll day and night hearing way more aircraft noise and activity.the news had said the military would be exercising aircraft that day. That night I was watching TV and got bored and thought I would check out some of the planes flying around. The first thing I noticed was a satellite watched it for a while then noticed a plane circling at a pretty high altitude which I thought was strange. I could also see a few military jets flying over. I'm a huge aviation buff and know what planes look like at night since I've grown up next to an airport my whole life. The object I saw was very black triangular shaped with 3 very dimly lit lights in the pattern of a triangle.it made no noise and was traveling at roughly 350-400 MPH what alarmed me was how close it was with no discernible noise! and how dim the lights were,they were not bright enough to be used for identification.my first thought is that it is a classified military aircraft like Aurora or the TR-3B and the military was testing it with normal military jets. I also noticed and heard a helicopter and thought it may be a black helicopter that so often appear with UFOs. That's my report!"],"Latitude":"43.617261","Case Number":"35791","City":"Boise","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.617261,+-116.204846(35791)&iwloc=A&hl=en\"> mufon case (35791) map </A>","Object Features":"None","Log Number":"US-02132012-0029","Date Submitted":"02/13/2012 11:28 UTC","Tags":"City","Object Flight Path":"Straight-line path","Date of the Event":"02/13/2012 08:30 UTC","Summary":"object amid a bunch of otherplanes helis and satellites came across sky low with no noise.","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Region":"Idaho","files":["/var/www/straped/mufon/html2text/35791.html.txt","/var/www/straped/mufon/org/35791.html"]}