{"Object Shape":"Bullet, Missile","Object Flight Path":"Straight-line path","Tags":"City","Disposition":"Unresolved","City":"London","files":["/var/www/straped/mufon/html2text/35807.html.txt","/var/www/straped/mufon/org/35807.html"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"35807","Object Features":"Wings","Country":"United Kingdom","Latitude":"51.490566","Log Number":"GB-02142012-0015","Weather Factors":"Unknown","Date of the Event":"03/23/1997 12:00 UTC","Region":"","Sighting Duration":"Undisclosed","Summary":"Extremely fast, silvery white, pointed cylindrical object with stubby delta wings","Source":"MUFON","Date Submitted":"02/14/2012 04:52 UTC","divs":["Sighting DetailsI was not sure of the date of this event but I can work it out because of two events. First, the Hale Bop comet was visible in the sky which dates it to 1997. Second, I was on my roof to see the Lunar eclipse which was on the evening of March 23 that year. After looking at the eclipse I turned to look north, very few stars are visible in the city of London but the Big Dipper is clear, it was then that I saw a bright silvery white object moving across the sky from the North West to the North East. It was moving at incredible speed and crossed the whole arc of the sky in less than five seconds. It was at high altitude so it's speed was phenomenal to cover so much sky. It seemed to give off it's own light. It was bright and glowing silver, it had a long pointed body with two short stubby delta wings at the rear, a tail of light glowed from it's rear and shone about the same length as its body. It did not leave a vapour trail in the cloudless night sky and it was COMPLETELY SILENT! I have no idea if it was extra terrestrial but there is no craft, military or civilian, that could move like that and also make no noise. Well not one that they have announced to the public. I am a keen sky watcher and know what a satellite looks like, what a star or planet looks like. I know what military or commercial aircraft look like and sound like; this was none of those. I was elated to have seen such a mysterious object, I felt I had been waiting all my life to see something like that. It was after the event that I realised that the Heaven's Gate mass suicide, which had just happened, was supposed to have been timed to the arrival of a space ship. I have asked myself was that the ship? Did those people know something? Also that the price of a ticket was too high. I have yet to find another witness to this event, I am hoping your records might connect with this event."],"trends":["There have been 154 other sightings in London","There were no other sightings in London on or around March 23rd 1997"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.490566,+-0.155544(35807)&iwloc=A&hl=en\"> mufon case (35807) map </A>","Longitude":"-0.155544"}