{"Latitude":"44.739292","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.739292,+-85.625212(35801)&iwloc=A&hl=en\"> mufon case (35801) map </A>","Log Number":"US-02142012-0010","Object Shape":"Circle, Sphere","Date of the Event":"02/08/2012 12:50 UTC","Region":"Michigan","Summary":"Bright light with gray ring around it.Round.Hovered,then slower,then figure 8.Turned brighter then disappered.","Longitude":"-85.625212","City":"Traverse City","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/35801.html.txt","/var/www/straped/mufon/org/35801.html"],"Viewing Distance":"101-500 Feet","divs":["Sighting DetailsWitness went out for a smoke was facing north she noticed what she thought was a plane but it was traveling so fast.Then she realized it was a light.It stopped and hovered.Then noticed a gray ring around it.Round in shape.Then it went slower and made a circle then stright,then a figure eight and hovered again.The light got extremly bright and just disappered.There was no sound and lasted 3-5 minutes.She was the only witness that she was aware of.Witness wondres how anyone could not have seen such a bright light. Light gray sky,high ceiling.Closest building is 150 yards and it appeared to be 4 inches above that.If she could cover it up a golf ball would cover it or a bit smaller.It came from west to east. Two hours later she saw helicoptors flying in many different directions.After dark a couple more showed up.They do see helicoptors from time to time but never that oftn or so many. She was very excited and called a friend who told her about Mufon.Also told her to write this all down. Her stomach was in knots,legs jittery.Cried alot next day,felt a sense of loss.The third day she was fine.Wondered why her.She smoked a few extra cigerrets that day. She believes in UFOs and had been thinking about them latly. She has seen objects flying stright out on utube but nothing like what she witnessed. Witness is 61 and is a part time web and graphic designer.To her knowledge no family members have ever seen anything like this . She has no desire to remain anonymous as she is curious if others shared the same experience."],"Object Flight Path":"Hovering then path","Case Number":"35801","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 13 other sightings in Traverse City","There was one other sighting in Traverse City on or around February 8th 2012"],"Date Submitted":"02/14/2012 01:49 UTC","Object Features":"Unknown","Country":"United States"}