{"Case Number":"3581","files":["/var/www/straped/mufon/html2text/3581.html.txt","/var/www/straped/mufon/more/3581_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/3581.html"],"Latitude":"41.375094","map":"<A HREF = \"http://maps.google.com/maps?q=41.375094,+-74.692663(3581)&iwloc=A&hl=en\"> mufon case (3581) map </A>","trends":["There have been 5 other sightings in Port Jervis","There were no other sightings in Port Jervis on or around April 15th 1988","This sighting has never been favorited.",""],"Region":"New York","Date Submitted":"04/15/1988 08:30 UTC","Source":"MUFON","Viewing Distance":"21-100 Feet","Tags":"City","Date of the Event":"04/15/1988 08:30 UTC","Longitude":"-74.692663","divs":["Sighting DetailsI was in my parents house and I was watching TV. I noticed a glow out side the window that was behind the TV. I got up to see what was causing the light. Once I was close enough to the window to see outside I couldn't believe what I was seeing. At only about 25-30ft above the ground and only 40-50ft away from the house was a very strange craft. It hovered silently. It was about 20Lx10Wx5H. Two sloped rectangular geometric shapes on top of one another. It had red and yellow panels on it but, the majority of the the craft was a grey, blue. glowing metal color. As I watched it banked slightly from side to side. Very fluid motion. Being very young at the time, I ran to get my parents to come see it. But when they arrived it was already gone. I concede that I may have dreamed this. But to this day my parents and sister remember my fright and when I came to get them. And I remember in detail what the craft looked like. I am skeptical but if out of 100% of sightings, only .01% of them are true, then we have something huge on our hands. I believe what I saw may fall in that .01%"],"Object Flight Path":"Hovering then path","Object Shape":"Square, Rectagular","Weather Factors":"None","City":"Port Jervis","Country":"United States","Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-07132005-0004","Summary":"Geometric shape with no visible propulsion system.","Object Features":"Window(s), Patterned Surface"}