{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Jackson","This sighting has been favorited 1 time."],"Latitude":"37.382273","files":["/var/www/straped/mufon/html2text/35819.html.txt","/var/www/straped/mufon/org/35819.html"],"Country":"United States","Log Number":"US-02142012-0028","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Object Shape":"Circle, Disc","Tags":"City","Date Submitted":"02/14/2012 10:32 UTC","Disposition":"Unresolved","Date of the Event":"02/14/2012 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.382273,+-89.666206(35819)&iwloc=A&hl=en\"> mufon case (35819) map </A>","Case Number":"35819","Region":"Missouri","Longitude":"-89.666206","Summary":"Heard a helicopter circle around close by the house 3 times. Went outside to check it out and saw lights in the sky.","Object Features":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsI was reading my son a bedtime story, my boyfriend and my brother in law was talking in the living room when we kept on hearing a helicopter sound very close to the house. We hear helicopters a lot so the first time it went by it was just annoying. The second time the \"helicopter\" circled I heard the guys mention something about it. The third time the sound came by close enough to vibrate the house. I quickly finished our book and the bedtime ritual to see what was going on. My boyfriend was on the front porch and told me to come look. There was a big, red pulsating light slowly came into focus. It stopped and hovered for a good 10 minutes. Suddenly between 3-5 smaller white blinking lights came from somewhere close by the red one. One of the white lights zoomed past an airplane that was passing by. 2 of them went towards the East, and one towards the West. Another headed south and stopped what seemed directly over the area, under the cloud cover. It hovered for a couple of minutes, soundlessly. We could actually tell the red one was leaving, it headed south, directly. We came inside to tell the others to come look but by the time we got back outside (maybe 2 minutes) everything was gone. All I could think was \"why did we not take a picture of this\"."],"City":"Jackson","Source":"MUFON"}