{"Object Flight Path":"Straight-line path","divs":["Sighting Detailsthis was years for obvise reasons. we lived in the woods on 5 acres. On a rainy northwest night 9:30 or so, whole house started to pulse from a helicopter. my wife and I thought was going to crash into house it was so loud and pulseating badly. we had a lot of fir trees on propety and around area from 150- 200 + ft saw object just enough to know that not normal. craft was flying 15 ft from side of chinook helicopter as fast as the helo could travel.125knots Craft was glowing slightly. the directoin and where they were going was obvious around MT Pilcuck or around that area. a few days later I was at home sick and just walking out side to get some fresh air and heard what must have been a Giant amp the largest in the world start coming alive. the low level noise stayed on for about 15-30 sec. i know thats the sound from what other people have told me (ex-military). about a month later on the same type of night rainy overcast and at treetop level they flew over again slightly to the east by 400 yards. of a swath of 56 acres. saw nothing just heard helicopter again. A month later observed lights hovering in sky tree top level with rotating red green blue light veiwed thru a pair of 10x50 binoculars. called wife and daughter to look they being practical just said I dont know what that is and walked away. (thanks dear) The rotating lights stopped and the white lite stayed observed for 40 min it stayed staitnary, the light dimed, Might be because I shined a large spotlight in that area direction. I tryed to call neihbor and no anser (he was pissed, at him self) after this sighting nothing else did we see while we lived there. Having worked in covert operations new phones were being monitored, If you picked up and started yelling about what you just saw well. dont like being yelled at. and have a daughter. 1984 worked on aircraft till present."],"Source":"MUFON","City":"Northwest Snohomish","Date of the Event":"03/04/1997 09:30 UTC","Case Number":"35824","Disposition":"Unresolved","Date Submitted":"02/15/2012 02:34 UTC","Summary":"flying wing","Sighting Duration":"Undisclosed","Longitude":"-122.112056","Latitude":"47.951071","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/35824.html.txt","/var/www/straped/mufon/org/35824.html"],"trends":["There have been no other sightings in Northwest Snohomish","This sighting has never been favorited."],"Country":"United States","Object Shape":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.951071,+-122.112056(35824)&iwloc=A&hl=en\"> mufon case (35824) map </A>","Viewing Distance":"101-500 Feet","Region":"Washington","Log Number":"US-02152012-0004","Weather Factors":"Unknown"}