{"Country":"United States","Object Features":"Unknown","Latitude":"33.809438","Date Submitted":"02/15/2012 01:47 UTC","Sighting Duration":"00:15:00","Longitude":"-81.163853","files":["/var/www/straped/mufon/html2text/35823.html.txt","/var/www/straped/mufon/org/35823.html"],"Disposition":"Unresolved","Tags":"City","Object Shape":"Star-like","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Log Number":"US-02152012-0003","Region":"South Carolina","City":"Gaston","map":"<A HREF = \"http://maps.google.com/maps?q=33.809438,+-81.163853(35823)&iwloc=A&hl=en\"> mufon case (35823) map </A>","trends":["There has been one other sighting in Gaston","There were no other sightings in Gaston on or around January 15th 2012"],"Weather Factors":"Unknown","Summary":"mistaken as ISS first, witnessed (with neighbors) UFOs hover, then move back and forth. then left at high speed...incredible!","Viewing Distance":"Over One Mile","divs":["Sighting DetailsAround 7 pm, I walked outside to have a smoke and talk to friend that lives a few houses away from me. As I made myself comfortable in an adirondack chair and waiting for him to pick up the phone, I noticed a very bright object on the sky and that it was moving. As soon as my friend answered, I told him so he and his wife could go outside and watch (his wife loves star gazing)but almost immediately as soon as they looked at it, it stopped moving. The next few minutes were a back and forth of \"is it moving? Yeah, I think it is...wait no, it's not...no wait, it looks like it's movi--no, I guess not...\" Suddenly, two more bright (slightly less brighter than the first object)appeared out of nowhere--they didn't appear to fly to this spot, they just suddenly lit up. The next few minutes were spent watching the three objects clearly interacting with each other. moving back and forth almost perfectly in sync. After seven or eight minutes, one of the two that appeared last took off to the ESE slowly and turned sharply to the S at a high rate of speed, followed moments later by the other object that it appeared with. The original object hung around and meandered for about five minutes more, before taking off from a dead stop to unbelievably fast speed. Amazing!"],"Date of the Event":"01/15/2012 07:15 UTC","Case Number":"35823","Source":"MUFON"}