{"City":"Lenexa","Log Number":"US-02152012-0002","Latitude":"38.961537","Object Shape":"Star-like","Date Submitted":"02/15/2012 01:47 UTC","Summary":"From the SE towards ENE slowly. Accelerated and deccelerated, Subtle zig-zags and one almost full stop. As bright and large as Venus.","files":["/var/www/straped/mufon/html2text/35822.html.txt","/var/www/straped/mufon/org/35822.html"],"Case Number":"35822","Object Features":"None","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Date of the Event":"02/14/2012 06:57 UTC","Viewing Distance":"Unknown","Region":"Kansas","trends":["There have been 12 other sightings in Lenexa","There were no other sightings in Lenexa on or around February 14th 2012"],"Country":"United States","Disposition":"Unresolved","Tags":"City","divs":["sighting details i was on my back deck grilling dinner for my girlfriend and me. i first noticed the object when i was casually observing venus towards the southwest. next to venus was what i thought to be a star at first. when i noticed it was moving i became interested. i didn't know what it was at first. as it got closer to me, at the closest point almost right over head, i noticed that it didn't move like anything i'd ever seen in the sky before. it was slow, and seemed like it was light as air. it bobbed and weaved (subtly) and at one point came to a brief stand still before resuming course. it was yellowish gold\\orange. it made no sound whatsoever. it passed overhead all the way to the ene horizon and then vanished from my view. my girlfriend is the second witness. i was extremely excited during this experience. i've wanted to see a ufo ever since i was a little kid. when i realized what i was seeing wasn't a plane, helicopter, meteor, or a satellite, i became as elated as if i'd won the lottery. after 4 to 5 minutes of watching this thing, it just disappeared from my sight like a plane does. it simply got too far away for me to see it any longer."],"Weather Factors":"Unknown","Longitude":"-94.731001","map":"<A HREF = \"http://maps.google.com/maps?q=38.961537,+-94.731001(35822)&iwloc=A&hl=en\"> mufon case (35822) map </A>"}