{"trends":["There have been 7 other sightings in Fort Mill","There were no other sightings in Fort Mill on or around February 14th 2012"],"Longitude":"-80.904983","Case Number":"35821","Country":"United States","Latitude":"35.097125","Date of the Event":"02/14/2012 08:13 UTC","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Object Features":"None","Log Number":"US-02152012-0001","Viewing Distance":"Unknown","divs":["Sighting DetailsI was standing in front of my house smoking a cigarette before going to dinner with my parents. I was sitting on my porch and happened to see an orange orb in the sky. When I first noticed the object, I thought it was the planet Venus, but then quickly disregarded that thought because the light being emitted was far to bright to be from a planet or star. The orange orb started about 25 degrees above the tree line then slowly descended to right above the tree line. This still being probably a mile or more from where I was standing it was hard to say though. The object then began to move from left to right at a pretty fast pace quicker than any aircraft that fly through the area. To my best guess the object began slowing down as it crossed over where the interstate is located and began doing something I have never seen. My best description of what the object was doing was projecting a very thin white line with a small ball of white light attached. The weirdest thing about it though was when the orange orb began projecting this light, it seemed to happen like as if i were watching an old time 1900's movie:very choppy or almost flashing. The next thing that happened was my father opening the garage door so I turned around to go get my father and show him this thing because I couldn't believe what I was seeing. Before I told my father, what was going on I looked back to see if the orange orb was still there and I am still dumbfounded as to where the object went. I took my eyes off of the light for 5 seconds max and it was gone. I decided not to tell my parents about the sighting for fear of ridicule, and have tried to dismiss the event myself, but I have yet to come up with and answer for what I observed on Feb. 14. Might I also note that I live 15 miles from Charlotte Douglas Airport and live in an area when every type of commercial aircraft fly day and night. This object was no aircraft it did not strobe emergency lights, there were no additional lights other than the orb, and the fact that there was no sound is also rather peculiar."],"City":"Fort Mill","map":"<A HREF = \"http://maps.google.com/maps?q=35.097125,+-80.904983(35821)&iwloc=A&hl=en\"> mufon case (35821) map </A>","Date Submitted":"02/15/2012 12:41 UTC","Summary":"Orange ball of light almost looked like the planes Venus only brighter moved across the sky","Weather Factors":"Unknown","Object Shape":"Other, Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/35821.html.txt","/var/www/straped/mufon/org/35821.html"],"Region":"South Carolina"}