{"Log Number":"US-02152012-0013","files":["/var/www/straped/mufon/html2text/35836.html.txt","/var/www/straped/mufon/org/35836.html"],"City":"Elgin","Country":"United States","Object Features":"Unknown","Summary":"Craft making maneuvers","Weather Factors":"Unknown","Longitude":"-80.794252","Tags":"City","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Case Number":"35836","Date Submitted":"02/15/2012 07:40 UTC","divs":["Sighting DetailsMonday February 13, I was returning home having picked up my daughter from a school function around 8:30 pm. As we pulled into our subdivision I noticed directly in front of me what I thought was a plane. I noticed the light configuration was a little different than normal and it was fairly low but other than that I didn't think much of it. It had two strobe type lights on what I assumed were the wing tips and one red light in the center. The white strobe lights blinked a couple of times per second and the red light blinked at a slow but steady frequency. Again, I really didn't think much of it but I did notice that it banked to the right and up. I thought that was a little odd but I didn't suspect anything out of the ordinary. As I drove through the neighborhood, I caught another glance of it off to the right and I could tell it was making a looping type circle around the neighborhood. This raised my curiosity. I was trying to figure out why the pilot was making maneuvers in a residential area at night. When I arrived at the house, I waited for my daughter to remove some items from the car before I got out. I still had the aircraft in mind so I stood outside the car and waited to see if I could view it again. I didn't see it or hear it. As I was about to go inside, I looked up and saw it was flying right over my house heading in a westerly direction. From the back, the two wing tip lights were a amber type color, where before they were strobes (at least from the front). Almost the color of a street lamp but not as bright. I could still see the red light on the bottom. The sky that night was partly cloudy, some parts of the sky were clear, while other parts had a cloudy overcast look. I realized looking at the aircraft that I couldn't discern the shape. I was only able to see the lights. The direction it was flying was going to take it directly underneath a blanket of clouds. I assumed once it was under the clouds, it would contrast and I would see the shape. It flew under the clouds but for whatever reason I still couldn't see what the shape was. I could clearly see the lights but could not see what they were attached to. At that time it immediately made a hard bank to the left. Now I could see a red light on top as well as on the bottom. The strange part about it was the red lights on top and bottom seemed to be almost touching giving the appearance that it was very thin. There seemed to be very little structure between the two lights. I didn't hear any sound from the aircraft, however the night was chilly and the heating units in the neighborhood were running, so I can't be sure. I'm not sure what I saw, but it was definitely different."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.170983,+-80.794252(35836)&iwloc=A&hl=en\"> mufon case (35836) map </A>","Region":"South Carolina","Latitude":"34.170983","Disposition":"Unresolved","Object Flight Path":"Path with directional change","trends":["There has been one other sighting in Elgin","There were no other sightings in Elgin on or around February 13th 2012"],"Date of the Event":"02/13/2012 08:30 UTC","Object Shape":"Unknown","Source":"MUFON"}