{"Latitude":"43.179932","Summary":"3 White lights in triangular form hovering below cloud cover, no noise, transparent object","Date Submitted":"02/16/2012 11:19 UTC","Log Number":"CA-02162012-0008","Object Shape":"Triangle","Tags":"City","Date of the Event":"02/07/2012 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/35847.html.txt","/var/www/straped/mufon/org/35847.html"],"Object Flight Path":"Hovering then path","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.179932,+-80.202294(35847)&iwloc=A&hl=en\"> mufon case (35847) map </A>","Country":"Canada","Object Features":"None","Source":"MUFON","City":"Brantford","Disposition":"Unresolved","Region":"Ontario","Sighting Duration":"Undisclosed","Case Number":"35847","Longitude":"-80.202294","divs":["sighting detailsit was early morning on feb 7th and i was headed to my local gym. as i was driving northeast down the road i happen to notice 3 white lights in a triangular form floating in the sky just below the cloud covering. this morning was especially cloudy and very low ceiling. at first i dismissed the lights as reflection and i was somewhat tired, but then the lights moved to my left rather smoothly in the same uniform shape... this caught my attention immediately. i pulled into the parking lot while continuing to observe the object at this point stationary over an adjacent apartment building, i focused my attention to the objects shape which appeared to be an exact sided triangle however seems transparent\\translucent body. the object made absolutely no sound and then slowly ascended into the clouds. i had then got back into my vehicle and tried to follow the object by driving down the nearest street near the apartment but unfortunately couldn't find it. for the next few days i've been trying to make sense of what i had seen and being very familiar with most air craft and living close to an airport this object did not resemble anything i had ever seen. i had even tried duplicating this experience by creating the same sort of environment within my vehicle at the same time of day, verifying this was not an internal reflection, nor anti collision lights above the apartment, etc... this was to what i believe was an unidentified craft to which i have never encountered in my life."],"trends":["There have been 9 other sightings in Brantford","There were no other sightings in Brantford on or around February 7th 2012"]}