{"Weather Factors":"Unknown","City":"Redding","Region":"Connecticut","Longitude":"-73.388278","Source":"MUFON","Object Features":"Unknown","Log Number":"US-02162012-0003","Date Submitted":"02/16/2012 05:05 UTC","Tags":"City","Case Number":"35844","files":["/var/www/straped/mufon/html2text/35844.html.txt","/var/www/straped/mufon/org/35844.html"],"Sighting Duration":"01:00:00","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.306024,+-73.388278(35844)&iwloc=A&hl=en\"> mufon case (35844) map </A>","Summary":"Possibly witnessed Atmospheric Entry","Date of the Event":"02/16/2012 04:10 UTC","trends":["There has been one other sighting in Redding","There were no other sightings in Redding on or around February 16th 2012"],"Country":"United States","Latitude":"41.306024","divs":["Sighting DetailsAround 4am i went outside to have a Cigar on my back deck, i normally look up at the stars Nightly so when i saw at what appeared to be an orange star, it caught my eye,seeing as ive never noticed it before. As i watched it it slowly started to drift, then Suddenly Banked right, Accellerated Downwards and then Back to its original position. When it first moved i assumed it was a Satelite taking an Evasive action to possibly avoid Floatsom, but its movements became far too eratic, to even be the highest quality of jet. about 20 minutes later i went inside to tell a friend what i was looking at, then returned outside to watch for a few more minutes. when i realized more northeast there was another object of similar design. i looked to the original and it appeared to have a triangular shape now. coming from south east i thought i saw a Fast moving Jet begin an Ascending arc towards the object, but suddenly its Lights blacked out. I assume to hide its presense from both us and the object. I then looked back towards the second object and realized it was now also movnig eratically, and then Vanished from sight. I came back inside and my friend was now also watching and said he could hear what sounded like several helicopters In the distance, be described them as being too Low pitch to be Commercial craft. I tried to take a video of the event, but my phones Low quality camera, and its inability to shut off the Flash system made it impossible. a few minute after the Jet blacked out the Object stopped moving. and has yet to move. Personally i think the jet may have attempted to Intercept Object 1, and thereby scared Object 2 off. and perhaps through the interception disabled the craft from being able to maneuver or perhaps it stopped to blend with the stars again."],"Viewing Distance":"Unknown","Disposition":"Unresolved"}