{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Pahrump","Source":"MUFON","Case Number":"35841","Region":"Nevada","map":"<A HREF = \"http://maps.google.com/maps?q=36.1667,+-115.970669(35841)&iwloc=A&hl=en\"> mufon case (35841) map </A>","Log Number":"US-02162012-0002","trends":["There have been 12 other sightings in Pahrump","There were no other sightings in Pahrump on or around January 8th 1999"],"Viewing Distance":"21-100 Feet","Object Flight Path":"Hovering then path","Summary":"It fell from the sky then hovered over me and my dogs transparent stars around but not in the oval shaped area then slowly went on a path Angeled and vanished into the stars","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/35841.html.txt","/var/www/straped/mufon/org/35841.html"],"Latitude":"36.1667","divs":["Sighting DetailsI went to blanket my horses with two of my dogs. I looked up like I always do and noticed nothing in particular. After completing the blanketing of 5 horses I started back to the house, I looked up and said to myself wow, I don't think I have ever in my life seen so many stars. I starred at them when I noticed a star move quickly to the left, miles to the left then it dropped downwards, I stopped walking, my one dog stood on the right of me the other to the left of me. We starred up at the sky I noticed an object coming over the roof of the house, extremely slow as taking its time, I noticed it since there were millions of stars all around but not within this extremely large oval. Once it stopped I saw other circles underneath moving in all different directions, meanwhile I didn't move nor did my dogs. It slowly moved sideways to the next lot went slowly forward tilted upwards at an angle and was gone in a snap but I could see vapor trails and then all the stars disappeared. Later in the night I heard an apache helicopter over my house I went outside and no lights were on I said I hear you were are you, then they lite me up hovered me for awhile then followed the exact pattern this UFO did, they then followed the path and landed in the street with their lights off. I saw people running through the desert with flashlights, they closed the roads, trucks were driving down the street with no lights on for months after I kept seeing a silver government car seemed to be following me for a few months. Cows did live in the field were the helicopter landed nd there hasn't been any cows there since. I know what isaw and it was real. My two dogs saw it too."],"Object Shape":"Oval","Longitude":"-115.970669","Weather Factors":"Unknown","Date Submitted":"02/16/2012 01:05 UTC","Object Features":"Other","Date of the Event":"01/08/1999 05:30 UTC"}