{"divs":["Sighting DetailsI live near the C&D Canal, on the south side, just between Chesapeake City and the Summit Bridge (Rt 896). Last night, I was working at my desk in my bedroom at around 8pm, when my mother exclaimed that there was something really strange about the helicopter that just buzzed the house. Now, we live only a few miles down the road from Summit Aviation, a small local airstrip, and Dover Air Force Base, Aberdeen Proving Ground, and Philadelphia International Airport are all in the region, so planes and helicopters flying over and near the house are not that uncommon. Heck, on a typical night, I can usually look up into the sky and see blinking lights from at least a dozen airplanes flying somewhere high in the sky. So, I ignored her and kept working. A few minutes later, the helicopter buzzed the house again, this time, only a couple hundred feet above the house. She ran to the window and told me to look. At first, as I got up, I listened and thought, \"This is a Coast Guard, HH65 Dolphin,\" but then I listened more closely, and decided the sound wasn't right; it was something else. The helicopter flew by, and she asked me if I saw the red light in front of the helicopter. I said I didn't see anything. She described that roughly 4 to 8 helicopter-lengths in front of the helicopter, a glowing red light was visible. Now, we have seen plenty of helicopters, and so we know about the red, green, and white navigation lights they have. But, she insisted that this wasn't one of those lights, and that it was away from the helicopter. Well, a few minutes later, the helicopter returned in the opposite direction (each time it flew by, it was traveling roughly East or West, then turning around after it flew out of sight a few miles away). This time it was a bit farther away, about a half-mile behind the house, at the tree-line near the canal. I couldn't see the red light she mentioned, but could definitely identify all the navigation lights on the helicopter. A few minutes later, the helicopter flew past again in the opposite direction. This time, I did see what she was talking about. As she described, roughly 4-8 helicopter lengths in front of the helicopter, a small, glowing red light was visible. It seemed constant in illumination, size, and intensity. It was definitely not part of the helicopter; not one of the navigation lights. It was not a spotlight, and no lights were being aimed at the ground (as if the helicopter was looking for something). The red navigation light on the helicopter was blinking. My first thought was that the red light ahead might be from some sort of Near-Infrared sensor, or LIDAR or something, some instrument on the helicopter that was illuminating the area ahead of the helicopter. But, this didn't make sense, after I thought some more. It was a cloudless night, so if a laser or some other light were being produced by the helicopter, there is no reason that a ball of red light would be visible at that distance in front of the helicopter, unless it were shining on something solid that was in front of the helicopter. It was traveling perpendicular to our viewpoint, so it did not seem likely that any laser was being aimed directly at us by the helicopter. Maybe something was producing that light, that was in front of the helicopter? I didn't know what it was, but I grabbed my camera and headed out to the back patio to see if I could take a picture on the next pass, if the helicopter came back. About 8 minutes later it came past again, but farther away again, near the canal, so I couldn't get a good picture. I waited outside for another 15 minutes, but the helicopter never returned. It continued off to the East, roughly in the direction of the Summit Bridge. About 10 minutes after I lost sight of it, I saw a dim white light moving in a non-linear path, miles away near the horizon near the bridge, but after 15 seconds of moving to the left, then a little up, then back right, then up, it vanished. I noted that it was near the horizon, because the nearby shadows of the treeline were useful in noticing that it wasn't simply moving in a straight line like a plane would. In total, my mother said it passed back and forth 8 times in the hour. We also could not think of a reason why at this time of night, a helicopter would make so many passes over the house, and some of them very low (less than 500 feet), in such a strange pattern, unless it was expressly following the red light. We both felt very strange about the sighting. We see airplanes and helicopters all the time, but this was strange, and we had never seen an aircraft apparently following a red light. The following day (this morning), my mother talked with one of her coworkers, and her coworker also noticed 3 helicopters, in the vicinity, at roughly the same time of night, while driving her children home from a child's birthday party."],"Log Number":"US-02162012-0014","Longitude":"-75.747943","Object Features":"None","files":["/var/www/straped/mufon/html2text/35855.html.txt","/var/www/straped/mufon/org/35855.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.519685,+-75.747943(35855)&iwloc=A&hl=en\"> mufon case (35855) map </A>","Object Shape":"Sphere","Sighting Duration":"01:00:00","City":"Middletown","Date Submitted":"02/16/2012 08:25 UTC","Source":"MUFON","Disposition":"Unresolved","Country":"United States","Region":"Delaware","Object Flight Path":"Straight-line path,Path with directional change","Tags":"City","trends":["There have been 2 other sightings in Middletown","There were no other sightings in Middletown on or around February 15th 2012"],"Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Case Number":"35855","Summary":"Helicopter following glowing red light in multiple passes near home.","Latitude":"39.519685","Date of the Event":"02/15/2012 08:00 UTC"}