{"City":"Port St Lucie","Date Submitted":"02/16/2012 08:26 UTC","Sighting Duration":"Undisclosed","trends":["There have been 15 other sightings in Port St Lucie","There were no other sightings in Port St Lucie on or around February 11th 2012"],"Weather Factors":"Unknown","Date of the Event":"02/11/2012 06:30 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsDriving north on hwy 1 we stopped in the left turn lane at Westmoreland Blvd. waiting for the light we were the first car in line. My wife noticed three objects in the sky coming towards us from about a 10:o,clock direction. By the time the light changed four or five of these objects were out of sight to the left rear of the car with two or three coming into view. We turned the corner and pulled off on a side street and got out to look. by this time the last two spheres were still visible with one quite distant and the last over our position at an angle of about 75 degrees. The sphere did not have external lights or any external objects period. Four of us were there and nobody heard a sound coming from the spheres. The sphere was transparent in the upper half and a bright orange color in the lower section but not exactly half. The orange was in the center and tapperad down to the left and right. The orange was not radiating or blinding or flashing but it did seem to provide a slight orange cast to the upper part of the sphere. It was obvious the the sphere was transparent. After we got out of the car the last sphere was out of sight within about two minutes or less. Our first thoughts while stopped at the light was the bubble helicopters. We rolled down the windows but could not here them. Before we turned the corner we did not think they were helicopters because we could actually see into the spheres, and there wasn't any marker lights. After we stopped on the quiet street we knew it was something else. For me persolally there was no noise, no external lights, no external structure and no visable means of propulsion. After seeing the above my comment was that our government does not have the technology to move a sphere through our athmosphere without control surfaces and a visable means of propulsion. My second thought was that we saw eight or ten (different opinions)personal transporters with no visable weapontry or external anything. My next thoughts involved fear for my family, our country and our planent. I personally feel that \"nobody comes in peace \" My current feelings assure me that I did not see UFOS, I saw alien transporters of some sort. Sorry about my drawing. I am better at describing then drawing. After thinking about what we saw, the distance and the height I believe the sphere could be 12 to 15 feet in diameter. When asked about color I left it blank because of the \"exterior stipulation.\" All color came from the interior od the sphere."],"Latitude":"27.282233","Longitude":"-80.35216","Tags":"City","Summary":"10 spheres moving 100 plus mph, straight line, not equally spaced pass nearly over our heads. no sound, no external lights, no additional structure.","Country":"United States","Disposition":"Unresolved","Source":"MUFON","Region":"Florida","Viewing Distance":"101-500 Feet","Log Number":"US-02162012-0015","Case Number":"35856","Object Features":"None","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/35856.html.txt","/var/www/straped/mufon/org/35856.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.282233,+-80.35216(35856)&iwloc=A&hl=en\"> mufon case (35856) map </A>"}