{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.758393,+-106.055851(35852)&iwloc=A&hl=en\"> mufon case (35852) map </A>","Log Number":"US-02162012-0013","Disposition":"Unresolved","trends":["There have been no other sightings in Estancia","This sighting has never been favorited."],"Object Features":"Appendage(s)","Object Shape":"Blimp","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-106.055851","Country":"United States","City":"Estancia","Region":"New Mexico","Latitude":"34.758393","Date Submitted":"02/16/2012 04:40 UTC","Tags":"City","Case Number":"35852","Weather Factors":"Unknown","divs":["Sighting DetailsI have a glass window in my front door, which faces east. I was walking by the door and I noticed headlights in the sky. I backed up and stared. I moved my head around as I thought it might be a reflection, I wear glasses. No, it was still in the sky. I stared at this for awhile, thinking all kinds of things, but pretty sure what I was seeing was in fact a UFO. It started to turn south, and as it did so, I noticed something like fins or something on the side and as it completed the turn, there was a blinking red light on the bottom, near the end, but 10 or so feet from the end. There was a full moon that night or bright, because I noticed the reflection of the moon on the thing. After the turn was completed, it went a few 100 feet and disappeared. Poof, gone! I ran out of the door and could find, nor see anything. Called the 911, but no one else reported seeing anything. How could they not, it was 7:30 in the evening, people were driving on highway 41, less than a half mile east of my house. I remember I kept thinking, surely people are going to stop and look at this thing, no one did. So, was I crazy. I sat and thought this a bit and wrote down the day and time and drew a picture so I wouldn't forget, not that I will as I can still see it as clear as the night i saw it."],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Summary":"looks like the UFO on TV special UFO over Illinois., the one with two headlights.I","Date of the Event":"11/08/2011 07:30 UTC","files":["/var/www/straped/mufon/html2text/35852.html.txt","/var/www/straped/mufon/org/35852.html"]}