{"trends":["There have been 3 other sightings in Eufaula","There were no other sightings in Eufaula on or around February 12th 2012"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/35859.html.txt","/var/www/straped/mufon/org/35859.html"],"Summary":"Driving toward Lake Eufaula and saw an oval disk shape camouflaged with rotating lights moving east across the lake and again moving west.","Source":"MUFON","Disposition":"Unresolved","divs":["Sighting DetailsIt was a little after 8pm on a Sunday night and I was coming back from a dinner I had with my son, his wife and their 6 year old daughter. We had just left a musical concert at a local church. I was driving home on a hill top facing north toward Lake Eufaula at night and saw a camouflaged oval disk shape with rotating lights moving east across the lake and again moving west. The rotating lights were toward the bottom of the craft. It appeared as if the outside of the craft had reflectors to be the same as the darkness but the edges were visible and the rotating lights were more visible. There may have been more than one craft of similar appearance because it went behind some trees and I stopped on the road and turned my lights off to get a better look as there were no street lights or traffic where I was and a craft came back in the opposite direction. I thought because light was coming out of the bottom of the craft it was looking for something. This has been very alarming because something this big should have made big news. I was looking over the city of Eufaula and the craft seemed to be one third to one fourth the size of the entire town. I have tried to figure out how far it was but it is impossible to know because it was dark. This would allow me to figure how big it was. The next morning a heavy fog was over Eufaula and much of east central Oklahoma. This heavy fog has lasted throughout the week especially at night and early mornings. I have searched the internet to see if others have had a similar experience in this area to no avail."],"Object Shape":"Disc","Longitude":"-95.579875","Country":"United States","Latitude":"35.296291","Date Submitted":"02/16/2012 09:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.296291,+-95.579875(35859)&iwloc=A&hl=en\"> mufon case (35859) map </A>","Sighting Duration":"Undisclosed","City":"Eufaula","Tags":"City","Log Number":"US-02162012-0018","Weather Factors":"Unknown","Region":"Oklahoma","Date of the Event":"02/12/2012 08:15 UTC","Object Flight Path":"Path with directional change","Case Number":"35859","Viewing Distance":"Unknown"}