{"Date of the Event":"02/16/2012 07:01 UTC","divs":["sighting detailsi alway look in the sky almost every night because my wife said she had seen a ufo about 200 feet high back in nov 2011 around our neighborhood and a bigger one in july 2005. i finally seen this object on 2\\14\\12 at 8 pm. i got my video camera out to record but out of battery but i used my benocular to watch it for 15 minutes. the object seem to hoover above the navy base in seal beach. i saw the object moving toward catalina island but then it came back to the same position by navy base again. i look out my window again the next night around 8 pm and there the object again and film it for 11 minutes and then it took off. i look at the same spot on 2\\16\\12 at 7 pm and saw the object much closer within a mile. i took my camera out and film it. all of a sudden a hear a loud \"hum\" for 15 second which heard my ear when i was filming the object. it got closer to my house but then it move back further away. i can see airplane flying over the object which mean the object is pretty low. the object is still can be seen right at this minute while i am typing my story. if anyone live in orange county, please let me know what this object is."],"Object Features":"None, Unknown","Object Flight Path":"Stationary,Hovering then path","Tags":"City","Source":"MUFON","Latitude":"33.795419","Log Number":"US-02162012-0020","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around February 16th 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Country":"United States","Region":"California","City":"Garden Grove","map":"<A HREF = \"http://maps.google.com/maps?q=33.795419,+-117.951908(35861)&iwloc=A&hl=en\"> mufon case (35861) map </A>","files":["/var/www/straped/mufon/html2text/35861.html.txt","/var/www/straped/mufon/org/35861.html"],"Longitude":"-117.951908","Summary":"Objects been around for the passed 3 day now.","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Oval, Sphere","Weather Factors":"Unknown","Date Submitted":"02/16/2012 10:47 UTC","Case Number":"35861","Sighting Duration":"Undisclosed"}