{"Case Number":"35871","Log Number":"US-02172012-0010","Latitude":"33.551628","Summary":"Small White Puffs of Cloud Appearing, Disappearing in Cloudless Sky","files":["/var/www/straped/mufon/html2text/35871.html.txt","/var/www/straped/mufon/org/35871.html"],"Longitude":"-117.77921","City":"Laguna Beach","Tags":"City","divs":["Sighting DetailsI was driving to work northbound on Pacific Coast Highway in Laguna Beach, California around 4:20 p.m. on a CLEAR SUNNY DAY WITH NO CLOUDS ANYWHERE AROUND FOR MILES IN THE SKY when all of sudden I look out over the Pacific Ocean and see this small odd looking piece of cloud appearing in the sky over the ocean NEAR SANTA CATALINA ISLAND. As I was driving I started staring at it because it just seemed very odd that a small cloud like this would appear without any other clouds around it. It was white in color like most clouds are but that's where the similarities end. The shape of it was not smooth or round like normal clouds but more circular and popcorn shaped with rugged edges, almost like the remnants of a supernova explosion in space. As I kept driving for a few minutes IT STARTED TO DISAPPEAR, THEN APPEAR, THEN COMPLETELY DISAPPEAR WITHIN MINUTES! I KNEW THIS COULD NOT BE A NATURAL CLOUD because normal clouds do not appear and disappear like this within minutes. Because I had seen video on the web of similar \"clouds\" appearing in a clear blue sky out of nowhere and then disappear, I came to the conclusion that it could possibly be a UFO \"hiding\" itself to humans as a normal cloud but this very observant human was not deceived. I really don't know what else it could be."],"Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.551628,+-117.77921(35871)&iwloc=A&hl=en\"> mufon case (35871) map </A>","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 12 other sightings in Laguna Beach","There were no other sightings in Laguna Beach on or around February 16th 2012"],"Date of the Event":"02/16/2012 04:25 UTC","Date Submitted":"02/17/2012 05:55 UTC","Disposition":"Unresolved","Region":"California"}