{"Sighting Duration":"Undisclosed","Tags":"City","Summary":"F-16 jets following or warning UFO","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=31.658122,+-81.911414(35874)&iwloc=A&hl=en\"> mufon case (35874) map </A>","Date Submitted":"02/17/2012 10:38 UTC","Country":"United States","Object Flight Path":"Other","Longitude":"-81.911414","Object Shape":"Unknown","Log Number":"US-02172012-0012","files":["/var/www/straped/mufon/html2text/35874.html.txt","/var/www/straped/mufon/more/35874_submitter_file1__MyPhonePics362.jpg","/var/www/straped/mufon/more/35874_submitter_file2__MyPhonePics363.jpg","/var/www/straped/mufon/org/35874.html"],"Object Features":"Undisclosed","divs":["Sighting DetailsI live in Jesup Ga. 20 miles outside of Ft. Stewart military base. On Febuary 7, 2012 my son and i heard jets from inside our home around 2:00 P.M. They were very loud and i could tell by the sound unusually low. My son and i went outside to see the jets. We observed them flying in a circular formation. They stayed within about a three mile circular pattern of our home. We continued to watch them for appoximatly an hour and seventeen minutes. During this time my son and i took some pictures to show my wife. I didnt realize untill later i had captured on camera an object near the jet. Perhaps it was moving too fast for the naked eye to see. It is blurry compared to the F-16 but definitly was there. I only wish i would have had a better camera than my camera phone, however it is still easily seen due to flying so low.This is my first sighting of such an unusual event and thought that i should share it."],"trends":["There has been one other sighting in Jesup","There were no other sightings in Jesup on or around February 7th 2012","This sighting has never been favorited.",""],"Date of the Event":"02/07/2012 02:26 UTC","Case Number":"35874","City":"Jesup","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Latitude":"31.658122"}