{"Latitude":"29.863975","files":["/var/www/straped/mufon/html2text/35875.html.txt","/var/www/straped/mufon/org/35875.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Region":"Texas","Object Shape":"Circle, Cylinder, Fireball, Flash","divs":["Sighting DetailsIt was August 30th 2011 around 7:30pm in the city of Houston,Tx when I encountered this event that was truly unbelieveable but very true. I was at work when we had just started up our product on [jacketing #2] which is linepipe that we extrude a plastic jacket over it's surface in order to protect it from the elements when putting the pipe into the ground. The process requires that we lead the pipe outside and attach it to a wooden shipping spool so my job is a indoor outdoor job. After the process was started and everything seemed to be in order, speed adjustment, paper work and etc, etc..., I walked back outside and got about 20 ft from the spool controls just inside the roll up door when a reflection right above me drew my attention straight up and into a seemingly low cloud pattern overhead. The object overhead was very bright and it caused me to look away at first because it hurt my eyes and then I looked right into it inspite of the brightness and discomfort. It reflected as if the sun's light was bouncing off of it but at first glance I would have mistaken it for the sun. As I looked right at it I could see that the surface appeared to be moving as if I was looking at a fixed object behind a waterfall. I started yelling for someone to look and turned to my co worker Robert who was at the controls right inside the roll up door and he came from behind the controls and look upand he looked up and yelled WHAT IS THAT!!! As I continued to look at it from where I was standing it seemed to power down some of it's brightness on the bottom and now appeared to me to take on the color of solid white because I no longer felt as uncomfortable as before looking at it and that's when I realized that it was now moving away and getting smaller. That's when I yelled at my team leader Oscar who was down at the other jacketing building [jacketing #1] to look up and out. I also yelled for our new jacketing personnel Mona to LOOK!!! The object moved at an incredible high rate of speed across the sky towards the setting of the sun and out keeping it's brightness until it could no longer to seen, as if it was leaving the earth. Even calls made to various people seem to hit dead ends."],"Object Features":"Patterned Surface","Summary":"A VERY REFLECTIVE OBJECT AS IF IT WAS A GIANT MIRROR CASTING LIGHT OVER HEAD IN A LOW CLOUD PATTERN","Date of the Event":"08/30/2011 07:30 UTC","Date Submitted":"02/17/2012 11:33 UTC","Source":"MUFON","Tags":"City","Disposition":"Unresolved","Longitude":"-95.607257","Object Flight Path":"Stationary,Hovering then path,Straight-line path","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around August 30th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.863975,+-95.607257(35875)&iwloc=A&hl=en\"> mufon case (35875) map </A>","Country":"United States","City":"Houston","Sighting Duration":"Undisclosed","Case Number":"35875","Log Number":"US-02172012-0013"}