{"Date of the Event":"07/12/1998 12:00 UTC","City":"Wilbraham","divs":["Sighting DetailsI was traveling to my girlfriend's house, at about 10 at night, on Springfield St. in Wilbraham. As I approached the town hall I noticed a craft about the size of two cars parked next to each other hovering above the power lines, maybe 20 feet above them. They were the large kind of power lines, the twin span ones that run over the road, not parallel with it. anyway, it was about the same size as the power lines were wide, and it was circular, the typical UFO disc shape, but very small in comparison to what youd think a UFO would be in size. The color of it was very strange, it looked dark and shiny both at the same time, almost like a shimmering black void. There was no noise coming from the UFO whatsoever, not even a hum or buzz- no sound at all. There were no noticeable windows, or doors, only a circular ring of white lights that did not blink, except for a moment when I got out of my car. It was a very strange feeling to see it, because I have been enthralled with UFO's since I was a child and always thought that if I ever saw one I would probably be frightend out of my mind, but seeing the object up close I felt no fear whatsoever. In fact I stopped my car to watch the craft for a couple of minutes because I was so overtaken by seeing it, again I felt no fear whatsoever. After observing it, I got this incredible urge to get out of my car and approach it. As I opened my car door to get out, the white lights that went circular around the object started to blink and I immedietly got back in my car and started to drive away. As I drove away, I got my courage back up and turned around to go back to see it one more time, and it was gone. My immediate reaction to seeing the UFO was that I was seeing a UFO. The whole time I observed it, the energy in the air around the object almost felt suspended, like the object had its own foreign energy field that this atmosphere was uncomfortable with. Afterwards, as I thought back on what I had seen, my opinion of what I saw never changed or wavered. I shared the story with everyone I felt comfortable sharing it with, mostly with negative feedback. What made me the most confident about the encounter was the fact that six months or so later I saw the same object hovering over the river near my house, only this time my brother was in the car with me and saw the object as well, and he had previously been doubtful about what I saw before."],"Viewing Distance":"21-100 Feet","Latitude":"42.133001","map":"<A HREF = \"http://maps.google.com/maps?q=42.133001,+-72.430486(3587)&iwloc=A&hl=en\"> mufon case (3587) map </A>","Summary":"UFO over power lines; maybe the size of a car; 50 - 75 ft in air","Object Flight Path":"Stationary","Tags":"City","Country":"United States","Region":"Massachusetts","Date Submitted":"07/12/1998 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"3587","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/3587.html.txt","/var/www/straped/mufon/org/3587.html"],"Disposition":"Unknown","Log Number":"US-07142005-0004","Weather Factors":"None","Object Shape":"Disc","trends":["There have been 2 other sightings in Wilbraham","There were no other sightings in Wilbraham on or around July 12th 1998"],"Longitude":"-72.430486","Source":"MUFON"}