{"Longitude":"-66.119055","Sighting Duration":"Undisclosed","trends":["There have been 12 other sightings in San Juan","There was one other sighting in San Juan on or around February 14th 2012","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"18.466056","Source":"MUFON","Log Number":"PR-02172012-0015","divs":["Sighting DetailsIn route to dinner, and friend and I witnessed a strange formation of lights out of our car window flying over the buildings. At first I thought it was a meteor or satelite breaking up, but after we stopped the car we realized it was something different all together. A formation of orange centered orbs with a red aura were flying in a formation over old San Juan from the North East towards the South West over the mountains. There were over 100 objects flying at the same speed stretching over a mile. The formation was formed of three orbs, in a triangle pattern, with the right wing mate trailing slightly behind the other two. The preceding groups followed the same flight pattern. When we stopped and leaned out the window to take a few pictures we noticed they made zero noise of any kind. The air speed of the objects was very slow, to slow to be any flying object I know of. The lights did not flicker in any way and the cloud cover was above them. With the city lights reflecting off of the cloud ceiling, I could determine there was not a craft with running lights, but only the orbs alone were emitting the light. After watching for about five minutes, I was reminded we were late for a dinner reservation. At this point, looking back on the experience, I wish I had stayed longer to take more pictures and perhaps even a video. They were really quite beautiful. I'll never forget it."],"files":["/var/www/straped/mufon/html2text/35877.html.txt","/var/www/straped/mufon/more/35877_submitter_file1__photo1.JPG","/var/www/straped/mufon/more/35877_submitter_file2__photo2.JPG","/var/www/straped/mufon/more/35877_submitter_file3__photo3.JPG","/var/www/straped/mufon/org/35877.html"],"Date Submitted":"02/17/2012 02:02 UTC","Case Number":"35877","Region":"","Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Date of the Event":"02/14/2012 09:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=18.466056,+-66.119055(35877)&iwloc=A&hl=en\"> mufon case (35877) map </A>","Country":"Commonwealth of Puerto Rico","Summary":"Valentines Day sighting in old San Juan of over 100 Red/Orange orbs flying in formation towards the mountains.","Object Features":"None","City":"San Juan","Object Shape":"Sphere","Object Flight Path":"Straight-line path"}