{"Country":"United States","Disposition":"Unresolved","divs":["Sighting DetailsOn feb.13th at 9pm six of us were outside.we just so happened to look up at the sky and seen this bright object hovering down and sitting above the house acroos the street from my house.it then started to move to the right and wjen this object got to the middle of the syreet it just hovered and stayed in the same place around 15 to 20 minutes.where I live theyre hardly no ligjts on the streets and whete this huge object was hovering at had no light what so ever and was very dark making it very easy to srr becausr, it was very bright and large in size. By the way I live is in florida and the small city on the west coast named North Port. After watching this object for I would guess anout 20 minutes we noticed this red light to describe it to you it was like an ord or something of that nature.anyways we seen this red tiny ball like an ord shoot out of it and it went in the direction torwards the left of it.and it just vanished into the air. It was traveling at a very fast speed and as soon as we seen it this red ord ligjt thing vanished as fast as it appeared! Then about a minute or two this object started to move down the street as if it wasdjyst srolli.g through the neighborhood. Since this object was up in the air it was really hard to see its size but, we estimated that it had to be bigger than 6 or more large houses! As we watched this object move down the street it turned in such a sharp mannor that not even a car cam turn that sharply. And pretty soon this object was out of our vision. Now every nigjt since then ive seen this object in the sky just hovering in the same place every night after seening the object I just eplained to you. I used a telescope to veiw this object thay appears to the naked eye to look just as if it were a star. But veiwing it with a telescope you can clearly see that it has red and blue ligjts that seem to move in the same direction as if were circulating around the object. It is really stange and scary to me to see this object in the sky every night and it has not moved from the same spot all week. It has me thinking and believing that this object might be there during the day to! I would have never even questioned anything about ufos if my own eyes havent seen this object myself! A lot of scary thoughts have been in my head since the first night I seen it and I cant help to wonder why is it that there seems to be more and more sighting than ever before.and theres been talks about alien invasions from people up in high places. Is it true is something going to happen are we being warned and if this is true how do we or can we even prepare ourselfs for it at all? Wake up everyone and look up at the sky above you because, chances are that their up in your skies t. Its times to look up and start reporting everything you see and rember uour not alone a lot of people are.seeing the same objects in thheir skies to!"],"Viewing Distance":"21-100 Feet","Tags":"City","City":"North port&port charlotte","Summary":"6 of us were outside and seen this object hovering over houses& it moved right in the middle of the street! U could see the out line of the object and it wbas moving slow.every night it returns u can see it in the sky.red blue lights move around it.","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Region":"Florida","Source":"MUFON","Latitude":"26.894601","Date Submitted":"02/17/2012 07:24 UTC","Object Shape":"Other","Object Features":"Dome, Other","map":"<A HREF = \"http://maps.google.com/maps?q=26.894601,+-81.909826(35888)&iwloc=A&hl=en\"> mufon case (35888) map </A>","Weather Factors":"Unknown","Sighting Duration":"00:30:00","trends":["There have been no other sightings in North port&port charlotte","This sighting has never been favorited."],"Case Number":"35888","Log Number":"US-02172012-0021","files":["/var/www/straped/mufon/html2text/35888.html.txt","/var/www/straped/mufon/org/35888.html"],"Longitude":"-81.909826","Date of the Event":"02/13/2012 09:00 UTC"}