{"Latitude":"36.117097","map":"<A HREF = \"http://maps.google.com/maps?q=36.117097,+-97.042814(35880)&iwloc=A&hl=en\"> mufon case (35880) map </A>","Case Number":"35880","Source":"MUFON","Date Submitted":"02/17/2012 02:18 UTC","Region":"Oklahoma","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Sphere, Triangle","divs":["Sighting Details My family and I were in the living room with windows facing the north. It was about nine or a little after in the night. My eye was caught by a bright light coming through the slits in the blinds. I went outside and saw it was a sphere about as tall as high tower would be. I do know there are no towers in that direction. The light was round in shape,large and brighter than most stars I have seen. It was yellow orange and looked fiery in the center, like you could see inside of it if you were closer. My daughters and I were all viewing it. Then after a minute of complete stillness and hovering it rose up slowly. No noise. With a faint whir it changed into a craft.On the underbelly it it had circle two crescent shapes coming into each other. One side was blue light and the other was red of the crescent shapes. There was also more faint white smaller light on the underbelly. We were mystified about the whole event.It glided slowly and quietly over our neighborhood towards the south. My daughter noted that it was triangle shaped with a tail.One thing to note would be when we first saw the ball of light there were strange bird noises for under it on the next street over.. I don't know if they were associated but it seemed they were in reaction,response or apart of it. I then ran through the house to the front and saw it disappear into the distance."],"trends":["There have been 6 other sightings in Stillwater","There were no other sightings in Stillwater on or around February 16th 2012"],"files":["/var/www/straped/mufon/html2text/35880.html.txt","/var/www/straped/mufon/org/35880.html"],"Date of the Event":"02/16/2012 09:06 UTC","Object Flight Path":"Stationary,Hovering then path","City":"Stillwater","Viewing Distance":"501 Feet - 1 Mile","Summary":"Bright sphere of fire light morphs into large craft.","Tags":"City","Longitude":"-97.042814","Country":"United States","Object Features":"Other","Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"US-02172012-0018"}