{"Log Number":"US-02172012-0029","Object Features":"None","Region":"New Hampshire","map":"<A HREF = \"http://maps.google.com/maps?q=44.01044,+-71.049891(35896)&iwloc=A&hl=en\"> mufon case (35896) map </A>","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","Longitude":"-71.049891","Date of the Event":"02/14/2011 12:00 UTC","Object Flight Path":"Hovering then path,Straight-line path","Summary":"String of oddly acting bright glowing balls in the sky.","Date Submitted":"02/17/2012 10:44 UTC","Weather Factors":"Unknown","City":"Conway","Latitude":"44.01044","Tags":"City","divs":["Sighting DetailsId like to add this sighting to MUFONs data base. About a year ago I was coming home after work. It was early evening but dark. Up over the hills was a string of glowing light balls. First one then 2 then 3 this there must have been 2 dozen sight balls brightly glowing in a line,after a few minutes. One would appear then the next in line would slowly appear and get brightest slowly and so on. I stopped the car and looked. There was a loud sound that lasted a few minutes. The sound was like jet plane after burners. But more like a group of jets on after burners,very loud and went on for atleast 10 minutes. The long string of glowing balls would suddenly go out in the line,one after the other. If you have ever seen the video of the string of glowing balls in the evening above the mountains that was made,I believe in the Scottsdale,Arizona area,some years back and has been on TV,you will have seen exactly the sighting I had. The US military uses this area and surounding areas of 100 miles for flight practice.You often hear their very loud and low engines when its storming. These odd and bright string of weird acting bright glowing balls in a string may well be decoys for heat seeking missiles and the loud jet engine noises may well be the fighters distanceing themselves as very fast as possable from the decoys. The glowing balls were silent."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/35896.html.txt","/var/www/straped/mufon/org/35896.html"],"Object Shape":"Sphere","trends":["There have been 3 other sightings in Conway","There were no other sightings in Conway on or around February 14th 2011"],"Case Number":"35896"}