{"Date of the Event":"11/30/2011 07:00 UTC","Region":"New Hampshire","Viewing Distance":"Over One Mile","Summary":"Looked out back at, work saw three lights in cloud cover.","Object Features":"Undisclosed","Disposition":"Unresolved","Country":"United States","Sighting Duration":"07:00:00","Case Number":"35892","Log Number":"US-02172012-0025","divs":["Sighting DetailsWent to look out the back door at work around 7pm. towards Mount Ascutney in VT. It was three white lights in a triangle pattern, with a center green blue light with a milde glow in the middle, in a mild cloud cover. Thought it might be stars through the clouds, or a house across the valley. But the angle was to great to be a house on the mountain on the other side of the river. I went out at 7:15 and the clouds had moved, the lights were gone, there were no stars in that pattern, and the angle was to high to be something on the mountain. When I was looking at it, it was like they were trying to send images telepathically, mentally like trying to communicate. I felt a bit warm, and there was a feeling of electro-magneteic, or dry static elcectricity feeling, with a metalic taste in my mouth. I do work in a mahcine shop metal working, but this was like the tast of maybe blood taste. If you cut your finger and try to stop the bleeding. That taste. It was like a residue for over two hours after they left. The images were of like star patterns, or star charts, like a flight path map you would see of the us and all the flights, connected from air port to airport. Also there were symbals, and geometric shapes that I did not understand, or could reporduce, they were very detailed. It was to intense and fast, like downloading of the inernet very fast. I feel that I had had a close encounter. The vessel was about a mile away approx. 45 deg angle from where I was, so I would put it at about 3000 ft agl. But I will always remeber the feeling I got, like a hotflash during what I feel was some kind of communication. I will never forget this experience."],"Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/35892.html.txt","/var/www/straped/mufon/org/35892.html"],"trends":["There has been one other sighting in Claremont","There were no other sightings in Claremont on or around November 30th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.365172,+-72.337012(35892)&iwloc=A&hl=en\"> mufon case (35892) map </A>","Longitude":"-72.337012","Object Shape":"Triangle","Tags":"City","Latitude":"43.365172","City":"Claremont","Date Submitted":"02/17/2012 09:03 UTC"}