{"Latitude":"35.573221","Longitude":"-80.839611","divs":["sighting detailsi got up to go to the bathroom around 1:00 am. i thought, \"i should open these venetian blinds a little so that i can see out.\" (at night i keep all of the blinds shut tight in order to provide another layer of dead air to insulate against the cold coming in.) as i opened them a crack, there was a very bright orange star hanging nearly at the zenith. i thought, \"oh, jupiter.\" but then i thought, \"jupiter isn't orange like that.\" i kept watching to see if the object moved any. after watching awhile, the brightness decreased and i could see a tiny white triangle of light with small red lights surrounding the edge. the red lights started to cycle around the edge like on the old theater marquees. this was all very tiny, maybe at the altitude of 10,000 feet. other than the light show it didn't move out of place for quite awhile. so i thought if that's all the show i'm gonna get, i'm going back to bed. (by this time i'm pretty jaded, i have had 8 or 9 other sightings starting about 10 years ago.) when i got in bed i looked up through the open blind toward where the object was located but could not see the object. before i gave up looking, the object sailed gracefully by my window, from left to right, probably at an altitude of less than 1,000 feet and i estimate about one quarter mile from me horizontally. the apparent size during the fly-by was 3\\4 inch held at arms length. i wasn't excited per se because this is old hat with me, but i was grateful to have been invited to see it. there is no way i would get up to go to the bathroom and think on my own \"i think i'll open the blinds...\" it's interesting that none of the ten craft i have spotted in the past ten years is remotely like the others in size, shape or color or behavior."],"Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.573221,+-80.839611(35890)&iwloc=A&hl=en\"> mufon case (35890) map </A>","files":["/var/www/straped/mufon/html2text/35890.html.txt","/var/www/straped/mufon/org/35890.html"],"Summary":"Bright orange star faded and you could see a triangular, silver-white craft with sequential red lights circling the edge of the triangle. Was hovering at about 10,000 ft. Later descended and went by my window at under 1000 ft.","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unresolved","trends":["There have been 5 other sightings in Mooresville","There were no other sightings in Mooresville on or around February 14th 2012"],"Case Number":"35890","Date Submitted":"02/17/2012 08:51 UTC","Date of the Event":"02/14/2012 01:00 UTC","Tags":"City","Sighting Duration":"00:12:00","Log Number":"US-02172012-0023","City":"Mooresville","Object Shape":"Triangle","Object Features":"Other","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Source":"MUFON","Country":"United States"}