{"Region":"Virginia","Log Number":"US-07152005-0001","Summary":"unlit object seen moving through the sky, turned bright white, changed direction, disappeared","Case Number":"3590","files":["/var/www/straped/mufon/html2text/3590.html.txt","/var/www/straped/mufon/org/3590.html"],"Object Features":"Unknown","Source":"MUFON","Country":"United States","trends":["There have been no other sightings in Amelia C.H.","This sighting has never been favorited."],"Date Submitted":"07/04/2005 12:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"37.321271","Object Flight Path":"Path with directional change","City":"Amelia C.H.","Object Shape":"Diamond","Longitude":"-77.973865","map":"<A HREF = \"http://maps.google.com/maps?q=37.321271,+-77.973865(3590)&iwloc=A&hl=en\"> mufon case (3590) map </A>","Date of the Event":"07/04/2005 12:00 UTC","Tags":"City","divs":["Sighting DetailsWas up late with a friend sitting out in the front yard looking at the stars (rural area, no city lights). Had been observing quite a few shooting stars, one of which was particularly impressive, leaving a trail as it passed across the sky. While stargazing, observed an object crossing the NE sky. Object was unlit and barely observable. Approximate size was about a quarter of an inch at arms length. Could not make out a clear shape but if I had to guess, I would say it had a diamond shape but as I said it was very hard to see it. I pointed it out to my friend, thinking it was a satellite. As we watched it cross the sky, north to south, it turned bright white. It wasnt like landing lights were switched on. When it started to light up, it started dimly and grew to an extremely bight white (this only took 3-4 seconds). It then made a 90 degree turn to the east (not an acute right angle but a sharp arc, sharper than any of our aircraft can do) Was visible, bright white, headed in it's new direction for 1-2 seconds. Witnessed by two males in their 40's."],"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data"}