{"Region":"Florida","Date of the Event":"02/17/2012 10:45 UTC","Source":"MUFON","Log Number":"US-02172012-0033","Disposition":"Unresolved","divs":["Sighting DetailsI was driving home from work and turned onto Miccosukkee road from Hillcrest street at 10:45 pm and saw a steady red light fairly large sized above a church yard across the street, I thought this was odd because Lifeflight usually flies in from this direction towards the hospital but this was a steady red light and there was no helicopter sound. When I turned onto Terrace street I discovered that it was moving away from the hospital and was moving away from me (toward the west) at a quick but steady pace. It was hard to keep an eye on it with the trees and old, tall houses in my neighborhood. I didn't know that it had gotten so far away so quickly until I pulled into my driveway and stopped moving to try and see what it was between a break in two trees. It was stationary and red, then started to pulsate white and red all over alternately then headed north and at a slight upward angle towards the cloud cover we had tonight. It then took off at that angle (looking like a small meteorite streak). It had to be 10:47 when it left because that is when I called my husband to tell him what I saw."],"Latitude":"30.439796","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Saw steady red light in one location that moved steadily but quickly from east to west, pulsated red and white then took off to north.","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-84.275483","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.439796,+-84.275483(35900)&iwloc=A&hl=en\"> mufon case (35900) map </A>","Date Submitted":"02/17/2012 11:47 UTC","City":"Tallahassee","Object Shape":"Sphere, Star-like","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around February 17th 2012"],"files":["/var/www/straped/mufon/html2text/35900.html.txt","/var/www/straped/mufon/org/35900.html"],"Case Number":"35900","Object Features":"None","Country":"United States","Viewing Distance":"501 Feet - 1 Mile"}