{"map":"<A HREF = \"http://maps.google.com/maps?q=33.888781,+-117.166993(35906)&iwloc=A&hl=en\"> mufon case (35906) map </A>","Object Shape":"Unknown","Country":"United States","trends":["There have been 13 other sightings in Moreno Valley","There were no other sightings in Moreno Valley on or around January 7th 2012","This sighting has been favorited 1 time.",""],"Longitude":"-117.166993","Source":"MUFON","Tags":"City","Date of the Event":"01/07/2012 11:30 UTC","Weather Factors":"Unknown","Latitude":"33.888781","Case Number":"35906","files":["/var/www/straped/mufon/html2text/35906.html.txt","/var/www/straped/mufon/org/35906.html"],"Date Submitted":"02/18/2012 10:22 UTC","Region":"California","Sighting Duration":"00:01:00","Object Features":"None, Unknown","Log Number":"US-02182012-0005","divs":["Sighting DetailsMike and I were looking out my bedroom window when I saw the light heading towards our house at what looked like low-altitude. It's path of flight, speed, and singular light maybe suggested a helicopter, but we ran down the stairs and outside to the back yard patio to witness it fly over the house and it was completely to my surprise, noiseless. The light on it was very erie and had the quality of an L.E.D. type of light where if you would look at it directly, it would be brighter than from the side, but as the light moved over us and passed over the hilltop out of view it never really dimmed. Instead the light had this odd sputtering quality as if the light itself were a form of propulsion, but again, it was completely noiseless, so how could that be? It does not fit the profile of any human craft I can think of. We couldn't even see any structure or size to the object outside of the light (which wasn't blindingly bright but modestly bright). It's trajectory seemed very straight-line and purposeful. It seemed like it glided very smoothly at a perfect, unwavering speed. We lost sight of the object just short of it passing over the hill-top out of view when it sputtered out completely and was not seen again. When we got outside on the back patio, that's when Mike started shooting the video with his iPhone. He emailed it to me and I'm sending it to you for your inspection."],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Summary":"Just a singular bright orangish red light that sputtered irregularly and cast no shadows and made no noise. Couldn't see any vehicle shape behind the light.","City":"Moreno Valley","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile"}