{"Date Submitted":"02/18/2012 11:21 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.112266,+-93.201158(35908)&iwloc=A&hl=en\"> mufon case (35908) map </A>","divs":["Sighting DetailsMy daughter and myself were driving down Highway 10 on the evening of February 17, 2012. I seen lights that seemed quite close to the ground, I told my daughter kind of jokingly, look, a UFO. Since I had to also keep a eye on the road, she said no, that is the top of the water tower in Mounds View, I said, No, we are still at least five blocks from the water tower. I looked again, as we were passing it, It was a large black triangle with lights only on one angle, it seemed to be tilted and hovering in one spot, not moveing. She sat and stared also and said Oh my Gosh Mom, what is that? I said let's circle the block and check it out! We both had hair standing on edge. As we got to the next block where we could take a left to head in that direction, we lost it in the tree line, I said, it is o.k. we will catch it when we turn the corner. Well, as we turned the corner, there was absolutely nothing. We were baffled. So we drove back up Highway 10 and recreated our drive. Nothing! Now, I know there is a small Anoka County Airport about ten miles up the nearest Interstate, but if it would of been something waiting to land, we would of seen it as we turned the corner, it could of only been 60 seconds that it was out of our site, I just know others had to see this too."],"Tags":"City","Viewing Distance":"101-500 Feet","Region":"Minnesota","Log Number":"US-02182012-0007","Country":"United States","Latitude":"45.112266","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Hovering then path","City":"Mounds View","files":["/var/www/straped/mufon/html2text/35908.html.txt","/var/www/straped/mufon/org/35908.html"],"Object Shape":"Triangle","Longitude":"-93.201158","trends":["There has been one other sighting in Mounds View","There were no other sightings in Mounds View on or around February 17th 2012"],"Date of the Event":"02/17/2012 07:09 UTC","Case Number":"35908","Summary":"Large Black Triangle hovering 500ft","Object Features":"None","Sighting Duration":"Undisclosed"}