{"Region":"California","files":["/var/www/straped/mufon/html2text/35912.html.txt","/var/www/straped/mufon/more/35912_submitter_file1__L1010084.JPG","/var/www/straped/mufon/org/35912.html"],"Log Number":"US-02182012-0010","Date of the Event":"02/09/2012 02:30 UTC","Source":"MUFON","Summary":"Something transparent with lights in the sky","Country":"United States","divs":["Sighting DetailsMid afternoon, well into the Mohave during the early afternoon of 2-9-2012. About two hours drive out of Trona, CA. I felt a sudden sense of urgency to stop the car. I got out and walked around for a few minutes, looking around but noticed nothing. I started snapping photos of the surrounding area. Did not notice anything unusual with the photos until today when I started reviewing them on my computer. It appears I captured lights and perhaps a shadow of something larger and smaller lights around the periphery. Larger object appears to be transparent. If a reflection, not sure of what, since there was nothing around me, no other vehicles and not a cloud in the sky. One of the lights appears to be emitting, as you can clearly see the edges. I saw nothing and heard nothing at the time. I saw no air craft and was looking for China Lake jet patrols but saw none. I have one photo saved on the original memory card at the time the photo was taken. I have attached it here. I wish I had more information to offer, but as earlier stated, I did not see anything that day, so perhaps this is nothing, but maybe...it could be something...."],"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Searles Valley","This sighting has been favorited 1 time."],"Object Features":"Unknown","Date Submitted":"02/18/2012 06:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.762737,+-117.37309(35912)&iwloc=A&hl=en\"> mufon case (35912) map </A>","Weather Factors":"Unknown","Tags":"City","Latitude":"35.762737","City":"Searles Valley","Viewing Distance":"501 Feet - 1 Mile, Unknown","Case Number":"35912","Longitude":"-117.37309","Object Flight Path":"Unknown,N/A","Object Shape":"Unknown","Disposition":"Unresolved"}