{"Country":"United States","Source":"MUFON","divs":["Sighting DetailsA friend and I were fishing at Lewisville Lake, in Denton County, late at night. Sometime after midnight, approx., we saw a bright, vertical line of white light forming in the western sky. This line was slowing moving towards us and as it did, it seemed only the front edge was moving and leaving a long rectangular plane behind it. Within the rectangle were sharp, equal bands of light, in different shades of white, about 7 bands. There were no windows, or any sound. Though it seemed to be moving slow and steady, it must have been travelling fast. It didn't glow, like with diffused light, but we couldn't see through it either. It seemed 2 dimensional, with a height of maybe a mile and a width of approximately 500 miles long. Right above us, the leading edge of the rectangle made a sharp 90 degree turn to the south, with the remaining part of the rectangle still moving east until it hit that point, at which it bent and also turned to the south. We watched this display for around 10-20 minutes. We never saw any structure. Nothing was ever emitted from it. It didn't seem like any kind of craft. It was just like a huge and long light crossing the sky. It finally vanished into the south. I've never seen any UFO report similar to this and I never reported it. I can't imagine what it was. 3 days after this event, I was searching the local newspaper, Dallas Morning News, to see if there was any report on it. There was a small report mentioned about a Russian Missle that had re-entered the atmosphere over our west coast, travelling east to Oklahoma, then turning south, went over Dallas, and Houston before going out over the Gulf and falling into the water. My date and times are only approximate. I clearly remember the event and have grown more and more curious as to what I really saw. I know that it couldn't be any kind of missle or any satellite. It wasn't re-entering our atmosphere, there were no sparks or flames. It was travelling in a continuous direction east and then turning south. It never moved up or down and it only turned at that one point, the rectangle bending around one point so at the same time, there was the leading part heading south and a trailing part still heading east. I also approximate the time it took to pass over us. I know it started south long before we ever saw the end of it and we could have watched it for more than 20 minutes or more, or even less. Also, I think the event occurred sometime between the mid 1980's to 1990. I've had my share of ridicule about this, but it really did happen. I don't make any claim as to what it was, I just don't know, nor do I have anything to compare it to. My only hope seems to be some entity like yours with much greater access to info than I have and active investigators. Can you tell me what I saw or at least know of others who also witnessed it or something similar to it?"],"Log Number":"US-02182012-0012","Weather Factors":"Unknown","Summary":"Two dimensional rectangle made up of 7 bands of differing shades of white, 1 mile high x 500 miles long.","Date of the Event":"11/01/1989 12:00 UTC","City":"Lewisville","Viewing Distance":"Over One Mile","trends":["There have been 8 other sightings in Lewisville","There were no other sightings in Lewisville on or around November 1st 1989"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Region":"Texas","files":["/var/www/straped/mufon/html2text/35914.html.txt","/var/www/straped/mufon/org/35914.html"],"Longitude":"-96.964451","Disposition":"Unresolved","Case Number":"35914","map":"<A HREF = \"http://maps.google.com/maps?q=33.069288,+-96.964451(35914)&iwloc=A&hl=en\"> mufon case (35914) map </A>","Tags":"City","Date Submitted":"02/18/2012 08:00 UTC","Object Shape":"Square, Rectagular","Latitude":"33.069288","Object Features":"None"}