{"Sighting Duration":"Undisclosed","Summary":"black cylinder no wings no tail wings no lettering no windows","Region":"Pennsylvania","Case Number":"35923","Viewing Distance":"101-500 Feet","Date of the Event":"02/01/2012 04:07 UTC","Latitude":"41.208393","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/35923.html.txt","/var/www/straped/mufon/org/35923.html"],"Longitude":"-78.575579","Object Flight Path":"Straight-line path","Source":"MUFON","Object Shape":"Bullet, Missile, Cigar, Cylinder","divs":["Sighting DetailsI was driving my car on interstate 80 heading eastbound. Between the Dubois,Penfield exits I notice an object coming towards 80 from my car. The object was heading from my passenger side of car. Above the trees, from my right ,flying towards my left, over all lanes of highway. I looked up at it , I noticed it was all solid black. I looked for wings ,none, no tail fins either. I looked for windows none,no writing on it either. The first thing that entered my mine was what is that. Im driving trying to watch it also. I looked around to see if other cars were near me seeing this. I felt there was nobody around. I looked towards the westbound lane and watch the cars and this object flying over head.It just vanished over the horizon.The shape of object was long or cylinder shaped.The object seem to have the Length of 2 tractor trailor's end to end or a bit longer. Then shortly after that a jet appeared. Flying same direction chasing it. The object and jet didn't seem to be flying super sonic,real fast.It appeared that this jet was on hot pursuit. The jet seemed to fly same height and speed as this object. The object seemed to keep a steady speed. When the object disappeared from my sight,the jet appeared. My mine is racing trying to capture every detail of it and drive. I know what I saw, a black cylinder shaped object with no wings ,motor or windows or writing on it. No comparison to even a goodyear blimp. The object was more slender than a blimp.I was driving by my self. I was thinking of taking a picture with my cell phone,it didn't happen. I sure wish I would of had somebody with me that day. I would of had a fantastic picture and close up. The weather was real nice that day, sunny.For now on I will keep a loaded camera in the car."],"Log Number":"US-02192012-0003","Date Submitted":"02/19/2012 12:45 UTC","City":"penfield","trends":["There have been no other sightings in penfield","This sighting has been favorited 1 time."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.208393,+-78.575579(35923)&iwloc=A&hl=en\"> mufon case (35923) map </A>","Weather Factors":"Unknown","Object Features":"None"}