{"Date of the Event":"05/20/2010 12:00 UTC","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Summary":"we were shining a light at a branch to hang our food and a light shined back on us","Latitude":"47.750447","map":"<A HREF = \"http://maps.google.com/maps?q=47.750447,+-90.334273(35931)&iwloc=A&hl=en\"> mufon case (35931) map </A>","Source":"MUFON","Longitude":"-90.334273","Sighting Duration":"00:00:30","City":"Grand Marais","Object Shape":"Unknown","Viewing Distance":"101-500 Feet","Tags":"City","Date Submitted":"02/19/2012 03:32 UTC","trends":["There have been no other sightings in Grand Marais","This sighting has never been favorited."],"divs":["Sighting DetailsMy girlfriend and I were camping on an island on brule lake in the boundary waters in the arrowhead of minnesota. We were being loud and having a good time drinking and jamming the tunes on our dynamo radio, we also had a campfire burning. When it was time to hang up our food to keep bears from snatching it I shined a light up at the branch we planned on hanging it from, immediately after turning off the flashlight a bright white light turned on! It was shining directly down on us. The light was brighter than all the stars in the sky but not bright enough to notice it illuminating the ground around us. The light remained stationary for a couple seconds while my girlfriend and I reaffirmed that we were seeing the same thing. The light looked to be about 500 feet above us at about a 60 degree angle which would place it over the lake. The white light turned off and a light blue light remained, then the craft made a reverse \"J\" manuever that no human craft I know of would be capable of and then it zoomed out into space, faster than any human craft I know of. The strange thing about this is that neither of us felt any fear during or after the experience. It really seemed like they wanted us to know they were there. I am sure they were watching us for a while before we accidently \"signaled\" them."],"Case Number":"35931","Country":"United States","files":["/var/www/straped/mufon/html2text/35931.html.txt","/var/www/straped/mufon/org/35931.html"],"Weather Factors":"Unknown","Log Number":"US-02192012-0011","Object Features":"Unknown","Region":"Minnesota"}