{"Object Flight Path":"Straight-line path","Object Shape":"Triangle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/35941.html.txt","/var/www/straped/mufon/org/35941.html"],"Summary":"Lights in a triagular patern moving from west to east.","Latitude":"41.641141","Longitude":"-88.447295","map":"<A HREF = \"http://maps.google.com/maps?q=41.641141,+-88.447295(35941)&iwloc=A&hl=en\"> mufon case (35941) map </A>","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Country":"United States","Date Submitted":"02/19/2012 10:55 UTC","Tags":"City","Case Number":"35941","Sighting Duration":"00:02:00","Date of the Event":"02/19/2012 08:30 UTC","Region":"Illinois","Object Features":"None","City":"Yorkville","Log Number":"US-02192012-0021","trends":["There has been one other sighting in Yorkville","There were no other sightings in Yorkville on or around February 19th 2012"],"Weather Factors":"Unknown","divs":["Sighting DetailsApprox 830PM CST. I turned off the TV and looked out my window that faces west to have a look at the stars when I noticed what look liked a bright star or airplane headlight. I got out my 10x binoculars to view the object up close to see if it was moving. When I noticed that it was moving relative to the stars I thought I would see its strobe light since it was probably an airplane. When I didn't see any strobes I continued to observe the object through the binoculars. My next thought was that it must be the space station as it was too bright to be a satellite. The object moved about the same speed as an airplane. As it moved closer I noticed two bright orange colored lights underneath and to the rear of the object. When it was almost overhead, and when I managed to keep the binoculars very still I noticed a faint blinking red light in the center of the object. It seemed to be a triangular shaped object with two orange colored lights in back, one faint blinking red light in the center, and one bright white light in the front. It was too dark to make out any features. I lost sight of the object when it flew overhead. No sound. I looked online to see where the current location of the space station was. When I found out is was still west of me I knew it couldn't be that."]}