{"Viewing Distance":"21-100 Feet","Object Shape":"Triangle","Country":"United States","divs":["Sighting DetailsMy mother and I had snuck ouside to have a couple drags off of a cigarrete while my father was taking a shower(he didn't Know that I smoked, and was apposed to my mother smoking). We went around to the south-west side of the house and leaned our backs to the wall, standing side by side under the eve, about a foot apart. I felt my mother tense up next to me and she started to hit my arm frantically, remaining silent, I looked over at her at once to find her staring straight up with her jaw wide open. I followed her gaze into the sky, then my jaw fell, directly above us(we were actually under an oak tree that had lost it's leaves for the year as well) was a large black sillouette of a triangle with strange blue-silverish round lights on all three corners and one slightly larger in the center. It was less than 100 feet above us, it hovered what seemed like was just above the 50-60 foot oak tree, very close. Not only was it silient, but the lights on the object never reached the ground, the area was not lit, no shadows out of place. The lights were a strange blue and almost looked like there was a liquid texture to them that kinda swirrelled behind the lens, but as I said they didn't actually \"shine\". The center light remained stationary while the three outer lights blinked in succesion, giving the illusion, I think it was an illusion, That it was spinning, I remember trying to decide if it was or not. I think I remember some straight lines, and right angled lines on the bottom, but mostly it was a black sillouete. We both stood there staring at it silently for a while, mesmurized. I would estimate no more than five minutes elapsed. Then I heard a strange noise, it was my mothers voice trying to escape her throat. It started as a deep gutural sound that strained from her chest, I remember thinking it seemed to come out really slow and forced but she finally managed to scream: DONALD!(my fathers name). This snapped me out of my trance and I heard a commotion in the house, wich I realized was my dad rushing out of the shower and sprinting through the house to the front door upon hearing his wife call his name in that manor. Just as I heard him aproach the door the object exploded into a perfect ring of red, blue, and green capsules of light. My mom and I both yelled WHOA! at the same time. It turned into a little red blinking light and sped off as my dad flung the door open, naked as a jay bird with soap in his hair and toso. By this time I was yelling at my mom \"oh my god what was that\" completely amazed and excited, we ignored my dad who had just sprinted from the shower to see a red blinking light speeding off.\"Thats an airplane,\" he told us noncholantly. Our excitement quickly convinced him otherwise. Luckily in all the excitement he didn't notice the cigarrete in my hand, but neither did I at that moment. He finished his shower then joined me and my mom briefly in scanning the sky. This next part is the strangest part of the story, mostly due to the fact I totally forgot about it for 15 years! When the memory came back to me(semi recently) It came to me as if I had never forgotten it, I can't remember what trigered it. Later that same night I woke up with a start(I slept in a small camper trailor about 50 feet from the main house), I looked out my window and I could see everything in the yard, the light kinda reminded me of when lightning strikes, that silverylight, only it was steady, It didnt even produce shadow it was so bright outside, the yard was truly flooded in light, I didn't actually see the source but I could tell it was from not to far above my trailor. I closed my eyes and laid back down immediatly, hoping it would be gone when I opened them, but it wasn't. My only rational thought was to grab my 22 caliber rifle for protection. Isummoned the strength to sit up and swing my legs off the bed and open the cuppoard where I usually kept it. My heart sank to my toes when I realized it was in the house. The yard was still saturated with the strange light as I got out of bed and looked out of other windows to make sure. I paced from one end of the trailor to the other 2-3 times. I remember thinking to myself with grimm reaization\"I've gotta make it to the house\" I was certain my dad would know what to do. I stood at the door of my trailor with my hand on the door lever, but I was so scared I couldn't bring myself to push down. I cosciencly made an attempt to control my breathing as a stood at the door, the light still bright on the other side of it. I realized it wasn't going away, so in my mind I decided \"I cant stay out here, I gotta make it to the house!\" I took several deep breaths and counted to three before I flung the door open and took off in a flat sprint for the house. I had probably covered 25 feet before I realized it was gone, the light, the fear, the heavy breathing, gone. The only way I can describe the feeling is like this: you ever go to take a drink of milk but it winds up being kool-ade instead. Your sense of taste is almost startled by it, confused. That probably dosen't make sense to anyone but me. I stood midway between my trailor and the house in complete darkness and silence totaly confused and disoriented. \"I'm going in the house anyway's!\" I thought to my self and started off in that direction then stopped, thinking \"what am I gonna tell my dad\" I turned around and headed back towards my trailor a few steps, stopped and thought,\"I should at least go get my gun\" turned back towards the house, stopped again and thought \"Why?\" I walked back to my trailor reluctantly and laid in bed for hours, wide awake staring ou the window, but nothing else happened. Then I forgot the entire event until I was 31 years old (I was sixteen when it occured)"],"Summary":"Outside with mother, large Triangle craft hovered directly above lights on three corners and middle. Changed dramatically into blinking light, left, returning later","Tags":"City","Log Number":"US-02202012-0003","Latitude":"38.361547","Case Number":"35944","files":["/var/www/straped/mufon/html2text/35944.html.txt","/var/www/straped/mufon/org/35944.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.361547,+-120.529699(35944)&iwloc=A&hl=en\"> mufon case (35944) map </A>","Date Submitted":"02/20/2012 05:20 UTC","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Rail Road Flat","This sighting has never been favorited."],"Region":"California","Object Flight Path":"Stationary","City":"Rail Road Flat","Disposition":"Unresolved","Date of the Event":"10/15/1992 12:00 UTC","Longitude":"-120.529699","Source":"MUFON","Object Features":"Patterned Surface"}