{"City":"Lansdale","Log Number":"US-02202012-0016","map":"<A HREF = \"http://maps.google.com/maps?q=40.243895,+-75.281916(35958)&iwloc=A&hl=en\"> mufon case (35958) map </A>","Object Shape":"Star-like","Date Submitted":"02/20/2012 11:27 UTC","Source":"MUFON","Region":"Pennsylvania","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"35958","Latitude":"40.243895","files":["/var/www/straped/mufon/html2text/35958.html.txt","/var/www/straped/mufon/more/35958_submitter_file1__CP.jpg","/var/www/straped/mufon/org/35958.html"],"Weather Factors":"Unknown","Tags":"City","Date of the Event":"02/20/2012 07:00 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsOutside with the dogs. Facing east no clouds at 7pm observed bright star-like object to lower left of Pollux it was as bright and about same size as Sirius. The constant and bright round light moved upwards toward the zenith then when it was just slightly higher than Pollux it pulsed brighter and larger, it returned to original size and continued upwards until almost on same level with castor and pulsed again even larger still then moved up to a level even with or slightly higher than castor and pulsed even larger and brighter than the first two times and vanished. To provide an idea of the duration I had time to say the following in my head. Hello... What are you doing there?, oh you're moving! you're not a plane... whoa!that was bright, up again, whoa! what a flash! what are you??? Are you kidding me?? Wow! Where'd you go? I watched for another 15 minutes but did not see it again."],"Object Features":"Unknown","trends":["There have been 12 other sightings in Lansdale","There was one other sighting in Lansdale on or around February 20th 2012","This sighting has been favorited 1 time.",""],"Summary":"Facing east no clouds at 7pm observed bright star-like object to lower left of pollux light moved upwards toward the zenith just above pollux and pulsed brighter and larger, it returned to original size and continued upwards almost even with castor....","Disposition":"Unresolved","Longitude":"-75.281916"}