{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=31.413482,+-100.480231(35950)&iwloc=A&hl=en\"> mufon case (35950) map </A>","Tags":"City","Log Number":"US-02202012-0008","files":["/var/www/straped/mufon/html2text/35950.html.txt","/var/www/straped/mufon/org/35950.html"],"Longitude":"-100.480231","Case Number":"35950","Date Submitted":"02/20/2012 04:11 UTC","Latitude":"31.413482","Date of the Event":"02/17/2012 07:27 UTC","Country":"United States","Region":"Texas","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["sighting detailsstepped out to back yard to have a smoke and noticed a aircraft (plane)traveling at approx. 40 deg. moving e. to w. at reg. commercial height 30-35,000 ft. then scanned sky and noticed a very bright very fast moving pulsating red light. this object was moving from a wnw to e direction and upon getting within a half mile or so from airplane made a very sharp turn to the sse in under a second. if i had blinked i would have not seen the turn. the object seemed to be under the airplanes altitude but not by much from my vantage piont.it seemed to turn to go under the plane . i then ran in the back door and grabbed my binoculars and ran out the front to try and see what this was, i didnt have time to get the camera. looking at it i noticed 1. it had no regular type running lights and pulsated very slowly from bright red to a dim orange\\yellow. 2. it was moving two to three times the speed of the oncoming aircraft. 3.it made no noise that i could hear.i could hear the airplane as it passed by after the object was gone from sight. 4. it should have made a sonic boom but did not. 5.this object was completely out of sight in less than a minute(commercial aircraft take several minutes from in sight to out of sight) 6.the size of the light was much bigger than the whole airplane. 7.the pilot of the aircraft must have seen this,due to the brightness and close proximity of said object. after watching the light go out of sight at 20 deg. or so i returned to the back yard and could see and hear the airplane (jet)and watched it for a few seconds then went to explain to the family why i was acting like a crazy person. hope this was helpful and maybe the pilot of the aircraft will come forward , but we both know that is not likely. feel free to call my cell if you have any questions. thanks......."],"Object Flight Path":"Path with directional change","Object Features":"None","Source":"MUFON","Object Shape":"Unknown","trends":["There have been 9 other sightings in San Angelo","There were no other sightings in San Angelo on or around February 17th 2012"],"City":"San Angelo","Summary":"Observed aircraft then noticed UFO heading toward aircraft, UfO then changed direction."}