{"Date of the Event":"05/04/2011 07:10 UTC","City":"Austin","Log Number":"US-02212012-0001","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Two small orbs, yellow in front tennisball sized, red beside it about golfball sized.","divs":["Sighting DetailsMay 4th, 2011 near dusk while watching television and facing open window, noticed movement outside. Noticed two orbs flying synchronously by window. Yellow orange glowing orb of about tennis ball size accompanied by red smaller orb. Red orb was partially obscured by yellow orb. Both seemingly solid objects glowed though I did not note reflected light on ground outside window or glare on window panes. Objects traveled approx north to south in straight unwavering line approx 2-3 feet high over yard. Exact speed unknown though approximately that of a fast walk .. enough for me to note inside house through window and observe colors, size and direction and general position over the ground and just past my porch. No observable physiological or psychological effect on myself or missing time. Unable to note further path of object as it was gone by the time I made it to window, though oddly, within thirty seconds of object passing -white- fireflies began to rise all over yard. Fireflies in this area tend to be yellowish in color and very few are noted at once in one area. Approx 10-15 were noted rising in small backyard area. Orbs seen were NOT fireflies, remained lit or glowing entire 6-10 seconds of view time and were simply too large to be considered phosphorescent bugs. My first thought isn't remembered though several things passed my mind in quick succession. I, rather wonderingly considered them potential 'probes' of some sort or some sort of unknown flight-capable object. I dismissed the thought of tennis or children's balls having been tossed over a neighboring fence as they flew parallel to the ground ( no arc whatsoever was noted in their path)and were within 25-30 feet of where I sat. My window is wide and some sort of arc would have been noted or likely the bounce of one of them, had they been thrown objects. Their height from the ground was wrong for this as well, due to the height of the fence that abuts that side of the yard. By the time I saw them, they were at least 12-15 feet away from the 6 foot fenceline and flew in a straight line, not 2-3 feet over the earth. No balls were found afterwards. Fireflies were also dismissed due to the continuously glowing nature of the objects and their varying colors. The white lights that I assumed to be fireflies that rose afterwards were white in color, very wispy in nature and tended to fly slowly upwards, their lights diminishing within a small second or two as they rose. I am also familiar with 'spirit lights' or 'orbs' of the paranormal genre though these did not seem transparent and did not meander in their path as most depictions of such orbs are said to do. My feelings? I was rather shocked though intrigued and curious. I felt -no- fear strangely enough though kept my seat for a long few seconds after it passed. Though I was not exactly fearful I was cautious and sat there long enough for it to, hopefully, make its way out of my backyard. Just before I rose, I noticed the fireflies beginning to rise so grabbed up my cell phone, called a friend who is interested in such things and watched the fireflies rise as I told him about the possible sighting. I later exited the house and looked for any sign of the things though by this time the sun was down and, despite my porch lights illuminating the porch outside, I could see little. There were no other signs left by the next day or so, either on the ground under its basic flight path or on the fences to either side that abut my yard. I later reported this to a local Texas based investigator."],"Tags":"City","Longitude":"-97.740641","Object Shape":"Sphere","Source":"MUFON","files":["/var/www/straped/mufon/html2text/35959.html.txt","/var/www/straped/mufon/org/35959.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.271183,+-97.740641(35959)&iwloc=A&hl=en\"> mufon case (35959) map </A>","Object Flight Path":"Straight-line path","Latitude":"30.271183","Case Number":"35959","Date Submitted":"02/21/2012 12:59 UTC","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around May 4th 2011"],"Object Features":"Undisclosed","Region":"Texas","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less, 21-100 Feet"}