{"trends":["There has been one other sighting in Sparta","There were no other sightings in Sparta on or around February 19th 2012"],"Sighting Duration":"Undisclosed","Case Number":"35954","map":"<A HREF = \"http://maps.google.com/maps?q=43.132288,+-85.713586(35954)&iwloc=A&hl=en\"> mufon case (35954) map </A>","Object Features":"Undisclosed","Disposition":"Unresolved","Region":"Michigan","files":["/var/www/straped/mufon/html2text/35954.html.txt","/var/www/straped/mufon/org/35954.html"],"Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-85.713586","Country":"United States","Weather Factors":"Unknown","City":"Sparta","Viewing Distance":"Unknown","Date of the Event":"02/19/2012 08:30 UTC","divs":["sighting detailsi would like to report that last night at 8:30 pm feb. 19th i saw a single orange object over sparta,mi while standing outside on a deck. i was taking my dogs out at the time and often watch the night sky. i first noticed it due to its non-ordinary appearance. i really had no explanation of what hte object was, just that i knew it seemed odd. this is the report i sent to [name redacted\\cms\\tg] at [site redacted\\cms\\tg] i saw it first coming from the north traveling southward. the object was moving slow and had no sound. it seemed to be quite large in the sky and had no other color other than orange. it then got to about almost an eastward viewing still at about 60-70 degrees overhead and began to fade (almost as if it were gaining a lot of altitude). it took about 10-20 seconds then disappeared all together. i know the report you have says it describes 13 objects, but i only witnessed this one. i knew it was not an aircraft that is known to me and was not a meteorite or shooting star. the best way i could describe it when i first saw it was a glowing orange sphere and about the size of a soccer ball in the sky. it seemed close, almost like that of a helicopter in regards of distance.it wasnt until it was about 2\\3rds of its visibility that it got smaller and faded. unfortunately i have no evidence of this, just my eye witness report. my wife was at home but she works third shift. i did run in the door at one point to wake her, but by the time she got to the door it had faded away."],"Latitude":"43.132288","Summary":"An orange glowing sphere","Date Submitted":"02/20/2012 07:51 UTC","Tags":"City","Object Shape":"Sphere","Log Number":"US-02202012-0012"}