{"Weather Factors":"Unknown","Latitude":"20.941008","Country":"United States","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=20.941008,+-156.674402(35955)&iwloc=A&hl=en\"> mufon case (35955) map </A>","City":"Lahaina","Longitude":"-156.674402","Log Number":"US-02202012-0013","trends":["There have been 5 other sightings in Lahaina","There were no other sightings in Lahaina on or around February 20th 2012"],"Case Number":"35955","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was awakened by exceedingly bright light flashes in the southern sky. These persisted for longer than the hour I continued to observe them in the low southern sky. The night was clear, but this phenomenon seemed to have a cloud associated with it and repeatedly came from 2 distinct locations. I got out our Leitz 10x binoculars in an attempt to see better what was going on. It seemed like gigantic arc welders were illuminating the sky with varying blasts of very intense light. There was no sound associated with the lights. I began observing this @ 2:34 AM and it continued for longer than the 70 minutes I stayed awake watching. I was uncertain whether or not some of the light blasts had star-like movement associated with them and decided to look elsewhere in the sky when I detected a brightest star in the sky almost 180 degrees away from the lightning like display. When I first looked at this light with binoculars I thought my hands were shaking because of its movements, so I braced my hands and binoculars against the house and then realized that none of the other stars were moving, but that this one had rapid, tight movements and color changes associated with it. I observed it \"drifting\" in the sky while wildly darting and spinning in a fairly tight circle and there were always color changes going on at the same time. The shakiness and pinpoint intensity of the light reminded me of a hand held laser pointer but all the light appeared to be emanating from the source as opposed to being projected. I finally awakened my wife, handed her the binoculars and asked her to tell me what she saw. Her description corroborated my observations and we are both convinced that we witnessed a phenomenon outside any normal celestial observation that has no logical explanation. This sighting remained in the sky without interruption until I went back to bed"],"Region":"Hawaii","Date of the Event":"02/20/2012 02:50 UTC","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/35955.html.txt","/var/www/straped/mufon/org/35955.html"],"Object Features":"Unknown","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Path with directional change","Summary":"Observed what appearred to be a bright star. Using 10x binoculars was able to observe rapid movement, changing colors, and position changes","Date Submitted":"02/20/2012 08:24 UTC"}