{"files":["/var/www/straped/mufon/html2text/35967.html.txt","/var/www/straped/mufon/org/35967.html"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","Date Submitted":"02/21/2012 10:12 UTC","Disposition":"Unresolved","Date of the Event":"02/10/2012 07:38 UTC","Country":"United States","Log Number":"US-02212012-0008","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around February 10th 2012"],"Object Flight Path":"Hovering then path","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=29.876715,+-95.350586(35967)&iwloc=A&hl=en\"> mufon case (35967) map </A>","Latitude":"29.876715","divs":["Sighting DetailsOn Feburary 10th 2012, I went outside, my garage was open, kids were playing outside, it was about 7:30ish, the sun was down...I stood by the edge of my garage and looked up as I always do. I saw Jupiter a little to my right...(west view) then another star next to that..sort of aligned, then what I thought was another star, which was the UFO, it just didn't seem to belong so I starred at it. The oldest kid outside was 14 yrs. old, as I starred at this so called star, it then started to move, sort of like an orb would kind of erratic, wobbly, as though my vision wasn't clear, but it was. Then I pointed at it to show my cousin (14 yr. old) and her friend who was 13yrs old, I believe. They watched with me as it then started to move northeast. At the same time a plane flew over and it had it's blinking lights so I compared to the other UFO, mind you the UFO was moving steadily but very slow The UFO had no blinking lights it kept it's starlike appearance the whole time. We watched it till it faded away, three last things I noticed, there was no sound, as it turned off the star like light it had a reddish hue not light...so that may have been it's surface color...also we live near Bush Airport, so planes are flying frequently through here, this object seemed to be below the planes level, but it's light was equivalent with Jupiter's brightness at this time. Sort of gave me a feeling of fear, because before I came out, the kids were the only ones out there, and they shouldn't of been out by themselves...it seemed to be just hovering...maybe observing...but it gave me an uneasy feeling."],"City":"Houston","Tags":"City","Case Number":"35967","Source":"MUFON","Sighting Duration":"00:02:00","Summary":"Simulating a star, bright clean white","Weather Factors":"Unknown","Object Features":"None","Longitude":"-95.350586"}