{"Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/35985.html.txt","/var/www/straped/mufon/org/35985.html"],"Object Features":"Unknown","trends":["There has been one other sighting in Drexel Hill","There were no other sightings in Drexel Hill on or around February 22nd 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.949816,+-75.297165(35985)&iwloc=A&hl=en\"> mufon case (35985) map </A>","Date Submitted":"02/22/2012 01:32 UTC","Region":"Pennsylvania","City":"Drexel Hill","Source":"MUFON","Summary":"Large lights rotating in the sky with no noise and no light projecting from the ground .","Tags":"City","Longitude":"-75.297165","divs":["Sighting DetailsI had to take our dog out because he was crying at midnight. I had just finished watching a movie when he started so I took him out. I put on his leash and we were across the street by the cemetery by 12:05 . We went less than 2 blocks and we turned around. On our way back we came about a half a block and while he's doing his business I was looking at the sky which I like to do and I noticed a large light in the sky followed by another then by another like the lights were circling but not moving . There were no lights coming from the ground and there was no noise . At first I thought it might be a helicopter but no noise. And I even waited to see if the noise of a helicopter might come a little later but it didn't . Anyway these lights continued to rotate as I walked closer toward home and then they started to move west ? toward Burmont Rd. I stood outside and watched while these rotating lights moved away. When I came in I told my wife who was up late making a cake for her bosses birthday but when we went out back the lights were no longer visible. And that is my UFO story. Very strange. I never thought I would write such a thing but it was too weird to just blow off."],"Country":"United States","Sighting Duration":"Undisclosed","Latitude":"39.949816","Object Flight Path":"Hovering then path","Case Number":"35985","Disposition":"Unresolved","Log Number":"US-02222012-0002","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date of the Event":"02/22/2012 12:00 UTC"}