{"map":"<A HREF = \"http://maps.google.com/maps?q=14.679571,+121.04696(35989)&iwloc=A&hl=en\"> mufon case (35989) map </A>","Log Number":"PH-02222012-0006","City":"Quezon City","Country":"Philippines","Object Shape":"Disc, Other","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","trends":["There have been 9 other sightings in Quezon City","There were 2 other sightings in Quezon City on or around February 22nd 2012"],"Summary":"I was on the cell phone from the balcony of our house about 8Pm. I saw what looked like a string of 4 to 5 white lights in a straight horizontal line stationary...","Latitude":"14.679571","Case Number":"35989","Region":"Metro Manila","Viewing Distance":"Over One Mile","Longitude":"121.04696","Object Features":"None","files":["/var/www/straped/mufon/html2text/35989.html.txt","/var/www/straped/mufon/org/35989.html"],"Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"02/22/2012 09:14 UTC","Date of the Event":"02/22/2012 08:03 UTC","divs":["Sighting DetailsI have 3 cell phone photos that I will send upon finding the required cable to down load from my cell phone. Amasing photos but blurry as the object is very far away when I took the pictures. The photos are pretty amazing to me as they were not that visable with the naked eye. It looked like a string of 4 to 5 lights on a horizontal plane that tilted back AS IT MOVED WEST as it was over my GATED subdivison CALLED Filinvest 2 about 2 km from the Batasan Congressional Building complex IN NORTHERN QUEZON CITY , METRO MANILA. The oblect of lights was traveling from the east to the west very slowly. It seemed like a sigle white light IN THE PHOTOS at original (NO ZOOM ) setting but when full zoomed in it became a green saucer shaped object with a light bar under it. One CLOSE UP is white in color and the bars below is yellow and green . This EVENT started at APPROXIMATELY 8PM Manila Time on 22 February and passed over the horizon out of sight by 8:25 PM . AS I TYPE THIS REPORT MY HEART HAS FINALLY STOPPED POUNDING AS IT WAS SO WILD TO SEE THIS AS MY 2 HOUSE MAIDS WAS ABLE TO HELP ME CONFIRM WHAT I WAS SEEING WITH MY NOT SO GOOD EYES. I HAVE HAD A OPERATION IN BOSTON EAR AND EYE CLINIC SOME YEARS AGO TO REMOVE A CATARAC AND INSTALL A REPLACEMENT PLASTIC LENS IN MY LEFT EYE. MY RIGHT EYE IS BAD AS IT REQUIRES A PLASTIC CONTACT LENS AT -5 POWER. tHIS LENS IS USUALLY NOT SO CLEAR BY 8pM FROM THE AIR POLUTION WE HAVE TO ENDURE EVERY DAY HERE. I TRIED TO GET A VIDEO CAMERA FROM OUR BEDROOM BUT IT WAS TOO LATE AS THE OBJECTS WERE ALREADY TO FAR AWAY. I HAVE NEVER SEEN ANYTHING LIKE THIS AS THEY 4 TO 5 WHITE LIGHTS WERE IN LINE. IF I HAD TO MAKE A DISTANCE ESTIMATE FROM ME WHEN I FIRST SIGHTED IT I WILL SAY IT WAS MAYBE MORE THAN 5 MILES AWAY AT A ANGLE TO THE SURFACE OF MAYBE 15 DEGREES. AS IT SLOWELY MOVED AWAY IT MAY HAVE BEEN 8 TO 9 MILES AWAY AND DOWN TO AN ANGLE OF LESS THAN 8 DEGREES FROM THE HORIZON. THE ENLARGED PICTURE ARE FROM THIS OBJECT AND I NEVER SAW THE 5 LIGHTS IN A LINE IN THE ZOOM MODE OF THE CELL CAMERA. IM A BELIVER THEY ARE AROUND US AND IM NOW MORE THAN EXCITED TO SHARE WHAT WE SAW AS I HAVE MY TWO HOUSE MAIDS WHO WAS THERE TO SEE IT ALSO."]}