{"Disposition":"Unresolved","Region":"Nova Scotia","trends":["There has been one other sighting in Yarmouth","There were no other sightings in Yarmouth on or around September 7th 1982"],"Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular","Viewing Distance":"101-500 Feet","Country":"Canada","Source":"MUFON","files":["/var/www/straped/mufon/html2text/35994.html.txt","/var/www/straped/mufon/org/35994.html"],"Date of the Event":"09/07/1982 10:00 UTC","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=43.812352,+-66.157537(35994)&iwloc=A&hl=en\"> mufon case (35994) map </A>","City":"Yarmouth","Log Number":"CA-02222012-0011","Case Number":"35994","divs":["Sighting DetailsHi, in September or October 1982, I went outside of my parents house to go see my sister who was babysitting up the road. I was 17 at the time. We lived in a rural area and could see all the stars, so, like always, I looked up and soon realized that a portion of the stars were blocked out. I soon realized that there were \"four stars\",very far apart, rotating in a circle hovering right above me and slightly to my left. There was no sound. I called out to my mother, but she couldn't see it. I felt it was probably as big as a football field, but i'm not sure how close it was to me and the black part was not really something one could see, it was just blocking the stars, so I realized that it was a large rectangular object with a light at each corner, about as bright as the stars. My mother asked me if I was still going up the road, but I wasn't sure, because now I was scared. She went back in the house. I think it could read my mind or intentions, because the split second before I made the decision to go, it moved over the road and waited for me. As I walked and ran up the road, the object moved ahead of me,or to my right, but stayed very close. It was like it was escorting me to where I was going. When I was about one house from my sister, it moved over the house where she was and hovered spinning over the back door. This was the door everyone used, but how would it know that, unless it could read my intentions. I went inside to get her, but when we came out, it was gone. I have never seen it since. I was instantly aware it was a ufo and I really feel, it meant me no harm. To this day, my mother has no recollection of me even asking her out to view this object."],"Weather Factors":"Unknown","Tags":"City","Longitude":"-66.157537","Object Features":"Unknown","Latitude":"43.812352","Date Submitted":"02/22/2012 02:43 UTC","Summary":"Rectangular UFO over my driveway."}