{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.086663,+-98.336688(35999)&iwloc=A&hl=en\"> mufon case (35999) map </A>","Date of the Event":"02/21/2012 06:35 UTC","Country":"United States","Date Submitted":"02/22/2012 07:10 UTC","Disposition":"Unresolved","Latitude":"32.086663","Object Flight Path":"Stationary","Object Shape":"Square, Rectagular","Weather Factors":"Unknown","Longitude":"-98.336688","Log Number":"US-02222012-0016","divs":["Sighting DetailsMy family and I traveled to Dublin TX from Strawn for a girls play-off basketball game and arrived 25 minutes early. It was like 6:35 pm and we had all just gotten out of the car. When we started to head to the gymnasium doors we both heard a jetlike humming noise and I looked up and pointed out to my husband what were four very bright lights and said, \"stars during the day\". He looked up at them and said yeah we looked at one another like NO. Then the top left one disappeared first and the others right behind it along with the noise. We were floored. We've heard what people say they have seen and now we're part of it. When we entered the gym the lady taking our money I was assuming was a local so I told her and she didn't look at us like we were crazy at all. Her exact words were, \"I know people who have seen them too but I have to witness it\". Then my husband told a friend of his walking in and with the response he got we vowed not to say another word about it for that time being. Since we have called KSTV radio station and asked if anyone else out there saw this to to please call in and got no response. So that leaves me here searching on the web and reading a sighting in the same area the same night only and hour later than ours. It is exciting! Thank you for letting us share our story and see what others are seeing out there!"],"Case Number":"35999","Viewing Distance":"Over One Mile","Tags":"City","trends":["There have been 40 other sightings in Dublin","There was one other sighting in Dublin on or around February 21st 2012"],"Summary":"Four bright lights in the shape of a parollelogram were sitting stationary for a few seconds then one disappeared and after the first one disappeared the others vanished immediately after it. What made us look into the sky was a jetlike noise or hum.","Object Features":"Undisclosed","City":"Dublin","Region":"Texas","files":["/var/www/straped/mufon/html2text/35999.html.txt","/var/www/straped/mufon/org/35999.html"],"Source":"MUFON"}