{"Date of the Event":"01/09/2012 09:00 UTC","divs":["Sighting DetailsAt the time of the event i was walking down the street towards a friend's house after a fight with my girlfriend in a coastal suburb 50km north of the Perth City center. I noticed a blue coloured light in the sky which was when I started to record the event as I felt it was an abnormal thing to be happening. At first it appeared to be similar to a star, but I had no idea what it was which is why i used my Iphone 4 to record the event. The light then descended from high in the sky to the left to much lower and started to change colour, the outer rim of the object changed colour first and echoed into the center. I noticed two other people in the same area as me standing outside looking at the same object. The object then darts around and hovers, going through multiple colour changes for about 30 seconds. The object seemed to pause while changing colour or direction. I was in an angry and frustrated state before, during and after the sighting. The sighting did not affect my feelings at the time, it was not until reviewing the footage and recalling the event that I really questioned what happened, questions that multiply with every viewing of the footage, questions that seemingly have no answers. I was walking during the sighting and as the object started to re-ascend back to where it came from outside my field of vision I had turned a corner and arrived at my destination."],"Object Flight Path":"Path with directional change","Date Submitted":"02/22/2012 02:48 UTC","Viewing Distance":"21-100 Feet","Country":"Australia","Sighting Duration":"Undisclosed","City":"Kinross","Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There have been no other sightings in Kinross","This sighting has never been favorited."],"Region":"Western Australia","Case Number":"35995","Source":"MUFON","Latitude":"-31.722516","files":["/var/www/straped/mufon/html2text/35995.html.txt","/var/www/straped/mufon/org/35995.html"],"Object Shape":"Diamond, Flash, Square, Rectagular","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-31.722516,+115.735411(35995)&iwloc=A&hl=en\"> mufon case (35995) map </A>","Log Number":"AU-02222012-0012","Object Features":"Patterned Surface","Summary":"desends in view, changing colours, hovers around and asends and appers to realse a second flying object.","Longitude":"115.735411"}