{"Log Number":"US-02222012-0023","Disposition":"Unresolved","Country":"United States","City":"Sebago","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"02/22/2012 10:36 UTC","Sighting Duration":"00:02:00","Object Shape":"Fireball, Sphere, Star-like","Region":"Maine","divs":["sighting detailsi was fly fishing for summer bass one night at my favorite spot. i fish here often. there is one small, unoccupied cabin on the pond. an undeveloped old logging access road cuts through a very steep mountain side. there is swamp that turns into a valley, more mountains a mile or two in the distance to the west. there is on occasion a house light about a mile or more away on a mountain top that is visible on nights without fog and a radio tower about half that distance with multiple red and hot white lights that blink regularly (to the sw). it was a very clear and quiet night, though it is always quiet. it was between the hours of 10pm-1am. it was so clear that the moon illuminated the earth around me - i didn't need my headlamp. the pond is so remote you can not hear or see any car traffic\\lights from this spot. air traffic is not regular, but not uncommon. i was paddling across the pond to the side away from the road, traveling nw when i saw in my peripheral vision, from the north a light in the sky. i stopped paddling to take a look. the light was bright round-orb like, hot blue and white - star like - about four times as bright as polaris. it almost looked like an electric fire, incredibly hot colored pulsating light-but not in frequency, but in the color. it had no tail, trail indicating its flight path. it appeared from the north, over the trees on the horizon . it seemed high in the sky, similar to that of a high flying military plane. it made a sweeping arc southward. it appeared to be slowing as it moved across the sky. it was almost at the peak of the dome that it came to an abrupt stop. this thing was still moving at considerable speed, then bam! just stopped. i was looking right up at it, head cocked back wondering \"how the hell did that stop - looks like it hit a wall in the sky\". it stayed there for a second, maybe two and vanished. it just wasn't there. this took about a half minute, maybe less. no sound, not a thing else and it was just gone. i was awe struck, sitting in my little canoe looking up at the sky. when i went home, about 45 minutes later the gravity of what i could've seen really hit me. i felt anxious - an i was afraid. i don't know what i saw. i just know i saw something and that is what was most frightening to me: no explanation. i don't drink when i fish and i am very responsible and consider myself a safe and reasonable human being."],"files":["/var/www/straped/mufon/html2text/36006.html.txt","/var/www/straped/mufon/org/36006.html"],"trends":["There have been 2 other sightings in Sebago","There were no other sightings in Sebago on or around June 25th 2011"],"Date of the Event":"06/25/2011 10:00 UTC","Case Number":"36006","Object Flight Path":"Path then hovering","Weather Factors":"Unknown","Summary":"Observation of Unknown Light at Remote Maine Pond","Latitude":"43.89428","map":"<A HREF = \"http://maps.google.com/maps?q=43.89428,+-70.674518(36006)&iwloc=A&hl=en\"> mufon case (36006) map </A>","Longitude":"-70.674518","Object Features":"Unknown"}