{"Date Submitted":"02/23/2012 12:54 UTC","Object Features":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Circle","trends":["There have been 11 other sightings in Bullhead City","There were no other sightings in Bullhead City on or around February 21st 2012"],"Latitude":"35.157157","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.157157,+-114.560878(36009)&iwloc=A&hl=en\"> mufon case (36009) map </A>","Longitude":"-114.560878","Case Number":"36009","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-02232012-0001","Disposition":"Unresolved","divs":["Sighting DetailsMy son I and have taken a trip from Iowa to the Lake Mead recreation area near Bullhead City, Arizona. We are camping at the Katherines Landing location which is north of Davis Dam and about 6 miles north of Bullhead City, AZ. We arrived here on the 27th of January and are still here as of submission of this report. Being amateur star gazers we have taken advantage of the excellant conditions for night sky viewing on several occasions using a telescope. Many times at night while moving about the campsite, my son, myself or both of us will take a few minutes to observe the night sky with the naked eye. On one night in particular, during the early morning hours of Tuesday, February 21 at approximately 12:30 a.m. MST I had just finished some chores before going to bed. Since it was a clear, moonless night I decided to take a few minutes to view the sky before sleeping. While scanning the sky I noticed a light at approximately 10 degrees above the mountain horizon a few degrees east of north. The light was a significant distance from my location, estimating it to be at least 15 to 20 miles away as if you were viewing a distant aircraft beacon. It looked mostly red with a little white-ish component and had a radiant variance. At first I thought it to be nothing more than a common aircraft one would see at night accounting the radiant variance to be the effect of low angle viewing. The light did not strobe on and off as do most aircraft. Appearing to be stationary for the short time, maybe 20 to 30 seconds of viewing, I made the determination it was not a star or planet. Then to my surprise the light moved upward a few degrees then back down to it's original position in maybe 4 to 5 seconds at the most. Thinking this to be odd it now had my full attention since to move that amount from the distance I was viewing meant it had to be traveling at a significant velocity as well stop and start. Continuing to watch, approximately 20 seconds later the light moved again in the same upward direction at the same speed as before but this time it came downward in a slight arcing diaganol ending up just east of its original position by the width of about a fifth of its upward movement at the same position above the horizon. A couple of seconds later it moved to the left(west) traveling at the same rate of speed it went upward going approximately 3 times the distance that it had traveled upward, stopped and came back to its original position at a slightly faster speed. As it remained stationary I ran to my vehicle to grab a set of binoculars for a closer look and to tell my son, who was also in the vehicle using his laptop computer at the time, about what I had observed. Hurrying back with my son the light was still in the same location. I viewed it through the binoculars. The image was larger than with the naked eye but still quite small. The light now looked to be composed of three colors. Blue on top, white-ish in the center and red on the bottom but not well defined as the image was still too small for more detail. I gave my son the binoculars to view it. While he looked for about half a minute the light moved again this time to the right(east). It appeared to move at the same speed and distance as it had done to the west and came back to its original position with the abrupt stops at each end of its travel. This event is now about 10 minutes into it and having witnessed a couple more times of the up-down, side-to-side movements with the exception of one east back to west movement, in which the travel back was a wave-like motion. Deciding to get yet a closer look, I left my son with the binoculars to keep an eye on it and went to my tent to get our telescope. I set up the telescope and sighted in the light while it was stationary. The image was larger than the binocular view and now the colors more defined but no detail of a craft. Could now see definite blue light radiating from the top third, a white-ish yellow light in the middle that radiated less than a third part and the remaining bottom part which was more than a third as a bright red. The telescope image gave better detail of the light. It was very intense with a variable radiance, spherical with no defined outside edge, just fuzzy or almost intensly sun-like radiant. We're now about 20 minutes into this experience when the light starts an upward ascension at a slower rate of speed than what we previosly observed, slow enough that I could make fast enough adjustments to keep it in the eyepiece. The ascension required equatorial adjustments to the east until reaching approximately a 45 degree angle to the horizon in which it disappeared or I lost track of it in the night sky. Total time of sighting lasted approximately 35 to 40 minutes."],"files":["/var/www/straped/mufon/html2text/36009.html.txt","/var/www/straped/mufon/org/36009.html"],"Country":"United States","Date of the Event":"02/21/2012 12:00 UTC","City":"Bullhead City","Region":"Arizona","Summary":"Observed unusual movements and lights from object through naked eye, binocular and telescope viewing.","Object Flight Path":"Other","Tags":"City"}