{"Region":"California","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"07/09/2005 12:00 UTC","City":"Rialto","map":"<A HREF = \"http://maps.google.com/maps?q=34.1064,+-117.370324(3600)&iwloc=A&hl=en\"> mufon case (3600) map </A>","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Source":"MUFON","Object Features":"None","Disposition":"Hoax","Object Shape":"Diamond, Saturn-like","divs":["Sighting DetailsThere were three of us in the car who witnessed the ufo in the sky. I first noticed traffic slowing down on the 210 freeway East around 8:30 PM. Then we saw it in the sky. Not to mention hundreds of other people on the 210 East freeway traveling the same direction as us saw it as well I'm sure it was hard to miss. It looked like three balls of light stacked on top of each other. Like fireballs with rings of fire around them. As we watched the lights shoot up and down in the sky unlike anything I've ever seen. Very fast and precise. Then it moved to the right and stopped, disappeared and then returned to the same place it started at. It blinked on and off a few times and then red led type lights appeared to beam hundreds of feet off the sides of the craft. It then started to turn clockwise blinking the red lights up into the sky and down towards the ground. We pulled over and stopped in the center of the freeway derider lane to watch it. Other cars and trucks did the same. As we exited the car the lights went behind a hill. Came into site again and then shot off to the south east and disappeared. My girlfriend who never believed in Ufo's or Aliens is now 100% a believer. My girlfriends friend was crying from what we were seeing. I am still having a hard time believing what I saw and I have always believed in other life and ufo's. Please contact me for further details and as I'd like to see it anyone else reported what we witnessed. Thank you. Don't think I'm nuts but I also have a photo of another UFO I took over a year ago. Please take a look at the speck of what looks like dirt above my dads head in the picture zoom in on it tell me what you think it is. It was taken with a digital camera in Hollywood Ca, in the afternoon. I have the time and date written down somewhere."],"trends":["There have been 4 other sightings in Rialto","There were no other sightings in Rialto on or around July 9th 2005"],"Latitude":"34.1064","Weather Factors":"None","Summary":"3 Stacked balls of light with rings of fire around them blinking red led type lights of the sides from the middle ball of light. UFO!!!","Case Number":"3600","Sighting Duration":"Undisclosed","Log Number":"US-07172005-0001","files":["/var/www/straped/mufon/html2text/3600.html.txt","/var/www/straped/mufon/org/3600.html"],"Longitude":"-117.370324","Tags":"City","Date Submitted":"07/09/2005 12:00 UTC"}