{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=25.094345,+-80.44543(36002)&iwloc=A&hl=en\"> mufon case (36002) map </A>","Disposition":"Unresolved","Source":"MUFON","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/36002.html.txt","/var/www/straped/mufon/org/36002.html"],"Summary":"Bright light appearing, then slowly disappearing, streak across the sky.","Latitude":"25.094345","Date Submitted":"02/22/2012 09:21 UTC","Log Number":"US-02222012-0019","Country":"United States","Date of the Event":"02/22/2012 05:30 UTC","Viewing Distance":"Unknown","City":"Key Largo","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Key Largo","There were no other sightings in Key Largo on or around February 22nd 2012"],"divs":["Sighting DetailsI was outside on my patio early in the morning before work. I was looking down at my phone, when a bright light caught my eye in the sky. Bright enough to bring my attention away from my bright phone. There were some clouds in the sky, minimal and fast moving, my initial thought was that it was an airplane. I knew there were no stars that large, and no stars that bright in that part of the sky. Since I thought it was an airplane, I was waiting for the small puff of cloud to move out of the way, or expected to see it on the other side of the cloud. This did not happen. Instead, the bright white light faded as if it were moving away. After the cloud moved, there was nothing at all in the sky except for stars. Right after it faded, I heard a dog barking uncontrollably. It was from a dog that I do not usually hear barking. I heard it's owner outside trying to calm it down. I was still looking up at the sky, and I saw a \"shooting star\" beam across the sky coming from the point of where the bright light faded. After this happened, the dog stopped barking. The object was a bright white light that I noticed large, then become smaller as if it was moving away. I felt perplexed by this event, as I am familiar with what airplanes look like around here (usually VERY high up and I can see the standard blinking lights). I am also an avid sky watcher, and have seen many meteors in my life. I can't say this one looked different, but the series of events made me question it. I lost sight of the object because it faded, or... went back to outer space."],"Object Flight Path":"Other","Region":"Florida","Case Number":"36002","Object Features":"Unknown","Longitude":"-80.44543"}