{"Log Number":"US-02222012-0018","Summary":"Early one morning before daybreak, I saw a huge triangle shaped object just overhead.","Source":"MUFON","divs":["Sighting DetailsOne morning, about 3 years ago (I do not remember the exact date, but it was about 2 days after a meteorological phenomenon that causes the moon to appear orange with an aura, and it was cold and still dark when I woke up),I woke up for work around 5 am. I always go outside first thing to have a cigarette and let the dog out. I looked up because I like to see the stars when the city lights aren't so bright, and there isn't much else to do that early in the morning when you are just outside to have a cigarette. I saw a very large object directly over my next-door neighbor's house and partially over my back yard. It appeared to be very low, maybe 100 feet or so, just high enough to clear the oak trees in my yard. At that distance, it appeared to be between 60 and 150 feet across at it's widest point. Our lots are about 60 feet wide and it seemed to cover my next-door neighbor's house, part of my yard, and part of the neighbor on the other side of my next-door neighbor's house. It made no noise. It didn't even bother the dog, she paid no attention to it. It looked like a triangle, based on the three bright white lights that seemed to be on the corners. The lights did not seem to actually illuminate anything. My yard remained dark. I don't know how to describe the surface except to say that it was not a reflection of anything, but at the same time, it didn't appear to be a solid surface. It looked more like a projection of the night-sky above it,including cloud movement, looking up from underneath. It moved very slowly, impossibly slowly. I watched as it moved even more slowly than a person can walk. I almost thought I was seeing things. I went inside to get another cigarette, figuring that if it was gone when I came back out, I had just imagined it, or something. When I came back out only a second or two later (I kept my cigarettes right by the back door)it was still there, still moving at the same pace. So I kept watching it. Honestly, I can't remember seeing it actually go away. I watched it for so long that I think I got tired of watching and went inside to take my shower and get ready for work, though in retrospect, I can't imagine why I didn't keep watching until it was gone, or why I didn't try to take a picture, or even why I didn't wake up my husband. I didn't even tell him when he did wake up because I guess I thought it sounded crazy. But I just kept thinking, \"I saw it. I know I saw it.\" I finally did tell my husband a couple of months later, and my closest friend maybe a year ago. We don't really discuss it. I have never told anyone else, but I can't let go of the experience. That it happened, I have no doubt. What exactly it was, I have no idea. I am only sharing because it continues to creep into my thoughts to this day, and I thought that maybe my experience might have some value as a record of similar experiences or maybe be consistent with other reports in the same area, around the same time."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.94248,+-90.198341(36001)&iwloc=A&hl=en\"> mufon case (36001) map </A>","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","Longitude":"-90.198341","files":["/var/www/straped/mufon/html2text/36001.html.txt","/var/www/straped/mufon/org/36001.html"],"Disposition":"Unresolved","trends":["There have been 2 other sightings in Harahan","There were no other sightings in Harahan on or around January 20th 2009"],"City":"Harahan","Date Submitted":"02/22/2012 09:01 UTC","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Date of the Event":"01/20/2009 05:03 UTC","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface","Region":"Louisiana","Object Shape":"Triangle","Case Number":"36001","Latitude":"29.94248"}