{"Object Flight Path":"Stationary","Date of the Event":"02/23/2012 12:00 UTC","divs":["Sighting DetailsI was on my front porch with the lights on at around 12:50 A.m. I saw a flash in the sky and it registered in my mind that stars do not flash. I watched it for a few moments longer and realized these lights were not moving at all. Therefore, I knew it could not be a plane. I turned off my porch lights to try and get a better look at the lights. At this time I noticed a very faint disk like shape around the light, and a second smaller light that did not flash. The smaller light was only visible for a brief moment and then it disappeared, but the flashing light could still be seen. The flashing light would change from a white, to a dark red, to a red-orange color. The flashes at times seemed occur sequentially, but would occasionally flash randomly. The fact that the lights never moved at all tells me this could not have been a plane because planes are incapable of remaining still. I knew it could not be a star because stars to not flash. I also do not believe it was a helicopter because it would make sense for a helicopter to remain in the exact same place that long. I got frightened after watching for about ten minutes. I have no idea what this object was or what it could have been. I am a strong believer in extra-terrestrial life, and that seems to be the only explanation to what I saw."],"Summary":"Two lights. One flashing. Completely stationary. Faint disk shape around lights.","files":["/var/www/straped/mufon/html2text/36010.html.txt","/var/www/straped/mufon/org/36010.html"],"Object Shape":"Disc, Sphere","Source":"MUFON","Date Submitted":"02/23/2012 01:41 UTC","Viewing Distance":"Unknown","Country":"United States","Log Number":"US-02232012-0002","trends":["There has been one other sighting in Lake Monticello","There were no other sightings in Lake Monticello on or around February 23rd 2012"],"Sighting Duration":"00:10:00","City":"Lake Monticello","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.927922,+-78.328167(36010)&iwloc=A&hl=en\"> mufon case (36010) map </A>","Longitude":"-78.328167","Tags":"City","Region":"Virginia","Latitude":"37.927922","Case Number":"36010","Weather Factors":"Unknown","Disposition":"Unresolved"}