{"Date Submitted":"02/23/2012 09:13 UTC","Country":"United States","Object Shape":"Sphere","Summary":"Took a photo using Nikon D90 of a very low vapor trail about 100 feet above the house.","Disposition":"Unresolved","City":"San Leandro","Latitude":"37.737107","Case Number":"36017","Object Flight Path":"Hovering then path","Sighting Duration":"00:02:22","Longitude":"-122.165643","map":"<A HREF = \"http://maps.google.com/maps?q=37.737107,+-122.165643(36017)&iwloc=A&hl=en\"> mufon case (36017) map </A>","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","trends":["There have been 8 other sightings in San Leandro","There was one other sighting in San Leandro on or around February 19th 2012","This sighting has never been favorited.",""],"Region":"California","Log Number":"US-02232012-0009","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/36017.html.txt","/var/www/straped/mufon/more/36017_submitter_file1__shot1.JPG","/var/www/straped/mufon/more/36017_submitter_file2__shot1zoom.JPG","/var/www/straped/mufon/more/36017_submitter_file3__shot2orbmoved.JPG","/var/www/straped/mufon/org/36017.html"],"Date of the Event":"02/19/2012 01:16 UTC","divs":["Sighting DetailsI was in the living room on the computer and my dog wanted to go to the backyard for a restroom break. When I went outside I looked up and saw a very low white cloudy vapor trail about 100 feet high above the house on a clear night. I didn't hear any jet or airplane sounds. I found it strange that a vapor trail was so low and I always thought this can only happen at very high altitudes. So I went inside and grabbed my camera. I wanted to capture the vapor trail but when I reviewed the picture, there was no vapor trail but instead a blue orb hovering above my house about 500 ft. This orb appeared to be glowing blue inside and blue white outside with rough edges, like a pulsating orb. I took several more pictures and it seem to have moved to left upper quadrant of the photo. I took a couple more shots and the object disappeared."]}