{"Log Number":"US-02232012-0004","Date of the Event":"02/22/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.348789,+-118.323568(36012)&iwloc=A&hl=en\"> mufon case (36012) map </A>","Weather Factors":"Unknown","Case Number":"36012","files":["/var/www/straped/mufon/html2text/36012.html.txt","/var/www/straped/mufon/org/36012.html"],"Longitude":"-118.323568","Country":"United States","Date Submitted":"02/23/2012 03:47 UTC","Object Shape":"Fireball, Flash, Star-like","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path","Disposition":"Unresolved","Tags":"City","Summary":"Very Bright Flaming Object Out Over Pacific Ocean Pulsating Then Disappearing","Source":"MUFON","Region":"California","Latitude":"33.348789","City":"Avalon","Viewing Distance":"Over One Mile","trends":["There have been 3 other sightings in Avalon","There were no other sightings in Avalon on or around February 22nd 2012"],"divs":["Sighting DetailsIt was around 8:00 p.m. at night, I was at home and outside when I noticed a very bright object out in the sky over the Pacific Ocean near Santa Catalina Island. It stood out much brighter than any other star and was varying in its intensity of light like a flame would. At first I thought it might be the International Space Station but I don't think the Sun's light would be reflecting off of it in the manner that it did and it was much too bright to be any star or planet. As I continued to watch it over the next 45 minutes or so, it remained stationary for the entire time, so I knew it could not be a plane or helicopter and it did not have any blinking lights. About 20 minutes after it started, it began to diminish in brightness and disappear completely of which I then noticed some kind of vapor cloud in the moonlit sky where it had been. It then reappeared and grew in brightness until it became very bright again and then eventually disappeared completely. Just as it had disappeared for good, all of I sudden I see several miles across to the left of where it had been, a very large \"arc\" of light appeared like a giant flame had just erupted and then went out completely to be replaced by a blinking object which then started to travel right in the direction of where the first object had appeared. It moved slowly until it went past the first object's position completely and onward and of which this object did appear to be a plane or helicopter. I did witness several helicopters or planes over the Pacific Ocean in the area when this was happening. I don't know if any of them were just passing through or were actually \"following\" this object(s). I have seen these \"flaming stars\" in the past looking westward out over the Pacific Ocean before and cannot explain what they are."]}