{"files":["/var/www/straped/mufon/html2text/36013.html.txt","/var/www/straped/mufon/org/36013.html"],"divs":["Sighting DetailsI have been seeing ufo's in the skies over Edmonton for the last month, just about every morning. On Tues Feb 21,2012 I arrived at work with my new HD Night Vision Camcorder. I noticed lights moving in the sky over Edmonton and shot some videos and still shots. I was on the east end of the city shooting to the west. When I previewed the attached video I thought that nothing was captured. However upon vieing it in a blacked out room on a large screen, I realized that the camera had captured what I saw.Attached is a video and a key sheet showing what is on the video and approximate run times. The ones marked with an \"S\" appear as blue-grey smudges moving around. Don't dispair if you cannot see them as at 45 seconds there is a bright flash. This is eclipsed by a fast moving ufo at 1:00 minute. Definitely visible. It starts traveling north to south at abou 200 mph. It jumps to about 2000 mph and starts to turn to the south east. It then jumps to about 4000 mph and I finally lose it behind a tower structure."],"Object Features":"None","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Date of the Event":"02/21/2012 05:06 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Disposition":"Unresolved","trends":["There have been 70 other sightings in Edmonton","There was one other sighting in Edmonton on or around February 21st 2012","This sighting has never been favorited.",""],"Log Number":"CA-02232012-0005","Viewing Distance":"Over One Mile","Longitude":"-113.376199","map":"<A HREF = \"http://maps.google.com/maps?q=53.499544,+-113.376199(36013)&iwloc=A&hl=en\"> mufon case (36013) map </A>","Date Submitted":"02/23/2012 08:02 UTC","Latitude":"53.499544","Weather Factors":"Unknown","Case Number":"36013","Source":"MUFON","Summary":"Exteme activity over Edmonton","Tags":"City","Region":"Alberta","City":"Edmonton","Country":"Canada"}