{"Object Features":"None","Summary":"Star-like object sighted over Lower Lake Mary.","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-02232012-0003","Object Shape":"Fireball, Star-like","Longitude":"-111.637359","Date Submitted":"02/23/2012 01:55 UTC","files":["/var/www/straped/mufon/html2text/36011.html.txt","/var/www/straped/mufon/org/36011.html"],"Case Number":"36011","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsMy girlfriend and I had driven out to Upper Lake Mary, around 10:15pm. We parked on the side of the road, facing south. Out of the corner of my eye, I saw what first appeared to be a bright star to the west of us. When we first parked, it was blocked by the top of a tree, but it caught my attention when it seemed to get brighter. I focused my attention on the object and it noticeably moved from side to side horizontally. The object's movements would change, first just sitting stationary, then drifting back and forth horizontally, with the occasional bob vertically. It didn't move particularly fast, but the movements seemed erratic. We originally considered that it might be a helicopter or a small plane, since the Flagstaff airport was close by and in the same general direction, but there were no other lights on the object and the movements seemed too odd for a conventional aircraft. The object itself was bright white, and glowing like a star. There were no other colors of light, nor any blinking or pulsing. I suggested it might be some sort of kite with a light on it, since the movements of the object seemed restrained, like a kite would in a strong wind. We also considered a laser or spotlight beam, but there was no tail to the light and the cloud cover was very light. In addition, the light seemed to come from the object, and was not a reflection. Any other ideas I had that it might have been something tethered to the ground disappeared when we pulled back onto Lake Mary Road and started to head back to Flagstaff, around 10:30pm. From where we were parked, the light seemed to be over Lower Lake Mary, so we figured we'd get closer to it as we drove down the lake. However, as we drove further west, the light seemed to first maintain a distance away from us, then seemed to pick up speed and slowly drift away. It got smaller and smaller, and I eventually lost sight of it as we entered more heavily populated residential areas. The combination of the distance, as well as the added lights from the streetlamps made keeping an eye on it nearly impossible. I lost sight of it around 10:40pm."],"Date of the Event":"02/22/2012 10:30 UTC","Tags":"City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.211252,+-111.637359(36011)&iwloc=A&hl=en\"> mufon case (36011) map </A>","Latitude":"35.211252","City":"Flagstaff","Country":"United States","Region":"Arizona","Disposition":"Unresolved","trends":["There have been 24 other sightings in Flagstaff","There were no other sightings in Flagstaff on or around February 22nd 2012"],"Weather Factors":"Unknown"}