{"Longitude":"-121.482536","Summary":"Bright light appears, hovers, moves, then brightens and disapears","Region":"California","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36028.html.txt","/var/www/straped/mufon/org/36028.html"],"Object Shape":"Star-like","City":"Sacramento","Weather Factors":"Unknown","Log Number":"US-02232012-0018","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","trends":["There have been 83 other sightings in Sacramento","There was one other sighting in Sacramento on or around February 23rd 2012"],"Date of the Event":"02/23/2012 01:30 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date Submitted":"02/23/2012 10:37 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.66813,+-121.482536(36028)&iwloc=A&hl=en\"> mufon case (36028) map </A>","divs":["Sighting DetailsI went to smoke a cigarette on my lunch break at work in my car in the parking lot because it was very windy (gusts hit 40 mph according to local NPR station). I turned on the radio to listen to NPR while I smoked and leaned over to roll down the passenger side window (which was not in the direction of the wind). When I rolled it down I noticed a bright star like object that appeared. It materialized out of thin air. It became brighter until it reached its full luminosity. It hovered for about a couple of seconds then began to move. The object was in the direction of the south-west and then moved towards the east or south. It looked far away, and I could not tell if it was moving south or east from that distance. It moved very slowly, like watching a high altitude jumbo jet flying far, far off int he distance. There were no contrails, however. It's speed and velocity could not be verified by me. after traveling in a straight line for about 10 to 15 seconds, it stopped, and then became much brighter, and simply disappeared. I looked in that same direction for a minute or two to see if it would reappear but it did not. The location I witnessed it at is near the Sacramento international Airport where one can see several or more Southwest Airlines Boeing 737-300s taking off and landing. They fly much closer to the ground than this object seem to be, and high altitude jumbo jets that fly over Sacramento I have noticed take the same flight paths, which was not were this object was. Unfortunately, I have no photos or videos."],"Latitude":"38.66813","Case Number":"36028"}