{"Log Number":"US-02242012-0001","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"02/23/2012 09:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.451377,+-112.067627(36029)&iwloc=A&hl=en\"> mufon case (36029) map </A>","Date Submitted":"02/24/2012 01:06 UTC","Object Shape":"Circle, Oval","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around February 23rd 2012"],"Disposition":"Unresolved","Object Flight Path":"Other","Country":"United States","divs":["Sighting DetailsI was out in the side yard going to put the flowers in the garage then I see a orange circle like shape. I went to tell my mom , then when we came out there was a total of three ufos. What made me notice the object was well, I just looked into the sky then i see the ufos. What I thought it was well, ufos. The actions that the ufos were doing well 2 ufos were flying in a triangular shape. then a third one came from no where then they were in a triangle shape. I went to go tell my grandma then I think two dissapeared. then 1 was still there blinking one light witch it only had,no extras. It was blinking on and of continuously .I think that I saw the object without the light. The 3 witnesses were Me, my mom and my grandma. Then all the activity stopped. My mom and i left to go get ice, and we smelt smoke kind of where the object were probably. When we got back alot of helicopters were flying. the reactions of every one was shock . my mom thought it was cool I was scared and i don't know my grandma's reaction. I lost sight of the object it was blinking then just stopped and that's when I lost sight. If I did see the object it looked cigar shaped."],"Summary":"ovlal shaped or circle , orangeish formed a triagle, bcame a different time period about a minute.","Case Number":"36029","Region":"Arizona","Latitude":"33.451377","City":"Phoenix","Viewing Distance":"N/A","files":["/var/www/straped/mufon/html2text/36029.html.txt","/var/www/straped/mufon/org/36029.html"],"Longitude":"-112.067627","Object Features":"None"}