{"trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around February 17th 2012","This sighting has never been favorited.",""],"divs":["Sighting DetailsFirst off this is the third time I witnessed this star like object in the night sky, so Im finally reporting it. Last friday around 7:00pm I took my dog out for a walk. The sky was real clear with little clouds while walking east down the street I just glance up in the sky and to west of me there is this really bright white light. The light was definetly brighter than the stars that where out so I knew it wasnt that or a planet. SO while walking the dog Im watching this object in the sky and it looks motionless but the light would get dim then go bright. Like it was moving up and down. THe object was sitting the western horizon and the stars where stright above me so I know im not seening things. I run home to grab my camera and get in my car to follow this bright light. I drove out of the city to tape this thing. All the camera got was a bright light so so shap can be identified but as got to orefield the light was getting dim again like it was moving west. So I drove 2 more miles to a church parking lot and filmed what I could. I parked in a church parking lot to film this bright light and when I parked there the light now looked like a yellowish-white color, but looked like it moved slowly futher away. So after minutes of taping my battery died and I left I drove towards home and tried to spot the brigh whitelight but it was gone. By this time its around 8:15 on a friday night so I know a planet would not last for a hour in the sky. Now this is the 3rd time I witnessed this and it has to be something.I told my friends and dad and they think i was nuts until I showed the video."],"Tags":"City","Weather Factors":"Unknown","Longitude":"-75.485653","Country":"United States","Source":"MUFON","Date of the Event":"02/17/2012 07:10 UTC","Summary":"Bright Star- Like object in the Sky","Object Flight Path":"Path then hovering","Case Number":"36039","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Log Number":"US-02242012-0011","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.61455,+-75.485653(36039)&iwloc=A&hl=en\"> mufon case (36039) map </A>","City":"Allentown","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Latitude":"40.61455","Date Submitted":"02/24/2012 06:34 UTC","Object Features":"Other","files":["/var/www/straped/mufon/html2text/36039.html.txt","/var/www/straped/mufon/more/36039_submitter_file2__IMG_1109.JPG","/var/www/straped/mufon/org/36039.html"]}