{"Sighting Duration":"00:03:00","Object Shape":"Other","City":"Erie","Longitude":"-80.083819","Object Features":"None","files":["/var/www/straped/mufon/html2text/36032.html.txt","/var/www/straped/mufon/org/36032.html"],"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.132844,+-80.083819(36032)&iwloc=A&hl=en\"> mufon case (36032) map </A>","Summary":"Two Odd-Shaped, Dark Objects hovering in the sky during morning commute. Erie, PA","Region":"Pennsylvania","trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around February 23rd 2012"],"Case Number":"36032","divs":["Sighting DetailsWhile driving to work yesterday (2-23-12) morning I spotted two dark colored objects hovering in the sky. It was about 8am. I was driving Eastward along the Bayfront Connector (the part right down by the bay, Sloppy Duck, Marina, etc.), and as I took a glance up at the houses that sit up on top of the bank that was just cleared I noticed these two things hovering above the houses. The houses are probably a good 300 feet up the embankment and to the right of the road I was travelling on. The objects appeared to be at least another 300 feet above the houses. The objects were shaped like three-finned boat propellers sitting parallel to the ground. It took me about 3 minutes to drive past the objects where they weren't visible anymore due to me being out of range, but they stayed put for at least 3 minutes. At first I thought they were balloons that car dealerships sometimes tie down with long tethers to advertise sales but no tether was visible. They looked to be flying at the same height that you would see one of those advertisement balloons flying. I couldn't believe that no one pulled over to watch these things, but then again neither did I. Almost afraid of the stigma, you know?"],"Log Number":"US-02242012-0004","Date Submitted":"02/24/2012 10:00 UTC","Source":"MUFON","Date of the Event":"02/23/2012 08:00 UTC","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary","Disposition":"Unresolved","Latitude":"42.132844"}