{"Tags":"City","Case Number":"36030","Summary":"First looked like airplane on fire. Then saw 2 lights together. One light moving fast back and forth diagonally.","divs":["Sighting DetailsI was driving on the freeway southbound on the 101 heading towards Hollywood. There was a lot of traffic on the road and in the sky it looked like an airplane was on fire. There was a red blinking light with a flame coming out of the back that resembled a shooting star, except it lingered for at least a minute or so. Then I noticed that the flaming part separated from the red blinking part and \"fell\" down and just seemingly disappeared. The red light started moving towards the right and then seeming disappeared. On the right, I noticed 2 bright white lights diagonal from each other. The one on the top right remained stationary while the one on the bottom left was moving back and forth (diagonally from top left to bottom right) really fast. The feelings I had as I was watching this were \"What the heck is going on?\" and I was wondering if anyone else in the other cars was seeing what I was seeing. I lost sight of the objects as I exited off the freeway."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36030.html.txt","/var/www/straped/mufon/org/36030.html"],"Log Number":"US-02242012-0002","Object Flight Path":"Straight-line path,Path with directional change,Other","Longitude":"-118.323971","Country":"United States","Object Shape":"Circle, Fireball","Object Features":"Unknown","Latitude":"34.096839","Date of the Event":"02/13/2012 06:50 UTC","Sighting Duration":"Undisclosed","Region":"California","Date Submitted":"02/24/2012 06:50 UTC","City":"Los Angeles","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around February 13th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.096839,+-118.323971(36030)&iwloc=A&hl=en\"> mufon case (36030) map </A>","Viewing Distance":"Unknown","Disposition":"Unresolved","Source":"MUFON"}