{"Summary":"Saw large ball of red flame descending steadily down, not quickly, just straight down from high in the sky, descending and appearing to \"land\". Did not see landing site. Observed while driving down my street into my drive in the northwestern sky.","Object Shape":"Fireball, Sphere","Weather Factors":"Unknown","Latitude":"40.16411","Case Number":"36041","trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around February 24th 2012"],"divs":["Sighting DetailsI was driving down my street and approaching my driveway, when I noticed a large \"basketball\" sized red glowing sphere, descending straight down in the sky northwest of my location. It did not fall quickly but made a steady straight descent down. It was not like an airplane or a helicopter. I did not hear any sound at all and it appeared to be within a mile from my home. It took only about 30 seconds, and by the time it would have been too low to notice I got out of my car in my driveway, expecting to hear an explosion, but there was no sound. There was no flash to indicate a landing site. I quickly shouted to my family in the house but by the time they responded there was nothing left to see. One suggested was it maybe a flare someone shot up in the sky, that may have had a parachute. I guess that is certainly possible but the red glowing sphere to me appeared 20 times the size you would expect a flare to be, and there was no tail. Unfortunately, there wasn't even time to grab my phone to video tape it as it was visible less than 30 seconds and my phone was zipped up in my purse. It was a dark rainy night but the roads were rather busy and I am sure a lot more people noticed it than myself."],"Object Flight Path":"Straight-line path","Region":"Pennsylvania","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/36041.html.txt","/var/www/straped/mufon/org/36041.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.16411,+-74.822815(36041)&iwloc=A&hl=en\"> mufon case (36041) map </A>","Date of the Event":"02/24/2012 06:45 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02242012-0013","Disposition":"Unresolved","Country":"United States","Date Submitted":"02/24/2012 07:32 UTC","City":"Levittown","Tags":"City","Sighting Duration":"00:00:30","Longitude":"-74.822815","Source":"MUFON"}