{"Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"36049","Summary":"black gray like sphere","Date of the Event":"02/24/2012 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=24.719562,+-81.087391(36049)&iwloc=A&hl=en\"> mufon case (36049) map </A>","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-81.087391","files":["/var/www/straped/mufon/html2text/36049.html.txt","/var/www/straped/mufon/more/36049_submitter_file2__keylargo2120.JPG","/var/www/straped/mufon/org/36049.html"],"Object Shape":"Sphere","Tags":"City","City":"Marathon","trends":["There have been 13 other sightings in Marathon","There were 2 other sightings in Marathon on or around February 24th 2012","This sighting has never been favorited.",""],"Object Flight Path":"Stationary","Latitude":"24.719562","Log Number":"US-02242012-0021","Object Features":"Unknown","Date Submitted":"02/24/2012 11:09 UTC","Source":"MUFON","Region":"Florida","divs":["Sighting Detailswe were at the 7mile bridge just before the sun set in the florida keys. We saw a jet fly over and we took a photo. As the sun neared being set i noticed a blak grayish spehere hovering to the right of the 7 mile bridge. i pointed it out to my husband. we waited and watched for 15 min or so to see if it was a blimp or helicopter but it never moved! after the sun had set ad there was still some light in the sky we walked back to the car, my husband decided to run behind a tree to relieve himself. when he returned he said the object was still in the sky. this was maybe 8 minutes or so after watching it for 15 minutes earlier. darkness fell as we began to drive and whe we looked for the object we could no longer see it. the bridge was full of people but no one seemed to notice. I stopped a jogger passig by and asked him what he thought it was...he shrugged his shoulders and said he didnt know either. well I did get a few seconds on video ad i will upload it along with the photo of the plane."]}