{"Date of the Event":"02/22/2012 08:30 UTC","Longitude":"-88.193945","Object Flight Path":"Stationary,Hovering then path","City":"Charleston","Source":"MUFON","Object Features":"None","Viewing Distance":"21-100 Feet","trends":["There has been one other sighting in Charleston","There were no other sightings in Charleston on or around February 22nd 2012"],"divs":["sighting detailsmy girlfriend and i were traveling in our car after an evening out to dinner when we noticed unusual lights emitting from an aircraft.we were in close proximity to a rural airport, so air traffic is not unusual and at first glance we thought it was a helicopter because of the manner in which it was descending. this particular craft was descending vertically without horizontal movement. the ufo descended over a rural patch of homes and hovered approximately 50-100ft over them. after realizing the aircraft was not going near the airport only sitting stationary over people's homes, we decided to turn the car around. upon reaching the site the craft had been hovering we noticed it had ascended significantly to the point of appearing star-like. we drove around the site of homes to look for any sign of evidence or anything that could explain what could have been seen, but nothing was found. while my girlfriend watched the sky we continued to our home approximately 2 miles from the site. once home we got out of the car and observed the star-like craft that glowed much brighter than all other stars and was much larger. while watching the ufo began to glow and had an orange\\yellow aura around it for about 30 seconds after which it disappeared. my girlfriend had the best look at this aircraft because she was the passenger. she explains it as disc-like, larger than a helicopter with a white light and red lights on the sides. the surface of the craft was dark and it was quite cloudy that night because of storms, thus making it impossible to get a good look. after the sighting we were scared and curious. neither of us had seen anything like what we saw that evening. we decided to report the event to see if anyone else had a similar experience."],"Weather Factors":"Unknown","Sighting Duration":"00:10:00","Disposition":"Unresolved","Tags":"City","Summary":"From car noticed UFO hovering near local airport. Hovered over residential homes. Aircraft never accelerated horizontally, only moved vertically. Increased air traffic noted near craft.","Log Number":"US-02242012-0016","Date Submitted":"02/24/2012 09:25 UTC","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=39.487976,+-88.193945(36044)&iwloc=A&hl=en\"> mufon case (36044) map </A>","files":["/var/www/straped/mufon/html2text/36044.html.txt","/var/www/straped/mufon/org/36044.html"],"Region":"Illinois","Country":"United States","Case Number":"36044","Latitude":"39.487976"}