{"Sighting Duration":"Undisclosed","Case Number":"36046","Object Shape":"Circle, Other","divs":["Sighting DetailsI was lying in bed and I had just shut my TV off. This was the first time in 20 years I had turned off my TV to go to bed because I'm severely afraid of the dark. I had not slept the night before and for some reason I felt comfortable enough to sleep with just the light of the night. I spent approximately 20 minutes performing my yoga breathing exercises. When I was done I opened my eyes and I was facing my open window. In clear view was a star, aspirin sized and completely stationary. To the slight right of this star was what I first thought to be an airplane due to its slow and steady speed and its straight trajectory. Almost immediately after I noticed this object it accelerated to a speed I cant explain or understand. At the same time as its mind-numbing acceleration I heard a sound that I also struggle to explain. I have been witness to a shuttle launching and although this sound wasnt as loud, its the nearest comparison I can make with the exception of what I imagine a sonic boom to be. I was suprised that the windows didnt shake. I literally JUMPED out of my bed as it disappeared and made that sound, I ran to the farthest range of vision that my window accords. It was completely gone. I was and am very frightened although I never felt any realistic threat. I was so shaken up after this that I ran around my house hysterically and couldnt wake either of parents who are very light sleepers. I consider myself to be an open-minded person but also a healthy skeptic. This experience truly defies my understanding."],"Viewing Distance":"Unknown","Disposition":"Unresolved","Longitude":"-106.68526","Date Submitted":"02/24/2012 10:57 UTC","Region":"New Mexico","Summary":"I witnessed what I first believed to be an airplane due to its steady slow straight course. It immediately accelerated to a speed unknown to me in concordance with a boom. It was gone completely after that.","Object Flight Path":"Hovering then path,Straight-line path,Other","Log Number":"US-02242012-0018","Country":"United States","Latitude":"35.252199","Object Features":"None","trends":["There have been 8 other sightings in Rio Rancho","There were no other sightings in Rio Rancho on or around February 24th 2012"],"Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36046.html.txt","/var/www/straped/mufon/org/36046.html"],"Tags":"City","Date of the Event":"02/24/2012 01:25 UTC","City":"Rio Rancho","map":"<A HREF = \"http://maps.google.com/maps?q=35.252199,+-106.68526(36046)&iwloc=A&hl=en\"> mufon case (36046) map </A>"}