{"Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Unknown","Case Number":"36055","Weather Factors":"Unknown","Object Shape":"Sphere","Date Submitted":"02/25/2012 04:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-33.867451,+151.20989(36055)&iwloc=A&hl=en\"> mufon case (36055) map </A>","Region":"New South Wales","Country":"Australia","files":["/var/www/straped/mufon/html2text/36055.html.txt","/var/www/straped/mufon/org/36055.html"],"City":"Sydney","Disposition":"Unresolved","Longitude":"151.20989","Date of the Event":"02/22/2012 05:45 UTC","trends":["There have been 17 other sightings in Sydney","There were no other sightings in Sydney on or around February 22nd 2012"],"divs":["Sighting DetailsMy wife son and I were taking a walk when I felt a strong compulsion to look directly overhead. I saw the first object which I first thought was a helium filled party balloon, but it strongly glowed and at the same time appeared solid. It moved slower than the prevailing wind and when it passed through a cloud I realized that it couldn't have been a baloon and still be seen. the cloud was neither all that thick, nor that large but as it entered the cloud it disappeared. Before it disappeared its glow could be seen through the cloud and then the glos seemed to quickly diminish to nothing and disappear entirely. within minutes we saw another very bright orb, gestimated to be at least as high and very bright bluish white alternating to light yellowish white. The sun was still well in the sky (about 45degrees or more) and these orbs were still bright to the eyes. As with the first sighting, I had a compulsion to look up and again my eyes went straight to the orb without searching for it, as if in both cases I knew EXACTLY where it was. This time my wife also immediately located it without searching for it as she did with the first one. we both watched as it hung in the sky. We first talked about the possibility of it being a star but quickly dismissed the thought owing to the position of the sun at the time. We were further convinced it was out of the ordinary when right before our eyes it sort of 'blinked out'. we searched the sky for where it might have gone, but it was not to be seen. We knew they must be high as not long after they disappeared a commercial jet flew overhead yet seemed close than the objects we saw. After the orbs disappeared I suddenly felt very drained and sleepy for an hour or so. This is to me noteworthy as I was not remotely tired before the event, not after the hour or so duration after the event, but when the event occurred my mind seemed to be hypersensitized."],"Tags":"City","Summary":"One yellow - orange and one blue/white to yellow/white orb over Sydney","Object Flight Path":"Stationary,Straight-line path","Latitude":"-33.867451","Sighting Duration":"Undisclosed","Log Number":"AU-02252012-0005"}