{"Viewing Distance":"21-100 Feet","Date of the Event":"02/08/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/36056.html.txt","/var/www/straped/mufon/org/36056.html"],"Region":"Oregon","Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around February 8th 2012"],"divs":["Sighting DetailsMy wife and I were driving south to Salem Oregon and we were about 15 miles out from Salem when we observed the object on the opposite side of freeway Interstate 5. It was moving northward approx 50-60 mph ( traffic was about 70 mph so object appeared to be slightly slower ). It changed direction sudden left towards the south bound lanes and came right over our car, approx 20-50 feet up at the most. I was passenger, wife driving, I turned in my seat to watch it fly right over the semi-truck behind us. Totally clear and unobstructed view of tear-drop, in other words, smaller in back than in front. Wife thought the front was shaped like a mushroom...maybe, because it was larger than back end. No lights, no markings but there was some sort of darker rail-shaped apparatus hanging underneath it. For that reason I told my wife I believed it to be some sort of traffic control drone aircraft taking photos. It changed directions once behind us, veering to right, then to left and again each way. Whatever it was it was really flying, not drifting. Actually I'd have to say it was one of the sleekest beautiful aircraft I have ever seen. In the very beginning of his incident I do remember thinking it looked like a small blimp-balloon used by car dealerships and tethered to a small line on the ground and may have been momentarily stationary at that time, I just couldn't tell because it all happened in the course of 2-3 minutes and it moved along, crossing over us quickly as I mentioned above. I would really like someone to tell us what we saw if it is a known aircraft please."],"Log Number":"US-02252012-0006","map":"<A HREF = \"http://maps.google.com/maps?q=44.947698,+-123.027166(36056)&iwloc=A&hl=en\"> mufon case (36056) map </A>","Sighting Duration":"Undisclosed","Longitude":"-123.027166","Summary":"Dark dull larger in front than in back, thus teardrop but horizontally so","Latitude":"44.947698","Tags":"City","Object Shape":"Teardrop","Object Flight Path":"Path with directional change","Case Number":"36056","Country":"United States","Date Submitted":"02/25/2012 04:50 UTC","Disposition":"Unresolved","City":"Salem"}