{"Sighting Duration":"00:02:00","Region":"New Hampshire","Source":"MUFON","files":["/var/www/straped/mufon/html2text/36059.html.txt","/var/www/straped/mufon/org/36059.html"],"divs":["Sighting DetailsOut in my dooryard about 8pm looking straight up at the little dipper. Noted a white starlike blip moving almost due west near the little dipper's handle, thought it was a satelite at first. Have seen many satelites, this moved much faster. Live in a Military Operations Area, have seen what I thought were F15s or F16s mock dogfighting at night, the blip seemed to move faster than they did. The object moved in a straight line, and I was about to walk down my driveway, when this object let off an extremely large white flash. In relative size, say the object was the size of a poppie seed, the white flash was the size of a pea. This flash lasted about 2 seconds, then the object returned to its original size and I lost it after a couple of more seconds. The reason why I'm reporting this is that I can't understand how such a small starlike object could emit such a huge circle of light. The diameter of the flash must have been hundreds of times that of the object, just doesn't make sense. Have seen a couple of things in the skies in past as this area doesn't have alot of washout from street lights,etc. Since I saw the first UFO, I always look at the stars. My reaction right after the sighting was pretty much \"here we go again, another mystery.\" I am a person who hates unsolved mysteries. May sound silly, but when I went to sleep I had this like 10 act, extremely detailed dream. It involved being in a spacecraft with asian people, and we were visiting these Fritz Lang like cities revolving around these strange planets. We were in dire straits and I don't remember how the dream turned out. I would say the dream was part nightmare. I don't watch TV, read alot of non fiction, and haven't seen a Fritz Lang movies in 30 years. The dream has left me a little rattled. My girlfriend says maybe I shouldn't be looking up in the night sky too much anymore."],"Disposition":"Unresolved","Date of the Event":"02/22/2012 08:00 UTC","Viewing Distance":"Unknown","Summary":"Starlike blip moving pretty fast, let off extremely large flash, resumed course.","trends":["There has been one other sighting in Haverhill","There was one other sighting in Haverhill on or around February 22nd 2012"],"City":"Haverhill","Object Features":"Unknown","Object Shape":"Blimp","Date Submitted":"02/25/2012 09:48 UTC","Longitude":"-71.941815","Latitude":"44.11916","Case Number":"36059","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.11916,+-71.941815(36059)&iwloc=A&hl=en\"> mufon case (36059) map </A>","Weather Factors":"Unknown","Log Number":"US-02252012-0009","Object Flight Path":"Unknown","Country":"United States"}