{"Country":"United States","Log Number":"US-02252012-0017","Date Submitted":"02/25/2012 07:08 UTC","Object Features":"Undisclosed","Tags":"City","Latitude":"41.080553","Object Flight Path":"Undisclosed","Disposition":"Unresolved","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around February 17th 2012"],"Region":"Indiana","Case Number":"36068","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.080553,+-85.131191(36068)&iwloc=A&hl=en\"> mufon case (36068) map </A>","Date of the Event":"02/17/2012 12:00 UTC","Viewing Distance":"Unknown","City":"Fort Wayne","files":["/var/www/straped/mufon/html2text/36068.html.txt","/var/www/straped/mufon/org/36068.html"],"divs":["Sighting DetailsI can safely say that right now, Fort Wayne, IN is the leading UFO \"hotspot\" in the world. I have seen what most would call \"UFOs\" on a regular basis since 2004. There appears to be at least 3 different shapes or \"kinds\" of UFOs in the sky at any given time. Some appear to be solid objects moving silently and swiftly, while others only appear to be made of pure energy, like balls of light, that can pop up like a shooting star. Family and friends of mine have also witnessed this as well. The fact that this has taken place for such a long period of time is the reason I am contacting MUFON. Im 27, male, and currently back in school working on my General Eduacation degree. I have seen UFOs on a regular basis since I was 19, but have kept quiet about my situation since the first year of my repeated sightings. I dont want to be known as the weird UFO guy. I do feel that I am witnessing one of the most important and groundbreaking events in human history though, and Im finally deciding to do something about it. I feel I need to share this information about my experiences with the right people who will respect its importance, and can hopefully get a better understanding of UFOs and extra-terrestrials in general. Nothing I have seen on TV or read in books can compare to my experiences these past 8 years, and Im pretty sure Im doing the right thing by contacting MUFON. My situation is extremely real, and extremely serious. A revolutionary event is currently happening, and I feel I need to do my part. If you I could get in contact with someone at MUFON about my situation I would greatly appreaciate it. Thanks for providing this open service. I feel that if I dont share this information to people who take UFOs and extra-terresrtials seriously I would regret it. Please contact me!"],"Sighting Duration":"Undisclosed","Summary":"UFOs in Fort Wayne, IN","Object Shape":"Unknown","Longitude":"-85.131191","Weather Factors":"Unknown"}