{"Summary":"Object was very bright (orange) and hard to look at directly, faded into appearance, hovered, traveled left, and stopped then disappeared","City":"Sooke","Tags":"City","Longitude":"-123.733363","Sighting Duration":"Undisclosed","Log Number":"CA-02252012-0013","Latitude":"48.381225","Date Submitted":"02/25/2012 02:51 UTC","Date of the Event":"02/18/2012 06:40 UTC","Country":"Canada","Object Flight Path":"Hovering then path,Path then hovering","Object Shape":"Fireball, Sphere","Weather Factors":"Unknown","Case Number":"36064","divs":["sighting detailsme and a friend were walking up the road to his house around 6:40pm (it was dark outside) and came to rest at the top of the road for a bit. we sat there on top of some mail boxes, then my friend looked up and said \"dude, what the heck is that?!\". i saw it appear at the same time out of the corner of my eye, i saw a flame ball looking thing it appeared (kind of lit up) stationary or hovering in the valley between us and the mountain across the way, going slower than a plane, but traveling at a constant speed. it appeared much, much lower than a plane or helicopter should be traveling (and we don't have a flight path anywhere near us), traveled north east, and then dissapeard in mid air. it was orange, couldn't see any shape, because it was glowing, and hard to look at or focus on. it was weird, we couldn't see what landmark it was over, but it was between us and another mountain. we followed for about 1 minute to 2 minutes as it went behind a house and then continued to travel towards the langford\\victoria area, and disappeared. both mine and my friends cell phones were not unlocking, they were frozen, and unfortunately i was unable to capture any video or pictures. we were extremely frightened and shaky for the rest of the night."],"Source":"MUFON","Disposition":"Unresolved","trends":["There has been one other sighting in Sooke","There was one other sighting in Sooke on or around February 18th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.381225,+-123.733363(36064)&iwloc=A&hl=en\"> mufon case (36064) map </A>","Region":"British Columbia","files":["/var/www/straped/mufon/html2text/36064.html.txt","/var/www/straped/mufon/org/36064.html"],"Object Features":"None","Viewing Distance":"N/A"}