{"Longitude":"-85.599304","Latitude":"40.553916","Object Shape":"Unknown","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","City":"Undisclosed","Tags":"City","divs":["Sighting DetailsI really don't know who to tell this to. I'm not exactly sure if it even qualifies as a UFO event... but I thought that this might be the best place. First of all, I have no history of blackouts, head injury, or any medical condition that would cause loss of memory. I awoke roughly around 1:49pm after nothing more than a night at home working on a scale model... I got out of bed, and shuffled into the living room, turning on the Television and PC as is my normal routine on my days off. I saw down sitting straight up on the couch around 1:54pm, a few seconds later it appeared at glance than the program skipped a scene or two. I found that sort of odd, but I wasn't really paying attention because I was thinking of things I needed to buy for my modeling. But I then looked down at the clock on the cable box to find that it was now after 2pm! I thought that the cable company made some kind of error, until I checked my phone, alarm clock, and PC... all saying the same time. almost 2:05pm. I had almost 10 minutes of missing time! I'm not sure what to do with this... I don't remember anything unusual, besides the scene skip that I wasn't paying a great deal of attention too... Once I started thinking about it more, I started remembering abduction stories I have heard, and reports of missing time. Where the victims claim to remember nothing out of the ordinary, infact, don't seem to realize anything even happened, but somehow missing minutes, and even hours... Can anyone bring any light to this? I have no idea what to make of it."],"Source":"MUFON","Viewing Distance":"Unknown","trends":[],"Date of the Event":"02/24/2012 01:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.553916,+-85.599304(36067)&iwloc=A&hl=en\"> mufon case (36067) map </A>","Region":"Indiana","Date Submitted":"02/25/2012 06:31 UTC","files":["/var/www/straped/mufon/html2text/36067.html.txt","/var/www/straped/mufon/org/36067.html"],"Country":"United States","Case Number":"36067","Log Number":"US-02252012-0016","Sighting Duration":"00:09:00","Object Features":"Undisclosed","Summary":"Missing time - Possible abduction","Disposition":"Unresolved"}