{"Object Flight Path":"Straight-line path","Sighting Duration":"00:00:45","Tags":"City","trends":["There have been 3 other sightings in Springfield","There were no other sightings in Springfield on or around February 26th 2012"],"Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsI had been up all night watching tv and studying for an upcomming job. It was about 5:25 in the morning and I decided to go outside and have my last cigarette and then go to bed. AS usual im lookin at the sky and right over my house I see this , Basically a moving star. But when I say over my house I don't mean literally. I mean this thing was so high up it had to have been upper atmosphere or space I don't know. Any way It was moving very fast and didn't have any blinking lights. It just looked like a star moving at A VERY high rate of speed. It went in a total straight path and I watched it literally until I couldn't see it anymore. It didn't dissapear, it just flew so far away that I couldn't see it anymore. Im not saying this was an ET craft, but it was definitely an unidentified flying object. The thing that stands out is the speed. AS its passing im expecting to hear some type of sonic or sound barrier related noise. But nothing. No noise. Just very, very,very, fast. straight path.... thats all."],"City":"Springfield","files":["/var/www/straped/mufon/html2text/36077.html.txt","/var/www/straped/mufon/org/36077.html"],"Longitude":"-77.212832","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"02/26/2012 07:13 UTC","Date of the Event":"02/26/2012 05:30 UTC","Object Features":"Unknown","Latitude":"38.747298","Summary":"Airplane like path but Definitely not an airplane known to me or the public","Log Number":"US-02262012-0005","Disposition":"Unresolved","Case Number":"36077","Object Shape":"Star-like","Region":"Virginia","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.747298,+-77.212832(36077)&iwloc=A&hl=en\"> mufon case (36077) map </A>"}