{"Date Submitted":"02/25/2012 09:09 UTC","Tags":"City","Country":"United States","Object Shape":"Circle, Disc, Flash, Oval, Sphere, Star-like, Triangle, Unknown","Region":"California","Case Number":"36071","map":"<A HREF = \"http://maps.google.com/maps?q=37.953879,+-122.053696(36071)&iwloc=A&hl=en\"> mufon case (36071) map </A>","files":["/var/www/straped/mufon/html2text/36071.html.txt","/var/www/straped/mufon/org/36071.html"],"Viewing Distance":"101-500 Feet","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsA large, silent...(triangular formation of floating, gliding lights with no apparent mass, characterized by a circle of blinking red and white lights around the triangle?) passed above Pleasant Hill, California. Whatever was moving the lights made no sound. WHATSOEVER. What followed in the hour to come was a series of similar lights moving from roughly West to (Northish) East. Flying over where I would estimate the cemetery on Reliz Valley Road to be, and moving towards Gregory, over Pleasant Hill park, and onward towards Concord. Other arrangements of lights making absolutely no sound whatsoever and pulsating a rhythmic series of red and white flashes, along with some stationary blues and whites and golds. I lost count, but I can confidently say upwards of 12 light groups passed by. They all had slightly different shapes, but they made the same slow, steady trajectory, distinctly lower than an airplane's altitude. There was ABSOLUTELY no other air traffic. No atmospheric rumblings of planes. No buzzes of helicopters. Only a series of light groups, following behind each other in staggered gaps of time ranging from 2 minutes to 12 minutes. They moved slow and steadily, like a stone dropping through water; except horizontally through the air. Many of them nearly went directly over my roof. I ran into my house after standing on my lawn for over an hour watching this take place. Activity stopped probably around midnight (or perhaps one straggler after that time). On a personal note, I felt a non-threatening, if not peaceful, \"vibe\". Although there were moments of pure adrenaline and uncertainty."],"Disposition":"Unresolved","Latitude":"37.953879","Date of the Event":"02/23/2012 12:00 UTC","City":"Pleasant Hill","Log Number":"US-02252012-0020","Longitude":"-122.053696","trends":["There have been 2 other sightings in Pleasant Hill","There were no other sightings in Pleasant Hill on or around February 23rd 2012"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Summary":"A slow-moving procession of 12 light groups in the sky making no noise.","Object Features":"None, Dome, Unknown"}