{"Object Shape":"Fireball, Star-like","City":"Pomona","Summary":"Observed bright yellow/orange starlike object traveling from west to east.Moved very slow as high as a passenger jet. Light got real bright, then seemed to fizzle away.","files":["/var/www/straped/mufon/html2text/36078.html.txt","/var/www/straped/mufon/org/36078.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Latitude":"34.044773","Log Number":"US-02262012-0006","map":"<A HREF = \"http://maps.google.com/maps?q=34.044773,+-117.767169(36078)&iwloc=A&hl=en\"> mufon case (36078) map </A>","trends":["There have been 16 other sightings in Pomona","There were no other sightings in Pomona on or around February 23rd 2012"],"divs":["sighting detailsat 7:45pm, i took the dog outside to take care of business before settling down to watch tv at 8:00. it was a very clear night and the sky was full of stars. i observed a bright yellow\\orange \"star\" in the western sky. it caught my attention because of the color. as we walked along, i noticed that the object was actually moving from west to east. by 7:50, it was now directly overhead. it made no noise but it seemed to pulsate and it would get brighter then dim. it reminded me of a satellite but it traveled too slow to be a satellite. i noticed that the dog was now aware of the object and he started to bark at it. some neighbors were walking by i pointed it out to them. they too were puzzled by its color and we all observed its pulsating feature. we concluded that it was not an aircraft since it had no white\\red\\or green lights on it like typical aircraft. i went inside an got my spotting scope to get a better view of the object. through the scope it looked like a slow moving fireball. it got really bright then it dimmed and disappeared. it came back for a few seconds then it was gone."],"Country":"United States","Date Submitted":"02/26/2012 11:43 UTC","Case Number":"36078","Region":"California","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Features":"None","Disposition":"Unresolved","Date of the Event":"02/23/2012 07:45 UTC","Longitude":"-117.767169","Tags":"City","Weather Factors":"Unknown"}