{"Weather Factors":"Unknown","Object Shape":"Cylinder","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36084.html.txt","/var/www/straped/mufon/org/36084.html"],"Log Number":"US-02262012-0012","Region":"Pennsylvania","Date Submitted":"02/26/2012 04:57 UTC","Country":"United States","divs":["Sighting Details1) WE WERE COMMING HOME FROM CHURCH 2) IMPOSSIBLE NOT TO SEE 3) WASN'T SURE IT WAS LARGER THAN ANYTHING I EVER SEEN 4) IT WAS A CYLINDER IN THE MIDDLE WITH TWO SPHERES AT EACH END WITH WINDOWS THE LENGTH OF THE CYLINDER AND AROUND THE END OF THE SPHERES. IT LOOKED LIKE THE COLOR OF THE OLD GLOW IN THE DARK FRISBEES. WHEN WE STOPPED THE OBJECT GOT DIM AND ALMOST TRANSPARENT THEN QUICKLY MOVE AWAY FROM US. WE WERE ABOUT 500 FT FROM IT AND THE BUILDING IT WAS HOVERING OVER WAS AN OLD FOLKS HOME AND IT WAS HALF AGAIN BIGGER THAN THE BUILDING WHICH IS ABOUT 250 FT. LONG. 5)I WAS COMPLETELY CONFUSED WHILE LOOKING AT TE OBJECT JUST TRYING TO FIGURE IT OUT. MY MOTHER WAS WITH ME IN THE CAR AND WAS EXTREMELY UPSET AND JUST WANTED ME NOT TO STOP BUT LEAVE ASAP. IT IS JUST A FEELING OF SEEING SOMETHING THAT LARGE AND THAT CLOSE TO US AND NOT BEING ABLE TO RECOGNISE WHAT IS IT. I HAVE NEVER SEEN ANYTHING BEFORE AND SINCE THAT DAY. mY MOTHER IS 84 YRS. OLD AND HASN'T BEEN VERY TALKATIVE ABOUT UNTIL RECIENTLY AND I THINK IT MAYBE BECAUSE OF HER RELIGIOUS BELIEFS. WE GOT HOME ABOUT A MILE FROM THE SIGHTING AND THE RADIO SCANNER WAS GOING CRAZY WITH REPORTS OF A UFO IN THE AREA. IT WAS JUST SOMETHING WE DIDN'T TALK ABOUT AFTER THAT BUT THE QUESTIONS ARE STILL WITH ME AND IT'S JUST SOMETHING I CAN'T FORGET. I WAS 16 AT THE TIME AND SINCE MY MTHER PRETTY MUCH WANTED TO FORGET ABOUT IT I REALLY NEVER BROUGHT IT UP. 6) THE OBJECT JUST QUICKLY MOVED AWAY AND WAS LOST BEHIND THE HILLS."],"City":"Franklin","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Object Features":"Window(s)","Disposition":"Unresolved","Longitude":"-79.915058","Summary":"LOOKED LIKE A DUMB BELL SHAPE LARGE","Case Number":"36084","Latitude":"41.434949","Date of the Event":"11/05/1975 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.434949,+-79.915058(36084)&iwloc=A&hl=en\"> mufon case (36084) map </A>","Viewing Distance":"101-500 Feet","Source":"MUFON","trends":["There have been 2 other sightings in Franklin","There were no other sightings in Franklin on or around November 5th 1975"]}