{"Weather Factors":"Unknown","Date of the Event":"02/25/2012 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.046591,+-97.109127(36080)&iwloc=A&hl=en\"> mufon case (36080) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-02262012-0008","trends":["There have been 8 other sightings in Lewisville","There were no other sightings in Lewisville on or around February 25th 2012"],"Viewing Distance":"Unknown","Object Shape":"Fireball, Teardrop","Region":"Texas","City":"Lewisville","Longitude":"-97.109127","files":["/var/www/straped/mufon/html2text/36080.html.txt","/var/www/straped/mufon/org/36080.html"],"divs":["Sighting DetailsMy niece, my son's girlfriend, and I were walking out of Neighborhood Walmart on Feb. 25, 2012 (Saturday night). It was about 8:30pm and I looked up in the sky, towards the south and saw a red orange object traveling at a high rate of speed, heading north. It almost looked as if it was an airplane on fire as it shot across the sky. I was in awe looking at it, and said to my niece, \"look at that fireball in the sky, what in the world is that?\" She couldn't believe it either! We watched it race all the way across the black sky. My son's girlfriend was already in the truck, and she noticed us looking up at the sky and said, \"what are yall looking at?\" Then she looked up and saw it race by. We are not sure what it was? It could have been a meteor? Space debris? Space ship? We did not hear it, it wasn't making any noise but it was bright, looking like a fireball burning as it flew by. It burned out after watching it for about 20 seconds. It flew all the way across the sky flying at a high rate of speed coming from the south and burning out in the north towards Oklahoma. Really wild! Found a few posts on the internet of people that had also wittnessed it. Wittnesses from Houston all the way to Oklahoma City saw it!"],"Date Submitted":"02/26/2012 03:10 UTC","Object Features":"Dome","Source":"MUFON","Country":"United States","Case Number":"36080","Summary":"Walking out of Walmart on Saturday night, I saw a burning ball of flames traveling at a high rate of speed!","Object Flight Path":"Straight-line path","Tags":"City","Latitude":"33.046591","Disposition":"Unresolved"}