{"Case Number":"36090","Date Submitted":"02/26/2012 05:52 UTC","Longitude":"-117.207134","files":["/var/www/straped/mufon/html2text/36090.html.txt","/var/www/straped/mufon/org/36090.html"],"Sighting Duration":"Undisclosed","Latitude":"32.789056","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around December 31st 2010"],"Source":"MUFON","Log Number":"US-02262012-0018","City":"San Diego","Disposition":"Unresolved","Country":"United States","Summary":"blue lights over san diego coast on december 31, 2010","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.789056,+-117.207134(36090)&iwloc=A&hl=en\"> mufon case (36090) map </A>","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Viewing Distance":"Over One Mile","Date of the Event":"12/31/2010 06:00 UTC","Object Shape":"Sphere, Star-like","Object Features":"None","divs":["sighting detailsmy husband a friend and i were driving on interstate 5 northbound near the sea world exit on 12\\31\\2010, it was new years eve, at around sunset. my husband pointed out a light hovering almost directly in front of us in the sky, though it was many miles away further down the freeway. it was a blue light, light blue like the. color of those led blue lights. i noticed right away what he was talking about, because it was not normal to see that kind if light in the sky. i knew it was something special, nothing manmade though.i was holding my phone, but i didnt want to take a pic cause i didn't want to take my eyes off of it. the light, very quickly moved from in front of us to westbound, within seconds it was over by what i would assume was the water over la jolla, but it remained in sight. it hovered there for a few seconds and started down the coastline, and as it did it changed from one light, into two. the two lights both still the same blue color and size started weaving or what i have been describing as frolicking with eachother, almost as if playing with or racing eachother to the left of us down the coast. i had to turn around to see them because the vehicle i was in was moving freeway speeds. i watched the lights untill i couldnt see them any further. i just want to know if anyone else has seen this or reported it because i can't imagine we could have been the only ones. i also wonder what it could have been, i mean obviously it was a ufo to me because i have never seen such a thing, nor can i identify what it was. i now know there are such things as ufo's!"],"Region":"California","Tags":"City"}