{"divs":["Sighting DetailsSo six family members & I went for a drive on feb.25,2012 at 8:00p.m we were heading through Carson a town in Washington state.We continued up to snow park toward Hoodoo Recreation Area that is about 20 min north of Carson. My husband ,sister-in-law and i were sitting in the back of the SUV with the back door kept open .My husband had noticed a extremly bright light hovering above us. As my sister-in-law and i had looked up we had all three noticed that the object had been moving rather fast towards us as if it was a high speed chase.My sister-in-law had yelled to the driver to please stop,the driver had then slammed on her brakes at that time the object had also come to a complete and total stop so fast that it was clear to us the front of the craft dodged down. We all sat & looked at this thing for about 5 minutes before it slowly rose up & faded away.We continued up the road for a mile or so before it appeared again, not as aggressive as it had been but definately following us."],"Disposition":"Unresolved","City":"Carson","map":"<A HREF = \"http://maps.google.com/maps?q=45.730787,+-121.815991(36095)&iwloc=A&hl=en\"> mufon case (36095) map </A>","Tags":"City","Country":"United States","Summary":"Carson Wa experience","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Log Number":"US-02262012-0023","Case Number":"36095","Sighting Duration":"02:00:00","Weather Factors":"Unknown","Object Features":"Other, Unknown","Longitude":"-121.815991","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date Submitted":"02/26/2012 06:17 UTC","files":["/var/www/straped/mufon/html2text/36095.html.txt","/var/www/straped/mufon/org/36095.html"],"Object Shape":"Boomerang, Cigar, Oval, Triangle","trends":["There have been 2 other sightings in Carson","There was one other sighting in Carson on or around February 25th 2012"],"Region":"Washington","Date of the Event":"02/25/2012 09:00 UTC","Latitude":"45.730787"}