{"files":["/var/www/straped/mufon/html2text/36099.html.txt","/var/www/straped/mufon/org/36099.html"],"Longitude":"-81.197343","Date Submitted":"02/26/2012 06:41 UTC","Latitude":"42.773872","Object Shape":"Sphere, Square, Rectagular","Object Flight Path":"Straight-line path","Date of the Event":"05/17/2001 07:00 UTC","Region":"Ontario","Source":"MUFON","Case Number":"36099","Country":"Canada","Tags":"City","divs":["Sighting DetailsI was at an estate auction and went out for cigarette there were 5 or 6 people already out there, it was approx. 19:00. Then an incredable round light the size of a car zoomed by followed by approx.14 more, we were all stuned, then aformation of 15 went by in a cresent form very slowly, it was followed by another formation exactly the same going very slowly too,then this huge rectangle ship all black no lights went by when I saw it the first thing I thought of was a whale shark, the front was Identicle to a whale sharks head, flat and wide,in the middle of the front was a rectangle observation window,you coud see the sillouette of two beings from the shoulders up,this ship was absolutely huge,after it went by very slowly it was followed by two 15 each cresent formations going very slowly too,after they went by there were another 15 following them flying very fast.I did buy 4 paintings at the auction so I have a receipt with the date,I just have to go through a drawer with alot of other receipts to find it.This is a true story and is certainly the most incredable thing I;ve ever seen period.No problem with a lie detector test. We lost sight of it when it went back into the clouds."],"Object Features":"Window(s), Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.773872,+-81.197343(36099)&iwloc=A&hl=en\"> mufon case (36099) map </A>","Sighting Duration":"Undisclosed","Log Number":"CA-02262012-0027","trends":["There have been 3 other sightings in St Thomas","There were no other sightings in St Thomas on or around May 17th 2001"],"Summary":"huge ufo with 90 car size orbs in front and behind guarding it","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","City":"St Thomas","Weather Factors":"Unknown"}