{"Summary":"triangular, light in each corner and a single light in centre-there was no flashing lights.","Disposition":"Unresolved","Latitude":"52.586973","Date of the Event":"07/20/2005 03:41 UTC","Country":"United Kingdom","trends":["There has been one other sighting in Wolverhampton","There were no other sightings in Wolverhampton on or around July 20th 2005"],"Longitude":"-2.12882","divs":["Sighting DetailsI was in the flat and I had an urge to go outside with the video camcorder-this happens when I 'feel' there is something flying over-I cannot explain this but it is the first time I have been able to capture one of several events on digital 8. I had the urge to go into a carpark a few hundred yards down the road. when I entered the carpark I heard a rumbling low hum and looked up. My first thoughts when I noticed the UFO was, \"at last I can prove these things are really happening to me\"! I thought that the object was 'WOW' factor. I tried to think of what object could be but it did not resemble anything i had seen before. The object was flying above and over my head in a straight line. I thought it released an orb and so followed the orb-however this was a star that it flew past. I was excited and releaved that I had finally caught on film One of the phenomena that has been with me through-out my life. **There was a second object following the first. It was a silver intense light. The Camcorder was set on nightshot and as I raised the cam to film the light, it wentout and was lost in the star field. I am more pleased due to events I have witnessed, were too frightening for another witness to talk about. She was with me when four silver 'star' like objects came out of the blue sky and hovered above 2 jets a couple of years ago! for more info feel free to contact me. the clip is 146mb and it is copyright. contact me and I will release a picture."],"Viewing Distance":"101-500 Feet","Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=52.586973,+-2.12882(3609)&iwloc=A&hl=en\"> mufon case (3609) map </A>","Object Features":"Unknown","Case Number":"3609","Log Number":"GB-07202005-0002","Weather Factors":"Does Not Apply","Date Submitted":"07/20/2005 03:41 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/3609.html.txt","/var/www/straped/mufon/org/3609.html"],"Sighting Duration":"00:00:20","City":"Wolverhampton","Region":"England","Tags":"City"}