{"Summary":"5 slashes appeared one at a time. Traveled across the sky. Each changed shape and ascended.","Longitude":"-74.757429","Object Shape":"Other","Viewing Distance":"Over One Mile","trends":["There have been 8 other sightings in Trenton","There were no other sightings in Trenton on or around October 22nd 2005"],"City":"Trenton","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/36104.html.txt","/var/www/straped/mufon/org/36104.html"],"Source":"MUFON","Disposition":"Unresolved","Date Submitted":"02/26/2012 08:08 UTC","Tags":"City","Region":"New Jersey","Latitude":"40.227159","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.227159,+-74.757429(36104)&iwloc=A&hl=en\"> mufon case (36104) map </A>","Log Number":"US-02262012-0028","divs":["sighting detailsi was on the front porch of my parents house along with my parents and sister. a slash appeared to the right in the distant sky that looked like this \\ and moved from west to east. 15 to 20 seconds later there was another. the another. eventually there were 5 of them. they moved slowly across the sky and were in sight for about 15 minutes. they reached a point in the sky when the first one changed shape and began to ascend... so it seemed. the bottom part of the slash began moving up as it \"ascended\". eventually it turned into a u shape. as is \"ascended\" the next one continued in the same path and, once beneath the first, began changing shape as well. it too changed into a u. they all did this. they seemed to be flying towards philadelphia. i actually got in the car and drove towards route 95 south. i was able to keep them in sight untilthe bensalem mall. at that point i turned off and headed back home. i was at my friend's store in july 2009 and on the phone with my fiance in italy when i saw the same thing. i had told her about the earlier sighting and couldn't believe i was seeing the same thing years later. i called 2 of my friends to see what i was seeing."],"Sighting Duration":"Undisclosed","Case Number":"36104","Date of the Event":"10/22/2005 04:30 UTC"}