{"Viewing Distance":"Over One Mile","Region":"Pennsylvania","Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36107.html.txt","/var/www/straped/mufon/org/36107.html"],"Log Number":"US-02262012-0031","Country":"United States","City":"Philadelphia","Object Shape":"Bullet, Missile, Cigar, Cylinder","Source":"MUFON","Object Features":"Wings, Unknown","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around February 26th 2012"],"Tags":"City","Weather Factors":"Unknown","Summary":"Cigar shape with 'S' like movement","Latitude":"39.961105","Longitude":"-75.157149","Case Number":"36107","divs":["Sighting DetailsI turned to walk up my street and, for some reason, turned behind me to about 4 o'clock (almost due east) and looked up. I didn't feel an urge to do this, it was automatic. There were no clouds and I immediately spotted an object. It was gray, long, horizontally cylindrical and my first inclination was that it was a plane. It appeared to be hundreds of feet in the sky, and it began to rise but in an 'S' pattern. Draw an 'S' from bottom to top, and that is the motion the object took. It performed two 'S' patterns, still remaining horizontal, and traveling left and right about 3 lengths. It then disappeared. Nothing was obstructing my view, nothing was in this area of the sky but the object, and it appeared the sun was illuminating the object the whole time (which was directly behind me). The object was not a plane, not a helicopter, not a bird (which was my second gut reaction until I realized the motion was too perfect and then the object vanished). This was my first sighting and I wanted to be excited, but I wasn't. I think because no one else saw it with me, there was no way to really know if what I saw was real. I don't need validation, but sometimes having a second opinion on something this subjective is reassuring."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.961105,+-75.157149(36107)&iwloc=A&hl=en\"> mufon case (36107) map </A>","Date of the Event":"02/26/2012 01:50 UTC","Object Flight Path":"Path with directional change","Date Submitted":"02/26/2012 08:50 UTC"}