{"Tags":"City","files":["/var/www/straped/mufon/html2text/36100.html.txt","/var/www/straped/mufon/org/36100.html"],"Region":"California","City":"Campo","Object Features":"Undisclosed","Date Submitted":"02/26/2012 06:55 UTC","Object Flight Path":"Undisclosed","Object Shape":"Unknown","Viewing Distance":"Unknown","Date of the Event":"05/02/1978 12:00 UTC","divs":["Sighting DetailsI was a young teen 12 or 13. My mother and her friends were heavy partiers and were consumed with the idea of lots of ufo activity in the area. Most of thier sightings were over a canyon between Campo and Potrero. We stayed late at one of her friends house, i thought we left between 9 and 10 pm and was shocked when we got home after 1am. The house was down a very long driveway and had 3 gates that had to be opened and closed to keep the cattle in. I sat on the hood of the car to handle the gates as we got to them. At the middle gate i saw a flash of light and did not think anything of it. Everybody in the car could not stop talking about how long the light lasted how bright it was, and why did it take over 4 hours to get home when it should not have taken more than 30 minutes. I have always told them that they were high and the only thing that happened was a falling star and that i was the only sober person there and was actually outside and nothing happened. I have always had kind of an uneasy feeling about the time but i have no confidence in who i was with. In my twenties i had a scar show up on my thigh, i had an irrational fear of letting the doctor see it. A friend was diagnosed with skin cancer, so i went and had a doctor look at it and he said it was an ingrown hair and tried to squeeze it. I was satisfied that it is not cancer but i also knew the doctor was wrong. Two more have shown up on my shins, they look like burns, matching scars on each leg along with the lone scar on my thigh. I have also had an irrational fear of shaving my bikini line. I started spending a lot of time at the pool and talking girl talk with friends, my daughter and sister. They were talking about shaving and i never told them of my fear, but i resolved to just do it and get over it. When i shaved i found a scar in the crease where the leg joins the body about 3 inches long. I was upset because i could not figure out when or how i could have gotten it. I asked my mother about it and all she would say is that she knew something happened on that road all those years ago. I don't really think anything happened, but it is eating at me. How would i go about finding out if there is any relation to my scars and this so called event without letting anybody know i am inquiring about it?"],"Summary":"bright light loss of time","Latitude":"32.61462","Country":"United States","Longitude":"-116.464142","Case Number":"36100","map":"<A HREF = \"http://maps.google.com/maps?q=32.61462,+-116.464142(36100)&iwloc=A&hl=en\"> mufon case (36100) map </A>","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-02262012-0028","trends":["There have been 4 other sightings in Campo","There was one other sighting in Campo on or around May 2nd 1978"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}