{"Longitude":"-86.575627","Summary":"Viewed an unusually bright light in the sky. Grabbed the binoculars to get a better look. Object had defined pulsating lights of varied colors. Definitely not a plane or helicopter.","trends":[],"Date of the Event":"02/25/2012 09:00 UTC","Date Submitted":"02/26/2012 09:16 UTC","Case Number":"36108","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/36108.html.txt","/var/www/straped/mufon/org/36108.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.524321,+-86.575627(36108)&iwloc=A&hl=en\"> mufon case (36108) map </A>","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Circle","divs":["Sighting DetailsFirstly I am a retired AF meteorologist and have experience in determining aircraft types. I was letting my dogs out when I noticed an unusually bright light in the sky. I called for my wife to take a look. We both noticed that the object was pulsating light. There seemed to be varied colors along with the intense white light. The object was remaining stationary. There were no odd sounds. I grabbed my binoculars for a better look. Upon using the binoculars, I could distinctly see various colors of pulsing lights. I called for my son to view the object. His description is the same as ours. This object did not move; I made notice of a reference point. I used my cell phone's Google Sky to determine if this maybe was a astral-body. There was no correlation between any stars and the location of this object using Google Sky's application. It was see in the East-North-East sky. Before making this report, I decided to wait 24 hours and see if it was still in the sky at the same location. It was no where to be seen. I found this to be quite unusual and intriguing. I did not lose sight of the object as it remain in the same location for hours."],"Log Number":"US-02262012-0032","Latitude":"35.524321","Disposition":"Unresolved","Tags":"City","City":"Undisclosed","Source":"MUFON","Object Flight Path":"Stationary","Country":"United States","Sighting Duration":"Undisclosed","Region":"Tennessee"}