{"Case Number":"36116","map":"<A HREF = \"http://maps.google.com/maps?q=38.976393,+-94.507538(36116)&iwloc=A&hl=en\"> mufon case (36116) map </A>","Object Shape":"Other, Unknown","files":["/var/www/straped/mufon/html2text/36116.html.txt","/var/www/straped/mufon/more/36116_submitter_file1__IMG_1093.JPG","/var/www/straped/mufon/more/36116_submitter_file2__IMG_1072.JPG","/var/www/straped/mufon/org/36116.html"],"Log Number":"US-02262012-0038","Date Submitted":"02/26/2012 11:23 UTC","Source":"MUFON","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was Outside with my wife and daughter looking at my daughters vehicle purchase, when we noticed a clicking sound. then another. All of a sudden we were surrounded by them. So I told my wife that I was going inside to get the camera. When I came out I could still hear the clicking or poping sounds and where ever I heard them I would snap a picture. the two photos submitted are the result of that encounter. It should be after we went inside half of the light in our home went out. We tested all the breakers for voltage and we had voltage at the breakers but no voltage for lights in our bedrooms or outlets. what's weird is that the outlets are on a different breaker, but they have no voltage either. It may be conincidence, but I really find it strange that the lights would go out in that manner without the breakers being tripped. It's starting to become a little creepy around here."],"Sighting Duration":"Undisclosed","Region":"Missouri","trends":["There have been 15 other sightings in Raytown","There were no other sightings in Raytown on or around February 26th 2012","This sighting has never been favorited.",""],"Country":"United States","Disposition":"Unresolved","Latitude":"38.976393","Date of the Event":"02/26/2012 07:34 UTC","Weather Factors":"Unknown","Object Features":"Other, Unknown","Object Flight Path":"Hovering then path","Longitude":"-94.507538","Tags":"City","Summary":"one was balloon like in shape. The other was an orange Orb shape.","City":"Raytown"}