{"Source":"MUFON","Object Shape":"Disc, Saturn-like","divs":["Sighting Detailsi was observing the sky with my sister and my father on the roof of my grandmother's house in Vargem Grande, and we saw a red-orange light in the sky. We thought was common paper balloon , my sister placed the camera on a small wall, took pictures and a strange shape appeared in the screen. The object was slightly bigger than a star and it was slowly ascending. We felt excited about it, we thought we caught a picture of a UFO. I can't remember when it disappeared, and why we stopped to take pictures... Earlier on that day i was going to the house by car and i saw for 2 seconds an \"different\" object in the sky moving foward with a cloud of smoke behind it. Trees entered in my sight and for 5 seconds i couldn't saw the object, and the when i could saw the sky again, the object and the smoke was gone. i thougt this 2 facts are related... It's common to see paper ballons in the area. There's a story about an abduction in a lake near and my grandfather told me stories about a fireball over the near mountains long time ago. and sorry for my english"],"trends":["There have been 12 other sightings in Rio de Janeiro","There were no other sightings in Rio de Janeiro on or around July 22nd 2005","This sighting has been favorited 1 time.",""],"Summary":"i was observing the sky and we saw a light and thought was baloon, my sister took pictures and a strange shape appeared in the screen","City":"Rio de Janeiro","map":"<A HREF = \"http://maps.google.com/maps?q=-22.978675,+-43.456713(36115)&iwloc=A&hl=en\"> mufon case (36115) map </A>","Date of the Event":"07/22/2005 12:00 UTC","Object Flight Path":"Other","Weather Factors":"Unknown","Date Submitted":"02/26/2012 10:50 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36115.html.txt","/var/www/straped/mufon/more/36115_submitter_file1__Fotos061.jpg","/var/www/straped/mufon/more/36115_submitter_file2__Fotos065.jpg","/var/www/straped/mufon/more/36115_submitter_file3__Fotos067.jpg","/var/www/straped/mufon/org/36115.html"],"Tags":"City","Object Features":"Undisclosed","Latitude":"-22.978675","Longitude":"-43.456713","Country":"Brazil","Region":"Rio de Janeiro","Log Number":"BR-02262012-0037","Disposition":"Unresolved","Case Number":"36115","Viewing Distance":"Over One Mile"}