{"Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Region":"Paphos","City":"Konia","Disposition":"Unresolved","Longitude":"32.463512","Date Submitted":"02/27/2012 11:55 UTC","Log Number":"CY-02272012-0010","Object Flight Path":"Other","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Cigar","trends":["There have been no other sightings in Konia","This sighting has never been favorited."],"Tags":"City","Latitude":"34.787591","Case Number":"36128","Country":"Cyprus","Date of the Event":"02/15/2012 06:00 UTC","divs":["Sighting Details1. We where on a flight from the UK to the Island of Cyprus. The event happened more then half way through the flight and we took pictures and videos. 2. I was filming the view from the plane when i heard people talk about the object behind me. 3. I had no idea what it could have been when i first saw it. 4. The object flew fast next to the plane then slowed its speed to match the plane. two beams emerged from the object that seemed to be scanning the plane (evident in picture) Then the object suddenly changed direction in very fast speed. 5. When I first saw the object i was scared as i didn't know what it was. the whole plane apx 100 people saw the objects and started to panic. the captain then asked everyone to fasten their seat belts and not to panic. 6. we lost sight of the object when it flew away in a speed much faster then our plane. There are more pictures and a short video I just didnt get a chance to load them to the PC"],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/36128.html.txt","/var/www/straped/mufon/more/36128_submitter_file1__418548_10150553830071198_615831197_9276221_278150576_n.jpg","/var/www/straped/mufon/org/36128.html"],"Summary":"The UFO came near to our flying plane. All passangers aboard saw it including the crew. Many people took pictures including me.","map":"<A HREF = \"http://maps.google.com/maps?q=34.787591,+32.463512(36128)&iwloc=A&hl=en\"> mufon case (36128) map </A>"}