{"Viewing Distance":"Over One Mile","Tags":"City","Case Number":"36121","Longitude":"-83.375704","Object Features":"Unknown","Date Submitted":"02/27/2012 04:00 UTC","Source":"MUFON","Summary":"THIS WAS JUST RECORDED ON 02/25/2012 OVER GEORGIA. WE WITNESSED IT AT ABOUT 7:20 IT LASTED FOR ABOUT 30 MINS. CONTACTED CNN AND REPORTED IT. 20 -30 GOVERNMENT AIRCRAFTS RESPONDED TO THE LIGHTS IN THE SKY BUT CNN SAID NO ONE ELSE REPORTED IT.","Object Flight Path":"Stationary,Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.956489,+-83.375704(36121)&iwloc=A&hl=en\"> mufon case (36121) map </A>","trends":["There have been 4 other sightings in Athens","There were no other sightings in Athens on or around February 25th 2012","This sighting has been favorited 1 time.",""],"City":"Athens","Log Number":"US-02272012-0004","divs":["Sighting Details1.Leaving walmart 2 i noticed them because of their star like objects were so bright and extremely low 3i thought they were stars at first glance but soon discovered it not to be. 4 first they was stationary around a particularly dark cloud. then one separated itself from the rest and the rest formed sort of a triangle shape but not exactly. at this time they were still at the same altitude as they were when i first noticed them. the last formation they made was a horizontal line. after about 30 mins and then we left. 5 during the sighting i called cnn and made a report. five mins upon ending the call, 20-30 aircrafts were in the same airspace as the starlike objects. to me that was to many to be i that small area of sky. i know that they were aircrafts because of the flashing lights used by plans and helicopters at night. if they weren't ufos then why so many aircrafts to the response. also the cnn woman said i was the only person to report this. i lose sight of the object when all the aircrafts came to the area. we left from the scene after my cousin reminding us of prior engagements."],"files":["/var/www/straped/mufon/html2text/36121.html.txt","/var/www/straped/mufon/org/36121.html"],"Date of the Event":"02/25/2012 07:20 UTC","Weather Factors":"Unknown","Object Shape":"Star-like","Latitude":"33.956489","Disposition":"Unresolved","Region":"Georgia","Sighting Duration":"Undisclosed","Country":"United States"}