{"City":"Weatherford","files":["/var/www/straped/mufon/html2text/36137.html.txt","/var/www/straped/mufon/org/36137.html"],"trends":["There have been 9 other sightings in Weatherford","There were no other sightings in Weatherford on or around February 1st 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.764636,+-97.793514(36137)&iwloc=A&hl=en\"> mufon case (36137) map </A>","Summary":"three rows of spinning lights, middle row bright red spinning counterclockwise, top and botton bright blue spinning clockwise, tilted at around 30 degrees","Latitude":"32.764636","Object Flight Path":"Stationary,Unknown","Longitude":"-97.793514","Country":"United States","Region":"Texas","divs":["Sighting DetailsMy sister and I were out visiting one of her friends that lives in Weatherford, TX. We left her friends at around 1 a.m. and proceeded to drive home. My sister was driving and I was in the passenger seat. We took 730N towards Azle, TX. 730N has a lot of little hills that keep you from seeing into the valley over the next hill. Immediately grabbing both of our attentions was a UFO hovering maybe 50 ft. off the ground and partially over a house about 100 yards away from the road. The object consisted of three rows of spinning red and blue lights. The top and bottom lights were bright blue and were appearing to rotate clockwise at around 200 rpm. The middle lights were bright red and a lot larger than top and bottom ones and were rotating at high rpm in the opposite direction as the top and bottom lights. I could not see the structure of the craft because of the brightness of the lights on the craft. The Object was tilted and spinning like crazy with no wobbling. My sister slowed the car down so we could stare at this thing. A car passed us as we were slowed down so I know there were other witnesses to this thing. We lost sight of this ting after we went through another valley. I am still thoroughly freaked out by the incident and it was over a year ago. I am angry at my sister for not turning around so we could possibly get a photo of the object. We were both freaked out and not thinking clearly enough to get a photo or video. We will both be willing to take lie detector test. ooooo @@@@@@@ ooooo"],"Source":"MUFON","Sighting Duration":"00:01:00","Log Number":"US-02272012-0019","Tags":"City","Viewing Distance":"101-500 Feet","Object Features":"Other","Case Number":"36137","Disposition":"Unresolved","Date Submitted":"02/27/2012 09:03 UTC","Date of the Event":"02/01/2011 01:01 UTC","Weather Factors":"Unknown","Object Shape":"Disc, Unknown"}