{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36151.html.txt","/var/www/straped/mufon/org/36151.html"],"Summary":"Around 6 am this morning took my puppy out to do her biz. Witnessed two lights within about 5 mins of each other","Country":"United States","City":"Grand Rapids","trends":["There have been 45 other sightings in Grand Rapids","There were no other sightings in Grand Rapids on or around February 28th 2012"],"Tags":"City","Date Submitted":"02/28/2012 07:50 UTC","Longitude":"-85.655951","Log Number":"US-02282012-0012","Object Features":"Unknown","divs":["Sighting DetailsAround 6am this morning near East town in Grand Rapids Michigan, I took our puppy out to take care of her buisness. Looking up as I almost always do nowadays I witnessed a non-blinking light heading north through the broken cloud cover. The light did make a slight course correction while heading north, but it didn't \"feel\" like a plane movement. Oh and this happened nearly directly overhead. Well this peaked my interest so I stayed out a bit longer and was not disappointed. About 5 minutes later I saw a light that was very different from the first and lower in altitude heading south, it was flying through the clouds. This light was pulsing, the light would go out completely and come back on full strength every three to four inches from my vantage point, I think I counted five to six pulses before I lost it completely. Neither of these lights was in the normal airport flight path. I got a little freaked out by the last one and decided it was time to go back in."],"Region":"Michigan","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.938489,+-85.655951(36151)&iwloc=A&hl=en\"> mufon case (36151) map </A>","Date of the Event":"02/28/2012 06:00 UTC","Disposition":"Unresolved","Viewing Distance":"Unknown","Case Number":"36151","Latitude":"42.938489","Weather Factors":"Unknown","Object Shape":"Star-like","Object Flight Path":"Straight-line path,Path with directional change"}