{"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering,Other","Longitude":"-116.766411","Case Number":"36169","trends":["There have been 2 other sightings in Alpine","There were 2 other sightings in Alpine on or around June 22nd 1952"],"Latitude":"32.835052","Date Submitted":"02/29/2012 06:50 UTC","Object Features":"Unknown","Object Shape":"Fireball, Sphere","Country":"United States","Region":"California","Log Number":"US-02292012-0015","Date of the Event":"06/22/1952 01:45 UTC","files":["/var/www/straped/mufon/html2text/36169.html.txt","/var/www/straped/mufon/org/36169.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Summary":"1st crash ? 2nd craft hunting for crash site ? ON KCBQ RADIO LIGHT OVER OCEAN First sighting 1952 slow fireball n to s crashing,?,2nd sighting same exact spot 1962 bright orb from over ocean to my site, hover then return to ocean","divs":["sighting detailsfirst of two sightings,1952, riding a bycicle in rural area 1:00 am 12 years old headin home across a field, sensed something, looked up and saw a fireball, slow, orange, red, with blue\\white edges. softball? size, south to north. (near lat. 33.) cousin and i were scared went home mom wasnt interested and we forgot about it. 2nd sighting 1962 approx. 1-2:00 am 1\\4 mile from first sighting. leaving mom's house heading for el cajon, ca. about 15miles away. on gravel road on a high ridge going east, girlfriend says look a car's lights comming up the valley, below us. not many cars out there at that date. watching the \"car\" lights a mile and half away down the alley, we saw that the lights weren't on the road but near it, rough brush canyon lands. we were going east along a ridge, light heading east down below in the valley. we continued east then down off the ridge to the north turned onto a paved road going west towards the light now at our level less than 1\\4 mile away over a canyon on our level, hovering i pulled over and and stopped, the two girls were screaming wanting to get out of there. i rolled the window down, no sound, turned the lights off, no reflection. girls screaming, i said, i'll flash the lights and call them over. i flashed the lights and the bright white light like a street light but way brighter started moving back to the west on the same path. we followed the light at about 45, 50 mph, we were on a curvy road, it moving in a direct line, we went around a hill and the light was about 300 ft high now. we were going down into the valley, the light stayed level. another 1\\2 mile we were 1 mile behind the light and light was about 6-700 ft high. another hill to go around and we were farther behind. we lost sight of the light for about 8 min. till we reached a high ridge about 8 miles from el cajon, the light was over el cajon. we were able to watch the light most of the way back to el cajon and"],"City":"Alpine","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.835052,+-116.766411(36169)&iwloc=A&hl=en\"> mufon case (36169) map </A>"}