{"Date Submitted":"08/10/1983 05:30 UTC","Source":"MUFON","Log Number":"GB-07242005-0001","Object Shape":"Disc","Date of the Event":"08/10/1983 05:30 UTC","Object Flight Path":"Straight-line path","Tags":"City","trends":["There have been no other sightings in Abergavenny","This sighting has never been favorited."],"Latitude":"51.825366","map":"<A HREF = \"http://maps.google.com/maps?q=51.825366,+-3.019423(3616)&iwloc=A&hl=en\"> mufon case (3616) map </A>","Viewing Distance":"101-500 Feet","Summary":"Metallic Car sized squat disc with central rotating slatted band crossed my horizon about 150yds away. No lights, No sound, in bright Summer Morning Daylight.","Object Features":"Dome, Louvres","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/3616.html.txt","/var/www/straped/mufon/org/3616.html"],"divs":["sighting detailsit was a bright summer morning and i had just visited the bathroom. i sat down on the edge of my bed and looked out of the window across my home town of abergavenny, south wales, u.k. it was then that from the corner of my eyes that i noticed something entering my field of view from the right of my line of sight. it was only just above some trees, which are in the local public park and about no more than 150 yards away from my observation point, line of sight. my glance, in which i assumed a conventional aerial vehicle was coming into sight, quickly turned into a wide eyed stare. this was no ordinary vehicle type that i had previously observed! it was about the size of a large family saloon, saucer\\disc shaped and dark metallic in colour. the main distinctive feature, ( as if the rest of the vehicle was not distinctive enough), was a narrow flat band which broke up the shallow squat base of the disc, from the deeper top part. this band had black rectangular slats in it and it appeared that this band was rotating about the circumference of the disc in an anticlockwise direction, (observing from underside), while the rest of the vehicle remained static to the direction of travel. the band was spinning at the same speed the vehicle was moving across my field of view. could this be part of the propulsion system? it moved perfectly straight and level at quite a slow speed - say 5-10mph or so best guess. there were no lights and no sound at all. i remember calling my parents, who were still in bed to come and see this unusual sight, but they were out of it. i wished i had some film in my camera, as i observed it disappear to my left, again above some trees. over the next few days, i scanned the news and papers, for anyone else who had seen it. not a thing. i can not believe that this object crossed over my town so low and one else saw it? sadly, i have never seen anything of the like since that day."],"Longitude":"-3.019423","City":"Abergavenny","Case Number":"3616","Weather Factors":"None, Does Not Apply","Sighting Duration":"00:00:30","Region":"Wales","Disposition":"Insufficient Data"}