{"files":["/var/www/straped/mufon/html2text/36161.html.txt","/var/www/straped/mufon/org/36161.html"],"Case Number":"36161","City":"Pocatello","divs":["Sighting DetailsMy husband was outside having a smoke and out of the corner of his eye to his left he saw a streak of light come in to view then stopped. Trying to understand what he just seen he focused in on the sudden sedentary object. As he focused it dropped suddenly with a sharp stop then just as quick it made a hard upward right angle dart then suddenly stopped again then slowly drifted. That's when I heard him calling \"honey,honey, come out here quick!!!\". I ran outside to see what was going on and my husband pointed out to me the bright solid moving light. I just stood there staring and said \"it can't be a plane because there is no red & blue lights & I see no airplane wings and no flashing white light like an airplane has.\" Then my husband said he was going in to grab the camcorder. I stood there and kept my eyes on the object and never took then off it. He came out the back door and said \"where is it?\" All I could say was \"It's gone. It just blinked out like someone turned off a light switch. Just like that it was gone. Then my husband said \"#@!$&**\" \"&^#@*&^\" and so on!"],"Source":"MUFON","Country":"United States","Region":"Idaho","Weather Factors":"Unknown","Latitude":"42.857911","Date Submitted":"02/29/2012 11:30 UTC","Date of the Event":"02/26/2012 08:13 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=42.857911,+-112.451081(36161)&iwloc=A&hl=en\"> mufon case (36161) map </A>","Object Shape":"Circle, Saturn-like, Square, Rectagular","Summary":"light steak suddenly in view then stopped quickly went down then fast 60 *turn then slow 50 miles then blinked out.","trends":["There have been 10 other sightings in Pocatello","There were no other sightings in Pocatello on or around February 26th 2012"],"Longitude":"-112.451081","Object Features":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","Log Number":"US-02292012-0007","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}