{"Source":"MUFON","Viewing Distance":"101-500 Feet","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-02292012-0012","divs":["sighting detailswas traveling along us 62\\180 from el paso tx, east towards nm border. event occured at approximately 6-6:30 local time. observation was made as the sun set on a particularly dusty texas evening. approximately 5-10 miles from border patrol check point i noticed a light in the sky coming from the direction i was heading, traveling very low. initial thought was something that low would be a helicopter. it was apparent it was not a star or even a plane, but something flying. a fairly bright light and a pulsating light from underneath (much like those on \"conventional\" aircraft made discernment easy that this was not a star, planet, etc.). there is an airport in the area, though the flight path of the airliners could be seen a few miles later in the drive coming from the east, but on the opposite side of the road. the object i saw was on the right side of the road, with the airliners flying in on the left. the airliners were noticed after this sighting, and helped me discern this was not an airliner either. it should also be noted there is a military base in the area as well. fort bliss and biggs army airfield. both in the general direction of where the craft was heading. as i approached the craft on 62\\180, it was close enough to the road for me to open my sun roof cover, not the window, to look at the object from underneath. it did not fly right over the road, but close enough to see \"under(?)\" it displaying three lights at three points, revealing a triangle shape. also visible was the flashing light as described above. reaction, \"this is not a helicopter, and it is moving slow.\" not slow enough to track with a car (because believe me, i tried after pulling over, waiting for a car to pass and turning around), but slow enough that, without witnessing jets with flames shooting out the back or anything of the sort propelling the craft - or causing it to hover (like helicopter blades), that this thing was different, it was powerful (to be kept aloft like that) and it was, to at least this layman, unidentified, for sure. my first reaction was to pull over and listen for jets, etc, as i couldn't see anything of the sort, but once i realized the craft was not a helicopter, i had to slow, pull off and roll down the window. it was a fairly windy night and i cannot accurately report if the craft emmitted noise or not. i have the feeling, though, if it was that close to me moving that slow, i would've heard something. so if it wasn't 'silent' it was at least 'quiet.' after making the turn (and again, not seeing any sort of propulsion means from what i would guess is the 'rear (?)' of the craft and trying to track it on the highway (thinking of travis walton, famously saying, 'i should've stayed in the truck), i realized it had gained too much distance between us as i was waiting on cars to pass, etc. this did allow for the observation of the \"rear\" and no visible means of propulsion. feelings were that of awe. a large, slow moving triangle, with no visible propulsion means was new to me. the triangle seemed to be fairly \"thick\" gut tells me this is government owned\\operated and hasn't been disclosed to the public a la the stealth bomber a few decades ago, as i was in the vicinity of the military bases, described above. the flashing center light was also reminiscent of commercial craft\\public craft. dimensions: triangle. lights: 4 visible. one pulsating in the center, (maybe a little off center) and three yellowish\\white lights at the points of the triangle, but not flush with the points, the craft continued approx. 2-3 feet beyond the lights propulsion: no helicopter blades, flames emmited from afterburners. sound: unsure. seems i should've heard something. no additional evidence - only visual sighting."],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/36166.html.txt","/var/www/straped/mufon/org/36166.html"],"Date of the Event":"02/28/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.76791,+-106.485621(36166)&iwloc=A&hl=en\"> mufon case (36166) map </A>","Longitude":"-106.485621","Tags":"City","Region":"Texas","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around February 28th 2012"],"Date Submitted":"02/29/2012 04:39 UTC","Latitude":"31.76791","Object Shape":"Triangle","Disposition":"Unresolved","Object Features":"Unknown","Case Number":"36166","Summary":"Traveling along US 62/180, past border patrol station (approx 5 -10 miles) saw triangular object, three lights at each point SLOWLY fly along highway toward El Paso, TX (military base in area). Did not hear sounds, though I was on highway traveling fast.","Weather Factors":"Unknown","City":"El Paso"}