{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.019448,+-70.73078(36160)&iwloc=A&hl=en\"> mufon case (36160) map </A>","Object Shape":"Fireball, Flash","divs":["sighting detailsaround 9pm on 02\\28\\2012(for about 45 minutes), police, resuce and firetrucks were passing by our house. my husband and i assumed there might be a fire in an old farm house, as there are a lot of older farm homes in the area we live in. we were wathcing a movie in our living room in front of a large bay window. about 15 minutes after we noticed the last emergency vehicle drive by, at 10:03pm a very large, glowing green object seemed to shoot across the sky in the direction that the emergency vehicles had headed. there was no sound. my husband and i both stood up and i turned off the tv immediately. we listened for about 5 minutes for a crash (we both assumed at first that it must have been a plane \"falling\" out of the sky). we never heard any sounds. we stared outside for a while and there was nothing unusual. about 1\\2 an hour after that the emergency vehicles started coming back in the opposite direction with no sirens or lights. we watched the local news at 11:00pm and there was no mention of any of this. i logged into the news station's facebook site to see if there was any talk about this because it was so odd and several other people posted seeing something glowing\\shooting across the sky in multiple other towns. we went to bed assuming it would be on the morning news, but still nothing and no posts other than the people like myself on the news site. i have never seen anything like this. i have seen meteor showers\\shooting stars\\low flying airplanes, this did not look anything like those things. i was thankful that my husband was there because the whole thing was very strange. i also don't think we would have believed each other if we hadn't both seen it."],"Object Features":"None","Date Submitted":"02/29/2012 09:30 UTC","Log Number":"US-02292012-0006","City":"Bridgton","Summary":"At 10:03pm my husband and I noticed a very large glowing green object shoot across the sky.","Region":"Maine","Date of the Event":"02/28/2012 10:03 UTC","Source":"MUFON","Case Number":"36160","Viewing Distance":"Unknown","Longitude":"-70.73078","Object Flight Path":"Straight-line path","Country":"United States","trends":["There have been 2 other sightings in Bridgton","There were no other sightings in Bridgton on or around February 28th 2012"],"Disposition":"Unresolved","Latitude":"44.019448","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/36160.html.txt","/var/www/straped/mufon/org/36160.html"]}