{"Latitude":"40.067614","Object Shape":"Blimp, Cigar, Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=40.067614,+-74.530709(36168)&iwloc=A&hl=en\"> mufon case (36168) map </A>","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-74.530709","trends":["There have been no other sightings in Plumsted Township","This sighting has never been favorited."],"City":"Plumsted Township","files":["/var/www/straped/mufon/html2text/36168.html.txt","/var/www/straped/mufon/org/36168.html"],"Object Features":"Wings","Country":"United States","Log Number":"US-02292012-0014","Date of the Event":"06/10/1998 12:00 UTC","Disposition":"Unresolved","divs":["Sighting Detailswife and I were driving when we observed an object stationary in the sky. we thought it was a plane but it didn't move. We pulled over to observe it closer. I got out of car watching it and it never moved or made a sound and it was close enough that if it was just a normal plane it should have made some sort of sound. After an indeterminate time I got back in car. My wife was adamant she never got out of car but when we got home we both had gravel in our sneakers. strange thing was we somehow lost track of time and didn't realize till we had driven away that the plane or object or whatever was gone. don't remember it ever moving. Stranger still, later that month I received a phone call from a man asking if I had observed anything strange in the sky lately. He knew my first name but had my last name wrong. He invited me to a meeting of a supposedly private group of people interested in ufo's but the meeting was to be held at a nearby navel base. I decided not to go and that was the end of the incident, but my wife and I still are concerned that we seemed to have misplaced some time and we never did see the object move away. It just seemed to have vanished."],"Case Number":"36168","Date Submitted":"02/29/2012 05:40 UTC","Tags":"City","Summary":"seemed like large transport plane with stubby wings","Object Flight Path":"Stationary","Region":"New Jersey","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile"}