{"divs":["sighting detailsi took my dogs out in the backyard as have done countless times over 8 years here. as i was standing there looking at the night sky as normal, but this time i saw something different. i noticed what at first i thought was a very low shooting star. in the half second it took to realize this was no shooting star it broke from one solid object into 3 separate orbs. these orbs very quickly fell into formation of a perfect triangle for about one second before taking more of a wide v formation as it disappeared behind trees. the whole event did not take more than 5 seconds total. the object\\objects never changed heading or speed during the entire time and was moving much faster than planes i have ever seen fly over this area, and being over the flight path of lambert airport, and 3 smaller airports i have seen all type of plane fly over from commercial, single engine, to military jets. i have never seen anything that has even come close to what i had seen. the object started as a streak of blue-white light with a tail of matching light similar to a comet or shooting star. after it broke it seemed to have much less light, but still same color as it started. wish i had anything record it with, but ain't that the way!"],"Date of the Event":"02/29/2012 11:21 UTC","Summary":"Started as fireball/comet broke to 3 orbs in formations","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.791462,+-90.494435(36179)&iwloc=A&hl=en\"> mufon case (36179) map </A>","Disposition":"Unresolved","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around February 29th 2012"],"Viewing Distance":"101-500 Feet","Tags":"City","Case Number":"36179","City":"St Charles","Longitude":"-90.494435","Source":"MUFON","Sighting Duration":"00:00:03","Latitude":"38.791462","files":["/var/www/straped/mufon/html2text/36179.html.txt","/var/www/straped/mufon/org/36179.html"],"Country":"United States","Object Features":"Unknown","Object Flight Path":"Straight-line path","Object Shape":"Fireball, Sphere","Region":"Missouri","Log Number":"US-03012012-0003","Date Submitted":"03/01/2012 01:02 UTC"}