{"Disposition":"Unresolved","Log Number":"US-02292012-0019","Weather Factors":"Unknown","Region":"Ohio","Case Number":"36173","Sighting Duration":"00:05:00","Source":"MUFON","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/36173.html.txt","/var/www/straped/mufon/more/36173_submitter_file1__moon22912a.jpg","/var/www/straped/mufon/more/36173_submitter_file2__moon22912b.jpg","/var/www/straped/mufon/org/36173.html"],"Date of the Event":"02/29/2012 08:53 UTC","City":"Heath","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"None","Longitude":"-82.413894","Date Submitted":"02/29/2012 10:01 UTC","Summary":"Dark cone shape passing over the moon","trends":["There have been 3 other sightings in Heath","There were no other sightings in Heath on or around February 29th 2012","This sighting has never been favorited.",""],"Object Shape":"Cone","map":"<A HREF = \"http://maps.google.com/maps?q=39.960338,+-82.413894(36173)&iwloc=A&hl=en\"> mufon case (36173) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsMy girlfriend and I were outside the night on 2-29-12 looking at stars an dthe moon through my 8\" dobsonian telescope when I saw a dark cone shaped object pass in front of the moon moving from left to right following teh shadow line. I was not sure what it was and I looked for any type od object that was visible and there was nothing I could see. So I proceded to try to take a picture of the moon when I saw it again this time dropping down from the top and arcing to the right going the other direction this time. I took another picture right after and the objet was gone. I looked further for 10 minutes and I was not able to locate anything. There were aircraft in the area because we live along the flight path to Port Columbus airport but none of them were close to the moon at that point in time. I tried for 15 minutes to replicate the shadow thinking it might be a flare or glitch on the camera but I was not able to create it again. We searched for bird and bats and nothing found. There was varied clouds moving across the sky but again nothing close to the moon at that point in time. I have no idea what it was I saw but I found it interesting. I have two pictures that I took of this event. THe first shows the cone shaped object and the second picture taken just seconds later the object is gone."],"Latitude":"39.960338"}