{"Latitude":"47.675288","Date Submitted":"03/01/2012 12:07 UTC","Sighting Duration":"00:10:00","trends":["There have been 3 other sightings in Redmond","There were no other sightings in Redmond on or around July 17th 2011"],"divs":["Sighting DetailsIt was aproximately 2 a.m. on July the 17th 2011 in Redmond, Washington. A friend and I were outside on a back porch. I remember noticing that there were no 'stars' visible at the time except for one which was rather large and bright. After a few moments of I presumed it to be Venus because of it's large size and brightness. It was bluish white. There were no aircraft flying around and it was quite silent. Then suddenly, I realized that the 'star' was kind of 'wobbleing', moving to the left and to the right and changeing it's altitude slightly; going up and down a few degrees. My friend and I watched for at least five minutes as the object suddenly appeared to display three or four, smaller, secondary lights that were basically 'orbiting' the main, central light, but not in a fixed manner. The overall impression was that of a 'amorphous' or 'shape-changing' structure. I remember thinking that object could not have been more than a mile away because its lights illuminated the small clouds that were nearby. At one point the object was inside or behind the clouds but was still very visible because they were so bright. The object slowly moved up and away from us before vanishing completely. The objects location was seen approximately to the north-east of the new Virginia Mason hospital in Redmond. The object was initially fairly low in the sky; maybe 30-35 degrees from the horizon. Also the object made absolutely no sound."],"Weather Factors":"Unknown","Region":"Washington","Disposition":"Unresolved","Log Number":"US-03012012-0001","map":"<A HREF = \"http://maps.google.com/maps?q=47.675288,+-122.112652(36177)&iwloc=A&hl=en\"> mufon case (36177) map </A>","City":"Redmond","Source":"MUFON","Longitude":"-122.112652","Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/36177.html.txt","/var/www/straped/mufon/org/36177.html"],"Object Shape":"Circle, Sphere, Unknown","Case Number":"36177","Date of the Event":"07/17/2011 02:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Tags":"City","Summary":"UFO was stationary initially, hovering. Then moved to the left and to the right and eventually moved up and away until it was no longer visible.","Object Features":"Unknown","Country":"United States"}