{"Date Submitted":"02/29/2012 11:30 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36175.html.txt","/var/www/straped/mufon/org/36175.html"],"Object Features":"Unknown","trends":["There have been 8 other sightings in Miami Beach","There were no other sightings in Miami Beach on or around February 29th 2012"],"Country":"United States","Source":"MUFON","Date of the Event":"02/29/2012 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=25.79227,+-80.13192(36175)&iwloc=A&hl=en\"> mufon case (36175) map </A>","Object Flight Path":"Other","Region":"Florida","divs":["sighting detailson 2\\29\\12 at about 9 pm i and 100 to 200 people were watching an outdoor movie at a park at 17th st and washington on miami beach. my friend julie pointed to the sky to the right of me, north of our position. i saw approximately 12-15 solid orange bright, steady lights moving from east to west. they were scattered across the sky - some appearing further away than others by the relative size and brightness of the light. they were at varied degrees off the horizon, approximately 30 to 45 degrees in range. the lights traveled in a slight rise from a lower position in the east to higher positions in the west. as we watched, several other identical lights appeared from the east and traveled in their own rising path westward. several of us watched and wondered out loud what they were. i tried to take a picture with my phone, but it shows only a tiny pinprick of light. the lights moved at a steady pace, eventually fading into the cloud cover west of our position."],"Case Number":"36175","Object Shape":"Sphere, Square, Rectagular, Unknown","Log Number":"US-02292012-0021","Latitude":"25.79227","City":"Miami Beach","Longitude":"-80.13192","Weather Factors":"Unknown","Summary":"about 20 orange lights moved in scattered, staggered arc from east to west at varied degrees fading into cloud cover"}