{"Date of the Event":"11/23/2011 12:00 UTC","Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was going to bed after family day I believe it was Thanksgiving, my sister was staying over.I laid down and something through the window caught my eye. I watched it for a while, I was stunned. It was very close it was disc shaped with very bright lights it seemed to be rotating but it could have been the light sequence. The colirs of the lights are very bright and seem to have no pattern but alternate between color and white. I saw my sister heading to the bathroom and called her in to see it. She watched with me a while. I went and got my video camera it is an older Sony version.I began taping it through the window. My sister said ,wierd I do not hear any sound. I too could hear nothing. We went out on the back porch to see if we could hear anything or get a better view, I expected to be gone. It remained in the sky for hours. I taped alot and then I was starting to get freaked out. I felt weird looking at it. It moved slightly from time to time first straight up then back down very fast with no sound at all. My son told me he saw it a month or so later on the other side if our house, he video taped it on his cell phone. My sister was up this last weekend and we saw it again, we were in my jacuzzi and after going into the house we came back and it was gone. My husband and brother in law also saw it And my h that first night."],"files":["/var/www/straped/mufon/html2text/36182.html.txt","/var/www/straped/mufon/org/36182.html"],"Date Submitted":"03/01/2012 04:48 UTC","Country":"United States","trends":["There have been 13 other sightings in Cottonwood","There was one other sighting in Cottonwood on or around November 23rd 2011"],"Sighting Duration":"Undisclosed","Summary":"Ufo spotted and video taped through window and then off my back porch in Cottonwood Az","Object Features":"Undisclosed","Object Shape":"Disc","Log Number":"US-03012012-0006","Case Number":"36182","Source":"MUFON","Latitude":"34.747438","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.747438,+-112.007269(36182)&iwloc=A&hl=en\"> mufon case (36182) map </A>","Longitude":"-112.007269","Tags":"City","Object Flight Path":"Hovering then path","City":"Cottonwood","Disposition":"Unresolved"}