{"Disposition":"Unresolved","Country":"United States","Tags":"City","Log Number":"US-03012012-0010","divs":["Sighting DetailsI have observed two ufos in early to late evening (2:00am one night) on the last two nights. The smaller of two objects is spherical in nature, I have had daylight sightings of it before. It hangs out over our area on a regular basis. The larger of the two objects is chevron shaped with three bright lights on the edges of craft. I could not see the top or bottom it was two far away to see much detail other than the the bright search type lights along the sides. It appears in our northwestern sky about the same level of the moon visually. It was not out of the atmosphere last night because I saw a aircraft pass directly between myself and the object probably 35,000 feet up or so. Tuesday night the larger of the two crafts was just hanging out not doing much it was further north and west than the smaller local ufo. Wensday night the larger of the two crafts was back with the small one and it started out higher and further north and west of the smaller objects. It was shooting red and bright blue light beams at a unknown or unseen object west and south of where it was hovering, this was about 7pm. Smaller object seems to be there for an observer it did not particpate in light show other than its normal white lighting appearance. Although I did not see a third object, I have seen the larger of the two objects around before and was firing at a third object and apparent had smaller possibly fighter craft out doing their own shooting of lights and I even have seen it with large explosions possibbly small craft exploding but no proof. I saw it launch the smaller crafts. I did not see any of the smaller crafts last night though. About 10PM i took my dog out for his walk before bedtime. I observed the larger of the two craft swiftly desending toward the horizon. I m not sure what caused this to happen although my scanner reported no crashes of any crafts in the area, it has happend before though i never did find out if they found it or not. It could have landed under control. We are surround by the Mark Twain National Forrest area and there are plenty of remote unpopulatted areas. I took my dog back out about an hour later and they had both had left the area and I went to bed."],"files":["/var/www/straped/mufon/html2text/36187.html.txt","/var/www/straped/mufon/more/36187_submitter_file1__DSC00070.JPG","/var/www/straped/mufon/org/36187.html"],"Date Submitted":"03/01/2012 01:49 UTC","Object Features":"Undisclosed","Summary":"larger aircraft was chevron smaller sphere","Sighting Duration":"03:30:17","trends":["There have been 3 other sightings in Washburn","There were no other sightings in Washburn on or around February 29th 2012","This sighting has never been favorited.",""],"Object Shape":"Chevron, Sphere","Viewing Distance":"Unknown","Latitude":"36.588054","Date of the Event":"02/29/2012 09:14 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.588054,+-93.958355(36187)&iwloc=A&hl=en\"> mufon case (36187) map </A>","Region":"Missouri","Weather Factors":"Unknown","Case Number":"36187","Object Flight Path":"Path with directional change,Path then hovering","City":"Washburn","Source":"MUFON","Longitude":"-93.958355"}