{"Date of the Event":"03/01/2012 07:05 UTC","Viewing Distance":"Over One Mile","divs":["Sighting Details1. Where were you and what were you doing at the time? We were walking down our street about 5 minutes after 7 pm. We were facing east, and the sun had already set. 2. What made you first notice the object? We saw lights which we first thought were airplane lights. We had the impression of a large airplane turning in our direction. We never see this maneuver from a large airplane, so it caught our attention. We thought something unusual was happening with the plane. 3. What did you think the object was when you first noticed it? We thought it was an airplane, perhaps in the Orlando air traffic pattern. We saw a whitish light somewhat like a nose light on a passenger plane, and a bluish green light to the right side of the white light. 4. Describe the object and its actions and motions in detail. We thought that the object was making a turn in our direction - coming from the west toward the east. After about 5 to 10 seconds the two lights disappeared and were replaced by a string of around 7 larger bright red lights. They were much larger than stars would appear, perhaps about 3-5 times the diameter of Venus. The lights did not flicker or twinkle. The lights vanished for a split second and reappeared to our right, an angle of about 10 degrees of change (more to the south), and partially behind the edge of a cloud. It hovered briefly and then disappeared. 5. Describe your feelings, reactions and actions, during and after sighting the object. We were positive that we had seen something VERY unusual and hurried toward a higher elevation on the street with a bigger view of the horizon. We were somewhat excited, obviously, but not particularly fearful of the sighting. 6. How did you lose sight of the object? It simply vanished."],"Object Features":"Window(s)","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36195.html.txt","/var/www/straped/mufon/org/36195.html"],"Date Submitted":"03/01/2012 09:31 UTC","Sighting Duration":"Undisclosed","Longitude":"-81.621219","Tags":"City","Latitude":"28.15668","City":"Davenport","Case Number":"36195","Object Flight Path":"Hovering then path,Path then hovering","Summary":"Looked like airplane lites then string of head lites in a string of 7","Source":"MUFON","Country":"United States","Object Shape":"Other","Region":"Florida","trends":["There have been 2 other sightings in Davenport","There were no other sightings in Davenport on or around March 1st 2012"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=28.15668,+-81.621219(36195)&iwloc=A&hl=en\"> mufon case (36195) map </A>","Log Number":"US-03012012-0018"}