{"Object Shape":"Other","Source":"MUFON","Tags":"City","Region":"California","Weather Factors":"Unknown","Country":"United States","Longitude":"-117.125217","files":["/var/www/straped/mufon/html2text/36202.html.txt","/var/www/straped/mufon/org/36202.html"],"Latitude":"32.969509","Date of the Event":"02/20/2012 08:28 UTC","City":"San Diego","divs":["Sighting DetailsWhen I notice these I'm always out side smoking or walking. Also noticing them at different locations. Either with a really close friend or when we ar seperate at different locations. Its strange how we are always seeing these lights or objects, and its really making us kind of afraid but becoming quite the norm lately. I will list the description of each sighting so you can understand this isn't the normal thing... Also please keep inmind that this has been taking place in differrnt locations and seen by both of us together or sepret. And on different days in the last few months. And in different hights in the skies. I am only posting this to make it known and to get it out, as you know this isn't what most are willing or wanting to hear to give advice or to help us understand. Ever since(and I posted this here after sighting took place) we had our close and I mean very close sight of this firey translucent looking shape shifting craft, it was scary, that warped our reality since. And yes I have photos of this firey looking object. Its not verry clear but can draw what we saw through our binoculars. Man it was mind trippy, the kind of stuff you see on movies... But anyways here you go. First is which my closest friend seen while I was way. 2 white star looking lights, what was thought as first but brighter, right next to each other and close to the horizonish. Then boom one just drops out of no where, then a few after the nexts just drops out of the sky. Me and her seen, close to the horizon like really low. A white star streak across the sky at really high speed and vanish. Other times we've seen similar events but can't remember exact details. Other times we've caught lights that seemed close just disappeared. Other times we've seen white translucent cigar oval shaped objects disappear slowly as if it was going into an invisable tunnel. Just the other night I seen what I thougt was a plane high, dot size, up above me kind of. Going at an up angle untill the light was gone. And durring these strange events, stranger things have been happening... lol I assure you we are not \"on anything\" or drinking or anything of the like."],"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around February 20th 2012"],"Object Features":"None","Sighting Duration":"Undisclosed","Date Submitted":"03/02/2012 03:42 UTC","Object Flight Path":"Straight-line path","Case Number":"36202","map":"<A HREF = \"http://maps.google.com/maps?q=32.969509,+-117.125217(36202)&iwloc=A&hl=en\"> mufon case (36202) map </A>","Summary":"Multiple Sighting through out the months","Disposition":"Unresolved","Log Number":"US-03022012-0006","Viewing Distance":"Over One Mile"}