{"Disposition":"Unresolved","Country":"United States","Object Flight Path":"Path with directional change","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.77144,+-90.370949(36201)&iwloc=A&hl=en\"> mufon case (36201) map </A>","Log Number":"US-03022012-0005","Summary":"strange wobbly dark ufo with flashy lights","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Hazelwood","There were no other sightings in Hazelwood on or around February 27th 2012"],"Date Submitted":"03/02/2012 03:07 UTC","City":"Hazelwood","Object Features":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Boomerang, Triangle","Longitude":"-90.370949","Date of the Event":"02/27/2012 06:27 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36201.html.txt","/var/www/straped/mufon/org/36201.html"],"Case Number":"36201","Source":"MUFON","Latitude":"38.77144","divs":["Sighting DetailsMy sister was driving and I was in the passenger seat. We turned down the road to get home and she widened her eyes and pointed. I thought she was pointing at the roof of a nearby house that was under construction. I examined the house and said \"I don't get it\" she didn't say anything she just stopped the car and thrusted her hand towards the direction of the sky. I looked up and there was a wobbly thing hovering. It was dark and had 3 white lights that faded in and out. The lights started pulsing faster as it picked up speed, flashed randomly and darted like lightning but stayed in view and began hovering again. We drove home and I immediately grabbed my phone a to recordd... I ran towards the area (which was right behind my house) and it was gone. I have seen countless aircrafts in my life. I spent my childhood on an army base and spent 4 years married to an active duty USAF member ... Lived on Kadena AFB and Scott AFB. Also... I have spent my entire teenage years living right here next to Lambert. I have NEVER seen anything like this in my life."]}