{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.715483,+-73.999923(36219)&iwloc=A&hl=en\"> mufon case (36219) map </A>","Viewing Distance":"Over One Mile","City":"New York","Object Flight Path":"Stationary","Region":"New York","Date of the Event":"02/26/2012 07:15 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Square, Rectagular","divs":["Sighting DetailsI was on the phone looking out the window on the 14th floor. I watch planes go by all the time, and am familiar with the distances they need to keep. There was a plane going by, and I noticed a orange-amber light (not spherical, but squarish--the light seemed to have a square outline, or it had corners--it was between a circle and a square) a little bigger than Venus near the plane, not in line with it. It was probably behind the plane but from my angle it looked like it was too close to the plane. I kept watching it for a few seconds to make sure that it wasn't going to be an issue where the two would get too close. And then I noticed there was an identical object in the sky, in a straight line directly above the first object, but much further up in the sky than you would see two helicopters or jets flying in formation. The distance between them was about 5-10 degrees. But they looked identical in size, shape, glow intensity. I didn't feel scared when I realized that they were unusual or unexplainable, I was just excited to keep watching them and see what they do. I watched them for about 20 seconds and I didn't notice any significant change in location or size. I left the room I was in and quickly went out to another room to access the patio area. This took about 5 seconds. When I looked up and tried to find them, they were gone. When I first saw the first object I thought it may be a helicopter, although the color of the light on it wasn't a color I normally see on helicopters."],"Country":"United States","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around February 26th 2012"],"Summary":"Two pink-orange lights in a straight line above each other, about 5-10 degrees apart over Manhattan's upper west side near plan in flight path.","Longitude":"-73.999923","Log Number":"US-03032012-0005","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36219.html.txt","/var/www/straped/mufon/org/36219.html"],"Case Number":"36219","Date Submitted":"03/03/2012 01:17 UTC","Latitude":"40.715483","Source":"MUFON"}