{"Tags":"City","Date Submitted":"03/03/2012 01:00 UTC","Longitude":"-74.003563","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Log Number":"US-03032012-0004","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 22nd 1975"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36218.html.txt","/var/www/straped/mufon/org/36218.html"],"Object Flight Path":"Path then hovering","divs":["Sighting DetailsThe closing night of camp at Raquette Lake culminates with a traditional speech given by the director that includes boys camp, girls camp, and all counselors, around a very large bonfire in the center of the soccer field at boys camp. The night was perfectly clear, and since the stars were much more interesting than the speech I was listening to, I laid back in the grass and stared at the night sky above. The only light within a few hundred yards was the glow of the bonfire. As I stared at the sky, three fluorescent green disks appeared from three separate horizons. The disks came together faster than the speed of traditional aircraft of the day without sound. They formed a perfect equilateral triangle formation directly above us somewhere, between 5,000 - 10,000 feet and then began to spin in unison maintaining their triangular positions. After several minutes of spinning in unison they \"pulsed\" away and within less than 2 seconds each was gone. Before the speech was over, everyone had taken notice of what was happening over our heads, and even the director stopped speaking because of all the chatter and pointing going on all around him. I was not at all surprised by what I had seen, as it's unreasonable to think that within our boundless universe, Earth is the only planet capable of supporting life. I have believed in UFO's since reading library books about the subject when I was in 7th grade. This experience proved my belief."],"Object Features":"Unknown","Latitude":"40.717773","Case Number":"36218","Object Shape":"Circle","Viewing Distance":"Over One Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.717773,+-74.003563(36218)&iwloc=A&hl=en\"> mufon case (36218) map </A>","City":"New York","Region":"New York","Summary":"UFO Sighting Over 1975 Closing Campfire of Raquette Lake Boys Camp","Date of the Event":"08/22/1975 09:00 UTC"}