{"Disposition":"Unresolved","Region":"Florida","Sighting Duration":"00:10:00","Source":"MUFON","Log Number":"US-03032012-0003","Object Features":"Undisclosed","City":"St Petersburg","Viewing Distance":"101-500 Feet","Summary":"Three lights came towards us and then they shifted into a triangle craft","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around February 10th 2012"],"Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-82.63245","Case Number":"36217","Latitude":"27.781956","Object Shape":"Triangle","Country":"United States","Date Submitted":"03/03/2012 10:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.781956,+-82.63245(36217)&iwloc=A&hl=en\"> mufon case (36217) map </A>","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsMy son Joshua (age 36) and I had just left the movie theatre in Tampa at the Westshore Plaza, it was around 6:30 pm on Friday, February 10th 2012. I told Joshua to put his seat belt on and he said \"No\", then he said he heard very distinctive voice in his head that said \"you are moments away from something significant happening\", but he still did not put his seatbelt on. He laughed and said to himself, that would be a bummer if we got into an accident and Mom will tell me \"I told you to put your seatbelt on\"! We were now just on the St. Petersburg side of the bridge at 6:35 and we were heading South towards St. Petersburg on I275 traveling about 65 MPH. I was in the far left lane, the fast lane, and as I looked up in the sky I noticed 3 odd looking lights. I tried to slow down a bit but there were cars on the right of me and behind me and I was afraid to cause an accident. I said to Joshua, look at those lights honey, what do you see, he said yeah, those are......and then he said oh my God, those are not lights from a plane Mom, I said \"I know\", I was looking at them as we approached them. I noticed it was exactly 6:40 pm on the car clock. It was 6:42 pm when we were right up near the object. They were on our right on the passenger side of the car. Joshua put his window down for a better look, other than the noise from the wind and cars next to us, there was no sound like engines or anything coming from the lights themselves. There were 3 lights on our right side (West) of the car just off the Interstate coming towards us. The farthest light was a normal headlight looking light, that would be on a plane, big and round, the next one closest was however bigger and still round, then the closest one to us was smaller in size and again, round. There was a very small blinking red light between the first and second light and a white blinking light between the second and third light. Very odd looking for a plane, we both agreed it was NOT a plane or a helicopter or anything that could be identified. I was traveling now just near the Sawgrass Lake area of St. Peterburg. It then came to a complete stop in the sky and hovered just directly across from us, about 20 degrees off the horizon and just over the tree line, we could clearly see as it began to shape shift and turn towards us counter clockwise, into a large black pewter looking triangle that had several lights on it. there were many, many white lights. I'm not sure how many. We were about 250 feet from this object. Joshua was now hanging out the window, I was trying to drive in HEAVY traffic at 65 to 70 miles an hour, everything was happening so fast. I tried to hand Joshua my cell phone for a picture, but I could not get it out of my purse easily and stay in my lane driving so fast, Joshua said PULL OVER Mom, but there was no way as I was in the fast lane and I could not get over to the shoulder safely. I handed him the camera phone and he tried to take a picture but it was getting darker and the trees were now in the way, he could not get a good focus on the craft. I quickly made a call at 6:51 pm to a MUFON FI to tell him what we saw and to report it while it was still fresh in our minds. I tried to give him as much information as I could so there would be a new set of ears on this investigation. We drove on a bit and I was able to maneuver to the exit at 38th Avenue North and then we re-entered the highway once again heading towards Tampa (North) to try to get another sight of the craft. As we passed where we had originally seen it on our left, (West) my side of the car, we could no longer see it. It was just gone. But we had not seen it leave as we watched the area as best we could as we were exiting and re-entering the highway. We then got off the Interstate on the 118th Avenue exit towards Clearwater and drove to 28th Street No. Heading South again we then pulled the car over to the shoulder and got out of the car to watch the sky and see what we could. We did not see the craft again. We headed back home after about 10 minutes and re-entered the Southbound lane on I275 again. As we past the sighting area on our right (West) we noticed a car crash in the exact same place as we had seen the craft. There were 2 vehicles involved pulled over on the shoulder and two emergency type vehicles gathering the cars. They had yellow lights on the emergency vehicles. We then headed on towards home"],"Date of the Event":"02/10/2012 06:40 UTC","files":["/var/www/straped/mufon/html2text/36217.html.txt","/var/www/straped/mufon/org/36217.html"]}