{"Longitude":"-105.065519","map":"<A HREF = \"http://maps.google.com/maps?q=39.796211,+-105.065519(36216)&iwloc=A&hl=en\"> mufon case (36216) map </A>","Date Submitted":"03/03/2012 05:28 UTC","divs":["Sighting DetailsOn February 26,2012 and 3 days in a row at approximately 8:30pm I noticed a very bright light glowing green and purple hovering over the foothills. I am located in North Denver near 45th and Xavier Street. The object seemed to linger and hover for about 20 min and then it darted faster than a lightning bolt NW and behind the mountains. On the second day it did the same thing. On the third day the object was closer this time at least over I-70 and Sheridan from me that was 6 blks west and 2 blks north. It only stayed for about 10 min and I noticed it had 2 balls of light glowing red and orange and purple below it. I tried to take a picture but it then zoomed away like the speed of light. I have a photo with it zooming away there were 2 objects in the photo not sure if it was the same one or if it split into 2."],"Date of the Event":"02/29/2012 08:30 UTC","Viewing Distance":"101-500 Feet, Over 1 Mile","Latitude":"39.796211","City":"Denver","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Shape":"Circle, Cylinder, Egg, Sphere, Star-like, Teardrop","Summary":"On February 26,2012 and 3 days in a row at approximately 8:30pm I noticed a very bright light glowing green and purple hovering over the foothills. I am located in North Denver","Log Number":"US-03032012-0002","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36216.html.txt","/var/www/straped/mufon/more/36216_submitter_file1__IMG_20120224_182823.jpg","/var/www/straped/mufon/org/36216.html"],"Country":"United States","Region":"Colorado","Sighting Duration":"00:10:00","Source":"MUFON","Object Features":"None","Case Number":"36216","Tags":"City","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around February 29th 2012","This sighting has been favorited 2 times.",""],"Disposition":"Unresolved"}