{"Region":"Michigan","Latitude":"45.108209","Object Features":"Undisclosed","Log Number":"US-03032012-0014","Source":"MUFON","Date Submitted":"03/03/2012 10:13 UTC","Summary":"Strange Pulses of Blue Light","Weather Factors":"Unknown","Longitude":"-83.527105","Disposition":"Unresolved","City":"Alpena","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Date of the Event":"03/03/2012 03:30 UTC","Case Number":"36228","Object Shape":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.108209,+-83.527105(36228)&iwloc=A&hl=en\"> mufon case (36228) map </A>","trends":["There have been 5 other sightings in Alpena","There were no other sightings in Alpena on or around March 3rd 2012"],"Country":"United States","files":["/var/www/straped/mufon/html2text/36228.html.txt","/var/www/straped/mufon/org/36228.html"],"divs":["Sighting DetailsIn the early morning hours of March 3nd 2012 I was sitting in my living room watching a movie and enjoying my first day of vacation. Other than the television the house was completely dark. My sofa faces east with three large windows to the south, and a large sliding glass door to the north leading to my backyard, as well as a 3 x 3 kitchen window also on the north wall of my home. Around 330am I noticed an intense burst of blue light that flashed once very quickly which caught my eye. Then only a second or two later I saw the light even more intense this time and it sustained for 4 or 5 seconds. A few more quick flashes and that was it. Also, I did not hear a hum but the floor seemed to be vibrating at a low frequency. I tried to pass this off as lightening as we were having an intense snow storm but I could not in light of the following: I grew up in Pensacola Florida and there we have some of the most intense lightning storms on the planet. I have never in my 34 years seen a blue flash of lightning that seemed to be focused in such a small area. I think its worth noting to say I did not see the light through my front windows as you normally would during a flash of lightning. Something else I thought was strange: I have a Red Lab named Winston. He is 14 months old and has never barked, not one time.... Until last night. During the sustained flash he barked intensly for 10 or 15 seconds. He paced by the back door for several minutes. I believe God put us on this earth. I also believe in this vast universe there has to be intelligent life. I am a christian and a professional and would appreciate my name being dissmissed from this report. I would be glad to answer any questions you may have."]}