{"Case Number":"36223","Object Shape":"Circle","Object Flight Path":"Hovering then path,Path with directional change","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=34.140773,+-118.652233(36223)&iwloc=A&hl=en\"> mufon case (36223) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","Log Number":"US-03032012-0009","City":"Calabasas","Object Features":"Patterned Surface","trends":["There have been 4 other sightings in Calabasas","There were no other sightings in Calabasas on or around March 2nd 2012"],"Latitude":"34.140773","divs":["sighting detailsi was at home on friday evening, march 2, 2012. between 7 and 7:30pm i took my three small dogs out to the backyard. i immediately noticed a very bright object that i thought was a star. but when it moved i realized it wasn't a star. it appeared to have about three to five lights. it moved back and forth in a zig zag way, and then hovered and wobbled. i began to think perhaps i was just dizzy and maybe i wasn't actually seeing what i thought i was seeing. i asked my 18 yr old daughter to come out and look at it. she said it was not a star, it was definitely moving and hovering and was not an airplane. she said it must be a ufo. as time went on it moved further north, would zig zab a bit and then hover and wobble some more. it was very cold out and my daughter was recovering from a bad cold so she went back in. i came out about every 15 minutes and watched it. then i decided to see if i could get a better look through binoculars. i sat in a lawn chair and once i got it into focus, i kept my hands very steady. i got quite a good look. it was a spherical object with many lights on it. the lights were in a grid pattern. the object was a dull metallic color. i realized that what i thought had only been about three to five lights was really many more, at least 15 to 20. from the time i first saw it, it must have been between 2 1\\2 to 3 hours that i could still see it. at about 10pm it was still visible and had moved north toward ventura county. at 11pm it was gone. i regret that i didn't take video or was unable to get a closeup photo through the binoculars. i live about 10 miles from the pacific ocean. from where i live, the object appeared to be following the coastline north."],"files":["/var/www/straped/mufon/html2text/36223.html.txt","/var/www/straped/mufon/org/36223.html"],"Summary":"Sighting of bright spherical object in northern Los Angeles County","Sighting Duration":"Undisclosed","Longitude":"-118.652233","Date of the Event":"03/02/2012 07:00 UTC","Country":"United States","Region":"California","Source":"MUFON","Date Submitted":"03/03/2012 04:18 UTC","Tags":"City"}