{"Summary":"I was on the patio viewing the stars through our 20xbinnoculars on a stand when the ufo moved into my view it was big and squair with a big lite cross or x accross it in lights it shape changed in the first second the other four it thrusted to the south","Sighting Duration":"00:00:05","Country":"United States","Object Shape":"Square, Rectagular, Other","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date Submitted":"07/16/2005 12:15 UTC","Source":"MUFON","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around July 16th 2005","This sighting has never been favorited.",""],"Longitude":"-104.977543","Date of the Event":"07/16/2005 12:15 UTC","Object Features":"Patterned Surface, Other","divs":["Sighting DetailsIt was the evening of July 15th 2005 my husband and I were observing the stars from our patio in Denver Colorado. We were looking through our binnoculars they magnify 20x. We had been observing Mars and her moons as best we could. The view of the moon was magnificent. We had noticed that a few of the stars we could see that looked like they had red white and blue lights on them but seemed to be moving with the constelations we assumed that the freeky twinkle of lights was maybe caused by the planet Mars. We were watching them close because we had never seen them twinkle like that as apposed to the other stars which looked just like any star through our binnoculars. My husband had given up and gone to take a shower about 11:45pm I started to go lay down, but I went back out onto the patio and wanted to have just one more look at the star I was observing...I set the binnoculars up on the stand I found the star I was looking at and then it dissapeared I thought what? Right then the ufo came into view the first second it was making a machanical move either the triagles were moving into it, or the star part of the ship was moving into the triangles it was only for a second that took place the next four seconds it was a square with a light like cross and the bright one in the middle the others dim off white color of light emmiting from them.I tried to count them but could not deciede if I saw five and the middle light on each side of the cross or x It seemed to thrust to the south I could swear I heard it to it sounded like someone lit a big torch and as it tipped to the south the lights went out and the ufo and sound was gone. I could not see anything on the top side the bottom was illuminated by the lights ....the lines that go from the lights that make it look like a peramid or an eye of God, or maybe stairs kind of I was shaking terribly I don't know why I was so frightend . I ran to the bathroom and got my husband to come out side and I was shaking my heart was pounding...we never saw anything again. I have painted some water paintings of what I saw. Ok when all was over I looked at the clock it was 12:15AM which would be July 16th 2005."],"Case Number":"3623","map":"<A HREF = \"http://maps.google.com/maps?q=39.740484,+-104.977543(3623)&iwloc=A&hl=en\"> mufon case (3623) map </A>","Log Number":"US-07252005-0005","files":["/var/www/straped/mufon/html2text/3623.html.txt","/var/www/straped/mufon/org/3623.html"],"Weather Factors":"None","Object Flight Path":"Path with directional change,Path then hovering,Other","Latitude":"39.740484","Disposition":"Insufficient Data","Region":"Colorado","City":"Denver","Tags":"City"}