{"Summary":"two objects, moving at amazing speed, totally silent, changing position in relation to each other.","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/36239.html.txt","/var/www/straped/mufon/org/36239.html"],"Region":"England","Longitude":"-1.753402","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=52.482162,+-1.753402(36239)&iwloc=A&hl=en\"> mufon case (36239) map </A>","trends":["There have been 3 other sightings in Birmingham","There were no other sightings in Birmingham on or around January 17th 2010"],"Date of the Event":"01/17/2010 12:00 UTC","Case Number":"36239","Latitude":"52.482162","Sighting Duration":"00:00:06","Log Number":"GB-03042012-0006","Object Shape":"Star-like","Country":"United Kingdom","Disposition":"Unresolved","divs":["Sighting DetailsMyself and my girlfriend were walking my elderly brother home, as it was past midnight (he only lives about 3 hundred yards from my house)on a beautiful frosty, starlit night. just as we were about ten yards from my brothers front gate I happened to look up and immediately noticed two star like objects, side by side, travelling at great speed.within a split second the one object shot directly in front of the other, so quickly that I was`nt sure if it was the object on the left,or the one on the right.Within another second or so they were back side by side then as they were starting to go away from us they did another manoeuvre.At precisely the same moment the object on the left moved away in an arc to the left, and the other one moved in an arc to the right. As they were disappearing into the distance I could see them move back towards each other before I lost them in the glow of the street lamp on the far side of the road.As soon as I had seen them I pointed and shouted to my brother and girlfriend to look, but unfortunately they were unable to see them, partly due to the speed of the objects, and partly due to the fact that my girlfriend and brother have`nt got the best eyesight without wearing glasses.I am sure the objects were not jets (at least not any that I am aware of) as there was no sound,no vapour trail and no cloud cover. I had the distinct feeling that whoever or whatever were operating them were out for a \"joyride\", almost as if they were saying \"look what we can do\". I was totally in awe of what I saw, and almost felt privileged to have witnessed the event. I confess to having an interest in the possibility of UFO`s as I know of four people who have had ufo sightings but you have to have doubts, that is until you see something like I did, then you may think differently.I did a little calculation, based on the approximate angle above the horizon that I first and last saw them,the amount of time I observed them (about 6 seconds)and different possible heights ie, one kilometre, two kilometres etc.If my calculations are correct then I estimate that at an altitude of one kilometre they were travelling at about 1,620 kilometres an hour. I only calculated up to a possible height of four kilometres but at that height i estimate they were reaching speeds of around 6,600 KPH or eleven kilometres in six seconds!. They could have been even higher,if so the mind boggles at what speed they were hitting."],"Source":"MUFON","Object Features":"Unknown","Weather Factors":"Unknown","City":"Birmingham","Date Submitted":"03/04/2012 08:02 UTC"}