{"files":["/var/www/straped/mufon/html2text/36244.html.txt","/var/www/straped/mufon/org/36244.html"],"Source":"MUFON","Disposition":"Unresolved","Region":"Pennsylvania","Sighting Duration":"00:05:11","Object Features":"Undisclosed","Country":"United States","Date Submitted":"03/04/2012 02:27 UTC","Object Shape":"Cross, Cylinder","Weather Factors":"Unknown","Case Number":"36244","map":"<A HREF = \"http://maps.google.com/maps?q=40.763026,+-79.531258(36244)&iwloc=A&hl=en\"> mufon case (36244) map </A>","Summary":"Draw a 2 inch cigar shape.. then move in 1/2 inch from each side and center a 1 inch cigar shape crossing he center, or may I say perpendicular to the center line.","Latitude":"40.763026","Longitude":"-79.531258","divs":["sighting detailsi have never reported this before but always looked for pictures similar and never have found. i along with my mother, who passed away 1998, saw an odd black shape, during a bright mostly clear day about 5 pm 1976, at least our vision of the item was not obstructed by clouds etc. we both saw the shape defined below at a lower altitude then raise directly overhead until object was out of site. the item appeared black in color. the center of the object was shaped similar to a cigar however there were two intersecting black lines. best way to describe for shape description. draw a 2 inch cigar shape.. then move in 1\\2 inch from each side and center a 1 inch cigar shape crossing he center, or may i say perpendicular to the center line. i use the 2 inch description because that is the size it appeared in the sky. i estimate this item to have been about 2000 feet up (i base this altitude estimate on my current perception of my past memory from 1976 and my skydiving experiences in the mid 90's when i was fairly good at estimating height of clouds). i do not take any drugs then or now, and never abuse alchohal."],"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 2 other sightings in Ford City","There were no other sightings in Ford City on or around June 15th 1976"],"Tags":"City","Date of the Event":"06/15/1976 05:16 UTC","Log Number":"US-03042012-0011","Object Flight Path":"Straight-line path","City":"Ford City"}