{"files":["/var/www/straped/mufon/html2text/36249.html.txt","/var/www/straped/mufon/org/36249.html"],"Source":"MUFON","divs":["Sighting DetailsWhile outside on a Sunday afternoon, I heard an airplane and looked up. We live in Frisco, Texas and on the flight path for DFW International Airport. Watching several planes at once, one on approach and two at higher altitudes with contrails, I noticed a very bright light slowly passing from West to East. First noticed due north at approximately 80 degrees inclination (nearly directly overhead). The object was not an aircraft as it was moving too slow and did not emit a contrail. (recommend checking the con altitude for this day, time and location. This will help determine altitude. I think it was well above the cons). The light brightened and then dimmed and brightened again, changing reflectivity. Appeared to be a reflection from the sun on some type of object, similar to aircraft glint, but not quite the same and much brighter. I called my family outside to look at the object. The 4 of us tracked it East until it disappeared from sight at 1801 CST. Object was observed for approximately 5 minutes. Using a Simmons spotting scope on 60 power a definite object was spotted. Spotting scope was used when the object was well to the East at approximately 30 degree inclination to the East. The object was somewhat translucent, wavering, with reflective properties. I was only able to see the object through the scope for about 1 min due to the distance and now getting lower on the horizon and beginning to fade away. My teenage son also saw the object through the scope. My first words when spotting the object were, \"its one of those sky snake ufo's!\" The object appeared to have a spherical center with 5 tentacle like tubes that flexed out to a flexible tubular ring around the outside. The entire object wavered and slowly changed shape as if it were blown by the wind. My thought is that it was some type of weather ballon, but some of the facts did not add up. Personally I've witnessed strange shaped weather balloons while flying in the USAF. I've seen them pancake, wobble, flatten and once even look like the Martian mothership. I even hit a Buzz Lightyear mylar ballon at 22,000 feet while flying in Mexico. Though the translucent coloring was similar to a weather balloon, there were no ribs, nor payload like most weather balloons. Speed and track was consistent with a weather balloon, but the shape did not make sense. This object was similar to thy sky snake ufo's I've seen on the internet. This was basically a Saturn type object with 5 spokes reaching out to the ring. The ring and spokes were tubular and flexed, changing shape somewhat. The sphere did not change shape. Reflectivity depended upon shape. The object did appear to slightly disappear and then reappear, but this could be because of distance, coloring, and shape. My 13 year old younger son stated he saw a very fast moving light moving toward the object and then disappear. The remainder of the family had looked away for a moment and could not corroborate that particular alleged event. The object was spotted by my father some 40 miles East of my location, in Rockwall. He was unable to get optics on the object, but definitely saw the bright and then dimming reflectivity from the object. The object could only be seen to have form while viewing through optics. Definitely structured, reflective object with unique shape and flexible properties. This sighting falls into the classic definition of a UFO...an unidentified flying object."],"Log Number":"US-03042012-0013","Date Submitted":"03/04/2012 09:28 UTC","Case Number":"36249","Longitude":"-96.787047","Object Features":"Appendage(s), Other","trends":["There have been 17 other sightings in Frisco","There were no other sightings in Frisco on or around March 4th 2012"],"Sighting Duration":"Undisclosed","Latitude":"33.177624","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Object Shape":"Circle, Saturn-like, Sphere, Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.177624,+-96.787047(36249)&iwloc=A&hl=en\"> mufon case (36249) map </A>","Date of the Event":"03/04/2012 06:01 UTC","Summary":"Snake like with sphere in middle ring around outside connected with 5 tentacles","City":"Frisco","Object Flight Path":"Straight-line path","Tags":"City","Region":"Texas","Disposition":"Unresolved"}