{"Tags":"City","Region":"Maine","files":["/var/www/straped/mufon/html2text/3624.html.txt","/var/www/straped/mufon/org/3624.html"],"Viewing Distance":"Over One Mile","Longitude":"-67.864444","Summary":"Controlled Flight East to West along US Border stopped suddenly then went vertical","Latitude":"46.981111","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-07252005-0006","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date Submitted":"04/30/1963 12:00 UTC","divs":["Sighting DetailsI was assigned as a supply clerk with the Army Nike Hercules Missle Site at Caswell Maine in 1963. There were four (4) missle sites surrounding Loring Sac Base. I was in the Radar Van delivering parts when suddenly all hell broke loose. Radar had picked up an object flying from West to East approx. 12 miles inside the Canadian Border. All four of the Missle Sites had picked up the oblect. The van officer had tried repeadily to contact the object to no avail. Loring AFB had picked up the object & had its fighters in the air. All of the missle sites had sounded the alert & had the missles raised on their launchers. The Tracking Board used to detect planes & subsequently the flight of a missle was locked onto the object. The estimated speed of the object was 600 MPH Suddenly the object stopped \"Completely\" and went straight up. The Van officer was shocked & lost for words. Gentlemen he stated we just had an equipment glitch. Yep we did! & also three other missle sites, A SAC Base & NORAD............"],"Case Number":"3624","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.981111,+-67.864444(3624)&iwloc=A&hl=en\"> mufon case (3624) map </A>","Object Features":"Unknown","Date of the Event":"04/30/1963 12:00 UTC","trends":["There has been one other sighting in Caswell","There was one other sighting in Caswell on or around April 30th 1963"],"City":"Caswell","Object Shape":"Disc, Other"}