{"Weather Factors":"Unknown","Region":"Washington","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Date Submitted":"03/05/2012 07:49 UTC","City":"Kennewick","Log Number":"US-03052012-0005","Sighting Duration":"Undisclosed","Summary":"I witnessed low flying triangular object with solid lights at each corner moving very slow","Disposition":"Unresolved","Source":"MUFON","Latitude":"46.213556","map":"<A HREF = \"http://maps.google.com/maps?q=46.213556,+-119.132544(36259)&iwloc=A&hl=en\"> mufon case (36259) map </A>","files":["/var/www/straped/mufon/html2text/36259.html.txt","/var/www/straped/mufon/org/36259.html"],"Date of the Event":"Unknown","Country":"United States","trends":["There have been 14 other sightings in Kennewick","There were no other sightings in Kennewick on or around"],"divs":["Sighting DetailsI was wrapping up yard work at 8:45pm the first time i seen this object which was around June. Three bright lights that did not blink appeared from the west hovering very low, it past directly overhead and had no sound. I thought it was very odd the lights were not blinking. The size of the triangle was massive, like the size of football field. The color of the lights were light blue. When the craft was directly overhead it past below a small cloud and that is when I realized this was one massive craft. As fearless a person as I am I found I was scared to move or speak. I ran to the front door and told my fiance to come look and make sure I wasnt halucinating. She is a extreme skeptic of anything thats not directly written in textbooks. When she saw the object she clearly had the initial feeling I did because I must have asked her 10 times if she was seeing it and she never replied. Then it continued east traveling very slow maybe fifty miles an hour. My fiance was so shook up she was in tears for hours. Whenever I would bring it up she would get extremely upset and not want to talk about it. So when I seen this same object Halloween night at the same time while I was with her and my daughter trick or treating I was scared to tell her but when I realized I had our hd digital video camera I had to record it. When she realized this was the same object she had a panick attack and rushed our daughter to the car. Halloween was over. We went home and to my horror none of the video turned out. She said GOOD becuase if it would of turned out she would have smashed the camera. It was at that moment that I realized some people if presented with evidence dont want to know the truth. It scares them to bad and disrupts their comfortability bubble. So whether this craft was piloted by E.T.s or humans I have to say I'm thankful I Still have my hd camera."],"Tags":"City","Longitude":"-119.132544","Object Flight Path":"Straight-line path","Case Number":"36259","Object Shape":"Triangle"}