{"Region":"California","divs":["Sighting DetailsMy sister and I were driving westbound on the 10 freeway near West Covina around 6:20-6:30 this evening, when we first noticed what looked like the brightest light in the sky, over the Downtown LA skyline. We reasoned that it was much too bright to be a star because the sun was then still setting, but it was not moving at all, so we doubted that it was an airplane or a helicopter. It seemed at first to be about as distant as the ocean. It went away a few times, and returned as bright as before. It seemed a lot closer to us during the second or third re-appearance, approximately over El Monte. It began to look like it was made up of two separate lights and we began to joke that it was just a star performing mitosis, when it appeared to be flickering in many colors much like a police light. It appeared to be \"M\" shaped to us, either because the object itself was shaped like an M, or because of beams of light emanating from the bottom of it in diagonal lines. The entire object looked to be pulsating with white light. It was difficult to focus on, it seemed like my eyes had to continually re-adjust to the brightness of it, making it difficult to perceive how close or far away it was from us. It even seemed that the colors of the object were also difficult to focus our eyes on. After about thirty to sixty seconds it seemed to get dimmer and move away in a southwest direction and we couldn't see it anymore. It did come back again but the last time we saw it, it was just a bright light high in the sky like it was before. We were exiting the freeway in San Gabriel when we lost sight of the object for the rest of the night."],"Log Number":"US-03052012-0001","trends":["There have been 7 other sightings in El Monte","There were no other sightings in El Monte on or around March 4th 2012"],"Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.070111,+-118.022597(36255)&iwloc=A&hl=en\"> mufon case (36255) map </A>","Summary":"Bright star-like objects in San Gabriel Valley","Source":"MUFON","Object Flight Path":"Hovering then path","Case Number":"36255","Longitude":"-118.022597","files":["/var/www/straped/mufon/html2text/36255.html.txt","/var/www/straped/mufon/org/36255.html"],"Weather Factors":"Unknown","Latitude":"34.070111","City":"El Monte","Country":"United States","Object Shape":"Sphere, Star-like, Other","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"03/05/2012 12:11 UTC","Date of the Event":"03/04/2012 06:30 UTC","Object Features":"Other","Disposition":"Unresolved"}