{"Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Object Shape":"Disc","Latitude":"35.387424","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.387424,+-94.395038(36253)&iwloc=A&hl=en\"> mufon case (36253) map </A>","Longitude":"-94.395038","City":"Fort Smith","trends":["There have been 12 other sightings in Fort Smith","There were no other sightings in Fort Smith on or around June 14th 1969"],"Region":"Arkansas","Case Number":"36253","Object Features":"Dome","Country":"United States","Date Submitted":"03/04/2012 10:16 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36253.html.txt","/var/www/straped/mufon/org/36253.html"],"Log Number":"US-03042012-0017","Date of the Event":"06/14/1969 12:00 UTC","divs":["Sighting DetailsAs a small child I can remember my father standing on our front porch of our garage apartment and calling for my mother to come outside. She went out to the porch with him, I can still remember the urgency in his voice. I remember them talking in a low excited voices and as a child I wanted to know what was so interesting. I can remember going out on the front porch of our garage apartment and looking up. To my amazement at tree top level was a circular object hoovering above our yard. I felt no worry, in fact I remember feeling very calm, and thinking to myself, Oh good they have come to take me home. The object that I was looking at was large and circular with a dome on top and bottom. Around the edge of the lip was a band of lights, no not lights, was more like a window that allowed lights to circulate around the edge of the craft. When the lights came on they would appear in patterns. These lights ran around the edge of the object, but in a repeating pattern of two or three different patterns. Always in the same colors of yellow, blue, red, or green. But not always in the same sequence. I don't know for sure how long they were there but I do remember wishing that they would take me home with them. I felt like they had come for me. I knew that the object was from another world and could almost feel a link with them as a child. Then as we watched the object shot start up so far that it appeared to be about the size of a dime in the sky and off to the west over the airport. We stood there amazed for a couple of minutes and then went into the house, my father called the airport to see if they had picked up anything on their radar. I can remember him asking for the control tower and then after they picked up he kept asking why do you need to know that and hung up the phone without giving them any information. as soon as he hung up the phone I can remember he yanked the phone cord out of the wall and we did not plug it back in for a few days. I felt sad that I had been left behind, but also seemed to feel that they would be back for me."],"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path","Summary":"Parents and I stood on porch and watched object hoover in our front yard. I felt they had come to take me home, as a child."}