{"Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"101-500 Feet","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.117514,+-98.528942(36251)&iwloc=A&hl=en\"> mufon case (36251) map </A>","divs":["Sighting DetailsLast night, a friend of mine and his daughter as well as myself and my son saw and watched two UFO's around my parents place on the Sabana River between Duster and Lake Proctor. We drove up to a lake that my dad built and shone our headlights on the tank. We also started using each a spotlight to look around the lake. After a min or so of looking I noticed four really bright stars reflecting off the water and when I looked up there were two horizontal crafts with lights on either end shining on to the lake. The light made the lake look like daytime for just a second and then they were off. You could tell that the crafts were still there but there was no sound. We shone our spotlights up at them and they flew along the treeline back to the right at an amazing rate of speed. They stayed over there for a bit and then went back to the left of the tank but much further away almost instantly. when they were to the left the two lights turned into three lights making a perfect triangle. We sat and watched them for 30 to 45 minutes as they moved around in the sky. My kid was getting a little freaked out over the situation so we proceded to head to the main entrance of the place. When we got into the open bottom land of the feild we stopped and watched them for another 30 min or so. I called my wife and then called my sister who was at my aunts house between Gorman and Duster to tell her about what i had seen. She said that her husband had called her less than five minutes ago asking if she had seen the lights in the sky as he was driving from there towards Comanche. I called him and we saw the same lights brighten in the distance. A little later 10:00 or 10:15 we saw a jet propelled plane fly into the area and drop 8 to 10 flares and chase the two crafts away. The jet plane made a definate plane sound just after it flew by. As we were closing the gate to leave the two crafts were back poking around. I have never in my 34 years of life seen anything like what we saw last night. I have always been kind of a skeptic but had no reason to not believe other friends and family members storys but had never myself seen anything. My cherry is popped and i now believe that there is somthing flying around up there that we as civilians are not privvy to. The government knows somthing is up because the attempted to chase them off."],"Tags":"City","City":"De Leon","files":["/var/www/straped/mufon/html2text/36251.html.txt","/var/www/straped/mufon/org/36251.html"],"Weather Factors":"Unknown","Latitude":"32.117514","Longitude":"-98.528942","Country":"United States","Region":"Texas","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Triangle","Log Number":"US-03042012-0015","Summary":"watched a UFO move around the Sabana river bottom for over an hour after it lit up the tank we were spotlighting.","trends":["There have been 13 other sightings in De Leon","There was one other sighting in De Leon on or around March 3rd 2012"],"Date of the Event":"03/03/2012 09:05 UTC","Date Submitted":"03/04/2012 09:34 UTC","Disposition":"Unresolved","Case Number":"36251"}