{"Country":"United States","Log Number":"US-03052012-0011","divs":["sighting detailswe were at home fixing a late dinner. husband went outside to take the dogs for their evening constitutional, when he saw the two objects. he came hollering onto the front porch for me to come outside and look! i rushed out to see what it was. there were two orbs in the sky, one higher and pure white, the other lower and slightly to the north of first one. the lower one flashed red\\green\\white in rapid succession. they were out over the ocean, but near the shore, moving much too slowly to have been orbiting satellites or the space station. they hovered briefly, then very slowly moved toward the east until we lost sight of them due to the hills and trees up behind us, nearly 20 minutes total viewing time. my husband was spooked by them, and very nervous. he didn't like them. my background is that of a navy brat - grew up with regular training and practice of navigating by the stars. i've long (over 50 years) been involved in star gazing, watching all sorts of celestial events, none of which compared to these objects. they were much closer than any orbiting objects i've observed in the past. not meteor showers. very deliberate and slow. not as fast as even a commercial jet liner. i was fascinated."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"36265","map":"<A HREF = \"http://maps.google.com/maps?q=44.387646,+-124.085586(36265)&iwloc=A&hl=en\"> mufon case (36265) map </A>","Object Flight Path":"Hovering then path","Object Shape":"Sphere, Star-like","Tags":"City","Latitude":"44.387646","Weather Factors":"Unknown","Summary":"Two objects, one lower. Low one flashed colors. Moved Easterly then disappeared.","Longitude":"-124.085586","Object Features":"None","files":["/var/www/straped/mufon/html2text/36265.html.txt","/var/www/straped/mufon/org/36265.html"],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"03/05/2012 03:31 UTC","Source":"MUFON","Region":"Oregon","trends":["There have been no other sightings in Waldport","This sighting has never been favorited."],"City":"Waldport","Date of the Event":"03/03/2012 07:45 UTC"}