{"Region":"Florida","trends":["There have been 5 other sightings in Wellington","There were no other sightings in Wellington on or around March 4th 2012"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=26.657031,+-80.249151(36260)&iwloc=A&hl=en\"> mufon case (36260) map </A>","Date Submitted":"03/05/2012 09:21 UTC","Object Features":"Unknown","Date of the Event":"03/04/2012 10:30 UTC","files":["/var/www/straped/mufon/html2text/36260.html.txt","/var/www/straped/mufon/org/36260.html"],"Viewing Distance":"Unknown","Case Number":"36260","Weather Factors":"Unknown","Summary":"Large Formation of Red-Orange Lights Fly Silently Over Wellington, Florida","City":"Wellington","Longitude":"-80.249151","Latitude":"26.657031","Log Number":"US-03052012-0006","divs":["sighting detailswellington, fl, 4 march 2012, approximately 1030-1045 pm. i was outside my house in my pool area. saw a total of 14 red-orange objects coming from the n\\nw (approximately 334 degrees) heading s\\se (approximately 178 degrees). the first group was 12, then a few minutes later 2 more came from the same direction (nw to se). all were in a straight line, as if following the same navigational heading. they were going in the direction of the atlantic ocean, and probably would have reached the atlantic near lake worth or boca raton, fl. they passed directly over my house, and were totally silent. i estimate the entire formation stretched out for 1-2 miles. i could not judge their height or speed, but had a speed similar to a helicopter. after passing my house they (the lights eminating from the objects) faded away after about 45 seconds to 1 minute while heading se. i have lived here 8 years and have never seen anything like this before. there is a pratt whitney facility that builds helicopters in the approximate direction they cam from. perhaps some new type of stealth technology? 1. outside in my pool area. 2. wife saw them first, she told me to look up. 3. i thought they were a large formation of helicopters, but they were totally silent. 4. just red-orange glowing lights flying in a formation as i described. i am pretty certain they were all separate \"small\" objects, not one large object. 5. amazement, we stayed outside and watched them. as i said above, at first there was a large formation all heading in a line in the exact same direction. once this group of 12 disappeared 2 more of the same objects came from the nw passed over my home and headed se, and they disappeared from view. 6. they just seemed to fade away."],"Country":"United States","Object Shape":"Unknown","Source":"MUFON","Disposition":"Unresolved","Tags":"City"}