{"Source":"MUFON","Disposition":"Unresolved","Region":"California","Date of the Event":"06/14/1996 12:00 UTC","divs":["Sighting DetailsWhen I first saw an alien in a public place, I was amazed that nobody else seem to notice. This event occurred at the Berkeley Flea Market back in 1996 or 97. It was a beautiful summer day. I had set up my display featuring a large photo of a flying saucer right up front. The market was busy but not too crowded. Someone caught my eye, it was a tall figure moving among the crowd looking at the sky, ground, other people as if very curious. But no one seemed to notice, even my friend standing next to me didn't see this seven foot tall figure walking toward us until I said, \"Anton, do you see that person coming this way?\" \"Yes, why?' \"Look at his face. That's an alien!\" \"Wow, he is very unusual looking.\" The face was human looking but the bone structure was radically different. There were deep ridges on the sides of his forehead and the skull seem oddly shaped. His clothes were very ordinary and dull, with no buttons, patterns, shoe strings, zippers or anything that stood out. Suddenly, he stopped and looked at the saucer photo, then he looked at me, then back at the saucer, then at me again. He began to move erratically, turning away like he was about to walk away, then turning his torso back toward me, then away with his arms moving up and down like a confused robot. Finally he started to walk away quickly.I told Anton to watch my stall so I can follow him. I followed about 25 feet behind him with several people between us. When he got to the BART station he suddenly stopped, and stood with his back to me until he spun around and stared directly at my face. I completely shocked. He knew I was following him. Again he made the weird movements, like he wanted to communicate but couldn't, then he walked into the station. I panicked and ran away back to the stall. That was the first encounter."],"Summary":"humanoid over 7 ft tall, ridges on side of head, seemed confused.","Latitude":"37.874363","Object Flight Path":"Undisclosed","Viewing Distance":"20 Feet or Less","Object Shape":"Other","Log Number":"US-03052012-0012","Tags":"City","Country":"United States","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Berkeley","There were no other sightings in Berkeley on or around June 14th 1996","This sighting has been favorited 1 time.",""],"Longitude":"-122.283165","City":"Berkeley","Date Submitted":"03/05/2012 04:01 UTC","Case Number":"36266","files":["/var/www/straped/mufon/html2text/36266.html.txt","/var/www/straped/mufon/more/36266_submitter_file1__alieninBerkeley.jpg","/var/www/straped/mufon/more/36266_submitter_file1__alieninBerkeley.jpg.1","/var/www/straped/mufon/org/36266.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.874363,+-122.283165(36266)&iwloc=A&hl=en\"> mufon case (36266) map </A>"}