{"Longitude":"-157.982079","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Latitude":"21.319431","divs":["Sighting DetailsI was living in iriqoise point in Honolulu Hawaii. I came home late at night at around 3am. I went to my room upstairs and sat down on my bed. I had in my room a small radio but this was shut off. I began thinking about things until the event happened. I started hearing a radar in my head.It sounded like a radar from a sattelite or a navy ship.I then stood up and said 'Does anyone else hear that!'My sister was sleeping in her room and noone heard me, because everyone was asleep and my door was shut.I sat back down on my bed as the radar continued.I then looked to my right where my window was and saw very bright lights flashing from a u.f.o. extremely close to my window. It began flashing the colors red,yellow,blue,and green simultaniously.As i witnessed this i stood up on my feet and began to walk towards the window.It was then that there was no doubt in my heart and in my mind that this was a genuine u.f.o..I put my hand on the string to lift up the blinds but was sure that i would be traumatized severely if i lifted up those blinds, because of the fact that this u.f.o. was only 5 feet away from my window.I went back to my bed and sat down.The sound of the radar grew louder. I felt as though i was being challenged with this radar.I looked right at the u.f.o. and began to try very hard to make it bow down to me with telekinisis.This did nothing to the u.f.o.. The one who controlled this u.f.o. and this radar decided to end this attempt. Within 3.7 seconds of me trying to do this. the radar jumped extremely loud. I imediately covered my ears and began screaming out of pain from this sound as i fell on my back on the bed.All of these events, i swear to you happened and the attack lasted 8 seconds. The radar stoped and as soon as it stoped my little radio which was turned off came on.The u.f.o. then left.The song 'let's just kiss and say goodbye' the ub40 cover was playing and was this aliens message to me.After 12 seconds of hearing this song i ran to my sisters room across the hallway.I knocked on her door and told her what had happened.I was shaking and she did not believe me.I stayed downstairs after this and continued shaking the rest of the night.I could not go to sleep that night and will never be the same."],"Tags":"City","Summary":"i was attacked by the radar of a u.f.o.","map":"<A HREF = \"http://maps.google.com/maps?q=21.319431,+-157.982079(36268)&iwloc=A&hl=en\"> mufon case (36268) map </A>","Log Number":"US-03052012-0014","Disposition":"Unresolved","Date of the Event":"08/15/2005 03:12 UTC","Object Features":"Unknown","Case Number":"36268","Object Shape":"Flash","trends":["There have been 2 other sightings in Ewa Beach","There were no other sightings in Ewa Beach on or around August 15th 2005"],"Country":"United States","files":["/var/www/straped/mufon/html2text/36268.html.txt","/var/www/straped/mufon/org/36268.html"],"Region":"Hawaii","City":"Ewa Beach","Viewing Distance":"20 Feet or Less","Date Submitted":"03/05/2012 07:58 UTC","Source":"MUFON"}