{"Country":"United States","Disposition":"Unresolved","Longitude":"-76.075258","files":["/var/www/straped/mufon/html2text/36271.html.txt","/var/www/straped/mufon/org/36271.html"],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"03/05/2012 09:00 UTC","Latitude":"36.853158","Date of the Event":"03/05/2012 08:13 UTC","Case Number":"36271","Object Features":"Unknown","Tags":"City","Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=36.853158,+-76.075258(36271)&iwloc=A&hl=en\"> mufon case (36271) map </A>","Source":"MUFON","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around March 5th 2012"],"City":"Virginia Beach","Log Number":"US-03052012-0017","Summary":"Bright solid white light zipped extremely fast in odd pattern","Weather Factors":"Unknown","divs":["Sighting DetailsI was coming home from an SAT preperation class at cox highschool, and i wanted to take the long way home because i wanted to drive for a bit. I was driving down N. Lynnhaven road, and pulled into the St. nicholas church parking lot because i wanted to sit and look up at the stars (i have always been very interested in the astronomy.) I was watching the airliners and looking at the planet conjunction of Venus and Jupiter off to the west, (i believe it is venus and jupiter, dont quote me on that), anyways, planetary alignment to the west, i noticed out of the corner of my eye, maybe NE or NNE, a bright white light, and i thought, oh neat a shooting star, but as i turned my head, i saw it make strange movements. The object was right above the tree line from my POV, it shot up at an angle to the right, slightly less than 90 degrees, then made a sharp u-turn to the left, and it squiggled down below the tree line, where i lost sight of it, then it shot straight up back above the tree line, this time at an angle to the left, and dissipated in the night sky. The object was very small, the light was bright white light, sort of like an orb, i could tell it was solid, there is absolutely no chance it was a spotlight of any kind, i could tell by lookng at it, it was a solid object. Anyways, the orb had a glow around it, the same color and light intensity as the object itself, with what seemed to be a very short trail after it. For people that know how to measure degrees in the sky, the trail was about 1 degree in length behind it. it stayed that length throughout the whole sighting. Again i want to emphasize, it wasnt like a street light color, or a head light density, it looked like a solid, white, solid bright light. The whole sighting lasted less than three seconds, it was moving very very fast, with absolutely no noise, but do not eliminate the noise factor becasue i was a good distance away. As soon as i saw it, i pulled out my phone, and called my friend Daniel Murguia and left a frantic voice mail explaining what had happened, then called my other friend Brian, who also didnt answer. no message was left for him, then i called another friend, Rachel, i told her what i had just seen, as i was talking to her, i drove to where i thought the object may have been flying over, that was an elementary school in my neighborhood. I went to the soccer field, named brill field, and walked to the middle of the field, still on the phone, trying to see if i could get another glimpse of the UFO. Unfortunately none was seen. I drove home, told my parents, im sure they dont believe me, the friend brian does not believe me, and the friend Rachel, i could tell by her voice and attitude, was skeptical. Though the first contact, Daniel Murguia, said he got chills when he listened to the voice mail i had left him. I hope my information was satisfactory, i surely hope to hear from whomever reads this soon. Thank you."],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Object Shape":"Circle, Sphere"}