{"Tags":"City","Region":"Indiana","divs":["Sighting DetailsMy daughter Heather 31 yrs. friend Laura (an abductee) myself fifty five, mother of four, grandma of four,(possible abductee) were sky-watching at the dark cemetary only three blocks south of my home in Amo. All were tired and saw the yellow bright globular object as we had given up to leave. (I have seen a number of them since I was 7yrs. old and have many ufo dreams.) At first it seemed fixed, but we stayed with it thinking it a planet and were rewarded with a real freak show. Talking outloud to one another as we watched we described to one another what exactly we saw and all agreed as to movement and direction although my dau. Heather could not see the little white lights and I admit you really had to be patient and very still to see one as they were quite quickly launched and disappears within a second. Laura finally fell asleep on the warm tarmac and my cat wanted to return home(no reaction on cat's part) but it was (the object) not directly overhead, instead could have been easily over Plainfield or even Indianapolis. Movement was slow and it would glide, hop and stairstep up or down and seemed to respond to our attention as silly as that sounds. We were very happy to see this and all felt it was probably a mother ship dispensing smaller scout ships but who can know really. could be fairies or russians for all we can prove. Sky was very clear and object was well above tree line and one airplane obviously was much higher up and also its tragectory was not an arc as in satellites or diagonal as in the Indpls. air traffic but isolated in a small area and although it did many tricks it still stayed within its self-designated area. Have been trying to form group here or join others but having trouble. People don't always show up. the local MUFON meetings were the best and I need to be on your list for future meetings. More to tell but that's all I have time for. I got what may be a message from them as I was falling asleep. Only 3 words, \"Are you Ready?\" I said yes."],"files":["/var/www/straped/mufon/html2text/3627.html.txt","/var/www/straped/mufon/org/3627.html"],"Longitude":"-85.598144","Weather Factors":"Unknown","trends":[],"Object Features":"Other","Summary":"3 people watching at cemetary see one BOL yellow in east approx. 30 degrees, object manuevers horizontically, vertically, Bobbles, loop-de-loop twice and emitting tiny white lights very faint from bottom at random. Very playful. We had all talked them dow","Disposition":"Insufficient Data","Latitude":"40.560206","Log Number":"US-07262005-0002","Object Flight Path":"Path with directional change","Object Shape":"Sphere","Date of the Event":"07/23/2005 11:45 UTC","Case Number":"3627","Country":"United States","Viewing Distance":"Over One Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.560206,+-85.598144(3627)&iwloc=A&hl=en\"> mufon case (3627) map </A>","Date Submitted":"07/23/2005 11:45 UTC","City":"Undisclosed","Sighting Duration":"Undisclosed"}