{"City":"Balch Springs","files":["/var/www/straped/mufon/html2text/36275.html.txt","/var/www/straped/mufon/org/36275.html"],"Object Flight Path":"Undisclosed","Latitude":"32.713008","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=32.713008,+-96.610088(36275)&iwloc=A&hl=en\"> mufon case (36275) map </A>","Source":"MUFON","Case Number":"36275","Viewing Distance":"20 Feet or Less","Tags":"City","Sighting Duration":"Undisclosed","Region":"Texas","trends":["There has been one other sighting in Balch Springs","There were no other sightings in Balch Springs on or around August 25th 1974"],"Weather Factors":"Unknown","Log Number":"US-03052012-0021","Date of the Event":"08/25/1974 07:10 UTC","Object Shape":"Disc, Oval","Country":"United States","divs":["Sighting Detailsit was 1974 i was 7 years old in balch springs, tx. i was playing in my backyard around dusk 630 to 700pm when it was close to getting dark.all i remember is that i noticed all of a sudden my surroundings became quieter, real still all of a sudden and i felt like iu was being watched. i remember sitting on the ground playin when i noticed this strange quiet feeling and it made me look up, and there on the lawen, about 10 to 15 feet from me was this saucer shaped ship with red green yellow and blue lightsin a line on the middle of it the ship itself was a grey colored but shiny gray....and it was just sitting there watching me, i did not know what ufos were so i didnt understand what i was seeing and i dont remember what i did upon seeing it, but i know i didnt go run screaming about it, but i have no memory about what happenend after i seen it.i felt calm, like it was normal seeing it, and then in 1989, i saw a book about ufos, and finally learned what they were, and knew that that was what i had seen all those years ago as a child. ive always wondered what happened to me when i seen it in my yard, if anything did, because i dont have any memory of going into my house or anything afterwards.but i know for a fact that they exist because i seen one when i didnt even realize what i was seeing, and i know our universe is too vast for higher evolved beings not to exist.....i wish they would make contact with us, but we are like children ,primitive in our ways,very unevolved.so they probably wont because of our war-like ways. it is the mark of a primitive society to call itself not primitive. but advanced technology without advanced thought is not advancement at all, but demise."],"Date Submitted":"03/05/2012 11:21 UTC","Summary":"I Was just a child did not know what ufos were.","Longitude":"-96.610088","Object Features":"Dome, Window(s)"}