{"Longitude":"-70.974795","Date Submitted":"03/05/2012 11:59 UTC","Weather Factors":"Unknown","Object Shape":"Disc","Date of the Event":"01/29/2012 05:30 UTC","Viewing Distance":"Unknown","Summary":"I saw a black object proceeding east. As it got closer, it seemed to flip and was obviously a large, black disk. It passed overhead, veering slightly to the southeast.","divs":["sighting detailsi was standing at the kitchen window, peeling potatoes in the sink. the window faces west. the sky was clear and the sun had begun to set. nobody else was in the house. i noticed a small black object on the western horizon (the view from this window is about 3\\4 mile, across undeveloped land and marshland). i looked down to watch what i was doing, then looked back out the window and was astonished to see the object was moving straight towards the house, at an elevation i cannot estimate, but i could clearly see that the object was a black disk, with no visible features, and it was quite large. it did once turn over - which really startled me. it continued overhead, moving then southeasterly. i heard no noise, but i was indoors. my impression is that from the moment i first saw the object until it passed overhead, its altitude lowered. i did not go to the east side of my home to watch further, as guests were due to dinner and i was busy. our location is semi-rural, near the little river on the westerly side of our farm, and buzzards bay lies to the east of smith neck road. the area has much property in conservation or preservation. in the past several years, from time to time after nightfall, 2 or 3 small yellowish lights on the western horizon. we do not know what they are. they appear to hover for a time, then move a little. we've thought they must be helicopters - but we could see only the lights the objects made. we could hear no sound from them, and we can only estimate their distance from our house at perhaps 2 miles. they were at low altitudes. sometimes they were in view for most of an hour. i have not looked for those recently."],"files":["/var/www/straped/mufon/html2text/36276.html.txt","/var/www/straped/mufon/org/36276.html"],"Tags":"City","Log Number":"US-03052012-0022","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"36276","Latitude":"41.562406","City":"Dartmouth","Source":"MUFON","Object Features":"None","Region":"Massachusetts","Disposition":"Unresolved","Country":"United States","trends":["There has been one other sighting in Dartmouth","There were no other sightings in Dartmouth on or around January 29th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.562406,+-70.974795(36276)&iwloc=A&hl=en\"> mufon case (36276) map </A>","Sighting Duration":"00:06:00"}