{"map":"<A HREF = \"http://maps.google.com/maps?q=40.221844,+-74.911979(36285)&iwloc=A&hl=en\"> mufon case (36285) map </A>","City":"Newtown","Log Number":"US-03062012-0009","Disposition":"Unresolved","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI live in Yardley, PA. I live under a flight path and have been a smoker for years. I'm used to going outside at night smoking and looking at the planes flying over head. Last night I was facing in a West, South West direction and an unusually bright light for a star caught my attention. I don't know what made me keep watching, but at first it was hovering not moving, you would have mistaken it for a star, almost like it was trying to act like a star. Then it started moving up and down, left and right, diagonally. I'm used to seeing planes at night, and that behaved like no plane I've ever seen. My estimation was it flew around 5-10,000 ft. It appeared like it was hovering just out of the way of the flight path and to me it seemed to e observing the planes flying. It was cold, slightly windy that night but clear it was still dark but when I saw these crazy movements it was almost like watching a bouncy ball in the air the way it moved, it appeared to be trailing or releasing smoke, but silhouetted against a clear black sky, I could only make the smoke out when the objects light pulsated brighter. I feel I saw that smoke, but that is the one part of what I saw that I'm not 100% on. Also twice I watched planes come in near my house and this object. The planes had only strobes on, then when it looked like they got danger close to the object, they turned their bright lights on, crash lights what ever they are called. If you dig a little in flight records from Philly international, or Trenton Mercer airport, you may find something out. Those airplanes would have seen it better then me on the ground. I'm not an expert, or a crazy person. What made me write this was I've never seen anything in the sky move like that in my life. I dont want to say I saw a UFO, but if it wasnt, I've never seen any plane or helicopter move that way at night."],"trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around March 5th 2012"],"Date of the Event":"03/05/2012 10:06 UTC","Country":"United States","Date Submitted":"03/06/2012 10:25 UTC","Case Number":"36285","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Region":"Pennsylvania","Tags":"City","Object Features":"Unknown","Weather Factors":"Unknown","Object Shape":"Sphere","Summary":"Orb like. Pulsating color. Would dim as well.","Longitude":"-74.911979","Source":"MUFON","Latitude":"40.221844","files":["/var/www/straped/mufon/html2text/36285.html.txt","/var/www/straped/mufon/org/36285.html"],"Viewing Distance":"Over One Mile"}