{"Case Number":"36282","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.061664,+-74.404461(36282)&iwloc=A&hl=en\"> mufon case (36282) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Log Number":"US-03062012-0006","Viewing Distance":"Unknown","Date of the Event":"03/05/2012 12:00 UTC","Longitude":"-74.404461","Date Submitted":"03/06/2012 09:55 UTC","Object Shape":"Bullet, Missile, Fireball","Summary":"Very Large Blue White Fireball in WSW sky in Morris County NJ","divs":["sighting detailsi was walking with a companion around park lake\\fox's pond at the border of rockaway borough and rockaway township. i had started my walk at 7:40 pm and it was my second lap around the lake, so it was about 8 to 8:10 pm. i was talking to my friend when the sky behind her head brightened. a huge bluish white fireball descended in the wsw sky. it was shaped like a comet. it's tail was quite thick and not very long. it had a rippling very bright appearance like melting metal. it descended slightly slower than a meteor and was far larger than any meteor i have ever seen and i have seen many because i purposely go out to view meteor showers when they are predicted. typically meteors i have seen have been far smaller, faster and have had longer streaks behind. i was so startled that i pointed and yelled but my friend did not know what was wrong and did not see the object. it was much larger than jupiter and the other planet nearby (venus?). it descended behind the trees and small hill. i expected the ground to shake when it hit the ground but it did not. it crossed my mind that it could have been a satellite falling to earth, a spherical aircraft of some sort or an asteroid. immediately after i had fear that it would have crashed and destroyed part of dover\\rockaway township. afterwards i felt excited and somewhat privileged to have seen something so awesome. but i wondered if anyone else saw it and if it set anything on fire and if there would be anything found from it."],"Source":"MUFON","Disposition":"Unresolved","Latitude":"40.061664","Country":"United States","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/36282.html.txt","/var/www/straped/mufon/org/36282.html"],"Region":"New Jersey","City":"Rockaway Township/Rockawa","trends":["there have been no other sightings in rockaway township\\rockawa","This sighting has been favorited 1 time."]}