{"City":"Muscle Shoals","files":["/var/www/straped/mufon/html2text/36287.html.txt","/var/www/straped/mufon/more/36287_submitter_file1__UFO2.jpg","/var/www/straped/mufon/org/36287.html"],"Latitude":"34.772943","Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=34.772943,+-87.603674(36287)&iwloc=A&hl=en\"> mufon case (36287) map </A>","divs":["Sighting DetailsJust came on duty, security for Wise Alloys. still dark. Work gate by myself. plant is out in the country. eating some mcdonalds standing outside guard shack and noticed off in the distance over a stretch of pasture what looked at first to be a helicopter slowly traversing field. about a mile away or less. watched it for a min or two as it came closer to plant. realized that I did not hear any rotor noise. looked closer as it came toward new conctruction( new smelter building) it dissapeared behind building for a min then came right over the top and it was then I realized that I had no Idea what it was. took out my cell phone and tried to get camara on, my hands where shaking pretty bad. got it on looked up and it was almost directly over me at I would guess about fifty feet. I took a couple of shots as it began to asscend. it got up pretty high Im not sure maybe a thousand feet and then it just vanished. after the fact I remembered that it did not make noise but it did vibrate my chest and head. very strange feeling and hard to explain. it had three distinct lights on the underside that changed in intensity as it took off... very blue and slightly violet. no heat. the top side was very dark and I could not see any detail. not a saucer sape but a circle cut in half. flat side down. no lights on top. My air force buddy tried to tell me its one of ours but he is wrong. I am familiar with most aircraft and this was not one of ours."],"Source":"MUFON","Country":"United States","Weather Factors":"Unknown","trends":["There have been no other sightings in Muscle Shoals","This sighting has never been favorited."],"Tags":"City","Summary":"Half orb, three brilliant blue lights on bottom, came accross field seemed to search then stopped over me. began to accend and then poof, gone. scared the hell out of me.","Object Features":"Dome, Other","Object Shape":"Sphere","Case Number":"36287","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date of the Event":"01/02/2012 12:00 UTC","Log Number":"US-03062012-0008","Sighting Duration":"Undisclosed","Longitude":"-87.603674","Viewing Distance":"101-500 Feet","Date Submitted":"03/06/2012 12:37 UTC"}