{"Object Features":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/3629.html.txt","/var/www/straped/mufon/org/3629.html"],"Log Number":"US-07272005-0002","Object Flight Path":"Straight-line path","trends":["There have been 39 other sightings in Burbank","There were no other sightings in Burbank on or around July 26th 2005"],"Source":"MUFON","Viewing Distance":"Unknown","Case Number":"3629","Tags":"City","Region":"California","Longitude":"-118.306496","divs":["Sighting DetailsAt approximately 9:25pm, I went out to the garage to put some laundry in. I noticed that there were two still spotlights aiming up into the sky from the direction of the Bob Hope Airport. The spotlights were both aiming SOUTH. Shortly after this, I noticed the sound of an approaching jet. Thinking that perhaps a plane was going to have to make an emergency landing or something like that, I stood in the yard scanning the sky for the plane. The sound continued for a while until suddenly I noticed, more or less directly overhead (and heading SOUTH (in other words, moving in the direction of the spotlights (AWAY from the airport))), 3 reddish flashing lights in a triangular pattern. The lights moved together indicating either three separate planes moving in formation or... one MASSIVE triangular craft extremely high in the sky. The object moved VERY slowly, accompanied by that same jet sound. I called for my wife to come out and we both watched it slowly move away. Seconds later, the spotlights from the airport moved together, then farther apart, then back to where they were. A couple minutes later, helicopters appeared overhead (3 or 4 of them) and then 10-15 minutes after that, the spotlights began to move back and forth across the sky. The spotlights remained until about 10:05pm when they switched off and now everything is quiet and back to normal."],"City":"Burbank","Summary":"Unusual craft (or crafts) seen over Burbank","Sighting Duration":"00:45:00","Object Shape":"Boomerang, Triangle","Weather Factors":"Unknown","Date of the Event":"07/26/2005 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.185519,+-118.306496(3629)&iwloc=A&hl=en\"> mufon case (3629) map </A>","Disposition":"IFO","Date Submitted":"07/26/2005 09:30 UTC","Latitude":"34.185519"}