{"Longitude":"-83.047987","Log Number":"US-03062012-0015","Case Number":"36294","divs":["Sighting DetailsOn Saturday March 2nd at aproximately 7:20PM I was returning home and saw moving glowing lights in the sky. There was a low cloudcover. The weather was unsettled. It was very dark and I first saw the light in my peripheral vision while driving behind my vehicles high beams out my drivers side window. The 4 lights appeared to be just at cloud level. I first thought they might be ground reflections from a EMS or police vehicle, because of the weather and the rotation. Their rotation was parallel to the ground though the unit moved to the NE This was in a very rural area. There were 4 lights and they appeared glowing at the base of the clouds near Airline Goldmine Rd and US 29 in Hart County, GA. They were organized in the cardinal points of the compass or at 12,3 6 and 9 o'clock on a watch face from my perspective. They rotated CCW 180 degres and paused, moved to the centerpoint and merged. There was a slight pause as they merged as one, though there was no increase in intensity of the 4 merged lights. They instantly separated into 4 individual lights again and moved back to the exact positions. Each cycle was aproximately 5 seconds. There was no deviation of this cycle or the intensity of the lights. It was steady and exact. Their cyclic pattern was intentional, mathematical, purposeful. Or at least that is what I read into my own observations. They moved gradually to the NE, but would remain stationary at times. As I moved, attempting to get better views, it was almost as if the lights remained a constant distance from me. I followed them and they remained in view nearly continually for a period of over 20 minutes. Holding my arm out, the 4 lights perimeter of rotation was about as large as a dinner plate. There was no noise or sudden movement (short of the steady cycle) the entire time I observed them. They seemed to stay over woods, pasture and farmland as I attempted to figure out what they were. My actions were intional and based on curiousity. After 20 minutes of watching with no change whatsoever and the fact I was not able to change my perspective or effect any change I simply went home."],"City":"Canon","Country":"United States","trends":["There have been no other sightings in Canon","This sighting has never been favorited."],"Summary":"4 rotatating(CCW), merging lights.","Date of the Event":"03/02/2012 07:20 UTC","files":["/var/www/straped/mufon/html2text/36294.html.txt","/var/www/straped/mufon/org/36294.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.313802,+-83.047987(36294)&iwloc=A&hl=en\"> mufon case (36294) map </A>","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"34.313802","Sighting Duration":"Undisclosed","Region":"Georgia","Object Shape":"Sphere","Object Flight Path":"Path then hovering","Tags":"City","Date Submitted":"03/06/2012 09:04 UTC","Disposition":"Unresolved","Source":"MUFON"}