{"Object Features":"None","Latitude":"42.940156","map":"<A HREF = \"http://maps.google.com/maps?q=42.940156,+-74.181006(36292)&iwloc=A&hl=en\"> mufon case (36292) map </A>","Summary":"Large Green Rectangular Object Hovering Then Rapid Descent","Log Number":"US-03062012-0013","Disposition":"Unresolved","City":"Amsterdam","divs":["sighting details1950hrs on march 5, 2012, while driving in my automobile on the crest of a hill, i noticed a rectangular green object moving horizontally within the southwest hemisphere over amsterdam, new york. the object appeared to be a rectangular shaped object similar to that of a street sign or green glow stick. i initially thought three things; reflection on my windshield, reflection of a street light, or a helicopter or airplane\\jet. as i watched the object race across the sky it immediately dived vertically towards the ground at an immense rate of descent. i thought that this might unfortunately be an aircraft in distress, but upon further driving, there was no sign or fire or downed power lines in it's path of motion. it was a steady green streak of light, similar to that of a green colored skittle bag. the object simply disappeared as if someone had turn a switch off. after serving in the air force for almost 22 years, i have found this sighting the most frightening and unexplainable that i have ever encountered. ironically, 4 other people had seen the same object at the same time (including a 3 year old boy and his mother), and as i questioned them, they on their own will told of the same time of occurrence in the same vicinity."],"Region":"New York","Country":"United States","Tags":"City","Object Flight Path":"Path with directional change","Date of the Event":"03/05/2012 07:50 UTC","Date Submitted":"03/06/2012 04:29 UTC","Longitude":"-74.181006","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Amsterdam","There were no other sightings in Amsterdam on or around March 5th 2012"],"Object Shape":"Cigar, Square, Rectagular","Case Number":"36292","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36292.html.txt","/var/www/straped/mufon/org/36292.html"]}