{"Longitude":"-118.586426","Log Number":"US-03072012-0001","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36296.html.txt","/var/www/straped/mufon/org/36296.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Triangle, Unknown","Source":"MUFON","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.265553,+-118.586426(36296)&iwloc=A&hl=en\"> mufon case (36296) map </A>","Latitude":"34.265553","Weather Factors":"Unknown","divs":["Sighting DetailsI was in my back yard with my dog waiting for him to go to the bathroom. I looked up to look at the stars. At first glance I thought it was an airplane flying extremely high. It was approaching a star so I could see that it was moving, then I noticed the flashing lights that I thought were wing lights on a plane. The object then slowed to a stop, stayed there for a few seconds then continued north for a few seconds, then it changed direction as if it had bounced off of something, moved south east for a couple of seconds slowly changed direction again back towards north west. It continued starting and stopping making slight changes of direction while slowly making its way north. At one point it was almost directly overhead. During this time a few planes passed trough the same airspace, it was more than obvious this was not a plane. The types of flashes on the planes were completely different and the planes had what looked like green and red lights and white lights that also did not flash. This object had one orange light on one \"corner\" on the other two \"corners\" it had flashing strobe type lights that seemed to fire off in 3 bursts at a time per light. From the bottom it appeared to be a triangular shaped object, but since it was dark out and the object was dark with no ambient light seeming to hit it or reflect off of it, it was difficult to be sure of the shape. It appeared to pass through a cloud, which was the first time I had any perception of how far it was, as it passed through the cloud, it changed direction to almost completely westward and picked up speed pertty rapidly, then just as suddenly slowed back down. I lost sight of it as it headed west and went behing a tree line. I tried to record it on my phone but I don't think anything came out, it was too small and or far away."],"Region":"California","Object Features":"Undisclosed","Date of the Event":"03/06/2012 07:05 UTC","Disposition":"Unresolved","City":"Los Angeles","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around March 6th 2012"],"Summary":"At first glance I thought it was an airplane flying extremely high.","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"36296","Date Submitted":"03/07/2012 12:27 UTC"}