{"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=46.093572,+-122.928684(36305)&iwloc=A&hl=en\"> mufon case (36305) map </A>","Object Features":"Unknown","Date of the Event":"08/23/1949 10:00 UTC","Object Shape":"Disc","Country":"United States","Case Number":"36305","Disposition":"Unresolved","Weather Factors":"Unknown","Region":"Oregon","Summary":"Large disc with a round though somewhat oval opening in bottom that was hazy or foggy","Latitude":"46.093572","divs":["Sighting DetailsIn late August of 1949 I and another boy (we are both alive, cognitive and active) were abducted and taken aboard a disc like craft where I (I cannot say the same happened to the other man) was examined and an unknown type of medical procedure was performed on both my mind and body. The abduction took place in a rural area approximately 8-miles south of the town of Rainier Oregon at 10 pm in the evening while the two of us were walking along a country road that led towards Mayger Oregon. However, our being taken was not remembered other than as a fragmented event until 1987 when the two of us again met up at a wake being held for my mother. Upon seeing me across the room the other man simply stated, \"Do you remember when we lit up\"? That is when we were first able to talk about our being taken with others. More of the event was learned in 2007 when I was hypnotically regressed by a therapist for PTSD and the event was what came to mind and not any event during the Vietnam War. Since then the other man has told me that when our bodies lit up with a white light that covered us from head to tow but not other nearby objects he said that he was able to see my entire skeleton and it scared the hell out of him. After we were released I did see a large fan type structure that glowed with a blue light which was similar in intensity and hue to the shaft of light that was used to bring the two of us up into the ship."],"Log Number":"US-03072012-0010","Date Submitted":"03/07/2012 12:18 UTC","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-122.928684","trends":["There have been 2 other sightings in Rainier","There were no other sightings in Rainier on or around August 23rd 1949"],"Viewing Distance":"20 Feet or Less, 101-500 Feet","Source":"MUFON","City":"Rainier","files":["/var/www/straped/mufon/html2text/36305.html.txt","/var/www/straped/mufon/org/36305.html"]}