{"Country":"United States","Object Features":"None","Sighting Duration":"Undisclosed","City":"Chicago Park","Case Number":"36318","Object Shape":"Cigar, Oval","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsWe were riding our motorcycle this afternoon between Colfax, CA and Chicago Park on Hwy 174 -- in Northern California. We were just cruising, (I was on the back) and was watching a normal plane off in the distance in my left field of vision as we were riding along when I noticed an object in the sky coming into my field of vision from my left - there was also a white small passenger plane coming in from the right - to gauge the height at which the object was flying, it moving just below this planes altitude. I followed it with my eyes glued, trying to process through what I couldn't seem to make out -- was it a helicopter, bird or plane perhaps? No. The shape was cigar-like, pill-like but more cylindrical. Matte finish, dark in color. No windows, no markings, no nothing, absolutely plain. No trails, no lights no sign of propulsion at all. Just this basic shape. At this point, I had told my boyfriend \"I think I am seeing a UFO right now\" -- he pulled over, and we both stopped to watch it intently. At this point it was hovering in the same spot as I was pointing up to it. It was still hovering than changed directions in place, (whether it changed shapes or directions, I cannot explain) it was unlike any other movement I have ever seen in a man-made aerospace craft. Totally bizarre. Once it had changed direction (while still hovering in place mind you) it continued forward on it's new path which was to the west, all of which was at the same altitude the entire time, on the same horizontal plane. It didn't follow any type of event horizon but went perfectly straight until it was out of sight all together. Both of the other two planes I had seen were still in the picture. This UFO must have been going so fast, it seemed like it could have gone so much faster if it wanted to. But it appeared to move much slower than it actually was, definitely. I'm sure of that. Wondering if anyone else saw this?"],"Summary":"Matte Dark Cigar/Oval Changed Direction In Place While Hovering Pointed It Out, Then It Proceeded With New Path Straight Until No Longer Visible","Source":"MUFON","Disposition":"Unresolved","trends":["There have been no other sightings in Chicago Park","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/36318.html.txt","/var/www/straped/mufon/org/36318.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.145003,+-120.967044(36318)&iwloc=A&hl=en\"> mufon case (36318) map </A>","Region":"California","Date Submitted":"03/07/2012 11:54 UTC","Longitude":"-120.967044","Log Number":"US-03072012-0020","Date of the Event":"03/07/2012 01:00 UTC","Latitude":"39.145003","Viewing Distance":"Unknown","Tags":"City"}