{"Case Number":"36314","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/36314.html.txt","/var/www/straped/mufon/org/36314.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.595944,+-93.957755(36314)&iwloc=A&hl=en\"> mufon case (36314) map </A>","Date Submitted":"03/07/2012 10:36 UTC","Tags":"City","divs":["Sighting DetailsI have been observing UFO and UFO activity every since one landed in my backyard on July of 1972 just before I started 12th grade in high school. Last night was simular to that in some aspects except they did not land as far as know. The first time I ever saw a ufo it landed in the field behind our house. We lived in a lonely location so much so that if a car was comming our way we knew they were comming to see us or they were lost. My father who goes to bed early just about night had gotten up for some reason, bathroom break or something. He spotted the UFO out the window of his beadroom. He screamed for us to get out of bed, that we had to leave imediatelly with out bothering to get dressed or anything he ran out the door and started the car. My father was not a loud person, he was mostly in his home life soft spoken and did not get upset all that much. But that night he was screamming at the top of his lungs shocking all of us in the house. As we left the yard and headed up the hill I looked toward the back of the house and in the field behind the house a large football shaped object sat. IT was bright and glowing in a orange color. A person could see trees lighted behind it and bushes and the ground in front of the object was lighted up. At the time I saw it, it was not moving. My father drove us and the car into the nearest town shouting at the top of his lungs there was a UF0 in the backyard and he wanted to leave before they abducted us. My father was a minister and well educated, eaning his master degree in Greek and Hebrew a few months before. My dog, a german shepherd would not come out from under of the house for three days it took us forever it seemed like to calm our horse Penny, and she was not an excitable horse. When we finally returned home the UFO had left. last night I went outside to take my dog for a walk, I looked up scanning the horizon which I do escpecially on a clear cloudless night. It was then I screamed. As I was looking up I observed 10 UFOS hanging in the sky over my head. They were, all except one, in a diamond pattern. For ease of discription I will describe it like a baseball diamond giving the positions in those terms if thats alright. The two largest objectss were at second base and home plate. There were 7 smaller but they were like the larger objects white in color. These craft spread out from third base past the pitchers mound all the way over to first base. The diamond shaped formation as far as I know was stationary. they were with the larger crafts in a north south position with smaller craft from left to right. The local UFO that i have mentioned in previous reports in the last few days was positioned in the east next to the moon. The others were west of the moon and east of the horizion. i have lived in this area since 1991 and have never before have seen anyting like what I saw last night and I have observed many differnet craft but had never seen anything like that. The two larger objects appeared to be firing white beams of lights at each other, and one was hit they became brighter in color. The smaller craft ranged accross the middle seemed too reflect the light toward the other craft. I am not sure what the purpose for the smaller craft were to tell you the truth. I went into the house trying to get my husband to go and look but he had already seen it. I have never been so scared in my life. I dont know why they were fighting (theyve been fighting all week on and off) but I had never seen anyting this aggressive out of either of the objects. I dont know long to tell you the truth this had been going or how much longer it lasted. We got up this morning to a cloudy sky so you could not see this formation anymore. I tried to report this sighting last night. i could not. My computer refused to come as if it had no power even though I knew it did. I have an older computer that I finially got to come on but the statlite dish internet was down, my phone did not work and the police scanner was all messed up. It was though the UFOs were jamming every thing so i could not report this sighting and they were determined to do it. It was later on this morning before my computer was finially back to normal, thankfully there was no permanent damage to anything. I was glad because i do not have the money to replace any of it. It looked like there was a trail of gas between the objects but it might have been my imagination."],"Summary":"speres and chevron","Latitude":"36.595944","Object Shape":"Chevron, Sphere","Sighting Duration":"12:28:28","Object Flight Path":"Stationary","trends":["There have been 3 other sightings in Washburn","There were no other sightings in Washburn on or around March 6th 2012"],"Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-03072012-0016","Longitude":"-93.957755","Region":"Missouri","Disposition":"Unresolved","Date of the Event":"03/06/2012 10:30 UTC","City":"Washburn"}