{"Longitude":"-97.407928","Summary":"Dandelion shaped UFO. Glows blueish-green from center.","files":["/var/www/straped/mufon/html2text/36322.html.txt","/var/www/straped/mufon/org/36322.html"],"Region":"North Carolina","Viewing Distance":"101-500 Feet","Log Number":"US-03082012-0004","Date of the Event":"04/05/2011 01:00 UTC","trends":["There have been 31 other sightings in Winston-Salem","There were 2 other sightings in Winston-Salem on or around April 5th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","City":"Winston-Salem","Disposition":"Unresolved","divs":["Sighting DetailsI was driving from Indiana to Durham, North Carolina. I have made that trip a hundred times with nothing unusual happening. I always go through this area about the same time when I make this trip. All I remember before the incident is that I was driving. THe next thing I know, I look over to my right and I say to myself, 'mmmph, I just saw a UFO'. I say it in a matter of fact way and I just go on driving like nothing happened. For some reason I reach for my cell phone and send my brother a message stating that I just saw a UFO. I seem to forget the whole thing. I arrive at the motel and I look at my watch and I think, 'Wow, it's 3 o'clock in the morning?'. I think, 'Boy, it took me alot longer to get here than I thought it would. I check in and go to bed. I get up the next morning go to work. I work for a couple of hours and my brother calls and askes me what I saw. For a minute or two, I don't know what he is talking about. I forgot the whole thing! After he ask me that question, it all came back to me! I can't believe I forgot about the UFO! I have always wanted to see one. I finally see one and I forget about it? That doesn't seem right to me. I am attaching a copy of a drawing that I made after talking to my brother that morning after the sighting. Also, after that sighting, I have made several changes to my life that I never thought of doing prior to this. Thank you for your time. Feel free to contact me if you wish. Thank you. Warren"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.434369,+-97.407928(36322)&iwloc=A&hl=en\"> mufon case (36322) map </A>","Sighting Duration":"00:02:00","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Sphere","Country":"United States","Case Number":"36322","Object Features":"Patterned Surface","Tags":"City","Date Submitted":"03/08/2012 10:55 UTC","Latitude":"35.434369"}