{"Source":"MUFON","trends":["There have been no other sightings in Cotopaxi","This sighting has been favorited 1 time."],"Object Shape":"Star-like","Case Number":"36336","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.340728,+-105.481561(36336)&iwloc=A&hl=en\"> mufon case (36336) map </A>","Latitude":"38.340728","divs":["Sighting DetailsAt around 9:00pm I take the dogs out before going to bed. With the dogs, we had stepted off the back deck so they could do their thing. I always look at the stars to see what formations are there and in what part of the sky. I was standing where I could barely see the orion belt when I thought I saw a flash, but it was behind a tree so I moved back in the yard and onto the deck and looked in that area again. I first saw a faint light but it sudenly got bright and then went out. It then came back on very bright and then shot a beam of light. Nothing happened so it shot another beam of white light that opened some kind of a riff like you would see in a syfi movie. It then moved rapidly into the riff (hole in the sky) whatever and dissapeared as the riff closed. I just stood there frozen wondering if it was coming back. It did not as I waited for another 10 minutes, so I called the dogs and went into the house.I did not tell my wife for over a month but I have really been watching the skys since then and have not seen it or anything up there. It has really bothered me as to what it was and where it whent? Is it something of ours or is it something from some where else? I was too far away to be heard if it made any noise"],"Object Features":"Unknown","Sighting Duration":"00:05:00","City":"Cotopaxi","Object Flight Path":"Stationary","Date Submitted":"03/08/2012 08:51 UTC","Log Number":"US-03082012-0018","Region":"Colorado","Weather Factors":"Unknown","Date of the Event":"10/20/2011 09:15 UTC","Viewing Distance":"Over One Mile","Summary":"Blinked on and off, shot a beem that opened a riff and disapeared into it.","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36336.html.txt","/var/www/straped/mufon/org/36336.html"],"Longitude":"-105.481561"}