{"map":"<A HREF = \"http://maps.google.com/maps?q=45.983501,+-84.295208(36338)&iwloc=A&hl=en\"> mufon case (36338) map </A>","Longitude":"-84.295208","Object Shape":"Circle, Disc","Latitude":"45.983501","Region":"Michigan","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Country":"United States","Tags":"City","Object Features":"None","files":["/var/www/straped/mufon/html2text/36338.html.txt","/var/www/straped/mufon/org/36338.html"],"divs":["Sighting DetailsI went outdoors to smoke a ciggarette. As I looked towards the northeastern skys I noticed a small but brilliant light headed at high speads towards the horizon. At roughly 70deg the object made a high speed maneuver towards north. At first, I thought perhaps the object may have been a day-time falling star, untill it changed direction. Then I thought perhaps it was a neighbor with an R.C. plane, untill it went through a high altitude cloud. As it dove, it went from glowing bright- yellowish orange, to a reflective silver color. No sound was heard. The color change is what initially shocked me. Then to see the object pass through high altitude clouds... Roughly three seconds later, as I stared in a mild state of excitment and shock, the object reapeared through the clouds, hung for but a moment, this time appearing in a much more uniforn blackish-gray circular shape, seeming much further away, then, within a fraction of a second, the object withered into the distance of the sky, around the bank of clouds from which it had previously broke."],"Case Number":"36338","Disposition":"Unresolved","trends":["There have been no other sightings in clark lake","This sighting has never been favorited."],"Sighting Duration":"00:02:00","Date Submitted":"03/08/2012 11:15 UTC","City":"clark lake","Summary":"downward at high speeds, then to change direction into distance.","Date of the Event":"03/08/2012 06:30 UTC","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Log Number":"US-03082012-0018"}