{"Date Submitted":"03/08/2012 09:46 UTC","Object Features":"Unknown","trends":["There have been 8 other sightings in Coatesville","There were no other sightings in Coatesville on or around June 3rd 1983"],"Sighting Duration":"Undisclosed","Longitude":"-75.829492","Case Number":"36337","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.982191,+-75.829492(36337)&iwloc=A&hl=en\"> mufon case (36337) map </A>","Object Shape":"Boomerang, Triangle","Summary":"there was 6 of us on a hill one looked up and said, What the hell is that? there were at least 6 at 2 different levels","Disposition":"Unresolved","divs":["Sighting Detailsme and 5 friends were on a hill, on looked up at said what the hell is that? we couldn't beleive what we were seeing, everyone sort of freaked out then as quick as we got excited they calmed down and said it was probably just birds, not me, They weren't birds, or planes, i was into planes back then and now im a pilot, they weren't planes back then and im positive they weren't now. The strange part is other people seen them to and reported it to the paper, it as titled UFO.s over Lukens, lukens being the steel mill about where we were. they seemed to have been flying circles overhead and i could see more of them above. If you GOOGLE ufos over lukens you might be able to dig up something. the reason im reporting this now is because watching the History channel about ufo's and MUFON one of the drawings of ufo's someone reported was exactly what I seen back in 1983 it was boomerang shaped with several black circles underneath. Thank you. P.S. Stephen Hawkings said a little while ago, we better leave them alone, the general opinion of the scientific community is we know there there. GM"],"Country":"United States","Region":"Pennsylvania","Tags":"City","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/36337.html.txt","/var/www/straped/mufon/org/36337.html"],"Date of the Event":"06/03/1983 12:00 UTC","Log Number":"US-03082012-0019","City":"Coatesville","Latitude":"39.982191"}