{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36354.html.txt","/var/www/straped/mufon/org/36354.html"],"Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Summary":"large hovering craft above the pond soundEd like millions of crickets","Date of the Event":"08/01/1973 11:15 UTC","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Latitude":"42.928698","trends":["There have been no other sightings in Sandown","This sighting has never been favorited."],"Object Features":"Dome, Patterned Surface","Source":"MUFON","Object Shape":"Oval, Saturn-like","Longitude":"-71.187005","divs":["Sighting DetailsHello All. The Event happened around Last week July first week in August 1973. My family was at a camp ground.Angle Pond Grove. where we camped seasonally for many years, I was 13 going on 14. It was a week night either Wednesday or Tuesday. I was walking on the Beach going to the restrooms and heard what sounded like a million crickets. The noise increased to quite loud, Then over the pond a large craft was hovering about 100 ft above the pond I was on the Beach with several people including my parents, sister and about 12 other people who where staying over on the weeks days. It looked like two saucers put together with a dome over the top The craft had a lot of bright lights around the middle and top and bottom primarily red green, blue white lights. it hovered above the pond for quite a while. Then the cricket sound became quite loud and the craft took off to the right in the blink of an eye. Incredible it was there then not. I did not think much time had past. but when we walked back to the trailer it was 3:30 am about 3 and a half hours had passed. My Uncle who was a 32 year Navy man witnessed this also. All he would say was it was unidentified. Most of the people did not talk about this event. I think it must be rare for almost a whole family to witness this. All that summer there were several siteings around that area. I think I was on the ship. I remember asking someone about where they came form. The individual showed a map on the wall, I think a like a TV screen, he pointed out the location, I remember he got upset that I did not know the star chart. I told him that in school we were not taught this. I also wanted to go with them but told no, I was crushed that is what I recall the most. I do not recall what they looked like, but they liked that I was very inquisitive.I may have jumped around a bit I apologize it was 39 years ago. Both my parents are still alive my Uncle has past on. Thanks for a forum to unload this info. call me if you would like further verification 617 889 0996"],"Country":"United States","Case Number":"36354","City":"Sandown","map":"<A HREF = \"http://maps.google.com/maps?q=42.928698,+-71.187005(36354)&iwloc=A&hl=en\"> mufon case (36354) map </A>","Date Submitted":"03/09/2012 09:02 UTC","Sighting Duration":"03:15:00","Region":"New Hampshire","Log Number":"US-03092012-0015"}