{"Region":"Florida","files":["/var/www/straped/mufon/html2text/36359.html.txt","/var/www/straped/mufon/org/36359.html"],"City":"Orlando","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=28.539596,+-81.375206(36359)&iwloc=A&hl=en\"> mufon case (36359) map </A>","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"03/10/2012 01:21 UTC","Date of the Event":"08/08/1989 09:30 UTC","Disposition":"Unresolved","Country":"United States","Object Flight Path":"Stationary","Sighting Duration":"00:05:00","Case Number":"36359","Longitude":"-81.375206","Tags":"City","Summary":"glass egg-shape (up-right egg-shape) with gold on the top and bottom the glass was almost white or silvery from the sun reflection looked a little like willy wonka's glass elevator from the 1971 movie","Log Number":"US-03102012-0002","Object Features":"Dome, Appendage(s)","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around August 8th 1989"],"Object Shape":"Bullet, Missile, Egg, Oval","Latitude":"28.539596","divs":["Sighting DetailsI believe it was in August of 1989, when my mother, her friend, and her friend's children, and I were in Orlando Florida to go to Disney World and to visit friends. It was between 8:30 and 9:30am, it was a beautiful sunny morning, no clouds in the sky. We stopped at a Waffle House to have breakfast. My mom brought her rottweiler with her, so after I finished eating I went out to the car alone to give the dog some food and water. I stood there petting her, not in a rush to be near my mother's friend's kids. That is when I saw a strange bright light in the reflection of the driver's side window, so I turned to look at the buildings across the street (I'm sorry I don't remember what buildings they were, or even what street we were on.) That is when I saw this object hovering above the buildings across the street. The light was not actually a light, but the sun reflecting off the surface of the object. It looked like glass but the reflection was bright enough that it was not transparent, on the top and bottom of the object it looked like gold. And the top came to a point, with the bottom flattish round, a little flatter than the bottom of an egg. The first thing that came to my mind was it looked a bit like Willy Wonka's glass elevator floating there. (the 1971 movie) It also looked to be about the same size as the glass elevator. Maybe 12 to 14 feet tall and between 7 and 8 feet wide. I stood there for 4 or 5 minutes staring at it. There was absolutely NOTHING holding it up, it was hovering a good 20 or 30 feet above the tallest building (which was about as high as a 2 or 3 story building. I also noticed that the building across the street from the building it was hovering over was about a six story building and it had a mirrored glass surface so I could see the objects entire reflection from the side angle. For as long as I was looking at it, it never moved, and I didn't hear any noise coming from it. I heard only cars passing. I looked around in the parking lot to see if anyone was seeing what I was seeing, but the dog and I were the only ones in the lot, and the Waffle House's windows didn't face the street. I didn't want to stop looking at it, I was afraid to let it out of my sight. But I also wanted my mom to see it, so I ran as fast as I could back inside to where they were sitting and told my mom to come with me outside, RIGHT NOW, that it was REALLY IMPORTANT. It took her about a minute to get out of the booth because her friend had to move out of her way. All in all I was away from the parking lot for maybe 2 to 3 minutes tops. When we got back outside it was gone, we looked everywhere there were still no clouds anywhere and no trace of the object. I told my mother what it had looked like, she believed me, even though she hadn't seen it herself. Even though it has been such a long time ago that it happened, and I was just a young girl, I can still picture EXACTLY what it looked like in my head, and it is something I will NEVER forget. I really would like to know if ANYONE has ever seen anything similar to what I saw that morning. I have watched stories about UFO's and alien documentaries and have read people's testimonies and have looked at as many photos of sightings that I can find and have never seen anything like what I saw. I could sketch it (well) but I have no way to scan it to attach the file. If you would like me to send a detailed sketch in the mail I can. Please feel free to contact me in any way."]}