{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/3635.html.txt","/var/www/straped/mufon/org/3635.html"],"Object Flight Path":"Stationary","Object Shape":"Star-like","divs":["Sighting DetailsI was enjoying a quiet afternoon on my backyard swing. It was a mild day considering the very hot and humid days we have had recently. The sky was bright blue and the humidity was very low, and there were no clouds in the sky. Looking in the distance I could see a very bright star. The first star of the evening to make its appearance. I remarked to myself of how bright it was....it did not appear as an object or a plane but clearly as a star. Dulles airport is to our West, far enough that we can see the planes approaching and leaving but not hearing any noise. I thought to myself that it was interesting that a star could be so bright in the heavens that none others were to be seen at that hour. I sat there watching it for over twenty minutes as the trees in front of me framed the view between their branches. It did not move in any direction but held steady, but to my amazement in an instant it was gone as if someone had turned off a light.....I was stunned I sat there for a whole hour trying to understand what I had seen. Whatever it was it emitted light like any very bright evening star ,the light trailed from its corners as it does a star. The sun had set minutes ago but the sky was still bright."],"Tags":"City","Object Features":"Unknown","Longitude":"-77.249705","trends":["There have been 5 other sightings in Woodbridge","There were no other sightings in Woodbridge on or around July 23rd 2005"],"Date of the Event":"07/23/2005 08:05 UTC","Latitude":"38.658172","Case Number":"3635","Disposition":"Unknown","Date Submitted":"07/23/2005 08:05 UTC","Source":"MUFON","Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=38.658172,+-77.249705(3635)&iwloc=A&hl=en\"> mufon case (3635) map </A>","City":"Woodbridge","Log Number":"US-07282005-0002","Viewing Distance":"Unknown","Country":"United States","Weather Factors":"Unknown","Summary":"appeared like a bright star in early evening sky, held steady for twenty minutes before disappearing in an instant."}