{"Case Number":"36350","Date Submitted":"03/09/2012 05:02 UTC","Source":"MUFON","Weather Factors":"Unknown","City":"DesLacs","Summary":"5 people in one car signaled UFO, UFO turned lights off but one.","Latitude":"47.553973","Disposition":"Unresolved","trends":["There have been no other sightings in DesLacs","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.553973,+-100.996412(36350)&iwloc=A&hl=en\"> mufon case (36350) map </A>","Sighting Duration":"00:15:00","Object Flight Path":"Stationary","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/36350.html.txt","/var/www/straped/mufon/org/36350.html"],"divs":["Sighting DetailsThere were 5 of us in the car,my sister, Myself, My mother, my Grandmother and my father who is retired Air Force 21 years. We picked my grandmother up at the Minot airport, she came in on the last flight. We headed home to Lonetree, ND and we were on County RD 10 and my grandmother noticed a light in the sky an she said \"oh look another plane coming in for landing\", that was it for that subject and we were driving and about two miles before DesLacs,ND my grandmother said \"is that the same plane that was coming in for a Landing?\" Then we all joked that it was a UFO but as we were getting closer we noticed it was not moving and then we stopped laughing. The object had a white bright light in the middle and one red light on the left and two red lights on the right, they were not blinking. My dad said\"should I signal it\" and my mom said \"no just drive\" My dad signaled it anyways with his high beams and all the lights went off except the one little red light. I remember seeing bars of light in the back of the object looked like about three rows of long 8 feet or so florescent lights. My sister says she remembers seeing the underneath of it. We called the MAFB flight control tower and they said no planes were in the area, Ward County Sheriff Department came out and asked us questions and went to look for it. We don't know who called the Sheriff department because it wasn't us."],"Log Number":"US-03092012-0011","Viewing Distance":"21-100 Feet","Country":"United States","Date of the Event":"11/01/1991 11:00 UTC","Region":"North Dakota","Object Shape":"Unknown","Longitude":"-100.996412","Tags":"City"}