{"Case Number":"36357","Date Submitted":"03/09/2012 11:30 UTC","Weather Factors":"Unknown","Tags":"City","Log Number":"US-03092012-0018","divs":["Sighting DetailsWe were driving on the I-10 heading West on the evening of Friday 03-09-12 at around 7:15 pm. Just after passing the Avondale Blvd. exit and approaching the Dysart road exit in Goodyear, AZ, I noticed many, many lights in the sky through the windshield. Initially, I thought it was planes preparing to land as there is the goodyear airport nearby. They were orangish and moving slowly in some sort of formation from South East direction, above our car on the I-10 and headed North West direction. However, the sheer number of them (about 30 to 50) made me doubt my aeroplanes' assumption. The lights were blinking sporadically. I yelled for the driver to pull over especially when I noticed a number of other vehicles pulled over to the side and some occupants gazing into the sky. The driver pulled over just before the Litchfield road exit and we witnessed the lights keep travelling North West. However, when they seem to cross the I-10 and approach the 303 (as I assumed), they would just disappear - as if someone turned the lights off. There was no sound except for the traffic on the freeway and my screaming. As the driver and I stood by the parked car on the freeway watching the lights move and slowly disappear, my companion noticed a bunch of lights on the East Horizon. I tried convincing him that it was a bunch of planes circling and preparing to land at the Sky Harbor airport. However, it was more than I had ever seen at other times - about 15 of them. That second set of lights just seemed to hover, in no particular formation. This second set had more of white glow to the lights. Suddenly, one of the lights grew very,very bright the dimmed to look like the rest. I kept watching for some more of the first set of orange lights and saw a couple follow the path of the previous ones and just like those before them, they disappeared suddenly just before approaching the White Tank mountains. Some few more minutes passed then saw another couple of orange lights - flying in tandem and follow the same path then disappear by the White Tank mountains. I got confused. I was not sure whether to be scared or happy I had seen something unique. Screamed a couple more times then got in our vehicle and drove away when I could not seem to see anymore at the time. As we continued driving West, noticed a number of planes (about 3) heading East - like they normally seem to do in a bid to land at Sky Harbor airport. Usually I see one, then an interval before the next one(s). This time, it looked as if they had been waiting. I got the impression that they were waiting for some 'traffic' to clear before proceeding. Still not sure whether to get excited or scared....."],"Sighting Duration":"Undisclosed","Object Shape":"Unknown","City":"Undisclosed","Summary":"Lots of Lights Flying over Phoenix","Date of the Event":"03/09/2012 07:15 UTC","Viewing Distance":"Unknown","Longitude":"-111.084771","files":["/var/www/straped/mufon/html2text/36357.html.txt","/var/www/straped/mufon/org/36357.html"],"Latitude":"34.057828","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=34.057828,+-111.084771(36357)&iwloc=A&hl=en\"> mufon case (36357) map </A>","Country":"United States","Disposition":"Unresolved","Source":"MUFON","Object Features":"Unknown","trends":[],"Object Flight Path":"Straight-line path,Other"}