{"Tags":"City","Region":"California","Case Number":"36360","Object Flight Path":"Stationary","Weather Factors":"Unknown","Object Features":"Dome, Appendage(s), Other, Unknown","City":"Riverside","Disposition":"Unresolved","Longitude":"-117.390596","Sighting Duration":"00:09:00","Summary":"Observed jellyfish UFO with Octopus-like, kicking tentacles. Requested neighbor to observe and she did. Huge and glowing.","Object Shape":"Oval, Other, Unknown","Date of the Event":"11/18/2011 07:30 UTC","Latitude":"33.959929","divs":["sighting detailsthe 2 weeks prior i had been roofing my house and noticed an object on multiple nights. too dark to be sure until one night when moonlight was in position to cast a shadow on what appeared as a 5-story down-pointing arrowhead shaped object made of multiple metal plates. spent many hours over the next few days between 11-5 and 11-17-2011 trying to find it, see it or see it better. on 11-18-2011 as it was getting pretty dark out, i walked out my backdoor which faces west and observed a huge glowing, semi-transparent object that looked identical to a 'standard' jellyfish. including the same natural swimming motions. except for instead of a ocean jf's stringy type 'tails', this ufo had 5 or 6 wildly kicking tentacles identical to a 'standard' ocean-dwelling octopus. absolutely the most unbelievable thing i could ever hope to see after 50 years of life. i was most-likely in shock as i observed it for the first 2 or so minutes. after trying to see something for weeks and then finally see something even crazier, i wasn't totally surprised. but in hind site, i wasn't thinking clearly. a camera\\camcorder didn't even enter my mind (???). luckily, at one point i told myself, \"you need another witness\". i went to one of two apartments behind my house and told my neighbor linda vance, i needed her to witness a real ufo. when she followed me out to near my backdoor i turned to her with my back to the object. i pointed to the sky behind me and asked her. \"what does that look like to you?\" she looked up passed me and stated, \"a jellyfish\". i don't know why, but i was so relieved to hear he say that. it was like years of pressure was lifted off of my shoulders. but i'm not sure why. later, i remember telling myself we observed the object for 9 minutes total. but i actually don't recall many of the details of the last few minutes of viewing other than linda went back in fairly quickly as it was unbelievably cold during that november in so california and she wasn't dressed for it. since that 11-18-2011 observation, i haven't seen either object. the jellyfish or the arrowhead shaped ufo. i've found some related info and video on the internet but i plan to keep looking skyward for new sightings whenever i can. i now keep a charged camera with 24\\7, too. just in case."],"Log Number":"US-03102012-0003","trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around November 18th 2011"],"Country":"United States","files":["/var/www/straped/mufon/html2text/36360.html.txt","/var/www/straped/mufon/org/36360.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.959929,+-117.390596(36360)&iwloc=A&hl=en\"> mufon case (36360) map </A>","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"03/10/2012 06:30 UTC"}