{"trends":["There have been 11 other sightings in Clearlake","There were no other sightings in Clearlake on or around August 8th 1981"],"Disposition":"Unresolved","City":"Clearlake","Tags":"City","Object Features":"None","files":["/var/www/straped/mufon/html2text/36371.html.txt","/var/www/straped/mufon/org/36371.html"],"Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was sitting on my dock fishing at about 3a.m. There was plenty of moon that night and I could see the surrounding hills and countryside for approx 20 miles.I was sitting on the dock looking at the milky way and pondering the possibilty of life somewhere in all those millions of stars. My Conclusion and belief is and was that there must be. Then I started thinking about the possibilty of real ufo visitors to this world and that if there was another highly intelligent life form out there some where, it could be a real thing. I started to surmise that if there were visitors they would have to have evolved to a form fo communication that would use there minds directly, not speaking thru and orofice such as we do. This is where the story gets strange, but from my experience true. I decided half jolkingly to try to communicate with them and the universe telepathically. IOt was a very qhuite night so i started concentrating in my mind and attempting to project a communication repeatedly that \" I mean no harm, if you are there let me see you. This went on, sort of like a mantra for approx 5 minutes with me laying back amd gazing up at the stars. Approximately 5 miles across the lake from me is a long bank of 1200 to 1400 ft hills that run steeply down to the lake, almost like a cliff. there are houses at the bottom along the lake front and at toimes on nights such as this you can actually here voices from there carrying across the water. from there up the hills the terrain is uninhabitable with out a light or structure. Suddenly and without sound I see a light come from behind the hill crossing to in front of the hill and stopping at an elevation of approximately 800 feet. I began to ponder, hmm what is that light doing there? Oh its probably a car. No.. There are no roads up there, Then I started to look at the lights reflection on the face of the lake, which was like a mirror. I could then determine that the light was not ON the hill , but rather hovering in front of the hill, hovering over the water with the hillside behind it.At this point your mind goes thru all the normal deductive reasoning and very quickly. Oh, its just an airplane, answer, no, its hovering and its not making a sound. I could not see a shape becaus eof the brightness of the white light emanating from it. it did seem to pulse a little and there did seem to be some smaller bluish or reddish lights emanating from it at times, but I can't be entirely sure. It did seem to hover with some sort of cross like movement, a little up a little down a little side to side. Judging by the surrounding terrain which was very visible in the moonlight it was somewhere in size between a car and a small house. back to deductive reasoning. Oh it's just a helicopter of some sort. NO there is absolutely no sound and I would surely be hearing a motor and the whop whop of helicopter blades over water here. I have heard them before. It is hovering and soundless!! At this moment the thought or possible realization kicks in that I may have called this thing and it may be looking at me with all the intent with which I am studying it. IT IS THERE FOR ME TO SEE IT AS I ASKED. I immediately start to become very very afraid, almost a paralyzing fear. At that moment it is as if this thing read my emotions almost immediately and responded with lateral movement to the left. For the first 1 to 2 seconds it moved slowly for the next 1 to 2 seconds it gathered speed as fast as a jet, and the its speed exploded for want of a better word and faster than you can repeat 'Oh MY God I watched going into a terrain following pattern curving and dashing over the hillside to the left for a distance of about 25 miles until it dissappeared overhe top of a small mountain still flying low along the terrain. I'm talking about 25 miles in 3 to 4 seconds. NO MORE! I was out of my mind I ran up to the house and woke up all my family but it meant little to them. THEY DIDN\"T SEE IT. I was not drinking at all or using any kind of drugs. I defintely was not sleeping and dreaming. It scared me very much. and then became my wonderful little sanecret. At times my mind still doesn't believe what happened. But a careful reality check says, YES IT DID. I do not consider myself to be psychic or have much of any special powers, but yes there have been other types of telepathic occurrences in my life. I still don't believe it but I CALLED THIS THING AND IT DID APPEAR, READ MY EMOTIONS, MY FEAR,AND LEFT IT DID EXIST AND ITS MOTION SHOWED INTELLIGENCE NOT AN ANOMOLY. I have told this story to a few people, but it is just one of those things people don't really know what to do with. Sometimes I don't know what to do with it but file it away as inexplicable.I am not a Liar and I am not making any of this up or exagerating. It is the truth as I lived it That is all i can say.needless to say, from this, I have an interest in U.F.O.s but I have not followed any magazines or articles to date. I don't know of anyone who has had a like experience and I still have difficulty believing in abductions and crop circles. I am not obsessed or possesed by Ufos. A footnote to reality.Approximtely 18 years later I ran intob an bairforce colonel of the 6th U.S. fighter squadron. Who confirmed for me among other technology things that yes on that hot august night he and his squadron were called to scramble after three unidentified aircraft over Mount Konokti,. When they got there they saw three glowing orbs hovering near the mountain. They kicked in after burners to pursue and engage and These Three Orbs took of straight up until they dissapeared at such a fantastic speed it was as if the F15. were standing still. He told me much more in a night of comeradery and drinking. I cannot tell it all here. Suffice it to say Yes they do exist. He has been very close to them in the cosmos and has no fear of them because there technology is so advanced that an F15 wouldn't stand a chance, but they never attack. He has actually seen the craft.I could still probably find and identify this guy again. He must be retired by now. But I don't know If he would ever talk again. You can contact me if you feel my experiences are important. Otherwise I will probably never contact you with this again. I'm 62 years old and going in for heart surgery in about three days. Just wanted someone to know."],"Sighting Duration":"Undisclosed","Region":"California","Date of the Event":"08/08/1981 12:00 UTC","Object Shape":"Sphere, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.982433,+-122.686124(36371)&iwloc=A&hl=en\"> mufon case (36371) map </A>","Date Submitted":"03/10/2012 10:03 UTC","Country":"United States","Latitude":"38.982433","Weather Factors":"Unknown","Log Number":"US-03102012-0012","Summary":"seemed to respond to meditative telepathic request to appear appeared over a 1500 ft hill range and over lake hovered as if in contact. upon my fear accelerated to incredible speed laterally an followed ground terrain for 20 mile visibilty in approx 3 s","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"36371","Source":"MUFON","Longitude":"-122.686124"}