{"Longitude":"-80.372404","Disposition":"Unresolved","Latitude":"25.749599","Date Submitted":"03/10/2012 09:53 UTC","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsOn Wednesday night March, 7, 2012, I happened to go out in my back yard to throw the recyclables in the bin at exactly 8:37 pm. I was taliking on my cellphone to my sister, and happened to look up at how clear the stars were around the Orion system, Procyon, Sirius, and Betelgeuse, which form a upside down triangle in the sky with Sirius at the bottom point, Procyon at the left top and Betelgeuse at the right top, but this time I saw a bright star flash on then off just about in the geometric center of the triangle. The flash is as bright as Procyon and Betelgeuse, not as bright as Sirius. It remains on for a fraction of a second about a half a second. It does not flash like a camera flash, but phases in rapidly, then phases back out. I am a life long boater and know how a lighthouse flashes. It's exactly like a light house or airport white flash. But seems to be in orbit above the Earth. The flashes are timed exactly four minutes apart, I drew a chart of the constellations. I noticed, however as the time went by the flash moved toward the East over the hour, in relations to the tri-star triangle, away from Orion. But in relations to the Earth and my backyard was stationary. It seems to be geosynchronised with Earth rotation and only appeared to be moving as the Earth rotates toward the East, leaving the Orion system and the tri-star triangle further west in the sky. By 9:18 on March 7th it stopped flashing and it's last flash put it below and left of Procyon well outside of the tri-star triangle. Thursday, I did not make an attempt to see it as I worked super late. But Friday March 9th, 2012 at 8:20 I got home from work and looked in the same geometric center of the tri-star triangle and sure enough, the flash was back, timed at 4 minute intervals, till about 9:28, then stopped flashing. Again it was geosynchronuos with Earth and appeared to be moving slowly due East from Orion's belt, 15%-22% East of the Orion system. Again tonight Saturday 10th of March, it's back like clock work after some lingering clouds blew out. I also over the past couple of nights called a friend to have him go out and look with my cell phone as we both saw the flashes at the same time and we live about 15 miles apart. I also got our neighbor Sandy to see it last night. My wife as well as my 8 year old daughter also saw it. I have a detailed chart drawn up with the complete times for Wednsday night and Friday night till it stopped at around 9:30 pm."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36370.html.txt","/var/www/straped/mufon/org/36370.html"],"Region":"Florida","Date of the Event":"03/07/2012 08:38 UTC","Log Number":"US-03102012-0011","Object Shape":"Flash, Star-like","Source":"MUFON","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around March 7th 2012"],"Sighting Duration":"Undisclosed","Summary":"Bright sequential flashing 4 minutes apart like clock work or strobe","Object Features":"Unknown","Object Flight Path":"Stationary","Country":"United States","City":"Miami","Tags":"City","Case Number":"36370","map":"<A HREF = \"http://maps.google.com/maps?q=25.749599,+-80.372404(36370)&iwloc=A&hl=en\"> mufon case (36370) map </A>"}