{"Sighting Duration":"Undisclosed","Case Number":"3638","Object Features":"Undisclosed","Tags":"City","trends":["There have been 11 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around January 9th 1948"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.957135,+-75.157159(3638)&iwloc=A&hl=en\"> mufon case (3638) map </A>","Longitude":"-75.157159","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/3638.html.txt","/var/www/straped/mufon/org/3638.html"],"divs":["Sighting Details it was 1963 during a baseball game. I had hit a single and was on first base. The first baseman (jimmy Steffens) and I were looking in toward home plate anticipating the next pitch. off in the distance Above the head of the batter was a tiny light like a star. It came from the horizon at an unimaginable speed. the sky was clear except for a cloud right above our heads. The height of the cloud was unknown and covered an area the size of a pizza pie held at arms legnth. this thing came at such a speed as to be beyond anything we have ever seen. It entered the cloud and was the size of a dime held at arms length. It did not exit the cloud as expected rather it sped off in the same direction that it came.the reverse direction only took 2 seconds and took off in the same direction that it came in at such a speed that by the time we started yelling the other players missed seeing it as it disapeared in the distant horizon. Later that night we were all playing hide and go seek.Jimmy and i chose a hidin place together. what happened to jimmy and myself is too bizzare to tell on paper. I am afraid if i explain it you will think of me as crazy. I have not seen or heard from Jimmy since about 1965 however his wife came to my office around 1985. she was helping a friend but asked me if anything strange happened to Jimmy and myself. i said yes i didn't elaborate and neither did she i knew she was talking about what happened that night. -------------------------------------------------------------------------------- --------------------------------------------------------------------------------"],"Latitude":"39.957135","Date Submitted":"01/09/1948 01:30 UTC","Date of the Event":"01/09/1948 01:30 UTC","Log Number":"US-07302005-0001","Source":"MUFON","Object Shape":"Undisclosed","Region":"New Jersey","Object Flight Path":"Undisclosed","City":"Philadelphia","Disposition":"Unknown","Weather Factors":"Unknown","Summary":"came from a distance incredible speed reversed course and left at incredible speed","Country":"United States"}