{"City":"Vail","Tags":"City","Source":"MUFON","trends":["There have been 13 other sightings in Vail","There were 2 other sightings in Vail on or around March 10th 2012"],"Disposition":"Unresolved","Object Features":"Unknown","Longitude":"-106.393162","Log Number":"US-03112012-0015","Date Submitted":"03/11/2012 02:25 UTC","Case Number":"36394","map":"<A HREF = \"http://maps.google.com/maps?q=39.656176,+-106.393162(36394)&iwloc=A&hl=en\"> mufon case (36394) map </A>","Region":"Colorado","Sighting Duration":"00:01:30","divs":["Sighting DetailsI am a MUFON investigator who lives in Vail CO. On the afternoon of March 10th, 2012, I was working my job as a security officer at the medical center in Vail. The sky was mostly clear with a few scattered clouds. I was out in the parking lot when I observed a dark object with two bright lights like headlights to the east of my position. At first I thought it might have been a helicopter, perhaps one of the medical flights that take serious medical cases to Denver hospitals, but soon decided it was not an aircraft. My pickup truck was nearby so I walked over to get my binoculars to get a better look. The UFO appeared to fade at times and I had a hard time getting it in view through the binoculars. At times it seemed to completly disappear, and then reappear. It appeared to be moving in my direction, towards the west, or ascending, and unfortunately I received a call on my work cellphone which I was required to answer. This distracted me from getting a better look through the binoculars, and by the time I finished the call the object was gone. I looked at my watch and the time was 1:40 PM, and the duration of the sighting approximately a minute and a half. I waited around a few minutes to see if it appeared again, but it did not. As a MUFON investigator with numerous sightings of my own in the past I am always scanning the skies for these craft and have had four other sightings in the past while at work. My best feeling is that this was an unknown. Event occurred on March 10th."],"Country":"United States","Date of the Event":"03/10/2012 01:40 UTC","Latitude":"39.656176","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Unknown","Object Flight Path":"Straight-line path","Summary":"Black object with two bright lights seen over Vail CO.","files":["/var/www/straped/mufon/html2text/36394.html.txt","/var/www/straped/mufon/org/36394.html"]}