{"Log Number":"US-03112012-0014","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around March 11th 2012"],"files":["/var/www/straped/mufon/html2text/36398.html.txt","/var/www/straped/mufon/org/36398.html"],"Case Number":"36398","map":"<A HREF = \"http://maps.google.com/maps?q=33.341518,+-111.922554(36398)&iwloc=A&hl=en\"> mufon case (36398) map </A>","Object Features":"Unknown","Region":"Arizona","divs":["sighting details at approx 2:50 am sunday morning, my girlfiend and i went outside our tempe house and initially noticed one abnormal bright flashing orb hovering low in the distance. the orb began to randomly and subtlely change it's location and altitude with each flash pulse in the ne valley sky. multiple (approx 4 to 8) white flashing orbs of lesser intensity began to appear around the initial orb with other orbs\\lights appeared faint all around them in multitude. then, other lights suddenly streak singularly across anda upward or were possibly ejected as the brighter orb's flash tempo changed. this continued until approx 3:35 am while the others diminished and the initial brightest orb streaked off quickly to the east, as all became no longer visible to us beyond the other house rooftops. no aircraft were seen in the sky at this time. these were not aircraft, nor did they travel in any manner or direction typical of any airplane or helicopter and made no apparent sound. my girlfriend and i regularly watch the sky and can recognize normal air traffic versus ufo anomalies. we have actually inadvertently captured daytime ufo images on multiple instances during the past year and have photo evidence of those other events. however, this recent sighting had the greatest number of ufo's we've ever witnessed at one time and for the longest duration."],"Sighting Duration":"00:35:10","Object Shape":"Unknown","Longitude":"-111.922554","Summary":"Fleet of multiple flashing orbs of varying intensity seen low in North East Valley (3 AM Sunday)","Viewing Distance":"Over One Mile","Latitude":"33.341518","City":"Tempe","Source":"MUFON","Tags":"City","Date Submitted":"03/11/2012 04:10 UTC","Weather Factors":"Unknown","Object Flight Path":"Unknown,N/A","Country":"United States","Date of the Event":"03/11/2012 03:10 UTC","Disposition":"Unresolved"}