{"Case Number":"36402","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.2618,+-77.606894(36402)&iwloc=A&hl=en\"> mufon case (36402) map </A>","Date Submitted":"03/11/2012 08:03 UTC","divs":["Sighting Details I was leaving my friends house one block north of the parkway ,their street is next to the parkway with the parkway wall separating their yard from the parkway. I turned right onto Lake Avenue & took another quick right onto the Ontario Beach Parkway, even before the first ramp to exit (which would have brought me around to where I started but I was intending to drive approx. 30 miles),I immediately saw this object just hovering there across the parkway just somewhat above tree level. It wasnt very large but was low & close. It was black, somewhat disc shaped but appeared with rounder edges with a dome-like look & something else on it like maybe a landing leg or as I can discribe shaped like a grasshopper leg (for lack of a better way to discribe)& that was coming off of the side & also black. There was,from what I could see lights from top to bottom in a row with 3 rows. I didnt know what to think as I stared in disbelief as to what I was seeing. I pulled over briefly & kept asking myself 'what is that'? Although there was traffic passing by at the intersection behind me, I then realized that no one else was near me on the parkway at that moment as I was curious if anyone else was seeing what I was seeing. I then thought that I'd better get out of there & exited on the nearby ramp which brought me back to where I started & ran in & told my friends. They could not catch a glimpse as the parkway wall way blocking the view. I once again had to go my route which I did almost immediately but when I got back on the parkway it was gone. I drove & didnt look back. This is my 5th sighting with one other sighting while driving the parkway last year but that one was green paneled disc & lit up with green lights & fell like a falling star in the distance but kept falling & hovered long enough for me to see it then raced off."],"Log Number":"US-03112012-0018","Disposition":"Unresolved","Weather Factors":"Unknown","trends":["There have been 53 other sightings in Rochester","There was one other sighting in Rochester on or around March 10th 2012"],"Longitude":"-77.606894","Region":"New York","City":"Rochester","files":["/var/www/straped/mufon/html2text/36402.html.txt","/var/www/straped/mufon/org/36402.html"],"Object Features":"Dome, Appendage(s)","Object Shape":"Disc","Summary":"Hovered low ,then moved east less than a city block & hovered silently.","Latitude":"43.2618","Sighting Duration":"00:15:00","Object Flight Path":"Hovering then path,Path then hovering","Date of the Event":"03/10/2012 12:00 UTC","Viewing Distance":"21-100 Feet","Country":"United States"}