{"Longitude":"-84.588742","Summary":"Surreal fireball teleported erratically near me and flew away faster than anything I ever witnessed","Country":"United States","Object Flight Path":"Other","Object Shape":"Triangle","Case Number":"36407","Source":"MUFON","Region":"Michigan","Tags":"City","Date of the Event":"03/10/2012 10:17 UTC","files":["/var/www/straped/mufon/html2text/36407.html.txt","/var/www/straped/mufon/org/36407.html"],"divs":["Sighting DetailsI was walking with my girlfriend to the lake closest to my house. we sat down at a park bench and noticed a fireball with multicolored lights on my 1 o' clock just above the tree tops. for some time, it was hovering and didn't appear to be activating anything or moving around. suddenly about 3 minutes into the encounter, It teleported to my 4 o'clock not much more or less than 300 feet away from my position. That's when I percieved its shape as triangular. When it teleported, there was a vertical ray of light much like a shooting star which it flew out from and over my head. It accelerated past the speed of sound instantly and without sonic boom. When it was directly over my head, I saw that it didn't show as many lights as when it was in its original position and only on the corners. The main body of the device blended in with the sky, which is to say it was invisible, except for the outline. After 3 seconds, the device flew into a straight vector away from the nearby airport and was out of my sight. It either sped to superluminary speeds or completed a cloaking field. there were no emissions except for the vertical ray of light."],"Viewing Distance":"101-500 Feet","Date Submitted":"03/11/2012 11:01 UTC","Log Number":"US-03112012-0021","map":"<A HREF = \"http://maps.google.com/maps?q=42.83786,+-84.588742(36407)&iwloc=A&hl=en\"> mufon case (36407) map </A>","Weather Factors":"Unknown","City":"DeWitt","Sighting Duration":"00:06:30","trends":["There have been 3 other sightings in DeWitt","There were no other sightings in DeWitt on or around March 10th 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Latitude":"42.83786","Object Features":"Window(s), Patterned Surface"}