{"Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.649768,+-89.032409(36406)&iwloc=A&hl=en\"> mufon case (36406) map </A>","trends":["There has been one other sighting in Janesville","There were no other sightings in Janesville on or around March 10th 2012"],"Date Submitted":"03/11/2012 10:34 UTC","Object Shape":"Oval, Other","Latitude":"42.649768","City":"Janesville","files":["/var/www/straped/mufon/html2text/36406.html.txt","/var/www/straped/mufon/org/36406.html"],"Region":"Wisconsin","Case Number":"36406","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"My son and I observed two strange crafts hovering to the northwest, objects hovered and then one took a a path change with amazing speed. second object remained. lights were white red and blue, pulsating.","Longitude":"-89.032409","Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-03112012-0020","Country":"United States","Date of the Event":"03/10/2012 12:00 UTC","Object Flight Path":"Hovering then path,Path then hovering","Source":"MUFON","divs":["Sighting DetailsI was watching television when my son came in my room and asked me to please come look outside, he thinks he sees something strange in the sky.I got up and went outside on my balcony and see two objects about a mile away about 500 feet from the top of the trees, in the sky, there was no noise of aircraft. they appeared orb like or slightly oval in shape. One moved away after being observed hovering next the the other one. they hovered for approximately 5 minutes before one took off faster than I can describe. The other one stayed hovering in the air with lights pulsating, it began to move across the sky and then quickly and abruptly changed direction and suddenly stopped again. About two minutes later it was seen moving at a high rate of speed and appeared to vanish completely from view as it rose upward into the night sky.This occurred approximately around 11:45-midnight central standard time. I am not real sure what I saw, but I do know it was not a helicopter or a plane. We tried to get pictures of it but it simply was too far away for good photo of what we saw"]}