{"Summary":"Saw a dark spot moving high in the sky. hovered then ascended out of sight.","Log Number":"IL-03122012-0009","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Appendage(s)","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=31.961544,+34.80705(36418)&iwloc=A&hl=en\"> mufon case (36418) map </A>","Region":"","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36418.html.txt","/var/www/straped/mufon/more/36418_submitter_file1__CameraPictures227.jpg","/var/www/straped/mufon/org/36418.html"],"Country":"Israel","Object Flight Path":"Stationary,Hovering then path","trends":["There have been no other sightings in Rishon LeZion","This sighting has never been favorited."],"Source":"MUFON","Longitude":"34.80705","Object Shape":"Cone, Diamond","Date Submitted":"03/12/2012 07:53 UTC","Latitude":"31.961544","Weather Factors":"Unknown","City":"Rishon LeZion","Case Number":"36418","Date of the Event":"07/24/2011 09:47 UTC","divs":["Sighting DetailsI was on guard duty at work at the time - I work as a security gaurd at a company that supplies natural gas. I was gaurding the main gate. There was nobody else with me. About 200m from where I work sits Israel's only meteorological station. Every two days they release a weather balloon - usually in the morning. I have observed these balloons on countless occassions - following their paths up into the sky until they disappear beyond the clouds. About 5 km away sits Ben Gurion International Airport, which is Israel's only airport. I have often obsrved aircraft flying low over our installation in preperation for landing. At the time of the sighting I was looking up to check if there were any aircraft approaching - they approach from the southwest and travel northeast. I did not see any aircraft - but looking towards the northeast I noticed an unusual black speck high up in the sky. It appeared to be stationary at the time. My first thought was that it was another weather balloon,but the weath camerer ballons I have observed before appear white-reflecting the sun's light. this particular object was dark grey or black in color. It was too high up for me to determine its shape. I then presumed it might be a circuling bird of prey-but the object remained stationary,despite the fact that there was a considerable wind blowing. Although vehicles entered the gate-and I had to take my eyes off the object for at least 30 seconds,when I eventually looked up again it appeared to have moved-it was drifting now towards the northeast and gaining altitude. It made no sound. nobody else saw the object-it was hard to see. I ran for my camera and took 3 pictures. I tried to get some background, but it was too high up. The object appears on the first picture but not on the second or third-it appeared to be ascending with increasing speed. It eventually disappeared - or became to small to observe with the naked eye. During the sighting I felt that i was looking at something unusual - it was hovering initally directly over our installation at high altitude. When I transferred the image to my computer and zoomed in, the object took on the shape of an ice-cream cone, with two appendages appearing at the top and bottem. I have no idea what it was and I have never seen anything like it before. One possibility that came to my mind is that it might of been some kind of drone. At the time of the sighting I felt no fear only curiosity as to what it might be and why was it hovering over a security-sensitive installation? I hope you find some answers. Colin Frankel"]}