{"Longitude":"-85.136881","Log Number":"US-03122012-0004","Object Shape":"Cylinder, Diamond, Disc, Sphere, Star-like","City":"Fort Wayne","Summary":"2 -3 UFO's that flashed multi- colored disc then changed to ballshapes (flashed Amber, white, red, and blue, green - then seemed to be \" balls shaped\" on 3/11/12 at approx. 10:30 p.m. (They) flashed a very bright light","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36412.html.txt","/var/www/straped/mufon/org/36412.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.086273,+-85.136881(36412)&iwloc=A&hl=en\"> mufon case (36412) map </A>","Source":"MUFON","Tags":"City","Date of the Event":"03/11/2012 12:00 UTC","Object Features":"Dome, Window(s), Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"Indiana","Country":"United States","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Case Number":"36412","divs":["sighting details on 3\\11\\12 at approx. 10:30 p.m. i observed 2 ufo's. these objects flashed multi- colored and were disc shapes while not flashing(they flashed amber, white, red, and blue and green - then seemed to be \" balls shaped\" while not flashing - appeared to bed red in color and hovering. i tried to \"communicate\" with them by flashing a flashlight in a cross sign and they flashed a very bright light back at me - off and on this went on for about 2 hours then flew off quickly . they left then returned swiftly- and began flashing lights again. also caused my cell phone to turn off then back on twice while trying to take photos and film with my htc evo (cell phone\\camera)after completely charging my battery had drained it twice as well while recording this event over a two hour span."],"Date Submitted":"03/12/2012 01:59 UTC","trends":["There have been 41 other sightings in Fort Wayne","There was one other sighting in Fort Wayne on or around March 11th 2012","This sighting has never been favorited.",""],"Latitude":"41.086273"}