{"files":["/var/www/straped/mufon/html2text/36435.html.txt","/var/www/straped/mufon/org/36435.html"],"Latitude":"38.781886","Country":"United States","trends":["There have been 9 other sightings in Gardner","There were no other sightings in Gardner on or around January 25th 2012"],"Sighting Duration":"Undisclosed","Case Number":"36435","Disposition":"Unresolved","City":"Gardner","Summary":"driving ,seen something ,believing it was a mother ship ,and then and orb appeared and watched me, immobilized my vehicle, it watched me and slowly moved away","map":"<A HREF = \"http://maps.google.com/maps?q=38.781886,+-94.894023(36435)&iwloc=A&hl=en\"> mufon case (36435) map </A>","Object Flight Path":"Hovering then path","divs":["Sighting Detailsi was driving from a friends house in a country dirt road, i have had encounters before and while driving i focused my attention on some lights far in the distance,and said to my self it was a mothership. as i was watching it i see something that looked like a plain heading towards me but it seemed too low. it had red and blue flashing lights so i slowed down thinking it might crash on me, as it kept approaching me ,my car started slowing down on its own and the craft got closer ,right above the tree line , i kept watching it since i had no controll of the vehicle ,and it kept hovering on the tree line 20 feet from the road and about 100 feet above or lower. it turned towards me once it was next to the truck and just watched me ,at this point the lights were not blinking anymore. it had an orb shape a separation between the two parts and thats where the red and blue lights came from , the color of the craft was a very bright metallic color. after it let me controll my car again ,i kept driving but looking back through the mirror and it was still there, a second later it dissapeared and out of nowhere a car came up behind me and turned onto another street. i drove home and went to sleep. that was all. by the way i had another occurence several years ago with two friends and it was a very close encounter, we all three seen it and will be willing to talk about it , and all our stories match, exact, i have been incarcerated and when i got out i asked them if they remembered and they described it like it had just happened. but thats a different story. thank you!!!!"],"Object Shape":"Circle, Sphere","Object Features":"Window(s), Other","Viewing Distance":"21-100 Feet, N/A","Weather Factors":"Unknown","Tags":"City","Date of the Event":"01/25/2012 12:00 UTC","Source":"MUFON","Log Number":"US-03132012-0003","Region":"Kansas","Date Submitted":"03/13/2012 07:03 UTC","Longitude":"-94.894023"}