{"Date of the Event":"03/12/2012 07:13 UTC","Longitude":"-74.044615","divs":["sighting detailson 03\\12\\2012 at 7:13pm, i was on the telephone while looking outside towards the point pleasant beach boardwalk and ocean. i noticed a bright glowing orb in the sky. lately i have been noticing more and more hovering bright orbs in the same spots of the sky at night time, but this time it was still daylight so i don't think it could have been dismissed as just a bright star. i grabbed my camera and took a picture as quickly as i could. the first one turned out blurry because the camera was moving so i took a second one as fast as possible. i looked down at my camera to look at the picture i took. when i looked back up, the bright light in the sky had vanished! this creeped me out because it was hovering in the sky just before that. when i zoom in on the picture, the orb seems to be in the shape of an egg\\oval. the object was motionless and just hovered. i unfortunately didn't witness it disappear. it pulled a \"now you see me, now you don't\" while i was looking at my camera. i was very excited when i saw it and in retrospect, it was a mistake to take my eyes off of it, but i'm glad i got a picture of it seconds before it vanished. i just wasn't expecting it to disappear. i wish i knew what this was! it is very strange! it wouldn't surprise me if i were to see something like this again in the near future because i've been seeing hovering bright lights for the past few months now in this area, except all of those cases have been at night time. i am very satisfied with the picture i took so please contact me via e-mail to investigate. i do not want to release the photo publicly. the first photo is blurry because the camera was moving but the second photo came out great. i want to know what this was, and the photo is so much better than anything i could have captured at night time."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.100427,+-74.044615(36430)&iwloc=A&hl=en\"> mufon case (36430) map </A>","Weather Factors":"Unknown","Summary":"Glowing light hovering in sky disappeared after taking picture","Latitude":"40.100427","Object Features":"None","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","Region":"New Jersey","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36430.html.txt","/var/www/straped/mufon/org/36430.html"],"trends":["There have been 2 other sightings in Point Pleasant Beach","There were no other sightings in Point Pleasant Beach on or around March 12th 2012"],"Disposition":"Unresolved","Object Shape":"Circle, Egg, Oval, Sphere","Case Number":"36430","City":"Point Pleasant Beach","Date Submitted":"03/12/2012 09:08 UTC","Log Number":"US-03122012-0021"}