{"Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI live on a hill which overlooks the norsewood valley out to the takapau planes,One night just on dusk I came out my back door to have a cigerette ,when I noticed an object to my right.It was travelling fast.My immediate thought was geez he's low thinking of a low flying military jet.(Our govt stopped flying military jets 2 years previous)Then I noticed its brightness like highly polised chrome.I thought it must be a private jet ,but he is going to crash because he was just so low,but there was just no noise at all ,nothing (A jet would of bounced sound off the hills beside it)The sun was going down behind it ,and it was giving off a shinging glow against the hills (Very bright like if you were holding a mirror agaist the sun and shining it on a building).I stayed glued to it because I thought it was an aircraft that was going to crash.At this point the object slowed down then just went straight up out of sight.When I say up I dont mean in a curving motion like a jet would,This thing just went straight up like an elevator.I never said anything to anyone as I,m a businessmen on all types of school and hospital boards ,I didnt' want or need any ridicule.But the reason I'm writing this to you today is that I was at a function the other night talking with a group of people ,and the UFO subject came up.A couple who I didnt, know laughed off the fact that they saw one. I plucked up the courage pulled them aside and asked when and where.They had seen the same object at the same time while out riding their bikes along the foot hills.They said it went straight over the top of them ,It had shape and was definately an object.Because they were in a tree line they didnt see it for as long as I did but they did see it going vertical and out of sight.I asked them what they thought it was ,and they replied \"don't know and really don't want to. And that was that. I promise you this is not a story ,this did happen .I'd clasify myself as more of a sceptic,but there was something very different in the skies that evening ,and I wasn't the only one who saw it.Keep up the good work GS"],"Country":"United States","Date of the Event":"04/10/2006 06:00 UTC","Source":"MUFON","Date Submitted":"03/12/2012 09:36 UTC","Tags":"City","Object Features":"Unknown","trends":["There have been 3 other sightings in Hastings","There were no other sightings in Hastings on or around April 10th 2006"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36431.html.txt","/var/www/straped/mufon/org/36431.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.594658,+-98.387373(36431)&iwloc=A&hl=en\"> mufon case (36431) map </A>","Weather Factors":"Unknown","City":"Hastings","Summary":"object travelled down valley and then went directly vertical completely out of site.","Object Shape":"Disc","Region":"Nebraska","Case Number":"36431","Longitude":"-98.387373","Latitude":"40.594658","Log Number":"NZ-03122012-0022"}