{"map":"<A HREF = \"http://maps.google.com/maps?q=41.106635,+-80.763024(36438)&iwloc=A&hl=en\"> mufon case (36438) map </A>","Object Shape":"Diamond","Sighting Duration":"00:00:40","divs":["Sighting DetailsOn Sunday night, March 11 around 10:30 I stepped out on my back patio to check the weather conditions. I've been an amateur astronomer for almost 27 years and I go out at night to stargaze. My 15 year old daughter came to the open back door and was standing behind me. I didn't notice the weather conditions because I immediately saw a very brilliant red light in the night sky to the south. I at first thought it was a plane, but then I realized that it did not have the usual lights on it, and the light that was on it was not blinking. It was around 65 degrees high in the sky. It had a very bright unblinking white light on the back point of the diamond. My daughter asked, \"What is that?\" and I replied that I didn't know. We watched it as it crossed the sky from southeast to southwest. I asked her if she heard anything and she replied that it was completely silent. I have giant 11 x 80 binoculars, but unfortunately they were upstairs at the time, since I had used them to stargaze out of the upstairs window several nights before this one, and there was no time to run up and get them. The object bobbed up and down as it flew, not a lot, but a gentle bobbing. It wasn't a Chinese lantern; I've seen several of them in the night sky and this was nothing like that at all. It was a very brilliant red...somewhat like a Christmas light red, and the white light on the end was also very bright. We watched it as it passed by us and headed off until we lost it over the tree line to the southwest of us. We watched it for around 40 seconds. As it was leaving our sight my daughter pulled me into the house. She said that she became terribly frightened as the object left, and she made me promise that I would not go outside again that night. It made no sound the entire time it passed by us. In the 27 years I've been stargazing (almost every clear night) I've only seen three things I couldn't explain. This incident was the third."],"files":["/var/www/straped/mufon/html2text/36438.html.txt","/var/www/straped/mufon/org/36438.html"],"Source":"MUFON","Object Flight Path":"Other","Summary":"A bright diamond shaped glowing red object with a bright white light on the end","trends":["There have been 6 other sightings in Austintown","There were no other sightings in Austintown on or around March 11th 2012"],"Disposition":"Unresolved","Date Submitted":"03/13/2012 11:27 UTC","Log Number":"US-03132012-0006","Date of the Event":"03/11/2012 10:30 UTC","Country":"United States","City":"Austintown","Region":"Ohio","Weather Factors":"Unknown","Case Number":"36438","Latitude":"41.106635","Longitude":"-80.763024","Tags":"City","Viewing Distance":"Unknown","Object Features":"None"}