{"Weather Factors":"Unknown","Longitude":"-80.321796","Region":"Florida","Date Submitted":"03/13/2012 07:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=25.599967,+-80.321796(36447)&iwloc=A&hl=en\"> mufon case (36447) map </A>","Disposition":"Unresolved","Case Number":"36447","Date of the Event":"03/10/2012 09:30 UTC","Tags":"City","divs":["sighting detailsit was on saturday, 3\\10\\12. it was already dark outside (obviously 'cause it was 9:30) and i was watching tv on the couch with my sisters. i'm a lazy person, so it took me at least six minutes for my dad to get upset. why? because he had told me almost 10 minutes ago to go find one of his tools that i left outside a few days ago. when your lazy, you're forgetful, too. (btw, i was using his tool to cut wood for a project) so i put on my sandals, grabbed a little red flashlight, and walked out back. ugh. i was windy and cold. i was getting irritated, so i went to the spot near our basketball court where i had stashed the tool. it was under an old thingy my dad used for who-knows-what and god-knows-how-long-ago. unfortunately for me, i had gotten pushed real far under the thingy, so i looked up at the sky (still annoyed) to think of away to get it out from under there. i forgot what i was doing when i looked at the sky. i never usually saw so many stars at night; even when it was clear. it was pretty... until i saw a light in the sky. first thing that popped into my head: i hate planes. it was moving at a steady speed. and i somehow got bored and randomly started doing something with my flashlight. i pointed it up at the sky and started making a figure-8 with it. then i flashed it on and off in a rhythm 'til the \"plane\" faded (i honestly don't know why i do stuff like that. when i can't think, i goof off). that satisfied my boredom and helped me think of a way to get the tool. the thingy had a bunch of pipes and wooden sticks in it, so i grabbed one and laided it on the ground. i was going to shove it out with the stick, but i stopped to look up the sky again. and there it was: the thing that i thought was a \"plane\". it was freakishly bright and it made my heart skip a beat. it was moving in a figure-8 pattern. then it started blinking in the same rhythm i had done. then, it just made some sort of \"sharp turn\" and faded. poof. vanished. i didn't blink my eyes a second, so my eyes were watery when i looked away from the sky after it disappeared. usually when i look up at something for a bit, it doesn't make me woosy. but i didn't care. i got the tool with the stick and ran back inside the house. dear god, i was dizzy."],"Source":"MUFON","Object Shape":"Flash, Sphere, Star-like","Latitude":"25.599967","Object Flight Path":"Other","Summary":"It did what I did like two (2) minutes earlier.","Country":"United States","files":["/var/www/straped/mufon/html2text/36447.html.txt","/var/www/straped/mufon/org/36447.html"],"Object Features":"Unknown","City":"Palmetto Bay","trends":["There have been 3 other sightings in Palmetto Bay","There were no other sightings in Palmetto Bay on or around March 10th 2012"],"Sighting Duration":"Undisclosed","Log Number":"US-03132012-0015","Viewing Distance":"Unknown"}