{"Case Number":"36440","Source":"MUFON","Date Submitted":"03/13/2012 01:47 UTC","Longitude":"-121.33174","map":"<A HREF = \"http://maps.google.com/maps?q=38.702363,+-121.33174(36440)&iwloc=A&hl=en\"> mufon case (36440) map </A>","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Other","files":["/var/www/straped/mufon/html2text/36440.html.txt","/var/www/straped/mufon/org/36440.html"],"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"California","Country":"United States","Object Features":"Unknown","Object Shape":"Circle, Disc, Oval, Sphere","Sighting Duration":"Undisclosed","Log Number":"US-03132012-0008","Latitude":"38.702363","Summary":"Object came down slow , hovered then went straight faster than anything i EVER . Faster than we have here. To Fast!","Disposition":"Unresolved","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around November 15th 2011"],"divs":["Sighting DetailsI took my dog out in front of my house to pee and I noticed a huge object that was roundish if I had to guess but it was so before it was hard to tell for sure. It was coming down very slow and then stopped and hovered . This is when it really got my attention. I thought it was a real close and big falling star but bigger than normal so I thought it was just close. I remember thinking it would hit the Walmart . I also thought it might be a hot air balloon that was lite up for night time or something . I do know I've never sen anything else like it . So it stopped and hovered and then took off fast. I mean fast !!!! Nothing on this earth can move that fast with our military technology much less anything else. DARFA doesn't have this. It covered 10 to 20 miles per second and probably faster than that. Then it was gone . It was for sure a solid Object , not like the Phoenix lights , you could tell it was a real object."],"Tags":"City","City":"Sacramento","Date of the Event":"11/15/2011 12:00 UTC"}