{"Log Number":"US-03132012-0016","Sighting Duration":"Undisclosed","Date Submitted":"03/13/2012 10:16 UTC","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.964094,+-76.901673(36448)&iwloc=A&hl=en\"> mufon case (36448) map </A>","files":["/var/www/straped/mufon/html2text/36448.html.txt","/var/www/straped/mufon/org/36448.html"],"Date of the Event":"08/15/1983 12:00 UTC","Object Shape":"Sphere, Triangle","Tags":"City","Object Features":"Other","Viewing Distance":"Unknown","Region":"New York","Case Number":"36448","Source":"MUFON","Summary":"Huge Triangular ships that passed over silently and Another event of a fast moving light","trends":["There has been one other sighting in Manhattan","There were no other sightings in Manhattan on or around August 15th 1983"],"Object Flight Path":"Straight-line path,Path with directional change","Latitude":"42.964094","City":"Manhattan","divs":["Sighting DetailsThere was a night when I was walking home from a cousins and saw a bright light in the sky. I stopped walking to stare at it to see if it twinkled as I was told it would be a planet if it didn't and a star if it did. This one didn't. What it did do was start moving to the right, slowly. It moved a short distance then went back left a similar distance past it's starting point, then back a bit faster then picking up speed zig zagged back and forth about 4 or 5 times, VERY fast, descending a bit each time and then Shot off to the right Extremely fast! The direction was towards Manhattan. If I had to guess, it was over the city some where. The next Sighting was a few years later, Heading home the same way and again saw a bright light. Again, waited to see if it was going to twinkle or move. Instead it seemed to split in two. Then three, then another appeared below it. The longer I watched the more I realized it was moving towards me and the one below was behind it. It did the same and another appeared behind it. As it got closer I could see it was a ship. I ran inside and got two of my cousins to come out an watch with me. The three of us stood there and watched as these HUGE ships passed over us. They were completely silent and filed the sky above us. They were Triangle shaped and the undersides were covered with Pipes. The first passed over and the second was passing and that was the last I remembered. I seemed to have forgotten all about it and have no idea what happened after. Several years later, I was at work talking with co workers and suddenly remembered that incident. I quickly called one cousin and got the second in on a conference call and then said to the two of them, \"do you guys remember...\" and went on to describe that day and both said, \"Yeah, but that was a dream I had. I must have told you about it!\" but then started arguing over who actually had the dream but I KNOW we never discussed it as if it was someones dream. I can only assume we were abducted and the entire incident wiped from our memories or pushed back to where it seemed like a dream."],"Longitude":"-76.901673"}