{"Object Shape":"Sphere","Date Submitted":"03/13/2012 03:35 UTC","Longitude":"-105.224507","Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","divs":["Sighting DetailsCame home from school about 7:25-7:30p on Feb 29, I live on a bluff overlooking city as I walked to front door with my books in hand I noticed 5 lights in the sky, very bright like at a baseball game, in fact that was my first thought...\"oh there must be a baseball game going on\" at that same moment I realized the baseball park is not over the city but a totally differet direction. I stood there shocked and dropped my books in the lawn and walked over to the edge of the bluff to see what the lights were. 5 large round (orb?) lights were hovering NE over the city not at tree line but well above tree line but not anywhere near where clouds would be. I stood and watched, the neighbor dog (who does not bark at me ever) was barking out over there edge of bluff. My boyfriend was inside sleeping as he works nights, I could not pull myself away from looking at the lights to even go get him. They were solid for a bit then the first 3 lights from left to right would in turn \"go out\" in a line not a blicking thing or a flashing but then would come back on (not a fade in or out either) then the 2 other lights would move around it like a game of tag. Then move back into a line and then almost into a pyrimid which it did 2 times and during this time there was flickering of the seperate lights. I watched for maybe 30 min as it stayed almost in the same area (slight back and forth movement) at the same altitude and then it disapeared completely. It did not \"fly\" away, leave a trail, go up or go down...it just disapeared. I have tried in my head to come up with an excuse for what I saw, I can not even properly explain what I saw because there isnt words to discribe what I saw. At approx 751 I realized my phone was in my pocket-it had not stuck me til that moment to get a photo because I was caught up in what the objects were doing I took 2 photos of poor quality and short video as my cell phone was dead but had enough battery to take the pics."],"files":["/var/www/straped/mufon/html2text/36442.html.txt","/var/www/straped/mufon/org/36442.html"],"Latitude":"38.442659","Case Number":"36442","Disposition":"Unresolved","trends":["There have been 6 other sightings in Cañon City","There were no other sightings in Cañon City on or around February 29th 2012"],"City":"CaÃƒÂ±on City","Summary":"Bright Orange Large Globes Hovering with movement into a pyrimid","map":"<A HREF = \"http://maps.google.com/maps?q=38.442659,+-105.224507(36442)&iwloc=A&hl=en\"> mufon case (36442) map </A>","Weather Factors":"Unknown","Region":"Colorado","Object Features":"None","Source":"MUFON","Country":"United States","Log Number":"US-03132012-0010","Date of the Event":"02/29/2012 07:31 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile"}