{"trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around March 14th 2012"],"Object Features":"Unknown","divs":["Sighting DetailsI was on lunch and in my car. Just finished eating. Thought I would lay back and enjoy the cool air and look at the clear sky and the stars. I was looking at the stars and thinking how calm the clear sky makes me. And all of a sudden 9 stars started moving they began in a triangle shape moved slowly starting from the westerly direction moving across the sky right over top of me which seemed to be 1500 to 2000 feet above me (not sure nothing to help judge by) . By this time I'm hanging out my window in complete aw. Around the lights it was darker then the sky and any real stars disappeared as it traveled across the sky. It made a perfect silo-wet of a triangle against the night sky full of stars. No sound at all was made by this object. As it got over the walmart roof it turned sideways and then flattened back out. then what i could have sworn was a solid object did something really strange, The two back lights at the tips of the rear end changed places and then went to where the began object did a complete 360 roll still going same direction two back lights did the same changing of places then back to where they began. Then the object changed direction with a sharp turn to a north east path. I felt like I was frozen in place and could not move, fear I guess because I'm not a believer in UFO's well I wasn't (AM NOW). I managed to get out of my car and get over to my bosses car who was taking lunch but he was taking a nap, and by the time I woke him up the object was gone.I was jumping out my skin trying to tell him what I just saw. My heart was beating so fast I could feel it hitting my chest."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.309911,+-79.851229(36457)&iwloc=A&hl=en\"> mufon case (36457) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"03/14/2012 03:43 UTC","Summary":"triangle over roanoke va.","Tags":"City","Country":"United States","Latitude":"37.309911","files":["/var/www/straped/mufon/html2text/36457.html.txt","/var/www/straped/mufon/org/36457.html"],"Object Shape":"Triangle","City":"Roanoke","Region":"Virginia","Log Number":"US-03142012-0006","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Longitude":"-79.851229","Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"03/14/2012 10:09 UTC","Case Number":"36457"}