{"Date of the Event":"03/13/2012 09:30 UTC","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.769427,+-89.790463(36454)&iwloc=A&hl=en\"> mufon case (36454) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/36454.html.txt","/var/www/straped/mufon/org/36454.html"],"Region":"Mississippi","Date Submitted":"03/14/2012 02:45 UTC","Country":"United States","Object Features":"Undisclosed","Latitude":"33.769427","Source":"MUFON","Case Number":"36454","Object Shape":"Sphere, Star-like","City":"Grenada","Longitude":"-89.790463","Summary":"Two lights, one larger than the other, seen hovering motionless not far above the town of Grenada, MS.","divs":["Sighting DetailsI was washing dishes & cooking dinner sometime between 9-9:30 when my husband came in the front door and yelled for me to come and look outside. I put down the pan I was washing and dried my hands, then followed him out onto our front porch. He pointed towards the east, and when I looked I thought I saw two very bright stars at first. But the longer I looked at them, the more I realized that not only were those lights not stars, they were much closer than I'd thought. It was somewhat cloudy, but the clouds didn't obscure the lights in any way. The lights were below the clouds. The larger light seemed almost as though it were made up of two or three lights, but all squished together. That light changed slowly as it would concentrate and get brighter, then spread out at dim slightly. The second light was smaller, and did not change at all. Both lights remained in fixed positions relative to each other. My husband used his Android phone's Star Chart app that shows you what stars you are looking at based on the direction your phone is facing. There were no stars that we could attribute the lights to. They also were not the other planets (shown on the star map) as we could see those; these lights were different. Others in town viewed the same thing from various locations in Grenada County. One person got a pic but I'll have to get it from her so I can post it here."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"US-03142012-0004","trends":["There have been no other sightings in Grenada","This sighting has never been favorited."]}