{"Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Object Shape":"Star-like, Triangle","Case Number":"36453","Disposition":"Unresolved","Date of the Event":"02/29/2012 08:30 UTC","City":"Laguna Woods","map":"<A HREF = \"http://maps.google.com/maps?q=33.610301,+-117.72533(36453)&iwloc=A&hl=en\"> mufon case (36453) map </A>","Longitude":"-117.72533","Source":"MUFON","divs":["sighting details event activity on-going 24\\7, feb. 29, 2012 to date (mar. 13, 2012) for nealy 3-years i've sat on my balcony nightly becoming well familiar with the stars, planets and drift of the moon, with the ocasional aircraft, in that i am not in any regular flight paths, and i have never seen anything, that is until feb. 29th aprox. 8:30p (pst). due to trees and buildings, the only view from my balcony is to the sw, out over the pacific ocean. i was looking at a particular star about 30-40-degrees abover the horizon, which has always been a stand alone star. but on this night, it was surrounded by 8 or 10 tiny little white star-like lights that did not twinkle like the star. in a few mopments, one of the lights began to move, first slowly, then diving at about a 45-degree plunge to the se at incredible speeds, followed by the others one by one. at forst i thought perhaps i was watching a meteror shower, but then noticed they were flying a particular flight path, each at their respective elevations, down toward the se, a radical \"s\" turn to the n, then back to the east. later, from a different vantage point, i could see they were all going over our mountains, toward the east, perhaps toward or into the nevada\\arizona\\new mexico area. (?) after watching them for a few nights, i noticed they are visible during the day, appearing as tiny little white dots, a bit squashed top\\bottom, indicating they may be saucer shaped. they travel the same basic flight path from my usualy view to the sw, then eith morphing to or flying into huge equalateral triangular shaped translucent cloud like shapes, which then travel to and hide in the nearest cloud formations. in changing locations, they are visible in all diorections, n, s, e, w and directly over head, all flying consistant, but different flight patterns, depending upon what part of the sky they are observed. they are extremely difficult to see, so most people i've pointed them out to give up looking if they don't instantly see them. well, forget it. your not going to finfd them that easily. however, they are easiest to spot at night, then once familiar with their size and movements, can be more easily seen during the day time. there are literally thousands of them and they have also been sighted in the seattle\\tacoma, wa area, so apparently, it is a very large scale operation. i can't raelly put a number on the number of witnesses; i point them out ever where i go as i have shot extensicve video day and night. they have been appearing 24\\7 since feb. 29, 2012 and are active as i write, mar. 13, 2012. in that they appeared with the advent of the solar flares, i thought perhapsa (pure speculation) they may be some hopw \"harvesting\" energy form the solar flares. any ideas?"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Tags":"City","trends":["There has been one other sighting in Laguna Woods","There were no other sightings in Laguna Woods on or around February 29th 2012"],"Log Number":"US-03142012-0003","Summary":"Night: Thousands of tiny star-like lights (they don't twinkle), flying spectacular aerobatics. Day: Show as tiny white dots morfing into or flying into HUGE equalateral trangular shaped translucent (cloud like), perhapos \"Mother Ships.\" (?)","files":["/var/www/straped/mufon/html2text/36453.html.txt","/var/www/straped/mufon/org/36453.html"],"Region":"California","Date Submitted":"03/14/2012 02:45 UTC","Object Features":"Undisclosed","Latitude":"33.610301"}