{"trends":["There have been 41 other sightings in Fort Wayne","There was one other sighting in Fort Wayne on or around March 12th 2012"],"Region":"Indiana","Case Number":"36460","Weather Factors":"Unknown","Log Number":"US-03142012-0010","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.085583,+-85.137031(36460)&iwloc=A&hl=en\"> mufon case (36460) map </A>","Date Submitted":"03/14/2012 11:47 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36460.html.txt","/var/www/straped/mufon/org/36460.html"],"Tags":"City","Summary":"daylight sighting of large object with apendage from inside bld through window","Date of the Event":"03/12/2012 02:46 UTC","City":"Fort Wayne","Country":"United States","Disposition":"Unresolved","divs":["Sighting Details . I was at the dentist office. I was sitting in the lay back chair in the room waiting for the doc to come in and give me the needles..The chair faces directly at the window and the window is double wide. I was reading my Open Minds UFO mag, in the chair,and decided to watch the cloud cover which was comming directly from the South at the window.after watching the clouds, I noticed a dark object moving the same direction as the clouds. I jumped out of the chair and saw that it was getting closer and moving directly over the bld. I then saw what looked like two red orange appendage hanging down. I did not think to run out the front door and use my cell phone camera....something I regret now..I do find it very interesting that I was reading this ufo mag ,and I see this ...I am a trained observer, and have investigated cases for MUFON some years ago.This is not my first sighting. I first thought it was a balloon, however it was to large and dark,even though it traveled with the wind. I lost sight of it when it went over the bld. ..and as I said. I do regret not running out the front door and using my cell camera....."],"Latitude":"41.085583","Object Shape":"Oval","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-85.137031","Object Features":"Appendage(s)","Object Flight Path":"Straight-line path"}