{"Date of the Event":"07/26/1971 04:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.411057,+-86.647936(36463)&iwloc=A&hl=en\"> mufon case (36463) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Unknown","Summary":"observed a star shaped object high in sky move in a strange patern up,down at strange angles","Log Number":"US-03142012-0013","Object Flight Path":"Path with directional change","City":"Munising","Date Submitted":"03/14/2012 04:23 UTC","Longitude":"-86.647936","Tags":"City","Region":"Michigan","Latitude":"46.411057","Country":"United States","files":["/var/www/straped/mufon/html2text/36463.html.txt","/var/www/straped/mufon/org/36463.html"],"Disposition":"Unresolved","divs":["Sighting DetailsThis is something I will never forget. My parents and myself were driving to Michigan to visit relatives. The road we were on was desilite no lights it was completely flat no hills in sight. It was nighttime. I was sitting in the back looking out the side window at the stars. It was a very clear night and millions of stars. After watching for 10-15 minutes I saw one \"star\" moving. At first I figured it was a shooting star, but it did not burn out. I then saw it change direction several times. It would go one way than take a 90 angle in another direction. We stoped the car and the 3 of us watched for 15-20 minutes continue to do this. I was 21 at the time. We had no explination for this. Finaly the object just disapeared. We did not see another car during this period. At the time people would have just not believed us, but there was no way anything 40 years ago could have changed directions as this did. I have never reported this before, but after seeing a sow about your network I thought maybe it could be of some interest to you. I do apologize for my poor spelling. Val Robert"],"trends":["There have been no other sightings in Munising","This sighting has never been favorited."],"Case Number":"36463"}