{"Tags":"City","Latitude":"41.235699","Date of the Event":"03/14/2012 07:30 UTC","divs":["Sighting DetailsAt 7:30 P.M, my wife and I were on our back deck when we noticed what appeared to be a star slightly to the north about 80 degrees above the horizon. Since it seemed way too bright out for stars to appear we watched it for about 10 minutes total. At first we couldn't tell if it was moving or not. I stood under the roofline and lined up the object to see if I could tell if it was moving against a fixed point. I still couldn't discern any definite movement in about 30 seconds. We pulled up some lawn chairs and watched it some more and saw three flashes of light about 5 - 10 degrees west of the object. It still seemed like it was moving very slowly, so I stood under the roof line again and this time I couldn't get it lined up, it had moved 5 or degrees to the east and maybe a little to the south. After about 10 minutes, high clouds dimmed the object and it finally disappeared. Since it was moving to the east and south it doesn't seem possible that it was a star or planet, and was way too slow for a satellite or the ISS (if that's even visible from here)."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.235699,+-95.796656(36465)&iwloc=A&hl=en\"> mufon case (36465) map </A>","trends":["There have been 11 other sightings in Council Bluffs","There were no other sightings in Council Bluffs on or around March 14th 2012"],"files":["/var/www/straped/mufon/html2text/36465.html.txt","/var/www/straped/mufon/org/36465.html"],"Country":"United States","Region":"Iowa","Source":"MUFON","Object Features":"None","Object Shape":"Sphere","Longitude":"-95.796656","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Disposition":"Unresolved","City":"Council Bluffs","Case Number":"36465","Date Submitted":"03/14/2012 09:05 UTC","Log Number":"US-03142012-0015","Summary":"star light object observed for 10+ minutes, moving very slowly west to east. Also observed within 5 - 10 degrees of object 3 light flashes.","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path"}