{"Object Shape":"Circle, Sphere, Star-like","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Features":"Unknown","Longitude":"-92.456383","divs":["Sighting Detailsok, i had just picked up my fiance maybe an hour and a half before in batesville AR. at first i thought it was a flash of lightning behind a mountain. my friend who was driving thought it was one of the lights that flash so planes and such dont crash into a tower. the flashing was so bright that i could not see it but the light. we got some really bad vibes from it. so we drove like a bat out of hell. but it was almost, it felt like it was watching us. it keep a distance and i could not tell how far because i could not tell the mass of the object. my fiance could not capture it with her cell or camera. from mountain view almost all the way to st joe we could see it following us. and the speed was almost.. if we slowed down it seemed to move away from us. then we sped to get away from it hitting speeds around 115mpg and it stayed right with us. it was at tree top level when we were in the mountains however i could not judge the hight once we got on open ground. i can explain more of it and if i had some type of transport i could go where it was. but the further we got from it the brighter it got."],"Region":"Arkansas","Weather Factors":"Unknown","Latitude":"35.842777","files":["/var/www/straped/mufon/html2text/36477.html.txt","/var/www/straped/mufon/org/36477.html"],"City":"Oxley","trends":["There have been no other sightings in Oxley","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Date of the Event":"02/16/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.842777,+-92.456383(36477)&iwloc=A&hl=en\"> mufon case (36477) map </A>","Disposition":"Unresolved","Country":"United States","Log Number":"US-03152012-0008","Date Submitted":"03/15/2012 03:25 UTC","Tags":"City","Case Number":"36477","Summary":"it was brighter then lightning","Object Flight Path":"Path with directional change,Other","Source":"MUFON"}