{"Case Number":"36475","Sighting Duration":"Undisclosed","Latitude":"41.605251","divs":["Sighting DetailsMy wife and I went outside for a cigarette around 10 pm. We were talking when a bight light in the sky caught my attention. I assumed it was a plane at first. It appeared to have white lights and a very light shade amber light that seemed to pulsate around the object. I asked my wife to turn around and look up. We agreed it was not an airplane, helicopter, blimp, balloon, satellite, or meteor. We watched it for a few seconds when the light(s) turned off. You could still see a dark objection the sky. Then the lights came on again very bright where we could clearly see the location of the object. This happened over and over. The object moved in a way neither of us have ever seen. It appeared to travel huge distances in the blink of an eye. We reacted in amazement and wonder. It's very difficult when you are seeing something that you've never seen before, there's nothing to compare it to in your mind. I couldn't believe my eyes when the object appeared to leave the atmosphere and travel toward space. I kept asking my wife over and over, \" did you see that? It went into space!\" after the event we continued to look at the sky and trade and confirm details of what we just witnessed. There were no clouds in the sky at the time of the sighting. I am replaying the event over and over in my mind. I just read a post on your sight from a woman in MI and it sounds like we witnessed the same thing. Her post encouraged me to write to you about our sighting."],"Summary":"Bright light in sky turned on and off and traveled large distances in the blink of an eye.","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Egg, Flash, Sphere, Star-like, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.605251,+-73.083609(36475)&iwloc=A&hl=en\"> mufon case (36475) map </A>","City":"Undisclosed","Source":"MUFON","Tags":"City","Date Submitted":"03/15/2012 01:49 UTC","Longitude":"-73.083609","Object Features":"Unknown","Log Number":"US-03152012-0006","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/36475.html.txt","/var/www/straped/mufon/org/36475.html"],"trends":[],"Date of the Event":"03/14/2012 10:05 UTC","Object Flight Path":"Path with directional change","Region":"Connecticut"}