{"Source":"MUFON","Country":"United States","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/36470.html.txt","/var/www/straped/mufon/org/36470.html"],"Viewing Distance":"101-500 Feet","Object Features":"Window(s)","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMyself, my husband, my mother and my neice were in the car at the intersection of hwy 17-92 and Dog Track Road in Casselberry Florida in the mid 80's. We were taking my mother home on a Sunday night to the best of my recolection and it was between 11:00 to 12:00 am. I was in the back seat behind my husband who was driving and my mother was in the front passenger seat and my neice was beside me in the back right. We were at the interstection and I heard a very low humming sound and I asked if anyone else heard this and they listend and said yes. We looked up and to the right we saw a huge hovering craft that I myself remember either saying or someone in the car saying that looks like something off of Battlestar Galatica. What would make us say that? It was big, so my husband said lets drive nearer to it so he turned right onto the road ( which I think was the other side of Dog Track Road) and from what I can remember got pretty close under it and we all remember seeing rectangle shaped windows and a few smaller square windows. They appeared to be the colors of Blue and Purple from what we can remember. If there were any windows on the side of it I can only barely remember...but perhaps there was. I myself felt eery about the whole thing and I remember thinking to myself that's strange some smaller square windows would be part of the pattern when really the rectangle ones are more obvious. It stayed hovering and I don't remember anything else after that until I think my husband said lets pull over and get another look but our car was back on 17-92 at that point from what I remember and I said no way I am not getting out of this car. I don't think we were abducted that just couldn't have happened I'm sure some of the memory loss on this is just from over the years of not talking about it. To answer the question of how we lost site of it....when we pulled over on the side of 17-92 would have been after we had driven away from it but I don't remember us driving away from it. So another words I don't remember being near it or seeing the windows anymore or the craft after we stopped and pulled over on 17-92. Hope that makes sense.....we would have had to turn back off of Dog Track Road to be back on 17-92. Whhhooo.... hope you understood that. It's as if we decided to drive and get back on 17-92 but I don't remember that but we did end up back on 17-92. Then we just drove mother home. I myself do not remember any time loss but ever so faintly in my memory I remember mother mentioning something to me about the time on the way home?? Maybe she was just confused because of what we just saw. Supposidly there was a crash of something big on Dog Track Road in 2004 and it shook the residents homes in the area and the ground and had a bright light when it hit. People say Nasa was out there and acted suspiciously quiet and there is a pond there now.....or something of the sort. Maybe they were testing one of these Stealth Blimps I've heard of or something similar....but we had never seen anything like it before or sense. It didn't look like the Stealth Blimps I've seen pictures of but perhaps it was something else from Nasa. It was huge. Even my husband who can't deny this because he saw it too but is a skeptic to most things admits this thing was at least the length of a football field. To bad I never thought to report this before or to pay much attention to it. I just thought we were all freaks. But once I read about that crash in Casselberry....it made me start to look at it again what ever it could have been. Man made or something else."],"Date of the Event":"06/16/1984 12:00 UTC","Date Submitted":"03/15/2012 12:26 UTC","Weather Factors":"Unknown","Latitude":"28.685015","Log Number":"US-03152012-0001","Region":"Florida","Disposition":"Unresolved","Tags":"City","Longitude":"-81.345432","Summary":"Huge! Dark body with blueish and purplelish colored windows (rectangle and some smaller square shaped windows) on the bottom and possibly part of the sides of the craft.","Case Number":"36470","trends":["There have been 6 other sightings in Longwood","There was one other sighting in Longwood on or around June 16th 1984"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.685015,+-81.345432(36470)&iwloc=A&hl=en\"> mufon case (36470) map </A>","City":"Longwood","Object Flight Path":"Stationary"}