{"Date of the Event":"03/14/2012 09:30 UTC","Longitude":"-94.68401","Disposition":"Unresolved","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Summary":"saw from back yard beyond treeline, disc shapes with rotating lights going around it. several planes flew to vicimity of object then made u turn and left.","divs":["Sighting DetailsAt 9:00pm i went out on back deck to read. After about a half hoir i looked up and noticed a particular bright light above and beyond the treeline. Initially i thought of a bright star however i quickly relized it wasan object. If i didnt know the area i may have considered a tower w lights. I continued to watch and it was an elongated football shaped disc with lights rotating continuously.at first it was mostly white lights, but then astream of red lights would go around. The lights seemed to go around at least half way midway from top and bottom. There were then occasional blue lights. I thouvht at first the lights went around randomly, however i watched for about an hour and in that time i realized there was some pattern to it. The object continued to hover at the treeline for 20 minutes or so, i then returned to my book and read for a few minutes. When i looked up again, the object had moved to now being above the hoise that was next to the trees. It was significantly higher as well. I couls still see the lights rotating but not as clearly. It also seemed to now be facing south west rather than directly west facing me like before. At this point i noticed a lot of airplanes. There were various types. I could tell this by their size and the light patterns. Some i figured must be commercial but certainly mot all. Then these one planes came from the southeast with exessively bright lights. Fthese were not ordinary planes, in fact when they turned, i think there were 2 flyimg together. Anyway the plane flew under but in the vicinity of the object then did a uturn and flew back south. This happened 2more times with all turning around aftrr getting near this the last plane went the closest as it was much higher and appeared to fly just past it, and then also did u turn and went south. A short time later the lights just went out., or it just vanished. Unfortunately my phone camera is awful and couldnt take a picture. I should mote that i did come to realize this obkect was very similar to one i saw last summer, and just a few weeks ago. All in samr area, tho before they were much closer, but disappeared pretty quick."],"Latitude":"46.736403","Case Number":"36474","Tags":"City","trends":["There have been no other sightings in plymouth-new hope areas","This sighting has never been favorited."],"City":"plymouth-new hope areas","files":["/var/www/straped/mufon/html2text/36474.html.txt","/var/www/straped/mufon/org/36474.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.736403,+-94.68401(36474)&iwloc=A&hl=en\"> mufon case (36474) map </A>","Object Flight Path":"Hovering then path,Path then hovering","Log Number":"US-03152012-0005","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Disc","Date Submitted":"03/15/2012 12:51 UTC","Region":"Minnesota","Weather Factors":"Unknown"}