{"divs":["sighting detailsafter leaving a bar in mount joy, pa, my cousin and i went to take some pictures of his bmw (i am an amateur photographer) in this area that had a big factory\\train tracks. when we got home, i threw the pics onto my pc and saw the object in the sky. this picture was part of a 3-pic bracketed exposure (three pictures taken one after the other, each with different exposure values +2, 0, -2). this picture just happened to be the one with no exposure value (0). none of the other pics had this object in them. this picture has, in noway whatsoever, been edited\\photoshopped; it is straight from the camera (only thing ive done to this was change the file format from .nef to .jpg)...i've tried to think of many different possibilities as to what could of caused this (i.e. lens flare, light reflection etc.) but i cant. what gets me is that, because this is a night time shot, i have to use such a slow shutter speed (i believe this was like a 4 sec. shutter) and when using such a slow shutter speed, any movement, especially light, will become a blur (with light, it becomes a long blurred line). but, when you zoom in, you will see 6 distinct red lights. if you would like me to send the other pics, i would be glad to do so....thanks!"],"Date of the Event":"03/13/2012 10:00 UTC","trends":["There have been no other sightings in Mt Joy","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Log Number":"US-03152012-0009","Object Shape":"Unknown","Summary":"Strange object with 6 red lights in sky of a picture I took","Object Flight Path":"Undisclosed","City":"Mt Joy","files":["/var/www/straped/mufon/html2text/36479.html.txt","/var/www/straped/mufon/more/36479_submitter_file1___DSC0524.jpg","/var/www/straped/mufon/org/36479.html"],"Object Features":"Undisclosed","Disposition":"Unresolved","Longitude":"-76.5033","Latitude":"40.109818","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.109818,+-76.5033(36479)&iwloc=A&hl=en\"> mufon case (36479) map </A>","Weather Factors":"Unknown","Country":"United States","Case Number":"36479","Date Submitted":"03/15/2012 12:05 UTC","Tags":"City","Source":"MUFON","Region":"Pennsylvania"}