{"map":"<A HREF = \"http://maps.google.com/maps?q=28.682385,+-81.321166(36483)&iwloc=A&hl=en\"> mufon case (36483) map </A>","Country":"United States","Object Shape":"Unknown","Region":"Florida","Longitude":"-81.321166","Summary":"Huge craft in sky with many windows......rectangle shaped and square shaped. Not just 7-10 windows but way more than that.","divs":["Sighting DetailsI didn't refill in all the information again pertaining to the large craft myself and 3 others saw in the 80's because of time constraints at this momemt due I have to get back from lunch to my job. However, I wanted you to know my opinion on my comment of the Stealth Blimp I made yesterday. I was looking at some pictures of this object that has been drawn by experts and computer generated ones as well and I do see one with windows on the bottom of it. However, the problem I have with this being the object we saw is that I remember seeing way more windows than just 7-10 windows like I have seen on these drawings or computer done pictures of these blimps. They say that amber colored lights are on it. However, again the light colors we saw on the windows were blueish or purpleish. I have sat down and started drawing for the first time the windows that I saw and my husband is going to do the same thing tonight. The windows I remember were very large windows and like I stated most were rectangle in shape but had a few square ones in the mix as will which I thought peculure. And there were many of these windows. From what I remember while racking my brain to think about this more is possibly some of the windows were not in line with the others and some were longer than others. Also, the year I choice yesterday was 1984 and that is correct to state in the frame of time to begin with but it could have been from 84-86 when this night occured that's why I said approximate. I'mnot trying to say it wasn't a stealth blimp for sure I just want to point out we saw way more windows than 7-10. Best regards"],"Viewing Distance":"Unknown","Log Number":"US-03152012-0013","Date of the Event":"06/16/1984 12:00 UTC","Sighting Duration":"Undisclosed","Latitude":"28.682385","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Object Features":"Window(s)","Source":"MUFON","City":"Casselberry","trends":["There have been 3 other sightings in Casselberry","There was one other sighting in Casselberry on or around June 16th 1984"],"Case Number":"36483","Date Submitted":"03/15/2012 01:21 UTC","files":["/var/www/straped/mufon/html2text/36483.html.txt","/var/www/straped/mufon/org/36483.html"]}