{"Latitude":"32.463326","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 22 other sightings in Columbus","There were 9 other sightings in Columbus on or around March 30th 2008"],"Region":"Georgia","Object Flight Path":"Stationary","Object Shape":"Star-like, Triangle","divs":["Sighting DetailsI was in prayer both times I was taken up into a stargate where I saw a man humanlike spotted man like a leopard just like on the t.v. show alien nation. He said through telepathy his name was North Star like the car engine, the star. The second time I was in prayer and he was a diffrent spotted man with royal robe on he said I just birthed for the pope's house it was like having a natural child but in the spirit. Then I saw the black flying wing over the treetops and I knew that it was there ship. Then I have seen the stars pulsate and appear as a ship. I also had strange creatures come on me after these encounters and the Lord Jesus said I was in trouble with him because I let these strange creatures come on me. It was not my imagination because a short time later area 51 showed up and they told me they where there to get people married and having natural children by the ships not just seeing the ships. It waas a silver van they where in and he showed me a card, but I donot remember his name and I did not get to keep the card. I tried several people to tell them and they are only interested in people with physical children by the ships. Please help, if you have and know people with these experiences. This happened several years ago but I am still in trouble with the Lord Jesus about this. With the star men I was not afraid but with the strange creatures I was afraid. The black flying wing I saw jsut hung there and then it as gone, the stars when they pulsated and then appeared as a ship . I am near the largest infantry base in the world."],"Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"Went intoa stargate with a man hairless and spotted like a leopard, two different times","map":"<A HREF = \"http://maps.google.com/maps?q=32.463326,+-84.983849(36494)&iwloc=A&hl=en\"> mufon case (36494) map </A>","Source":"MUFON","Date Submitted":"03/15/2012 03:10 UTC","Log Number":"US-03152012-0023","Object Features":"Wings","Date of the Event":"03/30/2008 12:00 UTC","Case Number":"36494","Tags":"City","files":["/var/www/straped/mufon/html2text/36494.html.txt","/var/www/straped/mufon/org/36494.html"],"Longitude":"-84.983849","Country":"United States","City":"Columbus"}