{"Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","City":"Buffalo","Weather Factors":"Unknown","Latitude":"42.954755","Date Submitted":"03/15/2012 05:00 UTC","Longitude":"-78.869606","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Country":"United States","Date of the Event":"03/14/2012 12:00 UTC","Object Shape":"Other","Summary":"White light moving to the east. Stoped. Hovered. red light from bottom merging with white light turning into one Orange object, then turning back the way it came WEST>>","divs":["Sighting DetailsTwo nights I have seen this odd orange orb that sometimes will breifly mimic a plane. On the 14th driving to wegmans food market me and my wife seen a white orb, flight path was east of wegmans then it stoped near by where a star was.. It hovered for a min.. me and my wife were in awe of it in the parking lot..after it hovered for a moment a red light kind of emerged from the bottom...also to mention it was lightly blinking every three seconds... after the red light merged with the top white it turned into a bright orange color and stayed that way as it continued back west towards canada... at which point we were staring it down as it grew further but then it vanished and there was nothing tall enough nor were there clouds for it to hide behind just vanished... I still tryed to find it even after it disapeared... Two hours later while taking my dogs out back.. I seen the orange ORB again blinking.. coming from the Northwest... I see planes here all the time.. but ive never seen an orange plane that moves slow like a helicopter.. Note, this think never made any noise... it moved from northwest to south east... I never could make a shape of it, not even a plane shape the first time i seen... The first time i seen it was a little over a week before this sighting... No planes that fly over my house are silent, Orange, and apear from nowhere.. I will keep an eye out more for this thing so maybe i can film it.."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.954755,+-78.869606(36496)&iwloc=A&hl=en\"> mufon case (36496) map </A>","Disposition":"Unresolved","Log Number":"US-03152012-0016","Region":"New York","Case Number":"36496","files":["/var/www/straped/mufon/html2text/36496.html.txt","/var/www/straped/mufon/org/36496.html"],"trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around March 14th 2012"],"Object Features":"Unknown","Sighting Duration":"Undisclosed"}