{"Log Number":"US-03152012-0027","Object Shape":"Boomerang, Triangle","Latitude":"39.505462","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Undisclosed","Viewing Distance":"101-500 Feet","Date Submitted":"03/15/2012 10:29 UTC","trends":["There have been no other sightings in Hedgesville","This sighting has never been favorited."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.505462,+-78.039889(36507)&iwloc=A&hl=en\"> mufon case (36507) map </A>","Case Number":"36507","files":["/var/www/straped/mufon/html2text/36507.html.txt","/var/www/straped/mufon/org/36507.html"],"Summary":"Huge triangular object with many white lights.","Longitude":"-78.039889","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsI had just arrived home and was in the bathroom when I heard a really strange high pitched whine. It was apparent from the sound that it was moving, so my son and I ran outside just in time to see a HUGE triangular or boomerang shaped object with at least 6 really bright white lights, flying due east directly over my house. It continued on toward the horizon then banked left and flew over the mountain out of sight. My husband arrived home at this point and asked had I just seen that huge flying thing. He had observed it through the trees while coming home up the mountain and had actually stopped his car to get a better look. He observed it hovering over a field near our home, then take off in an easterly direction. My daughter came running in the house about this same time. She had arrived home with me but had been outside getting her baby out of the car and watched it fly directly overhead. It was super huge and flew very slow right over the treetops. It couldn't even have been the 500 ft FAA minimum for rural areas. I have seen C-130s and they're pretty huge but this was way bigger, and much quieter. It made a noise kind of like a blimp but higher pitched, and it was lit up like a Christmas tree, which made it hard to see the actual object.I saw no colored lights like on an airplane. It was the biggest thing I've ever seen in the air, and it was going way too slow to be so big and still be in the air..."],"City":"Hedgesville","Disposition":"Unresolved","Date of the Event":"03/15/2012 12:00 UTC","Tags":"City","Region":"West Virginia"}