{"Disposition":"Unresolved","Object Flight Path":"Path with directional change","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/36508.html.txt","/var/www/straped/mufon/org/36508.html"],"Tags":"City","Log Number":"US-03152012-0027","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around March 15th 2012"],"Region":"Arizona","Object Features":"None","divs":["Sighting DetailsIt was 11:48 a.m. today, March 15th, 2012. At the Elliot and Signal Butte intersection in Mesa, AZ, while in my car on my way to the post office, I observed two flying disc-shaped craft in a very clear blue sky, one speeding in a south to north direction over the west valley, and the second craft speeding in a southeast to northwest direction from the Superstitions. Both craft looked identical, flat like a penny and a bright silvery color. They were traveling very, fast. The sun, at the time,was well behind both,in the southern part of the sky, high overhead. Both traveled too fast to be commercial aircraft. This is not the first time I have observed craft in the middle of the day. I am usually sitting at a stop light, waiting for the light to turn green, with my mind empty and singing along with the radio or cd. Today was no exception. I make it a point to notice any chemtrail action. When I observed the first one, speeding over the west valley area, I said out loud, \"Hey where are you going so fast?\" I blinked and it disappeared. I turned my head to look around for it and noticed another craft heading over the Superstition area. Again I said, \"Where are you going?\" That craft disappeared too. Then I looked back towards the west valley and saw that the first craft re-appeared and continued to speed along in a slight easternly trajectory. I spoke to it again and it vanished over the north Phoenix-Scottsdale area. Then I searched for the 2nd craft and it was still speeding along and I spoke again and it vanished again for the final time. Whatever these were, they seem to hear me speaking to them. I know this might sound strange. Maybe I just should keep quiet so they won't disappear so quickly."],"City":"Tempe","Summary":"Observed 2 disc-shaped craft speeding high above the PHX-Mesa area.","map":"<A HREF = \"http://maps.google.com/maps?q=33.436693,+-111.926838(36508)&iwloc=A&hl=en\"> mufon case (36508) map </A>","Longitude":"-111.926838","Viewing Distance":"Unknown","Case Number":"36508","Date Submitted":"03/15/2012 10:57 UTC","Weather Factors":"Unknown","Source":"MUFON","Latitude":"33.436693","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"03/15/2012 11:48 UTC"}