{"Disposition":"Unresolved","trends":["There have been 20 other sightings in Santa Fe","There were no other sightings in Santa Fe on or around March 16th 2012"],"Source":"MUFON","Object Shape":"Disc","City":"Santa Fe","map":"<A HREF = \"http://maps.google.com/maps?q=35.705598,+-105.946676(36517)&iwloc=A&hl=en\"> mufon case (36517) map </A>","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"36517","Log Number":"US-03162012-0008","Summary":"flickering blue/red/orange lit object in distance flying north of Orion in strange way","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"03/16/2012 12:00 UTC","Latitude":"35.705598","files":["/var/www/straped/mufon/html2text/36517.html.txt","/var/www/straped/mufon/org/36517.html"],"Country":"United States","divs":["Sighting DetailsSanta Fe, NM in the Rockies: Sometime after midnight, facing West from my 2nd story room, I had a direct view of Orion setting as I looked through sliding glass doors (Floor to ceiling, 10', glass doors, 9'). This is the only night since moving in over 6 years ago that I have had the idea to leave my curtains open after getting into bed. Whenever I have had such a random thought from 1981 onward to present day, I usually see a UFO. As soon as I shut off my macbook, immediately I noticed Orion's Belt and beside it, a flickering blue and red or red-orange light traveling from the belt of Orion northward. It was different from airplanes lights, although the blue and red colors were similar, in that the flickering and less sequential way the lights were blinking on and off, plus the haziness and twinkling, were pronounced. I could not be certain of these distinctions until I reached the glass door and slid it open. I knew from other experiences not to take my eyes from the craft, or, it could fade out while my eyes were averted. I watched the craft for another minute or two, as it was taking a long time to traverse the viewing window between the edge of Orion and the wall next to my upstairs deck. I just ascertained that this was \"different enough\" from an airplane to report, although I did not get that \"feeling\" of \"other\", nor any real psychic sense as is common in these instance, other than the fact that I do not normally have a thought come into my mind to leave my curtains open after getting into bed. The fact that this craft would go black between flickers, and then seemingly be a bit above or below the flight trajectory, and was possibly an disk shape with potentially rotating lights, and just the quality of the lights prompted me to report this as a possible UFO....I am not certain. I have seen many UFOs that I have absolute certainty are indeed extraterrestrial, but, this sighting was less certain. Again, no \"other feeling\" accompanied the sighting, no psychic thing, and the lights and flight irregularities were not as distinctive as I have previously witnessed. If anyone else in Santa Fe, NM has seen this object and has more details, I would feel more inclined to put it down as a definite UFO sighting."],"Region":"New Mexico","Date Submitted":"03/16/2012 01:46 UTC","Longitude":"-105.946676","Tags":"City","Sighting Duration":"Undisclosed"}