{"Tags":"City","Date of the Event":"03/16/2012 07:01 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Disposition":"Unresolved","Case Number":"36513","Object Shape":"Fireball","Region":"North Carolina","divs":["sighting detailsi was leaving home to go to school with my mom. we turned left to get off our street onto poplertent and then turned right, infront of our local wallgreens. it was then a straight shot to my school. right infront of us i guess maybe over my school (hard to tell from where i was) was red\\orange glowing lights. we have an airport a few miles down popler tent rd but im used to seeing the planes come in to land. (aviation is an interest of mine so i know planes of many shapes and sizes) so i looked back down to change the channel on the radio. at the top of my vision i saw something shoot across the sky like nothing iv ever seen before. it looked like it was heading toward our local home depot in kannapolis. i looked around and couldnt see it. i asked my mom \"what was that?!\", she busted out laughing saying \"i dont know\". i said immediatly \"that was a ufo\". we passed our local shopping center and i was looking to my right looking for the lights and i saw 2 glowing lights above the light of the sunrise. i beleive it was them. they appeared to be hovering. the close i got to the school th more trees blocked my veiw and i never saw them again. im willing to answer questions."],"Country":"United States","Latitude":"35.40475","Date Submitted":"03/16/2012 09:13 UTC","Object Features":"None, Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.40475,+-80.684855(36513)&iwloc=A&hl=en\"> mufon case (36513) map </A>","Summary":"I looked down but saw a light shoot across the sky threw the windshield. Mom saw it too. 2 red glowing lights in single file shot across the sky, stopped, hovered, and then I lost sight of it.","City":"Concord","trends":["There have been 3 other sightings in Concord","There were no other sightings in Concord on or around March 16th 2012"],"files":["/var/www/straped/mufon/html2text/36513.html.txt","/var/www/straped/mufon/org/36513.html"],"Log Number":"US-03162012-0004","Source":"MUFON","Longitude":"-80.684855","Viewing Distance":"Over One Mile"}