{"Date of the Event":"03/13/2012 10:15 UTC","files":["/var/www/straped/mufon/html2text/36519.html.txt","/var/www/straped/mufon/more/36519_submitter_file2__Galaxy_Sky_3.13.12029.JPG","/var/www/straped/mufon/org/36519.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"03/16/2012 05:00 UTC","Summary":"Multiple UFOs and mothership of different types. 1 star-like 1 quickly flash type(visible) 1 mothership with running lights, emits occasional flame, UFOs enter/exit (not visible to naked eye)","Disposition":"Unresolved","trends":["There have been 8 other sightings in Novi","There were no other sightings in Novi on or around March 13th 2012","This sighting has never been favorited.",""],"Latitude":"42.482665","map":"<A HREF = \"http://maps.google.com/maps?q=42.482665,+-83.455934(36519)&iwloc=A&hl=en\"> mufon case (36519) map </A>","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-03162012-0010","divs":["Sighting DetailsExited Walsh College Novi Campus at 10:05pm. Immediately noticed 2 bright lights due west that appeared too bright and too close to be stars. At first glance, one appears to be star-like and the other looked like a distant glimmering star. The glimmering star was glimmering far too rapidly, and one reminded me of the 2 separate experiences I had in Northern MI. So, I watched them for a while once I entered my vehicle. My vehicle was already facing west. Once stationary in vehicle, I confirmed that they were both in motion, relative to one another, to the ground and my location. I filmed and photographed with both my cell phone and an iPad. While filming on iPad, I could see other entities and lights in the sky that were invisible to the naked eye. The white sphere, star-like orb appeared as a green ball that moved in many directions, zipping up, down, diagonally, and sometimes sort of hovered. While in motion, the green ball moved very quickly with abrupt stops and starts. The glimmering entity also moved around, but it did not appear to make abrupt motions, and appeared much smaller and less bright than the green-white one. It rapidly flashed colors. They were so rapid that it was difficult to tell if there were more than 4: red, yellow, green, blue. There was also a very large entity that seemed to serve as the station or mothership for the orbs. It was dark, like the night sky, and invisible to the naked eye. My iPad was picking up lights and other shiny, iridescent or metallic characteristics that appear to be large corners. The corners, themselves, appeared to be 3 stories by two stories in width. Overall, it is so large that it is difficult to estimate size. It was very low to the ground and very close. In several pictures and video, a string of red lights are visible on the craft, but not visible to naked eye. The back-end emitted bright orange flames a few times, and what appeared to be bluish gases. It appeared that other UFOs were going in and out of the large craft in the video clips on the iPad. My reaction was calm. I was not immediately frightened. I have seen UFOs twice before and I wanted to be sure that I had more video and photos this time. I had to leave, but I wanted to stay longer. Before I left, I noticed a classmate outside smoking near her car. I pulled my car up and asked her to look up and see if she noticed anything unusual. She replied,\"What? You mean the stars?\" I said \"yes, do they look different to you?\" As she replied that they sort of did, I noticed her demeanor changed quickly, like she was frightened. I asked her if she saw that they were changing distance relative to one another. After she saw that she decided to leave immediately and offered to talk more about it at a nearby gas station. She was present at my passenger side window as I filmed a clip out my driver side window. After she left, I also left another minute later. There were more sightings, but not so close or intense, from my home, near Lake St. Clair. All of them were different. I may make a separate report if I have time to do so."],"City":"Novi","Object Features":"Undisclosed","Longitude":"-83.455934","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Cone, Chevron, Circle, Diamond, Fireball, Flash, Sphere, Star-like, Triangle, Other, Unknown","Country":"United States","Region":"Michigan","Case Number":"36519","Tags":"City"}