{"Summary":"looked like a shiny gold blimp.","Log Number":"US-08012005-0007","Object Features":"None","Latitude":"25.956481","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3651.html.txt","/var/www/straped/mufon/org/3651.html"],"Case Number":"3651","Country":"United States","Region":"Florida","trends":["There have been 6 other sightings in Aventura","There were no other sightings in Aventura on or around April 19th 1995"],"Disposition":"Unresolved","Date Submitted":"04/19/1995 06:00 UTC","City":"Aventura","Date of the Event":"04/19/1995 06:00 UTC","Longitude":"-80.139212","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","divs":["Sighting Details I was in my car, on my way home, in which I travel east to west, I was stopped at a red light. I was staring up at the blue sky through the front wind shield, there were no clouds, when I saw what I preceived to be a very shiny blimp. (Pro-player stadium is basically straight ahead of my direction home, so I thought it might be a blimp advertising over the stadium.) The shiny blimp was stationary. As I stared at the object, i realized that it was so bright I could not see an outline, and at the same moment, I realized since the sun had already set in the west, the glare of the object should not have been facing me and so bright, it should have been a dull gray. I realized that this all did not make sense and it could not have been a blimp and with that, in that moment, the object sort of turned and flew off in to the high sky and became a bright star. I kept my eye on it and in a half a second it was gone. I was thrilled and excited. I called the newspaper but they were not interested as well as the local airport except to tell me one piece of information. That was that the object was in the vicinity of what they call antennae garden.( 8 radio antennaes within a perimeter of one mile."],"Object Shape":"Blimp, Disc","Object Flight Path":"Hovering then path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=25.956481,+-80.139212(3651)&iwloc=A&hl=en\"> mufon case (3651) map </A>","Sighting Duration":"00:02:00"}