{"files":["/var/www/straped/mufon/html2text/36515.html.txt","/var/www/straped/mufon/more/36515_submitter_file1__DSC00273.JPG","/var/www/straped/mufon/org/36515.html"],"Summary":"HUGE light appears and then disappears after I took 1 photograph","Object Shape":"Circle, Disc, Fireball, Flash, Oval, Star-like","Log Number":"ES-03162012-0006","trends":["There has been one other sighting in Benidorm","There were no other sightings in Benidorm on or around March 14th 2012","This sighting has never been favorited.",""],"Case Number":"36515","divs":["Sighting DetailsMarch 14th 2012, Benidorm Spain. It was around 11pm at night, I was in my bedroom looking out of my window for anything suspicious happening in the skies. Suddenly, this big light appears to the left, not moving, it was completely stationary. So i quickly rushed to get my Sony H70 digital camera, and tried to shoot a video of the object but the 10x optical zoom could not get close enough, so i switched it to photo mode using VGA quality so i was able to zoom in using 72x special zoom. I managed to take just 1 photograph of the light and then it completely disappeared in the blink of an eye. The whole event lasted around a minute or so. The photo is not in the best quality, although it does appear to be in full focus. I have attached 2 enhanced versions along with the original photograph to give you the best quality possible as the 2 enhanced versions have improved image quality (vivid color and less noise). If anyone else can help me identify the object in the photo then i would greatly appreciate it. (I only have access to limited software.) I am the original owner of the photo and is therefore my Copyright."],"Object Flight Path":"Stationary","Sighting Duration":"00:01:00","Weather Factors":"Unknown","Country":"Spain","Region":"Valencia","Latitude":"38.537043","Longitude":"-0.129077","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.537043,+-0.129077(36515)&iwloc=A&hl=en\"> mufon case (36515) map </A>","Source":"MUFON","Date Submitted":"03/16/2012 11:38 UTC","City":"Benidorm","Date of the Event":"03/14/2012 11:00 UTC","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Tags":"City"}