{"Sighting Duration":"Undisclosed","Latitude":"39.298345","City":"Baltimore","files":["/var/www/straped/mufon/html2text/36522.html.txt","/var/www/straped/mufon/org/36522.html"],"Object Features":"Undisclosed","Object Shape":"Triangle","Disposition":"Unresolved","divs":["Sighting DetailsMy girlfriend(now wife)were riding in my car on road with no lights in surban area on Baltimore county in Rosedale 1972. The road we were on makes a 90 degree bend. Before getting to bend we see an object above the trees with three white lights and one red moving across the sky in the direction of the 90 degree bend. It was big and moving slow, it was dark but we could still see it. After making the 90 degree bend we were going in the same direction as object and it was to our right, ahead and above us. My wife had her head out the window looking at it and I had to slow down to stay even with it. I was looking at it thru the front window for a while but not when it got to the side. My wife and I were freaking out so because it was so low and made no sound. I went ahead of the object and pulled off on the shoulder and we both got out of the car. We could see it comming right over us, not making any sound at all. It looked like it was only 500 ft or less above us and it we hugh. Once the objects gets right over us we could see the dark triangle shape and the three white lights on each corner with smaller red light in middle. The corners of the trinagle were squared off, not sharp. We kept saying to each other \"what is that, what is that\". It was not a plane that is for sure because no plane could move that slow with no sound. It had to only be moving at about 10 mph. It passed over us and we just stood there, frozen and shocked. We then jumped back into car to follow it after it passed. We lost it for a minute and then picked it up down another road and then stopped at the top of a big hill and watched it slowly go off into the night. It never changed height but did change direction, about 20 to 30 degrees to left of road we stopped on which is how we caught up with it. It passed right over many homes and neighborhoods. The next day we thought we would hear something about it but heard nothing.I have not heard about anyone else seeing that exact shape until I just saw a special about the Belgian wave and my mouth dropped and I could not talk, I was once again in shock. The triangle shape they say they saw is the same thing we saw in 1972. The only difference is the three white lights were never bright like flood lights, they stayed dim the entire time this triangle floated above and by us. The red center light and the speed never changed. I guess seeing this special has brought back a flood of emotion and I just had to tell someone about it. I know it is probably not important to you being this late to tell this story. It has never left my mind and I can still see that craft like it was yesterday. The picture that the photographer took sent chills up my spine. Wife and I will never forget that night. Never saw another one to this day. But I am telling you that what was descriped and photographed in Belgium is exactly what we saw in 1972."],"Viewing Distance":"N/A","Summary":"black triangle with dim white round lights at each conrner w/red smaller lignt in middle","Date Submitted":"03/16/2012 08:32 UTC","Country":"United States","Date of the Event":"09/17/1972 12:00 UTC","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around September 17th 1972"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.298345,+-76.602359(36522)&iwloc=A&hl=en\"> mufon case (36522) map </A>","Source":"MUFON","Longitude":"-76.602359","Region":"Maryland","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Case Number":"36522","Log Number":"US-03162012-0013"}