{"Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"40.559236","Sighting Duration":"Undisclosed","Case Number":"3652","files":["/var/www/straped/mufon/html2text/3652.html.txt","/var/www/straped/mufon/org/3652.html"],"Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=40.559236,+-85.595464(3652)&iwloc=A&hl=en\"> mufon case (3652) map </A>","Date Submitted":"08/01/2005 09:57 UTC","City":"Undisclosed","Tags":"City","Country":"United States","Source":"MUFON","Summary":"Not Provided","Object Features":"Undisclosed","Disposition":"Insufficient Data","Date of the Event":"Unknown","Log Number":"US-08012005-0008","Object Flight Path":"Undisclosed","trends":[],"Object Shape":"Undisclosed","divs":["Sighting DetailsNo physical sighting. I have been aware since a teenager that I periodically have injuries that I cannot explain. These were infrequent until I moved to Indiana in 1996 at which time they became frequent, more unusual. None of them are ever painful. When I moved to Indiana I moved into a house that developed a toxic mold problem in spray-on insulation in a crawlspace that was installed after I moved in. I became ill but did not find the cause for two years. I eventually had to leave the house and moved to a condo which I had tested through a biological lab. There was no mold found. However, the condo has developed a problem while no one around me has it. Water gets into the ductwork during heavy rains and I suspect that this has led to the mold growth. Everyone has this problem with the water but I am the only one with mold growth. This has compromised my recovery. I mention this because in my attempt to find out what may be happening to me (and why I keep encountering barriers to getting well) I have been told by psychics and healers whom I have used that the entities causing the problem have installed the mold problem in their effort to keep me ill. It doesn't seem likely but I am presenting this information. For the past year I have had more frequent injuries, often only two weeks apart. A therapist has identified that I have the symptoms of Post Traumatic Stress Syndrome. I have shared with her the injuries and she suspects that if there is an abduction going on that this is interfering with my recovery and keeps suppressing the immune system. About a month ago I noticed that the lower part of the back of my head (the part of the skull at the back of the head that is on either side of the opening for the spinal column)was swollen. While feeling the area I found that there was a scab. I checked the same area on the right side of my head. There was no swelling but there was also a small scab. The left side has healed and the scab is gone. The right side is not healed, the scab is present and the area is painful. However, I have picked at it trying to see if there is something underneath that I can feel. Does anyone at Mufon have any experience with anything like this? Also, the increase in frequency is of concern."],"Longitude":"-85.595464"}