{"Region":"California","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"12/15/1991 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.712575,+-117.94866(36528)&iwloc=A&hl=en\"> mufon case (36528) map </A>","City":"Fountain Valley","Object Flight Path":"Hovering then path","Object Shape":"Other","Latitude":"33.712575","Tags":"City","Source":"MUFON","Date Submitted":"03/16/2012 11:48 UTC","Case Number":"36528","divs":["sighting detailsi was working as an on-duty fountain valley police officer, driving my patrol unit n\\b on brookhurst street on top of the 405 freeway overpass in fountain valley, ca. this was a crystal clear early morning (between 12:00 midnight and 4:00 am) in december, early 1990's. it was at this time i observed 6 very bright horizontal lights above the distance mountain range. as i looked at the lights i thought it was an airplane, and tried to determine if it was coming towards me or away (by the position of the red and green lights). it then it hit me that airplanes do not have blue and yellow lights. (note: this object was in a direct line with edwards air force base, located on the other side of the distant mountain range). being familiar with airplane lights (red, green and white) it immediately struck me as odd that there were blue and yellow lights. as i focused on this object in an attempt to determine which direction it was traveling, it ascended at an extremely high rate of speed, skyward, disappearing. it traveled so fast as to leave a streak(or blur)in it's wake. i have related this to many people over the years, and just recently decided to inquire if anyone else has seen similar lights."],"Weather Factors":"Unknown","trends":["There have been 2 other sightings in Fountain Valley","There were no other sightings in Fountain Valley on or around December 15th 1991"],"Log Number":"US-03162012-0019","files":["/var/www/straped/mufon/html2text/36528.html.txt","/var/www/straped/mufon/org/36528.html"],"Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-117.94866","Summary":"Approx 6 horizontal red, green, white and blue circular lights. Hovered and then accelerated skyward at an extreme speed into space.","Disposition":"Unresolved"}