{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-26.085308,+27.951261(36527)&iwloc=A&hl=en\"> mufon case (36527) map </A>","Region":"Gauteng","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Date Submitted":"03/16/2012 11:40 UTC","Longitude":"27.951261","Sighting Duration":"00:03:00","Country":"South Africa","Source":"MUFON","Case Number":"36527","Object Shape":"Disc","Date of the Event":"03/02/1976 09:00 UTC","files":["/var/www/straped/mufon/html2text/36527.html.txt","/var/www/straped/mufon/org/36527.html"],"Latitude":"-26.085308","Tags":"City","Summary":"\"Hot Metal\" UFO","Object Features":"Other","trends":["There have been 3 other sightings in Randburg","There were no other sightings in Randburg on or around March 2nd 1976"],"divs":["Sighting DetailsAt 9pm CAT I observed a flash of light in the sky in a SE direction looking towards the horizon. I had observed a few interesting lights which I interpreted as aircraft during the evening and twice saw satellites pass directly overhead in low earth orbit. I'm mentioning this as I know the difference between aircraft, satellites and astronomical bodies in the sky. The light that caught my attention was like a flare of plasma or when a gas (like methane) ignites. It was bright and reddish white colour to it. What was interesting is that this plasma looked to have flames only at the edges. At this stage the object was very high and my first reaction was that it was a meteorite entering the atmosphere. I realised pretty fast that this was not the case as I heard no tell tale sonic booms or streaking tail of an object burning up on entry. Instead the object \"drifted\" like a leaf down and to my left, paused in this position briefly ( causing another \"flare\") then drifted down further to the right, paused again (another \"flare\") and drifted down and to the left again. Whilst falling in this manner the object became more visible as a disc and glowing like hot metal out of a furnace. The glow from this heat like effect was making the object stand out nicely against the dark night sky. It had descended about 25km in altitude to roughly a kilometre above the ground. At this stage it stopped the falling motion and moved in an arc towards the west where I was standing observing it (arc went towards the north ending with the object moving westwards right towards my position). It continued to move towards me until it passed directly overhead. At this stage it was about 800m above my head and had a diameter of 80 to 100 meters. This plasma flare with fire at the edges would occasionally occur (mainly when the object changed direction or hight). It remained looking like hot metal the entire time I observed it not changing colour at all. Having observed military and civilian helicopters fly over during the course of the evening I KNEW that this object is NOT a helicopter. It made NO HELICOPTER RELATED SOUNDS. It was NOT A FIXED WING LIGHT OR COMMERCIAL AIRCRAFT. IT MADE NO AUDIBLE PROPELLER OR JET ENGINE SOUNDS. Furthermore it HAD NO NAVIGATION LIGHTS ( RED,GREEN,WHITE LIGHTS THAT ALL AIRCRAFT ARE LEGALLY REQUIRED TO HAVE ON AT NIGHT). It took about 3 minutes for entire sighting from beginning to end and ended with the object moving westwards at LOW altitude IN COMPLETE SILENCE WAS NOT OF ANY TECHNOLOGY I KNOW OF. IT WAS TOO BIG TO BE A TERRESTRIAL AIRCRAFT. IT DISPLAYED NO CHARACTERISTICS OR DESIGN FEATURES OF ANY KNOWN MAN MADE CRAFT. IT WAS COMPLETELY SILENT AND ENTERED SA AIRSPACE FROM A LOW EARTH ORBIT HEIGHT TO ABOUT 800M ABOVE MY HEAD WITH RELATIVE EASE. The object was witnessed by myself and 2 friends that both work for the government at local and national advisor levels. Both of them failed to understand what we had just seen, what was even more upsetting is the fact that hey both refuse to talk about the event AT ALL and have remained silent to the present. I know what I saw, i can draw this object and show its flight path accurately if needed. It was a disc-like craft, 80 to 100 meters in diameter and passed 800m above my head in ABSOLUTE silence emitting no light except for the glow of \"heat of the metal exterior\" marking its presence. I will testify to these facts IN ANY COURT."],"Log Number":"ZA-03162012-0018","City":"Randburg"}