{"Country":"United States","Sighting Duration":"00:00:15","Object Features":"Patterned Surface","Date Submitted":"03/17/2012 01:43 UTC","Object Shape":"Square, Rectagular","Object Flight Path":"Stationary","trends":["There have been no other sightings in Curtice","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.65008,+-83.308781(36530)&iwloc=A&hl=en\"> mufon case (36530) map </A>","Source":"MUFON","Region":"Ohio","Longitude":"-83.308781","Case Number":"36530","Log Number":"US-03172012-0002","divs":["Sighting DetailsI was standing on the back of my boat talking on the cell phone and watching two different commercial air planes fly across the blue cloudless sky (both traveling in two different directions) approximately 10 or 11 in the morning when this seemingly very large rectangle shaped object slowly just appeared in the sky, became totally visible and then slowly disappeared back into the blue sky. The air planes I would have to guess were flying at the usual 30-35 thousand feet. Whatever this rectangle object was it was at least 4 or maybe even 5 times longer than the air planes. the width was about half the length. It seemed to be shiny metallic in color and had either lines on it or it was textured.. could not tell because it was too far away. My guess is that whatever it was, had to be in low earth orbit and maybe the sun reflected off of it at just the right time for me to catch a glimps?? I know it was not the space station. I have seen that many times orbiting over head and this thing was much larger than that and it was not moving as if it was orbiting. In fact it was stationary and didn't move at all. From the time it started to appear until the time it disappeared again I'm guessing was a total of about 15 to 20 seconds. No time to grab a camera or anything."],"Tags":"City","Disposition":"Unresolved","Date of the Event":"07/15/2011 10:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Rectangle shaped ufo seemed to appear out of the blue cloudless sky and then fade back into the blue sky.","Latitude":"41.65008","City":"Curtice","files":["/var/www/straped/mufon/html2text/36530.html.txt","/var/www/straped/mufon/org/36530.html"]}