{"Log Number":"US-03172012-0004","divs":["Sighting DetailsWhen I read your story my hair stood up, we seen the very same thing off in the woods. It looked like someone was up in a tree swinging light bulbs around (they were that big),they also had a insect type movement. We seen 2 and sometimes 3. They would light up and then go out, they were huge! My husband said it looked like a lightning bug on steroids. We had a total of 3 people in the car, and we back your story 110%! Please forgive me, but I have to admit had I not witnessed this with my own eyes and just randomly read your story I would have thought you were crazy.(sorry) : ) I have never seen anything like it. We went back tonight and sure enough they were there, they lite up and then went out, we waited about 5 mins but they didn't light up again so we left plus it was very late. I had a camera ready to make a video too! Tomorrow night I am going back in hopes of capturing this! It's pretty incredible to see. *I used the date March 14 on my report because that is the first night we seen them and they stayed around for the full 10-15 minutes that we were there."],"Longitude":"-86.081999","Source":"MUFON","Latitude":"35.487163","Date of the Event":"03/14/2012 03:45 UTC","Tags":"City","Region":"Tennessee","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.487163,+-86.081999(36532)&iwloc=A&hl=en\"> mufon case (36532) map </A>","Object Shape":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/36532.html.txt","/var/www/straped/mufon/org/36532.html"],"City":"Manchester","Date Submitted":"03/17/2012 05:44 UTC","Summary":"TO THE LADY THAT REPORTED: \"lightningbugs\" size of a Coke can","Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"36532","trends":["There have been 7 other sightings in Manchester","There were no other sightings in Manchester on or around March 14th 2012"],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed"}