{"Object Flight Path":"Straight-line path","Log Number":"US-03172012-0003","Latitude":"42.02489","Source":"MUFON","Case Number":"36531","Date of the Event":"03/16/2012 01:00 UTC","Sighting Duration":"Undisclosed","City":"Ames","Object Shape":"Star-like","Object Features":"Undisclosed","Date Submitted":"03/17/2012 02:26 UTC","Region":"Iowa","files":["/var/www/straped/mufon/html2text/36531.html.txt","/var/www/straped/mufon/org/36531.html"],"divs":["Sighting Detailsames, Iowa, outside smoking apparently near 1am. viewing the stars, when concentrated but dispersed cloud cover came in directly overhead. noticed immediately 8-10 star-like objects fly through the cloud cover first at a slow rate that seemed as though it were the clouds moving, but after a few moments it was clear that the clouds were more or less stationary and these objects were traveling through them at a fairly alarming rate with acceleration after my friend and I noticed them. after about ten seconds all of the stars disappeared into the clouds. no chemtrails. no noise. went back in to get another smoke, came back out and clouds were gone. clear skies. stationary stars. no picture or video, sorry, it happened without warning. also, originally thought the time was around 11pm.. when came back in I thought the clocks were all off by 2-3 hours.. just a note.. I've been trying to convince many of my closest friends and relatives that something is very obviously happening. first legitimate, \"what the heck just happened\" sighting. my friend tried to say they were satellites, but the last time I checked fleets of satellites dont materialize out of nowhere, travel at strange speeds, and disappear just as quickly."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.02489,+-93.623012(36531)&iwloc=A&hl=en\"> mufon case (36531) map </A>","Summary":"viewing the stars with concentrated cloud cover when 8-10 starlike objects flew threw the clouds at accelerated pace","Longitude":"-93.623012","Country":"United States","Weather Factors":"Unknown","Tags":"City","trends":["There have been 9 other sightings in Ames","There were no other sightings in Ames on or around March 16th 2012"],"Viewing Distance":"20 Feet or Less"}