{"trends":["There have been 4 other sightings in Evergreen","There were no other sightings in Evergreen on or around March 15th 2012"],"Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Star-like, Other","Country":"United States","Sighting Duration":"01:00:00","Region":"Colorado","files":["/var/www/straped/mufon/html2text/36536.html.txt","/var/www/straped/mufon/org/36536.html"],"Case Number":"36536","Longitude":"-105.399622","Tags":"City","Latitude":"39.629798","Log Number":"US-03172012-0008","Disposition":"Unresolved","Date of the Event":"03/15/2012 12:00 UTC","Summary":"Pulsating and surging light hovering for an hour near Mt Evans on 2 nights","divs":["Sighting DetailsOn March 15 2012 at midnight, I was in my bedroom. I was walking past my sliding glass door when I noticed a blue colored pulsating light outside, hovering over the tree line. I stood and watched this object pulsate and rapidly change color. At first, the object was blue, then red, then white, then red and then green, orange, yellow. At times, it appeared as if this object would practically surge with power. The lights would burst out of the center of this object in all directions. It appeared in the western sky. Facing Mt. Evans, it was appeared to be just slightly south of Mt. Evans. After several minutes of watching this object, I decided to wake my boyfriend. After waking my boyfriend, we both continued to watch this object. We watched this object for another 40 minutes before the object disappeared. On March 16, 2012 at just after midnight, I got out of bed and walked into the kitchen to get a glass of water. Upon returning into the bedroom, I decided to pull up the curtains on the sliding glass door, and look outside. To my surprise, the object was there again. I immediately woke my boyfriend and we watched this object for about 45 mins before the object disappeared again. We witnessed the same light show. Pulsating and surging lights, changing colors. On both nights, the object eventually disappeared. I am not sure if the lights just stopped, or the object moved away. It just seemed to vanish. After witnessing this object last night, we started to experience some strange, almost paranormal activity in my bedroom and master bathroom. At first, it started with a loud bang. Then we started to experience strange problems with the bathroom lights. Turning themselves off, however, the switch has actually been turned off, which was very strange still we just turned the lights on. Throughout the night, we heard what sounded like loud, heavy breathing coming from the bathroom. This type of strange activity only happened last night, after the object disappeared. We are not really sure if we will see this object again tonight, however, we are prepared this time, with our cell phone camera and another camera. If it returns, we hope to capture this on video."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.629798,+-105.399622(36536)&iwloc=A&hl=en\"> mufon case (36536) map </A>","Date Submitted":"03/17/2012 02:33 UTC","Object Features":"Other","Object Flight Path":"Path then hovering","Viewing Distance":"Unknown","City":"Evergreen"}