{"Region":"Missouri","Viewing Distance":"101-500 Feet","Source":"MUFON","Log Number":"US-03172012-0006","Case Number":"36534","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.09049,+-94.318267(36534)&iwloc=A&hl=en\"> mufon case (36534) map </A>","Object Shape":"Triangle","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around March 2nd 2012"],"Longitude":"-94.318267","City":"Independence","files":["/var/www/straped/mufon/html2text/36534.html.txt","/var/www/straped/mufon/org/36534.html"],"Weather Factors":"Unknown","Latitude":"39.09049","Summary":"Black triangular craft hoovering near cell tower in Independence","Disposition":"Unresolved","divs":["Sighting DetailsI was driving West on Truman Road taking my three boys home after a school function when my oldest son (13) noticed something hoovering very still next to the top of a cell tower which was close to the power plant off of Truman road in Independence, MO. I estimate the cell tower to be about 100-150 feet tall, but it is hard to tell how tall it really is. My son said \"It looks like a car with headlights floating in the air.\" And it did look like a car at first, but as we got closer I could see that it was a triangluar black craft of some type with the flat long end facing our direction and the two front lights that were facing forward appeared to be lighting up the cell tower. There was a third white light that came on in the back of the craft, which was a beam shooting straight downward, but did not appear to hit the ground. The beam stopped in mid-air, which was very strange. All of the lights appeared to be very bright white but with halos of rainbow colors. I've never seen anything like it. All of us (my kids and I) saw this and were shocked, but we have seen other strange things before, so we decided to try to get closer to get a better look at it. So I sped the car up and turned on the next road going nearer the object. It seemed to notice us, and appeared to react by banking slightly to the right and then moving away from us in the opposite direction, then and then shot out of sight at a very high rate of speed and out of sight very quickly. At that point, we realized that it could not have been a conventional aircraft, so I decided to report this."],"Date of the Event":"03/02/2012 09:30 UTC","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"03/17/2012 01:03 UTC","Object Flight Path":"Hovering then path"}