{"files":["/var/www/straped/mufon/html2text/36548.html.txt","/var/www/straped/mufon/org/36548.html"],"Country":"United States","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around March 17th 2012"],"Tags":"City","Object Shape":"Unknown","Date Submitted":"03/18/2012 02:30 UTC","Log Number":"US-03182012-0001","Case Number":"36548","Summary":"sighting with camera footage over transmountain in el paso tx.","Date of the Event":"03/17/2012 11:30 UTC","divs":["sighting detailsapprox. 1130pm saturday march 17th 2012, i went out for a smoke and as usual i looked into the sky as it was a clear night and i love to look at the stars. i noticed what appeared to be two separate light sources very low in the night sky. at first i thought they were just another set of airplanes in a holding pattern for fort bliss\\biggs army air field or the airport nearby. although i did find it unusual that they were coming in from a north western approach as most planes flying in have always come towards the base from a north easternly avenue for landing. after observing these two large lights, i noticed that they were actually stationary and not moving whatsoever as if hovering. being a sceptic, i thought perhaps helicopters, but the lights were too bright and not of the right color patterns for any chinook, blackhawk, hewey or any civilian model that i am familiar with. ( i am a former military member with 13 years experience and i am quite familiar with all forms of aircraft as we are responsible for identifying aircraft. ) after watching these lights for what appeared to be a few moments i realized i had been observing them for approx. 10 minutes as my cigarette had burned down to the butt. yet these objects had not moved from their position. now this had me curious as to what would be hovering over transmountain at this time. recalling what i had seen on tv and realizing no one would believe me without video evidence, i grabbed my droid phone and took a picture of them. then i remembered my phone can record via video so i took two different video shots. one i was standing and was wobbily, the other i was braced for a more stable picture\\video recording. i have over a minute of footage as my phone storage is apparently limited. the objects stayed in position for about 30 minutes and then flashed and disappeared into the night sky. nothing i know of military craft or otherwise can do what i saw or videotaped."],"Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Texas","Longitude":"-106.438379","City":"El Paso","map":"<A HREF = \"http://maps.google.com/maps?q=31.887596,+-106.438379(36548)&iwloc=A&hl=en\"> mufon case (36548) map </A>","Weather Factors":"Unknown","Object Flight Path":"Stationary,Path with directional change","Disposition":"Unresolved","Latitude":"31.887596"}