{"Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/36559.html.txt","/var/www/straped/mufon/org/36559.html"],"Summary":"A glowing, orange-colored light moving north, fast.","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.673295,+-111.837808(36559)&iwloc=A&hl=en\"> mufon case (36559) map </A>","Case Number":"36559","City":"Salt Lake City","Region":"Utah","Sighting Duration":"00:01:45","Date of the Event":"03/17/2012 11:11 UTC","Log Number":"US-03182012-0011","Source":"MUFON","Date Submitted":"03/18/2012 07:17 UTC","Longitude":"-111.837808","divs":["sighting detailslocation: my house along east millcreek in slc, utah. at around 10:20 pm on march 17, 2012, my second friend had arrived at my house. we were all going to watch the movie \"pandorum\", oddly enough. we started the movie closer to 10:55 pm. about twelve or so minutes later, my friend abram had stood up and walked towards the window. nigel (my other friend) and i asked him what he was looking at\\had seen. he stated that for the past few minutes he had seen two orange lights, or \"meteors\" (he suspected), move from left to right (south to the north) at different times. nigel and i were curious and simply told him to tell us the next time he sees one of these lights. we rewound the small part of the movie we had missed and continued watching the film. (i'd like to mention that abram was the only one with a good window view. the television blocks most of the window leaving only about a good foot to look through.) it wasn't long until abram exclaimed \"there it is! ...joe! joe!?\" i was delayed momentarily because at first i thought he was pointing to something in the movie. i soon jumped over to look out the window and sure enough there was an orange light traveling through the sky. we ran outside and down my long driveway without our shoes on. (we wanted to get a better view that was away from all the tall trees in my yard.) we then ran into a church parking lot nearby to get an even better look. (i would at this point like to note that i did have my glasses on and could see everything perfectly.) object\\event description: the object we saw was glowing bright orange with no other colors. it was traveling in a straight path and at a constant speed heading north. the object cruised at or below about 8 kilometers above the ground (way above the mountains in the distance). and it was roughly 10-15 kilometers away from my position. i have seen many planes at night and this was traveling at least twice the speed of a normal plane at that distance. the light was not blinking in any way by \"it's\" own choice. the only blinking, or \"pulsing\", i observed was when it began to enter the cloud cover. and this pulsing was erratic (suggesting that it was caused by the different cloud thicknesses). it soon disappeared into the clouds northwest of my location. the sighting of this one object lasted for roughly one minute. i happened to have my digital audio recorder in my pocket at the time so i have included the audio recording i made. i began recording at the end of my driveway. i do not know what it was. and i might not ever truly know. but still, it was exciting!"],"Object Shape":"Fireball, Sphere, Unknown","Latitude":"40.673295","Object Features":"Unknown","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around March 17th 2012","This sighting has been favorited 1 time.",""]}