{"Date of the Event":"03/13/2012 11:05 UTC","Object Flight Path":"Unknown","divs":["sighting details the first part of the night starts in mount vernon, ohio which is about 16 miles south of my location. i was coming home from the gym and was north of the fairgrounds at the intersection of fairgrounds and old mansfield road. the sky was dark and starless. around 9:30pm as i came up the street i noticed three bright lights overhead. the lights were very bright white and were evenly spaced. they did not seem to move. i couldn't figure it out why on a night with no stars out these three bright white lights would be shining. i drove from mount vernon to interstate 71\\ohio 13 which was about 25 miles away and i looked and noticed the lights from time to time. i drove back home from the interstate exit through the country to my home at 6418 state route 546. i didn't really think much about those lights until my mother comes into the room as i had turned on the tv to watch the twilight zone. my mother then walks into the room and says \"come out into the backyard and see something\". by this time i noticed the sky had cleared and the stars were visible. my mother told me she had been watching what seemed to be the same orbs over the treetops behind our house. my mother and i have witnessed similar star-like orbs before but i wrote them off to being satellites in orbit. then out of nowhere i focus on this white orb slightly to the southwest. when your eyes focused on the orb immediately you could see rays of light radiating out from the center point i counted maybe four or six distinct light beams. i compared it to a pinwheel or a drawing of the bethlehem star. then i noticed over our house straight up was another orb this one was yellowish\\orange. the same exact thing when you looked at it you could see rays of light radiating out from the center. i am 35 and i have watched stars since i was too small to remember. i have never seen a star radiate beams of light at various angles that i could count nor have i ever seen a yellow\\orange star in the nighttime sky doing the exact same thing. i went back inside and watched tv then went out around 11:30 and they were still up there. i gave up watching them because at first i felt well okay this is just another anomaly that nobody will believe. i thought about it the rest of the week then decided to contact mufon to register this sighting of bizarre lights."],"Case Number":"36554","trends":["There have been 2 other sightings in Bellville","There were no other sightings in Bellville on or around March 13th 2012"],"Country":"United States","Object Shape":"Star-like","Region":"Ohio","Viewing Distance":"Unknown","Longitude":"-82.582722","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.569002,+-82.582722(36554)&iwloc=A&hl=en\"> mufon case (36554) map </A>","Summary":"I saw strange lights over my area of Ohio on March 13 2012","Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"US-03182012-0007","Source":"MUFON","files":["/var/www/straped/mufon/html2text/36554.html.txt","/var/www/straped/mufon/org/36554.html"],"Date Submitted":"03/18/2012 04:28 UTC","Object Features":"Unknown","Latitude":"40.569002","City":"Bellville","Tags":"City"}