{"Country":"United States","Source":"MUFON","Date Submitted":"03/18/2012 06:02 UTC","Sighting Duration":"Undisclosed","Log Number":"US-03182012-0010","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI was out in my front yard with my son when we observed this object softball size glowing and darting irratically. We called my husband from inside to observe it as well. He called 2 friends, our neighbors and they also observed it as well. This was not the only time we saw the object. It appeared at least 3 other times in the same area. I would have documented that as well but My daughter had my camera. I am not sure of the date but I do believe that it was in October, around the 29th but I am definately not certain. I didn't even realize that i had captured it until a friend magnified the picture to see what i had taken a picture of. These pictures are what we saw I am sorry they aren't of better quality. We were also shaken by the events as well. The 2 of the other 3 times we witnessed the object it had a straight trajectory path but was traveling to quickly to be a conventional aircraft it was gone across the sky in seconds. The other time we witnessed it with 2 neighbors they agreed there were no aircraft light, it was one glowing ball of light. This time that the 4 of us witnessed it, the actions were like the ones i captured irratic. I am sorry I acnnot be more helpful, but i do have more photos if they will help. We are certain we witnessed and captured evidence of a UFO even if you do not think so. We are certain. If you can tell us what it was that we saw please let us know."],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","Latitude":"30.13103","Date of the Event":"10/29/2011 12:00 UTC","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=30.13103,+-85.588177(36557)&iwloc=A&hl=en\"> mufon case (36557) map </A>","Region":"Florida","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/36557.html.txt","/var/www/straped/mufon/more/36557_submitter_file1__100_1734.JPG","/var/www/straped/mufon/more/36557_submitter_file2__100_1735.JPG","/var/www/straped/mufon/more/36557_submitter_file3__100_1736.JPG","/var/www/straped/mufon/org/36557.html"],"Disposition":"Unresolved","trends":["There have been 19 other sightings in Panama City","There were no other sightings in Panama City on or around October 29th 2011","This sighting has never been favorited.",""],"Longitude":"-85.588177","Case Number":"36557","Summary":"It looked like a glowing softball that changed directions consatantly I have photos of it","City":"Panama City"}