{"Case Number":"36550","Sighting Duration":"Undisclosed","Summary":"Multiple Objects sighted","trends":["There have been 6 other sightings in Dalton","There were no other sightings in Dalton on or around March 17th 2012","This sighting has never been favorited.",""],"Log Number":"US-03182012-0003","Latitude":"42.476614","Date of the Event":"03/17/2012 10:10 UTC","Longitude":"-73.175162","Disposition":"Unresolved","Tags":"City","Object Shape":"Sphere, Triangle, Other","Object Features":"Other","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.476614,+-73.175162(36550)&iwloc=A&hl=en\"> mufon case (36550) map </A>","divs":["sighting detailswitnesses multiple objects, but the main one approached me from the south\\east- i was walking my dog at the dalton sand pits. i looked at it with my image stabilization binoculars, and saw an amazing spacecraft- the only thing that is close to discibing it is a sleek, shiny, bsg-(battlestar galactica). i observed this object approaching me very smoothly at maybe 20k ft agl. i then switched to my handycam - sony hdr-sr11. as i focused on the craft , i noticed an object, zoom at the craft. this reminded me of an astroid that disappeared, or burnt out just before reaching the craft. or being absorbed by it.. the craft headed off to the north and i lost site of it. the video looks like a standard triangle ufo, but that is not what the actual craft was. it had 2 sleak pods, one on each side of the main structure- extending above, like star trek pods. the whole object reminded me of shiny glass or crystal. i will try to attach the pics that i pulled out of the video. the video file is too big, if you need it email me back."],"City":"Dalton","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/36550.html.txt","/var/www/straped/mufon/more/36550_submitter_file1__3-17-12(1).jpg","/var/www/straped/mufon/org/36550.html"],"Region":"Massachusetts","Source":"MUFON","Date Submitted":"03/18/2012 12:26 UTC","Country":"United States"}