{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.623134,+-95.530312(36552)&iwloc=A&hl=en\"> mufon case (36552) map </A>","Object Flight Path":"Path with directional change,Other","trends":["There has been one other sighting in Starbuck","There was one other sighting in Starbuck on or around March 18th 2012"],"files":["/var/www/straped/mufon/html2text/36552.html.txt","/var/www/straped/mufon/org/36552.html"],"Sighting Duration":"Undisclosed","Longitude":"-95.530312","divs":["Sighting DetailsI was standing outside smoking and watching the blinking lights from an airplane as it traveled beyond my sight. Then I looked back to the patch of sky right above me and I saw two red lights traveling side by side.They were moving at the same rate of speed so I thought it was just one craft at first, possibly just an airplane with unblinking lights. But then they began to \"dance\", that is, they switched position with each other rapidly a few times then flew on until I could no longer see them. Immediately I realized what I had just seen had to be UFO's. The manuever they did and how quickly they did it is not achievable by any aircraft I know of, either military or otherwise. It also seems like they were playing or something. . . . why else just randomly switch a few times and then fly on in the same path? I can only say this. I have been waiting for this proof all my life. I have seen other oddities, such as a star-like orange light, far off a couple of times. But the scientist in me was still unconvinced it was anything other than an explainable event. But this. .. .. .this has changed everything. I am absolutely, 100%, without a doubt CERTAIN now. WE ARE NOT ALONE. I don't feel like everything is impossible anymore, i'M SERIOUS! I firmly believe they are out there to observe and maybe even protect us. They would have shown violent intentions long ago if that's why they are watching. They've been here for thousands of years. We have plenty of documentation on this fact. I have been changed by this is all I'm saying. I believe in the unbelievable. I'm so enchanted and GRATEFUL for the experience and hope more people can have the chance to see REAL magic like I got to. Truly amazing and wonderful!!!!"],"Weather Factors":"Unknown","Latitude":"45.623134","Country":"United States","Summary":"was watching airplane and saw two red lights on straight path then they switched spots","City":"Starbuck","Disposition":"Unresolved","Case Number":"36552","Date Submitted":"03/18/2012 01:49 UTC","Object Features":"None","Source":"MUFON","Log Number":"US-03182012-0005","Viewing Distance":"Over One Mile","Date of the Event":"03/18/2012 12:00 UTC","Object Shape":"Circle, Sphere, Other","Region":"Minnesota"}