{"Weather Factors":"Unknown","Log Number":"US-03182012-0018","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.935905,+-74.237587(36566)&iwloc=A&hl=en\"> mufon case (36566) map </A>","City":"Wayne","Object Features":"Window(s)","Latitude":"40.935905","Case Number":"36566","Date Submitted":"03/18/2012 10:41 UTC","Date of the Event":"07/04/1972 12:00 UTC","Source":"MUFON","Disposition":"Unresolved","Region":"New Jersey","Country":"United States","Longitude":"-74.237587","files":["/var/www/straped/mufon/html2text/36566.html.txt","/var/www/straped/mufon/org/36566.html"],"Object Shape":"Disc","Tags":"City","trends":["There has been one other sighting in Wayne","There were no other sightings in Wayne on or around July 4th 1972"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsMe,parents,sister, and cousin where driving home from my cousins house between 12pm to 1am traveling from the direction of Ratzer Rd on Valley Rd heading towards the direction of Riverview Dr. I was sitting in the back of the car and had looked out the back window and noticed a light over the road heading toward us. When it passed over us we were about 100' from the first entrance to High School on right. My parents were talking and I said look a UFO, they first didn't respond then I said it louder look,when it passed over it went slighting in a right direction where at that time there had been a old church converted to a PAL building with a roughly 40'Pine tree next to it,today they are both gone the main entrance is now there. When my mother saw it she said what is that and told my father to pull into the High school entrance. We parked by front doors of school and the UFO was about 6' above the tree the UFO was I would say around 40' diameter and as I can remember seemed as though the top was turning in one direction and the bottom the other and the middle seemed to be all boxed lights not moving with a glowing look now the turning could have been pulsating was never sure. The UFO was stationary for about a minute or two and again as I remember no one in the car was talking. Now in the direction of Preakness Ave which is a hill heading towards Paterson about two miles out you could see a small planes lights flying over Paterson guessing 2000 ft elevation I didn't notice this until the UFO headed that way. When the UFO took off it went in the direction of the plane when it was just above the plane did this in less then a second then went vertical over it and disappeared. I had mentioned it at school to a school mate the following school year whose mother called my mother because the had been in West Paterson that night at a party and saw it. The odd thing was years later when brought up 2 of the 5 had no memory of the encounter Sister and Father. The year 1971-1973 not sure."],"Viewing Distance":"101-500 Feet","Summary":"35 ft above Rd stop over Old Church hovered 2 min then shot about 2mile to plane then vertical"}