{"Country":"United States","trends":["There have been 12 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around November 7th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.82292,+-77.431998(36562)&iwloc=A&hl=en\"> mufon case (36562) map </A>","Case Number":"36562","Disposition":"Unresolved","divs":["Sighting DetailsMe and my girlfriend were leaving a friends house late at night, i took the same back road i always take to get home because its quicker. We were on a two lane road surround by trees an it's pitch black not even a star in sight. we were a about half way home when i noticed in my rear view mirror less than a second a neon blue light flashed behind me just a little than a second later it was over on right of us falling down from the sky. We only saw the bottom of the ship as fell to the ground in a filed of trees. there was no noise no crash no explosion. It was as if the ground opened up and it flew straight into the ground like a underground base was there the trees didn't even move. At this point i knew we just saw a ufo. the bottom of the ship was round and flat like a pizza pan and had neon blue lights on each side that were designed like a sleeping mask u would wear on your face. The ship was black behind that and u could see this greyish white trail as it fell but like a blur.after it fell i wanted to stop and check it but my girlfriend was just wanting to go home. We were in shock at the fact that it was so close to us and we really saw this. this is the first time im telling anyone this."],"City":"Jacksonville","Object Features":"Undisclosed","Date of the Event":"11/07/2011 12:00 UTC","Viewing Distance":"20 Feet or Less","Log Number":"US-03182012-0014","Latitude":"34.82292","Summary":"driving home on a back road surrounded by trees ufo comes straight down into treees no sound no crash as if it went into a underground base.","Sighting Duration":"00:00:02","Longitude":"-77.431998","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/36562.html.txt","/var/www/straped/mufon/org/36562.html"],"Date Submitted":"03/18/2012 08:09 UTC","Object Shape":"Disc, Sphere","Region":"North Carolina"}