{"Region":"Kentucky","Object Flight Path":"Path with directional change","Summary":"Round, bluish green in color, no outside lights, trail behind it, or distinguishing marks on it.","Viewing Distance":"Over One Mile","Case Number":"36569","Longitude":"-84.588293","trends":["There have been 2 other sightings in Dry Ridge","There was one other sighting in Dry Ridge on or around March 18th 2012"],"Date Submitted":"03/18/2012 11:55 UTC","Disposition":"Unresolved","City":"Dry Ridge","Object Shape":"Fireball, Sphere","divs":["Sighting DetailsI was driving down the road I live on around 8:30 eastern standard time. My younger brother was in the car with me, we were coming around a curve and both happen to look up and see the object. At first I thought it was a firework, it was bluish green in color, sphere shaped, it had no smoke or fire trail behind it and no wings, tail, or an engine of any kind that we could see. It was heading west, stopped, came back east for a second or two, then shot west again out of sight. We both stopped talking when we first saw it, i wasn't scared at first when we saw it, more amazed. Once it shot west and we talked about what it could have been and came to the conclusion it wasnt anything we knew of we both got a little creeped out. When shot west it went very very fast, faster then any jet that i have ever seen. Once it was gone it left no trail of smoke or anything to follow.If you deem this case needs to be investigated please call between 11:00 am and 2:00 pm eastern time, I work second shift and would be the best time to catch me."],"Latitude":"38.688792","Log Number":"US-03182012-0021","files":["/var/www/straped/mufon/html2text/36569.html.txt","/var/www/straped/mufon/org/36569.html"],"Source":"MUFON","Object Features":"Unknown","Date of the Event":"03/18/2012 08:30 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.688792,+-84.588293(36569)&iwloc=A&hl=en\"> mufon case (36569) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}