{"Latitude":"40.949966","Weather Factors":"Unknown","Country":"United States","Date of the Event":"03/19/2012 06:23 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.949966,+-72.254238(36574)&iwloc=A&hl=en\"> mufon case (36574) map </A>","Object Shape":"Circle","Region":"New York","files":["/var/www/straped/mufon/html2text/36574.html.txt","/var/www/straped/mufon/org/36574.html"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Wainscott","There were no other sightings in Wainscott on or around March 19th 2012","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","divs":["Sighting DetailsThis was a bright orange colored orb that sped across the sky at approximately 6:23 a.m., this morning. It appeared from the treeline from the west, and went over my head heading east, before disappearing over the tree line in the west. I saw several other orbs earlier this evening, but could not capture them on film. This was very pronounced, and it appeared orange to me, it did not flash, or make any noise. I am so happy to finally have filmed one, despite the clarity and my freaking out a little in the end of this video. I implore you, do not take my word for it. On a clear night, at approximately 5:00 to 6:30 a.m. ish, look up into the sky, and you will see the same things. They are not satellites, planes, or helicopters. Go look for yourself, as long as you get a clear view without artificial lighting. Go to the East Hampton Town Beach, or Wainscott Beach on Beach Lane, or any other area on the East End, South Shore of Long Island. I am now curious to know if these \"orbs\" exist on the North Shore as well. I swear and attest that what I am reporting is true, as I saw it and have been seeing it for 6+ months now. Several family members and friends have also witnessed these and other similar events."],"Tags":"City","Summary":"ORANGE ORBS USUALLY HEADING WEST TO EAST OVER SOUTH SHORE OF LONG ISLAND, NEW YORK","Object Flight Path":"Hovering then path","Date Submitted":"03/19/2012 07:41 UTC","Case Number":"36574","Log Number":"US-03192012-0005","Longitude":"-72.254238","City":"Wainscott","Source":"MUFON"}