{"Date of the Event":"03/13/2012 12:00 UTC","Longitude":"-82.688083","Object Shape":"Unknown","trends":["There have been 2 other sightings in Liberty","There were no other sightings in Liberty on or around March 13th 2012"],"Date Submitted":"03/19/2012 11:25 UTC","divs":["Sighting DetailsIt was Tuesday night on March 13,2012 about 11:00p.m.,I was at home watching t.v with my husband when my youngest son had come home and ran into the house telling me to come quick and look at this strange object in the sky making a weird humming noise and bright red lights. He said he had seen it at closer view when he was driving home, but was off in the distance now, more south of us. At first I thought this was a helicopter but there was no flashing lights on it. It had one or more non-flashing red lights. The object was moving east and then turned on a dime and went west...then back to the east then back west. This object turned back and forth so fast I was like watching a tennis match. It did this about 4 or 5 times. About then a plane was approaching from the south west and the object took off in a southeast direction very quickly and just disappeared. I told my son I had seen this about a month earlier about 10 miles north from of us and also two red orbs about an hour later. Again, I had no explanation of what I had seen on Feb 14, 2012 but this was identical to it and now my son had seen and heard it. The way these objects moved was not a normal movement. It was so fast and turned so quickly. There was no hesitation when it turned...like I said it was like watching a tennis match. As fast as it was going in one direction would turn just as fast and go another direction. I could hear no noise from it. I figured it was too far away but I could hear the roar of the plane that approaching it."],"Object Flight Path":"Path with directional change","Tags":"City","Weather Factors":"Unknown","City":"Liberty","Sighting Duration":"Undisclosed","Object Features":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=34.786062,+-82.688083(36577)&iwloc=A&hl=en\"> mufon case (36577) map </A>","Viewing Distance":"Unknown, N/A","Latitude":"34.786062","Source":"MUFON","Case Number":"36577","Country":"United States","Log Number":"US-03192012-0008","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/36577.html.txt","/var/www/straped/mufon/org/36577.html"],"Summary":"ufo with red lights and humming noise that turned on a dime."}