{"trends":["There has been one other sighting in Snow Camp","There were no other sightings in Snow Camp on or around March 15th 2012"],"Longitude":"-79.496873","Log Number":"US-03192012-0001","Date Submitted":"03/19/2012 12:43 UTC","Latitude":"35.892026","Case Number":"36570","Weather Factors":"Unknown","Summary":"I watched an unknown flying object chased by a jet.","Country":"United States","Object Shape":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","City":"Snow Camp","files":["/var/www/straped/mufon/html2text/36570.html.txt","/var/www/straped/mufon/org/36570.html"],"Region":"North Carolina","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"03/15/2012 12:00 UTC","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.892026,+-79.496873(36570)&iwloc=A&hl=en\"> mufon case (36570) map </A>","Object Features":"Unknown","divs":["Sighting DetailsI was on my computer last Tuesday evening and Wednesday morning. I heard a loud rumbling sound like \"hollow\" thunder. I realized it was coming in my direction very very quickly. As it flew directly over my house it was so low it really scared me. It didn't sound exactly like a jet although my husband woke up thinking he heard 2 jets. The second vehicle was definately a jet. It also flew low over my house. It rattled my windows but the first one did not. I ran to my kitchen window where I have a great vista. The first craft was already about 3 to 4 miles from my house. It had bright red lights across the rear in a straight line. It appeared to be massive compared to the jet that was chasing it, perhaps 3 times the jets wing span. It was headed east southeast when it suddenly \"jumped\" to south southwest. The degree of the \"jump\" was from 9 o'clock to 3 o'clock and the distance it jumped was approximately 5 to 7 miles. One second it was to the left on my horizon and then it was on my right. I did not see the craft moving from one spot to another because it was instantaneous! This was when I knew it was not military. Our planes do not have that capability. The jet that was chasing the craft was far enough behind that it did not have to make a turn in order to follow it. There was no way the jet could catch the object because of its speed and maneuverability. I lost sight of them when they crossed the horizon behind trees that are about a half mile beyond my home. These vehicles were flying very low. It was exciting & scary because they were so low and the UFO jumping amazed me. I cannot express the awe I felt seeing that maneuver."],"Viewing Distance":"101-500 Feet"}