{"Latitude":"30.274248","files":["/var/www/straped/mufon/html2text/36586.html.txt","/var/www/straped/mufon/org/36586.html"],"Case Number":"36586","Viewing Distance":"Unknown","Object Shape":"Circle","Object Features":"Unknown","Date Submitted":"03/19/2012 08:07 UTC","City":"Panama City","Disposition":"Unresolved","Tags":"City","Date of the Event":"09/26/2011 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Other","Source":"MUFON","Region":"Florida","Longitude":"-85.487213","trends":["There have been 19 other sightings in Panama City","There were no other sightings in Panama City on or around September 26th 2011"],"Summary":"My husband and I did not not the onject we saw in September because we have no pictures, however, this was our first encounter with the object and the characteristics it displayed were different. It is very much the same as the on e we saw in October","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.274248,+-85.487213(36586)&iwloc=A&hl=en\"> mufon case (36586) map </A>","divs":["Sighting DetailsMy Husband and I were walking our dog down Lee Court in Panama City sometime in September of 2011. Near to October. We saw a glowing object above the treeline that fle west to east and as it was moving all of a sudden it disapeared. We were shocked and darting to look for the quick aircraft then north-east of where it had just been it re-appeared and went in a direction that looked like up. When we spotted it just as quickly it disappeared again. It appeared once more surprising back almost where we had originally seen it. When I sent the report with the photos I didn't realize you accepted reports with no pics or video. We thought that this was important because we witnessed the very same object, the very next month with friends and got pics. It only disappeared in our 1st encounter, if that matters. At then end a neighbor caught sight of the departure"],"Log Number":"US-03192012-0016"}