{"City":"Conway","Object Shape":"Other","Object Features":"Unknown","Region":"New Hampshire","Object Flight Path":"Stationary,Other","Disposition":"Unresolved","Date of the Event":"03/19/2012 02:15 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.932167,+-71.106826(36582)&iwloc=A&hl=en\"> mufon case (36582) map </A>","Date Submitted":"03/19/2012 02:06 UTC","Latitude":"43.932167","Tags":"City","Case Number":"36582","Sighting Duration":"00:45:00","Viewing Distance":"Over One Mile","Longitude":"-71.106826","Summary":"Object In Northwest Quandrant Of Sky Near Mt Washington","files":["/var/www/straped/mufon/html2text/36582.html.txt","/var/www/straped/mufon/org/36582.html"],"Country":"United States","divs":["Sighting DetailsAt approximately 2:15 am I went outdoors to look at the night sky, I noticed an object in the sky hoving just above the tree line. I watched this object for 5 minutes and then called for my wife to come out and observe what i was seeing. She grabbed her camera(nikon cool pix s8100) with very high resolution. She wondered if she would even be able to get this object on camera? She then proceeded to take 20 pictures in succession, then we observed the object for another 10 minutes approximately, then she too another 18 pictures in succession. It was a clear and starry night, yet when you look at the pictures there are no stars, just a small object of light. When the photos were brought into a higher and closer resolution, the object took form and color and no two pictures are the same. The colors in the pictures that the object appears to be emitting are yellow, dark pink to red, and green. With the naked eye you could see blue, but blue didn't appear in any of the photographs. The object also appeared to move further and closer from view, some of the photo's brought in close are extremely provacative. My wife and i have both never seen anything like this, so we are turning to you in hopes that you will contact us and perhaps view the photos or come to the area to see exactly where this event took place. If you are interested please contact us and we will send you the photos. Thank You"],"trends":["There have been 3 other sightings in Conway","There were no other sightings in Conway on or around March 19th 2012"],"Log Number":"US-03192012-0013","Source":"MUFON"}