{"Latitude":"42.80417","Date Submitted":"03/19/2012 01:56 UTC","Sighting Duration":"Undisclosed","Case Number":"36581","Country":"United States","Object Shape":"Circle, Disc, Fireball, Flash, Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=42.80417,+-89.09111(36581)&iwloc=A&hl=en\"> mufon case (36581) map </A>","Object Features":"Other","Source":"MUFON","Region":"Wisconsin","Weather Factors":"Unknown","City":"Indianford","divs":["Sighting Detailsi was fishing along the rock river when i witnessed a square object with 4 lites, 1 on each corner move from left 2 right over head..i thought what is that..it was moving slow with no sound, so i thought i wonder if i can get a pic of it before its out of sight..i just stared at it then realized i had a phone with camera..by the time i had set the camera up it was out of range, then to my right i saw a very bright light, or ball, or ship, something, and it had several small lites next to it sort of shaped like something but not sure what. i had the phone out to take pic of the first one and got a pic rather clear of a big glowing ball and small lites..they are on my phone, so if someone calls me i can send them..the object lasted a min or two...in hinesight i remember a house light by the river going on and off rapidly about 5 or 10 minutes before the incedent occurd...i was fishing in total darkness with no moon and a pretty clear sky..the ball proceded down the river and was gone.....some one please call me..its a heck of a sighting..also saw a hovering ufo in july of 1994 with 3 witnesses who are very credable..and that happened in east troy wisconsin..i have seen many ODD things fly down the river at night with no sound..this area of todays sighting seems to be a hot area."],"Summary":"saw a ufo went to take pic. it got to far. then i saw another 1 and got pic. all with in 30 secs.","Date of the Event":"03/19/2012 06:01 UTC","files":["/var/www/straped/mufon/html2text/36581.html.txt","/var/www/straped/mufon/org/36581.html"],"Disposition":"Unresolved","Log Number":"US-03192012-0012","Tags":"City","Object Flight Path":"Straight-line path,Other","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Longitude":"-89.09111","trends":["There have been no other sightings in Indianford","This sighting has never been favorited."]}