{"Source":"MUFON","Date Submitted":"03/20/2012 12:18 UTC","Date of the Event":"03/19/2012 11:00 UTC","Disposition":"Unresolved","divs":["Sighting Details1) In driveway having a smoke, looking around at the stars and planes. I do this almost every night before bed 2) Noticed Colored flashing, Non-Moving object thru the trees 3) first thought was a plane flying towards me but it never got closer or farther away. Remained stationary for over 20min. Thats when I grabbed my binoculars. 4)Object 250deg S-SW @ 15Deg Elevation relative to Danbury, CT Verified location with Suunto Dish TV locating meter. Flashing Blue, Red, Green & white lights Watched for 1 hr now. Both sons 20 & 14 observed as well. Nobody believes its a planet, too many colors. Began observation at around 11pm, still there as of this writing. Thinking maybe a planet because stationery, but why all the flashing lights? Red lights seem to be mostly midline and below object, Green, blue and white above. Observed with Nikon 8 X 40 binoculars. Stuck my flip video camera in the lens but no image. 5) I think it's just cool, no adverse reaction. I saw the Thomaston, CT sighting on Dec 5, 2005 as well. Whole family witnessed it. Never reported it. 6) Still there, as far as I know. Cold out! Will verify again at same tomorrow to make sure it's not a planet throwing colors because of atmospheric conditions."],"Case Number":"36599","City":"Danbury","Object Features":"Unknown","Country":"United States","Longitude":"-73.414438","map":"<A HREF = \"http://maps.google.com/maps?q=41.406349,+-73.414438(36599)&iwloc=A&hl=en\"> mufon case (36599) map </A>","Tags":"City","Object Flight Path":"Stationary","Region":"Connecticut","Log Number":"US-03202012-0001","files":["/var/www/straped/mufon/html2text/36599.html.txt","/var/www/straped/mufon/org/36599.html"],"Weather Factors":"Unknown","Latitude":"41.406349","Sighting Duration":"Undisclosed","trends":["There have been 8 other sightings in Danbury","There were no other sightings in Danbury on or around March 19th 2012"],"Summary":"Non-Moving Colored Object - Range 5 Mi?","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Oval"}