{"Source":"MUFON","Object Shape":"Disc","Latitude":"41.588554","Object Features":"Undisclosed","Sighting Duration":"00:03:00","Log Number":"US-08022005-0006","Date Submitted":"09/01/1973 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.588554,+-71.471839(3660)&iwloc=A&hl=en\"> mufon case (3660) map </A>","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","City":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-71.471839","divs":["Sighting Detailsaround dusk...the electrician and my older brother then around 11 or 12 ran in the house, my brother told my mom who was then washing dishes..MOM!! MOM!! theres a flying saucer out side..theres a flying saucer out side!!! My mom said \"your crazy\".. The electrician said \"Lady, if thats not a flying saucer, then its a round plane\".. I then along with 2 of my sisters ran to the storm window in the living room, nelt down and looked up to see a silver disk in the sky...with multi colored lights going round the disk but in no curtain direction..with no noise from the craft... i remember thinking to myself as a child, how is this spining in the sky but not going zig zag as a top would do if you spin it?? the craft just moved in a straight line.. I followed it with my eyes as long as i could until it passed in the direction over my house...i never forgot what happened there and remember as a child when i used to go out side the house and play basketball, i would look over in the woods and thing what if they landed there??? and i would get my ball and run back in the house... writting this right now makes me really realize that i as a child had nothing to gain by going through this or remembering this but you know what?? i still dont want anything, its just the TRUTH. I would like to know if there was anyone in Johnston, R.I. that saw the same . thank you Gary p.s. I hope this isnt some goverment mis information sight... just to make everyone think where fruitcakes but 75% of what we see on TV is fruitcake stuff... : )"],"Summary":"johnston, R.I. (I along with others say flying silver disk)","files":["/var/www/straped/mufon/html2text/3660.html.txt","/var/www/straped/mufon/org/3660.html"],"Region":"Rhode Island","trends":[],"Country":"United States","Tags":"City","Disposition":"Unknown","Case Number":"3660","Weather Factors":"Unknown","Date of the Event":"09/01/1973 06:30 UTC"}