{"Weather Factors":"Unknown","Country":"United States","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Log Number":"US-03202012-0005","Object Features":"Unknown","City":"Danvers","Longitude":"-70.937945","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Case Number":"36603","trends":["There have been 2 other sightings in Danvers","There were no other sightings in Danvers on or around March 15th 2012"],"Date Submitted":"03/20/2012 04:40 UTC","Latitude":"42.550725","Date of the Event":"03/15/2012 09:20 UTC","Source":"MUFON","Summary":"single orb, then meteor, then 3 f-16s flying toward orb, 2 hours later. orb seen again","map":"<A HREF = \"http://maps.google.com/maps?q=42.550725,+-70.937945(36603)&iwloc=A&hl=en\"> mufon case (36603) map </A>","Disposition":"Unresolved","Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/36603.html.txt","/var/www/straped/mufon/org/36603.html"],"Tags":"City","divs":["Sighting DetailsWe were sitting, drinking coffee, talking and looking out the sunroof as usual. We both spot and orb moving right to left above us, very high in the sky. Was not pulsating, just an orb-like dot moving along. We were amazed to say the least. As the object was almost out of sight, a meteor-like object displayed above us and disappeared quick like a comet or a meteor shower. But it was only one. About 1 min after that I saw a bright light flash in the cloud above us and 3 f-16 planes appeared parallel to each other moving in the direction of the orb. Also this is probably unrelated by I should mention that right after that I witnessed 10-12 albino bats flying around within 20-30 feet from us. About 2 hours after that, we were still there as another business partner showed up. Around 11pm or sometime between 11-12, we all witnessed a second orb identical to the previous one. It was flying at the same rate of speed but a different direction. Sightings like these don't change my life, weird things happen around me all the time but I thought it would be cool to post as their were 5 strange things in one evening."]}