{"Weather Factors":"Unknown","Case Number":"36615","Region":"","Disposition":"Unresolved","Object Shape":"Unknown","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/36615.html.txt","/var/www/straped/mufon/org/36615.html"],"trends":["There have been 5 other sightings in SCARBOROUGH","There was one other sighting in SCARBOROUGH on or around March 20th 2012"],"Latitude":"54.297632","Date of the Event":"03/20/2012 07:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","divs":["Sighting DetailsShortly after 7pm, in the North Bay of Scarborough, UK on a beautiful crisp and clear night about 15 independent people witnessed what can only be described as UFOs ie. unexplained Flying Objects. From an initial flash which appeared like a 6 light flare that ran along the sky in white,red colours and extremely bright about 1mile out to sea that appeared horizontally, flares do not appear horizontally! The lights in the sky seemed to have 2 central brighter and larger lights which panned-out to form a straight line of light with 3 smaller lights either side giving approx 6 lights in total. In the distance way above the horizon line was a permanent light which seemingly randomly changed green, reddy orange,white stationary light in a non-sequential manner no this wasnt a star, helicopter or aircraft. This light seemed stationary for at least 5+mins then disappeared, reappeared then 2 other smaller lights appeared at varying stages adjacent to the initial light. A 2nd horizontal light burst was witnessed by all there and active discussion was had along with attempts to see what the lights were through 2 x sets of binoculars. Several of the witnesses were local fishermen and one of them stated he seen one of the lights zip along the sky and abruptly halt, then seemed to disappear shortly before we arrived at just after 7pm. We all witnessed the lights start moving, stop moving, appear randomly, move in diagonal and at previously unobserved speeds for a known aircraft. There was also no noise and we were in a bay with virtually zero wind so sound would have traveled and been observable. If this was a military aircraft exercise, it surpassed all expectations or knowledge of all those present who witnessed this event in terms of what military aircraft can do! It was a very eye-opening, interesting observation for all those who saw this strange & exciting spectacle."],"Object Flight Path":"Stationary,Path with directional change","Date Submitted":"03/20/2012 07:36 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=54.297632,+-0.409659(36615)&iwloc=A&hl=en\"> mufon case (36615) map </A>","Longitude":"-0.409659","City":"SCARBOROUGH","Source":"MUFON","Log Number":"GB-03202012-0017","Object Features":"Unknown","Tags":"City","Summary":"Multiple witnesses to multiple strange moving lights, Scarborough, UK sighting 20th march 2012."}