{"Sighting Duration":"00:00:10","Region":"Texas","Country":"United States","Tags":"City","Disposition":"Unresolved","Object Shape":"Sphere","Date Submitted":"03/20/2012 09:40 UTC","Log Number":"US-03202012-0021","Object Flight Path":"Hovering then path","Longitude":"-99.503782","Latitude":"27.516367","Date of the Event":"08/01/2006 08:00 UTC","trends":["There have been 21 other sightings in Laredo","There were no other sightings in Laredo on or around August 1st 2006"],"Summary":"a green orb twice the size of a basketball. it floated over a roof gracefully. I was shocked and I felt like it was shocked too. it stopped in mid air a quickly zoomed back in the direction it came the instant it saw me. it panicked . Ii know it was as sI","divs":["Sighting Detailsi was at a barbecue at a friends house. We were sitting in chairs under a patio roof, but my chair was not under the roof. Then a green ball like twice the size of a basketball floated over the roof. I quickly stood up shocked and as I shouted, \"Holly Molley! What the hell!\" the think freaked out. it stopped mid air. in an instant it shook back and forth as if not sure where to go. I don't know how I know, but the thing panicked and zoomed back the direction it came over the roof. I stood up and gave chase. it was gone. it was green, it glowed like a glow stick. I was a solid sphere. No one else saw it and I was the but of jokes for days after the fact. I know what I saw. I was sober and clear headed. I haven't spoken of it since because I've been made fun of every time I mention it. it was less than 20 ft from me. I saw it clearly. Ramon Amezcua, Jr., RN., MSN., FNP-BC"],"Object Features":"None","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.516367,+-99.503782(36619)&iwloc=A&hl=en\"> mufon case (36619) map </A>","files":["/var/www/straped/mufon/html2text/36619.html.txt","/var/www/straped/mufon/org/36619.html"],"Case Number":"36619","City":"Laredo","Source":"MUFON"}