{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/3661.html.txt","/var/www/straped/mufon/org/3661.html"],"Source":"MUFON","Country":"United States","Case Number":"3661","Sighting Duration":"Undisclosed","Object Shape":"Cylinder, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=39.172468,+-119.758293(3661)&iwloc=A&hl=en\"> mufon case (3661) map </A>","Region":"Nevada","Log Number":"US-08022005-0007","City":"Carson City","Viewing Distance":"20 Feet or Less","Longitude":"-119.758293","Summary":"Gazing right inside and making eye contact......lost time.","Disposition":"Hoax","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Date Submitted":"03/31/1996 12:00 UTC","Tags":"City","trends":["There have been 9 other sightings in Carson City","There were no other sightings in Carson City on or around March 31st 1996"],"Latitude":"39.172468","divs":["Sighting DetailsIt was around 11:00 P.M. I was driving my car to home in Dayton, Nv. It was a Friday night. I am not sure what the date was other than the Year and Month. It was April of 1996. This is a real true encounter and I do not wish to be known. It has been actually a hard thing for me to deal with in my life. I was actually going to go home to grab my guitar. I was a 25 year old guitar virtuoso. My indian friend from the Hopi tribe in town was waiting for me to come back. I was a kid, just trying to have some fun on a Friday night. So now I am going to put into perspective the events that happened, true and factual. I will have you know straight forward that this story is complete and true. I will send drawn pictures soon. So I was driving in my Dodge Rampage on Hwy. 50 East in Moundhouse Nevada. My window was down. The air was blowing on my face. I had my radio tuned in and up fairly loud. My speakers sucked with some distortion, but it was cool with me. I was on my way home to grab my guitar at 11:00 at night. I was intending to get there as fast as possible cause I wanted to create some music with my friend Chris, the Indian. So it was already late and I knew I had to hurry. I had nothing else to do. I passed the Virginia City turn off on the left. As I passed it I noticed some light on the hills at the mouth of the Canyon there. There were 4 lights. They were a whitish blue and very very bright. They were lighting up the sagebrush actually on the hillside on the west side of the VC Highway. They were about 50 to 100 feet off the ground. I was driving so, I saw the lights but I looked away as I was driving. I was thinking to myself thats a low jet. I thought it was a jet plane coming from Reno. I looked back at them. They were still in the same spot some 30 seconds later. Then I began to wonder. What the heck is that. Must be a helecopter I thought. Then I really began to stare. No it's not a helecopter. I knew it was no helecopter or plane. Yet, I could see no object, only lights. They were not moving. I could see the brush on the hill bright as day. I saw some things moving in the brush. Little objects scurrying about very quick like that of coyote's or something. My heart began to thump. The adrenaline kicked in as I realized this was something different than that I'd ever seen. I was driving still and slowed down so I could see more of it. I was very realized and already had a hunch it was a UFO. I said out loud, \"Haha yeah you know I can see you.\" As soon as I said this, the lights began to turn. They were no longer shining on the brush. They span approximately 100 yards apart with 2 on top about 30 yards apart and the lower ones at the sides about 100 yards apart. They looked like the lights in a stadium kind of. They were very big and bright. There were no other cars behind me I could see lights from nor in front of me. My heart was racing fast. I was frightened. I no longer was really watching the road. The lights had my total attention. They turned around and began slowly hovering down the Canyon towards the Highway I was driving on. There were then smaller lights below the larger ones that were blinking in succesion around and repeated. Thats when I realized it was a round object. I was freaking out. My eyes were huge I'm sure and I was awake and ready to notice every detail. The lights came closer down the canyon as if to head me off at the pass. Like direct coordinates at my speed to meet me at a certain point ahead. I knew I was heading straight towards them at the same time. I was afraid, yet I was curious. So I kept driving and looking as they became larger and closer. I was amazed. Entranced by the realization and curiousity I barely even looked at the road ahead. I was just staring out my downed window. My radio became all fuzzy and then was silent. My car was driving fine. Soon there became an embankment on the side of the Highway that separated the lights from my vision. I knew from driving the Highway many times that the embankment recedes as you approach Dayton hill where the Canyon is. I also knew the thing was moving down the canyon at the same speed I was. The suspense was incredible. I came to the hill and as soon as the Embankment receded, there I saw something that I will never forget for the rest of my life. I was at top the hill and the Canyon beside me on the left. Right there as the ground cleared way, I was gazing into the middle of a set of windows! Yes, this was real. I was not even watching the road. I was mezmerized by the depth. I was staring straight into a spacecraft from another world. It was indeed a saucer. Yes, there were long windows draping all the way across and around. I saw the tiers or stories, the floors. I saw the walls. Everything inside was white. This was incredibly astounding. I had no clue what to think or anything. All I could do was stare and observe.It was like I was above it and as I went down the hill I became level with it. On the left bottom story in the windows were aliens that I first saw. There was a female. They all were wearing white robes. She had a bracelet and a necklace on, that of gold or silver and makeup like blush on her cheeks. Her arm was on the shoulder of a younger one, a boy and they were looking right at me. Right into my eyes they were. She nudged herself to him and spoke to the other younger children along the window maybe 10 or so more. They were all smaller like a 5 year old. She was talking to the older boy and them without speaking! And me! I felt a joyful feeling inside as they gazed into my eyes and she then smiled and pointed at me as to show them that I understood her and them. Her long finger, their faces grey. She had 3 fingers and a thumb. I then had a terrible feeling. I looked up to the second story. There was 2 beings there in the middle of the room. I was about level with them I think. The being I first saw had a long draped back skull like that of the movie alien kinda but the face any eyes of E.T. His skin was chocolate brown and he too was wearing a white robe. His skull was maybe 2 feet long behind his head draping down. His face looked a lot like E.T. The kids faces below looked like the alien pictures you often see yet their eyes weren't black. Their eyes were shaped like the pictures but they were white with irises. Blue eyes, the girl had green eyes. The one with the draped skull on the second story was standing and holding a clipboard against himself in his white robe. I noticed all that stuff as he noticed me. His mouth dropped! His eyes bulged! As he realized I was looking at him and them and He was staring straight into my eyes! He was frightened that I saw him. It was deffinately not part of his plan. His eyes were white with huge blue irises and pupils. I'd estimate I was 20 feet from his face. I made contact alright. He immediately turned to the other one in the room in front of him. The one in front of him was sitting. I saw the side view of him but only his head at the time. He had a human like head. Not a draped skull. I could see wrinkles all over his head. It made him look very old. No hair on any of them whatsoever. He was not in white. He was wearing a black suit from what I could see. He turned his face toward me! Right after the one with the clipboard looked at him after seeing me! He turned his face toward me. Ohhhh Myyyy Goddd was I scared!!!! He was so so so so so old looking it sent shivers all over me. His face was all wrinkled and old and his eyes all beady! They were pure black. As he and I stared eachother in the eyes I realized he was a man. He was a human. He must've been thousands of years old and very wicked. I was petrified. I was scared shitless. He gave me this snarling look yet at the same time I could see his smarts. There was some kind of bigscreen in front of him blinking at the outer rim of the windows edge at the end of the ship windows on his floor. He then looking at me directly, raised his hand up with a very long finger and smiled or smirked as he hit a button on some kind of panel in front of him. Instantly! The windows covered themselves with a fanlike shell that was that like of ripples like of a Chinese fan decending from the top. Corrogated riffles about 1 foot high each decending from the top to the middle. They were breathing like and sparkling with colors. I noticed that they were very sharp looking like razor blades all on the top along the riffles.They could cut through anything! The bottom sealed up and began blinking lights around in succession. That must be how they do their airports. That must be their laws or regulations I thought. Then it began to spin. My window was still down and I was close to the bottom of the hill as I heard the riffles begin to hummmm! They sounded like they were some kind of giant fan blades. The object tilted at about a 45 degree angle. As it spun faster and faster I could only see the outline of it. Like it was suddenly cloaked. Kinda like a rim on a car as it spins. It spun so fast it began to become invisible. It then shot up into the sky leaving a small white trail behind for a split second. I was petrified. I had reached the bottom of the hill and pulled over. I had to look through my rear view mirror to switch lanes from traffic. I pulled over and got out of my car. I looked up. I wanted to see it more. It was sunny outside. There were cars going by. It only takes 3 minutes to get down the hill. I was at the top at 11:00 P.M. and the bottom around 8:30 or something. Yet, I didn't even realize this. Not at all. I had no conception of time. I was tired. I went home and crashed out. I woke up and remembered the hill. I don't know how it was daylight when I got to the bottom of a 3 minute hill at 11:00. I don't remember anything between that time accept for driving down the hill. I have only told a handfull of people this story. There's more to it as well in the day and the months that followed. I will tell more if I get a chance. I want to send sketches so I will begin the drawings from memory tonight."],"Date of the Event":"03/31/1996 12:00 UTC","Object Features":"Window(s), Insignia, Louvres"}