{"Tags":"City","Object Features":"None, Other","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=-26.148863,+27.950222(36612)&iwloc=A&hl=en\"> mufon case (36612) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36612.html.txt","/var/www/straped/mufon/org/36612.html"],"City":"Randburg","Sighting Duration":"00:20:00","Object Flight Path":"Straight-line path","Case Number":"36612","Latitude":"-26.148863","Country":"South Africa","Date Submitted":"03/20/2012 06:45 UTC","Object Shape":"Disc, Sphere","Log Number":"ZA-03202012-0014","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 3 other sightings in Randburg","There were no other sightings in Randburg on or around March 20th 2012"],"Longitude":"27.950222","Date of the Event":"03/20/2012 10:45 UTC","divs":["Sighting DetailsAt 10:45pm CAT I walked outside our house to have a cigarette and looked up to see atleast 5 or 6 objects in a staggered formation in the sky. They where all at various altitudes ranging from very low to horizon (from my vantage point) to very high altitude. they were glowing red to orange and each one was a different intensity and colour. I noticed them as they were manoeuvring around quite vigorously in the sky. I immediately ran indoors to call my housemate to come look at what was in the sky. We both then went out and witnessed each of the craft move slowly up into the sky and at high altitude seemed to disappear. By 11:00pm the last of the objects faded out and we then thought they were gone. I tried to get picture and video on my cellphone but the camera could barely make them out. I then noticed my housemate had a much better camera with a really big lens on it. He said he got a few snaps of them. Then suddenly I noticed one of the craft coming directly over our heads at height of about a 1000 meters. It was glowing white but in a very faint fashion. It was clearly a disc-shaped craft and moving as fast as a helicopter would but in COMPLETE SILENCE. As it passed over it appeared to have a smaller glowing orb (spherical shaped) craft come out of the centre of the disc and drop down and move away in a westerly direction. The main (or bigger) craft continued at the same height in an south westerly direction. Again we managed to get some pictures before the object disappeared behind the trees. The formation of the craft where originally to the north of our position (Northcliff looking north towards Midrand area). The disc with the smaller orb like craft where heading in the direction of Soweto, the smaller craft after detaching and moving in the same direction then veered westward toward Roodepoort. Entire sighting lasted roughly 20 minutes. There was no wind, conditions where clear and mild with no clouds. Venus was clearly visible directly north west of where we first saw the formation of craft and its a new moon here tonight so that rules out astronomical objects entirely. Will supply photos ASAP once we download them of the camera."],"Region":"Gauteng","Summary":"Multiple U.F.O Sighting Northcliff, Johannesburg, South Africa 10:45pm 20/03/2012"}