{"Tags":"City","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=51.256165,+-85.320614(36622)&iwloc=A&hl=en\"> mufon case (36622) map </A>","Summary":"7 lights that went from the eastern sky to the western sky in about 2 seconds!!!!","Date Submitted":"03/20/2012 11:02 UTC","Disposition":"Unresolved","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/36622.html.txt","/var/www/straped/mufon/org/36622.html"],"Object Flight Path":"Straight-line path","trends":[],"Source":"MUFON","divs":["Sighting DetailsMarch 20, 2012 Approximately 2100 hrs I was out on my deck and I just finished putting together a new patio set I just bought. I was sitting down in my chair facing the north sky enjoying the night stars as they appeared during the evening and after a few minutes watching several airplanes fly through the sky all of a sudden I saw seven lights in a row fly from the east to the west in about 2 seconds!! These lights seemed to be connected and moving together at the same time. It happened so fast I couldn't believe it. After this event, I did see more airplanes and I timed them during the exact field of visiion and determined what I saw was not a regular airplane. These planes took about twenty to thirty seconds to past thru the same window I saw the UFO. I am a electrical professor and I have had Ten years with the Canadian Air Force so I know the differnece between an airplane and anything else. I live next to an airforce base and I really don't know if there weee any military activites at that time but I seriuosly doubt it. This experience has intrigued me and scared me at the same time. I have always an interest in the possibility in exteristial life but I never thought that I would ever see anything. This sighting has thrown me in a loop. I love the idea ht I believe that there is other life out there but I am also concerned."],"Sighting Duration":"Undisclosed","Date of the Event":"03/20/2012 12:00 UTC","Longitude":"-85.320614","Viewing Distance":"Unknown","City":"Undisclosed","Latitude":"51.256165","Case Number":"36622","Region":"Ontario","Object Shape":"Other, Unknown","Weather Factors":"Unknown","Log Number":"CA-03202012-0024"}