{"trends":["There has been one other sighting in Henderson","There were no other sightings in Henderson on or around"],"files":["/var/www/straped/mufon/html2text/3662.html.txt","/var/www/straped/mufon/org/3662.html"],"Weather Factors":"Unknown","Log Number":"US-08022005-0008","Object Features":"None","divs":["Sighting Detailsaprox. 11 pm, starry nite, no moon, I was getting irritated with all the apache helicopters flying over my house, seemed like this route was the mississippi flyway for choppers, a string of 4 or 5 choppers had just flown by,I was standing on my front porch as they went by watching them fade off into the distance, I looked back in the direction they had come from expecting more when I noticed just above treeline the stars disapearing at the leading edge and reapearing at the trailing edge, object was pitch black (I guess), there was no difference in it and the nite background only hint of shape was stars that were blacked out, it had an approximate oval elongated shpae and about 100yds. long and absolutly NO SOUND it was also aprox a football field away and in front of me following the same route as the choppers. When it came even with my house I was hit with an intense light that lasted less than a second and i was blinded for a min., it wasn't a wide beam of light just an intense narrow beam it didn't light up anything else but my eyes, when i could focus again it was going over the hillside south to north, a three days later suspecting a secret military machine I called the FAA in louisville, they gave me the ph# to an army base in GA. i believe. going to file a complaint, the secretary said anyone that could or would talk to me was in a high level meeting........next day we invaded Grenada. That is one of three encounters I've had, another one similar to this same object, the first and most terifying was when in fourth grade we lived in the country, I was at that age when your brave enough to sleep with your head out from under the covers.lol... my younger brothers were in the bed next to me, mom and dad in the next room, i was almost asleep, my bed was by the window, thought i heard something scratching on the screen, wasn't unusual for a moth of such to lite on the screen, I rolled over toward the window and there outside the screen was a human bipedal form with an erie light glow looking in the window at me 6 inchs away from my face, I screamed got to the door and dad with shotgun blew the window out of moms bedroom.....dad told me he was doing it just to scare us but I knew better, and I left it at that , until about a year ago I was watching a UFO documentary, they were showing schetches of possible aliens all looked like ET to me until one showed up and horrified me to the core , that face was what was in my window that nite. I know beyond a shadow of a doubt what I saw that nite and it sure as hell wasn't my dad. He admitted this year he had said that to calm everyone down, I knew better, from the time of my scream and flying to the door the shotgun goes off........NO WAY"],"Date of the Event":"Unknown","Source":"MUFON","Latitude":"37.829501","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.829501,+-87.586225(3662)&iwloc=A&hl=en\"> mufon case (3662) map </A>","Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"3662","City":"Henderson","Summary":"black object flyby","Region":"Kentucky","Longitude":"-87.586225","Date Submitted":"08/02/2005 01:04 UTC","Object Shape":"Blimp"}