{"files":["/var/www/straped/mufon/html2text/36621.html.txt","/var/www/straped/mufon/org/36621.html"],"Viewing Distance":"Over One Mile","Log Number":"US-03202012-0023","Date Submitted":"03/20/2012 09:49 UTC","trends":["There has been one other sighting in North Reading","There were no other sightings in North Reading on or around March 20th 2012"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.579,+-71.076687(36621)&iwloc=A&hl=en\"> mufon case (36621) map </A>","Sighting Duration":"Undisclosed","Latitude":"42.579","Summary":"I saw what I thought was a star, move past the other stars out of sight","Country":"United States","Region":"Massachusetts","Object Shape":"Star-like","Source":"MUFON","Tags":"City","Date of the Event":"03/20/2012 08:30 UTC","City":"North Reading","Weather Factors":"Unknown","Object Flight Path":"Stationary,Straight-line path","divs":["Sighting DetailsMy daughter and I were standing in front of my house in MA around 8:30 PM purposely looking at the stars in the clear night sky. We looked almost directly above us and at the same time saw what appeared to be a stationary star, start to move. Slow at first, then it picked up speed. My daughter asked me why the the star was moving. I didn't answer or take my eyes off the moving star. I called my wife to come outside to check it out but it was moving to fast and she didn't get to see it. There were airplanes in the sky at the time that looked like airplanes and had distinctive aircraft lights. The star-like object, looked like a twinkling star. no lights other than it's star-like glow. It moved north in a straight line, then disappeared. It made no sound and it left no trail. I am no expert on aircraft so this could have been anything. It is just so strange that it was so high up in the sky. It appeared to be as far away as a star. I have no idea how reporting this helps but I felt compelled to tell someone. Take care."],"Longitude":"-71.076687","Case Number":"36621","Object Features":"Unknown"}