{"Object Features":"None","trends":["There have been 26 other sightings in Manchester","There were no other sightings in Manchester on or around June 10th 1971"],"Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United Kingdom","Sighting Duration":"Undisclosed","Date of the Event":"06/10/1971 12:00 UTC","City":"Manchester","Case Number":"36638","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=53.488711,+-2.242266(36638)&iwloc=A&hl=en\"> mufon case (36638) map </A>","divs":["Sighting DetailsI am 57 now the incident hapened about 1972 when i was working for my local council in a town called Shaw , 10 miles from Manchester airport England .I was employed as a gardener And i was working at a local primary school at the top of Beal lane, I think the school was called st georges. i was working with another man called Terry who has since passed away. It was near lunch time and me and Terry were discusing his vacation to Spain the next day, The town of Shaw is on the flight path to Nearby Manchester airport And we could hear the sound of an airliner pasing overhead, me and Terry looked up at the aircraft and terry comented he would be on board a plane like that the next day on his way to Spain, being so near to Manchester airport the plane was quite low, then from nowhere this ball shaped silver metalic object shot under the belly of the aircraft, it was traveling fast and disapeared from view within 2 mins. The object was much smaller than the aircraft , it made no noise and left no trail and could clearly be seen to be a solid object. Me and terry just looked at each other and said what the hell was that. we didnt report it to anybody for fear of ridicule. and we never talked about it to each other again. I now live in the Philippines"],"Date Submitted":"03/21/2012 02:58 UTC","Region":"England","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36638.html.txt","/var/www/straped/mufon/org/36638.html"],"Longitude":"-2.242266","Latitude":"53.488711","Summary":"Ball shaped , flying directly under the belly of airliner","Log Number":"GB-03212012-0007","Viewing Distance":"Unknown","Tags":"City","Disposition":"Unresolved"}