{"Object Flight Path":"Straight-line path","Case Number":"36630","Source":"MUFON","Sighting Duration":"00:01:00","Object Features":"Unknown","Weather Factors":"Unknown","divs":["Sighting Details Late evening, 1966, 11 years old, playing in the alley with two friends. Lights in the sky between the trees caught our attention. A string of lights, arranged in a bilateral \"V\" pattern was passing slowly over, just to the east of us and heading north. There was no sound, only bright, steady lights. I do not know if I was seeing one object displaying mutiple lights, or multiple objects. We had to run through neighbor's yards, dodging trees, to maintain line of sight. After about a minute of we lost sight for good. The size of the formation was comparable to holding my hand at arm's length with the index finger and thumb forming a \"V\" Shape. It was larger than the moon. At the time we thought it was a USAF B-49 Flying Wing or something. I don't recall \"spacecraft\" even crossing my mind. About 3 or 4 years later, I was reading a book about UFO's and found a photograph of the exact pattern we'd seen. Since that time, I had decided that it really was a conventional aircraft, light reflecting off a string of flying geese, or even chinese lanterns, which in recent years I have experimented with. However, as I am studing the UFO phenomenon more closely these days, I have re-examined my sighting and reached these conclusions: 1. The lights were not reflections. They were incandescent. 2. Aircraft do not carry a running lights like what we saw. 3. If it was a conventional aircraft, due to our perspective, it was barely a thousand feet above us. We would have heard it. 4. The formation was tight and bilateral. It could not have been chinese lanterns."],"Longitude":"-98.353073","Log Number":"US-03202012-0032","Disposition":"Unresolved","Date Submitted":"03/20/2012 11:50 UTC","Country":"United States","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/36630.html.txt","/var/www/straped/mufon/org/36630.html"],"Region":"Nebraska","Summary":"V-shaped bank of lights (10-12) passed over head.","trends":["There have been 9 other sightings in Grand Island","There were no other sightings in Grand Island on or around June 15th 1966"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.923933,+-98.353073(36630)&iwloc=A&hl=en\"> mufon case (36630) map </A>","Date of the Event":"06/15/1966 12:00 UTC","Latitude":"40.923933","City":"Grand Island","Viewing Distance":"Unknown"}