{"Case Number":"3664","City":"Tucson","Longitude":"-110.919949","Date Submitted":"06/30/2001 12:00 UTC","Disposition":"Unknown","divs":["Sighting DetailsMy husband and I were returning from the Casino on Mission Road. We were driving south when we noticed a bright white light coming around the side of a mountain. At first, we thought it was a small plane going down. It stopped suddenly and then turned and returned between two hills. The lights stopped and a red light came up from the hillside and joined the white lights. It appeared to vanish. The lights reappeared about 100 yards further south of us and a red light came up from the ground and entered the white lights. The lights then again seemed to vanish. Two other people stopped on the road and the man asked if we saw that? There was absolutely no sound. Even the dogs and cattle were perfectly quiet. Two jets came streaking into the area, circled where the lights had been and then returned from the direction in which they came. (Davis Montham Airbase is located in Tucson). We reported this at one time, but I don't know if it was with you. We discussed this on the remainder of the trip home. My husband is a quality engineer, I am a nurse. We both think clearly and precisely and objectively. We agree that the light appearance (from center to outside) appeared as if \"doors\" were opening. We wonder if we hadn't witnessed a \"loading dock\" affect. The colored orbs came up from the Indian Reservation. The man who stopped with us said his Indian grandfather had told him stories for years about the \"sky lights\" but this was the first he had ever witnessed. I still to this day (four years later) think about the strange lights and the actions. What sticks with me the most is the total lack of sound; on the ground or in the air. It was extremely strange."],"Country":"United States","Source":"MUFON","Summary":"a series of white lights joined by one red light and then one green light going from ground to white lights in air","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around June 30th 2001"],"Latitude":"32.231433","Region":"Arizona","Log Number":"US-08022005-0010","map":"<A HREF = \"http://maps.google.com/maps?q=32.231433,+-110.919949(3664)&iwloc=A&hl=en\"> mufon case (3664) map </A>","Object Features":"Undisclosed","Object Shape":"Undisclosed","files":["/var/www/straped/mufon/html2text/3664.html.txt","/var/www/straped/mufon/org/3664.html"],"Object Flight Path":"Undisclosed","Date of the Event":"06/30/2001 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}