{"Date Submitted":"03/21/2012 01:17 UTC","Date of the Event":"03/09/2012 04:10 UTC","Region":"Arkansas","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","trends":["there have been no other sightings in bryant \\benton, citys bou","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/36646.html.txt","/var/www/straped/mufon/org/36646.html"],"divs":["Sighting DetailsC2C, had signed-off and I steped outside to check the weather, a fairly warm night,so I was taking my time. It was way distant and this object had two rows of irregular flashing lights, At first I thought it was a helicopter. the absence of sound caoght my attention. Whenfirst observed the craft was the size of a pin head with very distinct sepparation of lights.It eventually grew to the size of a asprin. The craft was moving really fast in contrast to the Jet's that I observe daily as I walk my dog. I would say that it covered 75 perecent of my field of view when suddenly with almost inperceptible hesitation it made a 90 degree turn and appeared to lose alitude at the same time thou it appearance became perceptually smaller. Now I noticed a commercial jet high in the sky approching from the opposite direction, it was way up in the sky also. the UFO and the liner were approching each other on parallel paths the ufo was about an inch an a half difference in the flight path. the ufo moved across the entrie arch of th sky and flew out of my field of view before the jet had coveed one third of mmy field of vission, when I spotted the liner it was 6 o7 percent of the sky arch. The two rows of lights appeared as windows ,five blue lights over four red lights. I didn't know what to think un'till this moring when I looked on a internetsite that had a vidieo of a mysterious Planet sized object hit by a plasma ejection of our Sun,Near Mercury on december first last year. That observer decried that the UFO was cloaked to be invisiable. The magnified view of the object is identical to the object I saw with matching lights even though the picture did not portray the window lighting as blue over red."],"Object Shape":"Square, Rectagular","Longitude":"-91.821963","Tags":"City","Object Features":"Window(s)","Summary":"high,fast,distant, 6-2-8X faster than the ocomming commerical jet ,whom the object made a 90% turn to pararell path I used to detrmine speed of the craft.c","Weather Factors":"Unknown","City":"Bryant /Benton, citys bou","map":"<A HREF = \"http://maps.google.com/maps?q=35.20477,+-91.821963(36646)&iwloc=A&hl=en\"> mufon case (36646) map </A>","Log Number":"US-03212012-0014","Case Number":"36646","Latitude":"35.20477","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Country":"United States"}