{"Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI thought this would be the best place to report what my wife and I saw many years ago but never forgot. My wife has always been more observant than me, thankfully, or I probably would have missed this. We were out for an evening walk with a friend and I was chatting with him when my future wife remarked \"What's that?\". She apparently heard a hum and looked up to see where it was coming from. I hadn't noticed the sound because I was talking, but when I stopped and looked I could hear a low frequency, steady hum, like an electrical transformer. But what we saw was inexplicable. There was a large craft slowly moving from east to west about 100-150 feet off the ground. It was almost directly overhead when we first saw it and watched it move off to the west for at least a minute maybe more. It was oblong shaped, about 200ft by 100ft with small white lights around its perimeter and a larger red pulsating light located in it middle on bit of a bump. When the red light lit up we could see the body of the craft was a reflective metallic surface. I have always been a keen student of aeronautical studies and have no explanation for what we saw. Of course anyone we relate this story to regards it as crazy. Whatever!"],"Longitude":"-76.16391","Date Submitted":"03/21/2012 11:15 UTC","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Tags":"City","Region":"Ontario","Disposition":"Unresolved","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=44.330318,+-76.16391(36645)&iwloc=A&hl=en\"> mufon case (36645) map </A>","Case Number":"36645","files":["/var/www/straped/mufon/html2text/36645.html.txt","/var/www/straped/mufon/org/36645.html"],"Latitude":"44.330318","Country":"Canada","Log Number":"CA-03212012-0013","Source":"MUFON","Object Flight Path":"Straight-line path","City":"Gananoque","trends":["There have been 2 other sightings in Gananoque","There were no other sightings in Gananoque on or around July 1st 1978"],"Summary":"Low altitude oval craft. Steady white light on perimeter, center pulsating red.","Date of the Event":"07/01/1978 12:00 UTC"}