{"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Source":"MUFON","Longitude":"-96.936371","trends":["There has been one other sighting in Giddings","There were no other sightings in Giddings on or around October 29th 2004"],"files":["/var/www/straped/mufon/html2text/3665.html.txt","/var/www/straped/mufon/org/3665.html"],"Object Shape":"Triangle","Log Number":"US-08022005-0011","Latitude":"30.182716","Country":"United States","Summary":"shooting star with brakes and 3 lights","City":"Giddings","Object Flight Path":"Path then hovering","Date Submitted":"10/29/2004 09:27 UTC","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.182716,+-96.936371(3665)&iwloc=A&hl=en\"> mufon case (3665) map </A>","divs":["Sighting DetailsMyself, my wife, daughter and my daughters boyfriend were traveling to the Dallas area to see the breeders cup horse race. My wife never sees shooting stars. As we entered the edge of town we both saw what we thought was a shooting star moving from left to right across the sky in front of us. My wife began exclaiming -- ooh ooh ooh and pointing at it. When the streak of light got in front of us, it slowed down to almost stopped and slowly moved over the town. When it slowed down, we could see that it was actually three lights mounted on a triangle shaped object. We were close enough that I could see a bit of bronze color on the fuselage between the lights. My wife continued to point and ooh and while we watched, the object simply disappeared. My wife then actually slapped me quit hard saying -- did you see that? I did have the mental faculty to answer her slowly by saying. -- Yeah I know what I saw, but I want you to say what you saw so I can compare. She described exactly what I saw. It was a particularly disturbing dissappearance because the moon was quite bright and the lights from the town and a softball field(?) made certain cloud formations behind the object very visible when the object disappeared. Unfortunately the kids in the back seat did not see it. Just guessing, I would say that it was about 1500 ft or less in altitude. As we drove on, I became quite bothered because I can find no explanation for what I saw. I am a very critical thinker and can come up with nothing. I considered that a reflection from behind was refracting in the windshield, but my wife's pointing finger on the glass and the fact that it was viewed through both the windshield and side window ruled out that possibility in my mind. As I said, the disappearance moment was very dramatic. It was not as quick as a light turning off, but it was quick enough that I saw no fade. I replayed the event over and over in my mind and cannot explain it. I submitted this sighting on some other site shortly afterward, but the discovery channel reminded me of mufon. I believe that this is a true sighting (I have had others that I would not call reliable) and want to report it to a true reasearch group."],"Object Features":"Undisclosed","Region":"Texas","Disposition":"Unknown","Case Number":"3665","Date of the Event":"10/29/2004 09:27 UTC"}