{"trends":["There has been one other sighting in Horse Shoe","There was one other sighting in Horse Shoe on or around March 21st 2012","This sighting has been favorited 1 time.",""],"Viewing Distance":"101-500 Feet","Tags":"City","City":"Horse Shoe","Region":"North Carolina","Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown","Date Submitted":"03/21/2012 09:52 UTC","Object Features":"Dome","Source":"MUFON","Longitude":"-82.54869","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.346801,+-82.54869(36655)&iwloc=A&hl=en\"> mufon case (36655) map </A>","files":["/var/www/straped/mufon/html2text/36655.html.txt","/var/www/straped/mufon/more/36655_submitter_file1__photo1.jpg","/var/www/straped/mufon/more/36655_submitter_file2__photo2.jpg","/var/www/straped/mufon/more/36655_submitter_file3__photo3.jpg","/var/www/straped/mufon/org/36655.html"],"Object Shape":"Other","Summary":"Orange-redish glow shaped like a parachute with fire coming out from underneath. Shapes would rise up independently and join to form a triangle. Several sets of triangles seen. Slow moving in straight path.","Log Number":"US-03212012-0022","Date of the Event":"03/21/2012 08:15 UTC","Case Number":"36655","Latitude":"35.346801","Sighting Duration":"Undisclosed","divs":["sighting detailsdriving home at 8 pm we first saw tiny red lights and assumed they were airplane lights. but there were no airplanes. once we got closer we noticed these were not little red lights but orange-red objects (basketball size) floating through the air. we pulled over to the side of the road, stopped the car and got out to see what they were. at first we thought they were lanterns or parachutes being propelled by a flame. somebody was having a party!!! then we worried about the number we were seeing and momentarily thought maybe there had been a fire and these were large embers. the object was an orb-like shape, dome-like with a fire-like glow coming from underneath it. reminded me of a moon-jelly fish! approximately 2 feet in diameter, the object would emerge from the tree line and float upwards. the glow was an intense red\\orange\\yellow. there was no sound coming from them at all. as soon as one appeared there would be another one emerging within 20-30 seconds. three of these objects would join together in a triangular formation (above telephone pole height) and slowly float in a straight direction past the horizon. there were multiple groups (triad) but you did not see more than one group unless you were to turn and face the direction the others had been going. they continued to just float up and away. we observed several sets emerge in the course of 8 minutes. when we first noticed them in the distance we saw 6. there were only 2 cars that passed by our car and no other noises. we had no idea what we had just seen but as soon as we arrived home we checked out orange shaped orbs traveling in a triangular formation. quite amazing and extraordinary!"]}