{"Tags":"City","Case Number":"36660","files":["/var/www/straped/mufon/html2text/36660.html.txt","/var/www/straped/mufon/org/36660.html"],"Date of the Event":"03/22/2012 01:20 UTC","Viewing Distance":"101-500 Feet","Longitude":"-63.574752","map":"<A HREF = \"http://maps.google.com/maps?q=44.714543,+-63.574752(36660)&iwloc=A&hl=en\"> mufon case (36660) map </A>","Summary":"UFO type object moving silently in a straight line in front of me, no wings, no windows, no tail...","Sighting Duration":"00:01:30","Disposition":"Unresolved","Country":"Canada","Object Flight Path":"Straight-line path","Log Number":"CA-03222012-0002","divs":["Sighting DetailsIt was the hottest day of 2012 so far, 29 degrees C, on March 22nd in Dartmouth Nova Scotia, (normal high 4c) so I was out for a walk around where I work. I was within 1 block of the address given when I noticed a silent white or silvery disk shaped object gliding past in front of me. I immediately thought it looked like a giant frisbee, but i can see why some people would call it cigar shaped, because it appeared i was looking at a disk from the side. It was a completely clear, beautiful sunny day, and this object might have been only 500-1000 feet in front of me, and elevated about 30-45 degrees in the air, maybe up 500 feet, I didn't have to crank my neck up to see it. It was moving slowly, maybe 50mph? There were no wings, no tail, no markings, the sun glinted off of it, so it appeared solid to me, it was moving faster than the wind, and against the prevailing wind which was westerly and I was looking easterly, it was moving approximately SE and it was steady. It was moving at the speed and solidity of a helcopter, but it was completely level and there were no blades or anything sticking out of the smooth craft. I would say it was between the size of a personal aircraft like a beachcraft and a small learjet. It was longer than it was high, and there was no visable engines, no sounds, it silently glided away from me, heading over Dartmouth crossing and over Mic Mac Mall, eventually heading towards a military base in Eastern Passage called Shearwater (if it contined straight on the course i observed) I would suspect it was a military drone powered by some kids of hover craft style technology, it did not appear to have any windows so i would doubt it was occupied by humans and I have no reason to believe it was Alien in nature, it was just strange and out of place. There were several planes in the air over Dartmough that day following the great circle route heading West towards Boston or New York, and I could see contrails from those plains and even though they were probably cruising at 35,000 feet I could hear the rumble from them as they went by. The object I opserved was not heading towards the stanfield international airport at that would have been going to my left, (I was facing roughly East) and the object was going left to right across my field of vision, which i believe would be SE. it was basically heading towards Halifax Harbour. I would love to know if anyone else witnessed this object and find out what it really was."],"Region":"Nova Scotia","Object Features":"None","Source":"MUFON","City":"Dartmouth","Date Submitted":"03/22/2012 01:41 UTC","trends":["There have been 6 other sightings in Dartmouth","There were no other sightings in Dartmouth on or around March 22nd 2012"],"Object Shape":"Cigar, Cylinder, Disc, Oval","Latitude":"44.714543","Weather Factors":"Unknown"}