{"Sighting Duration":"Undisclosed","Log Number":"US-08022005-0012","Date Submitted":"05/10/2005 04:40 UTC","files":["/var/www/straped/mufon/html2text/3666.html.txt","/var/www/straped/mufon/org/3666.html"],"Object Shape":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.300278,+-87.4275(3666)&iwloc=A&hl=en\"> mufon case (3666) map </A>","divs":["Sighting DetailsOk I had just gotten off work on Perdido Key and was driving across the bridge that spans the intra-coastal waterway, traveling north off the Key headed home. There was a very impressive cummulonimbus cloud off to the Northeast and I was admiring its beauty as traffic was kinda backed up on the bridge as it is that time of day... well I noticed almost in the center of the cloud which was probably 5 to 10 miles away maybe further, at the edge facing my point of view... in other words there was cloud behind the anomoly..., was a VERY shiny object or reflection. I gaze at the clouds all the time and have never seen clouds do this. Anyway like I said it was shiny and judging the distance it had to be like say a football field across kinda blob shaped. It was hard to tell shape as the background was almost the same color. but it was reflecting light in such a manner that I dont think it was part of the cloud. you know like a sundog type effect. I suppose it could have been natural sunlight reflecting off the cloud but I've never seen that phenomena before. anyway it slowly dimmed maybe like if it was an object that it was moving further into the thunderstorm. thats not all... when I got to the top of the bridge I took my eyes off it to make sure I wasnt going to run into the car in front of me. when I looked back over at the object its like the whole area around it \"shifted\" for a split second. thats the best way I can describe it..after that the object slowly got absorbed by the cloud. I had polarized sun glasses on so the detail of the event was very good. virtualy no glare. The shifting effect could have been cloud to cloud lightning I suppose but it was a bright sunny day and you rarely see c to c lightning in the day. Well thats pretty much it... oh a couple days later one of my co workers and I were talking and I brought it up and he said that he had seen the same thing that day (he was about five min. ahead of me) So the phenom. lasted a while aparently. And caught his attention too... well was it natural phenom or substantial object?? I dont know."],"Date of the Event":"05/10/2005 04:40 UTC","Region":"Florida","Country":"United States","Weather Factors":"Unknown","Case Number":"3666","Tags":"City","Object Flight Path":"Undisclosed","Source":"MUFON","City":"Perdido Key","Latitude":"30.300278","Disposition":"Unresolved","trends":["There have been no other sightings in Perdido Key","This sighting has never been favorited."],"Object Features":"Undisclosed","Longitude":"-87.4275","Summary":"Very shiny object seen near thunderstorm"}