{"Date Submitted":"03/22/2012 03:36 UTC","Date of the Event":"03/20/2012 11:30 UTC","Country":"United States","Case Number":"36663","map":"<A HREF = \"http://maps.google.com/maps?q=28.153453,+-82.736024(36663)&iwloc=A&hl=en\"> mufon case (36663) map </A>","Viewing Distance":"Over One Mile","Object Features":"Unknown","Longitude":"-82.736024","City":"Tarpon Springs","Log Number":"US-03222012-0005","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"28.153453","Summary":"A very fast B2 Bomberlike craft, moving very fast. Just a shade darker than the surrounding sky, edges seemed blured.. No Lights, No sound.","Weather Factors":"Unknown","Region":"Florida","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path","trends":["There have been 7 other sightings in Tarpon Springs","There were no other sightings in Tarpon Springs on or around March 20th 2012"],"files":["/var/www/straped/mufon/html2text/36663.html.txt","/var/www/straped/mufon/org/36663.html"],"divs":["sighting detailsit was about 11:30 on a very nice clear night, the 20th of march 2012. i was standing outside with my dogs in the backyard. i enjoy looking at the stars and looking for the planets when i am out there, so i was looking north and up into the sky. it was a clear night sky with clouds on the northern horizon. my house was to my back and i was looking due north. i hear a pop, like a sonic boom, way off in the distance, i could not tell the direction, then out of the corner of my eye i catch movement in the night sky directly above me, slightly to the east (at the 1 o'clock position) moving rapidly north (covered the night sky in under 10 seconds). the object is about 2\" in size relative to me. i concentrate to make it out as it is moving fast and there are no nav lights. (i live near 2 major airports with at least one entry pattern running right over the house, so no nav lights really caught my attention. - i guess here would be a good place to point out that i am a us army combat veteran and by habit i study my surroundings.) i looked away and back again to confirm i was seeing something, and sure enough it was there now about 1\\2 way to the horizon. the shape was very much like a b2, but not black. the sky was a shade of purple, and this seemed to be just a shade darker. the edges were just a bit fuzzy, like it was out of focus. i thought it could be something in my eye until it flew behind a bank of clouds far to the north on the horizon. at first i thought it was a b2 until i thought abuot the lack of lights or noise and the speed. i have been on the ground when both f117s and b2s have flown overhead, so i was waiting for the sound. it never came."],"Object Shape":"Boomerang, Triangle"}