{"Tags":"City","trends":["There have been 5 other sightings in Amherst","There were no other sightings in Amherst on or around March 22nd 2012"],"Source":"MUFON","Longitude":"-72.508397","Date Submitted":"03/22/2012 10:17 UTC","Object Shape":"Other","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Object Features":"Other","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Log Number":"US-03222012-0010","files":["/var/www/straped/mufon/html2text/36668.html.txt","/var/www/straped/mufon/org/36668.html"],"City":"Amherst","map":"<A HREF = \"http://maps.google.com/maps?q=42.370567,+-72.508397(36668)&iwloc=A&hl=en\"> mufon case (36668) map </A>","Summary":"Stingray like but smoothed from below, disk like when viewed from front and rear, beaming lights","Disposition":"Unresolved","Region":"Massachusetts","Latitude":"42.370567","Date of the Event":"03/22/2012 09:10 UTC","Case Number":"36668","divs":["Sighting DetailsOne large object floated slowly towards, over and past our house tonight. When we first spotted it, it appeared as two bright beams of light pointed in our direction. It approached slowly, unwavering and silently. As it came closer, it appeared to be somewhere between 100 to 150 feet above us (we live on a hill, over a valley.) Around 3 minutes into our encounter. As it passed overhead we could see its undercarriage, it appeared to be translucent and glowing orange, faintly. Around 5 minutes into our encounter. Just after it passed over us, again silently and slowly, we could see one white light at its rear as it was silhouetted by the beams emanating from its front. It appeared to be disk shaped both from its front and rear, but revealed itself to be shaped something like a stingray, but more rounded and curved, from underneath. Around 8 minutes into the encounter. The object appeared to speed up somewhat, but it is hard to gauge. It made a smooth 90 degree turn towards the town nearby, Amherst, and began to weave somewhat. Around 10 minutes into the encounter it disappeared below the tree line. Will attach documentation soon."]}