{"map":"<A HREF = \"http://maps.google.com/maps?q=-37.944842,+145.497115(36665)&iwloc=A&hl=en\"> mufon case (36665) map </A>","divs":["Sighting DetailsI was driving along Pakenham Rd in Cockatoo Victoria Australia with daughter, husband and son-in-law. We turned into side street and observed what we first thought were car headlights coming down the street. Upon facing objects they [3 or 4] hovered about 10 foot above the ground and moved in a group to the right of us about 15 feet in front of my car . They appeared bright white and had small head shapes and long necks seemingly no legs or body just long tall beings .Husband and son-in-law also observed , daughter in car doesnt see objects as looking other way and when we all saw them we apparently went quiet . Beings continued for about {30 seconds}?and for a distance of about 50 meters [they headed towards a Pony Club Paddock] I had stopped the car left engine running to let them cross .I didnt take note of times I can only assume it was around 10p.m.When i got home which would normally take 3-4 minutes , my other daughters at home [20 and 14]complained of very loud banging on the roof and outside the back of house . Later that night 14 year old daughter wakes to investigate very bright orange light the size of a large car directly outside house hovering about 15 foot above ground , so bright it lights up inside of house,she goes out to find object has gone."],"Object Shape":"Other","Summary":"Four orb like 'beings ' observed befre large orange ball sighting .","City":"Cockatoo","Object Flight Path":"Path with directional change","Case Number":"36665","Date of the Event":"03/21/2012 12:00 UTC","Sighting Duration":"Undisclosed","Country":"Australia","Log Number":"AU-03222012-0007","trends":["There have been no other sightings in Cockatoo","This sighting has been favorited 1 time."],"Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Source":"MUFON","Object Features":"Other","Tags":"City","Longitude":"145.497115","Date Submitted":"03/22/2012 06:38 UTC","Weather Factors":"Unknown","Region":"Victoria","files":["/var/www/straped/mufon/html2text/36665.html.txt","/var/www/straped/mufon/org/36665.html"],"Latitude":"-37.944842"}