{"Weather Factors":"Unknown","Object Shape":"Sphere","Latitude":"36.607938","Log Number":"US-03232012-0005","Date Submitted":"03/23/2012 01:55 UTC","Summary":"videoing large airplane UFO coming by the other airplane crossing it's contrail","Disposition":"Unresolved","Date of the Event":"03/20/2012 07:55 UTC","Source":"MUFON","trends":["There have been 18 other sightings in Monterey","There were no other sightings in Monterey on or around March 20th 2012"],"files":["/var/www/straped/mufon/html2text/36675.html.txt","/var/www/straped/mufon/org/36675.html"],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Case Number":"36675","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.607938,+-121.891486(36675)&iwloc=A&hl=en\"> mufon case (36675) map </A>","Tags":"City","Country":"United States","City":"Monterey","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI was videoing at the Monterey beach around 7pm on 20 March. there was a large earthquake today in Mexico around noon time it was a 7.4 in size therefore It was time to be on the look out for weird things and sure enough as I'm videoing this large airplane, around 7:55pm coming from the West over the Monterey Bay going East. 3 minutes into videoing the airiplane a UFO came out from the South. The large airplane had it's typical contrail, about 16 sec.later the UFO crossed through the airplanes contrail and keep going North. I tryed to zoom in at different times during my videoing of the UFO it lasted over 5 minutes. Same night around 8:15pm. a second UFO came into view coming from the South --South-West area going North this went on for about 4 minutes. Then another UFO coming from the same direction going North by North-East. All of this was exciting to watch not sure if they were airplanes or not. they did'nt make any major changes like the other videos I have over the months. Trying to get my videos together for MUFON to review before I release then to the public...Maybe with MUFON--sorry but this is going into my book-etc... Maybe I will put one of my ufo videos onto my website."],"Longitude":"-121.891486","Region":"California"}