{"Country":"United States","Region":"Connecticut","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"03/22/2012 11:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.446688,+-72.821808(36670)&iwloc=A&hl=en\"> mufon case (36670) map </A>","files":["/var/www/straped/mufon/html2text/36670.html.txt","/var/www/straped/mufon/org/36670.html"],"Sighting Duration":"00:02:10","Disposition":"Unresolved","Latitude":"41.446688","Tags":"City","Source":"MUFON","divs":["Sighting DetailsIt was 8:27 pm on March 22, 2012 when my cousin and I noticed the object falling like a leaf from at about 1,000 feet. The cigar shaped object displayed unusual gold colors on its surface and brighter lights around in 4 locations on it's shape. The lights where MUCH brighter than an aircraft. Object came out of westerly direction, hoovered for 5 seconds as we watched from our rear deck. Then object continued on decending to about 500 feet and changed direction quickly in radical directions. It hovered once again for 2 or 3 seconds then continued on. I couldn't figure what it was. It continued on over us and didn't change color or intensity or make any noise at all!! It continued descending over the trees, over the highway and then we tried to see it through the trees as it headed down towards the power lines across the highway. We lost it through the trees and seemed to disappear after crossing the highway. Bill my cousin and I tried to figure what it was but neither one could determine what kind of craft it was. I was a pilot and it stumped me. If anyone had a sighting this time or night please let me know."],"Object Shape":"Cigar","City":"Wallingford","Summary":"Cigar shaped object gold colored surface with red-orange lights.","Date of the Event":"03/22/2012 08:27 UTC","Weather Factors":"Unknown","Log Number":"US-03222012-0012","Object Flight Path":"Hovering then path,Path then hovering","Longitude":"-72.821808","Case Number":"36670","trends":["There have been 4 other sightings in Wallingford","There were no other sightings in Wallingford on or around March 22nd 2012"]}