{"Longitude":"-111.455141","Summary":"Multi-colored pulsating lights staying stationary witnessed in night sky in Pine, AZ.","Object Features":"Unknown","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Disposition":"Unresolved","trends":["There have been no other sightings in Pine","This sighting has never been favorited."],"Source":"MUFON","Object Flight Path":"Stationary","Weather Factors":"Unknown","divs":["Sighting DetailsMy friend and I were going outside to smoke a cigarette, as my friend wallked further from the porch, she looked up in the sky and something caught her eye. There was a pulsating red light. It was around 1:30 A.M on March 23, 2012. The light slowly transitioned into a turquoisish color. She immediately was struck with fear and we went inside to calm down. At this point I had NOT seen the object. About 20 minutes later when we were calm we proceeded back outside. She saw the lights after about 10 minutes of searching. This time she made me stand where she was standing, and I, too, saw it. It had moved slightly to the right of where she had last seen it. There were about 5-7 lights all positioned sort of diaganoly from eachother.We then went back inside and considered all possibilities. Leading us here. Now nearly 3 hours later the lights are still in the sky, only now they have had blue, white, green, red, and pinkish pulsations. We can see them from our living room window. We were both freaking out incredibly bad. My friend looked like she was about to have a heart attack. I then became very frightened, which is odd because I usually am calm while she freaks out. We are still very frightened. Help."],"Date of the Event":"03/23/2012 01:30 UTC","Object Shape":"Circle, Flash, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/36678.html.txt","/var/www/straped/mufon/org/36678.html"],"Case Number":"36678","Latitude":"34.384474","Date Submitted":"03/23/2012 07:56 UTC","Sighting Duration":"Undisclosed","City":"Pine","Log Number":"US-03232012-0008","map":"<A HREF = \"http://maps.google.com/maps?q=34.384474,+-111.455141(36678)&iwloc=A&hl=en\"> mufon case (36678) map </A>","Region":"Arizona"}