{"Disposition":"IFO","Object Features":"None","Case Number":"3667","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Date Submitted":"11/09/2004 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Log Number":"US-08022005-0013","Viewing Distance":"Over 1 Mile, Unknown","Region":"California","divs":["Sighting DetailsThe wife and I were seeing our company to their car in front of our house, It was a real clear night I could see off to the west what I thought was an airplane white light it was heading towards what looked like a fairly bright star and I thought to myself if that star was another airplane they would crash and to my suprise the airplane light did not pass by the star. It was then that I brought it to everyones attention, After a minute or two it came out the other side and I hollerd to everybody again to look, it came out a little ways it did a half circle around the star and went back into it, I asked everyone if they had seen it? the only one was my wife she said she saw it come out and go half way around and go back inside, We then went and got our binoculars but through the binoculars it looked like a star with red,blue glittering. Our company left and I went to my back yard were it's a little darker but nothing happened the hour I was back there, I also judged the movement with the other stars an it appered to move at the same pace, I then tired and went back inside hoping to hear on the news if someone else had seen it."],"trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around November 9th 2004"],"City":"Bakersfield","Summary":"Starlike object moved toward another starlike object and stopped in it, after a few moments it came out the other side did a half circle around it and went back into it.","map":"<A HREF = \"http://maps.google.com/maps?q=35.381562,+-119.011712(3667)&iwloc=A&hl=en\"> mufon case (3667) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3667.html.txt","/var/www/straped/mufon/org/3667.html"],"Object Shape":"Sphere","Longitude":"-119.011712","Date of the Event":"11/09/2004 12:00 UTC","Tags":"City","Latitude":"35.381562"}