{"divs":["Sighting DetailsNote: May be related to a MUFON report I submitted a couple of weeks ago from the exact same location, visible from my bedroom window in Mooresville, NC. For the past several nights, stationary and moving lights have been observed in the woods, which are no more than 100 ft behind our apartment building. The first night that I observed the lights, there was a trio of golden lights that remained on but seemed to be changing position in relation to each other (hereinafter called the triad.) To my left, probably within 30 feet of the triad was a brighter blue-white light. I was able to obscure and reveal both sets of lights by moving my head up and down and side to side. So the lights were behind the first row of trees. My first thought was that I was seeing security lights that may have been on a building beyond the woods, (but by walking up to the edge of the woods, the next morning, I could see that the woods were too deep and dense for that to be the case--also a look at Google maps showed no buildings beyond the woods but instead a large municipal golf course. However, there was a clearing in the woods with a break in the treetops on a direct line to my bedroom window) That first night I kept monitoring the lights periodically with no change, except the lights of the triad changing into different triangle configurations. At my final check at 7:00 am, the sky was already getting light blue but the lights were still in place. After my morning shower, the lights were gone. Two nights later the lights were back in the woods in the identical two-group configuration as before. This time there was also some movement of star-like points above the woods, however they were all too big to be your average star and in the wrong area of the sky to be Venus. Two of these objects were stationed above two of the largest trees in the area of the stationary lights. I fixed my vision on one of the hovering stars and it was not moving in relation to the trees. After three hours, the two star-like objects had not changed in relation to those trees but the other stars in the sky had moved a lot further to the West. On this night the stationary lights were gone by 5:00 am, while the sky was still black. The next day, after work, I walked into the woods and gradually made my way to the clearing. The soil was damp clay and easy to depress however there were no landing pod depressions anywhere. The only possible artifacts in the \"landing zone\" were some very spiky dark green plants something like chives which stuck straight out of the ground but were bent over and laying down in places without being broken. There was also an area about 5 ft in dia, in the center of the clearing where the spikes were dried out-not burnt but dried out like wheat when ready to harvest. There were no other plants in or around the clearing that were dried out like this. Last night I started a vigil while still daylight, hoping I could see any craft approach and land in the clearing. I only left my post a few times to take care of personal needs but upon returning from one of those interludes I found the stationary lights were back. This was slightly after dark. The configuration of two sets of lights and their behavior was exactly the same. Again, there was some activity of star-like objects in the sky, one set was very far away but flying in an equilateral-triangle pattern against the clouds. I had my Nikon DSLR camera out this time with a 200mm lens but was having trouble finding and focusing on any of these objects. So I went out onto my patio where I had a clear shot at the woods with no glass obstructing things. Standing in the shadows, I tried shooting toward the stationary objects but the stupid camera put out the focusing beam and the rear display totally lit up my face. If they didn't know I was spying before, they sure did now. Right after that, I saw something sparkling moving through the treetops, south of the apartment complex and moving our way. Getting closer, I could see that it was now in the woods. It was moving between the dense growth very gracefully, seemingly with ease. It reminded me of a giant firefly. Finally it came to a stop and hovered at the edge of the woods directly opposite to my position. For a moment it seemed we were looking at each other with direct eye-contact. The \"orb\" then went off, navigating through the woods with the same ease and with no particular sense of urgency. Since it was right at the edge of the woods I think a pretty accurate estimate of the size would be similar to a softball. When I entered the house and came out again, the stationary lights were no longer there. The time was approx. 8:20 pm 3-22-2012. My speculation is that the stationary lights and the one that came after my camera lit up are survey vehicles that are controlled by the many larger craft that were seen up above during each event."],"Log Number":"US-03232012-0009","Region":"North Carolina","Tags":"City","Date of the Event":"03/22/2012 12:00 UTC","Sighting Duration":"10:00:00","Disposition":"Unresolved","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"moving lights appearing in and over the woods several nights lately","Longitude":"-80.835191","Latitude":"35.574981","Object Shape":"Circle, Flash, Star-like","Object Flight Path":"Path with directional change,Path then hovering","City":"Mooresville","Country":"United States","files":["/var/www/straped/mufon/html2text/36679.html.txt","/var/www/straped/mufon/org/36679.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.574981,+-80.835191(36679)&iwloc=A&hl=en\"> mufon case (36679) map </A>","trends":["There have been 5 other sightings in Mooresville","There were no other sightings in Mooresville on or around March 22nd 2012"],"Case Number":"36679","Viewing Distance":"21-100 Feet","Date Submitted":"03/23/2012 08:09 UTC","Source":"MUFON"}