{"City":"Westfield","Latitude":"40.021096","files":["/var/www/straped/mufon/html2text/36682.html.txt","/var/www/straped/mufon/org/36682.html"],"Viewing Distance":"Unknown","Date of the Event":"03/21/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.021096,+-86.164892(36682)&iwloc=A&hl=en\"> mufon case (36682) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Case Number":"36682","divs":["Sighting DetailsStanding out on the balcony having a smoke. I looked up because I always look up hoping to see something. And, wouldn't you know it, as soon as I did I finally saw something that amazed me. I actually said Whoa! out loud even being alone. The two objects came from out of sight from the South. Head due North. They gained size as they approached at a phenomenal speed. But, for some reason I feel slight slower than a meteor. when you see meteors they tend to burn up in the atmosphere and you can tell they are losing material and brightness. These objects did not do that they were the same brightness the whole duration of about 2 seconds. They were a strange orange red color unlike most of the 'shooting stars\" I've seen. That was weird and the fact that they stayed equidistantly apart the whole time with no trails behind them. I can only liken them to fighter jets staying in formation. The were single lights, no noise, way too high, but lower than a satellite, not pulsating and WAY too fast to be anything I've heard of or seen. Thousands of miles an hour. The lights passed by at a completely horizontal level. Straight across the sky. This was no meteor, they were exactly the same size. When have you seen two meteors following each other that didn't seem to burn up, traveling in a completely horizontal line, with no trails, same color, in a fighter jet formation? I haven't."],"Object Flight Path":"Straight-line path","Sighting Duration":"00:00:03","Object Shape":"Sphere, Star-like","Date Submitted":"03/23/2012 01:19 UTC","Longitude":"-86.164892","Log Number":"US-03232012-0012","Summary":"2 red-orange glowing lights staggered formation staying in form sped in horizontal path no trails","Object Features":"Unknown","trends":["There have been 8 other sightings in Westfield","There were no other sightings in Westfield on or around March 21st 2012"],"Tags":"City","Region":"Indiana"}