{"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Brewer","Region":"Maine","Date Submitted":"03/23/2012 02:22 UTC","Disposition":"Unresolved","Log Number":"US-03232012-0016","Object Shape":"Egg","Longitude":"-68.756835","Case Number":"36686","Date of the Event":"03/22/2012 12:00 UTC","Tags":"City","Viewing Distance":"Unknown","Country":"United States","Latitude":"44.804118","map":"<A HREF = \"http://maps.google.com/maps?q=44.804118,+-68.756835(36686)&iwloc=A&hl=en\"> mufon case (36686) map </A>","files":["/var/www/straped/mufon/html2text/36686.html.txt","/var/www/straped/mufon/org/36686.html"],"Object Features":"Undisclosed","trends":["There has been one other sighting in Brewer","There were no other sightings in Brewer on or around March 22nd 2012"],"Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","Summary":"Thought it was a shooting star, but it changed direction and hovered.","divs":["Sighting DetailsI was on South Main Street in Brewer, Maine around 11:40pm-midnight. My fiance, and two friends of ours were pulling out of my friend's apartment. I, who was sitting in the passenger seat, was looking up at the sky because I have a fascination with space and stars, etc. I got all excited because while I was watching the sky, I thought I saw a shooting star. However, it was going way too slow to be a shooting star. It was also orb like, with a bright blue & green color coming from it. It was going down path like, and then suddenly changed direction and did a couple zigzags before it hovered for a few moments. I tried getting everyone's attention, but by the time they all looked it went below the treeline. I was confused, I really have never believed in aliens, but it definitely was not a shooting star and it really makes you think sometimes. When I got on facebook after, I was going down my news-feed, and somebody had posted a status seeing the same thing so I commented and asked him what he saw, and he described his sighting as the same thing!"]}