{"Tags":"City","divs":["Sighting DetailsMy wife, daughter and I were traveling east-bound on interstate 40 at approximately 2:30 PM Wednesday, March 20, 2012 about 10 miles west of Ludlow. I was driving and noticed off to the right (south of interstate)a cloud that was rapidly expanding and blowing off giant trails of hot burning debris all over the desert. The Cloud seemed to be about 500-1000 feet above the desert floor, stationary and literally exploding in mid-air. The cloud did not have a tragectory of any sort that we could tell, nor was there any vehicles, military aparratus, fire, or other human activity to explain the event. My Wife filmed the event as we traveled past and we have incredible footage. Pictures were also taken as we drove by. The only discernable object around the area was a bright white orb about the size of a large beach ball. It was intermittently in and out of the area surrounding the exploding white cloud. After viewing the footage we did find that an orb was captured in one of the several videos we took. As we continued east we took moore pictures, and notes as to mile markers on the freeway and to get some scale of the event we just witnessed. The cloud continued to expand to over a mile wide over the mountains as we drove away. We cannot make out what was behind, or rather inside the cloud at all. It was as-if something massive was exploding in another dimension, and spilling into ours."],"Case Number":"36695","map":"<A HREF = \"http://maps.google.com/maps?q=34.7211,+-116.160012(36695)&iwloc=A&hl=en\"> mufon case (36695) map </A>","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Unknown","trends":["There has been one other sighting in Ludlow","There was one other sighting in Ludlow on or around March 20th 2012","This sighting has never been favorited.",""],"Longitude":"-116.160012","Log Number":"US-03232012-0025","Object Features":"Unknown","Object Flight Path":"Stationary","Region":"California","Date Submitted":"03/23/2012 06:35 UTC","Summary":"Two clouds in air exploding, raining burning debris over desert:& orb","Disposition":"Unresolved","Country":"United States","Sighting Duration":"Undisclosed","City":"Ludlow","Date of the Event":"03/20/2012 12:00 UTC","Source":"MUFON","Latitude":"34.7211","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36695.html.txt","/var/www/straped/mufon/more/36695_submitter_file1__ufo204.JPG","/var/www/straped/mufon/org/36695.html"]}