{"trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around March 23rd 2012"],"Log Number":"US-03232012-0024","divs":["Sighting DetailsAs I often do I went onto my balcony early this morning about 6:15 am CDT. In the distance I could see planes coming from Austin Bergstron Airport, having taken off to the south and turning north to vector out. At a position SSE of mine I suddenly saw lights that I thought was another plane except it was not moving. I grabbed my binoculars and looked. It appeared oval shaped with white lights on the ends of the object and occasional red or blue lights between the white lights. It was no more than 10-15 degrees above the treeline of the ridge immediately east of me. I watched it both with and without binoculars for approximately 20-25 minutes. During that time, numerous commercial flights were taking off and vectoring away from the airport. The object appeared to be higher than the planes. It gradually disappeared, I believe moving off to the east. Climate and Direction: Calm wind, 60 deg. temperature, Humidty 80%; Dewpoint 44; Visibility 10 miles, object was SSE of 30 deg 15 min; 97 deg 53 min. I have been watching aircraft all my life. These were not landing lights since the white lights were at the end, not the center of the object. The blinking lights were interior to the white ones. If it had been a plane, I could have tracked it landing at a 90 deg. angle away from me. It did not do that, but rather hovered. This also eliminates potential \"landing lights heading towards me\" since the flight path for planes landing to the south would have been from my left to the right with the plane dropping below the treeline. These are easily observable from my balcony. While the movement of aircraft taking off was visibly easy to follow, this uap hovered, moved slightly south then moved away apparently to the east."],"Object Features":"None","Object Shape":"Disc","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Latitude":"30.268203","Summary":"Bright disk shaped object","Disposition":"Unresolved","Region":"Texas","Date of the Event":"03/23/2012 06:20 UTC","Object Flight Path":"Hovering then path","Longitude":"-97.735961","City":"Austin","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.268203,+-97.735961(36694)&iwloc=A&hl=en\"> mufon case (36694) map </A>","Case Number":"36694","files":["/var/www/straped/mufon/html2text/36694.html.txt","/var/www/straped/mufon/org/36694.html"],"Date Submitted":"03/23/2012 04:35 UTC","Tags":"City","Source":"MUFON"}