{"Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","divs":["Sighting Details 1.One evening while leaving band practice, my co-band member and I noticed huge, I mean HUGE space ship hovering above the Woodlawn Cemetery in Baltimore, Maryland. 2.What made us notice the object was the enormous size of the space craft, and that it was just hovering over the cemetery. 3.When I first saw the object I thought it was a huge space ship. 4.The object was shaped very similar to the saucer part of the Star Ship Enterprise on the New Generation series. Only the saucer part, not that other space garbage they put on the Enterprise that looked like \"Discovery\" booster rockets. It didn't need none of that crap. It was dark metalic like color with tiny lights all around and underneath. It appeared to have a few lights that were extended off of the bottom surface of the craft. It was huge man! It seem to be just as large as the grave yard, but it was hovering above it. It was making a low frequency sound like.....jshr...jshr....just hovering. 5. When my friend and I saw the space ship, we pulled over next to the grave yard. I asked Jay if he was seeing the same thing that I was seeing and he said yea. We were talking about how huge it was and the jshr motor sound it was emitting. We also talked about why it was over Woodlawn Cemetery like that..you know...what was it really doing other than hovering. When it left we jumped with excitement because neither of us has ever seen anything leave and travel so fast before.....did I mention that it was HUGE? After it left we agreed not to tell anyone....well it was 1981! We did tell the band though. 6. It left at a speed so fast that my eyes could barely keep up with it. It never changed sounds, it just \"zipped\" away. I guess the sound it made when it left could be compared to the sound of a bullet whizzing. It left in a \"Z\" pattern. Not a lot of Z's, but like one big Z and it was back with the stars. Comment: The followint year I was employed by the NSA (National Security Agency). I thought it perculiar when I saw a question which read..\"Have you ever seen a UFO or have ever been abducted by an alien?\" I answered \"No\". I was not going to be the one!"],"Source":"MUFON","City":"Baltimore","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"Undisclosed","Case Number":"3669","Longitude":"-76.605439","Date of the Event":"09/15/1981 12:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.292865,+-76.605439(3669)&iwloc=A&hl=en\"> mufon case (3669) map </A>","files":["/var/www/straped/mufon/html2text/3669.html.txt","/var/www/straped/mufon/org/3669.html"],"Date Submitted":"09/15/1981 12:00 UTC","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around September 15th 1981"],"Country":"United States","Region":"Maryland","Summary":"My friend and I got out of the car to see a huge UFO hovering over a graveyard!","Tags":"City","Log Number":"US-08022005-0015","Latitude":"39.292865","Object Shape":"Undisclosed"}