{"Source":"MUFON","City":"Roanoke","Latitude":"37.27454","map":"<A HREF = \"http://maps.google.com/maps?q=37.27454,+-79.935817(36703)&iwloc=A&hl=en\"> mufon case (36703) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/36703.html.txt","/var/www/straped/mufon/org/36703.html"],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date of the Event":"03/20/2012 10:30 UTC","Case Number":"36703","Log Number":"US-03232012-0032","Longitude":"-79.935817","Country":"United States","trends":["There have been 24 other sightings in Roanoke","There was one other sighting in Roanoke on or around March 20th 2012"],"Summary":"Possible explanation for sighting of March 20, 2012","Weather Factors":"Unknown","Object Shape":"Unknown","Date Submitted":"03/23/2012 11:13 UTC","Object Features":"Undisclosed","Region":"Virginia","divs":["Sighting DetailsFor purposes of integrity, I am reporting a possible explanation for the sighting on March 20, 2012 at 10:30 p.m., of a large, white star like orb of lights hovering over Read Mountain in Botetourt County, VA. My intent has been to keep an outlook for the large, white star like orb that I saw on Tues., March 20, since other people near my area are reporting similar sightings. On Wed., I checked the sky around 10:30 pm - - there was no sighting, but the area was slightly overcast. On Thurs., March 21, I checked the sky around 10:15 pm and saw a light, but this light was Venus (I believe). It was shining brightly, but it was not as large as the bright light that I observed on Tues. I felt that maybe what I saw on Tues. was really Venus, rather than a \"UFO\", so I decided to watch and see what path this light would take over the time frame from 10:30 to 10:42 pm (period of my observation on Tues.) As I watched, this large light followed just about the same path down toward the mountain, all within the projected time period and disappeared behind the mountain. This seemed very similar, but not exactly the same as Tuesday's observation. It did not appear to change colors like the one on Tuesday, but atmospheric conditions may have played a part in that. I was going to watch one more night, just to be certain about this matter, but this area is really over cast (expecting rain) so I cannot double check again. At this point, I would like to apologize for reporting a sighting that may have been incorrect. Thank you!"],"Viewing Distance":"Unknown"}