{"Object Shape":"Sphere, Star-like","Longitude":"-72.248018","Object Flight Path":"Path then hovering","Latitude":"40.953216","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"New York","City":"Wainscott","Date of the Event":"03/24/2012 12:00 UTC","Tags":"City","Summary":"White orb above Long Island in sight for over 1 hour 15 mins this a.m.","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.953216,+-72.248018(36707)&iwloc=A&hl=en\"> mufon case (36707) map </A>","trends":["There have been 5 other sightings in Wainscott","There were 2 other sightings in Wainscott on or around March 24th 2012","This sighting has been favorited 2 times.",""],"Viewing Distance":"Over One Mile","Log Number":"US-03242012-0003","Source":"MUFON","Date Submitted":"03/24/2012 10:31 UTC","Case Number":"36707","files":["/var/www/straped/mufon/html2text/36707.html.txt","/var/www/straped/mufon/org/36707.html"],"divs":["sighting detailsi was outside with my dog, and i had seen several objects in the night sky which is frequent, i have reported these repeat occurences to mufon..i saw a white star like object ascend over my tree line in the north west direction, where it then hovered. i was able to get two camera's from inside the house, when i returned moments later, the object was in same place. i have video footage, not that clear in some clips, but quite clear in others. this object was in the sky heading in an south easterly direction for approx 1 1\\4 hours. i called mufon ny director, sam, and we reviewed all possible objects via stellarium, and could find no such objects that matched. i was able to send him footage, as i was on the phone with him (i think i woke him up i called so early...am sorry sam!) i was able to maintain visual contact with this white star like orb. in that i had no more avail space on my camera memory card, i looked at object right before it disappeared behind treeline on adjacent side of property from where it had originated, and the object appeared to be reflective, and elongated, almost rectangular shaped. i do not have equip to document telescope visual, only my verbal description."]}