{"files":["/var/www/straped/mufon/html2text/36708.html.txt","/var/www/straped/mufon/more/36708_submitter_file1__chapelhillufo.jpg","/var/www/straped/mufon/org/36708.html"],"City":"Chapel Hill","Summary":"3 white lights in a triangle formation pointing down with a green light below the white lights. No strobes just solid lights.","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Object Features":"Unknown","Log Number":"US-03242012-0004","Sighting Duration":"00:01:00","Region":"North Carolina","Longitude":"-79.032409","Country":"United States","Case Number":"36708","Object Shape":"Unknown","Date of the Event":"03/23/2012 12:00 UTC","Latitude":"35.90054","trends":["There have been 4 other sightings in Chapel Hill","There were no other sightings in Chapel Hill on or around March 23rd 2012","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsAt approximately 12:15-12:20am I witnessed 3 white lights in a tight triangle formation pointing down. Below the lights there was a smaller solid green light. There was a slight gap between the white lights and the green. This was on NC HWY 54 westbound just after exiting from I-40 on the Durham-Chapel Hill line. The object descended very smoothly without any lateral movement from an approximate altitude of 1000 ft. or so (rough estimation). I lost sight of it once it became obstructed by trees. As it did so it became one solid white light. The sighting lasted just under a minute. The object appeared to be about a mile to my southeast. At the time of the sighting there was a conventional smaller airplane several thousand feet up to the west-southwest of the object. I am a meteorologist and storm spotter so I am quite familiar with sky observation and explainable phenomena. This was clearly an object under some form of intelligent control and not weather related."],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=35.90054,+-79.032409(36708)&iwloc=A&hl=en\"> mufon case (36708) map </A>","Source":"MUFON","Date Submitted":"03/24/2012 11:17 UTC"}