{"City":"Prescott Valley","Date of the Event":"09/01/2011 12:00 UTC","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/36704.html.txt","/var/www/straped/mufon/org/36704.html"],"Weather Factors":"Unknown","Log Number":"US-03232012-0033","Longitude":"-112.311721","map":"<A HREF = \"http://maps.google.com/maps?q=34.612444,+-112.311721(36704)&iwloc=A&hl=en\"> mufon case (36704) map </A>","trends":["There have been 12 other sightings in Prescott Valley","There were no other sightings in Prescott Valley on or around September 1st 2011"],"Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"03/23/2012 11:14 UTC","Object Features":"Unknown","Summary":"Same thing as the orb over South Mtn. phoenix Az.on 21st, march 2012, hovers up over Mingus Mtn. across the valley from prescot valley","Tags":"City","Source":"MUFON","divs":["Sighting DetailsSince early fall, we have noticed this flashing ball of light, that comes up over Mingus Mountain every night, i assumed it was some sort of wierd satalite, until i saw the South Mountain story, and that orb that was spotted was the exact same as what i see, only it is probably 20 or more miles East as the crow flies right across the valley from my town, this thing flashes red, white and green lights, sometimes it flashes red and green only, sometimes another configuration, as it rises, then it falls, as it does so, sometimes it will list to the left or the right, at times it will travel left to right horizontally and visa versa, sometimes it completely goes dark... there is a telephone pole and line that stands in my view of the middle part of Mingus Mountain, so i use that as i sit on my porch, to triangulate myself to that thing so that i can see it move better, I just got a camera tonight,with a 30 times zoom! but i have to wait 8 hours for the batteries to charge, or i would already have a pic of this thing!, if i go out often enough in the early dark hours i know i will catch it dancing around like a drunk ballerina!"],"Object Shape":"Star-like","Case Number":"36704","Latitude":"34.612444","Region":"Arizona"}