{"Object Flight Path":"Path with directional change","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/36709.html.txt","/var/www/straped/mufon/org/36709.html"],"Source":"MUFON","Latitude":"35.017312","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.017312,+-97.086547(36709)&iwloc=A&hl=en\"> mufon case (36709) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsMy husband and our two boys were leaving our home in Seminole, Oklahoma to go fishing. My son and step son said \"wow look at all those birds!\" I looked up out of the sun roof of the vehicle and saw a plane going very fast to the west, and then saw what looked to be over 100 white, round objects and quickly realized they were NOT birds!! We drove a little and parked in a church parking lot to get out and observe. The objects were moving in a northerly direction, but moving like birds or like swarming fish in water, going in one direction then changing into another direction while still heading North! There was a smaller group of about 50 of these objects that stayed lower and were not part of the larger group, but just like the objects in the larger group. We watched in amazement how the orbs dimmed almost to invisible then brightened like a stars!! The boys said it looked like fireflies. I took 2 pictures with my phone but it showed NOTHING but blue sky, and then they completely faded out, the lights diminished and were nowhere to be seen. We all know that we saw something we cannot explain. We have never seen anything like this in our lives and I hope SOMEONE else saw this, as there were cars driving by us and had to see that we were looking and pointing at something! This is the second time I have seen a UFO in this town and I would like to have some answers!!!"],"Object Shape":"Circle","Date of the Event":"03/24/2012 02:35 UTC","Region":"Oklahoma","Summary":"Flock of over 100 orb like objects that moved silently in the sky, dimmed and brightened then vanished.","Longitude":"-97.086547","Log Number":"US-03242012-0005","Country":"United States","Date Submitted":"03/24/2012 09:31 UTC","Case Number":"36709","Object Features":"None","Sighting Duration":"00:05:30","trends":[]}