{"divs":["Sighting DetailsI was driving northbound on the 7200 block of North Wadsworth Blvd at 10:37PM when a single point of solid, bright, white light, about 50 degrees above the horizion caught my attention. During my brief observation (3 seconds) it became appearent that the object was moving 10 degrees East of due North. It was observed traveling in linear motion and quickly disappeared. The light appeared to be moving much too fast to be a satellite, but far slower than any meteor I've ever observed. The object left no trail, (unlike a meteor of such brightness) and the light it emitted was a \"hard\" non-glowing, white light- similar to that of a krypton bulb. Lights of similar brightness can be observed from helicopters or fixed-wing aircraft that are on approach to the nearby Rocky Mountain Metro Airport. However, this light did not the match the typical locaton, or motion of an aircraft on approach, and once the light disappeared, there was no sign of landing, navigation, or anti-collision lights. This object was in clear view through my car's windshield, and I have ruled out the possibility of any reflections from the windshield as well."],"Summary":"Bright white light,too slow for a meteor, but way too fast to be a satellite.","Longitude":"-105.081476","Disposition":"Unresolved","Date of the Event":"03/23/2012 10:37 UTC","City":"Arvada","Viewing Distance":"Unknown","Log Number":"US-03242012-0002","Object Shape":"Star-like","Latitude":"39.82731","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"36706","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around March 23rd 2012"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.82731,+-105.081476(36706)&iwloc=A&hl=en\"> mufon case (36706) map </A>","Source":"MUFON","Region":"Colorado","Date Submitted":"03/24/2012 02:20 UTC","files":["/var/www/straped/mufon/html2text/36706.html.txt","/var/www/straped/mufon/org/36706.html"],"Tags":"City","Country":"United States"}