{"Object Features":"Unknown","Object Flight Path":"Stationary,Straight-line path","Sighting Duration":"00:01:30","City":"Shelby Township","map":"<A HREF = \"http://maps.google.com/maps?q=42.670782,+-83.032993(36715)&iwloc=A&hl=en\"> mufon case (36715) map </A>","Date of the Event":"03/25/2012 11:02 UTC","Object Shape":"Cylinder","Latitude":"42.670782","Region":"Michigan","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-83.032993","Weather Factors":"Unknown","trends":["There have been 7 other sightings in Shelby Township","There were no other sightings in Shelby Township on or around March 25th 2012"],"files":["/var/www/straped/mufon/html2text/36715.html.txt","/var/www/straped/mufon/org/36715.html"],"Disposition":"Unresolved","Summary":"It was at the height a plane would be, two blue dots big blinking red, blue and white, then like soooo fast faster then an eye blink on drops straight down to about the houses, then after a few secs the other one does. After the just start going in a stra","Tags":"City","Case Number":"36715","Country":"United States","Date Submitted":"03/25/2012 01:06 UTC","Log Number":"US-03252012-0003","divs":["Sighting DetailsMy sister, her boyfriend and I were driving home from a play. We were about to turn on our street when her boyfriend noticed two blue dots in the sky blinking from, red to white then back to blue. At that moment they were just stationary hoering in the sky, about a mile away. When I looked over at them I saw one of the dots, they were roughly to where a plane would be in the sky, drop in a straight line, unbelievably fast, to an abrut stop. It dropped to just about the top of the house below it. After a few seconds the other dot proceeded to do the same as the previous one. The objects then started to dart back and forth in a straight line at the height they stopped at. After a couple seconds of this the objects just dissappered. The first thing that entered our minds was UFO, that could be the only plausible explanation. The excitement that came over me the moment I saw the objects was unreal, I knew what I was seeing was a UFO, no doubt in my mind about it."],"Source":"MUFON"}