{"divs":["sighting detailsmy wife and i were traveling from pikeville, kentucky to inez, kentucky on us route 23 and had just were passing deskins motors, a dodge, jeep dealership on the left side of the 4 lane highway. i was looking at cars on the lot as i was driving by and my wife told me to look up in the air. when i did i saw at least 8 white\\yellow glowing orbs in the sky about what i would guess to be at least 500 to 1000 feet in the air at about what i would guess to be about 1\\2 mile away. they were in a random pattern but were grouped together loosely. two of the orbs were moving in a slow counter clockwise motion and a couple more were moving slowly up and down. the rest were hovering. i pulled the car over on the side of the 4 lane and my wife and i got out of the car to look. i am 45 years old and never have seen anything like this. i thought at first the lights were search lights on helicopters but they were closes enough to make noise enough to be heard. the circular pattern the orbs were moving in were too fast to be done smoothly by a helicopter. this display lasted about 5 minutes then the orbs moved into a stacked formation and slowly ascended one after the other into the low cloud cover and we could no longer see them. i never reported this to anyone else except friends because it occurred on 9\\11\\11 and i could not say if they were some kind of aircraft. i really believe these were not aircraft due to the manuevers these orbs were making so smoothly. my wife and i are not seeking attention we would just like an explanation or to know if we were the only ones who saw this. my wife said others pulled off and looked but i do not remember this because i was a little shaken and still am. i always thought i would be less disturbed because i grew up in florida and have seen rocket launches to the moon while i was growing up."],"Date of the Event":"09/11/2011 09:30 UTC","files":["/var/www/straped/mufon/html2text/36713.html.txt","/var/www/straped/mufon/org/36713.html"],"Viewing Distance":"Over One Mile","City":"Pikeville","Log Number":"US-03252012-0001","Region":"Kentucky","map":"<A HREF = \"http://maps.google.com/maps?q=37.410483,+-82.532558(36713)&iwloc=A&hl=en\"> mufon case (36713) map </A>","Sighting Duration":"Undisclosed","Latitude":"37.410483","Case Number":"36713","Date Submitted":"03/25/2012 12:26 UTC","Longitude":"-82.532558","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Disposition":"Unresolved","Object Shape":"Sphere","Tags":"City","Summary":"I and my wife saw glowing orbs in the sky in Pike County Kentucky while travelling on a 4 lane highway on 9/11/11. Nothing was reported on the news the next day","trends":["There have been 3 other sightings in Pikeville","There were no other sightings in Pikeville on or around September 11th 2011"],"Object Features":"None","Weather Factors":"Unknown","Source":"MUFON","Country":"United States"}