{"Summary":"Shape most resembled {","Country":"United States","Disposition":"Unresolved","Date Submitted":"03/25/2012 11:55 UTC","Source":"MUFON","Case Number":"36726","divs":["Sighting DetailsMy friend and I were out in his front yard just after midnight talking politics when a passing object overhead caught my attention. The object was moving in a south to north directions passing almost directly overhead. I first noticed the object when it was about 70 degrees overhead and viewed the object for about 2-3 seconds until it disappeared at about a 45 degree angle of view. I could not estimate the actual altitude, size or speed of the object, but the apparent altitude appeared to be the same height of a small personal air craft or helicopter, so maybe a 1000 ft up and the apparent size of the object was 2\" wide. I did not see a length. It did not make any sounds. The shape of the object I observed is best describe with the following keyboard character { or however, there was not a point in the middle of the shape. All I saw was the leading edge of the object which almost looked like thick smokey white condensation (such as con-trails from an aircraft), but this was on the leading edge of the \"wing(s)\" and it did not trail, only highlighted the leading edge as it traveled. Another way to describe it would be it looked similar to the leading edge of a search light shining in the sky at night. When I first saw the object I remember thinking that the white I was seeing just appeared out of no where and how much is stood out and contrasted with the night sky, which was clear last. I immediately thought of the UFO's Over Illinois TV show and and yelled at my friend to turn around and look up it's a UFO. By the time my friend turned around and looked the object had disappeared. The only rational non-UFO explanation I could think of was a search light shining from some club or bar promotion, but we monitored the sky of any more search lights and saw none. Plus the object moved in a straight line, no circular pattern, and it was only the leading edge and not a semi or full circle. I knew instantly what saw was not a normal aircraft. I was pumped after seeing it and kept describing what I was over and over to my friend and then his wife."],"Latitude":"38.579856","trends":["There have been 4 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around March 25th 2012"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.579856,+-89.89781(36726)&iwloc=A&hl=en\"> mufon case (36726) map </A>","Tags":"City","Date of the Event":"03/25/2012 12:00 UTC","Longitude":"-89.89781","Object Shape":"Boomerang, Other","Weather Factors":"Unknown","Object Features":"Wings","Object Flight Path":"Straight-line path","Region":"Illinois","Log Number":"US-03252012-0013","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/36726.html.txt","/var/www/straped/mufon/org/36726.html"],"City":"O'Fallon"}