{"Object Flight Path":"Straight-line path,Path with directional change","City":"Billings","Latitude":"45.789716","Object Features":"Unknown","Region":"Montana","Log Number":"US-03252012-0007","Weather Factors":"Unknown","Country":"United States","Date of the Event":"03/24/2012 08:28 UTC","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"03/25/2012 07:36 UTC","Summary":"Approx. 6-7 lighted objects traveling in same direction less than a mile apart from each other.","map":"<A HREF = \"http://maps.google.com/maps?q=45.789716,+-108.49328(36720)&iwloc=A&hl=en\"> mufon case (36720) map </A>","Tags":"City","Sighting Duration":"Undisclosed","divs":["sighting detailson 3-24-12 at approx. 2028 hrs. i was standing on my deck facing north\\northeast and observed several approaching lighted objects in the sky in a southwest direction. the objects appeared to be orangish in color caused by a white\\red light. the objects were spaced approx. 1\\2 to 1 mile apart, were silent, and all but two extinghished their lights when they reached a point east of my residence. there was an airliner high in the sky traveling in and east\\west direction, and the last two objects, although much lower in the sky (1500-2500) feet agl, extinguished their light prior to a \"visual\" intersection with the plane. the last object acuatlly appeared to possibly hover momentarily before smoothly going what appeared vertical and extinshishing its light on the way up well in advance of a visual intersection with the highflying airliner. i at first thought the objects were several planes or helicopters in a linear group flying in the same direction, but these objects were silent, and extinguished their lights. i live close to an airport, and these lights were just as bright in the sky, and as low as most approaching aircraft to the airport."],"Object Shape":"Unknown","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/36720.html.txt","/var/www/straped/mufon/org/36720.html"],"trends":["There have been 13 other sightings in Billings","There were no other sightings in Billings on or around March 24th 2012"],"Longitude":"-108.49328","Case Number":"36720"}