{"Object Flight Path":"Straight-line path","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Colorado","Object Shape":"Boomerang, Chevron","Latitude":"40.168857","files":["/var/www/straped/mufon/html2text/36728.html.txt","/var/www/straped/mufon/org/36728.html"],"Weather Factors":"Unknown","Summary":"crescent or chevron-shaped object, luminous or reflective, silent","Date of the Event":"03/24/2012 09:45 UTC","City":"Longmont","Disposition":"Unresolved","Log Number":"US-03252012-0015","Object Features":"Wings","Case Number":"36728","Country":"United States","Date Submitted":"03/25/2012 01:58 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.168857,+-105.093238(36728)&iwloc=A&hl=en\"> mufon case (36728) map </A>","Longitude":"-105.093238","Source":"MUFON","divs":["Sighting DetailsMy wife, son (12yo) and I were in our back yard last night with a low fire in our chimnea enjoying a clear night star-gazing (we had a telescope out and were observing Jupiter, Venus, and a low moon before this event). We were talking when my wife pointed to the sky nearly directly overhead and asked what \"that is\". My son and I both looked and we all three watched a faint crescent shaped (my wife called it \"crab shaped\", it did look something like a crab floating across the sky) object move silently across the sky in a north-west direction in a straight line, disappearing behind my neighbor's house. The object was faint, did not appear to have discrete lights, it looked as if it was glowing or reflecting light. To be honest it looked like would expect a silvered Mylar balloon would look reflecting fire light. The shape of the thing was crescent but seemed to have feathered edges on it's wings. So a bird or balloon make sense except it couldn't have been either in our opinion, the apparent speed and course ruled out balloon and it just didn't seem like a bird. I have never reported a UFO, and never claimed to have seen one. I have never in my 45 years seen anything in the sky I couldn't explain. I am a scientist by education, and an engineer by trade, working in the aerospace field. I am also a photographer, and know a think or two about lighting, light sources, and reflections. I am also familiar with aircraft, military and civilian, as well as spacecraft and meteorological phenomena. I cannot explain what we saw last night. I report this to add to your observation database. I would love to hear more about similar sightings if they exist."],"trends":["There have been 30 other sightings in Longmont","There was one other sighting in Longmont on or around March 24th 2012"],"Sighting Duration":"Undisclosed"}