{"Tags":"City","Disposition":"Insufficient Data","Country":"United States","Log Number":"US-08022005-0018","Longitude":"-74.007978","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI lived in the Sea Gate section of Brooklyn, New York which is a private community at the end of Coney Island. I was going to get ready for work. I was sitting up in bed having my coffee at 6:45 am,(my bedroom was on the 2nd floor of a 2-family house and in the front of the apartment.) I was looking across the street at my neighbor's house, which belonged to Jackie Parascondola and his family. Something caught my eye. It was exactly directly in my full field of vision. I called my mother to see it and she was amazed too. (She is now deceased and cannot corroborate my accounting of this incident). I ran to get my 8mm Kodak movie camera, but it lacked film. The object was approximately 30' above the roof directly dead-center over Jackie's house. It looked like a small water tower (oval-shaped top and 4 legs descending from the top). It was light tan or beige. It stood absolutely still and suspended in mid-air. It didn't go sideways, tilt or turn around or upside down. No lights, no sound - just suspended and quiet. We watched it for about 10 solid minutes. It stayed there about 5 minutes doing nothing in direct line of my gaze. All of a sudden it started to move straight up in a direct line about 30 feet, slowly and in complete silence. It came back down to the original height over the house and then moved in a straight line directly to its right about another 30 feet. It went back to the original position for a few moments and then went left. It went behind the trees on the block and we couldn't see it anymore because the sun was rising from the East, which completely obliterated our view. It moved slowly and steadily and in complete silence. It was a mechanical object that seemed to be made of metal. It appeared to us to be controlled because of its measured movements. It never went fast. Always at the same rate of speed. To this day, every time I see a water tower, while driving, I think of that object. The object was maybe 5 feet in height and about 2-3 feet wide. It was longer than it was wide. I have always wanted to report this and now, 42 years later, it is still clearly visualized and remembered by me. I can draw a picture and I can even go back to the house and take a digital photo and sketch what I saw, if requested. Anyone have a similiar experience?"],"Date Submitted":"05/31/1964 07:00 UTC","Source":"MUFON","Object Shape":"Other","Case Number":"3672","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"05/31/1964 07:00 UTC","Viewing Distance":"101-500 Feet","Region":"New York","Latitude":"40.57681","Summary":"Saw object hovering over neighbor's house early in the morning. No lights/no sound. Absolutely silent and suspended in mid-air.","map":"<A HREF = \"http://maps.google.com/maps?q=40.57681,+-74.007978(3672)&iwloc=A&hl=en\"> mufon case (3672) map </A>","Object Features":"Other","files":["/var/www/straped/mufon/html2text/3672.html.txt","/var/www/straped/mufon/org/3672.html"],"Weather Factors":"Unknown","City":"New York","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around May 31st 1964"]}