{"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"03/25/2012 11:38 UTC","Summary":"straight line flight multipul witnesses","Country":"United States","divs":["sighting detailswhile at a chili cook off with some of my wifes friends, one of them looked up into the sky and said whats that? a group of us looked up and saw a orb like object moving from the southern sky north at maybe 1000 ft moving quickly north, it had a greenish\\yellow\\ orange glow, we saw it for maybe 10 seconds, we moved across the yard to see if we could watch it come out the other side of a group of trees but it was gone.this was st patricks day, this event took place in northglen colorado,last night march 24th i was outside cheking out the nice crescent moon with jupiter and venus shining brightly above the moon, i thought i would snap a few photos quickley, i didnt have my glasses on and the photos came out crappy, the moon and the planets were just squigly lines, as were some of the neighbor hood lights, but in the photos there were orbs, that were not visible when i took the photos, but were there when i downloaded the pictures to my computer, i checked the camera lens for dirt, dust or anything that would have created the orbs, but the lens was clean, why arent they distorted like the moon, planets and other lights in the photos? and these orbs are a match to the one seen by multipul witnesses the week before 25 miles south of this location, perhaps they are just a reflection or something else from the camera, i dont know, but very interesting to say the least, dave b."],"Date of the Event":"03/24/2012 12:00 UTC","Latitude":"40.150777","Object Features":"None","Sighting Duration":"Undisclosed","Case Number":"36725","trends":["There have been 30 other sightings in Longmont","There was one other sighting in Longmont on or around March 24th 2012","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Log Number":"US-03252012-0012","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.150777,+-105.140858(36725)&iwloc=A&hl=en\"> mufon case (36725) map </A>","files":["/var/www/straped/mufon/html2text/36725.html.txt","/var/www/straped/mufon/more/36725_submitter_file1__NiceMarbles2056.jpg","/var/www/straped/mufon/more/36725_submitter_file2__NiceMarbles2062.jpg","/var/www/straped/mufon/more/36725_submitter_file3__NiceMarbles2057.jpg","/var/www/straped/mufon/org/36725.html"],"Object Shape":"Sphere","Region":"Colorado","Longitude":"-105.140858","City":"Longmont","Source":"MUFON","Disposition":"Unresolved"}