{"Case Number":"36732","Region":"KwaZulu-Natal","Object Shape":"Star-like","Log Number":"ZA-03252012-0019","Summary":"star like - flashing white then blue at regular intervals","Sighting Duration":"01:03:00","Source":"MUFON","divs":["Sighting DetailsWent to bed at around 11pm & could not sleep as it was too hot. Got up at around 3am and read a while, and started getting sleepy, so switched lights off and went to kitchen to get glass of water. As I was drinking the water, I looked out at the stars - one of them was particularly bright - about a quarter of the size of Venus and about half as bright. It attracted my attention as it was sort of strobing - going from white to blue to white to blue. As I watched, it moved in what looked like a circular pattern. I rubbed my eyes, thinking I was seeing things, but it moved again - this time in an irregular circular pattern, and the movement was definite, as I could guage it from the edge of the tree silhouette outside. Thinking it may be something to do with the window glass, I rushed outside and confirmed that it was moving from time to time. I had a sighting just a month previously (fortunately witnessed by my wife) and had not managed to take a photo of that one, so I rushed inside and got my digital camera, zoomed to its maximum and got two shots of it. The image is unfortunately so small as to be virtually useless as the object was approximately 20km away (near as I could tell, but that may be incorrect). It's height was around 45 degrees from the horizon, bearing plus minus North, North East (I checked my compass). My first thought was that it was a star, and because it was low on the horizon, it was being severely distorted and giving the illusion of moving, but then I noticed a star just near it that was not moving at all! My second thought was maybe it was an aircraft, as it was hovering above the approximate position of the Durban airport - the trouble with that theory is that it maintained its position for over an hour! Then I saw what I can only describe as an 'auroric' effect, starting about 5km from the object, contracting in to the object. This only happened once. Directly after this, I saw 'incoming' golden orbs streaking in from about a 10km radius to the object, and then from the object away from it and disappearing at about the same distance. I saw lots of them and lost count at 41. These orbs came in towards and out of the object at all angles or directions. The object did strange irregular manauvers at irregular intervals every minute or two. At 4:31am it dimmed suddenly to a tiny speck for a minute or so, and then returned to its original brightness. I searched for any sign of clouds, but could see none. It should be noted that being near the sea, there is a lot of humidity, so there is a chance there was some fine cloud that I could not observe that may have obscured it momentarily, but it only happened once, so I have my doubts it was cloud. At exactly 4:44 it moved up to about 22,000 feet - that is about 2,000 feet from its original position. This was a marked change in altitude, and put away my thoughts of it being a star affected by atmospheric interference completely. Please remember these distances I have quoted are suspect, as it was difficult to guage any sort of distance in relation to the object, which was too far to make out if it had any particular form or not. At 5:03am it faded into nothingness and did not reappear. During this time I took my telescope outside, but the objects movements were such that I could not track it or get a decent view of it - the telescope is not of high quality, and of the type used for casual lunar observation. I was quite critical of my thinking during this time as I had seen a very clear UFO about a month previously (also reported on this site), and thought I may be experiencing some sort of 'UFO' fever - where one starts to imagine that any and everything one sees in the sky is suspect. Hence the included thoughts I had of what it could rationally be. Nevertheless, the observation does not add up to anything rational, and I think there is a real chance it was a craft of sorts, but I cannot truly say if it was."],"trends":["There has been one other sighting in Westville","There were no other sightings in Westville on or around March 22nd 2012"],"Country":"South Africa","Longitude":"30.901918","Tags":"City","Date of the Event":"03/22/2012 04:05 UTC","City":"Westville","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=-29.818542,+30.901918(36732)&iwloc=A&hl=en\"> mufon case (36732) map </A>","files":["/var/www/straped/mufon/html2text/36732.html.txt","/var/www/straped/mufon/org/36732.html"],"Latitude":"-29.818542","Date Submitted":"03/25/2012 03:54 UTC","Object Flight Path":"Other","Viewing Distance":"Over One Mile"}