{"Region":"Tennessee","Object Features":"None","Latitude":"36.42423","Tags":"City","Country":"United States","Object Flight Path":"Straight-line path","Summary":"A light in the sky appears and \"flashes\" and then drops below our line of sight.","Log Number":"US-08022005-0019","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.42423,+-89.05701(3673)&iwloc=A&hl=en\"> mufon case (3673) map </A>","City":"Union City","trends":["There have been 3 other sightings in Union City","There were no other sightings in Union City on or around August 19th 2002"],"Weather Factors":"None","Longitude":"-89.05701","Object Shape":"Sphere","Date of the Event":"08/19/2002 04:00 UTC","files":["/var/www/straped/mufon/html2text/3673.html.txt","/var/www/straped/mufon/org/3673.html"],"Date Submitted":"08/19/2002 04:00 UTC","Case Number":"3673","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIn the front yard of my home at the time, we were outside looking at a new car a friend had purchased. There were six of us outside just chatting at the time, when my daughter said, \"what's that in the sky\"? We saw what looked like a extremely bright star. But, soon we realized that it was dropping lower and lower in the sky. As we watched it, the light \"fluttered\". I'm not sure of what term to use, but it seemed like the like moved.. a sheet of light, like a page turning in a book eminated from the light. It was a series of flashes only lasting a moment, then it seemed to remain a solid light after that. Until it dropped below our line of sight behind a construction company rock pile across the street. My daughter and I jumped in the car to get another look, but never found it again. I don't claim anything about this, other than it was an odd way for any light to behave, and I've never seen anything like it before or since. I have a public job as a radio announcer in a small town, so I would appreciate this NOT being used in association with my name. Therefore, I have NOT offered my address, or phone number. But, I have offered my email if for some reason you have questions. Thank you."],"Viewing Distance":"20 Feet or Less","Disposition":"Insufficient Data"}