{"files":["/var/www/straped/mufon/html2text/36735.html.txt","/var/www/straped/mufon/org/36735.html"],"Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Summary":"large star like craft absorbs red orb than glows and pulsates greater, follwed by slow decent","Region":"Florida","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Longitude":"-82.782985","trends":["There have been 8 other sightings in Seminole","There were no other sightings in Seminole on or around February 29th 2012"],"Date of the Event":"02/29/2012 09:14 UTC","Weather Factors":"Unknown","Object Shape":"Diamond, Fireball, Sphere","Disposition":"Unresolved","Case Number":"36735","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"27.833158","Object Features":"Unknown","divs":["Sighting DetailsIt was around 9:14 PM... I had just got home from work and took my dogs outside into the backyard before getting ready to go to bed. I had an erie feeling as I looked at the full moon since this wasn't the first time that I've seen odd things in the sky. I looked west towards the Gulf of Mexico and I saw a star like object with a yellow-orange hue. It was sort of glowing and pulsating. It was stationary for the first couple of minutes. A red orb suddenly appeared about 400 yards below the object and was immediately absorbed into it. After the craft in question absorbed the red orb, it got significantly brighter. In addition to this, orange and white hues became more prominant. After the absorbtion, the object slowly descended diagonally. It stopped halfway between where it was and the tree line and hovered for about thirty seconds. It then moved to the left and upward slightly, where it stayed for about ten seconds. It then descended below the tree line. It's unknown whether or not it landed. It just descended until I could no longer see it. I was extremely unsettled. I called for my mom, but she didn't see any of it. The rest of the night was uncomfortable."],"City":"Seminole","map":"<A HREF = \"http://maps.google.com/maps?q=27.833158,+-82.782985(36735)&iwloc=A&hl=en\"> mufon case (36735) map </A>","Date Submitted":"03/25/2012 04:45 UTC","Log Number":"US-03252012-0022"}