{"Country":"United States","City":"New York","Object Flight Path":"Path with directional change","Tags":"City","Summary":"Observed two star - like lights, but somewhat brighter and larger, traveling across the sky. I est speed greater the 6000 mph, with abrupt direction changes.","Date of the Event":"03/22/2012 09:50 UTC","Source":"MUFON","Log Number":"US-03252012-0021","Latitude":"40.717263","files":["/var/www/straped/mufon/html2text/36734.html.txt","/var/www/straped/mufon/org/36734.html"],"Disposition":"Unresolved","Date Submitted":"03/25/2012 04:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.717263,+-74.000243(36734)&iwloc=A&hl=en\"> mufon case (36734) map </A>","Object Shape":"Star-like","divs":["Sighting DetailsThere is a cat in my apartment that started acting strangely at the window. I went outside of my rooftop apartment and 2 very bright stars caught my eye. Quickly i realized they were moving and I tracked them across the sky. They were moving together about 4-5 inches apart relative to my observation point. I believe the altitude was quite significant at 90,000 or more feet high. The lights tracked almost directly over me and i continued to observe them as they headed north. I followed them for 20 - 30 seconds as they were now probably 40 miles, or more, north of my rooftop vantage point, one of the lights abruptly veered toward the other light. The second light seemed to give way and they continued very close together into the horizon and out of view. Since then, i have tracked several commercial aircraft that followed the same approximate course. It takes a regular commercial jet about 4 minutes to complete the path that these lights covered in about 20 - 30 seconds tops. No noise, no exhaust, no flames,. abrupt veering. My roof-top vantage point made this sighting quite extraordinary, indeed. Interestingly, when i tried to call my friend to tell her about it, we encountered some cell phone problems."],"Longitude":"-74.000243","Weather Factors":"Unknown","Case Number":"36734","Sighting Duration":"00:00:30","Object Features":"Unknown","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around March 22nd 2012"],"Region":"New York","Viewing Distance":"Over One Mile"}