{"Country":"United States","Date of the Event":"03/25/2012 11:10 UTC","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.889716,+-72.777439(36749)&iwloc=A&hl=en\"> mufon case (36749) map </A>","Case Number":"36749","Disposition":"Unresolved","trends":["There have been 3 other sightings in Simsbury","There were 2 other sightings in Simsbury on or around March 25th 2012","This sighting has never been favorited.",""],"Sighting Duration":"00:03:45","Date Submitted":"03/26/2012 01:13 UTC","Latitude":"41.889716","Object Shape":"Triangle","City":"Simsbury","divs":["Sighting DetailsI live in a small town with my grandparents. We live within 15 miles of Bradley Int'l Airport and see many airplanes, day and night, fly by. On March 25, 2012 me and my grandfather went out to walk our dog at 11:00 PM. When we turned around to head back at 11:10 PM, when I suddenly whirled around for no apparrent reason toward some trees of our neighbors and in the sky, over the mountains, about 5-10 miles away, 500-1000+ ft. up, were two very close together sets of lights at nearly a standstill, almost a hover. Bear in mind, that at this distance, the object would have to have been very large, possibly a mile or more, since the lights were the distance apart of a golfball held at arm's length. Far to close for any airplanes to be together, which was what made me realize it was something very abnormal, and not any airplane. At their speed, they would have passed over us while we were running. They did not, however, they just seemed to appear where they were over the mountains as I turned around. Then the lights slowly started accelerating away, mainating a perfect \"golfball's width at arm's length\" for about 2 minutes and 45 seconds. Then, all of a sudden, the lights broke their distance, increased speed, and started rapidly descending for about 1 minute over the mounains until they disappeared, as if they had been found and did not want to be seen. As I witnessed the event, and afterward, I had this vague growing feeling that these lights were somehow connected or part of a larger object that was unseen. What compounded my belief that this was an actual UFO sighting was that I believe I saw 2 military aircraft fly overhead just before and after the sighting. All of the commercial and passenger airplanes that fly into Bradley Int'l Airport all have Yellow forward lights. These were the very first airplanes I have ever seen to have LED forward lights. These craft were also flying significatly faster than any of the commercial or passenger planes that ply overhead. I have seen many airplanes pass over while I'm at work, and seen many pass over at night, but this was unlike anything I have seen for 15 years or more, since I was a little boy of 5 or less. It was truly a feeling of awe and mystery of something truly unknown had happened that I have not felt for a very long time and I do hope someone is willing to hear my story for what what it really is, and not just another attempt for attention."],"Summary":"Walking my dog with my grampy, at about 11:10 PM, I turned around and saw a hovering set of lights about 5-10 miles away.","Region":"Connecticut","files":["/var/www/straped/mufon/html2text/36749.html.txt","/var/www/straped/mufon/more/36749_submitter_file1__ufopic001.jpg","/var/www/straped/mufon/org/36749.html"],"Log Number":"US-03262012-0005","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Features":"Wings","Longitude":"-72.777439","Viewing Distance":"Over One Mile"}