{"Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on the phone and walked outside when I noticed a blueish ring of light in the clouds. On further inspection it was clear that the ring had equally spaced balls of blue light. After getting a few photos and for a minute or so the objects and the ring increased luminosity substantially. That did not last very long and after 20 minutes total It had faded away and I went back inside. About 10 minutes later my father told me that it was back. I went outside and observed the same ringlike formation and more glowing spots in the clouds much higher than the initial ring. Within a minute or so another ring much higher above it had formed. This ring appeared to be made up of 6 seperate balls of light which seemed to be moving slowly and steadily in altitude and direction formed a semi circle. then 3 lights moved more east and the other 3 went west creating a gap and their positions appeared in tandum forming a ( ) pattern. All this time the original ring had reapearred and over the next few hours would dim out then randomly gain luminosity. Sometimes there would be no change and appear to \"hover\" for up to 20 minutes before dimming or changing into unidentifiable formations. During form changes the light was too dim to effectively be caught on my camera. I walked a few blocks to get a better view and after a couple hours the objects seemed to form a pattern resembling a parachute with beams that went below my sight due to tree cover. All colors were either blue or blue with a hint of white. The beams of light appeared to be gathered at a cental ground point. This lasted about 10 minutes. The objects did not seem to me to be farther away but were dim during this time. My first reaction was \"did I just get duped by an elaborate light setup?\" I found this unlikely as this was the only period during which any illumination went towards the ground. The weather had a mild cloud cover. a short light rain began after witnessing the initial \"ring\" and stopped before the event ended. The lights appeared to move much higher in elevation and some would move farther outward from view. There was always a noticable central ring of at least 6-12 clearly seperate orbs. Very shortly before the parachute formation with \"beams\" I watched a lower flying dual jet aircraft heading straight towards the objects parrarel to me but the same trajectory. The aircraft got to a close enough to think \"This is about to be interesting\" when It made an immediate 180 flew for several seconds, made a right turn flying for a minute or so then another right. This aircraft clearly gave a wide berth to the objects. Sometime between 330am and 339 the \"Ring\" formation faded away completely. Prior to this even when no orbs were visible and the ring had significantly faded out, the area of the clouds it had been stayed obviously illuminated to some degree. The maximum time between the \"fading\" before a \"fade in\" was no longer than 15 minutes. My camera was insufficiant to reliable capture anything other than when formed in a ring as any other activities reduced their lumination below the capability of my camera. There are a couple pictures that were able to capture the beginning of formation changing. Albeit they are not that great."],"Region":"Minnesota","Summary":"Observed ring of light appearing to be close to a mile in diameter. Noticed several balls of blue light that later moved into different formations.","Object Shape":"Circle","Date Submitted":"03/26/2012 05:46 UTC","Latitude":"44.793705","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/36758.html.txt","/var/www/straped/mufon/more/36758_submitter_file1__IMG_0159.JPG","/var/www/straped/mufon/more/36758_submitter_file2__IMG_0183.JPG","/var/www/straped/mufon/more/36758_submitter_file3__IMG_0191.JPG","/var/www/straped/mufon/org/36758.html"],"Country":"United States","Case Number":"36758","Date of the Event":"03/25/2012 10:45 UTC","Object Flight Path":"Hovering then path,Path with directional change","City":"Chaska","map":"<A HREF = \"http://maps.google.com/maps?q=44.793705,+-93.593739(36758)&iwloc=A&hl=en\"> mufon case (36758) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","Log Number":"US-03262012-0014","Longitude":"-93.593739","trends":["There have been 6 other sightings in Chaska","There were no other sightings in Chaska on or around March 25th 2012","This sighting has never been favorited.",""]}