{"Region":"Ontario","Object Shape":"Flash, Star-like, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.9885,+-82.35453(36751)&iwloc=A&hl=en\"> mufon case (36751) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36751.html.txt","/var/www/straped/mufon/more/36751_submitter_file1__100_5236.JPG","/var/www/straped/mufon/more/36751_submitter_file2__100_5237.JPG","/var/www/straped/mufon/more/36751_submitter_file3__100_5254.JPG","/var/www/straped/mufon/org/36751.html"],"Summary":"looked like a star that wasn't twinkling right, multicoloured and random flashes of brightness as well as colours","Source":"MUFON","Case Number":"36751","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Weather Factors":"Unknown","City":"Sarnia","Log Number":"CA-03262012-0007","Disposition":"Unresolved","Object Features":"Unknown","Latitude":"42.9885","Country":"Canada","Date Submitted":"03/26/2012 01:50 UTC","divs":["sighting detailsi was outside on my balcony, 2nd story, just having a smoke when i noticed a particularly bright star, it flashed multicoloured and very random brightness, definately didn't look like any of the other stars, or planets, it's not venus or mars. the altitude was roughly above the tree tops. this is the second time i've seen it in almost the same spot within a couple weeks. i believe its a ufo, not sure what its doing there but i took some pics the 1st time i saw it and they didn't turn out so great, so i took some more tonite and they turned out weird... it doesn't look like a star at all, and i can't really distinguish a real shape at all, seems to be constantly moving or changing or something. also no colours showed up in the pics, but did on video. it doesn't do anything except hover there so i went in after taking pics and put them on my computer, looked at them and wanted to get some more but the 'star' was gone 1\\2 an hour after i initially saw it. i'm using a kodak easyshare m531 digital camera with 14 mega pixels and 3x optical zoom. i also pointed it out to my bf as well to get a second opinion, and he said it did look odd for a star. i'm very interested in stars, ufos and anything unusual really. i will continue to watch ;) i have alot more pics, i just kept snapping to make sure i was gonna get some good ones."],"trends":["There have been 16 other sightings in Sarnia","There were no other sightings in Sarnia on or around March 25th 2012","This sighting has never been favorited.",""],"Tags":"City","Longitude":"-82.35453","Date of the Event":"03/25/2012 12:00 UTC"}