{"Country":"United States","Log Number":"US-03262012-0006","Date of the Event":"03/25/2012 12:00 UTC","Case Number":"36750","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around March 25th 2012"],"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=30.498777,+-87.206914(36750)&iwloc=A&hl=en\"> mufon case (36750) map </A>","Latitude":"30.498777","Object Features":"Unknown","City":"Pensacola","Region":"Florida","Sighting Duration":"00:01:06","Summary":"what looked like a very slow moving meteor small, close, descending below treeline","Tags":"City","divs":["Sighting DetailsI was at home, and had gone out to smoke a cigarette. I am not sure of the time, I was looking west to see if I could see the planetary \"show\" the news was talking about. I looked between two treetops just gazing at the sky. I ad not been able to see the planets because of the trees. So I was looking at the open space between two trees where I knew the planets would not be, and wasn't thinking about anything beyond getting chores done. Then a light appeared slightly above the treeline between the trees and it started slightly descending and moving south. It looked like a closeup of a very tiny meteor falling, only the angle was slight and the movement was slow. The \"meteor\" went behind the trees and I could see it's brightness through them but then the thickness was such in the treeline that I no longer saw it. I remember thinking what could that be? It wasn't a firefly, they blink. It wasn't a meteor, this was low to the ground, and so slow. But the trail behind it was just like that of a meteor. I went to the street and knowing I could not see anything to the west from there I looked to the southeast. All I noticed was an aircraft moving west, but it was too far away to tell what it was other than it was man-made and it was not the thing I saw. I felt a bit frustrated at not knowing if the little object landed or hit the earth, and not knowing what it was.. Other than that I felt nothing out of the ordinary. I did think twice about reporting it here because I am not even sure whether it was what you'd call a UFO. I don't know or sense that it was man made and I don't know whether it was intelligently controlled or just an anomaly of nature or something..... The skies were clear. All I can say is that it was like a meteor, only really tiny and low and slow. I had a sense it was less than 30 feet away and not really a meteor."],"Source":"MUFON","Longitude":"-87.206914","Object Shape":"Fireball, Star-like","Disposition":"Unresolved","Object Flight Path":"Unknown","Date Submitted":"03/26/2012 01:41 UTC","files":["/var/www/straped/mufon/html2text/36750.html.txt","/var/www/straped/mufon/org/36750.html"]}