{"Source":"MUFON","Region":"New Mexico","City":"Roswell","Weather Factors":"Unknown","Date Submitted":"03/26/2012 04:29 UTC","Tags":"City","Longitude":"-104.542429","divs":["sighting detailsa friend and i were at the cielo grande soccer field\\ track walking on the far west side of the track where there was a row of trees, around 9:45pm. we noticed a red\\blinking white light heading east bound (no noise). then noticed what had appeared to be a disk tilted at a angle at the time about nw(same colored lights). we started to notice that the objects were moving towards us at a quick pace, slowly decending which had seemed to be about 400 ft. (we tried to use our cell phones to record what we were seeing before we ran)... my friend, inital reaction seemed to be a fight or flight response, i kept looking at the objects as they approached. he said to me, \"run, run!\" as we ran through the soccer field we kept looking at the lights as they appeared over us (possibly 100-300 ft. in the sky). as we ran, we noticed a car pulling up to the parking lot; as they seen us running toward their direction... they immediately left right as we made it towards a street lamp. as we stood there we watched the triangle shape objects head south bound for about a good 5 mins. then discussed what we had seen, my friend no longer wanting to stay we parted ways and headed home."],"trends":["There have been 38 other sightings in Roswell","There were 2 other sightings in Roswell on or around March 23rd 2012"],"Object Shape":"Triangle","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"21-100 Feet, Over 1 Mile","Latitude":"33.412844","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"36757","Object Features":"Unknown","Date of the Event":"03/23/2012 09:45 UTC","Log Number":"US-03262012-0013","map":"<A HREF = \"http://maps.google.com/maps?q=33.412844,+-104.542429(36757)&iwloc=A&hl=en\"> mufon case (36757) map </A>","files":["/var/www/straped/mufon/html2text/36757.html.txt","/var/www/straped/mufon/org/36757.html"],"Disposition":"Unresolved","Summary":"triangular lights."}