{"Case Number":"3676","Log Number":"US-08022005-0022","Latitude":"32.230143","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"None, Unknown","Region":"Arizona","Summary":"Two disc shaped objects traveling west to east passed over my house then shot away back to the west.","map":"<A HREF = \"http://maps.google.com/maps?q=32.230143,+-110.917439(3676)&iwloc=A&hl=en\"> mufon case (3676) map </A>","Source":"MUFON","Sighting Duration":"00:15:00","Longitude":"-110.917439","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","divs":["Sighting DetailsI had just finished put brakes on my truck and was putting my ramps away in my back yard. My house faces east so I was walking to the west. I live just a few miles east of DM Air Force Base and I enjoy watching the planes fly over, so when I'm outside I always watch the sky. When I got to the back yard I put the ramps down and looked up out of habit. I saw 2 small objects off in the distance coming toward me so I stopped to watch them. I've always loved aircraft and can ID just about anything in the air from the Hellcat to the Raptor. As they got closer I realized they were round and had no wings or roters. They were moving slow like a helocopter but with no sound. One was very clearly not from the base. It was flying at about 500 ft in a straight line traveling from W.N.W. to E.S.E. The second object was either much smaller or higher up like maybe 1000 ft traveling with the first one. As I watched they both passed directly over head. When they did I could see that both were round and looked like polished steel. Then both objects stopped dead and shot up and away back the way they came. It took about 10 to 15 minutes to get to me and less than a second to disappear from sight. The larger or lower one was the only one I really saw shoot back to the west. The smaller one just seemed to vanish in place. I can only assume it followed the other one. I didn't report this sooner because I wasn't sure of what I'd seen, that was until last night 8-1-2005. I was standing looking out my back door watching a storm coming in. It was about 8:30 pm and I saw two lights traveling at high speed one behind the other just north of my house. I walked to my side yard to watch them to see what they were. I thought they were both Air Force jets because I could hear the engine noise. Then all of the sudden the front one made what looked like a 90* square right turn south. It's flight path was well east of my house. The one following it made a sweeping turn that took it almost right over my head. When it did I could see it was an A-10 flying at about 300 ft. The A-10 got back in behind the first object and a few seconds later the first object shot straight up out of sight. The A-10 started up after it but then turned out heading west back toward the base. I know the second light was an A-10 but the first one was what looked like what I had seen in May except it looked as if it were made of light."],"Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/3676.html.txt","/var/www/straped/mufon/org/3676.html"],"Date of the Event":"05/09/2005 07:40 UTC","Disposition":"IFO","Date Submitted":"05/09/2005 07:40 UTC","Object Shape":"Disc","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around May 9th 2005"],"City":"Tucson","Weather Factors":"None"}