{"Object Features":"Unknown","trends":["There have been 5 other sightings in Baker","There were no other sightings in Baker on or around March 25th 2012"],"Object Shape":"Circle, Flash, Sphere, Star-like","City":"Baker","divs":["Sighting DetailsI was outside, under the stars, leaning back in my fold-back chair just waiting for my space-bearing friends to make another appearance. As it is, they visit every night I go out to look for them. Since this was a particularly beautiful night, I knew they would come. Most nights I see at least four or five, although occasionally I only see one. I can always expect to see at least one peer through the clouds as if to say \"Hi!, I'm just seeing if your still there\". Last night was different. As usual I saw the initial Orb. My traditional calling method is a trained 10 second solid laser beam directly overhead. I am always careful NOT to direct my beam at any Aircraft. The first Orb appears and often a chain reaction is started and more appear. On this night, they just kept appearing. I did not keep count but there were over a dozen. They came from all directions with different intensities and distances. One Orb appeared directly overhead and was traversing the sky towards the South. I took my LED flashlight and flashed out a code. Immediately, the Orb began to grow in intensity as if flying towards me at a great speed. Within seconds the defined round light went from the size of a pea held at arms length to penny sized, then to quarter size and finally to about the size of a golf ball. When the object got to the size of a golf ball or greater, fear seized me once again and I could no longer remain in my chair. I made way to the front door and as I turned to look back, realized the object had begun to retreat the same way it had advanced, diminishing in size and intensity. Had I remained in my chair, I have no doubt the object would have continued to advance towards me. I do not know if fear is saving me or if it is keeping me from knowing the truth. Presently and Honestly, I am at an impasse. if I continue to observe these objects, all the while allowing their advancement, will I find their inhabitants to be friendly? or will there presence be more of an malevolent nature. It is said that fear is necessary for survival, however it can also be a detriment to exploration. I know that if these beings intended to pursue or harm me, they could have easily done so by now."],"Longitude":"-91.162863","Region":"Louisiana","Date of the Event":"03/25/2012 07:23 UTC","Summary":"UFOrbs communicate with light","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/36771.html.txt","/var/www/straped/mufon/org/36771.html"],"Latitude":"30.598143","Log Number":"US-03262012-0026","map":"<A HREF = \"http://maps.google.com/maps?q=30.598143,+-91.162863(36771)&iwloc=A&hl=en\"> mufon case (36771) map </A>","Sighting Duration":"01:00:00","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering,Other","Country":"United States","Case Number":"36771","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Date Submitted":"03/26/2012 02:36 UTC"}