{"map":"<A HREF = \"http://maps.google.com/maps?q=41.210602,+-77.192265(36783)&iwloc=A&hl=en\"> mufon case (36783) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-03262012-0036","Case Number":"36783","trends":["There have been no other sightings in Thurmont","This sighting has been favorited 1 time."],"Object Features":"Unknown","Longitude":"-77.192265","Tags":"City","Object Shape":"Circle, Disc, Egg","Disposition":"Unresolved","Summary":"during the time obama was visiting camp david for v8 summit. Over Site R, I saw what looked like a craft or maybe a few.","Country":"United States","Latitude":"41.210602","Region":"Pennsylvania","Date Submitted":"03/26/2012 09:06 UTC","Sighting Duration":"00:08:06","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsI was outside about 11 PM walking my dog. He started to bark and I just thought maybe it was a deer. I then preceeded to take him in. I was inside for a good 3 minutes before I realized that I needed to get something out of my mothers car that I left in it. As I go outside, I am quite afraid of the dark and the night sky because of what might be up in the sky. I happened to glance up and see a clear night with stars and a moon.. but out of my right eye, I saw something weird.. I looked up over The Underground Pentegon which is supposed to be this secret base hidden whith in a mountain side across the street from me. I saw this light. At first I thought its just an airplaine or something because we are near Dullas and BWI. I then also thought it might be a helecopter or a jet because of the president being at camp david. Then I noticed something different. I used to watch alot of alien movies like close encounters by spielberg. What I noticed was a light blinking.. it was whitish orange.. then it would flicker on and off much like what you would see on an airplaine wing.. but then after it flickered.. I saw some other lights flicker that resembled what looked like a frisby shaped round object. I was in shock... It looked like it was big... but I coudent tell because of the distance between me and the object. The lights then flickered in a wave like pattern like BLINK... then the wave.. one will blink then the wave.. and it would hover over the mountain.. I counted what I saw to be about 12-15 lights in a circle. It was not flat.. It was on an angle. The lights lasted for about a good 3 to 4 minutes before I saw it move.. It slowly moved hovering at a slow speed which Is not normal for an aircraft because it would crash. It was moving towards camp david which was south east of the underground pentegon. I do not know if I was the only one who saw this but I KNOW it was not normal. We do get alot of low flying appachae Helecopters in this area alot due to the nature of the secret government areas. I tried to record it but my cellphone was dead. It was half full but then I noticed it was dead. When I went inside.. my mother said the power flickered on and off for a few seconds as well which was during the time I saw the moving object. I have kept this to myself and told no one but I am now reporting it because I am watching your show on planet green realizing I need to let this story be heard. My biggest fear is of an abduction by a UFO. When I saw this.. My enitial reaction was I was scared.. afraid.. and did not know what to do.. I lost site of the object as it disapeared over the mountains towards camp david."],"City":"Thurmont","Date of the Event":"03/06/2012 11:10 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/36783.html.txt","/var/www/straped/mufon/more/36783_submitter_file1__Untitled-1.jpg","/var/www/straped/mufon/org/36783.html"]}