{"Longitude":"-83.111005","divs":["Sighting DetailsI reported a sighting in early January at the same location, I've actually relocated into the house of the first sighting. During this time and now I've seen the same Triangle-shaped objects as well as these star-like floaters. In this particular case, I remained calm and actually had my wife and daughter come outside to witness what I was hearing, as well as to show her the different constellations and to hear her opinion on the crescent moon and the various stars which are brighter tonight than usual.. As well the sound I was hearing, was very strange; But I attributed to some organic animal, such as a frog or something that makes a strange humming or almost instrumental groan. During this time, she noticed a star moving (not very uncommon leading up to this point.. As we have noticed these things almost every night.) It was hovering, very fast & very high. We knew this wasn't an optical illusion as We watched it pass between other stars in the sky, and went under the brightest star beside the moon, it descended & flew in a left-ward direction until it went beyond our sight. I stood on the porch straining to see it, but it had vanished beyond sigh completely. I later noticed a single Nimbus cloud, the only cloud in the visible night sky.. I'm not completely sure, what this was .. it was too high to be so large and bright, So I personally ruled out satellites or airplanes, because at that height there would be a typical sound boom or trail of noise in the sky, similar to thunder.. also, I tried to focus on the star and nothing else, so the lights reflective from the other stars wouldn't disrupt my vision. (after a brief duration exposure to light in the night sky can usually \"blind\" a person to see beyond a certain distance). That is all the information I can provide, it's simple and not very elaborate, but this is the best description I can assert without exaggerating."],"Object Features":"Unknown","Object Shape":"Star-like","Region":"Virginia","Log Number":"US-03262012-0042","Source":"MUFON","Summary":"It appeared as a bright star , it appeared white and a reddish orange.","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/36789.html.txt","/var/www/straped/mufon/org/36789.html"],"trends":["There has been one other sighting in Jonesville","There were no other sightings in Jonesville on or around March 26th 2012"],"Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Case Number":"36789","Date of the Event":"03/26/2012 09:05 UTC","Weather Factors":"Unknown","City":"Jonesville","Latitude":"36.688978","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.688978,+-83.111005(36789)&iwloc=A&hl=en\"> mufon case (36789) map </A>","Date Submitted":"03/26/2012 09:50 UTC","Disposition":"Unresolved"}