{"Latitude":"42.902614","trends":["There have been no other sightings in Cheektowaga","This sighting has never been favorited."],"Country":"United States","files":["/var/www/straped/mufon/html2text/36786.html.txt","/var/www/straped/mufon/org/36786.html"],"Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","Disposition":"Unresolved","Object Shape":"Fireball, Sphere","Sighting Duration":"Undisclosed","Date of the Event":"03/20/2012 09:05 UTC","Region":"New York","Longitude":"-78.744572","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.902614,+-78.744572(36786)&iwloc=A&hl=en\"> mufon case (36786) map </A>","Date Submitted":"03/26/2012 09:38 UTC","City":"Cheektowaga","Case Number":"36786","Summary":"2 Glowing Orbs, floating like a candle in a balloon, which then seemed to fly away at incredible speed.","Object Features":"None","divs":["Sighting DetailsI was outside of my apartment building at 9:05pm, I did not notice anything immediately. I then caught the two objects floating at approximately 280* from where I was standing. The objects floated along together moving to my left. At first I was trying to figure out where the airport was thinking they may have been planes that recently took off, but I did think they were in the direction of the airport. This is when I realized that these red-orange objects were glowing, and did not have any other lights blinking on them to indicate that they were aircraft. I then received a call from one of my classmates who was out at Tim Horton's getting a coffee, and he also saw the objects. I had been standing outside less than 4 minutes when he had called, and we stayed on the phone for a few minutes discussing what we were seeing and how strange it was. The orb on the left then started moving away at a high rate of speed, it disappeared from sight completely within 15 seconds. The second orb (which was on the left) began to move away within 30 seconds of the first orb disappearing, and it disappeared in a similar amount of time, and this was at 9:12pm. I consider myself a man of science and I have no other way of rationalizing what I saw. I was pretty stunned after seeing it and was pretty excited about it. I then took the reading on my iPhone of where I started seeing the object (280*) to when I saw the object fly away, 310*"],"Viewing Distance":"Unknown","Log Number":"US-03262012-0039"}