{"Case Number":"3680","City":"New Iberia","Date of the Event":"10/01/1992 11:15 UTC","Object Shape":"Star-like","Object Flight Path":"Straight-line path,Path then hovering","Disposition":"Insufficient Data","Latitude":"30.006206","Region":"Louisiana","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Log Number":"US-08022005-0026","trends":["There have been 4 other sightings in New Iberia","There were no other sightings in New Iberia on or around October 1st 1992"],"divs":["Sighting DetailsSpeaking to a friend from one vehicle to another. As my friend spoke. I'd divert my eyes away, reflecting on was said. First, I thought the stars were moving, but as my eyes adjusted, I noticed just two were moving. I thought it might be a jet or some other aircraft and I was waiting for the report from the engines. Where my friend and I were was a very remote part of an already remote state, Weeks Island. No available ambient noise, none, truck engines off, no sound. The two lights traveled very slow from north to south in what I could tell was a perfect arc but slightly canted to the east, about eleven o'clock. At the apex of arc, object stopped and I observed clearly that these lights were on one object. Slowly these lghts began to fade in light intensity until they were indistingushable from other stars. Finally, I think, they faded to black. The only movement I made was to get out of the my vehicle at the first movement over the trees. The whole event took about three minutes, five tops. Can you tell me what I saw that night? PS The lights were positioned in a staggered kind of arrangement, like military aircraft do, one forward, toward the east, the other aft, toward the west. NO SOUND!"],"Date Submitted":"10/01/1992 11:15 UTC","Viewing Distance":"Over One Mile","Longitude":"-91.816668","files":["/var/www/straped/mufon/html2text/3680.html.txt","/var/www/straped/mufon/org/3680.html"],"Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.006206,+-91.816668(3680)&iwloc=A&hl=en\"> mufon case (3680) map </A>","Summary":"Observed odd moving, soundless lights in night sky that, when were overhead, stopped and shortly afterward faded until indistinguishable from other stars. This was two distinct lights in a staggered formation, but moved as one body. Absolutely no sound."}