{"Date Submitted":"03/10/1978 08:15 UTC","Object Flight Path":"Undisclosed","Case Number":"3681","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"03/10/1978 08:15 UTC","Latitude":"30.313277","divs":["Sighting Details Although it occured over 25 years ago, I still remember the sighting very clearly. My brother and I who were 6 and 10 years old, respectively, were in our family room at the end of our house watching television. It was a Tuesday night around 8 pm...I remember that because we were watching \"Three's Company\", which aired on ABC on Tuesdays back then. For no apparent reason, my brother got up from the sofa during the show and went to the window facing south. He looked out and saw something in the sky above our street. He told me to come to the window. I did, just in time to see a circular pattern of orange lights rotating and slowly moving down the street perhaps 200 feet in the air. We ran to our parents room on the other side of the house to tell them what we had seen. Our mother was very intrigued by the story, but our father was less than enthusiastic and dismissed it as a plane or something else of normal origins. By the time our mother got to the family room window, the object had floated down the street beyond our line of sight...it was now behind the treeline and gone for what we thought was forever. I'm not sure if it was the following night or a few nights later, but certainly not very long after the initial sighting, my family was in our parents' bedroom watching television, I'm guessing approximately the same general time of night (8-9 o'clock). My brother was once again compelled to look out the window, this time to the west toward a pasture behind our back yard. At the far edge of the pasture, about a quarter mile from our house was a line of pine trees where, hovering just above that, maybe 200 feet in the air, was the same object we had seen previously. My mother and I sprang from our seats to see the object, this being her first look at it, while my father once more seemed disinterested. My mother wanted to get a better look at it, so she and I quickly threw on coats and rushed outside to the back fence while my father and brother stayed in the house. This time we viewed it straight on, so it appeared as a horizontal row of lights. The object displayed the same orange lights on bottom as before, but it had more colorful lights around its central edge. I remember the various colors (green, blue, orange) being somehow different from what one might see on a conventional aircraft; not necessarily brighter or duller, but just different, and no blinking either. It was a chilly night in early March, and the trees hadn't budded out yet, so the canopies were bare of any foliage. This allowed an almost unobstructed view of the sky above. My mother and I watched this object with great interest as it simply sat in mid-air making no sound except what my mother describes as a gentle swooshing...I don't recall any sound coming from it myself. As we peered at this strange sight, my mother and I scanned the sky around us in all directions, where an even stranger thing caught out eyes. Coming across the sky from four different directions were four tiny, solid, unblinking balls of red light approaching the object simultaneously. We watched as these things steadily approached the larger \"ship\" at an altitude about a hundred feet above it. They converged to a point just above its center and, one by one, each descended into the top of the larger object. As soon as this process was completed, the object seemed to activate itself by turning on two larger, brighter lights, almost like spotlights. These lights criss-crossed a couple times before finally turning off. Soon afterward the object began to move away from us gradually until it retreated beyond the treeline and out of sight. My mother and I turned around and walked back into the house, never to be the same. We never saw the object again after that night, although that's not to say it didn't ever return, as it very well could have. The experience left my mother and me with a profound belief in extraterrestrial life and visitation. Neither of us expressed any fear during the encounter, but rather a great fascination and excitement. My mother and I do not believe we were abducted, but we are both dead certain even after all these years that the object was not anything of this world. It didn't exhibit any behavior characteristic of man-made aircraft, and although it could understandably be confused with perhaps a blimp by someone less observant, we know that it definitely wasn't that...at the time, Goodyear had a blimp base just 20 miles south of Conroe, so we had seen blimps flying on numerous occasions at night. There was absolutely no mistaking one for the other. It is one of only a few experiences my mother and I shared which we have continued to discuss many times since, and we both consider ourselves very fortunate to have had the opportunity to witness something this extraordinary...we will always cherish the memory of that night. And after going to see \"Close Encounters of the Third Kind\" later that year, my father deeply regrets that he chose not to go out that night to see the object with us for himself. As it was back in 1978, before the technology became affordable, we had no way of videotaping the experience, and the only camera we had at the time was a cheap one incapable of nighttime photography. We have only our memories of the event to rely on now, but maybe that's all we really need, for as long as we believe with all our hearts that what we saw is something rare and special and genuine, physical proof isn't really that vital. Of course it would have been nice to have something to show others what we saw to establish crediblity, but that's impossible under the circumstances. Whether anyone else believes our story or not, we know it actually happened, and I feel that's what truly matters."],"City":"Conroe","files":["/var/www/straped/mufon/html2text/3681.html.txt","/var/www/straped/mufon/org/3681.html"],"Log Number":"US-08032005-0001","Object Shape":"Undisclosed","Country":"United States","trends":["There have been 10 other sightings in Conroe","There were no other sightings in Conroe on or around March 10th 1978"],"Tags":"City","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.313277,+-95.449561(3681)&iwloc=A&hl=en\"> mufon case (3681) map </A>","Object Features":"Undisclosed","Summary":"My mother and I noticed a circular pattern of colored lights floating above the treeline behind our back yard. It remained stationary for about a half hour where it was accompanied by four smaller red balls of light that approached it from different dir","Region":"Texas","Longitude":"-95.449561","Disposition":"Unknown"}