{"trends":["There have been 6 other sightings in Plymouth","There were no other sightings in Plymouth on or around August 19th 2004"],"files":["/var/www/straped/mufon/html2text/3685.html.txt","/var/www/straped/mufon/org/3685.html"],"Summary":"2 reddish diamond or oval shaped objects sighted. traveling from the west make 5 or 6 sharp angular turns and head north at night.","Sighting Duration":"00:00:30","Viewing Distance":"Unknown","Case Number":"3685","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"08/19/2004 12:00 UTC","Longitude":"-93.446449","Latitude":"45.019839","Region":"Minnesota","Object Shape":"Undisclosed","Country":"United States","City":"Plymouth","Object Flight Path":"Undisclosed","divs":["Sighting Details My family & were sitting in our front yard on a very nice Summer night last year watching the sky and talking. We got on the subject of UFOs. My kids (Emma 6 & Molly 8) asked me if I had ever seen a UFO. I said no but I'd like too. Just then my wife says \"Like Those\"? I thought she was just being funny. I looked to the west where she was pointing and just like they where on que,2 UFOs. A chill went up my back. In all my life I've never seen anything like these 2 diamond or oval shaped objects with an dark red or orangish glow. They were traveling from the west in a side by side formation end to end. They almost appeared to be linked. Very close. They were moving very fast. No sound. it was a very clear night and we could see some airliners and small planes nav lights. This was certainly not one of those. They flew right above us and made 5 or 6 very sharp angular turns, still staying tip to tip, until they were heading north. The whole event was maybe 30 seconds and they were out of sight. I've been a star gaizer and sky watcher for a long time (I'm 50) I've been to air shows, seem lots of meteors (I've even seen one hit the ground in Kansas. Satellites, Comets. I'm an aviation buff so I know things that fly. I've never seen anything like these two things. My wife and kids saw the exact same thing. We were all stunned. We talked about it for days. Little variation on our sightings. I thought I saw a darker diamond shape or shadow on the bottom of the objects. Very sincerly Mark Sisk"],"Tags":"City","Disposition":"Unknown","Log Number":"US-08032005-0005","Date Submitted":"08/19/2004 12:00 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.019839,+-93.446449(3685)&iwloc=A&hl=en\"> mufon case (3685) map </A>"}