{"Object Shape":"Disc, Unknown","Date Submitted":"04/30/1986 07:30 UTC","Case Number":"3687","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3687.html.txt","/var/www/straped/mufon/org/3687.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"very clear daylight sighting of ufo following a commercial jet.","Longitude":"-76.995279","Tags":"City","City":"Williamsport","Object Features":"Unknown","Log Number":"US-08032005-0007","Region":"Pennsylvania","Disposition":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.24659,+-76.995279(3687)&iwloc=A&hl=en\"> mufon case (3687) map </A>","Date of the Event":"04/30/1986 07:30 UTC","Object Flight Path":"Path with directional change","trends":["There have been 13 other sightings in Williamsport","There was one other sighting in Williamsport on or around April 30th 1986"],"Latitude":"41.24659","divs":["Sighting DetailsIn mid May 1986 I took a ride to Rose Valley Lake appx. 10 miles north of Williamsport, Pa. An old neighbor friend of mine and I were just killing time until we meet some women friends later. We parked on the north side of the lake facing south and got out and sat on the hood. The sun was just setting to the west dipping just below the mountain. The sky was very clear and we were noticing a smaller commericial jet heading east comming slightly to the south and above us. One of us commented on how clear the jet was visible at that time. While we both we looking at the jet in those few seconds an object appeared to the rear of the jet. We both made comments at the same time. It was something like \"Do you see that?\"!!! or \"Oh my God\". It only took me a few seconds to scan and compare the object to the jet and know I was witnessing something truely remarkabe. Now you could not ask for a better visual sighting as the sky was well lit from the sun but blocked from our eyes from the mountain to our right. I watched this ufo follow the jet and slowly get closer to the back of the jet. The jet had a jerky motion to it. THe ufo just glided. the jet had exhaust exiting while the ufo nothing. To my best recolection I could hear the jet and nothing from the ufo. I am not a ufo expert. But this ufo was so admormal looking from any aircraft i had ever seen. My best comparison at the time was a music CD in color and shine. It was slightly smaller than the jet but round. It was sleek, no bubble on top like alot of photos I've seen. So anyway, we continue to watch the ufo close in on the jet and suddenly it disapears. I never take my eye off the jet as it moves more to the east of me by this time. Suddenly it appears again. But this time it is in front of the jet slightly above it and to the south. It somehow moved to stay in the same position watching the front of the jet. This went on for several seconds or so and then it gave us the grand finally. The ufo moves upward and excellerates more as it goes. It went straight up in the sky until I could not see it anymore. We watched for a good half hour more hoping to see more but that was it. I knew I witnessed something very special that day. I probably would have stayed much longer but my fried Bernie Williams was getting restless. I grew up watching jets from the mountain right behind the Little League World Series field in South Williamsport. People use to sit on Sky Line Drive for something to do. I lived right next to an Air Force bace in Fort Worth Texas. I always watched jets passing by. But I never before or after have seen anything like this. I beleived before this, but now I know for sure. I always wanted to report this but didn't really know how. I know those pilots had to have seen it. If they had reported it, I'm sure they could have used my report from the ground. I always felt a little guilty about that."],"Country":"United States"}