{"City":"Williamsport","trends":["There have been 13 other sightings in Williamsport","There were no other sightings in Williamsport on or around June 12th 1958"],"divs":["Sighting DetailsMe and two friends were walking home one evening in June 1958 i was about 15 years old. I saw the highway pavement light up and I though a car was coming so I looked up and saw it. I froze and my girl friend stopped with me. My friend had been playing a transistor radio and it stopped working so he was walking backwards trying to get the station back on. I yelled Earl! to get him to stop before he ran into the object. I soon as I yelled his name the object went dark and disappeared. The object was about the size of a Gravel Dump truck it was a lens shape and on the edge of the object you could see what appeared to be gear teeth the appeared to be spinning around the object. the bottom of the object was brightly lit but did not seem to have and central source but rather it was like the whole bottom was the light source the light was soft like florescent but was very bright it was reflecting of the highway pavement and the top of the disk was dimly lit I think from the light reflection. It was totally silent it hovered about 4 or 5 feet off the road and appeared interested in the pavement and it seemed it was unaware of our presents until I called out, then It disappeared. I never reported this because we were just kids and felt no one would believe us."],"Object Features":"Other","Object Shape":"Disc","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/36898.html.txt","/var/www/straped/mufon/org/36898.html"],"Weather Factors":"Unknown","Summary":"Lens shape disk hovered above highway bottom of disk Lit up the highway .","Sighting Duration":"00:02:00","Date Submitted":"03/27/2012 12:20 UTC","Latitude":"41.239541","Tags":"City","Date of the Event":"06/12/1958 12:00 UTC","Disposition":"Unresolved","Source":"MUFON","Longitude":"-77.000949","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.239541,+-77.000949(36898)&iwloc=A&hl=en\"> mufon case (36898) map </A>","Log Number":"US-03272012-0002","Object Flight Path":"Hovering then path","Case Number":"36898","Region":"Pennsylvania"}