{"files":["/var/www/straped/mufon/html2text/36897.html.txt","/var/www/straped/mufon/org/36897.html"],"Region":"Michigan","Date Submitted":"03/27/2012 12:04 UTC","Case Number":"36897","Object Flight Path":"Stationary","Viewing Distance":"21-100 Feet","Source":"MUFON","Country":"United States","Log Number":"US-03272012-0001","Object Features":"Other","Latitude":"41.879056","Longitude":"-86.533464","Summary":"A big bright light and 2 smaller lights.","divs":["Sighting DetailsMy story start's back 27 yrs ago when I was a young boy walking down our drive way to catch the buss for school. As I was walking I had a feeling something wasn't right. I looked to my left and saw an abject, or I should say a very bright light coming from the end of a blueberry field. I saw it once and then again about a 100 ft down the driveway. I had know idea what I was looking at at the time. The strange thing about looking at it the second time was the fact I have no memory of walking that 100ft. It was as if I was in 1 place and then another. The object looked like a very bright white ball with a blue light at its top moving counter clock wise and a green light at its bottom moving clock wise. I stared at it for a few more minutes and then it glowed brightly and was gone. This took place in the winter. By summer when the grass started growing, I remember the place where I saw the object, the grass didn't start to grow back for 5 or 6 years. All traces of the spot are gone now. I've only toiled 1 other person of what I saw and it was my mom. But I didn't tell her until I was in my late 20's. I've always wanted to tell someone else but people would have said I was nuts. The only thing I have to remember that day is a strange round mark on my right ankle. It never hurt and my mom said she never remembered me doing anything as a kid for that mark tobe there. I don't know if I was lucky to see it or in the right place at the right time. I feel a great sense of relief tell my story. It's hard to carry something like this for so long and not have a place or others to tell. All I can say is we aren't alone."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.879056,+-86.533464(36897)&iwloc=A&hl=en\"> mufon case (36897) map </A>","trends":["There have been no other sightings in Lake Charter Township","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"02/15/1984 07:15 UTC","Object Shape":"Sphere","City":"Lake Charter Township","Weather Factors":"Unknown","Disposition":"Unresolved"}