{"trends":["There have been no other sightings in Bremen","This sighting has never been favorited."],"Tags":"City","Date Submitted":"03/26/2012 11:36 UTC","Source":"MUFON","Summary":"Disk-shaped flying object with multi-colored blinking lights outside my bedroom window","map":"<A HREF = \"http://maps.google.com/maps?q=33.721218,+-85.145504(36895)&iwloc=A&hl=en\"> mufon case (36895) map </A>","City":"Bremen","files":["/var/www/straped/mufon/html2text/36895.html.txt","/var/www/straped/mufon/org/36895.html"],"Weather Factors":"Unknown","Region":"Georgia","Object Features":"Unknown","Object Shape":"Disc, Oval","divs":["Sighting DetailsThat day, I had stayed out of school and watched TV in my bedroom all day. My parents came home, we had supper and went to bed. I was laying in bed watching TV when my TV just went off. At first, I thought that I had rolled over on the remote. I found the remote and tried to turn the TV back on and it would not come on. I then thought that the batteries were dead or weak in the remote, and I started feeling a little like someone was \"pranking\" me. I got up and walked over to the TV and pressed the power button and nothing happened. There were red lights on my TV and stereo to show they were receiving power so I knew they weren't unplugged. At this point, I started to really have a feeling as if someone was \"pranking\" me. I reached over and tried to turn on the stereo by pressing the power button and, again, nothing happened. That's when I started to get a really eery feeling that someone was watching me and I got chill bumps. I felt that I needed to look out the window that looks out to the next door neighbors' house. I went over to the window and rolled open the blinds so that I could see out. As soon as the blinds opened enough for me to see through them, I saw the object. It was disc shaped with multi-colored lights around the rim and they were blinking. The object was hovering near the back corner of my house and was probably about 20-30 feet off the ground. As soon as I got a glimpse of the object, it took off straight up in the air. I pulled the blinds up so that I could follow it in the sky. By the time I got the blinds up so that I could see up in the sky, the object was very small in the sky and then quickly dissapeared. I stood there for a minute in shock trying to make sense out what had happened. I then went straight over to the TV and pressed the power button and the TV came on with no problem. At that point, I knew something very surreal had taken place. I thought to myself that I must be dreaming. To test that theory, I wrote a note to my mother telling her that if she got the note to wake me up because I had seen a UFO. My mother woke me up the next morning asking \"what is this about you seeing a UFO?\". I knew at that point that what I saw was no dream. It was very real. I've told about 20 people that were the closest to me about the sighting. Based on the reaction that I've gotten, I kind of tried to just forget about it. I have never, though, not even for a second thought that what I saw was not real. I KNOW what I saw was real and it definately left a lasting impression in my mind."],"Sighting Duration":"00:05:00","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path","Country":"United States","Latitude":"33.721218","Date of the Event":"03/03/1982 01:00 UTC","Log Number":"US-03262012-0144","Longitude":"-85.145504","Case Number":"36895","Viewing Distance":"21-100 Feet"}