{"Summary":"was in back of car,looked up and saw a triangle shaped craft with round lights at each point. was silent and after a couple of minutes the object sped away very fast.","Region":"California","Date of the Event":"08/15/1985 12:00 UTC","City":"Santa Maria","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Source":"MUFON","Country":"United States","Case Number":"36894","Date Submitted":"03/26/2012 11:20 UTC","Latitude":"34.961874","map":"<A HREF = \"http://maps.google.com/maps?q=34.961874,+-120.428819(36894)&iwloc=A&hl=en\"> mufon case (36894) map </A>","trends":["There have been 4 other sightings in Santa Maria","There were no other sightings in Santa Maria on or around August 15th 1985"],"divs":["Sighting Detailsinow im 40was coming back to the boys camp i was in. it was about eleven at night and there was about six of us coming back from a weekly meeting in santa maria. the boys camp is behind santa barbara in the los prietos national forest, right near red rock. i was sitting in the back of a station wagon just talking to the other guys and about half way back to the camp, on a twisting highway near lake cachuma, i looked out the back window and noticed an object overhead. i couldnt believe what i saw. above us was a large triangle object with a big, round, white light at each point. i told everyone to look and they saw it too. we slowed down to look at it and we watched it hover for about 2 or 3 minutes and then it just shot away from us at an incredible speed. nobody relly talked about what we saw. manny ernst was the driver and my camp counselor. he saw it as clear as i did and he thought it might be something from vandenberg air force base but was still unsure. my camp # was 4742. mr. ernst is the only person i remember the name of. now im 40 years old and i have thought about this for years and have been seeing alot of what i saw on television lately. i know now that what i saw was not a conventional craft, but when i was 15 i didnt give it as much thought. i have never told anyone else up until now."],"Object Flight Path":"Stationary,Straight-line path","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-03262012-0144","Longitude":"-120.428819","files":["/var/www/straped/mufon/html2text/36894.html.txt","/var/www/straped/mufon/org/36894.html"]}