{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"Maryland","Date Submitted":"03/26/2012 11:57 UTC","Object Shape":"Disc","Sighting Duration":"00:02:00","City":"Cloverly","divs":["Sighting DetailsIt was afternoon time I was at my friends house whom I was living with at the time, when we decided to ride our bikes 6 houses down to our other friends house . We exited the house out the back and got on our bikes. Then we proceeded to ride down the street with me in the lead .the house opposite to his had a big trees in the front yard ,as we past the trees to our left and continued riding I caught something out of the corner of my eye and did a double take .immediately I slammed on the brakes as fast as I could which caused my friend who was behind me to do the same .I said ricky what the f@#k is that and a reflective disk shape object was floating over the houses kind of like it was riding along side us ,about 500 to 1000 ft in the air. as we were looking it continued on for another couple of seconds then stopped, It did not make a sound. The object continued to sit there ,we were speechless cause we both knew what we were looking at was not any conventional air craft we know to exist. And it was a bright sunny day not a cloud in the sky .Then after 5 to 10 seconds the object started heading back the way it came with out turning and from a stand still.It started off very slowly moving back the way it came but picked up speed as it went . While we continued looking at this thing in amazement I realized that I would lose sight be hind the trees we had just passed I jumped back on my bike as fast as I could and rode up the street after it. I wanted to try and see it as long as I could, but as it came to where I would loose it behind the trees the thing literally took off like a bullet and was gone . well me and my friend could not believe what we just saw and sat there in awe for a minute .But knowing there was nothing else we could do we got back on our bikes and continued to our friends house. we told her and every one we saw for days to a week but you can only so many people. I would of reported it then but I was 17 and did not know who to tell and figured no one would believe us any way. but as I watch the investigations on tv I see there are lie detector test and other things that will lend credence to my story .And I am willing to do whatever I have to to prove my story. I am sure my friend will do the same. I don't know what It was I saw ,but I know what I saw .Something strange is happening ."],"Date of the Event":"07/10/1999 01:00 UTC","Log Number":"US-03262012-0134","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.116637,+-76.961903(36896)&iwloc=A&hl=en\"> mufon case (36896) map </A>","Summary":"25 Words just do not do the event justice.","Tags":"City","Source":"MUFON","Case Number":"36896","Object Features":"None","files":["/var/www/straped/mufon/html2text/36896.html.txt","/var/www/straped/mufon/org/36896.html"],"Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Weather Factors":"Unknown","trends":["There have been no other sightings in Cloverly","This sighting has never been favorited."],"Latitude":"39.116637","Longitude":"-76.961903"}