{"Tags":"City","Log Number":"US-03272012-0013","Country":"United States","Object Features":"None","Latitude":"40.176943","map":"<A HREF = \"http://maps.google.com/maps?q=40.176943,+-77.392796(36909)&iwloc=A&hl=en\"> mufon case (36909) map </A>","Case Number":"36909","Summary":"Bright Orbs Leaving Twin Trails of Neon White Light","trends":["There has been one other sighting in Newville","There were no other sightings in Newville on or around March 27th 2012"],"Object Flight Path":"Path with directional change","Date of the Event":"03/27/2012 05:03 UTC","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"Pennsylvania","City":"Newville","Viewing Distance":"Unknown","Longitude":"-77.392796","files":["/var/www/straped/mufon/html2text/36909.html.txt","/var/www/straped/mufon/org/36909.html"],"Object Shape":"Fireball","Date Submitted":"03/27/2012 07:06 UTC","divs":["Sighting DetailsI was delivering newspapers at 5:03 this morning (March 27th 2012) when i noticed a white ball of light surrounded by a neon whit aura traveling toward the earth at a very slow rate of speed. It was literally leaving a trail of light behind it. I thought perhaps a falling satellite until it did something extraordinary. It changed directions. Not just once but multiple times. It was not uniform at all however but very erratic. It fell for a while and then shot back upward then beck down at another angle leaving a trail of white light behind it that did not dissipate for about forty minutes. While speeding home to tell some friends I noticed a second one to the left of the original making a lightning shaped pattern through the sky. It scared me so I rushed home. I have Benn delivering papered for two years now and have seen just about everything you can see in the night sky. But never have I seen anything like this. It was amazing yet terrifying at the same time. There were reports of this being seen the part few nights over New Jersey but now PA. I couldn't get a picture of it. The glow was too dim by the time I got home for the camera to pick it up? Anyone out there seen this? I would love to hear from you. My friend Matt saw the remains of the glow when I took him outside to see it."],"Weather Factors":"Unknown"}