{"Region":"California","Object Shape":"Circle, Disc, Square, Rectagular, Other","Latitude":"37.012772","files":["/var/www/straped/mufon/html2text/36904.html.txt","/var/www/straped/mufon/org/36904.html"],"Object Flight Path":"Straight-line path","Sighting Duration":"00:00:11","Source":"MUFON","Disposition":"Unresolved","City":"Gilroy","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsWe were in a wooded east of gilroy in an open parking lot where hikers and horse back riders can park. It was approx. Around 11:30 to midnight and the date I am not sure of being that it was about 10 years ago. We were standing out side of our car. I was with two other friends who were with me. The night was extremely odd and we were standing outside the car in amazement of the sky being an odd bright blood red coming from one directtion of the tree line. It looked like maybe a fire on the other side of the mountain or maybe how big factory lights look that light up the sky but more red than orange. We would come hang out at this spot a few times a week and were very familiar with the area and this was very out of place.about fifteen minutes being there and hanging out amazed by how red the sky was, an extemely huge object flew from tree line in front of us to treeline over head and consumed most of the open sky. Huge craft, circular but not smooth and was completely silent. It was moving about the speed of an aircraft that would be approaching a runway. The tree line obstructed most of surrounding are view except the brief time that it was overhead and clear of tree obstruction due to dirt parking lot. The objest had white lights in no pattern it seemed on the bottom side of craft and were not blinking. I remember standing in awe and slightly nervous about what I just saw and at the same exact time one of the people I was with said oh my god. And we really were frozen for a bit in shock. We really felt the urge to leave and got out of there just talking to each other in pure shock. We continued going up there after the event for quitwe some time and never have seen the sky the way it was that night and never seen anything like what we saw that night ever again."],"Weather Factors":"Unknown","Date of the Event":"09/18/2002 12:00 UTC","Date Submitted":"03/27/2012 01:54 UTC","Log Number":"US-03272012-0008","Tags":"City","Country":"United States","trends":["There have been 8 other sightings in Gilroy","There was one other sighting in Gilroy on or around September 18th 2002"],"Summary":"in wooded area with friends outside of cars. extremely huge object overhead passed over silently.","Case Number":"36904","Object Features":"Other","Longitude":"-121.558605","map":"<A HREF = \"http://maps.google.com/maps?q=37.012772,+-121.558605(36904)&iwloc=A&hl=en\"> mufon case (36904) map </A>"}