{"Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-03272012-0011","Summary":"Silent, very slow moving domed saucer-like craft hovering then passing directly overhead at treetop level.","Object Features":"Dome","Object Shape":"Disc","Weather Factors":"Unknown","trends":["There has been one other sighting in Chappaqua","There were no other sightings in Chappaqua on or around October 12th 1967"],"divs":["Sighting Details45 year old mother and 17 year old daughter driving 20-25 mph on Quaker Road about a half mile out of Chappaqua witnessed bright light on treetops to the right of the tree lined road, then watched it pass directly over the car and road and disappear at treetop level on the left side of the road. We had the windows open at the time, and the radio was off. We weren't talking and watched it in stunned silence. Then we did lots of talking after it disappeared! It made no noise, and moved very, very slowly. The lights were bright white. It made believers out of both of us; we were convinced it had to be a UFO. The whole sighting took about 30 seconds. There was no other traffic on the road, and no houses in that area to shine lights. The craft was travelling west. That particular area is not a flight path area, even for small planes. I don't ever remember hearing a plane fly overhead in the ten years I lived there. I have a sketch of it, but do not know how to upload it. I would be happy to mail it and MUFON could upload it."],"Date Submitted":"03/27/2012 02:39 UTC","Source":"MUFON","Object Flight Path":"Hovering then path","Latitude":"41.173948","Case Number":"36907","map":"<A HREF = \"http://maps.google.com/maps?q=41.173948,+-73.777055(36907)&iwloc=A&hl=en\"> mufon case (36907) map </A>","Country":"United States","Longitude":"-73.777055","City":"Chappaqua","Region":"New York","Date of the Event":"10/12/1967 09:20 UTC","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36907.html.txt","/var/www/straped/mufon/org/36907.html"]}