{"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/36901.html.txt","/var/www/straped/mufon/org/36901.html"],"trends":["There have been 3 other sightings in East Islip","There were no other sightings in East Islip on or around May 12th 1984"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.737344,+-73.192015(36901)&iwloc=A&hl=en\"> mufon case (36901) map </A>","Summary":"Seen 4 star like objects in the sky moving fast stopping changing direction","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Case Number":"36901","Weather Factors":"Unknown","Date of the Event":"05/12/1984 12:00 UTC","Log Number":"US-03272012-0005","divs":["Sighting DetailsMe and my mothers boyfriend and two other friends were looking up at the sky where one of us seen what we thought was a shooting star it was starlike and moving very fast across the sky. But it stopped paused, changed direction then shot across the sky. Stopped again and disappeared. We were all looking for it again up directly above us when i found it again we all screamed found it again but when i looked at my friend they were looking left i was looking right there was more of them. They would shoot across the stop abd change direction like 45 degree angles. Two of them stopped right in front of each other and two more came out. They were all round and a colored light greenish was circling the perimeter around all of them. Then they all disappeared at once. Look i know this isnt going to blow minds or make the news but i been waiting over 27 years just to tell someone that wouldnt laugh and can appreciate it. I would have never ever believed in UFO at all until i seen it with my own two eyes what i saw. I wish i had a camera or cell phones invented back then. I am willing to take a lie detector or hypnosis anything. But if anyone in your group is a non believer they are wrong. Planes dont speed across the sky and from an estimate 12 feet of sky from my view in less than a second and come to a complete stop then shoot off in a 45 degree angle. Not sure what the actual distance is but no plane flies that fast. Just needed to get this off my chest and its been a secret eating at me forever. If anyone read this letter thank you for reading it. Thank you for your understanding"],"Date Submitted":"03/27/2012 01:08 UTC","Region":"New York","Disposition":"Unresolved","Object Features":"Unknown","Country":"United States","Object Shape":"Circle, Star-like","Latitude":"40.737344","City":"East Islip","Source":"MUFON","Longitude":"-73.192015"}