{"City":"Raymore","Weather Factors":"Unknown","Date of the Event":"03/26/2012 10:45 UTC","Tags":"City","Case Number":"36913","Object Shape":"Triangle","Region":"Missouri","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"03/27/2012 10:42 UTC","Log Number":"US-03272012-0017","Longitude":"-94.444649","files":["/var/www/straped/mufon/html2text/36913.html.txt","/var/www/straped/mufon/org/36913.html"],"Viewing Distance":"Over One Mile","Latitude":"38.811493","trends":["There have been 3 other sightings in Raymore","There were no other sightings in Raymore on or around March 26th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.811493,+-94.444649(36913)&iwloc=A&hl=en\"> mufon case (36913) map </A>","Object Features":"Wings, Other, Unknown","Disposition":"Unresolved","divs":["Sighting DetailsAbout 10:00pm I had the back door open and just happen to walk by and noticed some lights in the south that looked out of place, so I walked out on the back deck and noticed these 3 lights spaced like a triangle but almost on a vertical plane and not horizontal.It was over my neighbors house to the south, I called to my wife because I could not believe what I was seeing. My wife stepped out on the deck, I asked her do you see that? She said yes what the heck is that. I said I don't know? She said should we get the binoculars, I agreed and told her to go get them I was not taking my eyes off this thing. Then I noticed intermittent flashing lights behind this triangle traveling about the speed of a helicopter. These navigation lights were following this floating triangle. We could not tell if the triangle was solid or translucent because of the angle with the horizon. With the binoculars I could see more clearly the flashing navigation lights and could tell they were not a plane because it was moving to slow. About this time the whole thing became obscured because of the street light behind my house. I have never been witness to anything like this before and I am still trying to wrap my mind around what we observed. I have no answers only more questions but would like someone to explain to us what we witnessed. What was strange was that we live under a couple of flight paths for MCI and some smaller airports in the area and there was no planes in that area until after the objects had moved out of sight. Then we started getting flight traffic again. which is unusual for that time of night because we spend a lot of time on our deck. This is the first time I have ever thought about putting anything in writing for fear of ridicule, but I know what I witnessed and cannot explain it. I have witnessed satellites and meteors before. IT JUST DOES'NT MAKE SENSE."],"Source":"MUFON","Summary":"Viewed 3 evenly spaced lights (triangle)moving in a southwesterly direction with 3 navagation lights following it","Object Flight Path":"Straight-line path"}