{"Region":"","City":"Glasgow","Tags":"City","Log Number":"GB-03272012-0014","divs":["Sighting DetailsThe photo was taken some time ago. me and at least 2 friends where out looking to take photos of the incoming lightning storm. We went to a vantage point overlooking Glasgow. I had tacken several shoots this day. It was only yesterday that I was going over the photos I have on my hard drive to delete and edit through what I have. \"this was to clear up space and to prep my portfolio\" On finding these shots I put the image in to photoshop as I wanted to get a clearer look at the image on the left hand side in the clouds. I can say there is no way it could be an known aircraft.1st thing is the size, Then the faint out line. the order of the lights are not what I am awaire of as standard confirurations. It had me more than a little shocked at what I think I maywell be seeing. In PS I was doing colour correction contrast changes to see if it would make the image any clearer. It does show a little better. the 2 photos I have attached are both without any edit what so ever. As this was a find long after the photo what taken I cant say what it was doing or anything about the motion of it. If I had seen it I would have got much beter shoots of it."],"Country":"United Kingdom","Summary":"Very Long at least 5 lights on exterior","Sighting Duration":"Undisclosed","Case Number":"36911","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/36911.html.txt","/var/www/straped/mufon/more/36911_submitter_file1__DPP_0027.JPG","/var/www/straped/mufon/more/36911_submitter_file2__DPP_0028.JPG","/var/www/straped/mufon/org/36911.html"],"Object Features":"None","Longitude":"-4.249244","map":"<A HREF = \"http://maps.google.com/maps?q=55.825909,+-4.249244(36911)&iwloc=A&hl=en\"> mufon case (36911) map </A>","Latitude":"55.825909","Weather Factors":"Unknown","Object Shape":"Cigar","Date of the Event":"08/01/2009 04:00 UTC","Viewing Distance":"Over One Mile","trends":["There have been 28 other sightings in Glasgow","There were no other sightings in Glasgow on or around August 1st 2009","This sighting has never been favorited.",""],"Disposition":"Unresolved","Date Submitted":"03/27/2012 07:33 UTC","Source":"MUFON"}