{"Case Number":"36934","Latitude":"37.27848","Longitude":"-79.938927","Object Shape":"Cross, Square, Rectagular","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"03/27/2012 06:03 UTC","files":["/var/www/straped/mufon/html2text/36934.html.txt","/var/www/straped/mufon/org/36934.html"],"Log Number":"US-03272012-0035","Date Submitted":"03/27/2012 09:32 UTC","Summary":"Has anyone seen anything like this - a flying \"cross\" of lights?","Object Features":"Other","Viewing Distance":"Unknown","City":"Roanoke","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.27848,+-79.938927(36934)&iwloc=A&hl=en\"> mufon case (36934) map </A>","Weather Factors":"Unknown","Tags":"City","Region":"Virginia","Source":"MUFON","trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around March 27th 2012"],"divs":["Sighting DetailsI'll make this short as possible! On Tues., March 27, 2012 around 6:03 am, I took my dog outside for his morning potty break. While waiting on him in my front yard, I looked to the sky as usual. Movement of a fairly large yellowish-white light flying from West to East caught my eye. There was no noise, no cloud cover, and the sky was clear with some stars still visible, and the eastern sky was just beginning to lighten at bit. (However, I could hear that the birds were beginning to softly chirp in the neighborhood.) As this \"object\" got closer, the yellowish-white light turned out to be nine squarish to rectangular shaped soft glowing, yellowish-white lights in an upside down cross shape or formation. As they passed right over me (maybe several thousand feet above me??), the only way I can describe what I saw is this: the rectangular lights were arranged uniformly, two side by side in the 1st row, two side by side in the 2nd row, three side by side in the 3rd row (these 3 lights were a little longer than the others, with a little more space before and after them), and two side by side in the 4th row. Like I stated, the color was a soft, yellowish-white glow, similar to what an encased light source would look like, with soft corners on all points. I could not see anything between the lights nor outside the formation of lights. I could not see any wings, tail, body, shadowing or mist like you would expect on an airplane or helicopter. At one point, it looked as if from the side, these rectangular lights may have had some depth to them, something like a shoebox shape. Maybe this was a formation of individual objects flying together. (Looked like something out of Star Wars!) The lights never blinked, pulsated, or changed color. The sound I heard while it was near me was a wobbling, pulsating strange sound, with a slight percussion of air (???). Nothing about this sound was similar to that of a jet, prop-jet, helicopter or anything I have heard or seen in my lifetime. It was flying perhaps about 30-40 mph, not slow, but not fast either. As it got further away, the sound dissipated quickly, and the lights returned to looking like one, fairly large yellowish-white light flying in the sky again. If our military has anything like this, WOW! If not, what is it??!!"],"Disposition":"Unresolved"}