{"Case Number":"36930","Summary":"'Extremely' bright light - was NOT an airplane/helicopter, etc.","Object Features":"Unknown","Longitude":"-77.070605","map":"<A HREF = \"http://maps.google.com/maps?q=38.889653,+-77.070605(36930)&iwloc=A&hl=en\"> mufon case (36930) map </A>","Log Number":"US-03272012-0031","trends":["There have been 7 other sightings in Arlington","There were no other sightings in Arlington on or around March 27th 2012"],"files":["/var/www/straped/mufon/html2text/36930.html.txt","/var/www/straped/mufon/org/36930.html"],"Latitude":"38.889653","divs":["sighting detailsi have witnessed this 'same' light four times over the last year (two times in 2011, and two times in 2012). the 2012 sightings were yesterday, march 26, 2012, and again this morning; march 27, 2012. at first glance, the light appears like it could 'possibly' be a very strong landling light of a plane\\ however, after living near reagan national airport for years, i'm familiar with flight patterns and the overall look of landing and airplanes taking off. this light initially appeared like a small star, then got brighter and brighter. i was approximately 1 mile south of the pentagon heading north on 395 towards pentagon city on my way to work. both times i saw it, the light more or less got a little brighter, then a little dimmer - then 'bigger'. then it got smaller, and smaller, and smaller in a smooth transition to a pinpoint of light. then this morning, i 'thought' i saw a dark shape after the light went out that resembled two radar (convex) pieces back to back. but at this point, the shape was extremely small. the light appeared to be over washington national airport in dc, from my view from 395. each time i saw it, it did the same thing, then my view would be obstructed by trees for a few seconds, then i could not see anything in the sky after that. i put only one witness below, but there 'had' to be others who noticed, as the light was 'very' bright."],"Source":"MUFON","Country":"United States","Date of the Event":"03/27/2012 06:50 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Disposition":"Unresolved","City":"Arlington","Region":"Virginia","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"03/27/2012 06:43 UTC","Object Flight Path":"Stationary"}