{"Longitude":"-77.189765","trends":["There have been no other sightings in sky over Wilmignton","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","Object Features":"Unknown","Summary":"unusual white streaks of light in dark sky","Region":"Pennsylvania","Tags":"City","Latitude":"41.206202","files":["/var/www/straped/mufon/html2text/36932.html.txt","/var/www/straped/mufon/org/36932.html"],"Disposition":"Unresolved","Country":"United States","City":"sky over Wilmignton","Source":"MUFON","Object Flight Path":"Stationary","Log Number":"US-03272012-0032","Date of the Event":"03/27/2012 05:15 UTC","Object Shape":"Other","divs":["Sighting Detailswhile driving south, I noticed a 'Z' pattern white streak in the sky looking to the southeast. The streak was not a straight line, but a slanted 'Z' shape. Then I noticed an IDENTICAL white streak more to the south of the first one that was literally identical from my perspective. They were at approximately the same elevation and distance from me but I would estimate over a mile apart. At this time, I stopped my car along side of the road so I could open my window and see them without looking through my windshield. Sure enough, they were there and after rubbing my eyes, thinking I was seeing double, they still were there clear as day, although the sky was pitch black, and the sun has not casted light on the sky (literally still pitch black sky) and not one cloud could be visible since it was pitch black. They did not move, blink, flash or anything, they were simply there. I started to think could it be the sun shinning on extremely high altitude clouds? Could it be a vapor trail?? After all I have seen in my past, and knowing that it was not easy to explain, this could not be either one. As I continued to drive, glancing up when I could, I noticed the first one changed. The middle part of the 'Z'was extremely brighter and had like a haze around the line, like it was glowing extremely bright and casting light off of moisture in the air. I didnt notice the second one changing at all but both 'Z' shape forms were both still visible. Eventually I notice that the seem to disapate as time went on. All this took place for approximately 10-15 minutes. I'm not sure how long before 515am they were there, but before 530am it was over. I do not have any evidence, I was more curious to find out if anyone else saw this and if there is a reason or explanation to what it was."],"Case Number":"36932","map":"<A HREF = \"http://maps.google.com/maps?q=41.206202,+-77.189765(36932)&iwloc=A&hl=en\"> mufon case (36932) map </A>","Sighting Duration":"00:10:00","Date Submitted":"03/27/2012 07:43 UTC","Weather Factors":"Unknown"}