{"Date of the Event":"03/24/2012 07:00 UTC","Date Submitted":"03/28/2012 12:20 UTC","Longitude":"-72.249748","trends":["There have been 5 other sightings in Wainscott","There were 2 other sightings in Wainscott on or around March 24th 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Region":"New York","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.954526,+-72.249748(36952)&iwloc=A&hl=en\"> mufon case (36952) map </A>","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"36952","divs":["Sighting DetailsThese are more videos from a different camera. I uploaded to you videos from my FUJI, thinking that the other videos from my Sony would not be clear in that I could not see them through the viewfinder while recording this object. This Saturday morning I had seen multiple objects as I do every clear night, and was about to come in side after all the stars were gone, but stayed out longer to play with the dogs. I saw in the north sky a white star like orb rise above the tree line, and stay there. It then went in a westerly direction a \"few inches\" from my perspective. It then began to slowly head in a south easterly direction, and was in the sky for at least 1 hour and 15 minutes. At one point in an attached video, as I was looking through the viewfinder of camera #2, the Sony, I could not see the object, so I didn't think it would work, however, last night March 26, 2012, I viewed the footage from the Sony and found in this one clip where I did not have a visual by eye on it, footage shows it did not stay in one place on its path towards the east, but momentarily went north, and then continued back in the easterly direction. On at least one still shot, when zoomed in, the object does not look round, but rather oval. I would like to send you more videos and pictures, but your current settings allow only 3, so please advise."],"Object Shape":"Circle, Oval","Summary":"UFO MORE VIDS WAINSCOTT EAST HAMPTON NY DAYTIME MARCH 24, 2012 In sky for approx 1hr 15 mins","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/36952.html.txt","/var/www/straped/mufon/more/36952_submitter_file1__March24,2012038ufooblongappearance.JPG","/var/www/straped/mufon/org/36952.html"],"Log Number":"US-03282012-0002","Object Features":"None","Object Flight Path":"Path with directional change,Path then hovering","City":"Wainscott","Latitude":"40.954526"}