{"Summary":"IT IS SOMETIHING THAT LEFT ME SPEECHLESS","Region":"Maharashtra","Longitude":"72.889208","Country":"India","divs":["Sighting DetailsWE HAVE BEEN OBSERVING DIS PHENOMENON FROM LAST 1MONTH. FIRST WE DIDNT KNW TIME AS WEN IT TAKES PLACE....BUT LATER WE STARTED PREDICTING IT....WE WERE LOOKIN IN ONE DIRECTION WE KNEW THERE WERE NO STARS THERE..ITS WAS CLEAN PATCH...BUT SUDDENLY BRIGHT BALL OF LIGHT LIKE STAR SHAPED(ONLY CAME TO KNW ABOUT SAHPE WEN IT GAVE LIGHT) AND THEN IN LIKE 3 SECS THE LIGHT WENT OFF AND IT TOOK OFF....TOWARDS WEST....AND DIRECTION ARE LINEAR OR STARIGHT IT MOVES UP DWON LEFT RITE....IT IS AMAZING....LEFT EVERYBODY SPEECHLESS....AND AFTER THAT THINGS AHPPENS THERE ARE TRAVELLING STARS(THATS WAT I CALL EM) AND THEY COME FROM EVERY POSSIBLE DIRECTION. AND COVERS THE ENTIRE HORIZON FRM NORTH TO SOUTH OR VICE VERS IN LIKE MINS.....ITS AMAZING AND UNEXPLAINED!!I DONT KNW IF IT IS ALIEN SHIP OR WAT?? BUT WATEVA IT IS >>GUYS I PROMISE U WUDNT HAVE SEEN IT BEFORE.......TIME TO SPOT ALL DIS ACTIVITIES IS AROUND 4 TO 6. BTW GUYS I M DOING DIS EVERYDAY SINCE JAN 2012 AND I END UP SEEIN ATLEAST 6 TO 7 TRAVELLIN STARS. IT TAKES SATELLITES OUT OF QUESTION COZ THEY ARE AT SUPER SPEED. PLEASE SOMEBODY LETME KNOW WAT DIS IS."],"Latitude":"19.086895","Object Features":"Undisclosed","Object Shape":"Square, Rectagular, Star-like","Date Submitted":"03/28/2012 09:02 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","City":"Mumbai","Date of the Event":"03/14/2012 05:30 UTC","Disposition":"Unresolved","Case Number":"36958","trends":["There have been 4 other sightings in Mumbai","There were no other sightings in Mumbai on or around March 14th 2012"],"Weather Factors":"Unknown","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/36958.html.txt","/var/www/straped/mufon/org/36958.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=19.086895,+72.889208(36958)&iwloc=A&hl=en\"> mufon case (36958) map </A>","Log Number":"IN-03282012-0008","Source":"MUFON","Object Flight Path":"Path with directional change"}