{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Unknown","Longitude":"-123.057824","Summary":"standin in an alley smoking i seen a glowing top hat shaped object. it hoverd for a period of time blinked appeared above me. droped what look like melting fireballs. Shortly after blinked zigzag and was gone.","Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular, Triangle","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.94497,+-123.057824(36951)&iwloc=A&hl=en\"> mufon case (36951) map </A>","City":"Salem","Region":"Oregon","Date of the Event":"03/10/2004 12:00 UTC","Case Number":"36951","Country":"United States","Tags":"City","divs":["Sighting DetailsOne night standing in the alley of my apartments smoking, I noticed a strange light above the houses across the street. What caught my eye was the object looked so big and bright, like a top hat on fire. I knew I had never seen this light before. Keep in mind I just started smoking my cigarette. Still watching it, it appeared to be moving slowly Almost dancing. It again stopped and changed color and shape and hovered above me. I finished my smoke and immediately lit up another amazed by what I was seeing. Not sure how long it was but I watched it and finished my second cigarette. Shortly after that it began a zig zag pattern in the sky, blinking in and out. One minute Really close then blink and it was Really far away, but the oddest thing is it was dripping red fireballs every time it would appear then disappear. Also I actually had this happen two more times that year and was able to get people from the complex to see it as well. And each time it seemed that two planes would always show up flying very fast before it would blink it self across the sky. I just need some feed back. Even people who seen it won't except it and everyone else thinks I am nuts. Please say someone else knows what I am talking about."],"Latitude":"44.94497","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around March 10th 2004"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36951.html.txt","/var/www/straped/mufon/org/36951.html"],"Weather Factors":"Unknown","Date Submitted":"03/28/2012 12:05 UTC","Log Number":"US-03282012-0001","Viewing Distance":"101-500 Feet"}