{"Date of the Event":"03/28/2012 01:15 UTC","Source":"MUFON","City":"Chestnut Ridge","Country":"United States","Log Number":"US-03282012-0018","divs":["Sighting DetailsI was in front of my home returning from an event where I was taking photos. I had a flip camera in hand and a Smart phone. Something caught my eye. I looked up. It was an Overhead sighting. Intermittent low clouds. Dark night. Stars, no moon. Observed starlike object moving very slowly. It shimmered white light. Low to high to low intensity. It moved, stopped, hovered, changed direction, oscillated in place, moved again. I am an experienced astronomer and know the night sky and constellations. As I continued to observe it, an airliner passed at a much lower altitude but both within eye shot so I could compare the lights. The plane lights did not compare to the object at all. I saw the object as spheric in shape in comparison. Star like. I thought it could be a satellite, until it changed direction, stopped and oscillated. Then it appeared to shrink in place. But I realized it must have ascended and appeared to be getting smaller, until it disappeared from all view. I shot three photos with my phone camera. It was too dark but the data recorded: GPS latitude: 42.074234 GPS longitude: -74.048584 0115hrs. I felt that it was not a plane, did not behave like a satellite, it was not natural to the night sky. It was sphere like. Looked like a star but it was inside the atmosphere. It was above the cloud deck, but the clouds were low and it was breezy. I took mental note of the time. Then the next day, about now 3pm, I saw on the news blog on AOL a UFO sighting over the netherlands occurred yesterday with video. I looked at the video and determined it was almost exactly what I saw last night. Decided to make this report for the records. Thanks for reading my observation."],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere, Star-like","Tags":"City","trends":["There have been no other sightings in Chestnut Ridge","This sighting has never been favorited."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36969.html.txt","/var/www/straped/mufon/org/36969.html"],"Longitude":"-74.048067","Case Number":"36969","Sighting Duration":"Undisclosed","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.068291,+-74.048067(36969)&iwloc=A&hl=en\"> mufon case (36969) map </A>","Summary":"Overhead sighting. Intermittent low clouds. Dark night. Stars, no moon. Observed starlike object moving very slowly. It shimmered white light. Low to high intensity. It moved, stopped, hovered, changed direction, oscillated in place, moved again.","Date Submitted":"03/28/2012 03:17 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"41.068291","Region":"New York"}