{"Object Shape":"Circle, Star-like","Viewing Distance":"20 Feet or Less","Summary":"My husband had a strange experience where a white light came from the woods and hit his windshield.Afterwards he became very ill with no Physical explanation.","Object Features":"None","divs":["Sighting DetailsSOMETHING happened to my husband.It just recently came to my mind about the night he came home and was soooo scared and told me the story about the white light.About a month after this incident my husband became very ill.He has had every test in the world and they say they find nothing.He lost a total of 55 lbs and I never even gave a thought to what had happened to him that night until today.I remembered how scared he was and how quickly he became ill afterwards.It lasted for about 8 months and he has slowly begun to get better.If regular and specialist doctors can't explain what's happened to my husband,..then maybe you can.He saw something that night that scared him profusely,..yet today,...he does not seem worried at all about what happened,...or even why he was so sick,...he is just happy to be returning to normal.So the story goes,...he comes in the house shaking like a leaf,...his eyes were full of tears,..(and my hubby dont cry)He says \"Baby I need to tell you something and i need you to believe me\"I say \"ok\" He says,\"I was driving home from school and you know how this road is totally dark?\" I say yeah baby what happened.He says,I was driving along and coming around the last curve before our turn and this bright ball of light came out of the woods and straight across my windshield,...i thought it was gonna crash through the window but it was moving too fast.I told him it was probably a spirit.We left it at that and never spoke about it again until today.SOMETHING happened to my husband that PHYSICALLY caused him to become ill.WE WANT ANSWERS!That's all.Some kind of explanation for what happened to him."],"City":"Fort Bragg","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Latitude":"39.449443","trends":["There have been 3 other sightings in Fort Bragg","There were no other sightings in Fort Bragg on or around April 21st 2011"],"files":["/var/www/straped/mufon/html2text/36968.html.txt","/var/www/straped/mufon/org/36968.html"],"Sighting Duration":"00:00:02","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"04/21/2011 09:15 UTC","Case Number":"36968","Country":"United States","Region":"California","Date Submitted":"03/28/2012 03:06 UTC","Tags":"City","Log Number":"US-03282012-0017","Longitude":"-123.801594","map":"<A HREF = \"http://maps.google.com/maps?q=39.449443,+-123.801594(36968)&iwloc=A&hl=en\"> mufon case (36968) map </A>"}