{"Object Shape":"Triangle","Date of the Event":"08/11/1997 12:00 UTC","files":["/var/www/straped/mufon/html2text/36960.html.txt","/var/www/straped/mufon/org/36960.html"],"Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Source":"MUFON","Case Number":"36960","Disposition":"Unresolved","Log Number":"US-03282012-0010","Tags":"City","Longitude":"-71.379957","trends":["There have been no other sightings in Not sure","This sighting has never been favorited."],"Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Region":"Massachusetts","Summary":"I KNOW that I saw a UFO!","Date Submitted":"03/28/2012 12:52 UTC","divs":["sighting detailsi was driving north on highway 495 in massachusetts back in 1997. i was on my way to work and it was 2pm. there were no clouds in the sky and the sun was out. what i saw was triangular in shape and had lights at each corner. the main body of the object was invisible and only the 3 lights at each corner were visible. the lights were so bright that they compared to the brightness of the mid-day sun. i watched the object rotate and hover for several minutes while driving. at first i thought i must be seeing things, so i slowed down and stopped in the breakdown lane. i watched the ufo slowly rotate and hover for serveral minutes. then it accelerated at a speed that nothing man made can do! it took off straight out of the earth's atmophsere in a fraction of a second. i have seen just about every flying vehicle man has to offer...i have been to space shuttle launches...and after that day it was clear to me that...someone\\something out there can move around the galaxy\\universe as easily as we drive to the corner store! this experience scared the hell out of me and i did not tell anyone for years for fear of ridicule. my best guess is that this ufo was just watching us."],"City":"Not sure","map":"<A HREF = \"http://maps.google.com/maps?q=42.411861,+-71.379957(36960)&iwloc=A&hl=en\"> mufon case (36960) map </A>","Latitude":"42.411861","Weather Factors":"Unknown","Country":"United States"}