{"Date of the Event":"02/15/2012 11:00 UTC","Case Number":"36966","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around February 15th 2012"],"Source":"MUFON","Latitude":"36.964726","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI am a CNA working for Sunshine Villa in Santa Cruz. At 11:00 p.m., I was waiting with a co-worker for my husband to pick me up after my shift. I was facing north when my co-worker exclaimed, \"What is that?\" I turned to look south, toward the ocean, and a huge object was passing overhead, approximately 50 feet above us, moving north. It passed quickly, much faster than any small plane I'd ever seen. It had a dull metallic bottom, like aluminum or titanium, and there were lights around the edge. It was silent. The object disappeared toward the mountains north of Santa Cruz. I was astonished to see the thing and can't figure out what it could be. I told my husband that night and since then, he saw something on TV about USOs. Santa Cruz is on the edge of a deep trench and my husband thinks it may have come from there. The ones on TV matched the description of the thing I saw and he thinks I should tell someone. So, I'm telling you. My son-in-law apparently saw something very similar when he was only six years old that he said hovered over redwood trees when he and my husband lived on an isolated parcel in Scotts Valley, Ca., but he doesn't want to talk about it."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.964726,+-122.025021(36966)&iwloc=A&hl=en\"> mufon case (36966) map </A>","Log Number":"US-03282012-0015","Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Circle, Disc","Region":"California","Summary":"Large circular object passed over Sunshine Villa parking lot at 11:00 p.m.","Viewing Distance":"21-100 Feet","Object Features":"None","City":"Santa Cruz","files":["/var/www/straped/mufon/html2text/36966.html.txt","/var/www/straped/mufon/org/36966.html"],"Date Submitted":"03/28/2012 02:46 UTC","Country":"United States","Longitude":"-122.025021","Disposition":"Unresolved","Weather Factors":"Unknown"}