{"trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around September 9th 1966"],"Object Features":"None","Viewing Distance":"21-100 Feet","Summary":"like two coffee cup saucers with a round metal rotating flashing object in between saucers","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-03282012-0014","Object Shape":"Circle, Disc","Region":"Florida","Country":"United States","divs":["Sighting DetailsI was staying with a friend and around midnight I couldn't sleep so I got up made a cup of coffee and took it to the dock. I was sitting waiting for the coffee to cool a little when I noticed flashing lights on the lake. I looked up and saw a round object slowly moving over the tree tops then it came down and hovered over the lake. The nearest part of the saucer was no more than 70-75 feet from me. It looked as though it could house no more than two to four people my size. The lights flashed then pulsed I didn't understand what it wanted. But I heard myself say aloud \"okay\"..then the next thing I remember is sitting back on the dock and my coffee was cold. I watched the object slowly rise to the tops of the trees and zip it was gone. I walked back into the house and looked at the clock it was about 1:35 a.m. I told noone back then if I had said anything about it I would have been placed in a mental hospital and called crazy. Many years later around 1988-89 I quit smoking and gained quit a bit of weight at that time I noticed small grooves in both arms as if tissue had been removed. I checked and found two scar like patches one on each arm, resembling a polio vaccination, but much lower. Why hadn't I noticed them before I wondered. Well for one thing they are in an area not easy to look at, on the back of the arms. Was I affraid \"NO\" I curious, I was more interested in the object and what was inside than affraid."],"Case Number":"36965","map":"<A HREF = \"http://maps.google.com/maps?q=27.960455,+-82.455148(36965)&iwloc=A&hl=en\"> mufon case (36965) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/36965.html.txt","/var/www/straped/mufon/org/36965.html"],"Latitude":"27.960455","Object Flight Path":"Hovering then path,Path then hovering","Disposition":"Unresolved","Longitude":"-82.455148","Date of the Event":"09/09/1966 12:00 UTC","City":"Tampa","Tags":"City","Date Submitted":"03/28/2012 02:31 UTC"}