{"Region":"California","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=33.469152,+-117.689198(36971)&iwloc=A&hl=en\"> mufon case (36971) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Unknown","Log Number":"US-03282012-0020","Source":"MUFON","Case Number":"36971","Summary":"Light over the ocean just off shore, hovered, then shot straight up into the air, hundreds of feet, then did fantastic maneuvers.","Tags":"City","files":["/var/www/straped/mufon/html2text/36971.html.txt","/var/www/straped/mufon/org/36971.html"],"Longitude":"-117.689198","Viewing Distance":"Over One Mile","Date Submitted":"03/28/2012 03:39 UTC","trends":["There have been 18 other sightings in Dana Point","There were no other sightings in Dana Point on or around April 20th 1995"],"Date of the Event":"04/20/1995 06:15 UTC","Weather Factors":"Unknown","City":"Dana Point","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"33.469152","divs":["Sighting DetailsHi out there. My girlfriend at the time and I were on Salt Creek State beach near Dana Point,CA, sitting on a rock, we watched the sunset, then stayed listening to the waves, when I noticed a light to the south,towards Camp Pendelton, which is probably 30 miles to the south. This light seemed maybe between3 to 10 miles away, I thought it as just a boat on the water, as it just sat there on the water for a long time, then as I was watching it, it shot straight up into the air and hovered for a few seconds, then began doing circles and maneuvers up and down left and right, as if you were using a laser pointer on a wall, like people do making squiggly lines all around, it was moving fast, unbelievably fast,the only reason I believed my eyes was I was watching it, and I pointed it out to the girl I was with, and also to a random person walking on the sand. All three of us were amazed. This movements continued for about 30 to 40 minutes, then began to fade away as the movements slowed down. It did not cast a reflection on the surface of the water that I remembered. It was the most amazing thing I have ever seen. The next night I went back about the same time, just after sunset, and again it was there, but only for about 15 minutes before it disappeared."]}