{"map":"<A HREF = \"http://maps.google.com/maps?q=38.03809,+-92.711573(36977)&iwloc=A&hl=en\"> mufon case (36977) map </A>","City":"Linn Creek","trends":["There have been no other sightings in Linn Creek","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/36977.html.txt","/var/www/straped/mufon/org/36977.html"],"Viewing Distance":"101-500 Feet","divs":["Sighting Details At the time of my encounter I lived on a remote arm of the \"Lake of the Ozarks\" in \"Southern Missouri\", it was in MAY of 1970. I have kept the story of what I experienced to myself for fear of ridicule. Only telling four other people until today, now I am ready to share my encounter with the everyone. Over the years I have heard many a story of strange encounters', yet none of them described a craft like the one I saw. It was a Saturday, around 10am when I decided to bank fish for Crappie. So, I took off walking the rocky hillside shore, fishing as I walked. I did this often, and each time it took me \"Three to Three and a half hours\" round trip. I had fished to my turn around point and was about half way back home. I had looked to the sun to guess the time and it was above me in the noon position. Just then my lure got caught on a branch, I turned to free the lure and noticed the most amazing thing I would ever see. There floating perfectly still was a \"Huge\" craft, it made no sound, not so much as a whisper. I remember feeling a strange calmness, not frightened or excited as one might expect to feel. I stood there staring at it for what felt to be \"Three to Five minutes\". The first thing that I remember thinking was, why doesn't it fall, why doesn't it make any sound? The craft was triangular in shape, except the corners didn't come to a point, instead they appeared to be blunted. The craft was around 200 yards or so away from me, above the hill. It was a dull Tan color (like sand color is), with a thick glossy Black strip down the side of it. The surfaces appeared to be perfectly flat and smooth, I noticed no seems on it at all. The craft was about 100 yards plus in its width and length, and four to six stories in thickness.( I could only see the bottom, one blunt corner and one side of it from my point of view ) Suddenly I noticed the craft had began to very slowly float away, over the hill moving out of sight. I stood there watching it, when suddenly I noticed that I was waving at the craft in a goodbye manner. I don't remember starting to wave, only that I was waving. As it passed out of sight the day light suddenly became very very dim all at once. I looked to see what had blocked the sun, but the sun wasn't above me any more. Instead it was on the Western horizon about to go down. I headed down the shore back home as fast as I could, it was dark when I arrived, it was after 8pm. A good seven hours of my life and memory are still missing from that encounter. A couple of days later I found Two bright Red dots' inside the hair line above my temple and located an odd bump on the back of my head toward the base of my skull.(they are both still there) It should have only taken me Three or so Hours to complete that trip, instead it had taken me over Ten Hours. I am hoping to be regressed, and will make public any and all memories that I am able to recover from the encounter."],"Case Number":"36977","Date Submitted":"03/28/2012 08:27 UTC","Object Flight Path":"Stationary","Tags":"City","Sighting Duration":"07:00:00","Object Features":"Unknown","Region":"Missouri","Weather Factors":"Unknown","Summary":"triangle,lite brown,glossy black stripe,silent,floating in mid air,150 yards length,four to six stories thick,seven hours time and memory missing. h","Date of the Event":"05/16/1970 12:00 UTC","Disposition":"Unresolved","Object Shape":"Triangle","Longitude":"-92.711573","Source":"MUFON","Country":"United States","Latitude":"38.03809","Log Number":"US-03282012-0026"}