{"Viewing Distance":"Unknown","Case Number":"36984","Disposition":"Unresolved","Source":"MUFON","City":"St Louis","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.560907,+-90.283832(36984)&iwloc=A&hl=en\"> mufon case (36984) map </A>","divs":["Sighting DetailsFriday evening March 23rd, 2012 over south St. Louis city appeared a beautiful double rainbow. It lasted for maybe 10 minutes, and I was able to get my camera and snap off about 30 pictures. In only one of them, \"within\" the rainbow, was a black \"line\" with a black \"aura\" around it in the purple section of the major rainbow! The pictures from six seconds before and twelve seconds later of essentially the same perspective did not exhibit such an anomaly, and so I know it was not a camera anomaly. I did not notice the object until I downloaded the images from camera to computer. A single cropped image at 100% of the camera's resolution accompanies this report. I find such interesting in comparison to a similar circumstance event on November 10th, 2010, also here at my St. Louis south city house, also reported to MUFON, I took pictures of a beautiful sunrise and in different images UAPs were also later noticed to have been captured."],"Sighting Duration":"00:00:01","Region":"Missouri","Country":"United States","Weather Factors":"Unknown","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around March 23rd 2012","This sighting has never been favorited.",""],"Object Shape":"Cylinder","Log Number":"US-03282012-0032","Tags":"City","Date Submitted":"03/28/2012 09:49 UTC","Summary":"Unknown Aerial Phenomenon Captured during Double Rainbow over St. Louis","Date of the Event":"03/23/2012 06:02 UTC","Latitude":"38.560907","Object Flight Path":"N/A","Longitude":"-90.283832","files":["/var/www/straped/mufon/html2text/36984.html.txt","/var/www/straped/mufon/more/36984_submitter_file1__2012032318022802.jpg","/var/www/straped/mufon/more/36984_submitter_file2__2012032318022801.jpg","/var/www/straped/mufon/org/36984.html"]}