{"Disposition":"Unresolved","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.208257,+-119.003962(36998)&iwloc=A&hl=en\"> mufon case (36998) map </A>","Sighting Duration":"Undisclosed","City":"Burbank","Summary":"It looked like a 8'-10' glass ball with an ark welder in it putting out orange-red light. I got 5 min of video.","Latitude":"46.208257","Object Features":"None","Date Submitted":"03/30/2012 12:41 UTC","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/36998.html.txt","/var/www/straped/mufon/org/36998.html"],"Region":"Washington","Longitude":"-119.003962","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Burbank","There were no other sightings in Burbank on or around March 27th 2012","This sighting has never been favorited.",""],"Source":"MUFON","Date of the Event":"03/27/2012 11:52 UTC","divs":["Sighting DetailsSaturday night March 24,2012 at 11:52pm I took my dog out to do his business and I noticed right over my tree in Burbank Wa. and at about the same hight as small air plain would fly was a 8'-10' glass ball with what looked like a ark welder in it but it was putting off orange-red light instead of white. It was traveling east 100 degees at about 20-30 miles an hour. Too slow for an air plane unless it was an ultralite but this ball put off so much light that it would have illuminated any craft around it. I knew no one would believe me without evidence so I ran back into the house and grabbed my video camera and got 5 min. of video of it going away from me until it went out of sight. It's an analog Hi-8 and I have been trying to find someone that can put it on a DVD so I can upload it on the internet. I have talked to our air port and they said that they would not have record of radar because they shut down at 10:00pm. A few days later doing the same thing with the dog I saw a white orb come out of Burbank hights Arleens addition across the river towards Finley Wa. It was traveling very low and like a rocket. I haven't seen anything move that fast. It moved so fast I didn't even have time to turn on the camea I was holding. The object that I did get video of was right over me and it was putting out so much light that it actually would hurt your eyes if you stared at it to long. I had my camera in night vision mode so that it would film it at night so it looks white-green on film but it was really orange-red and maybe a hint of yellow. I didn't have time to grab my tripod so it's a bit shaky. I ran over to my fence and tried to stabilize the camera but it still moves around on the screen."],"Log Number":"US-03302012-0002","Case Number":"36998","Object Shape":"Sphere"}