{"Tags":"City","Object Shape":"Circle","Date of the Event":"03/28/2012 11:29 UTC","Disposition":"Unresolved","Latitude":"40.886813","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"36990","files":["/var/www/straped/mufon/html2text/36990.html.txt","/var/www/straped/mufon/org/36990.html"],"Region":"New York","Weather Factors":"Unknown","divs":["sighting detailsjust around 11:30pm, we switched off the bedroom lights. our top windows are not covered, so we have a view of the night sky. looking out the window, i saw a single light quickly move across the sky, in an arc. initially assumed this was either a residual image in my eye or a plane\\helicopter, but the same pattern of movement was observed several times so i asked my wife to confirm. she also saw the light. we moved the blins to one side on the lower window and observed 4 lights moving very quickly (much quicker than a plane passing overhead) from a central point, out in 4 directions, and then coming back to the central point (no light in the central point, appeared to be the four lights created the central point when converged). this happened maybe 4 or 5 times, then the lights were gone. both my wife and i witnessed this event. i watched the sky for another 20 minutes or so and saw nothing else. whatever these were, they moved very fast. i can't think of how best to describe it. the force of the movements and elipsical route taken to reconverge on the same point must have been incredible. this movement was not in any way similar to a plane or helicopter movement. any explanantion\\confirmation\\additional sightings much appreciated."],"Country":"United States","Longitude":"-73.794482","Summary":"Incredibly fast lights over Pelham, Westchester","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Log Number":"US-03292012-0003","map":"<A HREF = \"http://maps.google.com/maps?q=40.886813,+-73.794482(36990)&iwloc=A&hl=en\"> mufon case (36990) map </A>","Object Features":"None","trends":["There have been 2 other sightings in Pelham Manor","There were no other sightings in Pelham Manor on or around March 28th 2012"],"Date Submitted":"03/29/2012 09:40 UTC","City":"Pelham Manor"}