{"Disposition":"Unresolved","Summary":"Metallic disk spins and moves in various directions before vanishing.","map":"<A HREF = \"http://maps.google.com/maps?q=33.956449,+-117.386986(36992)&iwloc=A&hl=en\"> mufon case (36992) map </A>","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-117.386986","City":"Riverside","Date Submitted":"03/29/2012 01:33 UTC","Region":"California","Country":"United States","Date of the Event":"03/27/2012 05:17 UTC","Viewing Distance":"101-500 Feet","Log Number":"US-03292012-0005","divs":["Sighting DetailsI was standing inside a store lobby while on the phone at work. A bright shine hit my eye unexpectedly. I quickly noticed that it was not from a car and when I looked up there was a metallic disk in the air rotating and tilting as it was slowly moving upwards in a spiral type path. I was able to clearly see the shape and surface of this craft. It was a perfect metallic disk with no seams, lights, glass, or doors of any kind. It was made of a very reflective silver type metal. As it continued to move it suddenly stopped and vibrated. At this time I was still seeing the metal shine from the sun hitting it. It sat vibrating and tilting before suddenly moving in a horizontal direction approximately 40 feet. The speed it moved was extremely fast and almost instantaneous. It hovered again shaking with a strange pulsing motion before moving a small distance again horizontally. I was on the phone with a co-worker and I was trying to describe what I was seeing while in complete shock and amazement at what was going on. After hovering for a couple seconds it disappeared into thin air. It seemed to vanish from the outside of the craft inwards at a very fast rate. It did not fly away. This whole event took approximately 27 seconds. I had enough time to describe what I was seeing to someone on the phone and get a very good look at this object. It was about 700 feet from me and roughly 50 feet off the ground. The size of this disc was about 16 feet wide by 6 feet at its thickest middle point. There is no doubt in my mind that this was a very solid disk and was made of a extremely reflective metal type material. The shine coming off the craft was striking and can be compared to a bright shine off a chrome part of a car in the sun. That shine hit me in the eye twice which made this experience very real and disturbing. I have seen multiple UFOs in my life but nothing this clear or close. I will now keep a high definition camera handy because I would not believe this unless I had seen it. This is reality and I wish there were answers."],"trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around March 27th 2012"],"Sighting Duration":"00:00:27","Latitude":"33.956449","Object Features":"Other","files":["/var/www/straped/mufon/html2text/36992.html.txt","/var/www/straped/mufon/org/36992.html"],"Case Number":"36992","Tags":"City","Object Flight Path":"Hovering then path,Path then hovering","Object Shape":"Disc"}