{"Viewing Distance":"101-500 Feet","Region":"Pennsylvania","Log Number":"US-03302012-0003","Country":"United States","Object Shape":"Disc","Latitude":"39.93116","trends":["There have been 8 other sightings in Coatesville","There were no other sightings in Coatesville on or around March 14th 2011","This sighting has never been favorited.",""],"Date Submitted":"03/30/2012 01:43 UTC","Longitude":"-75.828604","Date of the Event":"03/14/2011 11:30 UTC","Weather Factors":"Unknown","Case Number":"36999","City":"Coatesville","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/36999.html.txt","/var/www/straped/mufon/more/36999_submitter_file1__ufo.png","/var/www/straped/mufon/org/36999.html"],"Source":"MUFON","Object Flight Path":"Stationary","Summary":"Object rose up over the tree line & hovered for 15 mins, appeared to see me, tilted in my direction.","divs":["Sighting DetailsMy fiance, My cousin & myself were driving through Pennsylvania for a couple hours enjoying the tranquility of the scenery & conversing about life when we made a wrong turn & ended up on Doe Run rd. We were driving on a downward slope passing the hillside when I noticed off to my right that there were lights behind the treeline. At first I thought it was just lights from a house we were approaching but as we got closer the lights ascended up through the treeline & hovered just a few feet above the treeline about 200-300ft away from the road. The object was noticeably big considering it was about the size of the first floor of the house we had just passed. I opened my car window & had literally half of my body outside of the car as we were moving because I at first thought this can't be what I think it is. The object had no sound what so ever & the lights were the purest white I had ever seen & didn't light up the trees at all. It was a disc shape with three white lights on the bottom, I assumed it was the front of the object because I got the feeling that something in the craft was watching me from inside, & then the object tilted at about a 45 degree angle looking directly at me & I began to feel strange. It was emitting an energy that I had never felt before & I could feel the energy coursing through my body. This was not fear or an adrenaline rush. It was something different I was experiencing. I could hear my fiance in the background yelling \"what is that?, What the hell is that?\" I could hear the fear in his voice. It was so close to us. I couldn't take my eyes off of it, not even for just a second so that I could grab my camera. Almost as if I was in a trance. As more cars began to catch up to our car (we were driving very slow since we were unfamiliar with the area we were in)& we began to pass the object it seemed to go into what I would describe as a decoy mode. The three main lights shut off & they switched on four much smaller lights. Two red(diagonal from one another) & parallel to the red lights were two green lights(also diagonal from one another). I broke out of the trance as we passed it, & I started to yell out in excitement \"Turn your lights back on!, Please! Turn them back on.\" I guess I had hoped that they would listen to me. I then yelled out \"I knew you were real!, I'm so happy that I could see you even if this is the only time.\" It was so amazing. I kept watching out the window as we got farther & farther away from it & it stayed there until we were about a mile away from it. It then began to ascend into the sky & I lost sight of it. My cousin was in the backseat in complete shock. He remained quiet the entire time & just watched. He wasn't sure what to make of the object we were seeing. He was a skeptic prior to this experience & it took him a few weeks to admit what he saw. My fiance & I had discussed the encounter frequently after that & to this day still talk about it."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.93116,+-75.828604(36999)&iwloc=A&hl=en\"> mufon case (36999) map </A>","Tags":"City"}