{"Object Shape":"Diamond","Latitude":"40.370036","Log Number":"US-03292012-0007","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/36994.html.txt","/var/www/straped/mufon/org/36994.html"],"Country":"United States","Viewing Distance":"Unknown","Summary":"Loud jet-like noise heard, then observed lighted diamond-shaped object flying slowly east","trends":["There have been no other sightings in McDonald","This sighting has never been favorited."],"Weather Factors":"Unknown","Date Submitted":"03/29/2012 09:20 UTC","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI just moved to a rural area in southwestern PA for a job after living in rural northwestern PA (and never seeing anything like this). I was in my apartment on my laptop when I heard what sounded like a plane flying low and close. I went to my door and opened it to see what was happening, and I saw a kite-shaped object flying east over town. It looked familiar (most likely from TV programs about UFOs) but certainly not like an airplane, so I was not alarmed, but I was extremely curious and interested while watching it. The sun had set but the sky was still royal blue, so I could clearly see the gray shape of the object and could tell that it had no discernible wings, just a solid diamond-like shape. There were several lights along the front, and I believe the ones at the corners flashed. Some were white and others were slightly yellowish. As the object neared the hills that would block it from my view, it turned slightly to the north (left). It flew slowly and smoothly, and sounded much louder than a plane. The whooshing hum was higher in pitch than any plane or jet I've heard before. I live south of an airport, and I've observed several airplanes flying tonight after seeing this object. They all go north and have lights in a plane-like configuration. The kite-shaped object was lower, louder, and definitely not flying toward the airport. After seeing it, I returned to my laptop and researched what I may have seen, and found UFO sightings very similar to mine. I'm a smart and logical person, and I am 100% sure I did not see an airplane. I will now keep my camera close and try to get evidence if this happens again."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.370036,+-80.232861(36994)&iwloc=A&hl=en\"> mufon case (36994) map </A>","Object Flight Path":"Path with directional change","Longitude":"-80.232861","City":"McDonald","Case Number":"36994","Region":"Pennsylvania","Source":"MUFON","Object Features":"None","Date of the Event":"03/29/2012 08:29 UTC"}