{"trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around August 25th 2003"],"Object Features":"Undisclosed","Region":"Oregon","Date of the Event":"08/25/2003 11:00 UTC","divs":["Sighting Details I was driving with my friend in the middle of the night through the woods on route 101 in oregon, heading south. It was probably about midnight, very dark out, we haven't seen many other cars, there are no lights above the road. In the side mirror i saw a blinking yellow light hovering and following behind us. I was about to say something to my friend when he said, \"are you seeing this?\" And I said, yes, what is it? It followed us for maybe thirty seconds, while we were kind of dumbfounded, and if my memory serves me, I think it matched our speed as we sped up and slowed down, but that may be a false conception. During this period I looked up to my left and saw around the top of a tree another yellow light. It was about as high as the top of power lines would be. I did not see it for very long, as we passed by quickly, so my impression of this light is less ingrained. The one behind us just dissapeared. Right after it stopped blinking, I realized that the radio had been giving off static noise in time with the blinking. The radio had been off the whole time. I wonder if this might have been my imagination, because I should have noticed the radio noise earlier, however, I might have been too distracted wondering what the lights were to notice the radio earlier. I realize that a blinking yellow light behind a car sounds a lot like it might be another car's turn signal, but the conditions make this possibilty seem improbable. We were drinving in a dark area, not near a city, no road lights. It was dark. I have tried to turn out my lights and drive for a few seconds while on dark camp roads, and you can't see anything. You can't turn out your headlights for more than 3 seconds or so, and you can't go more than about 5 miles an hour. The darkness on 101 was like this. I find it hard to believe that someone was drinving a car for at least a minute or two without headlights, travelling at 45 or 50 miles an hour behind us. Even if they were just following the lights on our car, how did they catch up to our car in the first place? The light just came out of nowhere. No headlights, and I don't think i had seen anyone behind us for a while. I was wondering if you get anything similar, or if you have an explanation."],"files":["/var/www/straped/mufon/html2text/3699.html.txt","/var/www/straped/mufon/org/3699.html"],"Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=45.527492,+-122.669707(3699)&iwloc=A&hl=en\"> mufon case (3699) map </A>","City":"Portland","Log Number":"US-08052005-0001","Date Submitted":"08/25/2003 11:00 UTC","Object Shape":"Unknown","Country":"United States","Weather Factors":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"blinking yellow light behind car and another one above tree, corresponding to radio fuzz","Longitude":"-122.669707","Tags":"City","Latitude":"45.527492","Disposition":"Unknown","Object Flight Path":"Stationary,Straight-line path","Case Number":"3699"}