{"Disposition":"Unresolved","Summary":"Clouds opened, 4 crafts came from clouds, beam, searching, object shot never looked for","Date of the Event":"06/12/1994 12:00 UTC","Latitude":"40.515678","City":"Center valley","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Object Features":"Unknown","Object Shape":"Cone, Disc","Log Number":"US-03302012-0013","map":"<A HREF = \"http://maps.google.com/maps?q=40.515678,+-75.388332(37009)&iwloc=A&hl=en\"> mufon case (37009) map </A>","Source":"MUFON","trends":["There have been no other sightings in Center valley","This sighting has been favorited 1 time."],"Sighting Duration":"Undisclosed","Case Number":"37009","divs":["Sighting DetailsMy friend and I were having a sleep over and we were up late when we noticed purple and blue lights above the clouds. We kept watching giving that we have never seen lights like that before and then the clouds opened up in a circle form and a craft emerged with red and blue lights and clear lights underneath. It made a circle manover and after it stopped 3 smaller craft came out from the same location above the clouds and they seemed to be evenly spaced around the large craft almost like a triangle shape. They all hovered for a few minutes and the larger craft beamed a white solid light to the ground and started moving around as did the smaller craft but without a beam. Seemed like they were searching for something. My friend and I never stopped watching as we both were in shock nor seen ANYTHING like this before. After Id say, about 3-4 minutes the 3 smaller objects went back inside the clouds where the opening and lights were the bigger one hovered and looked like red laser beams that made a solid line in the air and kept shape. The line did not fade but yet made almost like a box shape. Once it made the box shape the craft shot something out of it threw the laser shaped box and landed behind our old house. After seeing all this my friend and I were very scared and didnt get much sleep if any that I remember. Being scared as we were and giving what we seen we never really looked for the object. I did however see an episode on tv about a person finding and seeing about the same thing I seen that night. But what he found had traces of metals that we dont know of even today. I myself know the area where it landed and know, even today that the land did not change since the sighting that its still there in the ground and I want to find it."],"Country":"United States","Longitude":"-75.388332","Date Submitted":"03/30/2012 02:36 UTC","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/37009.html.txt","/var/www/straped/mufon/org/37009.html"],"Region":"Pennsylvania"}