{"Date Submitted":"03/30/2012 10:59 UTC","Object Shape":"Triangle","Log Number":"US-03302012-0007","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.003933,+-83.944942(37003)&iwloc=A&hl=en\"> mufon case (37003) map </A>","Date of the Event":"05/07/1995 12:00 UTC","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Object Features":"Unknown","City":"Tecumseh","trends":["There has been one other sighting in Tecumseh","There were no other sightings in Tecumseh on or around May 7th 1995","This sighting has never been favorited.",""],"Tags":"City","Summary":"Triangular aircraft flying over apartments towards Tecumseh Stamping","Country":"United States","divs":["Sighting DetailsThis event occured back in early 90's while i was still 15-16. I was walking across the apartment complex from my place to my girlfriends about 1 am. I dont know what made me look but when i looked back towards my apartment building i noticed 3 triangular lights moving very slowly and quietly moving towards local busniess called Tecumseh Stamping ( i think that was its name).I stood there for what seemed like an hour just watching it. I could make out a silouette that the craft was triangular on the base with 3 triangular lights at each of the peaks of the shape. I could also see sillouette with the factory lights in the skyline that the craft also had a pyrimid shape on top but not straight, more of a flattened and slanted pyrimid, its hard to describe in words but i can see it as if i just saw it last night. I will include my best rendering of it as i can, i'm not the best artist but i can still pitcure it in my head any time. I saw no lights on it other then those i could see on the bottom. My first thought when i think about this craft is maybe was some kinda stealth fighter like the B2 Bomber or something but the slowness and silentness of it make me think otherwise. I dont claim this to be alien but judging from what tech we as humans have and are experimenting with i dont think it was man made."],"Latitude":"42.003933","files":["/var/www/straped/mufon/html2text/37003.html.txt","/var/www/straped/mufon/more/37003_submitter_file1__myufosighting.jpg","/var/www/straped/mufon/org/37003.html"],"Source":"MUFON","Case Number":"37003","Sighting Duration":"Undisclosed","Region":"Michigan","Longitude":"-83.944942","Viewing Distance":"101-500 Feet"}