{"Longitude":"-111.756205","Log Number":"US-03302012-0010","Weather Factors":"Unknown","Case Number":"37006","Date Submitted":"03/30/2012 11:08 UTC","Viewing Distance":"101-500 Feet, Unknown","Country":"United States","Tags":"City","Date of the Event":"01/13/2000 11:00 UTC","Region":"Arizona","Summary":"There were a number of craft of varied designs that I videotaped. I am jepgs of a couple of the crafts that were taken from the tape","trends":["There have been 47 other sightings in Sedona","There were 6 other sightings in Sedona on or around January 13th 2000","This sighting has never been favorited.",""],"Object Shape":"Cigar, Cylinder, Square, Rectagular, Other","Sighting Duration":"00:20:00","map":"<A HREF = \"http://maps.google.com/maps?q=34.770365,+-111.756205(37006)&iwloc=A&hl=en\"> mufon case (37006) map </A>","Latitude":"34.770365","City":"Sedona","files":["/var/www/straped/mufon/html2text/37006.html.txt","/var/www/straped/mufon/org/37006.html"],"Object Features":"Other","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsWhile watching a football game on TV I decided to set up a video camera outside on a tripod. I pointed the camera in a southernly direction, set the lens a 2X power and let the camera run for approximately 20-minutes. A day or two later I decided to view the film on a VCR and while running the film at half speed I discovered that I had taped numerous objects during that 20-minutes and have continued to do so ever since into the late 2000's. The majority of craft are either somewhat arrow shaped but I have videotaped saucer and skate board type objects all of which have very good to excellant definition. Some of which were shown on the History channels 'UFO hunters'. If anyone wants to see them I can either send them to UFO Stalker or e-mail them upon request. I am enclosing three video stills that might be of interest to UFO StalKer viewers Note: All the videos were filmed in the Village of Oak Creek, Sedona Arizona"]}