{"Object Features":"Undisclosed","Date of the Event":"05/31/1983 12:00 UTC","Source":"MUFON","Tags":"City","trends":["There have been 3 other sightings in Carmel Hamlet","There were no other sightings in Carmel Hamlet on or around May 31st 1983"],"Country":"United States","Weather Factors":"Unknown","Summary":"Rectangular hovering ship?","Region":"New York","Latitude":"41.437354","Disposition":"Unknown","divs":["Sighting DetailsMy mother told me that while travelling on Rt 84 near the exit for rt 52, all the cars on the highway stopped to look at the object in the sky. She described it as the size of a football field, rectangular in shape and also said the center was hollow(for lack of a better word) In other words, one could see through the center and see the stars in the sky. She said it just stayed above them making no sound whatsoever. Not moving at all,just suspended in mid air for about 10 minutes or so. Then left the area without making any noise. The following day, a friend of hers that worked for the phone company told her that they had been swamped with calls -thousands of them. Of people trying to find out where they can call to report seeing this object. She says I was in the car at the time, but I have no recollection of this. She also said the oddest part about it was that all these people on the highway got out of their cars but no one said a word to each other. No one commented on it it was eerie and dead silent. She even said she and my step father got back in the car and drove away after it left and they didn't speak to each other either. I have been trying to find other reports on this same sighting. Just out of curiosity. Weird."],"Log Number":"US-08052005-0002","Date Submitted":"05/31/1983 12:00 UTC","Viewing Distance":"Unknown","Case Number":"3700","Longitude":"-73.67783","files":["/var/www/straped/mufon/html2text/3700.html.txt","/var/www/straped/mufon/org/3700.html"],"City":"Carmel Hamlet","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.437354,+-73.67783(3700)&iwloc=A&hl=en\"> mufon case (3700) map </A>","Object Shape":"Undisclosed","Sighting Duration":"Undisclosed"}