{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Region":"Alaska","Object Shape":"Circle, Sphere","Disposition":"Unresolved","Log Number":"US-03302012-0019","Tags":"City","Weather Factors":"Unknown","divs":["sighting detailsin the morning hour of 0600 on this particular day, i drove back south to our ufo sightings area after i dropped off my fiance for work at a mine boat. upon my arrival i parked in the first pull off to the south where we saw the two orange orbs\\ufo's in the earlier am around 0515. i sat there for a bit and decided to take pictures and videos of the canadian geese and mallard ducks. i took a few pictures and then looked up and saw a very bright white orb\\ufo at 0612 in the distance over the island where helicopters and other ufo's have been seen by myself and two other family members over the months. i was very excited to see it especially during the daylight hours. it was so very, very bright and totally awesome! i then started to take videos and pictures of this ufo. observing it through the binoculars revealed it was flat, and had very bright diamond like flashing lights around the edges. it continued hovering and moving slightly inward for about 5 minutes until it appeared to tilt on its side\\axis and then winked out. or so i thought. i then saw it up against the clouds with flashing white lights. it then flew east, with red\\white flashing lights and quickly out of sight around the mountain ridge. on my way home, i felt really fatigued so upon arriving home 4 miles away i went back to bed and slept in."],"City":"Undisclosed","Case Number":"37017","files":["/var/www/straped/mufon/html2text/37017.html.txt","/var/www/straped/mufon/more/37017_submitter_file2__3292012133am.JPG","/var/www/straped/mufon/more/37017_submitter_file3__3292012134am.JPG","/var/www/straped/mufon/org/37017.html"],"Viewing Distance":"Unknown","Longitude":"-154.486362","Summary":"Observed bright white orb/ufo hovering over trees on island. Hovered, appeared to spin and wobble in video. Tilted winked out. Saw it up near clouds. It then flew East flashing lights of red&white. Disappeared behind mountain ridge.","Date of the Event":"03/29/2012 06:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=63.594953,+-154.486362(37017)&iwloc=A&hl=en\"> mufon case (37017) map </A>","Latitude":"63.594953","Object Features":"Other","Source":"MUFON","trends":[""],"Date Submitted":"03/30/2012 06:41 UTC","Sighting Duration":"Undisclosed","Country":"United States"}