{"Weather Factors":"Unknown","Date Submitted":"03/30/2012 07:39 UTC","Region":"North Carolina","Object Features":"Unknown","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Latitude":"35.907459","Case Number":"37019","City":"Spruce Pine","Sighting Duration":"01:00:00","Tags":"City","Date of the Event":"11/15/2010 09:01 UTC","files":["/var/www/straped/mufon/html2text/37019.html.txt","/var/www/straped/mufon/more/37019_submitter_file1__nc.jpg","/var/www/straped/mufon/org/37019.html"],"Object Shape":"Triangle","Country":"United States","Object Flight Path":"Other","trends":["There have been no other sightings in Spruce Pine","This sighting has never been favorited."],"Longitude":"-82.007745","map":"<A HREF = \"http://maps.google.com/maps?q=35.907459,+-82.007745(37019)&iwloc=A&hl=en\"> mufon case (37019) map </A>","Source":"MUFON","Log Number":"US-03302012-0021","Summary":"Red and Yellow Prisms in the Sky over Appalachia","divs":["Sighting DetailsMy friend invited me to his brothers house for dinner. During dinner, he asked his brother if he still saw UFOs. I laughed, because I thought UFOs were stupid. His brother said not to laugh, because he saw them every night. I said I'd stay and watch for them, kind of as a joke. But about 9 pm, after it was dark, I saw a red light appear on the horizon over a mountain far in the distance. I thought it may be a plane, but it barely moved. I thought perhaps a tower, but it moved far too much. Slowly, over about 15 minutes, 7 more appeared. At this time, his brother brought out a telescope. I looked at the dots through the telescope, and I saw red and yellow pulsing prism shapes. I was shocked and frightened. I've never seen anything like that, and I've believe in UFOs ever since. The scariest thing happened next. They formed a ring shape in the sky, and circled counter clockwise. Then, one by one, they faded from view. At one point, we saw one briefly chase an airplane. The most interesting thing about this is supposedly these lights can be seen every night from Henredon Road in Spruce Pine, facing Marion and Morganton from the mountain top."]}