{"trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around March 29th 2012"],"files":["/var/www/straped/mufon/html2text/37012.html.txt","/var/www/straped/mufon/org/37012.html"],"Log Number":"US-03302012-0016","map":"<A HREF = \"http://maps.google.com/maps?q=40.750027,+-111.839852(37012)&iwloc=A&hl=en\"> mufon case (37012) map </A>","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Longitude":"-111.839852","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","Date Submitted":"03/30/2012 04:04 UTC","Weather Factors":"Unknown","Case Number":"37012","Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"Utah","Date of the Event":"03/29/2012 10:20 UTC","divs":["sighting detailsi was in my backyard getting ready to call it a night, when i suddenly saw these glowing red\\orange lights ascending over mt. olympus in utah. the mountain is west of my house. at first, i thought an airplane, but then the lights seemed to multiply above and below the mountain horizon. withing seconds there was over 8-10 of them and i realized that the majority of them were actually in alignment moving north east directly toward me. so i realized there was a \"form\" to them but i couldn't see any actual \"structure\". just pulsating orbs\\lights that appeared to have a solid mass. the \"floated\", silent, fluid movement still north east direction. i couldn't believe what i was seeing. i am a believer in ufo's but had never witnessed one. what were these things? was a really seeing a ufo\\ufo's heading straight toward me. i realized they were heading in a direction that would take them right over my house, so i ran to my top deck and could then see that there were even more lights\\orbs in a unilateral alignment \"floating\" north east. i ran through my house, grabbing my cell phone and a video camera and headed out the front door to the street. i though i would be happy......this might actually be a ufo but instead i felt uneasy and a little fearful so i was yelling for my husband and neighbors to come see. no one seemed to hear me. when i reached the corner of 20th east, the object suddenly seemed to make an abrupt shift 90 degree's to the right and immediately vanished. like someone just turned the lights out. gone. heading back to the house i realized that i hadn't even turned the video camera on and my cell phone only got glimpses of the ground as i was running. i guess i was so mesmerized, i didn't even focus. after wards, i immediately searched the internet for any news that might confirm what i saw. nothing. within 20minutes post the event, i was suddenly exhausted! couldn't keep my eyes open even though my mind was racing. i slept like a rock which is extremely unusual for me. the whole experience has me a little nervous to be honest. i have no idea what i saw, so i guess i can officially say \" i saw a ufo\"."],"Latitude":"40.750027","Country":"United States","Object Shape":"Fireball, Sphere","Summary":"Red/Orange Orbs over Mt. Olympus Utah","City":"Salt Lake City"}