{"Source":"MUFON","Case Number":"37022","divs":["sighting detailscame out of my sister's apartment after dinner and noticed 3 stationary orange lights to the north between the hospital and the block my home is situated on. wondering what the lights were and also going to my car i was literally shocked to see a massive black triangle hovering in the sky. there were these orange lights on each point (underneath the craft) that seemed to have a seam in the middle and bulged out left and right as you were looking at them. i went back into my sister's apartment and got her boyfriend to come out and see what i was seeing as he could not hear me yelling for him from the road. when we got back to the road the object was moving towards the south east in the direction of baraboo, wi. what was really odd is that as it moved it began to shut off the lights one by one starting on the right side to the top and then finally the left side (as you are looking at it). there was also cloud bank or possibly a fog bank moving in from the east as well and this where the object headed and the lights turning off at this time - not being obscured by the cloud bank but turning off. once the object dissappeared behind the cloud bank i went home and told my wife and son what i and my sister's boyfriend had seen and my wife related that our dog has been acting really odd and was barking at something in the sky in our living room (faces north west) and then followed something in the air (her words) through the house to our bedroom on the south east end of the house. i am an air force veteran - specifically security police\\law enforcement specialist with security flight line experience and worked around various types of aircraft including top secret spy planes while stationed in the rok. this was not anything i have seen in the past. my sister's boyfriend also seen the object and tried to take pictures of it but none turned out (he was using his cellphone camera)."],"Date of the Event":"03/24/2012 09:20 UTC","Summary":"Extremely Large Black Triangle with 3 orange lights at each peak. Hovered in sky at first and when I went to get another witness it had started to move south east towards Baraboo, WI and went behind an odd cloud bank or fog like structure.","files":["/var/www/straped/mufon/html2text/37022.html.txt","/var/www/straped/mufon/org/37022.html"],"Tags":"City","Date Submitted":"03/30/2012 08:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.566059,+-89.965655(37022)&iwloc=A&hl=en\"> mufon case (37022) map </A>","trends":["There have been 2 other sightings in Reedsburg","There were no other sightings in Reedsburg on or around March 24th 2012"],"Region":"Wisconsin","Latitude":"43.566059","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Object Shape":"Triangle","Longitude":"-89.965655","City":"Reedsburg","Disposition":"Unresolved","Log Number":"US-03302012-0024","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path"}