{"Summary":"My wife and I saw approximately 12 lights,white red and blue, moving from south to north without any sound for about 15 seconds.","Date Submitted":"03/31/2012 12:00 UTC","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=29.92693,+-82.437391(37025)&iwloc=A&hl=en\"> mufon case (37025) map </A>","Disposition":"Unresolved","Longitude":"-82.437391","Log Number":"US-03312012-0001","divs":["Sighting DetailsTonight (March 30, 2012) my wife and I were outside burning leaves in a burn barrel. It was a couple hours after sunset, and was totally dark. I had just added some more leaves to the fire, and looked up watching the smoke rising when I saw some multicolored lights moving through the branches of the trees above us. I pointed them out to my wife and she immediately said that she saw them also. There were about 12 different colored lights, white, red and blue, moving in loose formation to the north. We both moved to a spot in the yard that gave us a clear view of the sky, and saw the lights clearly for about 5 to 10 seconds until they went behind the branches of a tree. we could still see them through the branches for about another 5 seconds. Some of the red lights were flashing rapidly, about 3 or 4 flashes per second, The other lights were steady. The lights were about 30 degrees above the horizon to the east of us, and moved from south to north. There was no sound from the lights. We were surprised at the sighting, but not fearful or agitated at all. We both commented at how beautiful and vivid the lights were. My wife compared the size of the lights to the size of a car's headlights appearance when it is coming at you on the highway. I concur with that description. We lost sight of the lights after they went behind the branches of a tree in our neighbors yard."],"trends":["There have been no other sightings in Worthington Springs","This sighting has never been favorited."],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","City":"Worthington Springs","Case Number":"37025","Region":"Florida","Date of the Event":"03/30/2012 08:48 UTC","Tags":"City","Sighting Duration":"00:00:15","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Latitude":"29.92693","Object Features":"None","files":["/var/www/straped/mufon/html2text/37025.html.txt","/var/www/straped/mufon/org/37025.html"]}