{"Object Shape":"Bullet, Missile","Disposition":"Unresolved","Region":"","Case Number":"37029","trends":["There have been no other sightings in West Yorkshire","This sighting has been favorited 2 times."],"Latitude":"53.837119","Log Number":"GB-03312012-0005","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsMy older brother and I were sat on a stone wall at the side of the road [Oldfield Lane in Oldfield. near Kieghley] waiting for our Father to come home from work Probably around 4pm as he had a motor bike and would give us a ride down the long drive to the farm house where we lived. I was 4 years old. it was summer I think because it was warm and I remember only wearing a T shirt and Shorts. Suddenly above the tree we were sitting under we noticed a Craft Hovering above us like it was watching us. It can't have been more than 20 ft above us, less I think. We both looked at it and said that must be \"ThunderBird 2 \" I can only remember seeing the front of the craft it was the same shape as ThunderBird 2 at the front. The back half was hidden by the tree. I noticed it was a Gun Metal grey color, with a dull shine and small windows in odd and random places. I can't remember seeing anyone inside, or if it made a sound. Then my father must have come along and I don't remember anything after that. When I ask my Brother now if he remembers, he says no but he is very afraid of UFOs."],"Longitude":"-1.991524","Date Submitted":"03/31/2012 02:59 UTC","files":["/var/www/straped/mufon/html2text/37029.html.txt","/var/www/straped/mufon/org/37029.html"],"Date of the Event":"08/30/1964 12:00 UTC","Summary":"Craft we thought was Thunder Bird 2 but a Gun Metal Grey with small Square windows in odd places.","map":"<A HREF = \"http://maps.google.com/maps?q=53.837119,+-1.991524(37029)&iwloc=A&hl=en\"> mufon case (37029) map </A>","Source":"MUFON","Object Flight Path":"Stationary","City":"West Yorkshire","Object Features":"Window(s)","Country":"United Kingdom"}