{"Object Shape":"Saturn-like, Sphere, Triangle","Object Features":"None","Log Number":"US-03312012-0011","files":["/var/www/straped/mufon/html2text/37038.html.txt","/var/www/straped/mufon/more/37038_submitter_file1__UFOSketch.JPG","/var/www/straped/mufon/org/37038.html"],"Region":"Michigan","City":"Holly","divs":["Sighting DetailsMy boyfriend and I were coming home from school in Holly MI. We were going over I-75 on Grange Hall Road when we noticed a big object going over us. We stopped and jumped out of the car to get a better look at it. It looked like a series of tubes making the shape of a big triangle. Suspended in the center of the triangle was a sphere that was not atached in anyway yet they were moving together. I noticed it was a brushed siver color, with no reflection at all. Now I know it to be the appearence of stainless steel. I estimated it to be moving at about 20 miles an hour. It was just going over the tree tops and was very large, with no noise. We jumped back in the car to follow it. We wondered if anybody else had noticed it because it was moving parallel to I-75, headed north. We raced down Grange Hall rd, got to Dixie Hwy, and made a left. We raced down Dixie Hwy, seeing it here and there as we started to head into Grand Blanc. There is a little party store at the corner of Dixie and Grand Blanc Rd that we frequented, and we ran in hoping to find another witness. We told the guy behind the conter \"Oh my God there is a UFO flying outside you've got to see it!\" Of course he thought we were out of our minds. Finally we convinced him to go outside, where it was just going over the town of Grand Blanc. He looked at us and said \"Wow, oh my God!\" We said \"we told ya.\" And then we stood there and took it all in."],"Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","Source":"MUFON","Disposition":"Unresolved","Country":"United States","trends":["There have been 9 other sightings in Holly","There were 2 other sightings in Holly on or around May 1st 1980","This sighting has never been favorited.",""],"Longitude":"-83.625936","Tags":"City","Summary":"Dull MetallicTriangular Tubular Craft with Sphere Suspended in Center","map":"<A HREF = \"http://maps.google.com/maps?q=42.797903,+-83.625936(37038)&iwloc=A&hl=en\"> mufon case (37038) map </A>","Date Submitted":"03/31/2012 05:04 UTC","Sighting Duration":"Undisclosed","Latitude":"42.797903","Weather Factors":"Unknown","Date of the Event":"05/01/1980 02:30 UTC","Case Number":"37038"}