{"Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","Case Number":"37031","trends":["There have been no other sightings in Bristol or Johnson","This sighting has been favorited 1 time."],"Object Flight Path":"Unknown","Object Features":"Unknown","Region":"Tennessee","Source":"MUFON","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.458567,+-81.822436(37031)&iwloc=A&hl=en\"> mufon case (37031) map </A>","divs":["Sighting DetailsI tonight on 3-31-12 go out on my deck to let my dog do her business. I observed a light that went basically from 1 end to my house to the other very quickly (less than 5 seconds). I don't know north , south, east, west so that is the way I explain it. I have seen and observed local planes pass over and they don't move that quickly (this was not a plane). The blinky lights emitted colors that are not common with a small plane or next size up. I have flown in planes myself. Big planes don't emit this coloration. Cloudy sky tonight. What I noticed, it seemed the lights stopped when I was vigorous in looking. I have been watching my skies for at least a year. I have this feeling. On 2 occasions within the last 6 months, I believe the sky is changing. In addition, I witnessed my soda bottle twice do something strange. The soda in my 2 liter bulged up (as if it were a volcano erupting--it fell over itself-not the bottle but the liquid). I have a train track approximately a football field and a half from my house. When a train comes, I get ripples in my soda, not volcanic like transformations in the liquid. The movements of liquid are not geologically or train related. I theroretically (spelling sorry) think that sound is making that happen. The resonance of the sound vibrated, therefore causing my soda to do that action. Oh Boy do I have this feeling----I get A lot of ringing in my ears. Like elephants, whom emit a sound that human ears can't hear, I hear something that I can't explain. Sometimes the ringing in my ears is so loud, I pop my own ears. It helps but it is depressing. At night, I hear a HUM, can't get rid of it. I know UFO'S exist!!! I know there is something out there. We are not alone!! Cloudy Night--I haven't observed this phenomenon on a clear night. However, I feel stars were blocked by big objects non clear nights."],"Tags":"City","Date of the Event":"03/31/2012 03:30 UTC","Latitude":"36.458567","Date Submitted":"03/31/2012 04:51 UTC","Longitude":"-81.822436","Log Number":"US-03312012-0007","City":"Bristol or Johnson","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37031.html.txt","/var/www/straped/mufon/org/37031.html"],"Sighting Duration":"00:01:06","Summary":"An event that displays for months...the sky is changing...."}