{"Latitude":"38.807957","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Log Number":"US-03312012-0010","Object Features":"None","Longitude":"-122.558316","trends":["There have been no other sightings in Hidden Valley Lake","This sighting has never been favorited."],"Region":"California","Sighting Duration":"Undisclosed","City":"Hidden Valley Lake","files":["/var/www/straped/mufon/html2text/37037.html.txt","/var/www/straped/mufon/more/37037_submitter_file1__ufophotooct320096pmfacingwest01.jpg","/var/www/straped/mufon/more/37037_submitter_file2__ufophotooct320096pmfacingwest03.jpg","/var/www/straped/mufon/more/37037_submitter_file3__ufophotooct32009.jpg","/var/www/straped/mufon/org/37037.html"],"Object Shape":"Sphere","Weather Factors":"Unknown","Summary":"Misty White Sphere Like Object Ascending into Cloud Cover at Dusk","Date Submitted":"03/31/2012 01:53 UTC","Case Number":"37037","Tags":"City","Country":"United States","Date of the Event":"10/03/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.807957,+-122.558316(37037)&iwloc=A&hl=en\"> mufon case (37037) map </A>","divs":["Sighting DetailsOn October 3 2009, while admiring a beautiful sunset from our deck in HIdden Valley Lake, I decided to snap a few stills. The sky was absolutely clear of cloud formations except for one large single cloud bank over the moutains to the West. These moutains are right in the heart of the Geothermal emissions in Lake County, near the georhtermal poiwer plant set atop one of the highest hills. I took a series of 4 or 5 photos with perhpas a 2 - 3 second delay between each , due to autofocus and the common delay with digital cameras. I never viewed anything out of the ordinary when taking the shots and observed nothing with the naked eye. I headed back into the house with the intention of uplaoding the photos to my computer and noticed the first photo had a very prominant misty globe like sphere, not shown on any other photo. I was very excited at finding the object and showed it to my wife who's first thought was that it was the moon, however the moon was rising in the east and could only be viewed at about 45 degrees in the front of the house directly eastward. The cloud which appears in the photo was absoltely static for a good 20 minutes and then within a few minute span completely dissapated leaving a cloudless sky for the reaminder of the sunset. The interesting things to notice about the photo is the sharp detail of the trees and cloud formation compared to the misty globe like figure which has obvious motion blur towrads the cloud bank. I've had friends with photogrpahy experience take a look at it and it seems readily apparent its not a camera flash or reflection and is of a rather large size. Aside from what the camera captured in that 300th of a second frame , there was nothing viewable from the naked eye, no noise , no pet distrubances and nothing out of the ordinary except for the fast dissapation of the cloud 10 minutes after the photos were taken. A very exciting afternoon that has stuck with me the last 2.5 years and one of only 2 possible sightings Ive ever experienced in the area. the third photo shown is the picture with adobe effect applied to it which brings out some interesting charactersitics."],"Object Flight Path":"Straight-line path"}