{"Object Flight Path":"Unknown","Log Number":"US-03312012-0006","Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"03/31/2012 04:13 UTC","Latitude":"39.000362","Object Shape":"Oval","Country":"United States","City":"Zephyr Cove-Round Hill Village","Source":"MUFON","divs":["Sighting DetailsI was at Lake Tahoe with my husband and a couple of his friends in August of 2009, not positive of date. Camera had not had date set, so any dates in photo are incorrect. It was mid afternoon and we had been down at the water just passed Zephyr Cove on Hwy 50. I had taken several photo's I did not see object in the photo until recently, I was looking at some of my favorite photo's (I like to take picture with tree's, with both living and dead branches)and I noticed an odd image in this photo. I am posting the original photo as well as a cropped copy of the image alone. In the cropped image you can see what appears to be either an aura, heat, or some other form of emission generating from both top and bottom of photo. Being as I did not see the image when taking photo, I cannot say if or how it was moving. I am hoping someone can tell me what it is. Object is to the right of the branch i sky above the lake. Second photo is cropped close up of image in first photo. If you enlarge the photo's you can see, it is the same photo, and you can see the aura or whatever it is."],"Summary":"Took photo of Lake Tahoe through trees, noticed object after downloading to computer..","Sighting Duration":"Undisclosed","Region":"Nevada","Date of the Event":"08/18/2009 02:40 UTC","trends":["There have been no other sightings in Zephyr Cove-Round Hill Village","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/37030.html.txt","/var/www/straped/mufon/more/37030_submitter_file1__100_0893.JPG","/var/www/straped/mufon/more/37030_submitter_file2__100_0893.JPG","/var/www/straped/mufon/org/37030.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.000362,+-119.952569(37030)&iwloc=A&hl=en\"> mufon case (37030) map </A>","Viewing Distance":"501 Feet - 1 Mile, Unknown","Longitude":"-119.952569","Case Number":"37030"}