{"Source":"MUFON","Summary":"Large flaming object falling straight down and not as fast as a shooting star","Case Number":"37048","Log Number":"US-03312012-0017","files":["/var/www/straped/mufon/html2text/37048.html.txt","/var/www/straped/mufon/org/37048.html"],"Viewing Distance":"101-500 Feet","Latitude":"37.846173","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date Submitted":"03/31/2012 11:24 UTC","Date of the Event":"01/30/2012 12:00 UTC","Region":"Kentucky","trends":[],"divs":["Sighting DetailsAs a nurse, I always left work at approximently 7:30 PM to 7:40 PM. I would leave work on a narrow county road, through the hills. Rarely met another vehicle. This evening, it was dark, as usual and I just rounded a curve when I seen what I first thought was a shooting star. But this object was on fire and it was huge and descending slower than a star. I had always seen shooting star fall at an angle and so very fast, you barely got to observe it before it disappeared. This object was falling slower than a shooting star and the fire was bellowing from it. It looked like the flames were comeing from a cylinder shape, but I didn't actually see the cylinder. It was falling straight down, not at an angle. It fell behind a hill, so I lost sight of it. I heard no noise. I continued to drive, still wondering if this was a meteorite or what? I was telling my brother about it yesterday and he says we should go to the area and try to find the objest. I cannot climb the hills anymore, due to a bad knee. I can take someone to the area and point out where it was falling. This could have been a meteorite, but unlike anything I've ever seen. I didn't have a camera and there were no other vehicles around."],"Object Shape":"Fireball","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.846173,+-84.260418(37048)&iwloc=A&hl=en\"> mufon case (37048) map </A>","Longitude":"-84.260418","Tags":"City","City":"Undisclosed","Object Features":"Unknown","Weather Factors":"Unknown"}