{"Country":"United States","Object Flight Path":"Straight-line path","Log Number":"US-03312012-0016","trends":["There has been one other sighting in Fredericktown","There were no other sightings in Fredericktown on or around March 29th 2012"],"Object Shape":"Unknown","Object Features":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.559659,+-90.292824(37043)&iwloc=A&hl=en\"> mufon case (37043) map </A>","Date of the Event":"03/29/2012 08:19 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWent to step out my back door to enjoy a moment of a gorgeous evening when I looked up to see if there were any ufos. Too my complete shock there were a group of lights that ran perpendicular over the top of our 40 by 60 foot shop. It took a second to absorb the idea that it was even there. My response was..OMG OMG it's a ufo a Mother ship. There is NO way that is was anything else...I believe it was over 300', and with a good mathematician they could let me just how big it was....I tried getting a video and pictures but I was just so excited. Also tried calling my neighbor , no answer...ran to the house...but the HUGE ship was moving over the horizon. The whole thing lasted 7 to 10 minuted. My neighbor did see the lights I was pointing out to him but the angle of the string of lights was now down to one which at first he thought was a star then the light went out.. The lights on the craft, I could not see anything else , would with a pattern turn off and on...reminded me of a movie where the space ship is on cruse control with crusing lights on. Ran silent and was HUGE!!! move toward Ironton, MO and Belgrade, MO. to the NW of Roselle. MO."],"Longitude":"-90.292824","Date Submitted":"03/31/2012 07:33 UTC","Latitude":"37.559659","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37043.html.txt","/var/www/straped/mufon/org/37043.html"],"Summary":"HUGE invisable craft. w/ 7 to 9 lights that ran in a perpendicular, flashing off and on. Slilent...moving slowly.","Region":"Missouri","City":"Fredericktown","Source":"MUFON","Viewing Distance":"Over One Mile","Case Number":"37043","Disposition":"Unresolved"}