{"Disposition":"Unresolved","Country":"Bulgaria","Date of the Event":"03/31/2012 09:35 UTC","Viewing Distance":"Unknown","Longitude":"23.677651","Object Shape":"Sphere","Region":"Vraca","map":"<A HREF = \"http://maps.google.com/maps?q=43.797907,+23.677651(37042)&iwloc=A&hl=en\"> mufon case (37042) map </A>","Weather Factors":"Unknown","Case Number":"37042","Object Features":"None","Log Number":"BG-03312012-0015","Latitude":"43.797907","files":["/var/www/straped/mufon/html2text/37042.html.txt","/var/www/straped/mufon/more/37042_submitter_file1__IMG_0036.jpg","/var/www/straped/mufon/more/37042_submitter_file2__IMG_0042.jpg","/var/www/straped/mufon/more/37042_submitter_file3__IMG_0051.jpg","/var/www/straped/mufon/org/37042.html"],"City":"Kozloduy","divs":["Sighting DetailsI was smoking on the balcony of my flat. It was impossible not to notice several bright moving objects on the sky in front of me. My first suppose was it's artificial lights like \"chinese lanterns\". However it's doubtful bacause there is a mile-wide river (Danube) and miles of unsettled swampy land where objects flew from. Six or more bright orange circular moving spots. Objects moved smoothly from about NE to SW. They slightly changed group configuration and speed. No any noise was present. I didn't feel strange anyhow. Fortunately, I had my camera and tripod at hand and managed to make some photos. Unfortunately, camera automation set too long exposure. However the last visible object can be seen without motion blur. The objects left my viewfield due to its limitation by building walls. The last observed object stopped moving horizontally and rather began to draw away growing down."],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"03/31/2012 06:14 UTC","Tags":"City","Summary":"Six or more bright orange circular moving spots. Objects moved smoothly from about NE to SW.","trends":["There has been one other sighting in Kozloduy","There were no other sightings in Kozloduy on or around March 31st 2012","This sighting has never been favorited.",""],"Source":"MUFON"}