{"Weather Factors":"Unknown","Tags":"City","Longitude":"-115.345408","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around January 12th 2012","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/37044.html.txt","/var/www/straped/mufon/more/37044_submitter_file1__UFO11212205AM.jpg","/var/www/straped/mufon/org/37044.html"],"Object Shape":"Circle, Egg","Sighting Duration":"00:03:00","Object Flight Path":"Straight-line path","Date of the Event":"01/12/2012 02:05 UTC","Country":"United States","Case Number":"37044","divs":["sighting detailson 1\\12\\2012 at 2:05 a.m., i was in bed sleeping and i was awakened by a loud noise that lasted about 45 seconds. i then got up and looked out the window and saw the above-described object for about 1 minute across the street. then the object lifted up and went over the house in back and down where i lost sight of it. about 6:00 a.m. that morning 2 helicopters arrived about where i first heard the noise and hovered at about the same location where i heard the noise. then they turned and came east to where i saw the object and they then turned north and followed the same path as the object. my first reaction was that i was a little scared then that feeling went away and i just looked at the object in amazement. after the object left, i just stood at the foot of my bed wondering what to do next. i then decided to go back to bed and deal with what i saw later in the morning. note: see attachments. one is an image done by a friend. it is a photo of the house where i saw the object with a representation of the object superimposed on it. the second is a recent newspaper article about my sighting. and the third is a newspaper article about a fatal traffic accident that occurred the morning of 1\\12\\2012 at approximately the same time the object left my view and traveled in the direction where the accident occurred. can you please send a copy of this report and attachments to chuck weaver. i spoke with him a few days ago and he asked that i file this report and that he would get a copy. thank you,"],"City":"Las Vegas","Region":"Nevada","Latitude":"36.200064","Summary":"Heard loud noise then saw round-egg/domelike shaped object on ground for one minute then object lifted off.","Log Number":"US-03312012-0017","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.200064,+-115.345408(37044)&iwloc=A&hl=en\"> mufon case (37044) map </A>","Date Submitted":"03/31/2012 08:54 UTC","Object Features":"Dome","Source":"MUFON","Viewing Distance":"21-100 Feet"}