{"Disposition":"Unresolved","Country":"United States","Date of the Event":"06/15/1983 09:30 UTC","Longitude":"-81.374646","Weather Factors":"Unknown","divs":["Sighting DetailsIt was approximately 9:30pm eastern time in central Florida. I was 10 years old, and my family was returning home, Winter Park, FL, after visiting family in Tampa. My Father was driving and my one brother and two sisters were in the car as well. I was sitting in the back seat looking at the stars. The sky was completely clear and I could see the stars very well. We were outside of any major city, so there were no nearby city lights to disrupt vision. One of the times I looked up I noticed a very bright light that was jumping up and down, and side to side, staying within a specific range of movement. The light was a circle and definitely much brighter than the stars or even Venus or Jupiter. It was brighter and larger than a typical passenger plane coming in for a landing. It seemed to have a center point which its pattern of movement was centered around. It would move up from that center point then return. It kept 'jumping' up, down, and to each side, left and right of the center point. But it would always return to the center point after each movement before making another move. Also, the bursts of movements were always the exact same distance from the center point, and always a straight line, no matter which direction it moved. After watching it for about 10 minutes, I told my Father to look at it. My Father is a very intelligent gentleman who served 7 years in the army as a computer technision. He was quite amazed as I was, and we pulled over on the side of the freeway and all of us sat in the car watching this light for about 30 minutes. It never changed its location in the sky and it never went away. It just kept making quick bursts of straight line movements from its center point. Also, it always moved in one of four directions... straight up, straight down, straight to the left, or straight to the right. And it would usually pause for a few seconds at its center point before making another movement in one of the four directions. The movements were also very fast, almost as if it were jumping to each point. It was probably within a 5 mile distance from us and I would say probably about 10,000 feet up. It wasn't real high above us. It was more like out to our side, low in the sky. Also, the movements were short distances from the center point. Maybe 500 to 1000 feet. It never went away and we finally drove home. My Father smiled and said, \"It's things like that, that make you wonder what else is out there.\" It was something I will never forget, and I thought I would share it with MUFON. Thanks for taking the time to read this. Good luck with your research. I truely believe that there is definitely intelligent life throughout our incredibly large universe. Mr. Trevor Tompkins"],"Viewing Distance":"Over One Mile","Sighting Duration":"01:00:00","Tags":"City","City":"Orlando","Date Submitted":"03/31/2012 11:32 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/37049.html.txt","/var/www/straped/mufon/org/37049.html"],"Latitude":"28.540226","Summary":"Bright light that constantly shifted direction within one area of the sky.","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around June 15th 1983"],"Case Number":"37049","map":"<A HREF = \"http://maps.google.com/maps?q=28.540226,+-81.374646(37049)&iwloc=A&hl=en\"> mufon case (37049) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Log Number":"US-03312012-0018","Region":"Florida","Object Shape":"Circle, Sphere"}