{"Viewing Distance":"N/A","Longitude":"-74.364591","divs":["Sighting DetailsI went online to ufo webcams on March 29 at approx. 8:45pm. I saw a streak of light over the buildings that looked different. I do not go to ufo webcams often so by no means am an expert of how things looked. I saved a picture of the streak of light. I watched it for a while. At around 9:30pm, I went back online and checked the webcam and the streak of light was now exiting the screen. I took another picture. I again watched for a while. I once again checked the webcam again at around 10 pm and this time I was shocked to see a line of round lights. I have no clue if webcam pictures are useful, acturate or even analyzable ( if that is a word); however, these lights were so intresting I wanted to share them. Oddly, ufo webcam site as no address to send the pictures you save. So I decided to send them here. I was online when I saw the objects. Webcam does not alow for motion, can only reset to refresh image. I felt intrigued and curious during the observation. Finaly I refreshed once and the lights were gone."],"Log Number":"US-03312012-0014","files":["/var/www/straped/mufon/html2text/37041.html.txt","/var/www/straped/mufon/more/37041_submitter_file1__brigantine2.jpg","/var/www/straped/mufon/more/37041_submitter_file2__brigantine_3.jpg","/var/www/straped/mufon/more/37041_submitter_file3__Picture1.jpg","/var/www/straped/mufon/org/37041.html"],"Summary":"lights in sky on brigantine nj webcam","Object Flight Path":"N/A","Case Number":"37041","Country":"United States","Disposition":"Unresolved","Object Shape":"Circle, Other","Date Submitted":"03/31/2012 06:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.410117,+-74.364591(37041)&iwloc=A&hl=en\"> mufon case (37041) map </A>","Latitude":"39.410117","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Brigantine","There were no other sightings in Brigantine on or around March 29th 2012","This sighting has never been favorited.",""],"Tags":"City","Region":"New Jersey","Object Features":"Unknown","Weather Factors":"Unknown","City":"Brigantine","Date of the Event":"03/29/2012 09:30 UTC","Source":"MUFON"}