{"Case Number":"37055","divs":["Sighting DetailsOn thursday I was getting ready for bed when I say a fire type light from my back patio window. I went outside to see what it was. I was looking at a redish orange glow being distorted by clouds. I was trying to rationalize the event and said well maybe we have a red moon tonight for some reason. I was tired and just watched it for a while. I thought several times to go and get my camera, but knew that the battery would be low from earlier use with my kids. I kept convincing myself that it was a strange moon. The next day I was talking with an uncle and he said that we only had a quarter moon last night. I could have kicked myself. I realized that this was definatly not the moon. I really got suspicious the following day when I heard helicopters over my home. I went outside because they kept flying over. The helicopter was drab green with no markings. I was further surprised to see paratroopers doing loww jumps out of the back of the helicopter (long duel rotor). I ran inside and retrieved my camera snd staerted filming. I saw parachutes opening behind the trees. I had to pick up my kid from school so I stopped filming. I drove around the area that I thought the landed in and did not see them. I at this time stopped and left the area. I have never seen military trainnig in this area. I thought to myself is the series of the past two days coincidence or something else."],"Date Submitted":"04/01/2012 12:39 UTC","Weather Factors":"Unknown","Sighting Duration":"00:10:00","Latitude":"38.482704","Object Flight Path":"Straight-line path","trends":["There have been 17 other sightings in Ashland","There was one other sighting in Ashland on or around March 28th 2012","This sighting has never been favorited.",""],"Summary":"firey ball of light( I thought it was a harvest moon distorted by clouds","City":"Ashland","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Circle, Fireball, Sphere","Disposition":"Unresolved","Country":"United States","Log Number":"US-04012012-0005","Longitude":"-82.633039","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/37055.html.txt","/var/www/straped/mufon/more/37055_submitter_file1__mili33012167.JPG","/var/www/straped/mufon/more/37055_submitter_file2__mili33012165.JPG","/var/www/straped/mufon/org/37055.html"],"Object Features":"None","Tags":"City","Date of the Event":"03/28/2012 11:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.482704,+-82.633039(37055)&iwloc=A&hl=en\"> mufon case (37055) map </A>"}