{"Case Number":"37052","Object Flight Path":"Hovering then path","City":"Pike Creek","Region":"Pennsylvania","Longitude":"-75.706332","Summary":"very large craft and contact with life from within","Source":"MUFON","Date Submitted":"04/01/2012 01:57 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.736684,+-75.706332(37052)&iwloc=A&hl=en\"> mufon case (37052) map </A>","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/37052.html.txt","/var/www/straped/mufon/org/37052.html"],"trends":["There have been no other sightings in Pike Creek","This sighting has been favorited 4 times."],"Date of the Event":"09/13/2003 12:00 UTC","Weather Factors":"Unknown","Latitude":"39.736684","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Patterned Surface, Appendage(s), Louvres","Object Shape":"Unknown","divs":["Sighting Detailsi was on the pa turn pike and pulled off on the first rest and refreshment stop and got out of my car and i wondered what all of the noise i was hearing was about! after looking up at the direction the noise was coming from i saw what i thought was a train because it seemed to be one of those trains that have over 100 cars and very long but covered by fog but i could see large parts of it clearly. the time at this point is about 905pm just then a small person seem to just appeared and he told me he was the FBI i needed to come with him and i believe i refused and he said he would force me to if necessary and the next thing i know i am on the ship. one thing i can recall clearly is when they copied all of my memory's i was feeling violated and if you will raped mentally. the next thing i know i am back in my car in the driver seat and awake and the time now is 1030pm. i started the car and felt the need to get the hell out of here! however i did not know why at the time, i felt very very confused and nervous when i drove away from the area."],"Country":"United States","Log Number":"US-04012012-0002"}