{"Summary":"White orb turned in HUGE black triangle (blacker than black) with red lights on each corner.","Date Submitted":"04/01/2012 01:25 UTC","Source":"MUFON","City":"Goleta","Object Shape":"Sphere, Star-like, Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.441999,+-119.825089(37057)&iwloc=A&hl=en\"> mufon case (37057) map </A>","Viewing Distance":"101-500 Feet, Over 1 Mile","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-119.825089","Country":"United States","Disposition":"Unresolved","Case Number":"37057","divs":["Sighting DetailsIn Nov. of 1989 I was driving sober south bound on hwy 101 in Goleta CA just past Patterson overpass at about 9:45PM when I saw a very bright white orb over Santa Barbara about 10 miles away. It was moving VERY fast towards my direction along and over the freeway. I knew this was an orb ufo, as I have seen them before. It was too bright and went much too fast to be any known aircraft. It then stopped over Turnpike overpass and turned into a huge black triangle with red lights at each corner (as I later saw as I got under it) and then moved towards the ocean. From the side it looked like a long, black line as it had no thickness to speak of. I got off at Turnpike and got right under it, stuck my head out the window and got a good look at it as it slowly moved towards the ocean. It was very black. It looked like a void of blackness, unlike any black surface. The red lights at each corner did not reflect any light off the bottom of that blackness, as they should. I thought it was some sort of a space gate that may have been scanning the area. I don't know, but I could not call that blackness an object, it was void of mass. Likewise, the ambient light from the city light should have reflected at least something, but it did not. I do TV lighting so I know this stuff. I followed it with my car, as it moved at a constant speed of about 4 mph and spun very, very slowly from it's axis as it faced the ground. I stopped my car again, turned it off this time, and looked out the window at it. I felt safer to stay in my car. It made no sound. It was at least 2,000 feet long and 500 feet off the ground, above me. It filled much of the sky as I looked straight up at it. At least 2 other people in cars stopped and watched it too. One was a cop in a police car. We all had eye contact with each other and made gestures of disbelief to each other as we looked up at it and back to each other. As a joke, I made a gesture with my hand that the cop should shoot at it, but he was not amused and looked disturbed. We were all disturbed. Although I have have seen orbs before, those are cute, but this big black thing looked wicked evil. It passed over San Marcos High School and covered 90% of the school, it was HUGE. Those cars later moved on, but I later followed it as it descended into a large open space known as Mora Mesa, into the darkness beyond my sight, so I left. 5 minutes later I told a friend about it, and then we saw a white orbs from his house that went straight up and out. I soon later saw another orb that went over the mountains but my friend missed that one. It was about 10:15pm and that was that. FYI: I think I reported this sighting with NUFORC but I don't see it there. But this time I made a picture, it looks exactly like what I saw. ss"],"Weather Factors":"Unknown","Object Features":"Other, Unknown","Date of the Event":"11/01/1989 09:45 UTC","trends":["There have been 7 other sightings in Goleta","There were no other sightings in Goleta on or around November 1st 1989","This sighting has never been favorited.",""],"Region":"California","Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-04012012-0007","files":["/var/www/straped/mufon/html2text/37057.html.txt","/var/www/straped/mufon/more/37057_submitter_file1__blacktriangle-blackerthanblack.png","/var/www/straped/mufon/org/37057.html"],"Latitude":"34.441999"}