{"Latitude":"28.625453","trends":["There have been 9 other sightings in Titusville","There were no other sightings in Titusville on or around April 1st 2012"],"Object Features":"None, Unknown","Log Number":"US-04012012-0003","divs":["Sighting DetailsIt was about 2:29 am on April 1st. I went out on my back pporch for a smoke and was trying to identify some stars and constellations from memory. Out over the Salt Lake Wildlife Management Area I saw a bright light appear, bright like a shooting star, but flying at what appeared to be a constant altitude. It flew from over the forest to the west, over South Lake, and directly overhead. At about 40 degrees above the east horizon it suddenly disapppeared. The duration of the flight was around 30 seconds, and I estimate the distance traveled to be about 8 miles. I spend a great deal of time hunting fshing and ccamping in that W.M.A. and know this landscape day or night, so my estimation of the distance is approximate. My house sits at the top of a hill overlooking South Lke and the Salt Lake WMA, so the path of the flight was completely unobstructed from view. When fist observed it appeared to be about the size of a bb. As it traveled towards me it grew in size to what appeared the size of a basketball, and then reduced again in size as it proceeded east and then disappeared. Although it was extremely brilliant LIKE a shooting star, it was traveling much too slow, was at what seemed to be a constant altitude, and when passing overhead appeared to be just a brilliant white solid ball. I have no idea of the actual altitude or size of the object, but from where I was able to see it when it appeared from my location, as an educated guess I would say around a thousand feet. The terms \"bb + basketball\" refer how they appeared to me visually from my location."],"City":"Titusville","Region":"Florida","Sighting Duration":"00:00:30","Date of the Event":"04/01/2012 02:29 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Country":"United States","Summary":"Apppeared over forestt to west, extremey bright, crossed above lake and directly overhead","Case Number":"37053","Date Submitted":"04/01/2012 03:20 UTC","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/37053.html.txt","/var/www/straped/mufon/org/37053.html"],"Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.625453,+-80.845082(37053)&iwloc=A&hl=en\"> mufon case (37053) map </A>","Longitude":"-80.845082"}