{"Weather Factors":"Unknown","Summary":"speeding UFO, hovered and lit up like christmas","Viewing Distance":"101-500 Feet","Region":"Virginia","Longitude":"-77.26275","files":["/var/www/straped/mufon/html2text/37063.html.txt","/var/www/straped/mufon/org/37063.html"],"Disposition":"Unresolved","Case Number":"37063","Log Number":"US-04012012-0013","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.801147,+-77.26275(37063)&iwloc=A&hl=en\"> mufon case (37063) map </A>","Tags":"City","divs":["sighting detailsas i was driving south on 7100 from fairfax city towards burke, va, i saw a flying vehicle moving faster than i thought it should be moving at its altitude. it was near dark, but there was just a bit of dusk left. the vehicle was pretty high in the air, but not sure how high. we have at least 2 airports in the area so i've seen hundreds on approach. when i pointed it out to my wife i pointed out that it had a single light instead of the faa required suite of lights. she watched it and told me that the light went out. as we got to the bridge over braddock rd. she looked to the right (west) and yelled that it was hovering now. i looked over and it had reached a very low altitude. it had to be 300-400 feet off the deck. it was cylindrical disk shaped. as we drove past, about a 1\\4 mile i looked in my side mirror to see if i could see it and i saw that it was moving slowly across 7100 to a popular soccer field, which was packed with players. the whole ship was flashing multiple lights in random order. it was a fantastic display, but i was out of eye-shot before i could see where it went. when we turned around to see if we could find the ship and it's path, we could no longer see it. the forests are starting to fill in and the trees are quite tall, so seeing distances in the sky is next to impossible."],"Latitude":"38.801147","Date of the Event":"03/29/2012 08:20 UTC","City":"Burke","Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"04/01/2012 10:18 UTC","Object Features":"Unknown","trends":["There have been 2 other sightings in Burke","There were no other sightings in Burke on or around March 29th 2012"],"Object Shape":"Cylinder, Disc","Country":"United States","Source":"MUFON"}