{"Country":"United States","Date of the Event":"03/29/2012 01:15 UTC","Tags":"City","Log Number":"US-04012012-0010","Weather Factors":"Unknown","Latitude":"39.610462","Case Number":"37060","Longitude":"-82.203507","Object Shape":"Sphere","Summary":"2 orbs of light displayed breath-taking manuevers every so often and was tracking about due west in staggered formation.","divs":["Sighting DetailsFirst off i am former army recon with the 1rst cavalry and i know beyond a shadow of a doubt these were definitely not of this world. It was about 12:30 when i went out into my yard for some fresh air on this exceptionally clear night, not a cloud. I made it about 15 paces into my yard before a light(bright and flickering so many colors so very fast) caught my very sharp and well trained eyes.I am familiar with everything that flies, rolls, or is fired. This object tracked very slowly about due west about 200'-300' about the ridge witch i estimate at roughly 1 kilometer from my position. I studied this thing in complete awe, full knowing where this this DID NOT come from at least, for about 15 mins before i pulled out my bright LED flashlight. I blinked the morse code signal for S.O.S 2 times directly at it and it stopped briefly before dimming as it descended(as if it let up on the throttle and killed some power to descend) the it got bright with red on the bottom and shot up about 200' in about 2 secs as it do so it dimmed back to its normal luminosity(as if burning power off as it rose). It eventually track too far west to be seen from my angle. So of course i start looking hard for any more activity and actually to my surprise, i indeed seen another, this one much closer slightly obscured be trees. I got to a better vantage point and flashed sos and included the numbers 1-9 interpreted through flashing my light. Indeed it seemed to respond by flashing so bright it must have been pointing directly at me and my brother(indeed at times it seems to use a separate yet from the same source, light witch did not produce a beam but was like looking at a spot lot shined right at your face). I continued with my light trying different things to grab its attention as it gradually dimmed completely out then back again 3 times before continuing due west staggered behind and right to the other object by about 1kl. by 1kl(back and right) until it tracked so far west i could not make it out, it just pin-pointed out of my vision. On a final note, i called some of my friends and 2 of them witnessed the same event witch exactly corresponded with my angle and time!!! I believe this is going to be the year of a forced disclosure, hows them apples congress!"],"Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Ohio","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Disposition":"Unresolved","City":"Shawnee","map":"<A HREF = \"http://maps.google.com/maps?q=39.610462,+-82.203507(37060)&iwloc=A&hl=en\"> mufon case (37060) map </A>","trends":["There has been one other sighting in Shawnee","There were no other sightings in Shawnee on or around March 29th 2012"],"Date Submitted":"04/01/2012 03:08 UTC","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/37060.html.txt","/var/www/straped/mufon/org/37060.html"]}