{"Source":"MUFON","Country":"United States","Case Number":"37069","Latitude":"40.299237","Date of the Event":"04/01/2012 12:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.299237,+-80.152279(37069)&iwloc=A&hl=en\"> mufon case (37069) map </A>","Date Submitted":"04/02/2012 02:40 UTC","Object Flight Path":"Unknown","divs":["Sighting DetailsDriving back from Pittsburgh to Morgantown, WV on April 1st, 2012 at roughly 1-1:20 am, a bright, pulsating light was observed in the clouds west of I-79 roughly around Mile Marker 36. It had been raining that evening, so when I first saw the lights, I assumed it was lightening and thought nothing else of it. My friend, who I was riding with mentioned it, and I looked again. This time I noticed that the light was consistently pulsating a brilliant reddish-orange, like you would see with a forest fire at night. Just the amount of light would indicate that had it been a fire, it would have been of massive proportion and would have been reported on the news by today, not to mention it had been raining most of the day. We watched the light as we continued travelling southbound, for at least 6-7 miles, discussing what it could have been. The light stayed stationary as we drove past, still glowing brightly behind us. I've never seen anything like this before on a drive back from Pittsburgh at night, and if there's some kind of logical explanation, I'd like to know, but I can't find a single thing."],"files":["/var/www/straped/mufon/html2text/37069.html.txt","/var/www/straped/mufon/org/37069.html"],"Log Number":"US-04022012-0002","trends":["There have been no other sightings in Hendersonville","This sighting has never been favorited."],"Disposition":"Unresolved","Weather Factors":"Unknown","Region":"Pennsylvania","City":"Hendersonville","Summary":"Brilliant, pulsating light observed from vehicle in southwestern pennsylvania.","Longitude":"-80.152279","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Object Features":"Unknown","Viewing Distance":"Over One Mile"}