{"trends":["There have been 8 other sightings in Copperas Cove","There were no other sightings in Copperas Cove on or around March 31st 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Latitude":"31.095216","Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-97.929437","Source":"MUFON","Date of the Event":"03/31/2012 12:00 UTC","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.095216,+-97.929437(37079)&iwloc=A&hl=en\"> mufon case (37079) map </A>","Case Number":"37079","Region":"Texas","Date Submitted":"04/02/2012 06:15 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37079.html.txt","/var/www/straped/mufon/org/37079.html"],"divs":["Sighting Details How do you know if you were dreaming or taken? I'm almost afraid to ask.... do I want to know? I feel it in my body but my mind wont let me think it's true. Here is what I felt. Just before I fell asleep, I heard a ringing in my left ear, it startled me into full awareness. I totally woke up, I don't know why. It took me a while to fall back to sleep. I think this is because I read that this happens sometimes when people are taken.... so, could it of been a dream? My mind thinking about it? After falling asleep, I felt like I woke up but couldn't move.. I forced my eyes open and standing in my bathroom, in my line of vision was---- a grey I think. short, thin, large head, black almond eyes, large eyes and I could see another in my peripheral vision. The one in the door of my bathroom, it almost seemed like he was in charge... he was still and silent, very small movements... a light sway here and there. He was intense, but I had the feeling he was friendly. He didn't scare me, but I felt he was the one that was controlling my not being able to move. I have the feeling he was the one that made me feel calm and after I panicked and became afraid, I think he is the one that gave me the feeling of euphoria. He was in the shadows but I remember him clearly. I was surprised that he was so short, maybe slightly taller than my door-nob I think. As I was laying down, I didn't have to look up to see him clearly. I quickly closed my eyes and told myself I was dreaming. I don't know how long I stayed like that, it felt like only a minute. It was like I could hear them thinking. The second one, he moved quickly. He is the one that frightened me, he is the one that has the sing-song voice. I thought he was singing in my mind, I don't know what he was looking for but I do know he was going through my stuff... I only remember one thing of what he said, but I don't know what he ment by it, I remember hearing the words or impression of \"bad baby\". and that disturbed me. Last september, I went through a 4 or 5 day period of time... I knew I was pregnant.... I knew it. When I was laying down and I rolled over, I felt the sharp painful pull of the muscle holding my uterus.... sounds funny, but I only had that when I was pregnant and the weight of the baby made the muscle pull, it started in my pregnancies at about the 5th or 6th week and always got worse the bigger the baby grew. I also had a heaviness or a fullness in my uterus. I kept talking myself out of it, I finally got around to taking a test and it came up negative, but I could of sworn I was pregnant. After talking with a friend and putting a few time lines together, I think they impregnated me. My friend said it usually only last 3 - 5 days. I was happy I wasn't crazy and sad because I don't know if I will ever meet my child, is it my child? I carried him, so I feel like it's my child, even if it was only for a couple of days. Anyways back to last night. when he said \"bad baby\" it upset me because I thought that maybe something was wrong with my baby. At this point, I still feel like I cant move. I didn't want to see them so I closed my eyes. That's when I got the weirdest sensation, I was floating, rotating around above my bed. I was scared this whole time and yet not scared or maybe just this feeling of calm, this deep, deep sense of calm. As I was floating--- how do I explain this--- you know what the pressure you feel when your lying down, that softness of your bed when your really, really tired and it feels so soft and comforting and solid? That's how I felt all around my body. This soft wonderful pressure surrounding me and it was nice. I felt no breeze as I floated but I could feel the sensation of turning. Then I was back in my bed, I was more aware again and thinking of \"bad baby\" and then I heard a moan and thought it was one of my girls. I felt an intense protectiveness and became upset. I wanted to protect her but I couldn't move. I felt an intense fear came over me. I told them no--- or thought the words, it was like I could hear them with no noise. I felt panicked, then suddenly I got this rush of euphoria. I was covered in it. I could feel it everywhere in my body, I tingled with it, I could feel myself smiling, even laughing in my head. It was wonderful. Then it was like the \"heaviness\" that surrounded me left, but I felt so good I didn't want to move or it would go away. My body felt heavy but my mind told me to move, so I started with my hands and as I wiggled my fingers I felt the euphoria leaving my body, going up towards my face, which still tingled. When I stood up I felt unsteady and a heaviness in my limbs, but I still went to check the girls. They were all sleeping. I tried to go back to bed, but I felt surreal and when I just lay there I started to cry. I don't know what to feel, I don't know what to think, I don't know if it was a dream or if it was real. So I decided to write it all down on my computer, but when I turned on my computer, it made a series of low tone, loud buzzing noises, twice in a row. I've never heard it before. I'm really tired now so I think I'm going to go back to bed. I don't know if I like this. I feel a little fear to go back to sleep and that's stupid, if it wasn't a dream... they wouldn't come back again... and yet at the same time I don't feel fear... I think because I believe that no matter what, I am God's child and He is watching over me and because He is God, they were created by Him too.... Weird. I do know that I have that image etched into my mind... of him standing in my bathroom doorway just looking at me... dream or real... I wont forget that."],"Object Flight Path":"Unknown","Summary":"Visitation","Log Number":"US-04022012-0012","Viewing Distance":"Unknown","Tags":"City","Country":"United States","City":"Copperas Cove"}