{"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.087902,+-76.522146(37074)&iwloc=A&hl=en\"> mufon case (37074) map </A>","divs":["Sighting DetailsWas taking my dog out to relieve herself at 6 AM in my back yard. My yard is on a flight path to the airport (BWI) so we see planes all the time. I looked upward to the east and at about halfway up the sky and saw a white blinking light moving quickly across the sky heading to the northeast. When I first saw it, it maybe was slightly smaller than an aspirin held at arm's length. It was blinking slightly more than once a second. I really didn't think much of it and assumed it was a high flying moving quickly across the sky. After watching it for about ten seconds, it appeared to jump from one spot in the sky to another about an inch away. I watched as it continued flying mostly in a straight line till it flew by my line of vision past the tree line by my home. Through the trees it appeared to jump twice more (each jump was smaller than the first one). I lost sight of it through the trees after about a few more seconds. The total time I saw it was about a minute or so (no more than two minutes). I had already had my shower and was fully awake when this occurred. I am not 100% sure that my eyes weren't playing tricks on me, the trees were swaying slightly due to the wind, but I figured I should report it just in case someone else saw it. Note the first jump occurred before the light hit the tree line."],"Object Features":"Unknown","Latitude":"39.087902","Object Flight Path":"Path with directional change","City":"Pasadena","Log Number":"US-04022012-0007","Date of the Event":"04/02/2012 06:05 UTC","Case Number":"37074","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37074.html.txt","/var/www/straped/mufon/org/37074.html"],"Longitude":"-76.522146","Region":"Maryland","Date Submitted":"04/02/2012 12:24 UTC","Source":"MUFON","Object Shape":"Unknown","Summary":"Saw a blinking light jump in position several times in Pasadena MD","trends":["There have been 8 other sightings in Pasadena","There were no other sightings in Pasadena on or around April 2nd 2012"],"Tags":"City","Sighting Duration":"Undisclosed"}