{"Object Flight Path":"Straight-line path","Source":"MUFON","Region":"Georgia","Viewing Distance":"Over One Mile","Country":"United States","Object Features":"Unknown","Date Submitted":"08/26/2003 06:00 UTC","Sighting Duration":"00:00:25","Tags":"City","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/3707.html.txt","/var/www/straped/mufon/more/3707_submitter_file1__Sketch.jpg","/var/www/straped/mufon/org/3707.html"],"Latitude":"34.121044","Summary":"Cigar/Cylindrical Object flying over House","Log Number":"US-08072005-0001","Longitude":"-83.563718","map":"<A HREF = \"http://maps.google.com/maps?q=34.121044,+-83.563718(3707)&iwloc=A&hl=en\"> mufon case (3707) map </A>","trends":["There have been 2 other sightings in Jefferson","There were no other sightings in Jefferson on or around August 26th 2003","This sighting has never been favorited.",""],"divs":["sighting detailsabout 6:00pm on the afternoon of august 26, 2003, i took my dogs in the back yard. i heard a small plance low and close. i looked up as the plane came over the trees. at this time i heard another small plane. i walked to the edge of the porce and looked over the roof at the plane. as i looked at the second plane, i noticed a shiney object shaped like cylinders. there were two cylinders. they were even in length and size and there appeared to be space between them. from my view, it looked as if they may have been connected by something that was not as long as the two cylinders and from my point of view, the center conenction was darker. the cylinders were at a banked angle which made the center connection unclear. as i watched for approximately 20 seconds, there was a burst of a very bright light as from a flood light. the bright light was about the size of a quarter at arms length and the two cylinders were 1\" to 1 1\\4\" aal. after the flash, the craft continued on until out of sight. it was lower and slower than a commercial arliner. the object was going south west."],"Weather Factors":"None","Case Number":"3707","Date of the Event":"08/26/2003 06:00 UTC","City":"Jefferson","Object Shape":"Cylinder"}