{"City":"Youngstown","Log Number":"US-04022012-0014","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Region":"Ohio","Date of the Event":"04/02/2012 09:15 UTC","Object Features":"Appendage(s)","Viewing Distance":"101-500 Feet","Country":"United States","Weather Factors":"Unknown","trends":["There have been 16 other sightings in Youngstown","There were no other sightings in Youngstown on or around April 2nd 2012"],"files":["/var/www/straped/mufon/html2text/37082.html.txt","/var/www/straped/mufon/org/37082.html"],"divs":["sighting detailsi went outside around 9:10pm est to lock my car and saw a row of orange colored lights on a structured object heading from north to south. this being the opposite direction of normal air traffic we see here. the object was low over the houses and was moving rather slowly. at first the object was not blinking any kind of lights just glowing a light orange hue. when i grabbed my camcorder out of my car and focused on the object and it was making little if any noise. i heard nothing at first which was strange as a cessna or any other airplane would be audible. the formation of lights is what is most peculiar about this footage as it doesnt look the standard conventional aircraft light formation. the object looks like a triangle upright and the flashes of purple\\blue and one red light are very random. the red flash appears to be so far removed from the object itself and doesnt coincide with being on an airplane wingtip. i do not believe this to be of alien in origin, however not totally ruling out the possiblity.i do believe it is a military spy drone from wright patterson airforce base and we are under surveillance."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.10431,+-80.644199(37082)&iwloc=A&hl=en\"> mufon case (37082) map </A>","Tags":"City","Latitude":"41.10431","Case Number":"37082","Sighting Duration":"00:02:00","Source":"MUFON","Date Submitted":"04/02/2012 10:13 UTC","Summary":"UFO Or Military Spy Drone April 2 2012 Ohio","Longitude":"-80.644199","Object Shape":"Triangle"}