{"Tags":"City","divs":["sighting detailsme and one other person were chatting outside jefferson college in arnold and i pointed to a satellite i usually see most nights from my backyard, then to the right we noticed a very unusually large off white\\yellow light moving real slow in the clear open sky. it was night about 7:45 or so and there was plenty of open sky in all directions around this thing. it was shaped almost rectangular only it didn't have sharp corners. we looked back at each other and i said is that a meteor or comet or something but it had no tail like meteors and comets. boy if that would of been a meteor it would of for sure wiped out missouri!!! only 10-15 seconds probably went by and i looked back for it and it was gone!!!! the guy i was talking with was freakin and so was i. i finally seen it for myself, yes!!!!! i wonder who else got a glimpse of this? i wish i had some kind of video, cuz i cant even explain how big this light was and how close it was to us. hopefully whoever else comes forward will have some footage, cuz im not really sure about how long it had been there before we noticed it. thanks"],"Longitude":"-90.372319","Case Number":"37085","Weather Factors":"Unknown","Source":"MUFON","Region":"Missouri","Viewing Distance":"Unknown","Object Features":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/37085.html.txt","/var/www/straped/mufon/org/37085.html"],"Sighting Duration":"Undisclosed","Summary":"very unusually large light in clear sky then dissappeared","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"04/02/2012 07:45 UTC","Date Submitted":"04/02/2012 10:54 UTC","City":"Arnold","Object Shape":"Square, Rectagular","Log Number":"US-04022012-0017","trends":["There have been 7 other sightings in Arnold","There was one other sighting in Arnold on or around April 2nd 2012"],"Latitude":"38.435012","map":"<A HREF = \"http://maps.google.com/maps?q=38.435012,+-90.372319(37085)&iwloc=A&hl=en\"> mufon case (37085) map </A>","Disposition":"Unresolved"}