{"Log Number":"US-04022012-0013","Summary":"looked like a meteor that was almost \"squared off\" in the corners, had one pulsating light","divs":["Sighting DetailsI was walking along Bayshore Blvd. in Tampa, FL on the night of March 27, 2012 at about 8:45 pm. I was looking at a tall building on the waterside when I first notices a bright amber light moving toward me, from northwest to southeast at an unknown altitude that was not much higher than the height of the building, maybe a bit more than 500 feet. The light made no sounds, had no other pulsating or strobe lights on it, and was moving at a relatively slow speed. It then disappeared from view in an instant, and after seeing this I knew that it was not any plane or other aircraft that I had seen before. I searched for it in the sky for a moment and then kept walking on. About a minute later, I was looking up in the direction that it had come from, trying to make sense of what I has seen, when I noticed an object moving along the same trajectory as the first, this time with no amber light. The object looked like a rectangular meteor, was dark grey, and was tumbling end-over-end. It made no noise and had a pulsating light on one side that I saw as it tumbled overhead. It was about at the same altitude as the first object, and was moving at the same speed. I tried to take video of it with my iPhone, but it was too dark to pick up the object because of its color. The object continued to move slowly and I was able to observe it for about a minute as it went directly over my head and continued southeast over Tampa Bay and in the direction of MacDill Air Force Base. My girlfriend was walking with me and she also observed it and was unable to identify either object."],"files":["/var/www/straped/mufon/html2text/37080.html.txt","/var/www/straped/mufon/org/37080.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Object Features":"None","Source":"MUFON","City":"Tampa","trends":["There have been 105 other sightings in Tampa","There was one other sighting in Tampa on or around March 27th 2012"],"Date Submitted":"04/02/2012 07:30 UTC","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.954185,+-82.451028(37080)&iwloc=A&hl=en\"> mufon case (37080) map </A>","Object Shape":"Square, Rectagular","Latitude":"27.954185","Country":"United States","Longitude":"-82.451028","Weather Factors":"Unknown","Region":"Florida","Case Number":"37080","Date of the Event":"03/27/2012 08:45 UTC"}