{"Country":"United States","divs":["sighting detailsme and another person were standing outside of jefferson college in arnold, missouri. i pointed out the satellite that i see most nights from my backyard and mentioned how you can see a faint blinking of red and blue lights. to our right we noticed a very large yellowish\\off-white lighted object. it was rectangular in shape only it didn't have sharp corners. it wasn't too high and it wasn't too far. it was a clear night and there was plenty of distance around it in every direction of empty sky. it was very slowly moving in a straight line. we looked at each other and tried to figure out if it could be a comet or meteor but we concluded that the object had no tail like a meteor would have. maybe 10-15 seconds went by, i looked back up and it was gone!!!! it was just gone. we freaked!!! the only reference i can give to explain the size and shape of it is the size of a cigarette butt if you are holding in in front of you--that big only in the freakin sky!!! it was amazing. i hope others seen it and perhaps got some footage cuz i would really love to see it. i don't know how long it was there before we noticed it. i have waited forever to see evidence for myself and this was real. i have always believed, but i just needed to see. thanks"],"Date Submitted":"04/03/2012 12:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.435982,+-90.370689(37087)&iwloc=A&hl=en\"> mufon case (37087) map </A>","Date of the Event":"04/02/2012 07:45 UTC","Latitude":"38.435982","Summary":"low and unusually large off-white yellowish light slowly moving in clear sky, then disappeared","City":"Arnold","Log Number":"US-04032012-0001","Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/37087.html.txt","/var/www/straped/mufon/org/37087.html"],"Object Shape":"Square, Rectagular","Case Number":"37087","Tags":"City","Weather Factors":"Unknown","trends":["There have been 7 other sightings in Arnold","There was one other sighting in Arnold on or around April 2nd 2012"],"Region":"Missouri","Source":"MUFON","Longitude":"-90.370689","Object Features":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unresolved"}