{"Weather Factors":"Unknown","Object Shape":"Oval","divs":["Sighting DetailsI was photographing the near conjunction of Venus and the Pleiades. I was using a Nikon D7000 with a 18-105mm lens on a tripod. The exposures ranged from 3 to 15 sec at f11 with an ISO of 6400. In the 62 seconds that the event was observed, I shot 6 exposures. I didn't notice anything by my eye or in the viewfinder but later, when I downloaded the pictures into Adobe Lightroom, I saw a blue nebulosity below and to the left of Venus. In each subsequent photo, it moved up and to the right against the star field. I doubt it was a lens artifact as the camera didn't move and I took pictures of Orion shortly thereafter with no problems. The sequence of photos were taken over 1 minute and 2 seconds from 2042:10 to 2043:12. Like I said I didn't see anything with the naked eye but the camera caught it at 6400 ISO. I was using a remote cable release to trip the shutter and did not see any aircraft pass during that time period. When I saw the photos on the computer, I was mystified and excited. I've seen unknown objects before but this was the first time I've documented any, albeit unknowingly."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.581151,+-73.845719(37096)&iwloc=A&hl=en\"> mufon case (37096) map </A>","Source":"MUFON","Date Submitted":"04/03/2012 12:24 UTC","Longitude":"-73.845719","Region":"New York","Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"New York","files":["/var/www/straped/mufon/html2text/37096.html.txt","/var/www/straped/mufon/more/37096_submitter_file1__EG1_0184.jpg","/var/www/straped/mufon/more/37096_submitter_file2__EG1_0186.jpg","/var/www/straped/mufon/more/37096_submitter_file3__EG1_0187.jpg","/var/www/straped/mufon/org/37096.html"],"Log Number":"US-04032012-0010","Country":"United States","Object Features":"Unknown","Viewing Distance":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around April 2nd 2012","This sighting has never been favorited.",""],"Summary":"Nebulous blue elongated oval apparent length 20 arc seconds","Latitude":"40.581151","Case Number":"37096","Date of the Event":"04/02/2012 08:43 UTC"}