{"Viewing Distance":"Unknown","Sighting Duration":"00:00:08","Object Shape":"Circle, Sphere, Other","Object Flight Path":"Straight-line path","Date of the Event":"04/02/2012 09:58 UTC","Weather Factors":"Unknown","Country":"United States","Log Number":"US-04032012-0005","Case Number":"37091","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37091.html.txt","/var/www/straped/mufon/org/37091.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.965804,+-75.602218(37091)&iwloc=A&hl=en\"> mufon case (37091) map </A>","Latitude":"39.965804","divs":["Sighting DetailsTwo pale red lights seen above West Chester, Pa at 9:58pm on April 2, 2012. I was standing in my backyard, smoking a cigarette (bad me), looking at the sky and saw the lights traveling in a slightly offset linear formation heading north-west. I immediately regarded them as something I have not witnessed in the past and pointed at them, saying to my wife standing next to me, \"Do you see that? What is that?\" I pointed my fingers at the object(s) as they crossed the sky. Our in-town home does not provide much vantage to the night sky, but I would say that I saw the lights pass for about 7 seconds until they were overcome by neighboring trees. My wife never did see what I was pointing at. The lights were steady, but pale, and I was not particularly surprised that she didn't see them-- but I was frustrated that she didn't. The pale red lights were silent as they passed overhead. A few minutes later some small planes flew by with all the telltale signs of being planes---red and green lights, strobes, noise.. I have no idea as to their distance in the sky, but the two lights were approximately an index and ring finger apart if spread in a V, just slightly offset. I just read the 6 points at the side so.. 1. Home outside 2. Looking at stars.. i just do that when I smoke. 3. Something odd. I hadn't seen that before in the sky, so nothing came to mind, except to look. Although, I first thought it was one object with a red light in front and in back; I never saw anything between the lights--and then because the lights were offset, I just assumed them to be two different separate items. Either way, the lights maintained a steady distance, offset and speed from each other. 4. Very steady, straight NW heading 5. Just thought it was weird. 6. Trees"],"City":"West Chester","Object Features":"Unknown","trends":["There have been 10 other sightings in West Chester","There were no other sightings in West Chester on or around April 2nd 2012"],"Region":"Pennsylvania","Longitude":"-75.602218","Date Submitted":"04/03/2012 01:28 UTC","Summary":"2 pale red lights over West Chester, Pa. 4/02/2012, heading NW in linear offset formation.","Tags":"City"}