{"Weather Factors":"Unknown","trends":["There have been 2 other sightings in Sanbornton","There were no other sightings in Sanbornton on or around February 21st 2008","This sighting has never been favorited.",""],"Region":"New Hampshire","Tags":"City","Date of the Event":"02/21/2008 07:55 UTC","Object Features":"None, Unknown","City":"Sanbornton","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/37103.html.txt","/var/www/straped/mufon/more/37103_submitter_file1__img004.jpg","/var/www/straped/mufon/org/37103.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.553934,+-71.605491(37103)&iwloc=A&hl=en\"> mufon case (37103) map </A>","Log Number":"US-04032012-0017","Object Shape":"Triangle","Latitude":"43.553934","Disposition":"Unresolved","Longitude":"-71.605491","Sighting Duration":"Undisclosed","divs":["sighting detailsduring the evening of 2\\21\\08 there was a total luma eclipse. at 7:55 i went to the south facing bay window to check the progress of the eclipse, which had just started. out of the right side window of the bay i saw an extremely massive and very fast isososeles triangular craft coming towards me over steele hill from the east. i ran out as fast as i could to the ice covered walkway. at almost over head i locked in on the illuminated areas in the back corners ( see dia.) and then it went behind the pine trees. because of the size and speed i assumed it must be only a few thousand feet. puzzled, i came in and continued watghing tv. at 8:25 i once again checked on the eclipse, which was a little over half, and again a craft came over the hill with the same heading, but a bit to the right. as before i ran out and this time was able to pick on a nose strobe light and maybe, but not sure, one in the interior. just over head before loosing it again in the pines i noticed the the sound, which was that of a multi engine jet, lagged the craft by 2 or 3 body lenths. given this, i figured that it must be at least 20 to 30 thousand feet, making it very very much larger and faster than my earlier estimate. each occurance lasted no more than 5 or 6 seconds. there were no further sightings that night or since. i have often thought about it and it has always bothered me as to just what i had seen that night. i am sure that it must be american man made. i really hope that this somehow leads to answering my questions as to just what i saw that night-- and i am sure of that i saw."],"Object Flight Path":"Straight-line path","Country":"United States","Summary":"On the night of 2/21/08 during a total luna eclipse I saw an extremily large and very fast dark isosceles triangular craft coming from the East with illuminated areas in the back corners ( see dia.).","Date Submitted":"04/03/2012 02:55 UTC","Source":"MUFON","Case Number":"37103"}