{"Case Number":"37109","Summary":"bright light like a star in a straight line and disappeared in a cloud raisins a less than 5 seconds","Object Features":"Other","Weather Factors":"Unknown","Object Shape":"Star-like","Tags":"City","Latitude":"-20.348543","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-20.348543,+-40.380677(37109)&iwloc=A&hl=en\"> mufon case (37109) map </A>","Longitude":"-40.380677","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","City":"Cariacica","Disposition":"Unresolved","Date Submitted":"04/03/2012 06:41 UTC","Date of the Event":"04/02/2012 06:30 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/37109.html.txt","/var/www/straped/mufon/org/37109.html"],"divs":["Sighting DetailsI was out of the garage, and started to notice a light that moved in the sky, I noticed right away that it was not an airplane or a helicopter or a balloon or a satellite. The light was very bright and was neither too close nor too far, already knowing that it was something strange called my sister and mother ran to prove to them that believe not. The light at one point began to slow, and even though she followed his path to light was everywhere, so the mystery, and soon after I discuss with my sister and mom saying ... Yes it is an object that is not human! ... when suddenly we saw him going behind a cloud, and in less than 5 seconds gone!!!. By the speed that the object was not human any aircraft could have stopped instantly and disappear. we were shocked, simply disappeared, and the brightness is not see anything else. The brightness was a star as seen in the same size as we see bright Venus in those days, was light on all sides. I noted the time so I thought of going on air to ask if something was recorded at the time, but I think they'll end up laughing in my face. I can not stop remembering that moment was beautiful and scary at the same time, because if something off the ground what it was doing here '. I'm from Brazil Vitoria ES. I hope you can understand the way they talked."],"Log Number":"BR-04032012-0023","Region":"Espírito Santo","Country":"Brazil","trends":["There have been no other sightings in Cariacica","This sighting has never been favorited."]}