{"Summary":"BRIGHTLY GLOWING -RED/ORANGE IN COLOR FLASHING OFF AND ON","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"40.555945","Object Features":"Unknown","Case Number":"37104","Tags":"City","City":"Fort Collins","divs":["sighting detailslooked out of my all glass back door to veiw venus\\jupiter conjunction when i noticed the bright objects darting about in the area of the planets. they were moving up and down, sideways and backwards. the flashing seemed to coinside with flying movements as they would disappear and the lights would come on in another location but never far from the planets. there is a possibility of more- but i saw 2 flashing at the same time and assume they were the same two repeatedly and were some distance from each other. i look out often at the stars and it was all clear and bright at the time, no clouds to block the sight as what happens some nights. i could not tell how close they were but brightness was similar to that of jupiter and almost as bright as venus. i watched them in their spurt like movements for about 2-3 minutes, one had dissapeared, the other was still there when i returned to my living room. checked again 5-10 minutes later, neither one was present but a plane was approching from the s.w. and was also identified by flashing lights, it was too high to hear through closed doors- but moving much slower and going in a straight line towards the n.e. therefore verifying that the 2 objects i saw were definately not airplanes or anything i had ever seen before. i have always believed in other life in space as it's vastness keeps expanding with stronger telescopes. i was excited and a little frightened but assumed they were some distance from here and would not be landing. would love to know if anyone else reported seeing the same objects...thank you. a. edwards"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37104.html.txt","/var/www/straped/mufon/org/37104.html"],"Longitude":"-105.098077","Source":"MUFON","Disposition":"Unresolved","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around April 1st 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.555945,+-105.098077(37104)&iwloc=A&hl=en\"> mufon case (37104) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Star-like","Date Submitted":"04/03/2012 05:07 UTC","Date of the Event":"04/01/2012 10:15 UTC","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-04032012-0018","Region":"Colorado"}