{"Object Features":"None","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["Sighting Details I spend most of my time looking at the sky, as I enjoy the endless perspective of the sky. In doing so, I have spotted quite a few 'interesting' lights in the sky, including multiple planes, blimps, helicopters, military and such. Last week, around the 25th of March, some friends (4) and myself were standing in the yard watching the sky as a few planes had just left trails that seemed to turn into thin clouds... hazing the sky above us. We joked about why these trails were being layed in the sky at such an hour (about 8pm). I spot a very small, star-like light at a very high altitude, high enough that I couldnt begin to estimate a size. It was mostly white, although it pulsated from a red, to orange, to blue, and back to white again... in no particular pattern. It moved very quickly from vantage point to vantage point, and had the five of us in trance. Once it was gone, we continued joking about the object's origin, later forgetting about it as the night progressed. The next day, another friend of mine was leaving my house (which is located down a long, unlit, dirt road) and called me frantically, claiming that he was staring at a large, triangular object just above the tree line, off to his left. He claimed that it boasted three large white lights, one at each of the triangles edges, and one large, high intensity light in the center that looked to be more blue-ish (much like a xenon or HID bulb). He described this object to be hovering just above the trees, at a very slow rotation as to continue its hover. This went on, with me on the phone with him, for about five minutes or so, until he inturrupted me to tell me that it had stopped rotating and was now moving away from him, towards a near-by Correctional Institute. He managed to take a shakey video of the object, that proves nothing more than that an object WAS in fact very low to the treeline, but didnt show up clearly at all. That was it... My property is surrounded by large, open fields, owned by that near-by Correctional Institute. It is extremely quiet here, and Im used to the common air-crafts and birds and such. These recent sightings have been very curious to me, as I continue to hear strange sounds through my window at night, as if something is rummaging through my toolshed, although Ive never seen anything more than strange lights... even at ground level. Maybe these things are connected, maybe not. But for me, the question is why... Why are these things occuring here... and What are they looking for, if anything?"],"Tags":"City","Date of the Event":"03/26/2012 08:30 UTC","Source":"MUFON","Date Submitted":"04/03/2012 01:39 UTC","Log Number":"US-04032012-0015","trends":["There has been one other sighting in Ridgeville","There was one other sighting in Ridgeville on or around March 26th 2012","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","City":"Ridgeville","Latitude":"33.098793","files":["/var/www/straped/mufon/html2text/37101.html.txt","/var/www/straped/mufon/more/37101_submitter_file1__Untitled.png","/var/www/straped/mufon/org/37101.html"],"Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=33.098793,+-80.310244(37101)&iwloc=A&hl=en\"> mufon case (37101) map </A>","Country":"United States","Summary":"Multiple sightings over many nights... most recently in close range sighting. Multiple witness","Longitude":"-80.310244","Object Shape":"Star-like, Triangle","Case Number":"37101","Object Flight Path":"Other","Viewing Distance":"101-500 Feet"}