{"Object Features":"Unknown","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"We were sleeping and a bright light shined through bedroom window. It woke me and I saw 4 short grey figures at our bed. One at my side of the bed ; two at end of the bed ; and one moved to my fiance's side of the bed. I tried to scream but I could not.","Viewing Distance":"N/A","Date of the Event":"05/15/1991 12:00 UTC","Sighting Duration":"Undisclosed","Latitude":"32.312387","Case Number":"37118","City":"Maypearl","files":["/var/www/straped/mufon/html2text/37118.html.txt","/var/www/straped/mufon/org/37118.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.312387,+-97.015446(37118)&iwloc=A&hl=en\"> mufon case (37118) map </A>","trends":["There has been one other sighting in Maypearl","There were no other sightings in Maypearl on or around May 15th 1991"],"Longitude":"-97.015446","Date Submitted":"04/04/2012 03:47 UTC","Country":"United States","Object Flight Path":"N/A","Object Shape":"Unknown","Region":"Texas","Log Number":"US-04042012-0002","divs":["sighting detailsi had moved in with my fiance' ; now my husband. one night in the early morning hours in 1991 ; i was woken up by a bright blinding light shining through the window of our bedroom window. i also heard a loud humming sound. it startled me. i had woke up and looked up at the window. my husband didnt budge at all. i looked back to the room and saw four short greyish figures with big dark eyes standing by our bed; one was standing by me ; looking at me. i could see that they were all about 3-4 feet tall. light grey ; big head, small mouth\\nose, skinny neck; body was not porportioned with their head size, body was smaller in size, big dark oval eyes, long skinny arms; long skinny fingers,they made a weird voice type noise;like a soft robotic sound. i could see two more at the foot of bed and one to the side of my husband.i saw the one by my husband; touching my husbands shoulder. i was frightened and was watching them . i didnt know what to do . i could not move or scream; like i was paralyzed or something. it felt like my arms, my head,and legs were being held down. all i could do was move my eyes to see what they were doing. i tried to holler at my husband but i could not say anything at all. the one that was looking at me; was moving its head side to side looking at me; like he was observing me or something. i seen its hand come up toward me. right after that ; i dont remember anything else that happened .time had lapsed into daytime; hours later. i started remembering what had happened that next night. bits and pieces. but the next day and following a few days later; me and my husband noticed that we had gooey; jelly type ooze that kept coming out of both of our belly buttons.when we showered ; we both had said something about the goo to each other. i told him that i had the same stuff coming from mine to. we did not what it was; we felt tired the next day and the days followng that. i didnt put two to two together until days later; after what had happened. it is like i remember what happened the time of seeing them and everything else was blocked. after days going by; i kept getting sick off and on ; feeling drained. at one time i had to be taken to hospital but they did not know what was wrong with me. i had headaches; dizziness and nauseousness. it was like i couldnt breathe or something. to this day we dont know what happened to us both. we have since moved from the area it happened; a year later. i am still puzzled about it all but i know what i saw and it was not a dream either.i am a light sleeper and it was no dream. i was woken up by the bright lights and then seeing those things were terrifying. it was the most frightening thing that happened to me. i was awake and then i saw them; then all else was blocked from me. they were there and then gone in a flash. thats all i know; i still want to know what happened to us and what the ooze was in our belly button area. we still would like to know what took place with us that night. i still think about it today. i could sketch it but i will not at this time."]}