{"City":"Miller Lake","Summary":"Luminscent white vortex-like object","Tags":"City","trends":["There have been no other sightings in Miller Lake","This sighting has never been favorited."],"divs":["Sighting DetailsI went outside to let my dog in as he was barking a lot (which is typical, there are coyotes around our house in the country). It was dusk and right away something strange caught my eye, almost due west. I thought it was the moon because it was relatively bright, but totally in the wrong place and, sure enough I looked around and found the moon just over my house. It was a slow moving, fairly large and very distant funnel shaped object hovering over the trees. The tip of the vortex or funnel was pointing down and to the left so that the top, or opening looked almost like a morning glory flower in full bloom. I called my partner outside to look at it and she got so creeped out she told me to come back inside. I tried to take a picture but the cloud thing, although visible to the naked eye, was too dark to register on the camera. It reminded me of the Norway Spiral, although not that big and not with a seeming point of origin on the ground. It didn't seem to be moving at first, but then it sank quite quickly, over a matter of 30 seconds or so, below the tree line, beyond which is Lake Huron (I live several hundred feet from the shore). I'm sure that it was well over the lake, many kilometers away."],"Object Shape":"Cone","Date Submitted":"04/03/2012 10:59 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"Canada","Log Number":"CA-04032012-0024","Case Number":"37113","Object Features":"None","Region":"Ontario","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"45.101532","files":["/var/www/straped/mufon/html2text/37113.html.txt","/var/www/straped/mufon/org/37113.html"],"Longitude":"-81.443349","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.101532,+-81.443349(37113)&iwloc=A&hl=en\"> mufon case (37113) map </A>","Date of the Event":"04/03/2012 08:45 UTC","Object Flight Path":"Hovering then path"}