{"Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/3711.html.txt","/var/www/straped/mufon/org/3711.html"],"trends":["There have been 4 other sightings in Margate","There were no other sightings in Margate on or around September 15th 1953"],"Object Flight Path":"Straight-line path","Tags":"City","Summary":"Saucer Shaped Disc w/Dome w/Black Circles on Dome","Sighting Duration":"Undisclosed","Weather Factors":"None","divs":["sighting detailsa flying saucer flew over my school, cliftonville boy's school in the summer of 1953. we were at recess and my instructer mr. olsen was standing by my side. we were standing in front of the school looking accross our soccer field. we saw a saucer shaped disc appear above the trees at the edge of the school grounds. it flew in a straight line directly over the school. the sky was clear and it was easy to see. the saucer was fairly flat and it appeared to be metallic. in the center of the saucer was a dome which was maybe 1\\6th the size of the saucer and 4 times higher than the thickness of the saucer. the dome had a hat band around it approximately 1\\2 the hight of the dome. the hat band had black circles the full height of the band and touching one another. these black circles went entirely around the dome. the area around the black circles was either bluish grey or mauve. the top of the dome was eighter bluish grey of mauve also. the top of the dome was one color and the hat band was the other color. the saucer was rotating in a clockwise direction. the black circles moves slowly around the dome as the saucer flew over. the saucer seemed to be flying fairly high, maybe 20,000 feet. even though it flew this high it was still possible to see the black circles around the dome. there was no sound and the saucer flew over in 8-10 seconds."],"Date Submitted":"09/15/1953 12:00 UTC","Latitude":"51.400285","Source":"MUFON","Object Shape":"Disc","Date of the Event":"09/15/1953 12:00 UTC","Longitude":"1.407718","Object Features":"Dome","Log Number":"GB-08082005-0002","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=51.400285,+1.407718(3711)&iwloc=A&hl=en\"> mufon case (3711) map </A>","Case Number":"3711","Region":"England","Viewing Distance":"501 Feet - 1 Mile","City":"Margate"}