{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","City":"Bellingham","Object Features":"Window(s), Other","map":"<A HREF = \"http://maps.google.com/maps?q=48.659186,+-122.379757(37119)&iwloc=A&hl=en\"> mufon case (37119) map </A>","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-122.379757","divs":["Sighting DetailsWe were heading northbound on I-5 at around 10:30-11ish at night. My boyfriend and I were listening to music when I happened to catch something out of the corner of my eyes. I look to the left and over Lake Samish, there were two GIANT, rectangular objects ascending from behind the mountain. When right above the mountain they stopped and just hovered there. They were one of the brightest reds I have ever seen in my life. It looked like 2 casino sized monitor boards or larger that were bright red. They had lines going through them almost like a T.V. of some sort. I immediately told my boyfriend to look at them. It was pouring down rain so he couldn't look until the last second, but he saw them. We were already late home from my grandmas, so we couldn't turn around to go back and see them. I texted my dad as soon as I saw them because I was scared. I know for a fact that these weren't the usual aircraft beacons because, they were bright red, football size, monitor-like objects that ascended from behind the mountain and stopped there. They were so bright you could see the space between the two. I could draw exactly what Ive seen 100 times again. I have no idea what it was, but I know for a fact it wasn't from this earth."],"Date of the Event":"04/04/2012 11:00 UTC","Source":"MUFON","Object Shape":"Square, Rectagular","Weather Factors":"Unknown","Log Number":"US-04042012-0003","Region":"Washington","Date Submitted":"04/04/2012 04:12 UTC","Latitude":"48.659186","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around April 4th 2012"],"Summary":"2 GIANT rectangular objects hovering over mountain","files":["/var/www/straped/mufon/html2text/37119.html.txt","/var/www/straped/mufon/org/37119.html"],"Case Number":"37119","Object Flight Path":"Other"}