{"Disposition":"Unresolved","Date Submitted":"04/04/2012 06:16 UTC","Log Number":"US-04042012-0013","Object Flight Path":"Stationary","City":"Landrum","Sighting Duration":"Undisclosed","Latitude":"35.178155","Summary":"Noticed UFO due to firework display, then hovered, divided in half, and descended","Case Number":"37129","Weather Factors":"Unknown","Date of the Event":"12/03/2011 12:00 UTC","Region":"South Carolina","Object Shape":"Cylinder","Source":"MUFON","files":["/var/www/straped/mufon/html2text/37129.html.txt","/var/www/straped/mufon/org/37129.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.178155,+-82.1817(37129)&iwloc=A&hl=en\"> mufon case (37129) map </A>","trends":["There has been one other sighting in Landrum","There were no other sightings in Landrum on or around December 3rd 2011"],"Longitude":"-82.1817","Tags":"City","divs":["Sighting DetailsIt was approximately 7pm on Saturday night, December 3, 2011. Three friends and I were enroute to Charlotte, NC, from Poinsett Bridge near Travelers Rest, SC. I was driving northeast on SC-ll (Cherokee Foothills Scenic Hwy) when I spotted an explosion of lights in the night sky to my right. I immediately called attention to the display of lights. Robin Perry was riding shotgun. She caught sight of what captured my eye as it transformed into a cigar-shaped (cylindrical) object aglow in a bluish-white hue. Although it appeared to be miles high and away from us, it was the size of a huge jetliner lengthwise but twice as wide. Within moments, this glowing object divided into half. The two equal size objects ... now glowing white ... descended in opposite directions at forty-five degree angles. They disappeared below the horizon. Time seemed to stand still as I continued driving down the rural highway at 55 miles per hour. The two occupants in the backseat, Shay Sommer and Nancy Queen, didn't see the UFO but they saw and heard Robin and I reacting to our sighting of a UFO. As crazy as it sounds, this display was beautiful to behold ... absolutely mesmerizing. Robin and I were excited by the sighting. We had gone to Poinsett Bridge on a paranormal investigation. We were slightly disappointed we had travelled so far and gathered no evidence of a haunting. The futherest thing on our minds was sighting a UFO. Nancy and Shay were greatly disappointed that they didn't see anything due to their seating positions. Although we had cameras with us, no one thought to take pictures. It probably doesn't matter as the car was in motion and it happened too fast. I continued driving until we merged onto Interstate 26. We stopped at the first restaurant we saw, which was a Waffle House. Nancy didn't see anything but Shay recalled a bright light. She thought it was emitted from a billboard. Several days later, she realized there were no lit billboards on the highway. None of us are aware of any missing time as we arrived back in Gastonia about 9pm which would be about right."],"Country":"United States","Viewing Distance":"Unknown"}