{"Object Shape":"Chevron","Date of the Event":"03/18/2012 08:30 UTC","Summary":"Huge UFO caught on camera in Independence, Missouri","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.079089,+-94.413826(37126)&iwloc=A&hl=en\"> mufon case (37126) map </A>","Sighting Duration":"Undisclosed","Region":"Missouri","Log Number":"US-04042012-0010","Country":"United States","files":["/var/www/straped/mufon/html2text/37126.html.txt","/var/www/straped/mufon/more/37126_submitter_file1__UFOphotos014.JPG","/var/www/straped/mufon/more/37126_submitter_file2__UFOphotos015.JPG","/var/www/straped/mufon/more/37126_submitter_file3__UFOphotos016.JPG","/var/www/straped/mufon/org/37126.html"],"Case Number":"37126","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around March 18th 2012","This sighting has been favorited 1 time.",""],"Date Submitted":"04/04/2012 02:44 UTC","Object Features":"Unknown","divs":["Sighting DetailsI was driving west on 23rd street past Noland Road in Independence, Missouri on March 18 at sunset when I suddenly had the urge to take photos of the sky ahead of me. I sensed a large object in the sky, but did not see anything with the naked eye. This has only happened to me one other time --and at that time I also captured a UFO on camera. I did not see anything with the naked eye in either instance. When I downloaded the photos several days later I noticed that there was an object that moved from the north to the south across the street in front of me and apparently just under cloud cover. Two of the three pictures are clear, one is unfortunately not good quality. However, out of the two good pictures you can clearly see a chevron-shaped craft with amber color lights along the bottom of it- I see three lights on each \"wing.\" At the time, since I sensed there was something in the sky I was on the lookout for low flying planes or helicopters but saw none. There was absolutely no sound. If a plane that large had been that close I would have heard something. This object looks huge. It does not look like artifacts from the street lights causing glare. The object changes position, and since I took the pictures while driving along, they are not taken from the exact same location. Yet the object remains in all three photos- and is the same size and shape in all three photos."],"Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"39.079089","Source":"MUFON","Longitude":"-94.413826","City":"Independence","Object Flight Path":"Straight-line path"}