{"map":"<A HREF = \"http://maps.google.com/maps?q=38.440467,+-122.714431(3712)&iwloc=A&hl=en\"> mufon case (3712) map </A>","Object Flight Path":"Path with directional change","Source":"MUFON","Object Features":"None","Country":"United States","Disposition":"Insufficient Data","Date Submitted":"07/09/2005 06:50 UTC","Date of the Event":"07/09/2005 06:50 UTC","Case Number":"3712","Region":"California","City":"Santa Rosa","Summary":"4 bright, glowing objects flying NNW away from Santa Rosa","Object Shape":"Sphere, Star-like","Log Number":"US-08082005-0003","Longitude":"-122.714431","files":["/var/www/straped/mufon/html2text/3712.html.txt","/var/www/straped/mufon/org/3712.html"],"Sighting Duration":"Undisclosed","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around July 9th 2005"],"Weather Factors":"Unknown","divs":["Sighting Details1. Where were you and what were you doing at the time? 1) We were driving northbound on HWY 101 just entering Rohnert Park from the Cotati Grade. 2. What made you first notice the object? 2) My wife said half jokingly, \"look, aliens!\" I was driving and looked towards where she pointed and saw four bright, glowing objects. 3. What did you think the object was when you first noticed it? 3) I did not have any thought specifically yet as to \"what\" these objects were other than, \"Wow, that's really strange\" and that they did not seem to be conventional aircraft. 4. Describe the object and its actions. 4) The objects were glowing very brightly, were sphere like, varying in their intensity, flying side-by-side but varying their altitude and brightness with respect to one another slightly. They seemed to be moving away from us as over the approximate 7 minutes we observed them they seemed to get smaller as if moving into the distance. While watching them I tried to think what they might be, that maybe they were airplanes reflecting the sun, but they were just sperical and the light coming from them was not like a reflection. It seemed to be generated from the objects and varied in intensity as they varied their attitudes position wise towards each other. 5. Describe your reactions and actions, during and after sighting the object. 5) This wasn't my first sighting and I tend to take these things sort of for granted, so I was kind of like \"Wow, that's really strange\" but being that I've had several experiences with these things it was almost kind of like just another sighting. I was was more analytically thinking of it more so than being excited about the event. During the sighting I was a little excited as this was my first daylight sighting. 6. How did you lose sight of the object? 6) The objects seemed to move away from us, NNW, at first slowly, then suddenly disappeared all together."],"Tags":"City","Latitude":"38.440467","Viewing Distance":"Over 1 Mile, Unknown"}