{"Weather Factors":"Unknown","Longitude":"-93.29063","Date of the Event":"04/04/2012 01:25 UTC","Source":"MUFON","Summary":"Silent yellowish orb flying from NE to SW. 1:20 am. 2nd time in a week I saw this in the same neighborhood.","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around April 4th 2012","This sighting has been favorited 1 time.",""],"Log Number":"US-04042012-0011","Country":"United States","Tags":"City","City":"Minneapolis","Case Number":"37127","divs":["Sighting DetailsI saw a yellowish orange orb flying at the same level inner city helicopters fly at, and assumed that's what it was until it got closer and there was no sound. There was no shape or distinctions other than it being a sphere of light. Two neighbors walking past saw it as well. I had a camera in my bag and took a blurry shot. Then quickly set my camera to video and followed it as it flew away from me. This was (I think) on Sat Mar 24th around 11pm. It flew from the NW to the SE and then curved due East. I put the video on my ipad and showed a few people. The image is only visible for a few seconds. 10 days later I was riding my bike in the same neighborhood after work at 1:20am and saw a light in the sky from the NE coming towards me. I immediately recognized it as an object just like the one I saw previously. It was flying at the same level, same speed, was the same color, and was silent. It flew almost right over me towards the SW. My friends were in a car a few blocks behind me and had seen the previous video I took. The passenger saw the light and recognized it and was watching it. When they reached me stopped on the road, they pulled over and were able to see it going further away from us toward the SW. Then it either went into some low clouds or just sort of dissipated. We could see stars and the moon, but there could have been some random clouds. It seemed to be traveling at about the speed a traffic helicopter would be going at, but slower than a medical helicopter. It was also at about that height, but again, absolutely no noise. It was also going against the wind, though it seemed to be floating as opposed to flying a very perfectly solid straight line. File 1: video from March 24 File 2: video from April 5 File 3: still photo from April 5 video with a) original b) shadows lessened by Photoshop c) color saturation increased by Photoshop d) color saturation removed by Photoshop"],"files":["/var/www/straped/mufon/html2text/37127.html.txt","/var/www/straped/mufon/more/37127_submitter_file3__stillfromApr4thvideo.jpg","/var/www/straped/mufon/org/37127.html"],"Date Submitted":"04/04/2012 04:30 UTC","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Object Flight Path":"Path with directional change","Latitude":"44.948356","map":"<A HREF = \"http://maps.google.com/maps?q=44.948356,+-93.29063(37127)&iwloc=A&hl=en\"> mufon case (37127) map </A>","Region":"Minnesota","Disposition":"Unresolved"}