{"Sighting Duration":"00:10:30","Tags":"City","Object Features":"Unknown","City":"Colorado Springs","Summary":"Three orangish orbs pulsating and going back and forth and then fading out","Date of the Event":"04/04/2012 11:00 UTC","Viewing Distance":"Over One Mile","Region":"Colorado","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","trends":["There have been 106 other sightings in Colorado Springs","There were 2 other sightings in Colorado Springs on or around April 4th 2012"],"files":["/var/www/straped/mufon/html2text/37137.html.txt","/var/www/straped/mufon/org/37137.html"],"Longitude":"-104.757089","Latitude":"38.839228","Weather Factors":"Unknown","divs":["Sighting Details1. Driving down academy 2. looked straight ahead an noticed the lights moving in a path parallel 3. at first thought a street light and possibly a star until it moved 4. orange orbs that were pulsating their light in a steady pattern, at first only 2, one above and to the right with the other below. the second one moved directly under the first and faded. then a third appeared above the second to the left and descended to just above the second one but remained to the left. the third then faded and the second reappeared to below and right of the first. the second and first then started to move toward each other. the second one is then faded again. the first stayed still for a few minutes and then slowly faded. 5. at first a little bit of shock and pleasantness, knowing i have had my first true observation. continued to drive toward the orbs that were in the southern direction. after had a kind thought of if they came back and put me at unease. 6.they faded out"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.839228,+-104.757089(37137)&iwloc=A&hl=en\"> mufon case (37137) map </A>","Disposition":"Unresolved","Log Number":"US-04052012-0006","Object Shape":"Circle, Fireball, Sphere, Star-like","Date Submitted":"04/05/2012 02:22 UTC","Case Number":"37137","Source":"MUFON"}