{"Region":"Ontario","Log Number":"CA-04052012-0009","Disposition":"Unresolved","Longitude":"-79.541882","divs":["Sighting DetailsI was in my bed room watching T.V. when I looked up ,(I have a large bed room window that I can see right out of )I saw a very bright strange shaped light, I watched it for about 20 minutes and it never left the spot. I thought that was strange so I got up and stood right on the bed 1\" from my window and look out at it it was way to bright to be a plane and and it was round. I called my son in and he looked and say the same thing that it was strange. I went out and got my binoculors my son and I both looked through them and I wanted and even closer look so I went right out in to my yard with my binoculors. It seem at one point to pivet still hovering and I saw the bottom of it, it looked like a 7 pionted star like this * only 7 points not 5 each point from line to line was lit up with really bright lights and it had it looked like 3 beems of light coming straight down from it and the lights pulsated . It stayed there for a good hour then. By the time I got back to my room it had moved. When I first seen it, it was north west, when I got to my room it was north and hovering I was staring right at it and it moved back to the west a little more and in a blink of a eye it was gone. I phone cp 24 news but I think they thought I was crazy. I never told my son what I saw like shape or anything like that I gave him a paper to draw what he saw and I did the same we both drew the same thing. We are not very good drawers but you will get the idea. I would really like to hear back from you this is not the first time I have saw a UFO and other members of my family have also seen UFO's."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.603225,+-79.541882(37142)&iwloc=A&hl=en\"> mufon case (37142) map </A>","Object Shape":"Cone, Disc","Latitude":"43.603225","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 136 other sightings in Toronto","There was one other sighting in Toronto on or around April 4th 2012","This sighting has never been favorited.",""],"City":"Toronto","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"04/04/2012 10:11 UTC","Object Flight Path":"Stationary,Hovering then path","Tags":"City","Summary":"Saw strainge bright light in sky for over 1 hour","Date Submitted":"04/05/2012 11:39 UTC","Object Features":"Undisclosed","Case Number":"37142","files":["/var/www/straped/mufon/html2text/37142.html.txt","/var/www/straped/mufon/more/37142_submitter_file1__UFOApril42012001.jpg","/var/www/straped/mufon/org/37142.html"],"Country":"Canada","Sighting Duration":"Undisclosed"}