{"Latitude":"43.16224","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=43.16224,+-77.603182(3715)&iwloc=A&hl=en\"> mufon case (3715) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/3715.html.txt","/var/www/straped/mufon/org/3715.html"],"Longitude":"-77.603182","City":"Rochester","Region":"New York","Log Number":"US-08092005-0003","Weather Factors":"Unknown","Date Submitted":"12/10/1988 12:00 UTC","Date of the Event":"12/10/1988 12:00 UTC","Object Features":"Undisclosed","Object Shape":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","Country":"United States","divs":["Sighting Details My dad and I were walking up from the barn after doing chores. We had gotten right outside of our driveway when my dad said he had to go check on the animals in the upper pasture. Several minutes later I observed an oval orange neon craft rise from behind the hill across our road. I thought it was a UFO immediately. It was nothing I had ever seen before and my gut said that it was not of this earth. Its possible it could be some govt. vehicle but my intuition said no. I would say it was two football fields away. Approximately three seconds later it was hovering over the road about 3 to 4 feet above road from the south. It had a gaseous auora. It was about 12 feet high and it took up the entire diameter of the road. I would say 25 feet wide. It had windows in the middle of the front like portholes on a cruise ship. It did not make any noise and there was no sign of propelsion mechanism. It just hovered for 3 to 4 minutes and then sped off at lightning speeds through the trees in a southwesterly direction and quickly disappeared. During this event I was in total awe. I was only ten years old. I felt like somewhat paralyzed. I wanted to run but I was in too much shock. After it sped away I ran as fast back to the house as I could. That was probably only 60 yards. A few days later I started having strange nightmares of UFO's and I remember a presence in my room and feeling paralyzed."],"Object Flight Path":"Undisclosed","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around December 10th 1988"],"Summary":"I witnessed an oval orange neon craft rise above our hill across the road and in a matter of seconds watched it hover over the road for approx 3-4 minutes","Source":"MUFON","Case Number":"3715"}