{"Viewing Distance":"Unknown","Region":"Oregon","files":["/var/www/straped/mufon/html2text/37156.html.txt","/var/www/straped/mufon/org/37156.html"],"divs":["Sighting DetailsSee them all the time but this was the neatest one. Crused then stopped high up in the sky, started to think it was just a star. Then 20 minutes or so after that it did the swoop down with a tight turn then flung straight up at speeds i couldn't explain! Look up everyone and focus!! You need to train your eyes. Its sorta like those images you look at to see the hidden image after you unfocus your eyes. Same gig!! After getting it you'll start seeing things, usually you'll see 3 or 4 hauling ass together across the sky!! Then after you start seeing them it just opens up more questions you can't answer!! Is Jesus, the gods, or our creators back for 2012, or have they been here the whole time? I ask them or \"pray or talk via telepathy\" when I see them to come down and have a beer but of course I get no love... o well maybe someday! It sure be fun to bring a bean bag and go for a ride someday ;) I heard their chairs are small from Bob Lazar.. And of course I took video with my smart phone and of course it wouldn't focus! I was sad.."],"Country":"United States","Longitude":"-122.873595","City":"Medford","Log Number":"US-04062012-0005","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Latitude":"42.334585","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around March 10th 2012"],"Case Number":"37156","Sighting Duration":"Undisclosed","Date of the Event":"03/10/2012 12:00 UTC","Summary":"Just another active day in the sky","Date Submitted":"04/06/2012 01:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.334585,+-122.873595(37156)&iwloc=A&hl=en\"> mufon case (37156) map </A>","Object Features":"None","Object Shape":"Sphere, Star-like","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering"}