{"files":["/var/www/straped/mufon/html2text/37151.html.txt","/var/www/straped/mufon/org/37151.html"],"City":"Costa Mesa","Source":"MUFON","Date of the Event":"04/05/2012 09:30 UTC","Object Features":"Other","divs":["sighting detailsi was driving south bound on harbor blvd near the 405 fwy. at this time i saw what appeared to be a diamond shape vehicle in the eastern sky abpproximately 1 mile from my location. while i was driving i noticed the vehicle hovering, so i thought it was a heliocopter, but then it did not have the aviation lights. also, it was much to big to be a heliocopter. when arrived on harbor and baker it was still in the sky hovering\\gliding south east direction. i arrived at stater bros which is located on the south\\east corner and got out of my pickup truck. at this time the vehicle tilted on its side and then i was able to see it was in the shape of a diamond, or actually two diamonds connected in the middle. at first i thought it was a hoax but this vehicle was much too sophisticated to be a toy and very large. it made a hummimg noise that i could hear from approximately a mile away... several people in the parking lot became spectators with me as we all watched in awe. the vehicle at that time proceeded to fly\\hover\\glide higher in altitude and in a north\\east direction. i felt at tthat time it was in the orange county airport flight path ,so it should have shown up on their radar. also at that time, the craft emmitted 4 brighter than the sun lights, or energy sources when it tilted. ive see many things at night and in this area but nothing to this degree. if it was a hoax it would of costed the person(s) in the millions of dollars to conduct... i am very confident i was not the only person that was watching this because of the size and duration of the incident. i know for a fact there are witnesses at the gas station, stater bros, and possibly more that were driving in a 2-4 square mile of the craft."],"Log Number":"US-04062012-0003","Tags":"City","Summary":"driving s/b on harbor towards 405 fwy it was towards the east, like two diamonds joined side by side","Case Number":"37151","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"33.695586","Sighting Duration":"Undisclosed","Longitude":"-117.91939","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 17 other sightings in Costa Mesa","There were no other sightings in Costa Mesa on or around April 5th 2012"],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.695586,+-117.91939(37151)&iwloc=A&hl=en\"> mufon case (37151) map </A>","Object Shape":"Diamond, Square, Rectagular, Triangle","Date Submitted":"04/06/2012 02:02 UTC","Disposition":"Unresolved","Country":"United States"}