{"trends":["There has been one other sighting in Fairview","There were no other sightings in Fairview on or around April 6th 2012"],"Source":"MUFON","Tags":"City","Disposition":"Unresolved","Latitude":"35.502343","Summary":"Bright Star-like Object on Mountain","Date Submitted":"04/06/2012 09:46 UTC","Object Flight Path":"N/A","Longitude":"-82.38678","Log Number":"US-04062012-0010","Viewing Distance":"Over One Mile","Case Number":"37161","Object Features":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsMy husband and I were watching TV when he noticed a bright light outside our sliding glass door. We both got up to look and it was a star-like object, very bright, on top of the mountain across from our house (maybe about a mile away). We look out that sliding glass door every night so this was an unusual white light, nothing like the house lights on the adjacent mountain. The bright light seemed to flash a little and my husband got out his binoculars. He said he saw the light flash blue briefly. After that the light faded away. We sat back down on the couch and not five minutes later the light came back, not as bright this time, and it was in a different spot on the mountain. I watched it while he went to find batteries for his night vision, but it had faded away then reappeared in a different spot on the mountain briefly before disappearing altogether by the time he had his night vision ready, so we weren't able to get a better look at the light. It was far too bright to be car headlights or lights from a house until it faded down, then it looked similar to the house lights in the area just before it disappeared."],"Object Shape":"Star-like","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/37161.html.txt","/var/www/straped/mufon/org/37161.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.502343,+-82.38678(37161)&iwloc=A&hl=en\"> mufon case (37161) map </A>","City":"Fairview","Date of the Event":"04/06/2012 09:14 UTC"}