{"Latitude":"31.103824","Date Submitted":"04/07/2012 01:04 UTC","Object Shape":"Circle, Fireball, Sphere","trends":["There have been 10 other sightings in Temple","There were no other sightings in Temple on or around April 6th 2012"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.103824,+-97.334682(37169)&iwloc=A&hl=en\"> mufon case (37169) map </A>","Viewing Distance":"Unknown","Region":"Texas","files":["/var/www/straped/mufon/html2text/37169.html.txt","/var/www/straped/mufon/org/37169.html"],"Date of the Event":"04/06/2012 09:20 UTC","divs":["sighting detailsi was in the garage talking to one of my sons and one of my other sons, who is 11 years old, asked me to come outside. he pointed out an orange light in the west\\northwest sky. the time was about 9:20 pm cst. the size of the object appeared similar to venus which was higher in the sky. the object was orange in color and pulsated in brightness. the object seemed to be moving north\\northwest and eventually faded from view. approximately 5 minutes later, the same or similar object appeared in the same general direction but seemed to ascend from a location further north. this time the object appeared like a fireball and seemed to be much closer. the object appeared to be heading our direction and i became a little concerned that it would get too close for comfort. at it's apparent closest distance or largest size, it was about the size of my thumbnail at arm's length. the object faded in a manner similar to the first sighting. two neighbors said they saw the object also. i believe both my other sons saw it too. at about 10:00 pm cst, my 11 yr old son noticed a light again. this sighting was very similar to the second sighting. my wife had just arrived home and saw the object also. the sightings made for a pretty exciting evening."],"Sighting Duration":"00:02:00","Disposition":"Unresolved","Case Number":"37169","Object Flight Path":"Path then hovering","Summary":"Orange fireball sighted 3 times in North/Northwest sky","Log Number":"US-04072012-0002","Weather Factors":"Unknown","Country":"United States","Longitude":"-97.334682","Tags":"City","Source":"MUFON","City":"Temple"}