{"Tags":"City","Sighting Duration":"00:30:00","Disposition":"Unresolved","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.937946,+-98.53406(37176)&iwloc=A&hl=en\"> mufon case (37176) map </A>","Longitude":"-98.53406","Date Submitted":"04/07/2012 01:32 UTC","Region":"Texas","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.937946","divs":["Sighting DetailsThis is the four time I witnessed the same object over a 10 day period in the Western sky at 11 PM CST. Wichita Falls, Texas Very bright hovering within a mile or more from my residence. Appears to be Venus about 10 degrees above the horizon but twice as bright. However, it's not Venus! I can see Venus and Saturn aligned with Moon. This object is not a planet or star it's stationary as thou it's observing. Sheppard Air Force base is not flying or training at this hour. It was very quiet clear evening observing the object for 30 minutes. It slowly faded in brightness and slipped below the trees not far from my location. At 12 midnight I witness another object appearing to be a star not nearly as bright, changing colors from white light to red. I watched for nearly 2 hours as the object slowly faded out of site to the Northwest. This object projects or mimics a star or planet somewhat like Mars in the night sky. It's hovering at 3,000 feet very slowing moving to the Northwest over 2 hours period until it disappeared from site."],"Object Shape":"Diamond, Star-like, Other","files":["/var/www/straped/mufon/html2text/37176.html.txt","/var/www/straped/mufon/org/37176.html"],"City":"Wichita Falls","Summary":"4 out of the last ten nights on clear nite sky, twice as bright as venus, hovering. went behide trees.","Date of the Event":"04/06/2012 11:05 UTC","Source":"MUFON","Country":"United States","trends":["There have been 12 other sightings in Wichita Falls","There were no other sightings in Wichita Falls on or around April 6th 2012"],"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Log Number":"US-04072012-0009","Case Number":"37176"}