{"Latitude":"42.212109","Case Number":"37177","Log Number":"US-04072012-0010","Tags":"City","Region":"Michigan","divs":["Sighting Details1. I was heading into work with my boss. 2. My boss noticed it and pointed me to it. 3. I thought it was an asteroid because of its fiery color until my boss told me it was moving upward. 4. It appeared from across the street and seemed to do a slight lateral curve (while heading upward on an incline). As it got closer, it's angle of elevation changed to a degree that I've never seen a plane ascend at. All the while it was making no noise whatsoever (which is a shock because it was pretty close) and was moving far too quickly to be a weather balloon. Seemed too fast to be a helicopter or plane either. The most shocking part was how high it kept going. It continued to ascend and when I looked away for a second, my boss told me it disappeared. We both looked to see if it would come back and it didn't. 5. At first I was scared because I thought we might be getting pelted with a space rock, but then I was nervous and excited by the prospect of what we were witnessing. Now I'm a little frightened by the implications of what I saw and any possible future contacts with any kind of extraterrestrials or those that may be trying to hide them... I've been pretty public about this because I didn't feel like hiding it. 6. I looked away from the object to see how well my picture of it turned out (not that well...) and my boss just said it was gone. I don't know if it turned its \"lights\" off or something, but I'm reasonably sure that it left the atmosphere do to its continuing ascension and the last altitude I personally saw it at. I've never seen anything fly that high up (at least that quickly)."],"Country":"United States","Source":"MUFON","City":"Lincoln Park","Date of the Event":"03/06/2012 10:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.212109,+-83.213253(37177)&iwloc=A&hl=en\"> mufon case (37177) map </A>","Summary":"orange light with randomly appearing orange-red light on top","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/37177.html.txt","/var/www/straped/mufon/more/37177_submitter_file1__ufo.png","/var/www/straped/mufon/org/37177.html"],"Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Object Shape":"Sphere","Longitude":"-83.213253","Weather Factors":"Unknown","Date Submitted":"04/07/2012 01:55 UTC","trends":["There have been 5 other sightings in Lincoln Park","There were no other sightings in Lincoln Park on or around March 6th 2012","This sighting has never been favorited.",""],"Sighting Duration":"00:02:00","Object Flight Path":"Path with directional change,Other"}