{"Tags":"City","Region":"Texas","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"None","files":["/var/www/straped/mufon/html2text/37170.html.txt","/var/www/straped/mufon/org/37170.html"],"Latitude":"33.01512","Source":"MUFON","Viewing Distance":"N/A","map":"<A HREF = \"http://maps.google.com/maps?q=33.01512,+-96.613049(37170)&iwloc=A&hl=en\"> mufon case (37170) map </A>","City":"Murphy","trends":["There has been one other sighting in Murphy","There were no other sightings in Murphy on or around April 7th 2012"],"Log Number":"US-04072012-0003","Case Number":"37170","Object Flight Path":"Straight-line path","Object Shape":"Other, Unknown","Disposition":"Unresolved","Date Submitted":"04/07/2012 01:32 UTC","Summary":"Firey like object move directly over head-SE to NW- no sound","Weather Factors":"Unknown","Date of the Event":"04/07/2012 09:25 UTC","Longitude":"-96.613049","divs":["Sighting DetailsVeiwed object at approxly 9:25 pm to 9:30pm, object moved form SE to NW at same alitutide in straight line at 2 o'clock above the horizon, object was firey with haze surrounding it, but fire was in same direction as object was moving, no contrail, no smoke, no sound, stayed at same speed and altitude until moved from sight due to distance.Color was red, orange and yellow, but not like a normal flame. Speed appeared to be from 150 to 200 MPH at approximately 800 to 1000 ft. Hard to gauge as no reference for height or speed but moved similar to aircraft making approach but with no change in altitude. Unable to see any structure as object moved directly over head from viewing point. Haze surrounded the object, humid night with full moon. First appeared above the horizon, but moved directly over head as stated above. First thought it was a rocket launch, then thought an aircraft on fire, then thought a meteror, but decided it was none of these due to speed, flight path and observation. Was also viewed at same time by lady friend at her residence. We both saw the object from the same location at the same time. Was unable to photograph the object. We both asked each other what we thought it was , both agreed not an aircraft, not a rocket, really have no idea what the object was, hope someone other than us also saw it. Immediately wrote down our observations of the sighting, and have drawn no conclusions as to what the object may have been."]}