{"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.095353,+-118.178285(37179)&iwloc=A&hl=en\"> mufon case (37179) map </A>","files":["/var/www/straped/mufon/html2text/37179.html.txt","/var/www/straped/mufon/more/37179_submitter_file1__December08009.jpg","/var/www/straped/mufon/more/37179_submitter_file2__December08013.jpg","/var/www/straped/mufon/more/37179_submitter_file3__December08015.jpg","/var/www/straped/mufon/org/37179.html"],"Object Features":"Other","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","City":"Alhambra","Case Number":"37179","Date of the Event":"01/10/2009 09:00 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"34.095353","Source":"MUFON","Tags":"City","Object Shape":"Circle, Disc, Saturn-like","trends":["There have been 4 other sightings in Alhambra","There were no other sightings in Alhambra on or around January 10th 2009","This sighting has never been favorited.",""],"Region":"California","Log Number":"US-04072012-0012","divs":["Sighting DetailsI was home with my daughter on the evening of Jan 10th 2009, I walked outside to take out the trash and noticed a giant disc slowly moving towards the east. the disc appeared to have no color, it looked transparent or cloaked, when you looked at the disc it looked like heat or static electricity, it looked wavy like a hot street on a summer day. Suddenly a 2nd and third one appeared almost as if they were in formation, not a noise made from them not a single cloud in the sky that night. I told my daughter to grab my camera and snapped about four or five pictures. This is the strange part, when I went to save the pictures to my computer and my camera wasnt responding I was able to recover the pictures from the memory stick, but the camera since has been useless. when I did get the pictures saved to my computer they were not in the order as taken as they normally save that way they were all scattered out of order."],"Longitude":"-118.178285","Date Submitted":"04/07/2012 02:49 UTC","Summary":"Transparent disc with static eltrcitiy refelecting light off the edges"}