{"trends":["There have been no other sightings in Traverse City","This sighting has never been favorited."],"Longitude":"-91.830603","Summary":"I saw a pentagon shaped object from my 3rd Floor room. It was large, I compared it to the restaurant and trash bin even the road. I just couldn't figure out what it was. At first I though it was a large canopy but I doubt it.","map":"<A HREF = \"http://maps.google.com/maps?q=35.20949,+-91.830603(37172)&iwloc=A&hl=en\"> mufon case (37172) map </A>","Object Features":"Unknown","Date of the Event":"06/24/2009 12:00 UTC","divs":["Sighting DetailsThis is a copy of the letter I sent to Rick at UFO picks. A couple of years ago my 14 year old daughter and I along with three other family members went to Traverse City Michigan. My 14 year old daughter was going to attend the summer session at Interlochen Center for the Arts. She is a creative writer. We dropped my daughter off and checked into the Marriott Hotel in Traverse City for seven days of fun. > > The weather was warm. At night my other daughter and I would each get up in the middle of the night. She to turn off the air conditioner, me to turn it on. I suggested switching beds but her answer was no. > > About four nights into our stay I had already gotten up a few times when I looked out the window as I usually did each time I got up and saw an object in the field (2 to 3 am), this field was tall and grassy. > > The object looked like it could have been an awning. I looked to my left at the restaurant on the other side of the road and the large trash dumpster, I also looked at the road that separated the object from the restaurant. This object was almost as large as the restaurant! It reminded me of an old cadillac (dart shaped reference) It was seamless. It had sides that angled slightly larger on the bottom than on the flat top. From the front point it gently and slightly angled away from where I viewed it. The back side had the same gentle slight angle but inward to an inverted point in the middle. It was all white, windowless, spotless! It really looked like a dart (wide and thick). UFO did not enter my mind. > > I watched it for a few minutes trying to figure out what it could be, after a few minutes I told myself I would get up in the morning and see if it was still there. I then went back to bed. The next morning I can't remember looking but am pretty sure I did. I got up had breakfast (there was a gentleman I hadn't seen before and he was dressed all in white, I smiled to myself and thought how funny it was I had seen an all white object and then this gentleman was here in all white, there were subtle imaginations in my mind at this point, very subtle) and listened to the news where I heard Michael Jackson had just died. We went home a couple days later and I forgot all about what I saw. > > A few months later I recorded some Alien shows and sat in shocked silence as I realized I had seen what could have been an alien spaceship and did not even realize it! It was an episode where the British Government and French Government had released their UFO sightings and also the American Press Release on one of the Major News Cable Stations that convinced me I could actually talk to someone about this. I told my daughter if we ever go back to Michigan I will definitely not stay in a location without a lot of people around! We were talking about going back and renting a house on a lake. My daughter wants to go back to Mackinac Island. I would also like to hear from anyone who has seen an object like this. I stayed at the Marriott Fairfield Inn & Suites > 3701 North Country Drive, Traverse City, MI > > If you look on Google maps there is an open field in front of it. I don't see the trash dumpster by the Cracker Barrell Restaurant anymore. It's changed a bit since I stayed there. I can't remember if it was two or three years ago, my daughter is sixteen now and I made an estimate on her age at the time."],"Object Shape":"Unknown","Latitude":"35.20949","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Log Number":"US-04072012-0005","Tags":"City","City":"Traverse City","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37172.html.txt","/var/www/straped/mufon/org/37172.html"],"Source":"MUFON","Region":"Arkansas","Case Number":"37172","Date Submitted":"04/07/2012 02:11 UTC","Country":"United States","Object Flight Path":"Stationary"}