{"Log Number":"CA-04072012-0008","Date of the Event":"04/06/2012 06:30 UTC","Object Features":"None","Longitude":"-79.241103","Source":"MUFON","Disposition":"Unresolved","Tags":"City","trends":["There have been 9 other sightings in St Catharines","There were no other sightings in St Catharines on or around April 6th 2012"],"Case Number":"37175","Date Submitted":"04/07/2012 01:09 UTC","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Cylinder","Summary":"Large and very reflective. No wings, no tail fin.","Object Flight Path":"Straight-line path","Region":"Ontario","files":["/var/www/straped/mufon/html2text/37175.html.txt","/var/www/straped/mufon/org/37175.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.166234,+-79.241103(37175)&iwloc=A&hl=en\"> mufon case (37175) map </A>","City":"St Catharines","Weather Factors":"Unknown","divs":["Sighting DetailsI was walking down the path that runs adjacent in between Bunting Rd and Niagara St where the old railway tracks used to be. When I reached Linwell Rd I looked up at the sky and saw the sun reflecting off a chromed object slowly making it's way to the east less than 200 feet above the rooftops. I watched the object for a matter of seconds before it disappeared behind the trees in the area. I walked a kilometre down this path and when I approached Scott St I got a better look at the object as it crossed my path again. I saw it had a solid smooth and shiny surface, no visible wings and no tail fin or identifying marks and was in the shape of a cigar. It was moving far too slow to be a conventional aircraft and far too low. The object was silent and looked magnificent as the sun was just mirrored against it. It was approximately 30-50 feet long. I've never seen a UFO before but I never felt so at peace as when I adored this object. Again, I watched this object for about a minute before it disappeared from my line of sight behind trees and houses."],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"43.166234","Country":"Canada"}