{"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Date Submitted":"04/07/2012 10:08 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 45 other sightings in Allentown","There were 3 other sightings in Allentown on or around April 7th 2012"],"Latitude":"40.61205","Case Number":"37186","Date of the Event":"04/07/2012 08:25 UTC","Source":"MUFON","Object Shape":"Sphere, Star-like","divs":["Sighting DetailsI was pulling into my parking spot at my apartment complex and talking on my cellphone to my aunt. It was fully dark outside, clear skies. Venus and Orion were behind me. I observed a series of 5 lights ascending from the NE toward the SSE. Upon seeing the object, I told my aunt what i was seeing and that I needed to get off the phone and videotape what I was seeing. The lights were red-orange in color - they did not blink - nor did they seem to have other directional lights or strobes. I spent over 13 years in the military as an Infantry officer, and I have never seen anything like these lights in the military or the civilian world. The first indication that they were odd was the color. They did not match any other aircraft light that I had observed. Also, the direction of travel was odd for this area, as was the number of lights. Each was clearly an individual object. Aircraft are required to have both red and green running lights, as well as strobes. These had neither...just the strange color light I mentioned previously. I counted 12 objects prior to them all disappearing. If they had been airplanes or helicopters, I would have discerned some kind of noise. There was none. In all honesty, I said to my aunt, \"Holy crap, what is that??? Let me get going, this is really weird\". I had no idea what I was seeing - but I wanted to get into the dark field near my house in order to see better. I can state with no equivocation that these lights were like nothing I had ever experienced. One possibility for the investigator - the wind direction of travel was close to the direction of travel of the lights. The wind was approximately NE to SW. Close, but not exactly the same as the direction of travel. Also, these craft were clearly under power based upon the speed of travel - it was much faster than the wind velocity. The objects rose along a similar trajectory - however, at one point, one of the lights overtook one of the others. However, within seconds, the objects swapped back into order. I lost sight of the objects as they rose into the sky. I wasn't afraid or nervous, though my hair was standing up on the back of my neck. It was a surreal experience. I called my neighbor to see if he would come out, but he wasn't home. I took a picture and videotaped the event as well. I lost sight of the objects when they ascended out of view into the sky."],"Country":"United States","Weather Factors":"Unknown","Longitude":"-75.485053","Log Number":"US-04072012-0019","Tags":"City","files":["/var/www/straped/mufon/html2text/37186.html.txt","/var/www/straped/mufon/org/37186.html"],"Region":"Pennsylvania","Summary":"12 ascending lights over 7 minutes traveling NE to SSW","City":"Allentown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.61205,+-75.485053(37186)&iwloc=A&hl=en\"> mufon case (37186) map </A>"}