{"Log Number":"US-04082012-0006","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Riverside","There was one other sighting in Riverside on or around April 8th 2012"],"Case Number":"37194","City":"Riverside","Disposition":"Unresolved","Sighting Duration":"00:00:15","divs":["Sighting Details1. Walked in front of my house to smoke. 2. I noticed it because of how bright it was, and close. We're near MCI airport, and I frequently watch planes arrive and depart. My eyes are pretty good, I can typically make out what airline is flying overhead from their colors, planes tail logo etc. this object flew at about the same altitude you would expect to see a traffic helicopter at. 3 and 4. When I saw it I had no idea what I was looking at. I instinctively knew it was not an airplane or helicopter. It was disc shaped, no other shape I could determine due to its brilliance. It was gold-red-bronze. Like the color of molten lava. It became brighter as it passed overhead, heading due north. The we're no flashing lights or changes in color. It left no trail. Skies were clear no clouds at all. There was absolutely no sound. As close as it appeared in relation to planes we regularly see there would always be a sound that follows the passing of an airplane. It moved extremely fast, faster than any airplane ive ever seen, commercial or military. 5. My first reaction was wtf was that? Then I thought about what it could be: airplane, heli-no. Closer than a satellite. Not a shooting star, unless it was one that was large and about to hit the ground. Way too fast for a blimp. Not lightning. Steady quick purposeful straight line direction at an incredible rate of speed. Then I thought it might be a UFO and got the chills all over. I walked inside and told my wife and that I don't know what I just saw and described it. I then checked on our child. Then I started doing google searches for kc UFO sightings. Oddly, there was a video from apr 6 2011 that was remarkably similar, however my sighting was much closer and there was only one object. I found this site and figured I'd report to see if anyone else saw it. 6. I lost sight of it after it passed overhead then behind a tree and my neighbors house. I did not peruse-to tell the truth it freaked me out."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.159861,+-94.62471(37194)&iwloc=A&hl=en\"> mufon case (37194) map </A>","Longitude":"-94.62471","Object Features":"Unknown","Viewing Distance":"Unknown","Summary":"Bronze disc moved quickly across sky. Silently.","Source":"MUFON","Region":"Missouri","Tags":"City","Date of the Event":"04/08/2012 01:15 UTC","Date Submitted":"04/08/2012 05:18 UTC","files":["/var/www/straped/mufon/html2text/37194.html.txt","/var/www/straped/mufon/org/37194.html"],"Latitude":"39.159861","Weather Factors":"Unknown","Country":"United States","Object Shape":"Disc"}