{"Longitude":"-117.845362","files":["/var/www/straped/mufon/html2text/37199.html.txt","/var/www/straped/mufon/org/37199.html"],"Object Shape":"Cigar","Viewing Distance":"101-500 Feet","Date of the Event":"04/06/2012 07:45 UTC","City":"Orange","trends":["There have been 23 other sightings in Orange","There were no other sightings in Orange on or around April 6th 2012"],"Object Features":"None","Country":"United States","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"04/08/2012 01:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.788834,+-117.845362(37199)&iwloc=A&hl=en\"> mufon case (37199) map </A>","Latitude":"33.788834","Sighting Duration":"Undisclosed","Log Number":"US-04082012-0011","Region":"California","Summary":"Saw huge black elongated oblong shaped object passing over the frwys 5, 57 and 22 from Santa Ana heading to Orange, CA","divs":["sighting detailsi was driving northbound on the 5 freeway coming close to the 22 and 57 freeway, i noticed a huge black shape in the sky in front of me. it appeared to be hovering on the left side of the freeway. i stared at it because it looked to be the size of a jumbo airplane when it's arriving at an airport and you see it pass over you. except this was not a plane. i tried to figure out if it was a blimp but it had no logos or lights other than two small flashing lights that i could see. in my opinion one was red and one was orange. the lights were one on the right and another on the left side, both towards the bottom. the kept thinking the shape almost seemed rectangular. it was like an elongated oblong. i drove very slow when i noticed it and noticed that although the traffic was flowing, the traffic slowed down with me. i am sure many people questioned themselves also what this could be. i tried to get a good view but it appeared to be over the underpass of the freeways so when i passed the underpass, i pretty much lost view quickly. it all happened so fast, i didn't have time to configure my cell to take pictures or video, while driving and trying to make sense of what i was witnessing. it was too dangerous because of the traffic to fumble with my phone. the day was still light but in process of turning dark. by the time i passed the underpass, it seemed everyone had their lights turned on. it quickly became dark. this happened at approximately 7:45pm on 4\\06\\2012. i just kept thinking that i couldn't wait to get to a computer and see if anyone was able to take pictures or video. i kept wondering if this was a ufo or a government craft i've never seen before. the fact that it was hovering first then very slowly moving towards the city of orange on the other side of the freeway was strange and inconsistent with what a military craft would do. i don't think it was a blimp because i've seen blimps. that's not what this looked like. there was no visible cabin that i could see. it appeared very close, just over the 57 freeway. maybe as close as the top of a tall palm tree. i couldn't wait to share my experience with friends. the thought that this could be a ufo was exciting. i looked for other testimonies as soon as i was able to. to my surprise i found a few but not as many as i hoped to find. a couple of my friends laughed when i mentioned it on facebook. i took it very seriously. i wouldn't joke about something like this."],"Object Flight Path":"Hovering then path","Source":"MUFON","Case Number":"37199"}