{"divs":["Sighting DetailsI saw (witness) 3 ufo's about 10,000 ft at around 2pm, They were all 3 one on top of the other, maybe 800 to 1000 feet apart. Bright like an intense beam of light, like a Halogen lamp. The lowest one made a quick right turn and flew into a cloud. The next one up, moved down to the first ones position and then made a quick right turn and followed the first into the same cloud. The 3rd light moved down a bit slower (still very fast) and had a trail of light behind, until it moved into the position of the last light. Then it moved into the cloud (quick right) and dissappeared into it. About 2 minutes later, the cloud(the only cloud in the sky) dissappeared, and there was nothing.It was the only cloud in the sky also.....it was a beautiful and clear day! Later that night I was looking in the sky after my curiosity had a hold of me, and observed the moon and a small round throbing and pulsating light near by the moon. I did take videos of this light and have those videos now. I didn't think about it until now, hoping to get some answers. I am an X US Navy veteran, and I know what I see to be a fact. I and have a pretty good knowledge of many type's of aircraft. I have also worked very close to aircraft carriers in the Pacific Ocean. I have these videos and would like to share them with someone who would be interested and helpful in telling me what it was that I saw! PLEASE contact me and give me a report! Thank you, Stephen McCandless Veteran of Foreigh Wars (Viet Nam) PS. I did make a report of the first lights after they happened......I cannot remember the exact date"],"Tags":"City","Longitude":"-116.417689","Log Number":"US-04082012-0013","Country":"United States","Sighting Duration":"01:01:01","Case Number":"37201","Summary":"After seeing 3 ufo's (no photo) at about 2pm.....later that night about 9pm","Date Submitted":"04/08/2012 04:56 UTC","City":"Freeley","trends":["There have been 2 other sightings in Freeley","There were 2 other sightings in Freeley on or around July 12th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/37201.html.txt","/var/www/straped/mufon/org/37201.html"],"Object Shape":"Circle, Flash, Sphere, Star-like","Region":"Nevada","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.80781,+-116.417689(37201)&iwloc=A&hl=en\"> mufon case (37201) map </A>","Date of the Event":"07/12/2009 12:00 UTC","Disposition":"Unresolved","Object Flight Path":"Stationary","Source":"MUFON","Object Features":"Undisclosed","Latitude":"38.80781"}