{"divs":["Sighting DetailsWe were driving on International Drive towards World Center Drive, south of Seaworld. A large grouping of orange lights were visible to our right as we drove south. We turned into our hotel on World Center Drive and got out of our car to a clear area. The sky was full of these light orange lights, probably 30-40 initially, at varying positions in the sky. They traveled in a group from northwest to southwest between Univeral and Disney. As the group moved from our right to our left viewing area, they disappeared as they reached our left viewing area, while new orange objects continued to travel from our right viewing area. I would describe them as traveling at a consistent speed in a horizontal plane. We did not know what they were, and ruled out balloons, fireworks, commercial planes, etc. With so many of these aircraft, we became very concerned and called the front dest of the Royal Caribe. They said other guests had seen them as well, and wrote it off as \"fireworks.\" These were absolutely not fireworks, as I am an Air Force officer who has flown military aircraft and know what a flying object looks like versus Disney fireworks. About 5-10 minutes later, they had all disappeared. We went inside our hotel and googled \"Stange Odjects in the sky\" and found a video from Lincoln, Nebraska that clearily showed exactly what we had just seen: A large grouping of orange objects traveling together with no sound."],"Tags":"City","Case Number":"37215","Log Number":"US-04092012-0006","Object Flight Path":"Straight-line path","Object Shape":"Oval","Weather Factors":"Unknown","Date Submitted":"04/09/2012 05:45 UTC","Latitude":"28.546286","Object Features":"Unknown","Region":"Florida","Viewing Distance":"Over One Mile","Country":"United States","Longitude":"-81.374296","Source":"MUFON","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around April 7th 2012"],"Sighting Duration":"Undisclosed","Date of the Event":"04/07/2012 10:20 UTC","Summary":"Large group of UFOs over Orlando- April 2012","files":["/var/www/straped/mufon/html2text/37215.html.txt","/var/www/straped/mufon/org/37215.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=28.546286,+-81.374296(37215)&iwloc=A&hl=en\"> mufon case (37215) map </A>","City":"Orlando"}