{"Weather Factors":"Unknown","Object Shape":"Sphere","Tags":"City","Summary":"4 amber lights in straight line (continuous glow), changed pattern to triangle configuration, and lights went out one by one.","map":"<A HREF = \"http://maps.google.com/maps?q=39.077266,+-121.542818(37210)&iwloc=A&hl=en\"> mufon case (37210) map </A>","Disposition":"Unresolved","Log Number":"US-04092012-0002","Latitude":"39.077266","Object Features":"Unknown","Case Number":"37210","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/37210.html.txt","/var/www/straped/mufon/org/37210.html"],"Region":"California","Longitude":"-121.542818","Country":"United States","divs":["Sighting DetailsDriving north on Highway 70 toward Marysville, California, at about 8:35 p.m. on April 8, 2012 (between Plumas Lake and Marysville). Noticed a line of four amber sphere-like lights in sky directly above the highway. Pulled over and observed lights. Got out of car, and stood along roadside. Lights moved from West to East over highway, and then they reconfigured from single file to a triangle pattern and one by one the lights disappeared. While standing along the road, another witness who had pulled over, came running up and said, \"You saw that, right? I'm not crazy?\" I confirmed that I had indeed seen the same thing. When I got home, I learned that my wife had also, seen the same four lights, and had pulled over ahead of me, but left before I did, as she didn't see them anymore. We had been driving two separate cars, from the same location and were essentially, following each other to the next destination. So at least three of us saw the same thing at the same time. I thought it might be planes or helicopters as Beale Air Force Base is very near there, but these lights had no sound, and did not appear to be attached to anything, and there were no strobes or landing lights (apparent). I don't know what it was, but it wasn't conventional in terms we understand. Not planes, not helicopters. Don't know. Tried to take photo with cell phone, but had no memory to do so."],"trends":["There have been no other sightings in Olivehurst","This sighting has never been favorited."],"Date Submitted":"04/09/2012 12:38 UTC","Date of the Event":"04/08/2012 08:35 UTC","Source":"MUFON","City":"Olivehurst","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change"}