{"Log Number":"US-08102005-0001","Sighting Duration":"Undisclosed","Object Features":"None, Unknown","City":"Burnsville","Case Number":"3722","Source":"MUFON","Date Submitted":"03/01/2004 12:00 UTC","Region":"Minnesota","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Burnsville","There were no other sightings in Burnsville on or around March 1st 2004"],"files":["/var/www/straped/mufon/html2text/3722.html.txt","/var/www/straped/mufon/org/3722.html"],"Country":"United States","Tags":"City","Viewing Distance":"21-100 Feet","Summary":"Something flying really low over the houses in my neighborhood, no sound","Disposition":"Insufficient Data","Longitude":"-93.270003","Object Shape":"Triangle","divs":["Sighting DetailsI was driving home one night from work at about 12am. I turned into my culdasac and I noticed something almost hanging from the house accross the street. It was a triangle shaped object flying very low in the sky. Literally I felt like I could touch it. I thought maybe it was a helicopter looking for someone. But I opened my truck window to hear it. And there was no sound. It was flying very slow above the house, Inching along. I thought it was really weird because there was no sound coming from it and it was flying so low. It could have touched the houses if it was any lower. I watched the object continue to move from house to house. And then I got nervous and went into my house. I never told anyone about it until my co-worker told me that he saw this weird thing in the sky on the way home. And I proceeded to explain it to him and he was freakin out. He hadn't told anyone either and I described it just the way he saw it. But like I said, he said that there was no sound coming from it. It was very strange that we both saw it on different nights, but saw the same thing."],"Object Flight Path":"Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.771942,+-93.270003(3722)&iwloc=A&hl=en\"> mufon case (3722) map </A>","Date of the Event":"03/01/2004 12:00 UTC","Latitude":"44.771942"}