{"map":"<A HREF = \"http://maps.google.com/maps?q=33.839956,+-116.536252(3726)&iwloc=A&hl=en\"> mufon case (3726) map </A>","City":"Palm Springs","Date of the Event":"07/31/2002 02:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Features":"Window(s), Unknown","Longitude":"-116.536252","Country":"United States","Date Submitted":"07/31/2002 02:00 UTC","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.839956","Log Number":"US-08112005-0001","divs":["Sighting DetailsI think I saw the next generation stealth bomber. I was working at the time as a Registered Nurse at Desert Regional Medical Center in Palm Springs on the night shift a few years back. I wasn't supposed to be on the balcony of the East Tower as the doors have been locked because of fire code reasons. Anyway, I was standing out there getting some freash air in the middle of the night when I saw what appeared to be a \"wedge\" shape with red lights down the side fly quickly and quietly down Palm Canyon Drive, the main strip in PS. I heard nothing and it only lasted a brief moment. There is an air museum in PS and for the Veterans Day parade they fly vintage bombers down the same route, and this object was a little smaller than those that I had seen. I came inside and told the other nurse that I saw a \"UFO\" but I think that it was the next generation stealth. Her husband is into this stuff and she knew exactly what I was talking about. Anyway, I had a few moments and was trying to find any information available on this object, which I know I have seen on TV before describing just what I saw. Any information you have would be helpful. Thank you."],"Region":"California","trends":["There have been 23 other sightings in Palm Springs","There were no other sightings in Palm Springs on or around July 31st 2002"],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/3726.html.txt","/var/www/straped/mufon/org/3726.html"],"Source":"MUFON","Case Number":"3726","Disposition":"IFO","Summary":"next generation stealth?"}