{"Weather Factors":"Rain, Light","trends":["There has been one other sighting in Phenix City","There were no other sightings in Phenix City on or around September 29th 1987"],"Viewing Distance":"20 Feet or Less","Date of the Event":"09/29/1987 10:21 UTC","divs":["Sighting DetailsWe were in Phenix city,Al.We were parking,making out.I noticed a beeping sound, faint at first,but became louder & more frequent.It had been raining,so I thought maybe it was a raindrop falling on a bucket or something in the back of my truck.Then I finally couldnt ignore it any longer.I asked my girlfriend if she heard it.She heard it also,Then I looked out the driver side window,& there were three glowing circular objects floating,We couldnt tell how close or far it was,that was scary.So I locked my door.Because We couldnt focus on it, I decided to crank the truck,turn on the lights,& press on the brakes all at once to try & shine light in that direction. As soon as I did this. The circular obects disappeared,& some kind of thing was in its place. The only way I can describe it is, it was about one foot tall,it had a rectangular head,no eyes ,no nose, no mouth. It had a tornado shaped body. It was still floating, back & forth to the sound of the beeping.I was scared so I put the truck in gear & took off. We didnt go but about fifty feet or so, and I decided to turn around and shine my headlights on it.When I did, it was not there. What is strange to me,we didnt talk about it, We went back to her house & fell asleep. The next day I called & reported it to the police. They told me some people reported hearing hovering noises over their houses. I asked my Ex girlfriend recently, what she remembered about this, she remembered everything. I want to know has anyone ever reported any sightings like this."],"Region":"Alabama","files":["/var/www/straped/mufon/html2text/3727.html.txt","/var/www/straped/mufon/org/3727.html"],"Tags":"City","Disposition":"Insufficient Data","Object Features":"Other, Unknown","Latitude":"32.470976","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.470976,+-85.000765(3727)&iwloc=A&hl=en\"> mufon case (3727) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Teardrop","City":"Phenix City","Summary":"Me & my girlfriend were parking. We didnt see a space ship. But we saw something not from this planet.","Case Number":"3727","Object Flight Path":"Stationary,Hovering then path,Other","Date Submitted":"09/29/1987 10:21 UTC","Source":"MUFON","Longitude":"-85.000765","Log Number":"US-08112005-0002"}