{"Weather Factors":"None","Summary":"Singular solid small light at close range but completely silent.","Country":"United States","Source":"MUFON","Longitude":"-84.94606","files":["/var/www/straped/mufon/html2text/3728.html.txt","/var/www/straped/mufon/org/3728.html"],"Case Number":"3728","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.286461","divs":["Sighting DetailsWent to my nieces to pick up her little girl and take her to her \"nannys\". Close to Cleveland Community Hospital we were buzzed and spotlighted by the hospital hellicopter, which proceeded to land near the hospital (this was right at dusk), I thought this was slightly odd. Several miles down Georgetown road (between Bradley and Hamilton county lines), there is a section of road which runs along a ridge, full of cow pasture. The distance between the ridge and road I'm sure is less than a mile. We noticed a simple star like light between us and the ridge. As it was backdropped by the ridge but appeared so tiny, it was slightly out of place. Planes usually have more than one light and flash. We flashed our car head lights. It proceeded to follow us several miles down the road. It stayed slightly above tree level but within visual range and alongside our car for most of the trip except for a \"popular\" intersection (hwy 58,60 and Georgetown)when it skirted around and ahead of it and us, and we lost visual contact just for a few seconds while it did this. As the place we were going was right past this intersection, we turned into a driveway. We flashed the lights of the car as we turned in and it actually turned and came back some but still stayed down from or ahead of us and away from the intersection. I walked out in a cow field and had a spotlight brought to me from inside. Spotlighted the ground for some other people to walk out, me, the field and it (completely dark by now). It generally hovered right above tree level the entire time COMPLETELY silent and able to hover completely still. Never got too close (within shooting range, not that I had a weapon- but we're talking rural south) but it was still fairly close. After I spotlighted it, it made a few non-impressive maneuvers (circles and squares and zig zags)- well within the capabilities of a stealth hellicopter I would guess maybe, but enough to get curious responses from the crowd. It was generally yellow but appeared red to me at times. Everybody else got bored with it and went inside? So I stood out in a cow field for a full twenty minutes looking at a light that was looking at me. We watched each other until it got bored with me. It never did fly off. It moved slightly to the right of the road and then further above the tree line and proceeded to go dimmer. Right at the point I was having problems seeing it, it gave three little twinkles and disappeared. Witnessed by six people (including a child). Would a stealth helicopter (even perhaps an unmanned craft) be audible at a mile's distance in the country? Are they allowed to fly with just one light? Better yet, could the government really be stupid enough to waste stealth craft in watching (me)...talk about Big Brother. Or alternative two. Either way, I'm the only one that seems flabbergasted."],"trends":["There have been no other sightings in Georgetown, TN","This sighting has never been favorited."],"Date Submitted":"08/10/2005 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.286461,+-84.94606(3728)&iwloc=A&hl=en\"> mufon case (3728) map </A>","Date of the Event":"08/10/2005 10:00 UTC","City":"Georgetown, TN","Region":"Tennessee","Disposition":"Unknown","Object Features":"Unknown","Tags":"City","Object Shape":"Star-like","Log Number":"US-08112005-0003","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}