{"Sighting Duration":"Undisclosed","Longitude":"-104.818936","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37317.html.txt","/var/www/straped/mufon/more/37317_submitter_file1__zolietree2.jpg","/var/www/straped/mufon/more/37317_submitter_file2__ufocloseup2.jpg","/var/www/straped/mufon/org/37317.html"],"Region":"Wyoming","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.143031,+-104.818936(37317)&iwloc=A&hl=en\"> mufon case (37317) map </A>","Date of the Event":"03/31/2012 12:00 UTC","trends":["There have been 17 other sightings in Cheyenne","There were no other sightings in Cheyenne on or around March 31st 2012","This sighting has never been favorited.",""],"Object Shape":"Disc, Oval","Object Features":"Unknown","divs":["Sighting Details On March 31, 2012 - Last weekend, I was driving just outside of Cheyenne, WY on the I-80. I was just taking a mini road trip with my dog, Zolie, to see tourist spots, etc... I stopped to see the \"Tree in the Rock.\" It is located in between Cheyenne and Laramie. I took a picture of my dog in front of the tree. I did not see anything at the time or even a few days later. Last night, I was making a \"Facebook skin\" with pictures from the trip. When you load the pictures up, they are very zoomed in. This is when I saw it. It looks metallic & a typical \"saucer\" shaped when zoomed in. Some additional information, there are no airports close by or anything that would be in that flight path. It is very rural, etc... F.E. Warren AFB is approx 25 miles away (I work there). I have attached the regular picture and then I zoomed it in and cropped it with just the Windows photo viewer. In the original photo, it is on the upper middle left. It looks just like a black dot. Its very hard to see. But, when you zoom in, you can see it; it is \"saucer\" shaped & perhaps metallic because it appears to give off a reflection. Its better to look at the original & zoom in. When you look at the original picture, there is a small black dot in the upper middle left area. (below the board & under the small whispy cloud). I took the picture on my Iphone4. Thanks :) Location: Buford, WY"],"Country":"United States","Case Number":"37317","Viewing Distance":"Unknown","Date Submitted":"04/09/2012 08:51 UTC","Summary":"UFO in background of Picture?","Disposition":"Unresolved","Object Flight Path":"N/A","City":"Cheyenne","Log Number":"US-04092012-0011","Latitude":"41.143031"}