{"map":"<A HREF = \"http://maps.google.com/maps?q=38.449255,+-122.705384(37316)&iwloc=A&hl=en\"> mufon case (37316) map </A>","Country":"United States","divs":["sighting detailsi was driving past a friends house. not sure why i looked up but i looked up and to my left \"north\" and saw two shiny objects flying side by side. at that point they looked like two black lines like this \"\\ \\\" one on the right looked a little higher, then they spread apart and started moving around each other like they were playing or dancing. now they looked more like a boomerang but with less angle. like birds with no head or tail. they weaved in and out, over and under each other. i had to stop my car there were trees starting to obstruct my view but like they knew i was watching and losing sight one seemed to move back and to the left of the tree so i could see it. the other one was gone. i drove up so i could see better but they were both gone. there was no sound at all, both solid black and shiny. they were very low and seemed very small. i'm not sure if i made the right selection above about the size. they looked big enough for only one person to fit and as low as planes i've seen coming in to land. it was the most amazing maneuvers i have ever seen. they seemed to be having fun."],"Weather Factors":"Unknown","Date Submitted":"04/09/2012 08:20 UTC","Object Shape":"Boomerang, Other","Case Number":"37316","Date of the Event":"04/09/2012 10:35 UTC","Source":"MUFON","Latitude":"38.449255","Log Number":"US-04092012-0010","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around April 9th 2012"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37316.html.txt","/var/www/straped/mufon/org/37316.html"],"Object Features":"None","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Summary":"two black boomerang ufo's","Object Flight Path":"Path with directional change","Tags":"City","Region":"California","City":"Santa Rosa","Longitude":"-122.705384"}