{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Dome","Object Flight Path":"Stationary,Hovering then path,Other","Country":"United States","trends":["There have been 21 other sightings in Laredo","There were no other sightings in Laredo on or around February 6th 2011"],"Source":"MUFON","Region":"Texas","Object Shape":"Circle","Longitude":"-99.673434","Date of the Event":"02/06/2011 12:00 UTC","Date Submitted":"04/09/2012 10:08 UTC","Viewing Distance":"501 Feet - 1 Mile","Latitude":"27.675355","map":"<A HREF = \"http://maps.google.com/maps?q=27.675355,+-99.673434(37325)&iwloc=A&hl=en\"> mufon case (37325) map </A>","files":["/var/www/straped/mufon/html2text/37325.html.txt","/var/www/straped/mufon/org/37325.html"],"City":"Laredo","Tags":"City","Case Number":"37325","Summary":"Amazing specially when I've had 2 similar sightings with two different groups of invites on hunting ranch!","Weather Factors":"Unknown","divs":["Sighting DetailsI was night hunting for hogs with a group of invtes on our hunting lease. After spending a good bit of time out in south Texas night hunting for hogs. On the way back to camp just as we where making it up to the top of one of the senders of the ranch, all my invites and me where completely taken by surprise when a huge flash had just been set off over us. I'm talking about on top of us it looked like god had just taken a panoramic picture and we where in it. It was really cool it looked like stadium lights in the middle of no where. That was the end of my first sighting. one huge flash in the pitch black! Second sighting was even better, me and two different invites are sitting around the camp fire. We had just gotten back to camp after spending the early evening hunting. It was about 10:00pm when there it was again. This time it gave me a better view of what I had seen a few months prior. It was two bright yellow orange light, they looked comparable to two vw beetle head lights in the sky and then one more light poped out and now is hovering in level with the other two. They sat there long enough for me to get to my binoculars and get a better look at what now looks like a yellow disco ball. Ok so now I'm sitting there in total state of shock. The best part obout this hole light show in the sky is when all three lights ball up into just one light remainig same shape in size. That was the same size for obout 30 seconds and then it got tiny in size and whent from yellow orange to bright ruby red and then all the sudden it looked like this thing was a pin ball inside a pinball machine in the sky. And just like that it was gone and had me and my invites looking into the crystal clear night sky's of south Texas. After that that night my invites and me realized that there are some powers of some sort that defiantly are way more advanced than I we are."],"Log Number":"US-04092012-0019"}