{"Latitude":"35.4387","Date of the Event":"04/03/2012 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.4387,+-83.350778(37320)&iwloc=A&hl=en\"> mufon case (37320) map </A>","Sighting Duration":"01:00:00","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/37320.html.txt","/var/www/straped/mufon/more/37320_submitter_file1__tn1-Copy.jpg","/var/www/straped/mufon/more/37320_submitter_file2__tn1.jpg","/var/www/straped/mufon/org/37320.html"],"City":"Whittier","divs":["Sighting DetailsMy stepdaughter just took a trip with family to the North Carolina mountains. She took alot of photos with her Blackberry Playbook. Knowing that i watch UFO stuff on T.V. She just showed me that there are objects in the sky above the mountains in several photos. Well, the device she used allowed me to zoom in quite well. And it seems that whatever it is has an air stream behind it. Well actually its more like coming from the top right of it at an angle. Like its moving downward. Its really crazy! And me being a believer am convinced its a UFO. This is not a joke! And there is a little reflection from the sun on it. I am a little upset i was not there. I asked her if her or anyone else seen it. And she said that she wasn't paying attention and her Grandmother wasn't either. You have to see this! I can't stop looking at it! My girlfriend is trying to download them to this PC as we speak. Not working out to well at the moment. I am not to well with computers."],"Region":"North Carolina","Case Number":"37320","trends":["There have been 3 other sightings in Whittier","There were 3 other sightings in Whittier on or around April 3rd 2012","This sighting has never been favorited.",""],"Tags":"City","Date Submitted":"04/09/2012 09:16 UTC","Summary":"My step-daughter just got back from the mountains. She took alot of photographs with her Blackberry Playbook.And there are objects in them. Uexplained ones!","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-04092012-0014","Viewing Distance":"Unknown","Object Shape":"Disc","Country":"United States","Longitude":"-83.350778","Object Features":"None","Disposition":"Unresolved"}