{"Weather Factors":"Unknown","Source":"MUFON","Region":"New York","Log Number":"US-04092012-0020","files":["/var/www/straped/mufon/html2text/37326.html.txt","/var/www/straped/mufon/more/37326_submitter_file1__DSCF2663.JPG","/var/www/straped/mufon/more/37326_submitter_file2__DSCF2664.JPG","/var/www/straped/mufon/org/37326.html"],"Country":"United States","divs":["Sighting DetailsI am a beginning photography student and my instructor ordered us to take as many pictures as possible so that we could get an idea of how to use our cameras. I had been outside for some time and there was no aircraft in the area, it was kind of peaceful. I happened to spot a cloud that I wanted to capture on my camera. I took two images of the cloud at 4:51pm, in the first I was zoomed in too far but it shows nothing just the cloud. In the few seconds it took me to zoom out something appeared in the next image. They were consecutive images and until this moment I never knew that there was anything other than the cloud in the image. I didn't end up using it for my class so it was forgotten. I was hoping someone skilled might be able to tell me what the image is. I do not have the skill required to bring out the object. I have played with it a little but I can't make it out. The pictures I am providing are the originals the first without the object and the second with. I did not see the object until the image was brought up. It is in the center at the top of cloud in the image that is zoomed out. Did I manage to catch a stealth plane on film? Feel free to let me know if you figure it out."],"Longitude":"-75.319102","Sighting Duration":"00:00:10","Viewing Distance":"Unknown","Object Shape":"Bullet, Missile","Tags":"City","City":"Rensselaer Falls","Date of the Event":"03/20/2012 04:51 UTC","Disposition":"Unresolved","Case Number":"37326","Object Flight Path":"Straight-line path","Date Submitted":"04/09/2012 10:09 UTC","Object Features":"None","Latitude":"44.592006","map":"<A HREF = \"http://maps.google.com/maps?q=44.592006,+-75.319102(37326)&iwloc=A&hl=en\"> mufon case (37326) map </A>","trends":["There have been no other sightings in Rensselaer Falls","This sighting has never been favorited."],"Summary":"Just Taking Pictures"}