{"Sighting Duration":"Undisclosed","Country":"United Kingdom","Date Submitted":"08/31/1958 12:00 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/3732.html.txt","/var/www/straped/mufon/org/3732.html"],"Weather Factors":"None","City":"Rotherham","map":"<A HREF = \"http://maps.google.com/maps?q=53.432604,+-1.363501(3732)&iwloc=A&hl=en\"> mufon case (3732) map </A>","Case Number":"3732","Tags":"City","Source":"MUFON","trends":["There have been 2 other sightings in Rotherham","There were no other sightings in Rotherham on or around August 31st 1958"],"Object Flight Path":"Path with directional change","Date of the Event":"08/31/1958 12:00 UTC","Latitude":"53.432604","Region":"England","Object Shape":"Disc","Disposition":"Unresolved","Summary":"light moving at terrific speed, very high, changed direction 90 deg abruptly, NOT on a curve.","Longitude":"-1.363501","Object Features":"Unknown","Log Number":"GB-08132005-0002","divs":["Sighting DetailsTaking a break from an all-night card sesion, about 2-00am my friend and I went outside for some fresh air. It was a crystal clear night and on looking up at the stars, saw a bright light - a shade more yellow than a star, moving at very high speed. We both remarked \"He's moving fast\", thinking it was an aeroplane. It then did a 90 degree turn, though \"turn\" is the wrong word. Without slowing down it sped off its original course at an acute 90 degrees and disappeared after traveling a short distance. My friend and I looked at each other and quickly went indoors. The \"turn\" wasn't a turn as an aircraft would make, and I still know of nothing on this earth that can make a acute 90 degree change in direction without slowing down. The object appeared to be a fraction larger than the North Star. Hard to guess the height - maybe 60,000ft. Neither of us had been drinking, or taking any drugs. I estimate the object was traveling from north to south when first seen, then abruptly turned west and vanished. I have never heard of a UFO making such a change in direction which is why I have never reported this happening before. There was no sound during the event."]}