{"Region":"Illinois","Object Shape":"Disc, Sphere, Star-like, Other, Unknown","Tags":"City","trends":["There have been 2 other sightings in Wadsworth","There were no other sightings in Wadsworth on or around April 9th 2012","This sighting has never been favorited.",""],"Latitude":"42.409978","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Log Number":"US-04092012-0018","Source":"MUFON","Date of the Event":"04/09/2012 07:15 UTC","Summary":"Saw what looked kinda like a star, after I shot the 1st photos & looked back up it had split into 2 streams of pink light traveling like a shooting star.","Object Features":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37324.html.txt","/var/www/straped/mufon/more/37324_submitter_file1__IMG_0959.JPG","/var/www/straped/mufon/more/37324_submitter_file2__IMG_0961.JPG","/var/www/straped/mufon/more/37324_submitter_file3__IMG_0962.JPG","/var/www/straped/mufon/org/37324.html"],"Longitude":"-87.917124","Case Number":"37324","Weather Factors":"Unknown","divs":["sighting detailsi was driving home and thought i saw a couple things, but then had to check my sanity - the 1st was what looked like a very short chemtrail - it could've been a cloud, but it was tiny and straight. i thought i saw it hovering and it looked like the \"typical\" flying saucer. then it was gone, nothing in the sky at that place, not even the \"cloud\". i saw what looked like a plane maybe 20 ft down the road & pulled over to take a picture. it was sooo small and looked like it could be a airplane, so i decided not to take a picture. when i looked back up it appeared to have gone in a circle. i thought planes didn't do that. there is a small airport nearby (within 5-10 miles) & a major airport about 35 miles away. i got back on the road & turned in my subdivision. this \"star\" caught my eye, because it looked \"fake\" or placed somehow, like a sky prop. i stopped to take a picture in the day time because the sun was setting. when i looked back to the sky after taking the first 3 photos rapidly, it had turned pink\\rose & split into 2 streams side by side. i rapidly took more photos until i looked up again (without the camera) & it had disappeared. not even another half mile towards my home, i saw it again - or another one. the same short stream of light, like a firework or shooting star - but pink. what is this? i have photos from my iphone."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.409978,+-87.917124(37324)&iwloc=A&hl=en\"> mufon case (37324) map </A>","Viewing Distance":"Unknown","Date Submitted":"04/09/2012 09:58 UTC","Country":"United States","City":"Wadsworth"}