{"Viewing Distance":"101-500 Feet","Tags":"City","Latitude":"29.690576","Country":"United States","Case Number":"37323","Summary":"Two Glowing orbs changing colors","Weather Factors":"Unknown","Region":"Louisiana","Source":"MUFON","Log Number":"US-04092012-0017","Date of the Event":"09/10/2003 02:00 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=29.690576,+-91.052132(37323)&iwloc=A&hl=en\"> mufon case (37323) map </A>","divs":["Sighting DetailsDriving north along Hwy 662 in Bayou L'ourse, I saw two lights in the sky just above the Texas gas plant. The two glowing orbs was about 10 feet wide and they were changing colors randomly blue, red, green, orange, white...As I got just in front of the gas plant one object turned blue and darted to the east in a ziz-zag path...It darted left-then right and them it was gone in a streak...the other came over the road and hovered above me. I could look up and see it at the top of my windshield. It continued to change colors but had a white glow to the other edge of the round orb shape. I was afraid to let it follow me home..so I kept driving toward Labadieville on hwy 398. It stayed above me just above the tree tops along the road. It didn't make any sound it was a ball of light which had an eternal glowing light changing to blue, white, green, red, just about every color known. It was beautiful...Just as I was calming down and getting more interested in what it was...it moved higher and faster and continued till it went out of sight...The time from the fist sighting to when the second one went out of sight was no longer 10-12 minutes. I only wish I had a way to record what I experienced...I know no one would believe me."],"Sighting Duration":"Undisclosed","Date Submitted":"04/09/2012 09:48 UTC","Longitude":"-91.052132","Object Shape":"Sphere","trends":["There have been no other sightings in Morgan City","This sighting has never been favorited."],"Object Features":"None","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/37323.html.txt","/var/www/straped/mufon/org/37323.html"],"City":"Morgan City"}