{"trends":["There have been 21 other sightings in Bethlehem","There were no other sightings in Bethlehem on or around April 9th 2012"],"Date Submitted":"04/10/2012 12:54 UTC","files":["/var/www/straped/mufon/html2text/37339.html.txt","/var/www/straped/mufon/org/37339.html"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"00:02:00","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.633732,+-75.367508(37339)&iwloc=A&hl=en\"> mufon case (37339) map </A>","Viewing Distance":"Unknown","Object Shape":"Sphere, Unknown","Latitude":"40.633732","City":"Bethlehem","Disposition":"Unresolved","divs":["Sighting DetailsJust after Mad Tv ahd started on Cartoon Network, i noticed an unusual* object traversing the sky. (living near an international airport and a hospitals with helicopter landing zones, seeing aircraft is NOT unusual. But this was on a flightpath that didn't conform to typical ones used frequently by commmercial or emergengy medical aviation.)The path it took was strikingly smooth, steady, and, again, did not travel in a speed or manner indicative of conventional aircraft. It's size, altitude, speed were impossible to determine with my limited level of instrumentation (binoculars) at my disposal. i can only analogyze it's appearance to a soft, white LED bulb glow, steady in both consistency and brightness. PLEASE NOTE: the object crossed my line of sight from nearly horizon to horizon, over a time period of approximately two to four minutes, giving me the vantage point of viewing it from several angles, and with contrast of several visible stars, planets, and conventional aircraft. This object displayed NO FAA directional, formation, or static or flashing navigation lights, as is nearly always seen on typical aircraft, leading me to theorize it could possibly be the solar albedo reflecting off a man-made satellite, or asteroid. (again, lack of accurate size perspective made it nearly impossible to estimate whether it was an airborne craft, or orbiting object). Using a pair of Barska 10 x 42 binoculars did little to clarify any mysteries, as i found it difficult to get a precise focus on the object, leaving me uncertain if i could see a solid mass behind the illuminated area, or it was merely an optical or atmospheric anomaly. When i took my gaze off the object to focus in on nearby aircraft, stars, and planets for a control comparison, i was unable to reaquire the object, leaving me perplexed as to if it altered course, dimmed, turned off, or changed the direcion of the light, or simply passed through enough atmosphere so as to be rendered unvisible to me. i heard no sound i could attribute to the object, nor could i detect any exhaust, or any other effects on surrounding space, matter, persons, animals, etc. i was unable to find anyone else that also witnessed it to confirm, support, or add to my report."],"Tags":"City","Object Features":"Unknown","Case Number":"37339","Log Number":"US-04102012-0003","Summary":"LED-like soft white light or albedo on steady (orbital?) flightpath","Region":"Pennsylvania","Date of the Event":"04/09/2012 08:40 UTC","Country":"United States","Longitude":"-75.367508"}