{"Case Number":"37344","Country":"United States","Region":"North Carolina","Date Submitted":"04/10/2012 11:04 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.225394,+-82.429564(37344)&iwloc=A&hl=en\"> mufon case (37344) map </A>","Weather Factors":"Unknown","Object Flight Path":"Stationary","Object Shape":"Sphere","Log Number":"US-04102012-0008","Source":"MUFON","Longitude":"-82.429564","Latitude":"35.225394","Object Features":"None","City":"Tuxedo","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/37344.html.txt","/var/www/straped/mufon/org/37344.html"],"divs":["sighting detailsi was a retail store manager for a well-known corporation and was returning home to asheville, nc from a business trip in the greenville, sc area. it was near 9:30pm on monday, april 27th of '09. i was alone, traveling along us 25 heading toward i-26 and had crossed the state line not long before this sighting. i noticed the craft ahead of me; it caught my attention because of the unusual lights, how low it was and how close it was to the road. as i got closer to it, i became sure that this wasn't any type of standard aircraft i'd ever seen before. it was round\\ball-shaped with two red lights on either side, center, and a row of at least 3 rectangular light panels on the bottom half which were strobing slowly in vertical sequence, from the top one down. it was about the size of the cab section of an 18-wheel truck. i estimate it was approximately 50 feet in the air, on the right side and just slightly over the road. it did not move at all, and as far as i could tell, it remained stationary the entire time i had visual contact with it. i had the radio playing and did not have the presence of mind to turn it off or down, so i am unaware if the craft made any type of noise. i did briefly consider stopping to try and take a picture, but the only thing i had with me was an older cell phone which previous experience taught me did not take decent pictures at night at all. i slowed my vehicle quite a bit as i approached in order to get a better look at it, being both fascinated but understandably a little shaken, too. in my rearview mirror, i previously had noted that another car was coming up behind me. i was driving quite slowly, so with that in mind, i sped up slightly to prevent annoying the other driver and finally drove past the craft, which still never moved from its position. once past it, i looked in my mirror again and was dismayed to see that the car i'd seen behind me was no longer there--i'm not sure if the other driver had seen what i was seeing and pulled off or had exited the road somewhere--but i became immediately aware that i was now totally alone on the road, with no cars whatsoever in sight in either direction. this finished unnerving me and while i no longer saw the craft, i suddenly felt the need to at least be within sight of other cars\\people, so i accelerated to appx 70-75 mph and stayed at that speed until i finally caught up to more cars about five minutes later."],"trends":["There have been no other sightings in Tuxedo","This sighting has been favorited 1 time."],"Date of the Event":"04/27/2009 09:30 UTC","Disposition":"Unresolved","Summary":"Metal Ball with Flashing Lights Hovering Next to US 25 in Henderson County, NC"}