{"Object Features":"Other","Log Number":"US-04102012-0021","files":["/var/www/straped/mufon/html2text/37358.html.txt","/var/www/straped/mufon/org/37358.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.35082,+-81.633281(37358)&iwloc=A&hl=en\"> mufon case (37358) map </A>","Date of the Event":"01/14/1998 12:00 UTC","Country":"United States","Date Submitted":"04/10/2012 10:24 UTC","City":"Charleston","Sighting Duration":"Undisclosed","Tags":"City","Region":"West Virginia","Longitude":"-81.633281","Disposition":"Unresolved","Object Flight Path":"Stationary","Latitude":"38.35082","Case Number":"37358","Summary":"It was shaped like a chrome derby hat and along the so call brim was the colored lights gliding back and forth along the so call brim.","Weather Factors":"Unknown","Object Shape":"Other","Viewing Distance":"21-100 Feet","trends":["There have been 13 other sightings in Charleston","There were no other sightings in Charleston on or around January 14th 1998"],"Source":"MUFON","divs":["Sighting DetailsIt was winter weather. Small amount of snow on the ground and cold. I was in my husbands car , passenger side with him driving.We had just left the Cinema in Kanawha City where we went to celebrate our wedding anniversary. I saw the object stationary beside the interstate overpass(West bound Lane) in front of the Charleston, WV, State Capitol. One week later, again, I saw the same object stationary over the sand and stone pit beside the Dunbar Interstate bridge(East Bound Lane) about the same distance away from the interstate as the other one I saw. They were both sighted by myself only. My husband was too busy driving to get a look at them both times. It was late afternoon each time. The one next to the Dunbar Interstate bridge was partially surrounded by the fog caused by the snowy weather at that time. But I could still tell it was the same type of craft. The one at the State Capitol was totally exposed. They both were about the size of a large bulldozer.The first thing I noticed about them was they were so close to the bridges and so beautiful. Shaped exactly like a chrome shaped derby hat with Christmas type lights moving gracefully along the brim- back and forth. I couldn't believe the newspapers or tv never had any reports of them. There was plenty of traffic both times. I wanted my husband to stop the car but he refused because of the traffic and weather. The crafts never seemed to move. To this day , I still hope to see them again. I've never seen or heard of any craft of these descriptions in the news, internet, or paper. I'm very surprised. I was brought up a very religious person and you wonder about stories such as this. But I believe what I saw was real and not man made and was really beautiful."]}