{"files":["/var/www/straped/mufon/html2text/37361.html.txt","/var/www/straped/mufon/org/37361.html"],"Log Number":"US-04102012-0024","Date Submitted":"04/10/2012 11:20 UTC","Longitude":"-117.019659","Region":"California","Country":"United States","Date of the Event":"04/10/2012 07:50 UTC","divs":["Sighting DetailsI was on my back porch, smoking a cigarette, when I looked to the stars (as I always do) and noticed a star-like \"object\" that appeared to be on the move. I did a double-take, as stars do not move, and realized that yes, this star was moving. Curious, I followed it with my eyes and watched as it turned left. Aware that this was no longer just some anomaly of the skies, and also aware that the \"star\" was going to pass over my townhome and out of sight, I ran inside to retrieve my camera and flew down the steps from my living room to my front door to confront the \"star\" again. I began filming but was frustrated that I had to zoom in as much as I did just to get it into view. Long story short, there was no backdrop there to confirm it was even moving, so that's not good, and a car started to creep up on my left side... here in my community there is zero room to maneuver and park cars. I had to move out of the way, and in doing so became frustrated and just turned the camera off. I wish I hadn't. For about 30 more seconds I just watched this \"star\" as it continued to glide into the distance... It was strange how, as I watched it, that I realized if I were someone who had just come outside, this \"star\" would not now appear as anything unusual... I could no longer see a flight path. Anyways, as I watched the \"star\" suddenly disappeared. It just \"blinked out\". One second it was there, floating across the sky, the second, it simply ceased to exist. I am troubled by this. Did anyone else in the San Diego area see it?"],"Object Features":"Undisclosed","Object Shape":"Star-like","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.755482,+-117.019659(37361)&iwloc=A&hl=en\"> mufon case (37361) map </A>","Disposition":"Unresolved","trends":["There have been 13 other sightings in La Mesa","There were no other sightings in La Mesa on or around April 10th 2012"],"Viewing Distance":"501 Feet - 1 Mile","City":"La Mesa","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"37361","Object Flight Path":"Path with directional change","Latitude":"32.755482","Summary":"Saw what looked like a star. It was moving, not quickly, and changed direction and flew off into the distance where it just \"turned off\". It was there in the distance, looking like a star that was flying away, and then it \"blinked out\"."}