{"City":"Apache Junction","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"None","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/37362.html.txt","/var/www/straped/mufon/org/37362.html"],"Summary":"past 6 weeks, extremely tiny lights that blink, fly in dark room, intelligent, curious, communicate w/each other,t","Source":"MUFON","Latitude":"33.413656","Tags":"City","Date of the Event":"03/01/2012 01:59 UTC","trends":["There have been 16 other sightings in Apache Junction","There were 2 other sightings in Apache Junction on or around March 1st 2012"],"Date Submitted":"04/10/2012 11:59 UTC","Case Number":"37362","Disposition":"Unresolved","Viewing Distance":"Unknown","Log Number":"US-04102012-0025","divs":["sighting details i know people will not believe me but i am being studied by tiny entities nightly, as soon as the lites go out in my bedroom. when this first happened, light translucent clouds started appearing hanging from ceiling in strands. i could blow at them and they would move. i could gently touch them and move them. the next week or so these sort of vine-like plants would grow around the room with thin leaves that were semi-transparent and fluttered. now, for the past 2 weeks i see little clusters of lights no more than a total outside dimension of 1\". there are red, blue, green, white, etc. after studying them each night i am sure they are intelligent. the white dots slowly move around the room, mostly on the ceiling. these seem to be following orders from the nests of colored dots as they blink quickly and then glow constantly until the next movement. i can chase them with a flashlite and they don't like it. one time one came as close as a foot from my face and studied me for about 30 seconds. i kept calm and stared back smiling. it looked like a tiny 1\\4\" red flower (daisy-like shaped) with a cloudy aura around it about two inches wide. i have not heard of any type of ufo that fits this description. i'm reluctant to even report this. i will be in portland for 5 weeks beginning tomorrow. i will try to take pictures of them when i get back if they are still here. it will be interesting to see if they show up on a digital picture. has anyone ever reported anything like this to your organization? the minuteness of them is quite different, almost molecular. it was hard to fill out your sighting form because they don't fit."],"Country":"United States","Longitude":"-111.528764","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.413656,+-111.528764(37362)&iwloc=A&hl=en\"> mufon case (37362) map </A>","Object Shape":"Other"}