{"Longitude":"-84.155278","map":"<A HREF = \"http://maps.google.com/maps?q=9.409722,+-84.155278(37375)&iwloc=A&hl=en\"> mufon case (37375) map </A>","City":"Manuel Antonio","Object Shape":"Star-like","Object Flight Path":"Path with directional change","Tags":"City","files":["/var/www/straped/mufon/html2text/37375.html.txt","/var/www/straped/mufon/org/37375.html"],"trends":["There have been no other sightings in Manuel Antonio","This sighting has never been favorited."],"Weather Factors":"Unknown","Case Number":"37375","Source":"MUFON","Date Submitted":"04/11/2012 08:43 UTC","Viewing Distance":"Unknown","Region":"Puntarenas","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date of the Event":"02/13/2012 12:00 UTC","Latitude":"9.409722","Log Number":"CR-04112012-0012","Country":"Costa Rica","divs":["sighting detailswe were in manuel antonio, costa rica on our hotel room balcony around 11:00pm at night on 2\\13\\2013. our hotel was set up on the side of a cliff overlooking the pacific ocean. we were sitting outside enjoying a beautiful night and looking at a very starry sky. we first noticed the object when what we thought was just one of the many stars we were looking at starting to move. it started to accelerate and move up at a great rate of speed, weaving in a cross motion. when i first saw the object i was unsure what it was, but after watching for a few seconds it was absolutely apparent that it was not an airplane or comet etc...my first thought is that it was a ufo. the object was star like, very bright white light and round. it was very far away over the ocean but was still clear to our line of sight. we were very shocked when we saw the object, and my girlfriend was very scarred. the next day there was a magnitude 6.4 earthquake very close to manuel antonio. we lost sight of the object as it traveled up into the sky towards outer space (similar to a rocket launch) until it was no longer visible."],"Disposition":"Unresolved","Summary":"We saw what we thought was a star in the night sky move at great speed in multiple directions in Costa Rica."}