{"Summary":"3 witnessed bright star-like object appear from high altitude with extreme velocity. Rate of speed then dramatically slowed to near stop, then accelerating across sky before vanishing upward.","Country":"United States","Case Number":"37373","Longitude":"-120.596487","Log Number":"US-04112012-0010","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Date of the Event":"12/04/2010 08:15 UTC","trends":["There have been 2 other sightings in Arroyo Grande","There were no other sightings in Arroyo Grande on or around December 4th 2010"],"City":"Arroyo Grande","Object Shape":"Sphere, Star-like, Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.067463,+-120.596487(37373)&iwloc=A&hl=en\"> mufon case (37373) map </A>","Latitude":"35.067463","files":["/var/www/straped/mufon/html2text/37373.html.txt","/var/www/straped/mufon/org/37373.html"],"Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Path with directional change,Other","Date Submitted":"04/11/2012 08:14 UTC","Weather Factors":"Unknown","Object Features":"None","Region":"California","divs":["Sighting DetailsI just found this website but had I known of this site when this event happened, the exact date and time could have been clarified through cell phone history. So excuse me for the approx. date and time for it was over a year and a half ago. In the early month of December of 2010 around 8:00-9:00pm, two of my friends and I were just finishing up a long day of work on his father's home remodeling. The weather forecast that night was predicting rain for the next morning, so it was important that we made sure to protect the exposed walls, surrounding materials, ect. from any excessive moisture expected from the downpour. So us three were tacking a vinyl construction tarp to the roof eave to prevent water entering through the exposed exterior wall. After we finishing wrapping things up, we all met at the tailgate of the pickup truck to discuss tomorrow's plan. This is when the sighting happened. First I'd like to state the important description of that evening's night sky. Yes rain was predicted for the following morning. However, the sky that night was EXTREMELY clear and I DON'T recall the moon being very prominent either(if the moon was even out that night). The location was just outside of the city which makes the night sky even more detailed as you all know. So that said, thousands of stars and star clusters littered the sky this night with not a rain cloud in sight yet. So now back to the three of us discussing tomorrow's plan at the tailgate of the pickup... As we all stood there looking at each other(not the sky), a VERY bright-lit object came into my peripheral vision which grabbed my instant attention. And not just mine, I recall all three of us turning our attention to this bright object at the same time. My other two friends recall the same exact scenario which makes it interesting because it describes the action and detail of how powerful this object really was. It had absolutely NO blinking lights and the star bright \"white\" was unwavering(constant). It appeared to perhaps, enter our atmosphere at a high rate of speed. It made a quick swooping-like angle of direction as if it were leveling out. The speed and star-like brightness was indescribable to anything man made! After it seemed to level out(if you will), it then seemed to slow down at a rate that was definitely not normal. With much enthusiasm in our voices, we shouted to each other things like, \"What is that?!\" \"Is it a plane!\" \"No way a plane can't slow down like that!\" \"A plane doesn't emit light like that!\" \"Then what is it?!\" Stuff like that. (Take into consideration that only about 15 seconds have passed now.) So this is when things got really weird, exciting, ect! Next we heard what sounded to be like a helicopter or train(both of which have frequent routes close to this home). I said to my friends, \"Whatever that is it's not making that sound. That thing is way to high to be making that sound.\" That's when a helicopter appeared from the perimeter lying trees of the property. It flew directly over us at about ONLY 1,500 feet(which was obviously the sound we heard). This gave the three of us our own personal gauge of just how high this object really was. Think of the object as the size of an aspirin in your fingers holding it up to the sky with a helicopter flying over you. But far off in the distance of the large helo(I assume this object was easily above the 35,000 to 37,000 feet altitude in which passenger jets fly at). At this moment the object was moving very slow(it never stopped completely). After the helo passed and was gone...the slow moving \"star\" began to accelerate from it's sluggish stall. Because of the TALL trees I mentioned on the property that were only about 20 feet away from us, the object began to fly in a direction in which the trees were blocking it. I instantly began running out of the driveway to keep my eyes on this thing. Meanwhile my friend jumped the fence and ran through the group of trees to the highway which was a totally different direction I took. Me, running down the driveway in a panic I pulled my phone out of my pocket and just pressed SEND to call whoever the last person in my call history. It could've been anyone. My family friend answered to me yelling frantically \"Look in the sky, look in the sky!!!\" I hung up and as I got to the end of the driveway the object was traveling at such a fast rate compared to that of a passenger jet we see in the sky! It again...made a swooping-like angle of direction this time UPWARDS as if it were leaving our atmosphere! During the quick change of direction it accelerated so fast that it just disappeared!!! I waited for a while before walking back to the truck hoping to see it again. When I got back to the pickup, all of us three could barely talk in turns...let alone make sense of what we just saw. After about two hours we were able to take turns and describe the situation and all three of us witnessed the EXACT same thing. My buddy that ran to the highway said he too saw it fly \"upwards before disappearing.\" To this day I KNOW that what I saw in the sky that night is something that no one can explain. I've been put down as if I were a whack job. Things have been said to me like \"Oh you just saw a satellite.\" NO I've seen satellites and as well as the space station! We all know satellites don't move with those variable rates of extreme travel, Nor does the space station. I've also been told by a website I won't mention here that what I saw was a phenomenon called \"Ball Lighting.\" Well I know the theory behind ball lighting(now) and that theory for this detailed incident is just absurd! I understand that many things are misidentified can be explained. But this here, I am one hundred percent sure that what I saw moved at speeds of which man cannot travel(not yet at least). This wasn't man made! It's important too that I mention that this occurred not too far from a military base. Vandenberg Air Force Base to be exact. Although I AM POSITIVE this wasn't military activity. Far too advanced to be human. That six percent of truly unidentifiable flying objects...this is DEFINITELY in that six percent. My hope now is that someone else in my area recalls seeing this dominant object in the sky that night and shares their story as well. All three of us still to this day KNOW we CANNOT be the only ones who witnessed this thing in the sky that night."]}