{"Latitude":"41.008869","Weather Factors":"Unknown","Date Submitted":"04/11/2012 01:09 UTC","files":["/var/www/straped/mufon/html2text/37382.html.txt","/var/www/straped/mufon/org/37382.html"],"Country":"United States","Object Features":"None","Case Number":"37382","City":"Red Oak","Tags":"City","Date of the Event":"04/08/2012 12:00 UTC","Longitude":"-95.226653","trends":["There has been one other sighting in Red Oak","There was one other sighting in Red Oak on or around April 8th 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Region":"Iowa","Viewing Distance":"20 Feet or Less","Object Flight Path":"Hovering then path","Log Number":"US-04112012-0018","divs":["Sighting DetailsAbout a month ago my 10 year old son and his brother woke me up by screaming for me to come to there bedroom,I checked on them and they told me they saw a bright blue light blind them inside the room,and when they got up and looked out the window they saw a small disk type object flying away from our home,my son said it was about the size of a yard stick. I told them at the time they must have seen an emergency vehicle going down the street and insisted that they just go to bed. On the 9th of this month we were all up late hanging out,My wife and I heard a noise coming from that bedroom,thinking it might be a ghost,because we live in a 102 yr old funeral home,we grab our ipod touches and digital voice recorder and open the door,not turning the light on. We enter the room and stay to the right wall of the room and stay standing in one position with my video recording in front of my face. We are talking out loud thinking that we may have a ghost in the home,and after a few minutes we leave the room. upon reviewing the recording that night we first hear as i enter the room my self what i can only describe as frogs croaking,mixed with an insect clicking language speech sound. It is loud but we did not hear it with our ears at the time. The video shows some sort of being what we first thought was a ghost of a kid or midget. we then see what appears to be a disk enter the room and hover above the white being and it zips left and right and then down on top of the main figure. we also notice at this time there seems to be a cloud or white energy ring being formed around the being,it seems to us that there are other beings in the room behind this one that has large almond eyes,typical larger head with small chin. then we notice when we frame by frame the video the disk zips up and left of me at an angle and this time we see it as a bright led neon plasma blue color as the beings are \"sucked into it or are just leaving with it\"? we still don't know for sure what we see but we for sure have this speech recorded and it is loud and very clear. We have no clue as to if we are really seeing this or not,were hoping its just our imagination because this is very frighting and too close to home we know the video on the ipod isnt perfect but we thought we were just going to document toys being moved by what we thought may have been a spirit in our sons room. the speech is what really has me convinced it is alien in nature I would gladly post the audio of this to anyone that wants to hear it. We are weeks away from having a baby and dont know if they are here for that reason or that they were doing something that has nothing to do with us at all,but my sons story a month prior now seems more believable to us all now,were all 6 sleeping in one bedroom together now and are moving out as soon as we can."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.008869,+-95.226653(37382)&iwloc=A&hl=en\"> mufon case (37382) map </A>","Object Shape":"Disc","Source":"MUFON","Summary":"in bedoroom we recorded a small disk hovering and decending near the floor","Sighting Duration":"Undisclosed"}