{"Disposition":"Unresolved","City":"Guasave","Country":"Mexico","Source":"MUFON","Weather Factors":"Unknown","Summary":"Walking with my cousin on the streets and then observed the object. I thought first it was a plane, but it started moving rarely and with an irregular path, then saw it on different parts of the sky.","Tags":"City","Object Features":"Dome","Object Flight Path":"Hovering then path,Path then hovering,Other","Longitude":"-108.469544","trends":["There have been no other sightings in Guasave","This sighting has never been favorited."],"Object Shape":"Disc, Saturn-like","map":"<A HREF = \"http://maps.google.com/maps?q=25.593013,+-108.469544(37387)&iwloc=A&hl=en\"> mufon case (37387) map </A>","files":["/var/www/straped/mufon/html2text/37387.html.txt","/var/www/straped/mufon/org/37387.html"],"Viewing Distance":"Unknown","Date of the Event":"04/10/2012 09:30 UTC","Region":"Sinaloa","Latitude":"25.593013","Case Number":"37387","divs":["Sighting DetailsI was at my grandma`s house at La Brecha, a small town where a lot of agricultorists and fishers live.. Then my cousin invited me to go take a walk, which we do regularly when we are in La Brecha. We walked a few streets and got to the main street. There, we found another cousin and his friend. His friend took his bike and departed. We were talking about the beach and the hot weather, etc. I looked to the sky and saw a moving light. At first, I thought it was a plane or a helicopter plane, but then I saw it descended and then going up again ina very rare way. It surprised me because it happened very fast. I told both of my cousins and they looked up. My cousin then followed his friend and went home. We moved to another street to observe it better and then we walked toward it until we could see it better. We talked about calling History Channel and bringing them down here, still kind of not believing what we were seeing. I had seen a lot of UFO videos and always wanted to see one, but I doubted. All my doubts flew away when we saw it disappear, then we looked around to relocate it and found it moved about 120 degrees in a very short time. I was not scared but amazed. I asked my cousin if she had a cellphone or a camera to record it or take pictures but she did not. We kept walking and as we moved we could see it better. It looked exactly as a flying saucer. The light illuminated a little the shape of teh top of the object. We headed back home and I think we saw another one or two objects similar to the previous, but fastly disappeared. We got home and told our family what we saw. Some of them believed us and went outside to see if they could see it or take pictures, but it wasn`t there anymore."],"Sighting Duration":"Undisclosed","Date Submitted":"04/11/2012 06:42 UTC","Log Number":"MX-04112012-0023"}