{"Log Number":"CA-08152005-0003","City":"Lac St-Marie","Tags":"City","Object Shape":"Cylinder","Date Submitted":"08/13/2005 06:58 UTC","Longitude":"-72.10333","Viewing Distance":"Over One Mile","Source":"MUFON","Date of the Event":"08/13/2005 06:58 UTC","Case Number":"3738","Summary":"High speed cylindrical object flying at high altitude. No visible wings on craft, no sound emitted, no contrail observed.","trends":["There have been no other sightings in Lac St-Marie","This sighting has never been favorited."],"Latitude":"48.572787","files":["/var/www/straped/mufon/html2text/3738.html.txt","/var/www/straped/mufon/org/3738.html"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"Quebec","Weather Factors":"Unknown","divs":["Sighting DetailsMy girlfriend and I were sitting on the deck of a cottage in the early evening on Saturday August 13, 2005 when she noticed an unusual object in the sky overhead. We both observed an object which was cylindrical and highly reflective, move through the sky at very high speed. What struck us was the definite impression that the object was at a very high altitude, seemed not to have wings, made no sound at all and there was no contrail coming from it as one would normally observe with a jet aircraft. It moved very quickly on a west to east axis and veered out of our view after having made a sharp southward turn. Our view of the sky was limited by trees to the west and the balcony of the cottage to the east. That was the extent of our sighting. We both agreed that what we had seen was not like any aircraft either of us had preciously seen. I noted the time on my watch, it was 18:58 pm. The whole event lasted at most 20 seconds - if that. The weather as clear and the portion of the sky in which we observed the object was cloudless."],"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=48.572787,+-72.10333(3738)&iwloc=A&hl=en\"> mufon case (3738) map </A>","Country":"Canada","Object Features":"None"}