{"Summary":"Triangle shaped, almost silent","Region":"Texas","Object Features":"Undisclosed","Object Shape":"Triangle","Log Number":"US-04112012-0019","Date Submitted":"04/11/2012 11:58 UTC","Latitude":"29.379386","map":"<A HREF = \"http://maps.google.com/maps?q=29.379386,+-100.894417(37381)&iwloc=A&hl=en\"> mufon case (37381) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37381.html.txt","/var/www/straped/mufon/org/37381.html"],"trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around April 8th 1985"],"Source":"MUFON","Longitude":"-100.894417","Viewing Distance":"101-500 Feet","Country":"United States","Tags":"City","Date of the Event":"04/08/1985 09:00 UTC","Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path","City":"Del Rio","divs":["Sighting DetailsAround 1985, A friend and i were sitting on our bikes in the middle of the neighborhood street. We were facing north. It was night time, so there was no traffic and everyone was in for the night. We both heard a subtle noise like an air leak or a subtle swishing sound. For some reason, we both knew to look up. Even though the noise was subtle, we could tell which way it was coming from. We saw a large triangle shape of dim lights about the size of maybe a football field. It was hard to tell the actual size because the object was being hidden by the stars. But it was close enough to to hear it. It was moving north west. It wasnt moving very fast. I remember being able to see right through it and see the stars. It was strange that the triangle shape of lights were visually the same size of the stars in the sky that we were seeing form our altitude. Its as if the object had adjusted its light size in order to blend in with the size of the stars that we were seeing. We ran inside frightened. We came out about 15 minutes later and never saw it again. In 1993 or 94, I remember watching the Larry King show that he aired from the desert near Roswell. He had a bunch of UFO experts on the show. It just so happens that someone called into that show and described the exact thing that I had seen and heard but in a different part of the country about 8 years later. I was shocked."],"Case Number":"37381"}