{"Date Submitted":"07/15/2005 07:00 UTC","divs":["Sighting DetailsThere was about ten people in our swimming pool. The kids noticed them first. They were yelling \"look at those things up there!\" About twenty witnesses inside and out of the pool all looked up to see two metallic objects traveling west.I have never seen anything like it in my life. Bear in mind I dont beleive in ufo stuff. They looked like mercury from a thermometer, and seemed to change color from white to silver. One stopped and one accelerated west very very quickly. The one that stopped hovered for about a minute and a half. Neighbors scrambled to get cameras from inside their houses. The object then accelerated extremely quickly east, until it disappeared from the horizon. Nobody was able to get pictures. I shrugged it off as strange, and got out of the pool.Not twenty seconds later. Another resident said \"look, there back!\" we all looked up in the south western sky to see three objects in a triangle shaped formation hovering. You could tell the objects were very far away and very high in the atmosphere. They stayed in the same place for about two minutes or so. they then vanished as it seemed they moved south almost instantly. every body was kind of frantic when we spotted the first two. The mood changed with the second group of three to a quiet dumbfoundedness. All the adult witnesses were kind of walking up to eachother and reassuring ourselves, \"Did you see that?\" I guess we wanted to make sure we werent crazy. I have never, never seen or even thought I would ever see anything like that. I feel the other witnesses felt the same. Im scared and I think the other people are too. We do not discuss the incident when we speak. Everybody who saw those things that day seem quieter and more humble. The woman who snapped pictures of the second group of objects showed us the photos with nothing but the sky in them. When she clearly took the pictures of them corectly. The objects didnt develop on the digital film."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.70724,+-105.079943(3739)&iwloc=A&hl=en\"> mufon case (3739) map </A>","Log Number":"US-08162005-0001","Latitude":"39.70724","Object Shape":"Oval, Teardrop","Longitude":"-105.079943","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Tags":"City","Disposition":"Hoax","Weather Factors":"None","Summary":"Not Provided","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around July 15th 2005","This sighting has never been favorited.",""],"Case Number":"3739","Region":"Colorado","Date of the Event":"07/15/2005 07:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3739.html.txt","/var/www/straped/mufon/more/3739_submitter_file1__100_0374.JPG","/var/www/straped/mufon/org/3739.html"],"Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None","Sighting Duration":"00:05:00","City":"Lakewood"}