{"Log Number":"US-04122012-0001","Date Submitted":"04/12/2012 12:00 UTC","Sighting Duration":"01:00:00","Source":"MUFON","Object Flight Path":"Stationary","Summary":"like a large star - amber - had been present for month - same location- disappeared tonight","Weather Factors":"Unknown","Tags":"City","Longitude":"-77.93432","Country":"United States","Case Number":"37394","Object Shape":"Star-like","Latitude":"39.450896","Region":"West Virginia","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.450896,+-77.93432(37394)&iwloc=A&hl=en\"> mufon case (37394) map </A>","Viewing Distance":"Unknown","City":"Martinsburg","Disposition":"Unresolved","trends":["There have been 9 other sightings in Martinsburg","There were no other sightings in Martinsburg on or around April 11th 2012"],"divs":["Sighting DetailsAbout a month ago my wife informed me of a planetary alignment that's infrequent. Mars (or Venus), Jupiter and the Moon were going to be in configuration with each other. I observed it and it was magnificent. I watched the configuration over the next few nights, then weeks. During this time the moon moved away and the two planets remained in line with each other with the closest planet (Again, either Mars or Venus) being the biggest and brightest and the distant Jupiter up in the far right angle of the sky. Note: When this phenomenon first manifested it was almost directly west but as the days and weeks went on it moved more southwest. Tonight (Wednesday - April 11th at 10:15 p.m. Eastern time) I went to the store for milk. As I exited my car I looked up in the sky to observe the familiar sight I'd been observing for the past several weeks on almost a nightly basis. However, tonight was different and caused me to pause for several minutes in the parking lot. The closest planet (Mars or Venus) was now much closer and had changed from a white color to a dirty amber. It's light that it gave off was \"hectic\" - moving about at a quick pace. Jupiter was still where it should be and showed no unusual characteristics. After observing this I went into the grocery store and obtained what I needed. During checkout I felt that someone should observe what I had just observed if only to break up their night behind the checkout. I told the women who I'd become acquainted with through my visits to the grocery store that when time permitted she should step out into the lot and take a look at how bright the one planet was. She followed me out and as I stepped down from the curb I already had my hand in the air with my finger pointed in the direction of the planet. But when I looked only distant Jupiter was visible. Mars (or Venus) was gone. Completely. For the first time in over a month. I walked frantically around the parking lot thinking I was standing in the wrong spot. The grocery clerk lost interest and went back inside the store. I never was able to re-establish acclimation with the object. Once arriving home I jumped out of the SUV and ran to the side of my house where I'd observed this planetary alignment for the past few weeks. Again, the object was gone. I'm left with a dilemma: I feel that what I initially viewed over a month ago when my wife brought the planetary alignment's attention to me was in fact a planet. And all of the nights since. But what I viewed tonight I only assumed was the planet due to it's location. But it was bigger, brighter and of different color than the other nights. My two questions are - What was I observing (both tonight and for the past several weeks) if it wasn't a planet and, if it was a planet that it's appearance somehow changed due to atmospheric conditions then why didn't a planet show in it's place in the sky as it had for four weeks prior?"],"Date of the Event":"04/11/2012 10:20 UTC","files":["/var/www/straped/mufon/html2text/37394.html.txt","/var/www/straped/mufon/org/37394.html"]}