{"Date Submitted":"04/11/2012 11:41 UTC","Object Shape":"Square, Rectagular","Region":"Ohio","Case Number":"37391","Viewing Distance":"101-500 Feet","Country":"United States","Summary":"Observed football feild sized rectanguar craft with windows hovering over old Rink's parking lot. Multiple witnesses","Longitude":"-82.98983","Tags":"City","files":["/var/www/straped/mufon/html2text/37391.html.txt","/var/www/straped/mufon/more/37391_submitter_file1__rectangularUFO.jpg","/var/www/straped/mufon/org/37391.html"],"divs":["Sighting DetailsDATE IS APPROXIMATE-don't remember exact date. My former fiance and I were leaving our home on his motorcycle and headed West toward I-71. As soon as we turned onto the main road we noticed three painfully bright lights in the distance in a triangular formation, hovering not that far above the ground. At first we thought that they were attached to a crane, but as we drove closer we realized that they were a bit too high up for that. My ex was in the Air Force and knew his aircraft, but he kept saying \"what the hell is that??\" as we came closer to it we could see the huge silhouette behind the lights. It was about the size of a football field, like a huge rectangular slab lying horizontally a few hundred feet above the parking lot of an abandoned Rink's department store. As we drove past it we could see smaller colored lights on the bottom of it. It had various geometric shapes in relief all over the exterior and was gunmetal gray. It was perfectly silent. When we drove to the \"back\" of the craft we noticed maybe 4-5 huge rectangular \"windows\" that were angled slightly down and were lit from within. It seemed like there were figures moving behind the windows. I was very scared and begged him to drive away, but he wanted to drive toward it. As we argued a group of African American teens (5-7 ages 13-17) ran across the road right in front of us and we slammed on our brakes. The teens were looking at the craft. They ran onto the parking lot and were nearly under it when it shot straight up into the sky and disappeared without a sound. If any of those formally young men are reading this, I hope that they will post what they saw."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.032534,+-82.98983(37391)&iwloc=A&hl=en\"> mufon case (37391) map </A>","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around June 13th 1984","This sighting has been favorited 1 time.",""],"City":"Columbus","Weather Factors":"Unknown","Log Number":"US-04112012-0027","Date of the Event":"06/13/1984 12:00 UTC","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Latitude":"40.032534","Object Features":"Window(s), Patterned Surface","Sighting Duration":"Undisclosed"}