{"Log Number":"US-04122012-0009","Viewing Distance":"Unknown","divs":["sighting detailsi was sitting on my back patio talking with my brother over the phone. i was laying back in my chair and looking almost strait up and facing ese. i saw a dim blue light appear dead center of my field of view. it then increased in brightness equal to or even exceeding that of venus, then gradually faded the same way it began. the whole thing was +\\- five seconds in duration. that is really about the extent of it. however, this is the second time i have witnessed this. i saw the exact same thing for the same duration at the same location about a month ago. it was also about 80 degrees above the horizon but i was facing almost due south on this occasion. i never reported this one because up until now, i thought my eyes were just playing tricks on me, or a cloud had passed between me and my view of some planet. last night's occurance was right in front of my face and the sky was quite clear. i feel compelled to add that i never thought that i would be reporting such a thing. i always thought of ufos quite jokingly until now. i will not go outside without my camera anymore. i'll try to get you guys some pics or vid if it ever happens again."],"Case Number":"37402","Latitude":"24.718214","Source":"MUFON","trends":["There have been 13 other sightings in Marathon","There were no other sightings in Marathon on or around April 11th 2012"],"Summary":"single light gradually increased to the brightness of Venus, then gradually faded away.","files":["/var/www/straped/mufon/html2text/37402.html.txt","/var/www/straped/mufon/org/37402.html"],"Region":"Florida","City":"Marathon","Tags":"City","Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"04/12/2012 11:21 UTC","Longitude":"-81.065485","Sighting Duration":"00:00:04","Object Shape":"Star-like","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=24.718214,+-81.065485(37402)&iwloc=A&hl=en\"> mufon case (37402) map </A>","Disposition":"Unresolved","Date of the Event":"04/11/2012 10:15 UTC"}