{"Object Shape":"Circle, Flash, Sphere, Star-like","Object Features":"Unknown","Longitude":"-88.016131","Sighting Duration":"Undisclosed","trends":["There have been 19 other sightings in Mobile","There were no other sightings in Mobile on or around April 6th 2012"],"Source":"MUFON","Latitude":"30.687251","Tags":"City","files":["/var/www/straped/mufon/html2text/37404.html.txt","/var/www/straped/mufon/org/37404.html"],"Log Number":"US-04122012-0011","Case Number":"37404","Date of the Event":"04/06/2012 08:00 UTC","Region":"Alabama","Date Submitted":"04/12/2012 12:08 UTC","City":"Mobile","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.687251,+-88.016131(37404)&iwloc=A&hl=en\"> mufon case (37404) map </A>","Object Flight Path":"Stationary,Straight-line path","Disposition":"Unresolved","divs":["Sighting DetailsThis particular sighting occurred on Dauphin Island near Mobile Alabama. I decided to take my son to the beach for spring break. we checked in at 1:00 in the afternoon and made way for the beaches for a wonderful time. Evening came and we made our way back to the Motel. We had some dinner and my son wanted to watch some cartoons and relax. The time was approaching 7:00pm and the sun had just set beyond the horizon. We were on the second floor with a fabulous view towards the West and I could already see Venus and Jupiter in all of their splendor. Immediately I recognized a strange Orange star directly over the West End Tip of the Island. The object could be seen through a couple of palm trees. Thinking the object was out of place, I set a line of sight, aligned the star adjacent to the vertical plain of a palm tree and then rested my elbows on the rail to hold that line of sight. After a couple of seconds I could clearly see the object was slowly moving Northward. I re positioned my line of sight for confirmation and confirmed that the object was indeed creeping towards the north which was completely uncharacteristic of normal star trajectory. Star trajectory in that part of the sky should ark towards the West-North-West. After nearly half an hour I realized the object was neither growing or fading in intensity and had moved towards the north only by a fraction of an inch at arms length. This was not an aircraft and not a star! I happened to bring my laser pointer along so I directed a beam of light near and around the object while carefully avoiding any direct beam-shot just in case it was an aircraft. Immediately the object began to slightly pulse. Confident that this was no airplane or helicopter, I hit the object with one quick direct burst. Instantly, the thing vanished into thin air as if a light switch was turned off. Suddenly, a bright white object appeared over the Motel traveling due North at a swift and steady pace. Knowing that this was no Aircraft either, I hit that object with a quick burst and witnessed a bright flash back at me. Once the flash was delivered to me, the object rapidly, yet un-instantaneously disappeared overhead. This was a new confirmation for me which adds to the list that these objects or the beings inside them are: 1:intelligent. 2:attracted to laser projections. 3:communicate with light. 4:appear and disappear through portals. 5:able to maneuver unlike any know human craft. 6:hear, understand and act upon human thought processes 7:able to apply maximum covert maneuverability. I have been witness to unusual events mostly occurring over my home and now at other destinations. There is a fear associated with these events. A fear of the unknown. Who are they? What are they doing? What are their intentions? These are honest questions that deserve honest answers. But does anyone really know the answers?"],"Country":"United States","Summary":"Everywhere I go, there they are! They are everywhere!"}