{"Date Submitted":"04/12/2012 01:19 UTC","Country":"United States","Tags":"City","Date of the Event":"03/19/2012 09:00 UTC","City":"Chattanooga","Object Flight Path":"Other","divs":["sighting details on march 19, 2012, at exactly 2100 hours, i was walking in the parking lot at vulcan materials, my work place. a meteor caught my eye and i looked up. i saw two more meteors all from about the same point, but going in slightly different directions. these were not the white streak meteors, but had the orange glow of low altitude meteors. as i watched this, a bright red-orange light appeared in the same location. it was blinking almost but not quite perfectly. it made a u turn at such speed that it left a streak. it made a large circle in the sky, (would have fit inside orion), but very erratic, reminding me of the way a house fly makes a circle around a room, in, out, u turns, and blinking the whole time and leaving tracers. appx. 1\\2 sec. on, 1\\2 sec. off. after a few seconds, the light dissapeared for maybe 2 or 4 seconds. it then reappeared several degrees to the north at a higher altitude. it had lost the color and size and was white and starlike. it made another eratic circle as before, for about the same mount of time, than disappeared for good. there were no clouds and visibility was unlimited.there were two aircraft in the air at the time.one to my north and the other to my south. both were flying in a westerly direction. they were flying fairly slow, so i assume they were prop planes. im would estimate the altitude for both planes at appx. 20,000 ft. the site is also less that one mile from the chattanooga metropolitan airport. the light i saw was between venus and orion, (jupiter was also visible fairly close to venus. if you drew a line from venus to the three kings of orion, the light was just above that line right in the middle. that would be close to 45 degrees to the west. when the light appeared the second time, it was on the north side of venus. i can only guess the altitude of thy light as i had no reference."],"Object Features":"None","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.053281,+-85.182994(37406)&iwloc=A&hl=en\"> mufon case (37406) map </A>","Object Shape":"Fireball, Star-like","Log Number":"US-04122012-0012","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Source":"MUFON","Region":"Tennessee","trends":["There have been 18 other sightings in Chattanooga","There were no other sightings in Chattanooga on or around March 19th 2012"],"Case Number":"37406","Sighting Duration":"00:00:20","Longitude":"-85.182994","Summary":"Saw a blinking light larger than Venus, making circles in an eratic pattern.","Latitude":"35.053281","files":["/var/www/straped/mufon/html2text/37406.html.txt","/var/www/straped/mufon/org/37406.html"]}