{"Log Number":"US-04122012-0021","divs":["Sighting DetailsI was driving home from dinner with my fiance. We pulled into our development and my finance looked out my window ( driver's side) and spotted three orangeish glowing lights in the sky. He said, those are not planes. At first I did not believe him but once we pulled over in our development and got out of the car. I saw the three orange lights and looked over behind the tree line behind the development and saw more of the same orange lights. This time I saw about 8 together in a cluster they seemed to be following eachother and then descended higher behind a cloud. Some of the lights were closer together and some were further behind.. Once they hit the cloud above they disappeared. After both clusters, I saw a more orange lights flying individually until there was one left and that one too disappeared upward. They moved quickly and without any sound. I personally thought they were plans and did not believe it, but after I saw a hand-ful that were so low, I knew those were not planes. We saw several planes above... I kept thinking how are the pilots not seeing this?! Right after we experienced this we stood outside longer to see if anymore would come. We both smelled the air and it smelt like burnt plastic... not a great smell and not sure if it had an relation but it is ironic. I then came in and went right on Goggle to see if anyone else has seen this. Once I got on Utube and saw video of the same exact thing I saw- then I really believed this is something unique.. 2 weeks ago in Lancaster PA- someone posted they saw the same thing... PA must be a hot spot, do we know what this means?"],"City":"Quakertown","Object Shape":"Oval, Sphere","Tags":"City","Object Flight Path":"Straight-line path","Region":"Pennsylvania","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37416.html.txt","/var/www/straped/mufon/org/37416.html"],"Date Submitted":"04/12/2012 10:09 UTC","Latitude":"40.435369","Longitude":"-75.333323","Date of the Event":"04/12/2012 08:44 UTC","Sighting Duration":"00:15:00","Source":"MUFON","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.435369,+-75.333323(37416)&iwloc=A&hl=en\"> mufon case (37416) map </A>","Object Features":"Unknown","Case Number":"37416","Country":"United States","Summary":"Yellow- Orange UFO spotted in Quakertown, PA","trends":["There have been 12 other sightings in Quakertown","There were no other sightings in Quakertown on or around April 12th 2012"],"Weather Factors":"Unknown"}