{"Log Number":"US-08182005-0002","Region":"California","Latitude":"32.847888","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around August 1st 2005"],"Disposition":"Unresolved","Tags":"City","divs":["Sighting DetailsI was driving home from work, approaching the intersection of Stresemann Street and Governor Drive. I then saw a greenish hue from the driver-side window, which is quite an odd sight when, due to cloud cover and marine layer, the sky is usually sodium-yellow in hue. As I made my left turn onto Stresemann, and approached my house, I saw the green flare-like object slowly descending over what appeared to be a block not too far from where I lived. It was close enough for me to be worried something might catch fire if it touched any foliage, but it itself was not very large at all. I'd wager, at arms-length, it was roughly the size of a BB. Yet, it was bright enough to be highly specular, to have extensive glare surrounding it, and was bright enough to leave dim, yet sharply defined, shadows on the ground. As I was driving at the time, I cannot tell if it had any sound. At the time I saw it, the first thing that raced through my mind was a meteorite that was composed largely of copper or one of its oxides. However, it was moving entirely too slowly for that to be the case; an object of the size I saw, moving fast enough to flouresce at that luminosity, would transcend the sky as fast as any other meteor you see in the sky -- less than two seconds to cover an entire great circle overhead. This was just kind of floating down lazily, as if it didn't have a care in the world. Since the only thing I knew that was that bright and moved that slowly was something lightweight that was on fire, I was absolutely certain it was a flare of some kind, hence I never reported it. Sea World is known to have nightly fireworks displays, and that night was no exception. However, I thought it odd that a green flare would make its way, at full luminosity, all the way from Sea World to my city block, complete and through the marine layer clouds (remember -- they're dense water vapor clouds!), intact. Even on a clear night, it is not possible to see Sea World's fireworks displays from my house; only to hear them. I asked my roommates if they had seen anything or if they heard local people launching bottle rockets, but nobody took notice as they were busy doing other things inside the house at the time. So, I just forgot all about it, confident it was just a spurious flare. It wasn't until I saw this report that I decided to file my report, as she describes an object *exactly* like what I saw: green, highly specular, descending slowly, in a southernly direction, and of a brief duration. I feel this was the same object, though I don't recall the precise day on which I saw it. :( I had no particular reactions except to be extremely curious as to what it was. I was still driving at the time, so I didn't have much time to get excited and still be safe. The object disappeared just above the roof of my house. Note that the object did NOT visibly go behind the house -- it simply expired like a flare would expire, but without the flickering. That is, in about a quarter of a second, it dimmed and expired just like someone turned off an incadescent light bulb. It happened too fast to determine if the object spatially receded from me during that time -- again, I was concentrating on the road more than the object. That path the flare took was straight down, following a path not unlike a plumb-line. It flickered only three times, which I believe was the result of being temporarily occulted by the overhead powerlines. At all other times, it was of consistent brightness."],"Weather Factors":"None","Longitude":"-117.256474","Sighting Duration":"00:00:15","Date of the Event":"08/01/2005 10:30 UTC","Date Submitted":"08/01/2005 10:30 UTC","files":["/var/www/straped/mufon/html2text/3743.html.txt","/var/www/straped/mufon/org/3743.html"],"Country":"United States","Case Number":"3743","City":"San Diego","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.847888,+-117.256474(3743)&iwloc=A&hl=en\"> mufon case (3743) map </A>","Object Shape":"Star-like","Object Features":"None","Summary":"Green flare-like object descending"}