{"Longitude":"-75.199468","Source":"MUFON","Country":"United States","trends":["There have been 13 other sightings in Bangor","There were no other sightings in Bangor on or around April 12th 2012"],"Object Features":"Unknown","Region":"Pennsylvania","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.867912,+-75.199468(37438)&iwloc=A&hl=en\"> mufon case (37438) map </A>","Object Shape":"Circle","Viewing Distance":"Unknown","Date of the Event":"04/12/2012 08:10 UTC","Case Number":"37438","divs":["Sighting DetailsLast evening at 8:10 pm. Watching tv. Bright green object goes streaking across the sky. I was looking SE. No tail like a shooting star. Went down at an angle. Saw the same green type in Jan. of this year. That one went straight down. This one at an angle. Upon seeing it I thought it was probably going to be an active orb night. Decided to go outside and watch the sky. I didn't see anything else out of the ordinary at that point. Between 9 and 9:30 I went back out and looked up and witnessed whitish glowing orbs. Going in various directions. S to N. W to E. One was coming from the NW and it stopped and faded out. Saw 3 of these within 15 mins. Understand, I have been seeing these for years now, and have reported multiple times. They move across the sky faster than average jets travel. There were small planes in the area all during these events. Right after the green abject flew by, I looked for planes and spotted one moving in the same direction as green object. Small plane. The pilot couldn't have missed seeing this as well. So in all 4 objects were seen by me. I went inside around 9:30 pm. Had I stayed outside, I feel certain I would have seen more. I check MUFON reports every day and when I saw all of the reports from all over PA, I just had to add to it. Reporting these orbs over the past few years became redundant. Trust me when I tell you they are way too low to be satellites. The green object at 8:10 was traveling E to W. I haven't been watching the sky at night since last fall, but after last nights events, my obsession is renewed."],"Latitude":"40.867912","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path then hovering","Tags":"City","files":["/var/www/straped/mufon/html2text/37438.html.txt","/var/www/straped/mufon/org/37438.html"],"Date Submitted":"04/13/2012 10:19 UTC","Disposition":"Unresolved","Summary":"Active night over PA","Log Number":"US-04132012-0013","City":"Bangor"}