{"Summary":"bright light north to south in eastern sky extremely fast. at 1 point looked like it went behind a bright star.","files":["/var/www/straped/mufon/html2text/37446.html.txt","/var/www/straped/mufon/org/37446.html"],"City":"Charles Town","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"04/13/2012 04:07 UTC","Country":"United States","Case Number":"37446","Tags":"City","Object Features":"Unknown","trends":["There have been 2 other sightings in Charles Town","There were no other sightings in Charles Town on or around April 12th 2012"],"Longitude":"-77.854298","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsAbout 9:00 pm stepped out back porch for a smoke as always looked up at the sky to find my stars that I follow throughout the night. Looked to the east and saw what looked like a star moving across the sky, very high; higher than I've ever seen an airplane or jet. Kept my eye on it & it looked almost like it went behind one of the big bright stars & kept going. I actually said out loud \"Holy cow, am I the only one seeing this right now?\" I followed it until I could no longer see it. It seemed to be traveling in a straight line, even though my eyes moved off the light a couple of times as it was moving farther away, I was able to pick back up on it. Almost exactly 2 hours later @ about 11:10 I went back out & saw a 'falling star', a sort of curved trailing yellowish light that lasted about a second or two. Was this a comet passing followed by a meteor passing through the atmosphere? I don't know, but I've never witnessed anything like this before. I look up at the stars all the time & have seen the sky from many different states & this is a first. Looking for answers on internet & found this web site from someone who had posted from Pennsylvania."],"Log Number":"US-04132012-0020","Date of the Event":"04/12/2012 09:05 UTC","Region":"West Virginia","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Latitude":"39.2984","map":"<A HREF = \"http://maps.google.com/maps?q=39.2984,+-77.854298(37446)&iwloc=A&hl=en\"> mufon case (37446) map </A>"}