{"Case Number":"37445","Object Flight Path":"Hovering then path,Straight-line path","Country":"United States","Source":"MUFON","divs":["Sighting DetailsI was watching the sunset from the balcony of a condo on the Gulf of Mexico. As the sunset, I looked up to observe a sliver of the moon starting to appear. Then a reflection caught my eye to the right over the gulf. At first I thought it was a kite from the beach. Then I realized it was farther out over the gulf and must be larger. My wife and mother-in-law then saw it. My mother in law went in to get binoculars and I went in and got my camera. When I returned to the balcony the object had moved back toward the horizon. I photograped it through my zoom lens. It appeared to be horseshoe in shape. It also had a pinkish orange glow to it that I did not see when I first observed it. I took several pictures with my zoom lens and one without the zoom. The object looked very different on the horizon than it did when I first say it. When I first saw it it was very metalic and was difficult to focus on. It almost apppeared as if it fluttered. It stayed on the horizon for quite sometime before it finally disappeared out of sight. I never actually saw it move. It just seem to \"suck back\" toward the horizon until it disappeared. Ihave seven digital pictures. I only could attach three, and I don't know if they are the best, but they were the first three I took."],"Region":"Florida","Latitude":"27.849331","Object Shape":"Other","Date of the Event":"03/25/2012 07:54 UTC","trends":["There have been 3 other sightings in Indian Shores","There was one other sighting in Indian Shores on or around March 25th 2012","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37445.html.txt","/var/www/straped/mufon/more/37445_submitter_file1__IMG_6528.JPG","/var/www/straped/mufon/more/37445_submitter_file2__IMG_6529.JPG","/var/www/straped/mufon/more/37445_submitter_file3__IMG_6529.JPG","/var/www/straped/mufon/org/37445.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.849331,+-82.862028(37445)&iwloc=A&hl=en\"> mufon case (37445) map </A>","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Features":"Unknown","City":"Indian Shores","Date Submitted":"04/13/2012 03:00 UTC","Disposition":"Unresolved","Summary":"Sighted silvery object over gulf from balcony it then \"sucked\" to horizon.","Log Number":"US-04132012-0019","Tags":"City","Longitude":"-82.862028"}