{"City":"Port Jefferson Station","Summary":"15 years of possible abduction/contactee","map":"<A HREF = \"http://maps.google.com/maps?q=40.925376,+-73.047328(37440)&iwloc=A&hl=en\"> mufon case (37440) map </A>","files":["/var/www/straped/mufon/html2text/37440.html.txt","/var/www/straped/mufon/org/37440.html"],"trends":["There has been one other sighting in Port Jefferson Station","There were no other sightings in Port Jefferson Station on or around November 30th 2008","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Object Shape":"Circle","Date Submitted":"04/13/2012 11:04 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Country":"United States","Case Number":"37440","Viewing Distance":"Unknown","Log Number":"US-04132012-0015","Object Features":"Undisclosed","Longitude":"-73.047328","Latitude":"40.925376","divs":["Sighting DetailsIn 2001 lived in a farm house, in a wooded area, a voice in his head instructed him to come outside, he believes he was under some type of control, this voice led him to a UFO, he saw white lights spinning in a circle, craft was hovering then moved to the right, object went behind trees and was able to move on his own. In 1995 His first sighting was about 4 pm, he was playing baseball, all of a sudden the sky opened up and a silver metallic disc appeared. Object stopped on a dime, then shot straight down. This report was summitted by stephen Cox, Chief Field Investigator for NY Mufon on witnesses behalf. See attachment for more details. Believes he is experiencing the Abduction Phenomenon 1. Having Blackouts 2. Memory Loss 3. Saw UFO on property, Disoriented 4. Close encounter with object, circle of lights rotating 5. Trance like states, unable to move 6. Uses meditation to communicate with alien life forms (during one of his meditations he asked for proof, he asked the voice to produce a Praying Mantus inside his house, the next morning Paul found a praying Mantus on his computer screen."],"Date of the Event":"11/30/2008 12:00 UTC","Region":"New York"}