{"Region":"Massachusetts","Date of the Event":"04/10/2012 10:40 UTC","Summary":"Watching satellite when UFO bisected flight path and abruptly changed direction.","divs":["sighting detailsi was working on my website last night and decided to take a cigarette break. i don't smoke in the house so i went outside to refresh myself in the cool new england air and drive another 'coffin nail' into my body. it was about 2240 hrs. and there was some patchy cloud cover. as i usually do in the evening when i go out for a smoke, i check out the stars; i was looking southernly from my apartment orions belt was at my 4 o'clock sky position. as i'm looking up i picked up a satellite (object 1) tracking north due south and began to follow the pin dot sized light noting its steady movement. as object 1 got to about 80 to 75 degrees above the horizon another pin dot sized light (object 2) entered my view only moving northeast due southwest. these objects were a hands width apart in the night sky (4.5 - 5 inches). what spawned this report is that object 2 stopped moving as if to allow object 1 to pass only to regain its trajectory after object 1 had proceeded beyond the (estimated) intersection point in the sky. feeling confident that object 1 was infact a satellite i continued to observe object 2 moving southwesterly (i was pretty excited now) and noticed that object 2 'stuttered' in its flight path then abruptly changed direction and shot off in a due north direction at a perceived increased marked rate of speed. i'm 47 y\\o, was in the army as a m.p. and performed civilian law enforcment duties as well. i'm now in the it field as a civilian. i have seen pleanty of satellites in the sky numerous times and have never seen anything like this before. object 1 maintained consistant speed and luminosity through out the event and i eventually lost sight of it due to my attention shifting to object 2. object 2 maintained constant lumninosity but displayed the above mentioned movement anomalies: stopping as if to avoid object 1, stuttering in its movment and abruptly changing direction and speed of movement."],"Viewing Distance":"Unknown","Tags":"City","Object Shape":"Star-like","City":"Taunton","Log Number":"US-04132012-0016","files":["/var/www/straped/mufon/html2text/37441.html.txt","/var/www/straped/mufon/org/37441.html"],"Country":"United States","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Weather Factors":"Unknown","Latitude":"41.880964","trends":["There have been 8 other sightings in Taunton","There were no other sightings in Taunton on or around April 10th 2012"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.880964,+-71.090536(37441)&iwloc=A&hl=en\"> mufon case (37441) map </A>","Date Submitted":"04/13/2012 11:12 UTC","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"37441","Longitude":"-71.090536"}