{"Date of the Event":"08/22/2010 12:00 UTC","Weather Factors":"Unknown","Case Number":"37457","Tags":"City","Log Number":"CA-04142012-0001","map":"<A HREF = \"http://maps.google.com/maps?q=49.394613,+-121.438783(37457)&iwloc=A&hl=en\"> mufon case (37457) map </A>","City":"Hope","Object Shape":"Diamond","Region":"British Columbia","Longitude":"-121.438783","Date Submitted":"04/14/2012 01:02 UTC","Disposition":"Unresolved","Summary":"Like a top, with 3 white lights, two on top, 1 bottom right, reflected bronze","trends":["There have been 2 other sightings in Hope","There were no other sightings in Hope on or around August 22nd 2010","This sighting has never been favorited.",""],"Object Features":"Patterned Surface","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/37457.html.txt","/var/www/straped/mufon/more/37457_submitter_file1__UFOcircled.045.JPG","/var/www/straped/mufon/org/37457.html"],"Latitude":"49.394613","Sighting Duration":"00:00:01","Object Flight Path":"Stationary","divs":["Sighting DetailsI wanted a picture of the full moon, aimed the camera up at the moon, took the shot, then returned to my campsite. This was 2 years ago. I looked at the picture tonight, and saw the object, partly obscured by a 200 foot B.C. evergreen. I was facing away from the only road, about 20 miles from any civilization, camping in Manning Park, and was standing on a river bank. The object showed up in the photo, and that's about all I know. When I saw the object, I knew the angle of the shot, and realized this could only be a UFO...there are even stars underneath the object, so it was very high in the sky. I had the flash on, so the tree is illuminated, and the object is peeking out from a branch, but you can see two lights together on top, a third light on the bottom right, and a reflection of bronze or orange under the two top lights. I was alone, camping, in the middle of nowhere, it was perfectly quiet, and this object showed up in my picture. I was amazed, as it can only be a UFO when you understand the upward angle I shot with. Look at picture and the circled area. Very strange, and unlike anything that would ever be in the sky. My father was a pilot and I often flew with him and know angles and distances. This object should not be in the photo, but it is there, and is clear when zoomed in on the highlighted area."],"Country":"Canada","Source":"MUFON"}