{"Weather Factors":"Unknown","Summary":"Noticed a brightly lit white round shaped object in teh sky which moved from the North west direction to the South east and it hovered for about a few seconds above and then went left and followed its path down to the South east","Tags":"City","Region":"Ontario","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Brampton","There were no other sightings in Brampton on or around April 12th 2012","This sighting has never been favorited.",""],"City":"Brampton","Object Shape":"Circle, Sphere, Star-like","Log Number":"CA-04132012-0025","Viewing Distance":"Over One Mile","Case Number":"37451","Country":"Canada","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37451.html.txt","/var/www/straped/mufon/org/37451.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.688991,+-79.751364(37451)&iwloc=A&hl=en\"> mufon case (37451) map </A>","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Latitude":"43.688991","divs":["Sighting DetailsAround 9:30 pm on April 12, while me and my son were returning home from his soccer practice we were discussing about the stars and especially the North star. As we reached home and got out of the vehicle my son pointed out to a brightly lit object above and asked me if that was a star and then we noticed it moving. I watched the brightly lit round object approaching at a steady speed from the North west corner of our house and immediately knew it wasn't a airplane, helicopter or a meteor as it had no blinking lights and it was flying too high to be a helicopter and I ran to grab my camera. Didn't have time to attach my telephoto lens get my DSLR so I grabbed my wife's Nikon coolpix camera and the took a short video of the object. As I was taking the video, the bright light object which was flying very high paused for a few seconds above and then turned left and then continued on its steady path at good speed to the South west. The object didn't have any blinking lights except for the bright light on all sides and it even changed direction which made me sure that it was a UFO and not a airplane, helicopter or a meteorite. I felt shaky and so did my video but I felt good as I knew I had done my first UFO sighting. Lost sight of the object as it went far away beyond eyesight."],"Date of the Event":"04/12/2012 09:30 UTC","Date Submitted":"04/13/2012 08:52 UTC","Longitude":"-79.751364"}