{"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/14/2012 01:28 UTC","trends":["There have been 3 other sightings in Riverview","There were no other sightings in Riverview on or around April 14th 2012"],"Latitude":"27.877743","Source":"MUFON","City":"Riverview","Object Flight Path":"Other","Case Number":"37458","Tags":"City","Date Submitted":"04/14/2012 02:07 UTC","Summary":"V shaped, very big, no noise. 5 lights underneath, barely visible then gone.","Weather Factors":"Unknown","Longitude":"-82.337626","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=27.877743,+-82.337626(37458)&iwloc=A&hl=en\"> mufon case (37458) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unresolved","divs":["Sighting DetailsA little over thirty minutes ago i had a life changing experience. I was outside smoking a cigarette with a friend, who also saw the exact same thing as me; it wasn't that high but yet somehow barely visible for such a huge object. V shaped, and yes i say again very, very big. The five lights underneath were dim, but that is was first brought my attention to the object. We started screaming because we have seen ufo's in the past but nothing more than fast beams of light far far away. This was right over my house,we were in my driveway when we saw it and it was traveling towards the brandon area. we moved to get a better view because trees were about to block the view, but then it was gone ! it was not flares or a group of helicopters because nothing flies like that, that low, that close without any noise that i know of. It was like things i have seen on tv before the huge blackish or maybe even see through type v shaped object. I wish I could tell you more, if You have any questions please do not hesitate, I want the truth."],"Log Number":"US-04142012-0002","Object Shape":"Boomerang","Object Features":"Other","files":["/var/www/straped/mufon/html2text/37458.html.txt","/var/www/straped/mufon/org/37458.html"]}