{"Object Shape":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","trends":["There have been 16 other sightings in Lake Charles","There were no other sightings in Lake Charles on or around September 10th 2003"],"Viewing Distance":"Unknown","Longitude":"-93.211186","Source":"MUFON","Case Number":"3746","Object Features":"Undisclosed","City":"Lake Charles","Log Number":"US-08202005-0001","Sighting Duration":"Undisclosed","divs":["Sighting Details(1)-I was outside in my backyard one September 2003 evening about10 PM setting up my telescope to view stars to the south. A few street lights and commercial signs were lit up nearby, but stars could still be seen.(2)-As I was setting up my telescope I was facing due south, I noticed movment to my left or east through my side vision, I immediatly turned and saw the craft.(3)-I thought the object was a UFO \"flying saucer\". (4)-The object was disc shaped, about 50 feet in diamter, moving about 30 mph due south, no lights, no sound, no exhuast, no wings. it had some type of hatch on top of it and a white circle on the bottom outter edge of the craft. It passed above the live oak tree in my back yard. I am estimating it was 200-300 feet distance from me. (5) I was excited but yet very perplexed as to what it was, who built it, why it was flying in my neighborhood, and how did it stay up without making a sound? I told some of my family members and some friends, I also sent a report to NUFORC website. An astonomer at SETI recommed that I also give MUFON a report of this sighting. (6)I lost sighting of this objcet as it passed beyond my neighbors trees, that were and are still to my immediate south."],"Date Submitted":"09/10/2003 12:00 UTC","Tags":"City","Latitude":"30.235965","map":"<A HREF = \"http://maps.google.com/maps?q=30.235965,+-93.211186(3746)&iwloc=A&hl=en\"> mufon case (3746) map </A>","Region":"Louisiana","Date of the Event":"09/10/2003 12:00 UTC","files":["/var/www/straped/mufon/html2text/3746.html.txt","/var/www/straped/mufon/org/3746.html"],"Summary":"A disc shaped object observed by me, at night, moving about 30mph, about 50 feet in diameter","Object Flight Path":"Undisclosed"}