{"Disposition":"Unresolved","Date Submitted":"04/14/2012 01:36 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.18722,+-83.429444(37467)&iwloc=A&hl=en\"> mufon case (37467) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/37467.html.txt","/var/www/straped/mufon/org/37467.html"],"Object Features":"None","trends":["There have been 8 other sightings in Morehead","There were no other sightings in Morehead on or around April 12th 2012"],"Longitude":"-83.429444","Tags":"City","Summary":"Football shaped set of three lights seemed stationary in SW sky but reappeared continuously in front of me during 40 minute drive","Region":"Kentucky","Source":"MUFON","Log Number":"US-04142012-0008","Latitude":"38.18722","Object Shape":"Other","Date of the Event":"04/12/2012 10:00 UTC","Object Flight Path":"Hovering then path","divs":["Sighting DetailsTraveling from Clear Fork Road in Rowan County, KY onto Cranston Road and then onto US 32 towards home (a 40 minute drive) I observed a set of three lights shaped like a football on its end. The top light and bottom light were about a fourth the size of the middle light and were red and randomly blinking (I believe they were randomly blinking but I was driving and unable to watch the object continuously until I reached home.) The middle white light was longer and vertical. When I was about four miles past Morehead I was able to see the sky unobstructed. I noticed it because it appeared huge compared to flying planes in the sky. I had seen on the news that the International Space Station was visible the night before so at first I thought it must be that. However, I realized the description was just a round white light of the ISS and this was not at all round or just white. It was probably 25 times the size of a normal airplane flying in the sky and at first was stationary. As I traveled northwest it appeared in the SW sky and was not visible unless I looked behind me but several times it appeared in front of me. As this could have been because of the twists and turns in the road I find it hard to believe it remained stationary the whole time. US 32 is not extremely curvy therefore, I decided it must have moved west at some points during my drive. The white light did not blink. I was amazed that this was so large and kept appearing in front of me. I was quite mesmerized by it and felt like I was seeing something quite unique and special. I would have stopped to look at it but I was extremely tired from working 12 hours and honestly wondered if my eyes were playing tricks on me. I do not believe my eyes would have seen this from being tired for a full 40 minutes. When I reached home, it appeared to be farther away and maybe higher in the sky. I watched outside for a few minutes and did not see it move. While I was watching I saw a plane(?) or some other object with white and a red light in the configuration of a normal airplane appear to hover beside it. However, when I went to my bedroom about to lie down for the night about 20 minutes later, I noticed it still in the sky in the same area. I decided I wanted to take a picture of it with my cellphone and turned my tv and my light off. When I tried to get it in my viewfinder, it suddenly descended below the tree level. It may have landed somewhere. It went from being above the treetops to almost on the horizon within seconds. I looked for it for about 10-15 minutes and saw the white light through the trees but not enough to see continuously. As I live in a rural area and do not normally see a light at this level, I feel it may have been the light still shining. Finally, I could not see the light anymore at all."],"City":"Morehead","Weather Factors":"Unknown","Sighting Duration":"01:10:00","Case Number":"37467","Country":"United States"}