{"Region":"Ontario","Object Features":"Unknown","Log Number":"CA-04142012-0010","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.659166,+-79.380154(37469)&iwloc=A&hl=en\"> mufon case (37469) map </A>","Source":"MUFON","Case Number":"37469","Date of the Event":"02/08/2012 06:10 UTC","Object Shape":"Circle, Fireball, Sphere, Star-like","Country":"Canada","Object Flight Path":"Path then hovering","Date Submitted":"04/14/2012 04:08 UTC","files":["/var/www/straped/mufon/html2text/37469.html.txt","/var/www/straped/mufon/org/37469.html"],"Tags":"City","divs":["Sighting DetailsDuring dinner hour a family member witnessed a light in the sky from the kitchen window and called me to look. The sky was dark as the sun had already set. Facing east I observed a red-orange glowing orb or fireball above the rooftops. The object moved slowly and horizontally across the sky from south to north. Two family members witnessed the same event. Distance was difficult to judge, possibly a few miles away. At first I thought it was an airplane or helicopter but it did not have the typical blinking lights of an aircraft. I thought it could also be a meteor but I have never positively identified a meteor before and the path the UFO traveled seemed inconsistent with a meteor. During this time I could recognize aircraft in the distance in the same field of view as the UFO. After a short time observing, the orb stopped along its path and hovered. I thought to take a photograph but then the glow ceased and the object became star-like after which it disappeared into the distance. It was no longer visible and did not reappear. The entire event lasted not more than 3 minutes, possibly even less than 1 minute."],"trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around February 8th 2012"],"Weather Factors":"Unknown","Sighting Duration":"00:03:00","Summary":"Slow moving red glowing orb observed on an aerial path, hovered, then extinguished.","Latitude":"43.659166","Longitude":"-79.380154","City":"Toronto"}