{"Tags":"City","City":"Fleetwood","Latitude":"40.461913","trends":["There have been 4 other sightings in Fleetwood","There were no other sightings in Fleetwood on or around April 14th 2012"],"Object Flight Path":"Hovering then path","Case Number":"37478","Source":"MUFON","Log Number":"US-04142012-0018","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Region":"Pennsylvania","divs":["Sighting DetailsI was driving to work with my Uncle in Fleetwood, a very rural area with lots of farms and amish folk. On my way in, I noticed something about 20 degrees to my right. It seemed to be a pulsating light, flickering blue, red, green, orange, and a few other colors. At first I thought it was just a star, but as we drove closer, it appeared to get larger and the flickering colors stopped. It became a very very bright goldish-white color, and hovered there for a few minutes. As we became parallel to the light, there appeared to be an extension of the craft that went down a few feet, but unlike the rest of the craft, this part was solid black with a circular light around the bottom of it and was in the shape of a bullet. As we kept driving, I turned around and continued to watch the craft. As I neared my work, I noticed the craft had started to travel on a path to the south-south east, where it eventually disappeared from my site over a tree line. Even my Uncle, who usually has a sound explanation for almost anything, couldnt figure out what we were looking at. We were both left unsure, and talked about it for several minutes trying to deduce what it could have been, but still came to no logical conclusion. It was like nothing we have ever seen before."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.461913,+-75.813426(37478)&iwloc=A&hl=en\"> mufon case (37478) map </A>","Disposition":"Unresolved","Object Shape":"Cylinder","files":["/var/www/straped/mufon/html2text/37478.html.txt","/var/www/straped/mufon/org/37478.html"],"Longitude":"-75.813426","Sighting Duration":"00:03:00","Date of the Event":"04/14/2012 09:43 UTC","Date Submitted":"04/14/2012 10:29 UTC","Object Features":"Unknown","Summary":"Pulsating lights breaking into a path"}