{"City":"Mission","Latitude":"49.158203","Date Submitted":"04/14/2012 08:13 UTC","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Mission","There were no other sightings in Mission on or around May 29th 2009","This sighting has never been favorited.",""],"divs":["Sighting Details Back in May of 2009 my wife and I saw some unusual things happening in the night skies. It started one night as we were outside, like we did quite often, sitting by a fire pit having coffee and watching the stars. One night in May we were sitting around talking when we saw three bight lights cross the sky and stop for a few seconds and then the three lights shot off in different directions. It actually sent chills up my back and made us feel a little uneasy being outside. The way the lights came streaking across the sky and then all three stopped at the same time, stood still for about 30 seconds and then shot off if three perfectly patterned exit at very high speed. It was about a week later, we were sitting outside again on another clear warm night on the 29th.of May when we saw this. Two lights that came from different parts of the western skies over Mission, British Columbia, Canada. The two objects stopped just to the east and just hung there. After being in shock again for a few seconds, I thought I need to try and grab my camera to prove this. It took me roughly a minute, maybe two, to get my camera, a lens and get back outside. Much to my amazement the objects were still in the sky. I managed to get these five shots of what we saw. Keep in mind, that these two objects were actually small very bright dots, but because I didn't have time to set up a tripod and shot at an ISO of 3200 hand held the camera for a 1 sec exposure, the dots look like small lines. These objects, to my surprise showed up on my camera. The stars were very bright that night and were all around these objects but never showed up on the image. Gives you an idea of just how bright they were. The two objects made very rapid moves changing their location in the sky over roughly this 1 minute 15 second span. But they moved fast, then stopped and then moved again, rather than a drifting motion. After the last image I shot here the two objects, at exactly the same time, seemed to shoot straight up into space at an amazing speed. I have seen a few shooting stars, but these objects were traveling at way faster speeds than that and did not shoot across the sky like a meteor or shooting star, but rather straight up. It was an extremely eerie feeling. We had some friends see the same thing during that month as well. I tried calling the TV news channels to report what I saw, hoping that someone else had seen the same thing but I couldn't find anyone who was really interested, which shocked me. Except for those two nights in May of 2009 I haven't seen anything more. I saw a TV show that featured a group called MUFON and it made me want to do this letter and send it to them."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=49.158203,+-122.294942(37474)&iwloc=A&hl=en\"> mufon case (37474) map </A>","Country":"Canada","Case Number":"37474","Sighting Duration":"Undisclosed","Log Number":"CA-04142012-0015","Object Shape":"Circle","Weather Factors":"Unknown","Summary":"Two bright lights that moved across the sky and stop, changed locations and left at the same time","Longitude":"-122.294942","Date of the Event":"05/29/2009 10:52 UTC","Region":"British Columbia","files":["/var/www/straped/mufon/html2text/37474.html.txt","/var/www/straped/mufon/more/37474_submitter_file1__PICT3946.JPG","/var/www/straped/mufon/more/37474_submitter_file2__PICT3950.JPG","/var/www/straped/mufon/more/37474_submitter_file3__ufo-2.jpg","/var/www/straped/mufon/org/37474.html"],"Source":"MUFON","Tags":"City","Object Features":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}