{"Date of the Event":"06/14/2002 12:00 UTC","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"04/15/2012 04:13 UTC","Latitude":"36.975927","Object Features":"Other","City":"Santa Cruz","Object Shape":"Flash, Triangle","Object Flight Path":"Straight-line path","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around June 14th 2002"],"files":["/var/www/straped/mufon/html2text/37484.html.txt","/var/www/straped/mufon/org/37484.html"],"Tags":"City","Viewing Distance":"101-500 Feet","Country":"United States","divs":["sighting detailshi it was june 14 2002 aronud 10:00pm i was living on summit\\mt madonna road located in the santa cruz mountain area. elevation 3500ft. i had just lyed down for bed and heard a low rumble and it started getting louder and louder until i sat up in bed to try and see what was going on outside. i had never heard anything like this in all my life. hundreds of small blueish white beams of light began strobing and flashing all around out side of my house. like a thousand flashes of a camera in only ten seconds. i could seem the beams scan around as if under control. my heart is pounding so hard and i feel like i am going into shock at this point. i couldnt comprehend what was happening. the last several beams came through my window and i had a very close look at them, about 15 inches away from my legs. the beams were 10 inches around with a darker blue core and a brighter blueish white outer. like a beam inside a beam is the best i can describe it. i peer out the window and see this 500ft long craft flying directly over head, only 200-300ft above me and traveling in a north east direction very slowly. looking directly up at the craft i could see a huge square red light a dozen smaller white lights in rows around the outter edge in a triangular shape. i know the craft was flying super low because i could now see the rear of the ship. from the rear i could see large circular red lights pulsating from left to right then right to left and so on. slowly disapeared out of sight. the whole incident only lasted 15 minets but when i checked my clock it was 11:59pm. strangly i went calmly to sleep with out getting out of bed to go and check on my 16 year old cousin who was right outside camping in a tent only 25 feet away. i awoke the next morning with no memory of this sighting and neither did my cousin untill later that evening at the exact same instant we both remembered and became so flustered we couldnt find the words to describe what happened we both just knew and tears came out of our eyes for a second. then words came out and he said he saw the exact same thing and even more than i had seen due to the fact he was out in a tent looking straight at it during all the beam flashes. he told me it looked as if it were searching for me and when it found me the beams stopped. we both drew pictures in seperate rooms and compared them both were almost identical. i still have the drawings. i always wanted to tell my people about this incident but i dont want to be called crazy i think hypnotheropy would reviel much more about the two missing hours. i want to know what happened to me that night. are their others with a similar experance.i need answers. thanks for your time"],"Case Number":"37484","Summary":"A terrifing event that changed my life forever. What ever it was did something to me I can feel it .","Longitude":"-122.025386","Log Number":"US-04152012-0003","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.975927,+-122.025386(37484)&iwloc=A&hl=en\"> mufon case (37484) map </A>","Weather Factors":"Unknown"}