{"Source":"MUFON","Tags":"City","divs":["Sighting DetailsMy daughter arrived at home and came running inside saying there were UFOs outside. She and her two friends were standing in the street and pointed out to me a line of objects passing over our house and heading in a rough southwestern direction. They were well above the tree tops; I would estimate them to be about 500 feet above the ground. I had to crane my neck to look up and see them. They said that they saw a large group moving towards them above the main road outside of our neighborhood . We observed 10-15 noiseless objects that appeared with fuzzy edges and circular shape with an unwavering orange light. Our first thought was that there were paper lanterns, but they were traveling very quickly and the evening was mild, clear, with only a light breeze. The light did not flicker as I would expect a paper lantern to and the objects were all traveling in a uniform direction and speed as if on a path. These were obviously new lights and not the ones they had seen on the road. I would estimate they were about 30 to 45 seconds apart. I attempted to film with a phone camera but I do not believe it captured the images due to the lack of light."],"Country":"United States","files":["/var/www/straped/mufon/html2text/37481.html.txt","/var/www/straped/mufon/org/37481.html"],"Object Flight Path":"Straight-line path","Region":"Georgia","Latitude":"34.043213","City":"Lawrenceville","Case Number":"37481","Date of the Event":"04/14/2012 11:15 UTC","Disposition":"Unresolved","Object Features":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.043213,+-84.027806(37481)&iwloc=A&hl=en\"> mufon case (37481) map </A>","Log Number":"US-04142012-0020","Date Submitted":"04/14/2012 11:57 UTC","trends":["There have been 14 other sightings in Lawrenceville","There were no other sightings in Lawrenceville on or around April 14th 2012"],"Summary":"6-10 large objects with orange lights travelling in a straight line over a period of 15 minutes.","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-84.027806","Weather Factors":"Unknown","Object Shape":"Circle"}