{"Date Submitted":"04/15/2012 12:07 UTC","Log Number":"US-04152012-0006","Case Number":"37487","City":"Michigan City","Date of the Event":"04/14/2012 10:30 UTC","Source":"MUFON","Object Shape":"Star-like","Tags":"City","Country":"United States","Summary":"A large number of small star-like objects moving quickly in random directions, sometimes following one another at high speeds.","divs":["sighting detailsi was on my balcony last night around 10:30 pm, smoking a cigarette, and noticed a small streak of light go across the western sky\\horizon, probably above the pines\\michigan city area in indiana. so i watched a waited for more- but noticed something way more awesome! there were 20+ of these objects scattered in that direction only(west). they were fast and could stop on a dime, make a 180 turn at high speeds... it was just way out of the ordinary. last night was cloudy, i couldnt see the stars but i could definitely see these tiny objects chasing each other through the sky. i stood there and watched this for at least 30 minutes, with my mouth hanging wide open and wondering- why isnt anyone else outside right now?! id totally ask them if they saw it too i was home alone and got a little startled when i thought i saw one of the objects come in my direction... once i saw the mass of the object coming closer and growing- which was like a shadow- i quickly went inside grabbed my keys and left. that was all i wanted to do with it...so that was the last i saw of it. no et meetings for me, thank you!"],"Region":"Indiana","files":["/var/www/straped/mufon/html2text/37487.html.txt","/var/www/straped/mufon/org/37487.html"],"trends":["There have been 15 other sightings in Michigan City","There were no other sightings in Michigan City on or around April 14th 2012"],"Latitude":"41.712209","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Sighting Duration":"01:00:00","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.712209,+-86.88827(37487)&iwloc=A&hl=en\"> mufon case (37487) map </A>","Longitude":"-86.88827"}