{"Country":"Canada","Longitude":"-122.476382","Log Number":"CA-04152012-0002","files":["/var/www/straped/mufon/html2text/37483.html.txt","/var/www/straped/mufon/org/37483.html"],"Summary":"Satellite-like points that zig-zagged and hovered, then orb or disk that cloaked","trends":["There have been 6 other sightings in Maple Ridge","There were no other sightings in Maple Ridge on or around April 14th 2012"],"Sighting Duration":"00:00:30","Latitude":"49.225429","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Case Number":"37483","Tags":"City","Object Features":"Unknown","Region":"British Columbia","Date of the Event":"04/14/2012 10:35 UTC","divs":["sighting details22:35 approx (main sighting). sometimes i ufo-gaze out my front window. thus... about 21:30 to 22:00 or so, observed first one star-sized object, then about 15 mins later another, much clearer. both seemed to zig-zag and hover in their n-s paths, but i thought the first one might have been a satellite at first because it was mostly obscured by trees. but the second one (which at one point was directly above me relative to the earth) i clearly saw zig-zag and pause in place many times before moving on. as if wanting to make a point that it was not a \"normal\" object. so 22:35 came, and i heard what at first i thought sounded like a distant airliner, but the sound became more humming and pulsated abnormally, not like the relatively constant sound of jet engines at all. so i positioned myself to get a clear view, and out from behind a tree came a white orbish thing, but it was so close i could have sworn it had disk-like morphology (it seemed to glow around the edges but was dark in the middle). when the craft was approximately 5-10 degrees west of the star polaris (it was travelling to the north of me, west to east, straight line and no zig-zagging or hovering), the sound stopped altogether - another thing jet engines can't do, at least not if they don't want to fall out of the sky. it got steadily dimmer in approximately a 10 degree arc, until it disappeared from vision altogether, before it passed the tree line. ain't the first time i've seen weird stuff while ufo-gazing either, but didn't report the other incidents because they were a lot more ambiguous. i do seem to see a lot of weirdly shaped planes which make no sound and hover, as well as helicopters flying with no lights at night, 2 meters above the freaking ground. not bothered to report because as of yet, no completely reliable method to tell holograms from actual human aircraft. i suppose it's worth mentioning i've witnessed and\\or accidentally caught on camera at least 7 separate incidences of unidentified objects, and more than one sighting has been unambiguous enough to report to mufon (though i only thought to report the red orb incident)."],"City":"Maple Ridge","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=49.225429,+-122.476382(37483)&iwloc=A&hl=en\"> mufon case (37483) map </A>","Object Shape":"Disc, Sphere, Unknown","Date Submitted":"04/15/2012 02:26 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON"}