{"Latitude":"44.069232","trends":[],"Summary":"NOT a plane or balloon. Very remote wilderness terrain. Mid day, white disk that stayed stationary at a 45 degree angle for 5 minutes or so. Saw it go through a cloud, then hover and move on until disappeard behind a mountain.","files":["/var/www/straped/mufon/html2text/37482.html.txt","/var/www/straped/mufon/org/37482.html"],"Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Region":"Idaho","divs":["Sighting DetailsI was driving home from a day kayaking on the Lochsa river in northern Idaho. It was about 4:00 PM on a unusual(for this time of year!)beautiful day. Blue bird sky's, with popcorn white clouds. I was driving back to Missoula Montana, about two hours away, after kayaking the Lochsa river. While driving on a very curvy road I spotted a white, disk like object hovering but yet moving at a very slow speed, about 500 ft in the air, one mile ish away from me. The weird thing was, it, the object remained at a 45 degree angle the entire time. Unlike a plane that were to be banking, it never changed it's angle or course. Also, the object didn't emit any light really, it was just solid white with a darkish strip that seemed to move slightly. I watched it for quite awhile, at times losing it behind mountains only to see it again. Thought about it intensely, trying to rule out a plane or glider or balloon, but nothing made sense. This is such a remote location, it's HIGHLY unlikely that a balloon or glider would be in the area. At first thought it was a glider, then after watching it for awhile realize,there is NO location for a glider to take off in this remote wilderness. THEN realized, this was no glider. I know this area well. Not something you see.....ever."],"Case Number":"37482","Tags":"City","City":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/15/2012 01:45 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Features":"Dome","Longitude":"-114.733911","Log Number":"US-04152012-0001","Object Flight Path":"Hovering then path","Object Shape":"Unknown","Date of the Event":"04/14/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.069232,+-114.733911(37482)&iwloc=A&hl=en\"> mufon case (37482) map </A>"}