{"Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/37496.html.txt","/var/www/straped/mufon/org/37496.html"],"City":"Undisclosed","divs":["Sighting DetailsLast night around 8:30 in the evening I was sitting on my balcony on the beach gulf of Mexico and I looked to my right and I saw a burning yellow orange object come down about 100 feet or so flaming to be exact I thought for a moment this was a shooting star but quickly dismissed as they are white then within 10 seconds 2 more came down I was in disbelief I ran to my room and grabbed my iPhone when I got back or was gone. I tried to reason withy self to what this was and just said wow what was that no sooner then a minute later is when they just started dropping from the sky I thought it was parachutes. But the way these came down were as if they were , but parachute jumpers don't have flames on there parachutes I was in shock and FaceTime my sister she seen them to the best of her ability there were about four at that time she hung up and I started to record . I also thought it might have been meteor shower but they don't fall from the sky and hover then dissipate and make a right turn into horizon of gulf. I also asked any residents in building of they say anything and they said no. I really don't have an explanation for what I these were about 10 or more or so but I do know what I saw. I am a type of person to have facts or reason and do not just say oh I saw a UFO I really don't know what this was but it was not anything I have ever witnessed as a human on this planet ."],"Object Shape":"Fireball, Other","Tags":"City","Summary":"Last night April 14 2012 around 8:30 in the evening I was sitting on my balcony on the gulf Mexico I saw A very bright flaming object fall from sky I was in disbelief as I tried to rationalize this I am not a person to say what it was bu","Latitude":"27.674287","Source":"MUFON","Case Number":"37496","Object Features":"None","Log Number":"US-04152012-0015","Disposition":"Unresolved","Longitude":"-81.509284","Region":"Florida","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Date Submitted":"04/15/2012 07:05 UTC","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"04/14/2012 12:00 UTC","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=27.674287,+-81.509284(37496)&iwloc=A&hl=en\"> mufon case (37496) map </A>"}