{"Object Features":"Patterned Surface, Appendage(s), Other","City":"Los Angeles","files":["/var/www/straped/mufon/html2text/37490.html.txt","/var/www/straped/mufon/org/37490.html"],"Tags":"City","Longitude":"-118.270204","Source":"MUFON","Case Number":"37490","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/15/2012 01:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.086941,+-118.270204(37490)&iwloc=A&hl=en\"> mufon case (37490) map </A>","divs":["Sighting Details1. During the sighting I was smoking a cigarette outside on a raised terrace in the Los Angeles neighborhood of silver lake facing E. 2. A large, silent flash of light high above me in the sky caught my attention,after receding it immediately reveled the craft. 3. I thought the object was an extraterrestrial vessel emerging from a visual field cloaking device and ascending out of Earth's atmosphere. 4. After the explosion-like flash of light receded, there was a dark craft with light edges, shaped with rectangular and cube-like protuberances. After hovering briefly, the object began a rapid ascent into the upper atmosphere which lasted very briefly, only 4-5 seconds. The object quickly became a faint point of light in the upper horizon, before disappearing entirely. 5. At the time of the sighting, I felt confused and impressed by how a craft could demonstrate a silent explosion (an impossibility?) as a mechanism for some sort of function, and by comparison, how backwards and simple our Earthly technology seemed. 6. After the craft's rapid ascent it disappeared out of Earth atmosphere."],"Summary":"UFO APPEARS AFTER SILENT FLASH OF LIGHT AND ASCENDS INTO UPPER ATMOSPHERE","Country":"United States","Object Shape":"Square, Rectagular, Other, Unknown","Object Flight Path":"Other","Log Number":"US-04152012-0009","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 16th 2011"],"Disposition":"Unresolved","Date of the Event":"10/16/2011 05:45 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"California","Latitude":"34.086941"}