{"trends":["There have been 2 other sightings in Flint Township","There were no other sightings in Flint Township on or around April 14th 2012","This sighting has been favorited 1 time.",""],"divs":["Sighting DetailsI first noticed the object in February while looking at another object in the eastern sky. I had been trying to take pictures as I told my niece that there were a lot of ufos in the sky. As I was watching this object in the eastern sky with my great-niece and her boyfriend, they walked in the house and I stayed to watch all the aircraft in the area. I live near an airport that is about 3 miles away but, I have never seen it like that night since the 70's. As I watched, a star came from the sky in the southeast looping around toward the front of the building which faces west. It must have been a couple hundred feet off the ground. I ran to the other door. This object was barely more than treetop high and moving very slowly over an area maybe as far as two miles away. I shouted to my niece,'DO YOU WANNA SEE A UFO'. She and her boyfriend came to the door and watched as the craft was spinning and hovering over the treetops. They asked me how far away it was and I said I thought maybe a mile. It started to loop around toward our direction as if searching and then headed north slowly. I was filming with my camera and turned the camera lights on to see if it would make a difference,[I really wanted them to see the light and come to investigate]. My niece and her man ran back in the house screaming,'turn that light off'. Laughing, I watched as the craft headed north which took my eyes past the location of this object I am talking about today.It was the brightest object in the sky except for the full moon and from February till now is in relatively the same area of sky. I actually did think it was a star or the new planet everybody is talking about until after posting on facebook about it, I went immediately back to look at it and of course it was gone. This was the around end of March and since then I tried to photograph it many times to no avail till last night. Previously, I had found a nice spot and as soon as I turned the camera on the image started to to fade out of view but was still sitting there in my vision as if they knew I was filming. This really made me work a little harder to get these images. My cheap camera doesn't do well in the dark so for this to show up at all is exciting. I have had experience with this sort of stuff all my life and have been an abductee repeatedly since I can remember. I am not concerned about publicity or fame from this, I would just like to see more people come forward without shame. I started telling people about this stuff in the 70's and even my family berated me for telling then. I am sure I will get more tuff words, I can handle it. If you want images, I have a few as, my computer keeps destroying itself and I lose all my stuff."],"Date of the Event":"04/14/2012 08:20 UTC","Object Flight Path":"Stationary,Hovering then path,Other,Unknown","Region":"Michigan","files":["/var/www/straped/mufon/html2text/37495.html.txt","/var/www/straped/mufon/org/37495.html"],"Object Shape":"Star-like","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Country":"United States","Date Submitted":"04/15/2012 06:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.005352,+-83.778037(37495)&iwloc=A&hl=en\"> mufon case (37495) map </A>","Case Number":"37495","Longitude":"-83.778037","Log Number":"US-04152012-0014","City":"Flint Township","Disposition":"Unresolved","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Summary":"This has been in the same relative position for over 2 months, it is there and in a while may disappear and return. There are other objects around as well as miitary aircraft.","Latitude":"43.005352"}