{"Tags":"City","Longitude":"-78.863333","Object Shape":"Star-like","City":"Mathias","Date Submitted":"04/15/2012 06:44 UTC","Latitude":"38.875","map":"<A HREF = \"http://maps.google.com/maps?q=38.875,+-78.863333(37494)&iwloc=A&hl=en\"> mufon case (37494) map </A>","Case Number":"37494","Weather Factors":"Unknown","Date of the Event":"07/04/2005 09:00 UTC","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"04:00:00","Summary":"I wittnessed 28 (over a period of 4 hours). They were zig-zagging through the sky between and around stars as if to catch your attention.","trends":["There have been no other sightings in Mathias","This sighting has never been favorited."],"divs":["Sighting DetailsI went on a trip to Hardy County WV, I guess it was July or August 2005. We were staying with some friends in a cabin style house at the top of a great big hill, very mountainous area.. I was on the back deck about 9pm, soking a ciggarette just star gazing, the air was so clear and your up higher in altitude so the stars were really catching my eye, they were very bright. Then I started watching what looked exactly like a star move in a straight line and then begin to change directions in NO-TIME FLAT, just one second one way...one second the other. It was literally zigzagging in between other stars. I mean at that far away the speed must have been AMAZING!! about 4 of my friends cae outside and watched also, turns we counted 28 of those things that night. Same color as any other star, same size... I mean going completely across the sky at times just to turn around. I had this crazy feeling they we're just doing it to see if anone was paying attention, just a private show for those who were. At times there were 2 or 3 at a time."],"Log Number":"US-04152012-0013","Object Flight Path":"Path with directional change","Object Features":"Undisclosed","Region":"West Virginia","Source":"MUFON","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/37494.html.txt","/var/www/straped/mufon/org/37494.html"]}