{"Country":"United States","Viewing Distance":"Unknown","Region":"Florida","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAround 11:35 a.m. this morning I was driving east on Indiantown Road in Jupiter, Florida. I had just passed under Hwy 95 and was attracted by flashes of light moving to the west just in front of me. At first I thought it was a plane in distress since it looked like it was in a slow spiral. As it turned I could not see any wings. As it came closer to my left I could see yellow flashing lights at each end of the object flashing one then the other. It really looked like a flying boxcar. I was watching the road and the object and saw it move (like doing a figure 4) in the sky. It was just under the clouds. The sun was out and when the object turned I could see flashes of sunlight hitting the sides of this object. The yellow lights flashed at each end as the object turned (rotated) end to end. The flashing lights were definitely yellow. I was in a little traffic and was obstructed by trees losing sight of it as I passed the Shell station on my left. I turned the corner but could not see the object any longer. Hope more reports are received by you. I feel calm and would like to see it again."],"files":["/var/www/straped/mufon/html2text/37497.html.txt","/var/www/straped/mufon/org/37497.html"],"Tags":"City","Disposition":"Unresolved","City":"Jupiter","Weather Factors":"Unknown","Object Features":"None","Longitude":"-80.090659","Log Number":"US-04152012-0016","Date Submitted":"04/15/2012 08:58 UTC","Summary":"Bright light reflecting off surface- boxcar shaped-yellow flashing lights on ends, rotating end to end.","map":"<A HREF = \"http://maps.google.com/maps?q=26.941695,+-80.090659(37497)&iwloc=A&hl=en\"> mufon case (37497) map </A>","Source":"MUFON","Date of the Event":"04/15/2012 11:35 UTC","Latitude":"26.941695","Case Number":"37497","Object Shape":"Square, Rectagular","trends":["There have been 14 other sightings in Jupiter","There were no other sightings in Jupiter on or around April 15th 2012"]}