{"City":"Gallant","divs":["Sighting DetailsWe were watching the top of a mountain very close to our home and we saw what appeared to be headlights then flashing blue lights and we thought it was the police. All of a sudden the flashing blue lights were in a field in front of our home. We saw numerous orbs of white, red and blue. The flashing lights grew more intense and we saw what appeared to be a white form, almost human like but it vanished as quickly as we had seen it. There was a red flash in the field across from us that appeared to be the tail of some form moving quickly across the field. We continued to see more red, white and blue orbs blinking in the field then a red orb appeared to be at the top of the mountain in front of us and as quickly as it was seen by us it came at us faster than we had time to process and right before we ran inside we both noticed it looked very insect in form by the time it got to us. We continued to see red, white and blue lights at the top of the mountain hovering up and down above and below the tree line and casting a very bright white light on the top of the mountain and suddenly they disappeared. this all took place over a two hour time span. We were both very scared but remained outside to watch this phenomena. There is absolutely no way to define these things or the way they moved silently with such speed but gave off so much light. At first we thought the white orbs were lightning bugs but later determined the size was much too great to be that. Also the red flash in the field and the white flash that revealed (only for a second) what appeared to be a type of humanoid form is completely unexplainable to us."],"Source":"MUFON","Object Features":"Unknown","Weather Factors":"Unknown","Log Number":"US-04162012-0004","Disposition":"Unresolved","trends":["There have been no other sightings in Gallant","This sighting has been favorited 1 time."],"Country":"United States","Region":"Alabama","Longitude":"-86.311312","Latitude":"33.943395","files":["/var/www/straped/mufon/html2text/37504.html.txt","/var/www/straped/mufon/org/37504.html"],"Viewing Distance":"101-500 Feet","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"04/15/2012 10:24 UTC","Summary":"2 hour time span of sightings","Date Submitted":"04/16/2012 01:26 UTC","Object Flight Path":"Path then hovering","Case Number":"37504","map":"<A HREF = \"http://maps.google.com/maps?q=33.943395,+-86.311312(37504)&iwloc=A&hl=en\"> mufon case (37504) map </A>"}