{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Log Number":"US-04162012-0003","Latitude":"41.121012","Disposition":"Unresolved","Longitude":"-78.758326","City":"DuBois","Weather Factors":"Unknown","Object Shape":"Boomerang, Triangle","divs":["sighting details4\\16\\2012 around 12:37(am) my girlfriend and i were watching the sky, browsed an app on my mobile device to watch satellites, and then i looked straight up and even tho at night i started to make a shape out(12:40 am). it was directly over me heading south\\west. it looked pretty large, bigger than planes i've seen before, made no sound whatsoever. it had an almost stealth bomber look(the boomerang shape), it had blurry outlines like a haze almost. very misty and black. even with the night sky, due to the light pollution, i was able to see the blackness of this object. i'd say it could've been a few hundred feet from wingtip to wingtip. it was also flying very low especially for an aircraft and judging by the height i am positive i would've heard a sound. as i watched it fly for about 6 seconds it seemed to just vanish, almost ghost like(about 30 degrees south\\west). my best guess it was flying at an altitude of around 300-550 feet. there was no lights visible to blinking and behind the whole wingspan seemed to look distorted almost as heat waves come up off a road on a hot day. never seen anything like this in my life(even after living on various military bases)."],"Date of the Event":"04/16/2012 12:00 UTC","trends":["There have been 2 other sightings in DuBois","There were no other sightings in DuBois on or around April 16th 2012"],"Sighting Duration":"Undisclosed","Case Number":"37503","Object Flight Path":"Straight-line path,Unknown","Object Features":"Wings, Unknown","Region":"Pennsylvania","Country":"United States","Summary":"Weird shadow like Boomarang disc","map":"<A HREF = \"http://maps.google.com/maps?q=41.121012,+-78.758326(37503)&iwloc=A&hl=en\"> mufon case (37503) map </A>","files":["/var/www/straped/mufon/html2text/37503.html.txt","/var/www/straped/mufon/org/37503.html"],"Source":"MUFON","Date Submitted":"04/16/2012 01:01 UTC","Tags":"City"}