{"Weather Factors":"Unknown","Object Shape":"Square, Rectagular","Latitude":"39.747107","Longitude":"-104.981718","divs":["Sighting DetailsI was having lunch, alone, in my car at 11:25AM when I observed an object that was traveling towards me at a distance of 15 miles.(estimate) I thought at the time it was a banner that was being towed behind a plane. I thought at the time that it kind of fluttered.I initially thought it was stationary untill it turned to it's left, my right, heading north. That is when I searched for the plane that I thought should have been towing this. I did not see anything else. This object was a rectangle,a light solid color, a light grey. What was strange was that it was a rectangle when it was traveling toward me. This all happened in Denver, Colorado on 10-30-2011. I was parked across the street from a golf course. I took a few photo's with my phone.I was going to try to follow it, but realized it was a good distance away, and I did not think I could drive safe, in lunch time traffic and keep an eye on it. I did pull forward and take a few more pictures. It seemed to speed up slightly, the farther away it got. That is when I lost sight of it. This took maybe 5 minutes or less. I then looked at the pictures I took, not really seeing anything, I began to zoom in on the picture, and kept the new pictures. I was able to at least get the shape of the object. I did watch the news and newspapers the next few days,although I did not see any reports of anything unusual. I have found a few reports of rectangles in the Denver area, but not on my date. I will send the best pictures, but they are from a phone camera taken at a distance."],"Viewing Distance":"Over One Mile","Date of the Event":"10/30/2011 11:26 UTC","Object Features":"None","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37514.html.txt","/var/www/straped/mufon/more/37514_submitter_file1__denverufo1.jpg","/var/www/straped/mufon/more/37514_submitter_file2__1030111126b_0001_0001ufodenverpiczoom.jpg","/var/www/straped/mufon/more/37514_submitter_file3__1030111126b_0001_0001_0002_0001_0002denverufosuperzoom.jpg","/var/www/straped/mufon/org/37514.html"],"City":"Denver","Tags":"City","Object Flight Path":"Path with directional change","Summary":"object appeared to be traveling toward me, then turned and traveled parallel","Case Number":"37514","Source":"MUFON","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around October 30th 2011","This sighting has never been favorited.",""],"Sighting Duration":"00:05:00","Date Submitted":"04/16/2012 09:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.747107,+-104.981718(37514)&iwloc=A&hl=en\"> mufon case (37514) map </A>","Country":"United States","Log Number":"US-04162012-0014","Region":"Colorado"}