{"Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Alameda","There was one other sighting in Alameda on or around April 14th 2012"],"Tags":"City","Date of the Event":"04/14/2012 12:00 UTC","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Log Number":"US-04162012-0023","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.774606,+-122.236766(37523)&iwloc=A&hl=en\"> mufon case (37523) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Undisclosed","Source":"MUFON","Region":"California","City":"Alameda","files":["/var/www/straped/mufon/html2text/37523.html.txt","/var/www/straped/mufon/org/37523.html"],"Object Flight Path":"Stationary","Longitude":"-122.236766","Date Submitted":"04/16/2012 06:30 UTC","divs":["sighting detailsi was at at a golf course in alameda on sat 4\\14\\12 (approx. 3pm)and one of the guys i was playing with just hit his drive and he said \"i popped it up\".... so i looked up and i saw this white object that looked like a golf ball. and i looked at it and looked at it and it didn't move. mind you it was really windy(25-30 mph gusts) and not a cloud in the sky. yet this object did not move or even make a noise. so i turned to the rest of our group and i said jokingly \" hey i thought that was your ball\" as i pointed towards the object in the sky. everyone stood and stared at this object not knowing what to say or think....i hesitated and then i said \"i didn't think you could see saturn today.\"..as we were golfing next to an airport it was quite clear this was not a plane or helicopter. as it had no obvious sign of direction, did not appear to make a sound and did i mention it looked like a golf ball. we proceeded down the fairway and it did not move, much like you would expect from looking at the moon. when we got to the green (aprox. 1 minute later)we all looked around and it had vanished. it was no where to seen...we looked and looked as if expecting to see that it was just a ballon or blimp or anything. but it was gone........"],"Summary":"Golf ball like object seen hovering, no sounds","Latitude":"37.774606","Case Number":"37523"}