{"Log Number":"US-04162012-0026","divs":["Sighting DetailsI was driving west on Hwy 152 from Los Banos, CA at 7:30am. As I drove past the dam at the east end of San Luis Resevoir I saw a bright light above the hills on the west end of the lake. My first thought was that it was a reflection of the sun behind me off a low flying silver airplane. The light was not moving so I thought it might be a reflection off the tip of a radio tower. I was not aware of a radio tower in the area so over the next couple of miles I looked hard to see if I could spot on underneath the light. As I drovealong the north side of the lake and over Pacheco Pass for the next five minutes or so, I lost visual contact with the light. As I descended the pass, I noticed a white car parked along the road and a man standing next to it with binoculars. Around the next curve I saw 4 cars pulled over, with people out of the cars looking upward to the south. I thought they had spotted a California condor or some other rare bird. Around the next corner were 6 cars pulled over. I had to know what they were looking at. I pulled over and looked up. There was a large metallic rectangle perched in the sky. I got out of my truck and immediately began talking to the man & woman from the next car. Over the next 15 minutes we talked about everything we saw, so I know we all saw the same thing and had the same questions. I saw a large rectangle floating in the sky at roughly 60 degrees up from the horizon. I extimate that the rectangle was half a mile or less from us, 80 feet high and 50 feet wide. The side facing us was silver metallic in color. It was highly reflective, like Mylar. It was silvery except when it reflected the sun at us. The bursts of reflection were sporadic as though there was equipment or a texture of some sort on the surface. The object was stationary and silent. We looked for wings and balloons, and listened for motors. We saw no means of propulsion or levitation with which we were familiar. After a few minutes, perhaps 5, the object began to rotate. As it rotated 90 degrees, we saw that the side was very narrow and black. It rotated a little more and we saw that the back was also black in color. The narrow side showed us that the overall shape of the object was similar to a mattress or paperback book. The corners and edges were crisp like a book rather than rounded like a mattress. Given my estimate of a 50x80 foot object, I estimate that the thickness was about 5 feet. Once the object rotated we observed that it was moving slowly toward the southwest. The winds were blowing gently in that direction, so it is possible that the object was drifting with the wind. We continued to look, almost compulsively, for evidence of a helium-filled balloon. The object did not appear to change its elevation. After 10 minutes the object had moved far enough away from us that it was a small black speck with one small bright reflective spot. At this point the man and his wife left. I watched the object 5 minutes more, until 8:00AM, and then left. Its appearance did not change again. The object could have been a giant book shaped balloon filled with helium made of silver and black Mylar. The hurdles to this possibility are: 1) a very odd shape and orientation for a balloon, 2) object did not appear to flex or otherwise react to the wind, 3) there is no apparent source of a 20,000cf balloon that would only have risen to 400-800 yards near San Luis Reservoir (closest towns are 20 miles east and 20 miles west) 4) object rotated 90 degrees then stopped rather than continuing its rotation from angular momentum, 5) the edges appeared crisp like metal rather than puffy like a Mylar balloon."],"Source":"MUFON","Tags":"City","trends":["There have been 6 other sightings in Los Banos","There were no other sightings in Los Banos on or around April 16th 2012"],"Summary":"San Luis Reservoir","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-120.842465","Date of the Event":"04/16/2012 07:30 UTC","Date Submitted":"04/16/2012 06:55 UTC","files":["/var/www/straped/mufon/html2text/37526.html.txt","/var/www/straped/mufon/org/37526.html"],"Region":"California","Object Flight Path":"Stationary","Latitude":"37.065039","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=37.065039,+-120.842465(37526)&iwloc=A&hl=en\"> mufon case (37526) map </A>","Country":"United States","City":"Los Banos","Weather Factors":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"37526","Object Features":"None"}