{"Region":"Texas","Sighting Duration":"00:05:00","Object Flight Path":"Hovering then path","City":"La Porte","Weather Factors":"Unknown","Latitude":"29.596586","Country":"United States","Source":"MUFON","Disposition":"Unresolved","Summary":"had an URGE to look up, saw a flash and object started moving north, then east, then north","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"03/22/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.596586,+-95.030158(37532)&iwloc=A&hl=en\"> mufon case (37532) map </A>","Object Features":"None","trends":["There have been 5 other sightings in La Porte","There was one other sighting in La Porte on or around March 22nd 2012"],"Date Submitted":"04/17/2012 01:00 UTC","Longitude":"-95.030158","files":["/var/www/straped/mufon/html2text/37532.html.txt","/var/www/straped/mufon/org/37532.html"],"Log Number":"US-04172012-0002","divs":["sighting detailsi was at work and i met up with a contractor to explain a job i had for him to do. he was looking down at a list i gave him when i had an urge to look up. as i looked up i noticed what looked like either a flash of light or a glint from the sun reflecting off of its surface. it was hovering motionless for about 15 seconds giving me time to point it out to my co worker and the contractor. it then took off slowly as if it were fluttering up and down erratically then taking off very quickly. the object made a sharp 90 degree turn then straight, another 90 then straight again. the object then shot off while vearing to the left slightly. we sat and watched it without saying a word until it was no longer visible. as it took off, it looked to be moving much faster than any jet i had ever seen. it was a very cool experience. the object looked like a large white\\pink orb that seemed to be disk shaped and reflected sun light as it changed direction. about 10 seconds after it had left sight we saw an f=16 headed in the same direction fast."],"Case Number":"37532","Object Shape":"Circle, Disc"}