{"Object Shape":"Unknown","Case Number":"37538","Date Submitted":"04/17/2012 10:11 UTC","Object Features":"Undisclosed","Sighting Duration":"00:20:00","Tags":"City","Summary":"I only saw bright lights shining in the winows and experienced beingst","divs":["Sighting DetailsI wanted to share this story because it may or may not be related to another incident in Fayetteville in 2007. I lived in Fayetteville, Nc from 2004-2006. Shortly after moving to the area I began having night time encounters with beings. I first noticed bright lights in the bedroom windows, then found myself unable to move or speak. I saw several beings around the bed. They did not speak or move, but seemed to be projecting images into my mind. They flashed colors and images that varied from the humorous to terrifying images of war. As suddenly as they appeared they were gone and I was able to move again. This happened several times, even after we changed residences. We moved from Fayetteville to Crestview in 2006, and there have been no incidents that I remember specifically since. The entities were similar to the \"typical\" alien, with a grey sin with an almost metallic sheen and large black eyes that didnt blink. They were smaller than an adult human and appeared to hover around the bed. After these encounters, I began to have debilitating anxiety and personality issues as well as some physical issues that may or may not be related to the encounters. I have always attributed these events to the phenomenon of sleep paralysis, and kind of laughed them off. I wanted to share this information just in case it could be helpful. It may well have been a physcological or physical issue, but the memories of these events are so vivid that I really don't know if it is real or not. I briefly discussed this incident with a mufon investigator while describing a group of objects that I saw, and again at that time, I blamed it on sleep paralysis. I discussed these events with my family and it kind of became a running joke, but in the back of my mind, I have always had a feeling that something sinister had been taking place."],"Region":"North Carolina","Weather Factors":"Unknown","Longitude":"-78.870958","Date of the Event":"05/16/2005 01:08 UTC","files":["/var/www/straped/mufon/html2text/37538.html.txt","/var/www/straped/mufon/org/37538.html"],"trends":["There have been 20 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around May 16th 2005"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.058454,+-78.870958(37538)&iwloc=A&hl=en\"> mufon case (37538) map </A>","City":"Fayetteville","Object Flight Path":"Unknown","Viewing Distance":"Unknown","Log Number":"US-04172012-0008","Latitude":"35.058454","Disposition":"Unresolved","Source":"MUFON"}