{"Object Features":"None","Country":"United States","Date of the Event":"04/07/2012 01:15 UTC","Case Number":"37535","Latitude":"35.427501","divs":["Sighting DetailsThe Saturday before Easter, we had about 30 family members at my place for an Easter egg hunt. My grown daughter and I were sitting in a lawn swing talking and looking at the beautiful puffy white clouds, when she pointed, and excitedly said \"what in the world is that\". At about the same time I also saw it. What we observed was a very fast moving, pure white sphere-like object, traveling at an unusually high speed. It was moving from due East towards due West. I say sphere-like because it did not appear to have any defined boundaries, and was the whiteness of the whitest portion of the clouds, yet it held sphere like shape. The blue sky was very clear between clouds so we saw it very clearly for a short period of time. It did not \"shine\" as in reflective. It was simply cloud white. We first spotted it at about 45 degrees above eastern horizon, and lost it in clouds at about 45 degrees above western horizon. It traveled in a straight line almost overhead (85 degrees above horizon, and covered this distance in about 4-5 seconds. Cloud tops estimated at 6500ft. The object appeared to be flying just above the lowest clouds and through one of the tallest cloud. Wind and cloud direction from NW to SE. Did a little flying years ago and am pretty good judge but have not confirmed from official sources. If held at arms length, it would have been about the size of a contact lens. It made no sound, and left no contrail. We both had the feeling that whatever it was, was \"on a mission\". I had my cellphone in my hand, but it happened so fast that it was gone before I even thought about it."],"trends":["There have been no other sightings in Lewisburg","This sighting has never been favorited."],"Object Shape":"Sphere","City":"Lewisburg","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"04/17/2012 01:54 UTC","Source":"MUFON","Longitude":"-86.902569","map":"<A HREF = \"http://maps.google.com/maps?q=35.427501,+-86.902569(37535)&iwloc=A&hl=en\"> mufon case (37535) map </A>","Tags":"City","Viewing Distance":"20 Feet or Less, Over 1 Mile","Log Number":"US-04172012-0005","Summary":"White spherical object observed traveling at very high speed.","Disposition":"Unresolved","Sighting Duration":"00:00:06","Region":"Tennessee","files":["/var/www/straped/mufon/html2text/37535.html.txt","/var/www/straped/mufon/org/37535.html"]}