{"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Longitude":"-81.78999","Source":"MUFON","Log Number":"US-04172012-0014","map":"<A HREF = \"http://maps.google.com/maps?q=26.146676,+-81.78999(37545)&iwloc=A&hl=en\"> mufon case (37545) map </A>","Tags":"City","Case Number":"37545","divs":["Sighting DetailsMy husband and I were sitting on the lanai outside. We just finished dinner and we were enjoying the evening. It was clear night with bright stars, not completely dark yet. Suddenly, I noticed a something with red - orange light silently flying in the air towards us (direction of southwest). I made a joke that it is UFO flying to abduct us. It turned it's course away from us and immediately we noticed one more object flying towards us. I made a comment that maybe this one is going to abduct us. Then the third one came. Suddenly we realized that the first one had disappeared, too fast for anything traveling at this speed (helocopter speed). At that point we looked at each other and exclaimed \" what are we waiting for?\". I had binoculars in mind but my husband rushed to the bedroom and got out a telescope. Meanwhile, there were seven objects passing one after another following the same path. There were three closer together. My husband caught a UFO in the telescope briefly as it was moving through. I got a small glimpse of it as well. Then I decided to run upstairs to get binoculars. UFO' s kept coming. We lost count of them. I focused binoculars and what I've seen was exactly what my husband have seen in telescope what was not visible to the naked eye. There was a dome which was made out of some reflective material which had small white lightings at the ridges. It was at least double the size of the red - orange light at the bottom. It seems that UFO' s were ascending from near by golf course. As they passed by our house ( about a mile away) they were gaining heights very gradually, then they turned northwest away from us and disappeared quite fast. There were total at least 15 of them. We tried to take some pictures and videos but they didn't turn out well. In the dark all you can see is a red light out of focus. They were completely silent, all we could hear were crickets in our backyard. The whole experiance lasted about 10 minutes. What we have seen through telescope and binoculars were the important testimony for us. Both of us have seen the same thing which was amazing beyond believe. This is our first experience."],"Latitude":"26.146676","Date Submitted":"04/17/2012 12:18 UTC","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around April 14th 2012"],"City":"Naples","Object Shape":"Fireball","Summary":"15 to 20 fireball UFO's ascending in the same path. Through telescope and binoculars doom above the orange red lights was observable.","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/14/2012 08:35 UTC","Object Features":"Dome","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37545.html.txt","/var/www/straped/mufon/org/37545.html"],"Sighting Duration":"Undisclosed","Region":"Florida"}