{"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/3755.html.txt","/var/www/straped/mufon/org/3755.html"],"Summary":"greeny grey, fat rugby ball like shape, eratic movements above cloud level, covering vast distance in sky.","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-1.968243","Region":"England","Country":"United Kingdom","Latitude":"51.718495","Date of the Event":"08/13/2005 10:30 UTC","Source":"MUFON","trends":["There have been no other sightings in Cirencester","This sighting has never been favorited."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.718495,+-1.968243(3755)&iwloc=A&hl=en\"> mufon case (3755) map </A>","Case Number":"3755","Log Number":"GB-08222005-0002","Viewing Distance":"Unknown","Tags":"City","divs":["Sighting Details1. Driving back from the village of Minchinhampton to Amberley after eating out on holiday. 2. I noticed a strange movement of light in the sky (was in the middle of nowhere so it stuck out a bit!). 3. At first I thought it was some kind of reflection on the windscreen but it was obvious it was not when my girlfirend said she could see it too. Once we realised it was above the cloud level and had observed it's eratic movements we were a bit stunned. 4. The object was a greeny grey colour (obscured by cloud)and resembled a fat rugby ball above the cloud level. It was a cloudy night yet we could see something moving beyond it. It's movements were completely eratic covering vast distances, left right, back and forward. Changing direction far too quickly for it to be any kind of human craft. There didn't appear to be any noise (although we were inside the car travelling at the time). It was quite large as we could see it without looking hard and it was well up in the sky. 5. At first I was a bit confused as I tried to think of a logical answer for what it could be. I was still driving so asked my girlfriend to have a look. She wasn't sure either and then confusion turned to a little fear. Both a little freaked out being in the sticks and something strange above us. It was only a short distance back to the hotel and we had our eye on it all the way. When we reached the hotel we got out of the car and looked to the sky but whatever it was had gone. We probable saw it for approximately 2 minutes. 6. We lost eye contact when we got out of the car and when we looked again it had gone. No piccies i'm afraid. Only had a camera phone with us but were too stunned to think about taking pictures (and possibly a little scared to keep looking at it)."],"Object Features":"Undisclosed","City":"Cirencester","Object Shape":"Undisclosed","Date Submitted":"08/13/2005 10:30 UTC"}