{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.9946,+-82.35122(37552)&iwloc=A&hl=en\"> mufon case (37552) map </A>","files":["/var/www/straped/mufon/html2text/37552.html.txt","/var/www/straped/mufon/org/37552.html"],"Source":"MUFON","divs":["Sighting DetailsStanding along Exmouth waiting for the bus facing SW towards the border,when I ended up seeing three long missle like looking planelike images dark gray in colour. The wide view of the sky allowed me to view each flying duration for about 6 to 8 seconds, appearing in the distance. Trees & buildings closer to me limited my seeing where they actually came from and where they were headed. I didnt really think anything when I noticed the first one. Just instantly thought how odd to see an F15 fighter jet fly over so low and no noise. Then I was thinking how neat to see that but then I questioned myself...was that a military plane? Next thing I knew I saw a second one flying along the same path roughly 30 seconds later. They didnt fly very fast just a steady paced glide almost. I tried to listen for the noise and couldnt hear anything other than the cars going by along the street. F15s make loud noise & dont fly that low. If I didnt know better they could've been low enough to fly under the bridges or just overtop. Then to my surprise I saw a third and then my eyes were glued to the sky to see if there would be another. No more appeared. I'm a skeptic but I sure will say this really intrigued me to investigate if any planes were in the area etc. I could find nothing & found nothing of any other people reporting to see them. I was excited & yet shook up about the whole thing & cant get the images out of my mind what I had seen."],"Disposition":"Unresolved","Longitude":"-82.35122","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Case Number":"37552","Weather Factors":"Unknown","Latitude":"42.9946","Date Submitted":"04/17/2012 08:35 UTC","Country":"Canada","City":"Sarnia","Sighting Duration":"Undisclosed","trends":["There have been 16 other sightings in Sarnia","There was one other sighting in Sarnia on or around April 2nd 2012"],"Summary":"Three objects flew from NW to S steady line about 30 seconds apart","Region":"Ontario","Object Shape":"Bullet, Missile","Object Flight Path":"Straight-line path","Date of the Event":"04/02/2012 07:30 UTC","Log Number":"CA-04172012-0019"}