{"Date Submitted":"04/17/2012 10:10 UTC","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-04172012-0023","Object Features":"None","Object Shape":"Circle, Flash, Sphere","Summary":"4 large yellow/orange round lights appeared & faded sequentially.. Each glowed brightly for 1-2 sec., then faded quickly. Lights were in straight line appearing equidistant from one another. Finally 5th light appeared / faded below original line.","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around April 17th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.753594,+-78.800763(37557)&iwloc=A&hl=en\"> mufon case (37557) map </A>","files":["/var/www/straped/mufon/html2text/37557.html.txt","/var/www/straped/mufon/org/37557.html"],"Case Number":"37557","Country":"United States","divs":["sighting detailsi was sitting on the boardwalk in the center of myrtle beach,looking at the ocean at dusk. first couple of stars in the sky were barely visible. planes and boats were still plainly visible. all of a sudden relatively large golden\\orange ball appeared and glowed brightly for approx. 1-2 seconds then faded quickly. a 2nd appeared and faded in the exact same fashion right beside the first. a third and then 4 appeared\\faded in the exact same fashion. all appeared in an exactly straight line. 5 appeared, glowed and faded directly below the line of the other 4. all appeared and faded sequentially. when the first faded, the second appeared 1-2 seconds later. when 2nd faded the 3rd appeared and so on. entire incindent lasted approx. 10-15 seconds. as i explained planes and other objects were still plainly visible as it was dusk. there were not other objects associated with these lights. although it was fairly clear with no cloud reference, they appeared to be a few miles away and quite large. the lights were significantly larger and significantly brighter than the planes arriving and departing the airport a few miles to the south. the glow was similar to a firey color\\fashion - what i imagine a fighter jet engine flare would look like if you were looking directly into its tail. as if a jet went full throttle and then quickly throttled back. only much larger. it almost appeared to burn and disappear like a flare only each light was perfectly stationary. when it was over i looked around to see if anyone else had seen it and there was only an asian couple - like any ignorant american, i naturally assumed wouldn't speak english and didn't talk to them :) i asked several couples that walked by if they'd seen it but no one else seemed to have been looking. i kept watching the sky for 15 min but saw nothing else. either way feel very lucky to have witnessed something so spectacular. from a cursory search of google, i'm one of several dozen folks who have seen such a thing a myrtle beach over the last 5 years."],"City":"Myrtle Beach","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Latitude":"33.753594","Disposition":"Unresolved","Longitude":"-78.800763","Viewing Distance":"Over One Mile","Region":"South Carolina","Tags":"City","Date of the Event":"04/17/2012 08:10 UTC"}