{"Object Features":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","Region":"California","Sighting Duration":"Undisclosed","Summary":"Grayish colored, blimp/cigar-shaped object seen in the SW skies in full daylight","Date Submitted":"04/18/2012 11:00 UTC","Disposition":"Unresolved","Case Number":"37567","trends":["There have been 13 other sightings in La Mesa","There were no other sightings in La Mesa on or around April 17th 2012"],"Tags":"City","Date of the Event":"04/17/2012 03:00 UTC","Longitude":"-117.018034","Log Number":"US-04182012-0009","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"32.774059","City":"La Mesa","Object Shape":"Blimp, Cigar","divs":["Sighting DetailsI was driving out of my complex, which is located high up in the hills of La Mesa, when I spotted an object in the SW skies. I see planes coming in all the time, and this was no plane. It was just hovering above the tree tops in the distance. I pulled my car over to try and get a better look and it started to move VERY SLOWLY. Twice it kind of rotated to a 45 degree angle, hovered like that, then it straightened back out and kept up it's crawling pace. It was not shaped like a plane, but rather like a blimp or a cigar. It was so far away I was having a hard time watching it, really. That being said, the planes that were coming in, and there were at least four that passed as I watched, were much closer in proximity to me, and this object at it's far-off distance appeared to be the same size. So it must have been huge. Anyways, I tried taking three pics of this thing and I'll be damned if it barely showed up in just ONE photograph... and by barely I mean I had to zoom in and crop it for a while before I finally found it - and it doesn't look like anything spectacular, therefore I have not included it. Now, it could very well have been a blimp, I have no clue, but do blimps rotate at 45 degree angles and hover? I would like to know this... and I looked on the internet to see if I could find anything about blimps flying over San Diego and I couldn't find anything. This is my second sighting of something unusual in exactly 7 days... I have never seen a UFO, now I have seen TWO in just a week... I don't know. Please help."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.774059,+-117.018034(37567)&iwloc=A&hl=en\"> mufon case (37567) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37567.html.txt","/var/www/straped/mufon/org/37567.html"]}