{"Object Flight Path":"Straight-line path","City":"Moore","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around April 17th 2012"],"Object Shape":"Triangle","Region":"Oklahoma","divs":["Sighting Details In Oklahoma City 4-17-12 at around 1:00 AM I saw something I've never seen before. Here is my best description of the sighting. I was outside having a smoke before going to bed when something caught my peripheral vision, at first it looked like a HUGE bird gliding but it was a craft that looked somewhat triangular, best I could tell. It made absolutely no audible sound, nothing, dead quiet. I would guess it was anywhere from 300 ft -500 ft high, was flying very low and fairly slow. It looked as though it was gliding or floating effortlessly. A couple of things that really threw me were, the two lights, one on each wing tip, looked as though you were shining a light thru a dense fog or haze, there wasn't a cloud in the sky, the lights did not look vivid or stark in contrast like you would normally see on a aircraft, these had a sort of cloudy glow to them. Misty looking is a good description and possibly why the craft itself looked cloaked or almost transparent to me, although, I could vaguely make out a triangle shape it was not necessarily definitive as such, it also made it hard to judge altitude and size of the craft. My best guess as to the size of the craft would be roughly 40ft -80ft in width and it seemed wider than it was in length. The sighting only lasted maybe 10 seconds, my back was to the craft and I didn't see it approaching. I did not see it until it was right above me. It disappeared very quickly and not by speed, almost as though someone turned out the lights. I was not able to visually track it like you can a normal aircraft on a crystal clear night. It took me a few minutes to process what I saw, My gut feeling is that this is military and not a alien craft, whatever the technology was that I saw, it has definitely not been made public. Tinker AF base is fairly close and the flight path was similar to other craft I have seen in the past."],"Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Date of the Event":"04/17/2012 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"37562","Object Features":"Wings","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.342788,+-97.484143(37562)&iwloc=A&hl=en\"> mufon case (37562) map </A>","files":["/var/www/straped/mufon/html2text/37562.html.txt","/var/www/straped/mufon/org/37562.html"],"Date Submitted":"04/18/2012 01:09 UTC","Summary":"Silent Black Triangle","Weather Factors":"Unknown","Longitude":"-97.484143","Latitude":"35.342788","Source":"MUFON","Log Number":"US-04182012-0004"}