{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.992297,+-71.758678(37566)&iwloc=A&hl=en\"> mufon case (37566) map </A>","Region":"New Hampshire","divs":["Sighting DetailsI was driving my girlfriend home to Warren NH from North Woodstock NH at aprox. 1 AM. We were on Route 118 a very old and remote road with little to no traffic at that time of night. We were travelling in a southwesternly direction and had just crested the height of land and was beginning the decent into the Warren area valley. The road has many sharp twists and turns, I was used to driving the road at night was was travelling at a speed of aprox. 40 MPH. My girlfriend had fallen asleep. Suddenly, as I rounded a curve, I saw a sharply defined object (diamond shaped with a flat top very similar in shape to a cute diamond such as one that would be used to set into a ring. I was glowing in what I can only describe as a muted greenish orange color. While illuminating the object itself very clearly the light did not cause any sort of beam or glow, the edges of the object were visible and very sharply delimited. The object did not appear to be moving at all or making any noise. The object dominated the night sky which was cloudless with no moon. At first I thought the object MUST be the moon, but the shape and color soon caused me to dismiss that possibility. The object seemed very large, taking up to one quarter of the night sky that was visible through my windshield. Because the road in very narrow and there is no place to turn off the road safely, I continued to drive, but slowed down considerably to continue observing the object. I was able to keep the object in view for about 30 - 45 seconds before losing sight of it due to a sharp dip in the road. When I rounded the next curve, I caught a quick (10 seconds at most) of the top part of the object with trees and part of the mountain visible in front of it. After that I saw no more of the object, but continued driving slowly, hoping to get a better look at it, I was startled by girlfriend asking me \"what are you looking \" from the passenger side of the truck. I said something like \"oh nothing\" and started to pick up speed a bit. Then my girlfriend said \" are you looking for the ufo?\". \"Did you see it too?\" I said, surprised that she had been awake and had seen what I say. I had her describe what she saw and it coincided with what I have described here. I should mention here that my girlfriend was very much a skeptic on the topic of UFOs and for her to confirm what we saw is significant evidence of the veracity of the event. I had been keenly interested in UFO earlier in my life, but at this time had not been actively interested for close to a decade. I had pretty much filed UFOs under \"well, I just don't know what the heck is going on.\" and had let it rest at that. At any rate, I dropped my girlfriend off and drove back to North Woodstock over the same road we had seen the UFO on and did not see anything on the way home. My interest in the UFO phenomena has been rekindled in the last couple of years and I wanted to get an account of what we saw that last fall night. over 20 years ago. Thanks for reading this."],"Object Shape":"Diamond","Object Flight Path":"Stationary,Hovering then path","Disposition":"Unresolved","Date Submitted":"04/18/2012 10:55 UTC","Tags":"City","Summary":"Saw diamond shaped with flattened top shaped UFO hovering/stationary at treetop level on remote mountain road.","files":["/var/www/straped/mufon/html2text/37566.html.txt","/var/www/straped/mufon/org/37566.html"],"Case Number":"37566","trends":["There has been one other sighting in Woodstock","There were no other sightings in Woodstock on or around November 13th 1997"],"City":"Woodstock","Date of the Event":"11/13/1997 01:00 UTC","Object Features":"None","Country":"United States","Log Number":"US-04182012-0008","Latitude":"43.992297","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-71.758678","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}