{"Summary":"2 star-like lights, high in the sky, flying for a brief time before disappearing.","Longitude":"-74.587337","Object Flight Path":"Straight-line path","trends":["There have been 8 other sightings in Egg Harbor Township","There were no other sightings in Egg Harbor Township on or around April 16th 2012"],"Country":"United States","Object Shape":"Star-like","Log Number":"US-04182012-0013","Viewing Distance":"Unknown","Date Submitted":"04/18/2012 03:01 UTC","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/37572.html.txt","/var/www/straped/mufon/org/37572.html"],"divs":["Sighting DetailsOn Monday April 16, 2012 at 8:25pm (ET) I was standing outside on my roof. Many nights I sit on my roof, gazing at the sky. Immediately after going outside, I looked up and within seconds, noticed two star-like objects gliding across the sky. The two dots appeared to be flying together; the distance between the two remained constant during my observation. They were flying slightly in an upward direction. Their altitude appeared to be extremely high. I observed the objects flying for roughly 20 seconds. After, they simply disappeared. It was not a cloudy night. In fact, there was zero cloud coverage in the portion of the sky I was viewing. I was able to immediately rule out commercial airplanes and other crafts that frequent the sky where I live. This same night, there were also another incident I witnessed (all before 8:35pm). I saw another star-like object flying at a very high altitude. Its' light didn't appear particularly bright (comparable to a dim star), however for about a 5 second period, the light swelled and grew brighter (the object got larger). Then the light returned to its original brightness and I viewed it until it became too far away for me to see."],"Disposition":"Unresolved","Sighting Duration":"00:00:20","Latitude":"39.35481","Region":"New Jersey","Case Number":"37572","map":"<A HREF = \"http://maps.google.com/maps?q=39.35481,+-74.587337(37572)&iwloc=A&hl=en\"> mufon case (37572) map </A>","Tags":"City","City":"Egg Harbor Township","Date of the Event":"04/16/2012 08:25 UTC"}