{"Tags":"City","Date of the Event":"04/17/2012 07:50 UTC","Region":"Arizona","Object Flight Path":"Straight-line path,Other","Sighting Duration":"00:00:03","map":"<A HREF = \"http://maps.google.com/maps?q=33.554334,+-111.898904(37584)&iwloc=A&hl=en\"> mufon case (37584) map </A>","Log Number":"US-04182012-0024","Disposition":"Unresolved","divs":["Sighting Details I was sitting on the outside of my patio (which faces south) with my best friend watching for satellites like I do most nights. Between 7:50 and 8:30pm. I saw 9 satellites (a personal best) 2 headed North, 5 headed South, 2 headed Southeast and 2 Shooting Stars. (I was facing East with my head laying on the back of my chair.) At 8:50 I saw 2 bright lights coming from the Southwest going overhead Northeast so fast that by the time I jumped out of my chair ,(pointing at them with both hands so my friend might see them.) walked about three steps the lights were out of sight. My friend did not see them. The lights were to the side of each other with the left one passing the right one. The left one slowed down really fast and the right one passed a little bit. Then the left one started going faster enough to pass the right one by a short distance and maintained the same speed slightly ahead of the right one. Both lights were solid white with no glow around then and more then four times the size of Mars with the naked eye. They were moving so fast I didn't even have time to grab my cell phone and when my friend jumped up to look they were out of sight that fast. Wow...."],"City":"Scottsdale","Object Features":"Unknown","Summary":"Two solid white lights moving faster then anything I've seen before.","Source":"MUFON","Longitude":"-111.898904","Case Number":"37584","files":["/var/www/straped/mufon/html2text/37584.html.txt","/var/www/straped/mufon/org/37584.html"],"Latitude":"33.554334","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around April 17th 2012"],"Weather Factors":"Unknown","Date Submitted":"04/18/2012 11:17 UTC","Object Shape":"Circle, Unknown","Country":"United States","Viewing Distance":"Unknown"}