{"Country":"United States","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Features":"Appendage(s)","Disposition":"Unresolved","Case Number":"37581","files":["/var/www/straped/mufon/html2text/37581.html.txt","/var/www/straped/mufon/org/37581.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.307754,+-112.24976(37581)&iwloc=A&hl=en\"> mufon case (37581) map </A>","Latitude":"48.307754","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsI had arrived home from the grocery store in Valier, Mt. Had my 3 kids with me and we were just unloading groceries from back of my van. I turned and noticed orange lights coming over the canola field to the east of us, headed directly towards us. The lights were what drew my attention. It came towards us and passed over the top of us in seconds. No sound at all. Both my middle son and I ran as fast as we could down our driveway to the road, as we had very tall pines as a windbreak around our house to the north and west. At the last second as it passed over us I saw it turn to the north. When we reached the end of the driveway, maybe 75 feet, it was gone. It was bullet shaped but wider at the back. I remember the lights were underneath and also some other objects, not sure, seemed like some kind of piping or support. I was so fast and silent, it was hard to see exactly. But it was not a plane, maybe a 100 ft off the ground and silent. Not shaped like a helicopter at all. Definately not a weather ballon. To this day I don't know what it was only that it fits the true definition of a UFO. I would love to know if any one else saw this object as my son and I still talk about it. My other two boys didn't notice it as they were slow getting out of the car, but David, who was only 7 still remembers the same thing as I did. It's given him an interest for life!!! Seen other unexplainable things too (at least to us), like flashes in space like someone took a flash photo. But very interesting. This happened probably in early 1996."],"Log Number":"US-04182012-0022","Date Submitted":"04/18/2012 08:57 UTC","Longitude":"-112.24976","Source":"MUFON","trends":["There have been no other sightings in Valier","This sighting has never been favorited."],"City":"Valier","Object Shape":"Bullet, Missile, Cylinder","Summary":"Arrived home with kids, saw bright light across field headed towards us.","Date of the Event":"04/01/1996 07:15 UTC","Region":"Montana"}