{"Sighting Duration":"00:03:00","Region":"New York","files":["/var/www/straped/mufon/html2text/37582.html.txt","/var/www/straped/mufon/org/37582.html"],"Log Number":"US-04182012-0022","City":"New York","Source":"MUFON","Date of the Event":"04/15/1972 11:00 UTC","Summary":"Looking out of 8th story window upper Manhattan, saw V formation, thought they were geese coming our way, then we saw they were disks, they made no sound, had no lights, traveling very fast, we ran up to the roof and saw them going back down Manhattan.","divs":["Sighting DetailsMy husband and I had gotten back from work late at night and were up in our kitchen on the 8th Floor in Washington Heights. We opened the window to enjoy the clear crisp night and we just admiring the view of downtown Manhattan. Washington Heights is higher up and so we had a view of the length of Manhattan, plus our building was higher then the others to the South. We were chatting near the window, and then I saw a V formation coming towards us, and at first I thought it was a flock of geese, and my husband and I saw at the same time that they were disks. They were moving very swiftly, made no sound and had no lights. The only way that we were seeing them was that the bottoms were lit up by the city lights. The disks were black looking against the dark sky, but had a rusty orange color, mixed with diffused light. There were three on one side and two on the other (counting the leader of the V). We yelled excitedly and ran for the door to run up to the roof, calling to my father to follow us. The roof was three more flights up. When we got out, it was harder to see them but they had picked up an extra one and were heading back down the length of Manhattan until we could no longer see them. Up on the roof, there was more light shining up from the street lights, and the colors of the UFO's blended into the dark sky. I went up on the roof days after that to see whether we'd catch them again, and we didn't see those again. I think I may have tried to report it to the newspaper and they did not want to take the story. Everything happened so fast and it was before digital cameras, cell phones, etc., where we could have recorded it. My husband and I were not on drugs nor drinking, as it is strictly against the rules of where we were working. We both felt happy that we had seen them together. We were thrilled."],"Tags":"City","Viewing Distance":"101-500 Feet","Case Number":"37582","map":"<A HREF = \"http://maps.google.com/maps?q=40.839174,+-73.943465(37582)&iwloc=A&hl=en\"> mufon case (37582) map </A>","Weather Factors":"Unknown","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around April 15th 1972"],"Object Features":"Other","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Disc, Triangle","Date Submitted":"04/18/2012 09:55 UTC","Latitude":"40.839174","Country":"United States","Disposition":"Unresolved","Longitude":"-73.943465"}