{"Date of the Event":"06/25/2011 01:32 UTC","trends":["There have been 5 other sightings in Gloucester","There were no other sightings in Gloucester on or around June 25th 2011","This sighting has been favorited 1 time.",""],"Source":"MUFON","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Gloucester","Case Number":"37594","divs":["Sighting Details1) What is the make and model of the camera used to take the photos? The camera I used to take the photos was a Sony Cyber-shot with a 12x optical zoom model number: DSC-H2 Digital Still Camera. 2) What was the camera setting used? The setting was the Auto Adjustment setting. 3) Did you actually see the object or was it just noticed in the photos? I saw the object myself prior to taking the photos. The object was closer and larger before I went inside to grab my camera. The shape had not changed when I returned, however the object had moved slightly and was farther away. I saw the object through my viewfinder and after I downloaded the pictures onto my computer as well. The photos represent the same shape and color of the object I saw with my own eyes. 4) Where was the exact location on the coast where you took the photos? The exact location where the photos were taken is High Rock Terrace in Gloucester, Massachusetts. It is right on the water on Long Beach in Gloucester. 5) Were there other people and activities going on in the area at this time? The photo was taken in the summer so there were people on the beach at the time. The beach was not particularly crowded and I was taking the photos on my deck away from the people on the beach. My deck is approximately 4 to 5 stories higher than the ground level of the beach. The object itself was not located over the beach but rather over my home which is on a small peninsula. 6) In what direction did you see the object? I saw the object approach from the right side of my home, the west side, although I did not see it's origin. I saw it as it was approaching my location. It definitely had directionality and control. 7) In what direction was the object travelling? It hovered over my location for a period of time and then headed on an easterly path towards the open ocean. As the object made its way from west to east it appeared to get farther away from the ground, as if it was ascending into the sky. 8) What is the estimated speed of the object? It was slow moving, slower than a small plane, but faster than a balloon or kite floating. It was within my field of vision for approximately 30 minutes. It was very smooth in its trajectory with no wobbling at all. 9) How far above the horizon did the object appear t be? When I first spotted the object it was closer to the ground. It was about as high as a large bird might fly, definitely no higher than a mile off of the ground. As it headed east it continued to get higher on the horizon and smaller as if moving upwards rather than away from me. 10) What object, i.e...a penny, dime, quarter held at arms length would compare to the size of the object? Initially the object was about the size of my thumb nail if my arm was fully extended. As I mentioned the object appeared smaller as it moved away from me. It gradually got smaller and smaller until i could no longer see it. At the time the photos were taken the object had reached the size of the head of a Q-tip if extended at arms length. 11) Were you able to visually see this \"morphing? Yes, I saw the object both with the naked eye and through my viewfinder appear to bend in shape and then return back to its original hollow \"donut\" shape. The object, when close appeared to be more of a hollow hexagon or octagon with clear edges and a hollow interior. The shape, when close, was easier to observe and there were clear walls on each side of the hollow hexagonal or octagonal cylinder. 12) Did the object seem to reflect light? The object was matte black with no lights and no reflective surfaces. I also saw no windows. 13) Were there any other witnesses besides yourself? My mother, who was on the deck at the time, was also there to witness the object. 14) What were you doing at the time of the sighting? I had gone onto the deck to check on my father who was taking a nap when I saw the object hovering off on the west side. I watched it for a while before going inside to grab my camera. 15) How did you first notice the object? I caught it in my field of vision off the side of my home. I didn't draw attention to it, but i did call for my mother to come and witness it. 16) When and how did you lose sight of the object? I watched the object for as long as possible. I was taking pictures as it was slowly ascending into the sky, eventually (not suddenly though) the object became too far away for me to see. 17) Did you notice anything else in the sky like aircraft, birds etc...at the time? No, although there was some cloud cover."],"Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.625769,+-70.619559(37594)&iwloc=A&hl=en\"> mufon case (37594) map </A>","Weather Factors":"Unknown","Summary":"Matte Black Six to Eight Sided Donut Shaped UFO Spotted In Gloucester MA In June 2011","Region":"Massachusetts","Object Features":"Other","Date Submitted":"04/19/2012 12:23 UTC","files":["/var/www/straped/mufon/html2text/37594.html.txt","/var/www/straped/mufon/more/37594_submitter_file1__DSC05778.JPG","/var/www/straped/mufon/more/37594_submitter_file2__DSC05779.JPG","/var/www/straped/mufon/more/37594_submitter_file3__DSC05780.JPG","/var/www/straped/mufon/org/37594.html"],"Log Number":"US-04192012-0007","Longitude":"-70.619559","Latitude":"42.625769","Object Flight Path":"Hovering then path,Straight-line path","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Tags":"City"}