{"trends":["There have been 7 other sightings in Aberdeen","There were no other sightings in Aberdeen on or around July 1st 1998"],"Tags":"City","files":["/var/www/straped/mufon/html2text/37598.html.txt","/var/www/straped/mufon/org/37598.html"],"Latitude":"39.511426","Weather Factors":"Unknown","Region":"Maryland","Longitude":"-76.16205","City":"Aberdeen","Summary":"Small craft came to my bedroom window then took off.","Object Flight Path":"Path with directional change","Date of the Event":"07/01/1998 12:00 UTC","Date Submitted":"04/19/2012 07:37 UTC","Object Features":"Patterned Surface","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.511426,+-76.16205(37598)&iwloc=A&hl=en\"> mufon case (37598) map </A>","Sighting Duration":"00:00:30","Source":"MUFON","Log Number":"US-04192012-0010","Case Number":"37598","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsI was young 7 or 8 years old, i was supposed to be asleep but i had crept into my older brothers room, and he was looking out his bedroom window, (towards the Aberdeen Proving Ground). We both had a feeling like we had to look out the window, because there was something we had to see. The object resembled a small pyramid, with four lights on the bottom at each of the corners. It was red in color with strange designs wrapping around it. The object was around four ft tall and four feet ft in width and length. It was spinning the way a top would spin. The craft fell from the sky so fast it seemed to appear, nearly 20 ft away from the window. I guess you could say the craft \"flew\" to the window perhaps 2 or 3 ft away from my brother and myself, then took off almost like a U turn. We both jumped away from the window terrified and have rarely spoken of the incident since. A friend i have spoken to about this told me of the MUFON website and said that i should report the incident, even though it happened more then ten years ago."],"Country":"United States"}