{"Object Features":"Undisclosed","Longitude":"-88.230726","Source":"MUFON","Weather Factors":"Unknown","Latitude":"42.223611","Summary":"I heard what I thought was fluttering or crackling in the tree behind me. Turned around to see orb take off from tree.","files":["/var/www/straped/mufon/html2text/37597.html.txt","/var/www/straped/mufon/org/37597.html"],"Country":"United States","Tags":"City","Viewing Distance":"20 Feet or Less","Date of the Event":"08/15/2007 07:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.223611,+-88.230726(37597)&iwloc=A&hl=en\"> mufon case (37597) map </A>","Region":"Illinois","divs":["sighting detailsi was standing in my driveway talking to a friend who was sitting in her car with the door open. it was approximately 7;00 pm, it had been raining somewhat ( but not at the time of this event ) and there were thunderstorms in the area. i heard, from behind me, what i thought was a bird fluttering in the tree that kind of sounded like electrical crackling also. the tree was about 15 ft behind where i was standing. i turned around to look at what was causing the noise. as i turned a white ball came out of the tree and traveled away from us at a very great rate speed across the street over the house across the street and disappeared from sight. there was a definite curvature to its flight path as it flew away as it looked to avoid the trees across the street. the person who i was talking to also witnessed this event. i have never seen anything like it before or since. the entire event lasted no more than 15 seconds. i got a little excited and asked my friend if she had seen it and she said that she had and we wondered what the heck it was. at the time i wrote it off to ball lightning as i had heard it can occur when thunderstorms are around but was watching your today ( 4\\19\\12 ) show about orbs and it reminded me of this event."],"Date Submitted":"04/19/2012 04:47 UTC","Case Number":"37597","City":"Cary","Log Number":"US-04192012-0009","Disposition":"Unresolved","trends":["There have been 7 other sightings in Cary","There were no other sightings in Cary on or around August 15th 2007"],"Object Flight Path":"Path with directional change","Object Shape":"Sphere"}