{"Object Features":"None","City":"Clinton","Object Shape":"Sphere, Star-like","Summary":"very bright object (fosforesent) hovered under cloud for a split second then shot straight up.","Longitude":"-80.378684","Date Submitted":"04/19/2012 09:49 UTC","Latitude":"40.557995","Tags":"City","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.557995,+-80.378684(37590)&iwloc=A&hl=en\"> mufon case (37590) map </A>","trends":["There has been one other sighting in Clinton","There were no other sightings in Clinton on or around April 15th 2012"],"Log Number":"US-04192012-0003","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37590.html.txt","/var/www/straped/mufon/org/37590.html"],"divs":["Sighting DetailsI had walked outside to let my dog do his business. As any other night I looked up at the night sky and something caught my eye that was extremely bright and it was stationary almost directly above me right under a layer of clouds. The object was mostly white giving off even brighter reds, blues and greens on the fringes of the glowing white light the object was giving off all these colors where extremely crisp and very bright. I am not sure what the altitude of the cloud deck was but it lower rather than higher and the object was between a dime and an aspirin in size. I only had the privilege of seeing this object for a few seconds then it shot straight up so fast that I was amazed. I pondered what I thought I saw and what it could have been and I couldn't come up with anything that I see out at my house on a regular basis. I do live about 5 miles from the Pittsburgh International Airport and see planes all the time and what I saw was NOTHING like what I see out here on a regular basis. I did call the sighting in just in case there where any other people seeing anything as well and have heard nothing about it. I wish i would have had more time to look at what ever it was that I saw. It was very exciting for me and I find myself looking up more now than I ever did."],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/15/2012 09:45 UTC","Disposition":"Unresolved","Country":"United States","Case Number":"37590","Sighting Duration":"00:00:05","Region":"Pennsylvania","Source":"MUFON"}