{"Latitude":"35.152027","Longitude":"-86.570551","map":"<A HREF = \"http://maps.google.com/maps?q=35.152027,+-86.570551(37602)&iwloc=A&hl=en\"> mufon case (37602) map </A>","Case Number":"37602","Sighting Duration":"Undisclosed","Object Features":"Unknown","divs":["Sighting DetailsI was on my way to work headed south on hwy 231 and was on an open stretch just north of Fayetteville, TN on hwy 231. The object was just suddenly above some houses east of hwy 231 and moved over the power lines next to the highway and then hovered spotlighted me. I looked around an saw I was the only one on the road at the time in either direction as I got closer it turned the spotlight off and just hovered there. I just kept driving and it didn't move I drove under it and I wa about 30 feet long with a cigar like shape. After I passed it I slowed down some and when I hit my brakes it flashed a smaller white light at me a few times. So I tried to ignore this and went to work where I filed this report. I had also seen this object a few days before on the same road at about the same time except it was spotlighting a semi truck yard just south of Petersburg, TN but it was at a distance and gone before I got to it so I figured it may have been a helicopter even though we rarely see them since we are so rural. I wasn't coolheaded enough to think to take a pic or video with my phone but since it seems to be visiting the area I may see it again and I will take video next time. I just don't know how to explain what this was it was maybe five to ten feet above the power lines and not moving in any direction at all, it made no sound and was about thirty feet in length with a solid green light on each end of the cigar shape and a red flashing light that was randomly flashing at about the center of the craft I have no idea where the spotlight came from but the small white light the flashed was next to the red light."],"Date Submitted":"04/20/2012 12:40 UTC","Region":"Tennessee","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Log Number":"US-04202012-0001","Object Shape":"Cylinder","trends":["There have been no other sightings in Fayetteville","This sighting has never been favorited."],"Disposition":"Unresolved","Object Flight Path":"Path then hovering","Summary":"Was on my way to work and got spotlighted!","files":["/var/www/straped/mufon/html2text/37602.html.txt","/var/www/straped/mufon/org/37602.html"],"Date of the Event":"04/19/2012 08:57 UTC","City":"Fayetteville","Country":"United States","Viewing Distance":"21-100 Feet"}