{"files":["/var/www/straped/mufon/html2text/37608.html.txt","/var/www/straped/mufon/org/37608.html"],"Object Shape":"Circle, Sphere","Log Number":"US-04202012-0007","trends":["There have been 12 other sightings in Westlake","There was one other sighting in Westlake on or around April 16th 2012"],"Date of the Event":"04/16/2012 09:00 UTC","Source":"MUFON","Latitude":"30.273012","Tags":"City","Viewing Distance":"Over One Mile","Object Features":"Unknown","divs":["sighting detailstime: 9:00 pm date: 4-16-2012 location: weslake, louisiana (west side) conditions: night time with very thick and low rain clouds. note: all photo and video times are shown 1 hour earilier. (did not reset for daylight savings time). stepped out on the front porch to catch some fresh air and noticed a large white bright light directly west\\slightly south west. first thought was, \"wow, venus is really hugh looking tonight\"! object looked at least 20 times larger than venus, then noticed it was slowly moving south. then realized it was pretty low because it was below the low cloud deck. second thought, \"it's a large aircraft with landing lights on?\". due to the slow speed moving across the sky to my left, it just looked too slow to be a jet. watched the object for a minute or so, until my view was blocked by a tree a hundred yards down the street. at this time, i went inside and retrieved my binoculars and video camera. when i returned, the object was in a space between two trees. i looked at the object with binoculars and saw the most beautiful object that i have ever seen in my life! the object appeared to be about a mile away and was huge. it was at least twice the size of two 747's, and possibly 10 times larger! the best i can describe it in real time is that it looked like a giant atom. at least, what a picture of an atom looks like. it had a hugh bright white light center that looked like a ball of energy. around the middle, moved rapidly moving red lights that gave the object a saucer appearance. however, no structure could be seen between the \"nucleus and the outer band\" of red lights. even more to the atom appearance, were more random lights flying around the nucleus at 30 degree angles to the more prominate center band of red lights. then, between the \"nucleus and electrons\" was a bluest electrical \"field\". not sure what a \"force field\" would look like, but guess would have looked like one. started videotaping with my sony camcorder just before the object went behind a second tree. at this time, i jumped in my truck and headed west toward the object. never saw the object again, but proceeded to the area where it was last viewed and found myself at the entergy power plant on houston river road west of westlake. will send freeze frame photos of the object taken with my phone on a tv screen until i can transfer the video to the internet. the video is much better. the red outer lights moving around the center are hard to see in the photos."],"Case Number":"37608","Sighting Duration":"Undisclosed","Country":"United States","Region":"Louisiana","Object Flight Path":"Straight-line path","City":"Westlake","map":"<A HREF = \"http://maps.google.com/maps?q=30.273012,+-93.262992(37608)&iwloc=A&hl=en\"> mufon case (37608) map </A>","Disposition":"Unresolved","Summary":"Looked like a giant \"ATOM\" with bright white glowing nucleus and obiting red lights with a blue electron field surrounding atom.","Weather Factors":"Unknown","Longitude":"-93.262992","Date Submitted":"04/20/2012 11:38 UTC"}