{"Object Flight Path":"Straight-line path","City":"Van Alstyne","Weather Factors":"Unknown","Object Features":"Unknown","trends":["There has been one other sighting in Van Alstyne","There were no other sightings in Van Alstyne on or around April 19th 2012"],"Log Number":"US-04202012-0003","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/37604.html.txt","/var/www/straped/mufon/org/37604.html"],"Object Shape":"Triangle","Summary":"Lage Triangle caft with very odd light configuration and a large ruby colored light center mass","map":"<A HREF = \"http://maps.google.com/maps?q=33.444266,+-96.59424(37604)&iwloc=A&hl=en\"> mufon case (37604) map </A>","Tags":"City","divs":["Sighting DetailsI had just moved my pickup to the north side of my drive to allow room for my son to park when he arrived. I have a pair of 10 x 50 Binoculars I keep in the truck , and had had them out earlier in the day. When I moved the truck I placed the caps back on them (binoculars) and put them back into their case , and laid them in the passenger seat. Once the truck was parked I exited the truck walking behind it to avoid a muddy spot located at the front of the truck. After coming around the rear of the truck I was facing east , and noticed two very bright lights. At first glace I thought they were stars but quickly noticed they were moving from southeast to northwest. It proceeded to go behind some low clouds and I lost sight of it. I grabbed the 10x50 binoculars I had just put away and when the craft exited the clouds again I was able to get a good look at it. It had a strange light configuration with three unevenly placed lights on the leading end and two small dim lights located at what I believe was the tip of the wing ( or the two rear points of the triangle shape) no tail light was visable at anytime. Located near center mass was a large ruby colered light that did not flash or blink at anytime. I was able to get a freind to come out and see the object before it slipped behind the cloud bank and was out of sight. Their was absolutely no noise coming from the craft. My freind is former military , and estimated it to be not more than 20,000 feet up. Also their was a small prop driven plane passing to the northeast at the time of the sighting. I could hear its engines , but they werent that loud due to the distance it was from my location."],"Latitude":"33.444266","Country":"United States","Source":"MUFON","Longitude":"-96.59424","Date Submitted":"04/20/2012 02:07 UTC","Region":"Texas","Disposition":"Unresolved","Case Number":"37604","Date of the Event":"04/19/2012 11:05 UTC","Viewing Distance":"Over One Mile"}