{"Tags":"City","divs":["sighting detailsat approximately 9:15 pm thursday april 19,2012 my roommate and i saw strange light patterns in the west\\southwest sky. we live in a small town in yavapai county,az near prescott,az we were sitting in the back yard with the dogs,i looked over towards the neighbors to our west.i saw a bright light in the sky just behind their place towards 89 highway.at first i thought it was lights maybe from a car or a house but it was too high up in the sky also there are no towers are anything that direction. it looked like a solid light bar rectangular in shape it flashed on for about 5 seconds then went dark.i asked my friend did you see that?he said no.i pointed towards the sky where i saw the light then all of a sudden we both saw two sets of lights but they were a few hundred feet to the left of the first sighting and a few hundred feet higher.these lights were like two huge four bulb vanity lights side by side with a dark space between them.eight lights total in this pattern.these lit up for about 10 seconds and the where gone.there were no aircraft in the area that i know of and we did not hear any noises.this was my first sighting,i always thought ufos were a hoax.this was real!"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.41894,+-112.585422(37609)&iwloc=A&hl=en\"> mufon case (37609) map </A>","Date of the Event":"04/19/2012 09:15 UTC","Object Shape":"Circle, Square, Rectagular","files":["/var/www/straped/mufon/html2text/37609.html.txt","/var/www/straped/mufon/org/37609.html"],"Log Number":"US-04202012-0008","Source":"MUFON","Case Number":"37609","City":"Wilhoit","Summary":"We took the dogs outside last night around 9:15PM when we saw strange lights appear over the tree to the west..","Disposition":"Unresolved","Object Features":"Unknown","Country":"United States","Latitude":"34.41894","Object Flight Path":"Path then hovering","Longitude":"-112.585422","Region":"Arizona","Sighting Duration":"00:00:20","Viewing Distance":"Unknown","trends":["There has been one other sighting in Wilhoit","There were no other sightings in Wilhoit on or around April 19th 2012"],"Weather Factors":"Unknown","Date Submitted":"04/20/2012 04:10 UTC"}