{"Date Submitted":"04/20/2012 07:59 UTC","Country":"United States","Object Flight Path":"Stationary","trends":["There has been one other sighting in Boylston","There were no other sightings in Boylston on or around December 24th 2011"],"City":"Boylston","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.324884,+-71.751792(37614)&iwloc=A&hl=en\"> mufon case (37614) map </A>","Viewing Distance":"20 Feet or Less","Latitude":"42.324884","Object Features":"Dome","Summary":"inside, dome with panels of blinking lights all around them.","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Blimp","Longitude":"-71.751792","Date of the Event":"12/24/2011 12:00 UTC","Region":"Massachusetts","divs":["Sighting DetailsI woke to two entities grabbing me by my arms. one on the left to which i was fighting with and telling it to go away. i tried to focus on its face but was a blur except that it had a large bald head and was very tall with long thin legs and arms and it was grey.i was in my room and then on a table in a domed place and the other entity was towards a table with its back towards me. it was tall big bald head long grey thin arms and legs. it came towards me with something in its hands and it made me inhale it even though i tried to hold my breath i could not. they held me by my arms and i was walking inside a dome place and on the walls were panels of blinking lights and many beings walking left and right like a corridor. as i got close enough to pass them one turned and looked at me. it looked human but something about the eyes told me it was not and i woke up in my room with panic and fear. took me a while to realize i was home and i could not fall back to sleep. this is the second abduction i have reported to mufon. if i have had others... i can not remember. one thing im sure about i was not dreaming i was im my room and they have some control over me but im still aware. the scary thing is that they can come when they want to and what they are doing to me i wish i knew but its against my will. they do exist"],"files":["/var/www/straped/mufon/html2text/37614.html.txt","/var/www/straped/mufon/org/37614.html"],"Tags":"City","Case Number":"37614","Log Number":"US-04202012-0013"}