{"files":["/var/www/straped/mufon/html2text/37618.html.txt","/var/www/straped/mufon/org/37618.html"],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.27748,+-107.877487(37618)&iwloc=A&hl=en\"> mufon case (37618) map </A>","Latitude":"37.27748","Longitude":"-107.877487","Region":"Colorado","Tags":"City","Case Number":"37618","Summary":"Large sequention red pulsing sphere then 8-10 pulsating crafts hover around red craft","Source":"MUFON","Country":"United States","trends":["There have been 8 other sightings in Durango","There were 3 other sightings in Durango on or around April 19th 2012"],"Sighting Duration":"00:15:00","Object Shape":"Flash, Sphere, Star-like","City":"Durango","Date Submitted":"04/20/2012 08:59 UTC","Log Number":"US-04202012-0017","Object Flight Path":"Path with directional change","Date of the Event":"04/19/2012 11:12 UTC","divs":["Sighting DetailsThis sighting occurred between 11:00 and 11:30 above Durango Colorado's valley. I was watch tv when I saw the large red flashing craft come over the west mountains from west to east, then after coming over the valley the craft looked lower than I initially thought, it changed course to south east and seemed to be dropping in altitude. It went out of sight after it seemed to be slowing down. The truly humbling event occurred just after the flashing red thing went out of view and I looked up at several (8-10) twinkling lights that slowly got brighter from nothing at all in a straight line across the sky from west to east. Once these objects got brighter I noticed that they were actually moving and not stationary. They began to converge in a un-orderly and random fashion directly over where I saw the red craft flying. for about two minutes these twinkling crafts floated around to my south view occasionally shooting in one direction and then turning around, some were just stationary. After that, they all started heading north in the same line that they came into existence in. While watching them slowly move north one of which went directly over my house completely silent!!! I noticed they were all traveling in an erratic fashion not in a straight line. Slowly they all disappeared over the north mountains. I would like to mention that I am an aviation enthusiast and student pilot and know for a fact that this was nothing explainable by human technology. The way it all occurred, with the large pulsing red light changing courses and floating down south, and then the orderly appearance of these twinkling lights followed by erratic random movement and then orderly movement north, it seemed as if this was an operation or something that served a purpose, it was just a feeling I got while watching it.... Still in somewhat of a state of shock."],"Weather Factors":"Unknown","Object Features":"Dome"}