{"files":["/var/www/straped/mufon/html2text/37622.html.txt","/var/www/straped/mufon/more/37622_submitter_file1__RoundSphereUFO.jpg","/var/www/straped/mufon/org/37622.html"],"trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around April 20th 2012","This sighting has never been favorited.",""],"Latitude":"40.763079","City":"Salt Lake City","Object Features":"None","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI went outside to observe the sky after dark. I had 10x50 binoculars with me mounted on a tripod. I had a feeling to hurry and go look at the sky. It was 9:04 pm. At 9:11 pm I spotted a round sphere slowing moving above down town Salt Lake City area. I watched it for about two or three minutes. It was whitest in color with an amber tint. I could hear no sound. It had no FFA marking lights at all. Nothing blinked on the object. It came from the west and moved straight across the valley at about three and half to four thousand feet in altitude. Just high enough to clear the mountain ranges on the east side of the valley. My neighbors also saw it too. I remained outside watching. At 9:29 pm another object coming from the west. It was approaching and was moving faster than the first one earlier. It was also up much higher in altitude. I would say it was at about eight thousand feet(AGL). It went straight over me. It took about two minutes to cross over head and go out of sight over the mountain range to the east of the valley. It was also whitest in color with an amber tint to it. It was silent, round and just as the first object. The color was constant and nothing blinking on it. No FFA marking lights. I observed this object with 10x50 Bushnell binoculars. It was fast and had a smooth glide effect."],"Summary":"Two round amber spheres came over the Salt lake Valley (9:11 pm and 9:29 pm)","Case Number":"37622","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Disposition":"Unresolved","Country":"United States","Tags":"City","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.763079,+-111.889407(37622)&iwloc=A&hl=en\"> mufon case (37622) map </A>","Date Submitted":"04/21/2012 12:51 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-111.889407","Region":"Utah","Log Number":"US-04212012-0001","Date of the Event":"04/20/2012 09:11 UTC"}