{"divs":["sighting detailsme and my family were outside having a campfire looking at the sky when i noticed a very bright object above the horizon. imediatly i saw it was moving up and down and side to side.i pointed it out to my wife and son who were not very interested but said neat to make me feel better. i pulled out our binoculars and saw that it was not a star and had flashing lights of red blue green white and yellow. i could see that it was an object\\ not a star, and was reflecting light from the setting sun ( it was west south west) and even with the light reflecting from it the lights on it were very crisp and bright flashing all colors in about one second intervals.i had seen a similar object back in the 90's that instantly took off, made a perfect 90 degree turn and stop dead on the other side of the sky, sat motionless for about 5 min before streaking across the sky and disappear from view. this object i observed for well over an hour before it just now dipped below the horizon \\ trees, i do mean just now, i am typing this as i am watching it. the whole time it flashed its lights and)o (danced) in the sky. i tried to take photos but the camera on this phone only picked up blackness of the sky."],"Weather Factors":"Unknown","City":"Pittsburgh","Object Features":"Unknown","Latitude":"40.444605","Date Submitted":"04/20/2012 10:57 UTC","Case Number":"37621","Summary":"saw what i thought was a satellite but quickly knew otherwise","Log Number":"US-04202012-0020","Disposition":"Unresolved","Longitude":"-79.987616","Date of the Event":"04/20/2012 10:00 UTC","Region":"Pennsylvania","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/37621.html.txt","/var/www/straped/mufon/org/37621.html"],"Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Oval, Star-like","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around April 20th 2012"],"Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.444605,+-79.987616(37621)&iwloc=A&hl=en\"> mufon case (37621) map </A>"}