{"Country":"United States","Disposition":"Unresolved","Region":"Utah","Object Shape":"Disc, Egg","Source":"MUFON","divs":["Sighting DetailsIt was about 10:45pm and I was with a good friend walking down my drive way toward my parents. This was in Lehi, Utah. We were talking and I just happened to look up and I saw a dull orange object appear in the sky nearly directly over my head, what seemed to be a few hundred feet above me. It slowly flew in a straight line in a westward direction over and across the freeway toward the hills. It was visible long enough for me to acknowledge that it was an odd sight, say something to my friend, and have her look up and see it just before it seemed to vanish in direct line of sight as if it cloaked itself. I thought for only a moment that it might have been a slow moving shooting star, but after thinking about it for a few moments, I came to the conclusion that it couldn't have been one. It had no tail or streak to it. There were no flashing or blinking lights. It simply appeared and slowly flew across the sky right over our heads. I was excited to see it because i've never seen anything like it before. I've seen plenty of shooting stars and it was nothing like the ones i've ever seen. There were obvious airplanes in the distance which fly in and out of salt lake airport all the time. they were even in the background as this orange object flew overhead seemingly much closer then the planes but making no sound whatsoever. I seemed to see depth in the object, but I can't seem to place the exact shape. It was... a sideways oval shape with indents in the front and back. honestly, it looked as if i was watching a video of someone superimposing a smaller object in the sky trying to make it look larger than it really was for some special effect gag... but this was real life."],"trends":["There have been 3 other sightings in Lehi","There were no other sightings in Lehi on or around April 20th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.398547,+-111.847896(37623)&iwloc=A&hl=en\"> mufon case (37623) map </A>","Object Features":"None","Tags":"City","Latitude":"40.398547","Date of the Event":"04/20/2012 10:30 UTC","Sighting Duration":"00:00:05","Longitude":"-111.847896","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Log Number":"US-04212012-0002","Summary":"It was dull orange, solid, no streak or tail, no blinking or flashing lights. appeared then vanished in direct line of sight, as if cloaking.","files":["/var/www/straped/mufon/html2text/37623.html.txt","/var/www/straped/mufon/org/37623.html"],"City":"Lehi","Date Submitted":"04/21/2012 06:08 UTC","Object Flight Path":"Straight-line path","Case Number":"37623"}