{"Date of the Event":"04/14/2012 11:30 UTC","Region":"Florida","Latitude":"27.531147","Object Flight Path":"Stationary","Date Submitted":"04/21/2012 09:30 UTC","Case Number":"37638","Weather Factors":"Unknown","Object Shape":"Sphere","Tags":"City","Disposition":"Unresolved","City":"Anna Maria","map":"<A HREF = \"http://maps.google.com/maps?q=27.531147,+-82.733433(37638)&iwloc=A&hl=en\"> mufon case (37638) map </A>","trends":["There have been no other sightings in Anna Maria","This sighting has never been favorited."],"Log Number":"US-04212012-0015","Country":"United States","Summary":"Large light/craft hovering over Eggmont Key for over four hours, projected beam four times!","Longitude":"-82.733433","Object Features":"None","files":["/var/www/straped/mufon/html2text/37638.html.txt","/var/www/straped/mufon/org/37638.html"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had just come home from dinner the other night,and we came home to our beach house. I walked to the back yard (beach facing eggmont key and the skyway bridge) and notticed a bright light above Eggmont key. I watched it for a while, and noticed a boat fishing near the island, the light house and the green light from the dock as normal. There is also a street light type light on the island too. It was very bright, just above the tree tops and just hovered. It kind of swayed slightly back and forth(left to right) I have seen weird things flying in the sky here at least four times, but this time was different. A beam of light came down, it was faint, bc it was over on Eggmont, but it was a clear beam over the island. It lit up the trees below as it moved. I hollered inside to my boyfriend to come see it, and to grab a camera. He couldn't hear me so I ran to the downstairs window where he was. by the time he came out, the beam was gone, but the light was still in the sky. So he stayed on the beach and I ran up to look for a camera and get my sister. She woke up and went down to the beach. I couldnt find my camera but i found my cell phone. We all watched it for a while and it hovered in the same position. I ran upstairs one more time to grab the telescope. When I came back down stairs, my sister and my boyfriend wre screaming and hollering that they had seen the beam while I was upstairs! I was so thrilled I wasn't alone in this, so someone would believe me! We saw the beam at least two more times after that. I tried to get pics and they wouldn't come up on my camera clear or bright. I took a video, you can see it faintly over the top left of the screen, over the street light. The flashing light to the right is the light house on eggmont key. I rested my hand on the table to get a steady aim. I eventually went inside around 4 because I was exhausted. My sister and boyfriend went in before me, i was kind of shocked about how casual they were about it. The light was still in the same position. When I woke up the next day, it was gone. That light wasn't there the night before or the night after. I'm here a lot and I've seen things fly over that were strange shaped that made no noise, etc, but this was the only time I've seen it for this long and shine a beam down... Crazy!!!"],"Source":"MUFON"}