{"Longitude":"-82.172898","Object Features":"Undisclosed","City":"Clarks Hill","Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=33.670965,+-82.172898(37634)&iwloc=A&hl=en\"> mufon case (37634) map </A>","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Clarks Hill","This sighting has never been favorited."],"Disposition":"Unresolved","Case Number":"37634","Log Number":"US-04212012-0011","Country":"United States","Sighting Duration":"Undisclosed","Summary":"I witnessed a black triangular shape flying over Clarks Hill Dam.","Date Submitted":"04/21/2012 05:04 UTC","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/09/2012 12:00 UTC","Latitude":"33.670965","divs":["Sighting DetailsOn April 9th 2012, my girlfriend and I witnessed an unidentified object flying in the sky. We were at the dam in Clarks Hill, SC at around 9:00 at night. We were standing in the parking lot of the Visitor's Center enjoying the view of the night sky when I noticed what appeared to be a small piece of the sky moving. After viewing this object for a few moments, my eyes adjusted and I could definitively make out a shape. I could see a large, black triangular craft with three or four dim lights on it. There was a light on each point of the craft, including white, blue, and an orangish red. In the center was another red light that appeared to pulsate slightly. The object came from the northwest over Strom Thurmond Lake and flew to the southeast. It was moving relatively slow with absolutely no sound. I know this because there was an airplane a few miles to the northwest that was at an altitude approximately 5 times greater than the object I was observing. I could hear and see that plane off in the distance, but could not hear the object that was less that 500 yards away. It was flying less than a mile off the ground, but managed to duck behind the trees on the horizon. I only saw this object for about 1 minute. Since then I have had this image in my mind clear as crystal. I even made a sketch of it soon after. It wasn't until a few days ago that I truly believed this was a UFO. I was watching a special on the History Channel about UFO sightings around the world, especially in Belgium. There were over 150 sightings of objects in the sky over the period of a couple weeks. Most of these people were interviewed and asked to make a sketch of what they saw. 90% of them looked EXACTLY like my sketch! People across the globe are reporting these black triangles in the sky, and I got to see one. Awesome..."],"Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/37634.html.txt","/var/www/straped/mufon/org/37634.html"],"Object Shape":"Triangle","Weather Factors":"Unknown"}