{"Region":"California","Tags":"City","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around March 31st 2012"],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Longitude":"-121.929361","Object Shape":"Cigar","Country":"United States","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsI was walking on the overpass atop the I-5, and, since the vantage point there is good, I habitaully scan the skies. I had to take a double-look at what I saw since at first, I could not make out what I was seeing. They appear to be like a medium size airplane or a big helicopter. I cold not make out the exact outline since they are very far. What striked me though is that they are very dark, like black. They are moving very fast. And then I realized these could not be the usual, ordinary ones that you see in the skies! The objects were in a formation of 1 following the other. Until the 1 behind started to move faster and it is curious because it seems that if the 2nd object continues at its speed it might hit the first 1! So I looked intently to see what will happen, if it will explode or what. And then the 2nd objec's bottom hit the top of the 1st and they went into a another dimension or a plasma was created. Momentarily they vanished except for the brilliance of the \"plasma\" and then, after several seconds, they reappeared again with the 2nd object now overtaking the 1st and taking the lead. I followed them with my sight until I could not see them any longer. The whole incident probably took not more than 4 minutes. To me it's like an \"encounter\" bec. this isthe first time that am seeing a seemingly interdimensional objects. So this event kind shocked me and I was telling it to others but reluctant bec. others are not open to such incidents..."],"Date Submitted":"04/21/2012 06:14 UTC","Summary":"2 black short cigarette shaped objects flying like in a formation until the 1 behind moved faster and touched on top of the other and in that moment, they went into what I describe as a plasma and momentarily disappeared until they again emerged.","Date of the Event":"03/31/2012 04:30 UTC","Case Number":"37637","City":"San Jose","files":["/var/www/straped/mufon/html2text/37637.html.txt","/var/www/straped/mufon/org/37637.html"],"Latitude":"37.325318","Sighting Duration":"00:03:30","Weather Factors":"Unknown","Log Number":"US-04212012-0014","map":"<A HREF = \"http://maps.google.com/maps?q=37.325318,+-121.929361(37637)&iwloc=A&hl=en\"> mufon case (37637) map </A>"}