{"City":"Milton","trends":["There have been 12 other sightings in Milton","There were no other sightings in Milton on or around April 20th 2012"],"Object Shape":"Square, Rectagular, Other","Date Submitted":"04/21/2012 01:50 UTC","Sighting Duration":"Undisclosed","Summary":"fishing on the bank, looked to my right and observed 3 red objects","divs":["Sighting Detailswe where at the river this evening fishing @ around 6:10 pm facing north watching the sun set I looked to my right north and spotted 3 object that were red, they were not a lighted red but shiney red like a christmas bulb, the sun was reflecting off of it as it rotated slowly. the size looked to be like a probe seen years ago in gulf breeze florida. it wasnt round though, odd shape more of square with odd sides, they were 300 feet off the ground moving north north west at a fairly fast clip. when I first spotted them I told my wife to look she was standing next to me, I could see them really clear and as I watched and tried to make out shape it seemed to be getting smaller and harder to see, it was moving away fast and was a pin prick in a minute or so, I was upset that I wasnt able to view this object but for a minute or so, it much have passed right over my head as I sat fishing, the sun reflected off the side and it was red, very pretty color, it was longer that wide, standing on it end, I could see it wasnt a perfect square some odd out of place upper portion. The red struck me as unusal as I told my wife it looked like a color on a christmas ornament, it was rotateing slowly all three moved away and stayed together, I dont know which direction the wind was blowing and it wasnt ballon. the direction it was going in from were I was standing it had to have gone right over us,let me know if anyone has seen anything like this, I grabbed my wifes cell phone and took a couple of picture on our cell phone straight talk, But by the time I got the camera and went thru what seemed like forever to get it ready to take a picture it was a small spot in the sky, the short clear time I seen it at first is all I have in my mind and its an odd looking objects. All 3 of them were of the same shape and size a probe?? like I said it was the size of that probe I seen in the gulf breeze sighting in 93 online?? anyway I thought I'd shoot this to ya. Dana Painterman"],"Case Number":"37632","Log Number":"US-04212012-0010","map":"<A HREF = \"http://maps.google.com/maps?q=30.588881,+-87.075873(37632)&iwloc=A&hl=en\"> mufon case (37632) map </A>","files":["/var/www/straped/mufon/html2text/37632.html.txt","/var/www/straped/mufon/org/37632.html"],"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Region":"Florida","Date of the Event":"04/20/2012 06:10 UTC","Longitude":"-87.075873","Object Flight Path":"Straight-line path","Latitude":"30.588881","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved"}