{"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","City":"Las Vegas","Date Submitted":"04/22/2012 03:46 UTC","Object Features":"Other","Country":"United States","Date of the Event":"04/21/2012 08:55 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","trends":["There have been 229 other sightings in Las Vegas","There were 2 other sightings in Las Vegas on or around April 21st 2012","This sighting has never been favorited.",""],"Source":"MUFON","Region":"Nevada","Summary":"2 orange orbs rose up- then changed direction and form to grey with red light","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=36.177622,+-115.025649(37649)&iwloc=A&hl=en\"> mufon case (37649) map </A>","Log Number":"US-04222012-0007","divs":["Sighting DetailsI was going to take a photo of the city 2. I got out of my car and it was directly in front of me at the base of Frenchman mountain 3. I thought it was a balloon, being lit from within- like a fire inside it. It kind of flickered as it rose upward. 4. It rose haflway up in front of the mountain, then a second one appeard and began to do the same- then the first one changed direction and headed south, shortly after it changed direction it changed color to a solid grey, - when this happened i scrambled to change the lens on my camera, (which took me about 5 seconds as i am an ametuer phtographer), when i looked back up- the 1st orb had disappeared, (or i could no longer track it with my eyes). The second one- was still orange and appeared to be following the same path, so i managed to take a single phtoto of it, shotrly thereafter it changed - It turned from a flickery fiery orange, to a solid dark grey (almost blending in with the night but i could still make out the silloute, it then also had a red light- that appeared to be orbiting around the bottom lower half, about 1 revolution per second. My wife and step daughter had witnessed it as well, - My wife has very good far distance sight and she said it was 3 red lights orbiting around the bottom half. It then headed south, then appeared to descend below my line of vision where some buildings in front of me were obstructing the view. I am a graphic artist by career, so i mocked up exactly what i saw - using the actual location from google earth as a background. I did not edit the photo in any way- other than cropping it. I saved it to highest jpeg setting as not to degrade the quality. It is exactly as it appears on the camera."],"Latitude":"36.177622","Object Shape":"Circle, Fireball, Sphere","Case Number":"37649","files":["/var/www/straped/mufon/html2text/37649.html.txt","/var/www/straped/mufon/more/37649_submitter_file1__ufo_trajectory_and_time_04-21-12.jpg","/var/www/straped/mufon/more/37649_submitter_file2__UFO_cropped.JPG","/var/www/straped/mufon/org/37649.html"],"Longitude":"-115.025649","Sighting Duration":"00:01:10"}