{"files":["/var/www/straped/mufon/html2text/37640.html.txt","/var/www/straped/mufon/org/37640.html"],"Object Shape":"Bullet, Missile","Tags":"City","Object Features":"Dome","divs":["Sighting DetailsA friend and I were out riding the country roads heading West on Black River Village Road when we saw a blue colored bell shaped object rising from what appeared to be hills on left side of road. Object rose for about 6-8 seconds, stopped for a another few seconds and bottom of object started to glow orange-red and then moved at a 45 degree angle from it's rise going towards the west. Object continued moving west for another 7-10 seconds and stopped completely again. At this point, the object started to change from the blue color to a solid glowing red in about 4 seconds and then object shot up straight into the night sky at what seemed like light speed. Object never made a sound and if we would have had cameras then, the object was so clear, that I am sure the pictures would have provided a very clear image of what we saw. On the following night, another group of friends that we had told about our sighting, drove out to the area in question and were supposedly chased by two white lights which they said turned out to be two, military like choppers. They said they were frightened by the chase until the choppers turned back after a few miles of being chased down Black River Village Road and Old Cavern Hwy."],"City":"Malaga","Log Number":"US-04212012-0017","map":"<A HREF = \"http://maps.google.com/maps?q=32.22461,+-104.071578(37640)&iwloc=A&hl=en\"> mufon case (37640) map </A>","Sighting Duration":"Undisclosed","Latitude":"32.22461","Source":"MUFON","trends":["There has been one other sighting in Malaga","There was one other sighting in Malaga on or around September 3rd 1993"],"Case Number":"37640","Weather Factors":"Unknown","Country":"United States","Region":"New Mexico","Summary":"Bell shaped UFO","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Date Submitted":"04/21/2012 11:51 UTC","Date of the Event":"09/03/1993 01:05 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Longitude":"-104.071578"}