{"Date Submitted":"04/22/2012 01:47 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Object Flight Path":"Path with directional change","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around April 21st 2012"],"Log Number":"US-04222012-0003","Source":"MUFON","Case Number":"37645","City":"Kansas City","Longitude":"-94.689788","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"Appears as bright orange balls appeared to follow each other","Tags":"City","Object Features":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsWitnessed bright orange ball flying over my house approx 2000 feet altitude traveling east south east. Hard to gauge size but pretty good size, at least as big as an airplane. I had my wife come outside to see and she noticed another one farther away that had already passed over. They traveled in an east south east direction before turning more to the south. They appeared to be following each other. I would guess they were about a mile or so apart. We heard no sound at all, and the orange light was strong and constant. There were no other colors visible. After they turned in a more southward direction they seemed to increase speed considerably and climbed out of sight within a minute. We live close to MCI here in Kansas City and have never seen anything like this in 17 years here. I was also an Air Traffic Controller in the military so am familiar seeing all kinds of aircraft and this was nothing like anything I have ever seen. Clear night, no sound, no blinking lights, just looked like bright steady glowing orange balls that made controlled manuvers, then climbed and accelerated out of sight. Perhaps 2 minutes total viewing time."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.25492,+-94.689788(37645)&iwloc=A&hl=en\"> mufon case (37645) map </A>","Latitude":"39.25492","Region":"Missouri","Country":"United States","Date of the Event":"04/21/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/37645.html.txt","/var/www/straped/mufon/org/37645.html"]}