{"Latitude":"38.201391","Log Number":"US-04222012-0004","Object Features":"Patterned Surface, Unknown","City":"Haubstadt","Region":"Indiana","Longitude":"-87.575009","Object Flight Path":"Straight-line path,Path then hovering,Other","Source":"MUFON","Case Number":"37646","Date Submitted":"04/22/2012 02:04 UTC","Sighting Duration":"00:05:00","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Haubstadt","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.201391,+-87.575009(37646)&iwloc=A&hl=en\"> mufon case (37646) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Unknown","Date of the Event":"04/21/2012 08:10 UTC","Summary":"Four large, glowing, red objects moved across the sky. 3 moved quickly, 1 slowed down, before they all dissapeared.","divs":["Sighting DetailsWhile making dinner, my husband came in from cooking some steaks on the grill. He said to come outside right now! When I went out I saw four red objects floating across the sky very close to Venus. They all looked exactly alike, except that the last one was bigger than the others. I watched for several seconds before I ran inside to get our digital camera. It was close, so it could not have been more than 30 seconds before I began filming. By the time I came back out with the camera, one of the objects was already gone. While I watched, another of the objects moved quickly out of my sight, blocked by a tree. I filmed the last two objects. One of the objects disappeared very fast after I started filming, the last object slowed down. I got a good look at it. It looked like it was on fire, almost like a giant flare, or maybe a Chinese lantern. It looked like it was glowing from the inside. But, it was very big, very far away, it did not fall, and it did not move at the same speed as the others. They all moved horizontally across the sky, almost floating, except they changed speed. All these thoughts went through my head as I watched. The last object moved much slower than the other three, almost stopping, and it pulsated much brighter than the rest. At it's brightest, it was almost as bright as Venus (which is really bright at this time). It passed Venus, moving north to south, and grew dimmer and dimmer until it disappeared altogether. After they had all disappeared, I called a friend and finished making dinner. About ten minutes after the first sighting was over, I went back outside and saw another of the objects moving across the same path as the last four. I ran inside, again, to get the camera, but it was gone by the time I got back (less than 20 seconds). It just disappeared. I have lived near airports and military bases for most of my life. I have seen some very strange things in the sky, all with perfectly plausible explanations, but I have no idea what I saw tonight. It was a very nice day, and we had been outside all day and night. We saw nothing else strange in the sky, only the regular plane traffic. Several planes were even in the sky at the same time as the objects. I don't know what they were."],"Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/37646.html.txt","/var/www/straped/mufon/org/37646.html"]}