{"Date of the Event":"04/22/2012 12:00 UTC","Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Circle","Longitude":"-68.419666","City":"Punta Cana","Summary":"two small white lights flying around the trees","Tags":"City","Date Submitted":"04/22/2012 03:07 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/37657.html.txt","/var/www/straped/mufon/org/37657.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=18.469086,+-68.419666(37657)&iwloc=A&hl=en\"> mufon case (37657) map </A>","Region":"La Altagracia","Country":"Dominican Republic","trends":["There have been no other sightings in Punta Cana","This sighting has never been favorited."],"Latitude":"18.469086","Source":"MUFON","Viewing Distance":"21-100 Feet","Log Number":"DO-04222012-0014","Case Number":"37657","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy husband and I were at friends home for dinner. We live in the Caribbean at Cap Cana a very quiet remote area on the beach surrounded by lots of trees and vegetation. The villa is completely open and we were talking out back which backs up to the woods. I was facing the woods and saw a very bright small white light flying around below the tree line. Zipping around very fast, I saw one, our friend looked when i pointed and he also saw a second one but I didn't. They flew around quickly for about a minute and disappeared into the woods. No, I was not drunk, one glass of wine. The bright light against the pitch dark night made me notice it. When i first saw the object, I had no idea what it could be...it was too big to be a firefly and moving differently, very quickly and abruptly changing directions. It was a small, maybe golf ball size bright white light, not flashing. I felt like it was a UFO immediately, since I am 56 years old and have never seen anything like it and it didn't fit into any other category. Lost sight of it by it simply zipping away into the woods."],"Disposition":"Unresolved"}