{"Log Number":"US-04222012-0021","Latitude":"34.224484","Object Shape":"Oval","Case Number":"37665","Region":"California","Sighting Duration":"Undisclosed","Date Submitted":"04/22/2012 06:44 UTC","Date of the Event":"11/19/1994 04:30 UTC","divs":["Sighting DetailsIt was the second or third night after the 1994 Northridge, Ca earthquake. Because of being afraid to sleep indoors, arrangements were made to sleep in two of the cars that were parked on our driveway. I was babysitting my four neices, and nephew, all under 11 years old. My wife, and cousin decided to sleep in the minivan next to the other car with the kids in it. We positioned our selves as placing our heads towards the rear door of the van, so the van windows were above our heads. We all fell asleep. For me I woke up feeling fear, and a sencse that something was trying to hurt the kids next to us. I looked out the van window, and saw three ufo's. The one in the middle was larger than the two on each side. At first they were hovering still, and lights were coming off the middle one first. On one side it was blue lights, in formation, and then the other side they where red. it was doing this for a few minutes, like communicating with the other ones. They were hovering like in small circle patterns, going forward and back. Then in a fast forward motion the one in the center launched forward from the center and straight down to the horizon of my sight, the other two were moving side ways in a straight line really fast, zig zagging sideways, then the ufo on the right went to the left, and the one to the left went to the right, this happened repeatdly a few times. At this point i was so surprised, at what i was seeing that I woke up my wife and whisperred to her to look out the window, and describe to me if she could see any thing, she too then saw the same thing i did. to make sure i wasnt seeing things, i asked her which way the objects were moving, and each time it was correlating with what i saw, i asked of the lights, and the same lights flashed. Then we woke up our cousin and asked him what and if he saw anything, as we all gained our composure, the ufos zig zagged up down side ways, it looked as if they were really close, and then pull off far away. One came really close to the roof line fo the house, then pulled back really fast. When the ufo in the middle beamed its red lights to the lefft ufo, that one would beam back red lights too, then this continued for a few seconds. This was really scary, i immediatley felt like they were going to try to abduct the small kids sleeping next to us in the cars, whats wierd is that i woke up feeling fear for the kids, and saw these ufo's. A few days later i was in the topanga hills, and i was in a grocery store, and saw there was an ad, in the bill board, asking if any one saw any ufo's. I never did call or go to the workshop. I was just wanting to know if any one else ever saw anything like this before."],"trends":["There have been 3 other sightings in North Hollywood","There were no other sightings in North Hollywood on or around November 19th 1994"],"Country":"United States","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.224484,+-118.381826(37665)&iwloc=A&hl=en\"> mufon case (37665) map </A>","City":"North Hollywood","Tags":"City","Disposition":"Unresolved","Longitude":"-118.381826","Weather Factors":"Unknown","Source":"MUFON","Summary":"(3) flying saucers, two smaller ones on each side of the larger one. Hovering, then bolting accross the sky returning back to where it started","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/37665.html.txt","/var/www/straped/mufon/org/37665.html"]}