{"files":["/var/www/straped/mufon/html2text/37662.html.txt","/var/www/straped/mufon/org/37662.html"],"Latitude":"39.618631","Date Submitted":"04/22/2012 05:11 UTC","Summary":"Helicopter type sounding machine chasing bright round light","Log Number":"US-04222012-0019","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.618631,+-105.01319(37662)&iwloc=A&hl=en\"> mufon case (37662) map </A>","Country":"United States","trends":["There have been 29 other sightings in Littleton","There were no other sightings in Littleton on or around April 21st 2012"],"Object Features":"Other","Object Shape":"Sphere, Star-like, Other","Disposition":"Unresolved","Date of the Event":"04/21/2012 12:00 UTC","Weather Factors":"Unknown","Longitude":"-105.01319","Case Number":"37662","Object Flight Path":"Hovering then path,Path with directional change","Region":"Colorado","Sighting Duration":"Undisclosed","City":"Littleton","divs":["Sighting DetailsWe thought a large military helicopter must have flown over our house around 8:pm heading west from us. Around 9:00 it came by again, only I took my son out to see the \"cool chopper\". When we stepped out to see it, we quickly realized this was not helicopter. It was very thin, I referred to as \"stick shaped\" and very LONG. VERY BIG AND LONG. It hovered briefly and then changed directions. Then I saw a bright round circle light in front of this big \"helicopter\" thing. It appeared to be chasing the circle. The helicopter \"thing\" was black, had no flashing lights as a plane or helicopter would have during night flight. There was a smaller and brief red light circle. I feel as if it changed quickly? Something changed but I can't explain what. It was hard for my mind to comprehend what I was seeing. My son started crying and ran in the house. This was not a silent object. One of the two things made a noise that shook house. Assumed helicopter....but this was no helicopter and did not see any propellers. Flew lower than aircraft would. I asked neighbors if they saw, and they only heard but did not go out to look. They also said it shook their homes. I am positive it was chasing a round bright light that when I first saw I thought was a star. But stars are not that low and moving! My son thought the \"helicopter\" was shaped like a key."],"Viewing Distance":"101-500 Feet, Unknown","Tags":"City"}