{"map":"<A HREF = \"http://maps.google.com/maps?q=53.553114,+-108.630144(37672)&iwloc=A&hl=en\"> mufon case (37672) map </A>","Object Shape":"Disc, Fireball, Sphere","Country":"Canada","Log Number":"CA-04222012-0028","City":"Sunset View Beach","Weather Factors":"Unknown","Object Features":"None","Tags":"City","Latitude":"53.553114","Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37672.html.txt","/var/www/straped/mufon/org/37672.html"],"Summary":"Hovering orb- flew geometric patterns, ascended rapidly on ballistic trajectory.","Disposition":"Unresolved","trends":["There have been no other sightings in Sunset View Beach","This sighting has never been favorited."],"Date Submitted":"04/22/2012 11:44 UTC","Date of the Event":"08/01/2011 09:45 UTC","Longitude":"-108.630144","Region":"Saskatchewan","divs":["Sighting DetailsI was flying a small remote control airplane with my dad just after sunset at my grandparents cottage- it became stuck in a tree, and in the process of removing it from the tree, I noticed a stationary floating orb hovering above their cottage. It appeared to be about 45 degrees above the horizon, and the size of a dime held at arms length, and glowing bright orange. The light appeared to be emanating from within the object. I hurried inside and gathered my grandparents, and my fathers girlfriend, a photographer, who failed to grasp to gravity of my request to \"bring a camera\". In the meantime, the object had begun slowing flying, drifting more like, geometric patterns. It was a very straight, strict and rigid flight pattern, apparently self propelled. It made no noise. It appeared to be flying low and close, though we could not determine its distance from us definitively, we were sure it couldn't have been farther than a couple of kilometres. After thirty seconds of uninterrupted observation, the object began shrinking (moving directly away from us), then took off on a trajectory like a well-struck golf ball, rapidly leaving the atmosphere, before disappearing with a flash of red light. My grandparents subsequently sighted similar objects a ear later, flying low over the lake, them flying west in formation."],"Case Number":"37672","Source":"MUFON"}