{"Weather Factors":"Unknown","Country":"United States","Longitude":"-97.39555","Tags":"City","Case Number":"37676","City":"Edmond","map":"<A HREF = \"http://maps.google.com/maps?q=35.759198,+-97.39555(37676)&iwloc=A&hl=en\"> mufon case (37676) map </A>","divs":["Sighting Detailsi was about 300 feet from my house at the barn. i heard a noise that sounded like a wind coming up, i looked up to see a v shape of white objects that at first i thought were flock of birds. they went very quickly from south to north and curved to the west, there was no sound other than a light wind sound, a swish. we have alot of geese and other birds that fly even at night but they always make bird noises and they dont move that fast. they were like white spots in the sky in the shape of a V, but 3-4 thick. geese fly in a V with 1 bird in front of the other , this was like 3-4 birds flying next to each other making a chevron shape, like seargent stripes, made me shiver when it went by. it was a very clear night with little wind and no noise. for the first few minutes i kept thinking what kind of bird could that have been , they made no noise other than a wind noise and they moved very quickly in a tight formation, and tuned to the west as they went overhead. we live north of tinker afb and i see lots of planes flying all the time. this was no plane and not a flock of birds. freaked me out!! never done this before but this was really weird thought you might want to know"],"Date of the Event":"04/23/2012 12:00 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Summary":"chevron shaped flock of birds, too fast for birds","Object Features":"None","Log Number":"US-04232012-0004","Object Shape":"Chevron","Date Submitted":"04/23/2012 01:55 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37676.html.txt","/var/www/straped/mufon/org/37676.html"],"Disposition":"Unresolved","Region":"Oklahoma","Latitude":"35.759198","trends":["There have been 16 other sightings in Edmond","There were no other sightings in Edmond on or around April 23rd 2012"]}