{"Object Flight Path":"Hovering then path","City":"North Richland Hills","Summary":"My daughter and I saw a bright object hovering over the area known as Smithfield Acres","trends":["There have been 5 other sightings in North Richland Hills","There were no other sightings in North Richland Hills on or around April 4th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"37685","Date of the Event":"04/04/2012 09:00 UTC","Disposition":"Unresolved","Country":"United States","divs":["Sighting DetailsMy daughter and I were driving west on Mid-Cities (picking ups late dinner) and approaching Davis Blvd when we saw a very bright yellow-white triangular pair of lights hovering over what we thought was approximately over Smithfield Road north of Main Street. The oject was low enough that we initially thought it might be tower lights - but there are no tower lights in that area. It is a residential area. We took a right (north) on Davis. We pulled onto Main Street (west)off Davis into a parking lot to get a better look. As I pulled into a parking lot on Main Street the object(s) moved instantly over us (north to south) to an area over Mid-Cities and Davis Blvd. We jumped back in my car, and drove across Main Street since a tree was now blocking our view. As I pulled over across the street from my original location, what I can only describe as a vortex opened and the triangular shaped lights with a darker shape behind the lights that seemed to match the color of the sky disappeared. There was a very brief but bright white flash just prior to the object disappearing. There were two planes in the area flying north to south at the time of the incident. The two planes were clearly planes - the object we saw was not."],"Region":"Texas","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"04/23/2012 12:36 UTC","Longitude":"-97.222051","files":["/var/www/straped/mufon/html2text/37685.html.txt","/var/www/straped/mufon/org/37685.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.854337,+-97.222051(37685)&iwloc=A&hl=en\"> mufon case (37685) map </A>","Log Number":"US-04232012-0012","Object Features":"None","Object Shape":"Triangle","Weather Factors":"Unknown","Latitude":"32.854337"}