{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.510599,+-0.123095(37680)&iwloc=A&hl=en\"> mufon case (37680) map </A>","Region":"England","divs":["sighting detailsi was nearing the end of a flight from calgary canada, to london gatwick airport. i had a windowseat facing to the left of the aircraft. we had just flown over england, and had just turned from flying east along the southern coast to heading north towards the airport. we were around 500ft+ above the ground, but it was close enough for me to observe cities, roads etc from a great height. i was minding my business just looking out the window and a metallic sphere caught my eye. it was completely spherical and was traveling at a great speed. it did not appear to make a sound, have any visible form of propulsion it was simply a metallic sphere flying at a great speed, however fast enough to be observed. the total time of the encounter lasted about 6 or 7 seconds. i'd been watching ufo hunters recently and i thought that it must be weird to see something in the sky and instantly know it wasn't normal or that it didn't make sound. i wouldn't say i'm a skeptic but i just found it all very interesting. then i stumble across this sphere. i can guarantee 100% that i was not mistaken for any kind of helicopter\\aircraft. there was no propulsion and it was moving silent very fast. it's interesting because msot ufos caught in daytime are triangles over california. so to see a sphere is very different, and unlike a triangle, there is no relation of a spherical craft to any current aircraft models. it is possible that the object was disc shaped but i was observing it directly from above (making it appear spherical) the craft moved at an incredible speed."],"Case Number":"37680","Viewing Distance":"Unknown","Longitude":"-0.123095","Disposition":"Unresolved","Source":"MUFON","City":"London","Country":"United Kingdom","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around April 22nd 2012"],"Object Shape":"Sphere","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/37680.html.txt","/var/www/straped/mufon/org/37680.html"],"Object Features":"None","Latitude":"51.510599","Log Number":"GB-04232012-0005","Date Submitted":"04/23/2012 06:37 UTC","Object Flight Path":"Straight-line path","Summary":"Metallic sphere observed flying extremely fast in broad daylight.","Date of the Event":"04/22/2012 12:00 UTC"}