{"Log Number":"US-04232012-0010","Sighting Duration":"Undisclosed","City":"New Braunfels","Tags":"City","Region":"Texas","Object Flight Path":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/37683.html.txt","/var/www/straped/mufon/org/37683.html"],"Disposition":"Unresolved","Country":"United States","trends":["There have been 12 other sightings in New Braunfels","There were no other sightings in New Braunfels on or around April 21st 2012"],"Date of the Event":"04/21/2012 10:30 UTC","Weather Factors":"Unknown","Summary":"Witnessed very bright multi-colored object in distance, in southwesterly direction approximately over San Antonio when viewing from New Braunfels.","Latitude":"29.72101","divs":["Sighting DetailsWitnessed very bright multi-colored object in distance, in southwesterly direction approximately over San Antonio when viewing from New Braunfels. My wife pointed it out to me, so I got my binoculars and watched for approximately 30 mins. Bright lights that simultaneously displayed what seemed like red, white and blue colors. Not flashing, not alternately in sequence, but glittery-like. Very vivid colors. Definitely not a star, but star-like. At one point it had seemed to dim for a short period, then brightened. It hovered then moved slightly in relation to a tree limb I was orienting by. Seemed to be moving away, but to far away to tell. Eventually the tree blocked my view entirely. The next night my son told me the object was back. It was approximately the same time of the night. When I checked, it was appearing approximately at the same distance and elevation, but was now at more of a southerly direction, less to the west. It was not moving, so I went inside and came back out a few times to check. After about half an hour it was gone."],"Case Number":"37683","Longitude":"-98.154484","map":"<A HREF = \"http://maps.google.com/maps?q=29.72101,+-98.154484(37683)&iwloc=A&hl=en\"> mufon case (37683) map </A>","Object Features":"Unknown","Object Shape":"Star-like","Date Submitted":"04/23/2012 11:05 UTC","Viewing Distance":"Over 1 Mile, Unknown"}