{"Case Number":"37688","files":["/var/www/straped/mufon/html2text/37688.html.txt","/var/www/straped/mufon/org/37688.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","City":"San Francisco","divs":["Sighting DetailsI was on the roof of a friends apartment without 5 other people. We all witnessed this event. The first object to appear was a small red balloon sized glowing object that floated about the roofs of the houses 3 or 4 blocks from us. It traveled seeming only under power of the pendulum swinging motion it was making. Every front swing it would move forward and every back swing it would stay still. We all commented on how weird it was, but just assumed it was some party favor run amok from someones back yard. This lasted maybe for 2 minutes before the light just fizzled and the whole apparatus disappeared from view. About 15 minutes later. So around 11 or 11-30 I want to say. A HUGE red light, the exact same color of the red bobbing light, came over the hill of Buena Vista Park and moved fairly quickly in an arching motion upwards and over the city till it came to a complete stop over the city. It was quite startling and left everyone dumb-struck for a moment before we all became very excited at the prospect of what we were witnessing. It hung in the air for about 10 minutes, just sitting. At this time it was about the size of a planet in the sky. One of my friends remarked it looked like it was trying to be Mars. IT then slowly, very slowly descended about 40 feet in the air. Stopped flickered the way the much smaller light had, then was gone from the night sky. We discussed the possibility of it being a helicopter, however the light was one SINGLE bright source, and was not blinking the way flight lights do. Also SILENT no noise what so ever. We tried to film it with our camera phones but nothing showed up on them."],"Log Number":"US-04232012-0015","Disposition":"Unresolved","Object Shape":"Disc, Sphere","Tags":"City","Longitude":"-122.413596","Country":"United States","Summary":"Red Orb came over hill in SF, Floated above city then flickered and disappear like a candle going out.","Latitude":"37.78309","Date Submitted":"04/23/2012 01:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.78309,+-122.413596(37688)&iwloc=A&hl=en\"> mufon case (37688) map </A>","Date of the Event":"04/20/2012 11:30 UTC","trends":["There have been 127 other sightings in San Francisco","There was one other sighting in San Francisco on or around April 20th 2012"],"Object Flight Path":"Path then hovering","Object Features":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"California"}