{"Disposition":"Unresolved","Object Features":"Undisclosed","divs":["Sighting Detailsi am an avid sky watcher in the summer months. i am also an engineer and have lived near a muni aiport all my life .hopkins int. airport is also 30 miles away. i have seen a lot of aircraft, this was not an aircraft. my fiance wanted to see a satellite(i use nasa.gov. for known observations and times..really miss the old j-pass!) so .. i'm watching and she was in my tool shop . a sat. comes up from the south going north.very normal so i call her,show her where to look and she see's her first sat(maybe a 6.0 mag.)i have a long veiw over a golf course so i picked the sat up at maybe 20 deg. above the southern horizon ,as it reached 90 deg. another satellite (or so i thought) appeared from the west ,it looked like they would cross paths or close to impacting, original sat. continued in straight line and the second turned( aprox. 70 deg acute) exactly into that flight path approximate 1 inch(from our reference point)behind the known sat. and caught up to it. 3-5 seconds veiw was obsttructed by a tree.when they reappeared only one light source was veiwable until it reached approx. 70 deg. from northern horizon.second craft SHOT away back on original trajectory heading and very bright and very fast.i know roughly how fast the sat. was going and whatever we saw was going at an incredible speed.i can't guess as to what our govt. might have that can manuever like that.side note.i do research and cross reference to see if anything (including first sat.) was \"supposed to there\" and nothing was scheduled.not surprising though because on nights i am anticipating a particular satellite i may see 20 of em!(actually saw 42 one night)."],"Summary":"ufo investigates a satellite","Source":"MUFON","Date of the Event":"08/01/2011 12:00 UTC","Latitude":"40.425687","Log Number":"US-04232012-0016","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Tags":"City","City":"Undisclosed","Region":"Ohio","Weather Factors":"Unknown","Object Shape":"Sphere","Longitude":"-82.899603","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=40.425687,+-82.899603(37689)&iwloc=A&hl=en\"> mufon case (37689) map </A>","Case Number":"37689","files":["/var/www/straped/mufon/html2text/37689.html.txt","/var/www/straped/mufon/org/37689.html"],"Country":"United States","Date Submitted":"04/23/2012 04:15 UTC"}