{"Object Flight Path":"Straight-line path","Latitude":"39.487173","map":"<A HREF = \"http://maps.google.com/maps?q=39.487173,+-119.814431(37699)&iwloc=A&hl=en\"> mufon case (37699) map </A>","Object Shape":"Cigar, Square, Rectagular","Case Number":"37699","Object Features":"Undisclosed","divs":["Sighting Details I was at home late in the evening, between nine and ten P.M. I went outside to have a smoke on my patio. I almost always check out the stars, especially where Orion's belt is. Orion's belt on this night was in the southern sky. I happened to look straight up and saw a very strange craft. At first,I thought it was a satellite or perhaps the space station, but then I realized the shape was completely wrong and way to large. It was very long, with four very dim lights in a row, with 3 very bright lights at 45 degree angle at the very front of the object. It seemed to be very large because it also seemed be very high, approx. 20,000 ft. It was elongated, rectangular, long and thin. Approx. 100-200 yards long. It made no sound, and moved from horizon to horizon in a matter of 2-3 minutes. The edges of the craft were darkened and blocked out the stars. The night was perfectly clear and the stars were bright. After about a minute, I couldn't take my eyes off of it. I didn't want to miss anything! So I decided not to run inside to grab my camera or phone. I then focused on remembering what I saw and concentrated on drawing a picture of this incredible event."],"Viewing Distance":"Over One Mile","Log Number":"US-04232012-0026","Source":"MUFON","Tags":"City","Summary":"Looked up and saw an elongated craft, moving from west to east. Did not know what it was.","Date of the Event":"02/16/2012 12:00 UTC","Region":"Nevada","Disposition":"Unresolved","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around February 16th 2012","This sighting has never been favorited.",""],"Longitude":"-119.814431","Sighting Duration":"Undisclosed","Date Submitted":"04/23/2012 08:14 UTC","Country":"United States","City":"Reno","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37699.html.txt","/var/www/straped/mufon/more/37699_submitter_file1__dadsketch.jpg","/var/www/straped/mufon/org/37699.html"]}