{"divs":["Sighting DetailsWas sitting outside smoking a cigarette with my boyfriend when I noticed this orange light in the sky.I noticed the object because the stars were out was staring at them and I was thinking about when the next meteor shower was going to be. I pointed it out to him and we were trying to figure out what it was. I asked him if he thought it was a air plane,but we both thought air planes don't have orange lights on them. Too orange to be a helicopter, but we took that in consideration at first before thinking anything else.We sat there to listen to see if it was a helicopter,but it didn't give off any sound. Then we also thought maybe it was a sky lantern. So we kept looking at it,but it didn't go all over the place like a sky lantern nor it flicker like one either. It looked like it was coming towards us like how a air plane would look like when it first takes off into the sky,then it went up straight slowly into the sky eventually the light was gone. When this was all happening I did not feel fear what so ever was pretty calm the whole time. After the sighting I just said that was odd and just left it at that."],"Latitude":"44.188999","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.188999,+-88.453019(37695)&iwloc=A&hl=en\"> mufon case (37695) map </A>","Date Submitted":"04/23/2012 06:27 UTC","Log Number":"US-04232012-0022","Object Flight Path":"Unknown","Summary":"Bright orange light,ascending into the sky slowly,slowly the light went up further it went up.","City":"Neenah","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","trends":["There has been one other sighting in Neenah","There were no other sightings in Neenah on or around April 21st 2012"],"Viewing Distance":"Unknown","Object Shape":"Unknown","Region":"Wisconsin","Longitude":"-88.453019","files":["/var/www/straped/mufon/html2text/37695.html.txt","/var/www/straped/mufon/org/37695.html"],"Case Number":"37695","Disposition":"Unresolved","Date of the Event":"04/21/2012 12:00 UTC","Object Features":"Unknown"}