{"trends":["There have been 5 other sightings in Justin","There were no other sightings in Justin on or around April 22nd 2012"],"files":["/var/www/straped/mufon/html2text/37697.html.txt","/var/www/straped/mufon/org/37697.html"],"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.068739,+-97.318414(37697)&iwloc=A&hl=en\"> mufon case (37697) map </A>","Summary":"saw 3 fast moving 'BLINKING' lights - 2-red 1- green extremely bright. headed south . Lasted only about 30 seconds and then we lost sight of them.","Region":"Texas","Log Number":"US-04232012-0024","divs":["Sighting DetailsOn Saturday night April 21, 2012 I observed an extremely bright star in the west and on Sunday evening April 22, 2012 I wanted my husband to see the star, so I went into the back yard to see if the star was visible yet. It was, so I stepped back to the back porch to have my husband come and see and as I approched the door there was a loud \"boom\" (like an explosion sound) and my husband was coming out as he had heard the noise also---I had him walk with me out into the yard to see the star and as I was pointing it out to him we saw an extremely bright green flashing light, then a extremely bright red flashing light a little distance west of the green one. They were moving very fast toward the south and thru a clearing between the trees we could see a red light farther south from the other 2 lights. The whole event took about 30 seconds. We stayed out a few minutes looking for more but we did not see anything else. The event took place at 8:50 pm. I have never seen anything like that ever. It was exciting but at the same time disturbing."],"Source":"MUFON","Latitude":"33.068739","Country":"United States","Longitude":"-97.318414","Date of the Event":"04/22/2012 08:50 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Disposition":"Unresolved","City":"Justin","Date Submitted":"04/23/2012 07:07 UTC","Object Features":"Undisclosed","Tags":"City","Case Number":"37697","Sighting Duration":"Undisclosed"}