{"Date Submitted":"04/24/2012 03:41 UTC","Tags":"City","Viewing Distance":"Unknown","Object Features":"Unknown","Country":"United States","Object Shape":"Fireball, Flash, Star-like, Unknown","Longitude":"-122.370842","Object Flight Path":"Unknown","Log Number":"US-04242012-0006","Sighting Duration":"Undisclosed","Summary":"It scared me and I don't believe in hocus pocus","map":"<A HREF = \"http://maps.google.com/maps?q=40.680428,+-122.370842(37708)&iwloc=A&hl=en\"> mufon case (37708) map </A>","Weather Factors":"Unknown","divs":["Sighting Details I live on the outside of town where there are hardly any street lights and it is plenty dark. I've long had an interest in astronomy, my own telescope, and fair knowledge of direction and the stars. I am inclined to be analytical, and skeptic. I can honestly say I've never bore witness to any crazy unusual sites - before tonight. Right around 9 o'clock I decided to go for a walk. It's a beautiful night, and I ended up going further than I planned (4 or 5 miles). On my way back home, coming down our long private road and watching the stars, I noticed a sort of strange glowing light. Initially resembling a star, it quickly became immensely bright and seemed to waver, like someone signaling with a mag light in the dead of night. I started to question myself and looked away. Revert my gaze I thought, it's been a long walk. I noticed a helicopter moving to my east whereas the \"whatever\" in question was to the west. I deliberately noted the difference in volume, luminance, and velocity. Upon looking again it's actions were exaggerated. Glowing, then stable, then gone altogether. I have witnessed similar patterns from Sirius, but these conditions were different and this was by far a more dramatic experience. It was absolutely silent and seemed to change it's location relative to mine as if it were not so far away. I was genuinely afraid, having never seen a thing like it. By the time I reached home, it had come and gone 4 or 5 times, then disappeared entirely. So I don't want to be looked at like a fool but I'd like to put this out there for whatever value it may be worth. I'm still trying to make myself believe it was make believe, but take from my story what you will."],"City":"Shasta Lake","Date of the Event":"04/24/2012 10:30 UTC","Case Number":"37708","Region":"California","Source":"MUFON","trends":["There have been no other sightings in Shasta Lake","This sighting has never been favorited."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37708.html.txt","/var/www/straped/mufon/org/37708.html"],"Latitude":"40.680428"}