{"Date Submitted":"04/24/2012 01:43 UTC","Log Number":"US-04242012-0004","Source":"MUFON","Region":"Wisconsin","map":"<A HREF = \"http://maps.google.com/maps?q=45.802233,+-89.538755(37706)&iwloc=A&hl=en\"> mufon case (37706) map </A>","Date of the Event":"04/23/2012 12:00 UTC","City":"W Rapids","Object Features":"None","divs":["sighting detailsit passed quietly, smoothly and fast in between paul's tree tops in his backyard.altitude seemed low, but, hard to tell that and it's size because of the brief time it was in sight very much like a sighting my wife and i had in the florida keys in the late 90s. i had finished 2nd shift at 10 pm and had stopped at a freinds to drink beer arouhd his firepit. we both saw the lights. (it wasn't the 2 beers i had consumed, either.)it was just lucky we were both looking up at the sky right at the time or we'd have missed it. no sound! no strobe\\flashing lights or colored lights, just white lights as bright as medium stars in a stable triangle shape. no wind, no clouds. i was just happy that my friend saw it, too. i checked my watch for the time and then made sure we had just seen the same thing. as much as i was hoping, tho, it didn't show up again in the next hour before i left."],"Disposition":"Unresolved","trends":["There have been no other sightings in W Rapids","This sighting has never been favorited."],"Object Shape":"Triangle","Summary":"Looking at stars in a freind's backyard. I saw the lights moving and said \"Paul, look at that!\" He saw it also. We both confirmed it wasn't birds and had 3 lights and moved from E to NW smoothly.I was shocked because I had a sighting very similar yrs ago.","Case Number":"37706","Longitude":"-89.538755","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Latitude":"45.802233","files":["/var/www/straped/mufon/html2text/37706.html.txt","/var/www/straped/mufon/org/37706.html"],"Viewing Distance":"Unknown"}