{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37714.html.txt","/var/www/straped/mufon/org/37714.html"],"Object Features":"Unknown","Object Shape":"Other","Date Submitted":"04/24/2012 05:25 UTC","Disposition":"Unresolved","Country":"United States","City":"New York","divs":["Sighting DetailsAt the time, I had a daily habit of going to local libraries to pick up free books. It was when I was walking along Ocean Parkway in the direction of Avenue X from Avenue Z ,heading to the library on Avenue X, that I had my sighting. Off to my left, I noticed a ,seemingly, toy-like object just above the row of houses. Yes, it was that low to the ground. I quickly realized that this was something very unusual. It was a pyramid-shaped metallic object that was rotating as it was ascending into the sky. When I tell people about it, I describe it as being a pyramid-shaped capsule and as being toy-like. I know it was metallic because the sunlight reflected off of it just like sunlight would reflect off a shiny piece of metal. It didn't ascend straight up but actually ,maybe, at a 45 degree angle. The rotation or spin seemed to be somewhat slow but at a steady or consistent rate. Maybe less than a minute after first spotting it, it disappeared through the clouds and I could no longer see it. My current thought on it is that it was taking off ,maybe, from someones roof at that time. I want to point out that this was in broad daylight in the middle of the afternoon and in a main area. It was very busy was alot of traffic and people and there were planes in the sky too. There were 2 people that were standing just a couple of feet in front of me ,while I had the sighting. Unfortunately, I didn't say anything to them and I did wish ,afterward, that I had said something. But, there had to be other people who saw it too. I always tell people about it even though the reaction is not good. I made sure that I remembered the date which was on April 06, 2004. I tell people about how this sighting was traumatizing to me because it ,momentarily, took me out of the reality ,so to speak, I'm used to and made me aware of another kind of existence. This existence being other-worldly. Being a man of scientific thought, I always try to analyze and understand what I saw. I believe that the object was in some kind of anti-gravity space and it was rotating to provide gravity ,inside of it, for its occupants. But, no matter how much I think about it I can't know how it's doing it. Just this past year, I came to a startling realization. It is quite possible that these pyramid-shaped objects were commonly seen back thousands of years ago and this could be what inspired the Egyptians and others to build the pyramids. This may be what ancient civilizations did to pay worship to these objects."],"Source":"MUFON","Latitude":"40.61423","Log Number":"US-04242012-0012","Region":"New York","Case Number":"37714","Longitude":"-73.968881","map":"<A HREF = \"http://maps.google.com/maps?q=40.61423,+-73.968881(37714)&iwloc=A&hl=en\"> mufon case (37714) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around April 6th 2004"],"Viewing Distance":"21-100 Feet","Date of the Event":"04/06/2004 03:01 UTC","Tags":"City","Summary":"Rotating pyramid-shaped capsule ascending at an angle","Weather Factors":"Unknown"}