{"Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.380679,+-100.921686(37729)&iwloc=A&hl=en\"> mufon case (37729) map </A>","Sighting Duration":"Undisclosed","Longitude":"-100.921686","Disposition":"Unresolved","divs":["sighting detailsit was 8:04 pm on easter sunday (8 april 12) and i was walking with my dog back to my house. the was lowering in the sky behind us, but it was still pretty bright out. i noticed the bright orange light which was similar in apparent size and slightly brighter than venus. however, i noticed it was in the wrong part of the sky to be venus (i was facing east). also, i noticed the object was moving from right to left (south to north). at first i assumed it was an airliner, but it appeared way too bright and didn't have any navigation (red\\green) lights or anti collision (strobe) lights. it flew in that level path, never changing altitude. it took about 30-40 seconds for it to cover my field of view, going right to left. i took the dog in the house and then immediately went to the back yard to see if i could see it again. it was still following on the same path, until it started to fade away. it took about two full seconds for it to fade away (think dimmer switch). i live next to the local airport and there is a military air field here too (air force). i thought it also might be one of the jets in after burner, but the jets only use after burn when departing and terminate the after pretty shortly after takeoff. also, jets rarely fly on sundays unless they are returning from a weekend cross country sortie. there were no scheduled sorties for that day or time and none of the arrivals into the airfield call for the aircraft to fly a south to north path north of the airfield like the flight path of the object i saw. i've lived here nearly three years and haven't seen anything like that before and i haven't seen anything since."],"City":"Del Rio","Log Number":"US-04252012-0005","Country":"United States","Source":"MUFON","Latitude":"29.380679","Object Features":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Fireball, Sphere","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around April 8th 2012"],"Region":"Texas","files":["/var/www/straped/mufon/html2text/37729.html.txt","/var/www/straped/mufon/org/37729.html"],"Date Submitted":"04/25/2012 02:08 UTC","Date of the Event":"04/08/2012 08:04 UTC","Summary":"Orange orb/light heading N/NW before fading out","Case Number":"37729","Object Flight Path":"Straight-line path,Path with directional change,Other"}