{"Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/37720.html.txt","/var/www/straped/mufon/org/37720.html"],"Country":"United States","Date Submitted":"04/24/2012 09:05 UTC","Date of the Event":"04/24/2012 10:35 UTC","Case Number":"37720","Longitude":"-92.783537","City":"Afton","Log Number":"US-04242012-0018","Region":"Minnesota","Object Flight Path":"Stationary","Tags":"City","Object Features":"Unknown","divs":["sighting detailswas golfing in afton, mn. approximate time 10:35 am. 04\\24\\2012 was crossing from one side of the fairway to the other to get to my golf ball. i should point out that there was not a single cloud in the sky today, nothing but blue sky. saw what i assumed was an airplane about 600 to 1000 feet in altitude and probably about half a mile away. i noticed it wasn't moving anywhere, then i thought maybe a helicopter for a split second, but it wasn't making any noise whatsoever.i stared at it for about 6 seconds or so. the person driving the golf cart got to my ball that was behind a tree, blocking my view of the craft\\object. i still wasn't sure what i saw so i didn't say anything yet to the other person and i proceeded to hit my golf ball and get back on the golf cart. we pulled back onto the fairway and i looked for the object for further identification purposes.( i had my eye off the object for about 30 seconds at this point). the craft was gone! and was nowhere to be seen in the wide open blue sky. there was nowhere for this object to hide! it was definitely some type of craft. only possibility is it blinked out\\went stealth mode or it took off so fast that it was completely of the sky in 30 seconds. when i found it appeared to be gone already, i jumped out of the cart and asked the driver if he saw that! (the ufo) he said no he didn't, i was bummed he hadn't seen it and he helped me comb the skies to no avail. it was gone! could be unrelated but, about an hour later there was a helicopter that was flying back and forth over the golf course. it wasn't a black helicopter or anything like that, looked like possibly a news helicopter. there was big letters on the side, but couldn't get the correct angle to read them. i wish i could identify the craft better, but it was far enough away that details are sketchy at best, however, i will say that this wasn't a light orb or anything like that, this what looked to be some type of physical craft, it looked metallic and had either lights or windows on the side, was hard to tell because of distance and i only saw it for about 6 seconds and most of that time i was trying to figure out what is was not, and didn't get a ton of further examination time. anyway was a pretty neat experience. i didn't get freaked out or anything like that, just wish i could have seen it longer and closer."],"Summary":"Silent Craft of some type. Thought was a helicopter at first. No sound.","trends":["There have been 2 other sightings in Afton","There were no other sightings in Afton on or around April 24th 2012"],"Weather Factors":"Unknown","Latitude":"44.902745","map":"<A HREF = \"http://maps.google.com/maps?q=44.902745,+-92.783537(37720)&iwloc=A&hl=en\"> mufon case (37720) map </A>","Sighting Duration":"00:00:06","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved"}