{"map":"<A HREF = \"http://maps.google.com/maps?q=44.47446,+-70.064924(37723)&iwloc=A&hl=en\"> mufon case (37723) map </A>","files":["/var/www/straped/mufon/html2text/37723.html.txt","/var/www/straped/mufon/more/37723_submitter_file1__2012-04-2421.40.27.jpg","/var/www/straped/mufon/more/37723_submitter_file2__2012-04-2421.40.34.jpg","/var/www/straped/mufon/more/37723_submitter_file3__2012-04-2421.41.01.jpg","/var/www/straped/mufon/org/37723.html"],"Object Flight Path":"Stationary","Date of the Event":"04/24/2012 09:40 UTC","Object Shape":"Other","Region":"Maine","Longitude":"-70.064924","Date Submitted":"04/24/2012 10:49 UTC","Viewing Distance":"Over One Mile","Country":"United States","City":"Fayette","Latitude":"44.47446","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on my second floor deck smoking a cigarette. I was looking at the stars. I saw a crescent shaped object towards the west just above the tree line but low in the sky. I initially thought it was the moon but the light from the object was not uniform like the moon, there was some variation through the crescent. As I watched the object it faded slowly but not completely then slowly returned to the original brightness. I took out my Android phone and downloaded Google Sky Maps and pointed it towards the object just to be sure thinking it was the moon. The objects that came up was the Perseus constellation and Mirphak star. The object was stationary, there may have been a slight red light on the curve of the crescent but it could have been my eyes playing \"tricks\". I watched for maybe three minutes and needed to go inside to use the bathroom. I ran in as quick as I could and came out and the object was gone. I attached three photos there are two photos that are not zoomed in and the object on the right is a star."],"Log Number":"US-04242012-0020","Source":"MUFON","Case Number":"37723","Summary":"Cresent shaped object witnessed in Maine sky.","trends":["There have been no other sightings in Fayette","This sighting has never been favorited."],"Tags":"City","Object Features":"Unknown"}