{"trends":["There have been no other sightings in Icard","This sighting has never been favorited."],"Date Submitted":"04/24/2012 09:56 UTC","Case Number":"37721","Viewing Distance":"501 Feet - 1 Mile","Region":"North Carolina","Object Features":"Unknown","Object Flight Path":"Stationary","Summary":"Spotted disc shape object on I-40 North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.727354,+-81.470646(37721)&iwloc=A&hl=en\"> mufon case (37721) map </A>","Source":"MUFON","Log Number":"US-04242012-0019","Object Shape":"Disc","Date of the Event":"04/24/2012 06:30 UTC","Weather Factors":"Unknown","Longitude":"-81.470646","Country":"United States","files":["/var/www/straped/mufon/html2text/37721.html.txt","/var/www/straped/mufon/more/37721_submitter_file1__Unknown_1.jpg","/var/www/straped/mufon/org/37721.html"],"Latitude":"35.727354","Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Icard","Tags":"City","divs":["sighting detailsat 6:30 am on 4\\24\\2012, i am driving to work westbound on i-40 north carolina at exit 116 when i spotted this disc shaped object in front of me this was extremely bright and metallic, just slightly to the right above the tree line (see simulation photo). my first thought it was a commercial aircraft and did not think any more of it, when it became pretty evident that it was not moving as it seemed to hovering this to the best of my judgment, i was travelling approximately 65 mph. i continued to watch this craft for several seconds still trying to keep my on the road, interesting to note, there was very little traffic at this time. i again looked up only to find it had completely disappeared. total viewing time was estimated to be approx 30 seconds, and size was 1\\3 of the full moon. coincidentally and i must admit it did freaked me out for a moment. as i lost sight of the craft, my garmin gps (only 3 months old) just suddenly turned itself on and gave me directions to go to edgewood drive in morganton, nc which was another 11 miles away on i-40 exit 105."]}