{"Source":"MUFON","City":"Tulare","Object Shape":"Bullet, Missile, Cigar, Sphere","Sighting Duration":"Undisclosed","divs":["Sighting Detailsheading home through highway 58 towards bakersfield,I observed several bright lights in the sky in various locations through the sky. I took my phone camera and took pictures of them. There were at least 6-8 of them in the sky in various positions.They appeared to project a small exhaust as I got closer but the objects remained stationary in the sky. the one that caught my eye was the one in a vertical upward pattern that remained stationary until I stopped the car near the town of Keene. I got out of the car to take photos. As I was ready to take a photo of the stationary object with the small exhaust trail. something else approached it and appeared on a collision course with it. As it got closer to the object it moved to the right of the stationary object. I believe it was a jet fighter as it had quite the exhaust trail. As the object passed. it stayed stationary for what appeared quite sometime. I then was watching the objects slowly disappear including the small vapor trail associated with all of them. I enhanced the best photo of the vertical object on my cell phone. It almost appears to look like a cylinder shape two distant colors dull metal on top and a brushed metal in the middle. the closest thing I would compare it to would be a bullet in a casing. the other photos mainly show the various directions of the objects located throughout the sky. The next day, I asked a few workers if they seen the lights over the town. Another individual confirmed my observation but was in Tulare 62 miles away from my view of it. The media reported meteor showers but I have lived in the area most of my life observing meteor showers. I have never seen any stay stationary for extended periods of time or an aircraft direct it's attention toward it. I can send photos to you upon request and maybe you can enhance them better than my camera."],"Object Features":"Unknown","Disposition":"Unresolved","Longitude":"-119.297083","Log Number":"US-04242012-0021","trends":["There have been 2 other sightings in Tulare","There were no other sightings in Tulare on or around April 22nd 2012"],"Weather Factors":"Unknown","Region":"California","Tags":"City","Case Number":"37724","Object Flight Path":"Undisclosed","Summary":"coming through mountain range observed and took photos of several objects in the sky","Latitude":"36.262028","Date Submitted":"04/24/2012 11:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.262028,+-119.297083(37724)&iwloc=A&hl=en\"> mufon case (37724) map </A>","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/37724.html.txt","/var/www/straped/mufon/org/37724.html"],"Country":"United States","Date of the Event":"04/22/2012 07:15 UTC"}