{"Longitude":"-78.780246","Viewing Distance":"501 Feet - 1 Mile","Region":"North Carolina","Date Submitted":"04/25/2012 01:20 UTC","Source":"MUFON","Date of the Event":"04/24/2012 11:50 UTC","Object Shape":"Boomerang","Tags":"City","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/37726.html.txt","/var/www/straped/mufon/more/37726_submitter_file1__IMG_2734.JPG","/var/www/straped/mufon/more/37726_submitter_file2__IMG_2733.JPG","/var/www/straped/mufon/org/37726.html"],"Latitude":"35.819696","Case Number":"37726","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.819696,+-78.780246(37726)&iwloc=A&hl=en\"> mufon case (37726) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsI went out on my deck around 11:30 p.m. to have a cigarette. It was a clear night and a lot of stars were out. I noticed this twinkleing and thought ...that was a bright star. I came in the house and got my binoculars and realized that it wasn't a star because of the red lights so I figured seeing that we are close to an airport that it must be a plane. I sat down and just watched it and after 10 minutes it still didn't move. So I looked thru the binoculars again. The object seemed to be jerking almost like doing little circles?? This object stayed for about 45 minutes. It never went away it just seemed to go farther away up and then just disappeared.My wife did take some pictures which I have included for you. It was really freaky. Like I said this might have been a plane and I wouldn't have even filled this form out but my wife did see something about 5 months ago. She said she was sitting outside late one night and saw these red lights and to her it looked like 2 planes piggy backing and they moved really slow right over our apartment building. I didn't think anything about it until I realized planes never fly over our building. Like I said we live by the raleigh airport and we see the flight pattern of the planes all day long...the ones that went over our building just never ever happen. If you want the pics she took this evening, let me know where to send them. You have much better equipment and I am sure you could probably tell if this is a plane or not. Thanks for your time. Jon"],"Object Features":"Undisclosed","City":"Cary","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Cary","There were no other sightings in Cary on or around April 24th 2012","This sighting has never been favorited.",""],"Summary":"Just these lights of red and white and this object stayed in 1 place for 40 mins. I do have pictures. It may be a plane however, I never saw a plane stay stationary like that before?","Log Number":"US-04252012-0002"}