{"trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around September 10th 1990"],"Tags":"City","Date Submitted":"09/10/1990 04:00 UTC","Object Shape":"Other","Object Features":"None","divs":["Sighting Details\"Me, my wife, my brother in-law and my young daughter of 3 years old were headed to Salem Oregon on a highway 15 miles just east of Salem. There were clouds in the sky in three different layers but no rain. As I was driving West I noticed through my perifial vision to my left that there was a large dark spot in the sky so I looked to my left and saw a large object floating about 30 feet off the ground! I yelled and emediantly slowed down the car and did a quick U turn and pulled over to the south side of the highway, got out of the car and looked very clearly at this thing! Everyone in the car got out and asked what was wrong and I told them to look up over there and they gasped! This was an object with the exact demensions of a hocky puck in that it was flat on top, flat on the bottom and round on the edges. It was flat black and not shiny. It had no windows, no lights and made no sound. I noticed that the trees and shrubs just beneath it were not being disturbed in any way. Also under this object was the county jail facility or some sort of correctional facility and there was a gaurd in one of the towers. We yelled at him to look up but he just looked at us. He and the facility were about 75 yards from the highway. This object was about 80 to 100 yards in diameter and was just so massive that I could hardly believe it even though I stood there looking at it! I could have easily thrown a rock at it and struck it. It was just floating there 30 feet off the ground and it was tilted at a 45 degree angle and it was that way for about 2 minuts or so then it began to move which sent all of us to hide behind the other side of the car. It titled over to its other side at 45 degrees and remained there for about another 3 minuts. This allowed us to see the roof of the object which was as flat and smooth as its underside. It really looked like a giant hocky puck and was flat black. It then tilted again to the other side for about 10 seconds and then slowly began to move westward at a 30 degree climb angle at about 40 mph. We got back into the car and u-turned to head west to follow it. It then picked up great speed and by that time I was already pegging 90 mph in persuit. Just then a police car passed us with his cherries fully lit but no siren and I never even noticed that he was behind us. He passed us like we were sitting still and we all assumed that he was chasing this thing as well. If that was not bizarre enough what happened next was even more unbelievable. We lost site of this object in the low dark grey clouds but passed by an air national gaurd station about 5 miles east of Salem. I U-turned again and went back to that station, got out of my car with my brother in-law and we told the gaurds there what had just happened. They were totally unconcerned! I wanted to speak to their radar operater but they refused to allow me on the base. After about 5 minuts of argueing, I had enough so I simply pushed one of them aside and ran for the building that I thought may have the radar in it. They tackeled me and put my arms behind my back and led me back to the gate. They threatened me that I was guilty of a federal crime by \"breaking into a federal facility\" and would be arested if I didn't leave. We got into our car and left there headed for Salem again. We didn't see the police car or the UFO anymore. We then arrived at our relatives house in Salem and told them what had happened. To my amazement they chuckeled and said that they could tell that we were newcomers to Oregon. I asked how. She said that they see them all the time! Two days later at the vetenarian clinic while getting our dog a shot I told the vet what had happened. To my amaizment he too stated that this is a common occurance in and around salem! I heard this again from a store clerk and a parking attendant who states that on two seperate occations he personally spotted a UFO stuck to the side of one of the mountains east of Salem. So if there are so many sightings why then aren't ufoligists going there to film these on a regular basis? One thing is for sure, since that time on that highway my life has changed forever in that I am now obsessed with these crafts. I have dedicated all my spare and free time to understanding how these crafts fly, how their propulsion systems work and what intelligent race of beings fly them and why do they never come down to earth and land in the middle of a major traffic intersection and begin a dialog with us. This would block our Govt's effort to convince us that what we see is swamp gas comming from the planet Venus.\""],"Source":"MUFON","Case Number":"3773","Viewing Distance":"101-500 Feet","Sighting Duration":"00:05:01","City":"Salem","Longitude":"-123.026016","files":["/var/www/straped/mufon/html2text/3773.html.txt","/var/www/straped/mufon/org/3773.html"],"Summary":"Event was a close encounter. Object was hockey puck shaped about 75 yards in diameter. I was within 70 yards of craft.","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=44.950758,+-123.026016(3773)&iwloc=A&hl=en\"> mufon case (3773) map </A>","Weather Factors":"Windy","Latitude":"44.950758","Country":"United States","Object Flight Path":"Stationary,Hovering then path","Disposition":"Insufficient Data","Date of the Event":"09/10/1990 04:00 UTC","Log Number":"US-08262005-0002"}