{"Date of the Event":"04/24/2012 10:15 UTC","Case Number":"37732","Source":"MUFON","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.870233,+-97.159283(37732)&iwloc=A&hl=en\"> mufon case (37732) map </A>","Longitude":"-97.159283","Object Features":"None","trends":["There have been 2 other sightings in Colleyville","There were no other sightings in Colleyville on or around April 24th 2012"],"Weather Factors":"Unknown","Object Shape":"Boomerang","City":"Colleyville","divs":["sighting detailsaround 2200 on 4\\24\\12 i was in the back yard facing west i noticed a commercial aircraft heading north with its landing lights on as we are near dfw airport and have several flight paths for dfw and love field. i then noticed 2 aircraft at a higher altitude heading north northwest. they appeared to be military as the aircraft were in very close proximity to each other and one overtook the other. i then noticed several more of the same type of aircraft, they had the same distance from wingtip to wingtip and had strobes and beacons on, some were on a straight line path while others banked and turned and appeared to have no designated flight plans and none of the aircraft created a contrail. a total of eight of these aircraft were initially observed. i then noticed an object starting about 70 degrees fly directly overhead at 90 degrees. at first glance i thought it may be a flock of geese, as it was in a v formation, when i looked closer it appeared to be in a boomerang shape and a type of fog enveloped the object but was not traveling fast enough to create a wilson cloud. approximate altitude was hard to judge but i would say 500-1000ft and speed was around 150-200mph there were no lights on the object it was completely silent and was only lit by ambient light. as it headed off into a northerly direction it appeared to fade out. subsequent to this sighting there were more of the military aircraft in the area and no more commercial aviation seen in the area for over an hour."],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37732.html.txt","/var/www/straped/mufon/org/37732.html"],"Object Flight Path":"Straight-line path","Date Submitted":"04/25/2012 10:28 UTC","Latitude":"32.870233","Summary":"Boomerang shaped cloud object over north Texas","Country":"United States","Disposition":"Unresolved","Log Number":"US-04252012-0007","Tags":"City"}