{"Date of the Event":"04/21/2012 11:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.219067,+-118.424547(37738)&iwloc=A&hl=en\"> mufon case (37738) map </A>","Date Submitted":"04/25/2012 12:00 UTC","Object Features":"Unknown","Log Number":"US-04252012-0014","Object Flight Path":"Stationary,Hovering then path,Path then hovering","files":["/var/www/straped/mufon/html2text/37738.html.txt","/var/www/straped/mufon/org/37738.html"],"Country":"United States","divs":["Sighting DetailsI had walked outside to have a cigarette and I was looking towards Burbank airport,watching the planes come in when I noticed a dark object that appeared to be floating at first I thought it was a Mylar balloon it looked like it was tumbling up especially when it looked like it was reflecting sun light off the top, later I realized they were lights,anyway it climbed for about two minutes then it seamed to start drifting towards me. At that point I thought well maybe it's a helicopter, but I didn't here any noise I thought that was weird because as I watched it getting closer I started thinking well maybe it's an airplane,but still no noise then it came almost overhead and stopped also as it was approaching it appeared to be chanching shapes it looked a little jagged around the edges it also looked as if it were shrouded in mist. I also noticed lights flashing and there was a vortex way below it. At this point Iam starting to think maybe this is a UFO so I am thinking I should run and get my camera, but I don't want to miss anything. I finally dash in side grab my camera come back and it's still there so snapped a few shots then I decided to get a better shot from a different angle I stepped around the patio cover and it was gone just like that in an instant. I remember feeling as if it were trying to communicate I felt like I was being watched then it started feeling a little scary afterwards I thought wow amazing this feels like a dream unbelievable at that point I felt like go ahead take me I'll go what an opportunity chance of a lifetime. Iam now working on electromagnetic flying craft. I was that inspired because this is my second one the first one I didnt have a camera available. That was a whole different experience especially at night. This experience was like winning the lotto."],"Disposition":"Unresolved","Region":"California","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 3 other sightings in North Hollywood","There was one other sighting in North Hollywood on or around April 21st 2012"],"City":"North Hollywood","Viewing Distance":"Over One Mile","Object Shape":"Square, Rectagular, Triangle","Longitude":"-118.424547","Case Number":"37738","Latitude":"34.219067","Summary":"It was the most incredible experience better than my first about 30 years ago I always felt and knew we were not alone","Weather Factors":"Unknown"}