{"City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.432813,+-78.651144(37744)&iwloc=A&hl=en\"> mufon case (37744) map </A>","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting Details Hello Mufon. About fifteen years ago i put in a vcr tape of the movie \"High Noon\" staring Gary Cooper. In the first minute or two of the movie during the credits, an apparent ufo flew right over top of the camera and over top of three horse riders. Just as the riders turned left to cross railroad tracks the ufo flew over the riders and turned right without appearing to slow down. The object seems to be elongated as it flies overhead, but after it caught my eye i hit the pause button frame by frame until it does a 90 degree turn to the right. At first it appears black obviously because the sun is above. As it turns right it clearly looks like a classic silver disc, but not the plate on plate kind, but the kind taped in abundance in mexico. The sun is apparently behind the camera which is the reason it doesn't appear silver until it turns, and takes sunlight broadside. As it flies overhead you can see a wavy disturbance around the object. I have since researched the making of the movie, and i found out that the movie was done on a tight budget, therefore it was likely that the insignificance of the scene would not warrant a retake. This is no prank, and i hope you have the time to investigate this film and email me as to your conclusions. Also, the cinematogrophy is supurb in this film, so the video is top quality black and white. Many of my friends have viewed this sequence in the movie and think i should tell someone like you. Happy hunting. sincerely, a great advocate of your valuable research. John brite"],"Longitude":"-78.651144","Latitude":"37.432813","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"09/01/1952 08:15 UTC","Country":"United States","Object Shape":"Disc","Summary":"This is a ufo caught on film in the 1952 movie \"high noon\"","Source":"MUFON","files":["/var/www/straped/mufon/html2text/37744.html.txt","/var/www/straped/mufon/org/37744.html"],"Object Features":"Dome","Case Number":"37744","trends":[],"Date Submitted":"04/25/2012 07:35 UTC","Object Flight Path":"Path with directional change","Log Number":"US-04252012-0020","Viewing Distance":"N/A","Region":"Virginia"}