{"Case Number":"37749","Date Submitted":"04/26/2012 12:25 UTC","Sighting Duration":"Undisclosed","Longitude":"-87.809371","trends":["There have been 2 other sightings in River Forest","There were no other sightings in River Forest on or around April 25th 2012"],"Latitude":"41.906942","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.906942,+-87.809371(37749)&iwloc=A&hl=en\"> mufon case (37749) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37749.html.txt","/var/www/straped/mufon/org/37749.html"],"Weather Factors":"Unknown","Tags":"City","Summary":"large gray rectangular shape moving SE to NW, changed shapes","Region":"Illinois","City":"River Forest","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsWas at Concordia University Chicago track & field in River Forest, looked to the south and saw a commercial jet liner in the distance, moving from left to right. It was fairly high above the heavy tree line. Behind and below it - quite far below it - there appeared to be a very large, fuzzy, gray rectangular object, much larger (closer, perhaps) than the jet. The rectangle was longer than tall, but not by much... in other words, an elongated square shape. This is a common flight path for planes from O'Hare. I thought at first it was a very large banner being pulled by a plane, since it moved at approximately the same speed and in the same direction as the jet. However, what caught my attention was that it was so much farther below the jet (and jetliners do not pull advertisement banners), and it was not a long thin clearly-read banner, but a large, gray, indistinctly-edged rectangle. As I watched, it began to angle down into the tree line, so I jogged so I could keep it in view and yelled at others to check it out. Nobody saw it and gave me a hard time afterwards. As it moved towards the horizon, which was the tall tree-filled neighborhood, it appeared that perhaps there were two objects, more like two 'cigars' or saucers that overlapped, and moved independently, one rising above the other momentarily and showing a cylindrical rounded end, then dipping back into or behind the other... almost like two cylindrical objects that blended together in appearance to make a rough rectangular overall shape. It disappeared below the treeline and that was the last I saw. It appeared MUCH bigger than the plane, but it could have been much closer. I had time to think that perhaps it was a flock of geese or sandhill cranes; I'm a birder and pay close attention to things like that. However, the shape - while changing in nature - was too solid to be a flock of birds, and there was no fluttering or flapping of wings. It just moved steadily from left to right as I faced south, perhaps south east to northwest towards O'Hare, and was gone. Searched news about sightings in Chicago but appears nobody has reported it. My feelings? Was busy, the people I was working with laughed it off, so I got back to work and didn't think about it until I got home tonight. No time to pull my blackberry out and film."],"Object Shape":"Square, Rectagular, Other","Date of the Event":"04/25/2012 12:00 UTC","Country":"United States","Log Number":"US-04262012-0001"}