{"Longitude":"-72.021229","files":["/var/www/straped/mufon/html2text/37742.html.txt","/var/www/straped/mufon/org/37742.html"],"Source":"MUFON","Disposition":"Unresolved","Region":"Connecticut","Log Number":"US-04252012-0018","Latitude":"41.346839","Date of the Event":"04/24/2012 11:00 UTC","Date Submitted":"04/25/2012 06:12 UTC","Viewing Distance":"Over One Mile","Case Number":"37742","Tags":"City","Weather Factors":"Unknown","Object Shape":"Disc","Country":"United States","trends":["There have been 4 other sightings in Groton","There were no other sightings in Groton on or around April 24th 2012","This sighting has been favorited 1 time.",""],"Summary":"I was walking my son and noticed 2 flattened disc like objects maneuvering in a strange way.","Sighting Duration":"00:01:30","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.346839,+-72.021229(37742)&iwloc=A&hl=en\"> mufon case (37742) map </A>","Object Features":"Other","divs":["Sighting DetailsOn April 25th 2012, I was walking my son on Ring Drive with one of my dogs, my son has a thing for aircraft and pointed out these two objects in the distance. At first glance I realized that these were not fixed wing aircraft; the two objects were following each other too closely and in tandem with each other. So, I whipped out my camera and was able to video both objects, unfortunately I only have a few seconds of far less than ideal video because the objects started performing odd manoeuvres and zipped off before I could get to a different vantage point. Plus, I was pushing my son across the street in his carriage and with a chihuahua in tow. Of what I could see prior to video taping and during the taping was two flattened disc like objects that were very bright, they would move vertically up and down quickly, but with syncronisity to one another. Once I tried to stop video taping in order to gain a better perspective, but, both objects moved at an upward angle with a very fast rate of climb, interestingly enough neither object tilted during the high rate of climb. I guess my feelings are that we are not alone in this universe, I've been living in Groton CT for a few years. And YES we live near an airport, but in no way, shape or form was this a conventional aircraft. We see dozens of planes that fly by our house and this looked nothing like any of them. I believe this is a UFO hotspot and have been taking notice for quite some time now; recently, I've been packing my video camera along for my walks with my son because of all the activity that I noticed. I think that some of the supporting factors for the high activity are related to the fact that the Groton Nuclear Sub Base, General Dynamics (Electric Boat), and the military installation (National Guard - located next to the Groton Airport)are all located here. I'm sure it can be said that historically Groton CT isn't a UFO \"Hot Spot\", I can't argue with the facts; however, it is my personal belief that at this present time, it could be, and maybe someone will read this and start observing the skies whenever they are in this town. On a side note, it would seem that these objects have some sort of curiosity regarding us, and, after a bit of research I found that technology and nuclear weapons seem to invoke a curiosity or affinity on behalf of these UFO's or dare I say: extraterrestrial beings. As I said, I have a video of this instance as well as a few pictures and videos from the last month or so regarding different instances. Thank you for reading my experience."],"City":"Groton"}