{"City":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"04/24/2012 10:40 UTC","Object Shape":"Cigar, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=27.671347,+-81.512224(37740)&iwloc=A&hl=en\"> mufon case (37740) map </A>","Country":"United States","trends":[],"divs":["Sighting DetailsFlight path approx 70,000ft using Gen 2 Night vision monocular. Saw 3 start like objects in succession travel at high rate of speed. If you have seen the recent video clip of the Military scram jet test in the Pacific that broke apart at Mach 20. I would compare the speed to that except somewhat faster. It was straight and level from West to East. Using NVG as you know reveals everything in a green hue. These 3 lights were dim compared to the brighter star surroundings. Once it passed over the Eglin AFB airspace I got a better backdrop of stars and starlight at which point (only for a brief second) all 3 lights appeared to belong to a very LARGE cigar like object. It flew so fast and straight and level it was an awesome sight. I usually do not report anything like this but this was Super awesome! Plus, I know the (Powers that Be) monitor these sites and read everything carefully, so I just want to say that if it is us (Military Space craft). KEEP UP the GOOD work. If you guys fly around in those things, it really looks fun. I know our Military has to have craft that perform these types of things and you guys are just really, really lucky to be involved in the development, testing and implementation of that type of technology. What a fun job you must have. I am from the school that secrets are secret for a reason and John Q public does not need to fear the Military, but needs to make sure that we have really good medical care if anyone gets hurt. Anyways, Thank you for listening. P.S. - If you ever have an available seat, I would love to be flight crew for the day. I mean night that is!"],"Date Submitted":"04/25/2012 04:13 UTC","Latitude":"27.671347","Region":"Florida","Disposition":"Unresolved","Longitude":"-81.512224","Log Number":"US-04252012-0016","Weather Factors":"Unknown","Summary":"3 start like objects in succession until horizen star backdrop, appeared cigar shape briefly.","Case Number":"37740","Tags":"City","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/37740.html.txt","/var/www/straped/mufon/org/37740.html"],"Object Flight Path":"Straight-line path"}