{"Viewing Distance":"Unknown","divs":["Sighting DetailsAt about 9pm on April 13, I was in a grocery store parking lot putting my groceries in the car. I saw some lights that at first appeared to be airplane lights, blinking in the sky (red and white lights). I just saw those lights for a few seconds, and assumed it was an airplane, although I thought that it was moving slower than an airplane. When I looked up again to take another look, the lights were gone. (I'm still not sure whether this was part of my sighting experience or not; it's possible that this was an airplane.) A few minutes later I was at home, unloading my groceries. I made a few trips between my car and the house, and closed the house door each time, to keep the mosquitoes out. When I opened the house door to go back out to the car, I was confronted by some lights in the sky, directly in front of me. I felt frozen in place while I stared at it, trying to comprehend what it was. It looked like a disc shaped object, with three lights that covered most of the surface. The object appeared to be black; I saw a black outline at the outer edge of the lights. The object appeared to be really close and low in the sky; the size appeared about 2-4 inches in width (like thumb and first finger held apart at arm's length). The lights were incredibly bright, it's hard for me to describe the vivid quality they had. The light in the center was taller, oblong shaped, and a deep red. This light gave me a really frightened feeling. The other two lights extended off to the sides: a vivid bright blue on the left, and a white-ish blue on the right. These lights were so brilliant and vivid, but didn't appear to be shining onto the treetops. I only stared at it for less than 10 seconds (I think), while I tried to figure out what it was. It was completely motionless, and made no noise. Finally I realized it wasn't an airplane or helicopter, and I had a strong overwhelming feeling that it was watching me (the lights were pointed directly at me). I got extremely scared, said \"Oh sh*t\" out loud, and closed and locked the door. I went to get my husband, who was in our room at the other end of the house. I told him I'd seen something, and when he got there I opened the door just to peek outside, but it was gone. My husband went outside to look, and stayed outside for about 5 minutes, but he didn't see anything. He did see an airplane, which is normal since we're in the flight path for the RDU airport. This experience really scared me, because I don't know what it was, but I think that it was watching me and wanted me to see it. That really frightens me; I honestly just don't know what to think. The sky around our house is almost completely obscured by tall trees, except for one spot where there's a break in the trees next to our neighbor's house. This object was in the only spot where I would be able to see it in the sky, from the house. I almost wish that I'd taken a picture of it or watched it longer, but at the time that didn't even occur to me; I was just really frightened and wanted to get away from it as soon as possible. Nothing unusual has happened since then, although I've had dreams about seeing UFO's (objects and lights in the sky) several times since then. I'm also kind of scared to be outside at night, because I don't want to see something like this ever again. I wasn't sure whether to report this or not; I almost didn't want to, because I just didn't want to write about this or think about it. But I've been looking at the UFO reports on this webpage to see if there were any other sightings near here, and I saw one from last night (24th) in Cary that sounded similar, so I figured I'd report this in case anyone else in the Raleigh area has seen something like this."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/37741.html.txt","/var/www/straped/mufon/org/37741.html"],"City":"Raleigh","Country":"United States","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"US-04252012-0017","Latitude":"35.781516","Object Features":"Dome","Date of the Event":"04/13/2012 09:00 UTC","Summary":"Witnessed three extremely bright lights in the sky, stationary and no noise","Object Shape":"Disc","Longitude":"-78.631874","Date Submitted":"04/25/2012 05:01 UTC","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around April 13th 2012"],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.781516,+-78.631874(37741)&iwloc=A&hl=en\"> mufon case (37741) map </A>","Case Number":"37741","Region":"North Carolina"}