{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.207905,+-97.445266(37755)&iwloc=A&hl=en\"> mufon case (37755) map </A>","Tags":"City","trends":["There have been 22 other sightings in Norman","There were 2 other sightings in Norman on or around April 25th 2012"],"Region":"Oklahoma","City":"Norman","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Log Number":"US-04262012-0007","Summary":"In responce to UFO over OU campus, I DID see a strange light, very bright, no sound, near Campus.","Country":"United States","files":["/var/www/straped/mufon/html2text/37755.html.txt","/var/www/straped/mufon/org/37755.html"],"Weather Factors":"Unknown","Longitude":"-97.445266","divs":["sighting detailsthis is mainly in responce to the report of a \"lightless\" object over ou campus around 10pm 4\\25\\2012. i was leaving a well known \"center\" near (within 2 miles) of campus around (guesstimating) 10:20 pm wed nt. i say guesstimating then because i got home at 10:40pm and it's usually a 20 min drive to and from. so it must've been around ~10:20pm or so. unlike what you described, the only reason i even noticed this was because it was so bright and extremely low to me, and seemed awfully quiet and stationary to be an airplane. if it was a star i sure as heck didn't notice it before tonight. anyway, when i pulled out of the parking lot onto the road i didn't notice it anymore, so i kind of wondered where it went or what it was. i didn't really have aliens on my mind then, but i wondered and briefly thought, maybe i saw a ufo. i dismissed it pretty quick and didn't think anything else about it till i got a text from a buddy of mine back home who loves ufo stuff and actually texted me at 1:00am in the morning to ask me if i noticed anything strange (ufo wise) around 10:00 last night out here on campus, then i remembered what i saw. for whatever it's worth ( and i've never been much of believer in this stuff), but for coincidence sake... i will tell you what i saw looked like it was about ~ 2 to 3 football fields in distance northwest from the intersection of hwy 9 at chautauqua in norman around 10:15-:20 ish wed nt 4\\25 in norman ok, and looked a large...almost \"pinkish star (huge star) about ~200 to 400ft above the ground that just seemed to disappear, although i never saw it \"disappear\", i just noticed it was there one second and gone prety quick to be an airplane."],"Disposition":"Unresolved","Object Features":"Undisclosed","Case Number":"37755","Object Shape":"Star-like","Date of the Event":"04/25/2012 10:20 UTC","Date Submitted":"04/26/2012 03:38 UTC","Latitude":"35.207905"}