{"Region":"Oklahoma","Source":"MUFON","divs":["Sighting DetailsApril 25, 2012 I was at Bishops Landing Apts. In Norman, OK, which is directly behind the OU football stadium. It was around ten o clock, and two of my friends and I were having a cigarette outside their front door. This was on the second story of a three story apartment complex, and our view of the sky is quite limited due to an apartment wall in front of us. My friend Haley was the first to point it out, she later told me that she had been watching it for a few seconds already before bringing attention to it. The other friend of mine, Ryan, and I both immediately saw the object once we looked up. It was no more than 75 feet above the roof of the building, not quite directly over our heads but instead at about 80 degrees above the horizon. I only watched it for about ten seconds before was out of my line of sight, but I got a decent look. There were no lights on the object at all, but being so close I could easily make out an outline. It was somewhat boomerang shaped, but a bit thicker in the middle. I could also make out circles on the underside of the craft, probably the where the lights would be if they were turned on. I would guess it to be about 25 feet long, and since I was only able to see the underside of the craft I cant give much detail about the dimensions other than that. It was also moving at a rapid rate of speed, probably a couple hundred miles an hour, but being so low in the sky it looked like it was moving very fast. When I fist saw it, it came at us from SW headed NE. But it made a sharp turn (this was immediately after I looked at it) toward the north and continued that direction. It also made absolutely no noise. There was no noise interference around us at all, the place was dead silent. If there was even a slight hum coming from this object, we would have heard it. I made this report because this was right on campus, this is a very busy area. I am keeping my fingers crossed that other people saw this. I have always been interested in this subject, and I feel incredibly lucky and privileged to have witnessed something like this. There is no doubt in my mind I saw something extraordinary tonight. Keep your eyes on the sky everyone"],"Longitude":"-97.433788","trends":["There have been 22 other sightings in Norman","There were 2 other sightings in Norman on or around April 25th 2012"],"Case Number":"37752","Country":"United States","Date of the Event":"04/25/2012 10:00 UTC","files":["/var/www/straped/mufon/html2text/37752.html.txt","/var/www/straped/mufon/org/37752.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.226607,+-97.433788(37752)&iwloc=A&hl=en\"> mufon case (37752) map </A>","Log Number":"US-04262012-0004","Sighting Duration":"00:00:10","Object Features":"Window(s)","Summary":"UFO with no lights passes over OU campus","City":"Norman","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Date Submitted":"04/26/2012 01:32 UTC","Viewing Distance":"21-100 Feet","Tags":"City","Object Shape":"Boomerang","Latitude":"35.226607"}