{"Longitude":"-94.450045","divs":["Sighting DetailsJust wanted to let you know that there were several sightings over my neighborhood tonight around 9:30-9:45pm. We live in the vicinity of McCoy Park , around 24 highway and Pleasant. Two triangular objects flying fairly low and no sound were side by side, with reddish lights on each corner...then appeared to merge into one and glide off toward Truman Library. Another small white light was seen stopping and starting around the same time, very high up, then an orangish light flew over making no sound. This was witnessed by several in the circle drive.The night before, a huge triangular object drifted overhead at treetop level in the same area, no sound appearing to be grayish. This is the second time in a couple of weeks this neighbor witnessed this object. No lights. About a week ago, my son and I saw a neon colored orange orb moving at a high rate of speed around Crysler and Scott. We pulled over and turned off the car. The object made no sound -flew toward the west and into a cloud and disappeared. About three months ago, I saw the same colored object -only it appeared to just drop straight down out of the sky.As it fell, it slowed down and hovered, looking somewhat like a flame on a gas stove right after it is turned on. Then, it narrowed down to smaller orb, neon orange. It hovered briefly, then began to float away to the south. It hovered again, then turned to the West, entered a cloud and faded. It was also soundless, but this one higher up than the last one we saw. I saw it around 10pm, and called my son out to also see it as it drifted to the West. Please let me know if there have been other sightings lately! I appreciate it. Call me with any further questions."],"Case Number":"37757","files":["/var/www/straped/mufon/html2text/37757.html.txt","/var/www/straped/mufon/org/37757.html"],"Date of the Event":"04/10/2012 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.091738,+-94.450045(37757)&iwloc=A&hl=en\"> mufon case (37757) map </A>","Viewing Distance":"101-500 Feet","Object Shape":"Sphere, Triangle","Sighting Duration":"00:05:00","Object Features":"Other","Tags":"City","Region":"Missouri","Summary":"Several sightings over a period of time","Disposition":"Unresolved","Weather Factors":"Unknown","City":"Independence","Log Number":"US-04262012-0009","Source":"MUFON","Country":"United States","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around April 10th 2012"],"Latitude":"39.091738","Object Flight Path":"Hovering then path","Date Submitted":"04/26/2012 09:19 UTC"}