{"City":"Apple Valley","Latitude":"34.507455","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/37751.html.txt","/var/www/straped/mufon/org/37751.html"],"divs":["sighting detailsi was called outside my storefront by my partner. we watched the multicolored orb (predominantly magenta but also changing varied colors) in the sky for several minutes. it was in the afternoon, and several people were out, but none other observing what i perceived as a very apparent spectacle. we figured if it was close to us (within 1\\2 mile)it must be about the size of a small highschool football field...but if it was closer to the mountains behind it (about 5 miles away), than it was massive. we couldn't discern the distance. something descended from it, the color of white liquid light, then faded out. my partner said he saw a gold like emission spark on the right side i believe, then we both saw it shoot off to the left behind or into the mountains. if it was close to us it was super fast getting to those mountains 5 miles away...like in a second. if it was close to the mountains, it was fast also, but like i already mentioned, would have to have been huge. i didn't have ominous feelings about the object...just curiosity. we met one other person about a month later that also saw it, as she described almost exactly what we viewed."],"trends":["There have been 8 other sightings in Apple Valley","There was one other sighting in Apple Valley on or around June 18th 1993"],"Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"Unknown","Date Submitted":"04/26/2012 01:09 UTC","Summary":"Orb in Sky with teardrop like object descend from it","Object Features":"Unknown","Country":"United States","Longitude":"-117.242595","Case Number":"37751","map":"<A HREF = \"http://maps.google.com/maps?q=34.507455,+-117.242595(37751)&iwloc=A&hl=en\"> mufon case (37751) map </A>","Date of the Event":"06/18/1993 02:40 UTC","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Circle, Disc, Teardrop","Log Number":"US-04262012-0003","Region":"California"}