{"Date of the Event":"04/26/2012 08:50 UTC","Region":"Georgia","divs":["Sighting DetailsI was driving south on Ronald Reagan blvd passing the rock quarry when I glanced up and saw an extremely bright white light hovering in the sky, looked like headlights from a car, then i went to grab my phone so i could take a picture. My phone fell and when i looked back up all the lights were off. I continued driving to try and get closer, and then I noticed two other cars pulled over so I pulled over behind them. I looked up and saw the white lights but this time they did not project like head lights. I also noticed on one side there was a very bright red flashing light while the opposite side had blue-green flashing lights. Within seconds the perfectly round disc shaped object had started moving north and was across the sky. Then in the blink of an eye it shot north and was gone. I felt scared and wanted to cry, at the same time i wanted to know what it was. i tried to keep up with it but it disappeared. My first thought was that this is not a normal air craft. picture included is the bottom view"],"trends":["There have been 14 other sightings in Cumming","There were no other sightings in Cumming on or around April 26th 2012","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Summary":"while driving, i saw an object in sky and pulled over","Latitude":"34.136925","Case Number":"37768","Longitude":"-84.166438","Object Shape":"Circle, Disc","City":"Cumming","Object Flight Path":"Hovering then path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=34.136925,+-84.166438(37768)&iwloc=A&hl=en\"> mufon case (37768) map </A>","Tags":"City","Sighting Duration":"00:03:30","Object Features":"Unknown","Date Submitted":"04/27/2012 12:12 UTC","Log Number":"US-04272012-0001","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/37768.html.txt","/var/www/straped/mufon/more/37768_submitter_file1__IMG197.jpg","/var/www/straped/mufon/org/37768.html"]}