{"Weather Factors":"Unknown","Date of the Event":"04/26/2012 08:20 UTC","Object Features":"Undisclosed","divs":["sighting detailsi was driving west, sun was setting it was about 8:20 pm on 4-26-12 and i thought it was a chem trail but it wasn't getting any longer, so i thought i must be getting glare of my windshield or vehicle so i moved my head around and what i thought was some kind of glare never moved or disappeared. i kept an eye on it and it suddenly tipped it's side closest to me downward and that is when i could see it was an oblong saucer shape. it was glassy giving the appearance of being translucent with a dark tinted ring on top side that looked like a tinted window, a gray metallic edging outlined the outer edges. i had to curve to the south west and the sun was not shinning and i could still see it, then houses blocked my view for about a 1\\4 of a mile and i turned west and it was no longer there, just nothing. this was over saginaw mi i couldn't tell you how big or high up, just it was way below clouds, i am not good at judging distance or size with nothing to compare it to beside it. i am 54 and have never seen an ufo in day light, but have seen strange lights at night and this was amazing i was in awwwww. as soon as i got home i had to call my friends and tell them. i am still in awwwwwwww."],"Date Submitted":"04/26/2012 11:09 UTC","Viewing Distance":"Unknown","Latitude":"43.42544","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Stationary","Summary":"glassy transparent like withgray metalic edging, oblong saucer with band of dark I took to look like a tinted window on skyward top side","map":"<A HREF = \"http://maps.google.com/maps?q=43.42544,+-83.948107(37767)&iwloc=A&hl=en\"> mufon case (37767) map </A>","Object Shape":"Oval, Sphere","Sighting Duration":"Undisclosed","Log Number":"US-04262012-0016","Country":"United States","Longitude":"-83.948107","files":["/var/www/straped/mufon/html2text/37767.html.txt","/var/www/straped/mufon/org/37767.html"],"Region":"Michigan","trends":["There have been 20 other sightings in Saginaw","There were no other sightings in Saginaw on or around April 26th 2012"],"Tags":"City","Case Number":"37767","City":"Saginaw"}