{"Country":"United States","Viewing Distance":"Unknown","Disposition":"Unresolved","Region":"California","Weather Factors":"Unknown","Date Submitted":"01/15/2003 12:00 UTC","trends":["There have been 17 other sightings in Thousand Oaks","There were no other sightings in Thousand Oaks on or around January 15th 2003"],"divs":["sighting detailsone day i was outside looking at the sky. it was moderate temperature, and there wasn't a cloud in the sky. when i was looking down again, i heard a sonic boom. i looked up and saw a plane flying overhead, and dismissed it at that. when i looked down again, what i didn't notice before, was a huge cylindar shaped craft, flying very low seemingly over a school a few houses up the street from where i live. i was glued to the spot, and took in every detail. at first i thought it was a top secret military craft or something of the sort, but the governmet wouldn't fly that over a city. it appeared to be about a block or so long, and about 1\\2 tall and wide. the craft was completely convered in metal with many wires overalping the metal sheets connecting the entire outside of the craft with wires. some parts of it were rusted, and it looked very travel worn. it looked like it was made out of the exact same material as the death star in star wars. i looked for any openings for the pilot, but found none. when it started moving away, i saw that the entire backside was just a huge fan (about 1\\2 block tall and wide, the size of the craft. it seemed to be about 50 feet above the ground. the craft was totaly cylindrical, and it was traveling horizantaly, not vertically. it was moving slowly, taking a few minutes to travel a short distance, but all the while i was hearing a sonic boom, so it must have been traveling very fast. by this time the first plane that i saw was gone, so it couldn't have been that. when it started moving out of my field of vision, i went as fast as i could to the front of the house to see it better. even though it took so long to travel such a short distance, by the time i was at the front it was gone. i could not hear anything for a few seconds at that point. the birds even were not chirping, it was as if the world was on mute. i knew i could still hear because i could hear myself breathing. after a few seconds i was able to hear everything again, and everything seemed back to normal. i am the only person that i know that saw this or something like it."],"Log Number":"US-08272005-0001","Source":"MUFON","Case Number":"3776","files":["/var/www/straped/mufon/html2text/3776.html.txt","/var/www/straped/mufon/org/3776.html"],"Object Features":"Undisclosed","Latitude":"34.170561","Tags":"City","City":"Thousand Oaks","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.170561,+-118.837594(3776)&iwloc=A&hl=en\"> mufon case (3776) map </A>","Object Shape":"Undisclosed","Summary":"Large cylindar, looked worn out, almost like out of Star Wars","Date of the Event":"01/15/2003 12:00 UTC","Object Flight Path":"Undisclosed","Longitude":"-118.837594"}