{"files":["/var/www/straped/mufon/html2text/37769.html.txt","/var/www/straped/mufon/org/37769.html"],"Tags":"City","Case Number":"37769","Object Features":"Other","Country":"United States","Object Flight Path":"Straight-line path","Longitude":"-87.035048","Summary":"Star shaped object emitting a very bright white light moving slow from east to west","map":"<A HREF = \"http://maps.google.com/maps?q=30.640375,+-87.035048(37769)&iwloc=A&hl=en\"> mufon case (37769) map </A>","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Sighting Duration":"00:03:00","Region":"Florida","Source":"MUFON","Disposition":"Unresolved","City":"Milton","Weather Factors":"Unknown","Date of the Event":"04/25/2012 10:00 UTC","Latitude":"30.640375","trends":["There have been 12 other sightings in Milton","There were no other sightings in Milton on or around April 25th 2012"],"Log Number":"US-04272012-0002","divs":["Sighting DetailsMy house is oriented east. I stepped out the front door around 2200, and noticed to the north a \"Star\" shaped object moving from east to west at tree top level from my perspective and line of site. It moved at a slow pace and was very, very bright. I do not know how far away from me it was but I do know that it was nothing close to me. I assume it was a mile or more away. The light was white. There were no flashing lights observed, no sound could be heard and white was the only color of light that the object emitted during the sighting. The object itself was shaped like a star on a christmas tree, not like a star in the sky. The object was well defined with six points and did not appear to rotate or change altitude at any time during the sighting. The object appeared to be larger than the moon as observed in the night sky. The object did not seem to be transparent or see-through. The edges of the object were well defined and appeared to have a solid structure. I observed the object for about three minutes before I lost view of it behind some trees (wooded area). 1. Q: Where were you and what were you doing at the time? A: I was in my front yard letting out the dog when I observed the object. I actually walked out into my front yard and over to the side of the house during the sighting in order to continue viewing it. 2. Q: What made you first notice the object? A: How bright it was. 3. Q: What did you think the object was when you first noticed it? A: It was so bright and beautiful that at first I thought of Jesus. The bright white was very white. It was whiter than any white I have ever seen. 4. Q: Describe the object and its actions and motions in detail. A: Star shaped with 6 points. The entire object was a bright, white light. It moved slowly from east to west in a straight line. I could observe it through the tree tops. The trees are about 50 feet from my house. 5. Describe your feelings, reactions and actions, during and after sighting the object. A: I was in awe. For lack of better words I was \"Star struck\". It was just so beautiful I had never seen anything like it in my life. After the sighting I went in and told my husband about it. 6. Q: How did you lose sight of the object? A: It moved behind some trees in the woods behind my house."],"Date Submitted":"04/27/2012 12:14 UTC"}