{"Tags":"City","Summary":"Triangular lighted object moved, hovered, then departed as seen from car","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/37763.html.txt","/var/www/straped/mufon/org/37763.html"],"Date of the Event":"03/22/2012 04:45 UTC","City":"Huntsville","Log Number":"US-04262012-0014","Case Number":"37763","Object Shape":"Triangle","Latitude":"34.738309","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Region":"Alabama","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-86.583554","trends":["There have been 17 other sightings in Huntsville","There were no other sightings in Huntsville on or around March 22nd 2012"],"Country":"United States","divs":["Sighting DetailsI was driving home from a friend's house at around 4:45 am. I consumed no alchohol or drugs, prescription or illegal before, during, or after the event. As I was turning onto a side street in my home town of Huntsville, Alabama, I spotted a series of lights drifting toward the car. As soon as I could, I stopped the car to observe the object. I rolled down my window, to make sure that it was not a glare from lights or anything else. The object was roughly triangular in shape; I could see some light from the city reflected off of the clouds, and the object appeared as a black triangle. There were four lights: a red light near each corner and a somewhat larger white light in the center. My car was on the CD function, but there appeared to be radio static just before I observed the object. The object drifted to a point slightly to the left and ahead of me, before hovering for a few seconds. Then, the object flew at a somewhat greater speed to my right and behind me. I was not able to see it go over the horizon or depart in any other manner. I then proceeded to go directly home and did not see any further activity. I have never seen any unidentified flying objects before or since, and I do not believe that extraterrestials have visited Earth. I have eliminated the possibility of an airplane or helicopter because the shape of the object was certainly apparent, and there was absolutely no sound from the object. There were no other cars on the road at or near that time. There is an army base, Redstone Arsenal, in this city. There is also a large NASA presence due to the Marshall Spaceflight Center. I am almost certian that this was a military or government vehicle; I doubt that private entities would be able to manufacture this and, again, I do not believe that extraterrestrials can or are visiting Earth."],"Date Submitted":"04/26/2012 08:44 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.738309,+-86.583554(37763)&iwloc=A&hl=en\"> mufon case (37763) map </A>"}