{"Summary":"appeared as a circular disc based on the arrangement of the lights I observed","Case Number":"37773","Object Flight Path":"Straight-line path","Longitude":"-98.269815","trends":["There have been 5 other sightings in Mission","There were no other sightings in Mission on or around March 24th 2012","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=26.292116,+-98.269815(37773)&iwloc=A&hl=en\"> mufon case (37773) map </A>","Disposition":"Unresolved","Region":"Texas","Weather Factors":"Unknown","Country":"United States","Latitude":"26.292116","Object Shape":"Disc","Object Features":"Unknown","Viewing Distance":"Over One Mile","divs":["Sighting DetailsIt was around 9:30 when I noticed a Light to the East at about 30 degrees above the horizon. when I first saw the light it was at around 45 degrees NE and appeared to be moving to the south. I Got my Sony camcorder from my vehicle, which was parked right behind me In the driveway and began recording at 9:29. I then proceeded to film the object for about five minutes or so. I estimate the object was around three miles, approximately from my location. it appeared to be on a steady course to the south as it moved across the sky and did not appear to be changing altitude as it traveled. At first there appeared to be four lights with one of them blinking but as the object moved to the south it began to display more lights. soon there were six lights,two of which were blinking,the color of the lights were blue, white, and green. soon there appeared to be eight lights with two of them blinking. the object continued on its southerly course. at around 9:32 a red blinking light appeared as the most forward light and a third blinking blue light appeared behind it on what looked to be the center of the craft.at this point it appeared as if there were four blinking lights total with the rear lights blinking at a different interval than the red a blue lights at the front of the object. The object was now at about 100 degrees E and still on a southerly flight path. the number of lights visible were still the same. The craft continued on its course to the south and I lost sight of it behind a bank of trees at around 180 degrees. the whole sighting lasted around five minutes.I had just finished parking my vehicle when I felt compelled to look to the north east, if I had not done so I would not have seen this object nor been able to film it. this is not the first sighting of unidentified objects I have experienced, I had submitted a video clip of a UFO sighting to MUFON already from a sighting I had in 2009. I was not excited so much as I was curious about the nature of the object."],"files":["/var/www/straped/mufon/html2text/37773.html.txt","/var/www/straped/mufon/org/37773.html"],"Log Number":"US-04272012-0006","Date of the Event":"03/24/2012 10:30 UTC","City":"Mission","Date Submitted":"04/27/2012 02:10 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City"}