{"divs":["Sighting DetailsMe and my husband were driving home from a family event and I saw an airplane while looking out of my window, or so I thought until I saw like ten more flying with it. I immediately found this strange and turned to talk to my husband who was probably thinking me crazy at this point and when I turned back around to the window one was close enough for me to see. It was square for sure and had white lights on each corner and a red blinking light in the center of the square. I started ti get really scared and so we pulled over next to this field and he got out to see what I was making a big deal about. He got out and after observing them we noticed that they moved very fast and would change direction multiple times by turning on its side so it looked like an actual square outline then flattening again. There were tons. So we got back in the car and started driving again and we noticed as w got closer to our house that they were near there too and we stored to observe again after reaching our destination and they were hovering. We got scared and immediately ran inside and looked out of the window and there were none to be seen."],"Source":"MUFON","Disposition":"Unresolved","Longitude":"-86.420862","Date Submitted":"04/27/2012 01:36 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Object Shape":"Square, Rectagular","Date of the Event":"04/27/2012 12:00 UTC","trends":["There have been 7 other sightings in Martinsville","There were no other sightings in Martinsville on or around April 27th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.41011,+-86.420862(37772)&iwloc=A&hl=en\"> mufon case (37772) map </A>","Sighting Duration":"Undisclosed","Case Number":"37772","files":["/var/www/straped/mufon/html2text/37772.html.txt","/var/www/straped/mufon/org/37772.html"],"Region":"Indiana","Latitude":"39.41011","Summary":"Square flying objects over southern indiana","City":"Martinsville","Log Number":"US-04272012-0005","Tags":"City","Country":"United States"}