{"Date Submitted":"04/27/2012 07:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.164908,+-93.99582(37784)&iwloc=A&hl=en\"> mufon case (37784) map </A>","Date of the Event":"04/26/2012 09:00 UTC","Object Features":"None","Tags":"City","Disposition":"Unresolved","divs":["Sighting DetailsJust before 9pm April 26th, 2012, I had finished doing some yardwork and after I had put everything away, I stood on our deck to briefly survey what I had done that evening. Just before I went into the house, I noticed a bright orange light moving smoothly through the sky. It was coming from the northeast and headed southwest. It grew brighter as it came closer and passed overhead. The object didn't make any sound that I could hear, nor did it pulse or flash. It did have a very slight flicker, like fire would have. The crescent moon was also hanging clear in the sky that night and the object appeared to be about half the size of the crescent of light on the moon (of course, who knows how large it actually was). The object clipped along pretty fast - faster than a satellite or the space station when you see those in the sky. I ran into the house before it passed completely overhead. I grabbed my binoculars and tried to view it from a second story window that faced south, but could make out nothing. My significant other was taking a bath and said it was probably just the space station but I said I thought it was too large. I ran downstairs and outside to the sidewalk on the south side of our house to view the last of the object as it headed to the southwest. I watched it until it got so far away I could not see it. I then went back out onto the deck and noticed a second orange object traveling along the same path as the last one. This one also made no sound but it did have a strange pulsing to it and was slightly different in shape. As it passed overhead, I ran through the house to the south sidewalk to view it. My significant other stood in the second story window and saw this second object as it traveled to the southwest. I also noticed that as the object got farther away from us, I could see that it had maybe 4-5 distinctly separate lights at the rear in a straight up and down line. It too, traveled southwest into the distance and out of sight. That's my story. I hope somebody else saw the lights, too, so I know I'm not crazy!"],"Case Number":"37784","trends":["There have been 18 other sightings in Mankato","There were no other sightings in Mankato on or around April 26th 2012"],"Summary":"Witnessed two bright orange lights traveling in a straight path in the sky overhead around 9pm.","Object Flight Path":"Straight-line path","Log Number":"US-04272012-0017","Object Shape":"Fireball, Oval","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37784.html.txt","/var/www/straped/mufon/org/37784.html"],"Region":"Minnesota","Weather Factors":"Unknown","Longitude":"-93.99582","Source":"MUFON","Viewing Distance":"Unknown","Country":"United States","Latitude":"44.164908","City":"Mankato"}