{"Object Features":"Unknown","City":"Pleasanton","Tags":"City","Source":"MUFON","Latitude":"37.664231","Log Number":"US-04272012-0014","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37781.html.txt","/var/www/straped/mufon/org/37781.html"],"trends":["There have been 5 other sightings in Pleasanton","There were no other sightings in Pleasanton on or around April 26th 2012"],"Summary":"object fel over sunol hilltop down 680s then made right turn disappeared over the hill top.","Object Flight Path":"Path with directional change","divs":["Sighting DetailsThis was my 2nd time seeing something coming or going over this hill top. The first time I saw a really bright light shining over the Sunol hills. The light was so bright that every detail on the top of the ridge was visible and clearly seen from hwy 680. I thought either an airplane was coming over the hill or either maybe va police helicopter was shining light over the ridge. The light was moving forward you could tell, but it was moving extremely to slow to be an airplane. The light was also way too bright and wide to come from an aircraft. The whole ridgeline was lit like a baseball stadium.Then the light moved forward over the hill towards 680.When the object came over the ridge at a very slow pace I could see a round flat shaped craft with lights that went all the way across the front kinda like in a half circle.No sooner than it appearedd over the ridge, it made a right turn and disappeared over the hill and the light was gone. The object I saw last night was in the same area 680 and the Sunol Hillside. It looked like an airplane flying low next to the hillside heading south down 680. It was moving slow. Had bright bright lights in front. Object made its way down the path for maybe 30-40 seconds then made a right turn and began what looked like a descent to the valley on the other side of th hill.While it was turning I could make out a triangle shape with lights under neath but not bright. Couldn't see the whole object kinda only the outline. I drive this hwy almost daily from San Jose to Stockton. I have not seen any major airline fly next to the Sunol hillside on 680 south and also at an altitude barely over the ridgeline.In my whole life. I am now really curious about what's on the other side of that hill, and I will be making a trip to see."],"Region":"California","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-121.873679","Date of the Event":"04/26/2012 11:30 UTC","Date Submitted":"04/27/2012 03:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.664231,+-121.873679(37781)&iwloc=A&hl=en\"> mufon case (37781) map </A>","Country":"United States","Case Number":"37781","Object Shape":"Triangle","Weather Factors":"Unknown"}