{"Date of the Event":"04/27/2012 09:23 UTC","trends":["There have been no other sightings in Flowood","This sighting has never been favorited."],"Weather Factors":"Unknown","Latitude":"32.328392","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/37797.html.txt","/var/www/straped/mufon/org/37797.html"],"Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","Object Features":"Unknown","Log Number":"US-04282012-0002","City":"Flowood","Summary":"multiple glowing amber lights in slight formation crossing highway headed in one direction.. changing positions to each other disappearing floating off into horizon in night sky","Region":"Mississippi","Object Shape":"Circle, Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=32.328392,+-90.122018(37797)&iwloc=A&hl=en\"> mufon case (37797) map </A>","divs":["Sighting Detailscoming home headed east on hwy 25 lakeland drive just outside of jackson ms. suburban area noticed above stop lights ahead some lights well above the horizon that at first glance looked like burst of lights... perhaps fireworks (color of bottle rocket fire). then noticed looking ahead and above that the lights were more of of \"orb like\" but glowing almost like a candlelight color. they did not blink, they didn't flash... just glowed. they were in a slight loosely shaped v-formation as they crossed the highway... but as we moved down highway they seemed to change positions with each other. i asked my father (in vehicle with me) if they were maybe a large number (appx 20 or more that spanned across the highway and extended out on each end) of helicopters?? didnt seem to move fast enough for planes... but he's a retired FAA radar technician and said no... not plane or helicopters... he would know this i'm sure after 35+ years at JAN airport. we were within a few miles of the airport, so i assumed it was some training exercise at first. as we moved down highway slowly, a few cars slowed down to look but no one stopped (busy road) we thought the lights were moving slowly but we rushed to get home and see if they were visible on our farm in the night sky, and they were disappearing so fast we had to pull over on side of road to watch them disappear into the night sky. they all seemed to \"float\" off but rather quickly.... then one last light trailed behind and then was gone. visible for about 5 minutes. if i could describe a reasonable explanation, they looked like very large glowing balloons that were in some weird purposeful formation (perhaps like light glow you would see on large hot air balloons) that changed positions with each other as they continued on their path. but seemed to leave view just too quickly when we pulled over to watch them leave. too fast for balloons,,, but not supersonic etc... too slow for planes.... dad said he's never seen anything like it... he's 75, retired navy radar technician and as i stated, retired FAA airport radar tech. has spent many hours in the tower too. if interested, i can draw the formation and colors of light"],"Longitude":"-90.122018","Case Number":"37797","Date Submitted":"04/28/2012 12:05 UTC"}