{"Case Number":"37790","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsI was lying in bed last night, facing the window, and through my blinds I saw a bright red light. When I opened the window the light was headed north in an arch. It was visable to me for about 45 seconds to 1 minute before it dissapeared over the horizen. At first I thought maybe it was a meteor, or some kind of firework or flare. I called my boyfriend over to the window and he thought it was very strange as well. I've never seen anything like it before and I haven't been able to get my mind off it today, trying to figure out what it was. If I held a baseball up to the light it would cover it, maybe just a bit smaller. Either way it was so far up that it must have been very large! It was a round, red light with red beams or glare coming off. It seemed high up and then slowly arched its way down to the north until I couldn't see it anymore. The object did not skip around, it simply glided through the sky in one smooth motion. I still think this is very strange, and like I said I have never seen anything like this. I'm just hoping maybe someone saw the same thing as us."],"Date Submitted":"04/27/2012 09:59 UTC","Viewing Distance":"Unknown","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around April 26th 2012"],"Date of the Event":"04/26/2012 09:00 UTC","Object Features":"Unknown","Object Flight Path":"Straight-line path","Region":"Colorado","Tags":"City","Log Number":"US-04272012-0022","Sighting Duration":"00:00:45","files":["/var/www/straped/mufon/html2text/37790.html.txt","/var/www/straped/mufon/org/37790.html"],"Disposition":"Unresolved","Longitude":"-104.86393","Object Shape":"Circle, Fireball, Sphere, Star-like","Latitude":"39.685842","Summary":"There was a very large red light in the sky which seemed to fly very quickly in an arched line into the distance.","map":"<A HREF = \"http://maps.google.com/maps?q=39.685842,+-104.86393(37790)&iwloc=A&hl=en\"> mufon case (37790) map </A>","City":"Aurora","Source":"MUFON"}