{"Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37801.html.txt","/var/www/straped/mufon/org/37801.html"],"Disposition":"Unresolved","Latitude":"38.294968","Region":"Indiana","Viewing Distance":"Unknown","Log Number":"US-04282012-0006","Date of the Event":"04/27/2012 11:59 UTC","Country":"United States","Date Submitted":"04/28/2012 02:45 UTC","City":"New Albany","Tags":"City","Longitude":"-85.842336","Case Number":"37801","divs":["Sighting Details around 11:30 pm eastern standard time new albany Indiana. We witnessed a single brite beam of light coming from one side of the moon. The tree line blocked the other direction so I am not sure if it went out the other side. As we looked up again around 12:30 to discuss the beam of light, again, it was gone. We looked up from 11:30 pm for about 10 to 20 minutes every few minutes to look again. We stooped paying attention after the 10 to 20 minutes, figured the moon does this at times and maybe we just never noticed. We looked up again around 12:30 and the beam was gone. Again at around 12:45, looking up to see if it had returned, we noticed something flying very fast. It,s lights blinking much faster than an airplane. My neighbor said he thinks it was a helicopter. As I was disputing his explanation, now everyone is looking, a very bright light from nowhere, moved what seemed and arms length in distance, relatively speaking, the object was far away, than it disappeared as fast as it appeared. Now sure what to make of 3 strange events in one night within about an hours time."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.294968,+-85.842336(37801)&iwloc=A&hl=en\"> mufon case (37801) map </A>","Object Shape":"Circle, Oval","Object Features":"Unknown","Summary":"Beam of light from moon than what we guess was helicopter than what we guessed was something we could not explain but very bright and fast","trends":["There have been 5 other sightings in New Albany","There were no other sightings in New Albany on or around April 27th 2012"]}