{"Object Features":"Unknown","divs":["Sighting DetailsDriving southbound on 360 near six flags, I had noticed a few planes in the sky already. What looked like a very large and bright star appeared within my view while looking down the road and I watched it shoot downwards, coming from the upper atmosphere it seemed like. There was no trail behind it, despite it's considerable size and if it was farther than it appeared than it could be even larger. I could immediately tell it was no airplane, and thought I might be seeing a shooting star or meteor. The object did not break up at all or appear to get smaller, only moving in a downwards direction before disappearing completely well before it even got close to the horizon or any other obstacle that could have blocked my vision. My girlfriend sitting in the passenger seat exclaimed before I did, and we both confirmed we saw the same thing. It appeared as a solid white oval against the night sky and did not fade or shimmer out, just disappearing completely."],"Date of the Event":"04/20/2012 11:07 UTC","Tags":"City","Log Number":"US-04282012-0013","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around April 20th 2012"],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","City":"Arlington","Case Number":"37808","map":"<A HREF = \"http://maps.google.com/maps?q=32.740437,+-97.105966(37808)&iwloc=A&hl=en\"> mufon case (37808) map </A>","Sighting Duration":"Undisclosed","Summary":"appeared to be a large and bright star or meteor falling downwards at extremely high speed, disappeared long before reached horizon","Source":"MUFON","Country":"United States","Date Submitted":"04/28/2012 12:10 UTC","Region":"Texas","files":["/var/www/straped/mufon/html2text/37808.html.txt","/var/www/straped/mufon/org/37808.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Egg, Oval, Sphere, Star-like","Longitude":"-97.105966","Latitude":"32.740437"}