{"Longitude":"-80.85295","divs":["Sighting DetailsI looked out my kitchen window for some reason and to my left in the sky was a large, bright \"headlight\" in the sky. It looked like a headlight from a car.I watched for a while to see any changes because I wanted to see if it was a helicopter. I went outside with my friend who lives with me. We both watched and filmed it with a video recorder. I have a copy and would like to send it for analysis. It looked about the size of an oncoming car headlight. It had no sound. Dogs were barking,but it was unusually quiet. It was very cold that night and we couldn't stay out very long.It appeared to look like a sphere.It looked like it was spinning and would stop and aimed it's light like a big eyeball. That's what I remember most. It reminded me of an eyeball observing. At times it aimed left, then straight ahead. It then \"looked\" right and turned completely away. That's when you could see it's sphere shape. Afterward I felt disturbed and there was alot of static electricity in the air. I felt like I was being watched. We went inside to warm up. We went back out about ten minutes later and it had moved considerably away towards the west."],"Case Number":"3780","Summary":"I saw a large bright \"headlight\" in the sky. I went outside with my friend to film it.","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.905732,+-80.85295(3780)&iwloc=A&hl=en\"> mufon case (3780) map </A>","files":["/var/www/straped/mufon/html2text/3780.html.txt","/var/www/straped/mufon/org/3780.html"],"City":"Salem","Latitude":"40.905732","Country":"United States","trends":["There have been 4 other sightings in Salem","There was one other sighting in Salem on or around December 28th 2003"],"Weather Factors":"Does Not Apply","Log Number":"US-08282005-0003","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Ohio","Tags":"City","Disposition":"IFO","Date of the Event":"12/28/2003 08:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"12/28/2003 08:00 UTC","Sighting Duration":"01:00:00","Source":"MUFON"}