{"Longitude":"-93.933565","Object Flight Path":"Hovering then path","Summary":"saw a star turn off, then a star turn on about where the starboard aft tip would be on a triangle if the other star had been portside,then...","Case Number":"37802","Weather Factors":"Unknown","Tags":"City","Latitude":"36.338227","Object Features":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37802.html.txt","/var/www/straped/mufon/org/37802.html"],"trends":["There have been 16 other sightings in Rogers","There were no other sightings in Rogers on or around April 21st 2012"],"Region":"Arkansas","Source":"MUFON","Log Number":"US-04282012-0007","divs":["Sighting DetailsI, \"savi shankar\", went out with a friend, \"rocketman\", to his 1979 RV pleasantly located near Rocky Branch Marina in Northwest Arkansas. \"Rocketman\" has a friend taking care of the land and the RV, we'll call \"Porterhouse\". The weather was nice and with such we will often spend Saturday out at the RV, full of fishing, friends, and a good campfire. Without much ado, I was looking up at the stars, just kinda staring and noticing how much easier it was to see them now that the city was further away. Looking straight up,I noticed a star slightly brighter than the other three that were around it (i will look up the constellation in a bit). This \"brighter star\" then went out! From outside in, it got dark. Just as it went out another \"brighter than the other stars\" came on! It was located about where one would say the the other corner of a triangle would be. To be more descriptive, the nose or front of the triangle was pointed south, the tail to the north. The eastern corner light went out first, then the western tail light came on. The object was parallel or flat with the ground and these lights were on the bottom of the object. That light came on for about four seconds. I laughed, and said out loud, \"hahaaa, you guys screwed up, i saw you change your lights.\" i thought to myself that if it was the military or perhaps some other foreign entity that surely they could hear me and that i should make fun of them. this seemed perfectly rational and humorous to me at the time (not really giving any credence to their actually being anything over my head.) the object immediately turned off that light and with a very powerful yet powerfully muffled or silenced \"wahooom\", the object shot off to the south... i could see a black jet trail against the black sky, like a darker shadow on top of the dark sky... the trail was only four or five times the length of the object and quickly dissipated. it reminded me of looking at the sun briefly then closing your eyes and you can still see that burn mark or tracer...except this was black on black. Anyway, none of this would be known to anyone other than me if...just a few hours ago, \"rocketman\" and myself just got back from the RV, Friday April 27. \"Porterhouse\" said, that thursday april 26 at approximately 12:00am, he woke up standing, naked, about 65 feet from the RV in a field, looking up and thinking to himself how did i get down. There had been no drinking or other intoxication. he says he feels like it was supposed to be a dream, like he was not supposed to worry about why he woke up there... I can only say that what i saw, i feel was real. i did not share what i saw with anyone until after i heard \"porterhouse's\" story. The three of us jokingly figure it must be military espionage or manchurian candidate type implant because \"porterhouse\" has recently been employed by a senator from another state whom owns rental properties in the area. \"porterhouse\" says he does not notice anything different but does feel really weird about his memory not working appropriately for that one evening. Also, as an aside,he witnessed a bright white hypersonic craft while in the military, out at sea..he refused to sign the report of the incident for fear of losing his career, there were other witnesses to that incident. This is my first report, and, the first thing i've seen. What i saw really was right out of the x-files, and i'm gonna be really pissed if \"porterhouse\" ends up pregnant!!! after we get done laughing of course."],"Date Submitted":"04/28/2012 03:59 UTC","Date of the Event":"04/21/2012 12:00 UTC","Object Shape":"Triangle","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.338227,+-93.933565(37802)&iwloc=A&hl=en\"> mufon case (37802) map </A>","City":"Rogers","Viewing Distance":"501 Feet - 1 Mile"}