{"Disposition":"Unresolved","City":"Undisclosed","Region":"Oklahoma","Date of the Event":"04/26/2012 10:20 UTC","Viewing Distance":"20 Feet or Less, 21-100 Feet","Longitude":"-97.086917","files":["/var/www/straped/mufon/html2text/37809.html.txt","/var/www/straped/mufon/org/37809.html"],"Log Number":"US-04282012-0014","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was sitting in the back yard at a table when I noticed the table top light up like the moon had suddenly gotten very bright. I looked up & it was directly over head flying very low. There were clouds in the sky & it was flying below the clouds. It looked like a ball of light about the size of a softball, that was shimmering with light. The light was yellowish orange to begin with but as it flew past very slowly, the light changed to red & then back to yellowish orange & off white. I grabbed my cell phone & took a video but I was so excited I couldn't get to the camcorder part of my phone quick enough & by the time I got the video started the UFO had moved on past me a bit. Being that I don't have a very high tech phone, the video is not the greatest but you can see what I saw on it. You can see it better by viewing it full screen. I have never seen anything like this before & have no reference for it was other than it had to have been a UFO! I read on your website that someone from the OU campus had seen this on the same night. That is interesting because I am straight North & a little bit West of OU about 15 miles. I'm sure they saw what I saw because it was coming to me from that direction & kept traveling North West. What they described was pretty much the same thing that I saw. In the video it looks like it was bobbing around but it was not. The bobbing is from me trying to keep it on the thing as it left the area. I was too excited & a bit freaked out by it."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.016852,+-97.086917(37809)&iwloc=A&hl=en\"> mufon case (37809) map </A>","Object Shape":"Sphere, Star-like","Case Number":"37809","Tags":"City","Country":"United States","Summary":"Ball of bright shimmering light flew slowly over head very low to ground from SE to NW.","Object Features":"Undisclosed","Date Submitted":"04/28/2012 12:49 UTC","Latitude":"35.016852","Weather Factors":"Unknown","trends":[""]}