{"City":"Columbus","Summary":"Observed slow moving UFO with pulsing lights moving at tree line","Case Number":"37805","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Country":"United States","Longitude":"-83.067684","Date Submitted":"04/28/2012 10:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.114607,+-83.067684(37805)&iwloc=A&hl=en\"> mufon case (37805) map </A>","files":["/var/www/straped/mufon/html2text/37805.html.txt","/var/www/straped/mufon/org/37805.html"],"divs":["Sighting DetailsI live between Dublin and Worthington just north of the Outerbelt in Columbus. I was smoking on my porch and I saw this thing going by my house about 300-400 feet away. I saw it going through trees and over houses, it looked like it was about 50 feet up. I thought it was a plane at first because of the lights (Red on side towards me blue on the other and white lights on fore and aft). The lights struck me as very odd... They flashed like airplane lights but very slowly. They faded in and out at the same one second intervals (Red and blue. The white lights stayed consistently on). It moved pretty slowly too, close to a lazy helicopter speed. The lights and the fact that it made no sound at all struck me as very odd. My house faces south, and I was looking southeast when I saw it. I tracked it visually until it was blocked by neighboring houses and trees. It seemed to be heading north. I don't know what it was, it flew like I would have expected a normal aircraft to fly (No crazy speed or turns) but the lights on it were very wrong. Was it trying to look like normal aircraft traffic that goes over this area a lot? I have been taking my camera out to smoke with me and actually had it with me at the time, but I couldn't convince myself that I was looking at anything other than a wierd airplane (because of the familiar light pattern). I won't make that mistake again! I have seen multiple odd things in this area, mostly towards Hilliard and Dublin. Everything I see is either heading directly into downtown Columbus or heading north north-east towards Powell. In the last two months I have seen an orange ball flying west to east directly towards downtown and a silver shiny disk flying west to east out of the city towards Hilliard."],"Region":"Ohio","Object Shape":"Disc","Log Number":"US-04282012-0010","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around April 8th 2012"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Date of the Event":"04/08/2012 09:00 UTC","Tags":"City","Latitude":"40.114607"}