{"divs":["Sighting DetailsMyself and four of my close friends were hanging outside in the driveway around 10pm in Merritt Island, FL. My boyfriend then shouted \"UFO!\" Not taking him seriously we all laughed but quickly looked in the direction he was pointing. To everyones amazement there was a light moving across the sky. We waited for the blinking lights to prove it was a plane or helicopter. No blinking lights ever came. It was the same steady solid white light. The object still slowing moved in the same direction, east. We knew for how far in the sky the object was it was moving faster than any plane we have ever seen. So we then start to say \"It must be a satellite or slow shooting star. As we all have seen both before. The moving object then quickly changed direction jumping across the sky. Then went back in same direction and disappered. At that point there is NO way it was a satellite or shooting star. It changed direction. Stars, planes, helicopters, and satellites do not act in this way. Like I said this was witnessed by myself and four other adults. I felt strongly enough to report this. I should also say we live only minutes away from NASA and PAFB. What we saw was almost directly over the area of NASA."],"Latitude":"28.384463","files":["/var/www/straped/mufon/html2text/37814.html.txt","/var/www/straped/mufon/org/37814.html"],"Tags":"City","Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unresolved","Object Features":"Unknown","trends":["There have been 3 other sightings in Merritt Island","There were no other sightings in Merritt Island on or around April 27th 2012"],"Log Number":"US-04282012-0019","Object Flight Path":"Path with directional change","Summary":"Was standing outside with four other people. Saw what looked like a star moving acorss the sky. All five of us witnessed this moving across the sky. It then changed direction twice and then disappered.","Sighting Duration":"Undisclosed","City":"Merritt Island","Object Shape":"Star-like","Case Number":"37814","Date Submitted":"04/28/2012 07:20 UTC","Date of the Event":"04/27/2012 10:15 UTC","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.384463,+-80.709126(37814)&iwloc=A&hl=en\"> mufon case (37814) map </A>","Source":"MUFON","Longitude":"-80.709126","Weather Factors":"Unknown"}