{"Disposition":"Unresolved","Source":"MUFON","City":"Belen (Tierra Grande)","Date of the Event":"08/15/2011 09:30 UTC","Region":"New Mexico","Latitude":"34.97585","Object Features":"Unknown","Summary":"Locking my gate and saw lights in sky start to turn on and of towards S/E they stoped. Then other lights started doing same more to the West of others. Did that a few cycles and stoped.As if signaling?No Noise at all. Lights varied in strength.Very dark .","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.97585,+-105.022614(37818)&iwloc=A&hl=en\"> mufon case (37818) map </A>","Longitude":"-105.022614","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","divs":["sighting detailscame home between nine and ten pm. drove into property and left car to lock front gate. gate faces the mountains looking east.it is very dark here about mag. 7-7.5 skies. also you can hear the bubbles in a soda can from about 3 feet away, that is how quiet it is here! i heard nothing at all but my side vision picked up light bright enough for me to look to my side (south\\east) i saw a series of lights start to cycle on and off they seemed to be yellow\\orange in color and cycled rather fast. they were high enough in the sky to look higher then the distant mountains!i could not tell how far away or how high they actualy were. these were closer to the east. then a second after they stoped a series of other lights farther to the west did the same thing. there seemed to be some distance between them or like a very big gap. after they stoped the lights to their east started flashing again. then once more the other set of lights cycled on and off again. they did this i believe about three times. each of the lights in both groups looked to have a good space between each other. the all seemed to be at about the same level in the sky and i would guess by the distance between the two groups that they were seperated by at least mayby a half mile. hard to really say as all i could see was the lights flashing and watched for about 10 min. after they stoped and could not see any object\\objects in the sky and heard no sound at all. it's very dark here and also very quiet. you can hear a car coming down the road at least a mile away! very few house lights.i came outside a bit later after going into the house to let out the dogs and watched for a while. never saw them again. i know the area (sky, mountains, etc) very well in the daytime and there is nothing but empty space and sky in the direction that i observed the lights. not to sound like a nut, but it was very simular almost to the scene in close encounters! thank's."],"files":["/var/www/straped/mufon/html2text/37818.html.txt","/var/www/straped/mufon/org/37818.html"],"Weather Factors":"Unknown","Case Number":"37818","Log Number":"US-04282012-0023","Viewing Distance":"Unknown","trends":["There have been no other sightings in Belen (Tierra Grande)","This sighting has never been favorited."],"Date Submitted":"04/28/2012 09:09 UTC","Object Shape":"Flash, Sphere"}