{"Object Shape":"Cigar","Longitude":"-84.64296","Latitude":"39.159746","Object Features":"Window(s), Appendage(s), Other","Log Number":"US-04282012-0016","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around November 15th 1977"],"Viewing Distance":"101-500 Feet","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=39.159746,+-84.64296(37811)&iwloc=A&hl=en\"> mufon case (37811) map </A>","Country":"United States","Summary":"Cigar shape, no wings with conical tail gear. Size of commercial air-liner.","City":"Cincinnati","files":["/var/www/straped/mufon/html2text/37811.html.txt","/var/www/straped/mufon/org/37811.html"],"Date Submitted":"04/28/2012 02:37 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["sighting detailsi was driving home from work (second shift off at 11 ish) and with few cars on the road i happened to look up out of the windshield of my auto and saw what looked like a commercial aircraft zoo close to the ground i thought it was gonna crash. i stopped my car when i realized that it was simply hovering in place then pulled into the parking \\ play lot of the grade school, turned off my engine and got out to look up at it. i was a grey cigar shaped craft and i was struck that it didn't have wings and it occurred to me that it was not possible for something so large and no sound to just hang there over head. i stood under it looking up for a few minutes and it slowly began moving in a lazy movement and turned on a dime a one point. i was not fearful but amazed at this. it moved less than 1 mph away from me and i watched it till it went past the roof tops of the neighborhood houses. i got back in my car and drove home. this happened in cincinnati, ohio in front of a catholic grade school, st. aloysius gonzaga on the west side of cincinnati. 4390 bridgetown road, 45211 this is not the only unexplained object i have see and will be happy to share all as long as it is taken serious."],"Tags":"City","Case Number":"37811","Date of the Event":"11/15/1977 12:00 UTC"}