{"Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"04/28/2012 08:03 UTC","City":"Athens","Log Number":"GR-04282012-0020","map":"<A HREF = \"http://maps.google.com/maps?q=37.982386,+23.74199(37815)&iwloc=A&hl=en\"> mufon case (37815) map </A>","Object Shape":"Sphere","Country":"Greece","Summary":"APPROX 12-15 SPHERICAL OBJECTS MOVING FAST AND OCCASSIONALLY HOVERING IN AN ALMOST STEADY FORMATION . METALLIC AT PRETY HIGH ALTITUDE(500-1000 ft) FOR APRX 20 MINS. THEN FADED AWAY.","divs":["Sighting DetailsWe (my daughter, two friends and myself) saw in the horizon (North) something glittering. The sky was very clear, no clouds at all. The glittering effect kept on for some time, enough to make us interested to start observing the sight. Gradually a group of spherical objects was clearly approaching moving South-SouthEast at an apparently high speed, in a parabolic line , giving the impression that they occassionally hovered. The observation was very clear and kept for at least 20 mins. For some moments they were close enough to be counted (by all four of us) to be 12. They followed a very smouth pattern and moved at an almost unchanged formation. People passing by got also interested and at a point there must have been at least 20-25 people stirring at the sky watching the objects. They were NOT a bunch of mettalic Helium baloons got loose, nevertheless one could have mistaken them for such had they not been travelling so fast and being so large. Actual size of objects cannot be estimated, but they were clearly viewed to be spherical and mettalic, 12 in number and travelling at an altitude of apro 500-1000feet. In the twenty minuted that they were being viewed they must have travelled a distance of at least 200-250 miles, as they appeared on North side of the horizon and faded away towards the South-SouthEast having passed directly above us. The observation spot was an elevated hill close to the sea so the perimetrical horizon was extended.Thanks!"],"Weather Factors":"Unknown","Tags":"City","trends":["There have been 6 other sightings in Athens","There were no other sightings in Athens on or around May 18th 2011"],"Object Features":"Undisclosed","Source":"MUFON","Date of the Event":"05/18/2011 12:00 UTC","Latitude":"37.982386","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Longitude":"23.74199","files":["/var/www/straped/mufon/html2text/37815.html.txt","/var/www/straped/mufon/org/37815.html"],"Region":"Attica","Disposition":"Unresolved","Case Number":"37815"}