{"Object Flight Path":"N/A","Date of the Event":"05/05/1984 03:04 UTC","Tags":"City","Object Features":"Other","Log Number":"US-04282012-0021","trends":["There have been 2 other sightings in Steubenville","There were no other sightings in Steubenville on or around May 5th 1984"],"Region":"Ohio","Summary":"I have a picture of an Entity standing against a house that seems to be an Ailen hiding","Case Number":"37816","map":"<A HREF = \"http://maps.google.com/maps?q=40.390729,+-80.654603(37816)&iwloc=A&hl=en\"> mufon case (37816) map </A>","Latitude":"40.390729","Disposition":"Unresolved","Longitude":"-80.654603","Weather Factors":"Unknown","Object Shape":"Unknown","City":"Steubenville","Viewing Distance":"N/A","Country":"United States","divs":["Sighting DetailsI have a picture of my Aunts house, along the side of the house is the outline of a being that is about 4ft tall with long black eyes and is very thin. He looks clear, almost like you would be able to see through him. He has very long thin arms and what looks like bony black hands. You can see him better when the picture is blown up bigger, because it seems he is trying to keep from being seen by standing flush against the side of the house. I have had this picture looked @ by many people and they all say they can see the outline of a \"little creature\" but that \"it's not an Alien\" I would like you to see the picture and tell me what you think. I truly believe I have a picture of an Alien, and if so! It would be the only one, and the first REAL PROOF they are real. I have even taken the picture to NASA in Cleveland, Ohio and they looked @ the picture, put me into a small room and told me to wait. After about a half hour, two men came in and told me I needed to give them my picture,they said they would take a better look @ it and then give me a call back. When I did not want to give them my picture, they wanted me to go with them into another room, I told them I needed to \"use the lady's room\" and I left! They did not seem very happy with the fact that I would not give them my picture, and they creeped me out. I think my picture is worth taking a look @ and I hope you also think so. Please let me know if you would like to send a field rep out to have a look. Thanks much."],"Sighting Duration":"01:01:00","Source":"MUFON","files":["/var/www/straped/mufon/html2text/37816.html.txt","/var/www/straped/mufon/org/37816.html"],"Date Submitted":"04/28/2012 08:17 UTC"}