{"Disposition":"Unresolved","City":"Fort Indiantown Gap","Region":"Pennsylvania","Country":"United States","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving down the road in Ft. Indiantown Gap, PA on my way to my Grandparents house in Pine Grove, PA and out of the corner of my eye I caught the lights in the sky flashing from red to white. At first, I thought that they had put up radio or cell towers but then the lights started to move. They started off slowly and they shot off one by one to the right and then came back to the left. They got closer and then retreated. They would disappear and reappear. By this time, I had stopped my car on the back road that I was traveling on and got my camera out that I carry with me all the time to take pictures of my 3 year old and family. I got a few pictures and took a video of the lights that I saw. The whole ordeal lasted about 20 minutes total before the lights disappeared for the last time. This was my 2nd sighting of strange lights in the sky. The first sighting I was a young teenager and the lights that I saw then were comet like and bright and flew in a circular pattern almost like it was spinning and then would fly in a line. These lights had a tail like a comet though. Not like the lights that I saw tonight."],"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Fort Indiantown Gap","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.439811,+-76.598299(37819)&iwloc=A&hl=en\"> mufon case (37819) map </A>","Case Number":"37819","files":["/var/www/straped/mufon/html2text/37819.html.txt","/var/www/straped/mufon/org/37819.html"],"Object Features":"Unknown","Log Number":"US-04282012-0024","Date Submitted":"04/28/2012 09:25 UTC","Latitude":"40.439811","Tags":"City","Date of the Event":"04/28/2012 08:40 UTC","Longitude":"-76.598299","Summary":"5 lights flying in strange formation"}