{"Disposition":"Unresolved","Object Features":"None","Date Submitted":"04/29/2012 09:49 UTC","City":"Imperial Valley","Summary":"Not airrplane, Not ISS, Not obvious what it was, but did a 90 degree turn","Tags":"City","Object Shape":"Star-like","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Case Number":"37825","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"02/17/2012 07:11 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.787331,+-119.408332(37825)&iwloc=A&hl=en\"> mufon case (37825) map </A>","Log Number":"US-04292012-0003","Region":"California","Longitude":"-119.408332","Source":"MUFON","trends":["There have been no other sightings in Imperial Valley","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/37825.html.txt","/var/www/straped/mufon/org/37825.html"],"divs":["sighting detailsi was sitting in my recliner watching tv and facing a bay window with a view to the west. i first noticed the object as a bright light to the wnw and very low on the horizon. i am located at the foot of the peak of the chocolate mountains, so i was looking in the direction of pine mountain? it would be south of palm springs at least 15 or more miles where the object came into view of the mountains. it was clear over the imperial valley, but there were clouds over the pacific ocean and maybe the coast. when i first saw the object, i thought aircraft out of lax, but immediately realized it was too late in the evening to see reflected light from a plane, so assumed it was the iss, which we looked for once in a while, but had never seen. so i called my wife as i watched the object move up into the night sky, thinking it was the iss, which i knew would be high enough to reflect sunlight through the clouds (redish). she went to the front door next to where my chair is located and went out side. i asked if she could see it and she said she did. i lost sight of the object as it passed above my sun shutters above that window, so i also went to the door to see it. as i aproached the door i noted my wife was standing almost in the door on the porch, but under the overhanging area above the porch. she was watching the object now moving towards the wsw towards the horizon. it had changed direction (she did not see it change, nor did i)between the time she got to the door and the time it had moved above the sun shutters. except for the time when it was above the roof of my room, i had a direct view of the object for about 3-4 minutes at the most. it was quiet outside that night (i'm in the desert) and there was no noise from the object. i inquired of several other residents of the resort to see if anyone else had observed the light. one person unknown to me mentioned a light moving to the west to a friend of mine who was in going into the hot tubs. this man was already in the hot tubs and from that position would have an unobstructed view of about 180 degrees. his description of the object to my friend was a bright orange\\red light moving to the west very fast, but without the usual tail made by a meteor. the object: size: venus was in the western sky at about two slats up on the sun shade (i could see it through the slats) and the object was at least four to five times the diameter of venus. i can send pictures of the inside looking out, the tubs, etc. if you want. these would just be to set the descriptions, not views of the object. i should have had my wife bring the camera, but the object was not there that long."],"Latitude":"36.787331"}