{"Summary":"bright orange light, slow moving, hovered, wobbled, shrank then vanished, reappeared closer coming twd us, changed direction, vanished","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/37827.html.txt","/var/www/straped/mufon/org/37827.html"],"Date Submitted":"04/29/2012 01:39 UTC","Disposition":"Unresolved","Date of the Event":"04/28/2012 10:20 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.330478,+-122.703027(37827)&iwloc=A&hl=en\"> mufon case (37827) map </A>","City":"Cotati","Tags":"City","Object Features":"Unknown","Object Shape":"Sphere","trends":["There has been one other sighting in Cotati","There were no other sightings in Cotati on or around April 28th 2012"],"Latitude":"38.330478","Log Number":"US-04292012-0005","divs":["Sighting DetailsArrived home at 10:20 pm PST, walking from car to house, whole family looked up and saw slow moving very bright orange light, bigger and brighter than any visible star or planet. At first suspected it was a satellite, but it was too low and it's speed was not consistent. Seemed to hover, move along, hover. It was low enough to be heard if it was an airplane or helicopter, yet there was no sound coming from it. Followed it visually for a couple of minutes, went in the house, came back out about 3 minutes later, object was still in the same area last seen minutes before. Kept watching it as we walked across the street to the park. Moved slowly across the sky, hovered, seemed to shrink quickly then vanish. Less than a minute later another, or maybe the same, orange light reappeared much closer and lower on the horizon, coming toward us, stopped, hovered, wobbled, changed direction, shrank and vanished. Waited severeal minutes, nothing appeared. Again, there was no sound."],"Region":"California","Case Number":"37827","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-122.703027","Viewing Distance":"Unknown"}