{"Case Number":"37820","divs":["sighting detailsit was dark at 3 am.i slept in my house on st. martin with a panoramic view of the sea. i was awaken by a gong-like sound ,metallic resonance.it was a big copper plate hanging on the cement wall put in motion by something.the copper plate was bouncing of the wall and making laud sound. when i got up and looked through the french door towards the sea i saw a bright glowing orange oval 100feet wide sitting on small uninhabited island(pinel)just offshore of st.martin. i did not know what it was, but i was curious .so, i was staring at it trying to figure out what it was. i was mesmerized. i did not believed in ufo`s then. finally i realized that this has to be ufo & i panicked .i got very scared. i ran to the other end of a big house to talk to someone.when i looked through the window of the other room, the oval was gone,but above the island was unusual low hanging white cloud with light shining from underneath of it. there was no other clouds in the sky.it was a clear caribbean night. when i told about it to some friends there, they said several of their friends saw ufos on st. martin\\st.maarten. i made a drawing of the object and the following night i had a dream about the object and its \"structure\" & i made a drawing of it also."],"Date Submitted":"04/28/2012 09:28 UTC","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-33.079531,+-68.461454(37820)&iwloc=A&hl=en\"> mufon case (37820) map </A>","Longitude":"-68.461454","Summary":"I saw a stationary UFO, glowing , orange oval at night on St. Martin 1995","Disposition":"Unresolved","Latitude":"-33.079531","Log Number":"AN-04282012-0025","Tags":"City","City":"San MartÃƒÂ­n","Sighting Duration":"Undisclosed","Region":"Mendoza","Object Flight Path":"Stationary","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/37820.html.txt","/var/www/straped/mufon/org/37820.html"],"Country":"Argentina","Date of the Event":"11/25/1995 03:00 UTC","trends":["There have been no other sightings in San Martín","This sighting has never been favorited."],"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}