{"Date Submitted":"04/28/2012 11:44 UTC","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/37822.html.txt","/var/www/straped/mufon/org/37822.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","City":"Allentown","divs":["Sighting DetailsI was in my backyard with the dogs listening to my neighbors argue. My girlfriend was getting out of her car,when i looked over my right shoulder and saw what I thought was an ember floating about 50 feet away from me. Then I realized it was farther away from me and not a piece of floating paper bag or something. I started yelling at my girl to run over and look at it. She saw it also. At first it looked like it was floating then it moved in a straight line, stopped for a half second and proceed to move away from us going east towards Bethlehem. It looked like fire on top, but no distinct flames. When it moved away from us, I could vaguely see 3 prongs..appendages ...whatever's coming out from the bottom . It got farther away and went behind a tree that's about 80 feet tall. I can't say exactly how far away it was or how big. I didn't have shoes on, otherwise I would have ran down my alley to see it maybe a little longer. I ran inside my house to get my shoes. When I came out, my girlfriend had already walked out front of the house to see if she could see it still. It was gone by then. I NEVER believed in UFOs. I don't have any explanation for what I saw tonight. I also posted it on Facebook hoping someone else had seen it. I'm just glad my girlfriend saw it too."],"Object Features":"Appendage(s)","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Log Number":"US-04282012-0027","map":"<A HREF = \"http://maps.google.com/maps?q=40.61178,+-75.487213(37822)&iwloc=A&hl=en\"> mufon case (37822) map </A>","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around April 28th 2012"],"Longitude":"-75.487213","Case Number":"37822","Tags":"City","Source":"MUFON","Latitude":"40.61178","Region":"Pennsylvania","Date of the Event":"04/28/2012 10:00 UTC","Sighting Duration":"Undisclosed","Summary":"A paper bag on fire.","Object Shape":"Fireball"}