{"Viewing Distance":"Unknown","Summary":"Large Bright Rectangle Light moving Fast","Date Submitted":"04/29/2012 05:49 UTC","Tags":"City","Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path,Path with directional change","Region":"California","divs":["sighting details(1. where were you and what were you doing at the time?) stargazing (2. what made you first notice the object?) speed of movement, odd shape (3. what did you think the object was when you first noticed it?) aircraft, but all other aircraft in sky were blinking. similar to a satellite. but much larger and brighter. (4. describe the object and its actions and motions in detail.) first sighted about 30 degrees above horizon in south. moved quickly across sky toward us, approx north. only white rectangular light visible. appeared much too big (size at closest point was that of a 3\\8 inch object at about arm's length) and moved too quickly to be very high up but there was no sound. changed direction twice, second time to resume original course. report titled: \"bright orange light, slow moving, hovered, wobbled, shrank then vanished, reappeared closer coming twd us, changed direction, vanished\" on same date in ca, us is very similar. photo imag3540.jpg is just about what we saw minus the second light to the lower right. (5. describe your feelings, reactions and actions, during and after sighting the object.) calm observation, surprise (6. how did you lose sight of the object?) quickly vanished, not like it was too far away (it was still rather large at the time) about 30 degrees above horizon."],"Case Number":"37831","Country":"United States","trends":["There has been one other sighting in Valley Center","There were no other sightings in Valley Center on or around April 28th 2012"],"files":["/var/www/straped/mufon/html2text/37831.html.txt","/var/www/straped/mufon/org/37831.html"],"Disposition":"Unresolved","Longitude":"-117.034197","Log Number":"US-04292012-0009","Latitude":"33.21837","map":"<A HREF = \"http://maps.google.com/maps?q=33.21837,+-117.034197(37831)&iwloc=A&hl=en\"> mufon case (37831) map </A>","Weather Factors":"Unknown","Object Features":"None","Object Shape":"Square, Rectagular","City":"Valley Center","Source":"MUFON","Date of the Event":"04/28/2012 10:00 UTC"}