{"Date of the Event":"04/29/2012 07:30 UTC","Viewing Distance":"Unknown","Source":"MUFON","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around April 29th 2012"],"Region":"New York","City":"New York","Date Submitted":"04/30/2012 03:43 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37839.html.txt","/var/www/straped/mufon/org/37839.html"],"Weather Factors":"Unknown","Country":"United States","Case Number":"37839","map":"<A HREF = \"http://maps.google.com/maps?q=40.832354,+-73.855429(37839)&iwloc=A&hl=en\"> mufon case (37839) map </A>","Object Shape":"Sphere, Star-like","divs":["Sighting DetailsI am frightened as this is not the only time I have seen this object, I have seen it several times over the last2-3 years. It appears to be a large round silver bright object that descends from the sky, as if peeking through clouds. About 7:30 pm, on April 29, 2012. I was about to go to sleep, I live on the fifth floor of a walk up and the view is clear of the evening sky. I noticed, as always about this time, military jets making fly overs from on all directions. There it was a large white ball descending from the clouds, It was bright as a star, it stood there a few seconds and ascended. In a few minutes military jets (and now what appears to be civilian) planes sweeping the very spot where this object appeared.I was looking from my apartment window and have a clear view of the sky.I was scared as I knew I had seen this ball of light several times in the last several years. The object descending, and I saw it as clear as day as the sun had not completely set yet. It is for sure something that, what I felt is not from here. And then I see the military jets fly to the exact location where this object showed it self. It has a pattern, It round, its a ball of light, it descends, and for a few seconds, it ascends. It just then disappeared."],"Object Features":"None","Object Flight Path":"Stationary,Other","Log Number":"US-04302012-0002","Longitude":"-73.855429","Latitude":"40.832354","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Round ball of white light descends and ascends back into the sky"}