{"trends":["There have been 22 other sightings in Norman","There were no other sightings in Norman on or around March 24th 2012"],"Object Shape":"Disc","Tags":"City","Disposition":"Unresolved","Case Number":"37834","Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"Oklahoma","files":["/var/www/straped/mufon/html2text/37834.html.txt","/var/www/straped/mufon/org/37834.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.214438,+-97.444196(37834)&iwloc=A&hl=en\"> mufon case (37834) map </A>","Date of the Event":"03/24/2012 11:15 UTC","Date Submitted":"04/29/2012 10:44 UTC","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Summary":"It was shaped like a donut, and had yellow-orange lights all over it, which were flashing in an odd pattern.","Object Features":"Unknown","divs":["Sighting DetailsThe sighting took place at 11:15 PM, this evening (March 24, 2012) in front of my apartment in Norman, OK. The object we saw was traveling from south to north. When we first noticed it, it was directly overhead and appeared to be about the size of a dime held at arm's length. It was shaped like a donut, and had yellow-orange lights all over it, which were flashing in an odd pattern. In fact, the object seemed to be expanding and contracting slightly. It was plainly visible in spite of the \"light pollution\" in the area, and we could detect no sound. When it was at its closest, we got a good enough look to be sure that it was not an ordinary airplane or astronomical object. It seemed to gain altitude as it moved north, and I watched it until it was no longer visible. It was heading in the general direction of Oklahoma City. Actually, we could not see the body to which the lights were attached. I say \"donut\" because there was a dark spot in the middle. I could not judge size or altitude, so I can't make a guess as to speed. My first thought was that it might be something attached to a blimp or advertising plane, but a) it was pretty late at night for that, and b) it was moving much too fast for a blimp."],"Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-04292012-0012","Longitude":"-97.444196","Latitude":"35.214438","City":"Norman"}