{"Date of the Event":"04/27/2012 10:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.419752,+-112.298729(37830)&iwloc=A&hl=en\"> mufon case (37830) map </A>","Object Shape":"Boomerang, Unknown","Country":"United States","Longitude":"-112.298729","Sighting Duration":"00:01:10","Object Flight Path":"Path with directional change","divs":["Sighting DetailsSitting outside on my patio, I was quietly enjoying my morning while sipping on a coffee at 10:50 am. I looked up at the sky as I always do, and by chance, spotted bright flying objects. In utter disbelief at the peculiar site in the sky I thought to myself that there was no way they could be birds. I then ran into the house and got my camera and was able to take four pictures before they disappeared just as quickly as they appeared. At 50 years of age I have never seen anything like this in my life and had this feeling that this could very well be UFO'S as they came in and out of the atmosphere in such a short course of time. What is even more perplexing is the fact that I was witness to this potential sighting during daytime. Another thing to note is when I cropped these objects they look like winged crafts. I am hoping one day I will see more, I am always looking to the sky. I know they are not birds as birds do not fly that high and just disapear. They look like they have head lights on them. What is this mystery? You be the judge."],"Log Number":"US-04292012-0008","Weather Factors":"Unknown","Latitude":"33.419752","City":"Avondale","Region":"Arizona","files":["/var/www/straped/mufon/html2text/37830.html.txt","/var/www/straped/mufon/more/37830_submitter_file1__AprilArizona2012133.JPG","/var/www/straped/mufon/more/37830_submitter_file2__AprilArizona2012134.JPG","/var/www/straped/mufon/more/37830_submitter_file3__AprilArizona2012135.JPG","/var/www/straped/mufon/org/37830.html"],"Date Submitted":"04/29/2012 05:40 UTC","trends":["There have been 5 other sightings in Avondale","There were no other sightings in Avondale on or around April 27th 2012","This sighting has never been favorited.",""],"Case Number":"37830","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","Disposition":"Unresolved","Object Features":"Patterned Surface","Summary":"appeared from nowere then flew around in the sky then disappeared"}