{"Weather Factors":"Unknown","Log Number":"US-04302012-0009","Sighting Duration":"Undisclosed","Country":"United States","City":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.319491,+-86.894218(37848)&iwloc=A&hl=en\"> mufon case (37848) map </A>","Case Number":"37848","Date Submitted":"04/30/2012 03:07 UTC","divs":["Sighting DetailsSitting in my backyard drinking coffee, away from city lights, in the country, shortly before dawn. Approximately 4:30 AM observed what I believed to be a fast-moving satellite almost directly overhead. Quite high altitude, higher than any plane I have ever seen. No blinking, no noise and moving from the NW to the SE. Quite surprised about 30 sec later when two more, seperated somewhat but moving inline - in the same direction but offset somewhat from the path of the first. Perhaps 1 min later, as I was contemplating how unusual this was, when another followed the first three (pursuit?). Some wispy clouds, not many and not thick, but they appeared to travel from horizon to horizon. I lost sight of them behind wispy clouds. To my best knowledge there is only 1 satellite that travels a North to South path. It comes in the evening, well before midnight (7-8 pm???) It's path is a more definite North to South direction, these travelled towards a direction about 15 degrees East of South. Most satellites are geo-stationary (move with the Earth, appear to be standing still). Much too high for me to say more about their description but they had no blinking or colored lights, no noise and no jetstream. They did not change brightness (all about equal), travel extremely fast nor burn up. Appeared to be above the atmosphere. Never seen anythng like this. Hmmm???"],"trends":[],"Object Shape":"Star-like","Summary":"Like satellites moving in straight line formation, 1 / 2 / 1","Object Flight Path":"Straight-line path","Longitude":"-86.894218","Date of the Event":"04/30/2012 04:30 UTC","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"32.319491","Region":"Alabama","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37848.html.txt","/var/www/straped/mufon/org/37848.html"]}