{"Log Number":"US-04302012-0003","Object Features":"None","Date Submitted":"04/30/2012 06:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.766329,+-117.118303(37840)&iwloc=A&hl=en\"> mufon case (37840) map </A>","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"04/28/2012 02:00 UTC","Summary":"Bright orange large objects in sky moving fast","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Latitude":"32.766329","divs":["sighting detailsdriving to a friend's house with my boyfriend, we noticed a large fireball-like object in the sky which first looked to be falling quickly toward the earth. it was quite close, and we live near an airport but it was nothing like the airplanes that we see daily and it was not moving on a steady path. it was very bright and i noticed the edge of the object was moving, or flaming, which is why i first suspected it to be a fireball. instead of falling, the object continued on a very sporadic path, changing direction quickly, moving in circles, while moving farther away. nearby, there was another large, orange and bright object with less movement but it was also moving in quick circular patterns. i began to panic, not knowing what this was (i've always been a skeptic of paranormal\\ufos), pulled my car to the side of the road and got out. as i tried to record the lights on my phone, they faded into the sky hovering in one place, becoming smaller and disappearing (not fading away in a streak of motion). after researching these ufos online, i can't find any other reports of this sighting."],"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around April 28th 2012"],"files":["/var/www/straped/mufon/html2text/37840.html.txt","/var/www/straped/mufon/org/37840.html"],"Tags":"City","City":"San Diego","Object Shape":"Circle, Fireball","Case Number":"37840","Disposition":"Unresolved","Region":"California","Longitude":"-117.118303"}