{"map":"<A HREF = \"http://maps.google.com/maps?q=38.957485,+-92.329142(37859)&iwloc=A&hl=en\"> mufon case (37859) map </A>","Longitude":"-92.329142","Weather Factors":"Unknown","Disposition":"Unresolved","Tags":"City","Date of the Event":"04/30/2012 11:30 UTC","divs":["sighting detailsi was driving back to the university of missouri at around 11:30pm(23:30) after getting late meal with a friend and as i was driving back i noticed what i initially thought was a bright star in the west\\northwest part of the sky at about a 40 degree elevation. as i was looking at it from my truck i noticed that it was not stationary like a star so i pulled over and watched it for as long as i could. as i watched the brownish\\orangish orb in the sky it appeared to be moving in an erratic manor, similar to how a laser pointer moves when you are trying to hold it steady on a wall, and did not have any sort of warning or strobe lights like you would expect aircraft to have. after several minutes it began to fade and then got much brighter, then i had to move because there were other cars that needed to get by and i lost it behind a tree for 3 seconds max and after that it was no where to be found. i live a block from two hospitals that receive a lot of emergency transfers via helicopter so i am as familiar with them as i could be without any real expertise and i couldn't imagine an airplane moving in that fashion. the closest thing i can compare it to would be an emergency flare but it didn't move the way you would expect a flare to move and i could not imagine anybody would be firing flares in columbia missouri."],"Source":"MUFON","Viewing Distance":"Unknown","Summary":"orb, pulsated, west northwest section of the sky, moved like a laser pointer being held on a distant object","Object Features":"Undisclosed","Latitude":"38.957485","Region":"Missouri","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/37859.html.txt","/var/www/straped/mufon/org/37859.html"],"Object Flight Path":"Other","Country":"United States","Object Shape":"Fireball, Sphere, Star-like","Case Number":"37859","Log Number":"US-05012012-0001","City":"Columbia","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around April 30th 2012"],"Date Submitted":"05/01/2012 01:23 UTC"}