{"Case Number":"37855","Date Submitted":"04/30/2012 10:37 UTC","Region":"California","Summary":"6-10 orb to circular objects traveling NW-SE with differing spacing with sudden directtion change and then sudden disapperance.","map":"<A HREF = \"http://maps.google.com/maps?q=38.407099,+-121.366706(37855)&iwloc=A&hl=en\"> mufon case (37855) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 19 other sightings in Elk Grove","There were no other sightings in Elk Grove on or around April 29th 2012"],"Object Features":"Unknown","Longitude":"-121.366706","Latitude":"38.407099","Date of the Event":"04/29/2012 10:20 UTC","City":"Elk Grove","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/37855.html.txt","/var/www/straped/mufon/org/37855.html"],"Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-04302012-0015","Disposition":"Unresolved","divs":["Sighting Details I am a avid amatuer star gazzer and had a family event at my Elk Grove residence on Saturday April 28,2012. I was in my back yard with 6 adults and I got a light out of the corner of my left eye and my first thought was that it was the space shuttle flying over.(I keep track of the fly overs, but as soon as I saw it I realized that the shuttle was no longer flying. I turned to my left which would have been facing directly north and said out loud \"What the hell is that\" and pointed to the object moving Northwest to Southeast at a pretty straight line. It was was about 30-40 degress above the horizon and had no blinking lights and was a blue-white color. As it moved from my left to my right I noticed that there was another of the same shapes trailing behind the first one. Everyone in my back yard noticed it as well and we all started watching these lights. As we watched more started to appear traveling in the same genera direction. They where not moving fast like a shooting star or a metorite but at a fairly fast and very steady speed. They where moving at different altitudes and I ran inside to get my binoculars and came back outside to see 3-4 more coming from the northwest. When I focused in on on of them it was a bluish-white color and it definitely had no blinking navigation lights and there was no trail or tail behind any of them. There was no sound coming from them. As we watched I kept my eyes on the first 5-6 and they suddenly turned and started moving straight south and then started moving more of a 75-90 degree angle into the sky. Then those first 5-6 moved into a triangle-like position in the southeast sky with a smaller red lighted craft moving towards the center and then they just disappeared. The other members of my family kept there eyes on another group that turned directly north and disappered below the treeline in the distance. This group also a red lighted craft that appeared to be following it. Two of my family members had there smart phones and where taking video with audio, but I have not been able to view those as of yet. This was not a short 10-30 second event like a shooting star or a metorite going across the sky. this event lasted 7-10 minutes and had a least 7-10 objects that where viewed by all of us. My intial reaction was excitment, this is they kind of thing that is a hobby for me and always has been. Now that a couple of days have past my wife and I just want to know what we saw. We all know that these where not aiplanes.ballons,shooting stars or metorites. These objects where not moving any type of random pattern. We all agreed that these craft were defintely flying in a controlled and calculated manner as if on a mission."],"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Oval"}