{"Source":"MUFON","divs":["Sighting DetailsAT ABOUT 1400 HOURS, APPROXIMATELY ON THE DATE MENTIONED, TWO POLICE OFFICERS AND A CIVILIAN PILOT WERE IN A 182 CESSNA AIRCRAFT ABOUT 10 MILES SOUTH OF A MAJOR NORTHWEST AIRPORT, OPERATING IN THE ARSA UNDER APPROACH CONTROL. THE AIRCRAFT WAS IN A RACE TRACK HOLDING PATTERN ORIENTED NORTH AND SOUTH ABOUT ONE MILE BY TWO MILES, AT ABOUT THREE THOUSAND FEET MSL OVER A FREEWAY. THE WEATHER WAS CLEAR WITH BRIGHT OVERHEAD SUN, AND NO WIND, SMOKE IN THE AREA WAS RISING ALMOST VERTICALLY. VISIBILITY AND CIELING WERE UNLIMITED. THE TEMPERATURE WAS MILD TO WARM. OTHER AIRCRAFT WERE IN THE AREA BUT NONE WERE IN THE IMMEDIATE VICINITY. AS THE TWO PILOTS WERE INVOLVED WITH FLYING THE AIRCRAFT, THE OBSERVER IN THE BACK SEAT WAS SPOTTING VEHICLES ON THE GROUND PRACTICING TECHNIQUES TO ACQUIRE AND MAINTAIN VISUAL CONTACT WITH TARGETS ON THE GROUND. ON THE SOUTH BOUND LEG, ON THE EASTERN MOST TRACK, THE OBSERVER SAW A ROUND BALL LIKE OBJECT ABOUT TWO TO THREE FEET IN DIAMETER WITH A SEAMLESS, MIRROR LIKE SURFACE TUCKED INTO THE FOUR O'CLOCK POSITION, RELATIVE TO , AND KEEPING PACE WITH, THE AIRCRAFT, ABOUT TWO HUNDRED FEET OUT AND ABOUT THREE TO FIVE HUNDRED FEET BELOW. THERE WAS NO VISIBLE MEANS OF PROPULSION, AND NO LIGHT SOURCES. THE ONLY REASON IT WAS VISIBLE WAS THE CONTRAST OF THE SHINY OBJECT TO THE DARK GROUND. THE OBJECT WAS SEEN TO FOLLOW THE AIRCRAFT THROUGH A NINETY DEGREE TURN TO THE WEST, THEN A NINETY DEGREE TURN TO THE NORTH. IT CONTINUED IN IT'S RELATIVE POSITION, FLYING FORMATION WITH THE AIRCRAFT, ON AROUND TO THE SOUTHBOUND LEG. THIS PERIOD OF OBSERVATION WAS MADE BY THE OBSERVER ALONE WHO DID NOT NOTIFY THE PILOTS, NOT WANTING TO BE RIDICULED. TOWARDS THE END OF THE SOUTHBOUND LEG THE RIGHT SEAT PILOT OBSERVED THE OBJECT IDEPENDENTLY AND WITHOUT BEING ADVISED BY THE OBSERVER. UPON BEING ASKED THE OBSERVER THEN ADVISED THAT HE TOO SAW THE OBJECT. THE LEFT SEAT PILOT COULD NOT SEE THE OBJECT AS IT WAS TUCKED IN TOO CLOSE TO THE RIGHT SIDE OF THE AIRCRAFT. AS THE SCHEDULED TURN TO THE WEST WAS MADE THE LEFT SEAT PILOT MADE AN UNUSUALLY STEEP BANK AND IT WAS AT THAT TIME HE TOO SAW THE OBJECT. THE OBSERVER ASKED ABOUT THE POSSIBILITY THAT THE OBJECT WAS A MYLAR TYPE SILVER BALLON. IT WAS POINTED OUT THAT IT WAS A VIRTUALLY WINDLESS DAY AND FURTHER THAT THE INDICATED AIRSPEED WAS ABOUT 75 KNOTS AND THE OBJECT WAS MAINTAINING IT'S POSITION AND TURNING WITH THE AIRCRAFT. APPROACH CONTROL WAS QUIRIED AS TO THE PRESENCE OF ANY POSSIBLE RADAR CONTACTS IN THE IMMEDIATE VICINITY. THE REPLY WAS NEGATIVE. ALTHOUGH THERE WAS NO DIRECT QUESTION AS TO WHAT WAS BEING OBSERVED THE CONTROLLER ASKED THE APROXIMATE RANGE FROM OUR AIRCRAFT TO THE CONTACT AND WAS ADVISED WITHIN ONE QUARTER MILE. THERE WAS A STANDY ORDER THEN AN ADVISORY THAT THERE WERE NO CONTACTS IN THE AREA, AND THEN , \"DID WE WISH TO MAKE A REPORT\". THE LEFT SEAT PILOT DID NOT THINK ANYONE WOULD BELIEVE THE INCIDENT, AND THAT IT WOULD NOT BE WORTH THE TROUBLE. THE RIGHT SEAT PILOT WAS A LOW TIME PILOT AND WAS CONCERNED ABOUT POSSIBLE SANCTIONS AGAINST HIS LICENSE TO FLY. THE OBSERVER WENT ALONG WITH BOTH PILOTS WHO DECISION WAS MADE NOT TO REPORT. THE OBSERVATION CONTINUED AND AN INQUIRY WAS MADE TO THE GROUND UNITS BY THE OBSERVER IF THEY COULD SEE ANYTHING IN THE PROXIMITY OF THE AIRCRAFT. THE REPLY WAS NEGATIVE, AND WHEN ASKED BY GROUND UNITS IF WE WERE WATCHING A UFO THE REPLY WAS, \"AS A MATTER OF FACT YES WE ARE\". THERE WAS NO CONFIRMATION FROM THE GROUND. THEN AS THE AIRCRAFT TURNED ONTO THE NORTHBOUND LEG THE OBJECT SUDDENLY, AND VERY SMOOTHLY ACCELERATED OUT IN FRONT OF THE AIRCAFT AT ABOUT THE SAME ALTITUDE. IT COVERED THE DISTANCE OF ABOUT TWO MILES IN ABOUT TWO TO THREE SECONDS ACCELERATING FROM ABOUT SEVENTY FIVE KNOTS. THE OBJECT THE EXECUTED A NINETY DEGREE RIGHT TURN TO THE EAST, AFTER A RADICAL DECELERATION AS THE TURN WAS MADE. THIS MANEUVER CAN BE BEST DESCRIBED AS THE OBJECT DISPLAYING THE CHARACTERISTICS OF A 50 CAL. TRACER ROUND FIRED FROM THE AIRCRAFT. AS THE TURN TO THE EAST WAS COMPLETED THERE WAS AGAIN A DISPLAY OF ACCELERATION THAT WAS ALMOST UNBELIEVABLE. AGAIN THE ANALOGY OF A 50 CAL. TRACER ROUND IS CONSISTANT WITH THE FLIGHT CHARACTERISTICS OF THE OBJECT. THE ACCELERATION, A BALLISTIC CURVE, AND THE SPEED WERE ALL ABOUT WHAT ONE COULD EXPECT WHEN OBSERVING A PROJECTILE BEING FIRED FROM THAT TYPE OF WEAPON. THE OBJECT WAS SEEN TO ENTER THE TREES ON THE NORTHWEST SHOULDER OF A MOUNTAIN TO THE EAST, APPEARING TO HAVE CRASHED. THAT OBSERVATION WAS MADE BY ONE OF THE PILOTS. THE OBSERVER WAS INSTRUCTED TO FIX THE EXACT LOCATION OF POSSIBLE IMPACT WHILE THE PILOTS FLEW A NORTH, NORTHWESTERLY COURSE FROM THE SOUTHWEST CORNER OF THE PATTERN INTENDING TO OVERFLY AND POSITIVELY FIX THE LOCATION FOR GROUND INVESTIGATION. AS THE AIRCRAFT APPROACHED TO WITHIN ABOUT A MILE TO A MILE AND HALF OF THE POSSIBLE POINT OF IMPACT, THE OBJECT FLEW UPWARDS OUT OF THE TREES AT ABOUT A TWENTY FIVE TO THIRTY DEGREE ANGLE TO AN APPROXIMATE ALTITUDE OF FIVE THOUSAND MSL. THE ACCELLERATION AGAIN WAS EXTREMELY FAST AND SMOOTH, BUT AS THE OBJECT LEVELED OUT ON A SOUTHERLY COURSE IT, AS RAPIDLY, DECELERATED TO A MORE LIESURELY PACE, ABOUT ONE OR TWO HUNDRED KNOTS. THE OBJECT CONTINUED ON THIS COURSE FOR ABOUT THIRTY SECONDS TO A MINUTE WHEN IT EXECUTED A LEFT TURN, ABOUT FORTY FIVR DEGREES TO THE SOUTH SOUTHEAST AND ACCELERATED AWAY AT AN ASTONISHING RATE DISSAPPEARING FROM SIGHT IN A VERY SHORT TIME. A SIMILAR OBJECT WAS SEEN AT A LATER TIME IN AN AREA TO THE SOUTHWEST OF THE ORIGINAL INCIDENT DISPLAYING SIMILAR CHARACTERISTICS, SUCH AS ALTITUDE, SPEED, AND LAST KNOW DIRECTION OF TRAVEL, TO THE SOUTH SOUTHEAST AT A HIGH RATE OF SPEED. THIS INFORMATION CAME ABOUT AS A TELEVISION SHOW OF VIDEO RECORDED SIGHTINGS WAS ON. THE WIFE POINTED OUT ONE OF THE OBJECTS, A SILVER BALL, AND MENTIONED HER OBSERVATIONS. SHE WAS UNAWARE OF THE SIMILARITIES OF THE TWO INCIDENTS AT THE TIME OF THE CONVERSATION. THE PILOT OF THE PLANE IS AN EXPIERIENCED HIGH TIME CIVILIAN PILOT. THE COPILOT IS A LOW TIME LICENSED PILOT AND IS A POLICE OFFICER WITH ABOUT FIFTEEN YEARS EXPIERIENCE. THE OBSERVER IS A TWENTY YEAR POLICE OFFICER WITH SOME EXPIERIENCE FLYING AND IS A MILITARY VETERAN. BOTH OFFICERS ARE STILL EMPLOYED AND THE TWO PILOTS CONTINUE TO FLY."],"Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/3785.html.txt","/var/www/straped/mufon/org/3785.html"],"Latitude":"45.532502","map":"<A HREF = \"http://maps.google.com/maps?q=45.532502,+-122.671007(3785)&iwloc=A&hl=en\"> mufon case (3785) map </A>","Sighting Duration":"Undisclosed","City":"Portland","Tags":"City","Date of the Event":"05/15/1994 12:00 UTC","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around May 15th 1994"],"Longitude":"-122.671007","Object Features":"None","Object Flight Path":"Path with directional change","Log Number":"US-08302005-0001","Case Number":"3785","Date Submitted":"05/15/1994 12:00 UTC","Country":"United States","Object Shape":"Sphere","Summary":"UFO followed light aircraft from below and behind at close range","Region":"Oregon"}