{"Weather Factors":"Unknown","Date Submitted":"04/30/2012 08:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.057341,+-94.414842(37854)&iwloc=A&hl=en\"> mufon case (37854) map </A>","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around April 28th 2012"],"Summary":"Triangular craft with two slow blinking lights in the back moved very slowly over Independence","Object Shape":"Triangle","Tags":"City","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Region":"Missouri","Date of the Event":"04/28/2012 09:10 UTC","Longitude":"-94.414842","Object Features":"Unknown","City":"Independence","Log Number":"US-04302012-0015","files":["/var/www/straped/mufon/html2text/37854.html.txt","/var/www/straped/mufon/org/37854.html"],"Case Number":"37854","divs":["Sighting DetailsAs called in to ASD by phone: Witness wishes to remain anonymous due to her job and would not provide a phone number or e-mail. I was getting into my car after work at 9:10 pm on Saturday night when I noticed something blinking in the sky. It was very odd - a triagular shaped flying object that had two blinking lights in the rear only. These very very bright white lights were circular and blinked on and off every two seconds (I timed it). WThere were no other lights on the craft like you would see on a plane. I called my co-worker outside to look at this and we watched it together - the total time I watched it was five minutes and he saw it for about half that time. We were both perplexed because it was moving so very slowly and we decided that it could not have been a conventional aircraft. It did not look like a helicopter, either. It was triagluar with one end (the front) being longer than the other two sides and the edges were quite thick. The object was moving in a Northeast to Southwest direction in a straight line and did not waver from its path. It did not change altitude, either. I estimate that it was 500 - 1,000 feet from the ground since we could see it fairly well. We could not see the top very well but it appeared to be flat on all sides. We did not see the front of it. I called to see if anyone else saw this because it is the strangest thing I've ever seen. We were amazed at how this big solid object was even airborne and how it was moving so slowly! A former skeptic."],"Source":"MUFON","Disposition":"Unresolved","Latitude":"39.057341"}