{"Source":"MUFON","Date of the Event":"04/29/2012 10:15 UTC","Date Submitted":"04/30/2012 11:13 UTC","Viewing Distance":"Over 1 Mile, Unknown","City":"Rochester","Tags":"City","Region":"New York","Latitude":"43.16352","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37856.html.txt","/var/www/straped/mufon/more/37856_submitter_file1__triangular_object.jpg","/var/www/straped/mufon/org/37856.html"],"Object Features":"Undisclosed","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=43.16352,+-77.604762(37856)&iwloc=A&hl=en\"> mufon case (37856) map </A>","Country":"United States","divs":["sighting detailsit was about 10:15pm on sunday april 28th. a friend and i were sitting outside huddled around a bonfire. i'd say about 10 other people were around us. we happened to be looking up at the sky already because someone made a comment about how there were searchlights coming from downtown being cast into the sky. then suddenly out of the north, a strange shape appeared and flew directly above us. it traveled at a fairly slow speed... a lot slower than any airplane would. it made no sound... just drifted slowly above us. it was a triangular-shaped dark mass, with three large pink\\orange spheres of light. the lights were not blinking, but constant. they were not overly bright, but just sort of glowing. it flew in front the moon... and the strangest part was that the object was translucent. i could see the light of the moon through it. it traveled in a straight line from north to south. the sighting only lasted about 15 seconds before the object disappeared over the roofs around us. we were all a bit stunned... and sort of freaked out after! everyone around us started chattering and talking. we were all trying to piece together what we'd just seen. it wasn't like anything i'd ever seen before, that's for sure."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Case Number":"37856","Log Number":"US-04302012-0016","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around April 29th 2012","This sighting has never been favorited.",""],"Longitude":"-77.604762","Summary":"Triangular shaped dark gray/semi translucent craft with three large pink/orange sphere-like lights"}