{"Tags":"City","Region":"Georgia","City":"Swainsboro","trends":["There have been 2 other sightings in Swainsboro","There were no other sightings in Swainsboro on or around May 1st 2012"],"files":["/var/www/straped/mufon/html2text/37865.html.txt","/var/www/straped/mufon/org/37865.html"],"Date of the Event":"05/01/2012 12:00 UTC","Weather Factors":"Unknown","Log Number":"US-05012012-0008","divs":["Sighting DetailsMe and two friends where riding through swainsboro Ga monday may 1 2012. It was clear and alm outside when these 3 lights where coming toward car then just dissappeared. They then repeared in the sky but it was more and as they cut on they cut off in the same pattern. After that these big orangish lights would appear and as the would appear it was like they would b cut off without moving. But they would reappaer over a 15 min period in differnt locations. The sky seemed to b filled with a bunch of spakrly lights. They were moving so no stars and were moving way to fast to be planes. But we stopped and got out to watch and could here this noise not like a jet but louder and it was moving fast and would get quite thats when we would see the orange lights. Heard it twice and never heard a sound in the sky like it before. Ive always been a skeptic but im a believer now after witnessing this. Can someone explain?"],"Case Number":"37865","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.604816,+-82.332598(37865)&iwloc=A&hl=en\"> mufon case (37865) map </A>","Longitude":"-82.332598","Date Submitted":"05/01/2012 12:47 UTC","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"32.604816","Source":"MUFON","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Object Shape":"Fireball, Sphere, Star-like","Summary":"First there was these brihht light seemed tp b coming at our car then dissappeared. then these big orange spheres that seemed to come on then dim a little then go away just as they showed up. Like being cut off. Saw many sparklimg lights in sky moving fas","Object Features":"Unknown","Country":"United States"}