{"Disposition":"Unresolved","Log Number":"GB-05012012-0010","Weather Factors":"Unknown","Viewing Distance":"Unknown","divs":["Sighting Details@ approx 10:34 pm bst I went out into the garden with one of the dogs, looked up and saw a bright red light moving north to s east in quite an erratic manner, not steady but a bit uneven in course & speed, had no navigation strobes, was silent and moved quite rapidly, crossing the sky in around 25 - 40 seconds. I don't believe it was a lantern as there is little wind blowing and what there is is from the other direction. An airliner came into view heading into Luton airport, I think the crew will certainly have seen it, it passed across the path of the jet and seemed to be perhaps a bit higher, the light went into cloud just as the jet came over. Sounds odd I guess but got a rather creepy feeling seeing this. I am not saying this was an alien craft, I am not saying anything about where this object might be from because how would I know? But is was very strange. No strobes, silent, bright red, quite fast and erratic and up at an altitude where it went into cloud against the wind. The object looked like a bright red firework, the fact that it went into cloud against prevailing surface wind was very odd, so, clearly not a lighted balloon or similar."],"Date of the Event":"04/21/2012 10:34 UTC","Country":"United Kingdom","Object Features":"None","Summary":"very bright red light, fairly eratic in speed, moved quickly, crossed sky dissapered into cloud in proximity to plane.","Date Submitted":"05/01/2012 05:39 UTC","Longitude":"-0.186062","Sighting Duration":"00:00:45","Latitude":"51.884112","trends":["There has been one other sighting in Stevenage","There were no other sightings in Stevenage on or around April 21st 2012"],"Source":"MUFON","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/37867.html.txt","/var/www/straped/mufon/org/37867.html"],"City":"Stevenage","Object Flight Path":"Path with directional change","Region":"","Case Number":"37867","map":"<A HREF = \"http://maps.google.com/maps?q=51.884112,+-0.186062(37867)&iwloc=A&hl=en\"> mufon case (37867) map </A>","Tags":"City"}