{"City":"Aguanga","Date Submitted":"05/01/2012 03:01 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was grilling on our deck, when I happened to notice a bright star in the sky. I figured at first it was the planet Venus, as Venus passes through where this object was. But, I noticed that Venus was about 30 deg West of this object. Then I noticed the object was moving towards me. The object was coming in from the NW, heading South towards where we live, which is about 15 miles SE of Temecula, CA. It was moving slowly, but steadily. There was no sound from it at all. Even the commercial jets that fly over us at a good 10k ft, still make sound. This object was even lower than any of the planes fly over here. It had no blinking lights, or colors besides white. It was slightly larger than Venus, and was definitely as bright as Venus, if not more. Where we live is rural, so we have little light pollution. Part of the reason is because the Palomar Observatory is above us, we are in the foothills of the Palomar Mtns. This was at about 9:28-9:30 pm, and the object took about a good 5 minutes to move towards me. I wanted to get my camera, but was afraid it would disappear. So I waited until the object was directly above my house. Then I ran inside, grabbed my camera, and was gone a minute or less. However, the object was already to the far Southern sky, and then it just disappeared. The object had to have accelerated. It should have just been going over the other side of my house, due to the speed it was going at, but instead was now a good 40-50 miles away. Also, to note...we have many different types of planes that fly over our house. There are many military bases around here, and they fly helicopters, planes, and jets. Plus, commercial aircraft fly over our homes. Planes can definitely be made out as planes, with flashing red & blue lights. Provided we have a clear night, which is most nights, you can even make out the detail of the planes. I couldn't make out any detail of this object. It looked like a flying Venus, but a bit bigger. This is also not the first UFO sighting I have had at this location. I have had at least 3 sightings now in a little over a year. There are also many other questionable objects I've seen, but none of them were as distinct as these 3. Also, when this object was flying towards me, and then overhead of me, I got this sensation. Perhaps like a magnetic sensation, hairs standing on end, like you would feel when a storm is coming. It's like you could feel the electricity in the air, and it was coming from this object. MUFON should do an investigation of this area, as I believe it is a vortex. I was told before I moved here, that the area was known for UFO sightings, there is a high military presence, and the area gives off a higher than normal electromagnetic reading."],"Summary":"Slow, then fast flying object that was as bright, if not brighter than Venus.","Tags":"City","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Features":"Unknown","Date of the Event":"04/28/2012 08:30 UTC","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"33.442702","files":["/var/www/straped/mufon/html2text/37862.html.txt","/var/www/straped/mufon/org/37862.html"],"Object Shape":"Star-like","Region":"California","Longitude":"-116.865122","trends":["There has been one other sighting in Aguanga","There were no other sightings in Aguanga on or around April 28th 2012"],"Log Number":"US-05012012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=33.442702,+-116.865122(37862)&iwloc=A&hl=en\"> mufon case (37862) map </A>","Case Number":"37862"}