{"Latitude":"54.430467","files":["/var/www/straped/mufon/html2text/37860.html.txt","/var/www/straped/mufon/org/37860.html"],"Object Features":"None","divs":["Sighting DetailsI was running late at night on august 16 2011 and listening to the radio on my fathers iphone and i stopped to rest at at an elementary school playground and i while i was looking through the phone i looked up and across the field floating about the trees was a green orb somewhere between 15-25 feet wide and as soon as i saw it it seemed to notice that i was observing it and it then hid behind the tree line, which is a residential area, and as it went behind the trees i could clearly see the trees being silhouetted by the green sphere Naturally i thought it would come back up so i opened up the camera app on my dads phone and made a video recording of that area for the next few minutes until i gave up and realized it wasn't coming back up from the ground. It took me about 30 seconds to open up app and start recording and the time indicate in the video said 1:23:29 so It happened at almost exactly 1:23 am. Canada's largest airforce base is 6 km away but this was clearly not an aircraft since it was floating silently about 100 m away from me about the trees and it had no definable edges just a perfectly circular sphere glowing a vibrant green. my first thoughts upon seeing it were \"omg, what is that?\" i wasn't scared even though i should have been but this massive green orb seemed like it had to frantically get out of my view which is perplexing. I wanted to go investigate the area where it went down behind the trees but i never got around to it and winter came quickly since this is canada the only evidence i have is my recollection and the video i made waiting to see if the green sphere would rise up above the trees. After seeing this object i have absolutely no doubts that there are alien life forms and i believe that this may have been a non-corporeal life form of some sort since it didn't appear to have any mechanical systems of any kind. It appeared to be pure energy and to have the awareness that i was observing it, since it hid from my view, which would imply that it was intelligently controlled. I work at a video store and talk to many people every day and a few people have claimed seeing orbs chasing each other quickly across the sky above the lake on canada day a few years back. I just remembered that there was a place to report my sightings and if anyone else has seen this green sphere near that date or anywhere in alberta it would be a verification that im not going insane even though thousands of people have sighted green orbs throughout history."],"Disposition":"Unresolved","Source":"MUFON","Log Number":"CA-05012012-0003","Summary":"Glowing Green Sphere floating above tree tops","Country":"Canada","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=54.430467,+-110.198187(37860)&iwloc=A&hl=en\"> mufon case (37860) map </A>","trends":["There have been 2 other sightings in Cold Lake","There were no other sightings in Cold Lake on or around August 16th 2011"],"Date of the Event":"08/16/2011 01:23 UTC","Weather Factors":"Unknown","Tags":"City","City":"Cold Lake","Longitude":"-110.198187","Date Submitted":"05/01/2012 02:31 UTC","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Case Number":"37860","Object Shape":"Sphere","Region":"Alberta"}