{"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","divs":["sighting detailsmy wife and daughter noticed a light flying over a field in back of our house at about 9:30 pm. she first dismissed it thinking it was a helicopter flying low. about ten minutes later it flew back the other way. just then i came into the room and she mentioned the light and what did i think it was doing. i noticed that it was coming towards our house so i ran outside to see what it could be. when we looked up there it was right over the house. it was about 100 ft. up,triangular shaped with rounded corners and the sound it had was a low hum. the speed was about that of a slow moving helicopter. it had three red lights, one in each corner, a large white light in the center and a strobe light on it's front. the bottom of the craft had a lead\\gray color and appeared mottled. we watched it moving back and forth as it proceeded down over our neighbors pasture. my wife says it seemed like it was looking for something or maybe like it was mapping something. it was 20 degrees below zero that night and we were standing outside without jackets or shoes. we didn't persue it and wish we had now. the next day there were several people who called into the local radio staion asking if anyone else had seen this thing. we also saw an article in a little newspaper in the northern part of our county which talked about several people observing a similar flying object two weeks before. one person said they saw it hovering over the community medical building late one night and the other person said they were at a different angle on a hill and saw windows with some beings inside. we are not sure if it was the same object we saw, but the description sounded similar. a very exciting experience!"],"Object Features":"Patterned Surface","Date Submitted":"05/02/2012 01:16 UTC","Date of the Event":"02/10/1994 09:30 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.718003,+-73.138525(37876)&iwloc=A&hl=en\"> mufon case (37876) map </A>","Latitude":"44.718003","City":"St Albans","files":["/var/www/straped/mufon/html2text/37876.html.txt","/var/www/straped/mufon/org/37876.html"],"Case Number":"37876","trends":["There have been 7 other sightings in St Albans","There were no other sightings in St Albans on or around February 10th 1994"],"Object Shape":"Triangle","Log Number":"US-05022012-0008","Tags":"City","Longitude":"-73.138525","Region":"Vermont","Country":"United States","Summary":"Observed a flying object in a field in back of our home. Object then came flying over our house about 100 ft. up.","Object Flight Path":"Path with directional change","Source":"MUFON"}