{"Object Shape":"Fireball, Flash, Sphere","trends":["There has been one other sighting in Lindsay","There were no other sightings in Lindsay on or around May 1st 2012"],"Tags":"City","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Date Submitted":"05/02/2012 03:21 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.181439,+-119.095741(37871)&iwloc=A&hl=en\"> mufon case (37871) map </A>","Case Number":"37871","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsIT WAS NIGHT TIME AND I HAVE JUST GOT OUT OF CLASS AND I WAS WALKING TO MY CAR IN THE PARKING LOT WHERE THE SIGHING TOOK PLACE. I NOTICE A GUY STANDING ON THE SIDEWALK OF THE PARKING LOT LOOKING UP AT THE SKY WITH THIS DUMBFOUNDED LOOK ON HIS FACE. I IMMEDIATELY LOOKED UP AT THE SAME DIRECTION HE WAS WHICH WAS NORTH AND SAW THAT THE OBJECT WAS TRAVELING SOUTH. IT WAS A BRIGHT YELLOW, RED, FLASHING PULSATING OBJECT WITH ORGANIZE STRUCTURE TO IT WITHIN THE PULSATION AND FLASHING IN ITSELF. I CANT PIN DOWN THE DESCRIPTION OF THE STRUCTURE BUT THERE WAS SOMETHING THAT WAS STRUCTURE WITHIN THE FLASHING AND PULSATION. THE FLYING OBJECT WAS IN A SENSE FLOATING SMOOTHLY IN THE SKY BUT TRAVELING AT A HIGH SPEED IN THE SENSE OF THE ALTITUDE THAT IT WAS IN (APPROX 500 FEET TO A MILE). ANY AIRCRAFT WOULD HAVE BEEN RECOGNIZABLE AND HEARD AT THIS TYPE OF ALTITUDE AND A FALLING ROCK FROM SPACE WOULD HAVE TRAVEL IN ONE DIRECTION AND LEFT A TRAIL OF SMOKE BEHIND ITS PATH. THE FLYING OBJECT MADE A LEFT AND RIGHT TURN WITHIN SECONDS APART, THE PULSATING BECAME BRIGHTER AS IT FLEW NORTH IN OUR DIRECTION THEN THE PULSATING AND BRIGHTNESS DIMINISH TO A SMALL STAR TYPE OF LIGHT AND IMMEDIATELY AT A HIGH SPEED ASCENDED IN A 90 DEGREE ANGLE HIGHER UP INTO THE SKY AND DISAPPEARED. WITHIN APPROX 6 MIN LATER A AIRPLANE AND HELICOPTER APPEARED IN THE AREA. THERES A AIRPORT 6 MILE WEST FROM WERE THE SIGHTING TOOK PLACE. DURING THE SIGHTING I FELT EXCITED AND SURPRISE, I COULDN'T BELIEVE WHAT I SAW AS I WAS TRYING TO DECIPHER TO MYSELF A LOGICAL EXPLANATION OF WHAT IT WAS THAT I WAS SEEING, BUT WHAT I SAW SPOKE FOR ITSELF. THIS EVENT CAME TO ANSWER ONE OF MY SCIENTIFIC QUESTIONS AND THAT IS THAT UFO'S DO EXIST. THIS EVENT LAST APPROX 7 MINUTES."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date of the Event":"05/01/2012 08:37 UTC","files":["/var/www/straped/mufon/html2text/37871.html.txt","/var/www/straped/mufon/org/37871.html"],"Region":"California","Log Number":"US-05022012-0003","Summary":"UFO SIGHTING OUTSIDE COLLEGE CAMPUS","Viewing Distance":"101-500 Feet","Object Features":"Undisclosed","City":"Lindsay","Longitude":"-119.095741","Latitude":"36.181439"}