{"Summary":"Bright light change direction","map":"<A HREF = \"http://maps.google.com/maps?q=33.681916,+-112.204344(37870)&iwloc=A&hl=en\"> mufon case (37870) map </A>","Case Number":"37870","Country":"United States","Object Shape":"Circle","Object Flight Path":"Path with directional change","Longitude":"-112.204344","Tags":"City","City":"Glendale","Date of the Event":"05/01/2012 10:15 UTC","Weather Factors":"Unknown","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around May 1st 2012"],"Object Features":"None","Date Submitted":"05/02/2012 02:03 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:00:07","Latitude":"33.681916","Region":"Arizona","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/37870.html.txt","/var/www/straped/mufon/org/37870.html"],"Source":"MUFON","divs":["Sighting DetailsI sit outside by the pool every night and watch and wait for the Jet Fighters to come back to Luke Airforce base. I also see many other commercial planes because of all the airports. As I watched I viewed a light in the sky that glowed brighter ( not as brite as the Jet Fighters Strobe) heading East and turned South, before it moved behind a Cloud I saw it blink, I watched and waited about ten minutes but it never came out of that cloud and even if it turned West i would have seen it and it never exited the cloud. The cloud wasn't that big as opposed to the craft, it should have gone thru it in a few seconds but didn't. As I waited a very high commercial jet flew a diagonal flight ( much Higher) in a close vacinity. This makes number 11 I and some family members have seen in about 10 months. What is ironic is that about 12 Fighther jets came thru just 2-3 minutes before that viewing where they mostly fly over my home or somewhat close to it. My visual tells me that the craft was coming in from a higher altitued before it turned into the cloud. Jet airplanes have to have flashing red-Green lights and strobes and as stated I see these all the time, but this craft had none and I can see jet aircraft way up high I am assuming 50 thousand feet but you can see these strobes. This siting wasn't as defined as others I have viewed such as the fireballs"],"Log Number":"US-05022012-0002"}