{"Object Shape":"Egg, Oval, Sphere, Teardrop","files":["/var/www/straped/mufon/html2text/37880.html.txt","/var/www/straped/mufon/more/37880_submitter_file1__Tucson-UFO-05172008.jpg","/var/www/straped/mufon/org/37880.html"],"Longitude":"-110.867957","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"00:00:01","City":"Tucson","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around May 17th 2008","This sighting has never been favorited.",""],"Disposition":"Unresolved","divs":["Sighting DetailsAt the end of a stay at the Ventana Canyon Resort in the Tucson Santa Catalina mountains I was taking general area photos of the resort from my room balcony. I did not notice anything at the time this photo was taken. I first noticed the object in the photo while processing the images of my stay. I was surprised to see an object in an otherwise totally cloudless sky, so I attempted to enhance the object to bring out any additional details I could. Upon altering contrast and brightness it appears that the object has a physical form, and it also seems to have multiple colors. It is possible that the colors are an artifact of the digital photo process, but I believe the object is made of sufficient pixels to reveal that it actually does have shape, and color. The red and blue colors on the enlarged version do not appear to be the typical fringe colors you would find in a digital photo from my experience. I also found that with the artificial color enhancement the pixels below the object were significantly different from any other pixels on or near the object. You can see this in the submitted photo as the blue area directly below the object. I would like to hear from anyone else with similar object photos."],"Case Number":"37880","Summary":"Object showed up during processing of images shot with Canon 30D Digital SLR","map":"<A HREF = \"http://maps.google.com/maps?q=32.312304,+-110.867957(37880)&iwloc=A&hl=en\"> mufon case (37880) map </A>","Date of the Event":"05/17/2008 10:00 UTC","Date Submitted":"05/02/2012 08:02 UTC","Region":"Arizona","Country":"United States","Log Number":"US-05022012-0011","Source":"MUFON","Latitude":"32.312304","Object Flight Path":"Unknown"}