{"Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Tags":"City","Summary":"Objects chasing fireworks and each other,","Region":"Mississippi","Source":"MUFON","Latitude":"34.871984","Weather Factors":"Unknown","Longitude":"-88.429772","Object Shape":"Triangle","trends":["There have been no other sightings in Glen","This sighting has never been favorited."],"Case Number":"37887","divs":["Sighting DetailsI was outside shooting fireworks,roman candles and bottle rockets mostly. while my mother watched me from the porch. I don't remember how many bottle rockets were shot, before this object was seen. There was just one at the time chasing the fire works when they popped in the air. I can not remember my emotinons at the time,I was young when this happend,but is something I will never forget.After a few minutes passed by 4 more showed up. Now there is a total of 5 and they are chasing each other like a tag game. They moved so fast going from side to side up and down and just staying still. No noise at all. My mother and I were standing in the driveway watching this for at least a half hour. These objects were low enough where we could see the bottoms just fine. They were all the same size and about the sise of 2 full size pick-up trucks. Triangle shape with 3 lights. I could not how ever see the tops or the sides of the objects even though they had lights the top and sides were just to dark to see.While they were chasing each other we heard a loud rumble and when I turned around to see what it was I saw more lights,my mother was scared now and she grabbed me to head back into the house, when out from the tree tops a group of helicopters came flying by. the objects were still in sight and they all left together very fast. from the view it did look like they shot straight up in the sky.To this day I look at the sky every day and night,but I have never seen them or anything of this nature again."],"Sighting Duration":"Undisclosed","Log Number":"US-05032012-0001","Date Submitted":"05/03/2012 12:49 UTC","City":"Glen","Viewing Distance":"21-100 Feet","Date of the Event":"07/04/1988 12:00 UTC","files":["/var/www/straped/mufon/html2text/37887.html.txt","/var/www/straped/mufon/org/37887.html"],"Country":"United States","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.871984,+-88.429772(37887)&iwloc=A&hl=en\"> mufon case (37887) map </A>"}