{"Disposition":"Unresolved","Longitude":"-71.675725","Date Submitted":"05/02/2012 09:21 UTC","Tags":"City","Region":"Massachusetts","Latitude":"42.21265","Date of the Event":"08/24/1979 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.21265,+-71.675725(37883)&iwloc=A&hl=en\"> mufon case (37883) map </A>","Object Shape":"Triangle","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/37883.html.txt","/var/www/straped/mufon/org/37883.html"],"Sighting Duration":"Undisclosed","divs":["Sighting Detailsi was standihg at town common and glanced down rt 140 saw street light much brighter and pure white in comparison to 10 or so outher st lights it was the furthest one away about one half mile afew minutes later i noticed it was on rhe outher side of road me and a friend began to walk twoards it we meet at cumberland farms store this craft was 30 to forty ft. aboouve me i became so exited i began jumping up and down screaming come down come down it sat stanary for a goo two minutes that is when the 3 corner lights began to change to amber it moved up to about n500 ft. thentook of at blinding speed in a north northwest direction least to say i was in awe . i only then noticed my friend was running away. istayed a few more minutes to try to understand what just happend then 4 f 15 eagles in 2 by 2 cover formation at below 800 ft. came into view the funny thing is they followed the exact flight path as if their radar was showing the ufo still at each waypoint it changed my life compleatly now i am dedicated to the study of all craft that are unidentified i know what i saw and have been telling this story since rember this was before cable shows or any way to get informati0on on what i saw i am one of the few who can say uequivicly this was a real ufo no sound no heat no wind nothing now u see it now u dont 3 yrs ago my mom ,cousin alice and the milk man arrived at work 430 am in worcester mas and saw a cigar shaped objecct with the same charicteristices no sound all that stuff then it took off slowly and accelerated to just gone that fast then she became a beliver and appoligezed to me for doughting me. thank you for reading this feel free to call me because it was like it happened yesterday to me and i want to join your team sincerly b paul labbe"],"Log Number":"US-05022012-0013","Weather Factors":"Unknown","Case Number":"37883","Summary":"triangle 30 ft by30 by 30 ft. bright beam from center one red light in each corner changed to orangey yellowish","Viewing Distance":"21-100 Feet","City":"Grafton","Object Features":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","trends":["There have been 4 other sightings in Grafton","There were 3 other sightings in Grafton on or around August 24th 1979"]}