{"map":"<A HREF = \"http://maps.google.com/maps?q=43.0748,+-73.153995(37894)&iwloc=A&hl=en\"> mufon case (37894) map </A>","Object Features":"Unknown","Region":"Vermont","Latitude":"43.0748","divs":["Sighting DetailsThis is a shout to the gent in Arlington, Vt. Over the years, it has occurred to me that whenever I look for 'them' I see them. Have had two sitings like yours in this area (St. Albans) and one not too far from your siting. It's a wondrous thing. The reason I logged on today was an experience that I had last night--for reasons of brevity---will not go into now but I wanted to see who was in the neighborhood last night and bingo--there's your siting. I'm not saying our experiences were related but I'm here to tell you dude---you ain't alone---WE ain't alone. The pisser about this is---it makes some people very nervous. It threatens their well ordered world. Some people can't see beyond their own noses. It upsets the judeo-christian concept of things. I base all of my present belief system on one incontrovertible fact---space is infinite. No wall with a sign that says, \"The End.\" The question here is can the human mind truly grasp what infinity is? I'm not tethered to this universe and now neither are you. There's so much juicy food for thought here. Go with it. And, right on, my brother."],"Date Submitted":"05/03/2012 02:45 UTC","Weather Factors":"Unknown","Log Number":"US-05032012-0008","Object Shape":"Circle","City":"Arlington","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-73.153995","trends":["There has been one other sighting in Arlington","There were no other sightings in Arlington on or around May 3rd 2012"],"Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"05/03/2012 10:00 UTC","Summary":"have seen same as the sunderland/arlinjgton siting","Tags":"City","Sighting Duration":"00:00:07","Case Number":"37894","files":["/var/www/straped/mufon/html2text/37894.html.txt","/var/www/straped/mufon/org/37894.html"],"Disposition":"Unresolved","Country":"United States"}