{"Log Number":"US-05042012-0004","Longitude":"-83.664887","Tags":"City","Object Shape":"Circle, Sphere","Object Features":"None","trends":["There have been 5 other sightings in Cleveland","There were no other sightings in Cleveland on or around May 1st 2012","This sighting has never been favorited.",""],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.606531,+-83.664887(37906)&iwloc=A&hl=en\"> mufon case (37906) map </A>","Latitude":"34.606531","Case Number":"37906","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/37906.html.txt","/var/www/straped/mufon/more/37906_submitter_file1__DSC01630.JPG","/var/www/straped/mufon/org/37906.html"],"Date Submitted":"05/04/2012 03:16 UTC","Country":"United States","City":"Cleveland","Disposition":"Unresolved","Summary":"Two small cloudish circles seen hundreds of feet above house.","Region":"Georgia","Object Flight Path":"Stationary,Hovering then path,Unknown","divs":["Sighting DetailsMay 1, 2012: Took a picture of backside of a house for sale. May 4, 2012 when reviewing photo of house noticed 2 white cloudish circles (a dozen? feet in diameter..both the same size) above (hundreds of feet high) and beyond the house (hundreds of feet in front of the house). The 2 circles were hundreds of feet apart. When the photo was taken, I did not notice the circles as I was focusing on the back of the house, not the sky. I have no idea how long they were there or if they were still there when I left the scene. When I saw the circles for the first time on the picture, I initially thought they were water stains or Sun glare. This was quickly ruled out as it was a very dry day with 10-20% cloud coverage; Sun was to my left and above when photo was taken, not in front or low. When I zoom in on the picture the circle on the left of the picture seems to be stationary. The right circle is slightly blurred appearing to show motion. The one in motion (located on the right side of the picture) appears to be moving up and slightly to the right."],"Date of the Event":"05/01/2012 02:00 UTC"}