{"Summary":"Keep seeing bright glowing (white/yellowish) round/oval shape hovering in sky and then it leaves going North and West","map":"<A HREF = \"http://maps.google.com/maps?q=45.047299,+-93.256604(37903)&iwloc=A&hl=en\"> mufon case (37903) map </A>","Object Shape":"Circle, Egg, Oval, Sphere, Star-like","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","City":"Columbia Heights","Source":"MUFON","Country":"United States","divs":["sighting detailsfrom st. anthony, looking toward columbia heights and fridley, i see a very bright light in the sky like a star. through binoculars it looks like a very bright white\\yellow oval or sphere. it hovers. it moves slightly up and down and slightly back and forth, but mostly hovers. it has a halo or aura that is white as well. it can hang around for a half hour or an hour or more, and then it leaves, noticeably traveling north and west (getting smaller and smaller and staying close enough to horizon and tree line to not be able to see traveling away for long. i have seen this 4 times for sure and probably more. this has all been in 2012. it is usually late in the evening, between 10:00 and 12:30 for approximately an hour. even though i am looking towards columbia heights and fridley, what i am seeing could be as far away as brooklyn park for all i know. it could also be around a lot more often, i just don't look for it all the time and i'm not willing to stay up all night watching or looking for it. i have gotten my spouse out of bed to come look at it as well and he can verify that what i am describing here, he has seen as well. what made me first notice it, was i thought it was an unusually bright star...and then it moved. i don't feel any different when i see it or after it leaves. i lose sight because it leaves. i don't know what it is, but i do believe there is someone who does know what it is and why it is out there. it always seems to be in almost the same place in the sky from my vantage point, and it always goes the same direction more or less, when it leaves."],"trends":["There have been 2 other sightings in Columbia Heights","There were no other sightings in Columbia Heights on or around May 3rd 2012"],"Disposition":"Unresolved","Latitude":"45.047299","Date of the Event":"05/03/2012 11:15 UTC","Date Submitted":"05/04/2012 12:56 UTC","Longitude":"-93.256604","Weather Factors":"Unknown","Tags":"City","Case Number":"37903","Region":"Minnesota","files":["/var/www/straped/mufon/html2text/37903.html.txt","/var/www/straped/mufon/org/37903.html"],"Log Number":"US-05042012-0001","Object Features":"Unknown","Sighting Duration":"Undisclosed"}