{"Region":"Ohio","files":["/var/www/straped/mufon/html2text/37900.html.txt","/var/www/straped/mufon/org/37900.html"],"Longitude":"-82.586368","divs":["Sighting Details I was outside feeding the dogs and walking back toward the house to take out the trash when I looked behind me and in the northwestern sky was this extremely yellow bright light unlike any of the stars out. I then went around to the front of the house with the trash and my mother was standing in the driveway looking at a light in the eastern sky that was pulsating different colors. First white then red then white. I told her about the one behind the house in the northwestern sky so we watched both. Both objects seemed to have airplanes or some flying craft in the vicinity either beside or above them. This isn't the first time we have seen stuff like this. The light in the western sky seemed to expand a bit in other words whereas at first it was just a big yellow light it was as if you could see that the light was widening. I am going to keep looking for this object to see if it went anywhere but I just had to file this first report because some strange lights are showing up in this area of Ohio from time to time and I know I am not the only one seeing them."],"Log Number":"US-05032012-0014","Summary":"I saw three different lights as I was feeding the dogs and taking out the trash","Latitude":"40.59556","Viewing Distance":"Over One Mile","Case Number":"37900","trends":["There have been 2 other sightings in Bellville","There were no other sightings in Bellville on or around May 3rd 2012"],"City":"Bellville","Date Submitted":"05/03/2012 10:29 UTC","Object Shape":"Flash, Star-like","Source":"MUFON","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.59556,+-82.586368(37900)&iwloc=A&hl=en\"> mufon case (37900) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Weather Factors":"Unknown","Disposition":"Unresolved","Country":"United States","Date of the Event":"05/03/2012 09:50 UTC"}