{"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Boomerang","Longitude":"-99.769088","divs":["Sighting DetailsI was in my back yard viewing the night sky from my patio, it was a fairly clear night and had been star gazing for 30 minutes without anything unusual to note when a strange dark object caught my eye as it passed in front of the stars in the southern sky. At first I thought it was something else, though I didn't know what it could be, maybe a flock of birds, a civilian or military aircraft. Most of the objects structure was visible as a black boomerang shape, with about 4-5 light blue-white lights along the bottom side of the wings, but there was something strange about it. There appeared to be a mist or a shadow all around it as it flew across the night sky towards the north. The object and it's lights were visible, but the effect of the \"mist\" surrounding it made me blink and strain to focus at what I was seeing even though the outline of the object was clear. I didn't have my binoculars and my wife was inside, so I debated on staying to watch the object but I knew I didn't have much time before it would pass out of line-of-sight, blocked from view by surrounding houses. I ran through the house and grabbed my binoculars and yelled at my wife to come outside quickly as I ran out the front door. I could not find the object again though."],"Case Number":"37907","Region":"Texas","files":["/var/www/straped/mufon/html2text/37907.html.txt","/var/www/straped/mufon/org/37907.html"],"trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around March 21st 2012","This sighting has been favorited 1 time.",""],"Latitude":"32.414324","Object Flight Path":"Straight-line path","Summary":"Black Boomerang UFO with blue-white lights along wings, shrouded in mist","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"03/21/2012 09:30 UTC","Sighting Duration":"00:03:00","Log Number":"US-05042012-0005","City":"Abilene","map":"<A HREF = \"http://maps.google.com/maps?q=32.414324,+-99.769088(37907)&iwloc=A&hl=en\"> mufon case (37907) map </A>","Date Submitted":"05/04/2012 09:26 UTC","Tags":"City","Country":"United States","Object Features":"None","Source":"MUFON"}