{"Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsThe first object is in my jaw, small triangle. 2nd is in the neck area, just below the base of the skull,a rectangular rod, 3rd is between the hip and tail bones of the spine, a skull shaped object. I did not notice these until I pursued more chiropractic care. I happened to glance at them, and noticed the object in the largest x-ray of my spine. (These objects can not be buttons-the doctor had me remove my pants to the knees, and you can clearly see the metal on the back of my bra versus the object.) I had always had strange dreams, and even met particular people from these dreams. I've experienced missing time, but have had no specific memories of abduction. Recently a friend of mine had the same dream as I, and when we compared memories, they were of the same place, surroundings, fears, etc. Her family has experienced abductions for many years, and I believe my association with them was not a coincidence. I have included digital pictures of my x-rays, and am trying to obtain more recent x-rays from a local chiropractic office I visited in 2000."],"Summary":"This is not a UFO, I am reporting implants that can be viewed on my x-rays.","Viewing Distance":"Unknown","Latitude":"41.698642","Sighting Duration":"Undisclosed","Object Shape":"Undisclosed","files":["/var/www/straped/mufon/html2text/3790.html.txt","/var/www/straped/mufon/more/3790_submitter_file1__jaw-triangular.jpg","/var/www/straped/mufon/org/3790.html"],"Case Number":"3790","Country":"United States","Log Number":"US-08312005-0002","Object Flight Path":"Undisclosed","trends":["There have been 3 other sightings in Bolingbrook","There were no other sightings in Bolingbrook on or around May 4th 1994","This sighting has never been favorited.",""],"City":"Bolingbrook","Source":"MUFON","Date Submitted":"05/04/1994 12:00 UTC","Disposition":"Unknown","Date of the Event":"05/04/1994 12:00 UTC","Longitude":"-88.068396","Tags":"City","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=41.698642,+-88.068396(3790)&iwloc=A&hl=en\"> mufon case (3790) map </A>"}