{"Date of the Event":"07/15/1996 12:00 UTC","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in North Hero","This sighting has never been favorited."],"Latitude":"44.831143","City":"North Hero","Region":"Vermont","files":["/var/www/straped/mufon/html2text/37910.html.txt","/var/www/straped/mufon/org/37910.html"],"divs":["Sighting DetailsOn my way home from work (U. S. Army Mountain Warfare school) I took the Champlain Island exit off I-87 onto Route 2 to take a slow nice ride home, I pulled over to relieve myself; while in the process I for some reason looked up and there just above the treeline, to my total astonishment was this hugh Object moving silently in a straight line above me. I had always said to people that I would gladly be taken aboard a alien craft (because they obviously are highly intelligent) for examination. But it just kept moving at a very slow speed, I watched it till it disappeared beyond the tree's. The next day at work I wrote down in quite a bit of detail what I saw. I have it here I am just having a hard time finding the paper I wrote ....but I have it here somewhere. This I am guessing was in the summer of 1996 or 1997. The date above in the questionare are merely a guess. I have been thinking of that night alot lately and decided to hell with it I am going to send you my account. No doubt in my mind what I saw and no one can change my mind. I was alone, which probably makes this report worthless to you folks. I can't believe it was an experimental aircraft,and it was no aircraft I had ever seen before, NOT EVEN CLOSE and I know what I saw. I will continue to look for the paper I wrote about it, once found it will give me the Date, and time of my sighting. I could (and did on the memo I wrote) draw a sketch of the craft I saw. Thank You for your time in this, I am sure it will be of no use to you but I know what I saw. Retired Military"],"Source":"MUFON","Longitude":"-73.273505","Log Number":"US-05042012-0008","Case Number":"37910","Date Submitted":"05/04/2012 03:06 UTC","Tags":"City","Disposition":"Unresolved","Summary":"Round with a dome top White, Blue and Red/Amber lights pulsating or swirling around the object, actually I think it was spinning but not at a high rate of speed.","map":"<A HREF = \"http://maps.google.com/maps?q=44.831143,+-73.273505(37910)&iwloc=A&hl=en\"> mufon case (37910) map </A>","Object Features":"Dome","Country":"United States","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Object Shape":"Circle, Disc","Sighting Duration":"Undisclosed"}