{"files":["/var/www/straped/mufon/html2text/37913.html.txt","/var/www/straped/mufon/org/37913.html"],"Date of the Event":"05/03/2012 07:15 UTC","Region":"Florida","Log Number":"US-05042012-0010","Latitude":"26.061013","Country":"United States","Date Submitted":"05/04/2012 07:21 UTC","Case Number":"37913","trends":["There have been 3 other sightings in Cooper City","There were no other sightings in Cooper City on or around May 3rd 2012"],"Object Features":"Undisclosed","Object Shape":"Boomerang, Triangle","City":"Cooper City","Tags":"City","Longitude":"-80.294988","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","divs":["Sighting DetailsI observed what appeared to be a black balloon floating, but in the flight path that many aircraft fly routinly in the area. It struck me odd that previously a craft flew by with the lights on being that it was just before dusk. With the nakedgeye it apeared to be the size of a half carrot diamond, and had a steady, soundless track NW and smoothly turned west. I went into my home to get binos, (less than 30 sec.) and re-aquired the object still heading west. It was below cloud level and with the binos it was the size of a half of a dime, solid black, no lights, and at first glance looked like a oak leaf, and then the state of Texas. I gave the binos to my wife and she said it looked more like triangle (she was sitting I was standing). That prompted us to do a google search on UFO sittings on found out the have been numerous sitting worldwide of simmilar objects in the last week. about ten minuts later, what appeared to be a passenger jet flew the same pattern, but with binos I did not see any passenger windows, followed by another simmilar jet a minute later. On the next day, at approximatley 5:30pm, two fighter jets flew over the similar flight path. I do reside about 50 miles north of Homestead AFB. but have never seen any jets over my house."],"Summary":"Oak leaf / State of Texas","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=26.061013,+-80.294988(37913)&iwloc=A&hl=en\"> mufon case (37913) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Over One Mile"}