{"Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Manhattan","There were no other sightings in Manhattan on or around May 4th 2012"],"Date of the Event":"05/04/2012 05:30 UTC","files":["/var/www/straped/mufon/html2text/37914.html.txt","/var/www/straped/mufon/org/37914.html"],"Summary":"Possible Abduction ?","Viewing Distance":"Unknown","Object Shape":"Unknown","Region":"New York","Case Number":"37914","divs":["Sighting DetailsThis morning I left my home to catch the 4:15 am train towards Brooklyn. I have been doing this same route almost 12 years this coming November 2012. I rode the 6 train down to Brooklyn Bridge. I sat on the first car by the doors of the train where people can change from car to car. The train ride itself was of no event. It was smooth, good, I prayed, chanted OM, listened to a meditation CD on my IPHONE, I ate a Zone Bar, and balanced my check book. The train arrived to Brooklyn Bridge stop. I got out and walked towards the plat form across and made a left to walk upwards towards the middle back of the pending on coming train 4 or 5 towards Atlantic Ave Station. Due to the fact the stairs to get out are towards the back at this time, then off to star bucks for a Cappuccino. The sign said 4 train in 13 minutes. There was nothing unusual about anything. I seen some people still sitting on the 6 train and wondered why they did not get out, it was the last stop. Usually the conductor gets everyone off. But no conductor and people were just sitting. I lean up against a rail by the steps, and lean my back against the handrails, my right body leaned up against the steal larger bar from floor to ceiling. I observe a man across on the Up Town side of the tracks, homeless, older gentlemen, I think, \"poor guy, all these years of mental Illness ( the field I work in) and still this man has no help. So, I see another man, checking me out. I look at him, he is wearing shorts, carrying a large duffel bag. I look back again, and still all the passengers are sitting waiting for the same train-Down Town Brooklyn 4 or 5 train. I lean my head against the steel beam while I look, observe, and then closed my eyes and began to chant Om to the music. I hear the train coming, I look up number 4. All the people behind me get up and enter the train. I feel relieved, its here on my way to work, coffee, get notes and paper work done. I get on the train, and I walk and find a seat. Then I am lost when I look up I see I am at the Astor train stop. I am confused, I become scared, I can't understand why, how, did I get on the 6 train up town to the Bronx. Conductor says \"next stop 14 street Union Sq\". Now I say wait, \"How did I cross over the other side of the tracks to catch the 6 train?\" I am dazed, confused, frightened, I want to cry, but I cannot, I am like in shock, I am in Union Sq, 14 street, How did I get here, I cannot remember anything,I am confused, but at the same time I feel I have been dragged back and forth in time. I feel my mind, 'here and there.\" I am supposed to be on the 4 train headed to Brooklyn, I got on it, I saw it, I waited 13 minutes. Now I am on Union sq, 14 street, and I keep saying what happened how did I get here, Tears welling, questions, I am light headed. I am confused, Train sign says 9 minutes before the 4 train to Brooklyn arrives. I wait I am confused I am frightened. How did this happen, I am not sure, something happened to me, I am on one side of the tracks, then I am on the 4 train to Brooklyn but now I am headed to Union Sq. I called a MUFON person contact, she said I may need medical attention. I made an appointment with a Neurologist. But I think I, I, was taken. Things have been happening in the last several years and now this."],"Longitude":"-73.971249","Latitude":"40.78306","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-05042012-0011","Weather Factors":"Unknown","Date Submitted":"05/04/2012 07:27 UTC","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.78306,+-73.971249(37914)&iwloc=A&hl=en\"> mufon case (37914) map </A>","City":"Manhattan","Country":"United States","Object Features":"Undisclosed"}