{"Summary":"Star like / flair / or weather ballon","divs":["sighting detailsi just pulled into my driveway on my way home from work; when out of the corner of my eye i notice strange lights. i'm very into astrology and look up at the sky every night. what i saw surprise me. it was 4 reddish \\ orange star like circles in the sky. they were pointed towards buffalo ( west ) roughly 500ft in the sky and were about the size a normal star. they were in a diagnoal line that was shape the same as the big dippers handle. . . . . this would be an example of how it appeared. i study the moving objects for about a minute. they all move from right to left and then traveled upward at about the same speed. it was noticeably slow. look around 10-30mph if i had to make a guess. about a minute later they disappeared \" or fizzed \" out. i would say the lights were directly over the town of lancaster\\depew. if i had to make a guess, they were flairs; but being over a town made it very odd. the reason flairs didn't make too much sense is because of the flight path. they were falling but moving right to left and then up. making it very strange. but they did have a \"fiery\" glow to them like mars does. i tried taking a picture \\ recording a video on my phone but my camera quality is too weak to pick it up. very strange."],"Sighting Duration":"00:01:00","Object Flight Path":"Path with directional change","Object Features":"None","Longitude":"-78.663646","Case Number":"37927","Viewing Distance":"Over One Mile","Object Shape":"Circle, Sphere","Region":"New York","Log Number":"US-05052012-0008","Country":"United States","Source":"MUFON","Latitude":"42.903284","map":"<A HREF = \"http://maps.google.com/maps?q=42.903284,+-78.663646(37927)&iwloc=A&hl=en\"> mufon case (37927) map </A>","Date Submitted":"05/05/2012 10:52 UTC","files":["/var/www/straped/mufon/html2text/37927.html.txt","/var/www/straped/mufon/org/37927.html"],"Date of the Event":"05/04/2012 09:30 UTC","trends":["There have been 2 other sightings in Lancaster","There were no other sightings in Lancaster on or around May 4th 2012"],"Weather Factors":"Unknown","City":"Lancaster","Disposition":"Unresolved","Tags":"City"}