{"Summary":"4 Bright red/orange orbs, flew straight & disappeared","divs":["sighting detailssitting with some friends at coffee when one of them facing me said \"hey, what's that?\" and pointed to something behind me. i turned around to see what was clearly a helicopter or airplane flying but surrounding it a little further in the distance were 4 \"orbs\", glowing orange\\red. looked like they could have possibly been in a v formation, but not a part of one unit, and the angle at which we were looking at them made it also difficult to tell if there was a true formation in the flying pattern. the orbs did not hover but rather continued to move in a straight line and then one at a time each orb slowly dimmed out until none of them could be seen anymore. this happened in about a minute time span, maybe slightly more or less. nothing more was seen and the helicopter\\airplane just continued on it's way. i was present during the first phoenix lights in az and saw them first hand. although these did not hover or seem to be in a clear flying formation, the color and shape seemed very similar to the first sighting in 1997. i am not a huge ufo person and i am not a person who would typically seek out this kind of site, however this is not the first time i have seen this in the last couple years and it frequently seems to be unreported, as if no one else saw it. so, i thought i would throw this out there and see if anyone else saw what i saw. i was at mcclintock and southern when it happened in tempe."],"Object Features":"None","files":["/var/www/straped/mufon/html2text/37925.html.txt","/var/www/straped/mufon/org/37925.html"],"Date Submitted":"05/05/2012 04:41 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Country":"United States","Date of the Event":"05/04/2012 11:30 UTC","Log Number":"US-05052012-0006","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.42991,+-111.938305(37925)&iwloc=A&hl=en\"> mufon case (37925) map </A>","City":"Tempe","Viewing Distance":"Over One Mile","Latitude":"33.42991","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Region":"Arizona","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around May 4th 2012"],"Tags":"City","Longitude":"-111.938305","Case Number":"37925","Source":"MUFON"}