{"Log Number":"US-05052012-0004","Date Submitted":"05/05/2012 02:53 UTC","Country":"United States","Weather Factors":"Unknown","Case Number":"37923","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around May 4th 2012"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=45.541008,+-122.778954(37923)&iwloc=A&hl=en\"> mufon case (37923) map </A>","Region":"Oregon","Disposition":"Unresolved","City":"Portland","Object Flight Path":"Path with directional change","Source":"MUFON","Date of the Event":"05/04/2012 10:05 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/37923.html.txt","/var/www/straped/mufon/org/37923.html"],"Sighting Duration":"Undisclosed","Longitude":"-122.778954","divs":["Sighting DetailsWe were driving on I-84E to go to the Portland Airport when we saw 11 or 12 glowing yellow spheres in a formation in the sky to the left of the car. At first I thought they might be planes coming into the airport, but after a few moments it was obvious they were something else. They didn't seem to move like helicopters or any planes I could think of. For the next few minutes we peered out the windows as we drove and watched the lights slowly drift from the North to the South in a chain that drifted closer and farther from each other. They also seemed to get brighter and dimmer, though I wouldn't exactly say they were flickering. Eventually as we merged onto 205 the lights grew dim as they headed South and soon after merging they disappeared altogether. Whether they disappeared rapidly or we just lost sight of them is hard to say. Honestly, at first we just sort of shrugged it off as something odd, but not too strange, but when we got home we happened to glance at the Portland Monthly and saw a report of exactly the same thing in the same neighborhood on March 9, 2012. That was also what led us to MUFON."],"Object Shape":"Sphere","Latitude":"45.541008","Summary":"11-12 Orbs Hovering in the Sky Over SE Portland","Object Features":"None"}