{"Object Features":"Undisclosed","Latitude":"42.2","Source":"MUFON","Date Submitted":"08/25/2005 08:30 UTC","Object Shape":"Undisclosed","trends":["There has been one other sighting in Holliston","There were no other sightings in Holliston on or around August 25th 2005"],"Date of the Event":"08/25/2005 08:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Log Number":"US-08312005-0004","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.2,+-71.425(3792)&iwloc=A&hl=en\"> mufon case (3792) map </A>","files":["/var/www/straped/mufon/html2text/3792.html.txt","/var/www/straped/mufon/org/3792.html"],"Sighting Duration":"Undisclosed","City":"Holliston","Case Number":"3792","Disposition":"IFO","Summary":"this is an authentic missing time event","Region":"Massachusetts","Viewing Distance":"Unknown","Longitude":"-71.425","divs":["Sighting DetailsI was at a local pond unwinding. this location is an access point for small boats like canoes and puddle jumpers. it is a quiet spot in the burbs but not an isolated one. i frequent this spot and do a little fishing etc. allot of people go there. it closes at dark although there are no gates. on this particular night i was star gazing at sunset as it was a good observation point to watch an unusual planetary alignment that had been going on for at least a week. I'm not an expert on star gazing but the planets seemed to be in the western sky near a crescent moon. as the moon cycle changed it moved away from the planets. anyway i gazed for what i thought was about 15 min and decided to call it a night and started back to my truck. As i approached my truck i could see police on the other side of the pond in the local cemetary shining thier spotlights into the area i was parked. i thought, jeez i better get out of here or the'll be down here busting my chops for being here after hours. i drove home. when i got home it was 10:30 pm an utter impossibilty i only live ten minutes from the boat launch. i estimated my time being there as 1 hour tops. i got ther about 15 min before sunset and as stated only gazed for 15 minutes maybe 30 minutes tops. when i started thinking about the whole ordeal i got very confused. were the police on the other side of the pond investigating something? i have never seen them in this location with spotlights and i have no clue why they would be looking from that location to my location as they could have just driven over to where i was in about 5 minutes. It Does Not Make Sense? I also noticed that i had a sore on my lower back that itched and had like a kinda a welt near it. it wasn't painfull or anything just itchy. it was gone the next day. well this is my story, it is completely true. I estimate i cannot account for approximatley one hour of time perhaps a little more. I dont have any recollection of anything like an abduction happening or anything like that . but i can assure you something happened down there. what it was i cannot say but i am still puzzled some days later."]}