{"Log Number":"US-05052012-0013","Date of the Event":"05/05/2012 05:15 UTC","Date Submitted":"05/05/2012 03:48 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI walked out side to talk to my mom and I happened to look up. I saw a bright light, as bright as Venus moving in the sky. I know it was not Venus though because Venus had set like 7 hours earlier. It was very bright but seemed to have a haze to it. As soon as I saw it I called my mom over and she witnessed this too. The light was moving South West. It then dimmed and changed direction to the East. It traveled some distance then stopped. When it stopped it looked exactly like a faint star. It did not pulsate or anything. Right at this moment a shooting star shot through the area and I lost track of the first UFO. A few seconds later another UFO appeared in the same area. I don't think it was the first one because it was 8 inches away at arms distance. Anyways, it was yellowish and was traveling towards the South West then slowly turned till it was going South East where it disappeared. There was no sound at all to indicate it was helicopters or jets. The funny part about all this is I had just watched the movie Altered which is a really scary alien movie but when I saw these I wasn't afraid at all. All I felt was excitement and wonder."],"Summary":"Two bright UFOs and a shooting star.","files":["/var/www/straped/mufon/html2text/37932.html.txt","/var/www/straped/mufon/org/37932.html"],"Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Latitude":"34.387759","Weather Factors":"Unknown","Object Shape":"Star-like","City":"Hesperia","Longitude":"-117.334202","Country":"United States","Case Number":"37932","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.387759,+-117.334202(37932)&iwloc=A&hl=en\"> mufon case (37932) map </A>","Source":"MUFON","trends":["There have been 8 other sightings in Hesperia","There were no other sightings in Hesperia on or around May 5th 2012"],"Region":"California","Viewing Distance":"Over 1 Mile, Unknown"}