{"Disposition":"Unresolved","Region":"Oregon","Date of the Event":"05/04/2012 10:02 UTC","Summary":"Bright colored orbs ascending into the clouds and disappearing above the cloud line!","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/37930.html.txt","/var/www/straped/mufon/org/37930.html"],"Longitude":"-122.672137","map":"<A HREF = \"http://maps.google.com/maps?q=45.527332,+-122.672137(37930)&iwloc=A&hl=en\"> mufon case (37930) map </A>","Latitude":"45.527332","City":"Portland","Object Flight Path":"Other","Object Features":"Unknown","Log Number":"US-05052012-0011","Date Submitted":"05/05/2012 01:13 UTC","Object Shape":"Fireball","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy Girlfriend and I where at home watching T.V. and received a phone call at 10:02pm last night from a friend who frantically told us to go outside and look into the sky. This excited us after seeing numerous orbs in the sky last summer above our house we immediately ran outside. We attempted several different recording methods but we couldn't get good video. Our 12 year old daughter was also with us and witnessed her first sighting. We witnessed 15+ orbs moving upward into the cloud line and from our perspective we could see just above the clouds where the orbs should have become visible again. BUT DID NOT! THEY VANISHED! We witnessed several of the orbs glowing in and out almost to the point of fading out and then getting brighter as they moved oddly up into the sky! This lasted roughly 20 minutes from begging to end. We did not see it start so its unclear on how long this event lasted. In total there were 3 friends in the car who called us to tell us about the orbs and there was myself my girlfriend and our 12 year old daughter so at least 5 other people besides myself that I know of saw the event!I personally felt very overwhelmed at first but then felt hypnotized by its wonder and felt calm and peace. Very weird emotion."],"Source":"MUFON","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around May 4th 2012"],"Country":"United States","Case Number":"37930","Tags":"City","Weather Factors":"Unknown"}