{"Source":"MUFON","Region":"Texas","Object Flight Path":"Path with directional change","Latitude":"30.177328","Log Number":"US-05052012-0016","map":"<A HREF = \"http://maps.google.com/maps?q=30.177328,+-97.830189(37935)&iwloc=A&hl=en\"> mufon case (37935) map </A>","City":"Austin","Tags":"City","Longitude":"-97.830189","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"37935","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/37935.html.txt","/var/www/straped/mufon/org/37935.html"],"Date Submitted":"05/05/2012 06:47 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Summary":"Saw two lights in upper atmosphere moving beyond normal flight...","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around May 5th 2012"],"Object Shape":"Fireball, Sphere, Star-like","divs":["Sighting DetailsLast night behind my apartment building in south Austin Texas, I was watching the Moon, when my girlfriend and I witnessed an unusual light in the sky. The light was about two, (outstretched arm), phone lengths North of the Moon. My girlfriend noticed the object saying it changed altitude very fast. Then she brought mt attention to it. It was very noticeable having a starlit or fireball quality about. At first I thought it was a satellite but soon began doing things that are no indicative of known satellite or aircraft. The movements seem very controlled and sporadic. After each outburst it was joined by a second \"light object\". Then the second \"light object\" would move away and the movements began again. Back and forth, then S curves and Circles, in diferrent combinations all very precise. I felt as if I was watching a hi-tech flight exercise. The second \"light object\" playing the instructor and the first \"light object\" would carry out the exercise. All this lasted for 20 minutes... perhaps a lot longer as it was very cloudy and after this 20 minutes the clouds became so thick we could no longer see anything but cloud. I filmed about 5 minutes or so on my phone but the \"light objects\" were to high in the atmosphere to make a visable appearence."],"Date of the Event":"05/05/2012 01:19 UTC"}