{"Case Number":"37936","Longitude":"-81.730518","Sighting Duration":"00:08:00","Object Flight Path":"Path with directional change,Path then hovering","trends":["There has been one other sighting in South Charleston","There was one other sighting in South Charleston on or around May 5th 2012"],"Object Features":"Appendage(s), Wings, Other","Disposition":"Unresolved","Summary":"and then seen with binoculars; rotated without any extensions; then rotated with \"things\" sticking out of object. First looked like a balloon; then blimp; then went up out of sight without binoculars; then with, spotted. Smaller","Date Submitted":"05/05/2012 10:16 UTC","Date of the Event":"05/05/2012 08:30 UTC","City":"South Charleston","Tags":"City","Log Number":"US-05052012-0017","Weather Factors":"Unknown","Region":"West Virginia","Source":"MUFON","Latitude":"38.360267","files":["/var/www/straped/mufon/html2text/37936.html.txt","/var/www/straped/mufon/org/37936.html"],"Country":"United States","divs":["sighting detailssitting on my back porch enjoying the evening. just a large black thing appeared in the direction i was looking (westerly). possibly a black, large balloon? then a blimp that became kind of \"wavy;?\" when i got my binoculars, i couldn't locate it; then found it very high up in the sky; moving in a straight direction, while at times rotating while appearing to stop, with \"things\" sticking out of object, looking somewhat like a bug with legs, then again without anything sticking out. by then it had moved in a direction (se) disappearing behind the leaves of my large trees. i called my friend to search her skies and they saw nothing. my feelings during this was that it looked quite a bit like the \"flying people\\witches\" i've seen on internet reports of south america. never seen anything like it. no sound. very strange."],"Object Shape":"Blimp, Oval","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.360267,+-81.730518(37936)&iwloc=A&hl=en\"> mufon case (37936) map </A>"}