{"Summary":"Orangish ball came from W heading E, slowed down, stopped in mid air and then began to disintergrate","Object Shape":"Fireball, Sphere","trends":["There has been one other sighting in Halton Hills","There were no other sightings in Halton Hills on or around May 5th 2012"],"Log Number":"CA-05062012-0006","Country":"Canada","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"05/06/2012 09:46 UTC","Case Number":"37948","divs":["Sighting DetailsSitting in the backyard with my wife when we noticed an object coming from the West, we are on a flight path for planes coming into Toronto Pearson airport, but the planes never come in from that direction, so we watched this object. It appeared to be about the same speed as a plane at high altitudes. We knew it wasn't a plane as I did not notice any flashing lights on it. Wasn't sure what it was, so got my binoculars, but since they were not very good, couldn't properly focus on it. It had an orangish red glow to it and appeared to be about the size of a bright star. It then slowed down and basically came to a stop which really made me wonder. So we watched and then it just started to slowly disappear right in front of our eyes. I now feel very strange, never seen anything like it and went on line last night and this morning to see if anybody else saw it..couldn't find nothing and no news on the TV or Radio about it! Do you have any explanation, would be interested in hearing your comments. Thank you PS..we both saw it, not a figment of my imagination."],"Tags":"City","files":["/var/www/straped/mufon/html2text/37948.html.txt","/var/www/straped/mufon/org/37948.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.641667,+-79.889135(37948)&iwloc=A&hl=en\"> mufon case (37948) map </A>","Date of the Event":"05/05/2012 09:32 UTC","Latitude":"43.641667","Weather Factors":"Unknown","Region":"Ontario","Object Features":"None","Object Flight Path":"Path then hovering","City":"Halton Hills","Longitude":"-79.889135"}