{"Date of the Event":"05/05/2012 11:15 UTC","City":"Zanesville","Latitude":"39.986729","Summary":"Three small white objects flying triangular from north to north east right object veered to right as course changed no sound very high speed","Country":"United States","Case Number":"37940","Source":"MUFON","Date Submitted":"05/05/2012 11:57 UTC","divs":["Sighting DetailsThree small white 'orbs' flew over the home, no sound, about , this is a guess, 5,000 to 8,000 feet, I'n a triangular formation at very high speed with no sound. The objects changed direction and as they did so the right object changed direction just hesitant of the other two then went back into formation. The objects continued on I'n a north easterly direction and went out of site I'n approximately 30 to 45 seconds. Inwas I'n my back yard wanting to view the full moon as it's the largest of the year. I was viewing the moon and had just watched several jet liners traverse the area. On seemed to traverse from west to east uncommonly fast about a half hour previous. I was scanning the sky when suddenly this 'formation' came into view? It was very unusuall , moving very fast and what struck me was it was totally without any noise. I was shaken by this... The objects moved off to the north east and went out of visual sight I'n about 30 to 45 seconds. Very unusual ."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.986729,+-82.019189(37940)&iwloc=A&hl=en\"> mufon case (37940) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37940.html.txt","/var/www/straped/mufon/org/37940.html"],"Object Features":"Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Region":"Ohio","Log Number":"US-05052012-0021","Longitude":"-82.019189","Sighting Duration":"00:01:00","Tags":"City","Object Shape":"Sphere","trends":["There have been 2 other sightings in Zanesville","There were no other sightings in Zanesville on or around May 5th 2012"]}