{"Object Features":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37956.html.txt","/var/www/straped/mufon/org/37956.html"],"divs":["Sighting DetailsHi! I live about 7 miles southwest of LAX. Usually planes do not fly over me. They usually fly around south of me in Palos Verdes because of noise ordinances here in Torrance. Normally, we have, in the southbay. a heavy marine layer from the ocean so seeing stars is a real treat when we can. Last night I was cleaning my house. It was about 9pm at night. I wasn't tired. And, I went out on the balcony to shake out some rugs in my house. I stopped to notice the marine layer gone and how beautiful the stars were that evening. I looked up towards Venus. It's like the largest star. There was about 4 stars that I could make out that night. I had my direction directly above and low and behold there was something moving. It had no lights that were very bright. And it appeared totally black. Against the black sky, one would have missed it if they were not looking directly at it. It moved at a normal airplane pace but there was no noise. My line of site followed it. If I looked away, I probably might have lost it. It was heading northwest towards LAX in a straight line. Planes do not head in that direction usually. When they land at LAX they do so from the East to West on a clear night. As I tried to make out this opaque plane, I could tell there were 6 dim lights on the bottom of it. These lights followed a triangular pattern on the bottom of the object. My gaze followed it for about 3 to 5 minutes until I could not see it anymore. My first thought was it was heading towards Vandenburg air force base. We frequently get a lot of rockets and entrails around that direction. My second thought was that it was some kind of military drone. But, why the triangular shape? And silent, totally silent. Or, maybe it was that stealth bomber. I'm not sure if the stealth bomber is totally silent when it flies. And does the stealth bomber have about 6 lights on the bottom? It appeared the same description as the Phoenix lights triangle object but not that large. It's hard to distinguish how big it was or how far away because there was no noise coming from it and that would have given me a frame of reference in deciding how big it was or how far away it was. I thought it was very interesting and left me scratching my head."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.824708,+-118.365317(37956)&iwloc=A&hl=en\"> mufon case (37956) map </A>","Date of the Event":"05/05/2012 09:00 UTC","Summary":"Silent Dim Black Triangular object seen over Los Angeles","trends":["There have been 16 other sightings in Torrance","There were no other sightings in Torrance on or around May 5th 2012"],"Source":"MUFON","Region":"California","Disposition":"Unresolved","City":"Torrance","Date Submitted":"05/06/2012 12:35 UTC","Longitude":"-118.365317","Object Shape":"Triangle","Case Number":"37956","Viewing Distance":"501 Feet - 1 Mile, Unknown","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Straight-line path","Country":"United States","Log Number":"US-05062012-0013","Latitude":"33.824708"}