{"Tags":"City","City":"Des Moines","Log Number":"US-05062012-0017","files":["/var/www/straped/mufon/html2text/37959.html.txt","/var/www/straped/mufon/org/37959.html"],"Sighting Duration":"Undisclosed","Object Shape":"Star-like","divs":["Sighting DetailsI was walking south in my in-laws driveway toward my car parked on an east-west street. I was looking up at the \"supermoon\" when I saw this reddish-colored round object (star-like in shape) moving at steady high-rate of speed (over 200 kts) from east to west at about 20 degrees above the horizon. The Des Moines International Airport was about a half-mile away from my position and aircraft would not be allowed (nor would have a reason) to move that fast that close to the airport. The object had no position or strobe lights. The object was not descending as to land at the airport. The east to west object was momentarily shrouded by lower altitude clouds moving south to north and by trees south of my position but did appears a few moments later and was still on its straight line path westbound. Being a private pilot, I do not believe what I saw was an aircraft of any kind, despite its proximity to the airport. My first reaction was, I had seen red-colored chinese lanterns before and had been fooled into believing that they were a UFO. However, this object did not behave like a chinese lantern. It moved much faster and did not flutter like the chinese lanterns do. I lost sight of the object as it reached the western horizon about 2-3 minutes later."],"Object Flight Path":"Straight-line path","Summary":"Saw reddish-colored star-like object moving east to west.","map":"<A HREF = \"http://maps.google.com/maps?q=41.547935,+-93.651797(37959)&iwloc=A&hl=en\"> mufon case (37959) map </A>","Latitude":"41.547935","Longitude":"-93.651797","Viewing Distance":"Over One Mile","Region":"Iowa","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around May 5th 2012"],"Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"05/06/2012 02:30 UTC","Disposition":"Unresolved","Case Number":"37959","Object Features":"None","Date of the Event":"05/05/2012 10:05 UTC","Country":"United States"}