{"Date of the Event":"05/03/2012 10:15 UTC","Case Number":"37969","files":["/var/www/straped/mufon/html2text/37969.html.txt","/var/www/straped/mufon/org/37969.html"],"Disposition":"Unresolved","Summary":"unknown pulsating light hover and direction change","trends":["There have been 17 other sightings in Greenwood","There were no other sightings in Greenwood on or around May 3rd 2012","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.560406,+-86.100744(37969)&iwloc=A&hl=en\"> mufon case (37969) map </A>","Country":"United States","Sighting Duration":"00:05:00","City":"Greenwood","Object Features":"Other","divs":["Sighting DetailsOn the night of may 3rd I was in my back yard between the time of 9:30 pm and 10:00pm.I noticed what looked like a strange colored star in the south western sky it was yellow to orange and I noticed it seemed to turn red a bit at times. I know the night sky pretty well and realized this light was out of place.I watched the light for a couple minutes and it didnt move at all. I then went in the house and probably about 15 minutes ( give or take) I went back outside and i noticed the light that was in the south western sky was huge and just barely over the house tops and it was moving down and a little to the north .The object then vanished into thin air . As soon as the object vanished another object or possible the same one appeared up high in the sky where I fist saw the original one start.I then ran in my house and got my digital cam corder and started recording .The object decended just over the house tops and got real bright and then dimmed and vanished.The object made no noise."],"Longitude":"-86.100744","Latitude":"39.560406","Source":"MUFON","Log Number":"US-05062012-0025","Object Shape":"Circle, Fireball, Sphere, Star-like","Region":"Indiana","Tags":"City","Date Submitted":"05/06/2012 08:48 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Hovering then path"}