{"Disposition":"Unresolved","trends":["There has been one other sighting in Cerritos","There were no other sightings in Cerritos on or around August 19th 1985"],"files":["/var/www/straped/mufon/html2text/37962.html.txt","/var/www/straped/mufon/org/37962.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.867348,+-118.063197(37962)&iwloc=A&hl=en\"> mufon case (37962) map </A>","Object Shape":"Circle, Disc","Case Number":"37962","Date Submitted":"05/06/2012 03:23 UTC","Latitude":"33.867348","Source":"MUFON","divs":["Sighting DetailsLong summer day. Laying in backyard by pool after a BBQ I was just looking up at the beautiful clear blue sky. I noticed a white round balloon, or at least thats what I thought it was at first. I thought I would just watch it until it drifted away by the wind, but it didn't. It was breezy on the ground and I thought it should drift away from sight after awhile. Then I noticed another one close to it. After about ten minutes these objects didn't move. Stay equil didstance apart, did not drift away. My eyes were tired of stairing up. So I looked away for alittle. A friend of the family asked what I was doing. I told him what I was looking at. He joined me at looking up. They were hard to see, but we found them lookin 90 degrees overhead. Now there were more. In groupings of 3, at least 3-4 sets and a count of 14 total. You couldn't see all at once. I really had to focus on one small area to see two groups of three. Light blue sky in background, soft white disk. 3 out of 5 people were able to focus on the objects and confirm what I was seeing. They appear to be the size of a BB at twice an arms length. So my estimate was it was small and local or large and far. My guess was large and in upper atmosphere. This was arround 5pm and the sun didn't set until 8pm. I was guessing the under side was being elluminated by the reflection of the sun off the Pacific( Just a guess ). The sighting happened for about 45 minutes. Slowly disappeaing. Never changed location in sky. Always equil distance from each one and equil distance from each grouping. The exact date has been forgotten since it has been 25 years ago. Mid 80's summer time. Hoping that others might have info."],"Longitude":"-118.063197","Region":"California","Object Features":"None","Object Flight Path":"Stationary","Date of the Event":"08/19/1985 12:00 UTC","City":"Cerritos","Summary":"Multiple white disk at high altitude, Slowly appearing one at a time. Small grouping of 3 in a triangle arrangement in clear daylight.","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-05062012-0020","Viewing Distance":"Unknown","Weather Factors":"Unknown"}