{"Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Date of the Event":"07/10/2006 01:30 UTC","Region":"Alberta","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Boomerang","Source":"MUFON","Object Features":"Patterned Surface, Other","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Case Number":"37968","Longitude":"-118.793172","City":"Grande Prairie","Log Number":"CA-05062012-0024","Summary":"Silent boomerang shaped Ufo materializes out of clouds above our heads","map":"<A HREF = \"http://maps.google.com/maps?q=55.178022,+-118.793172(37968)&iwloc=A&hl=en\"> mufon case (37968) map </A>","Latitude":"55.178022","divs":["Sighting DetailsIt was July 2006.About 1:30am. My husband and I were stargazing at a park near our house. We sat on a hillside, overlooking the park, and at the edge of someone's yard. The sky was bright and full of stars, but there were some low clouds covering the western sky, which were getting closer to us. I was looking almost straight up. The edge of the clouds were right above us. Suddenly below the clouds a boomerang shaped craft \"appeared\". It was getting closer to us, coming at us, and getting bigger. It seemed like it dropped out of the cloud. It descended towards us for a couple seconds, then it stopped. It started moving south east in a slightly curved line and then it suddenly stopped made a 90 degree rotation (the whole craft turned like a steering wheel- staying flat)and then turned back (the turn seemed to give it propulsion to take off at an incredible rate of speed.) There is only 1 tall building in town. It disappeared behind the building, but got noticable smaller (further away) as it did so. As I was watching, I tried to get my husband's attention, but I was in awe and by the end he was saying \"what?\" but it was already over.. The whole thing lasted maybe 10 seconds but that was long enough to get a good look. I thought it was a smaller craft at first, but I calculated the distance of the cloud cover and realized if it was truely that far away (about 1000ft feet) then it must have been huge, for me to see the details I saw. It blended in to the night sky. The texture reminded me of what you would see on a movie space ship. Metal came to mind. (In my included pic, I have put a sample of a ship online in the bottom left corner as an approximation) It had 4 red \"lights\" on each side (I think the inner side, but it may have been the outer side, as it was 6 years ago) and what looked like a trap-door in the middle. The \"lights\" were not turned on. (Like I said, the whole thing seemed to blend in with the sky) I tried to discount it as a plane, but planes don't move that fast or turn the way it turned. Afterwords, I said to my husband \"did you see that?\". He said \"see what?\" so at first I thought maybe I was hallucinating. I explained to him as we walked home. I was now losing the awe and calm and excitement of the initial sighting and I began to get scared. It came down right on top of us, so I entertained thoughts that it wanted to abduct me. I was so terrified after that, I slept with the lights on for 4 days. Only about 10 people knew about this, until now. I decided to tell before the memories get too hazy."],"files":["/var/www/straped/mufon/html2text/37968.html.txt","/var/www/straped/mufon/more/37968_submitter_file1__Nightskyplainwcraft.png","/var/www/straped/mufon/org/37968.html"],"Date Submitted":"05/06/2012 08:35 UTC","trends":["There have been 3 other sightings in Grande Prairie","There were no other sightings in Grande Prairie on or around July 10th 2006","This sighting has never been favorited.",""],"Country":"Canada"}