{"Case Number":"37963","Log Number":"US-05062012-0021","Country":"United States","City":"Morehead City","Summary":"Observed a spherical shaped light.","Longitude":"-76.721472","Tags":"City","Region":"North Carolina","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Morehead City","There were no other sightings in Morehead City on or around May 5th 2012"],"Object Features":"Unknown","Date of the Event":"05/05/2012 09:28 UTC","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Latitude":"34.720202","divs":["Sighting DetailsMy sighting occurred at night, around nine thirty or so on May 5 2012. This was just last night. I felt to urge to smoke a cigarette, so I went out the back door of my home. A storm was rolling in and I could feel water droplets against my forehead. I decided that it would probably be a better idea to sit in the swing on our front porch. So I put them back in my pocket and withdrew inside. My Mom was sitting in the recliner next to the television and my father on the sofa to her right. I told them that it felt like it was going to rain and where I would be if they needed me. I walked through my house and onto the front porch. It had not yet began to really rain but just sprinkle. I usually put my headphones on and listen to music when I go outside to smoke when I'm at home, not at work of course. I was about to turn my mp3 player and just happen to look up out skyward. At night I like to look at the stars and the Moon, but there was nothing but clouds, the radio tower across the street, and a strange red light. I put my player back in my pocket and let my headphones dangle around my neck as I was trying to grasp what I was looking at. There is a cellular tower perhaps a block away from the radio tower. There is a beacon on top of it that flashes at a constant rhythm to warn any aircraft that is flying through the area. The beacon's light is almost like a light blue, white color. The object I saw I assumed to be a plane, but its pattern didn't match that of an aircraft. It was as bright as the beacon, but with aircraft you can sometimes make out their shape by the distribution of the lights. This thing was almost entire composed of red light. At first I thought of flares and the airshow that is going on at MCAS Cherry Point. The base is in Havelock, which is a good distance away, and with the coming storm I doubt they would have been flying any planes. I stepped out onto the side walk to get a better look. I cannot say for certain that it passed in front of or behind the radio tower, but it looked to be some distance away. I was overcome by curiosity and excitement. My first thought was to get my camera phone, but given my phone's camera doesn't work that well, I decided to observe and maybe get some close by to help me evaluate just what I was seeing. So I rushed to the front door and called my parents to come and see. I kept looking back to keep it in sight. The lights path took it from the point where I first observed it, passed the radio tower, and some distance away before it finally disappeared. My view was not interrupted by any buildings or trees, but I did move around in front of my home to observe it. Before it disappeared, it seemed to dim a bit almost out of sight but then brighten almost to full intensity. Then it began to slowly blink until finally it was out of sight. I called again to my parents to come and look, by this time my father was making his way slowly up the hallway. By the time he and my mother made it to the front porch, the object was out of sight, presumably gone. I told him and my mother about what I saw. He said it could have been a plane, but then he also mentioned that planes would fly in this weather. They assumed it was my eyes playing tricks on me, so they went back inside. The storm was really picking up at this point and I could see the lightning streaking across the sky. I decided to stay, under the shelter of the porch for a time to see if the object would come again. After a while I gave up and went back inside. I went to my room thinking about what I had just seen and that I wanted to tell someone that might listen to me. To be honest, I texted my friends and told them I just might have seen a UFO. My friend and his wife that live close by said that it might have been a chinese lantern. I do know that these kinds of lanterns might be kicked up by the wind, but they do not shine with the intensity of the object that I witnessed. I tried talking to my coworkers today about it and asking if anyone had seen a bright red light in the sky last night. None of them claim to have seen what I saw. I'm sorry that I do not have any photographs to submit, but they would have been of poor quality as the object was emitting light. The way I figured it would have been best to tell you of my experience. Maybe you can make some sense of what I saw. Thank you for listening."],"Disposition":"Unresolved","Date Submitted":"05/06/2012 04:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.720202,+-76.721472(37963)&iwloc=A&hl=en\"> mufon case (37963) map </A>","files":["/var/www/straped/mufon/html2text/37963.html.txt","/var/www/straped/mufon/org/37963.html"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"Unknown"}