{"Summary":"4 balls of white light flying in a diagonal line","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"Greece","Log Number":"GR-09022005-0001","Case Number":"3797","Object Shape":"Diamond","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/3797.html.txt","/var/www/straped/mufon/org/3797.html"],"Region":"","Tags":"City","trends":["There have been no other sightings in Island : Paros","This sighting has never been favorited."],"Object Features":"None","Disposition":"Unresolved","Date Submitted":"08/07/1990 12:00 UTC","divs":["Sighting DetailsI was walking from the port town on Paros after taking the last Ferry from Pireas Athens. I believe I had a 23 kilometer walk to make it to Cristi Atki where I was camping. It was very desolate and extremely dark as I walked. I was familiar with the route and knew that I would have to go through a dangerous pass around the right side of a small peak. I had been in a prayerful contemplative mood when I looked up towards the area where the peak was and noticed the four lights. Initially I supposed they were two cars headlights folowing one another, but I remembered there was no road at that height, in fact it wrapped the base and I was on it. I believe just before the lights appeared a cool circular wind began to buffet me in circular and upward movements then all of a sudden the 4 lights shot forward and struck me in the chest. The next thing I remember I was taking a step as a great explosion of light seemed to leave my head. I was absolutely freightened following. The lights were gone but I became rather paranoid immediately following and was rather afraid to continue on but I knew I had to as there are the occasional pack of wild dogs on the island. Later a strange old man stopped and picked me up, my greek was poor and we couldnt speak but somehow he knew where I was going and drove me the rest of the way. I offered to buy him a coffee, he declined, turned around and went back the way we had come. Later that night I looked up and saw a group of stars that looked a little like a kite. For some reason I took to them and started identifying with them in some way I guess. I used to call them the stars of Sam the name of my girlfriend at the time. Later I thought I identified the system as the 7 sisters. I still look for those stars in August. Any understanding of these events would be greatly appreciated."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.045306,+25.212629(3797)&iwloc=A&hl=en\"> mufon case (3797) map </A>","Date of the Event":"08/07/1990 12:00 UTC","Object Flight Path":"Other","Viewing Distance":"20 Feet or Less","City":"Island : Paros","Longitude":"25.212629","Latitude":"37.045306"}