{"Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=40.561026,+-85.594464(37988)&iwloc=A&hl=en\"> mufon case (37988) map </A>","Country":"United States","Latitude":"40.561026","Longitude":"-85.594464","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"05/07/2012 02:57 UTC","City":"Undisclosed","Case Number":"37988","trends":[""],"Object Features":"Other","Disposition":"Unresolved","Region":"Indiana","files":["/var/www/straped/mufon/html2text/37988.html.txt","/var/www/straped/mufon/more/37988_submitter_file1__010412134712.jpeg","/var/www/straped/mufon/org/37988.html"],"Object Flight Path":"Stationary,Hovering then path","Sighting Duration":"00:02:00","Summary":"I was in my car, parking outsite the city of Indianapolis, in the forets, writing poetry,then i saw something above my car roof, like a cloud, but then i saw it was a UFO over me","Log Number":"US-05072012-0010","Viewing Distance":"21-100 Feet","Date of the Event":"09/01/1997 04:00 UTC","divs":["Sighting Details In a forest park outsite of Indianapolis city. This event ocurred on september 1997. About 4:30-5:00 pm. I was siting in my car, writing poetry. Then a saw over me something like a cloud, but when i took a very good look at it, i notice i was a UFO over me. For about 2 minutes the UFO just hover over me, like a big a cloud; i was in shok at firts. The color of the UFO was grey-dark-plane: no lights, no windows. Only something like pipes on the bottong of the object. This UFO was circular, perfect circular, but in the botton i saw pipes. I am sorry because my english is not to good to describe what i saw that day. But, any way, after 2 minutes the UFO hovering over me, i got out of my car to take a beter look, and in that moment the UFO take off and just desapear on the sky. Days after this event i start to realice that my poetry was much better, so i finish my book of poetry. And not only that one, but more books of poetry. Now, this is my story. Today, i live in Miami, Florida. Now i will like to report this event that happen to my brother. This picture was take in a warehouse store. In the picture is my brother, and in the back, there is something like grey-figure, next to my brother... We will like to you to analize this pictures, and if you see what we see, please let us know. Thanks"]}