{"map":"<A HREF = \"http://maps.google.com/maps?q=29.509937,+-98.529325(37981)&iwloc=A&hl=en\"> mufon case (37981) map </A>","Disposition":"Unresolved","divs":["sighting detailsfirst saw the bright orange glowing light \\ orb when i looked out the sliding glass doors to our apartment patio. our apartment is a little over mid way up a 22 story high rise. i looked out the windows and saw an unusual orange light slowing moving by. i had no idea what i was looking at. when i first saw it, it had just come over the top of our apartment building moving south to north. our apartment faces west and north. it was a bright orange glowing orb. there was no physical ball or shape apparent, just the very bright orange glowing light. when i first saw it i could see what i can best describe as an aura. it was cloudy outside, but the ball was just under the cloud cover. according to an online weather site, the cloud cover was 800 feet. at one point it appeared to go through a small batch of clouds, but not to a point it was not visible. i watched it move along a straight line to the north until i could not see it any more. i would say the distance traveled before it went out of sight was 10+ miles, probably due to the cloud cover and light pollution. it had a very graceful glide to it and it was probably a little under a minute before i could not see it any more. we are in the city and there is an enormous amount of light pollution. we have to look very hard just to see the couple stars that are sometimes visible. when the orb was closest to us it appeared to move around or bob a little bit, but not veer off it's course. we see a lot of helicopters and smaller planes fly around, but this was not a helicopter or plane. it was too orange to be any aircraft and it was silent. i am a night owl and it is not unusual for me to be up at 3:00 a.m. we have lived in this apartment for almost 4.5 years and have never seen anything like this before. my husband saw it as well. he went to get the unready camera and binoculars for viewing. we did not have a card in the camera and by the time i got it in it was too far away for a photo. if i had it when i first saw it, i would have had a great photo."],"Viewing Distance":"501 Feet - 1 Mile","Summary":"Orange glowing ball of light","Source":"MUFON","Country":"United States","Latitude":"29.509937","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around May 7th 2012"],"Sighting Duration":"00:01:00","Tags":"City","Date of the Event":"05/07/2012 03:05 UTC","Object Shape":"Sphere","Object Flight Path":"Straight-line path","City":"San Antonio","Weather Factors":"Unknown","Case Number":"37981","Region":"Texas","files":["/var/www/straped/mufon/html2text/37981.html.txt","/var/www/straped/mufon/org/37981.html"],"Longitude":"-98.529325","Log Number":"US-05072012-0008","Date Submitted":"05/07/2012 05:41 UTC","Object Features":"None"}