{"Longitude":"-123.677048","City":"Hoopa","Date of the Event":"05/05/2012 12:00 UTC","Summary":"red-orange glow in sky, hovering in a \"U\" shape and pulsating!","Latitude":"41.049172","divs":["Sighting DetailsMy family and I were in the living room, someone pointed out that there was a weird looking \"star\" outside.So a few of us decided to go check it out outside and the \"star\" was pulsating a red-orange color. This night, there were clouds in the sky and the moon happened to be extra large that night. I could see only a few stars in the sky. And they seemed to be in pairs of two. The red-orange \"star\" that we first spotted then started to \"wiggle\" around, more like hover around in a \"U\" shape. Not just a little but an obvious amount of movement. That's really when i noticed the other objects in the sky. the one opposite of it, (same color and size) started up and that one stopped (for a few hours), and this new one started doing the same thing in only a matter or ten minutes or so. Then we saw it jet off to the left of it. holding your hand to the sky a whole finger away. and not just hover over there it was FAST! then it just continued to hover and move around for awhile. Now two out of five people that were outside that night, saw one of the \"stars\" drop a small white looking light. They each saw it a different time in about an hours time. i am not sure exactly what these are, and i am not sure any one else knows either but i have a good feeling that these were not man made. i can go on about this for ahwile but here is the short n sweet verison. *note: this is a small town so there are hardly ever any helicopters, airplanes, or anything in the air.... and they never made any noise. if it were any of the following it'd be an echo through the valley."],"Object Shape":"Oval, Star-like, Unknown","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/37980.html.txt","/var/www/straped/mufon/org/37980.html"],"trends":["There have been no other sightings in Hoopa","This sighting has never been favorited."],"Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.049172,+-123.677048(37980)&iwloc=A&hl=en\"> mufon case (37980) map </A>","Case Number":"37980","Tags":"City","Date Submitted":"05/07/2012 05:20 UTC","Disposition":"Unresolved","Log Number":"US-05072012-0007","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Region":"California"}