{"Summary":"25-30 very bright UFOs moving along 2 parallel paths at consistent speed and altitude, of irregular polygon shape followed by a final pairof delta-shaped UFOs moving OPPOSITE to the direction of the imagined arrowhead","Longitude":"-77.072095","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Country":"Jamaica","Sighting Duration":"00:15:00","Date of the Event":"04/22/2012 10:30 UTC","files":["/var/www/straped/mufon/html2text/37997.html.txt","/var/www/straped/mufon/org/37997.html"],"City":"Ocho Rios","Viewing Distance":"Over One Mile","Date Submitted":"05/07/2012 06:56 UTC","Object Features":"Other","Latitude":"18.407461","map":"<A HREF = \"http://maps.google.com/maps?q=18.407461,+-77.072095(37997)&iwloc=A&hl=en\"> mufon case (37997) map </A>","Source":"MUFON","Log Number":"JM-05072012-0018","Tags":"City","trends":["There have been 2 other sightings in Ocho Rios","There was one other sighting in Ocho Rios on or around April 22nd 2012"],"Case Number":"37997","divs":["sighting detailsi would be pleased to have someone call\\email me to review the following. we have recently returned from dinner (10.30 pm) at the jamaica inn. the night is clear. i had one-half glass of beer at dinner; my friend had one glass of wine.she (retired travel agent)called me (retired psychologist) to the second floor porch where she was standing, looking in a west-southwest direction. she said \"look!\" i saw a regular (in pairs)formation of 24-30 ufos, moving along two parallel paths in the arc of sky visible to us. it was impossible to guess size, speeed or altitude. this initial formation was followed by one pair of delta-shaped ufos, in effect, like a rear guard position. the latter two moved in the opposite direction of an imagined arrowhead. we were so surprised, in awe, that neither of us thought to get a camera. our second-floor porch (room 32 - the cowdray suite) was above tree top level. the ufos disappeared from our view due to the configuration of the inn's architecture. 1. we had been packing to return home after our holiday. i have no idea what caused her to look up. 2. she pointed, and said \"look!\" in a tone of voice that said \"drop whatever you are doing, come here and look!\" 3. although in no way a ufo \"buff,\" my immediate thought was ufos, i.e., the only possible explanation. my academic training is physics\\mathematics (undergraduate), money management (mba) and psychology (ph.d.) 4. i have done so. 5. my feeling was of imediate belief in what my senses were showing me, although had there not been a witness standing next to me, i might have begun to doubt what i saw after 1-2 weeks."],"Region":"St Ann Parish","Object Shape":"Other","Weather Factors":"Unknown"}