{"Source":"MUFON","Object Flight Path":"Stationary","Log Number":"US-05072012-0011","Disposition":"Unresolved","Latitude":"37.140096","Weather Factors":"Unknown","trends":["There has been one other sighting in Blackey","There were no other sightings in Blackey on or around June 12th 1995"],"Case Number":"37990","Sighting Duration":"00:10:00","Object Features":"Other, Unknown","Summary":"Witnessed star-like UFO","divs":["Sighting DetailsI was around 5 years old and was looking out the back window of my house while my Mom was in the bathroom washing my Sister's hair. From that window you can see an upward hill, my uncle's house, some trees; very little sky from that window is visible. As I was gazing out the window, I noticed that I could no longer see the ground, in fact, all I saw was the night sky. In the center of the sky was a large 4-pointed star. I remember at the time thinking that it was the Star of Bethlehem, as it looked exactly like the drawing on the back of a cross my Mamaw had given me. I made a wish on it for a Barbie doll that had just came out for my birthday that year, which was a month or two away. I do not remember what happened after that, it was as if I was no longer in my house during the episode. Even the window panes were no longer visible as I was looking at this star-like object. I do remember thinking however, that this is home. I didn't really think about it much after that until a month or so later when I realized that through that window (or any window in my house really) I cannot see that much sky. And there are not stars that normally look that big. I can, however, remember the event vividly even today."],"Tags":"City","Longitude":"-82.979051","Viewing Distance":"Unknown","Date Submitted":"05/07/2012 06:02 UTC","Region":"Kentucky","City":"Blackey","files":["/var/www/straped/mufon/html2text/37990.html.txt","/var/www/straped/mufon/org/37990.html"],"Object Shape":"Diamond, Star-like","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.140096,+-82.979051(37990)&iwloc=A&hl=en\"> mufon case (37990) map </A>","Date of the Event":"06/12/1995 08:15 UTC"}