{"Summary":"Hovering Disk, distance of object varies, two witnesses, missing time, entity (female hybrid?) appears in bedroom.","Date of the Event":"08/14/2005 03:14 UTC","Weather Factors":"None","Object Shape":"Disc, Oval, Saturn-like","Latitude":"37.957702","divs":["sighting detailsdescription here by lead investigator. female witness (24) arrives home from work about 02:30 hours. at 03:14 hours sees disk object in the northwest sky, 60 degree inclination. hovers side to side. when witness goes outside for better look, object disappears. when witness returns to her bedroom, object re-appears into view again through her window. object displays hovering & some subtle non-ballastic motion. witness calls her mother (44), both see object clearly. both witnesses agree. mother returns to her bedroom, as her grandson is upset. grandson clings tightly to grandmother in their bed. daughter (24) becomes drowzy gazing at object through her bedroom window from her bed. possible missing time - witness thinks 10 minutes or 90 minutes (1 1\\2 hours). a being or entity appears at daughters bedside, almost can touch. being seen from knees up. being appeared female (hybrid?), oval gray\\brown complexion. oval shaped face, with pointed pronounced chin. large brown eyes. black straight hair on head down to waist. witness described being as 'beautiful'. being first seen in right profile, then slowly turns to face witness directly. witnes felt being turned slowly as not be appear 'threatening'. witness does not remember other details after this. witness contacted mufon investigator only 8 hours after occurrance! three investigators (northern california state director, state section director - alameda co., and local stockton mufon field investigator trainee) one week later. did not wish to contact witesses alone. promised to be complex case, and for my personal safety (initial meeting w\\strangers). object described by witnesses matched exactly gold disk in dublin, california auto dealership case (occurred novemeber 5, 2004 at 18:45 hours - see mufon case report jsr-0011) report just previously completed. witnesses displayed great emotion when they were shown at end of interviews the police forensic sketch of the 'dublin object'."],"Log Number":"US-09032005-0001","Longitude":"-121.29078","files":["/var/www/straped/mufon/html2text/3799.html.txt","/var/www/straped/mufon/org/3799.html"],"Source":"MUFON","City":"Stockton","trends":["There have been 25 other sightings in Stockton","There were no other sightings in Stockton on or around August 14th 2005"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","Object Flight Path":"Stationary,Path then hovering","Sighting Duration":"Undisclosed","Disposition":"Unknown","Case Number":"3799","map":"<A HREF = \"http://maps.google.com/maps?q=37.957702,+-121.29078(3799)&iwloc=A&hl=en\"> mufon case (3799) map </A>","Object Features":"Dome","Region":"California","Tags":"City","Date Submitted":"08/14/2005 03:14 UTC"}