{"Source":"MUFON","Date of the Event":"05/05/2012 02:22 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.650882,+-117.744112(37996)&iwloc=A&hl=en\"> mufon case (37996) map </A>","Longitude":"-117.744112","trends":["There have been 28 other sightings in Irvine","There were no other sightings in Irvine on or around May 5th 2012"],"Disposition":"Unresolved","divs":["sighting detailssat may 5, 2012 around 2:30ish going n on toll rd 73 towards newport bch i'm on mountain top area of 73 & look off 2 right towards irvine spectrum\\fields, still s of orange balloon in park & hovering above but not far above ground b-c on mtn top it was almost across fr me is a giant (football field plus...) long, thin, dk gray ??? hovering there. i almost drove off road. i know what it was not but i don't know what it was. not a cloud, not an airplane, not a helicopter...truly nothing i can say i know of unless military is doing something secret @ old el toro air field (this was a bit south near spectrum) or ??? i assumed it would be all over news. nothing?! i assumed 1,000's of people saw this from ground. i assume u'll be bombarded by reports. i called my friend coming south on 5 but she didn't c it? it was something! if i wasn't driving & late 4 appt, i would've tried 2 film it but couldn't crash car.if it is secret military 4 national security i don't want 2 talk abt it but what is it? does anyone know?"],"Log Number":"US-05072012-0017","Latitude":"33.650882","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/37996.html.txt","/var/www/straped/mufon/org/37996.html"],"Summary":"I was on the toll road up in mountains heading 2 Newport & looked off 2 my right & almtt drove off rd b-c I could not believe what I saw hovering above Irvine near Spectrum, fields the size of at lst a football field & looked dk gray & long & thin","City":"Irvine","Weather Factors":"Unknown","Date Submitted":"05/07/2012 06:54 UTC","Object Shape":"Cigar, Square, Rectagular, Other","Object Flight Path":"Stationary","Case Number":"37996","Region":"California","Viewing Distance":"Unknown","Country":"United States"}