{"Object Flight Path":"Stationary","divs":["Sighting DetailsMy Dad and I had been staying the weekend with my aunt and uncle in Paris, Ky. That evening we decided to order us a pizza for supper and decided that we would go and pick it up instead of having them deliver it. My aunt lived in a suburb, we were leaving the suburb to get the pizza when we noticed something very low in the sky above us, hovering over the center of the road. We stopped at one of the stop signs and rolled down the windows to get a better look at it. Above us was a dark (black-ish, near the color of the night sky) object, triangular in shape as far as we could tell. Three lights went along the bottom of it, one in the front and two in the back. There was no sound, just the lights and faint outline of the craft. It was low...really low...probably just a few feet above the houses on either side of the street. It simply sat there. A few minutes after we had been stopped to look at it, another car pulled up beside us. It was crammed full of people - most looking around their mid-twenties to mid-thirties. They stopped and rolled their windows down as well to talk to us. They asked us if we knew what it was, we answered that we didn't. And a short conversation between my aunt and a couple of guys in the car went on about it for a bit. At one point a couple of the people in their car got out to look at it. Eventually we noticed the time and that the pizza place would be closing soon. So we left and hoped that the craft would still be there when we got back. It took us about 15 minutes or so to go get the pizza. And when we turned into the suburb we kept looking in the sky, but the craft was gone and the other car full of people had left as well. We then headed back to my aunt's house and told my Dad and Uncle, who, of course, thought we were joking and had made it up. My aunt was never someone who believed in the paranormal, and this was the only time I got to talk to her about such things without her laughing. In fact, not once during the whole encounter did she make any jokes or chuckle."],"Viewing Distance":"20 Feet or Less","Sighting Duration":"00:08:00","Summary":"Hovering Triangle over Suburb","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.209799,+-84.252987(37995)&iwloc=A&hl=en\"> mufon case (37995) map </A>","Region":"Kentucky","City":"Paris","Object Features":"None","Longitude":"-84.252987","Date of the Event":"07/05/2000 08:26 UTC","Case Number":"37995","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/37995.html.txt","/var/www/straped/mufon/org/37995.html"],"trends":["There has been one other sighting in Paris","There were no other sightings in Paris on or around July 5th 2000"],"Country":"United States","Latitude":"38.209799","Log Number":"US-05072012-0016","Source":"MUFON","Date Submitted":"05/07/2012 06:38 UTC","Object Shape":"Triangle"}