{"Sighting Duration":"05:00:00","Tags":"City","Object Features":"None","Latitude":"37.142926","Object Flight Path":"Straight-line path","Object Shape":"Circle, Star-like","Country":"United States","Disposition":"Unresolved","Case Number":"37991","Weather Factors":"Unknown","Region":"Kentucky","Date Submitted":"05/07/2012 06:20 UTC","trends":["There has been one other sighting in Blackey","There were no other sightings in Blackey on or around May 22nd 1997"],"Summary":"Shooting star UFO","City":"Blackey","files":["/var/www/straped/mufon/html2text/37991.html.txt","/var/www/straped/mufon/org/37991.html"],"divs":["sighting detailsthis happened when i was around 7 years old. i was up in my uncle's yard trying to draw the night sky with my crayons in a butterfly-shaped notepad. the only light was a dim street light that was a few yards behind me and slightly to my left. i could just barely see to draw and was mostly just trying to get constellations in the right place in my drawing. as i was looking at the sky, i saw what i thought was a star. but it was moving across the sky. so, having seen plenty of helicopters and planes in the night sky before, i assumed that's what it was. it was just about as big and bright (and even looked about as far away) as the stars around it. there were no other lights like most planes have, it was just the single white light moving across the sky at a steady pace. it had almost crossed the entire sky, when it got near the treeline...and then shot rapidly across the sky! it was as fast as a shooting star, but i had never saw a shooting star move so slowly across half the sky and then shoot like that. i thought it was strange, but continued my drawing. then, a few minutes later, i saw it (or a different one) come back over the treeline. it went slowly across the sky until it got right over head, then it shot across the rest of the sky as fast as the first one\\first time. i then got scared, grabbed my notebook and crayons, and ran back home. i kept the drawing in that notepad that i drew for several years after that."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.142926,+-82.972951(37991)&iwloc=A&hl=en\"> mufon case (37991) map </A>","Log Number":"US-05072012-0012","Viewing Distance":"Over One Mile","Longitude":"-82.972951","Date of the Event":"05/22/1997 10:31 UTC","Source":"MUFON"}