{"Object Flight Path":"Straight-line path,Other","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"40.722523","Date of the Event":"05/05/2012 08:47 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around May 5th 2012"],"files":["/var/www/straped/mufon/html2text/38009.html.txt","/var/www/straped/mufon/org/38009.html"],"Viewing Distance":"Unknown","Disposition":"Unresolved","City":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.722523,+-73.997013(38009)&iwloc=A&hl=en\"> mufon case (38009) map </A>","Log Number":"US-05082012-0007","Object Features":"None","divs":["Sighting DetailsAround 8:45-9:00pm on Saturday May 5, 2012 I was outside on my deck to let the dog out. We had alot of cloud coverage that night but I still looked up to the sky to see if the moon was going to be visible. When I looked up I noticed at least 5 red orbs rising up into the sky from the south shore of Long Island. The first orb was alittle ahead of the others. Then there were a group of four which were closer together but seemed evenly spaced apart. As I was watching them rise into the sky I thought I should go in the house and get my phone to take some pictures. I grabbed my phone and turned it on and went back out onto the deck and continued to stare. When I looked at my phone to get the camera on I noticed that it had frozen so I started to shout to my neighbor who was just inside his house to come out and take a look. He didn't hear me. It was then that I noticed my other neighbors car coming home so I went through the house and out the front door to get them to look up at the sky. By this time the last of the orbs that I had seen had just started to head up to the clouds. My neighbors did see it and as I was telling them the direction that they had come from another one started to rise above the trees and follow the same path as the others. We all wondered what they could be? Thinking that maybe it was military or some type of fire work or flare, maybe even metiors. There was no noise. Not until the last one disappeared above the clouds did we hear a plane. They were mostly red orbs with what appeared to be orange or yellow on the right side. They rose up from the south and continue rising up through the clouds on a northern direction. I saw them for at least a few minutes. They were moving at a steady pace with no sudden bursts of speed or change of direction. What ever they were it was a pretty cool thing to see."],"Country":"United States","Case Number":"38009","Summary":"observed red orbs towards the south shore of Long Island New York","Date Submitted":"05/08/2012 01:09 UTC","Object Shape":"Circle, Sphere","Source":"MUFON","Region":"New York","Longitude":"-73.997013"}