{"Source":"MUFON","Case Number":"38008","Date of the Event":"05/08/2012 07:50 UTC","Latitude":"41.144901","divs":["Sighting DetailsSon noticed object about 30 degrees or so above the horizon while in car on the way to school at 7:50am. He asked me if that was a star or an airplane. I had to slump down a bit to see the object through my windshield, but saw it as well. It appeared to be several miles off in the distance, perhaps 5 to 10 miles south of Cheyenne from our perspective heading toward it. It appeared to be round or perhaps slightly oval shaped, white and or reflective in the morning sun. As we observed it for a minute or two it seemed to be moving away from us as it was getting slightly smaller, and appeared to be moving to the southeast. After observing the object while still driving, I reached for my iphone which was in my pocket in order to film it. As I looked down trying to turn on the camera, my son said \"it's gone\" which I observed as well when I looked up. It definitely did not appear to be a plane or a helicopter as the shape appeared to clearly be round. There is an Air Force base here in Cheyenne so we are accustomed to seeing helicopters and planes. It also did not appear to be a balloon as while driving 65 mph toward the object, it still appeared to be moving away slightly. Also, it did not appear to be rising like a balloon would on a very calm morning, which is unusual here. It appeared to be a good distance to the south, but was either large enough to make out the round features of it, or perhaps it was closer than that and smaller. Hard to tell while driving."],"Tags":"City","Viewing Distance":"Over One Mile","Log Number":"US-05082012-0006","Object Flight Path":"Straight-line path","Object Shape":"Circle, Oval","Country":"United States","Longitude":"-104.815536","trends":["There have been 17 other sightings in Cheyenne","There were no other sightings in Cheyenne on or around May 8th 2012"],"Summary":"Reflective white round to oval shape object south of Cheyenne. Appeared to be moving south to southeast possibly at a fairly slow rate, then disappeared rather quickly.","Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/38008.html.txt","/var/www/straped/mufon/org/38008.html"],"City":"Cheyenne","Date Submitted":"05/08/2012 11:02 UTC","Disposition":"Unresolved","Region":"Wyoming","map":"<A HREF = \"http://maps.google.com/maps?q=41.144901,+-104.815536(38008)&iwloc=A&hl=en\"> mufon case (38008) map </A>","Sighting Duration":"Undisclosed"}