{"Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date Submitted":"05/08/2012 10:34 UTC","trends":["There have been no other sightings in Saint-Bruno-de-Montarville","This sighting has never been favorited."],"Case Number":"38006","Object Features":"None","Latitude":"45.520753","Object Flight Path":"Straight-line path","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/38006.html.txt","/var/www/straped/mufon/org/38006.html"],"Weather Factors":"Unknown","Region":"Quebec","Source":"MUFON","Log Number":"CA-05082012-0004","Country":"Canada","Tags":"City","Summary":"Two lights travelling close to each other but too large to be a single aircraft","City":"Saint-Bruno-de-Montarville","Date of the Event":"05/07/2012 09:15 UTC","Longitude":"-73.36379","map":"<A HREF = \"http://maps.google.com/maps?q=45.520753,+-73.36379(38006)&iwloc=A&hl=en\"> mufon case (38006) map </A>","divs":["Sighting DetailsOn the road, my attention was drawn to what appeared to be a very long airplane flying low. Venus was visible in the sky but I did not see other stars due to the light pollution. I stopped to observe a slowly randomly pulsating orange pinpoint light followed by a bright red regularly pulsating light. These two lights were separated by approximately 3 moon diameters, and the distance between the two was constant despite the fact that they were moving horizontally at a rate of around 90 degrees a minute. I could not see any other lights on either, or between (no evidence of aircraft position red or green lights on the small one, and no evidence of green light on the large red one). My initial feeling was that of an incredibly long aircraft flying low or of an helicopter following a \"light\", but I could not figure what this \"light\" was. These two lights were travelling from west to east, about a mile away, at about 20-25 degrees elevation, and occasionnay passing between trees. I was observing from the north-east of the flightpath, so not in the best position to observe a green position light if there was any. Observation lasted about a minute ad was terminated when the lights were blocked by trees. However I resumed driving west and about 90 seconds later saw a similar pulsating red light (cannot say if it was the same as the one previously seen) but this time the orange light preceding it was no longer observable. There is usually a lot of traffic around the airport nearby, but I was initially struck by: Either this was a fantastically long aircraft flying low or; These were two aircrafts flying too close to each other, and without regulatory position lights."],"Sighting Duration":"Undisclosed"}