{"Log Number":"US-05082012-0001","City":"Puyallup","Latitude":"47.103538","Date Submitted":"05/08/2012 01:34 UTC","Longitude":"-122.290582","divs":["sighting detailson the evening of 5\\7\\12 at 2106 local while walking my dog.i looked to the east toward the pierce county airport. i always look at the sky being an old pilot and aircraft mechanic. the righthand traffic pattern landing to the north goes directly over my home. i observed first one ogange\\red object within 2-3 minutes i was looking at four objects. the color being emmitted from the objects were not red collision lights. in fact the only lights i observed were orange\\red pulsating, no bright white strobes. the objects appeared in a more or less climbing straight line. living within 15 miles of joint ft. lewis and mccord ab my first thought was that i was watching four helicopters in trail returning to ft.lewis. however after watching the objects for 2-3 minutes they didnot fly over my home on the way back to the fort. the first object continued to assend to my guess would be above 2500'-3000' at which time its light blinked out. within two minutes the second, third, and forth objects did exactly the same. while flying westbound and having all four objects in sight a light aircraft on final approach to pierce county airport passed under the objects by 500'-1000'"],"Country":"United States","trends":["There have been 13 other sightings in Puyallup","There were no other sightings in Puyallup on or around May 7th 2012"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/38003.html.txt","/var/www/straped/mufon/org/38003.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.103538,+-122.290582(38003)&iwloc=A&hl=en\"> mufon case (38003) map </A>","Date of the Event":"05/07/2012 09:06 UTC","Case Number":"38003","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Summary":"While walking my dog, I looked to the east and observed 4 objects assending in a fairly straight line westbound. All 4 objects were orange/red in color. After observing all 4 objects for 2-3 min.All 4 objects blinked out in order.","Disposition":"Unresolved","Tags":"City","Region":"Washington"}