{"Case Number":"38017","trends":["There has been one other sighting in Beaufort","There were no other sightings in Beaufort on or around May 8th 2012"],"Source":"MUFON","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/38017.html.txt","/var/www/straped/mufon/org/38017.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"US-05082012-0014","Viewing Distance":"Over One Mile","Latitude":"34.745439","divs":["Sighting DetailsMe and a friend were driving down Highway 70 east, westbound towards Beaufort. While driving I noticed two lights in the sky that were alternating in color from white to red with a pinkish aura. At first I thought they were the beacons of a tower, so I asked my friend if there was a tower nearby. He said, \"no\", and spotted them as well and pulled off the road to get a better look. I had witnessed one of these lights before almost four nights ago, so I was surveying the sky while we drove. Like I mentioned before, I assumed there to be a tower where we observed the lights, but their peculiar lumination that informed me to their presence. We thought they were airplane beacons that warned of a structure, then we assumed them to be high-altitude jets, but their lights were even brighter than the running lights for aircraft at night. We could not tell if they had a body or were just made of light. Since we were traveling on a winding road, it was impossible to tell if they were moving or stationary. The lights continued to change from white to red in no apparent order. They did, however, appear to be in some sort of formation. As we watched, I tried to ready my camera-phone, but my friend told me it was too dark to take a proper photograph. I turned back up to look up just in time to see them leave. The first light turned white and shot straight up. The second left in the same manner a few moments after. We were bewildered and tried to comprehend what we saw."],"Date of the Event":"05/08/2012 08:30 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.745439,+-76.628817(38017)&iwloc=A&hl=en\"> mufon case (38017) map </A>","Summary":"Witnessed two, pulsating, red to white objects that hovered for a time shot straight up into the atmosphere.","Object Shape":"Sphere, Star-like","Longitude":"-76.628817","Country":"United States","Tags":"City","Sighting Duration":"00:30:00","City":"Beaufort","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"05/08/2012 09:33 UTC"}