{"Latitude":"44.961814","Country":"United States","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=44.961814,+-124.016621(3801)&iwloc=A&hl=en\"> mufon case (3801) map </A>","Object Flight Path":"Path with directional change","Region":"Oregon","Sighting Duration":"00:00:40","trends":["There have been 4 other sightings in Lincoln City","There were no other sightings in Lincoln City on or around September 2nd 2005"],"Tags":"City","Longitude":"-124.016621","Source":"MUFON","divs":["Sighting DetailsMy mom was outside on the back deck of our house letting the dog out when my little sister and I joined her. I looked at the sky because I hadn't looked at the stars in a long time when my mom asked me what this thing was in the sky. At first, I thought it was an airplane and said so, but then my mom said that she'd never seen a plane move that fast before, and I realized I hadn't either. I then said a satellite, but the object, we noticed, was zigzagging, which they don't do. I then thought space garbage but that was absurd. The object was, during this exchange between my mom, sister, and me, moving across the sky quite fast and zigzagging once and awhile. It was only the size of a pinprick in the sky, no larger than any of the stars visible in the sky. We were all just speculating as to what the object was, saying \"what is that?\" and \"look at that.\" I think we were all in awe. This whole episode only lasted less than a minute and abruptly ended when I lost sight of the object when it approached a cloud and then, disappeared in a large (compared to the size of the object, it was large) flash of light. We stayed outside for a minute or two trying to find the object again but to no avail. That was it. Very short in duration and really no detail, but it's driving me nuts not knowing what it was."],"Viewing Distance":"Unknown","Date of the Event":"09/02/2005 10:15 UTC","files":["/var/www/straped/mufon/html2text/3801.html.txt","/var/www/straped/mufon/org/3801.html"],"Object Features":"Unknown","Object Shape":"Star-like","Case Number":"3801","Summary":"A small pinpoint of light that zigzagged across the sky then disappeared with a flash of light.","Date Submitted":"09/02/2005 10:15 UTC","City":"Lincoln City","Weather Factors":"None","Log Number":"US-09032005-0003"}