{"Disposition":"Unresolved","Tags":"City","divs":["Sighting Detailsfor the past 6 nights i have looked into the sky and seen these so called pulsating color changing stars and they have turned all sorts of crazy colors. so i got one of my friends with me and we walked around smoking our cigarrettes and out of nowhere the same object appered we stood there and watched this object for 20 mins untill it dissaperred. 4 nights before that i had been tracking the same ufo everynight for 4 nights.then tonight happend not only one but about six of these pulsating light so colorfull i may add just about every color under the sun was pulsating out of these stars and they shot red beams and blue beams i or my friend were not scared of these but just very curious what were these and what were they doing in every direction you looked there was at least one of them and sooner or later we started watching other smaller blinkin lights besides the ball star like objects right next to them going so fast that these objects were zigzagin through the sky and if i may add there were about 2 of them over lake city ammunition plant. does anybody have a clue what these beautiful things are ive been trackin them like crazy and would love to know"],"Date of the Event":"05/09/2012 12:00 UTC","Country":"United States","Viewing Distance":"Over One Mile","Region":"Missouri","Object Flight Path":"Stationary,Other","Sighting Duration":"Undisclosed","Longitude":"-94.288801","Object Shape":"Star-like","Summary":"multi colored pulsating lights high in the night sky","Log Number":"US-05092012-0003","files":["/var/www/straped/mufon/html2text/38020.html.txt","/var/www/straped/mufon/org/38020.html"],"Source":"MUFON","Weather Factors":"Unknown","Case Number":"38020","City":"Blue Springs","Latitude":"39.079736","trends":["There have been 28 other sightings in Blue Springs","There was one other sighting in Blue Springs on or around May 9th 2012"],"Object Features":"Other, Unknown","Date Submitted":"05/09/2012 01:04 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.079736,+-94.288801(38020)&iwloc=A&hl=en\"> mufon case (38020) map </A>"}