{"City":"San Francisco","Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.78445,+-122.411346(38021)&iwloc=A&hl=en\"> mufon case (38021) map </A>","divs":["sighting detailssan francisco - apx. 7pm 5\\8\\12. on the corner of presidio and pine i noticed the sky. it was a rare and beautifully temperate day, a rarity as sf is frequently enshrouded in clouds and i felt i had to take note of what seemed like endless blue above me. i noticed something flying in a straight line high in the air hundreds of feet away. \"a bird\", i thought. it had to be a bird, it was too small to be a plane. i called upon my common sense and admittedly small pool of zoological knowledge and thought again. \"why would it be flying alone so high up? it can't possibly be hunting, it's too high. it can't be hurt, it's too high.\" it didn't make sense. at this point i literally giggled out loud to myself and thought of the gullible suckers who would have immediately leapt to identifying this thing as a ufo. mid-chuckle i became a sucker myself. it changed course suddenly. not violently, not totally drastically either, but it started taking turns faster than any flying object i've ever seen. it sounds crazy, but as fast as it was going it's movement was still graceful - like a leaf falling sideways. i am confident in saying that if this was indeed a tangible object it completely defied the human grasp of aeronautic physics. my smile faded and i stood transfixed. the light dimmed and grew stronger. a pin-prick of orange swelled into a glowing orb and then back down again. it seemed to calm it's turning a bit and stayed bobbing at a relatively fixed point in the sky; it's size still inhaling and exhaling light. with my head cocked like a dog that's heard a noise it doesn't understand, i was jolted back into reality by the shrill honk of a car. i looked down. a friend of mine who happened to be driving by waved and gestured for me to get in - \"i'll give you a ride\" she mouthed. i looked back up at the sky and there again was the endless blue - the orb had vanished."],"Summary":"A small orb of orange light flying straight at first and then started erratically changing direction. It then appeared to hover briefly and disappeared.","Case Number":"38021","Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"05/08/2012 07:00 UTC","files":["/var/www/straped/mufon/html2text/38021.html.txt","/var/www/straped/mufon/org/38021.html"],"Latitude":"37.78445","Disposition":"Unresolved","Object Shape":"Sphere","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around May 8th 2012"],"Country":"United States","Log Number":"US-05092012-0004","Tags":"City","Date Submitted":"05/09/2012 01:22 UTC","Source":"MUFON","Region":"California","Longitude":"-122.411346"}