{"Longitude":"-114.467454","Weather Factors":"Unknown","Log Number":"US-05092012-0012","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Case Number":"38029","map":"<A HREF = \"http://maps.google.com/maps?q=42.547741,+-114.467454(38029)&iwloc=A&hl=en\"> mufon case (38029) map </A>","Date of the Event":"05/07/2012 10:15 UTC","Date Submitted":"05/09/2012 02:07 UTC","Object Shape":"Star-like","Tags":"City","Object Features":"None","files":["/var/www/straped/mufon/html2text/38029.html.txt","/var/www/straped/mufon/org/38029.html"],"Source":"MUFON","Latitude":"42.547741","City":"Twin Falls","Summary":"hovered above tree tops, called cops no other reports of sighting.","Country":"United States","Object Flight Path":"Stationary","divs":["Sighting Detailsit was about 10P.M. I was coming home from the market. I looked to the north and saw this pulsating light, it was to large and close to be a star, and too large to be just a regular light, and it was in an area of the sky that I have never seen a light in. I knew it was not a normal size anything. it was not a plane, nor a helicopter. It hovered in silence just over the tree tops and it was way to big and too high to be a street light. It pulsated large and small lights of different colors, red and greenish blue? it held in place for I believe 45 min then just disappeared. my husband had never seen a planet in that area either. Per him he had never seen a star in that area before. He was surprised when the star went home for the night, or turned itself off. we got out the binoculars and watched the object grow larger, then shrink as it was pulsating. I stood out in front of my home and watched it. I watched it for about 45min, then I went into my home 15 to 20 min I looked out my bedroom window it was gone. I was not afraid nor surprised I have heard helicopters fly over our home always after 10 or 11 pm. I believe they are military helicopters because there are no other helicopters that fly around here day or night. we are a very small town. I have been here 8 years and never seen a object like this before in the northern sky."],"Region":"Idaho","trends":["There have been 9 other sightings in Twin Falls","There were no other sightings in Twin Falls on or around May 7th 2012"]}