{"Object Shape":"Sphere","Tags":"City","Case Number":"3802","Region":"New Hampshire","trends":["There has been one other sighting in Newport","There were no other sightings in Newport on or around August 27th 2005"],"City":"Newport","Object Features":"Appendage(s)","Date of the Event":"08/27/2005 11:15 UTC","Country":"United States","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=43.373238,+-72.171749(3802)&iwloc=A&hl=en\"> mufon case (3802) map </A>","Log Number":"US-09032005-0004","Latitude":"43.373238","Weather Factors":"Unknown","Summary":"A round ufo flying about the same height of a small plane, it slipped behind a tree and never re appeared.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3802.html.txt","/var/www/straped/mufon/org/3802.html"],"Longitude":"-72.171749","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/27/2005 11:15 UTC","divs":["Sighting DetailsMy grandson and I were having lunch on the porch of the Richards Libary during their apple pie festival. He was seated facing me, and I was seated facing the street and the common. I was looking for clouds since it was hot and was wondering rain would be comming. I noticed a round flying object in the sky. At first I thought it was a hoover disk, but it appeared to be too far up in the sky. It went out of my sight, behind a tree (The common is lined with trees) and I waited for it to come out the other side, but it disapeared. It was dark, dark, gray, almost black and I did not hear any sound. I kept looking up for it to reapear and looked for anyone on the common that may have seen the object, but everyone was going about their business as usual. I felt like I had seen something special and couldn't share it with anyone. Prior to reporting this tonight, I looked to see if there were any other sigthings that day. I did not find any, but did find some sightings about an hour away from our home, but the objects were completely different."]}