{"Region":"Georgia","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date Submitted":"05/09/2012 02:09 UTC","trends":["There have been 4 other sightings in Newnan","There were no other sightings in Newnan on or around April 29th 2012","This sighting has been favorited 1 time.",""],"Summary":"triangular shaped looked like \"kites with lights\" glowing pulsating changing colors no sound","Object Features":"Wings","Latitude":"33.402154","files":["/var/www/straped/mufon/html2text/38030.html.txt","/var/www/straped/mufon/org/38030.html"],"Object Shape":"Triangle","Source":"MUFON","Log Number":"US-05092012-0013","Date of the Event":"04/29/2012 10:30 UTC","Sighting Duration":"Undisclosed","City":"Newnan","Disposition":"Unresolved","Tags":"City","Case Number":"38030","Country":"United States","Longitude":"-84.769915","map":"<A HREF = \"http://maps.google.com/maps?q=33.402154,+-84.769915(38030)&iwloc=A&hl=en\"> mufon case (38030) map </A>","divs":["Sighting DetailsI was coming home from the store when I noticed two triangular objects flying over a wooded area about 5 blocks from my house. objects were changing color. it did not appear that they had lights on them but they appeared to be made of light. one was prominently green, the other was prominently blue. they had two orbs trailing them, although the orbs did not seem to be touching the object they followed it and they changed color as the object changed color and they changed the same color as the object (as if they were connected to it) there was also a red orb in the front of the object but the red orb did not remain lit the entire time. at first I thought someone was flying \"kites with lights\" I say that because they were moving like kites move when someone is doing tricks (dipping and ascending rapidly then hovering) I ruled out the kite theory immediately as they were flying over a wooded area (and what idiot would fly a kite in the woods) I also thought of a hang glider but there is no take off point for hang gliders where I live. anyway I saw another car sitting at a stop sign adjacent to the one I was sitting at I approached the car and asked the occupant if they saw what I was seeing (to make sure I wasn't loosing it!) she said yes. so now realizing I wasn't halucinating, I rushed home to get my camera. by the time I got back to the spot were I saw the objects it was only one left (the blue one) on the video you can hear the crickets, you can hear my voice, you can hear the cars passing by. but you cannot hear any noise coming from the object. I was very nervous, my hands were shaking, my heart was racing plus I was on full zoom, so the footage is a bit shaky. I was trying to zoom in so one could see the shape of the object and zoom back out so one could see the way it was moving. it was making sharp turns that I've never seen any plane or helicoptor make (as I said it was like a kite) it would get small and then big very quickly as it moved far away and then near again. one of the times when I tried to zoom in (which would've been a perfect shot) the object became blury but you can see that it is changing color. if you pause the video at different parts you can make out a definite shape. anyway I lost sight of it when it went behind the tree line and I never saw it again. notice at the end of the video right before it goes behind the tree line it is heading in one direction and then quickly changes direction."],"Weather Factors":"Unknown"}