{"Object Features":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/38037.html.txt","/var/www/straped/mufon/org/38037.html"],"Sighting Duration":"Undisclosed","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.811135,+-96.761603(38037)&iwloc=A&hl=en\"> mufon case (38037) map </A>","Source":"MUFON","trends":["There have been 116 other sightings in Dallas","There were 2 other sightings in Dallas on or around May 6th 2012","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Tags":"City","Viewing Distance":"Over One Mile","City":"Dallas","Log Number":"US-05092012-0020","Disposition":"Unresolved","divs":["Sighting DetailsThis is my second experience of seeing these cloud like objects over our neighborhood within two weeks and relates to the sighting in case # 37779. I was sitting with a group of 4 friends Sunday night May 6th in East Dallas. It was a relatively windless evening with lighter colored clouds gathered to the North. I was partially reclined and looking up at the clouds when I noticed a small dark isolated cloud coming from the SW heading NE. I pointed it out to my friends who immediately noticed it. The 'cloud' appeared about the size of a Cessna and quite dense. From the angle that I was sitting it looked like a cigar shape (perhaps I was seeing the side of it) as the 4 other witnesses described seeing a triangular, or boomerang shape. There was very little movement in the cloud cover backdrop as we watched the small dark cloud 'flying' as fast if not faster than an airplane. The cloud's movement (parallel in relation to the horizon) visually stood out. The experience was kind of unnerving. I have no idea what this thing was but I felt like whatever it was was trying to obscure itself. One of my more skeptical friends said it was the strangest thing he ever saw."],"Date of the Event":"05/06/2012 09:50 UTC","Object Shape":"Boomerang, Cigar, Square, Rectagular, Triangle","Longitude":"-96.761603","Summary":"Cloudlike UFO over Dallas Second Sighting","Date Submitted":"05/09/2012 10:44 UTC","Case Number":"38037","Weather Factors":"Unknown","Latitude":"32.811135"}