{"Latitude":"-27.604104","Log Number":"AU-05092012-0018","divs":["Sighting DetailsI'm a firm ufo beliver and attend the local Ipswich ufo sociey meetings on a regular basis, for the last few months I've been setting up my video camera near a window on a tripod and letting it run unattended for about 1 hour 15 minites, I wasn't having much luck during the daytime so I switched to nighttime and on the night of the 7th of April 2012 I got lucky and this is the image I captured, the video was taken from my address in the heart of Ipswich, which is 22 miles west of Brisbane, I had the camera pointed North Northeast and angled up to about 40 degrees above the horizon, the video camera I used was a JVC GZ-HD520AG high definition, later when I stopped the camera and hooked it up to my recorder as I always do and as I viewed the part where the objects appeared I had at first thought it was a meteorite breaking-up but when I went back and checked later I was certainly surprised to find that they were in fact objects, two of the objects displayed flashes which I think are propulsion bursts as they passed over, I was hoping by sending you this short video clip that you would do an analysis and let me know what you find."],"Case Number":"38035","Object Flight Path":"Straight-line path","Summary":"Unidentified objects cylinder shape passes over Ipswich Queensland Australia.","Date of the Event":"04/07/2012 07:23 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Region":"Queensland","Date Submitted":"05/09/2012 10:32 UTC","Sighting Duration":"Undisclosed","Object Shape":"Cylinder","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","City":"Ipswich","files":["/var/www/straped/mufon/html2text/38035.html.txt","/var/www/straped/mufon/org/38035.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=-27.604104,+152.764089(38035)&iwloc=A&hl=en\"> mufon case (38035) map </A>","Longitude":"152.764089","Country":"Australia","trends":["There have been 2 other sightings in Ipswich","There were 2 other sightings in Ipswich on or around April 7th 2012","This sighting has never been favorited.",""],"Object Features":"Undisclosed"}