{"Region":"British Columbia","divs":["Sighting DetailsI was camping with friends in Penticton in a camp site within city limits. I was sitting on a picnic table having a conversation with my girlfriend. I looked up at the stars and saw what I thought was a flashing satellite. As i stared t it it disappeared. I stood up and began searching for it, inadvertently annoying my girlfriend for ignoring her statement. As I searched I found another flashing object on the other side of the sky. Unsure if this was the same object I observed it's behaviour. It was flashing in a random pattern with random colours as far as I could distinguish.Over the course of 3-4 minutes it did this several times, flashing, disappearing and reappearing covering vast distances in a split second. At this point I began to shakes my friends tents saying \" get up! you gotta see this! I managed tor rouse 5 of my friends from their tents. By this time a second object had joined in. They would pair up on opposite sides of the sky directly above us flashing almost in synchronization. They would carry on the same routine; flashing, disappearing and reappearing. Eg. If my field of view was a box with side A on the left, side B on the right, side C on the top and side D on the bottom; Object A would start at A and object 2 at B. Flashing for a few seconds then disappearing to reappear with possibly object 1 at side C and object 2 at side D. this went on for approximately 5 minutes. Then the pattern changed. They would sway back and forth across the sky, like they were playing chicken or something. Again after a few minutes the pattern changed to swirling around each other, gradually getting larder and smaller diameters. Then at the end of a large diameter swirl they raced towards each other stopped simultaneously and shot of in a east and west direction away from each other in opposite directions. The rush of energy I felt after that was exhilarating. I had never felt so alive. Good luck getting sleep after that. So we sat around for a few hours after that talking about what we had seen, bugged the people who missed it, and swapped stories of other people we knew who had encounters to one extent or the other. I feel very lucky to have witnessed it and hope to see others, though I had seen a type of pink wormhole or an orb of some sort in 2007 but have never found anything close to the description of what I saw. For several years after this incident I was obsessed with tracking ufo sightings but as time carried on I graduated and got focused on my career so until now I haven't been involved. That is until I discovered the TR-3B flying triangle which was reversed engineered by USAF from Roswell. It uses a magnetic disruptor field to lower the mass of the craft by 88%! check it out guys the future is now and we are not alone in the universe! Thank you so much for allowing me to finaly report this and thank you for your time."],"Longitude":"-119.584708","Latitude":"49.501468","Date Submitted":"05/09/2012 07:01 UTC","Tags":"City","Country":"Canada","files":["/var/www/straped/mufon/html2text/38034.html.txt","/var/www/straped/mufon/org/38034.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=49.501468,+-119.584708(38034)&iwloc=A&hl=en\"> mufon case (38034) map </A>","Case Number":"38034","Summary":"Started w/ 1 flashing object then another joined in.","Disposition":"Unresolved","Source":"MUFON","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Penticton","There were no other sightings in Penticton on or around August 15th 1999"],"City":"Penticton","Object Shape":"Star-like","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"08/15/1999 01:49 UTC","Log Number":"CA-05092012-0017"}