{"Longitude":"-117.640448","files":["/var/www/straped/mufon/html2text/38050.html.txt","/var/www/straped/mufon/org/38050.html"],"Date Submitted":"05/10/2012 02:30 UTC","divs":["Sighting DetailsI have answered this description in the easiest way, by following the numbered questions and answering them directly. 1. I was at home,taking out the trash when I noticed this bright red and greenish colored light illuminating the yard. I had to find out what was going on. 2. I went to see where the light was coming from and it was then that I saw the really bright lights that were just there , in sky , on this object that made no noise. The object seemed to hover and then move in a straight line, then back again. It would decend a little, then go back up. It would continue like this. It looked like an airplane was in the area, and the object seemed to go crazy with its lights. Almost as if the lights were flashing and brightening in a pattern. Sometimes the the object seemed to almost glow white as if the airplane was causing it to go crazy. 3. I actually thought it was a helicopter, when I went looking for the source of the light. 4. The object itself was circular, oval disk like in shape. It was dark except for the lights. It mostly hovered and made a straight line path. 5. I said, \"what the f*ck is that?\" and grabbed my phone and began to video. I have about 17- 20 mins. of film. It was the weird and I knew I had to get it on video. I was holding my phone up to video for quite some time that my arm was beginning to ache. After the sighting I knew I had to call my sister, she would know what to do, whom to contact. 6. I lost sight of the object when I came inside because the baby was coughing. By the time I came back out it was gone."],"Latitude":"34.101","Date of the Event":"05/09/2012 09:20 UTC","Disposition":"Unresolved","Log Number":"US-05102012-0004","Region":"California","trends":["There have been 6 other sightings in Upland","There were no other sightings in Upland on or around May 9th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.101,+-117.640448(38050)&iwloc=A&hl=en\"> mufon case (38050) map </A>","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Country":"United States","City":"Upland","Object Shape":"Circle, Oval, Sphere","Viewing Distance":"Over One Mile","Object Features":"None","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Summary":"The object was very bright in the sky. The lights went between a green, grayish-white, and red color.","Case Number":"38050"}