{"Weather Factors":"Unknown","Log Number":"US-05102012-0012","trends":["There have been 11 other sightings in Fountain","There were no other sightings in Fountain on or around May 9th 2012"],"Region":"Colorado","Case Number":"38058","Longitude":"-104.663991","Latitude":"38.737145","City":"Fountain","Summary":"Bright white light, no flashing, moving across the sky.","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","divs":["Sighting DetailsWhenever I see an object I automatically think that it is a man-made object until I see the object do something that is unnatural to man-made objects. On May 9, at approximately 8:00 pm MT., I was in my jacuzzi for about 10 minutes when I noticed a bright object starting north of me heading south. The object did not appear to be too far away. It was approximately 20-25 degrees about the horizon looking east. The object was was solid white, very bright, with no flashing at all. It was shaped kind of like a mushroom top. Flat on the bottom and curved at the top. I was watching it travel north to south at a fairly slow speed. I watched it for 10 seconds. It made no sound or left no contrail. There was no other low level aircraft at this time. There were however light high altitude aircraft flying at this time At that moment, I took my eyes away for a split second and looked back and the object was gone. I am not sure if it just disappeared or took off somewhere at a high rate of speed. All I know is that I kept looking for the object and would not see it again. The sky was clear and calm. I live about 6 miles south of the Colorado Springs airport and about 2 miles east of Fort Carson and have seen several different kinds of aircraft. This object did not act like any aircraft I know of. I am 22 years retired from the Air Force so my background on aircraft is pretty extensive."],"Source":"MUFON","Date Submitted":"05/10/2012 01:53 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38058.html.txt","/var/www/straped/mufon/org/38058.html"],"Date of the Event":"05/09/2012 07:57 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.737145,+-104.663991(38058)&iwloc=A&hl=en\"> mufon case (38058) map </A>","Object Features":"Dome","Object Shape":"Other"}