{"Disposition":"Unresolved","Longitude":"-111.631887","City":"Queen Creek","Country":"United States","Object Shape":"Unknown","Source":"MUFON","Object Features":"None, Unknown","trends":["There have been 21 other sightings in Queen Creek","There were no other sightings in Queen Creek on or around May 5th 2012"],"Log Number":"US-05102012-0008","Summary":"9 lights/orbs 2 green, 7 red, one red bigger than all other lights/orbs","Case Number":"38054","map":"<A HREF = \"http://maps.google.com/maps?q=33.205093,+-111.631887(38054)&iwloc=A&hl=en\"> mufon case (38054) map </A>","Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/38054.html.txt","/var/www/straped/mufon/org/38054.html"],"Latitude":"33.205093","Region":"Arizona","Date Submitted":"05/10/2012 12:39 UTC","Date of the Event":"05/05/2012 01:00 UTC","divs":["Sighting Details1 am on may 2nd 2012. my friend asked me to come outside and take a look at something. i walked out side and saw a red light or orb floating in the high northern sky about 1 mile away. we observed it for about ten minutes then two green lights appeared, one on each side of the red one, then shortly after 6 more red lights appeared under the Red and green light(s). the red light then Got brighter and dropped something about equivilent size to itself rapidly hitting the ground below it. as soon as it happen we grabbed our cameras and ran to the area we believed it hit.. soon after leaving our house the lights disappeared... not just vanishing.. no they were chased like no other! they flew toward the superstition mountains.. it seemed they were being chased because they left in a hurry and 2 minutes later about 4 f16s flew right over us. so after 13 hours of nonstop searching for the landing site.. we came across it at about 12pm may 3rd 2012. whatever it was it melted through the sidewalk and concrete.. its been about a week since then and i still go back everyday to observe it.. its changing the ground drastically. its forming some kind of crystal substance almost as if the crystals are a biological life form. its pretty cool. though i hope its not a bad thing lol."],"Weather Factors":"Unknown"}