{"Date Submitted":"05/10/2012 04:57 UTC","Object Flight Path":"Hovering then path,Straight-line path","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Object Shape":"Other","divs":["Sighting Detailssitting outside my house smoking a cigarette, something caught my peripheral vision and as soon as i made eye contact with the UFO it took off faster than a fighter jet. I believe it was hovering before i spotted it, but it was not in my line of sight for more than 2 seconds. I looked above the tree line and saw a very bright red circle of light with two beams of yellow golden light coming off each end (looks like this shape basically -o-) only about an inch across in the sky. It was like literally as soon as eye contact was made from me it knew it because it zoomed off to the right behind the treeline. It was a very solid controlled movement like it had no problem changing directions and accelerating. Didnt look like solid matter either more of just light, there was no texture almost as if a spotlight was making a very strange shape on the sky (no clouds this night either). I spotted it and it was 100% some object accelerating at extremely high speeds out of my view as soon as i saw it. Very strange encounter i didnt really know how to respond afterwards. I was with my brother and a neighbor both of them were facing me so it was behind them. After it happened i got crazy goosebumps and my body was shaking, felt like my head was playing tricks with me but im positive it was something. About 30 seconds after it left i think there was a slight rumble like thunder from very far away im not sure if that is related to the UFO or not. Thanks for this website im glad i can share some solid information with others who care. This has really changed how i look at things now.... man, i cant believe i actually saw a ufo"],"Log Number":"US-05102012-0013","Summary":"red circular center with 2 gold/yellow beams coming off each end -o- shaped looked like solid light","map":"<A HREF = \"http://maps.google.com/maps?q=33.504223,+-81.956015(38059)&iwloc=A&hl=en\"> mufon case (38059) map </A>","City":"North Augusta","Object Features":"Other","Sighting Duration":"00:00:02","Latitude":"33.504223","Longitude":"-81.956015","files":["/var/www/straped/mufon/html2text/38059.html.txt","/var/www/straped/mufon/org/38059.html"],"Region":"South Carolina","Weather Factors":"Unknown","Case Number":"38059","trends":["There have been 7 other sightings in North Augusta","There were no other sightings in North Augusta on or around May 9th 2012","This sighting has never been favorited.",""],"Date of the Event":"05/09/2012 11:10 UTC"}