{"City":"Onaway","Sighting Duration":"Undisclosed","Summary":"very bright lights above trees. turned on and off. two other moving lights in distance, changed direction.","Object Features":"Unknown","Tags":"City","trends":["There have been 3 other sightings in Onaway","There were no other sightings in Onaway on or around May 9th 2012"],"Weather Factors":"Unknown","Date Submitted":"05/10/2012 01:09 UTC","files":["/var/www/straped/mufon/html2text/38056.html.txt","/var/www/straped/mufon/org/38056.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.362012,+-84.258165(38056)&iwloc=A&hl=en\"> mufon case (38056) map </A>","divs":["Sighting DetailsI spend a ton of time in the woods alone at night because I hunt coon dogs for a hobby and I've never seen anything like it. I live in rural northern michigan and there is no light pollution and the moon wasn't up yet. My wife advised me that there was a freeze warning and I should cover the strawberries since they had started to blossom. I had my LED coonhunting light on and I was dragging a tarp across the yard to cover up my strawberries. I shined my light on a tall pine tree across the road and saw 3 bright orange objects shining back at me. They looked just like raccoon eyes only bigger and brighter so I turned the light off and they stayed on, then they went out for a few seconds. I shined the tree again and they shined back at me again only much brighter this time. I turned out my light and they stayed on for a few seconds and went out again. I was dumbfounded and confused because when eyes reflect they go out instantly when you turn off the light source. Then they lit up again only this time they weren't behind the tree, they were to the right of it and I could tell they were much higher in the sky than I originally thought. This time they stayed on and hovered in the shape of a triangle. Then all 3 lights rotated and stopped then went out. I ran into the house and grabbed my video camera and got my wife. When we got back out two orbs lit up a little further south for just a few seconds and went out again but there were two other twinkling lights (didn't look anything like planes) moving north very slowly. They stopped then moved back to the south one following the other making no sound at all then left over the tree line. I managed to catch a few seconds of the sighting on digital video. The \"twinkling\" crafts didn't appear on the video since they were so far away at that point. I posted my sighting on Facebook and two of my friends also said they saw it but had not planned on telling anyone until they saw my post. One friend was in his house 10 miles west of me near m-68 and m-33 and his wife saw it out the window. He went outside and saw it clearly. He saw 3 bright lights (red, green and white) hovering about 100 yards away then they went out. He said the lights were definitely not an airplane. It was close and made no sound. Another friend was traveling east on M-68 near M-33 east of Afton, Michigan. He saw 4 bright orange lights out the window of his truck. They appeared to hover then moved toward Onaway. He tried to keep up with it but lost sight of it over the trees. He also saw two \"craft\" following the lights but they appeared to \"twinkle\" like a star. He is a Fire Chief and very credible."],"Log Number":"US-05102012-0009","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"05/09/2012 10:15 UTC","Object Shape":"Circle","Latitude":"45.362012","Longitude":"-84.258165","Disposition":"Unresolved","Country":"United States","Case Number":"38056","Region":"Michigan"}