{"map":"<A HREF = \"http://maps.google.com/maps?q=31.977829,+-99.900063(38052)&iwloc=A&hl=en\"> mufon case (38052) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":[],"City":"Undisclosed","Latitude":"31.977829","divs":["Sighting Details I am a 4th generation abductee. I have experienced missing time, spider bites, punctures strange blotches on my hands, small wound that healed in six hours on my palm, and scoop marks. A psychic told me the punctures in the pic attached were immunizations. I saw 3 greys when I was five years old. I have seen three ships as ships, up very close about a hundred feet from them. I have seen cars do very odd things which in all probability they were small craft instead of cars. I have seen portals in broad daylight. I have seen kiwi birds in Nacogdoches as well as mule deer, none of which are here in this part of Texas. I am often psychic and sometimes I see the future. I know nothing of coming disasters they haven't told me anything like that. They have saved my life eight times that I know of. One of the incidents was saving me from an exploding cannon. Someone got hurt in my place. There is lots more stuff. This is just a brief overview. They come one or more times a month. They have been very active the last two months. I believe at the moment I have an implant in my sinus or brain. Sometimes they talk to me. I talk to them often. They have done a few things for me as proof. When I discovered what was going on in 2009 I thought I was crazy, and they helped me through some rough spots. I always thought that guardian angles were doing stuff to me. I'd like my case investigated further by MUFON if possible. I will take lie detector tests, x-rays, anything. I want the truth revealed to and understood by the public. I do not like having a secrete life. I also had cancer when I was 2.5 years old. I had it for over a year before they found out why I was sick. It was a sarcoma. The doctors didn't have a clue as to why I lived long enough for them to find it. Sarcoma is the most invasive cancer there is. Most still die from it. I may have been the first to live from it."],"Source":"MUFON","Object Features":"Undisclosed","Longitude":"-99.900063","Log Number":"US-05102012-0006","Object Flight Path":"Undisclosed","Date of the Event":"01/01/2009 01:00 UTC","Disposition":"Unresolved","Case Number":"38052","Weather Factors":"Unknown","Summary":"Abduction experiences","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/38052.html.txt","/var/www/straped/mufon/org/38052.html"],"Region":"Texas","Date Submitted":"05/10/2012 06:34 UTC","Tags":"City","Country":"United States"}