{"Object Flight Path":"Hovering then path","Source":"MUFON","Latitude":"38.192396","trends":["There have been 8 other sightings in Morehead","There were no other sightings in Morehead on or around May 10th 2012","This sighting has never been favorited.",""],"Case Number":"38069","Sighting Duration":"Undisclosed","Region":"Kentucky","Date of the Event":"05/10/2012 10:00 UTC","Weather Factors":"Unknown","Longitude":"-83.433547","Tags":"City","Object Features":"Unknown","City":"Morehead","Summary":"Hovering the descending light over Eagle Lake","map":"<A HREF = \"http://maps.google.com/maps?q=38.192396,+-83.433547(38069)&iwloc=A&hl=en\"> mufon case (38069) map </A>","Object Shape":"Sphere","Date Submitted":"05/11/2012 01:00 UTC","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsMyself, my fiance and her sister witnessed a hovering light slowly descend into the mountains past Eagle Lake on Morehead State University's campus. She lives in a top-floor apartment near Eagle Lake, and I filmed and observed the object from her rear balcony which has a view of the lake's dam. We first observed the object around 10:00pm, and I just pointed it out as an abnormally bright star. However, my curiosity took hold as my brother-in-law's brother filmed a UFO in Paintsville, KY last night. I observed the light for about 5 minutes from her balcony when it suddenly disappeared and reappeared at a slightly lower elevation. At this point, I decided to use my iPhone to film it to observe what it would do. For the first short while, it seemed to hover, and pulse. I had to use a separate app other than the built-in one on the iPhone to film so that I could zoom while filming. I shot 4 separate clips which show the object disappearing, reappearing, changing elevation and pulsating in luminosity. The final clip shows the object as it disappears over the treeline of the mountains just past Eagle Lake. The nighttime sky was mostly clear, with only a few wispy clouds in view, none obscuring the object. Venus was in clear sight slightly to the east of the object. The only editing I have done to these clips is add text, flipped them to proper orientation and stabilized them slightly in Final Cut Pro."],"Country":"United States","files":["/var/www/straped/mufon/html2text/38069.html.txt","/var/www/straped/mufon/more/38069_submitter_file1__IMG1460.JPG","/var/www/straped/mufon/org/38069.html"],"Log Number":"US-05112012-0004"}