{"files":["/var/www/straped/mufon/html2text/38064.html.txt","/var/www/straped/mufon/org/38064.html"],"Sighting Duration":"00:10:00","divs":["Sighting DetailsI was going to my backyard to get the garbage moved to the street. Looking directly East. In the tree tops, I saw a single bright red light moving in my direction (West). At first I thought it was a landing light from a Jet aircraft taking off from Cleveland Hopkins but the light was very red and bright in color. Object was moving slowly and continued West until 45 Degrees above the horizon, where it stopped moving. I immediatley saw another red light moving in the same direction as the first object , red in color and bright. This second object stopped about 30 degrees above the horizon . At this time both objects are not moving. Occaisionaly, the objects would abruptly and I mean abruptly ,change to white and then back to red. I then saw the third red object approach from the same direction and then stop and hover about 30 degrees above the horizon. From my vantage point they formed a somewhat triangular formation. Not a perfect triangle ..The lead object then moved South stopped, then Northeast back to towards the other 2 objects. Then it stopped again. The three objects then all moved back to the East, I lost sight of the last 2 objects as they went below the tree line in my line of sight. The lead object then went dark. About 30 seconds later the lead object again began to light up with a red color. At this point I ran into the house and got my binoculars. Coming back out I saw these 3 objects again were taking the same path as I described ,for a second time. All were staionary and then the lead and second object began to move towards one another. I looked at them through the binoculars , got a good focus and could see the objects plainly were round, sphere shaped. These 2 objects were moving together and I thought they were going to collide. I could barely see any space betwen them when they quit moving together. Now the objects bagan to move East again and I lost site of the trailing (3rd) object. At this time my wife came out because I was yelling for her. The 3 objects again moved West in our direction my wife was able to see all 3 objects at this time. The objects then began to move away to the East . The lead object stayed behind and hovered while the 2 other objects disappeared from view behind the tree line. This lead object then began moving laterally again to the South and began to dim. I watched through the binoculars and could see there was a definate shape as the light faded to black. Conditions were clear sky, no moon, no wind , temp about 50 deg F. No light pollution , as my back yard is pretty dark. I'm 59 years old, I hold a commercial pilots liscense (I do not fly for the airlines but am an active and current pilot). This was a good sighting. The objects never moved at a high rate of speed, but rather slowly the whole time , except when they were stationary. They were not airplanes, as no acquistion strobes were seen. The entire object gave off light. The objects did not travel far in any direction, they seemed to stay in a relativley confined area of the sky .Not sattelites, as they they reversed direction several times.I know what sattelites look like in the night sky. I saw no low flying aircraft before or after this sighting. I did see high altitude jets , however. These objects appeared to be fairly low. I can't gauge how far they were away or how high they were. But these had to have been seen by other people. They were bright and very obvious..Call me at my home if you would like to chat. I will make sure I read the local newspaper to see if anyone else saw these. Thanks..Bob"],"Latitude":"41.410449","Date Submitted":"05/10/2012 11:38 UTC","Weather Factors":"Unknown","Region":"Ohio","City":"Amherst","Source":"MUFON","Disposition":"Unresolved","Log Number":"US-05102012-0018","Object Features":"None","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Amherst","There were no other sightings in Amherst on or around May 10th 2012"],"Tags":"City","Longitude":"-82.230516","Summary":"3 bright red objects , Sometimes turning white, sometimes turning dark","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date of the Event":"05/10/2012 09:55 UTC","Case Number":"38064","Object Shape":"Sphere","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.410449,+-82.230516(38064)&iwloc=A&hl=en\"> mufon case (38064) map </A>"}