{"map":"<A HREF = \"http://maps.google.com/maps?q=35.526571,+-86.570697(38061)&iwloc=A&hl=en\"> mufon case (38061) map </A>","trends":["There have been no other sightings in LiepersFork, Tn.","This sighting has never been favorited."],"Summary":"West to North reflective object in leipers fork, tn approximately 9:30 am on may 10th 2012","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Tags":"City","Object Shape":"Bullet, Missile, Cigar, Oval","Case Number":"38061","Latitude":"35.526571","Log Number":"US-05102012-0015","City":"LiepersFork, Tn.","Longitude":"-86.570697","Region":"Tennessee","Weather Factors":"Unknown","divs":["sighting details9:30 am 5\\10\\2012 i was driving north thru liepers fork, tn. on my way to work, when a reflective object caught my eye just west of me over the natchez trace parkway. the sun-glare showed that it was slightly banking possibly from an eastward direction to north. i thought it ws a plane at first, but it was too low in the sky. then i realized i couldn't see wings. i decided to try and speed up to get a better look and saw that it too was speeding up slowly then moved to a high rate of speed over the school. as a tall tree passed my view for half a second(i was driving 55 mph) the object was gone. there was no clouds in the sky and no obstructions. this is my first daytime sighting. from the time i saw the object to the time it vanished was approximately 15-20 seconds. i was perplexed at first, then just intrigued and wanting to see better detail, by the time the sighting was over i was in awe and excited. it definitely solidified the existence of these unknown objects for me."],"Disposition":"Unresolved","Sighting Duration":"00:00:20","Date of the Event":"05/10/2012 09:30 UTC","Date Submitted":"05/10/2012 06:58 UTC","Object Flight Path":"Path with directional change","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/38061.html.txt","/var/www/straped/mufon/org/38061.html"],"Source":"MUFON"}