{"Country":"United States","Summary":"various number of lights changing directions","Longitude":"-86.761154","Object Shape":"Sphere","City":"Monticello","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/38068.html.txt","/var/www/straped/mufon/org/38068.html"],"divs":["Sighting DetailsWe had taken the kids to Indiana Beach for the day. The park was closing and we were walking from the park to the parking lot, we noticed an old couple standing on the walking bridge. I stopped to see what they were looking and pointing at and noticed a bight light in the southeast sky. I was looking at what appeared to be a light that was twice as large as any star that was in the sky. Suddenly more lights appeared. At this time the park had shut off all of their lights and the bridge was full of people heading to the parking lot. The light appeared to be just above the tree tops across the lake from where we were all standing. This light then disappeared. A few seconds later more lights appeared at about a 45 degree angle from us and more in the southern sky then when the first light appeared. There were a total of about 4-5 lights at this time and they all would get really bright and then dim. During this whole time we could not hear anything except the frightened people on the bridge who were witnessing this event. These lights formed no certain pattern they had just appeared in the sky and were going from about a star like size to about the size of a penny. These lights held their position for about 30 seconds until they started moving around in the sky. These lights chased each other in weird patterns going from the southern sky to the southeast, then to the southwest, the whole time they would get really bright and then dim. They also would gain and loose altitude in just a matter of a few seconds. It reminded me of what I would think a \"dog fight\" would look like. The difference being the fact that these lights would appear and disappear and change direction and altitude too quickly to be a jet. Everyone watched these light for a few minutes when they all just vanished. After looking for them for about 5-10 seconds, someone noticed that they had moved behind us and were now in the northern sky and were acting same way. They were in the northern sky for about 20-30 seconds when they vanished again and then reappeared back in their original spot in the southern sky. We watched these objects and never heard them make any sounds. After about 10 mins of watching this event, we could hear the sound of jets coming from behind us (the northern sky at this time) and 3 military jets flew right over us (about tree top high) and headed right in the direction of the lights. These lights then shot straight up in the sky and were gone. We waited on the bridge for about 20 mins to see if anything would return but nothing did. But as we were heading back home, my sons mom (who was in Rochester at the time on Lake Manitou) called to ask us where we were at and if we had seen anything weird. My son told here what we had seen and she said they were out on the pontoon and seen the same thing. Rochester is about 60 miles from where we were at and she had seen them."],"Disposition":"Unresolved","Date Submitted":"05/11/2012 01:04 UTC","Case Number":"38068","Latitude":"40.751567","map":"<A HREF = \"http://maps.google.com/maps?q=40.751567,+-86.761154(38068)&iwloc=A&hl=en\"> mufon case (38068) map </A>","Log Number":"US-05112012-0003","Viewing Distance":"Unknown","Region":"Indiana","Object Flight Path":"Other","trends":["There have been 5 other sightings in Monticello","There were no other sightings in Monticello on or around July 23rd 2008"],"Weather Factors":"Unknown","Date of the Event":"07/23/2008 12:00 UTC","Source":"MUFON","Object Features":"None","Tags":"City"}