{"Tags":"City","files":["/var/www/straped/mufon/html2text/38066.html.txt","/var/www/straped/mufon/org/38066.html"],"Object Shape":"Circle, Sphere","divs":["sighting detailsreceived a call from a train electrical engineer friend who wanted me to accompany him to a malfunctioning railroad crossing. he got a call from the authority that the gates were down on a crossing off rt 28 athol\\ thurman area. we were in warrensburg headed north in route to the location when we both noticed ( 10-10:30 pm) an incredibly super bright white planet-like light\\object hovering stationary at approx 300-500 ft elevation within a mile of where we were. we were blown away but we were unable to stop because the crossing needed his immediate attention. as we drove past the ufo, we lost sight of it due to trees and other obstructions in our view. we were somewhat nervous because it seemed as though the object was very close to where we were going and thought that maybe this is why the railroad gates malfunctioned. we arrived at the location to check the control box, no immediate evidence of foul play...no evidence of the bright ufo or related phenomena. we quickly returned to the original sighting location...and it was gone...we wished we had taken a few minutes to film the object but we missed the opportunity. we stayed and hunted the area for any other activity, but all went quiet and back to business as usual."],"Summary":"Super bright white Planet-like but 10X larger hovering with slight pulse","Date of the Event":"05/10/2012 09:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.517483,+-73.790666(38066)&iwloc=A&hl=en\"> mufon case (38066) map </A>","Disposition":"Unresolved","Latitude":"43.517483","Log Number":"US-05112012-0001","Object Flight Path":"Stationary","Country":"United States","Weather Factors":"Unknown","Case Number":"38066","Date Submitted":"05/11/2012 12:52 UTC","trends":["There have been 3 other sightings in Warrensburg","There were no other sightings in Warrensburg on or around May 10th 2012"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Warrensburg","Region":"New York","Longitude":"-73.790666","Viewing Distance":"501 Feet - 1 Mile"}