{"Country":"Canada","Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=45.359192,+-75.795989(38073)&iwloc=A&hl=en\"> mufon case (38073) map </A>","Date Submitted":"05/11/2012 09:46 UTC","Tags":"City","Object Flight Path":"Stationary,Straight-line path,Other","Disposition":"Unresolved","City":"Ottawa","Case Number":"38073","Object Features":"Unknown","divs":["Sighting DetailsMy boyfriend and I were on the balcony of our apartment in Ottawa Ontario. He saw this huge orange big ball of light in the sky.We were both kinda like what the heck is thy an stared for a while then it would get smaller&disappear. It was foggy out this night&whenever the light would disappear whenever it was about to reappear the clouds in the sky would light up and then BAM the light would b back.It was the scariest thing I had seen really freaked me out. We took a video of it on an iPhone but there is no comparison to seeing it in person. This orange light in the sky was huge bigger then any plane we have seen from our balcony in the same area.We had been livin there fo years and go out on the balcony quite often and had never seen anything like that before.We saw that sometime in december 2011 I believe for about an hour long.It would appear&then reappear every few mins and sometimes would go away for like 15 mins then come back it didn't look like it was flying it look like it would like hover in the same place didn't really look like it was moving and we saw it dart across the sky once or twice the first time I thought my eyes were playing tricks on me but the. Me and my bf saw it happen again.Also this big huge orange light was bigger in the sky at that far a distance was bigger then a street light in front of us that we could see off the balcony. We had been looking hoping to see it again ever since.may 5 2012 around 9:45-10:25pm my sister and I were sitting On the balcony having a smoke while boyfriend and dad were at our new place right down the street moving stuff as we were moving out that day.My sister was like \" oh what is that?\" I look up and I was shocked! It was the huge orange ball of light that I had seen before. It really freaked her out because I had told her before what we had seen and showed her the videos.We were both really freaked out because it was exactly what I had seen before. Again this huge light was just an orange light no other lights that blinke at all or anything it was almost in the exact location as the one was the last time. We watched it disappear and reappear like it had done previously. The only difference this time was it was not foggy out so it was more clear. I could see a light over top of the water this time not sure if it was a light flashing down or the fact that this light was so huge that it was reflecting off the water. And then out of nowhere a second one appeared and the first one disappeared ! It was the first time we had seen 2 ! I had like no space left on my phone to video tape most but I caught the part on film where the one was there the second one appeared and the first One then disappeared. We watched for about a half an hour watching then disappear and reappear at one point we saw them both side by side in the sky! It also looked like when the one was in the sky&we could see the light across the water we could see this big ball of orange light move towards us slowly it was like in the same spot but would slowly move closer. I called my boyfriend when I saw this and told him to get back over here to see as he had seen it before with me. By the time he got back it was gone. As it was disappearing and reappearing when it was gone it would just simply not reappear. We have videos though we made sure of that. We moved out that day though so I doubt well ever see it again this building blocks the view of where we had seen them twice before."],"Source":"MUFON","Summary":"MASSIVE orange light in the sky that would disappear & reappear and then we saw a second one","Log Number":"CA-05112012-0008","files":["/var/www/straped/mufon/html2text/38073.html.txt","/var/www/straped/mufon/org/38073.html"],"Weather Factors":"Unknown","Object Shape":"Fireball, Sphere, Star-like","Viewing Distance":"101-500 Feet, Unknown","Longitude":"-75.795989","Sighting Duration":"Undisclosed","trends":["There have been 55 other sightings in Ottawa","There was one other sighting in Ottawa on or around May 5th 2012"],"Latitude":"45.359192","Date of the Event":"05/05/2012 12:00 UTC"}