{"Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Summary":"ncredibly fast metallic object shot into my view halted for a second maybe two then shot off in a northward direction and dissappeared","Date Submitted":"05/11/2012 10:30 UTC","Viewing Distance":"Over One Mile","Tags":"City","Date of the Event":"05/11/2012 08:30 UTC","Case Number":"38074","Latitude":"42.430801","City":"Oneonta","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.430801,+-75.026135(38074)&iwloc=A&hl=en\"> mufon case (38074) map </A>","files":["/var/www/straped/mufon/html2text/38074.html.txt","/var/www/straped/mufon/org/38074.html"],"Longitude":"-75.026135","Weather Factors":"Unknown","Log Number":"US-05112012-0009","Region":"New York","divs":["Sighting DetailsFirst, I must say that I have never reported anything like this before, though I have seen things in the sky I couldn't explain...the only reason I even bothered with this report is that it was seen in open clear blue skies and was so obviously NOT anything I could explain away. I was driving to work at an independent living center where I am an architectural barrier consultant and code enforcer...the sighting took place on a straight road with a clear view of the morning sky... while I was noticing how vivid and blue the sky was I saw something of a flash come into my view heading east at about (and I am estimating here) 4 miles out and about 15,000 feet up (much lower than most jets I see in this area). It slowed from a flash, to a halt in less than a second maybe two seconds...when it stopped I only had time to realize it was really sitting there and that it was reflective to the morning sun before it shot off to the north at a rate of speed that was absolutely insane...in my 42 years I have never seen anything that could do this type of a maneuver...I pulled off to the side of the road to try to see where it went and collect my head a bit...I was absolutely dumbfounded and my mind was racing to come up with ANYTHING that could explain what I just saw...Here is what I am sure of...there is NO WAY that was a bird, swamp gas, man made flying machine, meteor or a hallucination...nothing in our common understanding of G forces and man's limitations against them could explain this one...WOW!! Still have goose bumps over it! Do I have proof? No, but I would definitely take a lie detector test!"],"Disposition":"Unresolved","trends":["There have been 2 other sightings in Oneonta","There were no other sightings in Oneonta on or around May 11th 2012"]}