{"Longitude":"-74.161814","Case Number":"38072","Source":"MUFON","Object Shape":"Diamond, Flash, Sphere, Star-like","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Date of the Event":"05/10/2012 12:00 UTC","trends":["There have been 9 other sightings in Paterson","There were no other sightings in Paterson on or around May 10th 2012","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","divs":["Sighting DetailsAround midnight I heard a weird sound, it was quite strange, jet like just a tad more disturbing, and it felt wrong. So i decided to look out my window, and sound got louder. I looked up and saw the typical stars in the sky that dim in the distance motionless. Only one moved to the right and was sort of glued to the other, it is when i went to my room and got my iphone, I needed to record it. While im getting camera ready I look up, the stars was triple the size and getting bigger as it got closer descending to our neighborhood. The sound got louder, fellt and sounded like pulsating waves of sound, I immediately felt scared because the object got closer and I saw a clear look as it hovered pass my apartment, did not look nor sound like a jet, plain, helicopter or any other flying vehicle we know. It was definitely ship like, HUGE, the pulsating lights were under it, like 3 light circles pulsating and as it pulsated emitting the sound. It was disturbing, ship hovered by, then i saw more coming and recorded, i captured about 2 minutes of the sound very disturbing, as well as the light strobes, and on the video u can see the one that moved, hovered and disappeared out of nowhere. Im uploading a video here, but i recorded about 8 more I'll upload today. I am still shaken, scared, couldn sleep, noises and hovering stopped at around 3:30am Eastern Time. I know for a fact it's UFO, objects behaved like stars first then moved, ascending, descending, fast, then when passing by each other, hovering for a second like communicating then continue moving in opposite directions. Sound were very loud, coming and going as ships were hovering back again. I spotted at least 5 ships that hovered back and forth. And 3 specific ones that were together on a straight line, they would hover a bit and move but always in formation, those were white center, and outer glow was yellow, blue and red. I have more video footage, hopefully USA releases an official statement, if not I need to submit this info, I want the world to see we are not alone, if we are in for an invasion, last night was definitely a test. As they went and returned for about 3 hours."],"Summary":"Strobbing star like objects loud sound","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/38072.html.txt","/var/www/straped/mufon/org/38072.html"],"City":"Paterson","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.92908,+-74.161814(38072)&iwloc=A&hl=en\"> mufon case (38072) map </A>","Log Number":"US-05112012-0007","Region":"New Jersey","Disposition":"Unresolved","Object Features":"Undisclosed","Latitude":"40.92908","Date Submitted":"05/11/2012 09:30 UTC"}