{"Viewing Distance":"101-500 Feet, Unknown","Object Flight Path":"Stationary,Other","divs":["Sighting DetailsI was in my backyard about 4 nights ago some strange things have been seen in the sky around here by me and that might have made me more aware than others to take a second look at these lights. with my naked eye they just look like stars but way too low in the sky for stars. one is bigger and brighter than the other. They have come every night for the last 4 or 5 nights. They show up before sunset and are gone about an hour and a half later. I got some excellent video footage of these lights. when I zoom in the larger light (actually both lights, but I focused more on the one I could see better) it changes from brilliant white to purple to emrald green and sometimes seems to change shape. I can see right into the thing as it changes colors but it has a distinct border...it's not like a blob light it's very purposefull in shape. These lights hover and are pretty still. I am in the Elverta, California area. If anyone from here reads this these lights are appearing it seems somewhat over Elverta road just down from the Cherry Brook fire dept. I see them from my backyard and I live on Colonnade way. If anyone from this area reads this please keep your eyes to the sky... also at around 10 pm every night for a week there is another light that comes pretty much directly over the fire station and it is gone by 11:30 pm my video does not take night time shots very well so I have not been able to capture this one on film. it is a single light too low to be a star but high enough that people would preobably think it was one. Also enclosed in this report are two pictures I snapped of a seperate incident about a week ago ..maybe a week and a half of a silver round light object right over my duck pond. This object was moving and caught my eye as I walked out back one morning around 8 am approx. I ran for my camera and got off 2 snaps of it before it traveled away. it appeared to be rotating. please look at my photos. thank you"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.721858,+-121.456688(3808)&iwloc=A&hl=en\"> mufon case (3808) map </A>","Log Number":"US-09052005-0001","Weather Factors":"None","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Other","Latitude":"38.721858","Case Number":"3808","Summary":"Balls of light in the sky/ they look like energy/plasma, turning white, purple, emerald green","files":["/var/www/straped/mufon/html2text/3808.html.txt","/var/www/straped/mufon/more/3808_submitter_file1__strangesilverball1-08282005.JPG","/var/www/straped/mufon/more/3808_submitter_file2__strangesilverball2-08282005.JPG","/var/www/straped/mufon/org/3808.html"],"Disposition":"Insufficient Data","Date of the Event":"09/04/2005 12:00 UTC","Date Submitted":"09/04/2005 12:00 UTC","Longitude":"-121.456688","Country":"United States","Object Features":"Other","City":"Elverta","trends":["There has been one other sighting in Elverta","There were no other sightings in Elverta on or around September 4th 2005","This sighting has never been favorited.",""],"Tags":"City","Region":"California"}