{"Weather Factors":"Unknown","Source":"MUFON","Latitude":"40.831102","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around May 11th 2012","This sighting has never been favorited.",""],"Case Number":"38083","Disposition":"Unresolved","divs":["Sighting Detailsi was at home and i was upset for personal reasons when i looked out my window. i saw a plane passing by the noise made me look up and then i saw the object(s). i honestly been seeing strange lights and movements the past couple of days so at first i thought maybe its a far away plane. the object was hovering as two other went by it seemed as if the 1st object had stopped while thee other two passed by them not to far apart from one another. than suddenly looked as if it took off in the same direction the other two objects in a wobble or spinning like motion but at a faster really faster rate! the past few days ive been seen strange objects in the city skies ,on may 6th 12 about 2am-ish ive seen wat at first i thought was star but the movements convinced me it was a star.it was pulsin and had another which seems to be circling it like orbiting..this was another reason that had me constantly looking up now.so when i spotted this one i just knew and felt a sense of unexplainability in me,sorry! all i can do was pull out my phone and got to snap about four pictures i try to get one as close as possible but really blurry. i would like some feedback i would like to know if i am right or wrong? plane? or UfO? i watched it until they were all gone the 1st two seem to just passed right by kind of back to back and the third one hovereed thats the one i actually got a picture of! then after about 2 minutes it took off in a vertical motion. im 98% sure that was not air regular airplane. thanks"],"Object Flight Path":"Path with directional change","Object Features":"Unknown","Country":"United States","City":"New York","Longitude":"-73.869079","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/38083.html.txt","/var/www/straped/mufon/more/38083_submitter_file1__IMG20120511194402.jpg","/var/www/straped/mufon/more/38083_submitter_file2__IMG20120511194406.jpg","/var/www/straped/mufon/more/38083_submitter_file3__IMG201205111944061.jpg","/var/www/straped/mufon/more/38083_submitter_file4__IMG20120511194406picsay.jpg","/var/www/straped/mufon/org/38083.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.831102,+-73.869079(38083)&iwloc=A&hl=en\"> mufon case (38083) map </A>","Log Number":"US-05112012-0019","Date of the Event":"05/11/2012 07:30 UTC","Sighting Duration":"Undisclosed","Object Shape":"Bullet, Missile, Cylinder, Square, Rectagular","Tags":"City","Region":"New York","Summary":"was having a sort of arguement with my wife and suddenly mad looked out my window and saw the object which seem to be hovering","Date Submitted":"05/11/2012 10:59 UTC"}