{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=29.852691,+-97.920941(38085)&iwloc=A&hl=en\"> mufon case (38085) map </A>","Sighting Duration":"Undisclosed","Latitude":"29.852691","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Longitude":"-97.920941","files":["/var/www/straped/mufon/html2text/38085.html.txt","/var/www/straped/mufon/org/38085.html"],"Country":"United States","Tags":"City","Weather Factors":"Unknown","Region":"Texas","Date of the Event":"05/11/2012 09:27 UTC","Object Features":"Unknown","Source":"MUFON","Case Number":"38085","Log Number":"US-05112012-0021","Viewing Distance":"Unknown","divs":["sighting detailsi was preforming the duties of my job which require me to be outside patrolling at night. i happened to look up (as i like looking at the stars) and i saw 3 red-orange orbs that were then joined by a 4th of the same color and approximately the same size. at first i thought maybe they were stars or meteorites but they where first off moving and then also moving to slowly. i saw them in the sky down the street from where i was and the lights moved toward where i was but not \"at\" me. you could hear a slight whirring noise as they got closer but they were not planes. the lights almost resemble fire but not really. they were moving over the highway from the direction of wimberly, texas very slowly when they were almost over the complex i work at they stopped, hovered a moment and then continued moving slowly toward seguin, texas ( i think that is east to west...not really good at the cardinal directions haha). when they were above the complex i work at\\ field next the the complex they just disappeared like they were never there. one of the lights did sort of fade come back and then disappear but the others were just gone and the noise with them! although i am curious about what they were i dont really care...it was exciting. i ran to try to get my family but the lights were gone before they came out. several people stopped at our complex squealing and yelling excitedly \"did you see that? did you see that? what were they?\" another person said that people were stopped in the street in town trying to take videos and photos...he said they wouldnt come out on his own camera and my phone wasnt strong enough to pick them up as i have an older phone."],"Object Shape":"Sphere","Summary":"3 red-orange glowing orbs moving in sky, hovered then moved again, from Wimberly Texas area toward Seguin Texas Area, Disappeared in sky directly above where I and others stood watching!","City":"San Marcos","trends":["There have been 4 other sightings in San Marcos","There were no other sightings in San Marcos on or around May 11th 2012"],"Date Submitted":"05/11/2012 11:43 UTC"}