{"divs":["Sighting DetailsI was in my back yard taking my great dane (Shiloh) out to do her nightly business (9:03 pm). I noticed a very bright light in the sky (60 degrees west of my home) t first thought it was the north star (but it was FAR too large and too bright!). I then looked 90 degrees up and the north star was almost directly over my house where it is every night. Thats when I called my wife (a middle school science teacher) to come out and take a look. She confirmed it was not the north star but something that seemed odd. A very bright white light the size of an asprin just hovering in 1 spot,and next to it was a 2nd light(s) red and green blinking in a triangular pattern. After about 5 or 6 minute later another 3rd (what looked like a extreamlly fast moving helecoptor with flashing red lights-what I think may have been an Air force helecoptor) flew right directly at it,....then past it....then it the vanished out of sight. When the helecoptor with the flashing red lights or whatever it was vanished it gave me a very unsetteling feeling as if something was very wrong. At apox. 9:36 pm both the asprin and red & green triangular blinking light just \"poof\" disappeared. I know this may sound crazy but I KNOW what I saw and I am in a quandry whith very mixed emotions. At this point (9:59 pm) there has not been a reappearence and I need to go lay down for I am feeling very ill-at-ease Thank you for listening and if you had other sightings PLEASE call me and let me know for it mught make me feel a little better Craig Lospaluto 732 540 9433"],"Tags":"City","Object Flight Path":"Stationary,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.403874,+-74.194463(38081)&iwloc=A&hl=en\"> mufon case (38081) map </A>","trends":["There has been one other sighting in Matawan","There were no other sightings in Matawan on or around May 11th 2012"],"Date of the Event":"05/11/2012 09:12 UTC","Case Number":"38081","Longitude":"-74.194463","Object Shape":"Circle, Star-like, Triangle","City":"Matawan","Date Submitted":"05/11/2012 09:59 UTC","Region":"New Jersey","Country":"United States","Weather Factors":"Unknown","Latitude":"40.403874","Viewing Distance":"N/A","Log Number":"US-05112012-0017","files":["/var/www/straped/mufon/html2text/38081.html.txt","/var/www/straped/mufon/org/38081.html"],"Object Features":"Unknown","Summary":"2 lights (1 LARGEer steady white light) next to that (Grren & Red flashing lights in a triangular pattern","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}