{"Log Number":"US-05112012-0016","Country":"United States","Region":"Arizona","Longitude":"-111.087521","Tags":"City","Case Number":"38080","City":"Undisclosed","Date Submitted":"05/11/2012 09:03 UTC","Latitude":"34.054788","Viewing Distance":"101-500 Feet","Object Features":"None","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Date of the Event":"05/10/2012 09:45 UTC","Summary":"Big solid bright glowing orange orb. Not one other characteristic.","Disposition":"Unresolved","divs":["Sighting DetailsMy neighbors, roommate, girlfriend, and friend (six total individuals) witnessed a large solid bright glowing orange orb in Marana. The orb was twice as large as a full moon. We were standing out in the street socializing when I noticed the orb rising. It appeared to be a few streets down and may have been on the ground at one point. It was not confirmed to have landed however because houses and trees obstructed the view at first. Originally we concluded that the orb was nothing more than a candle or light tied to a balloon. This was instantly rejected when the orb began maneuvering. The orb ascended, then descended, then ascended slowly again. The maneuvering seemed rather unstable at first, but the orb finally ascended much farther into the sky and all six of us were able to observe the orb move from our neighborhood south towards the city of Tucson at a speed of probably 90-100 mph in a very linear path. We all watched the orb until it was about the size of a small star and eventually faded in the distance over the city of Tucson, about 10 miles away. The even lasted about five minutes. About 30 minutes after the sighting, incredibly strange sounds projected from the Tortillita Preserve desert down the street. The sound was unlike anything we have ever heard, and we are outside every night when we smoke our cigarettes. The sound was similar to a dog, but mixed with a high pitched opera singer, and had a slight vibrational low frequency humming during the \"barking\". All six of us, from three different houses on the Acacia Blossom Pl., will confirm this sighting."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/38080.html.txt","/var/www/straped/mufon/org/38080.html"],"Object Flight Path":"Path with directional change","trends":[],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=34.054788,+-111.087521(38080)&iwloc=A&hl=en\"> mufon case (38080) map </A>"}