{"City":"Carmichael","map":"<A HREF = \"http://maps.google.com/maps?q=38.67503,+-121.325447(38094)&iwloc=A&hl=en\"> mufon case (38094) map </A>","Source":"MUFON","Summary":"HUGE solid round briliant bright light and two smaller same shape and color that circled the huge center one.","Case Number":"38094","Longitude":"-121.325447","Latitude":"38.67503","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-05122012-0009","Region":"California","Tags":"City","Object Features":"None","Viewing Distance":"Unknown","Disposition":"Unresolved","Date of the Event":"09/20/1969 08:25 UTC","files":["/var/www/straped/mufon/html2text/38094.html.txt","/var/www/straped/mufon/org/38094.html"],"Object Flight Path":"Stationary,Other","Object Shape":"Disc, Sphere","divs":["sighting detailsi was 14 at the time and my mom ran in the house very excited and said, \"come see the ufo!\" and she ran back out. about 8 neighbors and a few kids were across the street looking east into the sky. there was an enormous brilliant white\\yellow perfectly round light that hung stationary in the sky. it was significantly larger than the moon and more brilliant. there were two other smaller lights of the same brilliance and shape as the huge center one but the other two were moving in a slow circular pattern around the edge of the center one that never moved. the light was much brighter than the moon but did not hurt our eyes to look at it. the edges were very clearly defined and the light was not a reflection but emanated from the objects themselves. the neighbors had been looking at it for about half an hour before my mother was called on the phone to come and see. she then came to get my brother, sister and myself. everyone agreed it was either a ufo or a new technology from the local space aeronautics company where many of the neighbors worked. after about half an hour of watching i got bored and went home to watch tv. after about 20 minutes back in the house, i could hear everyone outside yell, \"oh!\", and \"ah!\" and then yell loudly, \"oh my god!\" my mom came inside not long after and said i should have stayed. she said they saw a plane fly near the objects and it suddenly got very bright...and that is all i can remember. my emotional memory tells me she described an event where the thing either blew up or became somehow larger or more brilliant or some other description that was unbelievable or spectacular, but i was too young and it was too long ago to remember all the details of what my mother described. there was no report in the news or the paper the next day or days after that. i would like to know what the others thought about the incident but lost track of all of them after we moved in december of that same year. my mother died and none of us every talked about the event after it happened. it just had no significance to our lives to ever talk about it. it was so completely unknown that it had no relevance after the event. but it does now, and i sure wish i could talk to anyone who might have also seen it, all the way to the end, which i sadly missed."],"trends":["There have been 4 other sightings in Carmichael","There were no other sightings in Carmichael on or around September 20th 1969"],"Date Submitted":"05/12/2012 06:54 UTC","Weather Factors":"Unknown"}