{"City":"West Valley City","Object Shape":"Triangle","Date Submitted":"05/12/2012 02:15 UTC","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.679991,+-111.967562(38092)&iwloc=A&hl=en\"> mufon case (38092) map </A>","Date of the Event":"08/11/1992 12:00 UTC","Region":"Utah","Case Number":"38092","trends":["There have been 12 other sightings in West Valley City","There were no other sightings in West Valley City on or around August 11th 1992"],"Latitude":"40.679991","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsIt was the night of the Perseid meteor shower. My teenage son and I sat on our patio watching the sky. We were surprised by what appeared to be a flock of glowing green lights that shot by us to the west in a south-north direction. I've seen a lot of meteors over the years, but this didn't look like anything I'd ever seen. My son turned and asked, \"What was that, Dad?\" I simply said, \"I don't know. Never seen anything like that.\" My son stood and went inside to get a drink of water. Our house was situated directly under the airport landing path, so a couple of large jets flew past on their approach to the runway. At that location, the airplanes were fairly large in the sky. Above them was a layer of puffy clouds that extended to where it touched the tops of the Wasatch Mountains. As I sat watching the sky above me, I noticed movement against the black sky. It was hard to distinguish at first, but as I focused on that part of the sky, I saw a huge black triangular object above the clouds that was moving steadily from north to south directly above the landing pattern. Compared to the jet airplanes, the object was massive. It had five chevron-shaped lights, which I imagined must be its engines. They glowed a soft reddish-orange color, and the glow pulsated slightly. There was one at the nose of the object and two more along each side. At the speed the object was moving, I thought there would be a tremendous roar associated with it, but it was completely silent. I watched it move south to where it banked and changed to an eastern course. It crossed the Wasatch Mountains at a place near Mount Olympus, and it was still huge in comparison to everything around. Judging against the mountain tops, I estimate that it was about a mile long. As the object moved to the south, I could see that it had thickness, but not much. During the time that I watched it, I was so dumbstruck that I couldn't call for anyone to come and look. It was gone in only a few seconds. I knew that it was bigger than any earthly aircraft, and I've seen the biggest on earth. My first thoughts were, \"I've just seen something from outside our world.\" I've pondered the sight over and over again for many years. It has changed my view of life. I still hold my religious views, because in my beliefs, we are not alone in the vast universe, but I feel like we're being visited from somewhere else now. I'd desperately like to know if anyone else had the same experience that night. I've told a few people, but they act like I'm nuts when I talk about it."],"files":["/var/www/straped/mufon/html2text/38092.html.txt","/var/www/straped/mufon/org/38092.html"],"Object Features":"Other","Longitude":"-111.967562","Summary":"Huge black triangle with five chevron-shaped lights passed overhead then turned east and disappeared over mountains.","Log Number":"US-05122012-0007","Country":"United States","Source":"MUFON","Disposition":"Unresolved"}