{"Sighting Duration":"Undisclosed","Latitude":"41.819562","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.819562,+-71.368344(38095)&iwloc=A&hl=en\"> mufon case (38095) map </A>","Date of the Event":"05/12/2012 04:00 UTC","Source":"MUFON","Object Shape":"Sphere","Date Submitted":"05/12/2012 07:42 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/38095.html.txt","/var/www/straped/mufon/org/38095.html"],"City":"East Providence","Object Features":"None","trends":["There have been 11 other sightings in East Providence","There were no other sightings in East Providence on or around May 12th 2012"],"Disposition":"Unresolved","divs":["Sighting DetailsI was in a public parking lot in East Providence, RI, preparing to enter pharmacy. I glanced toward the northeastern sky and noticed what seemed to be a star at first. It was four o'clock in the afternoon with a cloudless, sunny sky. I thought it was strange to see a star in these conditions. As I continued to look at it, I realized that it was getting larger and descending. The whole time, it was flashing very intensely. It came as close to what appeared to be less than a mile away, at an elevation of approximately 500 meters. These are estimates because it was difficult to find adequate references. However, there was a jet plane in the northern sky at the same time, and it was obviously at a much higher altitude. This object then followed a path in a south eastern direction, pausing at times and making course corrections that seemed deliberate. After five minutes, it ascended at what seemed to be a 45 degree angle, at a relatively fast pace and in a direct line due east. I did have a camera phone with me at the time, but did not capture any images. I believe they wouldn't have come out properly and did not want to lose track of it."],"Log Number":"US-05122012-0010","Tags":"City","Region":"Rhode Island","Weather Factors":"Unknown","Summary":"Metallic spherical object pulsates with light, descends, hovers, then ascends after a five minute long path","Longitude":"-71.368344","Case Number":"38095"}