{"Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsAbout 8:15 pm, my wife and I were approaching our house from our back alley. Since I've seen UFO's all of my life, I'm prone to checking the sky. I noticed toward the south three unblinking red lights, bigger than stars without a doubt. They were flying in a northerly direction. I pointed them out to my wife who also saw them. Since we heard someone shooting off fireworks a few blocks to the southwest of us, she figured it was due to that, but then changed as we stood under the stars and watched these lights. There was a few clouds in the sky. As they almost got over our house, they seemed to vanish or 'blink out'. My wife again thought that they were embers from the fireworks, but I told her embers burn out fairly quickly and move with the wind. These did not and I perceived that they went behind the clouds. The whole incident lasted about four to five minutes. These was not the first red light I've seen over our house. Last July 4th, an unblinking red light flew in a south to north direction over our house and was seen by one of the neighbor pre-teen kids. But that's another story. Thank you."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.093627,+-94.504701(38093)&iwloc=A&hl=en\"> mufon case (38093) map </A>","Object Flight Path":"Straight-line path","Date Submitted":"05/12/2012 04:38 UTC","Sighting Duration":"Undisclosed","Longitude":"-94.504701","Region":"Missouri","trends":["There have been 11 other sightings in Joplin","There were no other sightings in Joplin on or around March 15th 2012"],"Summary":"Three reddish lights unblinking flying over house.","Date of the Event":"03/15/2012 08:15 UTC","files":["/var/www/straped/mufon/html2text/38093.html.txt","/var/www/straped/mufon/org/38093.html"],"Case Number":"38093","Disposition":"Unresolved","Object Features":"Undisclosed","Country":"United States","Log Number":"US-05122012-0008","City":"Joplin","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Star-like","Latitude":"37.093627"}