{"Country":"Australia","divs":["Sighting DetailsI was in my back yard burning off garden material and sat back to enjoy the warmth and looked up to notice a bird flying over (east direction) head and as i looked at it I noticed much higher up 1 x silver star like object that was stationary. I thought it was odd that a star would be visible in day light so continued to observe it and to my surprise it started to move rapidly toward the south west. I continued to watch it not understanding what it was. An Airliner Jet flew over from the south east corner into a north west direction toward the airport. This thing was many times higher than the jet. After it traveled a little I noticed a second orb appear out of no where - again heading in a similar direction. The 1st orb was still visible when at 30 degree angle from me (rather then directly overhead being 90 degrees). It had to have been huge given the altitude. The 1st object traveled much faster then the 2nd but they both disappeared out of sight in the south west direction at an angle of about 20 degrees. I have no idea what they were. My logical mind rules out stars because they don't move, and satellites because they don't hover. I can rule out a bird because it was a light much like a star but just before 4pm in the afternoon. I am stumped and will keep my eyes open to try take photo next time!"],"Object Shape":"Sphere","Longitude":"144.963056","City":"Melbourne","Disposition":"Unresolved","Region":"Victoria","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around May 10th 2012"],"files":["/var/www/straped/mufon/html2text/38109.html.txt","/var/www/straped/mufon/org/38109.html"],"Viewing Distance":"Unknown","Summary":"2 Silver Orbs Fly Over Eastern Suburbs of Melbourne","Date Submitted":"05/13/2012 10:06 UTC","Log Number":"AU-05132012-0006","Object Features":"None","Sighting Duration":"Undisclosed","Date of the Event":"05/10/2012 04:00 UTC","Weather Factors":"Unknown","Case Number":"38109","Tags":"City","Object Flight Path":"Hovering then path","Latitude":"-37.813611","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-37.813611,+144.963056(38109)&iwloc=A&hl=en\"> mufon case (38109) map </A>"}