{"Object Features":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"38103","Summary":"Saw about 3 red orange lights flying in formation, stopped to look, they flew right over head followed by 5 more,","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Egg","Source":"MUFON","divs":["Sighting DetailsDriving east on los indios on the way home from wallgreens at 183 & McNiel and saw 3 bright red orange lights flying in formation out of the north heading south south east. Immediatley felt they looked out of place & unusually bright, simmilar to mercury vapor street lamp color or looked like mars when its really close. I pulled the car over and got out to watch and one of the objects flew straight overhead. There was some low cloud cover tonight so i only got to see through breaks in the clouds as the objects were just above the cloud layer. It made almost no noise until it was right over me and i heard a faint whooshing noise as if wind rushing over the object. It appeared to be almost circular but with a slight egg shape with the narrow end towards the front. When i was watching the one go overhead i could see there were 5 lights to the northn on the horizon where there were only three before. As they got close to being overhead the orange light seemed to go away and you could only see it when it was right above you, only a slight blue green, very faint glowing of the object was visible, enough to make out the outline. I only managed to see two of the objects go directly over me. While i was focusing on the second one that flew directly above me it semmed that the others disappeared. I have to believe in a city the size of austin on a saturday night i cant be the only one who saw this! I was in the middle of a crowded suburban neighborhood. I have seen \"stars\" that appear to move in the past on a couple of occasions but this one takes the cake, never before have i seen the actual outline of a craft like these. Im a bit shook i must admit."],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/38103.html.txt","/var/www/straped/mufon/org/38103.html"],"Date Submitted":"05/13/2012 12:08 UTC","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around May 12th 2012"],"Log Number":"US-05132012-0001","Longitude":"-97.76476","Disposition":"Unresolved","Region":"Texas","Date of the Event":"05/12/2012 07:12 UTC","Latitude":"30.439279","City":"Austin","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.439279,+-97.76476(38103)&iwloc=A&hl=en\"> mufon case (38103) map </A>","Country":"United States"}