{"Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/38107.html.txt","/var/www/straped/mufon/org/38107.html"],"Longitude":"-77.12384","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.071281,+-77.12384(38107)&iwloc=A&hl=en\"> mufon case (38107) map </A>","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Features":"Unknown","Country":"United States","Latitude":"35.071281","Tags":"City","trends":["There have been 2 other sightings in New Bern","There was one other sighting in New Bern on or around May 12th 2012"],"Summary":"2 orange lights that brightened and dimmed in sequence, going from very small to very large and back again. Then disappear. Then one came back.","Disposition":"Unresolved","Date Submitted":"05/13/2012 12:58 UTC","divs":["Sighting DetailsAt around 2:30am I went outside for a cigarette, walked down to the end of my walkway and i turned around. When I did there they were,two very bright orange lights hovering in the distance as I looked out over my house. They started to brighten even more and I thought they were coming closer but then dimmed and brighten again in sequence. They did this several times and then faded after about 7_10 minutes and we're gone. I kept looking when I saw one light back up and continued to do the same as before brightening and dimming. And then vanished again not to return. At first I started to become very nervous, as I thought they were getting closer but then I calmed down and was just in total awe as I noticed they were strobing irregularly in sequence with each other. I noticed that the object to the left was drifting closer to the other, I was hoping for a merger, this dint happen. They would brighten to the size of a baseball and then shrink to a size of a small star. I so wanted to get my camera but was afraid that I would miss them. After they disappear I went inside and told my wife what had happened and we both went outside this time I carried my camera but they did not return. My wife noticed that the birds in the area were very active for this time in the morning. A police. Officer was passing game by and stopped, I told her I saw two lights in the sky, she thought I was drinking and drove off. I did have a wine cooler around 1:45am but that was it. I have seen a few very strange. Objects in the sky my whole life but this was the first time that I was totally freaked out about it. I don't think I will ever go outside with out a camera of some type again."],"Log Number":"US-05132012-0003","City":"New Bern","Date of the Event":"05/12/2012 02:30 UTC","Case Number":"38107","Region":"North Carolina","Object Shape":"Oval, Sphere"}