{"Log Number":"US-09052005-0004","City":"Greensboro","Source":"MUFON","Object Shape":"Sphere","Case Number":"3811","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/3811.html.txt","/var/www/straped/mufon/org/3811.html"],"Sighting Duration":"Undisclosed","Weather Factors":"None","Object Flight Path":"Stationary,Path with directional change","trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around September 5th 2005"],"Tags":"City","Region":"North Carolina","Latitude":"36.076205","Date of the Event":"09/05/2005 07:30 UTC","Longitude":"-79.790855","Summary":"Low flying orb","divs":["sighting detailsmy wife & i were playing with the kids outside when my wife and youngest son called my attention to the object. my wife asked me what it was. my first impression was a hot air balloon because of the shape, but it was brightly reflecting the sunlight (sun had just set)and there was no apparant color other than metallic\\silver. i can only guess at it's altitude of about 10,000 feet. i told my wife to keep an eye on it, and grabbed my binoculars and video camera. had no problem finding it in the binoculars, but had an extremly difficult time locating it with the camera. finally got it, and kept it for maybe 45 seconds, but lost it due to altitude. in the beginning, it seemed stationary, then as air traffic picked up (could have been due to the airport being so close by, but traffic seemed unusually high) but as traffic increased, it slowly began moving southwest while gaining altitude. after about 10 minutes, it began moving northeast while still gaining altitude. the entire time, it moved very slowly. we watched until it was out of sight due to the altitude of the object. i will try and add picture or video later, as i just came in about 10 minutes ago."],"Object Features":"Unknown","Date Submitted":"09/05/2005 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.076205,+-79.790855(3811)&iwloc=A&hl=en\"> mufon case (3811) map </A>"}