{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/38118.html.txt","/var/www/straped/mufon/org/38118.html"],"Disposition":"Unresolved","Source":"MUFON","Date Submitted":"05/13/2012 02:31 UTC","Summary":"2 circular fireballs moving together, not descending.","Weather Factors":"Unknown","Region":"Texas","Latitude":"33.074833","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Highland Village","There was one other sighting in Highland Village on or around May 12th 2012"],"Tags":"City","divs":["sighting detailsi went outside to my backyard to throw away trash. i looked up and saw what i believed to be an airplane, as we live about 15 miles from the dallas\\ft. worth airport. i then saw the 2nd light traveling close behind. the objects were too close together in proximity to be airplanes, as i have observed many airplanes at this elevation (during busy times, we can see aiplanes approaching dfw every 2 or so minutes). the objects were moving south very quickly, and were much larger than airplane lights. the lights were also flickering as if on fire. after about a minute or so, they began to turn to the west.they disappeared behind the tree line of my backyard trees. airplanes in this flight path that go over us always proceed due south. i ran inside to get my husband, but when i returned, they were gone. i thought they could have been meteors, but they were not descending at all. i don't know what i saw, but they were not airplanes, as i see them on a regular basis. there was also an airplane taking off to the north at the same time that i saw these lights."],"Object Shape":"Circle, Fireball","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-97.059074","City":"Highland Village","map":"<A HREF = \"http://maps.google.com/maps?q=33.074833,+-97.059074(38118)&iwloc=A&hl=en\"> mufon case (38118) map </A>","Log Number":"US-05132012-0014","Date of the Event":"05/12/2012 09:30 UTC","Case Number":"38118"}