{"Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Oval","Latitude":"36.783091","Sighting Duration":"00:00:10","divs":["Sighting DetailsI was standing outside a bicycle shop waiting for my bicycle to be tuned up. I like to look up into the sky from time to time, hoping to capture anything unusual with my digital camera. It was a very hot day (90'F), cloudless, blue sky. About 3-4pm, I looked up, immediately I saw an oval shape object flew across the sky from south to north with very high speed. The object was really bright, not sure it was glowing or it was the reflection from the sun light. I was skeptical about it, so I told my husband to look up and he saw it too, but he never believe in UFO, so he told me that's a bird. There were sea gulls flying above too, but the oval object definitely higher than those sea gulls. I have good vision, not wearing glasses. The object was in chrome color, it was very bright, but I couldn't tell it was glowing or it's just the reflection from the sun light. The object was in very high altitude and the speed 2-3 times faster than a commercial plane. No sound. My feeling at that time, it looked like a satellite orbiting the earth in terms of the high speed and moving in straight line, except I'm not sure there's a satellite orbiting the earth in such low altitude that can be seen in daytime and in oval shape."],"Tags":"City","Object Features":"Undisclosed","Longitude":"-119.415572","Region":"California","Source":"MUFON","Case Number":"38113","map":"<A HREF = \"http://maps.google.com/maps?q=36.783091,+-119.415572(38113)&iwloc=A&hl=en\"> mufon case (38113) map </A>","Date of the Event":"05/12/2012 04:01 UTC","files":["/var/www/straped/mufon/html2text/38113.html.txt","/var/www/straped/mufon/org/38113.html"],"Summary":"Oval shape object flew over","trends":[],"Object Flight Path":"Undisclosed","Date Submitted":"05/13/2012 12:41 UTC","Viewing Distance":"Unknown","City":"Undisclosed","Country":"United States","Log Number":"US-05132012-0010"}