{"trends":["There have been 5 other sightings in Inver Grove Heights","There were no other sightings in Inver Grove Heights on or around May 12th 2012","This sighting has never been favorited.",""],"Latitude":"44.853956","Source":"MUFON","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=44.853956,+-93.055057(38116)&iwloc=A&hl=en\"> mufon case (38116) map </A>","City":"Inver Grove Heights","Date of the Event":"05/12/2012 10:00 UTC","Tags":"City","Date Submitted":"05/13/2012 01:55 UTC","Country":"United States","Viewing Distance":"Unknown","Object Features":"None","Disposition":"Unresolved","Summary":"7 red lights coming up from horizon, hovering, then moving east, then fading away","Case Number":"38116","Region":"Minnesota","Sighting Duration":"Undisclosed","Longitude":"-93.055057","divs":["sighting detailsa coworker and i were driving south down hwy 65 in blaine. when we got to the on-ramp to main st\\ county 14, we were at the light at the top of the bridge facing southeast. i was in the passenger seat. to my right in the southwest sky i then saw at approximately 10:01 pm, 4 red lights fly up from the horizon, then 3 more a second later following behind. it was brighter than anything else on that side of the horizon. they came up in a scattered sort of line, like a massive roman candle but a little quicker in pace of appearance. they moved slightly east and formed a pattern. one went higher up in the sky, a set of three formed a near equilateral triangle to the bottom right of the first, and the last set of three formed a very wide obtuse scalene triangle to the immediate right of the first triangle. they were as bright as jupiter was during its peak this year, glowing red with just a little bit of yellow around them, but they were a significantly larger source than jupiter. they were a solid source of light, and they were moving visibly east and began to cross hwy 65. i watched them disappear behind the buildings as we turned and traveled north (my driver needed to get home), but when i got home a minute later i ran inside to get my boyfriend. i was very excited because it sounded a little similar to something somebody i know had seen once before a long time ago. when we went back outside all 7 were dimly visible from my parking lot due south and much smaller- the light source size was a third and they were just pricks of light, no longer glowing. to be seen from here they must have traveled over at least 1000 feet east and crossed over hwy 65 in approximately 3 minutes. the wide obtuse triangle vanished very quickly as soon as we got outside, as if it just blinked out. the high light and the equilateral triangle began to fade very rapidly and were gone in about a minute, almost as if they were traveling directly away from us. then i became suddenly frightened and went back inside. surface wind speeds in blaine this evening at 10 pm were calm to 4\\mph w. wind speeds in blaine at 3000 ft were n nw 8\\mph (national weather service)"],"Weather Factors":"Unknown","Log Number":"US-05132012-0012","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/38116.html.txt","/var/www/straped/mufon/more/38116_submitter_file1__mapofsighting.jpg","/var/www/straped/mufon/more/38116_submitter_file2__DiagramofFormation.JPG","/var/www/straped/mufon/org/38116.html"]}