{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/38114.html.txt","/var/www/straped/mufon/org/38114.html"],"Tags":"City","Sighting Duration":"00:15:00","trends":["There have been 41 other sightings in Spokane","There was one other sighting in Spokane on or around May 12th 2012"],"divs":["Sighting Detailsmy boyfriend woke me up and said come outside now theres ufos in the sky hurry. i woke up thinking he was crazy but i would look to please him and not make him feel stupid he was scared. i went outside ..we live in a busy neightborhood in a simi big city. i looked south and didnt see anything. i started to go inside he said stop look look there they are. i went back to the end of our yard into the street.and up from the horizon came 6-7 red 'fire balls\" i started yelling oh my god oh my god..what is it..i thought we were under attack maybe missles..then i thought space was exploading sending astroids or fire balls towards us..they were moving slowly like dripping upward..but had no tail..they moved slowly but withing 60 seconds as they went up toward the middle of the sky they disinigrated..i was so scared and still am. i called my family and woke them up and told them to look south outside.i was crying . then we saw 2 small airplanes or jets flying across where they were..then we saw a bright green one through the trees..it never acended."],"Longitude":"-117.386788","Date of the Event":"05/12/2012 10:15 UTC","Object Shape":"Circle, Star-like","Latitude":"47.677126","City":"Spokane","Region":"Washington","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.677126,+-117.386788(38114)&iwloc=A&hl=en\"> mufon case (38114) map </A>","Summary":"10-12 red cirlce \"fire balls\" coming up from the horizon..disinicrated as they went up","Log Number":"US-05132012-0010","Country":"United States","Date Submitted":"05/13/2012 01:34 UTC","Viewing Distance":"Over One Mile","Case Number":"38114","Object Flight Path":"Other","Disposition":"Unresolved"}