{"Disposition":"Unresolved","divs":["Sighting DetailsWas sitting out on the front porch with some friends. I was facing east, the others were facing west towards the house. I saw a large blue flash in the sky that lasted about 1 second. I told my friends about it, it was a large flash that sustained about 1 second. I commented it looked like a blue explosion. Similar to something you see from a nuclear event. Then about 2 minutes later I saw the glowing orbs, three of them shining brightly in the sky with a red-orange color. They seemed to be traveling in my direct and appeared in the sky for about 3 minutes. We all walked out on the lawn to try to determine what it was. The light spacing looked very consistent if there would have been four lights together, with the third light away from me not lit up. The continued to travel towards us and then the furtesh light faded away and the the middle light faded and then the closest light faded away. We all discussed what we had seen and agreed it was something we could not explain. The lights looked like they were at least five mils away but were very bright and clearly stood out in the night sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.731566,+-96.446799(38120)&iwloc=A&hl=en\"> mufon case (38120) map </A>","Date Submitted":"05/13/2012 03:39 UTC","City":"Forney","Tags":"City","Source":"MUFON","Date of the Event":"05/12/2012 10:45 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Object Features":"None","files":["/var/www/straped/mufon/html2text/38120.html.txt","/var/www/straped/mufon/org/38120.html"],"Longitude":"-96.446799","Object Shape":"Circle, Fireball","Country":"United States","Latitude":"32.731566","Region":"Texas","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Forney","There were no other sightings in Forney on or around May 12th 2012"],"Object Flight Path":"Straight-line path","Summary":"Saw large blue pulse and then one minute later saw 3 brightly glowing orbs","Case Number":"38120","Log Number":"US-05132012-0016"}