{"files":["/var/www/straped/mufon/html2text/38123.html.txt","/var/www/straped/mufon/org/38123.html"],"Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"101-500 Feet","Latitude":"41.057554","Log Number":"US-05132012-0018","trends":["There have been 2 other sightings in Berwick","There were no other sightings in Berwick on or around May 4th 2012"],"divs":["Sighting DetailsI had gone out back of my work place at around 9ish for a quick smoke break. My place of work is on the banks of the Sussquehanna River in Berwick pa. I noticed what looked like a helicopter search light coming down the river about 40 feet obove the water and about 100 yards from where I was. I noticed the light was bright- almost blue and hurt your eyes to look at it. As it got closer I thought they were looking for a boat or something thats when I noticed that it was silent - not a sound. It shot past dollar tree and kept going down river illuminating everything. Right before a bridge it rose up and stayed in a crease of the mountain ( these are large mtns by the way) and shot right up and over the mountain staying the same distance from the ground - this was fast and made no sounds at all. When it went over the mountain I noticed a few cars stopped on the bridge and they stayed for a while...I can tell you that this couldn't have been a helicopter because it stayed just below the tree line and it covered about 3 miles in less that 30 seconds and made no noise..that was the spookiest part for me. was the dead silence as this light came down the river and over the mountains.."],"Object Shape":"Star-like","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=41.057554,+-76.258335(38123)&iwloc=A&hl=en\"> mufon case (38123) map </A>","Object Features":"None","Disposition":"Unresolved","Date of the Event":"05/04/2012 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"05/13/2012 08:58 UTC","Longitude":"-76.258335","City":"Berwick","Summary":"lighted orb flew atop river then over mtn.","Case Number":"38123","Country":"United States"}