{"Longitude":"-77.185585","City":"blomsburgh","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was walking the family dog behind my house which has an amazing veiw of the sussquehanna river valley. I noticed my dog starting to bark and pull at his lead, then up over the river I saw a huge blue light that was flying along the river and then followed the terrain up towards my house. The light never..not once came above the tree tops...and was moving fast. It seemed to come with in a hundred feet of my house, it stopped and hovered behind the trees with no noise. Then I noitced something in the tree lines moving towards the light, then as the light streaked through thte trees out of sight I got a mental picture...words almost..I saw a qick flash of our solar system with the word Uranus...ringing in my ears...for days all I could think about was Uranus, I did research, I googled Uranus, I wikied Uranus and I thought of nothing but Uranus..I actually felt like that movie with Richard Dryfuss where he obsesses about Devil's peak...except I was going crazy over Uranus...the feeling of Uranus have since subsided...and I feel normal except for a ramdom thought here or there about Uranus...My wife actually was concerned with my facination about Uranus...I had thoughts and actually wished to see Uranus..I was totally..uneqivacally ..obsessed with Uranus."],"Log Number":"US-05132012-0024","trends":["There have been no other sightings in blomsburgh","This sighting has never been favorited."],"Country":"United States","Object Shape":"Star-like","Date Submitted":"05/13/2012 11:38 UTC","Case Number":"38129","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Region":"Pennsylvania","Source":"MUFON","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/38129.html.txt","/var/www/straped/mufon/org/38129.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.206752,+-77.185585(38129)&iwloc=A&hl=en\"> mufon case (38129) map </A>","Summary":"lights came over mountain near house...I saw things in the tree line - mental communications?","Latitude":"41.206752","Date of the Event":"05/04/2012 09:15 UTC","Disposition":"Unresolved","Object Features":"None"}