{"Log Number":"US-05132012-0023","Tags":"City","divs":["Sighting DetailsWell my family (younger brother, younger sister, and mother) were all driving 35 South heading back from the forum, when my younger brother pointed out a strange object; it was a silver elongated aircraft, bullet-like in its shape, and it was pretty high up in the sky, about 900ft up, traveling very fast in the Southwest direction. The time was approximately 8:10 PM when this was pointed out. About a minute later it suddenly shifted, and instead of the silver bullet shape it had previously, it shifted to an orb-like shape and was reflecting an unnatural red-orange glow, not bright enough to be a star, but it was metallic looking and certainly reflected more light than the average helicopter. We followed it down to O'Connor Rd, and stopped briefly at a motel to better observe it from our car, but then the orb suddenly became plural as another one appeared seemingly out of thin air. It changed direction soon after that and we followed it to a Valero on O'Connor Rd and we stepped out of the vehicle to follow it more, and it was about this time (about 8:19) that there was not one, but three orbs all reflecting the same orange-red glow, and all looked to be approximately the same size, and it changed direction once more before all three orbs suddenly changed back to the original silver color and then vanished. And right after it vanished, a plane zoomed into our line of sight."],"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/38128.html.txt","/var/www/straped/mufon/org/38128.html"],"trends":["There has been one other sighting in Selma","There were no other sightings in Selma on or around May 13th 2012"],"Date Submitted":"05/13/2012 11:35 UTC","Object Shape":"Bullet, Missile","Region":"Texas","Latitude":"29.571526","Summary":"It was moving extremely fast, like the velocity earth's rotation. Then it changed direction, 2 more appeared, then they all disappeared.","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"05/13/2012 08:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.571526,+-98.326819(38128)&iwloc=A&hl=en\"> mufon case (38128) map </A>","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-98.326819","City":"Selma","Case Number":"38128"}