{"Date of the Event":"05/12/2012 11:00 UTC","City":"Anaheim","divs":["sighting detailson 5\\12\\12 i was driving e\\bound on the 91 freeway near lakeview saw to my left over anahiem hills 3 shimmering objects holding a triangle pattern. i pulled onto the soft shoulder with a bout 5 other cars got out and watched as the craft(s) moved north directly overhead. the first craft was a triangle with an orange ball in the center, the second one appeared as a cigar shape with lines on the bottom...the 3rd seemed to tumble as it moved all three at times gave off the appearance of mercury. one at times appeared gelatinous and would give off, not a reflection but an illumination as to be partially made from mercury, like the reflective silver material used by nasa...how ever that illumination did appear to change shape all three of these at times appeared to tumble. the two that flew directly over head were definitely aircraft of some kind...i assume the third also was. i saw these with others as there was a lot of traffic on the freeway...we have alot of air traffic out of john wayne airport so its not remarkable to see planes holding patterns...but these moved unlike any craft i have ever seen..they also did not dissapear..but continued n\\e over yorba linda at now an extremely high altitude holding the same form. i do not believe in life on other planets and am a skeptic of all things mysterious...but feel fortunate to have seen these things"],"Object Shape":"Triangle","Weather Factors":"Unknown","Latitude":"33.855392","Summary":"3 shimmering triangle craft moving slowly East then North for a bout 10 min","map":"<A HREF = \"http://maps.google.com/maps?q=33.855392,+-117.747676(38139)&iwloc=A&hl=en\"> mufon case (38139) map </A>","Date Submitted":"05/14/2012 03:28 UTC","Tags":"City","Object Features":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-117.747676","files":["/var/www/straped/mufon/html2text/38139.html.txt","/var/www/straped/mufon/org/38139.html"],"Sighting Duration":"Undisclosed","Case Number":"38139","Object Flight Path":"Hovering then path","Region":"California","Source":"MUFON","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around May 12th 2012"],"Disposition":"Unresolved","Log Number":"US-05142012-0010","Country":"United States"}