{"Country":"United States","Latitude":"40.589246","Date of the Event":"05/14/2012 02:20 UTC","Object Flight Path":"Straight-line path","Region":"Pennsylvania","Source":"MUFON","Weather Factors":"Unknown","divs":["sighting detailstonight at 5\\14\\2012 at 2am est me and my fiancee took our dogs out side to use the bathroom in our back yard. we went outside to feel the cool air for a bit and when my husband looked up in to the sky he noticed some bright orange fieball looking circles flying from south to north up into the atmoshere. he told me and i looked up and saw that there were 2. 1 was directly behind the other flying in coorindation. he was thinking they were moving farley fast and very high in the sky. a few mins later we wnt back out to get the dogs and their was another one east of the 1st 2 we seen moving upwards twords the sky the same way. we waitied and watched some more and finally saw 1 last on in the same location as the 1st 2 but it was moving east to west and alil north but kinda doing a swiggly back and forth. they all only lasted for a few mins until they disapered into the atmosphere. i am not big on alien life comming to visit us but i have never seen anything like this before. i am hoping to gather some answers posting on here and i niotced some other people have made comments about the same thing but different dates. times and locations."],"Object Shape":"Circle, Fireball","City":"New Kensington","Tags":"City","Log Number":"US-05142012-0004","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/38133.html.txt","/var/www/straped/mufon/org/38133.html"],"Disposition":"Unresolved","trends":["There have been 6 other sightings in New Kensington","There were no other sightings in New Kensington on or around May 14th 2012"],"Summary":"Saw 4 fireballs ascend into the sky","Longitude":"-79.739743","Case Number":"38133","Date Submitted":"05/14/2012 03:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.589246,+-79.739743(38133)&iwloc=A&hl=en\"> mufon case (38133) map </A>","Object Features":"Unknown"}