{"Log Number":"US-05142012-0007","Country":"United States","Object Flight Path":"Stationary,Straight-line path,Path then hovering,Other","Date of the Event":"05/13/2012 09:20 UTC","trends":["There have been 3 other sightings in Freeport","There were no other sightings in Freeport on or around May 13th 2012"],"Latitude":"30.478158","divs":["Sighting DetailsI was in my neighbors back yard. Walking towards my house, I am always star gazing, I noticed movement out of the corner of my eye. I stopped and observed the object make small circles. Then it moved west, stopped, moved north all in straight lines. I phoned my neighbor and told him to come outside to look. He brought out a powerful flashlight. I told him which light it was that was making moves. He shined the light on the object and asked if that was the one I was reffering to. I said yes, to which the object dimmed out and appeared in another area of the sky. He spotted it this time approxamately 3-5 inches from where it \"dimmed\" out. It moved west in a straight line then dimmed out again. We watched for a couple of more minutes but the object did not re-appear. Clouds were moving into the area, so he went inside. I kept waiting for the sky to re-open but it was too far and few between openings. I've been waiting for a long time to see a UFO, it was AWESOME!"],"Region":"Florida","Case Number":"38136","Viewing Distance":"Unknown","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/38136.html.txt","/var/www/straped/mufon/org/38136.html"],"Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"05/14/2012 08:09 UTC","City":"Freeport","Longitude":"-86.336217","Source":"MUFON","Sighting Duration":"00:10:00","Summary":"Observed a light in the night sky, no twinkling, no lights flashing, no noise, no satellight!","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.478158,+-86.336217(38136)&iwloc=A&hl=en\"> mufon case (38136) map </A>","Tags":"City"}