{"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.951918,+-87.749577(38140)&iwloc=A&hl=en\"> mufon case (38140) map </A>","Tags":"City","Case Number":"38140","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"05/14/2012 04:33 UTC","Latitude":"41.951918","Log Number":"US-05142012-0011","Country":"United States","Longitude":"-87.749577","Disposition":"Unresolved","Date of the Event":"05/13/2012 08:50 UTC","files":["/var/www/straped/mufon/html2text/38140.html.txt","/var/www/straped/mufon/org/38140.html"],"Object Flight Path":"Stationary,Straight-line path,Other","divs":["Sighting DetailsI was home watching t.v. when my wife came home from washing clothes with our kids. The kids came in the house and shortly after my wife began screaming for my oldest daughter who is 8, then she came running up the stairs, into the house and told me to hurry up and come outside. I thought there was a car accident outside from the way she was acting. When I came out she was standing in front of our front door pointing to the North in the sky. She asked me what it was. I seen probably about 6 bright red lights which seemed to be floating stationary. They were blinking, and formed a diagonal line with the highest one being Northwest, and the lowest one being Southeast in the sky. I was startled at first because I there were so many and never seen anything like it. They started slowly moving away from each other. The gap between them became greater and greater as the diagonal line became longer and longer. The lights at first were big and bright but they bacame small and dull which made me believe they were moving away from us (They were definitely moving up). As we watched, she told me when she first noticed them they were all clumped together, and she thought it was very odd looking. Thats when she ran in the house to get someone else to see them. Towards the end of the sighting I could only see the two lowest lights, the others had disappeared behind foliage from a tree that sits in our front yard and the next door apartment building which is North from us. That is when a white light came straight across the horizon (very fast compared to the movement of the red lights) from the direct of O'hare Airport which we believe was a plane. It was headed right for the two red lights, one was above and the other below. Before it reached the closest red light they both disappeared and the airplane continued on its path. We stood there for a second while she asked what it was, I told her the only thing it might have been is flares but they were in an almost perfect diagonal line and they blinked on and off, and they did'nt fall down, they moved up. We have lived here all our lives near O'hare Airport and see planes flying in and out everyday, all day, but never seen anything like this. Maybe they could have been helicopters with red lights but I've never seen helicopters fly a formation like this. Who ever was responsible was intelligent. Every year in Chicago there's an air and water show where palnes and boats perform, and entertain. This reminded me of that. I know other people had to have seen it also. Who ever was responsible was putting on a show for people to see, they were saying look at this. They wanted to bee seen. I don't think they were balloons. I told her to get out her digital camera but she said she had too much saved on it and couldn't take any videos or pictures. I couldn't stop thinking about it for the rest of the night. Afterwards I thought about the timing of this. The Nato Summit is happening here in Chicago this week. I have a feeling this has something to do with it."],"Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"Illinois","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around May 13th 2012"],"Summary":"Red lights flashing floated up and away forming a diganol line after being clumped together.","City":"Chicago"}