{"files":["/var/www/straped/mufon/html2text/38144.html.txt","/var/www/straped/mufon/org/38144.html"],"Log Number":"US-05142012-0015","Summary":"Followed by bright white round light that stayed exactly above and off to the driver's side of my car.","Latitude":"37.083242","map":"<A HREF = \"http://maps.google.com/maps?q=37.083242,+-119.478641(38144)&iwloc=A&hl=en\"> mufon case (38144) map </A>","Viewing Distance":"Unknown","Longitude":"-119.478641","Case Number":"38144","Date Submitted":"05/14/2012 06:45 UTC","Date of the Event":"07/15/1991 05:00 UTC","Region":"California","Object Shape":"Circle, Disc","trends":["There have been 2 other sightings in Auberry","There were no other sightings in Auberry on or around July 15th 1991"],"Object Features":"None","Source":"MUFON","Sighting Duration":"00:30:00","Country":"United States","Object Flight Path":"Stationary","City":"Auberry","Disposition":"Unresolved","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving home from Huntington Lake off highway 168 in California. It was about five am and I was headed home from a camping trip. I got to the saw mill in Auberry around 5:00 am and noticed all the lights. As I turned around the many bends in the road I continued to see a light that I thought was pretty bright to be coming from the saw mill, especially so since I'd passed the saw mill about a half an hour before I noticed this one light. I kept looking out my side window to see if it was still there and it was. This light stayed exactly where it was except I continued to see it for a good 20 minutes beyond where I could have seen any lights from the mill. Not long after I realized I was way too far past the mill for this thing to be one of the mills lights I realized it was a UFO. I started talking to it because I did not want to be abducted. I then started to yell inside my car, \"I know what you are! I know you want to kidnap me! If I feel any change in the air, or the car, or the wheels, I'll drive right off the cliff and kill myself!! Back off!\" And I started speeding up and driving recklessly to show them I meant business. After only about five minutes of doing that the light was suddenly gone. Just gone. I did not see it leave or flare out, it just vanished. I didn't have any missing time and no after effects except for being scared and grateful that they left. This was in July 1990. I was 35 years old, was not drunk and don't have any history of being abducted in that past. I have had one other sighting that was significant but no abductions. No one from my family has been abducted either. This sighting seemed to me to be a chance encounter."]}