{"Log Number":"CA-05142012-0019","files":["/var/www/straped/mufon/html2text/38148.html.txt","/var/www/straped/mufon/org/38148.html"],"Region":"Ontario","Object Shape":"Triangle","Source":"MUFON","Latitude":"45.466208","map":"<A HREF = \"http://maps.google.com/maps?q=45.466208,+-75.542493(38148)&iwloc=A&hl=en\"> mufon case (38148) map </A>","Disposition":"Unresolved","Summary":"Orange Light - Black Triangle Over Ottawa","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"38148","Longitude":"-75.542493","Country":"Canada","Sighting Duration":"00:02:00","divs":["Sighting DetailsDate and Time: Approx. 23:10, May 5th (night of super moon) Location: Ottawa, Ontario, Canada (suburb of Orleans) Witnesses: 3 saw orange ball of light in the Northeast, 2 saw the black triangle fly overhead - heading southwest. Departing friend's home, standing in his driveway looking up at the super moon directly in front of us. Moon was high, quite bright and appeared normal in size. Turning to our left, facing the northeast, we saw a bright orange light - it was hard to tell if it was stationary or not. I thought it was a satellite being illuminated by the sun below the horizon, but it was not moving fast enough. I then thought it could be a flare, again, it appeared rather stationary - and, no smoke trails or arc in the trajectory of the light. The light then blinked out. My friend suggested it was just a plane - but no plane I know has orange approach lights. As we continued to look in the direction of the object, we could make out something approaching. Even as the moon was bright, nothing was reflected off the surface of the object. As it flew over us, we could clearly see a large black triangle. It progressed southwest in total silence. There were absolutely no lights, no strobes, nothing. I want to say I recall some circles on the bottom side of the object, but my memory has faded. The size of the object was hard to determine. It appeared to be about an index finger, may a bit longer in length. Speed was about cruising speed of an airliner. Again hard to just size without judging altitude. I am guessing in the 1000ft to 3000ft range. A total guess as I don't have a frame of reference. Our assumption is that this was some sort of US spy plane, but nothing comes to mind. It certainly did not appear to be the supposed TR3B - with no lights on the bottom, but who knows. We thought the orange glow might have been the object re-entering the atmosphere, but, it would have had to slow down and decrease altitude dramatically in seconds if that were the case. Total mystery. Ideas or opinions welcome."],"Object Features":"Undisclosed","City":"Ottawa","Date Submitted":"05/14/2012 11:22 UTC","Date of the Event":"05/05/2012 11:10 UTC","Object Flight Path":"Straight-line path","trends":["There have been 55 other sightings in Ottawa","There was one other sighting in Ottawa on or around May 5th 2012"]}