{"Summary":"5 red-orange orbs flew nearby but made no sound.","Log Number":"US-05142012-0020","files":["/var/www/straped/mufon/html2text/38149.html.txt","/var/www/straped/mufon/org/38149.html"],"Disposition":"Unresolved","Longitude":"-92.462913","Source":"MUFON","Sighting Duration":"00:02:00","Region":"Arkansas","Object Features":"Unknown","Latitude":"35.082214","Object Shape":"Sphere","Date of the Event":"05/13/2012 09:13 UTC","trends":["There have been 12 other sightings in Conway","There were no other sightings in Conway on or around May 13th 2012"],"Object Flight Path":"Hovering then path,Straight-line path","City":"Conway","map":"<A HREF = \"http://maps.google.com/maps?q=35.082214,+-92.462913(38149)&iwloc=A&hl=en\"> mufon case (38149) map </A>","Country":"United States","Case Number":"38149","divs":["Sighting DetailsI was backing out of my drive onto a road that runs north-south through Conway, AR, and while looking to my right (south) to check for traffic I noticed a string of lights similar to how flares may appear, or aircraft in very close formation flight, but these were red lights, were bright, were constant, and were too large to be aircraft lights without their being heard. As I watched them the arc formation of lights began to shift closer to one another. There were 4 lights that moved close together forming a diamond momentarily (indicative of a helicopter or aircraft losing altitude rapidly in formation flight) and one additional light nearer (higher on the horizon). They changed their formation while moving north, toward me. At this point I was out of my car and walking toward the lights, south along the street. The way the lights changed formation they appeared to hover and move slowly as a helicopter might, but there were no white anti-collision lights. All of the lights were a bright red with a slight tinge of orange and after the movement of the lights occurred some began to grow dim. As I walked closer I expected they would soon pass directly overhead or nearby, but by the time I reached a tall group of pines that were obscuring my view all of the lights had vanished. I am a former Army helicopter pilot, Chief Warrant Officer (retired 2007), and what I saw does not make sense. Because of the size of the lights I should have been able to hear the aircraft, were they rotor or fixed wing, but I heard nothing. It was a cloudless night sky as many stars shone brightly surrounding the area where I viewed the lights. After walking back to my car I immediately looked at the clock and it showed 2118hrs. I estimated it took me about 5 minutes to walk to the spot where I realized the lights had vanished and return to my vehicle."],"Tags":"City","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Date Submitted":"05/14/2012 11:55 UTC"}