{"trends":["There have been 41 other sightings in Spokane","There was one other sighting in Spokane on or around May 12th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.66433,+-117.416497(38142)&iwloc=A&hl=en\"> mufon case (38142) map </A>","Summary":"Spokane Glowing Lights/Fireballs (?)","Country":"United States","Source":"MUFON","Longitude":"-117.416497","Disposition":"Unresolved","City":"Spokane","Tags":"City","Date Submitted":"05/14/2012 05:51 UTC","Viewing Distance":"Unknown","Object Features":"Unknown","Region":"Washington","Log Number":"US-05142012-0013","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/38142.html.txt","/var/www/straped/mufon/org/38142.html"],"Latitude":"47.66433","Date of the Event":"05/12/2012 11:10 UTC","Case Number":"38142","Object Flight Path":"Undisclosed","Object Shape":"Fireball, Square, Rectagular","Sighting Duration":"Undisclosed","divs":["Sighting Details On 12-May-2012 I arrived home around 11:00 pm (PST) when I happened to glance up, looking south from Nora Ave, and I noticed several groups of yellow-orange lights. I witnessed a group of 5 lights float up the ground in a single file fashion, floating upwards for approx 2-300 feet and then float off travelling up and southward. There are several groups of trees and buildings between myself and the objects' origin, so I was unable to determine the exact point of origin. I noticed that they didn't disintegrate, but simply floated up and away until they were just gone. That is, they floated off into the distance, both up and southward. They didn't appear to be under deliberate or intelligent control as many high profile ufos are reported but I certainly couldn't identify them. I thought perhaps balloons with some sort of incendiary properties (flares?), but I did see one simply stop and hover for a few minutes before floating up and away as the others. There were multiple groups of these objects and this happened over a 15-20 minute duration, maybe longer. I finally got bored and went inside. I must note that I attempted to video, but the street lights impeded my camera's picture and the objects in my video were not visible. I was disappointed that there was no mention of this in any of the news reports."]}