{"Object Shape":"Triangle, Unknown","files":["/var/www/straped/mufon/html2text/38153.html.txt","/var/www/straped/mufon/org/38153.html"],"Longitude":"-98.920789","Tags":"City","Sighting Duration":"00:12:00","divs":["sighting detailsmy daughter and i were outside sitting on the front porch steps, when we heard a strange rumble sound coming from the east. we both thought it was a low flying plane at first, then we were able to see two white\\blue light that seemed to pulse up and down. as it got closer we knew it was not a plane by the low rumbling sound it made, and the two lights in front were hanging down from it, almost as long as a telephone pole. we could not see any type of body for this craft. as it slowly passed over us, i flashed my flashlight at it three times. it then turned on a third light, gold in color, located behind and in the middle of the first two. it looked as though there could have been five feet or more between the lights. after that we stepped out into the street and started walking in the direction that it flew away in. it never really moved very fast it seemed to just glide away almost. as it drifted off into the distance, maybe ten miles ahead of us, it stopped blinking it's lights, and just went out of sight. we were not frightened by it, more amazed than anything, and thought it was cool that it seemed to respond to my flashlight by turning it's third light on."],"Source":"MUFON","trends":["There have been 2 other sightings in Electra","There were no other sightings in Electra on or around May 15th 2012"],"Weather Factors":"Unknown","Latitude":"34.025621","Summary":"Flew above our heads and responded to a flashlight by turning on third gold light","Date Submitted":"05/15/2012 02:14 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.025621,+-98.920789(38153)&iwloc=A&hl=en\"> mufon case (38153) map </A>","Region":"Texas","Country":"United States","Log Number":"US-05152012-0002","Disposition":"Unresolved","Date of the Event":"05/15/2012 12:00 UTC","City":"Electra","Object Flight Path":"Straight-line path","Object Features":"Other, Unknown","Viewing Distance":"101-500 Feet","Case Number":"38153"}