{"Country":"United States","Case Number":"38158","Latitude":"40.93448","Weather Factors":"Unknown","divs":["Sighting DetailsI had uploaded a video with UFo events that had happened last week May 10th, I am very alert daily now & will go purchase a tripod, and get my hidef camera ready, as when I drive, i carry my iphone with me. This time it was Sunday may 13th. I went out to the dollar store around my street in paterson, NJ. It was around 7:30PM, a bit cloudy but still very light, when i spot a craft, it caught my attention because 1. I know automatically how airplane look like, and the manner this craft was flying was extremely off, almost like it was flying sideways in a straight line. I was alarmed as well, because we are a few miles from Newark Liberty airport and it was not headed that way, as it flew (again very slowly) it gradually slowed down some more. I immediately grabbed my iphone and recorded, my hands were shaking a bit because I parked on a handicap spot and got on top of my sit so that i may record from my car's sunroof. I have added screen grabs of the vide as well to show you key spots so you know where to look following it's path. Lasted about 30seconds on the video then it vanished into thin air. Video recorded iPhone 3GS, screen-grabs have object circled in red. No way that it was an airplane, a weather balloon or a satellite. I also checked the flights itineraries for that day, no flights were to be expected until 45minutes after the craft appeared. p.s. I added 6 pictures, they are in order by number as the craft appeared until it vanished. Photo #6 is marked as last frame seen"],"Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.93448,+-74.159334(38158)&iwloc=A&hl=en\"> mufon case (38158) map </A>","City":"Paterson","Summary":"Solid light gray object","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path then hovering,Other","Viewing Distance":"Unknown","Object Features":"Unknown","trends":["There have been 9 other sightings in Paterson","There were no other sightings in Paterson on or around May 13th 2012","This sighting has never been favorited.",""],"Region":"New Jersey","Date of the Event":"05/13/2012 08:10 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/38158.html.txt","/var/www/straped/mufon/more/38158_submitter_file2__1.png","/var/www/straped/mufon/more/38158_submitter_file3__2.png","/var/www/straped/mufon/more/38158_submitter_file4__3.png","/var/www/straped/mufon/more/38158_submitter_file5__4.png","/var/www/straped/mufon/more/38158_submitter_file6__5.png","/var/www/straped/mufon/more/38158_submitter_file7__6.png","/var/www/straped/mufon/org/38158.html"],"Date Submitted":"05/15/2012 12:57 UTC","Longitude":"-74.159334","Object Shape":"Disc, Oval, Unknown","Log Number":"US-05152012-0009"}