{"Object Shape":"Boomerang, Chevron","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-05152012-0013","Date Submitted":"05/15/2012 05:31 UTC","Disposition":"Unresolved","Latitude":"45.527062","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/38162.html.txt","/var/www/straped/mufon/org/38162.html"],"Region":"Oregon","Case Number":"38162","Summary":"UFO seen being chased by military aircraft over portland oregon on may 14th at 10pm","Country":"United States","Object Features":"Wings, Unknown","Date of the Event":"05/14/2012 10:05 UTC","City":"Portland","map":"<A HREF = \"http://maps.google.com/maps?q=45.527062,+-122.674067(38162)&iwloc=A&hl=en\"> mufon case (38162) map </A>","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around May 14th 2012"],"divs":["sighting detailslast night at about 10:00 pm my friend called me quite excited and told me to go outside and look to the south because there were ufos in the sky. he was at se 39th (cesar chavez) and woodstock, and i was at se 43rd and holgate. he stated that there were 3 craft in the sky, but by the time i made it to where i could see the southern sky,my friend said the ufo had disappeared and there were only two military aircraft visible. i could tell that they were military because they moved very slow and silently, and had the shape of a stealth or something (kind of like a flying wing shape) but they also had the traditional faa required flashing lights on the wings. they moved slowly toward me from the south and then made a sharp turn almost directly over my position and started moving south east. i had never seen an airplane move so slowly and silently, although i didn't see the ufo i definitely saw the military aircraft that were flying with\\chasing the ufo. my friend saw the actual ufo and military aircraft from his position at 39th and woodstock, my girlfriend and i saw the military aircraft from our position at 43rd and holgate, and my mother saw the military aircraft from her position at 33rd and holgate.you can contact me if you want any more details."],"Object Flight Path":"Path with directional change","Longitude":"-122.674067"}