{"Weather Factors":"Unknown","Summary":"Saw a starlike object hovering over west horizon that shot off to the south and disappeared.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was sitting in the carpool lot with my husband waiting for our daughter to be dropped off to us and while chatting and listening to the radio, we were just stargazing what few stars were visible at the time. As we were watching we looked at a very bright star, and just as I asked if he saw how bright the star was, I saw it quickly zoom in a southerly direction for about an inch and a half (in comparison to viewing it through the truck's windshield glass) before just disappearing. It almost seemed to get smaller before it disappeared as if it had turned toward space and away from earth. I asked my husband if he had seen the object and he denied it at first, until our daughter was safely in bed and sleeping when he admitted to me that he really had seen it but didn't want to freak me out. To test our sightings together, since I had tried to show him while we were seated in the truck, I asked him to describe what he saw... and it was exactly what I saw. He even gave details that I hadn't mentioned like how it was first seen just below a power line from our point of view and also how it looked like it got smaller before disappearing. I hadn't mentioned those things when spotting it and trying to show him. I believe that we both witnessed a UFO that evening."],"files":["/var/www/straped/mufon/html2text/38166.html.txt","/var/www/straped/mufon/org/38166.html"],"Region":"Michigan","Viewing Distance":"Over One Mile","Latitude":"44.316014","Object Shape":"Sphere","Source":"MUFON","Country":"United States","Object Features":"Unknown","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Hovering then path","City":"Rives Junction/Pleasant L","Longitude":"-85.598454","trends":["there have been no other sightings in rives junction\\pleasant l","This sighting has never been favorited."],"Date of the Event":"03/16/2012 07:45 UTC","Case Number":"38166","map":"<A HREF = \"http://maps.google.com/maps?q=44.316014,+-85.598454(38166)&iwloc=A&hl=en\"> mufon case (38166) map </A>","Log Number":"US-05152012-0017","Date Submitted":"05/15/2012 08:31 UTC"}