{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.096765,+-83.107946(38164)&iwloc=A&hl=en\"> mufon case (38164) map </A>","Weather Factors":"Unknown","Sighting Duration":"00:01:15","Log Number":"IE-05152012-0015","Viewing Distance":"20 Feet or Less, 21-100 Feet","divs":["sighting detailsi never thought i could live this one time... when travelling i was going to temple bar zone in the center of dublin and stopped near the liffey river for a while. it is not a really secured zone at that time of the night and i was only with my cellphone. i wish i could have my camera. it would be amazing. i have to say i didn't drinked anything ( just for those who know temple bar aerea :) )...after this sighting yes i've drinked a lot. anyway, when near the river i started noticing what i thought it was a sea flare rocket fired from the sea direction ( east )...i never seen one before and keep watching. the supposed flare started to be very bright in orange colour...i supposed that was normal, although i only see them in the movies ( they use to be red ). in a few seconds the bright light expanded, became bigger and i saw it was heading for the city, to my location. i don't remember to cross the road, neither if there was vehicles but i did, always staring at it. i grab my telephone. i was now near a building at a cross, with a way of escape ( i was a little scared ) because the light was not a light already. i was seeing a really disc ufo with the orange light at one edge and a fuzzy base like fog rotating in brown colour. this was a really phisical disc, except from that base that was like a cloud moving.no sound, to slow hovered above my head ( i toke a photo but the cellphone only show the bright light )....changed direction and crossed the river ( it inclined always to change the direction ) then stopped inclined in the sky just no more then 10 meters away from me and spotted a blue beam to the main monument in the center of dublin ( i don't remember the name - it's like a big antenna ). then rotated the beam to the opposite site of the river above the buildings and started moving again like slow motion. stopped again and then , well then it makes a full ascend until 40 \\ 50 meters altitude and dive in full speed out of sight to west \\ northwest. the object seemed to have a exploring pattern and if i wasn't shure of what i saw i could be tempted to compare the blue beam light similar to the lights police helicopters use in hollywood movies but no...it was really a disc object. also the speed in the final moments and the absent of any sound cleared all my doubts as the proximity to the object. i wish only i had a better photo, really. just one thing: please remember...i'm sure more people must have seen something. i was in almost shock, i was alone in a foreign country, i was near bar's and i don't told anyone. anyway i believe i was not the only one. i stated in the mufon report it seems reality was modified because no one seemed to notice, semmed that the time stopped like i was seing a movie, i really don't imagine how i crossed the road ( no traffic ? ) this was amazing, seemed the whole experience resumed to me and that object. i will never forget. thanks if you, et's see this report someday. please come back and show yourself again.and don't fear mankind...there are good peacefull people too"],"Longitude":"-83.107946","Country":"United States","Case Number":"38164","Summary":"Strange behaviour UFO beamed light to ground in Dublin (Ireland)","Object Shape":"Disc","trends":["There have been 2 other sightings in Dublin","There were no other sightings in Dublin on or around August 15th 2010","This sighting has been favorited 2 times.",""],"Tags":"City","Date of the Event":"08/15/2010 10:56 UTC","Source":"MUFON","Object Features":"Patterned Surface","Latitude":"40.096765","City":"Dublin","Date Submitted":"05/15/2012 07:36 UTC","Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/38164.html.txt","/var/www/straped/mufon/more/38164_submitter_file1__IMAGE015.jpg","/var/www/straped/mufon/org/38164.html"],"Region":"Ohio"}