{"files":["/var/www/straped/mufon/html2text/38181.html.txt","/var/www/straped/mufon/org/38181.html"],"Source":"MUFON","Case Number":"38181","Object Shape":"Sphere","Disposition":"Unresolved","Sighting Duration":"00:03:00","Object Features":"Unknown","Country":"United States","trends":["There have been 3 other sightings in Heath","There were no other sightings in Heath on or around May 15th 2012"],"Longitude":"-82.412584","Date Submitted":"05/16/2012 09:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.965558,+-82.412584(38181)&iwloc=A&hl=en\"> mufon case (38181) map </A>","divs":["Sighting DetailsMy girlfriend and I went out to smoke a cigarette with her adult aged son shortly before midnight on May 15th, 2012. Looking due East at about a 30 degree angle from my view point a bright orange light just came on as if somebody turned on a light switch. It hovered for a secong then slowly started to rise in alititude to about a 40 degree angle. Then the light simply went out. the entire event lasted about 3 minutes. There were planes in the area, in fact one passed directly below the light from my vantage point. This was no airplane or helicopter. There was no sound from it at all. There were no additional lights of any kind that you would normally associate with an aircraft other than the solid orange light. I know aircraft and this was no aircraft that I am familiar with. I live in the flight path of Port Columbus airport and I see alot of planes and helicopters. It was a good distance away from me so I am unable to give an actual determination of distance. It was not a meteor but there was one witnessed earlier in the evening that glowed a bright green color as it burned up. There was no cloud cover so the light could not have gotten lost in a cloud. It was about the color of Mars in the night sky and it was a steady light, not flashing or pulsing. It was about the size and intesity of Venus in the night sky. The entire event was witnessed by all three of us. I nad her son looked for the object until about 12:30 am but it never showed its self again. I am an amateur astronomer and I am familiar with the things associated with the night sky. This was not a planet, star, comet, or meteor."],"Region":"Ohio","Summary":"Glowing Orange Light","Object Flight Path":"Hovering then path","City":"Heath","Log Number":"US-05162012-0006","Latitude":"39.965558","Viewing Distance":"Unknown","Date of the Event":"05/15/2012 11:59 UTC","Tags":"City","Weather Factors":"Unknown"}