{"Disposition":"Unresolved","Longitude":"-118.810089","Date Submitted":"08/25/2005 12:00 UTC","divs":["Sighting DetailsAbout a week ago I saw 2 wedge-shaped craft that looked alot like the attached except the front light was a very large blinding white light and the other lights were not colored or flashing. I was on the beach in Malibu at night around 8pm with my dog...like the article below they were moving slow and rather low, cruising as if patroling the beach and nearby mountain area. I do not rememeber hearing any engine but at the time they were so obvious I took them for military vehicles (US)..it is only later when I talked to pilots and found out there is no known craft fitting the 'wedge-shaped' description, did it occur to me that they might not be ours. The size was larger than an average plane but not outrageously large like some triangles are being described. They might be considered about the size of 2 planes..but the body is 'fat' and they look very sort of chunky unlike the ufo's I've seen that move at incredibly rapid speeds. The first one came toward the beach perpendicular to it flying inland from out in the ocean --when I first saw it, it appeared to be a star from far away but then it got larger (a blinding white light) and seemed to be stationary over the ocean..I began to think it was a helicopter..but it finally came close and flew overhead and I could see it was this clunky wedge-shaped body, it sort of curved and fly overhead then another one came out of the north and from behind me and also flew in a leisurely way overhead...since there were two and I was still thinking they had to be ours because they looked so ..workhorse like and really seemed to be patroling..I didn't pay much more attention..I didn't lose sight of them they continued cruising around for a while. I was on the beach walking my dog for about 45 mins..I am attaching a photo I found online that approximates the way they looked.."],"Log Number":"US-09062005-0004","Object Shape":"Triangle","Country":"United States","Date of the Event":"08/25/2005 12:00 UTC","files":["/var/www/straped/mufon/html2text/3818.html.txt","/var/www/straped/mufon/more/3818_submitter_file1__h_triangle_schematic_02.jpg","/var/www/straped/mufon/org/3818.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","City":"Malibu","Summary":"2 wedge-shaped craft patroling beach and surrounding mountains","Tags":"City","Object Features":"Window(s), Patterned Surface, Louvres","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.005008,+-118.810089(3818)&iwloc=A&hl=en\"> mufon case (3818) map </A>","Latitude":"34.005008","Region":"California","Source":"MUFON","trends":["There have been 20 other sightings in Malibu","There was one other sighting in Malibu on or around August 25th 2005","This sighting has never been favorited.",""],"Case Number":"3818"}