{"Viewing Distance":"21-100 Feet","City":"Rugby","Summary":"Why did it seem to choose us? It was like a test!","Object Features":"Other","divs":["Sighting Detailsmy mother(maureen hunt) and sister(danielle McCulloch) left my grandparents house, in the evening. It was dark clear sky, littered with stars! As we got into the car something court my eye. What I seen or what I believed I seen was a light orbiting a star, it seemed so far away!!! I pointed it out to my mum, which she dismissed as just a star. We were now traveling back home, I don't know why but I was fixated on this star! I started to get excited as it seemed to have become a single object which was now looking more like an aircraft in the far distance at night. We are now half way home an the craft was now a lot closer, whilest this was going on I was giving my mother a running commentary. At the time my mum never seemed that bothered about it, she would reply saying 'it was a helicopter or something!'. We have spoke about it many times since and she tells me she was alarmed, I think I was to excited to notice at the time! By now the craft was very visible, and seemed to be following our car, which was very strange! As we turned into the main estate before our own there is a canal that runs parallel with the road, distance between them are no more then 20 meters. As we drove next to the canal the craft was matching our speed and was above the water which I could make out the shape which was a triangle, with three bright lights on the corners. As we approach the bend of the road the craft seems to follow the canal which goes of in the opposite direction. At this time I stared to quiz my mum about what we seen. We approached the house, drove up the short drive, stopped and got out the car. As I looked towards my mum on the other side of the car I seen the craft fly silently towards us! It must have been 50 60 feet in the sky no sound no down draft. It stops, right above us, in a blink of an eye it shot off with incredible speed. I ran from the car to the back garden, nothing, the dog was going crazy! when I spk to my mum an sister we have slight differences about the end. Mine is that my sister was crying in the car but never got out! When we speak about this she said she was out the car??? When talking about the incident I can give a better account. I have a military background, the years served I have never come across any vehicle with the capabilities of the one seen in my above statement. Also I apologise, but the date is approx."],"Country":"United Kingdom","Source":"MUFON","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=52.388521,+-1.237237(38185)&iwloc=A&hl=en\"> mufon case (38185) map </A>","Date of the Event":"02/14/1996 08:00 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Other","trends":["There have been no other sightings in Rugby","This sighting has never been favorited."],"Date Submitted":"05/16/2012 03:25 UTC","Longitude":"-1.237237","files":["/var/www/straped/mufon/html2text/38185.html.txt","/var/www/straped/mufon/org/38185.html"],"Object Shape":"Triangle","Region":"England","Log Number":"GB-05162012-0010","Latitude":"52.388521","Case Number":"38185"}