{"Country":"United States","Longitude":"-104.922196","Latitude":"39.567194","Weather Factors":"Unknown","Tags":"City","City":"Centennial","Case Number":"38189","Object Flight Path":"Straight-line path","trends":["There have been 16 other sightings in Centennial","There were no other sightings in Centennial on or around May 15th 2012"],"Summary":"Dark cube-shaped object that appeared to change shape slightly and had faint appendages along bottom edge","Object Shape":"Chevron, Other","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/38189.html.txt","/var/www/straped/mufon/org/38189.html"],"Object Features":"Appendage(s)","Log Number":"US-05162012-0014","Region":"Colorado","Date of the Event":"05/15/2012 08:10 UTC","divs":["Sighting DetailsMy wife and I are retired and we often sit outside in lawn chairs at the front of our house on warm evenings. We live under the flight path of airliners that take off and land at Denver International Airport, so aircraft sightings are common, but this sighting was not an airliner. We concurred that it was something we could not identify (not a balloon, or known type of aircraft, probably not a military drone, and was not a bird because it was too high up and did not resemble any kind of bird we are familiar with due to the roughly dark cubic shape it had. This object was moving about the speed of an airliner coming in to DIA and kept a straight path moving directly north from our vantage point over Denver. We saw it first at about 70 degrees from the horizon and quite high overhead. Object kept moving north and eventually disappeared behind a tree line. Object appeared to be rotating or changing shape slightly. At one point it did look something like a plane, but for the most part it was dark cubic non-reflective with appendages at the bottom edge. Strangely enough, my wife heard about another UFO report on Channel 9 later that evening, but no details were available regarding what a pilot had reported as a sighting in close proximity to his aircraft. That sighting apparently was a near-miss collision to the pilot's plane on the same day, so we don't know if what we saw was the same thing or not. The object we saw was completely silent, and there were no other objects or aircraft in the sky at the time of the sighting."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.567194,+-104.922196(38189)&iwloc=A&hl=en\"> mufon case (38189) map </A>","Date Submitted":"05/16/2012 10:28 UTC"}