{"Weather Factors":"Unknown","Longitude":"-2.878644","Source":"MUFON","Latitude":"53.464233","Object Features":"Other","divs":["Sighting Detailsmy friend and myself, i was driving were traveling home from Manchester to liverpool on the a59 east Lancashire road in 1989 approx 1am or later. when ahead we noticed a craft hovering above some buildings ahead of us we new something was weird as it was so large as we approached we talked rubbish to each other harrier jump jet, helicopter,the only things we knew that can hover but we new it wasn't as we got close to it my car cut out and we stopped directly underneath it but i was having trouble with my carb anyway so i wouldn't say or claim a Spielberg moment. i lay on top of my friend both looking up at it out the car window. you could see it was made of a dull grey to silver metal with lights all around its underside no sound no movement we watched it for quite some time then the lights went out with out a sound it shot up in the blink of an eye till it looked like a star stopped dead then shot off at a90 degree angle towards manchester"],"files":["/var/www/straped/mufon/html2text/38187.html.txt","/var/www/straped/mufon/org/38187.html"],"Disposition":"Unresolved","City":"Liverpool","Sighting Duration":"Undisclosed","Summary":"driving home with freind seen object ahead stopped direcly underneath it clearly see it was a dull silver gun metal colour , well lit up under side no sound at all","Case Number":"38187","Date of the Event":"09/19/1989 01:05 UTC","Date Submitted":"05/16/2012 04:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.464233,+-2.878644(38187)&iwloc=A&hl=en\"> mufon case (38187) map </A>","trends":["There have been 17 other sightings in Liverpool","There were no other sightings in Liverpool on or around September 19th 1989"],"Region":"England","Object Shape":"Oval","Log Number":"GB-05162012-0012","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary","Country":"United Kingdom","Tags":"City"}