{"files":["/var/www/straped/mufon/html2text/38180.html.txt","/var/www/straped/mufon/more/38180_submitter_file1__001.jpg","/var/www/straped/mufon/more/38180_submitter_file2__002.jpg","/var/www/straped/mufon/org/38180.html"],"divs":["sighting detailsi dropped my husband of at work about 3 miles outside of town as i got to the end of the driveway i saw 4 blue\\white lights on the ground in the yard across the street as i looked at them about 3-4 feet above a blue-green light pulsated as if under rippling water the light started on the left changed color to a dull yellow in the middle and then back to blue green on the right it did this about 3 times.my first thought was this is not normal so i turned left on the road and started to drive fast to get out of there, i looked into my rear-view mirror and and it lifted about ten feet off the ground the bottom angled toward me and on the bottom there was a very bright orange red light it sped up with the bottom angled toward me and was following my car i barely stopped at the stop sign and turned left, i thought it had stopped but i looked in my mirror again and it was chasing me i sped up to about 65 and it stayed within 20 ft of my car, i got to the end of the road and turned right at this point i was at the edge of the city and it's lights disappeared. i did not see it after that."],"Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Latitude":"37.682284","Object Flight Path":"Other","City":"Lebanon","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.682284,+-92.606786(38180)&iwloc=A&hl=en\"> mufon case (38180) map </A>","Disposition":"Unresolved","Region":"Missouri","Log Number":"US-05162012-0005","Viewing Distance":"20 Feet or Less","Case Number":"38180","Date Submitted":"05/16/2012 08:17 UTC","Summary":"I Saw it on the ground and it chased my car for about 1 mile no more than 20 ft behind me","Object Features":"Dome, Other","Longitude":"-92.606786","Object Shape":"Disc","trends":["There have been 7 other sightings in Lebanon","There were no other sightings in Lebanon on or around May 16th 2012","This sighting has never been favorited.",""],"Date of the Event":"05/16/2012 04:50 UTC"}