{"trends":["There have been no other sightings in Inez","This sighting has never been favorited."],"Region":"Kentucky","Weather Factors":"Unknown","Summary":"Happened around at midnight , travelling on Route 3 towards Inez","divs":["Sighting DetailsTwo people in car at first thought I saw lightning at a distance , then passenger saw same. Noticed at that time the light (dim at this time) was seen over hill and was pulsing. Kept getting brighter til we eventually started around a curve and spotted it .Very large in size hovering over parking lot. View was momentarily blocked by hillside.By the time we could get clear view it was gone. Then we again spotted it at the treeline about a half mile down road. Stationary, pulsing ,extremely bright white light. Appeared circular. I stopped car to look, it never moved. I tried to take video with cellphone, but it wouldn't show clearly. Just a white dot on screen. Got back in car and drove on while passenger watched out the window , it seemed to move a little but not much. When I arrived home a short distance later I could still see the flasing that I first saw over the hill. This lasted for an hour or more. I wanted to go back with a regular camera and see if I could get clear video. I suppose fear of the unknown and the fact I would have been alone in doing this stopped me. We both just kept saying the obvious- \"What is that?\" over and over. I tried to tell myself that it was military, but why would they take the chance to draw so much attention? If someone has an explanation I would love to hear a logical one. Side note- I travel this road every night from work so I wll be watching and carrying a camera."],"Source":"MUFON","Date Submitted":"05/17/2012 01:17 UTC","Disposition":"Unresolved","Tags":"City","Date of the Event":"05/17/2012 12:00 UTC","Case Number":"38206","Viewing Distance":"101-500 Feet","Object Flight Path":"Path then hovering","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/38206.html.txt","/var/www/straped/mufon/org/38206.html"],"Longitude":"-82.538763","Object Shape":"Circle","Log Number":"US-05172012-0014","Sighting Duration":"Undisclosed","Latitude":"37.866483","City":"Inez","map":"<A HREF = \"http://maps.google.com/maps?q=37.866483,+-82.538763(38206)&iwloc=A&hl=en\"> mufon case (38206) map </A>","Country":"United States"}