{"Country":"United States","Disposition":"Unresolved","Object Features":"Unknown","Latitude":"36.754561","divs":["Sighting DetailsAbout 1:00 a.m. last night (May 17, 2012) I was preparing to go to work. I live in Farmington New Mexico, near the Four Corners (NM, CO, AZ, & UT). The sky was clear, and very dark because the small crescent moon hadn't yet risen. My house faces south, and I walked out my front door to the driveway and stopped in front of my garage when a movement in the sky caught my eye. Facing southward, I looked up and saw a very large dark triangular-shaped object gliding ominously towards me & over me. The object passed directly over me, heading due north. As soon as it had passed overhead it was out of my view, since my garage and house blocked my view. The sighting only lasted about 3 seconds or less. The object was gliding along very smoothly and rapidly. I felt a creepy feeling, like a chill up my spine. It had a powerful presence, like a predator. I'm over 50 and this is my first UFO sighting. As soon as I saw it, I knew it was a UFO since there was no sound at all. It was eerie. I immediately went back inside and told some of my family members what I had just seen. Then I went back out and looked all around the sky but couldn't see any sign of it. By then it was probably several miles away, since it was moving at a steady, smooth pace, probably about a mile every 10 seconds. The size of it was so large, that a basketball held at arm's length would just barely have covered it. It could have been a top-secret spy drone or something, but I don't think our government has something that could fly that silently, with no sign of a propulsion system. It blended in with the stars and the night sky so well, that someone driving in a car probably wouldn't have noticed it."],"Date of the Event":"05/17/2012 12:00 UTC","Log Number":"US-05172012-0017","files":["/var/www/straped/mufon/html2text/38209.html.txt","/var/www/straped/mufon/org/38209.html"],"trends":["There have been 4 other sightings in Farmington","There were no other sightings in Farmington on or around May 17th 2012"],"Date Submitted":"05/17/2012 02:03 UTC","Summary":"Large triangular-shaped object gliding silently, passed right over me","City":"Farmington","Source":"MUFON","Tags":"City","Region":"New Mexico","Object Flight Path":"Straight-line path","Object Shape":"Triangle","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Longitude":"-108.16476","Case Number":"38209","map":"<A HREF = \"http://maps.google.com/maps?q=36.754561,+-108.16476(38209)&iwloc=A&hl=en\"> mufon case (38209) map </A>"}