{"Sighting Duration":"Undisclosed","Date Submitted":"05/17/2012 02:45 UTC","Tags":"City","Region":"Virginia","Object Shape":"Cigar, Disc","trends":["There have been 24 other sightings in Roanoke","There were 2 other sightings in Roanoke on or around May 16th 2012","This sighting has never been favorited.",""],"divs":["Sighting DetailsLooking out my window admiring the beautiful colors of the clouded sunset i decided to snap a few shots to use as my wallpaper. After a few shots i realized there was something in the sky above the tree line. I zoomed my cell in as far as i could and started snapping away. The clouds were moving right and this dark grey saucer looking object appeared out of them hovering in place, or so it seemed. At first i thought it was just a darker cloud mixing with the prettier light colored ones. Starring at it through my camera i could tell it was solid. Looking over the photos later i could clearly see that it was slooooooooowly moving against the clouds. The time was 8:26pm and it was gone by 8:29pm. I snapped 26 pictures in that time period. About 5-7minutes later I was on the phone explaining to my bestie what i saw. Sure enough as i was describing it to her this big huuuuge dark diamond shaped looking cloud started popping out of the clouds. I stared in awe at how massive it was. It wasn't one solid object. It was several small round, dark gray objects. They slowly started moving across the sky, same direction as clouds this time. A sudden bright flash of light and they shot of in two opposite directions. My son and his father were also starring at this unexplained phenomenon. I would have loved to have got that one on video or pictures. But can't use camera while im talking on my phone, that happens to be camera. Lol. I was disappointed i didn't get the big one recorded but i am happy i got the smaller one. I have several over sightings. I live near the airport in roanoke so i see planes go out all the time, along with helicopters. And what i have witnessed the last two months were nothing that has come out of that airport. I can see the planes land and take off. Im so close i hear them start up constantly. All 8 sighting this past month were NOT planes, birds, balloons or anything i have seen on this planet. I have also included two more photos of 3 round objects in the clouds near airport. If you look above the airport sign near top of photo you Will see them in a triangle like shape. Might have to zoom. One is the original and one is cropd to show them a little better. They are NOT birds. There is a bird in the photo but the three objects together are NOT. I have seen orbs. Stationary, blinking different colors really fast, flashes then vanished. Orange orbs that just zip across the sky and change direction too quickly and sharply to be plane, meteor or shooting start. No trails were left by either. Seen weird round objects in the clouds above airport and mountains. Grey, gun metal type colored Saucer flew 20ft above our heads( had 4 people over camping in my backyard) on April 20th @ 11:13pm. Made no sound, had no lights and wasn't very big. It actually shocked me on how small it was. It wasnt tiny, at first we thought it was an owl gliding through the sky. That was about the size, An adult owl with wings wide open. But it wasn't an owl, i can promise you that. Every time i see one of these objects i can't explain, i smile. Im not scared during any of these sightings. Im relieved that Im not crazy. I know there's no way we are the only living being in the whole universe. Im glad they are making themselves known and i can't wait to actually get to chill with beings who have so much to offer mankind. Happy hunting everyone. Peace. :-)"],"Date of the Event":"05/16/2012 08:26 UTC","files":["/var/www/straped/mufon/html2text/38200.html.txt","/var/www/straped/mufon/more/38200_submitter_file10__20120516202829.jpg","/var/www/straped/mufon/more/38200_submitter_file1__201205162027101.jpg","/var/www/straped/mufon/more/38200_submitter_file2__201205162028031.jpg","/var/www/straped/mufon/more/38200_submitter_file3__201205162027421.jpg","/var/www/straped/mufon/more/38200_submitter_file4__201205162027151.jpg","/var/www/straped/mufon/more/38200_submitter_file5__201205162027391.jpg","/var/www/straped/mufon/more/38200_submitter_file6__20120417173056.jpg","/var/www/straped/mufon/more/38200_submitter_file7__201204171730562.jpg","/var/www/straped/mufon/more/38200_submitter_file8__20120516202951.jpg","/var/www/straped/mufon/more/38200_submitter_file9__20120516202812.jpg","/var/www/straped/mufon/org/38200.html"],"Latitude":"37.27541","Log Number":"US-05172012-0009","Summary":"dark grey large solid object hovering and fading in and out of clouds","Case Number":"38200","Object Flight Path":"Hovering then path,Path then hovering,Other","Viewing Distance":"501 Feet - 1 Mile","City":"Roanoke","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Dome","Longitude":"-79.937077","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.27541,+-79.937077(38200)&iwloc=A&hl=en\"> mufon case (38200) map </A>"}