{"map":"<A HREF = \"http://maps.google.com/maps?q=33.629956,+-111.844137(38208)&iwloc=A&hl=en\"> mufon case (38208) map </A>","Latitude":"33.629956","Sighting Duration":"Undisclosed","Summary":"One object came toward us and then moved on; then three objects and then more. All had individual flight paths but similar direction. Moving at about 20 or 30 mph from SW to NE. They were silent and appeared to be glowing orange, red and yellow.","Log Number":"US-05172012-0016","divs":["Sighting DetailsWe were sitting in our backyard by the pool with all the outside lights on. I was looking up at the sky when I saw an orange, redish oval shape object coming toward us from the SW. When it got close it slowed from about 30mph to a hover and then started moving on towards the NE. I immediatly told my wife to look up and called for my daughter. Then three more of the same kind of objects came from the same direction on similar individual flight paths. All objects were totally silent which was very strange to me. More and more came in groups of one to three (total of about 12 objects). At first I though it might be a plane or helicopter but then as it closed in I could clearly see it was neither and totally silent. Objects seemed to know eachothers fligh paths but moved independently the whole time. All were the same glowing coloration. I was clam but excited to see this and felt fine the entire encounter. All of the objects moved NE at different times. Some in groups and some independently. In my video they appear to be in a triangle but they were actually moving at slightly different speeds and moved individually."],"Date of the Event":"05/12/2012 09:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Case Number":"38208","Object Features":"Dome","Longitude":"-111.844137","Source":"MUFON","Region":"Arizona","Object Shape":"Oval","Date Submitted":"05/17/2012 01:56 UTC","Object Flight Path":"Path then hovering","trends":["There have been 42 other sightings in Scottsdale","There was one other sighting in Scottsdale on or around May 12th 2012","This sighting has never been favorited.",""],"Tags":"City","City":"Scottsdale","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38208.html.txt","/var/www/straped/mufon/more/38208_submitter_file2__UFOPic.JPG","/var/www/straped/mufon/more/38208_submitter_file3__TwoUFO.JPG","/var/www/straped/mufon/more/38208_submitter_file4__UFO.JPG","/var/www/straped/mufon/org/38208.html"],"Country":"United States"}