{"Log Number":"US-05172012-0021","map":"<A HREF = \"http://maps.google.com/maps?q=41.351497,+-72.021269(38213)&iwloc=A&hl=en\"> mufon case (38213) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"05/17/2012 07:19 UTC","divs":["sighting detailsthis is always my least favourite part, excuse the cynicism. i guess i mean that i always find it difficult to describe a scenario so that someone understands how fantastic the event is as my experience; i'm a scientist, and a graduate nurse, and therefore trained to observe and report. however, there's more to a good story than just the facts, so, i'll do my best to make sense of this experience so somebody will enjoy reading this. every morning and some afternoons i take my 18 month old son for a walk around my neighbourhood, of which includes ring drive (in groton ct). my son has a thing for air-planes and loves to sky-watch, so, i often spend time looking up into the sky with him during our walks. this time, my son pointed at a plane and then i saw an object dangerously close to the plane, it seemed like the plane didn't see the object, as it didn't alter course or anything; i believe the object may have been on the periphery or in back of the plane, hence no change in course. at that moment i whipped out my video camera like \"billy the kid\" and started to video the craft, i didn't get much taping done and the object was gone, at that point i closed the video camera and sighed with disgust because i could not get a better video. then, out of the blue, totally unexpected another craft comes from another direction, this time closer and more discernible. it is totally possible that it could be the same same craft just closer, it was more difficult to make out the size and shape of the first one especially because of the brightness of the sky. however, the second video was shot at a closer distance and i was able to make out more details, this is supported by my less than perfect narration, i did just blurt out the details as the video plays reinforcing my memory and this description. i will say again, the object was circular\\spherical and moving around in an unnatural way. and, as you can see in the video, the object just moved out of view. it should be noted that this is my second mufon report. but, these to craft don't resemble the last two in the very least. in my opinion, the video quality and duration trump the video from the last report for the following reasons: a)the video camera was a 1080p (without zoom)vs a 720p from the last report, so, i think the object can be better discerned especially after digital zoom is applied. b) this was my second experience & i was not anxious and as jittery as the first video. c) lastly, there are objects in the foreground so a distance and size should be easier to figure out. by no means am i discounting my last experience, in fact i stated before that this area (groton ct) is a hot spot because of the sub base, general dynamics (electric boat), the air national guard, and lastly the airport. when i first came to the area a few people had mentioned the weird shapes and lights in the sky and i dismissed them all until i saw a bunch things in the sky that i could not understand myself. it is of my opinion that these ufo's and such are extraterrestrial in nature and have been occurring for quite some time now. and furthermore, it is also my opinion that these craft seemed interested in our military (especially nuclear) technology, commercial aircraft, and our developing tech (general dynamics). i hope that everyone reading this got a good understanding of what happened to me on may 11th 2012. thanks for reading my report."],"Sighting Duration":"00:02:00","Longitude":"-72.021269","City":"Groton","trends":["There have been 4 other sightings in Groton","There were no other sightings in Groton on or around May 11th 2012","This sighting has never been favorited.",""],"Country":"United States","Region":"Connecticut","Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Other","Object Shape":"Circle, Sphere","Tags":"City","Summary":"Two disctinctly different UFO's spotted in the Groton CT area AGAIN!!","Weather Factors":"Unknown","Latitude":"41.351497","Date of the Event":"05/11/2012 07:45 UTC","files":["/var/www/straped/mufon/html2text/38213.html.txt","/var/www/straped/mufon/org/38213.html"],"Case Number":"38213","Object Features":"Undisclosed"}