{"divs":["Sighting DetailsWell, I walked outside to take care of some personal stuff at around midnight or so. I looked overhead and I saw these strange blinking lights. [White and pinkish colors that were pulsating.] I definitely saw one UFO at first. Because it was hovering there for about an hour or so. But sometimes it would move abruptly about 10 to 50 feet. It would just sit there and act like a star at first, and it would just stay still in the sky for about 10 to 20 minutes or so in duration, hovering....then it started to hum a bit when it moved in a slow hover. I noticed it was blinking some sort of code. There were planes flying by this light that was moving just a bit. Then I noticed that there was another blinking light it was communicating with, a lower set UFO slightly above the tree-lines. I know planes don't do that! Stay still for a length of time, then move a bit in the skies, then stay still again. It did that quite a few times. Well both of these \"crafts\" did that. There were actually planes that flew by it...night pilots. But I noticed these planes were not paying any attention to these strange lights. I could not take a clear picture, because my camera is not great with night pictures. But it was obviously a couple of spacecrafts from \"somewhere out there\"! It was strange for me seeing this. Most certainly!"],"trends":[],"Date of the Event":"05/16/2012 12:00 UTC","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/38216.html.txt","/var/www/straped/mufon/org/38216.html"],"Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.967803,+-91.827153(38216)&iwloc=A&hl=en\"> mufon case (38216) map </A>","Date Submitted":"05/18/2012 04:05 UTC","Object Flight Path":"Stationary,Hovering then path","Object Features":"Undisclosed","Log Number":"US-05182012-0001","City":"Undisclosed","Disposition":"Unresolved","Summary":"2 Blinking UFOs Over The Lee's Summit Area","Region":"Missouri","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-91.827153","Object Shape":"Unknown","Latitude":"37.967803","Case Number":"38216"}