{"Sighting Duration":"Undisclosed","Tags":"City","Latitude":"31.216581","Country":"United States","divs":["Sighting DetailsThe date is very approximate. After arriving home on a Sunday afternoon I was talking with 2 family members who were on the driveway with me. I noticed something glinting in the sky to the east. We have a lot of commercial air traffic overhead in this area since we are under the path that many planes take up and down the Atlantic Coast and at first I thought it was a low flying passenger jet, but the glint was stronger than those planes produce. It was much lower than passenger jets in this area. I noticed that there weren't any wings and there was a wide black band that went around the circumference at a point slightly less than halfway from the from the front of the cylinder. I still thought it might be an airplane whose wings were not visible because the way the sun was hitting it so I watched as it made it's progress and it was clear that it was not an airplane since it did not have wings, tail, or any tapering of any kind. I could not tell if the ends, which were not tapered, were open or closed. There was a passenger jet flying above and in front of the object, and slightly farther away from me. Both were flying straight north. The distance between the object and the airplane remained the same during the siting. The passenger jet was flying lower than those we usually see here. There was another passnger jet that was much farther away and much higher that follwed these two, but were all visible at the same time. Other planes came and went in the busy Sun. afternoon sky shortly afterwards. The cylinder was shorter and fatter in proportion when compared to the passenger jet fuselage that I saw but seemed to be approximately the same size. I regret that tall trees blocked my view after about 10-15 seconds. My relatives wanted to know what I was looking at, but I just shook my head as if to say nothing because I didn't want to spend my time trying to explain while I could still see it and try to figure out what it could be. Afterwards I think I may have said I had seen something like an airplane without wings and tried not to make a big deal of it. I wanted to keep thinking about what it could be and didn't want to be distracted by kidding. Thoughts---Somehow it looked \"normal\". I didn't look menacing. Could it be some kind of device for photographing large areas, with the dark band being a dark \"plastic\" shield around cameras much like security cameras in stores have dark plastic looking covers? How did it get it's lift and propulsion? Was an airfoil inside the \"tube\"? Was it a lighter than air device with a propeller inside the \"tube\"? Why did it seem to be shadowing a fairly low flying passenger plane? Perhaps what looked like a passenger plane was really military? Was that plane perhaps an escort, but why would an escort be in front? Was it really above 500ft or under? Could civil and military radar detect it? Surely some of the planes in the busy sky had seen it. There are several airforce and naval air bases within 150 miles and no apparent military planes were checking it out. A nuclear submarine base is not too far away. I can only imagine that the skies are watched closely in this area."],"Longitude":"-82.350938","Object Features":"None","Region":"Georgia","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Waycross","There were no other sightings in Waycross on or around November 1st 2007"],"City":"Waycross","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Case Number":"38217","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=31.216581,+-82.350938(38217)&iwloc=A&hl=en\"> mufon case (38217) map </A>","Source":"MUFON","Object Shape":"Cylinder","Date of the Event":"11/01/2007 03:30 UTC","Summary":"Daytime cylinder with dark band","Log Number":"US-05182012-0002","files":["/var/www/straped/mufon/html2text/38217.html.txt","/var/www/straped/mufon/org/38217.html"],"Date Submitted":"05/18/2012 05:04 UTC"}