{"Object Shape":"Cigar, Circle, Oval","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around May 18th 2012"],"Source":"MUFON","Log Number":"CA-05182012-0009","Case Number":"38225","Object Flight Path":"Hovering then path","Region":"Alberta","Tags":"City","Sighting Duration":"00:01:30","City":"Calgary","map":"<A HREF = \"http://maps.google.com/maps?q=51.04633,+-114.051212(38225)&iwloc=A&hl=en\"> mufon case (38225) map </A>","Country":"Canada","files":["/var/www/straped/mufon/html2text/38225.html.txt","/var/www/straped/mufon/org/38225.html"],"Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-114.051212","Summary":"Black oval/cigar UFO over downtown Calgary. Appeared from clouds on 4th st and traveled East","Object Features":"None","Date of the Event":"05/18/2012 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"05/18/2012 06:49 UTC","divs":["Sighting DetailsSitting on the balcony with my wife, we looked up to see a black helicopter. The helicopter was circling the area between 17th Avenue 4th St and 15th Avenue 2nd St. I looked at it and commented \"That copter is looking for something, he's circling. What's he up to?\" My wife then pointed to the center point of the helicopters circled area. She said \"Look at that.\" The UFO appeared solid black and looked like a slightly bent cigar. It was very close to the helicopter, slightly to the west of it. The helicopter continued to circle and the UFO began changing shape into a circle. first it turned into an egg shape then a circle. After hovering for a few moments it appeared to drift about in a localized area. Then, it began traveling at a regular speed East. I thought it was coming down but then it started to get a little smaller and looked to be traveling upward. It was traveling only slightly lower than cloud cover. There was a thin ring around it like an aura and to me the sky seemed slightly electric. We lost sight of it as it traveled behind a building. We continued looked to where it's trajectory would have it appear but it never did. The helicopter moved to where the UFO had traveled and began circling that area. It looked like the helicopter was waiting for it to return or re-emerge. We watched the sky for some time after that, the helicopter circled the area for several minutes then headed north."],"Latitude":"51.04633"}