{"Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsMy mother and I were on our way to a nearby mall to do our weekly groceries. While waiting for a jeepney, I looked up at the sky, remembering another UFO that my mother witnessed last month (April 9) on the exact same spot, and hoping to see it too. (We saw multiple UFOs on April 10, including what appeared to be fleets of white orbs moving westward). Anyway, on April 9, my mother saw what she described as a transparent oblong with what appeared to be four legs with bright black balls at the ends. The entire object seemed to be rolling across the sky, moving from south to north, up in the sky along the exact middle of the main highway. At around 12:30 noon today (May 19), while waiting for a jeepney, I quickly scanned the skies and saw floating over the gas station across the street what I first thought was a black kite. It was moving in a waving, rippling motion, much like a snake. It was large because it was obviously very high up because it appeared to sometimes go above the clouds, and yet I could see it clearly and it probably measured about an inch if I held my fingers before my face against the sky. I pointed it out to my mother and we observed the object for a few minutes. We noted that it did not have a main head or body, like a kite has. It appeared exactly like a snake, except that when we observed it closely, we noticed that it actually appeared to be like some type of black plasma that seemed to be expanding and retracting at different points along its \"body.\" It was jet-black and had no discernible lights. A few minutes later, my mother suddenly exclaimed, \"Dalawa sila!\" (There's two of them!) And sure enough, some distance to its right was another object of the exact same type, also jet-black and also writhing and undulating like a snake. This one was much larger and we could clearly see that it was not a kite or a balloon or a piece of cloth. Like I said, it appeared to me to be a stream of some sort of jet-black plasma that was undulating in the air. It sometimes also flashed in the sun like something silver and metallic, and my mother thought she saw a light suddenly flash at one end of it, but I did not see this as I was looking at the other object when this happened. I tried to take photos and videos of the two objects with my cell phone camera, but my camera is an old model and was not able to capture the objects. Some time later (maybe around 15 minutes), I suddenly noticed that there was another object that had come up between the first two. It looked exactly the same and moved in the exact same way. The first two on the left would sometimes roll up into themselves and descend or ascend. The one on the right, the large one, would hover for long moments (around five to ten minutes at a time) as just a straight, rigid black line, without moving or fluttering in the wind. Then it would start to undulate again. It would cycle between this pattern of hovering and not moving and remaining rigid, and undulating and writhing, throughout the almost two hours we were standing there at the jeepney stop. All this time, we were both crying out and pointing at the sky but none of the people nearby bothered to look, which we both found strange. Anyway, apart from a group of men who were working on some sort of electrical repair out in front of their shop, there were very few people out because it was very hot and most people were having lunch, I guess. Some time later, another object appeared, in the same general area, making it a total of four black snakelike objects writing and hovering in the sky. Some time past one, I suddenly noticed what appeared to be a blurred pink or red light farther off to our right. As we looked, it slowly \"unfurled\" and also became snakelike, also alternating between being straight and rigid and undulating. I also noticed that it was accompanied by what appeared to be a black orb that was circling it at first and then moving beside it and suddenly veering off to the left and disappearing. When I moved my gaze back to the black \"snakes\" to the left, only two remained, and suddenly I noticed that there was an object to the left of the largest snake. It was aligned perfectly with the straight line formed by the black object. It appeared to me to be a small triangular object that emitted a pink light. When I first noticed it, it was hovering along with the black snake, but then it started moving in different directions. It was not fluttering like a kite or wobbling like a balloon. It was moving slowly in deliberate motions. Suddenly, it seemed to plunge downward. As it did, it became what seemed to be a silvery disk, and as it plunged further down, it suddenly became larger and became a large, deep black circle with a hole or light in the middle. When it reached a certain altitude, where I could see it right over the rooftops, it moved slowly to the right and suddenly moved up again and become again what seemed like a triangular pink star, or rather, three pink stars connected to each other to form a triangle. We watched this object move and plunge down and up again repeatedly, until we both realized that we were shaking with hunger. Around 2:15, we hesitantly left our spot to buy food at a nearby convenience store. When we returned, the black snakelike thing was gone and only the pink triangle remained, It still kept plunging and seemingly changing shape and then ascending again. We watched this for around 15 to 20 minutes more but my mother insisted that we need to get going. I very reluctantly agreed because we did need to get back home early. We boarded a jeepney and I briefly saw the object again when we passed by an open space between buildings. It was nearer here and I could clearly see that it was three circular objects that were joined together to form a triangle, and it was rolling and falling and moving sideways and just seemingly dancing up there in the sky. It was amazing. I still could not believe we saw all that today. I have to admit I thought instantly of Quetzalcoatl when we saw those sky \"serpents,\" whatever they were. I tried to look it up online when we got home but apart from a couple of reports, I could not find anything similar to what we witnessed today."],"trends":["There have been no other sightings in Cainta","This sighting has never been favorited."],"City":"Cainta","Disposition":"Unresolved","Region":"CALABARZON","files":["/var/www/straped/mufon/html2text/38238.html.txt","/var/www/straped/mufon/org/38238.html"],"Latitude":"14.584409","Case Number":"38238","Country":"Philippines","Object Flight Path":"Other","Object Features":"Other","Sighting Duration":"Undisclosed","Longitude":"121.12164","Date Submitted":"05/19/2012 10:43 UTC","Log Number":"PH-05192012-0006","map":"<A HREF = \"http://maps.google.com/maps?q=14.584409,+121.12164(38238)&iwloc=A&hl=en\"> mufon case (38238) map </A>","Tags":"City","Summary":"Sighting of four black snakelike objects and one red snakelike object accompanied by what seemed to be shapeshifting craft and orbs","Object Shape":"Sphere, Triangle, Other","Viewing Distance":"Unknown","Date of the Event":"05/19/2012 12:30 UTC"}