{"Case Number":"38230","Summary":"Two large bright lights, one red, one white, hover across sky and disappear","Country":"United States","Source":"MUFON","Date Submitted":"05/18/2012 11:01 UTC","Object Shape":"Circle","Disposition":"Unresolved","divs":["Sighting DetailsMy mom and I had gotten off the bus from church and started walking down the hill to our house. I looked up into the sky, and noticed a large, red, glowing circle slowly moving to the left. I told my mom and we stood there to watch it for about 30 seconds. Then I said, \"Oh my gosh I need to take a picture!\". When I reached down to grab my phone, there was a huge flash that made me jump, and the large red glow of the 'star' disappeared. But, then 'star' continued to move slowly to the left until I lost track of it. Then we continued walking down the hill, and still freaked out, I kept looking at the sky. I then noticed a large white ball, the same size as the red, in the sky moving to the left. I was only able to look at it for about 5 seconds because the bright light suddenly died out and turned into a normal looking 'star' and continued moving left, 2 seconds later completely dying out. After that we didn't see anything else. When I first noticed the object, I thought it was a comet or something. It made me feel excited, happy, or in aw because I've always wanted to see something like that, and it was so large. I lost sight of the object because I was looking around for other moving 'stars' in the sky. (I'm including an image I drew out in paint of the size of the object compared to the surrounding stars, and an arrow to show the direction it moved from where we were standing)"],"files":["/var/www/straped/mufon/html2text/38230.html.txt","/var/www/straped/mufon/more/38230_submitter_file1__size.PNG","/var/www/straped/mufon/org/38230.html"],"Object Features":"None","Object Flight Path":"Straight-line path","Log Number":"US-05182012-0013","Date of the Event":"03/18/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.443105,+-79.991866(38230)&iwloc=A&hl=en\"> mufon case (38230) map </A>","trends":["There have been 122 other sightings in Pittsburgh","There were 2 other sightings in Pittsburgh on or around March 18th 2012","This sighting has never been favorited.",""],"Latitude":"40.443105","Region":"Pennsylvania","City":"Pittsburgh","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-79.991866"}