{"Longitude":"-122.494397","Source":"MUFON","Region":"Washington","Object Flight Path":"Path with directional change","Object Shape":"Triangle","Log Number":"US-05192012-0002","City":"Lynden","Date of the Event":"08/15/2010 09:15 UTC","Object Features":"Patterned Surface, Other","Date Submitted":"05/19/2012 02:01 UTC","Latitude":"48.997905","divs":["sighting detailsi have seen the black triangle personally twice in my lifetime. both times where located within the same county (wa state). my most recent sighting is the one where i witnessed it fly 25 yards directly above my head. this account happened august, 2010. i was driving on a back road going to a buddies house (which is 1\\2 mile from the canadian border) when i saw it moving northeast from the southwest direction. it was moving around 10-15 mph. i witnessed it around 9:15 pm, so it was dark with mild cloud coverage. it was making no noise and had no lighting at first. from corner to corner i would compare the size to a 3 1\\2 lane road, so it was a fairly large. i witnessed the outline from a distance and eventually when it flew directly above me i saw some solid outlines on it. i saw no windows, in turn didn't see if anyone was operating inside. i noticed all three corners of the vehicle had 3 lights with a diameter of 1 foot. one light was in the middle with a diameter of 2 feet. these lights didn't turn on until the vehicle became very close to the border, the only reason i noticed them in the first place was because of the light reflection they were giving. it seemed to have 2 tiers in height, a smaller at the bottom, with a larger on top. the material also seemed to have a micro stone texture with a glossy smudge effect colored in black. as it became half the distance from me and the canadian border, lights turned on to mimic that of a helicopter and sounds were created to also mimic a propelling sound. it eventually disappeared from distance. i tried to pull out my evo 4g phone to take pictures, but the quality was so bad with pitch blackness while above me that i had to scrap them. no drugs or alcohol were involved with my personal sighting."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=48.997905,+-122.494397(38234)&iwloc=A&hl=en\"> mufon case (38234) map </A>","Case Number":"38234","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","Sighting Duration":"00:02:00","Summary":"Most Recent Black Triangle UFO, Whatcom County","files":["/var/www/straped/mufon/html2text/38234.html.txt","/var/www/straped/mufon/org/38234.html"],"Viewing Distance":"20 Feet or Less, 21-100 Feet","trends":["There have been 2 other sightings in Lynden","There were no other sightings in Lynden on or around August 15th 2010"]}