{"Tags":"City","Summary":"Row of lights takes off imediately after a distinct whirl/honking sound","Case Number":"38236","Date of the Event":"05/19/2012 01:45 UTC","Object Features":"None","Sighting Duration":"00:00:03","files":["/var/www/straped/mufon/html2text/38236.html.txt","/var/www/straped/mufon/org/38236.html"],"Disposition":"Unresolved","Region":"Washington","Date Submitted":"05/19/2012 06:11 UTC","Longitude":"-122.549604","Log Number":"US-05192012-0004","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.618606,+-122.549604(38236)&iwloc=A&hl=en\"> mufon case (38236) map </A>","Object Flight Path":"Straight-line path","divs":["Sighting DetailsA buddy and I decided to gaze at the stars after explaining my last encounter with UFO's. We got out the back door and looked for an area to lay down and gaze. My buddy started pissing on my house. I was looking for blankets on the cloths line and all of a sudden a weird honking type sound came from the sky. Assuming it was a bird of some sort, I look up to see what it was. My buddy unfortunately looked in the opposite direction as me but yet still heard the same sound I heard. As I was scanning the sky for a big loud bird of some sort, a dim light caught my eye. Heading to the north, was a diagonal row of dim lights heading at a quick and constant speed. The row of lights seemed to appear like half an isosceles triangle heading off in a hurry without a sound. It seemed as tho whatever it was, was spooked and make a honk like sound and hurried away. When I first saw this row of objects, I thought it was a shooting star. As soon as I saw the row of lights, I was rather frightened and hurried inside for about 30 seconds or so. My buddy finally got done emptying out on my house and was rather curious what he had heard and what I had seen. I seemed to lose sight of this object in the same place where the light dimmed out the stars. Not more than 45 seconds later, my buddy and I heard the same honking type sound in a different location, then about 5 seconds later, we heard this again in a totally different direction and louder. It seemed as tho this thing was on the move all around us. Some of its sound was louder and some was quieter as if it was far away. Later we never heard it again. In the audio recording which I hope works has dogs barking in the very beginning and right after the bark, the sound comes in rather faint but not hard to miss. That's my story! :)"],"City":"Vancouver","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Country":"United States","Latitude":"45.618606","Weather Factors":"Unknown","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around May 19th 2012","This sighting has never been favorited.",""]}