{"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Country":"Canada","Tags":"City","Log Number":"CA-05192012-0001","Summary":"3 star-like objects traveling fast in a linear formation then shifting to triangular formation","divs":["Sighting DetailsThe sighting occured today, May 18th 2012, 21h57. I have spent all evening in my backyard working on my company truck. I decided that it was all for today so I shut all of my outdoor lights. There was no neighbor outside and their exterior lights were also all shut. I went to the far end of my backyard and sat down on a chair, alone, relaxing and looking at the sky. A few minutes before the sighting, I spotted the usual planes and one possible satellite. My eyes were rapidly scanning the sky when something caught the corner of my eye. A \"star\" was traveling very fast across the sky, from west to east. As soon as I spotted the object, I tried to focus on it and follow it with my eyes : I was completely mind blown. There was a total of three star-like objects moving fast in a linear formation! They were surrounded by a very faint white disk-shaped halo. What happened after that just blew my mind: the objects steered to form a triangular formation. They regained their initial linear formation after about two seconds and I lost sight of the formation in the horizon. They made no noise, no blinking lights or no strobes. It was just like that: stars travelling at enormous speed. I got chills immediately afterwards, I knew that what I just saw was not of this earth. I've never seen anything like that before."],"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=46.560324,+-71.439004(38233)&iwloc=A&hl=en\"> mufon case (38233) map </A>","Region":"Quebec","Sighting Duration":"Undisclosed","Date Submitted":"05/19/2012 12:36 UTC","Case Number":"38233","Source":"MUFON","Latitude":"46.560324","Longitude":"-71.439004","trends":["There have been no other sightings in St-Agapit","This sighting has never been favorited."],"City":"St-Agapit","Object Features":"None","Object Flight Path":"Path with directional change","Date of the Event":"05/18/2012 09:57 UTC","files":["/var/www/straped/mufon/html2text/38233.html.txt","/var/www/straped/mufon/more/38233_submitter_file1__ovni19mai.jpg","/var/www/straped/mufon/org/38233.html"],"Disposition":"Unresolved"}