{"Longitude":"-83.652055","map":"<A HREF = \"http://maps.google.com/maps?q=38.374774,+-83.652055(38240)&iwloc=A&hl=en\"> mufon case (38240) map </A>","trends":["There have been 3 other sightings in Flemingsburg","There were no other sightings in Flemingsburg on or around May 17th 2012"],"Log Number":"US-05192012-0008","Latitude":"38.374774","Summary":"Another witness and I observed two dim star-like objects travel extremely fast across clear sky.","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/38240.html.txt","/var/www/straped/mufon/org/38240.html"],"Case Number":"38240","City":"Flemingsburg","Weather Factors":"Unknown","Country":"United States","Tags":"City","Region":"Kentucky","Object Shape":"Star-like","divs":["Sighting DetailsSitting outside on Farris Road another witness and I observed a dim \"star\" travel from directly above us due north at least five times faster than a normal airplane if not faster. Upon seeing this I stepped off the front steps into the yard to get a better view of the sky and immediately saw an identical object directly above us traveling due east at roughly the same speed as the first one. Within a minute I saw another identical object directly above me traveling due north again at the same speed as the other two. The other witness had walked inside and did not see the third object. The sky was completely clear. I stayed outside long enough to see a bird, a bat, a lightning bug, and another flying insect to see if a light reflection on some kind of flying insect or animal may look the same. This was not an animal, a star, or any conventional aircraft. The sightings were seconds long, the dim, almost gray, single light did not blink or pulsate and did not have any accompanying red light like an airplane. It traveled maybe ten times faster than a helicopter and appeared to be below the rest of the stars. I first noticed the object because I noticed movement out of the corner of my eye and then directed my view towards it. At first I thought it must be a plane but as I had been seeing planes fly over for about an hour, I knew it was traveling much too fast to be any plane and had no blinking lights whatsoever. The light appeared bigger than the lights on a plane. I felt like it was a fluke that I happened to be outside looking at the exact moment these objects flew over. I did not experience anything emotionally except amazement. At first I thought it might be some type of experimental plane but decided there would have to be three in order to appear as it did or the same one disappeared and reappeared within seconds almost at the same spot and then fly off. All three objects just disappeared out of sight. With the first object, I noticed something odd with the dark sky-like some type of optical illusion. It made me wonder if the object was indeed much bigger in size and perhaps transparent or cloaked making the sky around it appear fuzzy or warped."],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Date Submitted":"05/19/2012 02:31 UTC","Object Features":"Unknown","Date of the Event":"05/17/2012 10:04 UTC","Sighting Duration":"Undisclosed"}