{"City":"Swartz Creek","Object Features":"Unknown","Object Shape":"Disc, Square, Rectagular","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"05/19/2012 06:18 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving down Miller Road Westbound in Swartz Creek bringing my girlfriend back home from McDonald's. As we were leaving McDonald's we noticed several emergency vehicles driving by at a rather rapid rate of speed. When we got closer to her house we were rubber necking at the cops and EMTs to see what was going on. We drove past the house that they were at past the Rite Aid parking lot when I looked back at the road and there was a craft above the road. I noticed that it was close to the ground for an airplane or helicopter so I was joking around and said, \" Oh look a UFO\". That's when I noticed it had a weird shape for an airplane or helicopter it was shaped some what like a curved rectangle similar to a tel-per ware bowl. It had lights on the side of it with two columns of three yellow lights and then a third column with only the center light. It also had blinking orange light that appeared about every 5 seconds. At first I thought this couldn't be happening , I live by an airport and I see airplanes and helicopters come in all the time so that's what I initially thought it was until I saw how slow it was moving. I pulled over on the shoulder of the road, turned off the radio, and then rolled down my windows and me and my girlfriend heard no sounds. The craft was making no sounds and the usual night time sounds of frogs and crickets was silent as well. After we didn't hear anything we started to get very freaked out watching the craft move south to north. Then the craft stopped and was hovering somewhere off to the north of Miller Road. We were already pretty frightened at that point when it started moving in the eastward direction. After that a car was driving up behind us and I decided to drive away. As I drove away I could see the craft continue it's eastward journey as I turned one last time. We were both legitimately scared at that point and didn't want to see what else happened. I drove her back to her house as we went over what we had both seen. I was very scared driving back home and I didn't know what to do thinking I might see it again but by the time I got back to Miller Road it was already gone."],"files":["/var/www/straped/mufon/html2text/38244.html.txt","/var/www/straped/mufon/more/38244_submitter_file1__UFO.png","/var/www/straped/mufon/org/38244.html"],"trends":["There have been 10 other sightings in Swartz Creek","There were no other sightings in Swartz Creek on or around May 18th 2012","This sighting has been favorited 1 time.",""],"Source":"MUFON","Case Number":"38244","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.956966,+-83.846269(38244)&iwloc=A&hl=en\"> mufon case (38244) map </A>","Longitude":"-83.846269","Date of the Event":"05/18/2012 10:30 UTC","Tags":"City","Summary":"Disc/Rectangle Like UFO in Swartz Creek, MI","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Log Number":"US-05192012-0011","Latitude":"42.956966"}