{"Date Submitted":"05/19/2012 09:02 UTC","Tags":"City","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/38248.html.txt","/var/www/straped/mufon/org/38248.html"],"Weather Factors":"Unknown","Source":"MUFON","Longitude":"-75.29469","Country":"United States","Disposition":"Unresolved","Object Shape":"Cigar","Sighting Duration":"Undisclosed","Log Number":"US-05192012-0016","Viewing Distance":"21-100 Feet","Object Features":"Patterned Surface","Case Number":"38248","City":"Glenolden","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.894409,+-75.29469(38248)&iwloc=A&hl=en\"> mufon case (38248) map </A>","trends":["There have been 2 other sightings in Glenolden","There were no other sightings in Glenolden on or around April 15th 1973"],"Date of the Event":"04/15/1973 12:00 UTC","Summary":"The craft was a cigar shape brownist gray in color it was huge & made no sound","Latitude":"39.894409","divs":["sighting detailsthis a old sighting i remember from my childhood 04\\15\\73 glenolden pa. large brownish gray craft in the sky wittnessed by many it was on or about april 15th 1973 i remember because it was right before easter i was 10 yrs old at the time. i was traveling in the family station wagon with my mother and 12 year old sister. we were headed home from shopping traveling south on south ave in the small town of glenolden pa. as we approached the area of the macdade mall ( this is the same mall that was used in the to film the movie the lovely bones ) we could see the traffic was stopped up a head. then we noticed that people were out of their cars looking up at the sky.as we looked up there was a giant craft of some kind, i mean this thing was huge as big as the mall and the parking lot all put together. there were a few white lights on the center of the under side and the craft made no sound at all. it just seemed to hoover there in the sky.the craft was a cigar shape brownist gray in color. there were many witnesses to this event. we watched it for about five minutes then continued home. after arriving we called our local radio station to report what we had saw, they were receiving many reports of the same object in the sky.that night it was all over the local news. and by the next day it seemed, it was completley forgotten about and never mentioned again, there was no explanation ever given for what we saw in the sky that night. to this day my sister and i wonder what it was that we saw. the date of the incident is approximate."]}