{"Region":"Kentucky","Object Flight Path":"Stationary","Date Submitted":"05/19/2012 04:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.089809,+-84.68496(38242)&iwloc=A&hl=en\"> mufon case (38242) map </A>","divs":["Sighting DetailsDetailed Description of the UFO Event: My wife and I love to hike and look up at the sky.Almost every night for the pass three years when I am going to bed I will look out our back door and just enjoy the stars.I had read on the internet where Mercury or Mars was suppose to be getting to cross paths with Venus.The night was clear and the stars where out and almost as soon as I started looking up I noticed right away in the Western sky one White star like luminous object that seemed to be venting or sparking from the bottom(almost like a tail)and to the right of that was a Red Orb that looked like a red core with a pulsating ring around it(about a mile away. )I did not see a metal craft.I do live by the airport and I know it was not a plane.I know it was not a start because after 30 minutes they would have moved in the sky but these stood still.I went to wake my wife up and they where gone.The feeling I got was not one of dread but hay we are just watching you all and relax."],"Sighting Duration":"Undisclosed","Tags":"City","Case Number":"38242","Latitude":"39.089809","Object Features":"Unknown","Object Shape":"Sphere, Star-like","Weather Factors":"Unknown","Date of the Event":"02/20/2012 01:32 UTC","Longitude":"-84.68496","City":"Cincinnati","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38242.html.txt","/var/www/straped/mufon/org/38242.html"],"Source":"MUFON","Summary":"Two very bright lights in the sky .One was white a shined like a star but appeared to have a tail.The other red glowing orb with a pulse of red around it.","Log Number":"US-05192012-0010","trends":["There have been 5 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around February 20th 2012"],"Viewing Distance":"Over One Mile","Country":"United States"}