{"Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38259.html.txt","/var/www/straped/mufon/org/38259.html"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.5823,+-111.858182(38259)&iwloc=A&hl=en\"> mufon case (38259) map </A>","divs":["sighting detailsi was in my house, having just finished watching a tv show. my wife stepped out side to the front yard to smoke a ciggarette, when she comes in to have me see the light she noticed. icame outside to see a small, star-like light; orange in appearance over the mountain (little cottonwood). moving slightly faster than a plane would at that distance. i smelled what seemed to be wood burning, but saw no flickering of fire in the mountain. (some of us in the nieghborhood have fire-pits, so it may not be connected. i included it here for posterities sake.) the light was below the partial cloud cover, with no discernable outline.it flickered with a random pattern. i grabbed my phone to take video of it, but the object did not show up on my screen. (this would be from low resolution on my phone.) i used 7x50 binoculars to watch the object change course (a gradual curve from north-south to west.) where it then disappeared. 2-3 minutes later, the same (or very similar) object reappeared in the original place, travelling the same speed and course. at this point, i noticed a second object with a white glow from the origin point. i used my google sky app on my phone to ascertain it was a star (i forgot the star name.) we checked utah fire warch to see if there was a fire on one of the mountains in that direction, thinking it may have been a fire-plane partially obscured by smoke, but there wasn't.) my feelings\\reactions were curiosity, and i wanted to get as much detailed information as i could. i have been interested in ufology for over 20 years, so i had some basic idea of what info would be needed, and how to get it if possible. i feel this may have been a plane, but the lights did not flash, but rather flickered in a random pattern, also i have never seen planes with orange lights. i lost sight of the object when it stopped flickering. the outline could not be found through the binoculars either. both sightings ended the same way."],"Case Number":"38259","Summary":"Nocturnal Lights, Orange randomly flickering. Over Mountain, Smell of fire (wood), 1 or 2, disappeared.","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Date of the Event":"05/19/2012 09:35 UTC","Tags":"City","trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around May 19th 2012"],"Source":"MUFON","Region":"Utah","Log Number":"US-05202012-0003","Object Features":"Unknown","City":"Sandy","Latitude":"40.5823","Object Shape":"Star-like","Longitude":"-111.858182","Date Submitted":"05/20/2012 12:25 UTC"}