{"Latitude":"29.763313","Viewing Distance":"Unknown","Date Submitted":"09/05/2005 12:00 UTC","Summary":"3 crafts in V formation, red white and blue colored over Houston, TX","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3825.html.txt","/var/www/straped/mufon/org/3825.html"],"Object Shape":"Undisclosed","Case Number":"3825","divs":["Sighting DetailsI was hanging out with 3 of my friends (raoel, sammy & george) in George's frontyard, when I heard a very loud airplane approaching. I started to look up at the sunny clear blue sky to see where the plane was and a few seconds later, sure enough a regular plane (with a grey bottom with white letters that said A D) flew over the back to the front of the house at a very low altitude. The house is about fifteen minutes from Bush Intercontinental Airport, so the low flying plane wasn't unusual but the plane was flying a lot lower than average. Right after the plane flew over us, my eyes were still looking up at the sky, and I noticed what I thought was a \"brilliant white star\". Right away I told my friends to check it out, so now we all were looking at the sky. It seemed unusual because of how bright it was for the daytime. At this moment it was directly on top of us where the plane had flown over us, but this \"brilliant white star\" I would estimate was atleast double the cruising altitude of regular commercial airplanes. A second or two after telling my friends to lookup at the \"brilliant white star\" the \"brilliant white star,\" we realized was moving! Not only was it moving but after my eyes focused in I noticed two more crafts! Right then I asked everyone else if they saw the additional crafts, they acknowledge they saw them too. The \"briliant white craft\" was in the back of the V formation, to its left & front was a dimmer \"blue craft\" and to its right front was a \"red craft.\" All of us saw the \"brilliant white craft\" and \"red craft\" but the my last friend to look up (Sammy) never saw the \"blue craft.\" They seemed to be 1000's of feet apart in the sky so there is no way they could have been one craft. They were moving in a northeastern direction, and just seemed to glide through the air at a fast speed, if I were to estimate the speed, I would say it was 4 times faster than the speed regular planes travel through the sky when you watch them from the ground. The sighting lasted around ten seconds, and the crafts disappeared behind and over the right side of the house. I lost sight of the \"blue craft\" first and then the \"red craft.\" I could see the \"brilliant white craft\" until its view got blocked by the house. After the sighting, we quickly started to try to make sense of what we saw. We discussed many possibilities of what they were but having no working knowledge of aerial vehicles whether gov't, weather related or alien, we have no idea what we witnessed. All I know is that when I saw what I saw, I felt a great sense of awe, that's the only feeling that can describe what I felt at the moment of the sighting."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.763313,+-95.36007(3825)&iwloc=A&hl=en\"> mufon case (3825) map </A>","City":"Houston","Region":"Texas","Log Number":"US-09072005-0005","Longitude":"-95.36007","Object Features":"Undisclosed","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around September 5th 2005"],"Date of the Event":"09/05/2005 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","Disposition":"Unknown","Tags":"City"}