{"map":"<A HREF = \"http://maps.google.com/maps?q=43.604398,+-83.886315(38269)&iwloc=A&hl=en\"> mufon case (38269) map </A>","Region":"Michigan","Weather Factors":"Unknown","Latitude":"43.604398","City":"Bay City","Date Submitted":"05/20/2012 09:39 UTC","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Object Shape":"Square, Rectagular","Longitude":"-83.886315","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Bay City","There were no other sightings in Bay City on or around August 15th 2011"],"Date of the Event":"08/15/2011 12:00 UTC","Source":"MUFON","Log Number":"US-05202012-0013","Summary":"Rectangle grey metallic UFO w/red lights hovering in the clouds/fog over the mouth to the Saginaw Bay","files":["/var/www/straped/mufon/html2text/38269.html.txt","/var/www/straped/mufon/org/38269.html"],"Object Flight Path":"Stationary","divs":["sighting detailsit was approx the middle of august 2011. my family and i were on our boat going down the saginaw river heading towards the bay. it was extemely foggy out and also there were thick clouds in the sky. we reached the mouth of the bay and the fog started to clear out in the water but was still heavy on the shore. i was looking at the fog line when all of a sudden i saw something move in the fog\\clouds. it moved in and out of the fog\\clouds and appeared to be hovering but moving slighty back and forth. it was a dull metallic dark grey rectangle object. i could see what i thought to be red lights on it. we were approx. 500ft from the shore but i could see it plain as day peeking out of the fog\\cloud cover and then going back in. i watched it for as long as i could see it. i told my husband to look and he was busy driving the boat and either didn't hear me (our boat is loud) or just didn't look. i told my kids to look but they were young (then 5 and 6)and they didn't see it. (this was the 1st time i saw this object, the 2nd time - which i will post also - my daughter - then 7 yrs old did see it.) i didn't know what it was then and still don't know what it is now. i only decided to post my stories (the 2nd one to follow) after i read someone in ann arbor saw what i think to be the same thing in march of 2012. i believe in aliens and ufo's and was very excited to actually have seen what i saw. whether it really is aliens or just some \"weather balloon\" which it could be (you never know) i would love to find out."],"Case Number":"38269","Tags":"City"}