{"Disposition":"Unresolved","Log Number":"US-05202012-0012","Summary":"Large glowing object with tail decended over city.","Longitude":"-106.709169","Source":"MUFON","Region":"New Mexico","Viewing Distance":"Unknown","City":"Albuquerque","Latitude":"35.191005","Sighting Duration":"Undisclosed","Date Submitted":"05/20/2012 08:23 UTC","Object Shape":"Circle","Object Features":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Date of the Event":"05/20/2012 02:34 UTC","Case Number":"38268","map":"<A HREF = \"http://maps.google.com/maps?q=35.191005,+-106.709169(38268)&iwloc=A&hl=en\"> mufon case (38268) map </A>","files":["/var/www/straped/mufon/html2text/38268.html.txt","/var/www/straped/mufon/org/38268.html"],"Weather Factors":"Unknown","Country":"United States","divs":["sighting detailsat approximately 2:34 a.m., i left my home to go to the convenience store located at the corner of mcmahon blvd and unser. while driving on mcmahon (descending) toward unser at approximately 40 mph, i saw a bright object that appeared to be a meteor or other large object descending across the sky from my right to left, in what appeared to be a northeasterly direction. as i was descending from a higher elevation, i could see the entire city below, as well as the eastern skyline. the object appeared unusually large for a meteor, and it had two distinct colors (electric blue and white). trailing the object was what appeared to be a long white tail. i contacted local media and as of 6 a.m., they had not received additional reports. in all probability, the object was a meteor, small comet, or a large piece of space junk falling to earth. the object was definitely not an aircraft. the electric blue\\white colors of the object were reminiscent to the effect of a nuclear explosion on the night sky i witnessed as a child in the early 1950s. i was very surprised that there were no other reports filed as the object was quite large and anyone looking easterly over the city couldn't miss it. i am filing this report for the record and, hopefully, there is an official record of the object somewhere."],"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around May 20th 2012"]}