{"City":"Sarnia","Longitude":"-82.400199","Region":"Ontario","Latitude":"42.980459","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","trends":["There have been 16 other sightings in Sarnia","There were no other sightings in Sarnia on or around May 19th 2012"],"Object Flight Path":"Straight-line path","Source":"MUFON","Object Shape":"Circle, Fireball, Unknown","divs":["sighting detailstake a lay back at a skate park after a run. the sky was clear above where i live, sarnia. there were fireworks in the sky earlier in the evening, when i went out for my run. after about 5km i walked myself down to a calm and decided i deserved a little love and lay down a domed skate\\bike park cement hill. looking upward at a clear night sky. there wasn't much going on up there. a little surprised there were no planes that i could see. i was looking directly west upward laying on a slope about 45 degrees. i could half the sky in front of me. looking to my left (south) i saw what looked like two stars, i thought they moved for a second, so i referenced them against a local object and figured i would look back to see if they were moving. then something caught my eye, what i had thought was venus earlier, a orange star like light was moving across the sky from the south side of my view towards the north. i watched it for a few seconds figuring if it was a satellite or a plane. i have seen satellites before they are more dim, move a lot slower, and i have never seen an orange one. i then realized the light was moving across the sky extremely quickly. about a degree a second at what i would guess to be between 500ft - 1mi or higher. ( it faded from view a couple of times and returned to view in the same straight line path, not sure if there was some cloud way up there, but the stars were not obscured, in any obvious way. ) not sure about it's dimming and becoming more visible. i was more astonished at the speed. the direction was straight south to north, unwavering straight path. entire viewing was less than one minute. the time of the viewing is very close 10:46 est. after seeing it fade out, i was a little stunned, thought about reporting it, and then thought to check the time. it was 10:48pm, i estimate about two minutes after i saw it. it is likely that other people saw it, like me doing, some after fireworks star gazing."],"Weather Factors":"Unknown","Date Submitted":"05/20/2012 02:27 UTC","Country":"Canada","Date of the Event":"05/19/2012 10:46 UTC","Case Number":"38266","map":"<A HREF = \"http://maps.google.com/maps?q=42.980459,+-82.400199(38266)&iwloc=A&hl=en\"> mufon case (38266) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/38266.html.txt","/var/www/straped/mufon/org/38266.html"],"Sighting Duration":"00:00:41","Tags":"City","Disposition":"Unresolved","Summary":"Viewed small orange light, (thought was star / venus ), looked back it was moving south to north across sky. Very fast. Much faster than any airplane.","Log Number":"CA-05202012-0010"}