{"map":"<A HREF = \"http://maps.google.com/maps?q=43.602868,+-83.887055(38272)&iwloc=A&hl=en\"> mufon case (38272) map </A>","Case Number":"38272","Object Features":"Unknown","Region":"Michigan","Country":"United States","Disposition":"Unresolved","Date of the Event":"09/24/2011 12:00 UTC","trends":["There have been 7 other sightings in Bay City","There were no other sightings in Bay City on or around September 24th 2011"],"Object Shape":"Square, Rectagular","Longitude":"-83.887055","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Log Number":"US-05202012-0016","files":["/var/www/straped/mufon/html2text/38272.html.txt","/var/www/straped/mufon/org/38272.html"],"Latitude":"43.602868","Summary":"Dark grey rectangle object w/red lights witnessed in the clouds on a stormy day","Sighting Duration":"Undisclosed","City":"Bay City","Date Submitted":"05/20/2012 10:02 UTC","Tags":"City","divs":["Sighting DetailsThis is my 2nd sighting of the very same object I saw in Aug. of 2011. I was driving down I75 coming home from my nieces birthday party up north. It was myself and my 2 children (at that time ages 5 and 7) It was raining outside and thundering and lightning. I reached Bay City and was passing the RV store that is on the right of the highway (if you're going south on I75) when I saw the object. It was the same dull dark grey rectangle with red lights that I had seen previously. It seemed to be right overhead. I only saw it for a couple of seconds as I was driving on the busy highway and it was raining. It was so low I had to lower my head to look out and up thru my window to do a double take. It was just there in a cloud and then it went back in the cloud and I was too far ahead and could't look back. Had I not had my kids I would have pulled over right there on the highway and got out to look. I yelled at my kids to look that I was seeing the same thing I saw on the boat that day and my son was sitting on the far side of the car and couldn't see over, but my daughter saw it. She said she saw something grey with red lights. She says the lights were flashing but I never saw them flash. I was also traveling approx 75mph. I am very interested to know what these sightings are and hope anyone else who might have seen the same thing report it."],"Object Flight Path":"Stationary","Source":"MUFON"}