{"map":"<A HREF = \"http://maps.google.com/maps?q=43.17042,+-77.604012(3827)&iwloc=A&hl=en\"> mufon case (3827) map </A>","Date Submitted":"09/07/2005 11:13 UTC","Weather Factors":"None, Does Not Apply","Date of the Event":"09/07/2005 11:13 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy friend, Joanne Capo, and I were driving down Bailey Road (off W. Henrietta Road) when we were approaching a stop light at the corner of River Road. Because I was looking \"up\" for the light to change just to my left was a silver cigar-shaped object that appeared to be \"hovering\" above some trees, appox. 100 ft. above and to my left. It was below all the clouds. I told my friend to look to the left and she responded \"oh my God Barb, that's a UFO\". There was no traffic at that time so we slowed down to a stop and watched it hover for about 15 seconds - it would have made an excellent picture if I had brought a camera along. There appeared to be no lights (although it was daytime). It suddenly moved upward into the clouds and was gone. I had a unique sighting experience in 1969 with my father also. It was in the town of Churchville NY, west of Rochester. This one was more saucer-shaped and hovered just above the trees at Churchville Park.We watched it for a long time and even followed it westward until we were on a road that we did not recognize - it was about 60 miles from the park. My late father told me to never talk about it to anyone - so I didn't until recently. Also, in the year 2000, I was bothered by my right eye hurting as if something was lodged in it. I went to an eye doctor who told me there were two pieces of metal, identically shaped, that looked \"strategically\" placed on each side of my cornea. He asked me if I ever had eye surgery and I said, \"no, I sure haven't\". The doctor actually drew a diagram of my eye for me at the time. He sent me then (immediately) to an eye surgeon who removed these \"unusual\" pieces of metal from the sides of my cornea. He said \"those pieces of metal are identically shaped and placed and they just didn't blow into your eye\". I tried to locate the the doctor about 3 months later and his office was vacated. I don't remember the name of the actual surgeon he sent me to, but at that time I did a search for him (after thinking about the fact that he removed those pieces that I prob. should have been given) and came up with nothing - nowhere in the AMA or anywhere was he listed so I was out of luck. Thank you for listening; I am very tired of \"secrets\". We all know they're out there and it's time it was proven. I only hope I live long enough to experience the revelation. Thanks so much, Barb Nichols"],"files":["/var/www/straped/mufon/html2text/3827.html.txt","/var/www/straped/mufon/org/3827.html"],"Country":"United States","Region":"New York","Log Number":"US-09072005-0007","Object Flight Path":"Hovering then path","Object Features":"None","Case Number":"3827","Tags":"City","Disposition":"Insufficient Data","City":"Rochester","Longitude":"-77.604012","Summary":"My friend and I witnessed a \"pearly silver\" cigar-shaped UFO.","Source":"MUFON","trends":["There have been 53 other sightings in Rochester","There was one other sighting in Rochester on or around September 7th 2005"],"Latitude":"43.17042","Object Shape":"Bullet, Missile","Viewing Distance":"21-100 Feet"}