{"Tags":"City","Region":"Michigan","Object Flight Path":"Straight-line path,Path with directional change","Summary":"From 3:36 am till about 4:10 am witnessed 3 unidentified pulsating lights","Log Number":"US-05202012-0019","divs":["Sighting DetailsWas a late night of Netflix viewing and I decided I wanted to go outside and see if I might see anything. I had an overwhelming urge to do this earlier in the evening but the mosquitoes were much to obnoxious. Around 3:36 am I spotted the first one, very dim, pulsating to a brighter light, moving very slowly north to south. The light would dim out completely and I tried to anticipate where it might reappear. It did this about 3-4 times and then picked up a great deal of speed, faster than a plane, left no tail like a meteor and was gone. I was facing east at this time and it had been nearly overhead, I couldn't even begin to guess the altitude. So, this peeked my interest and I decided to stay out a bit longer. Facing west now, about 20 minutes later, I see a second light that seems to be lower in altitude and and pulsing in a similar fashion as the earlier one, heading North to South. I lost this one pretty quickly but was surprised to see a third light almost as soon as I lost the second, this one was also traveling North to south, pulsing but not going completely out. Also of note, if the second light was about 70 degrees from the horizon, then this third light was at about 80 degrees. As I said, I saw the third light almost as soon as I lost the second light, so they must have entered my line of sight at almost the same time, one slightly further back from the other. The third light did begin to arc slightly west and I finally lost it. I stayed out a bit longer, hoping for a better show, but got nothing. Well, that wraps it up. Happy hunting."],"Sighting Duration":"Undisclosed","Date Submitted":"05/20/2012 11:19 UTC","Longitude":"-85.613908","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.93613,+-85.613908(38275)&iwloc=A&hl=en\"> mufon case (38275) map </A>","Latitude":"42.93613","Weather Factors":"Unknown","Date of the Event":"05/20/2012 03:36 UTC","Country":"United States","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/38275.html.txt","/var/www/straped/mufon/org/38275.html"],"Disposition":"Unresolved","City":"Grand Rapids","Viewing Distance":"Unknown","trends":["There have been 45 other sightings in Grand Rapids","There was one other sighting in Grand Rapids on or around May 20th 2012"],"Case Number":"38275","Object Features":"Undisclosed"}