{"Longitude":"-121.992611","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/38288.html.txt","/var/www/straped/mufon/org/38288.html"],"Source":"MUFON","Log Number":"US-05202012-0032","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.826253,+-121.992611(38288)&iwloc=A&hl=en\"> mufon case (38288) map </A>","Summary":"Small bright sphere (think satellite) that zig zagged rapidly then faded...","Date of the Event":"05/19/2012 10:40 UTC","Object Features":"Unknown","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"38288","divs":["Sighting DetailsStepped outside to look up at stars. This is my ususal pre bedtime routine. Noticed small bright sphere, about the size of a satellite, zigzagging rapidly around the sky (think pinball)then moved quickly in straight line south east and faded from view. While processing that I observed a 2nd sphere, looked the same as the 1st, moved rapidly from northwest to southeast, in sort of an arc, no trail, faded from view. Few seconds later observed what I though initially was a satellite moving from east to west (with some relief I might add) but it moved too fast and again faded from view. I have observed many satellites and usually they have not moved across the sky as quickly and can be observed for quite some time. The ligt or glow never appeared to vary. I did look around the sky for airplanes to compare the lights against these spheres. There were at least 2 planes (pretty typical to see many planes as we are surrounded by airports), at much lower altitude with typical blinking lights. The 1st sphere I observed was what caused a feeling of mild alarm, heightened awareness and curiosity due to its very rapid and erratic pattern."],"Date Submitted":"05/20/2012 04:47 UTC","Object Flight Path":"Straight-line path,Path with directional change,Other","Country":"United States","Object Shape":"Circle, Sphere, Star-like","trends":["There have been 3 other sightings in Danville","There were no other sightings in Danville on or around May 19th 2012"],"City":"Danville","Tags":"City","Latitude":"37.826253"}