{"City":"Rose Lodge","Disposition":"Unresolved","Date Submitted":"05/20/2012 03:48 UTC","divs":["Sighting DetailsWhile in backyard smoking, witness saw three bright lights approaching from southeast. Witness is an aircraft enthusiast and recognizes aircraft lighting configurations. Initially, lights appeared to be possible landing lights on an aircraft, but as the lights drew closer, witness saw that there were actually three lights, and that they were glowing orbs not attached to a visible structured craft. As the lights drew even closer, they made a turn toward the east, and witness then saw that the rearward side of the bottom light was illuminated with red light, so that the bottom orb was half white and half red. Because of treetops obscuring view, witness could not determine if the turn was an abrupt, angular turn, or an arching turn, but no banking maneuver was observed during the turn. Altitude estimated at 1000 to 1500 feet. Lighted orbs were very close together, so witness could not discern any structure connecting or supporting the orbs, however they maintained the same relative position and proximity to one another during the observed flyover. Witness further stated that the following evening at approximately the same time, a 737 or similar aircraft approached and followed nearly the same path. This is unusual since the location is far from any major airports, and any large comercial aircraft would be flying over much higher than 2000 feet. Witness could not discern tail markings on the aircraft, but normal passenger jet windows appeared to be present with all the shades drawn. Witness was of the opinion that the jet was flying unusually slow and did not appear to have its wing flaps down, which would be expected at a relatively slow airspeed."],"Object Flight Path":"Path with directional change","trends":["There has been one other sighting in Rose Lodge","There were no other sightings in Rose Lodge on or around February 15th 2012"],"Date of the Event":"02/15/2012 06:00 UTC","Summary":"three glowing white orbs arranged in a verticle column approached, then turned","Region":"Oregon","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:01:00","Latitude":"45.004819","Case Number":"38286","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-05202012-0030","files":["/var/www/straped/mufon/html2text/38286.html.txt","/var/www/straped/mufon/org/38286.html"],"Country":"United States","Longitude":"-123.908043","map":"<A HREF = \"http://maps.google.com/maps?q=45.004819,+-123.908043(38286)&iwloc=A&hl=en\"> mufon case (38286) map </A>","Object Features":"Unknown"}