{"Date of the Event":"05/20/2012 01:00 UTC","Date Submitted":"05/20/2012 03:07 UTC","Weather Factors":"Unknown","Case Number":"38283","map":"<A HREF = \"http://maps.google.com/maps?q=39.030415,+-108.541438(38283)&iwloc=A&hl=en\"> mufon case (38283) map </A>","Country":"United States","Disposition":"Unresolved","Summary":"Lights above sky in Grand Junction Colorado May 20, 2012 in the A.M","Region":"Colorado","Object Features":"None","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"39.030415","files":["/var/www/straped/mufon/html2text/38283.html.txt","/var/www/straped/mufon/org/38283.html"],"trends":["There have been 24 other sightings in Grand Junction","There was one other sighting in Grand Junction on or around May 20th 2012"],"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Circle, Flash, Sphere, Star-like","Longitude":"-108.541438","Log Number":"US-05202012-0027","Tags":"City","City":"Grand Junction","divs":["Sighting DetailsThis all happened from 12 midnight to 4 A.M. outside in my back yard. Looking north toward the Bookcliff mountains a strange light brighter than any surrounding stars began to decend straight down in a slow movement. When out of sight I began to look around in the sky for the object or any thing else. I saw a bright light pulse on in an area of the sky were there was no stars, very bright. It went out after about 2 to 3 seconds and then repeated this again. After going out the second time there was a fast streak of light from left to right in a very straight line. The streak was short and very fast. In this area is a very dull but noticable object. I had to focus on stars in the sky away from object to see the glimmer out of the corner of my eye. About 10 minutes later i see a huge what seemed to be a search light in the direction of this dull object. I could not tell wether it was being pointed at this object or from the object, but it went from one side of the sky to the other. Then I seen alot of other slow moving objects moving across the sky, change directions in the direction of the dull object, then dissappear. I have seen shooting stars and what they move like, these were not natural. The movement was very uniform and intelligent. I've never seen shooting stars change direction and control speed. All the activity is in one portion of the sky around this dull object."]}