{"Object Features":"None","Log Number":"US-05202012-0025","Summary":"Five glowing orbs","files":["/var/www/straped/mufon/html2text/38281.html.txt","/var/www/straped/mufon/org/38281.html"],"Country":"United States","Longitude":"-122.668177","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 158 other sightings in Portland","There were 4 other sightings in Portland on or around May 19th 2012"],"Region":"Oregon","Date of the Event":"05/19/2012 10:30 UTC","Disposition":"Unresolved","Latitude":"45.528152","map":"<A HREF = \"http://maps.google.com/maps?q=45.528152,+-122.668177(38281)&iwloc=A&hl=en\"> mufon case (38281) map </A>","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","divs":["Sighting DetailsI saw a group of five UFOs last night. They were like nothing else I've ever seen. Strange yellow-orange glowing orbs. I was standing in my backyard about 10:30 p.m. near 71st and Glisan in Portland. When I saw the first one, it caught my eye because it was moving slowly from the west towards me. And I thought that's a weird helicopter. But there was no sound. It meandered north, then suddenly picked up speed and disappeared. Then from the southwest, two more flying slowly one behind the other. The first one suddenly rose up and stopped, and the other one came up to it. Then they slowly followed the same path as the first one. Then two more, doing pretty much the same. They were not planes ... planes don't stop in mid-air. And not helicopters because they can't go as fast as these did when they accelerated. They had no flashing lights like normal aircraft. And there was no noise at all. Even with a high-up plane you can hear something. And these weren't even that high up, probably 5,000 feet. I couldn't see any shapes, just a glowing lights. Someone else reported seeing this from the nearby Fred Meyers parking lot last night."],"Object Shape":"Oval","City":"Portland","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"05/20/2012 03:02 UTC","Case Number":"38281"}