{"trends":["There have been 158 other sightings in Portland","There were 4 other sightings in Portland on or around May 19th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Case Number":"38291","Weather Factors":"Unknown","City":"Portland","Region":"Oregon","Summary":"Series of 6-8 orange glowing lights coming from the south and gently turning east","Country":"United States","Source":"MUFON","Log Number":"US-05202012-0035","Date Submitted":"05/20/2012 07:16 UTC","Object Features":"None","Object Flight Path":"Path with directional change","Object Shape":"Circle, Sphere, Unknown","Tags":"City","divs":["Sighting DetailsMy In-laws were visiting our house (near SE 60th and Foster in Portland), and we had just come inside the house about 8:30 PM on March 19th 2012. My father-in-law called us back outside to show us a glowing orange light coming noiselessly from the south. the object appeared vaguely orb-shaped, or at least the glowing orange light did. The light did not blink like an airplane. It possibly pulsated somewhat, but that may have been the effect of the atmosphere. It curved gently to the east before it got overhead, and as it did, the light went out, and we saw a dark shape against the still-light sky. We couldn't really identify what the shape looked like. Then another orange light came from the same direction he first had, and followed the same path. We saw between 6 and 8 of these objects do the exact same thing. Sometimes two or three were within view at the same time, but all along the same path. They seemed to move about the speed of an ultralight - on the slower side. But they were close enough that we should have heard them if they were planes or ultralights. No sound. I looked at the objects with a spotting scope, but couldn't see any more detail in the shape. Just glowing, circular light, then a dark shape against the sky. Five of us witnessed the phenomenon."],"Longitude":"-122.601766","Latitude":"45.493317","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=45.493317,+-122.601766(38291)&iwloc=A&hl=en\"> mufon case (38291) map </A>","Date of the Event":"05/19/2012 08:30 UTC","files":["/var/www/straped/mufon/html2text/38291.html.txt","/var/www/straped/mufon/org/38291.html"]}