{"Latitude":"42.708844","Date Submitted":"05/20/2012 09:14 UTC","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy husband and I where out on our deck in the back yard around 11:30 May 19 2012 in Lansing MI when I noticed a very bright orange circular light appear over the trees on the other street. I noticed right away that this light was moving kind of quick for a plane or helicopter and did not appear to have any flashing lights like on the wings of a plane or the bottom of a helicopter. Both my husband and I got up and went into the yard to get a better view. As the light got closer over head we noticed it wasn't making a sound. The object came from the south and was moving north at a good pace. It was flying at about the height that a police chopper would fly when looking for some one on the ground. My husband tried to get video on his phone but only managed to capture 8 seconds of darkness and our amazed voices unfortunately. The object was over our pine tree with in a matter of a minute or so, and my husband and I scrambled to the deck to see it come over the other side. There was nothing there though. At the rate it was going before we lost it over the tree we should have been able to see it on the other side when we got to the deck but no dice. I have no idea what we saw last night, but I have never seen any thing like it before. I never thought I would witness any thing abnormal in the sky, but there it was. Hubby and I are both skeptics, but now we're both more open to the idea of UFO's. Only wish we could have gotten proof."],"Date of the Event":"05/19/2012 11:30 UTC","Tags":"City","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around May 19th 2012"],"Country":"United States","Log Number":"US-05202012-0039","files":["/var/www/straped/mufon/html2text/38295.html.txt","/var/www/straped/mufon/org/38295.html"],"Region":"Michigan","Source":"MUFON","Summary":"Orange light over Lansing","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-84.536436","City":"Lansing","Weather Factors":"Unknown","Case Number":"38295","Object Shape":"Sphere","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.708844,+-84.536436(38295)&iwloc=A&hl=en\"> mufon case (38295) map </A>","Object Features":"None"}