{"Disposition":"Unresolved","Summary":"orange orbs over brooklyn rooftop","files":["/var/www/straped/mufon/html2text/38292.html.txt","/var/www/straped/mufon/org/38292.html"],"Longitude":"-73.901532","Object Shape":"Other, Unknown","trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around May 20th 2012"],"Sighting Duration":"Undisclosed","City":"New York","divs":["sighting detailsbrooklyn rooftop... a bunch of us noticed 2 orange lights moving fast in the sky... linear.... lights moved but not closer together (as if it was on a single object). 3rd light appeared with the 2, then all disappeared. 5 mins later, 2 more orange lights one on top of the other, moving in a waving type movement...but always one on top of the other. disappeared in same area as previous one. 5 mins later...another set of the double moving lights. color was orange\\yellow.... very noticeable in the sky. seemed a lot lower closer to the ground than stars appear to be. no airplanes in the sky at the time. (around 1am or so may 19th into may 20th). 25+ witnesses on the roof at the time looking at the lights. after first sighting, was very curious... contimplated if it could be an aircraft. (there were no headlights or anything & it disappeared into nowhere!). when we noticed the 2nd set of lights.... we were in awe. the 3rd set was identical to the 2nd. almost as if the 2nd and 3rd set of lights were following the first steady (and larger in size as far as distance between the lights) set of lights. later read on the internet that similiar sightings of these orange lights\\orbs were seen in other areas! not sure if anyone snapped photos or video...being that it was an event"],"Tags":"City","Date Submitted":"05/20/2012 08:18 UTC","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.675198,+-73.901532(38292)&iwloc=A&hl=en\"> mufon case (38292) map </A>","Object Flight Path":"Straight-line path,Path with directional change,Other","Object Features":"None","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Case Number":"38292","Latitude":"40.675198","Log Number":"US-05202012-0036","Viewing Distance":"Unknown","Date of the Event":"05/20/2012 01:15 UTC"}