{"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 29th 0001"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.65949,+-73.94077(3830)&iwloc=A&hl=en\"> mufon case (3830) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Path with directional change","Case Number":"3830","Source":"MUFON","Date of the Event":"08/31/0001 12:00 UTC","Object Features":"Other","Country":"United States","City":"New York","files":["/var/www/straped/mufon/html2text/3830.html.txt","/var/www/straped/mufon/org/3830.html"],"Log Number":"US-09092005-0001","Date Submitted":"08/31/0001 12:00 UTC","Region":"New York","Latitude":"40.65949","divs":["Sighting DetailsWas just arriving home from work(audio engineer)and looking up to check seeing conditions(amateur astronomer)when object described emerged over church building across the street from my apartment. It flew slowly, almost majestically, as though it was on a track, curving over my apartment building(223 13th St.), continuing its 180 degree curve till it straightened out over 4th Avenue, the nearest intersection. I walked down 13th St. to 4th Ave. to keep it in sight, and watched it fly straight south on 4th Ave for a long way until it curved again out of sight over intervening buildings. As it flew away I could see it was quite thin compared to width and length. This happened in early evening and there was enough light for object to be sharply silhouetted. Could not see any markings or exhaust. There was also no sound. There were two crosswise narrow bands of pulsating orange light on the underside, fore and aft. This thing struck me as very unusual from the first instant I saw it. I tried to attract attention of bystanders but this is difficult in New York City. There was no time to get a camera."],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-73.94077","Disposition":"Unknown","Object Shape":"Square, Rectagular","Weather Factors":"Unknown","Summary":"dark rectangle approx 30X7X1,w/2 pulsating orange light bands underside; no sound or exhaust; flew curving track; 50-500 feet long?"}