{"Object Features":"None","Log Number":"US-05202012-0056","Object Shape":"Circle, Sphere","Region":"Georgia","Tags":"City","Date of the Event":"05/19/2012 12:00 UTC","trends":["There have been 2 other sightings in Grayson","There were no other sightings in Grayson on or around May 19th 2012"],"Source":"MUFON","Disposition":"Unresolved","Date Submitted":"05/20/2012 11:02 UTC","files":["/var/www/straped/mufon/html2text/38312.html.txt","/var/www/straped/mufon/org/38312.html"],"Summary":"5 witnesses saw 9 deep orange pulsating in straight path shoot upward at speed of light","map":"<A HREF = \"http://maps.google.com/maps?q=33.924194,+-83.952551(38312)&iwloc=A&hl=en\"> mufon case (38312) map </A>","Object Flight Path":"Path with directional change","Case Number":"38312","divs":["Sighting DetailsI walked outside my house on back deck around 2100 on May 19, 2012. I looked up toward tree tops and noticed a very large deep orange pulsating ball of light that appeared to be moving slowly at first, then shoot upward and disappear in 2-3 seconds. My view of the object was never obscured. As I excitedly called out to my family to come see, another approached in the exact same path coming from the north toward southeast. The view was from approx 4 miles away to over my area in 5 seconds to shoot upward in a 45 degree angle completely out of sight in 2-3 seconds. A total of 9 objects about the size of a football field were observed by 5 adults in my household. No sound, no emissions, just very bright pulsating lights. My husband said he could see that each object had 3-tiered lights that surrounded each. The night was quiet, no dogs barking, no other planes or helicopters were seen during sightings. After the last one was gone, regular airplane traffic was seen in the far distance. Everyone in my house was excited, in awe, not afraid, just currious as to what we had just witnessed."],"Sighting Duration":"Undisclosed","Longitude":"-83.952551","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","City":"Grayson","Latitude":"33.924194","Country":"United States"}