{"Object Shape":"Other, Unknown","Disposition":"Unresolved","Country":"United States","Summary":"Was watching Solar Eclipse. UFO came into view from behind me flying westward toward the sun","City":"Glendale","divs":["Sighting DetailsWas outside with my wife observing the Solar eclipse. We were taking turns using sun glasses to look at the sun. When from the corner of my eye i noticed something in the sky. At first i thought it might be a bunch of foil balloons someone had let loose. but upon second look i realized it wasnt moving up or with the direction of the wind it was at a steady pace keeping the same altitude moving in a straight path toward the sun(WEST). The object at first glance looked literally like a bunch of foil balloons. One in the middle straight up and down and four of them around it. thighly grouped together. the object was spinning very slowly clockwise and was moving forward only at about 100 mph. it did not move up or down or any other way besides the slow rotation. It moved forward until it was out of sight. My wife was freaking out while i was trying to take a picture of it with her phone but was unable to do so as her phone was having some weird malfunction which i had to power it off and back on to correct. I finally lost sight of the object as it headed in the same direction until the sun was making it difficult to view."],"files":["/var/www/straped/mufon/html2text/38311.html.txt","/var/www/straped/mufon/more/38311_submitter_file1__2012052019.53.31.jpg","/var/www/straped/mufon/org/38311.html"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-05202012-0055","Latitude":"34.166016","Case Number":"38311","Object Features":"Dome","trends":["There have been 13 other sightings in Glendale","There were no other sightings in Glendale on or around May 20th 2012","This sighting has never been favorited.",""],"Date Submitted":"05/20/2012 10:56 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","Date of the Event":"05/20/2012 06:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.166016,+-118.284917(38311)&iwloc=A&hl=en\"> mufon case (38311) map </A>","Longitude":"-118.284917","Weather Factors":"Unknown","Sighting Duration":"00:01:00","Region":"California","Tags":"City"}