{"trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around May 19th 2012","This sighting has never been favorited.",""],"Sighting Duration":"05:45:00","Longitude":"-83.042622","Summary":"Never saw it with my eyes, however when Ioaded the picture on my computer I blew it up to see if I could see the planes in the picture and there it was.","divs":["Sighting DetailsTaking pictures in Detroit for a class on composure of pictures. I blew up the picture when I got home there it was. Don't kwow what to think. My camera is a Sony A55. This object is not a dirty lens blew up all pictures for the day and one on a clear blue sky on Sunday morning and nothing like this appears in any other photo. when you look at the main picture you probably will not see anything at all. Perhaps you will see a small dust speak in between the building. The speak is directly below the left contrail in the picture. Upon blowing up the picture it is apparent that there is something there. Maybe it nothing but a childs balloon, however on close inspection changing colors contrast ect. it does appear to glow top and bottom and seems to have an effect on the air around it. Just thought it interesting."],"files":["/var/www/straped/mufon/html2text/38314.html.txt","/var/www/straped/mufon/more/38314_submitter_file1__DSC00185.JPG","/var/www/straped/mufon/more/38314_submitter_file2__DSC001851cr0p12.JPG","/var/www/straped/mufon/more/38314_submitter_file3__DSC001851cr0p.JPG","/var/www/straped/mufon/org/38314.html"],"Case Number":"38314","map":"<A HREF = \"http://maps.google.com/maps?q=42.33489,+-83.042622(38314)&iwloc=A&hl=en\"> mufon case (38314) map </A>","Weather Factors":"Unknown","Date Submitted":"05/20/2012 11:20 UTC","Disposition":"Unresolved","Country":"United States","Region":"Michigan","Latitude":"42.33489","Date of the Event":"05/19/2012 05:19 UTC","Log Number":"US-05202012-0058","Tags":"City","Object Flight Path":"Unknown","Object Features":"Unknown","Object Shape":"Circle, Disc","City":"Detroit","Source":"MUFON","Viewing Distance":"Unknown"}