{"map":"<A HREF = \"http://maps.google.com/maps?q=27.97753,+-82.827085(38329)&iwloc=A&hl=en\"> mufon case (38329) map </A>","trends":["There have been 31 other sightings in Clearwater","There was one other sighting in Clearwater on or around May 20th 2012"],"Log Number":"US-05212012-0014","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting Details3 friends and I were sitting on Clearwater beach,when I looked up and saw what appeared to be a glowing disk shaped object. It was glowing orange,but put off no other light. Almost like fire that didn't produce light. It looked as if it was going to crash into the ocean,because it kept hovering closer and closer,than would stop and stay in place. After watching it for 3 minutes,it began moving to the right like a airplane,but there were NO lights,NO wings etc and was still glowing orange. We then began to film it,and it began moving in a wobble like a helicopter, and was we were watching it,red lights appeared on the bottom,it broke into 2 separate objects, that appeared to be airplanes and went their separate ways. My first reaction of seeing it looked as if something were crashing into the ocean,I was frightened,but then as I watch it,I couldnt figure out what it was so I stood in place until I grasped the reality of what I was watching.I couldnt take my eyes off of it. It didnt take my eyes off of it until it broke in two and obtained an \"airplane\" disguise."],"Region":"Florida","Longitude":"-82.827085","Latitude":"27.97753","Object Shape":"Fireball, Oval","Source":"MUFON","Date of the Event":"05/20/2012 11:02 UTC","Sighting Duration":"00:15:10","City":"Clearwater","Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"Unknown","Country":"United States","Case Number":"38329","Summary":"3 friends and I saw a glowing object on clearwater beach,observed for 15 minutes.","files":["/var/www/straped/mufon/html2text/38329.html.txt","/var/www/straped/mufon/org/38329.html"],"Date Submitted":"05/21/2012 10:26 UTC","Tags":"City","Disposition":"Unresolved"}