{"Region":"Ohio","divs":["Sighting DetailsI was returning home to Chicago, from DC, on an Amtrak train, Capitol 29, that I've used many times. I was awake as the train pulled into the station at Cleveland, Ohio. It was early Sunday morning, May 20th, about 2:30 AM when the train stopped. I looked out the window only to see a number of UFOS, seen as white orbs, as many as 8 at one time. The sky was clear with no clouds. They were circling around a skyscraper, near the top which ended with a pyramid type tower and a spire. I was totally lucid, wondering what they were as they encircled the spire, moving in different directions, blinking out, then re-appearing. They changed directions, almost as if they were drawing from the energy from a pulsating light on the top. At first, it looked like swarms of insects that would be attracted to light. Then, I thought it might be a flock of birds. On top of the spire was ball of light that they seemed to be \"playing\" with. As the train remained at the station for almost 30 minutes, I watched them for almost as long. It was almost as if they were enjoying the chance to make themselves known. They would move in a swarm, then back away with some disappearing. When I got home, I checked out UFO sightings in Cleveland, and found that this is a common occurence that was brought to attention by a TV station a few years ago. It's the Key Building where I remember seeing a large lighted key as an insignia. It was way too high and distant for these orbs to be be insects, birds or other phenomena. I am a member of a MUFON group in Chicago, so I am very skeptical of these sightings, but this is something that remains a mystery for me. I looked at other skyscrapers in the vicinity, but saw nothing. It seems that this particular building has attracted them in the past. In my opinion, this was a UFO sighting. I took a picture with my cell phone which only showed the lighted tower in the distance."],"Case Number":"38326","Object Features":"None","files":["/var/www/straped/mufon/html2text/38326.html.txt","/var/www/straped/mufon/org/38326.html"],"Log Number":"US-05212012-0011","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","City":"Cleveland","Disposition":"Unresolved","Longitude":"-81.692039","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around May 20th 2012"],"Object Shape":"Other","Date Submitted":"05/21/2012 01:17 UTC","Tags":"City","Date of the Event":"05/20/2012 02:45 UTC","Country":"United States","Latitude":"41.502065","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.502065,+-81.692039(38326)&iwloc=A&hl=en\"> mufon case (38326) map </A>","Source":"MUFON","Summary":"UFOs over a building in Cleveland Ohio"}