{"files":["/var/www/straped/mufon/html2text/38338.html.txt","/var/www/straped/mufon/org/38338.html"],"City":"Maine","Object Features":"Dome","Case Number":"38338","Summary":"intense bright mesmerizing sphere.","map":"<A HREF = \"http://maps.google.com/maps?q=42.19777,+-76.053574(38338)&iwloc=A&hl=en\"> mufon case (38338) map </A>","Latitude":"42.19777","Object Shape":"Sphere","Source":"MUFON","divs":["Sighting DetailsMe and 2 other friends went camping on the coast of Maine , near the small town of cutler. we where camped out about 30 ft from a massive cliff over looking miles of nothing but miles and miles of ocean. There was nothing around us but woods and oceans. Around 7pm we saw something strange. It looked like a sphere of intense light maybe 3-5 miles out in the ocean. the light it was giving off was so intense we it cought our eyes from our camp spot in broad daylight it seemed almost like a spotlight. i myself passed it off as a boat or something as im kind of a skeptic to ufo's. About ten minutes later it disappeared. Later that night around 11:00 another light appeared in the distance. we first thought it was a boat but it seemed to keep coming closer and closer. once we realized it was at our level of elevation same level with the cliff edge we knew it was no way a boat. it was almost dome like and intensely bright and mesmerizing. mostly emitted a white light but there where variations of green,red and orange lights around it. it also emitted no sound it was completely silent. we ran back to the car (5 miles through dark woods) Once we started to leave we where followed by a strange black car just tailgated us for like 3 miles i dont know if this links to the lights but it was all very strange because we have camped here before and have never seen anybody near this area. its all just so odd i'm freaked out i don't know who to tell so i came here.."],"Date of the Event":"03/19/2012 11:17 UTC","Tags":"City","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Longitude":"-76.053574","Disposition":"Unresolved","trends":["There has been one other sighting in Maine","There were no other sightings in Maine on or around March 19th 2012"],"Log Number":"US-05212012-0023","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"05/21/2012 01:36 UTC","Region":"Maine"}