{"Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/3833.html.txt","/var/www/straped/mufon/org/3833.html"],"Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-09102005-0002","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around July 14th 1984"],"Summary":"spotted black object rising up from the west.","Object Shape":"Disc","Case Number":"3833","Latitude":"39.108048","Date Submitted":"07/14/1984 05:15 UTC","Disposition":"Insufficient Data","City":"Cincinnati","Date of the Event":"07/14/1984 05:15 UTC","Region":"Ohio","Source":"MUFON","Object Flight Path":"Straight-line path","Longitude":"-84.50518","map":"<A HREF = \"http://maps.google.com/maps?q=39.108048,+-84.50518(3833)&iwloc=A&hl=en\"> mufon case (3833) map </A>","Tags":"City","divs":["Sighting DetailsShortly after a thunder storm I went outside to the dock area to work. I happened to look west and saw what appeared to be a black ballon rising stright up from the ground. I could not tell how far away it was but guessed a quarter mile at most. As I worked putting labels on some drums I would keep looking at it to see where it was going. It was heading due east toward me. After several minutes I stopped working and just watch it. When it got closer I noticed that unlike a ballon there was no air inlet that I could see and it was perfectly round and the color was unusal as it looked blackest and dull gray. I had read that aliens use esp to transmit thoughts and I had made up my mind if I ever had the opportunity I would try that. As the object got overhead I stared at it and thought this ' If this is a ufo show me a sign \" At the exact time I thought this it turned over and it was really shaped like an old straw hat. Flat on the top with a thin body. I watched the object until it went over the building I was working next to and I couldn't see it anymore. I ran thru the building which was about 150 feet to the other dock door and then outside but could not locate it anywhere. This object had to be on edge when I first saw it and had to be slowly turning as it appeared round all the while I was watching it until it made that final turn when I could tell the real shape. I had a strange feeling that someone was watching during this whole encounter."],"Object Features":"None"}