{"Object Features":"None","Sighting Duration":"00:04:00","Region":"Istanbul","files":["/var/www/straped/mufon/html2text/38340.html.txt","/var/www/straped/mufon/more/38340_submitter_file1__485814174071416055250100003571794867237033366242525n.png","/var/www/straped/mufon/org/38340.html"],"Summary":"Star-like object, pulsating randomly just like a star, but shining yellow like a flame, not blue-white like a star","divs":["sighting detailsi was in my room on facebook. i live in the top floor, my house is on a hill. i always got up and look from my window, so i noticed it at the moment i looked outside of my window. as soon as i saw it, i called my roommate to check it out, he came and we watched it for several minutes. it was standing still in the air, then started moving to south-southeast direction very very slowly, not ascended, not descended, just a straight line, then i lost it when it went behind the skyscaper (that is only a half a mile away from where i stand) immediately i wrote it down on sirius ufo page in facebook and got response from another guy that saw it from bayramoglu\\darica area (that is 25 miles away in south-southeast direction from where i stand) he told me that it was just like how i described. then i opened google map, and put a pin point to where my home was, then aimed to the skyscraper, and draw an approximate directional map on google maps, tried to find out where it can be according to my view angle."],"Longitude":"28.9867","Weather Factors":"Unknown","Date of the Event":"05/16/2012 10:45 UTC","Log Number":"TR-05212012-0025","Country":"Turkey","trends":["There have been 4 other sightings in Istanbul","There were no other sightings in Istanbul on or around May 16th 2012","This sighting has never been favorited.",""],"Object Shape":"Fireball, Sphere, Star-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.00697,+28.9867(38340)&iwloc=A&hl=en\"> mufon case (38340) map </A>","Date Submitted":"05/21/2012 02:56 UTC","City":"Istanbul","Case Number":"38340","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Latitude":"41.00697","Tags":"City"}