{"Object Features":"Unknown","Date Submitted":"05/21/2012 07:37 UTC","Source":"MUFON","Tags":"City","trends":["There have been 5 other sightings in Perris","There were no other sightings in Perris on or around May 20th 2012"],"Date of the Event":"05/20/2012 04:45 UTC","Object Shape":"Sphere","Log Number":"US-05212012-0030","Weather Factors":"Unknown","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.891403,+-117.250736(38345)&iwloc=A&hl=en\"> mufon case (38345) map </A>","Summary":"Thunderbird performance at March AFB witnessed unknown fleet of black objects at extreme altitude.","Latitude":"33.891403","Object Flight Path":"Straight-line path","Longitude":"-117.250736","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Sighting Duration":"00:00:10","Country":"United States","Case Number":"38345","files":["/var/www/straped/mufon/html2text/38345.html.txt","/var/www/straped/mufon/org/38345.html"],"divs":["Sighting DetailsThere was an annual Air Show at March AFB last weekend. My wife, my son, and I hurried to catch the closing performance of the THUNDERBIRDS around 4:15p.m. on Sunday May 20th. The show was due to end at 5:00 p.m. We intended to see what we could from a distance as not to become involved with an after-show traffic jam at the base. About 4:20 p.m. we exited the north bound 215 freeway at Ramona Expressway and pulled onto a closed road, which led into an open field, to observe from a distance. The THUNDERBIRDS were in action. Six of them. They would fly in formation then break off from each other and perform spectacular flying maneuvers. We stood aside our car and watched, as other cars and observers continued to join in, and park around us, to watch. We were mesmerized and awe struck as time and time again the jets would fly over head, and around us, as the pilots re-aligned with each other for their next trick. At one point 4 jets came at each other from the 4 points of the compass- then went vertical together- and once again headed back out towards the 4 points of the compass... their contrails were visible... and at great altitude they were. I would have to say well above 7,000 to 8,000 feet in altitude. And then I saw them. At an even greater altitude above them I saw a fleet of at least 14-16 black spherical objects flying in a staggered but steady formation together, flying slowly in an east by south east direction above them. I know what I saw. And I know how easy it is to lose sight of an aerial object in the bright blue sky. I am also familiar with dead skin cells floating atop the eyeball and causing visual distortion effects. Prior to this I had tried to observe with my sunglasses on. My vision was clearer with out them. The sun was to the west at this moment. I had no glare to fight as I observed what I saw with the naked eye. In my mind a fleet of black unidentified flying objects cruised slowly above the show, at extreme altitude, to make their presence known, as a show of force. I yelled out to my wife wife, and my son, if they saw what I saw but their eyes were elsewhere, and their response was that my eyes \"were playing tricks on me\"... I saw this distant, and distinct, black fleet around 4:45 p.m., above the Air Show, on Sunday May 20th 2012---- and I just want to know if anyone else saw it!? As the THUNDERBIRDS split into 4 different directions at high altitude, in the center, above them, higher up in the sky, I noticed this fleet. I can only say that the sighting lasted for maybe 10 seconds at the most-then they disappeared from view, and I could see them no longer. Did anyone else see what I saw that day? Did the Air Force or NORAD have them on radar? Observer Sun City, CA"],"City":"Perris"}