{"Source":"MUFON","Summary":"Flew above us and changed direction a few times.","Longitude":"-78.942933","Object Flight Path":"Path with directional change","Object Shape":"Sphere, Other","trends":["There have been 3 other sightings in Whitby","There were no other sightings in Whitby on or around May 19th 2012"],"Tags":"City","Latitude":"43.897545","files":["/var/www/straped/mufon/html2text/38342.html.txt","/var/www/straped/mufon/org/38342.html"],"Object Features":"Unknown","Country":"Canada","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"05/19/2012 11:30 UTC","Case Number":"38342","map":"<A HREF = \"http://maps.google.com/maps?q=43.897545,+-78.942933(38342)&iwloc=A&hl=en\"> mufon case (38342) map </A>","Region":"Ontario","divs":["Sighting DetailsI was standing in the backyard at night when I saw what appeared to be an eagle shaped object, that was glowing orange, flying north to South, above me. The object changed direction very quickly a few times. At that point I started calling my friends over. The first friend to show up asked what I wanted, I pointed to the object and said \"look\", we didn't know what we were looking At. The object did a few more acrobatics then flew out of sight. At this point a few more friends showed up, they asked what we were doing, as we proceeded to tell them, 2 Orbs, glowing the same orange colour appeared from the south where the eagle shape disappeared. The orbs were flying in an offset pattern and never broke that formation. The were vibrating a little and going south to North. When they vanished over the horizon, we all just looked at eachother not knowing what to think. About 15 seconds later, the orbs came back, going from North to South this time, their direction changed a few times and then they vanished over the horizon again. We all agree that we don't know what the objects were, none of us has ever seen anything like it before. The objects were close but too bright to make out any detail."],"Viewing Distance":"101-500 Feet","Log Number":"CA-05212012-0027","Sighting Duration":"Undisclosed","City":"Whitby","Date Submitted":"05/21/2012 03:45 UTC"}