{"Date of the Event":"05/20/2012 08:45 UTC","Viewing Distance":"20 Feet or Less","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around May 20th 2012"],"Case Number":"38346","Region":"Arizona","Date Submitted":"05/21/2012 09:39 UTC","divs":["sighting detailsi was driving on the 51 freeway north bound at aprox. 8:45pm after work when i noticed in the sky 3 orange lights and an outline of a triangle with a black mass. the lights were at point to point of a triangle. as i was driving i was looking up as i felt like i passed underneath it. i couldn't pull over off the freeway so i exited off northern. i looked and i didn't see it anymore. i called a friend that lived in paradise valley and he also didn't see anything from his house over squaw peak mountain. i gave up and second guess on what i saw until i drove on northern rd west bound and i saw more orange lights in the far distance hovering and make a past east over downtown phoenix. i pulled into a residental road and saw another person pulled over pointing at the lights. i pulled up next to him and got out of the car and we both watched these lights over phoenix move east bound. at first there were three orange lights but the witness said a moment ago there were 4 lights but one went out. we than saw another orange light go out and only two remaining for about 1 1\\2 until the final two orange lights both went out. they were not passing though a large object like a building or a mountain, they just turned off like a light switch and didn't reappear after that. final time of ending was 8:53 pm. please note that this was the same day of the solar eclipse."],"Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/38346.html.txt","/var/www/straped/mufon/org/38346.html"],"Object Features":"None","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-05212012-0031","Object Shape":"Triangle","Latitude":"33.454897","Disposition":"Unresolved","Summary":"Triangle form with black mass and 3 distinctive orange lights hovering over freeway and second sighting over Phoenix Downtown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.454897,+-112.067827(38346)&iwloc=A&hl=en\"> mufon case (38346) map </A>","Longitude":"-112.067827","City":"Phoenix","Tags":"City","Country":"United States"}