{"divs":["sighting detailsi hope this is the right place to post this sort of sighting as it is not a ufo in the sense that we know of it but is a phenomena that is not clearly identified or understood. after picking up my daughter at 9\\10\\2005, 11:12pm from work, we had arrived home at 11:15pm - 11:20pm. we proceeded to walk into the house but was startled by a faintly green haze (we live in a highly polluted light area surrounded by portland \\ beaverton \\ hillsboro) spanning from northwest to northeast. i suddenly called out my oldest daughter to come and see the awesome sight. so, there are 3 witnesses that viewed the phenomena. continuing with the \"light show\", it appeared to get brighter and then it dimmed and disappeared. it suddenly appeared again in the east as a spherical shape (like a fog haze but visually noticable) then dimming a disappearing. then about a minute later, appears again spanning nw to ne. the whole affair lasted 15-20 minutes and did not appear for at least 30 minutes before we gave up and went back into the house. note: the light is green. no other colors of the light spectrum appears. the phenomena as it appeared did not seem to be an 'aurora borealis' which is why i am reporting it here."],"Source":"MUFON","Region":"Oregon","Object Shape":"Sphere, Other","Tags":"City","trends":["There have been 23 other sightings in Beaverton","There were no other sightings in Beaverton on or around September 10th 2005"],"Case Number":"3834","Weather Factors":"None","Longitude":"-122.80371","Log Number":"US-09112005-0001","Latitude":"45.487062","map":"<A HREF = \"http://maps.google.com/maps?q=45.487062,+-122.80371(3834)&iwloc=A&hl=en\"> mufon case (3834) map </A>","Disposition":"IFO","Date Submitted":"09/10/2005 11:18 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Country":"United States","Summary":"Not a UFO, but Aurora Borealis? HAARP maybe?","Date of the Event":"09/10/2005 11:18 UTC","files":["/var/www/straped/mufon/html2text/3834.html.txt","/var/www/straped/mufon/org/3834.html"],"City":"Beaverton","Object Features":"Undisclosed","Object Flight Path":"Unknown"}