{"Case Number":"38344","Source":"MUFON","Summary":"Three orange and red orbs around 5 min. apart, Last one very fast, close and bright","City":"Port Dover","map":"<A HREF = \"http://maps.google.com/maps?q=42.786772,+-80.203006(38344)&iwloc=A&hl=en\"> mufon case (38344) map </A>","divs":["sighting detailsi have seen a few ufos before but i have never considered reporting any of them until now because this time was so crazy. there was five of us outside when we noticed a huge, glowing orange orb floating from behind the trees and it appeared quite close to us. we considered for a second that because it was the may 24 weekend it was probably something from a firework, but very quickly it was extremely clear it couldn't have been. it came from the north and continued slowly along a straight path, then turned smoothly and went west, the direction we were facing in, into the distance until it was out of sight. it was in our sight for a little over a minute. upon observing these ufos, i had tears rolling down my face and spotting a ufo had never emotionally overwhelmed me like that. it was a strange feeling that i felt was neccessary to include. about three or four minutes passed, and a second glowing orb comes from the exact same place but it was a bit closer, making it seem faster as well. it was orange and red, almost looking like a huge fireball. in the center of the orb however the ufo seemed to have a strange shape (almost like an hour glass\\two triangles. it continued along the same straight path and then turned and went southwest until it was out of sight. the last orb that we spotted was the closest and it was bright red. it appeared about three or four minutes later also and it this one was b very frightening. it had a wild glow to it that was extremely red, a bright mezmorizing red and then it began changing colours between yellow, orange, white, blue, violet and red. it was absolutely insane. it quickly continued along the same straight path headed directly south from the north like the others, and also like the others it turned but continued going northwest until it was past the clouds. they seemed to be below the clouds at first, and all three seemed to slowly go up after changing their paths. after the last one was out of sight, there was strange rumbling\\roaring\\nearly staticy noises that are very hard to explain. i felt scared for the rest of the night. there were no airplanes in the sky during the time of this spotting, but afterwards there were what appeared to be strange helicopters. (three or four with lights i had never seen before)."],"Object Features":"Unknown","Region":"Ontario","trends":["There have been 2 other sightings in Port Dover","There were no other sightings in Port Dover on or around May 20th 2012"],"Date of the Event":"05/20/2012 09:55 UTC","Date Submitted":"05/21/2012 05:32 UTC","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Country":"Canada","Latitude":"42.786772","files":["/var/www/straped/mufon/html2text/38344.html.txt","/var/www/straped/mufon/org/38344.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Fireball, Star-like","Weather Factors":"Unknown","Log Number":"CA-05212012-0029","Longitude":"-80.203006","Sighting Duration":"00:14:00","Tags":"City"}