{"Log Number":"US-05212012-0026","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Flight Path":"Path with directional change","Region":"Connecticut","Object Shape":"Fireball","Country":"United States","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.610981,+-73.081339(38341)&iwloc=A&hl=en\"> mufon case (38341) map </A>","divs":["Sighting DetailsAt about 9:10 p.m., I was sitting inside at the computer and looked out the window when I saw a reddish orange light that looked a bit unusual. I thought might be a plane and dismissed it as such. A few minutes later, I looked out again and saw two more of the same type of light traveling from about 75 degrees east and turned to continue north. Seconds later, behind it were two more, traveling in same direction in parallel lines and then merging together. I called someone to come and look at what I was seeing and we saw another two, then another, traveling behind in the same path. The latter objects appeared to be a little larger and moved a bit more rapidly, almost looking like a fireball. They did not continue in a straight line from east to west, but turned at about 7 degrees north and continued that route. There was no noise and no blinking lights. As I watched them come, one after the other, I kept saying \"oh, my goodness...\" I tried to take some photos, but was too panicked to do so. I have never ever seen anything like it, nor ever expected to see anything like it in my life."],"Date Submitted":"05/21/2012 03:37 UTC","files":["/var/www/straped/mufon/html2text/38341.html.txt","/var/www/straped/mufon/org/38341.html"],"Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"We witnessed 7 to 8 orange-red objects in flight, traveling from east and turning towards the north. They did not come all at once, but one after another, some two at a time.","Disposition":"Unresolved","Case Number":"38341","Date of the Event":"05/19/2012 09:25 UTC","Latitude":"41.610981","Longitude":"-73.081339","trends":[]}