{"Weather Factors":"Unknown","Viewing Distance":"Unknown","divs":["Sighting DetailsWhile out camping with our Boy Scout Troop in the Tinley Park area, we noticed a bright red light suddenly appear about 35-40 degrees above the horizon in the SW sky. The light was brighter than any star in the sky and was brilliant red like fireworks, not a dull red like Mars or Betelgeuse. I assumed it was an aircraft that I hadn't noticed approaching, but it remained stationary for more than 5 minutes. Some of the scouts thought it might be a flare because it was so brilliant. But it didn't move at all! It apppeared to flash brighter on occasion, but this might be due to the hazy conditions. The light then slowly moved to the southeast in relation to the backgound stars covering about 10-15 degrees of arc, then slowly moved to northwest after another 5 minutes or so, covering the same 10-15 degrees of arc. The red light then changed direction and moved more quickly to the north and straight overhead us. As the sky was hazy we lost it overhead (behind the clouds? or faded away?). We searched the skies overhead for the next hour or so but could not locate it again. What was this?!"],"Object Shape":"Star-like","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.573367,+-87.784494(3835)&iwloc=A&hl=en\"> mufon case (3835) map </A>","Country":"United States","Date of the Event":"09/11/2005 01:45 UTC","Region":"Illinois","Source":"MUFON","Date Submitted":"09/11/2005 01:45 UTC","Latitude":"41.573367","Object Features":"None","files":["/var/www/straped/mufon/html2text/3835.html.txt","/var/www/straped/mufon/org/3835.html"],"Log Number":"US-09112005-0002","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Disposition":"Unknown","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around September 11th 2005"],"Tags":"City","City":"Tinley Park","Case Number":"3835","Longitude":"-87.784494","Summary":"Brilliant red light appears and moves across sky"}