{"City":"Halifax","Latitude":"44.658121","Case Number":"38351","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Unknown","Region":"Nova Scotia","Source":"MUFON","Summary":"While driving, friends and I all saw a huge green light fall from the sky. We then stopped to observe many other strange things.","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.658121,+-63.568012(38351)&iwloc=A&hl=en\"> mufon case (38351) map </A>","Log Number":"CA-05212012-0036","Date Submitted":"05/21/2012 10:43 UTC","files":["/var/www/straped/mufon/html2text/38351.html.txt","/var/www/straped/mufon/org/38351.html"],"Sighting Duration":"Undisclosed","Object Shape":"Fireball, Oval","Viewing Distance":"Unknown","Date of the Event":"05/21/2012 04:00 UTC","Longitude":"-63.568012","divs":["Sighting Details While driving in Timberlea near Halifax, around 4:00 AM today (may 21st, 2012) me and 2 friends all were startled by an extremely bright green light in the sky. We saw a long green trail of light going downwards as if it were crashing, and then the light flickered as if it slowed down some and now looked like a green fireball. The light trail lingered for about a minute but the object itself was only seen for about 6 seconds. We continued driving to the home of a friend who was there, and excitedly discussing what that interesting spectacle could have been. We all felt uneasy, sort of creeped out. The two of us that werent driving stared out the windows at the sky the entire time hoping to see more of this green thing, but instead we noticed a large number of lights moving overhead. They were the same color as the stars, but there were over 5 of them clearly moving in sight at one time, and they were all going seemingly random directions. Some of them seemed to change direction at times. We thought for a moment that all these things could just be an oddly large number of airplanes going over, but after staring at them for longer, we could see that they were each only one light, withoud any blinking lights around them. They looked oval shaped. As we looked at them, some of them would become dramatically more bright for about 3 seconds, as though we were looking into a spotlight. It seemed to me like they were searching. By this point we were all extremely uneasy. The two friends i was with went inside to get food and a laptop incase something crazy happened where we may have been stuck somewhere on the way back to my house. As they were inside, i stayed in the car keeping watch on the sky, which was very abundant with stars. The oval shaped objects that seemed to be searching converged and then stopped moving. they seemed to be really high up, but quite close together at this point. Their lights then began to pulsate sequentially, which they did for at least 15 minutes, and they then ascended. Today through talking to other friends, i learned that 3 other buddies of mine happened to be out ridiculously early this morning too, and they also saw the brilliant green light fall from the sky. This isnt the first peculiar thing i've seen up there, so i decided i had to record the incident somewhere. Ever since the massive rotating pyramid i saw in the summer of 2010, i've have aliens and whatnot on the mind all the time. its getting to me i think"],"Country":"Canada","Weather Factors":"Unknown","trends":["There have been 22 other sightings in Halifax","There were no other sightings in Halifax on or around May 21st 2012"]}