{"trends":["There have been no other sightings in Stouffville","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","Date of the Event":"05/20/2012 08:36 UTC","Latitude":"43.971317","Object Features":"Unknown","Object Flight Path":"Path with directional change","Region":"Ontario","Log Number":"CA-05212012-0032","Tags":"City","Date Submitted":"05/21/2012 11:44 UTC","Weather Factors":"Unknown","Object Shape":"Circle, Sphere","Country":"Canada","Summary":"Awesome UFO Sighting May 20th 2012 North East of Toronto Ontario Canada","map":"<A HREF = \"http://maps.google.com/maps?q=43.971317,+-79.247026(38354)&iwloc=A&hl=en\"> mufon case (38354) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unresolved","City":"Stouffville","Longitude":"-79.247026","Case Number":"38354","divs":["Sighting DetailsOn May 22 2012 around 8:35pm five of us walked out of my house in Stouffville, Ontario, Canada (just NE of Toronto) It was around sunset - don't remember seeing the sun setting & think it was already below the horizon. The temperature was comfortable - probably at least 20 degrees Celsius. No wind. The West sky had a red-orange glow to it. The 5 of is witnessed what we feel was a UFO sighting. Two brilliant red round objects emerged from the North, flew towards us in unison, and then changed direction to the west. I first thought the sun was reflecting off the wings of an airplane, but did not see an airplane shape nor did I hear any airplane sounds. I started a process of elimination & felt strongly it was not an airplane, a helicopter, a comet, or a balloon. The five of us were trying to figure what this was, but only figured out what it was not. My wife wanted her glasses so she could get a clearer view so I RAN back inside the house, couldn't find her glasses and came out with a digital camera instead. I started filming at 8:36pm, but at that time there was a small penny sized white circle getting fainter - just like someone started to dim its light, and it disappeared. Two minutes later the 2 bright red lights appeared again in same place that I saw the 1st set of two - in the North. I was thinking that what I saw did an elliptical type track - from the north, headed south, turned towards the west, and then circled around to its original position. I also thought that as an alternative this 2nd set may be a completely new set of lights (and not the 1st). I started filming it at 8:38pm. The 2 objects appeared to take the same path as the 1st set of objects. I only saw bright red as the dominant colour. Did not really notice the green until a replay of the video, and the white only when it started to fade in the west. I wasn't sure if the objects were fading because they were getting further away or the lights were dimming. After the sighting we carried on walking, looking around and hoping to see more of what we saw. There were two other people in our neighbourhood who I asked if they saw that stuff in the sky. The acknowledged that they did & we spoke about ufo stories. In total, 6 adults & an 11 year old witnessed this event. The attached video, by the way, is in its original form except that I removed and smoothed out the background noise with software in order to make it sharper. Otherwise the video and the audio is unaltered."],"files":["/var/www/straped/mufon/html2text/38354.html.txt","/var/www/straped/mufon/org/38354.html"]}