{"divs":["Sighting DetailsI was trying to go to sleep, while looking outside my window to see what looked like a slow moving plane with some normal signature colors (red, blue, white, maybe green) were flashing from behind the 'plane' at first. I had my TV on at the same time, thinking it was just a close slow moving plane, I ignored it. But then noticed it stopped in place and started to hover down into the woods in my backyard slowly. I start freaking out and call up my girlfriend and tell her what I was seeing outside. She tries to calm me down as I woke her up from slumber. I then tell her to hold on and go up the stairs to ask my father to come down the stairs in order to see the craft. Making me look like an idiot, when he got downstairs it wasn't there. I have came to my own conclusions that it was a police car on another street slowly patrolling. But I feel like I remember something being in the sky coming down, but since the colors resembled that of a flashing police car I just tried to come to my own senses. My backyard is always full of deer and other animals resting and feeding off of trees. I found it to be a mildly frightening night, but as time has gone by I find it less so."],"Date of the Event":"02/12/2011 11:13 UTC","Disposition":"Unresolved","Tags":"City","trends":["There have been 2 other sightings in Bella Vista","There were no other sightings in Bella Vista on or around February 12th 2011"],"Region":"Arkansas","Source":"MUFON","Summary":"Flashing Disc Flying above backyard. Hovering, Landing in woods...","Case Number":"38353","Object Features":"None","Longitude":"-94.267124","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=36.486364,+-94.267124(38353)&iwloc=A&hl=en\"> mufon case (38353) map </A>","Latitude":"36.486364","Log Number":"US-05212012-0038","Country":"United States","Object Flight Path":"Path with directional change","Date Submitted":"05/21/2012 10:58 UTC","files":["/var/www/straped/mufon/html2text/38353.html.txt","/var/www/straped/mufon/org/38353.html"],"Viewing Distance":"21-100 Feet","City":"Bella Vista","Sighting Duration":"00:10:00","Weather Factors":"Unknown"}