{"Object Shape":"Star-like","Object Features":"Unknown","Country":"United States","City":"Sierra Vista","Case Number":"38350","Object Flight Path":"Path with directional change","Region":"Arizona","Summary":"Star-like UFOs that moved steadily then rapidly descended then ascended.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.54865,+-110.268816(38350)&iwloc=A&hl=en\"> mufon case (38350) map </A>","Log Number":"US-05212012-0035","Weather Factors":"Unknown","Date of the Event":"10/14/2011 03:41 UTC","Longitude":"-110.268816","trends":["There have been 11 other sightings in Sierra Vista","There was one other sighting in Sierra Vista on or around October 14th 2011"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Date Submitted":"05/21/2012 10:33 UTC","divs":["sighting detailsi was outside early morning chatting with my girlfriend, staring up at orion's belt. the night prior i had seen an oddity: a previously stationary star seemed to descend for a few second then fly away and to the sw. i though i was just really tired and discombobulated. however, that night,(i was also on he phone with my girlfriend) in the same place, the same previously stationary star\\object flew left making no sound and leaving no trail. it flew extremely close to my house. it made no noise whatsoever. it floated near my house and i considered running into my house and contacting the authorities. i was frozen and could not speak. my cell phone cut off right then. i stared at the object. however, it flew straight towards the east over the city park. there, another star seemed to fall. the objects were about 100 feet away from each other. as the second object descended, the first ascended. then, the 1st descended and the second ascended. i was entranced. this pattern repeated over and over for about 4 minutes. then, the two objects ascended together to about 200 feet above the ground. the first object ascended upwards at a speed that i could not fathom. thirty seconds later, the second object ascended at the same rate. afterwards, called my girlfriend and talked to her normally, saying the call was cut off, fearing she would think me crazy for telling her. i have always been too afraid to tell anyone, until now, fearing that people would could me stupid and crazy, but i know what i saw."],"Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38350.html.txt","/var/www/straped/mufon/org/38350.html"],"Latitude":"31.54865"}