{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38368.html.txt","/var/www/straped/mufon/org/38368.html"],"Longitude":"-118.424878","Latitude":"37.361221","Object Shape":"Sphere","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Object Features":"Patterned Surface","Object Flight Path":"Path with directional change","Summary":"It was spherical, and made up of a geometric assembly of bright red lights, each apparently identical and equally bright.","Case Number":"38368","map":"<A HREF = \"http://maps.google.com/maps?q=37.361221,+-118.424878(38368)&iwloc=A&hl=en\"> mufon case (38368) map </A>","Log Number":"US-05222012-0013","Date of the Event":"05/21/2012 09:40 UTC","trends":["There have been 3 other sightings in Bishop","There was one other sighting in Bishop on or around May 21st 2012"],"divs":["Sighting DetailsI have to share this. On my way home tonight about 9:30 PM, I was on the outskirts of the small town in which I work, heading home. Suddenly, through the trees to the north, my attention was drawn to a very bright red light. Since it was low, no more than a hundred yards off the ground, I was confused by what I was seeing. At first, I thought it was a light on top of some radio tower, but there isn't any such tower in the area. Then, I could see it was moving in my direction. It passed very slowly over the two-lane road on which I was driving, no more than two or three hundred feet in front and above me. I would estimate it's speed as no more than fifteen or twenty miles per hour. What had first appeared as a solid red light wasn't solid at all. I would estimate the size of the sphere as no more than ten or fifteen feet in diameter, about the size of a small car, and as it moved, it was quite clear that the lights were evenly spaced, geometrically around the sphere. Frankly, it looked like some kind of huge lighted Christmas ornament. And it was beautiful. I was transfixed. I pulled the car to the side of the road, and rolled down the window, which provided a clear and unmistakeable view of the sphere, which was no more than a hundred yards away. It was completely silent, seemingly floating in the air. It continued it's southward course, and as it passed by, I was struck by how evenly spaced the lights were all around the outside of the sphere. The red lights had a metallic quality, with a magenta tone. They were very bright, and I could make out each individual light. It was a ball of closely-spaced red lights. I watched the sphere as it continued slowly south for perhaps a half-mile, clearly silhouetted against the dark night sky. Then, it accelerated abruptly, and moved up so quickly that it disappeared in the darkness. There was nothing left to see but the stars. No, I wasn't drinking, or smoking anything. I have never witnessed anything like it. I am convinced that it wasn't any kind of aircraft; not an airplane, or a helicopter, or any kind of balloon. There was no wind, and absolutely no sound whatsoever."],"Region":"California","Date Submitted":"05/22/2012 04:44 UTC","Tags":"City","City":"Bishop","Source":"MUFON"}