{"Date of the Event":"05/10/1944 12:00 UTC","files":["/var/www/straped/mufon/html2text/38362.html.txt","/var/www/straped/mufon/org/38362.html"],"Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsApproximately in 1977, as I was watching TV Station KQED channel 9 located in San Francisco California. I observed that they was showing s documentary on UFO's filmed approximately in 1944 or 1945 on a United States Navy Ship at sea, of course in black and white film. Keep in mind that they showed this film on TV everyday for 7 days and I watched it every night for the whole 7 days. After the 7th day I was reading the local newspaper, which I believe was the San Francisco Cronicle, there was a article in the papers stating that the Government has raided KQED TV to obtain Top Secret Documents that the Channel was showing on TV. To make a long story short from what I understand they obtain the Documents (film) legally won the lawsuits, to obtain the film, starting showing the film on TV as many times as they could knowing that the Government will fight them in Court to obtain it back from them. Now what I observed was a Navy Ship out at sea shooting at these balls of light with there cannons the lights was flying in formation, when they was shot down, the ship would some how get them out of the ocean and then put them on stretchers, one of them had a slit, slice, cut across the stomach and it glowed in color on the black and white film which shocked me, the color was a green glow, exactly like those glow in the night green lights. They appeared to be in human form, approximately 4' 2\" tall, long fingers, big dark black slanted eyes, there color and skin reminded me of a green frog, that is the only animal that I could compare there color and skin to. Now while they are pulling them out of the water, I could see the space ship, flying saucer, craft floating in the ocean, it appeared Metallic, bright silver round shaped, have of it was in the water the other half was sticking out of the water, it looked almost like the picture that you have on your page, the animated one. It would be a honor to take a lie detector test on this one and if you don't believe do your research on the evidence that I have presented."],"Latitude":"36.783461","Source":"MUFON","Tags":"City","Object Shape":"Circle, Disc, Fireball, Oval, Star-like","Log Number":"US-05222012-0007","Object Features":"Undisclosed","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.783461,+-119.413152(38362)&iwloc=A&hl=en\"> mufon case (38362) map </A>","Country":"United States","Object Flight Path":"Undisclosed","Date Submitted":"05/22/2012 12:29 UTC","Disposition":"Unresolved","trends":[],"Weather Factors":"Unknown","Region":"California","Sighting Duration":"Undisclosed","Longitude":"-119.413152","Case Number":"38362","Summary":"Approximately In 1977 Channel 9 (KQED) In San Francisco, Show A Top Secret UFO Documentary, The Station Was Raided A Week Later By The Goverment, Published In Newspapers."}