{"divs":["Sighting DetailsI was driving in my car coming up 1st ave s. I was looking up at the clouds and I saw light reflecting off of somthing and assuming it was a plane I kept my on it. When it stopped reflecting the light It was not a plane but a small round white object. I pulled over to the side of the road to watch it. It was moving faster than a plane would and didnt have a stream behind it like the planes coming and going from the Boise airport do. Next another object as same as the other one passed under it going the other direction so I tried to watch both but my Daughter kept bugging me to get going. When I got home my Husband came out to help unload the car and I got out and tried to spot the one that was coming our way. It was really high up and just hovering in one spot. My Husband had a hard time spotting it but when he did also found it odd and we watched it just hover there for about three minuites.I tried blurring my eyes and when I did it looked to have more shape than a circle(like a ring around the bottem or middle)my eyes wouldnt hold the focas enough to tell for sure. My son wanted me to pick him up and when I got him up and looked back up it was gone. My Husband looked all around for to make sure it wasnt just a plane Headed for the airport but the object was just gone. There was a steady breeze and it was semi-cloudy. The object would be covered by my pinky if I held it up to the sky. It was bigger than a pin head but smaller than a penny. I was pleased to finally see somthing that was hard to explain and my husband who is a little sceptical was even impressed by the sighting. The sighting stuck with me all night and all day today so I decided to report it hoping maybe somebody else noticed them to."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/3836.html.txt","/var/www/straped/mufon/org/3836.html"],"trends":["There have been no other sightings in Payette","This sighting has never been favorited."],"Viewing Distance":"Unknown","Longitude":"-116.933771","Sighting Duration":"Undisclosed","Date of the Event":"Unknown","Weather Factors":"Unknown","Region":"Idaho","Case Number":"3836","Object Shape":"Saturn-like, Star-like","Latitude":"44.07822","Summary":"Small white, metal when light reflected off it.","Log Number":"US-09112005-0003","Object Flight Path":"Straight-line path,Path then hovering","Disposition":"Unknown","City":"Payette","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.07822,+-116.933771(3836)&iwloc=A&hl=en\"> mufon case (3836) map </A>","Date Submitted":"09/11/2005 07:31 UTC","Tags":"City","Country":"United States"}