{"Object Features":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"38379","Date of the Event":"05/18/2012 09:30 UTC","files":["/var/www/straped/mufon/html2text/38379.html.txt","/var/www/straped/mufon/org/38379.html"],"Viewing Distance":"Unknown","divs":["Sighting DetailsI was at work (Dover Downs Hotel & Casino) On my lunch break along with 2 other coworkers, sitting on the bench out back of the hotel. One of my coworkers said why do they only have 1 light on, on the track, the other coworker and myself looked, I said thats not a light from the track, the other coworker said it just a plane, the coworker who first saw it said thats not a plane its not moving, I said it the aliens coming to get us like I was joking did not want them to think I was crazy. we sat an starred at this large bright white light in the sky, I pulled out my phone to try to get a pic of it it came out fuzzy I tried to get video of it it came out as static. I could not make a phone call, they checked their phones, theirs were not working as well, our two way radios were not working as well. we watched it from when it appeared to when it disappeared for what seamed like 3 to 5 mins. It was like a large spot light that just shut off and it was gone, we did not see it again. The coworker who first saw it said where did it go, the one who said it was just a plane said it went behind the clouds, It did not it was just gone. The coworker who said is was just a plane went into the building, myself and the other coworker sat outside and talked saying you dont think im crazy right it was there you did see it, it was not a plane, she then started telling me about other experiences she has had. I also told her about experiences I have had. The next night myself and the coworker were sitting outside on break again when another coworker from another department came out and over heard our conversation and started telling us he has been working there for 15 years and within the past 3 months he has seen strange lights outside over the track."],"Weather Factors":"Unknown","Region":"Delaware","Tags":"City","Object Flight Path":"Stationary","Source":"MUFON","Latitude":"39.164908","Longitude":"-75.521048","Summary":"Very large white spot light","Disposition":"Unresolved","Date Submitted":"05/22/2012 01:22 UTC","trends":["There have been 7 other sightings in Dover","There were no other sightings in Dover on or around May 18th 2012"],"Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=39.164908,+-75.521048(38379)&iwloc=A&hl=en\"> mufon case (38379) map </A>","City":"Dover","Log Number":"US-05222012-0019"}