{"Date Submitted":"05/22/2012 12:50 UTC","Weather Factors":"Unknown","Region":"California","Source":"MUFON","divs":["Sighting DetailsMe and my brother were coming back from reno nevada at about 12:00am. We stopped to let our dog out to run on gold lake highway. we went up the road and turned around less then halfway up the hill so we could see a-15. As we started to look down hill we noticed a car parked below us.I thought it was a cop car following us. It was parked above the road we came there on but below us and we never noticed another road. As we began to watch it, it began to look as though it was trying to make a 3 point turn. Then it would shine its headlights at us then back away it did this several times. As it countinued to do this it started moving sideways and diagional very fast. it backed up and it looked as though it hit an invisable wall and the whole body of the car vanished leaving just the two headlights.The two headlights then began to chase each other. we watched this for about ten minites before one of the two lights flickerd and vanished leaving one light. The light that was left began to get brighter before shooting off leaving a tracer behind it. Then they came back. They started chaseing each other again before smashing into each other. when they collided they shot the smallest thin stream of red light into the air and one blue thin light into the ground. After that several red lights came down from where the first red light was shot. Then a large light came from where the first two lights were. as we countinued to watch it it began to move in large circles around the vally as if it were searching for something. We could see the outline of it because its light was so bright. I told my brother to flash it with his high beams in the truck to try and get its attention. He refused because he dident know what it was. I then took my lighter and flicked it twice at it. It turned at us very fast and took what we thought was a picture with a fast bright yellow flash then it just turned and went about what it was doing before. As we sat watching this thing and wondering what it was several hundred small objects in the sky began coming into view. As we watched these objects come from either end of the sky we noticed that they were flying in formation. each side had a large half circle formation. As these two formations got close to each other they broke off into smaller formations and started chasing the other group. They seemed as though they would rush up to them with great speed and then back away almost like a jellyfish moves through water. But if the other objects dident move they would shoot blue tear drop shapes at them. When these would hit it would implode the object into a red dust. As these were in the sky the large object with the light was still searching the ground. My brother waited for it to come into view and flashed it with his brights. The object turned on us and came at us so fast. as it came at us the object would vibrate violently and then burst forward and then move back a little bit. It did this until it was very close to us and we could make out some detail of it. It was a ship with a neck on it. on the neck was a light that turned and looked at things. as the neck would turn the body would turn with it as one. The metals it was made out of was something i have never seen before. As it was coming at us we got a feeling it was warning us to leave. it felt intimidating as though if we dident leave something was going to happen. The vibrations from it was not something you can hear you can feel it through your entire body. We panicked and drove out of there as fast as we could. As we made it back down to the main road we stopped on the side of the road to try and pull ourselves together. I told my brother that we had to go back to try and see what that thing was. reluctantly my brother agreed. We got back to where we saw it all at and it was still there circling the valley ahead of us. We sat and watched all the ships in the sky and the big one with the light in the valley all night long. Once morning started to come objects like shooting stars were falling out of the sky right to where the big thing was circling as though it was collecting the stuff falling out of the sky. as we were watching it collect stuff another one came up next to us atleast 20 feet away. it came over the trees and looked down the road all along the road and then it looked at us. Its light was so bright that it light up everything in front and behind us. It kept looking at us then it just turned its head and left. Confused and a little scared we dident want to leave again incase our headlights got its attention again. We watched them all night until the daylight started to come. As light came they just blended in and vanished with the day light. as we sat thinking about what we saw we heard ssomething behind us we looked and thought it was a bear. But as we got to looking it looked like a man with two large dogs. But he walked on all fours. We waited and watched and he would walk over to piles of brush and lean over keeping his legs straight he would dig. it would start ripping the brush up with its hands. We rolled down the window and yelled at it. As it heard our yell it stood up, looked at us, and just turned and walked away like a human. so we started the truck and turned around to find it but it was gone. Too many weird things happend that night to be just chance. a meteor shower, lightning storms and an eclipse."],"Country":"United States","City":"Graeagle","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface, Appendage(s)","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Log Number":"US-05222012-0015","Date of the Event":"05/19/2012 12:00 UTC","Case Number":"38375","trends":["There have been no other sightings in Graeagle","This sighting has been favorited 1 time."],"Tags":"City","Object Flight Path":"Other","Latitude":"39.741956","files":["/var/www/straped/mufon/html2text/38375.html.txt","/var/www/straped/mufon/org/38375.html"],"Longitude":"-120.636731","Object Shape":"Bullet, Missile, Fireball, Flash, Sphere, Star-like, Triangle, Unknown","Summary":"a long detailed show of atleast two hundred small ufos in sky and two big ships down low","map":"<A HREF = \"http://maps.google.com/maps?q=39.741956,+-120.636731(38375)&iwloc=A&hl=en\"> mufon case (38375) map </A>"}