{"divs":["Sighting DetailsMy girlfriend and I were on our deck last night looking at stars etc and all of a sudden we saw objects many miles away that were triangle shaped (3 lights) red, green, & white on each corner. 2 of them were moving fast together and stopping on a dime sort of in unison. They must of been further away (east of Rochester MN). 1 that seemed somewhat closer to us (North) stayed still. All 3 had the same lights and triangle shape. There were a lot of stars out last night but these stood out. It could not of been a star, comet, or plane. We do have the Rochester airport near by and we did see some planes too, but the planes looked like planes. We have never seen a plane go up and down and zig zag and completely stop and go again like this. After about 15 minutes of watching and following them ,they just zipped off and were gone. My girlfriend stood and watched this with her eyes. I tried using my camera but could not pick it up, too far away. We both saw this visually at times and it was easier for me to see in my binoculars. They were many miles away for sure. I am 43 & she is 36, we live in a average neighborhood etc and have never seen anything like it in our lifetime. It felt eerie - Scott & Michelle."],"Disposition":"Unresolved","Latitude":"44.045058","Object Features":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.045058,+-92.534802(38377)&iwloc=A&hl=en\"> mufon case (38377) map </A>","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Case Number":"38377","City":"Rochester","Summary":"Triangle shaped objects with 3 lights, red, green, and white.","Date of the Event":"05/21/2012 10:45 UTC","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-05222012-0017","Region":"Minnesota","Object Shape":"Triangle","Tags":"City","Source":"MUFON","Date Submitted":"05/22/2012 12:57 UTC","Longitude":"-92.534802","files":["/var/www/straped/mufon/html2text/38377.html.txt","/var/www/straped/mufon/org/38377.html"],"trends":["There have been 13 other sightings in Rochester","There were 2 other sightings in Rochester on or around May 21st 2012"]}