{"Region":"Oregon","Tags":"City","Date Submitted":"05/22/2012 03:43 UTC","Longitude":"-121.28451","Latitude":"44.301569","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/38380.html.txt","/var/www/straped/mufon/org/38380.html"],"Object Flight Path":"Stationary","divs":["Sighting DetailsDoing dishes at the kitchen window, I noticed two glowing lights behind our house but far enough away that I knew they were on BLM land and not on our property. They appeared to be about 20 apart and were very fixed and stationary and basically rectangular...sort of bluish white in color. It was approximately 9-9:30 pm. I called to my husband to come and take a look. Our first response was that someone must have set up a camp back there, but in the 10 years that weve lived here, its the first time weve seen campers back there....it would not be easily accessible but not impossible, So we thought that they must have hiked in there or MAYBE rode in on ATVs. We had our 3 grandkids staying with us and they could see the lights and were freaking out that it was a UFO. To calm them down since it was bedtime, I asked my husband to go out with a flashlight far enough to confirm that it was just some campers. He started walking toward the lights and when he got out about 100, he said he felt an INTENSE sensation on one side of his head....sort of like a zapping electrical feeling and he put his hand to it and the next thing he knew - he was on the ground. His first thought was, is this what it feels like when you are dying?? He wasnt hurt in any way which is sort of weird in itself since he is 76 yrs. old and falling hard to the ground should have somehow hurt youd think. He was stunned and staggered back to the house....he was worried that he wouldnt make it back so there was a traumatized effect on him and feeling like \"what the ?? happened\". The kids were really anxious so we had to down play the whole event while giving each other the wide-eyed look to communicate how crazy and wild it was to us too. I tried to distract them with the whole procedure of getting ready for bed, all the while wondering what to do and keeping an eye on my husband to see if he was still ok. I got them in bed and calmed down. All this while, the lights were still there glowing and I wanted to go out there myself to see what would happen and to assure myself that we werent seeing an anomoly of some sort. My husband said \"No way, youre not going out there\" so I had to temper my curiousity. He said in the morning we will go out and see what it is. So probably the last time we looked before going to sleep was around 11 pm.- they were still there and they hadnt moved. We got up in a.m. and had to get kids and selfs ready and off to church, but as soon as we returned around noon, we changed and went out to find evidence that someone had spent the night out there. We searched the area for a couple of hours all together that afternoon and found ZERO signs of anything having been back there!!! No foot prints or tire marks or tent impressions or anything. We live in the high desert so there is not much for ground cover....lots of juniper trees but just sand underneath and we could not find any disturbances of any kind. So now what are we to think?? And by the way, my husband has felt totally fine every since the incident and the sensation has not reoccurred so wed feel a bit awkward going to the doctor about it. I wish we could know what the heck we had seen."],"Log Number":"US-05222012-0020","trends":["There have been 4 other sightings in Redmond","There were no other sightings in Redmond on or around May 19th 2012"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"05/19/2012 12:00 UTC","Country":"United States","Object Shape":"Square, Rectagular","Summary":"We noticed two glowing lights behind our house. Thought someone maybe camping out on the BLM land but to make sure, my husband went out to make sure. He got not even 1/2 way to the lights when he was zapped on one side of his head and knocked to the grnd","map":"<A HREF = \"http://maps.google.com/maps?q=44.301569,+-121.28451(38380)&iwloc=A&hl=en\"> mufon case (38380) map </A>","Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Redmond","Source":"MUFON","Case Number":"38380"}