{"Latitude":"43.681881","Object Features":"Other","Object Shape":"Triangle","Region":"Ontario","Summary":"I observed three red/orange lights in geometrically perfect formation (triangular vertex down) from a 16th floor balcony. I viewed them between two high rise buildings which were about a 1/4 mile north.","divs":["sighting detailsi observed three red\\orange lights in geometrically perfect formation (triangular, vertex down) from a 16th floor balcony. i viewed them between two high rise buildings which were about a 1\\4 mile north of my position. my observation lasted only a few seconds before the lights winked out in unison. there was an aircraft above and behind the lights which gave me an idea of their range which appeared to be about 5 miles. there was no sound and it was below my viewing angle on the 16th floor. i noticed it because it was moving slowly and had a definite geometry. i thought perhaps it was fireworks but it moved too slowly and had a geometry and behavior that suggested precise control as opposed to chance. it moved quite slowly from west to east and blinked out abruptly, i describe it as a unit because they moved in such perfect unison. it happened so fast that i said to my friends on the balcony; \"hey look....never mind.\""],"files":["/var/www/straped/mufon/html2text/38384.html.txt","/var/www/straped/mufon/org/38384.html"],"Disposition":"Unresolved","Log Number":"CA-05222012-0024","Country":"Canada","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around May 20th 2012"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.681881,+-79.396805(38384)&iwloc=A&hl=en\"> mufon case (38384) map </A>","Date of the Event":"05/20/2012 08:45 UTC","Object Flight Path":"Straight-line path","Date Submitted":"05/22/2012 05:23 UTC","Sighting Duration":"00:00:05","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-79.396805","City":"Toronto","Case Number":"38384","Source":"MUFON"}