{"Case Number":"38395","Object Features":"None, Unknown","Tags":"City","City":"ChÃƒÂ¢teauguay","Latitude":"45.380727","Sighting Duration":"Undisclosed","Date of the Event":"05/21/2012 04:15 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Date Submitted":"05/23/2012 12:07 UTC","divs":["Sighting DetailsI woke up at 4:15 am on may 21st 2012 to go get a glass of water, when i finished drinking my water i took a peek outside from the kitchen window. At first i tought somebody was in the field behind my house (wooded area)with a flashlight (about 100 feet at first) but i noticed that the light was blinking, i was a bit worried about the possibility of a burglar. I kept watching, after about 10 seconds the light was coming in my direction in a straight line. As it got closer i realized that it was about 15 feet from the ground, it got out of the woods and stopped in my backyard about 25 to 30 feet from the house, it hovered for about 5 seconds, it started to go to the left, it stopped hovered 2 to 3 seconds, after went to the right, up and down, it stopped again at about 5 feet from the ground and hovered again for about 5 seconds, i decided to go outside, i slowly opened the patio door and went on the deck so i could have a good look at it. I stood in front of it for about 10 seconds, it raised about 15 to 20 feet from the ground and left slowly and lost sight of it behind my neighbours houses. I really don't know wat it was, i'm not saying that it is a UFO, i am skeptic about these things, is it an explainable phenomenon ? maybe it is. That is why i am reporting it. Maybe somebody could give me an answer. The description of the object (if it is an object) was about the size of a golfball, it emitted an extremely bright white light, it was blinking aproximately every 2 seconds and it was completely silent. I was totally shocked and could not go back to sleep after the sighting, i am still troubled as i am writing down this report. Thank you ..."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.380727,+-73.752311(38395)&iwloc=A&hl=en\"> mufon case (38395) map </A>","Longitude":"-73.752311","trends":["There have been 51 other sightings in Châteauguay","There were 51 other sightings in Châteauguay on or around May 21st 2012"],"Source":"MUFON","Country":"Canada","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Object Shape":"Sphere","Summary":"Blinking ball of light.","files":["/var/www/straped/mufon/html2text/38395.html.txt","/var/www/straped/mufon/org/38395.html"],"Log Number":"CA-05232012-0005","Weather Factors":"Unknown","Region":"Quebec"}