{"Object Features":"Unknown","Source":"MUFON","Longitude":"-117.481685","Country":"United States","Region":"California","Disposition":"Unresolved","Latitude":"34.411974","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","divs":["Sighting DetailsAt approximately 8.30pm, my husband and I went out on to the porch for a cigarette. Our porch faces an easterly direction over looking the George Airbase. My husband pointed out 2 flashing red lights directly overhead. At first I assumed it to be a plane, however, they were a fair distance apart, much further than that of any plane I've ever seen. Secondly I've never seen a plane with 2 port lights, usually there is a green light on the starboard side. Thirdly, there was absolutely no sound. We continued to observe these 2 lights as they moved slowly in an easterly direction over the George Airbase. The object or lights, then seemed to hover over the Northern end of the Airbase for a short period of time. The lights were flashing separately, then in time, then differently again. The object or lights then proceeded in an easterly direction toward the mountain ranges. It was then we observed more red lights flashing independently and a fair distance apart, but all traveling in the same direction and all changed direction in unison, which lead us to believe it was many lights on the one object, or a group of lights flying in no particular formation, but together. At one point we observed 4 maybe 5 lights at one time. The object or lights went over the mountain ranges and disappeared. We did attempt to get some video footage, which we will upload if anything is visible."],"files":["/var/www/straped/mufon/html2text/38444.html.txt","/var/www/straped/mufon/org/38444.html"],"Case Number":"38444","Summary":"Red lights flashing sequentially at first then separately.","Sighting Duration":"Undisclosed","City":"Phelan","trends":["There have been 4 other sightings in Phelan","There were no other sightings in Phelan on or around May 22nd 2012"],"Log Number":"US-05232012-0054","Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"05/23/2012 12:50 UTC","Tags":"City","Object Shape":"Other, Unknown","Date of the Event":"05/22/2012 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.411974,+-117.481685(38444)&iwloc=A&hl=en\"> mufon case (38444) map </A>"}