{"Sighting Duration":"Undisclosed","Date of the Event":"03/01/1994 08:30 UTC","Object Shape":"Cylinder, Disc","Case Number":"38443","Source":"MUFON","Object Features":"Dome","Country":"United States","City":"Vista","trends":["There have been 11 other sightings in Vista","There were no other sightings in Vista on or around March 1st 1994"],"divs":["Sighting Detailsthroughout my life my father had been very interested in U.f.o.s,therefore i was a huge believer myself growing up listening to investigations,stories and findings.As a small child around 8years old i firmly believe i saw a ufo from the rear window of my dads vehicle while we were vacationing and stopped at a gas station in brooklyn,ny.i was young and could have been mistaken but moving forward 14 years later i was a u.s. marine stationed at a california base in oceanside,ca.Now 22 yrs old i found a young woman that i fell in love with who lived 10 minutes away in vista,ca.As we were on one of our first dates i took her out for some ice cream at a local shop in vista off of sante fe drive.Soon enough we finished eating our cones and sat at the bench table holding hands across from one anothe.this was about 8:30 P.M.AS we were talking love with each other i happened to look up at the stars above me.It was a crystal clear night and i enjoy looking at the stars during these times.Soon as i glanced upward to the sky i happened to see a disk like object stationary right above me but far away into the sky.It pulsated different color lights,green,red,white etc. and these lights were moving in a circular motion.At this time i was really excited and shocked in seeing this i told my new girlfriend and soon to be wife if she sees what i am seeing right now.Of course she was into me to much so she wasnt really involved with it.Being around the military base i knew a chance it could have been a helicopter or plane except for one thing.helicopters and planes dont just stop in midair going slowly side to side then shoot up into space.I was a military man and i surely know the difference between planes,helicopters and what i saw..a UFO.from expierience.THIS object was stationary,then moved slowly like 5miles pr hour to the left,then to the right and went stationary again all the while pulsating different lights.Then it zoomed upwards and disappeared.My girlfriend who is now my wife was there with me and she saw it as well since i made a big fuss about it.From there on i always glance at the stars hoping to see another."],"Log Number":"US-05232012-0053","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Longitude":"-117.234583","Summary":"rounded disk shaped object hovering above me high in the sky on a clear night,with flashing colorful lights circling from the object.","files":["/var/www/straped/mufon/html2text/38443.html.txt","/var/www/straped/mufon/org/38443.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.183545,+-117.234583(38443)&iwloc=A&hl=en\"> mufon case (38443) map </A>","Disposition":"Unresolved","Latitude":"33.183545","Date Submitted":"05/23/2012 12:34 UTC","Object Flight Path":"Hovering then path,Path with directional change","Region":"California","Tags":"City"}