{"Case Number":"3844","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Log Number":"US-09122005-0007","Object Shape":"Sphere","Latitude":"41.317222","trends":["There have been no other sightings in Old Lyme","This sighting has never been favorited."],"City":"Old Lyme","Summary":"Bright flying object hovering in woods in Old Lyme","Region":"New York","Date Submitted":"05/31/1994 11:00 UTC","Date of the Event":"05/31/1994 11:00 UTC","Weather Factors":"None","divs":["Sighting DetailsAfter watching the Stanley Cup Finals with my father we headed upstairs to call it a night. As we turned off the kitchen light my father and I noticed a round glowing white light deep in the woods (maybe about 200 feet away). It appeared to be on ground level through the trees. At first we assumed it was a reflection off our microwave clock but then it started to move. It appeared to rise slowly into the the air then took off into the sky. My father and I kept watching but whatever it was it didn't return. Knowing that I was only 13 at the time and scared of the unknown my father just told me it was a car in the distance. Recently I brought up the story to my father and he openly admitted that he never knew what the hell the thing was. Since there wasn't a road behind the house at the time (today a housing development named Peppermint Ridge is built on the property) the only other explanation I could think of was ball lighting. Two years prior on Thanksgiving we had a ball of lighting come through our backyard and strike our neighbor's chimney setting their house on fire... but seeing how it was early June and the object was much bigger than the ball lighting I saw then I can say I have no idea what the thing was."],"Longitude":"-72.303056","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/3844.html.txt","/var/www/straped/mufon/org/3844.html"],"Tags":"City","Object Flight Path":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.317222,+-72.303056(3844)&iwloc=A&hl=en\"> mufon case (3844) map </A>","Object Features":"None"}