{"divs":["Sighting Detailsmy wife and myself were sitting on our swing out in the front yard talking and looking up. when we both see these green neon lights in a circular shape travling from the ese to the wnw direction. this object was tipping from the left to the right as it moved across the sky making no noise whatsoever. I thought it might have been a plane, but had no sound, no blinking lights and i have never seen a round shape plane before. No helicopter. I asked my wife do you see what i see --she said yes. I asked her to describe what you see it was the samething i'm seeing. now when i said it moved tipping left to right it wasn't a drastic move but you could see that it was tipping because the lights would black out on the otherside as the side lifted up. all i kept saying is \" do you see what i see\" to my wife and kept saying yes. I have never ever seen anything like this before in my life. i watched the object move to the wnw moving sightly up and down from a distance. then i lost the object due to the trees and terrain. the object was not spinning . there was no sound, no heat distubance behind the object against the stars."],"Log Number":"US-09132005-0001","Case Number":"3846","Date of the Event":"09/12/2005 10:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.794664,+-98.73197(3846)&iwloc=A&hl=en\"> mufon case (3846) map </A>","Object Shape":"Undisclosed","trends":["There has been one other sighting in Boerne","There were no other sightings in Boerne on or around September 12th 2005"],"Object Flight Path":"Undisclosed","Region":"Texas","Country":"United States","Summary":"Not Provided","Date Submitted":"09/12/2005 10:25 UTC","City":"Boerne","Source":"MUFON","Sighting Duration":"10:30:00","files":["/var/www/straped/mufon/html2text/3846.html.txt","/var/www/straped/mufon/org/3846.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-98.73197","Tags":"City","Disposition":"Unknown","Latitude":"29.794664","Object Features":"Undisclosed"}