{"Date of the Event":"05/22/2012 10:30 UTC","Sighting Duration":"00:30:00","Longitude":"-83.066303","map":"<A HREF = \"http://maps.google.com/maps?q=39.885267,+-83.066303(38464)&iwloc=A&hl=en\"> mufon case (38464) map </A>","Country":"United States","Log Number":"US-05232012-0021","Region":"Ohio","Source":"MUFON","Latitude":"39.885267","Weather Factors":"Unknown","Object Shape":"Square, Rectagular","Tags":"City","files":["/var/www/straped/mufon/html2text/38464.html.txt","/var/www/straped/mufon/org/38464.html"],"trends":["There have been 13 other sightings in Grove City","There were no other sightings in Grove City on or around May 22nd 2012"],"Viewing Distance":"20 Feet or Less, 101-500 Feet","Summary":"Glowing Green/Red 1 Foot Long Flying Object","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Wings, Other","Case Number":"38464","City":"Grove City","divs":["Sighting DetailsI am reporting this for my Mother and a neighbor. I personally wasn't at the location at the time of the sighting. My mother and 3 other neighbors were sitting outside on her apartment patio at the time and place listed above. My Mother and 2 other witneses saw a rectangular object approximately 1 foot long producing a green glow moving at speed over the hedge that is approximately 20 feet from the patio on which she and the other neighbors sat. The object moved at speeds approximating that of a bird in flight. The object traveled from above the hedge to a tree approximately 30 feet away and promptly disappeared (glow turned off?), then reappeared heading away from the patio at the same speed as before. At an approximate distance of 100 feet, the object disappeared again, only to reappear momentarily on the roof of the single story apartment building across the street. At this time, the object changed in luminescent coloration from green to red and pulsated (dimmed and brightened) repeatedly until it disappeared once again and was again seen by my Mother and one of her neighbors at treetop level some 250-300 feet distant at which point the object disappeared yet again. Finally the object was seen heading back toward their patio only to increase in altitude and make a final disappearance in the clear night sky. This is about the best I can do for describing this event as I was not present and this is from direct testimony from the 3 witnesses. The 4th person at the event did not see the object the others were seeing as she was not able to follow the rapid appearance and disappearance of the object as the others pointed it out."],"Disposition":"Unresolved","Date Submitted":"05/23/2012 06:44 UTC"}