{"Case Number":"38463","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Disposition":"Unresolved","divs":["sighting detailssaw abnormally large orange globe coming from north kanata heading north\\west towards dunrobin. globe changed direction as if circling the city of ottawa in a clock wise direction. i am able to call to my neighbour who witnesses this as well. just as first globe starts to grow dime due to travelling away from my position, a second exact globe travels in the same manner. i am positioned on a dock out in the ottawa river so i am able to see a large portion of the sky. we both agree that this is abnormal and decide to observe for a longer period of time. within about 40 minutes one more orange globe follows the exact same path. flight is about the same height you would expect a small plane to travel at but no noise, no flashing lights and oddly smooth flight direction. we considered a drone purhaps. next evening i decide to sit out on the deck again and at aproximately 11 pm the same event happens again, just one globe. googled \"ufo ottawa\" and read a note about two people seeing orange globes over the city of ottawa and simply wanted to add my two cents. nothing else happened besides the viewing."],"Object Features":"None","files":["/var/www/straped/mufon/html2text/38463.html.txt","/var/www/straped/mufon/org/38463.html"],"trends":["There have been no other sightings in Woodlawn","This sighting has never been favorited."],"Region":"Ontario","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"05/23/2012 03:15 UTC","Date of the Event":"05/20/2012 12:00 UTC","Latitude":"45.462684","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.462684,+-76.075469(38463)&iwloc=A&hl=en\"> mufon case (38463) map </A>","Object Flight Path":"Path with directional change","City":"Woodlawn","Longitude":"-76.075469","Log Number":"CA-05232012-0020","Country":"Canada","Summary":"Orange globe shape, appeared to be circling city of Ottawa, two at same time"}