{"Log Number":"US-05242012-0001","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.914593,+-94.725187(38469)&iwloc=A&hl=en\"> mufon case (38469) map </A>","City":"Overland Park","Date of the Event":"05/22/2012 10:30 UTC","Longitude":"-94.725187","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/38469.html.txt","/var/www/straped/mufon/org/38469.html"],"Region":"Kansas","Tags":"City","Source":"MUFON","Object Shape":"Sphere, Star-like","Disposition":"Unresolved","Case Number":"38469","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around May 22nd 2012"],"Object Flight Path":"Stationary","Sighting Duration":"03:15:22","Date Submitted":"05/24/2012 12:08 UTC","Latitude":"38.914593","Object Features":"Unknown","Summary":"Saw small orb blinking above rooftops multiple colors for a few hours.","divs":["sighting detailsfor the last two days i have seen an object in the sky that flashes red white green and blue quickly, but always pausing on red for a couple seconds. the first night, which was last night, 5\\22\\12 at approximately 10:30pm i was out smoking on my front porch when i noticed a larger than a star object in the sky that was blinking those colors rather quickly. it was only slightly larger but i thought it might be a super nova. it was approximately 300 degrees nw in the sky above the rooftops of nearby houses. it stayed there for about 3 hours then when i came out again it was gone. tonight i had seen the report on channel 5 news and was excited because it was exactly what i had seen the night before. i walked outside and called my father and when i looked up into the sky where i had seen it previously i saw it again, only it was now about 312 degrees nw and it was about the size of a star. as i talked talked to my father i watched it slowly move to the north from 312 degrees to 319 degrees to 324 degrees nw. it was right above the treeline this time instead of above the rooftops and if i moved forward i couldnt see it anymore. this all happened at 10:30pm on 5\\23\\12. im sure it isnt a star, but im not sure what it is exactly. i thought you guys should know, just in case you wanted to look out and see it."],"Country":"United States"}