{"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=34.478448,+-119.261776(38460)&iwloc=A&hl=en\"> mufon case (38460) map </A>","City":"Ojai","Log Number":"US-05232012-0017","Longitude":"-119.261776","Object Shape":"Oval, Square, Rectagular","Tags":"City","files":["/var/www/straped/mufon/html2text/38460.html.txt","/var/www/straped/mufon/org/38460.html"],"trends":["There have been 20 other sightings in Ojai","There were no other sightings in Ojai on or around May 23rd 2012"],"Region":"California","Object Features":"Undisclosed","Sighting Duration":"12:28:28","Date of the Event":"05/23/2012 12:00 UTC","divs":["Sighting Detailsmy name is mark mellein and i am asking for help for any one to come to ojai. and bring some video or some way to see a lot of ufos liveing in the mountains. i dont know how to get help its so real iv seen them so close and far away useing scoops. i am up there by my self and i find themto were i walk up to them.and i dont know what to exspect so i dont get to close to them.iv went to the police and they told me to seek out mufon to come out and see them i contact edwerd air forse base but got no answer back iv ritten on the enternet hopfully some one would contact me but no one has. i went up there yesterday to make sure they are up there i found 6 realy butyfull ships.they were black green and gray shinny but the last one i say at the end of the day. was as big as a 3 to 4 story house tryangle shape it had 15 to 20 long shape rocks on the left side and the left side of it was a realy big ovel shap gray green and black ship abought the size of a 2 story house it is on top of a mountain its ben there for a good 3 months its realy hard to find them they are realy good at camo. themselfs i dont know why there are up there or how they servive i have seen them in the river and nere the power lines it is so amaseing i do know that they live up there and iv seen there tunnals that open up and close after ships come and go if you dont get back to me on this matter then i will gess that you already know about them but if not then it wwould be realy great to know and film them the reason i an contacting you is i dont have any equptment to film them thanks for your time it would be grate if they could be filmed or something"],"Weather Factors":"Unknown","Latitude":"34.478448","Case Number":"38460","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less, 101-500 Feet","Date Submitted":"05/23/2012 02:33 UTC","Summary":"there here in the mountains of ojai ca. 93023 in big groops or alone in brush or in the rocks","Source":"MUFON","Country":"United States"}