{"Date of the Event":"06/01/2011 12:00 UTC","Log Number":"US-05242012-0004","Case Number":"38472","trends":[],"City":"Undisclosed","Date Submitted":"05/24/2012 01:07 UTC","files":["/var/www/straped/mufon/html2text/38472.html.txt","/var/www/straped/mufon/org/38472.html"],"Viewing Distance":"Over One Mile","Longitude":"-112.382729","divs":["Sighting Details 1. I was in the passenger seat of a car with my father-in-law, wife and daughter. We were headed west bound on HWY 74 in Arizona. 2. They were moving. 3. Clouds. 4. There were two perfect looking circles on their sides vertical and the color of clouds; at first I thought that they were clouds. Both of them were rotating to a horizontal position. When the two objects got horizontal with the horizon they became very flat and just vanished. I tried telling my father-in-law but before my brain could process what I was seeing they vanished in mid sentence. There was no trail no streak just gone. 5. I felt as if someone had played a magic trick on me or as if I really did not see this just happen, but I witnessed it for too long not for it to had happened. I was upset with myself for not getting the words out quick enough for anyone else to see, it was just a very strange thing for me to see. I have lived with this strange sighting for about a year now always wandering what or if I really saw those two objects in the sky; deep inside I know that I did. If you have not witnessed you will never know the feeling of unknowing. I feel that has somewhat changed me and the way I look at things. I now wish that I never saw these things! 6. They vanished or disappeared."],"Object Features":"Other","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.82469,+-112.382729(38472)&iwloc=A&hl=en\"> mufon case (38472) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Region":"Arizona","Object Shape":"Circle","Disposition":"Unresolved","Latitude":"33.82469","Summary":"Two large perfect circles that had the color of clouds."}