{"Log Number":"US-05242012-0009","Region":"Missouri","trends":["There have been 7 other sightings in Warrensburg","There were no other sightings in Warrensburg on or around May 15th 2012"],"City":"Warrensburg","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Case Number":"38477","Country":"United States","Date of the Event":"05/15/2012 09:30 UTC","files":["/var/www/straped/mufon/html2text/38477.html.txt","/var/www/straped/mufon/org/38477.html"],"Sighting Duration":"Undisclosed","Longitude":"-93.764144","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","Summary":"3 extremely bright lights straight up and down, flashing slowly. I thought it was a newly errected tower.","Latitude":"38.865165","divs":["sighting detailsi was on my way to work at 9:30pm on tuesday night 05-15-12. when i pulled out of my driveway and onto the state road and drove about 1\\2 mile i noticed 3 bright white lights about 2 miles straight ahead. i live in the country and at this time i'm driving on a paved road. where i see the lights is where the paved road curves to the right but a gravel road goes straight ahead. as i get close to this gravel road, these lights are getting brighter and brighter. i'm wondering to myself \"when did they put up a tower down this road?\" and the closer i get the brighter these lights are so then i'm thinking to myself, \"man, the people who live down this road are gonna be mad about these bright lights on this tower!\" i pulled out my cell phone camera to try to catch a picture but with the lights flashing and the delay on my camera i kept missing the shot plus i didn't want to be late for work. i really wasn't thinking ufo at this time but as i kept on driving around several more curves i kept seeing these lights flash for several more miles and then i was out of range. i thought about these lights all night at work. the next night,wednesday 05-16-12, i looked for this \"tower\" but it wasn't there. this is when i thought it might have been a ufo. when i got off work at 7am on thursday morning i drove down this gravel road to see if i could see any signs of a tower or any farm equipment that could have made these lights. there was nothing. i haven't seen them since but i did post it on my facebook and one of my friends who lives about 10 miles or more from me said that she and her husband saw strange lights that night as well."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.865165,+-93.764144(38477)&iwloc=A&hl=en\"> mufon case (38477) map </A>","Date Submitted":"05/24/2012 09:37 UTC","Disposition":"Unresolved","Object Shape":"Circle, Flash"}