{"Sighting Duration":"Undisclosed","Longitude":"-74.414614","Case Number":"38474","Region":"New York","divs":["Sighting DetailsDriving home from work on Route 84 Westbound. Past exit 5 and heading towards exit 4. Aprox 13 mile stretch of country. started seeing 3 Extremely bright white lights in sky. Thought it was a Plane heading into nearby Stewart Airport for a landing. Been traveling this same stretch of road for 9 years now at this time of night and am familiar with the airplanes at night. But this wasn't acting like an ordinary airplane. It struck me odd, it was fairly low and appeared to be hovering. It looked so odd. I was driving 65 MPH and kept getting closer to the bright lights. Then I did see some faint red lights and reassured myself that it had to be a plane. Kept driving closer to it until I passed right by it. It was on my right, just on the other side of the eastbound lanes. It was not moving. It was indeed hovering. Difficult to drive, because I just kept looking at it, so I slowed down. It was just hanging there. A triangle shape with 3 very bright lights at the corners and a little red light near each big White light. Don't think it was huge as it seemed really close, hovering just above the tree line. Never seen any kind of craft just hover in one place in the sky. Became afraid and drove very fast home."],"Disposition":"Unresolved","Tags":"City","Log Number":"US-05242012-0006","City":"Middletown","Summary":"Triangle Ctaft Hovering next to interstate highway at night","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.447887,+-74.414614(38474)&iwloc=A&hl=en\"> mufon case (38474) map </A>","trends":["There have been 22 other sightings in Middletown","There were no other sightings in Middletown on or around May 24th 2012"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/38474.html.txt","/var/www/straped/mufon/org/38474.html"],"Viewing Distance":"21-100 Feet","Country":"United States","Object Shape":"Triangle","Date Submitted":"05/24/2012 02:14 UTC","Latitude":"41.447887","Source":"MUFON","Date of the Event":"05/24/2012 01:15 UTC","Object Flight Path":"Stationary"}