{"Weather Factors":"Unknown","Tags":"City","City":"North Vancouver","Longitude":"-123.068237","divs":["sighting detailsorange orb of light in the sky 2010 sept 25 at 12:50-12:55 am at bc north vancouver deep cove boat launch dock group of friends 4 people total. we were faceing west towards downtown vancouver we saw an orange orb of light at our location it was north west of us looked like 5-15 nm from us it was dark and the light was strong so it was hard to determind its distance. 2 of the witness is a pilot there was no red or green light. no strobe lights because the intensity of the lights is not what we are used to seeing when flying it was hard to determind the distance from us the light in the sky looked brighter then the street lamp that was less then a parking lot from us the light from the sky was not a focus light \"not a spot light\" was a all directional light the light made no sounds it was traveling steady from nort west of us to south west of us the object was slowing down to a dead stop which i would say its was above us i dont remembering the lights dimming it seems to me the lights stayed the same brightness as it came to a stop which was closest to us at the time. it made no noise. it then hover for 10-20 sec the wind was blowing north east. taf\\metars cyvr 251000z 10007kt 15sm few055 bkn076 ovc094 15\\12 a3005 rmk sc2ac5ac2 slp177 it then went upwards for around 3-5 sec untill it reached the overcast layer it was fast when i frist saw it. i would say it was almost as fast as an f-16 intercepting at the winter olympics but it had no sound one of my friend took a photo of it but it did not turn out good at all the lights in photo was blue. i was planing to report this to transport canada and phone up the cvyr tower. but did not do so. it was one of my friend who pointed to the sky telling us to look. my frist reaction to the object was it was a search helicopter. or something but 2 sec later my view totally changed. my personal view is that rotation, gravitation, electromagnetic, weak nuclear force. could be the power source of this craft and i think its made in earth. i never thought i will see a ufo in my life and i never did belived in them. i always thought most ufo seen in history is just airforce spy planes or prototypes. and i hope within my life time the ufo that i had seen will be disclosed to public as a project or prototype in the future. digital photo is not in my possession the other witness has it. but i've seen it."],"Log Number":"CA-05242012-0012","map":"<A HREF = \"http://maps.google.com/maps?q=49.319647,+-123.068237(38480)&iwloc=A&hl=en\"> mufon case (38480) map </A>","Country":"Canada","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"09/25/2010 12:00 UTC","Case Number":"38480","Region":"British Columbia","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Latitude":"49.319647","Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in North Vancouver","There were no other sightings in North Vancouver on or around September 25th 2010"],"Summary":"BRIGHT ORANGE ORB LEVEL FLIGHT CHANGE TO VERTICAL FLIGHT","Date Submitted":"05/24/2012 01:12 UTC","files":["/var/www/straped/mufon/html2text/38480.html.txt","/var/www/straped/mufon/org/38480.html"],"Object Features":"None"}