{"Object Features":"Unknown","Disposition":"Insufficient Data","Object Shape":"Star-like","Log Number":"US-09132005-0003","Case Number":"3848","trends":["There have been 15 other sightings in Huntington","There were no other sightings in Huntington on or around October 31st 1968"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.41925,+-82.445154(3848)&iwloc=A&hl=en\"> mufon case (3848) map </A>","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:06:00","Latitude":"38.41925","Source":"MUFON","Weather Factors":"None","divs":["Sighting DetailsI was about 14 years old at the time and was riding in the back seat of my parents car as we returned home one evening around 8:30PM. An avid stargazer as a boy I always had a habit of checking out the sky at night. That night we were on Fairfax Drive (in the hilly section of town) and as usual I had looked up in the sky to see the stars. I immediantly noticed two bright orange objects high in the sky above our car. At first I thought they were stars but the orange color gave them away. I alerted my dad who was at the wheel and he pulled over and my dad and mom and I got out to look closer. The objects did appear very high, silent, and positioned side by side not moving at all. After a few minutes the object on the right started moving slowly away from the other and then just appeared to go dark and dissapeared. The remaining object was motionless for 15 seconds or less and then just like someone turning a light switch off, just went dark without appearing to move at all and disappeared. We drove on home (next street over) and I remember my parents discussing the incident, wondering just what we had seen. I called the local branch of the weather service(just in case) and ask them if there were any weather baloons in the area that night. They said there were none and proceeded to take my report asking me specific questions as to altitude and other aspects of my sighting."],"Summary":"Returning home with my parents I noticed two bright orange objects high above the street we were on.","Longitude":"-82.445154","Object Flight Path":"Hovering then path","City":"Huntington","Country":"United States","files":["/var/www/straped/mufon/html2text/3848.html.txt","/var/www/straped/mufon/org/3848.html"],"Region":"West Virginia","Date Submitted":"10/31/1968 08:30 UTC","Date of the Event":"10/31/1968 08:30 UTC"}