{"Log Number":"US-05252012-0001","Longitude":"-96.157183","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"05/25/2012 12:47 UTC","divs":["Sighting DetailsI was spending the week at my brother's house in Sealy about 50 miles west of Houston, we were designing and building a fruit and vegetable garden for his yard during the day. It was about 11pm and I had went outside to smoke a cigarette and look at the stars because I don't get that view of the night sky in the city. I looked north towards I-10 and up about 60 degrees looking at the constellations in the sky one of which had a very bright star like object just below it. At first glance I thought it was a star but it seemed \"off\" in a way. After about a minute of staring at it I realized it was not a star so I pulled out my camera phone and to my dismay the battery was dead. I stared at the object for another 30 seconds when it seemed to grow bigger and get brighter, it grew to about twice it's previous size and then flashed out of view and was gone. I stared at the empty spot for about 5 - 10 seconds trying to contemplate what i just saw when out from the south were two F-16 fighter jets with full afterburners on racing towards the spot where the light had been then made a very wide 180 degree turn back to the south where they disappeared behind the tree line. In retrospect I would say the jets where around 30 - 40 thousand feet high and I would put the object at about the same altitude."],"Summary":"star like object seen over sealy tx.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/38492.html.txt","/var/www/straped/mufon/org/38492.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.780788,+-96.157183(38492)&iwloc=A&hl=en\"> mufon case (38492) map </A>","Case Number":"38492","Weather Factors":"Unknown","Date of the Event":"03/01/2012 12:00 UTC","Object Shape":"Star-like","Region":"Texas","City":"Sealy","trends":["There has been one other sighting in Sealy","There were no other sightings in Sealy on or around March 1st 2012"],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Tags":"City","Object Features":"None","Country":"United States","Latitude":"29.780788"}