{"divs":["Sighting DetailsI was sitting at a red light when I first noticed three lights coming directly towards me. The road I was on was soon to be curving towards the left as it goes around a very small hill, just above the hill is where the lights became visible. Because of the hill being in the way, only one of the lights was visible at first, at that point I wasn't paying much attention to it, just figured it was one of the helicopters that seem to be constantly around and typical of this Los Angeles suburb. The single light was very low in altitude, seemingly just low enough to clear the height of the hill by a couple hundred feet, again nothing out of the ordinary for the helicopters around here. But then two additional lights became visible as they got close enough that the hill was no longer blocking them. It was easy to see that all three lights were at the same altitude and moving at the same exact speed. When there was only one light visible, I didn't think much about it, but as soon as three identical lights showed up, that got my full attention real fast. Something was definitely different about the whole scene, the most obvious being that I've never before nor since seen three helicopters flying in formation such as this, basically side by side and awefully close together. But also was strange how all three lights were at exactly the same altitude, moving at exactly the same speed, and so evenly spaced. As the lights got a little closer I could see that the one in the middle was slightly ahead of the other two, like a boomerang shape except not so curved, more straightened out and not so curved like a typical boomerang is. At this point I was still thinking how odd it all seemed and then the light was green and I had to go. I went just as slowly as I could and was sticking my head out the window trying to get a look as I was driving. Like I said before, they were coming directly at me when at the red light, they were going to be passing directly overhead. This was not so easy to do, to drive down a road which was soon to be curving, and at the same time to be looking straight up at my zenith. I almost was about to pull off the road but didn't. Besides looking straight up at the lights, which by the way didn't look any different than when they were visible through my windsheild and coming straight at me, I did realize one thing by sticking my head out the window, that being that there was absolutely no sound whatsoever. That's when it struck me that what I had just seen was really weird, that a helicopter or even a small plane could have passed directly overhead at such an incredibly low altitude without making a sound was impossible, whatever it was it was just to low for it to have not made any sound whatsoever. I guess the only other thing I can think of is that maybe it was some sort of glider, yet this seems as fantastic a conclusion as it being extraterrestrial, I just can't beleive a glider would be flying around at night like that at hilltop level in a residential area, and besides that a gigantic glider to boot. I estimate the distance between the two outside lights to be approximately 1,000 feet. This thing was big and quiet and I was very impressed by what I had seen. It was many years later that I saw shows about UFO's which had the same boomerang type crafts as I had seen, in other words, corroborating my sighting, and interestingly enough, those boomerang type sightings were also contemporaneous. Also the size of my sighting seems to easily match the size of the other ones, so it seems that I,ve seen exactly the same craft as other people. Not sure if my finally getting around to reporting this incident will make any difference, maybe it can mean something that it expands the geographic area for sightings of this type of craft."],"Source":"MUFON","Latitude":"34.418995","Date of the Event":"05/01/1997 12:00 UTC","Country":"United States","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around May 1st 1997"],"Case Number":"38494","City":"Santa Clarita","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/38494.html.txt","/var/www/straped/mufon/org/38494.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.418995,+-118.536086(38494)&iwloc=A&hl=en\"> mufon case (38494) map </A>","Longitude":"-118.536086","Summary":"big boomerang shaped, silent craft","Object Features":"Unknown","Disposition":"Unresolved","Region":"California","Tags":"City","Weather Factors":"Unknown","Log Number":"US-05252012-0003","Object Shape":"Boomerang","Sighting Duration":"Undisclosed","Date Submitted":"05/25/2012 01:08 UTC","Object Flight Path":"Undisclosed"}