{"Object Features":"None","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"38505","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Longitude":"-86.155894","map":"<A HREF = \"http://maps.google.com/maps?q=39.682818,+-86.155894(38505)&iwloc=A&hl=en\"> mufon case (38505) map </A>","Weather Factors":"Unknown","Object Shape":"Circle","Summary":"Dark, reflective circular object that \"disappeared\" after about 15 seconds of observation.","Log Number":"US-05252012-0011","divs":["Sighting DetailsAt 16:45 on 25 May 2012 I was sitting in my backyard with my dog. I was in a chair that faced the direction of about 180-185 degrees. I happened to look up to see an aircraft I heard. I saw the airliner- on a course of about 350 degrees, around 3000 feet AGL, to my West. I also noticed a very dark, solid appearing object at about 85 degrees above the horizon. It was moving \"slowly\" in a northeasterly direction. It made no sound that I was aware of. It appeared to be a \"flattened circle\" in shape and was seemingly \"turning end over end\". It had a very definite, sharply defined shape. It reminded me of what I would imagine a LP record would look like in the air, but it had a definite \"thickness\". (I know, a circle has no \"ends\", but that is the best way to describe the movement). As it \"flipped over\" and seemed to \"wobble\", it reflected the sun light. It did not appear to be a bird, nor did it appear to be an aircraft. It had an apparent speed of about that of a soaring bird, but seemed to be higher than I have noticed birds flying in this area. It struck me as being solid, and \"metallic\", but that is just my opinion. As I have no idea of the altitude, I have no idea of the size, but it appeared to me to be between the size of Jupiter and the size of an aspirin at arm's length. It Was under the very broken clouds. After about 15 seconds of uninterrupted observation (by now it was just past my apparent 90 degree point heading to the NE it seemed to disappear. What was odd was that the sky where I last saw it seemed to \"shimmer\" for a brief moment. I had been outside for about 15 minutes; and am in relatively good health. I have spent years as an amateur \"skywatcher\" with binoculars and telescope. I do have to admit this is the first thing seen in the air in my 61 years of life that I have not been able to explain. AT first I thought it was kite, or perhaps a balloon, but it did not seem to move like either."],"Disposition":"Unresolved","Source":"MUFON","Region":"Indiana","Tags":"City","Latitude":"39.682818","Date of the Event":"05/25/2012 04:45 UTC","City":"Indianapolis","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around May 25th 2012"],"files":["/var/www/straped/mufon/html2text/38505.html.txt","/var/www/straped/mufon/org/38505.html"],"Date Submitted":"05/25/2012 05:47 UTC"}