{"Object Features":"Other","Source":"MUFON","Log Number":"BE-05252012-0010","Disposition":"Unresolved","Longitude":"3.329387","Sighting Duration":"Undisclosed","City":"Zwevegem","Case Number":"38504","map":"<A HREF = \"http://maps.google.com/maps?q=50.797413,+3.329387(38504)&iwloc=A&hl=en\"> mufon case (38504) map </A>","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/38504.html.txt","/var/www/straped/mufon/org/38504.html"],"divs":["Sighting DetailsIt was winter and I was with my mom and dad at our grandparents house. It was already dark outside and I was staring out the window, watching the fields behind their home and the city lights on the horizon. All of a sudden I saw an object hovering behind one of neighbours' trees. The tree is approximately 4 meters (about 12 feet I guess) away from the window and about 4-5 meters high (ca. 12-15 feet), but the object appeared much farther away (The object seemed to be about 300-500 meters away). Still the object was at tree level, so must have been hovering pretty close the ground. At first I only saw three lights, positioned in a triangle shape. They were red, blue and green and they changed colours in a random way, but there were never two lights which had the same colour at any given time. So at first I thought it was the reflection of something in the house (like those small 'party lights' you can buy at the kids store), but when I looked behind me I couldn't see anything projecting such lights. I looked outside again and I couldn't really figure out the shape of the object, but because we live in an area that has a lot of light pollution (which makes the sky look brighter), I could now at least tell that it was an object and not just lights, because I saw a silhouet that appeared darker than the nightsky. It hovered a little longer and all of a sudden it flew away at an amazingly fast speed, right into the sky and disappeared. I the whole event took about 2-3 minutes. I was kind of intrigued at first and kept staring outside to see if I could spot it again. When I couldn't find it, I asked my family, who were standing a bit further away, if they saw it too, but they didn't... I didn't really bring it up ever again, but besides from the exact date (because it has been 7 years) I remember the experience quite vividly, which I find a bit strange."],"Region":"Flemish Region","Country":"Belgium","Weather Factors":"Unknown","Summary":"Object with 3 lights changing from red, blue and green randomly hovering and then warp off into sky","Tags":"City","Date Submitted":"05/25/2012 02:52 UTC","Latitude":"50.797413","Object Shape":"Disc, Triangle","Date of the Event":"11/13/2005 07:00 UTC","trends":["There have been no other sightings in Zwevegem","This sighting has never been favorited."],"Object Flight Path":"Hovering then path"}