{"Weather Factors":"Unknown","Tags":"City","Longitude":"-91.903315","Case Number":"38503","Date of the Event":"05/24/2012 09:20 UTC","files":["/var/www/straped/mufon/html2text/38503.html.txt","/var/www/straped/mufon/org/38503.html"],"Log Number":"US-05252012-0009","Source":"MUFON","trends":["There has been one other sighting in Mexico","There were no other sightings in Mexico on or around May 24th 2012"],"Viewing Distance":"Unknown","Latitude":"39.188616","divs":["sighting detailsmexico, missouri 5\\24\\2012: overcast night, stars only slightly visible. i was looking for stars through the hazy atmosphere when the following events occured. 9:20-what appeared to be a star moved erratically (north, south, east, and west pausing and changing direction, also moving in concentric circles and arced paths at times. watched for approximately 30 min. 9:50 two dim orange lights on what appeared to be the underbelly of a rounded triangular craft shot off to the north and slightly west in a trailing pattern. almost as if gliding but very quickly. no sound at all. 10:15-my wife and i both saw what appeared to be a bright white trailing shooting star coming from the west\\south west that paused moved very erratically and then continued in its flight path towards the east\\north east. 10:20-i saw a fourth light, reddish in nature, stream in from the north headed south pause and behave much the same way as the first light in roughly the same location first spotted. watched for approximately 5 minutes before i lost sight of it, as the reddish hue was harder to detect with cloud cover starting to increase."],"Object Features":"Undisclosed","Disposition":"Unresolved","City":"Mexico","Sighting Duration":"Undisclosed","Region":"Missouri","Date Submitted":"05/25/2012 01:19 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.188616,+-91.903315(38503)&iwloc=A&hl=en\"> mufon case (38503) map </A>","Summary":"Four very different crafts of some type demonstrating various phenomena","Object Flight Path":"Stationary,Path with directional change,Path then hovering,Other","Object Shape":"Boomerang, Star-like, Triangle, Unknown"}