{"Latitude":"32.442947","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"3851","Summary":"Saw 4 lights in sky at a distance, which moved closer to reveal round object","City":"Rockledge","Date Submitted":"09/13/2005 08:15 UTC","Object Shape":"Disc","Viewing Distance":"Unknown","Country":"United States","divs":["Sighting DetailsIt was Tuesday, September 13, 2005. I had gotten off work and gone home to check some work that a friend of mine, John Darley, had done on our farm. He had cleared about an acre of land to build a shop on. After checking the work, I decided to ride over to his house to pay him for the work. I saw John and his helper, Leon, coming down the road (Leon Joiner Road) in John's truck. He saw me and we stopped to talk at a pond across from Leon's house. It was beginning to be dusk. It was between 7 and 8 pm. I pulled over and parked and we (Leon and I) were standing beside John's truck talking. I noticed an orange, pinkish object over Leon's shoulder that caught my attention. At first, I did not think anything about it. Then another object appeared and another, instantly. The objects were all at the same elevation and equal distances apart, but definitely not part of the same craft. Then, as quickly as they appeared, the objects were gone. In about 15 seconds, the objects appeared again. This time, they were closer to us. I saw the outline of a round object in the sky. I could see one light, or something glowing, at the perimeter of the object. Then there were two lights, then three lights, then four, five and six. The object was slowly rotating and as it rotated, more lights came into view. Another object appeared next to this one. The objects were very close together. John remarked \"Those two air planes are about to collide.\" This object rotated to reveal four \"lights\". The objects were stationary in the sky. There was no sound associated with the sighting. Then as quickly as they appeared, the lights and objects were gone. We stood their talking and decided what we had seen was no air plane or helicopter. A few minutes later these objects reappeared half way across the sky from the second sighting. There were three points of light. First one appeared, then the second some distance behind, then the third some distance behind. They were all at the same elevation in the sky and in perfect alignment. The objects moved some distance across the sky and stopped. As quickly as they appeared, they were gone again. We waited about another 30 minutes or so and discussed what we saw. We then went home."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.442947,+-82.697636(3851)&iwloc=A&hl=en\"> mufon case (3851) map </A>","Weather Factors":"None","Longitude":"-82.697636","Source":"MUFON","files":["/var/www/straped/mufon/html2text/3851.html.txt","/var/www/straped/mufon/more/3851_submitter_file1__MUFON-US-09142005-0003.JPG","/var/www/straped/mufon/org/3851.html"],"Tags":"City","trends":["There have been no other sightings in Rockledge","This sighting has never been favorited."],"Region":"Georgia","Date of the Event":"09/13/2005 08:15 UTC","Log Number":"US-09142005-0003","Object Flight Path":"Stationary,Straight-line path,Path then hovering","Disposition":"Unknown"}