{"Longitude":"-111.920092","Case Number":"38518","divs":["sighting detailsreporting on the sightings beginning may 23 2012 continuing and strengthing on until may 24 2012 11:51pm and more than likely in to may 25th. objects like army sq helicopters with triangles like side bottoms\\ two sides. most notable about the two sides is that the light is not coming in at the same time on both sides and report to be at weird\\quantum entanglement principles. can steadily ascend and descend quietfast or slow and have been noted as sitting in some specific spots and hovering there for periods of time. objects are not flying in fly path freeways not at correct hours of operation, sound emission is higher speeds than normal unless literally we got a gov or ours all in the sky atm. --> so if not that than, continue... specific constant fly overs frequently in specific areas by crafts that porject light at more than one type of (unknown to humans) frequency like state for their lights. with circle in pattern than emit a change light light than continue or if turning or communicating or getting in the way of communication have reported added light light change. objects have crossed at spontaneous velocity with differential distances. objects have moved some type of other notable sighting that appears one as a normal star andor planetastrieiod etc moves out of the way of the rapidly moving craft and than settled agin once it was away, like gravitational repealling but only on the event horizon of the spherical magnetic moments still interacting bc proximity etc. objects have increase so much activity that i must share, and i do not use a computer everyday(should,butwouldrather...), i am an observer. i see such a large us reporting gong on tonight as well, i do not know however do not continuous let them see you bc i notice they will stay longer possibly watch from near than far if they have seen you. may disregard if cadswallop. objects not obeying laws humans can on earth with mechanics (physics) however are operating with at least some ability to use quantum mechanics to operate their activity. #intense so many observations are going on not just the promiant ones noted*** do not panic, plan, do not freak out, observe and think humans are amazing creatures i want us to show that we are bonded on a human level and want our planet(even tho we have hurt it bad) and we love our home on earth as living beings . my heart is to god, #hossannahhhhinthehighest. use view finders, looking devices, telescopes, baniculers, hd cameras to view things so that you may note there velocity intensity shape etc. i love you to all humans i love you earth and i know we want our home here to be safe and i hope we all bond together to protect our gift of rare elements rare timing rare planet satellite model temp model etc how rare we are we must stand as one for our planet for whatever come what may. always rememebr do not panic, think observe note and react. instincts tend to have the %, do not jump to conclusions or cause raucousness."],"Country":"United States","Object Features":"Other","Region":"Arizona","City":"Scottsdale","Disposition":"Unresolved","Summary":"objects moving at rapid speed with fast changes in speed, direction, altitude, sound emission, pattern of lights. cross paths STRONG ENERGY HARNESSED in whatever is able to do those maneuvers, #usualskyobserver","Date Submitted":"05/26/2012 03:12 UTC","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around May 24th 2012"],"Latitude":"33.50138","Tags":"City","files":["/var/www/straped/mufon/html2text/38518.html.txt","/var/www/straped/mufon/org/38518.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Log Number":"US-05262012-0002","Source":"MUFON","Sighting Duration":"12:18:17","Date of the Event":"05/24/2012 11:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.50138,+-111.920092(38518)&iwloc=A&hl=en\"> mufon case (38518) map </A>","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering,Other","Object Shape":"Cigar, Flash, Square, Rectagular, Triangle, Other"}