{"Sighting Duration":"Undisclosed","Case Number":"38511","Disposition":"Unresolved","Date of the Event":"11/17/1999 03:15 UTC","files":["/var/www/straped/mufon/html2text/38511.html.txt","/var/www/straped/mufon/org/38511.html"],"Date Submitted":"05/25/2012 09:33 UTC","divs":["Sighting DetailsI was working the night shift at Williams Island, an exclusive wealthy residential area in Florida, as a security employee on the night of November 1999 when I had decided, as was usual at that time, to take a break from typing on a manuscript I was working on at 3 a.m. or thereabout. I stepped outside for air, walked a dozen steps or less from my station, and felt something diagonally above me that caused me to look up. To my utmost surprise above me at 100 feet was a humongous black and extremely heavy-looking triangular object without lights hovering near a building to my right near the 10th floor, soundlessly, in mid-air. I looked at the underbelly of the craft and what appeared to be rivets or some design around its edges, and thought it was so near one could actually hit it with a rock if they tried. I was awestrucked at the huge size of that thing, and at the incredible weight of what I thought to be a huge ship. When I realized the heavy craft was suspended in mid-air, navigating near a window of that building without sound, I took off toward my station frightened, locking the door when I got inside, and peeking up at it through the window of the guardhouse, when it slowly turned in a southwest direction. I never told anyone about it until recently. Only three people now know. I don't want to be contacted nor do I want to pursue this further. I had watched for years the ridiculous questioning of whether UFOs exist or not, and had heard their arguements for or against it. All I can say to all of you at MUFON is you are on the right track. Don't give up."],"Region":"Florida","Country":"United States","Tags":"City","Viewing Distance":"21-100 Feet","Longitude":"-80.153914","Source":"MUFON","Object Flight Path":"Stationary","Object Shape":"Triangle","City":"Aventura","Summary":"Heavy-looking, very huge triangular black object soundlessly hovering above me with no lights near 10th story window.","Latitude":"25.951297","Object Features":"Unknown","trends":["There have been 6 other sightings in Aventura","There was one other sighting in Aventura on or around November 17th 1999"],"Weather Factors":"Unknown","Log Number":"US-05252012-0017","map":"<A HREF = \"http://maps.google.com/maps?q=25.951297,+-80.153914(38511)&iwloc=A&hl=en\"> mufon case (38511) map </A>"}