{"Object Shape":"Egg, Sphere","Date of the Event":"04/20/2012 03:15 UTC","Region":"Missouri","Case Number":"38517","trends":["There have been 10 other sightings in St Joseph","There were no other sightings in St Joseph on or around April 20th 2012"],"Latitude":"39.757944","divs":["sighting detailswas just out \"starwatching\" off the back deck late at night. i believe this happened in april, but it could have been early may. hadn't seen anything interesting when suddenly a golden\\ yellowish sphere like object, passed across my field of vision, i guess you would say from my right to left, south to north. i was looking in the perfect direction to see it. i can only see a portion of the sky from my deck(due to the way my building faces the woods) so i only saw this thing travel across the sky for about 2 seconds or so. no sound, and no lights of any sort. to me it seemed golden or kind of yellow sphere or egg shaped. soon afterwards i was asking myself if this could have been a bird, which gives you an idea of how low the object was to the ground and treetops. to me it looked like the object was about 100-200 feet above the trees. before this event i had been wondering, what if someone yelled \"hello!\" at a nearby ufo\\spaceship. i can tell you right as this ball like object was about to head over the trees and out of my sight, i was thinking to myself, \"should i yell at it?\" hell no i was too scared. and before i could finish the thought it was gone. haven't seen that again. kinda wish it zig zagged a little because that would have really freaked me out and added something to the story, but it seemed to be traveling straight, headed who knows where."],"City":"St Joseph","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-94.836541","Object Flight Path":"Straight-line path","Source":"MUFON","Log Number":"US-05262012-0001","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"00:00:03","map":"<A HREF = \"http://maps.google.com/maps?q=39.757944,+-94.836541(38517)&iwloc=A&hl=en\"> mufon case (38517) map </A>","Date Submitted":"05/26/2012 03:03 UTC","Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/38517.html.txt","/var/www/straped/mufon/org/38517.html"],"Summary":"Low flying sphere, no lights shot across the sky, close. Seemed golden or yellowish."}