{"files":["/var/www/straped/mufon/html2text/38523.html.txt","/var/www/straped/mufon/org/38523.html"],"Date of the Event":"05/20/2012 09:30 UTC","Log Number":"US-05262012-0007","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.673848,+-113.12419(38523)&iwloc=A&hl=en\"> mufon case (38523) map </A>","Latitude":"37.673848","Case Number":"38523","Tags":"City","divs":["Sighting DetailsMy family and I live about 20 miles north from where the sweet spot was for the annular eclipse. My family and friends had actually been at the sweet spot watching the eclipse and we were returning home for the night. We were about to go into the house when I saw a bright orange light in the sky toward the side of our house, so I walked over to investigate. When I got to the side yard I saw that there were many of these orange orbs, all appeared solid and were flying low to the ground, barely above the trees, however they didn't make a sound! They were moving from south to north. I like to think they were flying from the sweet spot too. :) I quickly started calling my family and friends over to witness this, and my friends started taking pictures and video. The orbs were in groups of three and four, no pattern, and they faded and disappeared right above my house. We could see others coming from the south as the ones nearest us were fading and disappearing. We saw at least twelve orbs, and I was able to take pictures with my cell phone. Usually my cell phone doesn't take very good pictures, but I was pretty impressed with the pictures it took that night! I wish my phone could've taken video. Part of why I've waited so many days to report this sighting was so that I could include my friends videos and pictures, but they live out of state and left the next day, so I've decided not to wait for their pics and vids, and just report this sighting with my pics. It was incredible to see these orbs, and now I can't stop looking at that part of the sky hoping to see more. The lights appeared to be orbs when seen with the naked eye, but in the pictures I've included they seem to be different shapes. In the picture with three objects, you can see one fading and the two that were right behind it are brighter but they also faded and disappeared when they got to the same spot in the sky."],"Viewing Distance":"Unknown","Longitude":"-113.12419","Object Features":"Unknown","Date Submitted":"05/26/2012 01:53 UTC","Object Flight Path":"Straight-line path","Summary":"Several orange orbs flying low in sky then disappearing","Region":"Utah","trends":["There have been 8 other sightings in Cedar City","There were no other sightings in Cedar City on or around May 20th 2012"],"Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","City":"Cedar City","Source":"MUFON","Country":"United States","Disposition":"Unresolved"}