{"Date Submitted":"05/26/2012 07:26 UTC","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.439389,+-94.19964(38527)&iwloc=A&hl=en\"> mufon case (38527) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Case Number":"38527","Date of the Event":"06/15/1994 12:00 UTC","Longitude":"-94.19964","Object Features":"Unknown","divs":["Sighting DetailsI was going camping out at my family's pond. I had gathered some wood to use for a fire and was carrying it across the dam. About 200ft to the side of the pond is a tree row, with no noise and no previous visuals there were 3 very large extremely bright lights that suddenly appeared directly behind the trees. The lights were about 15 feet off the ground and appeared to be coming from one large object, but due to the brightness of the lights I could not make out the shape of the object other than it was a large dark mass. I could not look directly at them for any period due to the brightness. Looking behind me I could see the lights were illuminating a very large area of the field. I was somewhat transfixed trying to figure out what they could be and stood there for a good minute trying to figure out what they were. Suddenly it dawned on me that there was no noise, and these lights were different then anything I had ever saw and I became frightened. I threw down my firewood and turned to run back across the dam and across the field to the house. I found it extremely difficult to move, it was as though the harder I tried to run, the slower I could move, like something was holding me back. Finally I made it across the dam and into the field, the light illuminating the field suddenly dimmed and it became very windy, however there was no sound, then the light totally diminished, it became calm, and I found it very easy to run finally the rest of the way to the house. What happened after I turned away from the lights to run, I do not know as I never looked back at them as after feeling like something was holding me back preventing me from running I was in fear for my life and did not want to look back, I was too concerned with just getting away from it and to the house. The whole ordeal I thought had only lasted a couple minutes, but upon returning to the house I realized from the time I had left with the firewood to the time I was able to make it to the house over an hour had passed and it only takes 5 minutes to make it to the pond from the house. I have never figured out how there could have possibly been an hours worth of time gone. This happened back in the summer of 1994, and I don't talk about it, but I can still see the whole thing in my mind like it was happening, and to this day I am convinced something was trying to immobilize me from moving to run away from the lights."],"Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Object Shape":"Unknown","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/38527.html.txt","/var/www/straped/mufon/org/38527.html"],"Region":"Missouri","Latitude":"39.439389","Summary":"Saw very large, very bright lights appear behind trees. No noise from object.","Log Number":"US-05262012-0011","trends":["There have been 2 other sightings in Lawson","There were no other sightings in Lawson on or around June 15th 1994"],"City":"Lawson"}