{"Viewing Distance":"Unknown","Object Shape":"Circle","Country":"Canada","Case Number":"38536","Date Submitted":"05/27/2012 04:10 UTC","divs":["Sighting DetailsSaw a strange object travelling very swiftly from the south to the north, passing below Ursa Major toward Auriga (to the right of Capella) in the north at approximately 11:50 p.m. on Saturday, May 26, from Edmonton, Alberta, Canada? Very strange indeed... I was outside putting my bedding plants into my shed for the night (heard there might be some frost tonight) when something caught my eye (I always look up especially on a beautifully clear and pleasant night like tonight as I am an astronomer). I noticed a strange red ball like object moving rather swiftly, from where I first noticed the object slightly west of zenith moving to the north to the right of Capella as seen from my backyard in Edmonton, Alberta, in the Castledowns area. It moved faster than a satellite but in a similar way, made no noise, did not get brighter as it moved toward the north, definitely not a bird (more like an aircraft but no audible sound was heard), did not look like a meteor (magnitude maybe around 0 to -1 but very diffuse as I had to strain to try and make out any shape). Just looked really stange and very different over any other aerial phenomenon that I have seen in my life. It could have been a meteor but it would be the first time that I have seen a semi-bright meteor like this as it did not flare, did not have any ionization trail or any fragmentation. To me it looked like some diffusely defined object moving rather quickly (faster than a Earth orbiting satellite and even a jet aircraft but slower than some of the slower fireballs that I have seen). Maintained a true course to the north with no deviations in its flight path. Just wanted to see if anyone else may have seen anything tonight since this is something that I have not seen before. Wish I had my 11x80 binoculars with me but it just moved too swiftly for me to even think about getting them. Maybe lasted a whole 10 seconds to go from near zenith (slightly west of zenith when first seen) to the north when I lost sight of it over my neighbours house. Really strange."],"Longitude":"-113.532607","Region":"Alberta","Disposition":"Unresolved","Date of the Event":"05/26/2012 11:50 UTC","files":["/var/www/straped/mufon/html2text/38536.html.txt","/var/www/straped/mufon/org/38536.html"],"Weather Factors":"Unknown","City":"Edmonton","Summary":"Strange moving object seen for about 10 seconds before disappearing over neighbours house","Object Flight Path":"Straight-line path","Log Number":"CA-05272012-0004","map":"<A HREF = \"http://maps.google.com/maps?q=53.626798,+-113.532607(38536)&iwloc=A&hl=en\"> mufon case (38536) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"53.626798","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around May 26th 2012"],"Object Features":"None","Source":"MUFON"}