{"Region":"Illinois","Date Submitted":"05/27/2012 12:54 UTC","Sighting Duration":"Undisclosed","Summary":"Glowing deep orange iwth indigo triangle outline with lights and circle within triangle made of red lights","Log Number":"US-05272012-0003","Longitude":"-88.770894","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.579217,+-88.770894(38535)&iwloc=A&hl=en\"> mufon case (38535) map </A>","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/38535.html.txt","/var/www/straped/mufon/org/38535.html"],"Viewing Distance":"21-100 Feet","Object Features":"Other","Object Shape":"Circle, Triangle","Tags":"City","trends":["There has been one other sighting in New Burnside","There were no other sightings in New Burnside on or around May 26th 2012"],"City":"New Burnside","Latitude":"37.579217","Weather Factors":"Unknown","Case Number":"38535","Disposition":"Unresolved","Date of the Event":"05/26/2012 10:25 UTC","divs":["sighting detailsat approximately 10:25 p.m. driving east directly into the setting, cresent moon, on route 45 south almost to the route 166 junction, when we noticed the top of the trees on the south side of the highway up ahead looked on fire. at that time a triangle shaped craft came slowly toward our vehicle and passed directly over our heads just over the tree tops. we pulled the car to the side of the road and watched and listened as the craft slowly came toward us, then slightly proceded north east direction. there was no noise, and i felt fear at being too close proximity to the craft from our vehicle. most fantastic color of orange we had ever witnessed along with deep blue rim of a triangle with a circle of red lights on the under side. the craft seemed like a it had depth, or sides but the amazing glowing orange was something i will never forget craft was one mile north of junction 166\\45 when first sited. this area is old strip mine lakes and pits. very uninhabited area. many active strip mines in operation around this area at this time. galatia illinois, equality illinois, harrisburg illinois strip coal mines in the path of the north east direction of the craft."],"Source":"MUFON"}