{"Source":"MUFON","Disposition":"Unresolved","Date of the Event":"05/26/2012 03:30 UTC","Summary":"Strange object with lights hovering, darting, glowing, pulsating","Case Number":"38537","Tags":"City","Viewing Distance":"21-100 Feet","Longitude":"-83.124454","Country":"United States","Object Features":"Undisclosed","City":"Grove City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/38537.html.txt","/var/www/straped/mufon/org/38537.html"],"Sighting Duration":"Undisclosed","Region":"Ohio","Latitude":"39.906734","Object Shape":"Diamond","map":"<A HREF = \"http://maps.google.com/maps?q=39.906734,+-83.124454(38537)&iwloc=A&hl=en\"> mufon case (38537) map </A>","Date Submitted":"05/27/2012 05:11 UTC","Weather Factors":"Unknown","divs":["sighting detailsmy boyfriend and i had stepped outside on our 3-season room to smoke a cigarette, when i noticed a light crossing the sky from left to right. when the light passed behind a group of trees, i waited for it to emerge from the other side, but it never did. i then noticed a very large glowing light that would flash atop a big tree in my back yard. it then fell like a leaf a few feet further down the tree and continued to glow, flash and change colors, including a red and a blue-green. it then went dark and flashed 50 feet over to the the right, went dark, reappeared and changed directions and then hovered by a tree in my neigbors yard for a few seconds. it then reappeared again several hundred feet over to the left and back in my yard before it disappeared. i felt so bewildered that when i finally went to bed, i couldn't fall asleep. i went back out to the patio around an hour later and after several minutes saw a larger(but still small) diamondish shaped object crossing the sky about 75-100 yards away, while pulsating\\fluttering brilliant lights that were changing from red, to white to blue-green. i observered it in this solid form for at least 90 seconds before it disappeared into the night."],"Log Number":"US-05272012-0005","trends":["There have been 13 other sightings in Grove City","There were no other sightings in Grove City on or around May 26th 2012"]}