{"files":["/var/www/straped/mufon/html2text/38541.html.txt","/var/www/straped/mufon/org/38541.html"],"Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"Over One Mile","Object Features":"None","Region":"Alberta","Date of the Event":"05/26/2012 11:50 UTC","Latitude":"53.527265","Longitude":"-113.26754","Case Number":"38541","Object Shape":"Fireball, Flash, Sphere","Disposition":"Unresolved","Source":"MUFON","Summary":"Video of glowing orb crossing sky","map":"<A HREF = \"http://maps.google.com/maps?q=53.527265,+-113.26754(38541)&iwloc=A&hl=en\"> mufon case (38541) map </A>","Country":"Canada","City":"sherwood park","Weather Factors":"Unknown","trends":["There have been 21 other sightings in sherwood park","There were no other sightings in sherwood park on or around May 26th 2012"],"Sighting Duration":"Undisclosed","Log Number":"CA-05272012-0009","Tags":"City","Date Submitted":"05/27/2012 11:40 UTC","divs":["Sighting DetailsI was up at about 11:30 PM to get a glass of water. I live in Sherwood Park, Alberta. I put some ice in the water and went to my south facing windows to have a look outside. I started to check out the stars. It was a clear night. Just then I saw a brilliant gigantic photoflash in the sky over the Camrose area. It was so bright I was startled. I continued watching to see if it would flash again, but nothing happened. I was about to go back to bed, when suddenly I saw an orange orb flying through the sky. It was coming from the direction of Ferintosh. I grabbed my camcorder and started taking video. It was bright. Brighter than the stars. I continued watching as I realized it was not a satellite, flying a slightly arced path from SE to NW. It passed to the east of Sherwood Park, probably over Toefield and I lost sight of it behing my house roof line. I ran to my front door(facing north) and picked it up again, headed to Ft. Saskatchewan or St. Albert, where it suddenly stopped. I got tired of watching it and went to bed. I got up a few times more and checked on it. It stayed there all night. I played the video only to find that my camera recorded nothing. Not even the stars."]}