{"Latitude":"42.215556","Date of the Event":"05/26/2012 11:45 UTC","Date Submitted":"05/27/2012 05:53 UTC","Case Number":"38555","City":"Vernon Hills","Longitude":"-87.964444","Object Shape":"Circle, Sphere","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/38555.html.txt","/var/www/straped/mufon/org/38555.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.215556,+-87.964444(38555)&iwloc=A&hl=en\"> mufon case (38555) map </A>","Log Number":"US-05272012-0012","divs":["Sighting DetailsMy husband and I were headed southbound on Butterfield Road when at around the stoplight at Allanson road my husband said\"what are those planes doing?? \" There was a stream of red orbs all in a line heading West. They were in groups of 4 and then 2 and 3. I said, \"oh they must be in a holding pattern for the airport and can't land\". My husband said \"the airport is way way too far south of here for anything like that and some of them are following very close together\". I then noticed & said oh my gosh your right. Looked closer and begged husband to pull over so we could get a better look and I could videotape with my cell phone. He said there was no where to pull over so I opened window and tried to tape what we were witnessing. I was terrified at this point and couldn't understand what they were. We stopped momentarily at railroad crossing and I looked out and up and there were two of these red glowing orbs directly above our car. I could see them clear as could be but couldn't make out any details. They were silent, no engine, no noise at all. They were NOT Chinese lanterns and they were not flickering as such, they were just glowing and kind of like pulsating. They were NOT airplanes or any type of helicopter or drone. They were large red glowing spheres. We crossed the tracks and went to the parking lot across the street and by this time they had gone so far I could only see one in the far distance which I believe to mean they were obviously traveling at a high speed of around 500 mph. I tried from the lot to videotape with my phone the remaining glowing red orb and didn't think I was picking anything up so stopped quickly but at home realized I did get a shot of it very briefly & I have saved it as a photo. I have video of 20 seconds of this event but unfortunately it is not great because I was doing it out the window of a moving vehicle. I was very much affected by this event and am still shook up over it. I have never ruled UFO or other life out but now that I have witnessed such an unexplainable event I feel I have witnessed something I will never forget as long as I live. It was upsetting, creepy and disturbing and I had almost wished I hadn't seen it. Again, I apologize for the poor video quality but I am glad I got anything at all. In it you can see three of these moving red glowing orbs."],"Object Flight Path":"Straight-line path","trends":["There have been 5 other sightings in Vernon Hills","There were no other sightings in Vernon Hills on or around May 26th 2012"],"Region":"Illinois","Summary":"7-10 Glowing Red Orbs Traveling Across Sky going East to West","Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON"}