{"Object Shape":"Unknown","Summary":"5 or 6 high in sky black dots, with flashing light and golden tails overhead sort of north east as I was driving toward Erie, Pa to get on Rt 90 going west. I had just entered rt. 89 N.","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.717983,+-74.002083(3855)&iwloc=A&hl=en\"> mufon case (3855) map </A>","Region":"New York","Date Submitted":"09/12/2005 07:30 UTC","Viewing Distance":"Over One Mile","Longitude":"-74.002083","Sighting Duration":"Undisclosed","Log Number":"US-09162005-0001","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around September 12th 2005"],"Date of the Event":"09/12/2005 07:30 UTC","Object Features":"Unknown","Latitude":"40.717983","Object Flight Path":"Hovering then path","Case Number":"3855","Weather Factors":"None","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/3855.html.txt","/var/www/straped/mufon/org/3855.html"],"Country":"United States","City":"New York","divs":["Sighting DetailsDriving on Rt 89 N toward erie Pa to get on Rt 90 going w. I looked up at the sky, dusk, still bright, sun was just setting, sky was light and noticed the golden tails, not like vapor trails from airplanes. I immediately thought is wasn't earth made planes. I pulled off the road and watched, they were high in the sky the tail looked attached, didn't float away, and they seemed to be going at different angles to each other, so they couldn't be planes or they would run into each other in the sky. I knew I was seeing something special. I got back on the highway after calling my sister and reporting what I was seeing and felt blessed to be a part of the sighting. One then was in front of me on the road high in the sky, saw the blinking light. I just kept driving until I lost sight of them. About 15 minutes later I called 911 they took my cell number and said they would call back if anyone else called in noone ever called me back."]}