{"files":["/var/www/straped/mufon/html2text/38568.html.txt","/var/www/straped/mufon/org/38568.html"],"Region":"Pennsylvania","Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Case Number":"38568","Summary":"Northeast Philadelphia single orb sighting","Log Number":"US-05272012-0024","Object Features":"Other, Unknown","trends":["There have been 216 other sightings in Philadelphia","There were 8 other sightings in Philadelphia on or around May 27th 2012"],"Sighting Duration":"05:00:00","Date of the Event":"05/27/2012 09:34 UTC","Latitude":"39.955405","City":"Philadelphia","Country":"United States","Longitude":"-75.162279","map":"<A HREF = \"http://maps.google.com/maps?q=39.955405,+-75.162279(38568)&iwloc=A&hl=en\"> mufon case (38568) map </A>","Source":"MUFON","Date Submitted":"05/27/2012 11:44 UTC","divs":["Sighting DetailsOn May 27, 2012, about 9:34 pm eastern time, a group of us were watching a movie. As we were sitting on the couch, I saw a light through the blinds out of the corner of my eye. At first I thought it may be lights from an air plane. However, I noticed it was very bright, very low and moving at a slow pace. I jumped up from my seat and startled everyone by rushing to the window. When I looked through blinds I saw an orange-red orb with a bright white light floating by over the treetop in the neighboring home's yard. One of the group pulled the blinds open and we were shocked at what we saw. We immediately rushed outside and saw the object passing by. As it moved it was rising into the air in the northeast direction towards Philadelphia Northeast Airport. There were no other craft in the air, and no one was around. There was no wind and there was over-cast. The object was way below cloud level even as it was ascending. It kept on a straight line path and was rising higher into the air. as it passed over the houses across the street it seemed to pick up speed. The event lasted all of 5 minutes before it floated away, into the clouds, past our line of sight over the houses. 4 of us witnessed something that it seemed no one else was around to see. There was no sound, or residual affect from it. Not something that could be mistaken for what we saw. This is the second sighting, of two different sightings in this area. I personally didn't witness the first and this is the first ever in my life. If anyone witnessed this event respond to the post or leave a description on this sight. We are very interested in knowing if anyone else out there saw what we saw tonight. Cause it was f'n freaky!!!!"],"Viewing Distance":"21-100 Feet","Object Shape":"Circle, Sphere"}