{"Latitude":"39.288776","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.288776,+-84.496127(38569)&iwloc=A&hl=en\"> mufon case (38569) map </A>","Summary":"2 large fireballs hovering then 2 more appeared 1 at a time moved to a V formation; flickering then faded out 1 at a time","Longitude":"-84.496127","Region":"Ohio","divs":["Sighting DetailsI was sitting on the front porch talking to my spouse when a light in the sky caught my eye. I looked directly at it thinking perhaps it was some type of fireworks, but it just sat there hovering. Then another just seemed to appear not far from the 1st. I asked my spouse what those lights in the sky were when I noticed a 3rd light. Jokingly I asked if it was the mother ship coming in when I noticed the 4th light. My spouse began questioning if it was some type of weird fireworks bc they all seemed to be moving, yet stationary. They were just hovering there in the sky. We walked out into the street to get a better view of all 4 lights as the last 2 were somewhat obstructed from view by trees. The lights continued to hover, but seemed to move from a pointed V formation to a flat V formation. We continued to question each other what they could be and why they would just be hovering in place, and why the V formation? I kept telling my spouse that it was crazy how they looked like fireballs, or stars that were really close and on fire. They glowed and flickered a reddish, yellowish orange glow. Then the in the opposite order that they appeared they faded out. At first it appeared the 3rd and 4th fireballs were ascending toward the north, but I couldn't be sure if they were really ascending or if they just fizzled out. Then the 2nd fireball appeared to be getting smaller. Then the 1st one appeared to be fizzling out. It appeared to have an afterglow that lingered in the sky. Again, I couldn't be sure if they ascended, burnt out or fizzled out. The 1st one I saw appeared to be the biggest and brightest of all 4 objects. Each one the appeared, appeared to be smaller than the one before it. Once they all disappeared I continued to stare into the sky. Then began looking all around in the sky. Behind me I noticed an airplane flying northeast. I was so bewildered, curious, a little unnerved and awestruck all at the same time. And I keep going back out to look at the sky. And I watched the news to see if they reported anything about it. Nothing. :("],"Date of the Event":"05/27/2012 09:35 UTC","Case Number":"38569","Object Features":"None","Sighting Duration":"00:04:00","Date Submitted":"05/27/2012 11:44 UTC","Source":"MUFON","Log Number":"US-05272012-0025","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around May 27th 2012"],"files":["/var/www/straped/mufon/html2text/38569.html.txt","/var/www/straped/mufon/org/38569.html"],"City":"Cincinnati","Country":"United States","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Fireball","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown"}