{"trends":["There have been 2 other sightings in Blue Grass","There was one other sighting in Blue Grass on or around May 27th 2012"],"Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Summary":"Two reddish-orange lights fly across sky","files":["/var/www/straped/mufon/html2text/38570.html.txt","/var/www/straped/mufon/org/38570.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.508919,+-90.765977(38570)&iwloc=A&hl=en\"> mufon case (38570) map </A>","Sighting Duration":"Undisclosed","Latitude":"41.508919","Country":"United States","Longitude":"-90.765977","City":"Blue Grass","Region":"Iowa","Case Number":"38570","Object Features":"None","Date of the Event":"05/27/2012 12:00 UTC","Log Number":"US-05272012-0026","divs":["sighting detailswas sitting outside around 10:00pm. had been watching a video on my laptop. after watching the video i was turning off my computer. while the computer shut down i looked up at the sky, which is something i normally do, just to stare at the stars. i saw a reddish-orange object flying from the southern horizon. at first i thought the object was just an airplane, they fly over all the time. as i watched i noticed there were no green\\red flashing lights like an airplane or helicopter would have. the object flew from the south to the north, directly overhead. there was never any sound. i grabbed by cell phone and tried to record the object but i must not have hit the record button. i'm not sure i would have caught anything anyway, as i never could see the object on the screen. after the object disappeared in the north i was quite shaken up. i noticed airplanes flying overhead. i kept staring up in the sky when another object appeared from behind me, as i was facing north. this one was also reddish orange in color. this one was either lower or larger as it seemed to have a shape to it. it was a circle and appeared like i was looking at it through an out of focus camera or telescope. the second object followed the exact same path as the first. i thought i might have been watching something like the space station so i checked the nasa tracking website and determined that it had flown over earlier, but in a northwest to southeast direction, so it couldn't have been that. even if it had been the iss it wouldn't have explained seeing two different objects, unless there had been another spacecraft like a soyuz that was following the iss. needless to say i'm pretty freaked out about the experience. personally, i'd prefer a logical explanation, rather than not knowing what i saw."],"Weather Factors":"Unknown","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Straight-line path","Date Submitted":"05/27/2012 11:50 UTC"}