{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/38576.html.txt","/var/www/straped/mufon/org/38576.html"],"Region":"Delaware","City":"Claymoint","Country":"United States","Object Features":"None","Sighting Duration":"00:02:00","Log Number":"US-05282012-0004","Longitude":"-75.487213","Disposition":"Unresolved","Case Number":"38576","Tags":"City","Summary":"Object was low and hovering, Could not see the structure, only the very bright. lights","Date of the Event":"11/20/2011 11:30 UTC","Date Submitted":"05/28/2012 03:28 UTC","trends":["There have been no other sightings in Claymoint","This sighting has never been favorited."],"Latitude":"39.838146","Object Shape":"Other","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=39.838146,+-75.487213(38576)&iwloc=A&hl=en\"> mufon case (38576) map </A>","divs":["Sighting DetailsI was leaving the movies with my girlfriend, on our drive heading east bound on Naamans Creek rd. I noticed this object with three(3) very bright lights that was hovering over the road. I noticed the object quite a ways out but only noticed that somthing was strong when we got close, and said to my girlfriend \"Do you see that?\", she replied \"Yes what is that a plane?\". Once we got closer, I noticed none of the flashing lights that planes or helicopters have when flying. I must note, that we live near Philadelphia PA, which has a large airport; during the sighting I noticed planes very far out and very high in altitude and could easily spot there flashing lights. The three lights were so bright that I could not make out what the objects shape was; but it looked like the lights were wrapping around the object so there could have been more on the other side. When I say bright, i'm not talking about the type of brightness that is shinning and is hard to look at, I'm talking about brightness that had no direction; if that makes any sense. The object was just hovering and moving West very slowly. The object was only 150-200 feet off the ground. When we got near I noticed that it was not over the road, but that it was over some land just North of the road, I also noticed that I heard no sound (my window was down). I kept asking my girlfriend if she could see anything I couldn't, she would reply \"I don't know what that is\". We got so close to it that she could not see because it was about to be above us and to the left of us and she needed to watch the road. I leaned forward trying to look up and left through the windshield and still could only see three bright lights just before we drove under it. Once we drove under it I could no longer see it. We drive back and forth on Naamans Creek rd. at night frequently, and we have never noticed it again. As for my feelings, I didn't feel fear or anything that made me want to get the heck out of there. I was so surprised to see this that I didn't have time to think about anything else except of what I was actually seeing. After we lost sight of the object, I looked to my girlfriend who was driving, and just said to her \"There's no chance that it could have been a plane or helicopter right?\". She replied \" I was only able to look every few seconds, and I didn't see the flashing lights that planes have\""],"Viewing Distance":"101-500 Feet"}