{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.603095,+-93.604516(3857)&iwloc=A&hl=en\"> mufon case (3857) map </A>","Longitude":"-93.604516","City":"Des Moines","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around September 14th 2005"],"Case Number":"3857","Disposition":"Unknown","divs":["sighting detailsdes moines: morning drive-time radio show station who began receiving phone calls from various locations in the state (iowa city, brooklyn, knoxville, des moines area, atlantic, 30 miles west of fort dodge,and from i-80 in the stuart - menlo area) within minutes following sighting at approximately 5:50 a.m. most witnesses had the impression they were seeing a white-to-green ball of light close up, that is, within several miles of their location, although one witness in northern iowa thought it was in the omaha area some 100 plus miles sw of his position. following show hosts verbally wondering about mufon, beverly trout, mufon state director for iowa, called in and was put on the air, giving telephone and e-mail address, and then when the show received lots of calls the following morning, with callers wondering what mufon had found through investigation, trout called in during a break and host put her on the air again. investigated by telephone by beverly trout with 10 witnesses..... white-to-green ball of light moving from east to west, with some \"falling\" motion specified by the witnesses, and with reports of 2 to 7 seconds duration, to most witnesses seeming to be at high altitude, i.e. above average commercial flight altitude of 35,000. perceived speed of object shows some variance. some witnesses indicate this was slower than a meteorite\\falling-star event, indicating a somewhat floating motion. others saw it as very fast, but still not in the falling-star\\meteor category. one witness sitting on his deck drinking coffee reports it went over his head at 90 degrees as it then headed on west. he reports a smoke trail behind it, but no diminishing in size (and upon being questioned, none of the witnesses report the ball of light as diminishing in size as it seemed to move west and downward while in their line of sight. two other witnesses indicate that they thought there might have been a little elongation (trail??) to the light the witnesses are not sure what they saw, citing color, movement etc. as being a bit different than they think a meteor ought to look - although not ruling out that possibility. one witness, a lady truck driver, on i-80 at mile marker 87 headed west to blair, nebraska, maintains that the light\\object moved to within 1\\4 mile of her position on i-80 and down over a field to the right (north side) of i-80, and at about the altitude of 300 feet the light simply went out. she wanted to stop and go investigate, but had to deliver a load to blair at 8:00 a.m., so didn't have the time. she estimates size of the light as size of semi-trailer and about ten (10) feet across, and that it was moving at no more than 50-75 miles per hour as it descended to the estimated 300 feet altitude over the field. the witness west of fort dodge, iowa was looking sw, and if he had been seeing (at the same time) what the truck driver thought she saw, he'd have had to look sse. from telephone conversations with the various witnesses, it would appear that mufon is left with an inconclusive investigation..... questions that at present have no answer: 1 - was this only one (1) event??? with the possibility that something did come down close to the ground, and then move off briefly with lights out, and then perhaps move on to resume a colorful lighted passage on west??? 2 - could there have been two (2) events (given the truck driver's perception; or was she simply way off in her estimation of distance and size? 3 - in some past cases ufos in trouble have been able to continue on their way after sometimes descending to a lower altitude; could this be an example? who knows? certainly, this remains an open case."],"Object Shape":"Undisclosed","Country":"United States","Source":"MUFON","Latitude":"41.603095","Object Features":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-09182005-0001","Region":"Iowa","Date of the Event":"09/14/2005 05:50 UTC","Summary":"White to green ball of light seen wide area of Iowa; also report from South Dakota to Des Moines call-in radio show","files":["/var/www/straped/mufon/html2text/3857.html.txt","/var/www/straped/mufon/org/3857.html"],"Date Submitted":"09/14/2005 05:50 UTC","Object Flight Path":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed"}