{"map":"<A HREF = \"http://maps.google.com/maps?q=41.97844,+-87.901711(38574)&iwloc=A&hl=en\"> mufon case (38574) map </A>","Date of the Event":"05/27/2012 12:00 UTC","Source":"MUFON","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around May 27th 2012"],"Object Shape":"Cylinder, Oval","divs":["sighting detailsi was driving west-bound on 90 just before the tollbooth when my friend noticed a bright light in the sky northwest of us. at first i thought it was a plane and reminded him that we're right by o'hare. as the object descended (in a southeast direction) and was no more than 300 feet above the ground, we were surprised at how far west of ohare it actually was and that it no longer looked like an airplane, although it was difficult to make out what it was because it was so dark out (about 11pm) and our view was obstructed by trees. as we approached where the object had passed over the highway we were able to see that it was 100 yards away and hovering about 100-150 feet above the ground. the object had an oval base and looked like a sports stadium (the height was probably about 1\\2 of the length of the base so it looked like a sports stadium that had been \"smushed\" down). there was an \"l\" like piece that hung under the bottom and reminded me of what a tv satellite looks like. the object was light colored (maybe tan or beige) and there were a bunch of thin \"l\" shaped rods that came off of the sides and pointed upwards with blinking lights on them. i could not believe how close it was and how clearly i was able to see the \"l\" shaped rods because they were not very thick. i dont remember if there were lights on the actual object itself, but the object was lit well enough that it stood out and was so clear that other cars on the road must have noticed it as they passed by too. we were in such disbelief that what we first thought was a plane on its way to ohare ended up being a ufo that we didnt feel scared, we just kept asking each other if the other person was seeing it too. i'm not really sure ive fully grasped or comprehended how real what i just saw was and what it means."],"Country":"United States","Longitude":"-87.901711","Latitude":"41.97844","Tags":"City","Date Submitted":"05/28/2012 02:29 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unresolved","Object Features":"Appendage(s), Other","files":["/var/www/straped/mufon/html2text/38574.html.txt","/var/www/straped/mufon/org/38574.html"],"Log Number":"US-05282012-0002","City":"Chicago","Region":"Illinois","Weather Factors":"Unknown","Case Number":"38574","Summary":"Stadium-like UFO seen hovering next to highway near O'Hare Airport","Object Flight Path":"Path then hovering"}