{"City":"Port Charlotte","files":["/var/www/straped/mufon/html2text/38580.html.txt","/var/www/straped/mufon/org/38580.html"],"Latitude":"26.980741","Object Shape":"Circle","Case Number":"38580","Object Features":"Unknown","Disposition":"Unresolved","Log Number":"US-05282012-0008","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Port Charlotte","There were no other sightings in Port Charlotte on or around May 27th 2012"],"Tags":"City","Object Flight Path":"Path with directional change","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=26.980741,+-82.084595(38580)&iwloc=A&hl=en\"> mufon case (38580) map </A>","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","divs":["sighting detailsport charlotte, fl, may 27, 2012. i was taking my dogs out in the backyard to run around at approximately 8:15 p.m. i glanced to the north and saw about nine orange-amber glowing balls in the distance rising from the treeline. they were in a scattered pattern but rising slowly and steadily. i didn't know what to think, so i called my friend out. he said they must be planes. but i pointed out that they were awfully close together. by that time, there must have been at least fifteen of them with still more rising\\appearing. as they would get to a certain point, they began veering to the east with the same smooth movement. he said they must be helicopters and went back in the house. i began thinking, wow, there must really be some big problem\\event, if there are that many helicopters in the sky. i remained and waited to hear the familiar sound of the helicopter engines but heard nothing; i also noted that the orange color of the glow did not correspond to any helicopters or airplanes i have ever seen in the night sky. to get to any airports in our vicinity, they would need to start moving southeast but they kept moving east and then just faded into the darkness. they did not seem to be in any sort of formation, and more lights continued to rise in less numbers for a few more minutes. they all followed the same easterly pathline and then faded away. i checked a little while later, but there were no more lights."],"Longitude":"-82.084595","Region":"Florida","Summary":"At least 15 orange-colored balls rose over the treetops in a scattered pattern and slowly headed east before faded into the darkness.","Date Submitted":"05/28/2012 09:34 UTC","Source":"MUFON","Date of the Event":"05/27/2012 08:20 UTC"}