{"Latitude":"-34.922766","trends":["There have been 15 other sightings in Adelaide","There were no other sightings in Adelaide on or around August 20th 2005"],"Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"08/20/2005 12:00 UTC","Object Shape":"Disc, Other","Longitude":"138.604855","Summary":"Dark object observed by 3 people in absolute clear sky hovering then moving.","files":["/var/www/straped/mufon/html2text/3858.html.txt","/var/www/straped/mufon/org/3858.html"],"City":"Adelaide","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Date Submitted":"08/20/2005 12:00 UTC","Weather Factors":"Unknown","Object Features":"Other","Country":"Australia","Case Number":"3858","Log Number":"AU-09182005-0002","map":"<A HREF = \"http://maps.google.com/maps?q=-34.922766,+138.604855(3858)&iwloc=A&hl=en\"> mufon case (3858) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsIn august of this year 2005, Cannot remember the exact date but do remember the exact time when I and 2 others observed the object in the sky for over 15 minutes. I had just gotten out of the shower about 6 pm, the sun was setting but the sky was not completely dark, I went to my back yard to grab a towel from the cloths line, when I immediately noticed a dark almost black object appeared to be circular very slowly travelling from east to west. As Im accustomed to seeing other planes in the area, my immediate reaction was, how come this object does not have any lights on it what so ever especially since it was starting to get dark(For air safety reasons). Then I called out to my brother and a friend who were in the kitchen at the time, and said quote'look at this weird object in the sky' they ran out and saw it as well. The object was very clear, it was very very very odd that it did not make a sound or have any lights what so ever, was just a circular dark object. It was moving east to west for a minute or so, then just stoped and hovered at that position for a good 5 minutes, then strangely started heading away from us, untill it vanished into the clouds at a distance. The second we all saw the object, we knew within a second that this was not ordinary, infact we were happy that we had seen it and laughing while staring at it, saying to each other I cannot beleive we are looking at a ufo. This was seen by 3 people and we all know for a fact that it was strange, and definately something that could not be explained. I can assure anyone it was clear and obviously a ufo, not a balloon, plane,bird or anything that could be explained away easly."],"Sighting Duration":"Undisclosed","Region":"South Australia"}