{"Viewing Distance":"Unknown","Log Number":"US-05282012-0016","divs":["Sighting DetailsFour of my friends and I were sitting in a hot tub next to the lake in the town we live in. We had just gotten into the hot tub and were observing a very strange cloud formation. The clouds were very high and the crescent moon behind them were illuminating them. The clouds had formed the shape of a Trojan soldiers profile. Very similar to the Trojan man condom logo. One of my friends who was sitting directly to my left started getting all worked up asking us if we saw it. Thinking he was referring to the odd cloud formation I looked back into the sky and noticed three very faint lights, one green, one yellow, and one blue. As soon as I saw the lights another one of our friends started tracking it as well. They formed a triangle and were very faint. I would almost describe them as ultra-violet, similar to the light colored LEDs give off. The object could have been just inside of the cloud layer creating this effect. The lights were not blinking or pulsing, they just moved from the left hand side of the valley to the right at an incredible speed. Traveling what seemed to be hundreds of miles in a matter of 20 to 30 seconds. When the lights had reached the most northern side of the lake they started to pulse, then disappeared. Two of my friends had seen it, and the other two just stared at us thinking we were crazy as we were all very scared after seeing this."],"Object Shape":"Triangle","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","City":"Klamath Falls","Date Submitted":"05/28/2012 03:06 UTC","Disposition":"Unresolved","Case Number":"38591","Region":"Oregon","trends":["There have been 19 other sightings in Klamath Falls","There were no other sightings in Klamath Falls on or around May 28th 2012"],"Tags":"City","Longitude":"-121.77255","Country":"United States","files":["/var/www/straped/mufon/html2text/38591.html.txt","/var/www/straped/mufon/org/38591.html"],"Source":"MUFON","Latitude":"42.226737","Weather Factors":"Unknown","Summary":"A triangle with a solid light on each corner crossed the entire sky rather quickly.","map":"<A HREF = \"http://maps.google.com/maps?q=42.226737,+-121.77255(38591)&iwloc=A&hl=en\"> mufon case (38591) map </A>","Date of the Event":"05/28/2012 12:00 UTC","Sighting Duration":"00:00:30"}