{"Region":"Texas","Date of the Event":"05/28/2012 03:00 UTC","Object Features":"Undisclosed","Latitude":"30.272143","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"05/28/2012 05:51 UTC","Viewing Distance":"Over One Mile","Object Shape":"Cigar","Case Number":"38593","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Cigar shape blinding white reflective flash then dull white cigar shape then disappeared.","map":"<A HREF = \"http://maps.google.com/maps?q=30.272143,+-97.737291(38593)&iwloc=A&hl=en\"> mufon case (38593) map </A>","files":["/var/www/straped/mufon/html2text/38593.html.txt","/var/www/straped/mufon/org/38593.html"],"Country":"United States","divs":["Sighting DetailsMy girlfriend and I where riding on my motorcycle south on Mopac Expressway in Austin, TX going to Barton Creek Wilderness Area. My girlfriend motioned skyward with her right hand pointing at a brilliant cigar shaped blinding flash of light in the sky to our southwest, thirty degrees above the horizon at our two o'clock. I had noticed it before she pointed it out. There were NO clouds in the sky. It was so bright it shown like a mirror reflecting light. My girlfriend thought it was very bright and so did I. My girlfriend says she began to wonder when the object became dull so quickly. The very next second it appeared cigar shaped and dull white like a commercial jet without wings or tail, like it was low flying, and it was moving to the right, then suddenly vanished. There was no where for it to go, the sky was clear and blue, no clouds at all for it to hide behind. Startled, I pulled over to see if we could find where the object might have gone, but the sky was completely empty. We both thought it was quite strange, we were both certain that we were looking directly at it when it disappeared, and we agreed we both saw it disappear while we were on my motorcycle, we were not looking away. We compared our experience a half an hour later to a small commercial jet flying at a relatively low altitude. The jet was easily identifiable as a jet and we could trace it with ease all the way across the sky. Our experience with the cigar shaped object was just the opposite. We could not trace any object flying a path across the sky, it simply vanished."],"Tags":"City","Longitude":"-97.737291","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around May 28th 2012"],"Log Number":"US-05282012-0018","City":"Austin"}