{"Region":"New York","Country":"United States","Sighting Duration":"00:15:00","Object Features":"None","files":["/var/www/straped/mufon/html2text/3859.html.txt","/var/www/straped/mufon/org/3859.html"],"Disposition":"IFO","Source":"MUFON","Weather Factors":"None","Object Shape":"Star-like, Other","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"3859","Date of the Event":"06/20/2005 03:05 UTC","trends":["There have been 16 other sightings in Utica","There were no other sightings in Utica on or around June 20th 2005","This sighting has never been favorited.",""],"Summary":"While at customer's house working on her air conditioning, we all noticed a hovering bright silver, metalic object reflecting and pulsing sunlight.","map":"<A HREF = \"http://maps.google.com/maps?q=43.105513,+-75.223344(3859)&iwloc=A&hl=en\"> mufon case (3859) map </A>","Log Number":"US-09182005-0003","Tags":"City","Longitude":"-75.223344","Latitude":"43.105513","Date Submitted":"06/20/2005 03:05 UTC","City":"Utica","divs":["Sighting Details I am a MUFON State Section Director and Field Investigator, and consider myself fortunate to have had this first hand experience. I was working on a customer's air conditioning system when I overheard their comments and discussion. There were three women sitting at a poolside table.They were asking themselves, \"what is that\"? I then looked up and saw a bright chrome metallic object seeming to hover in the sky. I looked at my watch and noted 1505 hrs. I then measured the objects altitude using two handspreads which for me equates to approx. 50 degrees above the horizon. The primary witness ran into the house and retrieved a video camera after I asked if she had a pair of binoculars. While visually observing the object an jet airplane flew by the object although at a much higher altitude. The wings and fusilage of the airplane were easilly discernable. The object seemed to hover for many minutes flashing randomly with brilliant chrome flares. I took the camera from the witness and shot approx. 10 minutes of video trying to zoom and hold the camera steady as much as possible. The object slowly moved to the N.E. until it dissapeared into the distance. Upon first seeing the object I looked for any sign of wings, or contrails. None were noted. Primary witness called local TV station, but they apparently did not see anything."],"Viewing Distance":"Over One Mile"}