{"Disposition":"Unresolved","Latitude":"43.43664","City":"Milton","divs":["Sighting DetailsOn Aug 12, 2010, I went out about 2:30 am to watch the Perseids meteor shower. I was by Milton 3 Ponds in Milton, NH, I was looking at the bottom Right star in the little dipper, when I saw a extremely bright flash at first I thought I saw a star burn out, when my eyes adjusted I noticed that the star was still there but now it was moving from left to right. My next thought was well it is just a satellite or maybe the space station, just then it stopped, It stayed stationary for about 5-6 seconds and then it started moving again but in a different direction, it now was heading toward the lake it made a large ark out and around the lake and right back to the place where I first spotted it. The next night Aug 13, 2010, my neighbor that I told what I had seen the night before ask me If I would go back to the lake and take him this time, and I did, well we were not there 10 minutes when the same object appeared again roughly in the same spot I had seen it the night before. About 5-6 minutes later my friend pointed out a really bright light in the western sky just above the tree line, we watched this bright light for a good half an hour, during this time we watched this light change from red to green to blue and also white. This light also would appear to just blink out completely for 3-4 seconds and then appear again but several feet in the sky to its left and our right, it also looked like it was moving up and down left and right and even at times in small circles this light disappeared 5 times 4 of the 5 it would re-appear but each time it came back it was a little more to its left, the 5th time it went out it did not come back. We had no clue what we were looking at and jokingly I said to my friend what would you do if it disappeared and all of a sudden it was right above us, as I finished saying that I kind of jumped and said holly sh*t that just scared the sh*t out of me, my friend quickly looked in my direction and said what?, and I replied oh that plane coming across the lake with its landing lights on, we kind of laughed but kept watching the plane, as it got closer it started looking more and more not like a plane, My friend asked is there an airport close by and I said no why? And he said then why would it be so low and have its landing lights on? Well this got us both really watching these 2 lights that I thought at first was a plane with its landing lights on, it was getting closer and we still didn`t hear any noise. As it got closer we could see it better it had 2 large flood lights in the front but we didn`t see the standard red and green blinking lights on the wings, and no wings and still didn`t hear any sound from it we were sitting in the car with the sunroof open, and the craft was coming right at us from my left across the lake. It flew just about right over us, as it got right above us it was about 3-400 feet up and it flew through a small cloud as it got right above us that was when we heard a very low like rumbling sound nothing like a plane at all, but when it entered the cloud those huge spot lights in the front lit up the whole cloud and it illuminated the whole craft in like a golden aura, that was when the 2 of us really got a good look at it and I can say it scared the hell out of us both!! It looked like a large triangle, the first thing my friend said was holy sh*t look at that it looks like a pyramid flying over us!! It had the 2 large lights in the front and one large intense strobe in the back there were no other standard lights at all on this thing! what I saw was what looked like a pyramid sitting on top of this black triangle I also saw well the only way I can describe it as a half of an arch going from half way from the rear point of the triangle from the front arching up to this pyramid shape that was on top of the triangle. On the inside of this arch looking part on the pyramid part it looked like either a row of six windows that were illuminated from inside with a golden light or maybe it was just a row of 6 golden lights. It wasn`t moving very fast at all, maybe like 40-50 MPH because we got a good look, as it went over us for I would say maybe 4-5 seconds. On the right side of the road, is a row of pine trees as it went over these trees, I jumped out of the car and ran to the other side of the road just past the row of trees is a swampy area roughly a quarter of a mile across then you hit the rest of the woods. It looked to us like it had dropped even lower when it passed the first row of trees to where I thought it was either going to land or crash into this swampy area, but when I got to the tree line I could see this thing start to move back up and over the wooded area on the other side of the swamp, and it seemed to just blink out of sight. I have never seen anything like this in my life, and I have seen a lot of different aircraft, I am a Navy vet that served during the Gulf war. I have been trying to draw what I saw but I am not a very good artist, after we got back in the car I realized my new cell phone had a camera and does take video I am really kicking myself in the butt for not thinking of using the phone to either video it or at least get a few snap shots of this thing!(This was reported to NUFROC 2 days after the sighting I just found your sight and thought you should hear about this too if you didn't already know about this report)"],"Date Submitted":"05/28/2012 11:50 UTC","Object Features":"Window(s), Appendage(s), Other","Source":"MUFON","Summary":"Looked like a pyramid sitting on top of a black triangle","Region":"New Hampshire","Weather Factors":"Unknown","Object Shape":"Triangle","trends":["There have been 2 other sightings in Milton","There were no other sightings in Milton on or around August 13th 2010"],"Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/38602.html.txt","/var/www/straped/mufon/org/38602.html"],"Longitude":"-70.978108","map":"<A HREF = \"http://maps.google.com/maps?q=43.43664,+-70.978108(38602)&iwloc=A&hl=en\"> mufon case (38602) map </A>","Date of the Event":"08/13/2010 02:30 UTC","Country":"United States","Log Number":"US-05282012-0026","Case Number":"38602","Sighting Duration":"Undisclosed","Tags":"City"}