{"Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path","Case Number":"38604","Date Submitted":"05/29/2012 12:08 UTC","Latitude":"42.539639","City":"Twin Lakes","trends":["There has been one other sighting in Twin Lakes","There was one other sighting in Twin Lakes on or around May 27th 2012"],"Region":"Wisconsin","Object Shape":"Circle","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/38604.html.txt","/var/www/straped/mufon/org/38604.html"],"Country":"United States","Object Features":"None","Longitude":"-88.242826","map":"<A HREF = \"http://maps.google.com/maps?q=42.539639,+-88.242826(38604)&iwloc=A&hl=en\"> mufon case (38604) map </A>","Tags":"City","divs":["sighting detailsout on a boat on twin lakes. object appeared in the southwest shortly after dark. was proceeding at a fast pace north west at constant speed. unknown altitude, completely silent (initially thought it was a meteor skimming the atmosphere, or space junk burning up). object traveled overhead, proceeded north east, until it slowly dimmed and finally vanished. when overhead, the color was orange\\red, as the light from a flame. it seemed to have a brighter part and a more faint part. about 5-10 minutes after the object vanished, in the direction last seen a similarly colored object rose up from the horizon in a diagonal, straight climbing flight path. it then stopped, then begin to move back toward us (it would have been traveling southeast). after a few seconds, it vanished. after another 10 minutes, a second object appeared following a similar slight path as the first (appearing in the southwest and traveling to the same spot north east. it seemed to possibly change shape. again, it vanished in about the same spot as the first. the color of the object was a gentle orange\\red. no blinking, noise, or exterior lights of any kind. impossible to estimate the height, except that it was above the clouds. she of the glowing light was circular--i cannot say if it was a dome, sphere, disk, or the lighted portion of a different craft. if i had not seen the later phenomenon, i would have considered this a meteor glowing in the upper atmosphere."],"Log Number":"US-05292012-0002","Summary":"2-3 glowing red lights in sky, moving North East.","Date of the Event":"05/27/2012 12:00 UTC","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Unknown"}