{"Case Number":"38618","Date of the Event":"05/28/2012 09:18 UTC","City":"Laguna Niguel","Longitude":"-117.700033","Disposition":"Unresolved","Tags":"City","Latitude":"33.548378","Source":"MUFON","files":["/var/www/straped/mufon/html2text/38618.html.txt","/var/www/straped/mufon/org/38618.html"],"Log Number":"US-05292012-0015","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 11 other sightings in Laguna Niguel","There were 2 other sightings in Laguna Niguel on or around May 28th 2012"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.548378,+-117.700033(38618)&iwloc=A&hl=en\"> mufon case (38618) map </A>","divs":["Sighting DetailsFirst time I have seen an event. Huge skeptic here! I was in a public pool with another lady who was swimming laps. I looked up as I often do and immediately saw two glowing orange objects moving side by side in erratic, uneven flying movement......similar to motion of slowly reeling in a lure while fishing. I was so struck dumb-founded......I yelled at the lady swimming....pointed up...and said \"Do YOU see this????? She did! Saying \"What is it? over and over.....We agreed it was not one of the many commercial jets seen in the area!! And we could tell the objects moved like no known flying machine So. 2 glowing orange objects moving from South to North in an erratic flying pattern with no: sound, vapor trail...objects moved over us seeming to be high up the clear sky....hovered over Aliso Viejo to the North of us....then changed directions they both moved South again. While the 2 objects were above us I could make out square like patterns of Red and Orange Pulsating Lights underneath....!! Then, suddenly one Glowing Object quickly starting getting dimmer!! It was ascending very fast with no noise at all. Seconds later, the remaining Glowing Object quickly ascended getting dimmer as it went seemingly straight up! And that was it! Both Objects gone. There was completely clear skies, planes flying all around in their regular patterns. I thought that surely some pilots and some passengers must have seen what we did! My reaction afterwords was shock and disbelief......and comforted that I alerted a stranger who saw exactly what I did! Being a science enthusiast, I am very confident I saw 2 Glowing Objects that moved and behaved as NO OTHER KNOWN flying machines I could think of. I stand by this true and accurate story, welcome any inquiries. Most of all, I want to know what it was that we saw last night??? Sincerely, Andy Marshall"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Date Submitted":"05/29/2012 02:48 UTC","Summary":"Spotted with another witness at 9:18pm, May 28th; 2 Orange glowing UFO's over Laguna Niguel","Object Shape":"Square, Rectagular","Region":"California","Viewing Distance":"Over One Mile"}