{"Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsLater in evening we were experiencing some high gusts of winds while camping in the Front Royal area in VA. By 9 pm the weather had calmed and we could see stars. Then we saw an object fly over us but not directly. It came from our right into the middle of the sky and seemed to stop. We had plenty of time to watch it and becuase we were being so load my husband came from his tent to see what all the fuss was about. When it first apeared when it first flew in to me it looked like a tear drop but with no tale at all. It centered itself in the sky and appeared to hover in one position for almost 3-5 minutes before we realized it had taken a 90 degree turn and was moving up and away from us. Its center looked dark read and the outside a dark orange. WE were looking for shooting stars and then this. No one had no explanation for what we all just was. After the sighting and some discussion we went to bed after the high winds and lighting returned about 2 hours later and then we went to bed."],"Viewing Distance":"Unknown","Tags":"City","Date Submitted":"05/29/2012 12:57 UTC","trends":["There have been 7 other sightings in Front Royal","There were no other sightings in Front Royal on or around May 27th 2012"],"Log Number":"US-05292012-0011","City":"Front Royal","Sighting Duration":"Undisclosed","Object Features":"None","Object Shape":"Square, Rectagular","Date of the Event":"05/27/2012 12:00 UTC","Source":"MUFON","Latitude":"38.926917","Case Number":"38614","Longitude":"-78.188655","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"came from right side of sky straight seem to stay in 1 place then turned 90 degr. and flew up and away from us. Saw it while camping","files":["/var/www/straped/mufon/html2text/38614.html.txt","/var/www/straped/mufon/org/38614.html"],"Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=38.926917,+-78.188655(38614)&iwloc=A&hl=en\"> mufon case (38614) map </A>"}