{"Case Number":"38627","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"05/24/2012 10:10 UTC","files":["/var/www/straped/mufon/html2text/38627.html.txt","/var/www/straped/mufon/org/38627.html"],"Region":"Minnesota","Date Submitted":"05/29/2012 05:14 UTC","Viewing Distance":"Unknown","Latitude":"44.949947","Log Number":"US-05292012-0024","trends":["There have been 52 other sightings in Minneapolis","There was one other sighting in Minneapolis on or around May 24th 2012"],"Longitude":"-93.243019","City":"Minneapolis","Summary":"Multiple pairs of lights","Country":"United States","Object Features":"Unknown","Tags":"City","divs":["Sighting DetailsMy wife saw what appeared to be two satellites travelling in tandem with another companion of exact brightness from west to east across sky and called me out to see it. We both realized this was strange and followed the two objects from the back yard to the front yard as they crossed the sky. They appeared as two bright star like objects travelling in tandem together, as if they were tethered by a solid line in between, like lights on each end of a ruler. The objects rotated and changed direction abruptly to the north, back to the middle of the sky. When we looked back to the middle of the sky, we were stunned to realize that there were 10-12 pairs of these same lights, all in various distances from each other, some moving in all different directions, some stationary. They were much brighter than the rest of the visible stars in the sky over the city of Minneapolis. They covered much of the visible sky. It was amazing to realize how many there were, right above us. They were definitely not stars, as we referenced star maps to make sure. Definitely not planes as we skywatch a lot and know what planes at high and low altitudes look like. These did not travel like planes, with abrupt stops and starts, as well as changes of direction. Sometimes one of the lights would split from its partner, speed up across the sky, change directions and then appear in a different location with a new partner (emerging once it stopped). Other pairs moved slowly across the sky, while some remained stationary. The moving objects tended to remain visible for longer periods of time. Unlike satellites which typically fade as they move across the sky due to reflecting sunlight, these stayed the same brightness, unless they were stationary. The stationary pairs of lights would dim, pulsate and become bright again at random frequency. We watched these lights for approximately 15-20 minutes before cloud cover moved into the area and obscured them from view. I must qualify, these objects moved in all different directions, and at varying speeds from rapid to very slow. It was not cloud cover that made it look like stars were moving. My wife and I both saw this and are avid star gazers. We have never seen anything like this before."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.949947,+-93.243019(38627)&iwloc=A&hl=en\"> mufon case (38627) map </A>","Object Shape":"Star-like","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}