{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=26.185998,+-80.1272(38621)&iwloc=A&hl=en\"> mufon case (38621) map </A>","files":["/var/www/straped/mufon/html2text/38621.html.txt","/var/www/straped/mufon/org/38621.html"],"Log Number":"US-05292012-0018","Weather Factors":"Unknown","Object Features":"Unknown","Object Flight Path":"Unknown","City":"Wilton Manors","Latitude":"26.185998","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Summary":"Took pictures of sky, turned up on one pic.","Region":"Florida","Tags":"City","Object Shape":"Triangle","Date Submitted":"05/29/2012 03:17 UTC","Longitude":"-80.1272","Case Number":"38621","Date of the Event":"05/28/2012 12:00 UTC","Disposition":"Unresolved","trends":["There have been no other sightings in Wilton Manors","This sighting has never been favorited."],"divs":["sighting detailsover the past couple of weeks i have begun taking pictures @ around or before 8pm to put on facebook. last night i went out to take a few shots which are generally done of the western sky. as i looked to the south, the colors of the sky were so beautiful and it was about to rain (again), so i started taking shots one after another. it started to shower so i went in to take a look and choose a pic for facebook. that is when i noticed the strange looking white spot on one of the pictures. it looke so out of place and i had not noticed it as i looked through the lens. the object looks white against a purple\\pink\\smoky grey sky and it is triangular shaped although from the distance that it was taken there are no sharp looking edges. the moment that i saw it on my camera, i immediatelty uploaded to my computer to get a closer look at it and it looks extremely odd. all of the pictures were taken in the same direction of the sky one after the other. i called my husband to come in to take a look and tell me if he could explain what he thought it might me...he could not. i have to say that i was not only surprised at what is in the picture, but kind of excited too."]}