{"trends":["There have been 8 other sightings in Leavenworth","There were no other sightings in Leavenworth on or around May 28th 2012"],"Case Number":"38639","files":["/var/www/straped/mufon/html2text/38639.html.txt","/var/www/straped/mufon/org/38639.html"],"Summary":"7 high alt lights","Country":"United States","Latitude":"39.326757","Disposition":"Unresolved","Date of the Event":"05/28/2012 10:00 UTC","Weather Factors":"Unknown","City":"Leavenworth","Object Features":"Unknown","Object Shape":"Star-like","Date Submitted":"05/29/2012 08:36 UTC","Region":"Kansas","Log Number":"US-05292012-0033","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-94.905494","Tags":"City","Sighting Duration":"01:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=39.326757,+-94.905494(38639)&iwloc=A&hl=en\"> mufon case (38639) map </A>","divs":["Sighting DetailsAt 10pm CST my wife and I went out on our front porch to smoke before going to bed. I like to look at the stars which is how noticed one that was moving. We had been outside for a few minuets when I saw a star like object traveling north. At first I thought it might be an airplane, but I did not see any red or green marker lights. It suddenly grow very bright then faded as it continued to travel north. It continued to fade until we could no longer see it. Soon after there was a second light that appeared in the same area as the first but traveled more to the NNW. The second also grew bright before fading from sight. A third showed up which I did not see before. It started as a bright flare which dimmed and traveled to the East. the fourth showed up in the same location as the 1st 3, but began as a bright red flash which was followed by 4 progressively weaker flashes then it dimmed from sight. The fifth showed up just NW of the fourth stayed dim and traveled to the NE. I then noticed a sixth light coming from the NW across the handle of the big dipper. After about 1 min it dimmed from sight. The last one we saw was more to the East traveling South. It repeated what we had seen with the first 2 starting out dim then got very bright. It stayed very bright for much longer than the others but then faded very fast be for we lost sight of it. Soon after the last sighting we saw a plane to the North traveling East at high alt, but you could still see the head light and flashing red and green marker lights. Then another plane towards the south all lights clear on it as well. We saw the 2 planes between 10:55 and 11. The 7 unknown lights were spaced out from 10-10:50. I have seen plenty of planes helo's etc and these lights were not like anything I have seen before. I feel like I have seen something truly amazing."],"Object Flight Path":"Stationary,Straight-line path"}