{"Country":"United States","divs":["Sighting DetailsI was driving along Division Street in Stevens Point, WI, at approximately 7:38pm, Tuesday, May 29th, when I saw a metallic silver spherical object hovering in the sky in front of me at about 30' off the horizon. I immediately recognized that it was not an airplane or helicopter as it was completely round, hovered, and had no blinking lights. I kept my eyes on the object as I went through an intersection and observed it for appoximately 15 seconds before it simply disappeared. I pulled the car over and parked along Division Street. I scanned the sky for the object and it appeared again approximately 30 seconds later. It was in basically the same place, though a few degrees off from its original position. Once again, it appeared to be a metalic silver spherical object with a very distinct outline - no lights, wings, rotors. I watched it for approximately 10 seconds before it disappeared or \"winked out\" once again. I continued to sit in the same position and scan the sky for 10 more minutes, but did not see it again. NOTE 1: I don't know if it's relevant or not, but observing the object did not make me feel excited, scared or uneasy; I simply felt as if I was observing any other sort of object. NOTE 2: This is the second time I have seen an object in the air above Stevens Point, WI, that fits the description of the object listed above. I did not report the object the first time I saw it."],"Latitude":"44.544907","Tags":"City","Log Number":"US-05292012-0036","Object Features":"None","Source":"MUFON","City":"Stevens Point","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Case Number":"38650","map":"<A HREF = \"http://maps.google.com/maps?q=44.544907,+-89.591235(38650)&iwloc=A&hl=en\"> mufon case (38650) map </A>","trends":["There have been 17 other sightings in Stevens Point","There were 14 other sightings in Stevens Point on or around May 29th 2012"],"Region":"Wisconsin","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Longitude":"-89.591235","Summary":"I observed a solid spherical object hover in the air, disappear, reappear and then disappear.","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/38650.html.txt","/var/www/straped/mufon/org/38650.html"],"Date Submitted":"05/29/2012 11:35 UTC","Date of the Event":"05/29/2012 07:38 UTC"}