{"Date Submitted":"05/29/2012 11:36 UTC","trends":["There have been 17 other sightings in Stevens Point","There were 14 other sightings in Stevens Point on or around May 29th 2012"],"Date of the Event":"05/29/2012 07:38 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving along Division Street in Stevens Point, WI, at approximately 7:38pm, Tuesday, May 29th, when I saw a metallic silver spherical object hovering in the sky in front of me at about 30' off the horizon. I immediately recognized that it was not an airplane or helicopter as it was completely round, hovered, and had no blinking lights. I kept my eyes on the object as I went through an intersection and observed it for appoximately 15 seconds before it simply disappeared. I pulled the car over and parked along Division Street. I scanned the sky for the object and it appeared again approximately 30 seconds later. It was in basically the same place, though a few degrees off from its original position. Once again, it appeared to be a metalic silver spherical object with a very distinct outline - no lights, wings, rotors. I watched it for approximately 10 seconds before it disappeared or \"winked out\" once again. I continued to sit in the same position and scan the sky for 10 more minutes, but did not see it again. NOTE 1: I don't know if it's relevant or not, but observing the object did not make me feel excited, scared or uneasy; I simply felt as if I was observing any other sort of unusual object. NOTE 2: This is the second time I have seen an object in the air above Stevens Point, WI, that fits the description of the object listed above. I did not report the object the first time I saw it."],"Object Features":"None","Longitude":"-89.557305","City":"Stevens Point","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/38656.html.txt","/var/www/straped/mufon/org/38656.html"],"Country":"United States","Latitude":"44.524983","Summary":"I observed a solid spherical object hover in the air, disappear, reappear and then disappear.","Disposition":"Unresolved","Case Number":"38656","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.524983,+-89.557305(38656)&iwloc=A&hl=en\"> mufon case (38656) map </A>","Log Number":"US-05292012-0042","Object Flight Path":"Hovering then path","Source":"MUFON","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Region":"Wisconsin"}