{"Object Shape":"Square, Rectagular","Weather Factors":"Unknown","Tags":"City","trends":["There have been 2 other sightings in Clinton","There were no other sightings in Clinton on or around May 25th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.388286,+-93.771172(38669)&iwloc=A&hl=en\"> mufon case (38669) map </A>","Source":"MUFON","Object Features":"Window(s)","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"05/30/2012 02:38 UTC","Case Number":"38669","Date of the Event":"05/25/2012 09:40 UTC","Log Number":"US-05302012-0011","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/38669.html.txt","/var/www/straped/mufon/org/38669.html"],"Latitude":"38.388286","Disposition":"Unresolved","City":"Clinton","Region":"Missouri","Country":"United States","Longitude":"-93.771172","divs":["Sighting DetailsAs reported to ASD in person on May 28: Six of us were leaving a restaurant and traveling in two cars. We headed to drop off some of our party. We were driving west on Highway 7 and as we approached the stoplight at 2nd street all of us (four of us in my car and two in another car in front of us) all saw a craft of some type in the sky just below the clouds. It had four rectangular windows in it. The car in front of us saw it first and got a better view of the object. The two people in the car in front of us said that they saw thin humanoid type beings standing in two of the windows, which emmitted a yellowish glow from inside the craft. No one in my car saw the beings but we did clearly see the windows and saw the craft back up, move down a bit, then move up into the coulds. There were no lights on the outside of the craft and it was so dark that it was difficult to see the shape of it so all we could clearly see were the four horizontal windows with a light inside of them. Our friends in the first vehicle are so shaken by this that they refuse to talk about it any more. I am reporting this because I think you should know about the incident. Surely other people saw it as well. I just can't believe it - we are all very practical people and no one has seen a UFO before, but I believe that was exactly what we saw. Since that night I've been seeing some strange big white and amber lights in the sky that look like they have webs over them and pulse different colors. I've never seen these before, either. I would like to know what is going on."],"Summary":"Large craft with windows and humanoids witnessed by six people"}