{"Sighting Duration":"Undisclosed","trends":["There have been 28 other sightings in Blue Springs","There was one other sighting in Blue Springs on or around May 23rd 2012"],"Log Number":"US-05302012-0009","files":["/var/www/straped/mufon/html2text/38667.html.txt","/var/www/straped/mufon/org/38667.html"],"Region":"Missouri","Date of the Event":"05/23/2012 11:15 UTC","Object Shape":"Sphere","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.018761,+-94.272035(38667)&iwloc=A&hl=en\"> mufon case (38667) map </A>","Country":"United States","Summary":"Three objects appear nightly for the past two weeks","divs":["Sighting DetailsAs reported to ASD by phone on May 29: For the past two weeks my family and I have been observing some strange objects in the sky that we have never seen before. We live in an area with few neighbors and have a good view of the night sky. My teenage son first saw these and pointed them out to us. He is an ameteur astronomer and has his telescope out several nights a week. I am an instructor at a local college and my husband is a physician. We thought they were planets at first, but these were not in the correct places and were too large. One of the objects is approximately three times the size of saturn. The objects are bright white in color and pulse different colors in timed sequence every second or every two seconds, and the colors are very bright. We watched three of these objects, one in the west and two in the northest sky at approximately 40 degrees from the horizon. Through the telescope it appears as if a white glowing grid is over the front of each of these, making them appear to have structure. At approximately 11:15 pm on May 23 after we had watched these for a couple of hours one of these objects dropped down to tree top level and stayed in that position for approximately ten minutes, then shot straight up in the air at light speed and out of sight. At that point, all five of us packed up our equipment and ran back into the house. We realized that what we had been looking at was probably not man-made, or if it was it was highly unusual. We saw planes and jets in the area, and have seen planes nightly, some going near the objects and some appearing to circle them. We can't tell distance, but they do look like they are fairly close to us. I saw the reports on TV and decided to let someone know what we saw so you can investigate it, but I don't want any publicity and don't want to talk to any media. I attempted to get photographs but nothing appears on the photos - the distance may be too great."],"Case Number":"38667","Viewing Distance":"Unknown","Source":"MUFON","City":"Blue Springs","Latitude":"39.018761","Date Submitted":"05/30/2012 01:59 UTC","Longitude":"-94.272035","Object Features":"Patterned Surface","Tags":"City"}