{"Object Flight Path":"Stationary,Unknown","Case Number":"38671","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","Longitude":"-94.409837","Date of the Event":"05/25/2012 10:30 UTC","Region":"Missouri","Summary":"Stationary object with flashing lights over Independence for five nights","Weather Factors":"Unknown","divs":["Sighting DetailsAs reported to ASD by phone today: I have been observing some very strange lights over Independence for the past five days when I get home from work. I live in East Independence and from my place of work in Kansas City this is not visible. It looks like the same object returns each night in the east NE sky. It looks like a craft that glows white with red and blue lights on it that pulse, or a white, red, and blue light that pulses. I have looked at this through binoculars and can clearly see these pulsing lights in the sky that have never been there before. I have lived here for 35 years and have never seen anything like it. I spent two hours looking at it on one evening and it remained in the exact same spot and did not move like the stars do over time. I called my friend in Grandview and he is seeing the same thing from his position. On another night it looked like the object was moving around in a circle. We are perplexed by these bright neon-like lights and also the size of it - the thing looks very big - it would take a penny to cover it up at arms length."],"Object Shape":"Sphere","Viewing Distance":"Unknown","trends":["There have been 67 other sightings in Independence","There was one other sighting in Independence on or around May 25th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.093796,+-94.409837(38671)&iwloc=A&hl=en\"> mufon case (38671) map </A>","City":"Independence","Source":"MUFON","Date Submitted":"05/30/2012 03:14 UTC","files":["/var/www/straped/mufon/html2text/38671.html.txt","/var/www/straped/mufon/org/38671.html"],"Latitude":"39.093796","Tags":"City","Log Number":"US-05302012-0013","Object Features":"Unknown"}