{"trends":["There have been 3 other sightings in Seaside Heights","There were no other sightings in Seaside Heights on or around July 2nd 2004"],"divs":["Sighting DetailsWe were at the edge of the boardwalk in seaside heights nj..as far out into the ocean at edge of pier as possible. It was pretty strange.It was just a large cloud cover rolled in off the ocean, coming towards us.as it got closer it was just different.as the large cloud got close to the pier it turned to our rite and continued heading south along the beach.but out over the water..As it went away from us,and it was still very close at the time. We could easily make out 6 to 8 turbine type emissions from the rear,,although there was no sound. at least not that we could hear, and again, We were very close.but also all the rides and boardwalk noise was loud,along with the waves of the ocean. This vehicle was the most amazing thing I have ever scene.because of the heavy cloud cover surrounding most of it,the rear with its flame type emission was the only very clear section,,It hovered a good 10 to 15 feet off the water..keeping in mind also. There were no other clouds in the sky.It was a clear night. Also when I say it had 6 to 8 turbine like emissions in the rear..The closest thing to compare these emissions to would be like the end of a propane torch,,only each exhaust was much larger..this was a pretty large vehicle..It hovered effortlessly,without displacing any water below..It continued slowly down shoreline hovering over water,,a good 75 to 100 yards from where water meets the sand again heading south. As it moved away the fire like exhaust was eventually covered by cloud . we watched it in amazement till it was out of sight.We looked at each other and we each asked the other if they saw that.We both agreed we did and never spoke of it again ever since..I was in awe after seeing it..I know we seen something very strange that night..I had never seen anything like it before or since..For you people into this stuff,,You would of loved it..I'm not into this stuff and I was grateful and amazed at seeing it..Not sure how I would of felt if there wasn't someone else there that saw exactly what I did.."],"Country":"United States","Object Shape":"Other, Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Other","Summary":"on a clear nite a vehicle with flame type exhaust appeared out of nowhere.","City":"Seaside Heights","Object Flight Path":"Hovering then path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.941852,+-74.070559(38673)&iwloc=A&hl=en\"> mufon case (38673) map </A>","Longitude":"-74.070559","Date of the Event":"07/02/2004 12:00 UTC","Viewing Distance":"21-100 Feet","Tags":"City","Date Submitted":"05/30/2012 06:01 UTC","Case Number":"38673","Region":"New Jersey","Log Number":"US-05302012-0015","files":["/var/www/straped/mufon/html2text/38673.html.txt","/var/www/straped/mufon/org/38673.html"],"Latitude":"39.941852"}