{"Object Features":"Appendage(s), Other","Case Number":"38686","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Object Shape":"Bullet, Missile, Cylinder","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Hartwell","There were no other sightings in Hartwell on or around January 25th 2012"],"Date Submitted":"05/31/2012 03:21 UTC","divs":["Sighting DetailsOn January 25th (I reported the event the day it occurred on another site which records the submitted report as January 25th @ 12:13:04), at approximately 10:45 AM, EST, I stood on the back deck of my house which faces SE, and looked up to enjoy the clear, blue sky. I noticed a large flying cylinder shaped object, flat dark gray in color, moving at fast clip toward the east. I said aloud to myself, \"What the heck is that thing?\" As it approached it almost resembled a torpedo or bomb and seem to be in a maneuvered descent. It came in at 120 degree angle, flew overhead and I saw a large white ring in the middle of what I believe was the undercarriage. The ring appeared to be metal with integrated \"teeth,\" much like that of a gear, facing inward toward ring's center. In the center of the ring was another, smaller dark colored ring with something in the center of it I cannot identify. Two smaller, dark colored or black rings were equidistant from the center white ring and within these was a non-reflective gray material. There were no insignia, writing, numbers, wings, propellers, portholes or blades of any kind. Yet, I surmise it was controlled or piloted by virtue of its maneuvers. The craft passed beyond where I stood and I heard the sound of a jet airliner moving in a W or SW direction, possibly to ATL, which momentarily distracted me. I looked up at the jet airliner and hoped someone was seeing what I was seeing. I turned back to look at the other craft which now appeared bluish-silver and watched it maneuver from E to N, moving at fast clip. As it turned N, I saw a shaft-like object, resembling a missile arising from the far side of the object, toward its nose. Although I consciously made a mental note to absorb more detail, what I perceived was not congruent with any of my experiential knowledge; it simply was and is beyond my scope of understanding. I watched it until it was no longer visible, turned back to the plane and thought that the flight paths of the two crafts were dangerously close: If the plane had been ahead of schedule, the two paths might have intersected at the point at which I first saw the UFO. The whole thing took place under a minute, but I felt a distortion of time and space, which I suspect anyone would feel when confronted by the surreal. I am not detail-oriented by nature and terrible at gauging distance; certainly not equipped to judge the size or altitude of aircraft. (For example, in my first report I said the airliner had to be closer, when it was not, simply because it was identifiable!) What I provide here is information which I hope someone can discredit and provide a plausible explanation for what I saw."],"Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.391459,+-82.994315(38686)&iwloc=A&hl=en\"> mufon case (38686) map </A>","files":["/var/www/straped/mufon/html2text/38686.html.txt","/var/www/straped/mufon/org/38686.html"],"Source":"MUFON","Log Number":"US-05312012-0007","Region":"Georgia","City":"Hartwell","Summary":"On or about January 24 or 25th 2012, witnessed UFO moving east, came overhead at 120 degree angle, went straight across house, changed direction, color, and shape; turned N.","Sighting Duration":"00:01:00","Latitude":"34.391459","Longitude":"-82.994315","Date of the Event":"01/25/2012 11:45 UTC","Disposition":"Unresolved"}