{"trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around May 22nd 2012"],"Object Shape":"Bullet, Missile, Circle, Fireball, Flash, Other, Unknown","Disposition":"Unresolved","Tags":"City","City":"Calgary","Object Features":"None","Country":"Canada","Date Submitted":"05/31/2012 02:38 UTC","Viewing Distance":"Unknown","Summary":"Thunderstorm 22-May-12, thought I would get some great video clips, no lightning just orbs-lights changing direction at various altitudes. Reviewed the video on 28-May-12","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=51.009748,+-114.011369(38684)&iwloc=A&hl=en\"> mufon case (38684) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Region":"Alberta","Sighting Duration":"Undisclosed","Longitude":"-114.011369","Log Number":"CA-05312012-0005","Latitude":"51.009748","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/38684.html.txt","/var/www/straped/mufon/org/38684.html"],"Date of the Event":"05/22/2012 02:30 UTC","divs":["Sighting Details22-May-12 Heading home north on Deerfoot Trail Calgary, AB Canada. Thunderstorm was quite active, thought I would record aimlessly a video on my Apple iPhone 3G, of awesome lightning. Recorded while traffic was at a standstill, approximately 90-95 degrees up and continued once the traffic moved. The video was not viewed until 6am 28-May-12 while I was uploading other photos and cleaning up memory on my cell phone. Approximately time one minute twenty-six seconds.What I noticed on the top right of the screen was several objects flying from the cell of the storm and back to the storm, from second marker, 30 seconds on for approximatley twenty seconds. Speed of the returning objects are quite fast. Objects colours vary from white lights to red-orange glowing objects, faint lights underneath the clouds trailing other lights. The clouds also lit up in a small sections for several sections, not like lightning, rather like a pulse or round flash. The latter of the video was taken in a downward direction to try get the dark cell storm area, however, I recorded reflection of merging traffic during the last few seconds. There is no reverse traffic while heading north on the Deerfoot Trail only merging. Southbound is or could crossover the overpasses. Initally when I viewed it, I was dumbfounded, as I've seen many video's with similar lights. Just didn't think I would see any on my time. I kept reviwing it over and over again, to make sure lack of sleep was not tricking me. At 6:30 am I woke my daughter to tell her what I recorded. Background music was from the local radio station. The Calgary International Airport was nearby, however, there was no visible aircraft during this video. Airport traffic is quite noticeable while low flying. Suffice to say, there was not lightning recorded but objects left to your own interpretations. To the best of my ability, this information is what I reviewed."],"Case Number":"38684"}