{"Object Shape":"Sphere","Sighting Duration":"01:15:00","Log Number":"US-05312012-0009","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.583833,+-90.195968(38688)&iwloc=A&hl=en\"> mufon case (38688) map </A>","Region":"Missouri","Disposition":"Unresolved","trends":["There have been 74 other sightings in St Louis","There was one other sighting in St Louis on or around May 31st 2012"],"Tags":"City","Latitude":"38.583833","Country":"United States","files":["/var/www/straped/mufon/html2text/38688.html.txt","/var/www/straped/mufon/org/38688.html"],"Date of the Event":"05/31/2012 01:15 UTC","City":"St Louis","Summary":"Side by side small cotton ball look to them. edge of cotton ball kind of fuzzy not smooth around it . seemed to tumble once like floating. Moving real fast east to west straight line.","Case Number":"38688","Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting the back patio with my friend. We were talking about 7 sisters. i was looking up in the northeastern sky and spotted it moving east to west steady but faster than i have seen any planes or satalites before. This was in a place called soulard missouri.I first thought it was two white ish balloons tethered together. It moved across the section of sky i was looking at in about 7 seconds untill i couldn't see it anymore, buildings and trees were in the way. They both looked fuzzy but a real kind of faded white. i could not see anything holding them close together like a tether or anything, but they were moving in tandum. they slowly switched places of sort, like a slow tumble as it moved across the sky. About a second after i first spotted it i had goose bumps and the hair on my arms back of neck and back stood up. Really freaked me out. i have seen thigs before never like this. They a lot bigger than the stars. As soon as i saw them i stood up and watched them until i could not see them anymore."],"Viewing Distance":"Over One Mile","Longitude":"-90.195968","Date Submitted":"05/31/2012 04:56 UTC","Object Flight Path":"Straight-line path"}