{"Latitude":"43.385515","Longitude":"-80.722361","Tags":"City","Object Features":"None","files":["/var/www/straped/mufon/html2text/38687.html.txt","/var/www/straped/mufon/org/38687.html"],"Log Number":"CA-05312012-0008","Region":"Ontario","Source":"MUFON","Viewing Distance":"Unknown","Weather Factors":"Unknown","Summary":"Multiple lights coming from the same direction before disappearing.","Object Flight Path":"Straight-line path","City":"New Hamburg","Disposition":"Unresolved","divs":["Sighting DetailsI had stepped outside early Thursday morning for a cigarette. It was a clear sky that night. I leaned against my car facing south east. I had noticed at the corner of my eye a dim light moving east to south. I assumed it was probably a satellite or a small plane. A few moments later I saw the same light again coming from the east and moving to the south. This time the light got much brighter before fading away. I jokingly asked if you are a UFO you will show yourself again. After I said that I looked up directly above me and saw the same object again. This time the light was much more dim then the previous sighting. It continued moving in the same direction of the two prior lights. After the third sighting I began to be histerical, I couldn't believe I was seeing these lights heading in one direction and reapearing again back where I spotted them first. I would see the lights two more times doing the same thing each time getting dimmer, the last one got so dim it was almost impossible to follow. The whole experience made my heart drop, I became so nervous but excited to what I was witnessing. I am unsure if it was one object or 5 different objects, the lights were no bigger then a small star, must have been a few thousand feet above ground. The lights were white and round, I could not give an estimate on how large the object was. Ps. Keep up the good work Mufon, one day we will all know what these lights are thanks to the work you all do. -rob"],"Case Number":"38687","Object Shape":"Circle","trends":["There have been 2 other sightings in New Hamburg","There were no other sightings in New Hamburg on or around May 31st 2012"],"Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=43.385515,+-80.722361(38687)&iwloc=A&hl=en\"> mufon case (38687) map </A>","Date of the Event":"05/31/2012 03:00 UTC","Date Submitted":"05/31/2012 04:06 UTC","Sighting Duration":"00:30:00"}