{"Object Shape":"Blimp, Bullet, Missile, Circle, Cylinder, Disc, Oval, Sphere, Other, Unknown","Date of the Event":"04/24/2012 11:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.687963,+-97.192621(38695)&iwloc=A&hl=en\"> mufon case (38695) map </A>","Date Submitted":"05/31/2012 06:25 UTC","files":["/var/www/straped/mufon/html2text/38695.html.txt","/var/www/straped/mufon/more/38695_submitter_file1__IMG201205311718021.jpg","/var/www/straped/mufon/org/38695.html"],"Longitude":"-97.192621","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"38695","City":"Arlington","Tags":"City","Country":"United States","Region":"Texas","divs":["sighting detailsi was laying flat outside on a table, next to my friend john, who saw it too. at first i thought it was just a plastic bag that had caught wind but it had a steady straight lined path. i sat up and stared at it thinking i was imagining it (i never believed in ufos) imagine you have a pattern. now copy a small section of that pattern and move it to another area on that same pattern. it looked like that. it had the sky's color (dark\\navy blue), but it had some darker values that gave it shape. most noticeably, there were dark grey grid lines on it. all over it. like a sphere with grid lines, and just like the color, these lines gave it shape. the lines were equal, and moved when the ufo morphed. before it morphed, it had glided into view (again, on a straight path.) it had appeared into my view after it passed some trees (from my point of view .) it glided (i cant describe its movement in any other words) about halfway into my viewpoint, and then stopped. when it stopped, it morphed. i couldn't describe the shape, all i know is that the grid lines moved with the transformation. it had a point somewhere in the middle of the morph, the outline of it changed into a shape unknown. the pause lasted exactly four seconds, and after it had changed into the unknown shape, it slowly and soundlessly glided out of my view. there were no lights, and absolutely no sound. the trees on the other end of my view had obscured it. my friend and i reacted as anybody would: bewildered. i stared at it and would not blink, in case i were to miss anything. i went on top of the table to get a glimpse of it over the trees but it was nowhere to be found. maybe ten minutes later, there was a loud bang and the sky almost unnoticeably flashed a very very light shade of its original navy blue for a second or less. i told other friends about it, and i learned that five of my other close friends described the same thing. and i had heard that 12 others reported it, as well."],"Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around April 24th 2012","This sighting has been favorited 4 times.",""],"Summary":"Gridded pattern, Almost blended with the sky. Soundless, HUGE, morphed","Latitude":"32.687963","Sighting Duration":"00:03:00","Object Features":"Patterned Surface","Object Flight Path":"Hovering then path,Straight-line path,Other","Log Number":"US-05312012-0016"}