{"Longitude":"-89.486038","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=38.911944,+-89.486038(38693)&iwloc=A&hl=en\"> mufon case (38693) map </A>","Date of the Event":"05/27/2012 10:45 UTC","Tags":"City","Source":"MUFON","Case Number":"38693","Object Features":"Wings","City":"Greenville","Sighting Duration":"Undisclosed","Date Submitted":"05/31/2012 03:24 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsAbout 20 of us, family and friends, were wrapping up a birthday party for my son. We had been sitting outside on lawn chairs. Several teenagers were on the other side (West) of the house. The adults were sitting in the front yard (East side). I started to get out of my chair and just happened to be looking up to the East, when a concentrated bright orange (very dark orange) beam started piercing the clouds shining directly on us. It was about 3000 feet in altitude. My first impression, was crap, a 747 is about to land in my yard as I thought what I was seeing was a plane with its landing light on. But, we live out in the sticks and there would be no reason for landing lights to be on. But I then quickly realized the beam of light was too concentrated for a landing light, and the color was too dark of orange. Everyone quickly said something to the effect \"what in the heck is that?\" It was coming in from East to West right in line with my house. Everyone quickly assembled in front of my garage as we met the panicked teenagers coming around from the back of the house at that location. At that point the beam of light shut off and the craft banked slightly to the right bearing northwest. This was almost on top of our house which sits on 40 acres. When the beam was off we could clearly see a diamond shape of lights that formed the outline of the craft. There was an orange light at each tip, non-blinking. Also, the craft had a bright red pulsating light which didn't appear to be directly centered in the diamond shape. We were all amazed and in agreement that this was no aircraft any of us had seen before. It was also silent. It traveled about the speed of a small plane, at a constant speed. We all watched as it gradually disappeared to the northwest several miles away. Two theories developed among us about the beam of light. One thought was that we were being checked out (we were really lit up) by the craft and the beam was shut off once it figured we were no threat. The other thought was that perhaps the pilot was not familiar with our atmosphere so was using the beam to navigate through the clouds it was encountering."],"Latitude":"38.911944","Disposition":"Unresolved","Summary":"Diamond Shaped - Orange Light on Each Tip (non blinking) with One Red Pulsating Light offset from Center - Emitted Dark-Bright Orange Beam","Country":"United States","files":["/var/www/straped/mufon/html2text/38693.html.txt","/var/www/straped/mufon/org/38693.html"],"Region":"Illinois","Log Number":"US-05312012-0014","trends":["There has been one other sighting in Greenville","There were no other sightings in Greenville on or around May 27th 2012"],"Weather Factors":"Unknown","Object Shape":"Diamond"}