{"Object Features":"Unknown","Object Flight Path":"Stationary","Country":"United States","Region":"New York","Log Number":"US-05312012-0018","Disposition":"Unresolved","Case Number":"38697","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around May 31st 2012"],"Summary":"A series of bright lights appeared over Manhattan. Very strange activity.","files":["/var/www/straped/mufon/html2text/38697.html.txt","/var/www/straped/mufon/org/38697.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.723583,+-74.002973(38697)&iwloc=A&hl=en\"> mufon case (38697) map </A>","Viewing Distance":"Over One Mile","Date Submitted":"05/31/2012 10:03 UTC","Object Shape":"Cross, Star-like","Sighting Duration":"Undisclosed","Date of the Event":"05/31/2012 09:00 UTC","City":"New York","Longitude":"-74.002973","divs":["sighting detailsi arrived home from the store at around 8:55pm tonight. it had just gotten dark outside. my girlfriend called me over to our bedroom because she had just witnessed a series of lights appear out of nowhere over manhattan. from our house, we can see the skyline of manhattan island. i looked outside of the window and saw 5 very distinct lights hovering over the island. they were decently spaced apart and very still. one of the lights, the one in the center, was prodominantly bright. the others ( 2 on each side of the center light) were glowing, but only as strong as a dim candle. i then called my sister up to our apartment so we could use her binoculars to get a better idea of the lights and rule out the possibilty of airplanes. as i stared through the lens i saw that the bright lights had a cross shape to them. i could not see an outline of a craft. it was as if it did not want to be identified. for the next half-hour, the brightest light in the center would begin to fade as one of the lights on the side would flash\\pulse a red\\orange glow. at this point, the brightest light would fade and exit slowly towards the left side of manhattan until it was no longer over manhattan. the red\\orange light would then shift towards the place the original center light was. it would then grow a bright, yellow light like that of a light-bulb. this would continue until all the lights would dissapear. it is now 10:02 pm, and i have seen an additional 5 lights go through the same routine as the ones i described above. i have also noted two small red\\orange lights on the right side of manhattan."],"Tags":"City","Latitude":"40.723583","Source":"MUFON"}