{"map":"<A HREF = \"http://maps.google.com/maps?q=38.8037,+-116.414519(38701)&iwloc=A&hl=en\"> mufon case (38701) map </A>","Object Shape":"Square, Rectagular","Latitude":"38.8037","Region":"Nevada","Case Number":"38701","Country":"United States","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Object Features":"Window(s), Insignia","Date of the Event":"05/30/2012 12:00 UTC","Weather Factors":"Unknown","Source":"MUFON","City":"Almost 100 miles above LV","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There have been no other sightings in Almost 100 miles above LV","This sighting has never been favorited."],"Tags":"City","Log Number":"US-05312012-0021","divs":["Sighting DetailsMe and my grandfather had left this small town somewhere mabye 100 miles north of Los Vegas. We were driving on the road when we saw an extremly bright light. My grandfather was driving. We followed it as it slowy hooverd over the road mabye 50 ft away. Then it came to a stop but we didnt. When we where mabye 20 to 30 ft away it gave off this extremly bright blue green light and slowely landed. When it landed we stopped the car but remained in it. It took probably three min for all the lights to instantly stop then a gold light was shot down and a ape or man like object exept much taller and with a straight back like a robotic being was slowely beamed down. When it hit the ground all he lights went dead and the car was the only light i could see. I was something run past the lights then the sky lite up again with the UFO the UFO gave off this horrible noise and an extreme amout of lights and my grandfather passed out. After he passed out the noise stopped and so did all the lights. Now it was just glowing yellow and redish or orange. After it seemed to put on a show for me with alot of movement back and forth like dancing. After it landed for no reason afew times a wierd path was in the sky and ufo followed it until it was onlya star. My grandfather does not remember this. I think due to the sound and ights but he woke ip right then in the middle of the dessert"],"Date Submitted":"05/31/2012 10:52 UTC","Viewing Distance":"20 Feet or Less, 21-100 Feet","Longitude":"-116.414519","files":["/var/www/straped/mufon/html2text/38701.html.txt","/var/www/straped/mufon/org/38701.html"],"Summary":"Extremly bright and fast but seemed to dance around our car then go then come back"}