{"Case Number":"38702","Region":"Wisconsin","Longitude":"-87.757155","Date Submitted":"06/01/2012 12:02 UTC","files":["/var/www/straped/mufon/html2text/38702.html.txt","/var/www/straped/mufon/org/38702.html"],"Object Flight Path":"Stationary","City":"Sheboygan","Log Number":"US-06012012-0001","Country":"United States","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.795909,+-87.757155(38702)&iwloc=A&hl=en\"> mufon case (38702) map </A>","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Sheboygan","There were no other sightings in Sheboygan on or around May 30th 2012"],"Latitude":"43.795909","divs":["Sighting DetailsI was in an open field flying an RC plane. The weather on that day was stormy and later in the evening it was clearing and partly cloudy with white clouds and sun. The object was seen when my plane flew over head and I was watching it and out from behind a cloud I could see clearly this object, shaped like a soda can (vertical position) and vividly bright silver. I know it was not a plane or blimp as it was not an aluminum color but a very bright silver and the shape was so very clean in terms of seeing it clearly. As it came from behind a cloud it had to have been fairly high and would estimate at least a mile away, which would put it fairly close to being over lake Michigan, or over the lake. The size of it had to be significant There was no movement at all and no sound detected. My first thought was that it was nothing that I had seen before. We have jets flying over at times but much higher than this was. Secondly it was such a clean view, no haze, sun light was shinning on it, but it did not seemingly reflect the light, the light made it stand out very clearly. My feeling was that of excitement in the sense that I have been observing for some time, and this was clearly something that was unique and obviously did not belong there. Had to refocus on my plane, came around again I would say 20 seconds and landed and looked, for some time and it was gone. I am curious if any others spotted this object. I would assume even fishing boats in the lake would have had a good view of it as well. I would appreciate any information on this sighting if others saw it as well..."],"Summary":"bright vivid silver, clear outline, like a soda can in shape upright","Date of the Event":"05/30/2012 07:35 UTC","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cylinder","Source":"MUFON"}