{"Source":"MUFON","Disposition":"Unresolved","City":"Novato","Sighting Duration":"Undisclosed","Latitude":"38.109193","Weather Factors":"Unknown","Object Features":"Unknown","divs":["Sighting Detailsi have never seen a ufo before and don't know anything about the search for them except for what i've seen on t.v. over the years. this is just what i saw tonight. it was definitely the most unusual, interesting and kind of scary thing I have witnessed in the skies. especially when it seemed an airplane was going to crash right into it. sent by me to the marin independent journal tonight may 31st around 11p.m. right after i saw event. i live at marion and 8th street in novato ca and i just witnessed at about 10:50p.m. two fiery red objects very large in appearance heading south-west to north-east direction. these were nothing like anything i've ever seen before. they came 2 minutes apart and glided through the sky making no noise whatsoever. i believe it was not in any standard flight path. in fact, the second one went right past an airplane which was going in the direction of sfo. the airplane was very audible but the fiery thing was not. very interesting occurence; i hope someone can explain it, i'd be thrilled to know what they were because they were kind of majestic as well. i caugth it on cell phone video but i can't download it right now. email me if you would like it. Sent to the local mufon chapter same time: i just saw two very unsual objets glide slowly across the sky over novato in a northeasterly direction. they arrived about two minutes apart and were bright bright orange like fireballs,. oi don't know much about meteors but i went to a meteor reporting website and everythinkg there was reported as being blue or green or multi colored and having a tail and burning out and etc. these objects lost no intensity of color. that stayed the same as they each kept going until they disappeared into the horizon. they were off of flight paths i'm sure. in fact the second one passed right past an airplane headed easterly toward sfo or oakland airports. another strange thing. they made no noise whatsoever. i have cell phone video but its not very good. i would love to have someone analyze it or even better, if anyone else saw it how can i connect. thanks."],"Region":"California","Viewing Distance":"Over One Mile","trends":["There have been 18 other sightings in Novato","There was one other sighting in Novato on or around May 31st 2012"],"Tags":"City","Summary":"like fireballs but def not meteors, bright fire that never faded. seemed on a flight path. crossed paths with an airplane.","Date Submitted":"06/01/2012 02:56 UTC","Case Number":"38706","Date of the Event":"05/31/2012 10:45 UTC","Longitude":"-122.578297","Log Number":"US-06012012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=38.109193,+-122.578297(38706)&iwloc=A&hl=en\"> mufon case (38706) map </A>","files":["/var/www/straped/mufon/html2text/38706.html.txt","/var/www/straped/mufon/org/38706.html"],"Object Shape":"Circle, Fireball, Star-like","Country":"United States","Object Flight Path":"Straight-line path"}