{"Summary":"On May 31 2012 at 9:25pm in Peoria Arizona three people observed two objects emitting a bright orange light flying in a west-to-east trajectory outsaide their home","Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"06/01/2012 04:38 UTC","Latitude":"33.737294","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/38718.html.txt","/var/www/straped/mufon/org/38718.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.737294,+-112.254479(38718)&iwloc=A&hl=en\"> mufon case (38718) map </A>","divs":["Sighting DetailsOn May 31, 2012 at 9:25pm in Peoria Arizona three witnesses observed two bright orange lights flying silently in an east-to-west trajectory outside their home. We were facing north as the \"orbs\" flew by from west to east (left to right). The lights were bright orange, almost the same color as a street lamp and the light-halo emitting from each object was approximately 10-20ft in diameter. Both objects were identical size and shape. The lights did not strobe or flash but remained the same brightness and consistency the whole time. There were no visible wings or landing gear or any other physical characteristics we could see. We did not see any landing lights or flashing strobes. The orbs were flying just above nearby Westwing Mountain at approximately 500-600 feet altitude. The orbs were independent of each other staying 100 or so feet apart from each other. They were flying at a constant speed of 30-40MPH due east under their own power. One orb was about 10 feet higher than the other but both traveled at the same speed. It was very quiet out and no sounds could be heard coming from the objects. The objects continued on their eastern trajectory until eventually one of the objects dimmed and disappeared. The other object remained in view as it continued east for approximately one minute after which it disappeared from view as well. As they were flying away and we could see the rear of the objects they still appeared to be bright orange lights. One of the witnesses filmed the event on a Canon PowerShot SD750 digital camera. Weird. No idea what they were."],"Case Number":"38718","Weather Factors":"Unknown","Date of the Event":"05/31/2012 09:25 UTC","Region":"Arizona","Log Number":"US-06012012-0008","Source":"MUFON","Tags":"City","City":"Peoria","trends":["There have been 13 other sightings in Peoria","There were no other sightings in Peoria on or around May 31st 2012","This sighting has never been favorited.",""],"Sighting Duration":"00:05:00","Longitude":"-112.254479","Country":"United States","Disposition":"Unresolved","Object Flight Path":"Straight-line path"}