{"trends":["There has been one other sighting in Hamilton City","There were no other sightings in Hamilton City on or around February 12th 2012"],"Weather Factors":"Unknown","Case Number":"38720","Date of the Event":"02/12/2012 12:00 UTC","Summary":"predwan craft, large, hovering, when I got out of car and whistled loudly and waved i silently moved off to SW still just above tree tops","Object Features":"Unknown","City":"Hamilton City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38720.html.txt","/var/www/straped/mufon/org/38720.html"],"Source":"MUFON","Country":"United States","Longitude":"-122.008051","map":"<A HREF = \"http://maps.google.com/maps?q=39.74748,+-122.008051(38720)&iwloc=A&hl=en\"> mufon case (38720) map </A>","Log Number":"US-06012012-0012","Date Submitted":"06/01/2012 09:08 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailspredawn leaving property in a wooded area on sacramento river saw what at first i assumed was a helocopter b\\c it was hovering. although it had many more ights than a copter and all around, above and below, with several colors, which i don't exacty recall now, white, blue i recall for sure, perhaps 12 or so lights total. it was shaped not unlike a football but less accentuated \"ends,\" it appeared to be symetrical fron to back top to bottom, although oblong. i jumped from car when i realized not a copter (we have copters for field chemical applications out here)and whistled and waved. it then moved off silently toward the sw at a speed of about 20 mph or so, still noiseless. i have tried to fit this in a know craft behavior, but i can't, so i give up and am reporting now. i can't say why i whistled and waved, except that it was close enough, although still dark out, to see it was solid, close and big and i whistled while it was hovering. i felt it began to move away after that, it felt like it was in response to my curiosity and had i not jumped out may have had a longer witness. hard to imagine an alien craft and yet i can't think of any known craft we have that behaves like that. i want to think it was a helicopter, but it just doesn't fit visually or in it's silence."],"Object Shape":"Other","Object Flight Path":"Hovering then path","Latitude":"39.74748","Region":"California","Sighting Duration":"Undisclosed"}