{"trends":["There have been 28 other sightings in Blue Springs","There was one other sighting in Blue Springs on or around May 28th 2012"],"Weather Factors":"Unknown","Log Number":"US-06022012-0003","Summary":"Star-like white light traveling over Blue Springs, MO high straight 40 degree then light out","Case Number":"38736","Date of the Event":"05/28/2012 12:00 UTC","divs":["Sighting DetailsUFO sighting 28 May 2012 We are a 67 & 68-year old couple from Jefferson City, MO. We believe in UFOs but have never seen one before this. We were camping near Blue Springs, MO this past weekend. On Monday night 28 May 2012 it was getting dark when I looked up at the sky. I could see the row of satellites but it was too light to see the stars. 5 minutes later I looked up and saw the brighter stars. Again 5 minutes later I looked up and could see thousands of stars. I also noticed a Jet plane heading west with its flashing strobe lights. It was about 10 degrees west of straight up, heading west. I then saw a light going over the jet, a great distance away, heading east. It was about 50% faster than the jet. It was a continuous white light as bright as a bright star and similar in size. We watched it for the couple of minutes it took to get to about 30 degrees east from straight up. The constant bright light turned off. We watched for a couple more minutes and it did not reappear. There were no clouds around, the hundreds of stars around it were always visible."],"City":"Blue Springs","Latitude":"39.018411","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Date Submitted":"06/02/2012 12:51 UTC","Longitude":"-94.273275","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/38736.html.txt","/var/www/straped/mufon/org/38736.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.018411,+-94.273275(38736)&iwloc=A&hl=en\"> mufon case (38736) map </A>","Country":"United States","Object Shape":"Circle","Region":"Missouri","Source":"MUFON"}