{"Log Number":"US-06022012-0002","Longitude":"-87.827624","Country":"United States","Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"41.582069","Tags":"City","Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"06/02/2012 12:47 UTC","files":["/var/www/straped/mufon/html2text/38735.html.txt","/var/www/straped/mufon/org/38735.html"],"trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around March 17th 2012"],"Disposition":"Unresolved","Object Shape":"Cylinder, Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=41.582069,+-87.827624(38735)&iwloc=A&hl=en\"> mufon case (38735) map </A>","City":"Tinley Park","Date of the Event":"03/17/2012 07:50 UTC","Region":"Illinois","Summary":"came out of t-storm in south and flew overhead looked like fireball but never came down","Case Number":"38735","Sighting Duration":"00:03:00","Viewing Distance":"Unknown","divs":["Sighting DetailsI was at home in my driveway when I noticed a glowing orange object come out of a thunderstorm cloud that was south of my position. Object kept flying toward me, went over my head and continued heading off to the north. I took out my phone and snapped off pictures of it as it was coming toward me, overhead and moving away. It made no noise and left no smoking trail even though it looked like a fireball. I watched the object till it was no longer visible to me. The object NEVER changed altitude and continued in a straight path to the north. I was fascinated when I looked at the pics though. When I enlarge the pictures on my phone the fireball isn't a fireball it is a glowing orange line that changes shape. If I tilt the phone a little I can make out the outline of the cylinder from the heat source. The glowing line is inside of the cylinder. But that ONLY shows up on my phone, it wont transfer to the computer. My opinion is it was a cloaked object that was struck by lightning. I still have the original pics on my phone if needed."]}