{"Region":"Michigan","Log Number":"US-06022012-0015","map":"<A HREF = \"http://maps.google.com/maps?q=44.246607,+-86.315933(38748)&iwloc=A&hl=en\"> mufon case (38748) map </A>","files":["/var/www/straped/mufon/html2text/38748.html.txt","/var/www/straped/mufon/org/38748.html"],"Disposition":"Unresolved","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsIn 1985 I was in my third year in the U.S. Air Force at Keesler AFB, MS. I came home in May to metro Detroit, Michigan on leave with my one year old son and wife. After a few days of visiting with family and friends I decided to go with a friend to Manistee National forest to do some fishing over the weekend. Just prior to arriving, my friend and I pulled over at a gas station where he asked me if he could drive my new Ford Bronco II the rest of the way to the campground, to which I agreed. Approximately 10 minutes after leaving the gas station and with my friend driving at approximately 1:00am, my friend looked in the rear view mirror and asked me \"what is that following us?\" I then turned around from the passenger seat and looked out the back of the vehicle which was traveling at approximately 45mph. What I witnessed was an \"object\" that was approximately the size of a two story house with mo descernable outline with thousands of overlapping red lights going on & off at different intrivals, but they were going on & off like \"dimmer switches\" which created a pulsating appearance. My mind was trying to put it into a catagory of \"something.\" I then turned to my friend and said, \"I don't know what the hell it is.\" I then turned back to the object and noticed four yellow \"slits\" in the lower left hand corner. They were approximately 4ft long and approximatley 6-8in wide, shaped like eyes with bright yellow lights coming out, stacked one on top of the other, two sets next to each other. As I stared at it, the eye shaped lights became wider at the same time, aproximately 2ft wide for approximately 10 seconds, they then went back to narrow, 6-8in. As I stared at it trying to find a catagory in my mind, it...disappeared. I then turned around in the passenger seat and didn't say a word and neither did my friend, for approxiamtely 30 seconds. We both started talking at the same time, him saying, \"I ain't telling no one\" & me saying \"I'm telling everyone.\" To which he said, \"No one is going to believe you and they're all going to make fun of you and accuse you of being on drugs, to which I replied, \"I don't care, I saw it.\" Immediately after the incident we started noticing deer out in the road, approxiatley 10-15. We had to slow down to 5-10mph to keep from hitting them and as we drove by them, they didn't move. My friend was right, everyone I told laughed and made fun. Even my own wife said, \"I believe you saw....something.\" This incident as haunted my mind ever since. 20 years after that incident (2005), I was in the approximate area and witnessed \"somthing,\" not of a \"unidentified flying\" nature, but more of a ? \"supernatural\" orgin."],"Case Number":"38748","Latitude":"44.246607","Tags":"City","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Manistee","There were no other sightings in Manistee on or around May 15th 1985"],"Object Shape":"Unknown","Sighting Duration":"Undisclosed","Summary":"Manistee National Forest, MI.,1985 \"something\" the size of a house followed my vehicle for approximately 30 seconds.","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Manistee","Date of the Event":"05/15/1985 01:00 UTC","Date Submitted":"06/02/2012 09:38 UTC","Longitude":"-86.315933"}