{"files":["/var/www/straped/mufon/html2text/38750.html.txt","/var/www/straped/mufon/org/38750.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.449228,+-74.948472(38750)&iwloc=A&hl=en\"> mufon case (38750) map </A>","Date Submitted":"06/02/2012 09:55 UTC","Weather Factors":"Unknown","Longitude":"-74.948472","City":"Delaware","Case Number":"38750","Log Number":"US-06022012-0017","Disposition":"Unresolved","trends":["There have been 6 other sightings in Delaware","There was one other sighting in Delaware on or around June 15th 1975"],"Object Flight Path":"Hovering then path","Object Shape":"Other, Unknown","Country":"United States","Region":"Delaware","Sighting Duration":"Undisclosed","Latitude":"40.449228","Tags":"City","Date of the Event":"06/15/1975 08:00 UTC","Object Features":"Other","Viewing Distance":"101-500 Feet","Summary":"This event happened or 35 years ago. Craft was to big to see the ends or shape!","Source":"MUFON","divs":["Sighting DetailsFirst let me say this event happened over 35 years ago (somewhere in the early 70's). My wife and I were returning to New York from Penn. via 95. It was approx. 8PM and dark. As we approached Wilmington on 495 we saw a lot of different lights in the sky in front of our car at approx. 300'-500' high. Now remember, we are traveling at 60mph on a multi-lane highway in the middle lane. Hard to stop. I remember there was a river to the right of the highway. As we approached the lights I could see the object was enormous. It filled the windshield with no visible end in any direction. No end to the mutitude of lights. As I drove it moved ever slow slowly to my right across the sky. It seemed to stand still. There was no sound we could hear over the car noise. The best discription I can give to the object comes from the movie \"Forth of July\". They had it right. It was a vertual city upside down. My wife and I accepted what we saw and kept on truckin. When one considers the great exspance of space, who would travel in a little saucer? We are telling our story now just for the record."]}