{"trends":["There have been 4 other sightings in Savage","There were 2 other sightings in Savage on or around June 1st 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Viewing Distance":"Unknown","Date Submitted":"06/02/2012 10:37 UTC","files":["/var/www/straped/mufon/html2text/38752.html.txt","/var/www/straped/mufon/more/38752_submitter_file1__IMAGE.JPG","/var/www/straped/mufon/org/38752.html"],"Log Number":"US-06022012-0019","Latitude":"44.786664","City":"Savage","Date of the Event":"06/01/2012 07:30 UTC","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Case Number":"38752","divs":["sighting detailswas sitting on deck ~7:30 6\\1, leaned back and looked up, noticed white star-like object (like seeing venus during the day). was very light out yet. kept watching, it was lower than high clouds which were moving to the sw as the clouds passing over did not obscure it. it slowly moved, almost imperceptable, to the ssw over the course of an hour and i lost sight behind treeline. walked out behind trees about 20 minutes later and it was still there in extreamly slow path to ssw. checked in another 20 minutes and did not see anything anymore. about 15 min later, again on the deck, i glanced up and it was directly overhead again litterally stationary, the whole time i saw it you could barely see it move (at arms length with your thumb and small finger extended it moved that distance in a half hour). while we watched it, a cloud passed over it, about 10 seconds after the cloud passed it got about 50% brighter for about a half second then disappeared. both my daughter and i saw the same blink \\ disapearance because we both said '....did you see that...\" at the same time. was outside until about 9:00pm and didn't notice anything else. our backyard has a lot of trees so we're limited to a view of 90deg plus or minus 25 degrees. last note, as i opened up the picture i took, i just noticed what could be a second object below the first, did not notice it when i took the picture."],"Object Flight Path":"Stationary,Straight-line path","Country":"United States","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=44.786664,+-93.327841(38752)&iwloc=A&hl=en\"> mufon case (38752) map </A>","Tags":"City","Weather Factors":"Unknown","Object Features":"Unknown","Summary":"Starlike object overhead moving extreamly slow","Longitude":"-93.327841","Source":"MUFON"}