{"Tags":"City","files":["/var/www/straped/mufon/html2text/38768.html.txt","/var/www/straped/mufon/org/38768.html"],"City":"Pikeville","Object Features":"Unknown","Log Number":"US-06022012-0028","Object Flight Path":"Path with directional change","Object Shape":"Fireball","Longitude":"-82.530697","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.482938,+-82.530697(38768)&iwloc=A&hl=en\"> mufon case (38768) map </A>","Summary":"Multiple yellow, glowing lights seen drifting up from the horizon and heading higher and eastwards","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Over One Mile","divs":["sighting detailswhile driving my car on hambley blvd. in pikeville (pike county), kentucky towards hwy 23. on june 2, 2012 at approximately 10:18 pm edt i was alerted by my son in the front passenger seat to the presence of strange lights in the sky on his, northern, side of the vehicle. i pulled over and we both got out of the car to observe the lights. there were six to eight lights that appeared to be drifting higher and towards the east. they were yellowish and appeared to glow and at times twinkle red. each light drifted up from the same point at the horizon. they never changed direction nor speed. after several minutes they faded out in the cloud cover. another vehicle also pulled over and the driver got out to observe the lights as well. after a few minutes, fewer lights emerged and after about ten minutes the entire incident was over. no sound was heard. there were no stars in the sky due to the cloudy\\foggy conditions and the moon could also not be seen. there were no other objects, including aircraft, observable during the incident. i have never seen anything like this and have no idea what is was, other than the lights being quite odd."],"trends":["There have been 3 other sightings in Pikeville","There were no other sightings in Pikeville on or around June 2nd 2012"],"Date Submitted":"06/02/2012 11:56 UTC","Latitude":"37.482938","Weather Factors":"Unknown","Date of the Event":"06/02/2012 10:18 UTC","Region":"Kentucky","Case Number":"38768","Sighting Duration":"00:10:00"}