{"Longitude":"-79.529759","Log Number":"US-09222005-0001","Object Features":"Unknown","City":"Greensburg","files":["/var/www/straped/mufon/html2text/3876.html.txt","/var/www/straped/mufon/org/3876.html"],"Date of the Event":"09/22/2005 01:55 UTC","Latitude":"40.303258","Case Number":"3876","Date Submitted":"09/22/2005 01:55 UTC","trends":["There have been 21 other sightings in Greensburg","There were no other sightings in Greensburg on or around September 22nd 2005","This sighting has never been favorited.",""],"Region":"Pennsylvania","Country":"United States","Object Shape":"Sphere","divs":["Sighting DetailsI was driving in my car down route 30 towards greensburg. I saw a very bright light hovering in the sky in the distance. At first i thought it was the moon or a tower light, but i had never seen it there before. It was too bright to be a tower and too small to be the moon, plus i could see the moon. The object stood still for a few seconds and then moved straight up slightly, then fell out of the sky at a 45 degree angle. It fell very low to the ground, I thought that maybe it hit ground. It fell directly in front of me and to my right. It fell below the level of the buildings in the area, but I was unsure of its exact distance away. It startled me. I drove towards it down Pittsburgh Street trying to see if I could still see it, but it was gone. I know it wasn't a comet because it lacked a tail it was just a ball of white light. I was at the top of the hill and I tried to get closer, but once i was in the valley I turned around and went home. It was in about the same area that I was in a few weeks ago, but the other time it was a series of three green flashes of light in the sky, big enough to see from a great distance. I was inside at the time, but immediately after the last flash all the power in the area went out, it only went out for a minute or so, but I think that the two events were connected. This would have been about the same time last month."],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.303258,+-79.529759(3876)&iwloc=A&hl=en\"> mufon case (3876) map </A>","Summary":"white ball of light fell out of the sky"}