{"Date of the Event":"06/02/2012 08:30 UTC","Region":"California","Country":"United States","Source":"MUFON","City":"Irvine","Case Number":"38773","map":"<A HREF = \"http://maps.google.com/maps?q=33.689137,+-117.792994(38773)&iwloc=A&hl=en\"> mufon case (38773) map </A>","Date Submitted":"06/03/2012 02:58 UTC","Summary":"a UFO","Latitude":"33.689137","Object Flight Path":"Path then hovering","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38773.html.txt","/var/www/straped/mufon/org/38773.html"],"divs":["Sighting DetailsWas driving about 8:30 pm on 241 toll road souhbound between irvine blvd and portola pkwy. Going off ramp to pay toll looked out my drivers window at 60 degrees and noticed what I thought was helicopter very red and looked as if it was on fire bottom was flames red color on top. I then thought it was a hot air balloon.. but it was flying to fast. The bottom definitly had flames eminating from it. It moved in southeast to northwest direction for about one to two miles. I stopped my truck and starred right at it as it hovered over the road about 500-1000 feet above. It was not a helicopter or plane or balloon. I am 53 yrs old and have a masters degree and have never seen anything like this....ever. I went to get my camera phone and video it but by the time I got it I looked up and just as I was to aim at it it VANISHED. No sght of it again. It disappeared. It as though was watching me and my actions and new I was going to photograph it and vanished. I then dialed 911 and reported it. Of course what was I reporting ? A ufo not an emergency but no one seemed concerned or had any sense of urgency. I also contacted channel 4 nbc but again nothing. Also I reported it to irvine pd. But nothing as well. I have never seen anything like this and I am positive it was not manmade. It was definitely a ufo and definitlety not an aircraft or meteor or asteroid or comet. Feel free to call me. I SAW IT ..IT WAS REAL and WAS A UFO..."],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Log Number":"US-06032012-0005","Object Shape":"Circle, Square, Rectagular, Other","Sighting Duration":"Undisclosed","Object Features":"Other","Longitude":"-117.792994","Tags":"City","Weather Factors":"Unknown","trends":["There have been 28 other sightings in Irvine","There were no other sightings in Irvine on or around June 2nd 2012"]}