{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.622935,+-88.201949(38778)&iwloc=A&hl=en\"> mufon case (38778) map </A>","Disposition":"Unresolved","Log Number":"US-06032012-0010","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Summary":"10+ Orange lights moving in parallel line west to east then dissipating into upper atmosphere.","Date of the Event":"06/02/2012 10:15 UTC","Viewing Distance":"Over One Mile","Object Shape":"Other","divs":["Sighting DetailsAfter dark about 10:15 central. Clear sky. No clouds and a very bright moon shining from the east. Was in driveway with garage door open looking from garage door opening to end of driveway, having parked vehicle in driveway from street curb moments prior. Gazing westward listening to loud music from a house party a few blocks away in the westward direction, it is common to witness path of commercial airliners in the distance on approach to O'Hare moving south to north, from the westward sky, and to see another airline path of planes to my south moving west to east for landing at Midway Airport. In between both flight paths, I witnessed a series of orange lights or objects moving slowly in my direction from west to east looking like a string of helicopters in formation. The series of lights or objects did not have any pattern, but were each moving in parallel, very slowly, with one another in the same direction - eastward. There were NO Red or Green blinking beacons on each light as I would see on any commercial or private aircraft in the night sky at any altitude. At first appearance, the steady stream of orange lights appeared to be approaching aircraft lights on a long and slow approach, to final at a runway, but they would continue on their slow path eastbound until one by one they would disappear in the upper atmosphere almost overhead of me at near 75 degrees upward, but slightly to my south. These lights could not be mistaken for meteors, because of their very slow speed. Meteors would simply flash across the horizon. The formation of numerous lights in a string made me first think of helicopters flying in formation at low speeds. As I watched this string of lights move west to east and slowly dissipate in the upper sky one by one at about the same point in the sky, I ran into the house and retrieved my camera. The attached photo does capture the remaining lights in the direction I identified, but by then, the majority of the lights had disappeared leaving the remaining trail of lights as seen in the photo. After taking the photo and watching the string of lights slowly pass and disappear, a minute or more went buy then came another light in the same path, then about 30 seconds later, another lone orange light appeared in the westward sky on the same path and direction. Then under one minute another came into view. Same path, same speed, same point of disappearing into the upper atmosphere, or so it appeared, above and to the south of me. I will add that the lights were not pulsating, but remained viewable as consistent orange glows throughout. After I took the photo, I told my wife to come out and look. She too witnessed the remaining orange lights from the original string of lights. She went back indoors, that's when after about a minute or more looking westward, after the original string of lights disappeared overhead, that the independent lights came into view. That's when I walked over to my neighbor that was in her front yard walking her dog. I asked her to look at what I was viewing and she too acknowledged not being able to describe what the lights were. Behind me, I had my garage lights on, the outside house lights and the moon was very bright to the east. All of which spread a great deal of light pollution preventing me from capturing the orange glows with more clarity."],"City":"Plainfield","Date Submitted":"06/03/2012 12:12 UTC","Longitude":"-88.201949","Object Features":"Unknown","Region":"Illinois","files":["/var/www/straped/mufon/html2text/38778.html.txt","/var/www/straped/mufon/more/38778_submitter_file1__DSC02691.JPG","/var/www/straped/mufon/org/38778.html"],"Source":"MUFON","Country":"United States","Latitude":"41.622935","Case Number":"38778","Tags":"City","trends":["There have been 20 other sightings in Plainfield","There were no other sightings in Plainfield on or around June 2nd 2012","This sighting has never been favorited.",""]}