{"Country":"Canada","Case Number":"38777","divs":["Sighting DetailsLong story so.. take a coffe before reading! And... sorry for my poor english, i'm a french Canadian! So, I'll begin with the situation. Frist of all, i'm not a crazy fruit cake person. Or... not so much more than most of peoples! ;) I like paranormal, but, i'm also a sceptic and believe in the same way. I'm in between so... All my stories, are for me...always in my minds. Trying to scientifically analyse it! PLEASE: don't read this part in () if you're in a hurry or on a rush. Or just not interested by my profile and my old strage stories. (((((((((Since i'm young, many stranges things occured around me. At 4 years old, i was the type of child how was talking abouts GOD in a way particulary strange for my mother... who was a beliver. For me, the nature was god. The countrys fighting for names of gods... haved wrong. She never understood me! In the same age... all what a can remember is, this fear, than occur the night, in my room. I remember some presences, looking me and touching me... But, I can't remember the faces and all! I've sleep under my blanket for many years... and each night... until 20 years old! I dream on the september 11, in the same time than the second plane was crashing in the tower. I was in this plane...in the dream. When I woke up, I was alone in my house, no t.v or radio on. But, when I open the t.v... Surprise, it was occuring! I said many futur things, to many peoples in my life... and it was accurated! I saw, orange flying ball in my 10 years old. And one day, in 2006, this story. After my work's day, I had decided to back home by new path. Then,I started to walk on a street, that goes to the North. Strangely, may matter in the direction that I was walking, I always came back to the same point. In face of the same building. I walked 10 minutes to the South, North, East... probably for 30 minutes but, i was like in a return eternal point... I was walking in straight lines??? No curves!!! Up to a point, I find myself out of this infernal maze. But in fact, when I looked my watches, it was more than 2 hours after my departure. A strange story... that I still can't understand now!)))))))) Now, i'm 32 years old! Since my 27 years old... i'v not really experience things! Except: Since 1 year ago, I became obsessed with UFO, extra begins and all. Nothing about the story on 2012.. Before this... It was on my mind but..in a strange way. Like, since i'm young, i've the feeling than i've no place on earth. Please don't mistunderstood! It's not pooring my life! And i'm not thinking than i'm not human!!! loll Just this feeling sometimes...than they are something about me, than is not totaly understood by myself... But, in the same times, many flying strange object begins to past around my house! Big light globes in the sky. Red, blue, green. Each week since 1 years ago. I started to suffer of the Banshee syndrome. This feeling of being awake and, where you can't move. It's really scary! I have many dreams about flying vessels and abductions. In one of these dreams, they was examining me physically. I began to scream and crying with my mind: let me alone and do not hurt me! I wanted to ask them what they thought of humans! I couldn't see anything except a blinding light, and silhouettes. Since then, I also have terrible physical pain. I was examined by doctors because my heart still beats too quickly. About 120 beats minutes resting. In the effort, I turn from 120 to 190 in 2 seconds! Doctors do not find why! Even after 2 weeks of hospitalization in cardiology! Dreams are more occurrents and, the appearance in the skies also! When during 1 week, there was nothing, I'm better physically also! This is it! A coincidence? I don't know? I continue to live normally! I'm not really afraid. I do not spend my day to think about this! But you can say, that I throw the head into the sky... much more often! Please, If you do not believe these stories, don't let me bad messages. It is already very difficult to talk about it. Because Yes, I do not want you to say that I'm crazy and all. As many people, who keep silent, because they fear opinions of others! Thank you!"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.51098,+-73.551992(38777)&iwloc=A&hl=en\"> mufon case (38777) map </A>","City":"Montreal","Latitude":"45.51098","Source":"MUFON","Tags":"City","Region":"Quebec","Longitude":"-73.551992","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Log Number":"CA-06032012-0009","Object Shape":"Sphere","Summary":"Many apparitions since 1 year, dreams, panic and more...","Sighting Duration":"Undisclosed","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/38777.html.txt","/var/www/straped/mufon/org/38777.html"],"trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around May 30th 2012"],"Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"05/30/2012 12:00 UTC","Date Submitted":"06/03/2012 11:37 UTC"}