{"Sighting Duration":"00:01:29","Weather Factors":"Unknown","Case Number":"38772","Date of the Event":"05/18/2012 02:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.255039,+-66.06792(38772)&iwloc=A&hl=en\"> mufon case (38772) map </A>","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Disposition":"Unresolved","Country":"Canada","Source":"MUFON","Longitude":"-66.06792","Tags":"City","divs":["sighting detailsi was watching the moon on a clear night from my window may\\18th\\2012 at 2:48am and noticed a white glowing orb going over the top right of the moon.as i watched to see if it was a plane it slowed down over another bigger object on the left side of the moon, as i ran down my dark yard i leaned against my building to steady my camera and i saw the first orb speed up over the bigger one that had the different colored lights on it and change shape, then there were 2 white orbs and the big object there which made three,and it was huge. the sky was dark and thats how i first noticed them. i wasn't sure what it was but knew it wasn't a normal object cause it slowed down the went faster. the bigger ufo was fading in and out but my camera caught the lights on it and i steadyied myself by leaning against the building to get a better video of it all, the saw the 2 brighter one's which really freaked me out even now cause this isn't the first time i saw something in the night skies, i bought a sony 70 times 2000x zoom handycam and decided to catch the moon colors that night and caught these instead,i lost site of the big ufo with the colored lights as i tried to follow the 2 white lights, the bigger ufo was lost and ended up with what i am sending mufon now. i have another video and pics of a ufo that flew fast my house while recording a chopper in the daytime and will be sending it to you later and very soon. thank you for believing in what we see and do catch on video."],"Log Number":"CA-06032012-0004","Region":"New Brunswick","Viewing Distance":"N/A","Object Shape":"Boomerang, Oval, Sphere, Other","trends":["There have been 12 other sightings in St John","There were no other sightings in St John on or around May 18th 2012"],"Latitude":"45.255039","Date Submitted":"06/03/2012 02:29 UTC","Object Features":"Window(s), Patterned Surface","Summary":"2 bright ufo's orbs and 1 really big shaped ufo","files":["/var/www/straped/mufon/html2text/38772.html.txt","/var/www/straped/mufon/org/38772.html"],"City":"St John"}