{"files":["/var/www/straped/mufon/html2text/38781.html.txt","/var/www/straped/mufon/org/38781.html"],"Date Submitted":"06/03/2012 01:47 UTC","Date of the Event":"06/02/2012 09:16 UTC","City":"Cedar Rapids","map":"<A HREF = \"http://maps.google.com/maps?q=41.98712,+-91.663023(38781)&iwloc=A&hl=en\"> mufon case (38781) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Case Number":"38781","trends":["There have been 17 other sightings in Cedar Rapids","There were no other sightings in Cedar Rapids on or around June 2nd 2012"],"Viewing Distance":"Unknown","Object Shape":"Circle","Country":"United States","Sighting Duration":"00:05:00","Tags":"City","Longitude":"-91.663023","Object Flight Path":"Straight-line path","Latitude":"41.98712","divs":["sighting detailsat around 9:15 pm cst, i went to take the dog outside and i saw three large, bright, non-blinking red lights in a triangle formation, floating low on the horizon, across the clear cedar rapids, iowa (usa) sky, in a nw to se direction. i excitedly went inside to get my family, and when we came back out, low and behold, there were about 12-15 more in random spacing following the same nw to se pattern. one of them actually lost its lighting, but we could still view it, even though it was unlit. eventually, after about 4-5 minutes, they all faded, one-by-one, on the e\\se horizon. we could not believe our eyes and could not identify them. i'm an avid skywatcher and never saw anything like this in my life. they were not aircraft, meteors, balloons, or satellites. i called kcrg tv9 newsline, and they mentioned recieving other calls about this sighting. what were these strange lights? there has to be a logical explanation. sorry--i'm so disappointed, as i tried to videotape them with my camera, but the batteries were dead..."],"Object Features":"Unknown","Log Number":"US-06032012-0013","Summary":"Strange Bright Red Objects over Cedar Rapids, Iowa Sky June 2, 2012 9:16pm CST","Region":"Iowa"}