{"Object Shape":"Fireball, Star-like","trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around June 2nd 2012"],"Case Number":"38780","City":"New York","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38780.html.txt","/var/www/straped/mufon/org/38780.html"],"Viewing Distance":"101-500 Feet","Object Features":"Unknown","Latitude":"40.74715","Log Number":"US-06032012-0012","Country":"United States","divs":["sighting detailscounted 9 flying lights over glen oaks, queens, ny on 6\\2\\12 around 10:30pm. definately no planes or helicopters. no sound. flying low and then going up. the lights could not have been larger than a couple of feet. my husband and i were walking the dog around 10:15p et when i saw the first light. at first i thought it might be a helicopter at the distance but e color of the lights was too orange to be an aircraft and when it got closer it looked too small (maybe 3 to 5 feet) and too quiet to be a helicopter. the first light was moving on an strainght line and same altitude and then started ascending and gliding on the same direction but on an ascending trajectory. at that moment i looked to the area where this object came from and another object was coming on a similar flight path and also started ascending in a similar flight pattern. after this second one more kept coming and i counted 9 in total. all of them followed a similar path and they all were like a minute or two appart. i took a video,of the last three. i could not attached the video from my ipad but i can e-mail it to you if you send me and e-mail and i can reply with it. i never saw how they dissapeared in the distance as i was always looking back for the next one to come by. i was very afraid since i had no idea what these were. i actually had dreams about extraterrestrial invasion to the earth last night. i would like to find outmwhat these were."],"Tags":"City","Region":"New York","Object Flight Path":"Straight-line path","Date of the Event":"06/02/2012 10:25 UTC","Date Submitted":"06/03/2012 12:50 UTC","Longitude":"-73.711822","Summary":"Counted 9 flying lights over Glen Oaks, Queens, NY on 6/2/12 around 10:30pm. Definately no planes or helicopters. No sound. Flying low and then going up. The lights could not have been larger than a couple of feet.","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.74715,+-73.711822(38780)&iwloc=A&hl=en\"> mufon case (38780) map </A>","Sighting Duration":"Undisclosed"}