{"Case Number":"3879","Country":"United States","Log Number":"US-09222005-0004","Tags":"City","Latitude":"34.061864","City":"Los Angeles","Summary":"Small craft. Left behind a very potent light-like trail of smoke?","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","divs":["sighting detailsi walked outside my apartment and noticed a very bright light that was stretched out like a line against the clear black night sky. at the left end of the light trail, i noticed an object that was moving at very high speeds and the light source seemed to have been coming from some sort of exhaust. it stopped dispersing this trail of light in the same way a pilot would use smoke to write things in the sky and then shut off the smoke. then the object just disappeared. 10 seconds later, it appeared again (not at the same spot it disappeared), which is when i started to record the object with my phone's video camera function. it remained in the sky for another minute and again disappeared. both my girlfriend and i have witnessed the phenomena. i do not have a computer link for my phone which contains the video, but i am very willing to share it with whoever can tell me what it was i just saw. even though the object disappeared...the light trail remained and did not even dissolve in the sky like smoke would. in fact...the light turned from a very bright white\\blue to a bright red\\pink. no clouds visible."],"Sighting Duration":"Undisclosed","Date Submitted":"09/22/2005 07:30 UTC","Date of the Event":"09/22/2005 07:30 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 22nd 2005"],"Source":"MUFON","Disposition":"IFO","Viewing Distance":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/3879.html.txt","/var/www/straped/mufon/org/3879.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.061864,+-118.239815(3879)&iwloc=A&hl=en\"> mufon case (3879) map </A>","Longitude":"-118.239815","Object Shape":"Undisclosed"}