{"trends":["There have been 16 other sightings in Sioux Falls","There were 13 other sightings in Sioux Falls on or around May 31st 2012"],"Viewing Distance":"21-100 Feet","Tags":"City","Weather Factors":"Unknown","Case Number":"38791","Latitude":"43.558285","Object Flight Path":"Straight-line path","Sighting Duration":"00:03:14","Region":"South Dakota","Object Features":"Dome","Summary":"Both were bright white and bigger than blimps. They were shaped like blimps and were moving very slowly to the right.","Date of the Event":"05/31/2012 07:24 UTC","Longitude":"-96.696007","Country":"United States","Object Shape":"Blimp","City":"Sioux Falls","Log Number":"US-06032012-0019","map":"<A HREF = \"http://maps.google.com/maps?q=43.558285,+-96.696007(38791)&iwloc=A&hl=en\"> mufon case (38791) map </A>","divs":["Sighting DetailsI was outside near my cornfield when I looked up to see two bright white lights moving very slowly to the right. They were shaped like blimps and one was on top of the other with distance apart. They moved behind trees where I could still see them. I was watching the UFO untill it disapeared out of sight. Durring the sighting a plane was going by but not near it. It was going the opposite direction. I though the UFO had went behind a building but when I went in front of the building there was nothing in sight but just trees and the moon. It made a faint sound that sounded a little like a plane and a buzzing sound. I did not have any sort of recording device near me at the moment so I had no way of recording the incident. I talked to people around me like neighbors but no one else had seen the two objects. The UFO's were very large compared to the moon that was above them. They were the size of half moons if not larger. I kept searching every night after that to see if I could see the UFO once again but I saw nothing. The first time I saw it I thought they were blimps or planes but they were so close together that I wouldn't be possible. They were also to large to be either. It only moved a little bit, about the speed of slow clouds. The sky was clear and there were no clouds. My mother called me crazy and I was just seeing things. I saw the reflection through my bedroom window and that is why I turned around and looked. I had never seen anything like it and it was so amazing. I never really had believed in such things untill then. I had watched the show Fact Or Faked many times and thought all of it was faked. I was very surprised to realize that none of it was fake. There really or UFO's and aliens."],"Disposition":"Unresolved","Date Submitted":"06/03/2012 04:00 UTC","files":["/var/www/straped/mufon/html2text/38791.html.txt","/var/www/straped/mufon/org/38791.html"],"Source":"MUFON"}