{"Sighting Duration":"Undisclosed","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/3882.html.txt","/var/www/straped/mufon/org/3882.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Country":"United States","Weather Factors":"Unknown","Date of the Event":"08/27/2005 08:45 UTC","Tags":"City","divs":["Sighting DetailsI'm an amateur astronomer. I was in my back yard doing some naked-eye stargazing. About 8:45 PM CDT I noticed a solid, white unblinking light moving due north. It appeared a few degrees east of Alioth, the 1st star in the handle of the Big Dipper. At that time it was about 40 degrees above the NW horizon, at an azimuth of 315 degrees. By it's brightness (about the same as Alioth at magnitude 1.8) and speed I assumed that it was a satellite in low orbit. I watched it for maybe 30 seconds, until it was near Megrez, in the upper left corner of the \"dipper\", then looked away. That's about 5 degrees south of where it started. Less than a minute later I looked back and it was gone. Instead there was a much dimmer light but moving at exactly the same speed and over exactly the same path, but in the opposite direction. I'd estimate it's brightness as similar to Megrez, or magnitude 3.3. It disappeared within a minute when it was a little south of Alioth. There was no noise, no change in color or brightness or direction except that presumed course reversal. BTW, I used astronomy software to get all these numbers except duration. That's an estimate. Everything else is accurate. I tried to find out what I saw. I had seen a satellite about 15 minutes earlier in another part of the sky. When I checked to see what satellites were visible between 8:20 and 9:20 I was able to identify that first satellite, but no satellites passed close to Alioth at all. I'm also an amateur pilot, and I doubt it was an aircraft; there were no running lights and no strobes. It couldn't have been a landing light because it got dimmer, not brighter, as it moved south. I know this is not exactly a major sighting but this is the 1st moving thing I've ever seen in the sky that I couldn't readily identify, and I've been looking for a long time --- I'm 58."],"Object Features":"Unknown","City":"Michigan City","Log Number":"US-09232005-0003","trends":["There have been 15 other sightings in Michigan City","There were no other sightings in Michigan City on or around August 27th 2005"],"Date Submitted":"08/27/2005 08:45 UTC","Region":"Indiana","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.707539,+-86.89503(3882)&iwloc=A&hl=en\"> mufon case (3882) map </A>","Summary":"what looked like satellite disappeared, then reappeared moving in opposite direction","Source":"MUFON","Latitude":"41.707539","Case Number":"3882","Longitude":"-86.89503"}