{"Country":"United States","Object Features":"Undisclosed","Disposition":"Unresolved","Date of the Event":"06/02/2012 12:00 UTC","Case Number":"38846","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/38846.html.txt","/var/www/straped/mufon/org/38846.html"],"divs":["Sighting DetailsI did not see a UFO in the air. I awoke and a shadow caught my attention. At first I thought it was my eyes, I'm 31 and have never been so freaked out in my life. My dog never barked or alerted me. I'm not even sure why I woke up. When I blinked s everal domes and rubbed my eyes I realized I was seeing something. My windows are low so the figure could not have been more than 4ft tall. It was a shadow of a head, larger than a human head and a little skinny neck and shoulders (a bust) that's all I could see. It moved so slowly that, I got the chills. In the other window (we have 5in our master) there was a tall super skinny shadow that slightly made a \"y\" at the top. As soon as the shadowy figure moved away from the window I hit my husband so hard and (do not to sound completely nuts) I told him someone was outside. He turned on all the lights and grabbed his gun.... :( and ten minutes later, we checked outside and nothing. When we went back to bed I laid there looking for the shadows, but they were both gone. I didn't really go back to sleep and I can't figure out what it was. Help please."],"Latitude":"32.444193","Log Number":"US-06032012-0076","Object Flight Path":"Undisclosed","Viewing Distance":"20 Feet or Less","Tags":"City","Source":"MUFON","trends":["There have been 63 other sightings in Abilene","There was one other sighting in Abilene on or around June 2nd 2012"],"Summary":"not a ufo but a figure.","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.444193,+-99.764647(38846)&iwloc=A&hl=en\"> mufon case (38846) map </A>","Longitude":"-99.764647","Date Submitted":"06/03/2012 07:02 UTC","City":"Abilene","Object Shape":"Other"}