{"Summary":"At a stop light i saw the object in front of me to the right... high over the Lake. I WILL TAKE A LIE DETECTOR TEST TODAY TO PROVE THIS! I KNOWWWWW WHAT I SAW!!!!!!","Longitude":"-90.067352","Latitude":"29.952476","Sighting Duration":"Undisclosed","Log Number":"US-06042012-0004","Disposition":"Unresolved","Region":"Louisiana","map":"<A HREF = \"http://maps.google.com/maps?q=29.952476,+-90.067352(38868)&iwloc=A&hl=en\"> mufon case (38868) map </A>","Country":"United States","Tags":"City","Case Number":"38868","Date of the Event":"11/15/1995 02:00 UTC","Object Features":"Dome","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around November 15th 1995"],"Date Submitted":"06/04/2012 10:32 UTC","divs":["sighting detailsi was just driving along pontchartrain dr. in slidell, la. heading to the 5 mile bridge. as i stopped at the ref light at the oak harbor entrance, i clearly saw a disc shaped object above & to the front\\right of me. it caught my eye when i looked up at the traffic light. i was stunned because i absolutely knew what this was. i've never seen anything like this, and couldn't believe i was seeing this. i felt exhilaration, fear, complete disbelief at what i was looking at with my own eyes. cars behind me started to honk, the traffic light had turned green. so i whipped into the closest parking lot & got out of the car, ran around the side of the building to catch sight of it again, and it was gone. my sister came and picked me up... i was hysterical. i am certain of what i saw!!!!! i never spoke of it before, because people i know who know me, advised me that others wouldn't believe this. i've always kept this memory close & guarded... i do know for sure i saw a ufo. i will take a polygraph. i want to know if there have been sightings anywhere around that area as well. i just haven't known what to do with this information, i pray i can get someone to hear me!! what should i do?"],"City":"New Orleans","files":["/var/www/straped/mufon/html2text/38868.html.txt","/var/www/straped/mufon/org/38868.html"],"Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc","Object Flight Path":"Stationary"}