{"Summary":"2 bright orbs flying silently in a straight line","Log Number":"US-06042012-0003","Latitude":"34.186763","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","trends":["There have been no other sightings in Reseda","This sighting has been favorited 1 time."],"Region":"California","Country":"United States","Case Number":"38867","map":"<A HREF = \"http://maps.google.com/maps?q=34.186763,+-118.553311(38867)&iwloc=A&hl=en\"> mufon case (38867) map </A>","Date of the Event":"06/03/2012 06:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere","Date Submitted":"06/04/2012 08:36 UTC","City":"Reseda","Disposition":"Unresolved","Longitude":"-118.553311","Source":"MUFON","files":["/var/www/straped/mufon/html2text/38867.html.txt","/var/www/straped/mufon/org/38867.html"],"Weather Factors":"Unknown","Tags":"City","divs":["Sighting Detailsi was at a friends house in Reseeda CA up in the valley north of LA. we were sitting on the porch when one of the people said hey what are those dots in the sky are those balloons. we all looked up and quickly realized they were not balloons they were hovering perfectly still and totally unaffected by the wind. then after about a minute of watching them they begin to move. on other thing i forgot to mention was that at first tehy were both white but as they began to move one of them changed to a pinkinsh red color. the 2 orbs began to move across the sky in what seemed like a perfect line and very slowly. they drifted over us and off to the left hand side.on top of all of this there were lots of planes in the air as his house is in the flight path of the burbank airport. i watched as several airplanes at high altitude and leaving vapor trails passed below the orbs leading me to believe they were very high in the air. through all of this they remained dead silent. we could tell because when the planes cleared the sky there was no noise at all. we followed the orbs across the sky and to the left of his yard when all of a sudden the pink one just disappeared. at first we thought we just lost sight of it but it was gone and seconds later the white one vanished as well. it was really strange to say the least. on top of all of this this is the second time within one months time that i have seen this same thing. about two weeks ago i observed 2 pure white orbs over my house with one disappearing while the other sat and hovered for several minutes until it to vanished. i was able to snap pictures the first time because i was at home and had my nikon d200 with me. today though i only had my phone. i recorded a quick video but you cant really see anything there. either way its all just strange to me and i wonder if anyone else saw these orbs as well? i will post the 3 photos from the first encounter for you guys to check out and tell me what you think"],"Object Flight Path":"Hovering then path,Straight-line path","Object Features":"None, Unknown"}