{"City":"Palmerton","Date Submitted":"06/04/2012 12:05 UTC","Country":"United States","Object Features":"None","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/38871.html.txt","/var/www/straped/mufon/org/38871.html"],"Longitude":"-75.602597","Tags":"City","Region":"Pennsylvania","Summary":"2 maybe 3objects discovered in series of photographs","Object Flight Path":"Stationary","Latitude":"40.809983","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Square, Rectagular","divs":["Sighting DetailsSome time after taking artist reference photos April 15, 2010, on the Kittitinny [sp?] [Blue] Ridge about 7 miles southwest of Palmerton at \"Bake Oven Knob\" which is located near the corner border of several counties, and also from two photos taken at foot of mountain, - I discovered either two or three stationery silvery rectangular reflective objects, shaped like an oil drum, maybe twice as tall as wide, and slanted about ten of fifteen degrees to the left. I have the impression these may be cylinders. I was at about 1,300 feet for most of these photos, and the objects show up in several photographs, slightly higher than I, perhaps at 1,500 to 2,000 feet, on a bright sunshiny spring day. Apparently these objects were concealing themselves in a haze layer hanging over the valley, which was not very deep. They certainly were a hazard to civilian aircraft, while apparently having nothing else better to do. These were not visible to my eye in the glare when the photos were taken, but the camera caught them, whatever these may be. It took projecting the photos onto a Vizio TV screen to be discovered. The photographs were taken from several positions, with decent permanent landmarks, which should make some triangulation possible. Work with better programs may bring out detail. The weather was otherwise quite clear, windless, and visibility was at least 7 miles. Since the photos were taken over a period of time, and the objects apparently remained stationary during this time, positional data possibly may be also derived from the information portion in 'properties' of my computer, as well as focal length, shutter settings & etc. I attempted to send a disk with the photos and other information by mail to Mufon, but both times it was returned in the mail, as undeliverable."],"Case Number":"38871","trends":["There have been 10 other sightings in Palmerton","There were 9 other sightings in Palmerton on or around April 15th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.809983,+-75.602597(38871)&iwloc=A&hl=en\"> mufon case (38871) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"04/15/2010 12:00 UTC","Log Number":"US-06042012-0007"}