{"Date Submitted":"06/04/2012 03:09 UTC","Country":"Vietnam","Region":"Da Nang","files":["/var/www/straped/mufon/html2text/38882.html.txt","/var/www/straped/mufon/org/38882.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=16.051571,+108.214897(38882)&iwloc=A&hl=en\"> mufon case (38882) map </A>","divs":["Sighting DetailsIn the second week of March 1968 around 9:30 pm I was standing on the beach, facing east, just south of Da Nang, Vietnam. I Observed a red dot 70 degrees above the horizon moving south to north in a very straight line. Since no one in his right mind would fly with any lights on in this area I assumed it to be a space satellite. With nothing better to do, I continued to watch the \"satellite\" for about a minute. At about a 60 degree angle to the northern horizon it suddenly just Stopped! It then back upped and made a perfect counter clockwise circle around a star. When it reached the exact point that it started the circle, it shot in a general direction toward the star (about 15 degrees to the right of it), going from the red color to green then yellow, so fast that it seemed to be in three places at once. The night sky was extremely clear, no moon, no ground lights or flares, and although the sky had more stars visible than I have ever seen, this particular star was in a region of space with no other visible stars near it. Considering how spectacular the sighting was, I assumed that dozens, if not hundreds of people must have seen it also. Only recently did I see the Documentary \"The Universe ~ I Know What I Saw\" by James Fox and did an internet search to see how other people reported the sighting. When I couldn't find anything even close I realized the mistake I made 44 years ago by not reporting it."],"City":"Da Nang","Latitude":"16.051571","trends":["There have been no other sightings in Da Nang","This sighting has never been favorited."],"Summary":"Explorers waving Good-Bye?","Case Number":"38882","Log Number":"VN-06042012-0009","Weather Factors":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Longitude":"108.214897","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other","Object Shape":"Circle","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"03/09/1968 09:30 UTC"}