{"Object Shape":"Unknown","Tags":"City","divs":["Sighting DetailsI am not sure just what all I am comfortable putting out here in a public place but I will share the first of many events as I recall it. I remember that it was the first part of summer after school was out my first grade year. I lived out near the kokomo airport. I remember walking out into the back yard and mom had sheets hanging on the cloths line. I saw 3 sets of little feet under the edge of a sheet, so I walked around the sheet to see who was there. It was 3 little people just my size. The 4 of us or the 3 of them talked for what seemed a long time. After the event I told my older brother... (2years older) all about what the little people talked about.. I told him how the little people talked without moving their mouths.. His response was how could any one talk without moving their mouths and that I was a big liar. I tried to explain to him that it was like bubbles came out of their heads and when the bubbles burst I could hear their words...My family seemed to act as if I had a big imagination. Eventually as I grew up when I recounted the story as a funny story I made up as a child. When close encounters of the 3rd kind came out I was very excited to see the show. When the little people came out of the ship I got very excited and before I thought about it I was saying out loud... oh my God it really did happen.. I did observe from the movies little people that the eyes of the little people seems to be wrong... I will say that one time when I was in my 30s that I was with a group of people that had a guest speaker that researched ufo's and other events such as personal contacts and I tried to share some of my story with him. He asked me what color their cloths were and as I tried to tell him I heard myself tell him their cloths were silver... I knew that was wrong but that is the only word that would come out of my mouth. After that he just dismissed my story.. Until I met Glen Means I have never talked about the little people to any one that I thought might be investigating the other people as I have come to think of them. My encounters with the little people have never been a negative experience and I have as a grown up felt protective of them because of the negative prejudices humans have for each other let alone what I felt would be even more horrific to the little people. Why am I sharing this now... I'm not 100% sure except that as an older woman with more life experience I feel there surely must be other people out there that have had good experiences with the others (little people and more) I feel it is time and suspect the time for humans and the others will be meeting more often and I hope that we can meet and greet in a positive way in spite of us humans. Well there it is ... I hope this gives courage to other humans to share their stories and help the humans that live in the fear to know that there are others out there and here and we will come together in a positive way if we as humans choose to do so. I am not discounting any persons experience that was not a positive experience. I am just saying that they are not all negative and there can be open communication with out fear."],"Date of the Event":"06/10/1957 12:00 UTC","Source":"MUFON","Object Features":"Undisclosed","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around June 10th 1957"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.488337,+-86.127063(38887)&iwloc=A&hl=en\"> mufon case (38887) map </A>","Longitude":"-86.127063","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Summary":"personal contact","Log Number":"US-06052012-0002","files":["/var/www/straped/mufon/html2text/38887.html.txt","/var/www/straped/mufon/org/38887.html"],"Region":"Indiana","Date Submitted":"06/05/2012 09:59 UTC","Weather Factors":"Unknown","Latitude":"40.488337","City":"Kokomo","Case Number":"38887","Country":"United States"}