{"Object Features":"Unknown","Object Shape":"Unknown","City":"Okarche","Date Submitted":"06/05/2012 10:32 UTC","Country":"United States","Summary":"Unknown Lights over Oklahoma","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Region":"Oklahoma","Disposition":"Unresolved","Date of the Event":"03/02/2012 09:02 UTC","Tags":"City","Log Number":"US-06052012-0004","divs":["Sighting DetailsOn March 2, 2012 at approximately 8:50pm my wife and I were traveling south bound on U.S. Hwy 81. We were just outside of the town of Okarche, OK when we noticed what we thought was an aircraft with a red pulsing light on one end and a blue pulsing light on the other gliding over a field just east of Okarche heading east. We could only see the lights and not the object itself as it was very dark out. It struck me as strange as it was moving slowly and had no other beacon or strobe lights normally found on aircraft. We kept driving onto OK State Hwy 3 towards Oklahoma City, OK and watched the lights head east and go out of sight. At approximately 9:00pms we were approximately 8 miles east of Okarche when I happened to look to my right (south) and see what appeared to be a tower base of some kind with the same lights on top of it the base right next to a farm house. Out of curiosity I decided to pull on to a road in front of the farm house (exact address unknown) to see if we could see it up close. The lights were stationary there approximately tree top level maybe a little higher and approximately 50ft from our position. It was really dark and we could not make out the shape of the object. We could only see the lights. As we pulled up I rolled down my window to get a better look and heard no sound at all except that of traffic on the nearby highway. We sat there for about 10 seconds looking at the lights when all the sudden the object began moving west away from us which surprised us. It started off moving slow, however, in the 10 seconds or so it took me to get back on the highway the lights were already approximately 5 miles away heading back towards Okarche. We were amazed at how far it had travelled in just a 10 second period especially watching it travel so slowly earlier. We watched it glide back west then north until it was out of sight. On a side note I had observed the same lights over Okarche about a month prior to this sighting but did not have time to turn around and check it out. I just happened to be telling my wife about that sighting when we encountered it this time around. Again at that time all I could see where the lights and not the object shape itself."],"Case Number":"38889","files":["/var/www/straped/mufon/html2text/38889.html.txt","/var/www/straped/mufon/org/38889.html"],"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Okarche","This sighting has never been favorited."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.72588,+-97.976441(38889)&iwloc=A&hl=en\"> mufon case (38889) map </A>","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Longitude":"-97.976441","Latitude":"35.72588"}