{"Sighting Duration":"00:00:30","Case Number":"38880","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Country":"United States","Log Number":"US-06042012-0007","City":"Boulder","Object Shape":"Other","Summary":"two aircraft flying together, sounded like loud private planes, but had wing configuration unlike any known object","Source":"MUFON","divs":["Sighting DetailsMy husband and I were hiking between Green Mountain and Bear Mountain in Boulder county Sunday morning. I heard what sounded like a loud airplane about to fly over, but then heard an additional plane sound, and saw two apparent planes approaching from the south, flying north. They were similar in size, speed, and sound to a small private plane. As they came closer just to our east I was intrigued to see that they were unlike any aircraft I'd ever seen. We could see the shape clearly as they flew overhead: almost like a T, with the longer t-bar at the trailing end of the craft. Although not spectacular, the sighting was curious and mysterious nonetheless. My husband, who's a UFO skeptic, also witnessed these aircraft with me. The basic shape was reminiscent of a plane, but there were no wings along the center of the \"fuselage\" - just small winglike appendages at the leading edge of the craft and a larger wing-type shape at the rear, more or less in a \"T\" shape. These craft few together, one tailing the other slightly offset, heading north out of sight over the hills and presumably over the west part of the city of Boulder. Each time we heard planes the rest of the day, we looked to see if the UFOs were back, with no luck."],"files":["/var/www/straped/mufon/html2text/38880.html.txt","/var/www/straped/mufon/org/38880.html"],"Latitude":"40.017506","Date of the Event":"06/03/2012 11:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-105.263786","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.017506,+-105.263786(38880)&iwloc=A&hl=en\"> mufon case (38880) map </A>","trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around June 3rd 2012"],"Date Submitted":"06/04/2012 01:48 UTC","Tags":"City","Region":"Colorado","Object Features":"Wings"}