{"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=44.383603,+-85.352135(38892)&iwloc=A&hl=en\"> mufon case (38892) map </A>","Date Submitted":"06/05/2012 02:41 UTC","files":["/var/www/straped/mufon/html2text/38892.html.txt","/var/www/straped/mufon/org/38892.html"],"Source":"MUFON","trends":["There have been 9 other sightings in cadillac","There were no other sightings in cadillac on or around June 5th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"06/05/2012 02:57 UTC","City":"cadillac","Weather Factors":"Unknown","Case Number":"38892","Region":"Michigan","Object Shape":"Unknown","Latitude":"44.383603","Object Features":"None","Log Number":"US-06052012-0007","Summary":"witnessed a starlike object ascend vertically","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting Detailsa co-worker and i were outside on break at about 255 am. we work 3rd shift at the foundry in cadillac michigan, we were gazing the moon as it was full and wondering how many miles away it was, the moon was to the southwest, to the left of our periphial, we almost simultaniousley, noticed a starlike object appearing almost chrome. the object was traveling from south to the north moving slowly for about 2-3 seconds then it stopped for about a second, maybe 2 got brighter, it changed from a duller shiney starlike object, to 4-5 times the intensity. and then ascending straight up vertically speeding up until it was out of sight into deep space. deep, beyond the visible stars. the ascention was quick lasting maybe 3-4 seconds. at first site, i began to say \"theres the spacestation\",but all i got out was \"theres the..\" realizing, in that same breath, i was looking east not west. we were both equally as shocked as the other. and were basically dumbfound. it had a strange effect on me. because i knew it was not of this earth. having served in the airforce, from 86-90 on a black project with top secret and krypto clearance, and in the national guard currently, since 01 living on an airfield at a firestation. 15 years being familiar with fixed and rotary winged aircraft recognition both day and nightime,it was not something of our level of technology, that i can fathom. i want to see more. i am very intrigued. it will last with me forever."],"Longitude":"-85.352135","Tags":"City","Disposition":"Unresolved"}