{"Summary":"Object appeared oddly like aircraft, but wasn't. Disappeared when I looked away and back. Went back outside 45 min later and saw it briefly again before it just vanished.","City":"Oxnard","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.205975,+-119.168052(38894)&iwloc=A&hl=en\"> mufon case (38894) map </A>","trends":["There have been 19 other sightings in Oxnard","There were no other sightings in Oxnard on or around June 5th 2012"],"Object Shape":"Other","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"06/05/2012 05:54 UTC","files":["/var/www/straped/mufon/html2text/38894.html.txt","/var/www/straped/mufon/org/38894.html"],"Region":"California","Longitude":"-119.168052","Tags":"City","Date of the Event":"06/05/2012 01:35 UTC","Case Number":"38894","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unresolved","Latitude":"34.205975","Log Number":"US-06052012-0009","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsWent outside office to get lunch at street. When returning I was looking for Venus as the \"eclipse\" neared (around 1:35 pm). I notice a sea gull and a jet and what appeared to be another jet but, upon further observance, noticed it looked more like a cross between and jet and a bird. It was west of my position and moved very slowly to the North. It appeared to be several miles away and several miles high. The day was clear and I could see the jet at 30-35,000 feet with an obvious vapor trail. The \"wings\" appeared to reflect some of the sun light, but not as a pure metallic reflection. More of a hybrid metallic reflection. It moved very slowly as a jet would appear to move. I glanced away and back again and it was still there. I thought I'd get my phone out and take a picture or video, but when I looked back it was no where to be seen. I looked for several more minutes and then decided to go back into the office. While eating lunch inside I couldn't stop thinking about it so I went back outside and sat in my car looking for the object again. I saw two more jets with vapor trails over the next 15 minutes. Then I decided to go back into work and I got out of my car. Then I saw it again. This time lower in elevation but in the same general location. It appeared darker than before but I knew it was the same object I saw previously. It was large and difficult to see...almost invisible. I watched it for about 10 seconds trying not to take my eyes off of it. They started to water and I wiped them. It was still there not really moving in any direction. I reached for my phone and searched for the camera function. When I finally launched the program and looked back for the object it was gone. I sat there for another 20 minutes but was unable to spot it again. It is nearly 3 now and I am going out to observe the Venus eclipse and search again for the UFO. I will sketch what I thought I saw and submit it later. I took a picture in the area after it vanished but have not looked at the picture yet. I will after I type this and observe the eclipse."],"Object Flight Path":"Straight-line path"}