{"Country":"United States","Log Number":"US-06062012-0007","Object Features":"Unknown","Date of the Event":"06/06/2012 04:00 UTC","Source":"MUFON","Sighting Duration":"00:05:00","Disposition":"Unresolved","trends":["There have been 9 other sightings in Macomb","There were no other sightings in Macomb on or around June 6th 2012"],"Weather Factors":"Unknown","Region":"Michigan","files":["/var/www/straped/mufon/html2text/38907.html.txt","/var/www/straped/mufon/org/38907.html"],"Tags":"City","Date Submitted":"06/06/2012 06:58 UTC","divs":["Sighting DetailsTime: 4:00am EST (exaclty) Location: Macomb, Mi near 23 mile and Romeo Plank Weather: Clear sky, no clouds. Path: From the North traveling due South Lead up to sighting: Could not sleep, stepped outside to have a cigarette. Was looking up at the stars and then I saw what I thought was satellite. The Sighting: What I thought was satellite pulsed a very bright white light and then dimmed to be totally unoberservable. A few seconds later, the light again pulsed and the object has moved some distance from where I had first seen the object. The pulsing of the light was totally periodic - it was not chaotic or random; it had a period of maybe 5 seconds. Between pulses, the object was totally and completely unoberservable. Cnsidering I thought as first it was satellite, the altitude had to be extremely high. Size could not be estimated. The sighting lasted for a few minutes as the object travelled to the south. And then, about 45 degrees from my vantage point, the light simply stopped pulsating, and the object as stated before was again unobservable and that is how the sighting concluded. Final Note: the direction was North to South, but the flight path started to change at towards the end of the sighting, as the object then began to travel South-East. Satellites don't do that. The light (when pulsing) was much too bright to be a satellite, it was more like a bright star. Definately not an airplane... Definately not a meteor because it was too slow and flight path changed, not to mention meteors don't pulsate bright white light. Just another UFO sighting that won't help anyone figure this stuff out...."],"City":"Macomb","Object Flight Path":"Path with directional change","Case Number":"38907","Summary":"Appeared to be a satellite, at first, until it reglarily pulsed bright white light","map":"<A HREF = \"http://maps.google.com/maps?q=42.710929,+-82.993175(38907)&iwloc=A&hl=en\"> mufon case (38907) map </A>","Viewing Distance":"Unknown","Latitude":"42.710929","Longitude":"-82.993175","Object Shape":"Star-like"}