{"Summary":"Blue/Green shaped ring, fast speed, hovered took off & disappeared.","trends":["There have been 78 other sightings in Oklahoma City","There was one other sighting in Oklahoma City on or around June 5th 2012"],"Tags":"City","Country":"United States","Date Submitted":"06/06/2012 12:30 UTC","files":["/var/www/straped/mufon/html2text/38900.html.txt","/var/www/straped/mufon/org/38900.html"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.47533,+-97.509228(38900)&iwloc=A&hl=en\"> mufon case (38900) map </A>","Longitude":"-97.509228","Latitude":"35.47533","Object Shape":"Disc, Oval, Other","Log Number":"US-06062012-0002","Sighting Duration":"00:00:20","Case Number":"38900","Region":"Oklahoma","Date of the Event":"06/05/2012 10:10 UTC","Disposition":"Unresolved","divs":["sighting detailsdriving down a back road when i had the feeling to look out my driver side window. in my peripheral i saw a perfect glowing shade of aqua blue ring in the sky, just barely in the clouds. it moved fast at first then slowed down really quick, hovered with a slight jerky movement then took off again in the same direction for what looked like a couple hundred feet and disappeared from the sky. when i first saw the object i thought it was a falling star, but then i noticed the shape of it and it was between an oval and a circle and had a ring of blue\\green glowing light. the clouds around it were glowing white and it was just enough to be able to see a shape in the clouds with the object. the center was a very dark color. i could tell from it moving that it was in the clouds cause it made a tracer of light behind it. i kept looking in the sky after it disappeared to make sure it wasn't a helicopter\\airplane, but nothing was found. at first i freaked out cause i didn't know what it was and almost ran off the road. my eyes teared up from the overstimulating excitement when i realized what i had just seen. i called my sister to tell her about it. i lost site of the object cause the light disappeared from the sky, didn't ascend or descend it just vanished."],"City":"Oklahoma City","Object Features":"None","Object Flight Path":"Path then hovering","Source":"MUFON"}