{"Log Number":"US-06062012-0009","Object Shape":"Circle","Country":"United States","Source":"MUFON","Tags":"City","trends":["There have been no other sightings in Livingston","This sighting has been favorited 1 time."],"Longitude":"-94.93299","Region":"Texas","files":["/var/www/straped/mufon/html2text/38909.html.txt","/var/www/straped/mufon/more/38909_submitter_file1__PICT4166.JPG","/var/www/straped/mufon/more/38909_submitter_file2__PICT4167.JPG","/var/www/straped/mufon/more/38909_submitter_file3__PICT4168.JPG","/var/www/straped/mufon/more/38909_submitter_file4__PICT4169.JPG","/var/www/straped/mufon/more/38909_submitter_file5__PICT4170.JPG","/var/www/straped/mufon/more/38909_submitter_file6__PICT4171.JPG","/var/www/straped/mufon/more/38909_submitter_file7__PICT4172.JPG","/var/www/straped/mufon/more/38909_submitter_file8__PICT4173.JPG","/var/www/straped/mufon/org/38909.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Object Features":"Undisclosed","Latitude":"30.711029","Disposition":"Unresolved","Date of the Event":"04/10/2012 02:54 UTC","Summary":"This UFO was not observed in person. I have photos from a game camera pointed west.","City":"Livingston","divs":["Sighting DetailsPhotos from my game camera. Looks like the moon. The moon was 80% that night and rising at the same time of the photos. However, the object is round, not 80%. The object changes direction, whereas the moon would follow a path. The object is below the horizon in some of the photos, whereas the moon can't go in front of trees. I can't explain it. I am attaching the consecutive photos downloaded from my game camera. Because there was a small tree, approximately 1\" in diameter in front of my game camera, over a 2 month period, it took over 6,000 photos every time the small tree moved. Therefore, I deleted most of the photos, which were many photos of nothing. There were a fair number of photos from deer. No hogs. Some crows. As I stated above, if that is the moon, I can't explain why it changed directions and went below the horizon. The trees in the distance are a planted pine plantation, so the moon should be hidden or partially hidden when it is behind the trees. Out of the 6,000 photos that the game camera took in that two month period, the attached photos are the only photos that have this object, which may be the moon or may not be the moon. What I can't do now is look through the other photos that I deleted to see if the moon should have been rising in that direction at a certain time, for comparison. One thought is that it could be from a helicopter, but why would there be a helicopter flying in this area, which is a clear-cut area of a pine plantation at 3 AM? Also, why would a helicopter be there, hovering for 40 minutes? Also, someone mentioned that it could be dust on the lens, but dust would not be illuminated by the flash, so it can't be that. The photos are titled Grand Marquis because I have the back seat of a Grand Marquis in my hunting blind."],"Sighting Duration":"Undisclosed","Date Submitted":"06/06/2012 11:25 UTC","Case Number":"38909","map":"<A HREF = \"http://maps.google.com/maps?q=30.711029,+-94.93299(38909)&iwloc=A&hl=en\"> mufon case (38909) map </A>","Weather Factors":"Unknown"}