{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/38910.html.txt","/var/www/straped/mufon/org/38910.html"],"Disposition":"Unresolved","Object Shape":"Circle, Disc","Tags":"City","Longitude":"-92.519801","Date of the Event":"12/28/1969 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.139898,+-92.519801(38910)&iwloc=A&hl=en\"> mufon case (38910) map </A>","City":"Woodworth","Viewing Distance":"21-100 Feet","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","trends":["There have been no other sightings in Woodworth","This sighting has been favorited 1 time."],"divs":["Sighting DetailsDriving north on US 165 in Louisiana near the exit to Pawnee. It was a very beautiful clear day in late December of 1969 when I saw a UFO huvering only five feet off the highway. There were two cars on the sholder of the north bound side and three cars on the south bound shoulder. I stoped and watched as this beautiful crome colored craft with light of red and green going counter clockwise around the middle of the craft. One third of the top half of the craft appeard to be mirrored glass because of the light smoke gray coloration compaired to the metalic part of the craft. The bottem half of the craft had a vented extention of about one third the diameter of the width. This extention was what appeard to be the motor part of the disk. The lights moved around the black belted area in the middle with one light bright red the next was clear pure green, one light was white and it roated around with the other lights but came around only once every six to eight seconds. I along with all the other witnesses watch as the craft houvered then rotated by elevating on the west side to about 45 degrees and climbed above the trees on the east side and leveled above the rail road tracks where it stayed for thirty to forty seconds then rotated and went to the exact same place over the highway where is stayed motionless for thirty to fourty seconds then rotated on its east side and climed to the west of the highway. It leveled and remained there for the same amount of time. The craft went back to the position over the highway and repeated the manovers once more just as before. This time is leveled over the highway remained there for about fourty seconds and tilted to the west and moved slowly to the west between the trees. It changed to about sixty to sixty five degrees and started moving upward to the north west. It started slowly increasing speed very smoothly but in a compounding increasing speed until it climed out of sight in the stratisphere in about three seconds. The craft made no nose of anykind that I could dectect. It has been a long time and now that I'm older I will tell my incounter. It was an experance that I will not forget. As far as I know none of the people who witnessed this has ever come forward."],"Date Submitted":"06/06/2012 03:39 UTC","Latitude":"31.139898","Log Number":"US-06062012-0010","Source":"MUFON","Case Number":"38910","Object Features":"Dome","Weather Factors":"Unknown","Region":"Louisiana","Summary":"Up close view of beautiful chrome sauser with rotating red and green lights within sixty five feet."}