{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/38935.html.txt","/var/www/straped/mufon/org/38935.html"],"Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around June 6th 2012"],"Log Number":"US-06072012-0006","Sighting Duration":"00:00:04","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=32.749983,+-117.163944(38935)&iwloc=A&hl=en\"> mufon case (38935) map </A>","City":"San Diego","Case Number":"38935","Date of the Event":"06/06/2012 10:18 UTC","Object Flight Path":"Straight-line path","Latitude":"32.749983","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere","Longitude":"-117.163944","Date Submitted":"06/07/2012 03:21 UTC","Summary":"One slow white light and then one semi-transparent white light traveling low and very fast","divs":["Sighting DetailsI was standing near the corner of 1st Street and Washington Street in San Diego California between 9:30pm and 10:30pm on June 6, 2012. At 9:48 pm I saw a single light traveling south to north almost directly overhead; but slightly west of me. This area is very close to the San Diego airport, so planes, jets, helicopters and military aircraft are very common. In fact, there were aircraft in the area during both sightings. The first light did not have any blinking collision lights. The light was slightly higher than the jets coming in for landing at the San Diego airport; but still pretty low. There was no noise. The light had passed over me and then was about where the 8 freeway would be below it, and then, the light just turned off. There was no overcast this evening. This was interesting, but if that was all I saw, I wouldn't have filled out this form. Then at 10:18pm, a single semi-transparent light flew by faster than any jet has ever flown by. I could see it less than 4 seconds. This light was dull white and it almost seemed like I could possibly see through; but I could not. It flew in a straight line and very low, almost at the same elevation as the jets coming in for the final landing pattern at the San Diego airport southwest of this location. This dull white light was traveling southwest to northeast with no noise. It flew low, in a straight line and was totally silent. (If there has been coastal fog or overcast, it would have been below that level.) This light did not turn off like the first light but I lost sight of it only because it was blocked by buildings. Every jet or plane that passes by at the same elevation as the second light, or even much higher, can easily be heard. This second light was totally silent. This was not a meteor, I have seen many meteors."],"Country":"United States","Tags":"City"}