{"Object Features":"Unknown","Date of the Event":"06/21/1969 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.716813,+-74.000463(3893)&iwloc=A&hl=en\"> mufon case (3893) map </A>","Case Number":"3893","Summary":"A unidentified craft with multi-colored lights that hovered silently and could move at Incredible speeds,","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"None","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","City":"New York","files":["/var/www/straped/mufon/html2text/3893.html.txt","/var/www/straped/mufon/org/3893.html"],"Disposition":"IFO","Latitude":"40.716813","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around June 21st 1969"],"Longitude":"-74.000463","Source":"MUFON","Region":"New York","Date Submitted":"06/21/1969 12:00 UTC","Log Number":"US-09242005-0004","divs":["Sighting DetailsA teenage Friend(age 18) and myself(age17) were lying in the grass on our backs in a School playground at about 11 pm at night. After a short conversation about the days events, my friend mike pointed to a cloudless sky and told me that he learned about the location and names of constellations in Science class and began pointing out the little dipper and the names of certain other star formations for me. As our eyes were scanning the horizion, my friend happened to notice 3 colored lights that appeared to be close by. It was dark of course, but I would estimate the lights to be about two miles away and about one mile high above the ground. We were with-in 5 miles of an airport, so the occasional appearence of multi-colored lights of small aircraft in the sky was not unusual, and we both agreed that this is probably what the lights were and continued to scan the skys looking for other interesting constellations. About 15 minutes later, my friend looked to the horizon again and brought to my attention that the multi-colored lights were still in the same place as they were before. We naturally thought that this was very odd, but decided that it was either another airplane traveling the same flight path or the same plane had circled and just happened to be in the same location that we were looking. We quickly went back to obsevering the stars. Some time later, about 20 minutes, I happened to look in the direction of what we both dismissed as a airplane sighting, and again, in the very same place and of the exact orintation, I saw the same multi-colored lights. I quickly brought it to the attention of my friend and together we tried to come up with a rational explanation as to why and how an object could suspend itself in the air in the same exact place. I finally came to the conclusion that it must be a heliocopter, but my friend reminded me that heliocopters are extemely noisey and it was a very quiet night with no breezes. If the object was a heliocopter, we would definitely hear the sound of the motor and rotor blades. We both became very puzzled, and our attention was now focused directly on the object for about 10 minutes. As we stared at the lights, I strained to make out some kind of outline or silhouette of the object, but I could not see any definite shape because the object seemed to absorb what little light was available and blend into the night sky. Just as we were discussing what this thing could be, it suddenly moved at tremendous speed to our left at a 45 degree angle upward, about 5 miles in the sky, paused for a brief second, and then shot straight upwards to the very outer stratosphere of the Earth,... then stoopped, hovered, appearing as a point of light for a second, and then suddenly propelling itself into deep space at an even faster speed that I had ever seen any man-made aircraft accelerate to. The acceleration was so abrupt, that it is hard to believe that anything alive inside the craft could survive the G-Forces involved. My friend and I looked at eachother in astonishment,... all we could say to eachother is \"Woa\",... \"What was that?\". The next day we told all are friends. Some of are friends believed us, but most did not. However, those that did not believe us, could not come up with an explanation either. I am in my 50's now, but I will never forget the experience, and the memory of it is still fresh in my mind like it happened yesterday. At the age of 17 years old, I was a (\"I don't believe it, unless I see it\") kind of a young man, and I cerntainly did not believe in extraterrestial spacecraft, but after this 1969 sighting, I soon changed my opinion.."],"Object Shape":"Unknown"}