{"divs":["sighting detailsi was on a flight returning to california from florida. i noticed the skies over texas were very very dense with pollution and smoke. after taking a short snooze i realized i was over new mexico flying over mountains that were ablaze and smoke moving eastward. i was looking out the window and i observed two jets flying eastward to their destinations and as i looked back at them i notice a very large, dark object that looked as if it was tracking us since it never wavered or changed in size. it was over the mountains on fire but it made them look like little mounds of dirt, this object being so huge. the jet i traveled in was at an altitude of 39,740 ft and going away from the object. after the second plane went by going eastward i noticed the large object descend somewhat, make a directional turn as if it was going after the jet but not, and headed eastward\\southeastward and disappeared from my sight. this event lasted perhaps 5 minutes but am not really sure of the time. it could have been more . . . this is not the first time i had seen this large object in the sky and almost at the same place but it was over texas and that was in 2010 on a return flight too going east to west."],"Viewing Distance":"Over 1 Mile, Unknown","City":"Durango","Source":"MUFON","trends":["There have been 2 other sightings in Durango","There were no other sightings in Durango on or around May 24th 2012"],"Case Number":"38944","Disposition":"Unresolved","Object Flight Path":"Stationary,Path with directional change","Region":"New Mexico","Latitude":"37.245443","Tags":"City","Summary":"Large Object Over the New Mexico Skies Observing Fire","Longitude":"-107.827839","Object Features":"Unknown","Object Shape":"Square, Rectagular","Log Number":"US-06072012-0015","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/38944.html.txt","/var/www/straped/mufon/org/38944.html"],"Date Submitted":"06/07/2012 12:37 UTC","Date of the Event":"05/24/2012 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.245443,+-107.827839(38944)&iwloc=A&hl=en\"> mufon case (38944) map </A>"}