{"Weather Factors":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/38945.html.txt","/var/www/straped/mufon/org/38945.html"],"Case Number":"38945","Date of the Event":"05/16/2012 08:45 UTC","Summary":"Three star like extremely bright Orbs spotted too low to be stars, then when photos taken, one raced forward, silently and mutated into 12 FT round floating circular grey shape","Disposition":"Unresolved","Date Submitted":"06/07/2012 02:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.989097,+-121.689556(38945)&iwloc=A&hl=en\"> mufon case (38945) map </A>","Source":"MUFON","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","City":"Oakley","Object Shape":"Unknown","Log Number":"US-06072012-0016","divs":["Sighting DetailsAt sunset, my daughter and I noticed these three extremely bright stars, that couldnt be stars, for they were too low to the earths surface, so I went in and grabbed my Nikon D5000 camera and took one video clip, then several photos, where one of the objects raced forward toward us, then was sort of dull grey, transluscent and it looked like there were things inside of it, but we couldnt really tell what. There was no noise and it was just floating or hoovering at the edge of my apt. building and it was approx 12 to 15 feet, I supposed in diameter. Then it appeared to be moving slightly towards us, so we got scared and ran into the apartment. Ever since then, we have had some extremely strange happenings inside of our home, with shadows and light, even feeling something that we couldnt see, entering our bodies that would cause our heads to be extremely heavy and sometimes pain in various spots and every time we leave someplace, one of the bright stars, that are still outside of our apartment complex, follows us, and will come down quite low. I keep feeling like there is something implanted on the inside of my back now, that sort of moves around. On a Friday night at the end of March, my daughter and a friend of mine had seen what appeared to be a floating lantern sort of hoovering in tree that's on the neighboring property and it also looked almost as if there was some sort of creature inside of it, but was not making any noise as it hoovered. We didn't really have the time to investigate, so we just ignored it and continued on with what we were doing and that was at around 10:45 pm, along the fence line of my carport. I have hesitated to say anything, but this has become an ongoing nightmare and there doesn't really appear to be anyone from the Government that you can report these types of things to. My daughter will not leave my side! I hope this helps someone that might be having the same thing happen to them.I will email photos, as requested, they are on my iPhone."],"Longitude":"-121.689556","Tags":"City","Latitude":"37.989097","Object Features":"Undisclosed","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Oakley","There were no other sightings in Oakley on or around May 16th 2012"]}