{"map":"<A HREF = \"http://maps.google.com/maps?q=39.318151,+-94.912893(38949)&iwloc=A&hl=en\"> mufon case (38949) map </A>","Weather Factors":"Unknown","Log Number":"US-06072012-0019","Summary":"5 more strange lights over Leavenworth Kansas","Date of the Event":"06/06/2012 10:14 UTC","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Star-like","Object Features":"Unknown","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","divs":["Sighting DetailsMY wife and I went out to our front porch to smoke before bed around 10pm. Since I had another sighting recently I can't stop looking at the night sky. Since the last sighting on the 28th of May, I have seen 4 steady lights traveling across the sky but nothing to interesting. But, this sighting was just as odd as the 28th. The 1st object was a steady dim light traveling from the West to the East. When facing North the object was about 70deg from the horizon. It came into view and traveled in a straight line until no longer visible. It crossed about half of the viewable sky in about 2 min. This object was very high poss. outside of our atmosphere. As soon as I lost sight of it I check my phone for the time. It was 10:14 A few minuets later I saw a 2nd steady dim light traveling south approx. 45deg from Eastern horizon. It was also very high alt. It was visible for about 1min before I lost sight of it behind some trees. I observed a 3rd and 4th at 10:28. Around 50-60deg from the Northern horizon I saw a stationary bright flashing light and another light flying past the flashing light. The flashing was brighter than any star, and seemed timed. There was prob 1 sec between several flashes. The first flash in the series was brighter than subsequent flashes. The passing object would start as bright (not as bright as the flashing one) and dim along its path until it would disappear then would reappear further along its path bright again. It did this 5 or 6 times covering most of my viewing area. Its path also seem to have a slight curve to it. The 3rd or 4th time it reappeared it looked like it was either double or maybe dropped something. Meanwhile, the flashing one flashed several times after the other had passed it faded out then reappeared a second or two later on the path of the one that had passed it and did another series of flashes before disappearing again. I also saw several planes during this time. The last object that I saw appeared near a plane. The plane was prob around 30k ft heading East. The object may not have been close to the plane, poss. much higher. It was due East 40deg above the horizon and moved NNW for about 2 min before I lost track of it at 10:59. I could see the marker lights on all the planes even the ones I believe to have been around 30k ft with the naked eye. I tried to use a pair of cheap binoculars but could not see any FAA required lights on the ufos."],"trends":["There have been 8 other sightings in Leavenworth","There was one other sighting in Leavenworth on or around June 6th 2012"],"City":"Leavenworth","Date Submitted":"06/07/2012 06:27 UTC","files":["/var/www/straped/mufon/html2text/38949.html.txt","/var/www/straped/mufon/org/38949.html"],"Sighting Duration":"00:45:00","Case Number":"38949","Latitude":"39.318151","Region":"Kansas","Longitude":"-94.912893","Source":"MUFON"}