{"map":"<A HREF = \"http://maps.google.com/maps?q=37.764069,+-77.470972(38943)&iwloc=A&hl=en\"> mufon case (38943) map </A>","Object Flight Path":"Path with directional change","Object Shape":"Sphere, Star-like","divs":["Sighting Details My boyfriend was over the other night. We were watching t.v. and had decided to go out on my porch to smoke a cigarette. We sat on the step, I lit my cigarette, and looked upwards. I saw what looked to be either a very bright white star or a planet. The center was very bright and there was also a kind of halo of light surrounding it in the shape of a circle. After watching for maybe one second I realized that it was moving towards my left (north). My boyfriend had his eyes on the light as well. He didn't have his glasses on so he couldn't see it as well as I could but he COULD tell that it was moving. I thought it may have been a plane as I continued to watch it since I live relatively close to the Richmond Airport as well as the Hanover County Airport, but tried and failed to find the usual flashing red and blue lights or at least hear the engine. Suddenly, the object stopped moving and the circular halo of light around the object seemed to become squished into more of an oval. My jaw was dropped wide open and my eyes were probably as big as they could have gotten. It quickly decreased in sized and seemed to be moving up and diagonally away from where I sat at maybe a 130 degree angle to make a rough estimation. It went from a substantial and easily visible orb of light to the size of a pinhole in an unreasonably rapid rate and disappeared into the sky. Like I said, my boyfriend did not have his glasses on at the moment but he could tell that the light that he'd just seen had quickly disappeared. From my awestruck reaction he could tell that I was somewhat uneasy and amazed."],"Case Number":"38943","Region":"Virginia","Tags":"City","City":"Ashland","files":["/var/www/straped/mufon/html2text/38943.html.txt","/var/www/straped/mufon/org/38943.html"],"Log Number":"US-06072012-0014","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Summary":"Ball of light breaks northbound path and disappears upwards into the dark sky","Sighting Duration":"00:00:25","Country":"United States","Longitude":"-77.470972","Date of the Event":"06/05/2012 04:00 UTC","Source":"MUFON","Object Features":"None","Latitude":"37.764069","Date Submitted":"06/07/2012 11:30 UTC","Weather Factors":"Unknown","trends":["There have been no other sightings in Ashland","This sighting has never been favorited."]}