{"Object Features":"Unknown","Case Number":"38952","Tags":"City","Date Submitted":"06/07/2012 08:18 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Region":"Kiev City","Country":"Ukraine","files":["/var/www/straped/mufon/html2text/38952.html.txt","/var/www/straped/mufon/org/38952.html"],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","divs":["Sighting DetailsI currently live in Toledo, Ohio, but in May of 2012 I was visiting my hometown of Kyiv, Ukraine. The camera I took overseas with me, a nikon d3100, was purchased recently, and I did not know how well the camera would capture images at night. So before bed on May 17, 2012, I pointed the camera at the buildings across the street from where we stayed (Street: Priluzhna House #:10) and clicked the shutter. I took a few photos over a span of ten minutes. When I looked across the street, over the apartment buildings, I saw and heard absolutely nothing. Everything was so quiet that I did not see what I captured until the next morning, upon closer examination of my pictures. When I consulted my friends and family members, we tried to think of a rational explanation. The object could not be a cable dish, because it moved. It could not be a plane, because of its shape. It could not be anything human made, because I could not see it or hear it with the naked eye. In fact, as you can see in some of my photos, there were people outside, next to the building over which the object hovered. The people obviously did not see or hear it either, because they did not look up or act out of the ordinary. So the next day, may 18, I decided to take more photos. This time, I captured only an eerie light, which seemed to move away from the building, but nothing so obviously disk like. Again, I could not see anything with the naked eye or hear anything. Over the next few days, I took more photos, but captured nothing on film, until the night of May 21, 2012. This time, from 11:10 pm until 11:17 pm. I captured a disk that seemed to hover and move up and down over the building across the street. Like before, I could not hear anything, and could not see the object without the help of my camera. I took some continuous shots of the object, and some shots where I waited a minute or two before I took consecutive shots. The object first hovered over the building for a few minutes, then moved up and to the left, toward the building behind it (as appears in the photos I uploaded). Then the object returns, and again seems to hover over the building, then did the same as it did before, move flew to the left to the next building and disappeared. My first reaction to the object was disbelief, because I could see it with my own eyes. Then, as the photographic evidence became more conclusive, I became frightened, and after the night of May 21, 2012, I did not take any more photos. From May 17 to May 21, 2012, I have 37 photos of the object, which I captured with my Nikon D3100. Each photo is date and time stamped (I did not change the time on my camera, which was still in the Eastern Time Zone, Ukraine is seven hours ahead), and was not altered in any way. Upon my return to the United States in June 2012, I chose to share my story with you."],"trends":["There have been 2 other sightings in Kiev","There were no other sightings in Kiev on or around May 17th 2012"],"Date of the Event":"05/17/2012 09:43 UTC","Latitude":"50.476026","Longitude":"30.355431","Object Shape":"Circle, Disc, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=50.476026,+30.355431(38952)&iwloc=A&hl=en\"> mufon case (38952) map </A>","Source":"MUFON","City":"Kiev","Log Number":"UA-06072012-0023","Summary":"The actual UFO was never actually seen or heard by me, however, it was captured by my camera, a nikon d3100, in fine quality","Disposition":"Unresolved"}