{"Date Submitted":"06/07/2012 09:14 UTC","Source":"MUFON","Disposition":"Unresolved","trends":["There have been no other sightings in Mitchellville","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/38956.html.txt","/var/www/straped/mufon/org/38956.html"],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Log Number":"US-06072012-0025","Weather Factors":"Unknown","Object Shape":"Cone, Teardrop","Case Number":"38956","Object Features":"Window(s), Appendage(s)","Region":"Iowa","Viewing Distance":"21-100 Feet","Date of the Event":"06/05/2012 11:36 UTC","Country":"United States","Tags":"City","Summary":"Car sized object seen in direct line of sight by two witnesses. Unlike any known object. Seen in area with numerous sightings.","City":"Mitchellville","divs":["Sighting DetailsThis event occured after a short walk through our home locking doors, witness saw a light and took out a camera. The first craft was seen in the distance flying in a strange zig-zag pattern. This object was photographed, but at a low quality. The first witness and I discussed the object and thought it was strange as we had seen other objects in the area that resemble no known air craft and behaved in a strange halting then speeding up fashion, like pumping the brakes on a car. I said it was strange and thought nothing more until two minutes later the first witness ran back to me and told me to come to the window. That is when I saw a spot in the distance that was a purple,green,white,and orange strobe light. The object appeared to be going away from us but changed direction and came directly towards us. It seemed to know we were there watching. We had shut off all the lights to get a better view but it still seemed to know we were watching it. We watched the object come into view as a tadpole shaped craft with two antennae (one longer than the other) on the right side and a smaller one on the left side. The object came within 50 feet of us but it was moving at a rate of speed that no air craft I have ever seen. It was a metallic surface that was like the color of mercury and behaved in a strange fluid motion. It had four window like openings on the front that resembled the lenses of a fly. The craft flew over our garage and was in full view of our outside light, it seemed to come within inches of hitting the phone lines and light-pole. We were trying to take a photograph but our camera would not function properly, it had been used previously with no issues. Our dog was acting very upset before the incident started, that is one of the reasons the first witness was up walking in front of the windows. I felt an almost metallic feeling in my body, partially out of fear but it was a strange feeling like I had a magnet inside of my body that was being pulled towards this thing. The other witness reported a similar but more intense feeling. She states that she was being drawn to look out the window. This object looked like a metallic tadpole with three spindly arms. After it almost hit our light it vansihed. It didn't go off into the distance it vanished without a trace. We pondered over it, thinking of all the explinations that we could. We would have been able to hear a plane or helecopter out of the windows but it was silent. This shook us up a bit and I have reported to you before and thought this was the most impressive thing I have ever seen. I hope this is detailed enough for you."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.667222,+-93.360278(38956)&iwloc=A&hl=en\"> mufon case (38956) map </A>","Longitude":"-93.360278","Latitude":"41.667222","Sighting Duration":"00:04:53"}