{"Source":"MUFON","Case Number":"38967","Country":"United States","Log Number":"US-06082012-0003","map":"<A HREF = \"http://maps.google.com/maps?q=42.459463,+-90.70079(38967)&iwloc=A&hl=en\"> mufon case (38967) map </A>","files":["/var/www/straped/mufon/html2text/38967.html.txt","/var/www/straped/mufon/org/38967.html"],"divs":["sighting detailsi was sitting out on my friends back porch with my girlfriend facing southwest about 11:00 pm on thursday night (6\\7) having a brew. the house is on a high ridge line with a great southwestern view. my friend noticed a bright light approaching and shouted out to \"check it out\". i spotted a very, very bright light maybe a few thousand feet in the sky. it moved in a southwest to northeast direction in the night sky. i didn't hear any noise from it. a jet was flying overhead at the time and clearly visible and audible. the jet was significantly above the light and clearly distinguishable. the light appeared to be like a bowling pin standing upright, and about 1\\3 from the top, or where the neck on a bowling ball is, an aura type of light emitted horizontally out of its neck. as it moved across the sky in a generally sw to ne direction, it shifted direction, or zig zagged numerous times and seemed to stay still or float for brief periods (1 sec.) before moving again. it was very a very bright white light. it made no sound. i grabbed my iphone, recorded about 20 sec. but it just shows up black. whole episode lasted maybe 1-2 minutes."],"Sighting Duration":"Undisclosed","City":"Dubuque","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"42.459463","Date of the Event":"06/07/2012 11:15 UTC","trends":["There have been 8 other sightings in Dubuque","There were no other sightings in Dubuque on or around June 7th 2012"],"Region":"Iowa","Weather Factors":"Unknown","Summary":"very bright light went overhead 1000+ feet. bowling pin shape with light coming out horizontally from top 1/3 of pin light. Airplane visible at time. light zig zag randomly while on path","Tags":"City","Longitude":"-90.70079","Object Shape":"Cone, Teardrop","Disposition":"Unresolved","Object Features":"None","Date Submitted":"06/08/2012 01:47 UTC"}