{"Tags":"City","Sighting Duration":"00:20:00","Summary":"Flying stars","Region":"Kansas","Country":"United States","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/38966.html.txt","/var/www/straped/mufon/org/38966.html"],"Longitude":"-94.923297","Latitude":"39.307489","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"06/07/2012 10:20 UTC","City":"Leavenworth","divs":["Sighting DetailsOur family decided to have a little camp out in the backyard. I was sitting in a chair looking at the stars while my kids were suppoused to be going to sleep. I saw the 1st light moving from the south to the north (east of my house) about that time my 2 kids that were still awake came out of their tent to \"go to the bathroom\" I got excited because I wanted them to see what I have been watching in our night sky recently. They were quite amazed as I pointed out the difference between these objects and the planes that were periodicly flying over. The first was spotted around 10:20 we watched it travel across most of the sky before it faded. Almost as soon as 1st was gone we spotted a 2nd directly over head traveling from the west to east. This one also covered most of the sky within prob 2 min before it vanished. I checked the time when it was gone, 10:25. 10:34 a bright \"star\" appeared visible just over the corner of our house, between the tops of the trees across the street. (not actual near us just visible in that area) The object did not come from behind the trees, it just showed up in that area then traveled east, then view was blocked by trees. I saw a fourth again directly over head traveling from NW to SE. First noticed near big dipper handle. As it passed what I think is a star or planet \"very bright\" east of our home at the time of sighting, it seems to me that it had made a slight of ark to its path and was now heading in a more east direction. Lost sight of it just before my roof or nearby trees could block view. Time when we lost sight of it 10:38. I wish I could have gotten better details but I was very excited to have my kids see the strange lights. Also, looked at them with cheap binoculars. No visible air craft lights."],"trends":["There have been 8 other sightings in Leavenworth","There were 2 other sightings in Leavenworth on or around June 7th 2012"],"Log Number":"US-06082012-0002","map":"<A HREF = \"http://maps.google.com/maps?q=39.307489,+-94.923297(38966)&iwloc=A&hl=en\"> mufon case (38966) map </A>","Viewing Distance":"Over One Mile","Case Number":"38966","Date Submitted":"06/08/2012 01:17 UTC","Object Features":"Unknown","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change"}