{"Latitude":"39.396782","files":["/var/www/straped/mufon/html2text/38975.html.txt","/var/www/straped/mufon/org/38975.html"],"Longitude":"-104.883466","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-06082012-0011","Date Submitted":"06/08/2012 03:13 UTC","Summary":"8 round white lights in-line & 1 extra light above far left light during lightning storm hovering.","Date of the Event":"06/07/2012 10:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.396782,+-104.883466(38975)&iwloc=A&hl=en\"> mufon case (38975) map </A>","Object Shape":"Circle","Object Flight Path":"Stationary","divs":["Sighting DetailsI am a landscape photographer. I normally go out during storms to take pictures when I can distance myself from the storm itself. I had been photographing lightning from a vantage point which overlooks the new hospital being built. After spending approximately 30 minutes shooting intervals of time-lapse photography, I suddenly noticed 8 lights in-line with each other, with one additional light hovering over the far left light, within close proximity. The lights did not appear to flicker and they defiantly did not move during the 5 minutes I was photographing them. It had been previously raining terribly and this was one of the worst storms Colorado has seen in 20 years. During the time that the pictures were taken, it was dry and hadn't been raining for approximately 1 hour. According to the Air Force Operations Center, all flights were grounded due to the severe weather and they had nothing showing up on their radar in the area that I was observing the lights - somewhere in between Highlands Ranch and the Denver area. I did not observe the lights appear but they did appear to fade away after 5 minutes. During the entire 5 minutes the lights appeared nev I am a professional photographer. I have vast knowledge of celestial movements, natural phenomenon, and aircraft identifications. I could not find a reasonable explanation for the presence of these lights."],"Tags":"City","Object Features":"Unknown","trends":["There have been 11 other sightings in Castle Rock","There were no other sightings in Castle Rock on or around June 7th 2012"],"Region":"Colorado","Country":"United States","Viewing Distance":"Over One Mile","Source":"MUFON","City":"Castle Rock","Case Number":"38975"}