{"Object Shape":"Bullet, Missile, Cigar, Cylinder","Object Features":"None","Weather Factors":"Unknown","Date Submitted":"06/08/2012 02:48 UTC","Log Number":"US-06082012-0009","divs":["Sighting DetailsI'm 24 and I live in Bonita Springs,Florida. I saw something in the sky tonight (June 8,2012 around midnight). I was walking our dogs with my mom and we heard a weird noise and saw something in the sky. we thought it was a helicopter at first but the shape proved that innacurate.It was a long cylinder shape and it moved slower than an airplane. the color seemed to blend in with the sky , as if it was almost camouflaged, we could in fact see the outline of the object. It had a red and green light on the front and came right at us and did 4 roundabouts each time coming right at us. its flight path was east then it did a turn and headed south,than west directly toward us, after getting close and going directly over our heads it would turn north, then east, then south and onto west toward us. I felt like it could see my mom and I and was headed right at us. I had no idea what it was and i just stood there frozen. I felt like it knew we were there and was specifically coming round in circles towards my mom and I. It circled and came directly at us a total of 4 times, one right after the other. I had a horrible feeling inside me.I felt afraid but was in such shock and so curious. I thought there had to be a plausible explanation. After all this isn't the first weird flying object i've seen near my house before. After the 4th fly by it went off into the distance heading northwest. I don't believe in UFO's but I cannot explain what I saw. I never heard of a cylinder shaped ufo so I went Inside the house got on the computer and looked up cylinder shaped helicopters. The results I received were cylinder UFO's . Upon looking at the images I realized it was exactly what I had seen. I wish my phone wasn't dead inside the house at that time otherwise i would've tried to somehow capture it on camera, but even so I was so frozen and felt so weird that taking pictures wasn't even on my mind at the time.Perhaps its just the government testing new technology."],"Region":"Florida","files":["/var/www/straped/mufon/html2text/38973.html.txt","/var/www/straped/mufon/org/38973.html"],"Latitude":"26.327545","Date of the Event":"06/08/2012 12:00 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Longitude":"-81.710747","trends":["There has been one other sighting in Bonita Springs","There were no other sightings in Bonita Springs on or around June 8th 2012"],"City":"Bonita Springs","Source":"MUFON","Case Number":"38973","Tags":"City","Viewing Distance":"21-100 Feet","Summary":"cylinder/missle shape object circled my mom and I 4 times.","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=26.327545,+-81.710747(38973)&iwloc=A&hl=en\"> mufon case (38973) map </A>"}