{"Date of the Event":"06/07/2012 12:30 UTC","Object Shape":"Cigar, Disc","Longitude":"-111.777928","Case Number":"38977","divs":["Sighting DetailsI was standing on my front porch and was looking northwards in the sky and saw a commercial airplane with ensuing vapor trail heading westward and almost simutaneously noticed another object heading eastward that did not resemble anything I've ever seen before. Flagstaff AZ is roughly 50 miles north of my location and was in the general direction I was looking when I witnessed this. To put into perspective, I was looking at something far enough away as to get any detailed visual confirmation but close enough to make out a definite visual confirmation of the airplanes fuselage and the outline of the tail section. When I first noticed the unidentified object, it seemed to be stationary then started to move what looked like from my perspective, toward the commercial airplane. Whatever I was looking at was disc or cigar shaped with a very bright metallic like glare coming off of it and looked larger than the airplane. I wanted to grab a camera and get a picture of this but at the same time, I didn't want to miss anything seeing that the Object, and the airplane, seemed to be very very close to each other in proximity. What happened next is the part that turned my stomach.......It vanished right before my eyes. The hair on the back of my neck and arms seemed to be standing at full attention. All I kept muttering to myself was OMG...OMG...Did I see what I really think I saw? Did anyone else see what I just saw? I am a sky gazer during the night and day.I hope to get Pic's and or video if the opportunity ever comes my way again. I've been waiting 20+ yrs to see something along these lines. The day may have finally come!"],"Date Submitted":"06/08/2012 05:14 UTC","Region":"Arizona","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/38977.html.txt","/var/www/straped/mufon/org/38977.html"],"Summary":"Very bright object that was disc or cigar shaped. Just disapeared as it seemed to approach commercial airliner.","Source":"MUFON","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.632245,+-111.777928(38977)&iwloc=A&hl=en\"> mufon case (38977) map </A>","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"34.632245","City":"Lake Montezuma","Tags":"City","trends":["There have been no other sightings in Lake Montezuma","This sighting has never been favorited."],"Log Number":"US-06082012-0013"}