{"files":["/var/www/straped/mufon/html2text/38972.html.txt","/var/www/straped/mufon/org/38972.html"],"Case Number":"38972","Tags":"City","City":"Vancouver","Object Shape":"Star-like","Disposition":"Unresolved","Weather Factors":"Unknown","Region":"Washington","Log Number":"US-06082012-0008","divs":["Sighting DetailsI was at the barn with my daughter, when my son shouted \"UFO\"! I thought he was joking. I looked to the south and saw a steady white light heading north in our direction. It was visible between the two trees. It was not on the path the airplanes from the airport use. There were no blinking lights on it, so I knew it was not an airplane. As it headed our way I listened for a sound. There was no sound. As it went over us, it was silent. NO sound! It appeared to be traveling very slowly. It turned toward the east when it went over us. My daughter asked if I could see the ring around it. I could not, as I did not have my glasses on. I told her to run and get her camera. She said it would be gone before she could get back out with it, but I told her it was going too slow. So she went and got it, but by the time she got back, it had traveled a long way, but was still visible. I wanted to get in my car and follow it, but my daughter said it was going too fast. After the light was obscured by trees, we talked. I had strong, strange feeling, that the light (object) was \"surveying\" - doing surveillance. I told my daughter to draw a picture of the ring. She did. A few minutes later she took a picture of some clouds, and there was a round light in the picture. Almost like the moon. But the moon is not out."],"Object Flight Path":"Path with directional change","Object Features":"Unknown","Sighting Duration":"Undisclosed","Latitude":"45.6982","map":"<A HREF = \"http://maps.google.com/maps?q=45.6982,+-122.617302(38972)&iwloc=A&hl=en\"> mufon case (38972) map </A>","Date of the Event":"06/07/2012 10:10 UTC","Viewing Distance":"Over One Mile","Longitude":"-122.617302","Date Submitted":"06/08/2012 02:44 UTC","trends":["There have been 54 other sightings in Vancouver","There were 3 other sightings in Vancouver on or around June 7th 2012"],"Summary":"Silent light flew over us, and changed direction. Very high, Very slow","Country":"United States","Source":"MUFON"}