{"Log Number":"US-06082012-0021","files":["/var/www/straped/mufon/html2text/38988.html.txt","/var/www/straped/mufon/org/38988.html"],"Object Flight Path":"Hovering then path,Straight-line path","Region":"Missouri","Source":"MUFON","Case Number":"38988","Object Shape":"Other","Country":"United States","Date Submitted":"06/08/2012 02:19 UTC","trends":["There have been 2 other sightings in Hazelwood","There were no other sightings in Hazelwood on or around October 15th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.787457,+-90.353369(38988)&iwloc=A&hl=en\"> mufon case (38988) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Latitude":"38.787457","Object Features":"Other","Tags":"City","divs":["Sighting DetailsI had just bought a telescope and was carrying it outside to check out stars...the starts were not yet out but it takes time to set the scope up so I was doing so. My friends were sitting on the patio and i was out in the lot. I looked up and about 500 feet above me I saw a still hovering craft with four lights in equal distance from each other in a square shape. They were very very bright ...so bright that they reflected off of the underside of the craft which to me looked like a pyramid.(hard to explain) but i could see up inside the underneath of the craft because its lights were reflecting off the surfaces. I yelled at my friends to come look at this UFO they laughed and said Oh right.. It started to move in a straight path north in a slow but steady motion NO SOUND AT ALL. I screamed no come here guys look...By the time My buddy got to me he too saw the craft with 4 lights it was moving north and then still in line of site just vanished completely. We thought it was so strange because it was dusk and the moon was rising and it was not dark. we could see well beyond the craft into the distance....but the craft literally disappeared (not turned off lights if it had done that we still would have seen the craft) It was gone. Last week may 2012 I saw on the news Lights above Missouri and saw the video footage And immediately recognized the square 4 lights as the same lights I saw on October 15 2011. I KNOW I saw a UFO I know I'm not crazy I now Know others seen it too."],"Longitude":"-90.353369","Summary":"Pyramid (square bottom)shaped with 4 bright lights on bottom corner edge","Date of the Event":"10/15/2011 06:30 UTC","City":"Hazelwood"}