{"Object Flight Path":"Straight-line path","Sighting Duration":"00:01:30","Object Shape":"Cone","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Disposition":"Unresolved","Region":"North Carolina","Object Features":"Undisclosed","Log Number":"US-06082012-0024","Summary":"Metallic cone or cigar shape object on straight line path","Date Submitted":"06/08/2012 03:48 UTC","Longitude":"-79.282249","Date of the Event":"06/08/2012 02:40 UTC","Case Number":"38991","files":["/var/www/straped/mufon/html2text/38991.html.txt","/var/www/straped/mufon/org/38991.html"],"Country":"United States","Latitude":"35.256268","trends":["There have been no other sightings in Vass","This sighting has never been favorited."],"Tags":"City","City":"Vass","divs":["Sighting DetailsDriving home from work at about 2:40 PM eastern time in central north carolina when my eye distracted to a shimmer. I glanced up and saw a plane, but then i looked back because it didn't have wings that I could see. I continued to watch it cross the sky under cloud level. Today we have a few fluffy white clouds in the 3000 - 4000 foot range. It was traveling roughly south to north and i was traveling east to west. It was not moving too fast, and its speed seemed to stay consistent. After a min, maybe a little more, it was in the field of view directlt in front of my, when it seemed to darken out. It just kinda went from shiny metallic to a shadow and gone. I continued watching the area for another couple of minutes where I last saw it and the path it was on, but i never noticed it again. The object itself seemed maybe cigar shape and as it came closer to center of my view, it was more like a cone, wide at the back to a point in the front, front being direction of travel. the wider back seemed to have more reflection than the front. I never did see anything that appeared to be wings or any other identifiable marks. We do have military and personal aircraft in the area frequently, but I don't feel this looked like the planes I'm used to seeing. With the cloud heights and the position of the object, I suspect it was about 1 mile from me line of sight and no bigger that a 737, possibly smaller. Commercial flights in this area would typically be much higher."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.256268,+-79.282249(38991)&iwloc=A&hl=en\"> mufon case (38991) map </A>","Weather Factors":"Unknown"}