{"trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around April 30th 1977"],"Date of the Event":"04/30/1977 01:10 UTC","City":"Memphis","Log Number":"US-09252005-0005","Object Flight Path":"Hovering then path","Region":"Tennessee","Object Features":"None","Date Submitted":"04/30/1977 01:10 UTC","Summary":"Five police officers on duty saw triangular shape with bright lights","Case Number":"3899","Longitude":"-90.04311","divs":["sighting detailsin may 1977 two memphis city police officers on duty were southbound on 1-240 midtown near the 1-240 \\ i-55 split at norris road intersection. (lamar todd, tact squad captain, driving, who submitted this report, was with partner jerry jeter, tact officer.) jerry jeter made the comment \"i saw something in the air.\" they got off the interstate, turned around to head northbound and got off on the norris road exit near prospect park golf course. they stopped, and saw a triangular shape with bright lights hovering 250-300 feet above power lines. to get a better view, jeter got out, pointed the sighting scope of his rifle; the object moved away slightly, to 1000 feet. they watched for a few seconds and the object then moved quickly away over the horizon, disappearing instantaneously. lamar todd (who was also at that time a retired marine vietnam veteran) estimated 25 to 30 miles visibility that night. they called in on the radio but were told faa reported no air traffic was present. they later found out three off-duty police officers in the north precinct also saw the object near plough inc. (jackson ave. & warford rd, about 10-12 miles distant from their location."],"Tags":"City","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.158634,+-90.04311(3899)&iwloc=A&hl=en\"> mufon case (3899) map </A>","Disposition":"Unknown","Object Shape":"Triangle","Latitude":"35.158634","Country":"United States","Source":"MUFON","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/3899.html.txt","/var/www/straped/mufon/org/3899.html"],"Sighting Duration":"Undisclosed"}