{"map":"<A HREF = \"http://maps.google.com/maps?q=41.362632,+-81.744083(38993)&iwloc=A&hl=en\"> mufon case (38993) map </A>","files":["/var/www/straped/mufon/html2text/38993.html.txt","/var/www/straped/mufon/org/38993.html"],"Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-81.744083","Country":"United States","divs":["Sighting DetailsMy wife and I were sitting in our front yard enjoying a nice summer evening when we both noticed a orange-reddish glowing orb coming from the soutwest.My wife spoke first asking if that is a helicopter,I said no I do not see any blinking red and green lights or any sound(I grew up and lived for 27 yrs. less than 2 miles from Hopkins International airport and have been observing aircraft my whole life.)The object was on a straight trajectory toward the northwest like a satellite but appeared to be below the clouds.(My wife and I spend many summer evenings observing satellites and have observed the ISS and Space Shuttle and this was much brighter than either).we continued to observe the object travel on it's trajectory until it went behind some clouds, at that point I noticed and brought to my wifes attention that the Moon(which was close to full) cast a shadow on the clouds and, the shadow was a perfect circle. At this point my wife and I are trying to figure out what we saw by ruling out all possibilties. My first thought was a satellite because of the straight trajectory, but this was brighter than any satellite either of us have ever seen.Next we thought that possibly it could have been a meteor but I have never seen one that bright that did not have a trail(I have been an amatuer Astronomer for over 30yrs. and have observed every astonomical phenomemoan there is).Then I suggested space junk entering the atmosphere but we did not witness any breakup of the object like you would expect from a stallite rentering the atmosphere.My last thought was that it was the SpaxeX Falcon9 coming in for splash down but when I looked it up online I found out that the splash down was 2 days prior.Our only explaination would be a bright satellite we did not know of or an Unidentified Flying Object."],"Latitude":"41.362632","Date Submitted":"06/08/2012 06:09 UTC","Object Features":"None","Object Shape":"Sphere","Date of the Event":"06/02/2012 11:26 UTC","Region":"Ohio","Case Number":"38993","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","City":"Parma","trends":["There have been 4 other sightings in Parma","There were no other sightings in Parma on or around June 2nd 2012"],"Log Number":"US-06082012-0026","Sighting Duration":"00:05:00","Summary":"Glowing orange reddish orb traveling from the southwest to northeast.","Disposition":"Unresolved"}