{"Object Flight Path":"Hovering then path,Path with directional change","Case Number":"3900","Date Submitted":"07/15/1966 08:00 UTC","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around July 15th 1966"],"Latitude":"41.087783","files":["/var/www/straped/mufon/html2text/3900.html.txt","/var/www/straped/mufon/org/3900.html"],"Country":"United States","Region":"Indiana","Source":"MUFON","Weather Factors":"None","City":"Fort Wayne","Tags":"City","Object Shape":"Star-like","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-85.136101","Summary":"Saw object in sky in summer of 1966. Looked at it through telescope. It had interior lighting but no running lights. Object was 1/4 mile away and got to as low as 400 ft above the gound.","Object Features":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIn late summer of 1966 I was in the backyard with my family about 830 or nine o'clock in the evening when I noticed a bright object low in the sky, which I thought was a star . I had a 4 inch reflective telescope and told one of the kids to run in the House and get it for me. I sent it up on its tripod and proceeded to watch the star. I couldn't keep it insite when I realized it was moving. I finally moved the telescope in accordance with its movements and soon discovered that I was not looking at one light, but three. These were not lights like a headlight, but more like interior lighting . I kept watching it, keeping my telescope aimed at it and this went on for probably 20 minutes, since this was late in the evening it was getting dark and although I could not see the outline of the object, the lights were visible all the time. There were no other lights, no running lights, no strobes, just these three illuminations. Since I am a private pilot and spent three years in the Air Force I knew something about flying and do have running lights , and this thing had none . The time it got up to me I estimate it was maybe 300 to 400 feet above the ground and when about a quarter of a mile from my location it made a left turn which took it straight west. When I first saw it it was in the southeastern sky and came straight towards me for 20 minutes or so. When it made a left turn I could no longer see anything. The rules of flying keep you at least 1000 feet above the city or high enough to glide to a safe distance in case of engine failure. I doubt this thing was anymore than 400 feet above the ground. I had an insurance agency and had been talking with some of my agents about unidentified flying objects. On Monday morning when we were all together one of my agents told me, I would not believe what he saw. He had been making an insurance call and decided he needed to relieve himself before he made the call. He pulled down a side road, shut off his car, and was outside when he noted the three lights coming straight at him and going over his head at about 400 feet above the ground. He described to me exactly what I had seen with my telescope. I was in Fort Wayne, Indiana and he was about 20 miles away from me close to Decatur Indiana. We saw the same thing but it went right over his head. I did not know then nor do I know now what I saw. It was certainly an unidentified flying object."],"Disposition":"Insufficient Data","Log Number":"US-09252005-0006","Date of the Event":"07/15/1966 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.087783,+-85.136101(3900)&iwloc=A&hl=en\"> mufon case (3900) map </A>"}