{"Object Shape":"Cigar","Region":"Virginia","Sighting Duration":"00:00:15","Tags":"City","divs":["Sighting DetailsMyself and a friend where driving on a state road, we were on our way to go cut firewood after getting off work. We saw a dull silver cigar shaped craft appear in front of us about 200 feet away from us in the sky descending in a straight path about 45 degree angle downward towards us at a very slow rate of speed. We both asked each other at the same time ,do you see that? As it got closer I slowed almost to a stop thinking it would hit us, I swerved towards right hand side of the road hoping to avoid contact but just before it got to us it disappeared. We were no more than 20 feet away at that point. The sighting seemed to last about 15 seconds. We saw no visable meens of flight, no wings, no windows, no doors, no welds, no rivets, it was dull and almost a well used silver metal, looked like mercury. We both thought it would hit us or the ground in front of us, but it just simply seemed to vanish before our eyes. The craft was about 60 feet in length and 12 to 15 feet thick. It was a clear day about 4:30 in the afternoon. We both sat there for a few seconds in stunned silence. After arriving at our destination, about 1 mile away we relized it had taken 14 minutes longer to get there than it should have taken. My friend wanted to ask around at farm houses in the area if anyone else had seen the object, but I was a buisness owner in the area and was afraid that may not be the best idea. I do not know what we saw that day, but we were not drinking and were both clear headed at the time. To this day I have never told anyone but my wife about the craft but another odd occurance recently has made me want to report my sighting."],"Longitude":"-78.367506","Log Number":"US-06082012-0024","Weather Factors":"Unknown","Case Number":"39000","Object Features":"None","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.422627,+-78.367506(39000)&iwloc=A&hl=en\"> mufon case (39000) map </A>","Summary":"dull silver craft desending no welds or rivets, almost hit my truck. I was with another person and we both saw the object we had to swerve to avoid contact with craft in broad daylight.","files":["/var/www/straped/mufon/html2text/39000.html.txt","/var/www/straped/mufon/org/39000.html"],"trends":["There has been one other sighting in graves mill","There was one other sighting in graves mill on or around September 24th 1999"],"Date Submitted":"06/08/2012 09:28 UTC","Country":"United States","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"09/24/1999 04:32 UTC","Latitude":"38.422627","City":"graves mill"}