{"divs":["sighting detailsapprox driving route: i was leaving from my lunch break in my car driving. was driving n on n. 9th ave in greeley, heading towards approx 4th street, possibly 3rd or 5th. can't recall as i am unfamiliar w\\ greeley streets and i was running late to work. as soon as i turned n. onto 9th ave, it was obvious, quite low and right in front of me. i guess approx 200-300 ft above. (i at first kept heading w towards 10th, towards my work, really wondering what i am seeing,rationalizing probably birds, but realizing they are too strange to be birds) because i was late,better ignore my thoughts and intrique). then suddenly thought, no, too odd, gonna follow them towards the e. i had to head a bit n first , then turn right to head e down another road to follow them. eventually they disappeard from view because of treetops and they moved fast...i did pull over at the end (approx two min of driving and following w\\ my eyes) and i tried to take 2 cell phone photos, but really at that point they were too far away and didn't show up. what i saw: i saw about 10 or more, maybe 12, group of white orbs\\circles, and then a small separated group of 3 white orbs or circles heading s.e. they were almost in formation of birds, but not quite. they were bouncing around in and out of formation. i immediately thought and felt they weren't birds, although i rationalized that they were a group of pelicans or some group of very white birds. but they did weird dropping out of formation and kind of floating away from formation (mostly the large group) they also changed shapes. went from round to chevron, to oval or egg like shape, randomly. they moved quickly and they disappeard from sight pretty quickly as treetops obscured the view. however i got 3 or 4 really good views as i drove along. they changed shapes, moved oddly and floated around. at one point, and what has convinced me that these are not birds, is that the second or third time i had a very clear view, and they were close, there was a very clear, reflection off of one of them in the large formation. i knew it could not be a bird. it clearly reflected like metal or almost bright enough like a mirror. it was in it's chevron like form when it had the reflection. the formations (both small and large) kept moving s.e. and i left. the only emotions or reactions i had were intrique and then regret that i didn't follow it right as soon as i saw it. i could have gotten a better photo perhaps. they did move fast however and treetops obscured them."],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.435446,+-104.746543(39025)&iwloc=A&hl=en\"> mufon case (39025) map </A>","Tags":"City","trends":["There have been 19 other sightings in Greeley","There was one other sighting in Greeley on or around June 8th 2012"],"Date of the Event":"06/08/2012 12:49 UTC","City":"Greeley","Summary":"saw total of approx 12-15 round orbs/changing shapes, flying in odd patterns,daytime","Country":"United States","Latitude":"40.435446","Case Number":"39025","Source":"MUFON","Object Features":"None, Unknown","Log Number":"US-06082012-0049","Sighting Duration":"Undisclosed","Longitude":"-104.746543","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/39025.html.txt","/var/www/straped/mufon/org/39025.html"],"Disposition":"Unresolved","Date Submitted":"06/08/2012 09:50 UTC","Object Shape":"Chevron, Circle, Egg, Oval, Sphere, Square, Rectagular, Triangle","Object Flight Path":"Path with directional change,Other","Region":"Colorado"}