{"divs":["sighting detailsi began looking at the sky around 9:30 last night, the sky cleared up from the rain so i left my window wide open to look at the stars. at about 10pm, i saw lights blinking towards the west, i thought it was just a plane but it was blinking like a strobe light in the same spot off in the distance for 30 minutes before i decided to take out my telescope. when i pointed it at the blinking lights, my heart literally stopped! i screamed to my boyfriend, who was also amazed by these lights, \"that's a f@#%ing spacecraft, dude!\" he ran to look through the telescope and was in complete agreement that it was not anything he'd ever seen before! it was a diagonal line of lights, at one end, a steady green light. at the opposite end, there was a steady orangish light - in the middle were 3 erratically blinking white lights and in between the white and orange lights were distinctly smaller red flashing lights. my boyfriend and i were quick to get outside opinions, we yelled for my roommates who were also astonished at the sights of this craft-like object. we all watched for over an hour as this craft slowly hovered from left to right and saw a single orangish orb of light which appeared to dock with this vehicle and quickly drift away. between 11:30 and 12, a large\\bright white star-like object was also visible coming from that direction. we all watched as it ever-so-slightly drifted across the sky and over our house. we all ran outside to watch this light drift through the sky and slowly out of sight (northeast). as for the craft-like object, it was visible for about another 30 minutes and was drifting from side to side, which was clearly visible from the telescope and even visible with the naked eye. i was also able to record a video of the flashing lights through the telescope with my phone."],"files":["/var/www/straped/mufon/html2text/39036.html.txt","/var/www/straped/mufon/org/39036.html"],"Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-74.003473","Object Shape":"Cigar, Star-like","Case Number":"39036","Weather Factors":"Unknown","trends":["There have been 579 other sightings in New York","There were 43 other sightings in New York on or around June 7th 2012"],"City":"New York","Tags":"City","Log Number":"US-06082012-0056","Date Submitted":"06/08/2012 09:56 UTC","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Latitude":"40.722953","Date of the Event":"06/07/2012 12:00 UTC","Disposition":"Unresolved","Summary":"Diagonal string of flashing lights hovering in sky - orange orb docks. Star-like object drifts across sky.","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=40.722953,+-74.003473(39036)&iwloc=A&hl=en\"> mufon case (39036) map </A>","Country":"United States","Region":"New York"}