{"Latitude":"32.753472","files":["/var/www/straped/mufon/html2text/3903.html.txt","/var/www/straped/mufon/org/3903.html"],"Weather Factors":"None","Region":"South Carolina","Summary":"WHILE I WAS AT A NEIGHBORS HOUSE WITH SOME FRIENDS JUST HANGING OUT AND SHOOTING THE BULL WE SAW 7 UFOS IT WAS REALLY AN EXCITING EXPERIENCE","Sighting Duration":"00:55:00","Tags":"City","City":"Charleston","Viewing Distance":"Unknown","Case Number":"3903","Disposition":"Hoax","trends":["There have been 20 other sightings in Charleston","There were 2 other sightings in Charleston on or around June 7th 2005"],"Country":"United States","divs":["Sighting DetailsOn Tuesday June 7, 2005 at 10:35 P.M. at night I was at a nearby neighbors house with some friends. We were out in the backyard grilling barbecue ribs, barbecue chicken, and steaks on the outdoor grills in the backyard I looked up and saw 3 circle UFOS. The first UFO was round and on the inside of the bottom it had red, yellow, and green lights then red, yellow, and purple lights the all red lights then all blue lights then again red, yellow, and purple lights then again red, yellow, and green lights and it emitted orange beams. The second UFO was round and on the inside of the bottom it had red and orange lights mainly red lights then it was a roquefort blue (what I mean by a roquefort blue it looked like roquefort and blue cheese salad dressing it had light blue lights the lights on the inside of the bottom looked like ROQUEFORT SALAD DRESSING it had light blue lights) it still had on the inside of the bottom roquefort blue lights then again red and orange lights mainly red lights and it emitted pink beams. The third UFO was round and on the inside of the bottom it had red, yellow and blue lights. Then came another larger UFO and on the inside of the bottom it had red, yellow and orange lights and it disappeard as fast as it came. Then all 3 circle UFOS on the inside of the bottom had all red lights then all pink lights then all 3 circle UFOS on the inside of the bottom had all roquefort blue lights and emitted red beams then all 3 circle UFOS had all red lights again then all green lights. Then 3 triangler UFOS showed up they were all red lighted with purple dots at every corner than yellow dots at every corner then all 3 triangler UFOS were all orange lighted with yellow dots at every corner. We were still grilling our food on the outdoor grills in the backyard then all 3 circle UFOS on the inside of the bottom all red lights then all yellow lights then all green lights then all purple lights then all blue lights then all orange lights then all roquefort blue lights then all pink lights. So all 3 circle UFOS on the inside of the bottom had all red, yellow, green, purple, blue, orange, roquefort blue, and all pink lights. Then all 3 circle UFOS on the inside of the bottom had all roquefort blue lights and emitted red beams then again all yellow lights then again all orange lights. Well we also had some chefboyardee homemade pizzas in the oven. We were still grilling barbecue ribs, barbecue chicken, and steaks on the outdoor grills in the backyard and all 3 circle UFOS on the inside of the bottom had red, yellow, and pink lights and the 3 triangler UFOS had all roquefort blue lights with red dots and every corner and they hovered over the treetops in the backyard we watched these UFOS as we were still grilling our food on the outdoor grills in the backyard. And we had cokes and Dr. peppers to drink as we were grilling our food on the outdoor grills in the backyard. Then all 3 circle UFOS changed color one UFO on the inside of the bottom had all red lights and the other circle UFO on the inside of the bottom had all yellow lights and the other UFO on the inside of the bottom had all orange lights. And the 3 triangler UFOS changed color and were all green lighted with orange dots at every corner. We got our chef boyardee homemade pizzas out of the oven And we were almost done grilling our food on the outdoor grills in the backyard. And all 3 circle UFOS and all 3 triangler UFOS changed to a white color and they all disappeared. We were all done grilling our food on the outdoor grills in the backyard. When all 6 of these UFOS disappeard the 3 circle UFOS on the inside of the bottom had all white lights and the triangler UFOS had all white lights with black dots at every corner. We watched these UFOS disappear and we didn't see them no more. They were going towards the ocean (TO FOLLEY BEACH) when they disppeard I guess they crashed out in the ocean. All 6 of these UFOS the three circle UFOS and the triangler UFOS I guess crashed out in the ocean. We went inside to eat out food we grilled on the grill and the pizzas we had in the oven. We went back out in the backyard and didn't see these UFOS no more. Then we saw a big cone UFO it was red on top and yellow on the bottom. Then it was yellow and orange yellow on top and orange on the bottom. Then it was red on top and purple on bottom. Then it disappeard as fast as it came. It was going towards to ocean I guess it crashed out in the ocean. So thats 7 UFOS we saw 3 circle UFOS and 3 triangler UFOS and a cone UFO. We went in the backyard and we didn't see none of these UFOS no more. There was no sound to these UFOS. It was a very clear night outside. It was really fun to be with my neighbor friends and have dinner and it was really exciting to see these UFOS. I have never seen UFOS like this before and my neighbor friends have never seen UFOS like this before."],"Object Shape":"Undisclosed","Log Number":"US-09262005-0002","Date of the Event":"06/07/2005 10:35 UTC","Object Flight Path":"Undisclosed","Longitude":"-79.952845","map":"<A HREF = \"http://maps.google.com/maps?q=32.753472,+-79.952845(3903)&iwloc=A&hl=en\"> mufon case (3903) map </A>","Object Features":"Undisclosed","Date Submitted":"06/07/2005 10:35 UTC","Source":"MUFON"}