{"Summary":"1st one was a glowing bright redish pink oval light. The 2nd one was more red and more star shaped but the same size. -ish light slowly moving on path north to southwest","Object Flight Path":"Straight-line path","Source":"MUFON","Disposition":"Unresolved","trends":["There have been 2 other sightings in Lebanon","There were no other sightings in Lebanon on or around June 8th 2012"],"Log Number":"US-06082012-0083","Viewing Distance":"101-500 Feet","Date Submitted":"06/08/2012 11:09 UTC","Longitude":"-86.269688","map":"<A HREF = \"http://maps.google.com/maps?q=36.285171,+-86.269688(39059)&iwloc=A&hl=en\"> mufon case (39059) map </A>","files":["/var/www/straped/mufon/html2text/39059.html.txt","/var/www/straped/mufon/org/39059.html"],"Latitude":"36.285171","Weather Factors":"Unknown","City":"Lebanon","Case Number":"39059","Sighting Duration":"00:00:40","Date of the Event":"06/08/2012 09:09 UTC","divs":["Sighting DetailsI was sitting in the front yard and playing with the dog. I saw a bright light, which caught my eye because it was moving and was a pinkish red color. It was partially obscured by a tree in the yard. It was moving from the northeast to the southwest. When it emerged from behind the tree, I looked at it for a second trying to figure out what it was. It made absolutely no sound and was moving at a constant speed, too low for an airplane, plus it was shaped like a football with rounded ends. It wasn't moving nearly as fast as an airplane or helicopter would be at the altitude and distance from which I observed it but it was going much faster than a blimp would have been able to go. I ran down the west side of the house to our backdoor to get my wife to see it. By the time I reached the back door it was passing over the tree line on the west side of our house but you could still see it through the trees every now and then. By the time my wife got out there and we ran to the tree line to watch it, it was already several miles away but still visible, still pulsating and still on the same straight line course. My wife went back in and I went to put up the dog. About 15 mins. after the first one went over a second one came over flying the exact same flight path but higher in altitude. This one looked more star shape and rounder than the first,but was the same pulsating color. I got my wife and we both watched this one as it crossed over the back yard and disappeared over the western treeline. We both had a really good look at the second one. It was on the exact directional path as the first on only higher in altitude. It was also silent,too low for an aircraft, also no blinking lights, and also at the same rate of speed. There was no wind, no clouds and the moon wasn't up yet."],"Region":"Tennessee","Tags":"City","Object Shape":"Blimp, Oval, Star-like","Country":"United States","Object Features":"None"}