{"Object Features":"None","Source":"MUFON","City":"Catskill","Date of the Event":"06/07/2012 02:45 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.269208,+-73.912966(39054)&iwloc=A&hl=en\"> mufon case (39054) map </A>","Longitude":"-73.912966","Latitude":"42.269208","Case Number":"39054","Tags":"City","Weather Factors":"Unknown","Log Number":"US-06082012-0078","Region":"New York","files":["/var/www/straped/mufon/html2text/39054.html.txt","/var/www/straped/mufon/org/39054.html"],"Object Flight Path":"Hovering then path","trends":["There has been one other sighting in Catskill","There were no other sightings in Catskill on or around June 7th 2012"],"Disposition":"Unresolved","Date Submitted":"06/08/2012 10:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Summary":"Oval object dropped out of cloud, hovered, then acended back into cloud","divs":["Sighting DetailsI was out in the back yard, talking on the phone when I heard some rumbling thunder. I looked up at some very high clouds and noticed a metalic oval craft dip out of a cloud, hover for a second or two, then drift back up into a cloud. We have been having major thunderstorms on an almost daily basis for the last several weeks, and I have noticed that we have had unusual cloud cover for this area of NY state. I am not a UFO person, and this is the first time I have ever seen anything like this. When you see planes, helicopters, birds and the like, your brain tells you it's \"ours\", and you dismiss it. When you see something like the object I saw, you KNOW it's not one of \"ours\", and I tell you, the hair on my arms stood up! The thing is, I was at work, discussing business with an associate, and nothing in any of my conversations, with anyone for the past several months, had anything to do with UFO's, or anything related to same. Even as I write this, the hair on my arms wants to raise. I know I saw something either way ahead of our technology, or something very secret! From now on, I will be watching the skies!"],"Country":"United States","Object Shape":"Oval"}