{"Object Flight Path":"Straight-line path","Date Submitted":"06/09/2012 01:37 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/39069.html.txt","/var/www/straped/mufon/org/39069.html"],"Case Number":"39069","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn May 27th, at approximately 10:15pm, my 5 year old son and I were outside about to go to the store quickly. He said \"Look Daddy, fire!\" and I immediately looked all around me and didn't see anything. He said \"Up there!\" and pointed up in the sky. I immediately saw the orangeish-redish-whiteish light, and immediately thought it was a bright, weird looking airplane flying kind of low. After looking at it for a few more seconds, I noticed 2 more of these lights, and they all formed a triangle. At first, I tried to make sense of what I was staring at - synchronized planes, helicopters, fireworks, etc. but nothing I've seen ever looked like this before. I couldn't believe what I was looking at - the lights were so bright for how far away they were, and all 3 lights were moving at the exact same speed in a triangular shape. It then it clicked that I wasn't looking at 3 different objects, but one 'transparent' triangular flying object with these bright lights at each end. I say 'transparent' because you can usually see the outline of objects flying in the sky that low, and when I focused in the middle of these three lights, it looked like every other part of the sky - no outline or anything. I then called to my wife to come outside ('immediately!') and she ran outside and saw the same thing. We stood there, with my son, just watching this thing fly off into the distance over the horizon. It came from the North-East and headed South-West, but more South than West. The whole thing lasted about a minute or so, and I wish everyday that I would have taken a picture... I just was so lost in the moment I couldn't think of anything else! The thing that I remember the most was the lights - their colors were so unusual and bright... Imagine standing outside, seeing three 'fire-like' lights that formed a (huge) triangle, fly slowly across the sky... Not something you can easily forget!!!"],"City":"Plainfield","Tags":"City","Weather Factors":"Unknown","Log Number":"US-06092012-0005","Summary":"3 bright orange-ish lights synchronize (transparent triangle) heading south","Longitude":"-88.200678","Country":"United States","Latitude":"41.606619","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.606619,+-88.200678(39069)&iwloc=A&hl=en\"> mufon case (39069) map </A>","Object Shape":"Triangle","Date of the Event":"05/27/2012 10:15 UTC","Region":"Illinois","trends":["There have been 20 other sightings in Plainfield","There were no other sightings in Plainfield on or around May 27th 2012"],"Disposition":"Unresolved","Object Features":"Unknown"}