{"Disposition":"Unresolved","Region":"North Carolina","Case Number":"39062","Latitude":"36.21028","Weather Factors":"Unknown","Summary":"Black triangle shaped craft. Flying at tree top level, making no sound. Witnessed by two other people besides myself.","Date of the Event":"06/15/1991 03:00 UTC","Date Submitted":"06/09/2012 12:23 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","Log Number":"US-06092012-0002","Sighting Duration":"00:07:00","files":["/var/www/straped/mufon/html2text/39062.html.txt","/var/www/straped/mufon/org/39062.html"],"Source":"MUFON","trends":["There have been 3 other sightings in Rural Hall","There was one other sighting in Rural Hall on or around June 15th 1991"],"Country":"United States","Longitude":"-80.300262","Object Features":"Dome","Object Shape":"Triangle","City":"Rural Hall","map":"<A HREF = \"http://maps.google.com/maps?q=36.21028,+-80.300262(39062)&iwloc=A&hl=en\"> mufon case (39062) map </A>","Tags":"City","divs":["Sighting DetailsMy mother, a friend and I were traveling to a destination (I was 16 at the time so ya mom was driving-just got my license so...) when our cars engine sputtered a little. I being a passenger; constantly look out the windows when some one else is driving. We had just turned onto the road leading to my friends house when I noticed something in the distance rather large; then bam-it was right on top of us and I can assure you there was nothing in the sky before this. As we traveled about 200ft. down the road our car sputtered a little and I looked off to my right. Can't say why just did and there it was. A massive triangle shaped craft, flying at tree top level. At first I thought it was a bomber; then as I looked more the shape really started to take focus. It wasn't a wing bomber and it wasn't anything made by our government or military as I had read and study such thing as a child ( i.e. thanks to my grandfathers and the boy scouts). I had seen 7 objects like it about 6 months to a year early over the woods at my house ( another report I'll file after this one). I remember being extremely excited about my mom being able to see something like I had seen. I instructed my mom to pull over in some man's drive way and got out of the car. We watched as the craft moved ever so slowly (at treetop level) across the road over this guys house and us. It was moving in an north-northwesternly direction. It was about 30-40 ft off the ground maybe a little more. No birds chirped no grass hopper sang. There was only silence and this beast of a ship passing over head. I was amazed. To my chagrin I recall running and knocking on this strangers door but no one was home ( LOL the driveway was empty). As it passed over the house and over some open land my friend said we should be moving on and so we moved on. I hope this helps and thanks for the site. And a big thanks to PappyOG! Nice to be able to get this off my chest...so to speak."]}