{"Date Submitted":"06/09/2012 02:21 UTC","Latitude":"36.21644","City":"Rural Hall","Object Shape":"Triangle","Date of the Event":"Unknown","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsI was living in a small community out side a large city when this occurred. Our home was old. Built in 1901 in the Blue Ridge mountains and shipped to it's new foundation in the late 1950's. Every board and stone was moved. In the living room of the home we had an organ, which bore a Golden Royal insignia that read, \"Given to the first English speaking colonies of the America's\". Man I loved playing that wicked thing. I had snuck out of my house that night to take a puff off a cancer stick. I was 15 I kinda had to sneak. We had a long drive way and a rather large front yard. I would say I was probably a good 25 yards away from the house at the end of our drive way. There was located a very large bush. Big enough for me to stand in front of... As I stood there puffing away with my left hand as my right was in a cast ( longer story ) I noticed a beam of light hit the woods in front of me. From the bush the woods were probably about 25-30ft away. I looked up and saw 5 objects all shining beams into the woods where earlier that day I had built a fort out of boredom ( with a little nostalgia ); as a child I had constructed one for the BB-gun wars we had when I lived in the Mountains of my State - long before they made Air Soft. I thought the Police were chasing someone and that the individual had somehow gotten into my woods. I was amazed. So I walked up to the edge of the forest and leaned over the fence to get a better look. This put, what I assumed were helicopters about 30-40ft. above me. Then I noticed something. There was no sound. NOTHING! They made no noise. The frogs had stopped, the crickets had stopped there was no sound. I couldn't even hear the highway. I have flown in choppers and had the chance to fly one and I can assure you the make noise. Even advanced warbirds make some amount of noise. Not these puppies. I had seen domes on top, not exactly in the middle but maybe ( I was looking at angles ) and they had spot lights and side lights which I thought were running lights. With it being dark the hole of the vessel looked black. Being right under neath them I could look up at the sky and with the moons help ( Full Moon or close too it ) I could clearly see they had no tails. They were triangle shaped. I slowly backed up trying to figure out what they were and as I got back to the bush ( backing up the whole way ) I watched to more come in and they to began shining spot lights around and on the area I had built my little fort. I realized after a few moments that they weren't man made. They moved kinda like a chopper would around in circles ( some going up and or down out of the path of others ) but that was a search pattern. They moved up and down and around the whole length of forest in front of my house. After a long period of time I got the nerve up to look back in the woods so I got underneath them again and could swear I saw something very white moving around at my fort. I broke for the house. Don't know why but I was terrified. As I got back inside my mother scolded me for being gone for three hours and said she had yelled from the front door. She somehow didn't see them or payed no attention. Thats why I was thrilled when she and my friend saw the giant one on the way to my friends house. Made me feel less like a nut. I looked outside later on that night and they were gone. Big thanks again to you fine folks and your website for listening...so to speak and a phat thanks to PappyOG! God Bless and thank you."],"Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/39073.html.txt","/var/www/straped/mufon/org/39073.html"],"Summary":"7 strange craft in the sky and a young boy trying to sneak a cigarette.","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-80.294992","Object Features":"Dome","Log Number":"US-06092012-0009","trends":["There have been 3 other sightings in Rural Hall","There were no other sightings in Rural Hall on or around"],"Case Number":"39073","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=36.21644,+-80.294992(39073)&iwloc=A&hl=en\"> mufon case (39073) map </A>","Source":"MUFON"}