{"Log Number":"US-06092012-0007","Latitude":"31.124792","Country":"United States","Object Shape":"Fireball, Sphere","files":["/var/www/straped/mufon/html2text/39071.html.txt","/var/www/straped/mufon/org/39071.html"],"Date of the Event":"06/08/2012 10:07 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Region":"Texas","Longitude":"-97.707181","Tags":"City","Summary":"Friend noticed object in sky. we turned around and noticed a bright brilliant red orb in sky","Case Number":"39071","Date Submitted":"06/09/2012 01:43 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=31.124792,+-97.707181(39071)&iwloc=A&hl=en\"> mufon case (39071) map </A>","City":"Killeen","Object Features":"None","divs":["sighting detailswe were in the back yard of a friends house winding down our evening. friend with view of sky behind house noticed object and we looked after he told us to. we thought the object was a military flair then decided against it because of the location of the object. then again when the object changed direction and quickly moved away the object was a brilliant bright red orb that appeared to be within 1\\8th of a mile from us. the light (orb) had no flicker, no degree of change in the light intensity at all until the object changed direction. the light changed from red to a super brilliant white with red aura. the object appeared to be headed in our direction then paused briefly and change direction heading over the airfield of ft. hood. tx then the object appeared to pick up speed very quickly and disappeared behind the treeline. the object as it was approaching us was displaying a hovering type flight pattern. as it changed direction it appeared to sway slightly from left to right as it gained speed. feeling were very objective. being in the military and prior military we have some experience with military aircraft and military aircraft training maneuvers. we tried to debunk the possibilities of what it was and failed to do so. the object as it sped away was lost in the tree line of the back yard of the house we were at."],"Weather Factors":"Unknown","Sighting Duration":"00:05:00","trends":["There have been 16 other sightings in Killeen","There were no other sightings in Killeen on or around June 8th 2012"]}