{"Latitude":"44.321294","trends":[""],"Date Submitted":"06/09/2012 01:53 UTC","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"39072","Date of the Event":"06/08/2012 10:01 UTC","Summary":"Large red/orange colored ball (light) hovering /moving","Region":"Michigan","Longitude":"-85.594564","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/39072.html.txt","/var/www/straped/mufon/more/39072_submitter_file1__photo1...6812.jpg","/var/www/straped/mufon/more/39072_submitter_file2__photo2...6812.jpg","/var/www/straped/mufon/org/39072.html"],"Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Shape":"Circle","divs":["Sighting DetailsThis sighting took place in the same area as the sighting that I reported on May 9, 2012. On May 9th, I was traveling alone in my vehicle... Tonight (June 8, 2012) my husband was with me in the vehicle and he witnessed this sighting. We were traveling east on M-55... we turned north on Sand Lake Road. About a half mile north of M-55, on Sand Lake Road (at 10:01 pm), I looked east (out the passenger window) and saw a ball of light in the sky (60-70 degress off the horizon). I asked my husband to \"look\" at what I was looking at, and he immediately pulled over to the side of the road, turned the engine off and jumped out of the vehicle. He wanted to find out if there was any sound coming from the object. There did not seem to be any noise coming from the object, but within seconds of the engine being turned off a car coming from the other direction drove by... by the time the noise of the passing car was gone the object in the sky was further away from us and we could hear nothing coming from it. My first impression was that it was stationary in the sky, but upon stopping (the vehicle) I relized that it was moving VERY slowly... It appeared to be moving away from us (heading east). It was a BRIGHT, CLEAR, ball of light that was so very \"out of place\"... It was the ONLY light in the sky... There were no stars (or moon) visable, there was heavy cloud cover, and it had recently rained. This object was moving below the cloud cover. My husbands first impression was that it was a light from a radio or cell tower... but it was too high in the sky, there are no radio or cell towers in the area, and it seemed to move away from us very slowly once we had stopped the vehicle. We both agree that the Object was a solid ball of light that changed colors from dark red, to light red, to orange, to yellow, with an occassional flash of a white light... all within the solid area of the \"ball\".... There were no fuzzy edges... It was a crisp, round, solid ball of light... I would describe the light changes as a random sequence of colors, not necessarily fading in and out, just a continuous color change with no pattern... It was not pulsating and the color changes did not seem to be in any squence or in any pattern, however the white light did seem to be more of a flash or strobe, and the white light was in addition to the color... The \"ball\" was never solid white.... My husband first thought it was some type of remote control plane (since he flies RC planes, this was his logicical thinking), but he was not able to hear any noise coming from the object... and his first impression of the color changes reminded him of a Chinese lantern floating in the sky... with the occassional white light being a glimpse of a flame. He then described the color changes as a bright light with a colored flag wavering in front of the light... I must agree... \"wavering\" is a good way to describe the color changes. When we first saw the object it was about the diameter of a straw (if you held a straw at arms length)... When my husband got out of the vehicle, I rolled down the passenger window and grabbed my cell phone to take a picture... at this time the object was moving away from us (and seemed smaller).... The photo I took shows not only the cloud cover, but also a power line just above the object. The photo also looks as if the object has a \"tail\" which is not what we saw with our \"eyes\"..... I then got out of the vehicle, but my husband asked me to get back in so we could turn around and go back to M-55 to follow the object which seemed to be heading east. The second he turned the vehicle around, the object vanished... We had watched the object for approximately 2 to 3 minutes We continued back to M-55 and traveled east for a few miles hoping to see the object again, but we saw nothing...."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=44.321294,+-85.594564(39072)&iwloc=A&hl=en\"> mufon case (39072) map </A>","City":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-06092012-0008"}