{"Object Flight Path":"N/A","Longitude":"-111.878536","Tags":"City","divs":["sighting detailsi was standing on my front porch looking east just after 11 pm on june 5, 2012, when i noticed a line of horizontal lights close together just above the horizon. i thought it was aircraft at first. but then a second line of lights rose just above the first line, moved slightly to the left, tilted slightly down to the left, and started shaking up and down. i ran inside and got my camcorder but by the time i started shooting the objects had apparently turned into a flashing orb hovering in the same location. the orb itself never appeared to move and eventually just faded away. the whole event lasted for maybe 2 minutes. it all happened in the same spot in the sky. it was hovering 1\\2 mile south of ray road and somewhere east of alma school road, though it's hard to tell how far away it was. it was a clear night, the moon was bright and just past full, and was located about 15 degrees to the south and about 5 degrees above the object. the camcorder has a hard drive so the original video is still on it. i've never witnessed anything unusual like this in the sky prior to this."],"Date of the Event":"06/05/2012 11:05 UTC","Object Shape":"Circle","Case Number":"39078","Viewing Distance":"Unknown","Region":"Arizona","Sighting Duration":"00:02:00","Disposition":"Unresolved","Latitude":"33.324955","Log Number":"US-06092012-0013","trends":["There have been 52 other sightings in Chandler","There was one other sighting in Chandler on or around June 5th 2012","This sighting has never been favorited.",""],"Object Features":"None","Summary":"Saw a flashing orb hovering above the treeline in the distance.","Source":"MUFON","Country":"United States","Date Submitted":"06/09/2012 10:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.324955,+-111.878536(39078)&iwloc=A&hl=en\"> mufon case (39078) map </A>","files":["/var/www/straped/mufon/html2text/39078.html.txt","/var/www/straped/mufon/org/39078.html"],"City":"Chandler","Weather Factors":"Unknown"}