{"trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around June 1st 2005"],"Log Number":"US-09272005-0003","Tags":"City","Date Submitted":"06/01/2005 08:35 UTC","Object Features":"Undisclosed","Summary":"WHILE I WAS OUT WITH A FRIEND DRIVING AROUND ON THE TOWN WE WENT OUT TO DINNER AND SAW SOME UFOS WE COULDN'T BELIEVE IT.","Date of the Event":"06/01/2005 08:35 UTC","Case Number":"3907","Object Shape":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"32.781966","Region":"South Carolina","Longitude":"-79.922292","Disposition":"Hoax","City":"Charleston","Country":"United States","Sighting Duration":"00:20:00","divs":["Sighting DetailsI was out driving around one night it was 8:35 P.M. on June 1, 2005 on a Wednesday night we went to a MEXICAN RESTAURANT to eat dinner me and a friend. But when we drove by the CROSSROADS SHOPPING CENTER on Sam Rittenburg Boulevard and Ashley River Road we saw a UFO it was a circle UFO it had red, yellow, and orange lights on the bottom and emitted a blue beam then emitted green and purple beams then it changed into a cone UFO the top of the cone was red and the bottom of the cone was yellow. Then it changed into a triangler UFO then was all green lighted then 2 more triangler UFOS showed up then all 3 triangler UFOS were all red lighted then all purple lighted then 2 triangler UFOS were red lighted then the other one yellow lighted. Then all 3 triangler UFOS were all orange lighted and one emitted red beams then all 3 UFOS were still all ornage lighted then they disappeared going over the CROSSROADS SHOPPING CENTER and we didn't see them no more. It was exciting for us to see these UFOS it was partly cloudy outside and a warm night we pulled in the shopping center got out of our car and observed these UFOS we didn't hear no sound to these objects. Then we went to a convenient store and got some gas at the gas station and got some snacks and cokes and kit kat bars. Then we went ice skating at an ice skating rink and then I went to my friends house to hang out and have some beers and I spent the night there it was really a fun night and pretty neat to see these UFOS me and my friend will always remember seeing the UFOS we saw and going out to dinner and just hanging out."],"files":["/var/www/straped/mufon/html2text/3907.html.txt","/var/www/straped/mufon/org/3907.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.781966,+-79.922292(3907)&iwloc=A&hl=en\"> mufon case (3907) map </A>"}