{"Longitude":"-87.686883","Summary":"Ufo with Orb Trailing seen at the same time Chemtrails and Passenger jets were in the same airspace","Region":"Illinois","Country":"United States","Object Features":"None","Source":"MUFON","Tags":"City","Case Number":"39082","Date Submitted":"06/09/2012 06:47 UTC","Sighting Duration":"Undisclosed","divs":["sighting detailsi was sitting on my lanai and watching an untypical blue sky in chicago. the past 5 days have had little chemtrail activity, so when i started to see dispersants being laid, i decide to take some photos. as i took the first photo, i noticed something else whizzing past the plane ... at a much faster speed than the plane itself. what was most interesting is that it simply looked like a round ball, but in sync with the object was an orb trailing, almost parallel to the metallic object, but not close enough to be attached to it ... it was more like the orb was closely following this object. in my vision i could see a chmetrail heading directly away from the earth, almost as if it was going towards the atmosphere at a 90 angle ... in addition, were two passenger planes, so i could tell that the ufo was not a plane, as i had actual planes to compare it too. the whole sequence lasted about 3 - 5 seconds. i tried taking a photo, but i'm not sure i caught the image. i was using a cellphone camera, and after uploading the images i was able to capture during my very shaky and frazzled encounter, i'm not certain i caught anything. what puzzles me though is that my cell phone, which typically snaps away, started to freeze, and at one point somehow took a photo of the ground ... but i only ever had the camera pointed in the sky. i know the image appeared to be, from my perspective, about the size of an aspirin sitting on the table in front of you ... but nothing of the image appears in my pic ... although all of the other planes in the sky do appear. the shape of the image is what initially caught my attention ... almost a perfect sphere, but what really got my flustered was seeing the orb trailing it. the orb is what convinced me that this is indeed a ufo. the orb was white\\yellow and looked somewhat transparent\\translucent. it differed in speed but maintained a cloe proximity to the ufo. i wonder if anyone else saw it. i can send in the photos that i took of it ... but i'm not certain they show anything, although image enhancement may help? the problem is that the location of the image is simply blue where i remember the ufo\\sphere to have appeared. i've highlighted the images with white for the normal plane, blue for chemtrail planes and as the ufo\\orb got closer, it looks like they only refelcted light, but they move across the bottom of the sun as you can see in image 3 the white and blue spots are in one position, and image for they have moved ... i need a better camera. this was my first daytime sighting ever."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.895739,+-87.686883(39082)&iwloc=A&hl=en\"> mufon case (39082) map </A>","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","City":"Chicago","Date of the Event":"06/08/2012 02:42 UTC","Weather Factors":"Unknown","Latitude":"41.895739","Log Number":"US-06092012-0023","trends":["There have been 221 other sightings in Chicago","There were 2 other sightings in Chicago on or around June 8th 2012"],"Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/39082.html.txt","/var/www/straped/mufon/org/39082.html"],"Object Shape":"Circle"}