{"Sighting Duration":"Undisclosed","Object Features":"None","trends":["There have been 16 other sightings in Saskatoon","There were 2 other sightings in Saskatoon on or around June 7th 2012"],"divs":["Sighting DetailsAfter reading the report of a sighting over Saskatoon that took place a few nights ago I decided to do some sky watching at night. I have seen many objects and have acquired photos & video but only in daylight but the previous report caught my interest. I went out to my back yard at about 11:00 p.m. Although it was overcast with a fairly low layer of clouds I immediately noticed a star like object sitting stationary almost directly above me. Right away I began looking for any visable stars and not any were visable. In my opinion this object was beneath the cloud cover. I kept watching and it slowly just faded into nothing. Thinking well that was interesting, I started checking out other areas of the sky. As soon as my eyes returned to same area where the starlike object was, a much larger object was slowing travelling from west to east. It was very eerie as it was glowing inside the cloud cover, no blinking lights, absolutely no sound and gradually travelled over the peak of my house, I ran out to the front of the house thinking I would again see it, but nothing. A very interesting sighting."],"Weather Factors":"Unknown","Case Number":"39080","Viewing Distance":"501 Feet - 1 Mile","Summary":"Yes, something is happening over Saskatoon, from starlike to large moving object","Date of the Event":"06/07/2012 12:00 UTC","Object Flight Path":"Path with directional change","Date Submitted":"06/09/2012 01:20 UTC","files":["/var/www/straped/mufon/html2text/39080.html.txt","/var/www/straped/mufon/org/39080.html"],"Country":"Canada","Object Shape":"Unknown","City":"Saskatoon","Tags":"City","Latitude":"52.13437","Log Number":"CA-06092012-0021","Longitude":"-106.647656","map":"<A HREF = \"http://maps.google.com/maps?q=52.13437,+-106.647656(39080)&iwloc=A&hl=en\"> mufon case (39080) map </A>","Region":"Saskatchewan","Disposition":"Unresolved","Source":"MUFON"}