{"trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around June 7th 2005"],"Tags":"City","City":"Bangor","Country":"United States","Object Shape":"Undisclosed","Sighting Duration":"00:45:00","Summary":"RED, YELLOW, AND ORANGE LIGHTS OVER BANGOR MAINE.","divs":["Sighting DetailsI was out in my front yard and I saw 5 circle UFOS on the inside of the bottom they had red, yellow, and orange lights and emitted purple beams. Then they changed into triangler UFOS with one triangler UFO red lighted with pink dots at every corner the other triangler UFO yellow lighted with pink dots at every cornet and the other UFO orange lighted with pink dots at every corner they emitted red beams then purple beams. This was at 8:45 P.M on June 7, 2005 on a Tuesday night. We were getting ready to go out to a late dinner at an ITALIAN RESTAURANT and go roller skating for a while. Be we watched these objects for a while and then they disappeard and we didn't see them at our house no more we were out in the front yard. But when we went out to dinner we saw a circle UFOS with red, yellow, and orange lights on the inside of the bottom then 3 triangler UFOS one all red lighted the other all yellow lighted and the other all orange lighted with pink dots at every corner. And they made a whistling sound they disappeard as quick as they came they left a haze and a trial in the sky. It was weird and exciting and a little scary to see these UFO. Me and my friend that was with me couldn't believe these UFOS we saw. It was a clear night outside and there was sound to these objects."],"Date of the Event":"06/07/2005 08:45 UTC","Log Number":"US-09272005-0004","files":["/var/www/straped/mufon/html2text/3908.html.txt","/var/www/straped/mufon/org/3908.html"],"Date Submitted":"06/07/2005 08:45 UTC","Viewing Distance":"Unknown","Case Number":"3908","map":"<A HREF = \"http://maps.google.com/maps?q=44.803812,+-68.768944(3908)&iwloc=A&hl=en\"> mufon case (3908) map </A>","Region":"Maine","Longitude":"-68.768944","Disposition":"IFO","Latitude":"44.803812","Object Features":"Undisclosed","Source":"MUFON","Weather Factors":"None","Object Flight Path":"Undisclosed"}