{"trends":["There have been 24 other sightings in Grand Junction","There was one other sighting in Grand Junction on or around June 7th 2012"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was out camping with my boyfriend for the first time at Carson Hole in the Uncompaghre National Forest in Colorado. We live only a half hour but decided to stay for only one night. Everything was fine during the day, there was nothing abnormal at dusk either. When night finally fell (around 9 o'clock in Colorado) we were laying in the tent without the rain fly on so we could look at the stars. The conversation was casual and suddenly we heard a pack of coyotes. They began howling not far from us and then began to scream. It was a sound that I had never heard from any animal even while hunting and spending time outdoors. It lasted approximately 30 seconds and then stopped abruptly. Moments after, we both saw a bright flash just above us as though you would see from a digital camera although it was extremely concentrated as though something had just taken off. A few minutes later the first craft was observed near the tree to the right of us. It appeared slowly and then grew brighter and dulled as it moved across the sky until it faded away after hovering. The final craft was approximately 15 minutes later and again appear right above us, lit up so that you could see the border on the ship and the 3 main lights in the center. We watched it move across the sky for approximately 10 seconds before it disappeared in the blink of an eye. This area is so secluded and at such a high altitude that there is little aircraft interference that you witness. The crafts did not blink as an airplane nor behave accordingly. We heard the coyote screams twice more in the night before fading into nothing. I am surprised there have not been more sightings. We were both completely sober and very aware of what we saw. It appears as a simple sighting but never in my life have I felt such terror in those moments that we witnessed the objects. We both wanted to leave but were honestly too afraid to leave the tent or move inside of it never the less grab and pack all of our belongings that were spread around the camp sight."],"files":["/var/www/straped/mufon/html2text/39088.html.txt","/var/www/straped/mufon/org/39088.html"],"Summary":"Rectangular, blue glowing edges with three horizontal lights in the middle","Log Number":"US-06092012-0029","map":"<A HREF = \"http://maps.google.com/maps?q=38.7317,+-108.6168(39088)&iwloc=A&hl=en\"> mufon case (39088) map </A>","Object Features":"Unknown","Region":"Colorado","Source":"MUFON","Latitude":"38.7317","Tags":"City","City":"Grand Junction","Object Flight Path":"Hovering then path","Date of the Event":"06/07/2012 10:45 UTC","Longitude":"-108.6168","Object Shape":"Flash, Sphere, Square, Rectagular, Star-like","Sighting Duration":"Undisclosed","Case Number":"39088","Disposition":"Unresolved","Country":"United States","Viewing Distance":"Over One Mile","Date Submitted":"06/09/2012 11:32 UTC"}