{"Object Shape":"Star-like","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around June 8th 2012"],"Latitude":"38.606937","divs":["Sighting DetailsI was outside with my girlfriend smoking cigarettes at the Red Lion Inn in front of our room in Sacramento and looking up at the night sky. We observed and noted the Big Dipper constellation. I then noticed a bluish light a bit larger in size than the stars making up the Big Dipper. I asked my girlfriend if she saw it and confirmed she did as well. We both observed this light move from East to West over Sacramento. It blinked on and off about every 5 seconds. There was no visible clouds at all. This ruled out the blinking of the object to be from passing behind clouds. We heard no sounds at all overhead. The object moved from just under the handle of the Big Dipper to above the star Arcturus in about 20 seconds. It then continued across the sky another 10 seconds and then changed direction in a right angle turn that appeared to head downwards as if coming to an abrupt stop and then descending. The object appeared to descend for about 5 seconds and then disappeared entirely. The time durations are based on the blinking interval that seemed to again be every 5 seconds. The object was nearly invisible to the naked eye and would only be seen every 5 seconds when it emitted a bright blink or flash that was bluish in color. It was like tracking a firefly flying across your backyard. I noted the time of the event after first seeing the object. It was a full 11 minutes before the ISS was supposed to transit the sky. I do not believe it was the space station. There were no meteor showers anticipated for the evening either. I have seen \"shooting stars\" and this did not match what I have seen during meteor showers. There were no other colored lights such as red to indicate this was a commercial or military aircraft. I may be tempted to believe this was a satellite except for the sharp stop and direction changed we observed."],"Weather Factors":"Unknown","Log Number":"US-06092012-0024","Country":"United States","Case Number":"39083","Summary":"Bluish pulsating light moving East to West over Sacramento","map":"<A HREF = \"http://maps.google.com/maps?q=38.606937,+-121.455189(39083)&iwloc=A&hl=en\"> mufon case (39083) map </A>","files":["/var/www/straped/mufon/html2text/39083.html.txt","/var/www/straped/mufon/org/39083.html"],"Viewing Distance":"Over One Mile","Disposition":"Unresolved","Tags":"City","Longitude":"-121.455189","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Date Submitted":"06/09/2012 07:48 UTC","Source":"MUFON","City":"Sacramento","Object Features":"Unknown","Region":"California","Date of the Event":"06/08/2012 03:35 UTC"}