{"Viewing Distance":"101-500 Feet","Region":"Oklahoma","Summary":"came down turned off lights hovered over water appendage touched water went back in then it left straight up","City":"Checotah","Object Flight Path":"Path then hovering","Latitude":"35.472309","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"39085","Date of the Event":"06/07/2012 12:00 UTC","Disposition":"Unresolved","Object Features":"Appendage(s)","Date Submitted":"06/09/2012 09:00 UTC","trends":["There have been 2 other sightings in Checotah","There was one other sighting in Checotah on or around June 7th 2012"],"divs":["sighting detailsi was camping and fishing at lake eufaulla when i saw lights in the sky i watched them for a few minutes as they came closer to the waters surface completely silent.. it hovered over the water and all lights went off. i could still see it clearly in the moon light triangular\\teardrop in shape ... huge at least 90 ft. wide maybe 20 tall. something cylindrical extended from beneath and touched the surface of the water it stayed that way for about 5 minutes then it went back in and the object very quickly went back up so fast the water splashed and made waves once it was up about 300 ft the lights came back on and it sped off north and up. not ten minutes later there was a large black chopper with only one small tail light circled the area then hovered in the same area for no more that 15 sec. spotlighting the water. then it too left in the same directions... i dont want people to think im nuts so i dont want to give my name. but i know what i saw.. i was pretty close and nothing that big man made can be that quiet and quick."],"Longitude":"-95.513526","Object Shape":"Teardrop, Triangle","Weather Factors":"Unknown","Log Number":"US-06092012-0026","files":["/var/www/straped/mufon/html2text/39085.html.txt","/var/www/straped/mufon/org/39085.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.472309,+-95.513526(39085)&iwloc=A&hl=en\"> mufon case (39085) map </A>"}