{"Region":"New Mexico","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Summary":"A red orb, with the intensity of those red lights you see at an airport, and as large as an aspirin, low to the horizon, stationary, and still for themmost part.","Longitude":"-105.571136","Date of the Event":"06/09/2012 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Latitude":"36.409218","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOK. This is more than a strange coincidence. you might note I have commented on two other UFO reports. In regard to tonight, I am ashamed I did not post my sighting sooner. I must tell you, now, that I saw the same red orb, from New Mexico, where I live. yes, it was in the southern or western sky. I live seventy miles north of Santa Fe. I am looking out beyond the horizon, into the sky, and I see this red star, but is it a plane? No. it does not seem to move. I see a plane to the right flying far above it to the left. I have no reason for fright, but I feel a chill. Its real! What is it. it remains still. it is an intense red object, smaller by far than our moon, but about the size you would expect from a planet. this is to me, half the size of a dime, in the sky. it is round, glowing, and stands out clearly. I have looked at this section of sky continually for three solid years from the same vantage point. This is an object which has never before appeared. i do believe there was some movement, that it may have dropped, and it may have made some chnge to the right, but unlike other objects I have seen in my life, this object did not dance, make sudden movements, or fly away rapidly. it remained. I admit a fear of it, as I sensed it knew of my presence, and more, that it had called me outside, to see it. I heard a splash of water, and thought there was a visiting dog, taking a drink from a pan of water, I left outside, earlier in the day, for another, neighbors, dog. I went outside to greet the dog. it was not there. I looked up into the low horizon, and I gasped, to see this deep red glowing orb. yes, my friend, this is not a coincidence. I was fortunate to talk with a friend a few hours ago and after. I went to their place to see if they could see it. they are a half mile away. They could not, nor I. Their place is a bit lower on the landscape, than mine. We are at or about at 7000' above sea level. it was low on the horizon as you said. My house is fairly high oa hill, so I saw it on the horizon, a few inches above the horizon. My friend and I talked about 2012. Could this be Nebiru? it is mentioned by the Mayans and is expected, and it's return is marked by a 243 year event, known as the Venis transit across the sun, and connected to the last annular eclipse. The Venis transit was June 5th. I now feel this may not have been a UFO, but a planet, if that is possible. scientist refuse now, to acknowledge the planet. Lets see who else saw this event. blessings. love and light to you. by the way, I went to HB High School, in 1977. How's that for synchronicity. now is the time, the Hopis have told us about. Blessings, one and all. The exact time of the sighting may be recorded on twitter, @queerwire. I wrote, OMG, I just saw a UFO....OMFG! Yours in truth. A reliable witness."],"City":"Taos","Date Submitted":"06/10/2012 04:41 UTC","Case Number":"39118","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.409218,+-105.571136(39118)&iwloc=A&hl=en\"> mufon case (39118) map </A>","trends":["There have been 4 other sightings in Taos","There were no other sightings in Taos on or around June 9th 2012"],"Country":"United States","Log Number":"US-06102012-0028","Object Shape":"Circle, Fireball, Star-like","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/39118.html.txt","/var/www/straped/mufon/org/39118.html"]}