{"Date of the Event":"06/09/2012 11:53 UTC","files":["/var/www/straped/mufon/html2text/39115.html.txt","/var/www/straped/mufon/org/39115.html"],"Summary":"Saw three small objects (or one large one) in tight, triangle formation, float and ascend into cloud cover","Longitude":"-117.174891","Disposition":"Unresolved","Object Features":"Unknown","Latitude":"33.123849","Country":"United States","Region":"California","Log Number":"US-06102012-0026","Tags":"City","City":"San Marcos","Date Submitted":"06/10/2012 03:39 UTC","Viewing Distance":"101-500 Feet","trends":["There have been 10 other sightings in San Marcos","There were no other sightings in San Marcos on or around June 9th 2012"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI was dropping the other witness off at her car, and looking at the sky, as I often do. We both saw something moving, but on a second glance, I noticed it was moving oddly, as described below. I thought it could have been a plane, but, when it started to move I realized it could not have been one. Planes don't move in that way. I saw three lights (red in color), which moved abnormally: They moved in such a way that it seemed to be three craft (very small), flying in a tight formation. It was coordinated, and they seemed to fly away at a speed similar to an airplane, but it was ascending at too strange of angle to be a plane. The three objects, at first, appeared to be flat, relative to where I was standing (they appeared to be taking off from San Elijo mountain). The one towards the right then moved upward and the craft (or crafts) moved at an 80-something degree angle (where 90 would be straight up), and disappeared into cloud cover. The event was over in 2 or 3 minutes, tops, and besides myself, and another witness, no one else in the area seems to have seen the craft. I will also add that on the mountain behind California State University, San Marcos, there was a shaft of light, which was shining in the sky. If you were across the street from the school, like I was, in the parking lot, and facing that light, the craft would be at 4 o' clock (if the light was 12). If you were facing the school it would be 3 o'clock, as the school was at an angle ( I was in the parking lot of Ralph's, in the middle of the lot.) The lights faded, and finally disappeared (though it probably just became obscured in cloud cover). The lights were non-pulsating, or pulsing; they were simply brightly lit, and continued to stay lit. I was amazed, and felt inspired after I saw it. I drove relentlessly after I bade goodbye to the other witness, hoping to see it when I got to the top of San Elijo. Unfortunately, the cloud cover was too great and I could see nothing. I even stopped the car, and got out, but nothing. Radios were working perfectly (actually strangely better than normal, as I usually have issues going up the San Elijo hill, coming from Cal State San Marcos, but I had no static)."],"Object Shape":"Triangle","Object Flight Path":"Hovering then path","Case Number":"39115","map":"<A HREF = \"http://maps.google.com/maps?q=33.123849,+-117.174891(39115)&iwloc=A&hl=en\"> mufon case (39115) map </A>"}