{"Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-06102012-0014","Disposition":"Unresolved","Latitude":"43.134711","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","City":"Boscobel","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Boscobel","There were no other sightings in Boscobel on or around June 9th 2012"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=43.134711,+-90.697763(39124)&iwloc=A&hl=en\"> mufon case (39124) map </A>","Case Number":"39124","Longitude":"-90.697763","Tags":"City","divs":["Sighting Detailslast night about 10:15 I was letting the dogs in from outside when I noticed two bright amber lights going south to north. I was watching them and they didn't blink and were moving quite fast. All of a sudden one faded out as if shutting a light off. I came in and went out on the deck in front and there came another one. I yelled for the wife to come see the UFO and she came out and saw it too. Soon yet another one came and they all seemed to follow the same flight pattern and they made no noise whatsoever. I went in and grabbed the camera and went out to the back yard and waited. Nothing came for quite awhile. She went back in because the mosquitoes were bad so I went to the front deck. Having my camera set on video mode and waiting. Then two more came and I headed to the back yard away from the big tree in front. When I got to the back the second light was gone, but I captured the one on video. It was a very bright amber light, not blinking. When I played back the video it shows the light, but it's flashing green and blue as well. The UFO was flying in a straight path but the video shows it jumping around. That is me trying to keep it in the viewfinder."],"files":["/var/www/straped/mufon/html2text/39124.html.txt","/var/www/straped/mufon/org/39124.html"],"Date of the Event":"06/09/2012 10:15 UTC","Summary":"very bright amber globe","Object Features":"None","Date Submitted":"06/10/2012 08:54 UTC","Region":"Wisconsin"}