{"files":["/var/www/straped/mufon/html2text/39123.html.txt","/var/www/straped/mufon/org/39123.html"],"divs":["sighting detailsyup. this one's a weird one. i was lying in bed, my b\\f was moaning... he for some reason, he moaned \"no\" more than once, sounded like he was having a bad dream. i put my hand out, and felt in the palm of my hand a somewhat cube shaped object with a rounded corner. it was plexiglass\\ acrylic feeling. felt about an inch\\ inch and a half square. nothing else was felt, just smooth plastic. room temp, no other sensations. got out \"what the hell is *this*?\" and then \"fell asleep\" immediately. not my usual way of dealing with stuff. by all rights, i should have been able to have object in hand, tap my b\\f on whatever side i could find and ask him \"what is this thing, and where did you find it?\" and about the bad dreams. we searched the bed this morning...around the bed, under it, pillows, blankets. we do not even own anything that fits the description of the object (tho as an aside, we found one of the spice bottles- ground mustard- in a pair of leather riding shoes.... in an obvious statement, all spices reside n the cabinets. how it got there, in the bedroom....) my b\\f was seeing small red dots like laser pointer dots friday. i am not sure if this is in connection with last night's mystery cube or not- we have both seen ufos, aliens, etc."],"Summary":"Found alien object in bed.....","Country":"United States","Weather Factors":"Unknown","Date of the Event":"06/10/2012 12:00 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","Log Number":"US-06102012-0013","Viewing Distance":"Unknown","City":"Winter Park","trends":["There have been 10 other sightings in Winter Park","There were no other sightings in Winter Park on or around June 10th 2012"],"Object Shape":"Unknown","Region":"Florida","Tags":"City","Date Submitted":"06/10/2012 08:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.607182,+-81.294633(39123)&iwloc=A&hl=en\"> mufon case (39123) map </A>","Case Number":"39123","Object Features":"Undisclosed","Latitude":"28.607182","Longitude":"-81.294633"}