{"Source":"MUFON","Date of the Event":"06/09/2012 11:00 UTC","Sighting Duration":"00:05:00","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around June 9th 2012"],"files":["/var/www/straped/mufon/html2text/39128.html.txt","/var/www/straped/mufon/org/39128.html"],"Log Number":"US-06102012-0019","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"35.202596","Tags":"City","Case Number":"39128","City":"Charlotte","map":"<A HREF = \"http://maps.google.com/maps?q=35.202596,+-80.772985(39128)&iwloc=A&hl=en\"> mufon case (39128) map </A>","Longitude":"-80.772985","Region":"North Carolina","Country":"United States","Disposition":"Unresolved","divs":["Sighting Details My wife, myself, our 8 year old daughter, my visiting brother, and his wife, all were witnesses to the following event. We were sitting on the back patio chatting about 11:00 . My brothers wife first noticed circular, brightly glowing orange lights appearing over a stand of trees at our left (SE?). She pointed them out to us and we watched them move across the horizon almost overhead (toward NE?). They flew in tight formation, but there seemed to be some slight fluctuation in their closeness to each other. THey were glowing bright orange, and were about the size of an aspirin in the sky. Amazingly, they were followed by another couple of single lights flying in the same path, and then another group of three. Then followed another 2 or 3. Some of the objects dimmed their lights when they got close to overhead, but could still be observed flying across the sky. They were absolutely silent, and seemed to be flying at a speed somewhat faster than an airplane. Our house is under an airport flight path, and we often see airplanes cross over. When we see planes, though, they're closer to the ground, either gaining or losing altitude, make noise, and they're landing lights blink in a regular pattern. Their flight path is also different directionally. I am 56 years old, and have never seen lights like this in the sky. My brother observed what he though were a couple of other objects moving extremely fast across our field of vision, but much dimmer. He has a short video of part of the event captured on his cellphone. We talked about this experience for some time afterward. AMAZING!"],"Object Flight Path":"Straight-line path,Path with directional change","Summary":"Series of glowing orange circular shapes flying in triangular formation and singly.","Object Features":"Unknown","Object Shape":"Circle","Date Submitted":"06/10/2012 03:08 UTC"}