{"Source":"MUFON","Region":"Wisconsin","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.79244,+-88.778958(39136)&iwloc=A&hl=en\"> mufon case (39136) map </A>","Longitude":"-88.778958","Latitude":"43.79244","Object Shape":"Circle, Other","trends":[],"Sighting Duration":"Undisclosed","Date of the Event":"06/09/2012 12:00 UTC","Log Number":"US-06102012-0027","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/39136.html.txt","/var/www/straped/mufon/org/39136.html"],"Date Submitted":"06/10/2012 06:21 UTC","Summary":"Unusual lights seen in an area where we have been searching for a bigfoot","City":"Undisclosed","Object Flight Path":"Hovering then path","divs":["Sighting Details I was standing next to my friend who was standing in a 10 ft clearing in woods when she was personally buzzed by this unseen object. Then the Sat night before Easter, we decided to sit in my truck and watch at night. We 1st saw orbs in the woods and then a white light flew in and stopped at the front corner of the woods no higher than the trees and hovered there silently for over 45 mins. The object was across the cornfield from us which is no more than a short block. The object would get brighter sometimes, it would change from a PacMan shape (or bell shape) to round, sometimes fade out to a cigarette shape and disappear and then come back on bright as ever. We forgot our binoculars but we could see that sometimes there was a red light at the bottom and sometimes the object was a white circle with a red ring around it. It made no noise whatsoever and hovered there until it traveled back over a duck pond area and then over a marsh area when we lost sight of it. Altogether we saw it that Sat for an hour probably. The weirder thing though, is that we go back every Sat nite and between 8 & 10pm, the object shows up but it has been farther away over the duck pond and marsh areas. On these other occasions, we have seen in our binoculars that the object has red lights sometimes, sometimes it is circled in red, sometimes we see green lights, or blue lights, sometimes a 2 part object connected, one time hazy search lights or something that shines to the area below it and then in front of it and then above it. But it always hovers in an area and then moves and hovers over another area for a long time. Last night it seemed farther away and we got bored watching it for over a half hour so we thought maybe we could find it and get closer. Everytime we do that though, we either can't find it at all or like last night we lost sight of it on the winding country roads or it moved off. We watched that object last night for over 2 hours. The reason we are contacting you is we would like someone else to take a look at this object who has knowledge of UFO's and tell us what you think and also because maybe you can give us some clues on how to track it better to get a closer look. The first time we saw it, we were too scared to even move! Now, we want to get a better look."],"Tags":"City","Case Number":"39136","Viewing Distance":"Unknown"}