{"Longitude":"-122.684492","Date of the Event":"06/09/2012 09:55 UTC","Weather Factors":"Unknown","City":"Portland","Object Flight Path":"Straight-line path","Summary":"Unwavering bright white light w/o blinking or red&blue lights, no sound, traveling N/NE, straight line, seemed just a bit higher, but biggeer, than small plane circling area, no sound like the other plane came with","files":["/var/www/straped/mufon/html2text/39135.html.txt","/var/www/straped/mufon/org/39135.html"],"Object Features":"Unknown","Source":"MUFON","Tags":"City","Region":"Oregon","Latitude":"45.532175","Log Number":"US-06102012-0026","Country":"United States","Case Number":"39135","Date Submitted":"06/10/2012 05:49 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.532175,+-122.684492(39135)&iwloc=A&hl=en\"> mufon case (39135) map </A>","divs":["sighting detailsjune 9th, 2012, 9:55pm at 13th and overton, pdx 97209, i was waking home with my girlfriend from safeway grocery store. i looked up and saw a bright white light i at first thought was a planet because it was so large, then i noticed it was moving. it traveled somewhat slowly in comparison to and relatively at the same height as small\\medium size planes appear to travel. its flight seemed too perfectly steady to me, but the key factors by which i deemed it ufo were that the white light of it, as bright as the forward facing headlight of a 747 remained brilliantly white even as it flew directly overhead and off into the distance. also there was not one blinking light, nor any red or blue lights to indicate it as a standard aircraft as i know them. it did have a dim aura, seemingly yellow\\brownish, faint, i couldn't tell if it was or not, though probably was haziness in the sky,(no actual clouds). there was no sound, propeller or jet, emanating from it. i realized this when i soon saw and heard a small propeller plane circling the area, (mile radius?)this plane had a blinking white light, dim and weak in comparison, one red and one blue light. i could also see some dim light reflecting off the bottom of its wings. the distinguishing characteristics between the two were dissimilar. i recognize the likeness of it to regular craft, but this was not normal."],"Object Shape":"Sphere, Star-like","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around June 9th 2012"]}