{"Region":"Minnesota","Object Shape":"Circle, Cylinder, Flash, Sphere, Star-like","trends":["There has been one other sighting in Bovey","There were no other sightings in Bovey on or around June 9th 2012"],"Country":"United States","Case Number":"39130","Latitude":"47.288765","Longitude":"-93.311325","Object Features":"Unknown","Summary":"bright blueish light hovering and changing direction rapidly. disapeared suddenly.","map":"<A HREF = \"http://maps.google.com/maps?q=47.288765,+-93.311325(39130)&iwloc=A&hl=en\"> mufon case (39130) map </A>","divs":["Sighting DetailsMe and a friend were driving home at about 11 pm. I looked up at what i thought was a plane but realized it was making no sounds and was moving extremely slow and had no blinking lights indicative to aircraft. It started making spiratic direction changes. Then slowly went off into the horizon and disapeared. Over the last six months I have witnessed this UFO several times with 4 different witnesses all were clueless to what it was. Have seen this object hover at low altitudes and seemingly disapear into thin air on two of these sightings I have attempted to film the object with my hd camera on my phone both times my camera app had green lines running verticly down the screen and I could not film. This issue has only happened when the object is near. All of my sighting have been between 9 pm and 12 pm generally on Saturday and Sundays. I have five other witnesses who would also say they have seen the object including a very close frightening encounter where the object hovered over me and a friend at low altitude. I never felt threatened by the object and have since started scanning the skies for it rather frequently and have seen it on numerous occasions."],"Source":"MUFON","Log Number":"US-06102012-0021","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"06/10/2012 04:29 UTC","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/39130.html.txt","/var/www/straped/mufon/org/39130.html"],"Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change,Other","Date of the Event":"06/09/2012 12:00 UTC","City":"Bovey","Weather Factors":"Unknown"}