{"Longitude":"-81.045883","Region":"North Carolina","Disposition":"Unresolved","Summary":"Glowing orange object appeared above the treeline. Within seconds, two other objects came into view flying side by side.","files":["/var/www/straped/mufon/html2text/39131.html.txt","/var/www/straped/mufon/org/39131.html"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Date Submitted":"06/10/2012 04:53 UTC","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Belmont","There were no other sightings in Belmont on or around June 9th 2012"],"Date of the Event":"06/09/2012 09:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.174486,+-81.045883(39131)&iwloc=A&hl=en\"> mufon case (39131) map </A>","Log Number":"US-06102012-0022","Object Features":"None","City":"Belmont","Object Shape":"Circle","Country":"United States","Case Number":"39131","divs":["Sighting DetailsI went on the MUFON-NC website Saturday afternoon and read about recent sightings in NC. Being familiar with Belmont, I was intrigued by a recent report. So, I invited a friend, Nancy Queen, to go to a boat docking area Saturday night and stake out the area. This location is about a mile south of the Allen Stream Plant in Belmont, NC. We arrived at the site about 7:30pm and took a few pictures. When it started getting dark, I mounted my camera on a tripod and waited to see if anything got our attention. As we stood on the cement slab attached to the boat docking area, I caught sight of a flying object coming towards us. The object was glowing orange. I called out to Nancy as two more aircraft came over the treeline orange lights aglow. The first aircraft stayed in front of the other two aircraft which were flying side by side quite close to each other. As my camera was pointing in their direction, I started snapping pictures. Although the aircraft seemed to be moving much slower than the jets we had seen earlier in the evening, I had no idea it took two minutes for them to pass over our heads, heading south to north toward the Allen Stream Plant. (Please note that the first picture was taken at 9:25pm and the last picture at 9:27pm.) The reason I am accurate about the directions is because I took my compass with me and had already checked to ascertain north and south. My camera was attached to a tripod and there was no movement on my part. There was no noise as the aircraft flew by us. Amazingly, there were several boats being placed on their trailers during this time frame but nobody but Nancy and I noticed the aircraft. And, we were making quite a todo about them. What struck me about the three flying objects was the single orange glow each projected. I couldn't make out any features on the aircraft as the light was blinding. Nancy managed to get some pictures with her camera as well as me."],"Weather Factors":"Unknown","Latitude":"35.174486"}