{"Viewing Distance":"101-500 Feet","Latitude":"37.628155","Date of the Event":"01/13/2011 12:00 UTC","Region":"Kentucky","Object Shape":"Triangle","Log Number":"US-06102012-0038","Disposition":"Unresolved","divs":["sighting detailsmy wife and i were driving home from lexington, ky to somerset, ky via kentucky highway 27 on january 13th,2011 at 12am. i saw a red light to the east and dismissed it as a helicopter. i work in aviation and know this is a typical route for med evac choppers heading northward to uk. we continued southward and noticed the light getting closer, but, still payed no mind. a while later a truck caught up to us and followed closely for a few minutes. after a while it passed us in a big hurry. this caused us to look around to see what was going on and a business jet sized aircraft (100ft x 100ft x 100ft)was heading towards us very slowly moving westward roughly 50ft above the ground. it was black and had a pyramid shape, was not square, but triangular on the bottom. i'm not sure if it was fear or not but we slowed down to nearly a stop so it would pass ahead. the craft than averted it's course and stayed true towards our vehicle. once the ship was directly above us we could see a glowing red \\ yellow orb in the center as well as slightly smaller red lights on the 3 pointed edges. it also had small blue and white rectangular lights that flashed in a pattern once it was directly over us (almost like it was scanning our vehicle) my wife attempted to video the ordeal with her phone, but, was unable to get it to work. luckily we were in our 92 honda accord which has an engine that is not as computer based as a newer vehicle. i firmly believe it would have stalled the car. the ship never made a sound while hovering directly above us (approx. 15 mins) it then slowly moved to the southwest and took about 15 mins to appear to be the size it was when we first saw it. it than right angled northward towards the stars. the event lasted nearly 30 minutes and spanned from nicholasville to lancaster. we phoned some friends who traveled ahead in another vehicle to see if they saw it as well. they did not see it since there was an hour of time in between our departures. we didn't get home until around 3am which was an hour later than we should have, even with our slowed trip. we are still unsure about that."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.628155,+-84.571496(39147)&iwloc=A&hl=en\"> mufon case (39147) map </A>","Date Submitted":"06/10/2012 08:56 UTC","Sighting Duration":"Undisclosed","Case Number":"39147","City":"Lancaster","Country":"United States","trends":["There have been 5 other sightings in Lancaster","There were no other sightings in Lancaster on or around January 13th 2011"],"Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/39147.html.txt","/var/www/straped/mufon/org/39147.html"],"Object Features":"None","Longitude":"-84.571496","Object Flight Path":"Hovering then path,Path then hovering","Tags":"City","Summary":"Triangular / Pyramid UFO passed over and \" scanned \" vehicle. Event lasted 30 min."}