{"Disposition":"Unresolved","Latitude":"38.417592","Date of the Event":"06/03/2012 11:05 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.417592,+-85.363573(39145)&iwloc=A&hl=en\"> mufon case (39145) map </A>","City":"La Grange","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Log Number":"US-06102012-0036","Summary":"Dark circular object with multiple lights (same color) and no noise.","Weather Factors":"Unknown","divs":["sighting detailsobserved dark circular object with five other winesses. time was approximately 2305 on june 3, 2012. clear night with moon visible and a few high cirrus clouds. we had just left our next door neighbors house and were on our front sidewalk. my friend first noticed the object and drew our attention to it. object was traveling slowly from nnw to sse at 3000-4000 feet altitude. object appeared solid with unusual lighting configuration. had one large steady yellow\\orange light to the left of centerline about halfway between front and rear of object. had three smaller lights (all in a row and same color as the large light) to the right of centerline oriented left to right. also had 7 small lights (same color as others) evenly spaced on the forward edge of the object. object made no discernible noise as it passed over us. just before traveling out of sight the lights flickered two or three times before going out completely. once the lights went out we lost sight of the object. total observation time was approximately 3-5 minutes. object shape did not appear to be a perfect circle but seemed to be slightly flattened on the leading and trailing edges. both my friend and i have a combined 50 years of aviation experience. we were both flight engineers in the military, and i currently work as an instructor for an airline. neither one of us knew quite what to make of the object. at first i thougt it might have been a gag (someone rigging up some lights on a light aircraft)but the object appeared to be traveling too slowly for a light aircraft, and the absence of any engine\\prop\\rotor noise was inconsistent with it being a helicopter or autogyro either. we didn't feel afraid or otherwise concerned about the object. all of us were primarily occupied with just trying to figure out what it could be. after it disappeared we talked about it for a few minutes and then went to bed."],"Country":"United States","Longitude":"-85.363573","Sighting Duration":"00:03:00","Object Shape":"Disc","Object Flight Path":"Straight-line path","Date Submitted":"06/10/2012 08:50 UTC","Region":"Kentucky","Case Number":"39145","files":["/var/www/straped/mufon/html2text/39145.html.txt","/var/www/straped/mufon/org/39145.html"],"trends":["There have been 3 other sightings in La Grange","There were 2 other sightings in La Grange on or around June 3rd 2012"],"Object Features":"None"}