{"divs":["Sighting DetailsWhile relaxing on a neighbors porch in May I noticed three red blinking lights ascending closely in the sky. It was like a maneuver from an air show but there was not sound and they weren't in any obvious formation but they were extremely close. As I stood up to get a better view I noticed three more similar lights ascending, and still no sound. The lights seemed to meet at a certain point then five lights traveled northwest in a straight path and one continued east without an addition ascent. It flew in front of me above house level on the next level of houses above my own and then disappeared while traveling east. Right after it happened I though that I must have seen helicopters or small plains but there was no noise, there were too many and they were too close to not hear any noise at all. I am extremely close to the mountain and every sound echoes, if there was a sound I would have heard it. My neighbor and I were so happy that we saw it together and we quickly begun to research other similar sightings. Another explanation for what I saw that I found while researching was that I may have saw chinese lanterns. I didn't dismiss this right away but after looking at all the youtube video I could find on chinese lanterns I have come the conclusion that it was neither that object. First of all the object moved too quickly and in a straight line at the same latitude. Chinese lanterns ascend...consistently slowly. Another thing was if it were a lantern and being pushed by wind why did five change direction while one continued in a straight path."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.135174,+-117.205261(39149)&iwloc=A&hl=en\"> mufon case (39149) map </A>","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","Date Submitted":"06/10/2012 11:14 UTC","City":"Highland","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-117.205261","Object Features":"None","Log Number":"US-06102012-0035","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Object Shape":"Sphere","Country":"United States","Region":"California","files":["/var/www/straped/mufon/html2text/39149.html.txt","/var/www/straped/mufon/org/39149.html"],"trends":["There have been 15 other sightings in Highland","There were 6 other sightings in Highland on or around May 27th 2012"],"Summary":"red round blinking lights, no sound, going about as fast as a fast moving helicopter","Case Number":"39149","Date of the Event":"05/27/2012 12:00 UTC","Latitude":"34.135174"}