{"Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.576702,+-92.173516(3914)&iwloc=A&hl=en\"> mufon case (3914) map </A>","Tags":"City","divs":["Sighting DetailsI had walked outside of my girlfriends house to smoke a cig, which i do at least once a night, I was looking around in the sky,it was very clear,and not to bright out, when i noticed 4 stars forming a diamond in the heavens, i thought it was odd that the stars were spaced evenly,and that they all were the same brightness and size,no big deal, i turned to look towards the south,still looking in the sky,few planes blinking by pretty far out from me, i turned back to the north east in no less the ten seconds, and i was stunned, my diamond shape made of stars had two bright lights ,in the very middle of it, i thought,where in the hell did they come from, i knew they werent there when i was admiring the diamond seconds earlier, i questions my sanity haha,but i knew there was no way i would of missed these bright white lights, then the hair on my neck stood up,they started moving from the center of the diamond,to the left very slow then quickly moved away or up from me,all the time the lights got brighter, the two lights didnt look to be connected,but moved at the exact same time and distance, then with a bright flash or (ten times the brightness the light had been,made me see dots, the two lights seemed to speed off so fast(in the blink of an eye would be a slow comparason) i only saw two streaks,and these were short streaks. i do believe i have seen something from not this world,i dont think we are safe-meaning mankind. ty james wewerka"],"Object Shape":"Undisclosed","Date of the Event":"09/27/2005 08:30 UTC","Object Flight Path":"Undisclosed","Disposition":"Unknown","Object Features":"Undisclosed","Country":"United States","Case Number":"3914","Summary":"I am positive i have witnessed something that most people would kill to see, i call it being in the right place at the right time,scared the hell out of me! no joke","Date Submitted":"09/27/2005 08:30 UTC","files":["/var/www/straped/mufon/html2text/3914.html.txt","/var/www/straped/mufon/org/3914.html"],"Log Number":"US-09282005-0006","Longitude":"-92.173516","Region":"Missouri","City":"Jefferson City","Weather Factors":"Unknown","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Jefferson City","There were no other sightings in Jefferson City on or around September 27th 2005"],"Latitude":"38.576702"}