{"trends":["There have been 6 other sightings in Alamosa","There was one other sighting in Alamosa on or around June 10th 2012"],"City":"Alamosa","Source":"MUFON","Region":"Colorado","files":["/var/www/straped/mufon/html2text/39159.html.txt","/var/www/straped/mufon/org/39159.html"],"Object Flight Path":"Path with directional change","Longitude":"-105.860491","divs":["Sighting DetailsApproximately 10:55 pm, I had gone outside because our driveway alarm had sounded. As I was looking for the cause, my gaze went immediately to some solidly bright, circular lights moving in an ascending SW direction from very low directly east of me. Initially there was a group of three , then three more, then two, and two. The last one moved far more slowly and more vertically. There was virtually no sound. The orbs seemed to pulsate red and yellow, but mostly yellow and were distinctly constant bright. They did not flash or have any strobe effect. The distance between the lights varied, and they did not follow any formation pattern, each going in a slightly different direction. They moved at a rate I would expect of a helicopter, but the rate of ascension and distance covered seemed out of helicopter capability at this altitude. As bright as the lights were, I expected to see them for some time as they left this large valley, but they disappeared relatively quickly from sight. I would estimate they covered a distance of 50-60 miles in about 5 minutes relative to the ground. Both my wife and I saw them. I took pictures with my cell phone, but don't know if they will show anything since I was shooting into a night sky. I did make sure I got some ground yard night lites for comparison. The closest description I can give of the sight was it looked like a giant version of the firework type that is a cardboard tube held in the hand that shot out a colored ball sporadically I think was called a \"cannon ball\"? It was a completely cloudless, clear night."],"Log Number":"US-06112012-0003","Latitude":"37.473469","Summary":"String of 10 red/yellow circular lights moving sw appearing to originate low to ground and rose slowly. distance between lights irregular and irregular travel path","map":"<A HREF = \"http://maps.google.com/maps?q=37.473469,+-105.860491(39159)&iwloc=A&hl=en\"> mufon case (39159) map </A>","Date of the Event":"06/10/2012 10:55 UTC","Object Shape":"Circle, Fireball","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Country":"United States","Date Submitted":"06/11/2012 01:50 UTC","Disposition":"Unresolved","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"39159"}