{"Longitude":"-121.888036","Object Shape":"Cylinder","Date of the Event":"06/10/2012 09:54 UTC","trends":["There have been 18 other sightings in Monterey","There were no other sightings in Monterey on or around June 10th 2012"],"Country":"United States","Case Number":"39161","files":["/var/www/straped/mufon/html2text/39161.html.txt","/var/www/straped/mufon/org/39161.html"],"Weather Factors":"Unknown","Date Submitted":"06/11/2012 05:50 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.607968,+-121.888036(39161)&iwloc=A&hl=en\"> mufon case (39161) map </A>","Log Number":"US-06112012-0005","divs":["sighting detailsmyself, my wife and a friend visiting from out of town were sitting in our back yard having a cigarette. my wife noticed on the eastern horizon a cylinder shaped glowing light approaching us and said look what is that?, we looked up and saw the craft approaching, it looked like a large flying wing as its span was pointing north to south as it was flying east to west. the underside was illuminated with a soft glowing bluish\\white light all the way around the cylinder shape. as it crossed the entire sky we could definitely discern the dark gray cylinder shape as it was slightly illuminated by the undercarriage lights, then as it got directly over us it shifted on its axis in a clockwise direction from 45 degrees to 90 degrees, going from a flying wing type of thing to a flying torpedo or cigar shape would be the best way to describe it, it continued to the west and out over the ocean and disappeared over the horizon. all of our feelings were that this was like no other craft we have ever seen, and moved in a way that we all know is not physically possibly by our current aviation technology. we tried to get photos on our cell phones, my wife may have some, mine didnt turn out as it was moving pretty quickly, once we can d\\l hers onto the computer i can forward them. but this was definately a sighting witnessed by 3 of us at one time"],"City":"Monterey","Object Features":"Undisclosed","Latitude":"36.607968","Viewing Distance":"Unknown","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Summary":"Cylinder shape UFO traveling east to west that shifted its axis from 45 degrees to 90 degrees during flight","Sighting Duration":"Undisclosed"}