{"Weather Factors":"Unknown","Longitude":"-91.953786","files":["/var/www/straped/mufon/html2text/3918.html.txt","/var/www/straped/mufon/org/3918.html"],"Country":"United States","Case Number":"3918","divs":["Sighting Detailsi COME FROM A VERY LARGE FAMILY, AT THAT TIME THERE WERE AT LEAST 8 OF US SLEEPING UPSTAIRS, GIRLS SHARING 2 BEDROOMS AND 2 BROTHERS IN ONE BEDROOM, MOM AND DAD DOWNSTAIRS.I WAS A TEEN AT THE TIME, 13, MAYBE 14YRS. OLD. I'M NOT REAL SURE ON THE YEAR IT HAPPENED, I'M GUESSING AROUND 1967-68. ALL I REMEMBER IS ME AND ONE OF MY SISTERS WHO IS 2 YEARS OLDER THEN ME LOOKING OUT OUR WINDOW FROM OUR BEDROOM AND STARING AT THIS SAUCER SHAPED UFO HOVERING OVER THE TREES IN OUR FRONT YARD.DON'T REALLY REMEMBER WHY WE WOKE UP AND NO-ONE ELSE DID, EVERYONE ELSE WAS ASLEEP. I REMEMBER BEING SO AMAZED AT THE BEAUTIFUL LIGHTS ROTATING AROUND THE BOTTOM RIM OF THE SAUCER. THEY WERE MOVING IN A CLOCKWISE ROTATION RED, AND THEN TURN GREEN IN A COUNTERCLOCKWISE, AND THEN YELLOW. I REMEMBER THERE WERE LITTLE WINDOWS, I'M THINKING MAYBE THREE, FROM MY VIEW, THAT I KEPT TRYING TO SEE IN, JUST KIND OF A WARM YELLOW GLOW, I'M TRYING SO HARD TO SEE SOMETHING INSIDE. REMEMBER,WE ARE LOOKING OUT FROM THE UPSTAIRS WINDOW, AND ITS LESS THEN 30 TO 40 YARDS AWAY, ALMOST EYE LEVEL ITS SO LOW. NO SOUND AT ALL THAT I CAN RECALL, I CAN'T KEEP MY EYES OFF OF IT. IT MOVED A LITTLE OUT OF OUR VIEW SO THAT WE HAD TO RUN TO ANOTHER BEDROOM TO WATCH IT, WAKING UP A YOUNGER SIBLING WHO GOT SO SCARED WHEN SHE ASKED US WHAT WE WERE DOING, AND WE REPLIED, WATCHING A FLYING SAUCER, SHE GOT UP TO LOOK OUT AND IT SHOT IN THE AIR SO FAST BY THE TIME SHE GOT TO THE WINDOW SHE COULD BARELY SEE IT. WHAT PUZZLES US TO THIS DAY ALMOST 40 YEARS LATER IS WHY WE DIDN'T SCREAM THE HOUSE DOWN, OR RUN DOWNSTAIRS TO WAKE UP OUR PARENTS. WE JUST SIMPLY WENT BACK TO BED AND WENT RIGHT TO SLEEP. WE DIDN'T TALK ABOUT IT TO EACH OTHER FOR YEARS. I THINK THIS BOTHERS ME THE MOST, YOU WOULD THINK WE WOULD HAVE STAYED UP ALL NIGHT TALKING ABOUT WHAT WE HAD SEEN. WE CASUALLY MENTIONED IT TO OUR MOTHER WHEN WE WERE ADULTS, AND SHE SAID SHE HAD SEEN LIGHTS OUT BY THE BARNLOT SEVERAL TIMES BEFORE THEY MOVED IN 1969 WHEN MY BROTHER HAD BEEN KILLED IN VIETNAM. THROUGH THE YEARS I HAVE SEEN OTHER UNEXPLAINED THINGS IN THE SKY, BUT NOTHING COMPARED TO THAT NIGHT. I WILL NEVER FORGET IT!!"],"Disposition":"Unknown","Region":"Iowa","Object Shape":"Cylinder, Disc","Viewing Distance":"20 Feet or Less, 21-100 Feet, Unknown","Log Number":"US-09292005-0002","Tags":"City","Object Features":"Undisclosed","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path","Date Submitted":"10/15/1967 10:35 UTC","Date of the Event":"10/15/1967 10:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.363902,+-91.953786(3918)&iwloc=A&hl=en\"> mufon case (3918) map </A>","trends":["There have been no other sightings in Keota","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","City":"Keota","Latitude":"41.363902","Summary":"WOKE UP AND LOOKED OUT THE WINDOW AND IT WAS ABOVE THE EVERGREEN TREES IN OUR YARD."}