{"Viewing Distance":"Over One Mile","Sighting Duration":"00:00:15","Object Shape":"Unknown","trends":["There have been 3 other sightings in Bellefonte","There were no other sightings in Bellefonte on or around September 29th 2005"],"Case Number":"3924","Country":"United States","Date of the Event":"09/29/2005 07:25 UTC","Summary":"One red light followed by one white light at high speed.","Disposition":"Insufficient Data","Tags":"City","Weather Factors":"None","divs":["Sighting DetailsI was at my daughter's cheerleading practice which had ended around 7:20pm. Several of the parents and I were standing outside of the school discussing upcoming sports events while the girls played in a nearby playground. During our conversation one of the mothers stopped speaking mid-sentence, pointing upwards behind me. I turned around immediately and saw two lights, one red, the other white, clearly visible in the sky east of me. These lights appeared to be at least a mile away and at a fairly low altitude (to be an aircraft). The lights seemed to be traveling at high speed, heading from south to north and remained visible to me for at least 5 seconds before they 'vanished'. The sky was rather clear, with very few scattered clouds. The lights didn't go behind a cloud or other obstruction from my vantage point. There is an airport not far away but I've lived here my whole life and I'm used to seeing aircraft approaching and leaving and these lights were not in an area nor heading, nor speed, nor altitude consistent with this. The other odd thing about the lights was that they appeared to blink, not like aircraft strobe lights which flash. I could see the lights clearly, enough to distinguish their color, but I could not discern an object between them, probably due to the low light at the time.I'm sure the sun had already set by this time so I doubt this was a trick of light on a cloud. I've also seen military aircraft over the years fly over this area at a similar altitude and speed but these were always clearly heard. So far as I know noone there heard any sound from the object. At first I thought the object to by a low flying jet, but the lack of engine noise at what appeared to be such a close distance makes me think otherwise. In all likelihood it was an aircraft;but, the speed, odd blinking of the lights and abrupt way in which the object disappeared from sight leaves me baffled. I continued to observe the the sky for several minutes, thinking the object may have turned, causing me to lose sight of the lights, but I saw nothing else. I hope I haven't wasted your time and that maybe this report might help in some way. thank you."],"Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/3924.html.txt","/var/www/straped/mufon/org/3924.html"],"Latitude":"40.913394","Object Flight Path":"Straight-line path","Object Features":"Unknown","Log Number":"US-10012005-0002","Source":"MUFON","Longitude":"-77.778335","Date Submitted":"09/29/2005 07:25 UTC","City":"Bellefonte","map":"<A HREF = \"http://maps.google.com/maps?q=40.913394,+-77.778335(3924)&iwloc=A&hl=en\"> mufon case (3924) map </A>"}