{"Longitude":"-86.351316","Region":"Indiana","Disposition":"Unresolved","Case Number":"39274","Summary":"solid glowing light traveling med. rate of speed SW-NE; 4 other higher lights traveling different directions; one changed direction & brightened","Date Submitted":"06/11/2012 07:15 UTC","Weather Factors":"Unknown","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around June 6th 2012"],"Viewing Distance":"Unknown","Country":"United States","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/39274.html.txt","/var/www/straped/mufon/org/39274.html"],"divs":["Sighting DetailsI was looking for more info. on UFO sightings Wed., June 6, 2012 around 10:45 p.m. in northcentral Indiana. I was outside and saw a large white ball of light, traveling from southwest to northeast, low in the sky(lower than a jet). It was a steady light, not blinking, without a trail of light behind it. There was no sound. I watched it travel at a steady speed. That same evening, within about 30 min. we saw several smaller, higher objects traveling from east to west(2), north to south (1), south to north(1) and east to west(1). The one traveling east to west appeared to dim, then go back to the normal light. These were as high as I think I have seen satellites orbiting( maybe these were satellites, but it seemed a lot within the 30 min.) I saw 2 of the higher ones, last night, north to south and south to north about the same time period. I was in front of my house and at first thought the large object was a headlight of a plane, but there was no blinking lights or sound. I lost sight of the object as it continued NE."],"Latitude":"40.760944","map":"<A HREF = \"http://maps.google.com/maps?q=40.760944,+-86.351316(39274)&iwloc=A&hl=en\"> mufon case (39274) map </A>","Tags":"City","City":"Logansport","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Log Number":"US-06112012-0018","Sighting Duration":"Undisclosed","Date of the Event":"06/06/2012 10:45 UTC","Object Features":"Unknown"}