{"Region":"Illinois","Source":"MUFON","divs":["sighting detailsi was watching television from my couch and decided to make sure all of the doors were locked prior to going to bed. as i stood up i looked at the time on the cable box. it was 11:20 pm. i went downstairs to the den\\office to close the patio door that face east. when i got to the door i noticed two objects flying\\floating through the air, in tandem, to the east ( rear ) of my house. as far as i could tell both objects were circular, ( the one in the rear may have been somewhat oval in shape but both were about the same size. the one that was in front was glowing white, the one that was following was slightly elevated above the front and was glowing orange. there was no sound from either object. at the same time at a greater distance i could see an airplane flying off in the same direction. ( i live about 40 mins. northwest of ohare and see airplanes all of the time either transiting in or out.) at first i thought these objects must be airplanes or helicopters but as they came closer the shapes did not bear this out. while i have seen, at times, satellites and a few yrs ago saw the iss and space shuttle fly over, these objects did not look like any of those either. the objects were flying at a normal speed. they did not deviate from their flight path. i thought about reporting this to the local police but did not do so since it was late and did not want to endure any kind of criticism or skepticism from them. i did search for other reports and did not find any for this time or date in this area."],"Latitude":"42.269353","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/39273.html.txt","/var/www/straped/mufon/org/39273.html"],"Object Features":"Undisclosed","City":"Cary","Object Shape":"Circle, Oval","Case Number":"39273","Disposition":"Unresolved","Date Submitted":"06/11/2012 06:12 UTC","Date of the Event":"06/10/2012 11:20 UTC","Tags":"City","Longitude":"-88.251723","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Cary","There were no other sightings in Cary on or around June 10th 2012"],"Log Number":"US-06112012-0017","Summary":"I saw two aircraft flying from south to north, neither made any sound, One in the front was white the one that followed was orange","map":"<A HREF = \"http://maps.google.com/maps?q=42.269353,+-88.251723(39273)&iwloc=A&hl=en\"> mufon case (39273) map </A>"}