{"Date Submitted":"06/11/2012 04:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.253409,+-124.803975(39271)&iwloc=A&hl=en\"> mufon case (39271) map </A>","Object Shape":"Circle, Sphere, Square, Rectagular, Other","Object Features":"Other","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"49.253409","Viewing Distance":"Over 1 Mile, Unknown","divs":["sighting detailswhen i was 7 a few of us kids were playing in a park when i noticed the object in the sky i pointed it out to the others and we all figured it was a ufo, it traveled across the sky at the same speed that a satalite would and went 3\\4 of the entire sky ,,, we couldnt believe it so we all began to spin around to see if it was still there after we looked away ... it was. the object then in an instance shot off into space like the star trek light speed. i remember thinking were is our airforce what is this thing in our airspace they can come and go and we can do anything about it. we told our parents but they didnt believe. the object apeared to be the size of a quarter, it was pure white and a definate shape of a circle with corners (how to square a circle) it was so precise it was not like anything i have seen or have ever seen again. after years of concideration i have come to believe that that it was a craft that was in orbit so the size would be at least 1 mile in diamiter and is possibly an aircraft carrior craft, and if this is so then the reason to show themselves is a show of force. because if it was a peaceful ship then where are the embassitors? the fact that it was a squared circle to me denotes intelligence for pi(3.14) is required to know this shape i have never seen anyone report anything simalar usually"],"Weather Factors":"Unknown","Country":"Canada","trends":["There have been 7 other sightings in Port Alberni","There were no other sightings in Port Alberni on or around May 1st 1975"],"Case Number":"39271","files":["/var/www/straped/mufon/html2text/39271.html.txt","/var/www/straped/mufon/org/39271.html"],"Summary":"Glowing Circle with corners (Squared Circle) Transverses 3/4 of sky like a satalite then shots off at high speed into space","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Longitude":"-124.803975","Log Number":"CA-06112012-0015","Region":"British Columbia","Date of the Event":"05/01/1975 12:00 UTC","Sighting Duration":"Undisclosed","City":"Port Alberni"}