{"map":"<A HREF = \"http://maps.google.com/maps?q=39.606838,+-105.092967(39280)&iwloc=A&hl=en\"> mufon case (39280) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/39280.html.txt","/var/www/straped/mufon/org/39280.html"],"Tags":"City","Summary":"Craft descended over mountains, came straight to us and hovered. Then left.","Log Number":"US-06112012-0024","Viewing Distance":"101-500 Feet","Latitude":"39.606838","Region":"Colorado","Disposition":"Unresolved","Date Submitted":"06/11/2012 09:00 UTC","Object Flight Path":"Path then hovering","Case Number":"39280","Longitude":"-105.092967","Country":"United States","Object Features":"Louvres, Other","Object Shape":"Cigar","Date of the Event":"06/25/1967 12:00 UTC","City":"Littleton","trends":["There have been 29 other sightings in Littleton","There were no other sightings in Littleton on or around June 25th 1967"],"divs":["sighting detailson a summer evening, in as best as i can recall in 1966\\67 a group of us were playing in our front yard. we noticed a light off in the distance come down from the sky over the mountains and into a wheat field. it then moved toward us at about 30ft above the wheat tops until it was approximately 300 yds away and stopped. there was a small dry canyon between it and us. we called for my parents, who came outside and also witnessed this object that was now just hovering. it remained stationary for about ten minutes, making no sound at all. it was approximatly 40 ft or a little more in width and approximatly 15 ft in hieght. it had white panels around the circumfrence which were illuminated. the top and bottom of the craft appeared to be light gray.during it's hover many, many other children and adults from the neighborhood gathered in our yard watching it. this included a policeman and several men that worked at the nearby \"martin plant\". the object then moved off back toward the mountain range gaining speed until it reached the base of the foot hills and then just lifted off at a tremendous rate of speed into space. it did not \"tilt\" up when it went up. it remained flat and just took off at approximatly a 45% angle over the rocky mountains. it only to it 8 to 10 sec. to completly clear the mountain range."]}