{"Sighting Duration":"Undisclosed","Date Submitted":"06/12/2012 04:11 UTC","Longitude":"-111.084091","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","Region":"Arizona","Object Shape":"Unknown","Country":"United States","Viewing Distance":"Unknown","City":"Undisclosed","trends":[],"files":["/var/www/straped/mufon/html2text/39282.html.txt","/var/www/straped/mufon/org/39282.html"],"Object Features":"None","divs":["Sighting DetailsI have been observing these for several months both in Denver and Arizona. It is imperative to observe the sky in near dark conditions with minimum of light pollution. These observations invariably involve what looks like stars moving at extremely high speed flying South to North and occasionally North to South. Also some have been seen flying SW to NE. Tonight we witnessed these five times in twenty minutes. Then we saw two flying in tandem. The rear on caught up with the front one the suddenly turned 90 degrees and shot off to the East. By deduction I would estimate their speed to be in excess of 50,000 mph and certainly capable of traveling pole to pole in 20 to 30 minutes. The point is that we have been observing these for many months and I suggest others participate in observing these. These are too fast for satellites and were too high for aircraft )there were no anti-collision lights) Please consider asking others to participate in observing these. If we saw five in twenty minutes in just one sector (which implies 300 flights a day!) then this represents a huge amount of activity going on in the upper atmosphere.' Accurate feedback would be appreciated."],"Date of the Event":"06/12/2012 09:30 UTC","Latitude":"34.054078","Log Number":"US-06122012-0001","Case Number":"39282","Summary":"Extremely High Altiude - Extremely High Speed","map":"<A HREF = \"http://maps.google.com/maps?q=34.054078,+-111.084091(39282)&iwloc=A&hl=en\"> mufon case (39282) map </A>","Source":"MUFON"}