{"Summary":"2 sightings within 20 minutes near Great Sand Dunes.","files":["/var/www/straped/mufon/html2text/39299.html.txt","/var/www/straped/mufon/org/39299.html"],"Longitude":"-105.865301","map":"<A HREF = \"http://maps.google.com/maps?q=37.476439,+-105.865301(39299)&iwloc=A&hl=en\"> mufon case (39299) map </A>","Tags":"City","trends":["There have been 6 other sightings in Alamosa","There was one other sighting in Alamosa on or around June 10th 2012"],"divs":["Sighting DetailsI was camping on the western slope of the Sangres taking night time, time-lapse photographs of the stars between 12am and 1:30am on June 9th-10th. I had been looking into the sky for hours when I noticed a brilliant orange light hovering over the sand dunes to the north of my position. It hovered, unwavering, at a 25 degree angle, very low in the sky. It was at least 5x brighter and larger than any star in the sky. Since I have been to the San Luis Valley many times before, I knew there were no towns or a population of any kind in the mountains where the object was hovering and have never witnessed such events, whether viewing stars, planes or otherwise. After approximately 10 minutes, perhaps a bit less, the object disappeared. Shortly after, it reappeared a few miles from its previous position more toward the San Luis Lakes area. It moved very slowly and deliberately toward the Sangres, and took about 3 minutes to travel across my field of vision and out of my view over the mountains. As it moved, it remained silent and a steady, brilliant orange color. As it neared the mountains, I noticed 3 distinct 'wobbles' in its pattern, like a bobber in water - all of the characteristics of this flight was beyond anything I had ever seen before. I tried to take a photo of the object but, mysteriously, my camera would not turn on for about 30 seconds. I was finally able to snap 2 photos using the same exposure and shutter speed as previous photos I had taken that night, that inexplicably came out completely black. Of the 100+ photos I took that night and the next day, these are the only photos that did not turn out. Shocked and still trying to process what I had just witnessed, I sat staring at the sky in the vicinity I had seen the object when I noticed movement over the Sangres. At first I thought it was a satellite, since it looked like a star, but it moved much too slowly. I then noticed 3 more objects, identical to the first, flying in a rectangular formation, all completely in sync. After about 1 minute the objects reached the ambient light of the moon and I lost sight of them. A minute later, another identical object followed the same path as the 4 before it except this one had a light that flashed brightly in my direction every 15 seconds exactly. It reminded me of a lighthouse beacon - the beam hitting my vantage point every 15 seconds as if it were rotating. I followed this object until I lost sight in the light of the moon, as well. All objects traveled from north to south along the Sangres and I viewed each of them for approximately one minute. I sat and watched for the next hour for more activity, but saw none."],"Disposition":"Unresolved","City":"Alamosa","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","Log Number":"US-06122012-0014","Source":"MUFON","Region":"Colorado","Weather Factors":"Unknown","Date Submitted":"06/12/2012 05:37 UTC","Date of the Event":"06/10/2012 12:00 UTC","Object Shape":"Fireball, Star-like","Latitude":"37.476439","Case Number":"39299","Object Features":"Unknown"}