{"Tags":"City","Longitude":"-75.672342","map":"<A HREF = \"http://maps.google.com/maps?q=43.064614,+-75.672342(39292)&iwloc=A&hl=en\"> mufon case (39292) map </A>","Weather Factors":"Unknown","Region":"New York","Object Flight Path":"Hovering then path","Summary":"glowing light out in the distance. Hovering, moving up and down. Flew over us very slow","Source":"MUFON","Date Submitted":"06/12/2012 03:19 UTC","Log Number":"US-06122012-0011","Latitude":"43.064614","Country":"United States","Disposition":"Unresolved","divs":["Sighting DetailsMy wife Jen was feeding our newborn son at 4:00 am when she notice a light out in the distance over the street lights. It was a glowing light orange that looked to be hovering or moving very slowly. Moving up and down for about 5-10 minutes. She then woke me up and I saw the same movements. We went downstairs and out to our patio and saw it moving very slow towards us at what seemed like 300-500 feet in the dark sky. I ran in to grab the camera as it started to pass over us. That is the photo I got, not the best due to no flash. I could see details of the object when the lights flashed. It looked like a steath shape, but was lighter in color..like grey. It did look like something our military could be testing. Just seemed strange at 4:00 am...no way was it a commercial plane. The sound was so minimal, humming. I have heard military jets and they are very loud and rumble...this was not the case. Had multiple lights flashing the whole time. Finally flew over our house and headed west towards Syracuse, NY The photo is not the best I did zoom in and hopefully you can make more out of it"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/39292.html.txt","/var/www/straped/mufon/org/39292.html"],"Viewing Distance":"101-500 Feet","Object Shape":"Boomerang, Fireball","City":"Oneida","Object Features":"Wings","trends":["There have been 4 other sightings in Oneida","There were 4 other sightings in Oneida on or around June 12th 2012"],"Case Number":"39292","Date of the Event":"06/12/2012 04:10 UTC"}