{"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.198221,+-119.117036(39297)&iwloc=A&hl=en\"> mufon case (39297) map </A>","Source":"MUFON","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Circle, Disc","divs":["Sighting DetailsMe and my son were walking to my moms apt. around 6 pm.when a low flying older world war 2 looking plane flew by. so i stopped to show my son.after it had passed we began walking and i looked up again and noticed a jet very very high up going by. leaving trails.I than noticed a circular metallic object that seemed to be higher than the jet. in a stationary position.it was so high up that when i looked down \"were me and my son were walking\" and looked back up it would take me a few seconds to find it again. would have noticed it if the jet would not had flown somewhat by it from my perspective.we walked about 2 more blocks and sat down in a empty parking lot so i could show my son who is 5 years old. sitting and watching it i could see the sun reflecting off the side of the object that we were facing. it appeared to be closer and above the hospital area. and moving in in many different directions but was so high up that i could not tell how fast. we than started walking the rest of the way to my moms apt which was a block passed the hospital. i tryed to find it again but could not. i believe that it could have been cause the refection of the sun would have been on the opposite side of the object but thats just a theory :)."],"Viewing Distance":"Over 1 Mile, Unknown","Region":"Washington","Date of the Event":"06/11/2012 12:00 UTC","trends":["There have been 14 other sightings in Kennewick","There were no other sightings in Kennewick on or around June 11th 2012"],"files":["/var/www/straped/mufon/html2text/39297.html.txt","/var/www/straped/mufon/org/39297.html"],"Tags":"City","Log Number":"US-06122012-0016","Longitude":"-119.117036","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","City":"Kennewick","Case Number":"39297","Latitude":"46.198221","Date Submitted":"06/12/2012 04:59 UTC","Summary":"U.F.O spotted very high."}