{"Viewing Distance":"101-500 Feet","trends":["There have been 4 other sightings in Greenwich","There were no other sightings in Greenwich on or around September 15th 1975"],"Case Number":"39307","map":"<A HREF = \"http://maps.google.com/maps?q=41.048249,+-73.604151(39307)&iwloc=A&hl=en\"> mufon case (39307) map </A>","Region":"Connecticut","Source":"MUFON","Disposition":"Unresolved","Date Submitted":"06/12/2012 09:04 UTC","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/39307.html.txt","/var/www/straped/mufon/org/39307.html"],"Object Features":"Unknown","Longitude":"-73.604151","Tags":"City","City":"Greenwich","Object Shape":"Sphere","Latitude":"41.048249","Log Number":"US-06122012-0018","Date of the Event":"09/15/1975 12:00 UTC","Weather Factors":"Unknown","divs":["Sighting Detailswas watching the begining of kojack on tv. the tv channal changed by itself. when i went to turn my channal back on it wouldent moove it was frozen stuck. my bedroom light went out. i was laying in bed. and i saw out the window it just apeared then stoped. i got very afrade then it slowly went away. it was like a bright white light. round. as it mooved the edges of it had like pointed lights that got smaller then biger then smaller and so on like it was walking like a spider on the sky. yrt it was not far from me. ambroso or a name that sounds like it interviewed me about my sighting. i talked to people from mudon about it at that year. the eact fate i saw it was the day it first came on the tv news about trips to eternity where people left there kids there homes and left for the trip. it was after i saw this on the news on tv kojack started. then i saw it. i remember how it felt even today it felt evil. and i was deathly afraid. i wqas afraid it was going to get me if not now then later. i wouldent go out at night i stayed away from windows. and i was afraid to be alone from then on. i can tell you that i think what ever it was it is totaly evil. and dangerous. it felt like to me it was alive. you tell anyone that saw a ufo that they are evil. when i saw it a oer whelming force went in me and it felt evil. i was so afraid i was worried of having a heart attack. it wanted me. is there some people thaat can protect people that saw a ufo.. i remember what went in me that felt so evil even now today. i remember how it felt. then finaly the same week i reported it to the police. because i was afraid. they plitly told me many people saw one and suggested i just go home and forget it. i did ut i never forgot it.. and i cant stress enought to you that it was evil. never try to comtact a ufo. dont get intristed in them. is my advice to anyone that winders about them. and i cant find the right words to describe how afraid i was. i was like afraid for my sole. it wanted me."],"Country":"United States","Summary":"it looked like it was crawleing on the sky when it mooved"}