{"Weather Factors":"Unknown","Longitude":"-90.569817","Tags":"City","Object Shape":"Star-like","Date Submitted":"06/12/2012 07:14 UTC","Summary":"Distant star-like object moving slowly at first, and quickly accelerating away leaving a streak of light as it went.","Country":"United States","trends":["There have been 8 other sightings in Davenport","There were no other sightings in Davenport on or around June 12th 2012"],"Sighting Duration":"00:00:15","Object Features":"Undisclosed","Source":"MUFON","Viewing Distance":"Over One Mile","City":"Davenport","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Latitude":"41.532024","map":"<A HREF = \"http://maps.google.com/maps?q=41.532024,+-90.569817(39306)&iwloc=A&hl=en\"> mufon case (39306) map </A>","Region":"Iowa","files":["/var/www/straped/mufon/html2text/39306.html.txt","/var/www/straped/mufon/org/39306.html"],"divs":["sighting detailsat about 1am (june 12, 2012), roughly 45 degrees above horizon looking due north, i witnessed what appeared at first to be a faint star, blue\\white in color. i realized the object was moving against the background of other stars. objects speed was constant (unchanging) and i wondered if perhaps i was seeing some reflective object in orbit such as a large satellite\\etc. roughly 5 to 10 seconds later the object (very) suddenly accelerated away at a high rate of speed and became fainter and fainter. as it sped away i could track it for only about 5 seconds before it was too faint for me to make it out any longer. i witnessed the same thing about two weeks prior at about the same time of day while looking at the stars in the east, except that one started out completely stationary. it believe it was only by dumb luck that i happened to be looking right at it when it began to move. neither object appeared to have red, green, or white strobe lights characteristic of the other aircraft often seen flying through our airspace, and the rate of acceleration appeared extraordinarily conspicuous. i have no training as a pilot and little astronomical experience, but i do not believe these were any mundane objects entering the atmosphere, nor do i believe them to be any conventional aircraft due to the fact that the first object initially appeared to be (relative to other stars) stationary, and they both accelerated away. both sightings occurred during clear skies. i used nearby stars as well as the rooftop of the house and the treeline as visual reference during each sighting."],"Log Number":"US-06122012-0021","Case Number":"39306","Date of the Event":"06/12/2012 12:00 UTC"}