{"Weather Factors":"Unknown","Summary":"Hovering object in southern sky","map":"<A HREF = \"http://maps.google.com/maps?q=37.979479,+-87.56482(39317)&iwloc=A&hl=en\"> mufon case (39317) map </A>","Tags":"City","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around June 12th 2012"],"Date Submitted":"06/13/2012 12:17 UTC","Country":"United States","Disposition":"Unresolved","Source":"MUFON","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/39317.html.txt","/var/www/straped/mufon/org/39317.html"],"Sighting Duration":"Undisclosed","Latitude":"37.979479","Viewing Distance":"Unknown","Case Number":"39317","Region":"Indiana","City":"Evansville","Object Shape":"Unknown","divs":["Sighting DetailsAs witnessed from burdette park near the lake facing south, the object appeared approximately in the southern sky, above the treeline near the road by the main entrance to the park. At first notice I assumed the object to be an aircraft until watching for a little lover a minute and noticing it had no observable movement. The object had what appeared to be 2 flashing lights, which alternated side to size every one or two seconds and were white. Another plane was visible above at the same time and differing in that it had both red and white lights and that its white lights pulsed in unison, with a steady red light(s), as well as easily observable motion. Also a helicopter flew almost directly overhead during the sighting at fairly low altitude and in a southwesterly direction. After watching for about two minutes the object began to move either down or southward out of view, spanning the distance from its location to out of view below the treetops in less than 5-10 seconds. I attempted to record the object from my phone but don't believe I was successful, however I did pan and capture the helicopter and possibly the (other?) Plane during their flyovers. I can forward the video file if you believe it'd be of any use."],"Date of the Event":"06/12/2012 11:00 UTC","Object Flight Path":"Hovering then path","Log Number":"US-06132012-0001","Longitude":"-87.56482"}