{"divs":["Sighting Detailsmy wife, my friend and myself were out for a ride earlier this evening when we decided to go to a secluded part of town and see if we could see any lights that we have been seeing for the past few weeks. it was around 2247 hrs and i started to look in the sky toward town, we were all looking in different directions at the time. after about 5 minutes of not seeing anything i decided to smoke a cigarette and that is when i noticed on the horizon approximately 1000' up a very bright orb moving at a fast pace above the trees, i said for everyone to look where i was looking and they noticed it also, while looking at the one that was off to the north of us i turned to look in the opposite direction and noticed that there was a second and also a third object in the sky above us. the second one was closer than the first. this one was triangular shaped and had three very distinct lights that did not flash or strobe they stayed on the whole time that this was in motion the other two were round in shape. whatever the objects were scared the life out of my service animal. after watching these objects in the sky i noticed in the distance that there was a few military aircraft that were on a path to intercept the objects. we were all awestruck when we saw these. my wife and i have been watching the lights in the sky at around the same time every night in different locations. i am not willing to give up the location for fear that the wrong people will try to step in and say that we are not seeing anything but \"weather balloons\" or something to that effect. my dog was poking her head out of the window of our truck and started to whimper and shake really bad. enough that i had to comfort her and let her know that everything was alright. we lost sight of the three objects when they went lower than the horizon and we saw the military going after them."],"Sighting Duration":"Undisclosed","Date of the Event":"06/12/2012 09:46 UTC","Object Flight Path":"Path with directional change,Other","Disposition":"Unresolved","Region":"Maine","map":"<A HREF = \"http://maps.google.com/maps?q=45.654644,+-68.69943(39318)&iwloc=A&hl=en\"> mufon case (39318) map </A>","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Millinocket","There was one other sighting in Millinocket on or around June 12th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere, Triangle","Log Number":"US-06132012-0002","Source":"MUFON","Case Number":"39318","Object Features":"Unknown","City":"Millinocket","Tags":"City","Longitude":"-68.69943","Country":"United States","Latitude":"45.654644","Date Submitted":"06/13/2012 01:32 UTC","files":["/var/www/straped/mufon/html2text/39318.html.txt","/var/www/straped/mufon/org/39318.html"],"Summary":"we were out looking for lights on a deserted area in the town"}