{"Sighting Duration":"00:05:00","Region":"Iowa","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"Red light observed in sky","trends":[""],"Country":"United States","Disposition":"Unresolved","Longitude":"-93.094872","City":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"39316","Tags":"City","divs":["Sighting DetailsAs a line of thunderstorms were approaching from my west I noticed a single red sphere rising above and behind the roof of row of townhomes to my north. At first I thought it was a low flying jet on approach for a landing at Des Moines Airport. The red light was solid but flickered just a little. After a few seconds the upward vertical motion stopped and it became stationary in the sky even though the wind was gusting ahead of the storm. I quickly determined it did NOT have FAA strobe lights on it. The red light remained completely stationary for about a minute and then it slowly began to drift to the west for a few seconds. It lost a little bit of altitude when doing this. It then drifted off to the east for a few seconds and lost a little more altitude in the process. It then drifted back to the west but stopped in the original spot where it was previously going vertical in the sky but it was at a slightly lower altitude than before. The red sphere remained in this stationary position for several minutes. It slowly began to fade in terms of brightness while remaining stationary. I was unable to determine if the light source had faded out on its own or it just appeared to fade out because a cloud had obscured my view of the object."],"Date Submitted":"06/12/2012 11:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.885412,+-93.094872(39316)&iwloc=A&hl=en\"> mufon case (39316) map </A>","Log Number":"US-06122012-0027","Object Flight Path":"Stationary,Path with directional change","Source":"MUFON","Latitude":"41.885412","files":["/var/www/straped/mufon/html2text/39316.html.txt","/var/www/straped/mufon/org/39316.html"],"Date of the Event":"06/10/2012 10:03 UTC","Object Shape":"Sphere"}