{"Region":"New York","divs":["Sighting DetailsThe date was July 6, 2000 at around the beginning of sunset. I didn't look to see the exact time. The sky was pink, orange and reddish colors that indicated the sun was in the process of setting sometime soon. There were huge puffy white clouds low in the sky as I sat in my car facing a northerly direction on Route 110 at the corner of Melville Road intersection where I had to stop for a red light. I was first in line in the left turn lane as I intended to turn left into Melville Road heading West towards Farmingdale. I looked at the traffic light for a second after it turned red and then my gaze suddenly went towards the right of it because I noticed what I thought was the moon. This object was directly to the right of a huge white cloud and this 'moon' was just hanging there. I kept looking at it and noticed that it was a lot larger than the moon would ordinarily be, and that it was shimmering. I remember thinking to myself, \"why in the world is that moon shimmering?\". I'd never seen the moon do that and the color of it was like a silvery-white and very round, almost like a smooth satiny finish to it that is more like a shimmery atmosphere, than a material. It was absolutely beautiful. I kept watching it while waiting for the red light to turn green and it remained stationary so I believed it was the moon. But then it started to move downwards adjacent to the cloud and I then knew it wasn't the moon I was looking at. As it moved downward it gradually turned into an elliptical shape and it struck me that I was witnessing a genuine UFO in flight. I was angry at myself for not having my camcorder on hand in the car and moved so that my rear-view mirror was almost in line with the UFO. I had lined up the object while it was still a round shape next to the mirror and saw that the object was a bit bigger than the size of a quarter compared with the mirror. When the UFO reached the bottom of that cloud it resumed its round shape and hovered for a few seconds, then started moving under that same cloud towards the West. The traffic light had not changed yet so I kept watching the UFO and saw it move towards the West under the cloud, which was more grayer on the bottom of it by then. The UFO kept travelling towards the West at a great speed in about 2 seconds and after it got to the other side of that same cloud, it went upwards in a vertical path while still appearing as a sphere. After the UFO arrived at the top of the cloud but still adjacent to it, it went behind the cloud and disappeared from my sightline. I have never seen anything like that before in my entire life, or since, but in those three minutes or so of watching that object, I truly believed it was extra-terrestrial. I've never done drugs or alcohol and was not on medication and my mind was perfectly clear and I have no emotional problems. There was nothing at all that would make me doubt what I saw was an accurate witnessing of a UFO. After I watched the UFO duck behind that cloud, I thought that maybe I should have gotten out of the car and told the person in the car next to mine to look up in the sky. I didn't do that which I now regret. I might have had other witnesses to back me up also. However, I did feel that I was privileged to have seen this UFO and it may never happen to me again in my lifetime. But just for this one time, I saw somethng that many people never get a chance to, probably because they don't bother looking at the sky like I did. After the light changed to green, I had to drive on and continue home. I have since told several people, including members of my family, about my UFO sighting, but they apparently don't or won't believe. It's not surprising since they didn't have first-hand experience like I did. Yes, at first I thought maybe I was hallucinating so I pinched my skin hard a few times and no, I hadn't fallen asleep and dreamt it. I later on realized that Melville and some of Long Island is home to many aerospace related companies and that, perhaps, these UFOs are observing them. They couldn't possibly have been hovering over Long Island just to watch the traffic patterns and other evidence of human development, could they? I also thought that if the UFO isn't extra-terrestrial, then maybe the U.S. Government is testing spacecraft that can hover above cities and then move at great speeds to another area. But then, where did the Government get that kind of technology that possibly nobody else has? I have since retired and moved away from Long Island but I am still very much fascinated and curious about that UFO I witnessed and all others. I certainly hope that valid answers will be forthcoming soon before I grow too old to care anymore. Sorry, I have no photos of the incident. Just my vivid memories of it."],"Longitude":"-73.415121","Log Number":"US-10012005-0009","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"None","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/3931.html.txt","/var/www/straped/mufon/org/3931.html"],"City":"Melville","trends":["There has been one other sighting in Melville","There were no other sightings in Melville on or around July 6th 2000"],"Object Features":"None","Date Submitted":"07/06/2000 07:00 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date of the Event":"07/06/2000 07:00 UTC","Summary":"Melville, Long Island, New York, I saw a moving sphere in the sky after mistaking it for the moon","Object Shape":"Disc, Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.793432,+-73.415121(3931)&iwloc=A&hl=en\"> mufon case (3931) map </A>","Case Number":"3931","Latitude":"40.793432","Country":"United States"}