{"Object Shape":"Star-like","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around June 12th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.707434,+-84.528701(39315)&iwloc=A&hl=en\"> mufon case (39315) map </A>","Log Number":"US-06122012-0026","Latitude":"42.707434","files":["/var/www/straped/mufon/html2text/39315.html.txt","/var/www/straped/mufon/org/39315.html"],"Date of the Event":"06/12/2012 10:59 UTC","Object Flight Path":"Hovering then path,Path then hovering","Tags":"City","Longitude":"-84.528701","Object Features":"Unknown","Date Submitted":"06/12/2012 11:46 UTC","Source":"MUFON","Weather Factors":"Unknown","Case Number":"39315","divs":["Sighting DetailsI was watching Fox with Greta Van Sustern when I decided to return outside and look around. I had been out earlier and didn't see anything unusual, about an hour before and stars weren't out yet. I noticed what looked like a blinking star or possibly a plane as the lights were blinking red, green, yellow and over the course of an hour, became red, blue and yellow. No sound. It was in the southeast corner of the sky at first and hovered. We looked with binoculars, but no definitive outline and no distance change. We originally saw it at 10:35 p.m. and went back out at 11 p.m. and from our vantage point, it had moved west by two inches visually, then stopped and hovered again. It 11:30 p.m. it had moved barely to the west just behind a treetop, but the stars around it hadn't moved. While we were looking, 2 planes went by it. One above and one below. It couldn't be a new tower or planes wouldn't go below it and we would've seen it before as we have lived here for over 5 years. I had a \"feeling\" that it was watching ME although I had no evidence of that. At 11:35 p.m. as I was writing this, my husband said that while watching it, it moved suddenly \"up\" or straight north in our direction. I do not wish to describe here what I \"saw\" and \"felt \" in detail as I am too weirded out! Please let me know what you find out."],"Summary":"blinking,hovering,moving,hovering, moving, gave me \"images & Feelings\"","Disposition":"Unresolved","City":"Lansing","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Michigan","Country":"United States"}