{"Object Flight Path":"Straight-line path,Other","trends":["There have been 13 other sightings in Grove City","There were no other sightings in Grove City on or around June 12th 2012"],"files":["/var/www/straped/mufon/html2text/39323.html.txt","/var/www/straped/mufon/org/39323.html"],"Object Features":"None","Log Number":"US-06132012-0007","Region":"Ohio","divs":["sighting detailssince having a sighting in my backyard over memorial day weekend, i have been watching the sky at night. i had observed the same pulsing\\strobing star that floated over my neighborhood that weekend, now in the distance on several occassions. however, last night i saw something different. i observed some flasing lights over my treeline and called my boyfriend out, who also observed them. we then lost sight of them, so i went around to the front of the house to take a look. at this lime i saw an orange ball moving through the sky. it did not blink or make a sound. i watched it come across our entire block, but then it went behind a tree and never emerged on the other side. at which time we noticed an airplane in the direction the ball had been heading. we eventually went back inside, but i kept popping back out to check the skies. at one point i saw a flashing light dancing around the pulsing star that was in the distance. i called my boyfriend back out. the single light was then joined by two more flashing lights and they danced\\flashed around for a few minuted until they lined up in a straight line directly below the pulsing star. this alignment seemed to cause a reaction in the star object of a bright red strobe. the small lights then moved off in seperate directions and disappeared. the pulsing star object became more distant."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.876139,+-83.07274(39323)&iwloc=A&hl=en\"> mufon case (39323) map </A>","Date of the Event":"06/12/2012 12:00 UTC","Case Number":"39323","Disposition":"Unresolved","City":"Grove City","Object Shape":"Circle, Flash, Star-like","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.876139","Longitude":"-83.07274","Summary":"Orange non blinking orb and seperate formation of white flashing lights w Starlike object","Tags":"City","Date Submitted":"06/13/2012 02:29 UTC"}