{"Source":"MUFON","Date Submitted":"09/30/2005 04:55 UTC","trends":["There have been no other sightings in St Louis","This sighting has never been favorited."],"Tags":"City","Region":"Kentucky","Sighting Duration":"Undisclosed","Longitude":"-90.252883","divs":["Sighting Details It was A quiet cool clear night fore day in the morning at 4:55 A.M.. I was walking in the sireet heading home to my house on the north side of the city. When I looked up to my right I seen four bright white lights in the sky. I thought that was strange since there is no tall buildings or towers in that diection and that they had A triangle style shape. As I came closer I could begen to see the out line of A thick flat black colored triangle shaped craft with rounded off edges. It had four large bright white lights under it. There was one on the leading edge one on each corner and one in the back that lined up with the front light. I was walking slowly trying to make out the craft. I heard nothing until I was within A block I head A very low rumble that seem back and higher up the the craft. It was not like any civil or military aircraft or helicopter. The fact that it stood still in mid air with a no movement or the loud poping and clicking of A main rotor made it not A helicopter and it had no Nav light of either green or red which on A clear night like this I could have seen at that range. It was about twenty stories off the ground and was 70 to 80 feet in span and 40 to 55 in length and about 15 to 20 tall. It had A very smooth bottom and was A perfect triangle. It silently moved low and slowly to the southwest until I could not see it any more."],"City":"St Louis","Log Number":"US-10012005-0010","Date of the Event":"09/30/2005 04:55 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/3932.html.txt","/var/www/straped/mufon/more/3932_submitter_file1__lastscan.jpg","/var/www/straped/mufon/org/3932.html"],"Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Summary":"Unknown flat black thick triangle","Object Shape":"Undisclosed","Latitude":"38.62744","map":"<A HREF = \"http://maps.google.com/maps?q=38.62744,+-90.252883(3932)&iwloc=A&hl=en\"> mufon case (3932) map </A>","Case Number":"3932"}