{"trends":["There have been 26 other sightings in Corpus Christi","There were no other sightings in Corpus Christi on or around October 13th 1996"],"Source":"MUFON","Region":"Texas","Tags":"City","City":"Corpus Christi","Country":"United States","Disposition":"Unresolved","Object Shape":"Disc","Log Number":"US-06132012-0008","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/39324.html.txt","/var/www/straped/mufon/org/39324.html"],"Summary":"Saucer Shaped Like Disc Hovering Directly Above me for 10 minutes","Date of the Event":"10/13/1996 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-97.405427","Object Flight Path":"Stationary","Case Number":"39324","Latitude":"27.785237","map":"<A HREF = \"http://maps.google.com/maps?q=27.785237,+-97.405427(39324)&iwloc=A&hl=en\"> mufon case (39324) map </A>","divs":["Sighting DetailsDear Friends, Hi My name is Laura, and was 18 at the time. It was midnight October 1996 to be and I was in deep shock after what I saw, I believe in God, but couldn't believe that I saw this,I wasn't alone. That night my mother told me to call my brother Andrew in it was late, and he had been rebuilting an engine for several hours in the back yard. I notice some stobe lights in the sky and decided to look to see what was going on, it was a clear night. All of the sudden I was paralyzed with fear when I saw a spaceship disklike acending from the sky hovering and stopped directly above me. It was purple silverish, and spinning clockwise. I called to my brother to look but my voice was being controlled and I couldn't yell loud enough to get his attention. I kept looking up and said I must be dreaming and is this for real,this cannot be happening. All of the sudden it was closer but still far, and I could see three red lights changing colors to yellow and red in a triangle shape. They communicated with me telephathicly, telling me it was my time to be abducted. They were going to take me, but I ,strongly refuse to go. Finally after 10 mins, they I knew there was more than one creature, They sent me images of them in my head. The saucer started spinning faster and they slowly moved around the sky and then in hyperspeed like starwars ships do and took off into space. Then my brother looked up and it was too late. I ran to tell my mom what had happen,she said I was crazy and if I reported it I would end up in the mental institution. So I kept it to myself all these years except to my husband. A year ago my husband was suffering from sleep paralysis. He gets frozen and held down by creature like things in the bed. Sometimes they are holding his legs and arms towards the celing. He cannot move, breathe, or call out for help. Sometimes he was levitated and moved in the room. He was being dragged out the front door once and woke up in the bed screaming and believing he was awake the entire time. This would happen for a few months. He would also wake up to sounds of explosions. One day the nosie woke me up too. I was panicing. He had a dream we were being watched by aliens, grey creatures. He still sufferes severe headaches since and me too, like we never had before. And a year ago I had a terminal illness, which is completely gone now. The sleep paralysis is gone too."],"Object Features":"Other","Date Submitted":"06/13/2012 04:44 UTC"}