{"Latitude":"39.25163","Disposition":"Unresolved","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/39329.html.txt","/var/www/straped/mufon/org/39329.html"],"Date of the Event":"09/19/2011 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.25163,+-94.654745(39329)&iwloc=A&hl=en\"> mufon case (39329) map </A>","Source":"MUFON","Country":"United States","Date Submitted":"06/13/2012 09:34 UTC","divs":["Sighting DetailsMy mother and I were watching it out the windows facing East and it was coming just over the tree tops from the West heading South-West. After it passed over the apartments I ran out to the front and continued to see it ascend over I-35 and into the low lying rain clouds. It was all black in the back part and looked flat there unlike the sides and cone front which were white with 7-8 glossy light navy blue window trim with the window part white too. A design in the same blue color was observed on the larger front window but I couldn't make it out. The best I remember it was a zig-zag type like a lightning bolt of some sort. Two blinking lights one of the front and one on the back part. I remember Red and green and blue lights blinking. Two long antenna one top and one bottom with blinking colored lights on the top and bottom. There were many lights around the complex and other complexes and it helped reflect off of the craft and was very visible to see because of this fact. I have seen blimps up close and they are real loud with their propellers and this craft made no noise at all. it did not wobble or appear to be swayed by the breeze, but make an intended straight line over the complex and I-35. Also, no undercarriage for a crew and passengers was ever noticed like a regular blimp and no rudders at the back also. We viewed it in the back of the building about 60-70 yards away and it was only about 40 yards off the ground and looked about 30-40 yards long. We saw it at an angle going south-west. I have wondered why the craft had the antennas on the top and bottom and after thinking about it thought the most practical reason is that it uses them for sensors and markers since the large silver metal power lines were just feet below these antenna. My guess is they are retractable and that explains why I never saw them on any cigar shaped UFO on Google image search. I will download the picture to you tomorrow from the sketch I took just an hour after We saw this object. Yes, I have often wondered how drivers on I-35 didn't get a million dollar shot at this object, but by then it was just starting to descend into the dark rain clouds."],"Case Number":"39329","Sighting Duration":"Undisclosed","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around September 19th 2011"],"City":"Kansas City","Object Features":"Window(s), Insignia, Other","Longitude":"-94.654745","Region":"Missouri","Tags":"City","Summary":"I sent MargieKay 2 emails last Sept on the UFO...we have since moved back to Texas","Log Number":"US-06132012-0013","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Object Shape":"Cigar"}