{"Viewing Distance":"N/A","Date Submitted":"06/13/2012 06:30 UTC","City":"Eastern Passage","Object Flight Path":"Path with directional change","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Circle","Disposition":"Unresolved","Case Number":"39327","Summary":"Round bright white lights above Eastern Passage,","Country":"Canada","trends":["There has been one other sighting in Eastern Passage","There were no other sightings in Eastern Passage on or around June 11th 2012"],"files":["/var/www/straped/mufon/html2text/39327.html.txt","/var/www/straped/mufon/org/39327.html"],"Longitude":"-63.478585","Region":"Nova Scotia","divs":["Sighting DetailsI am reporting what my grandmother told me today. I have never seen anything paranormal myself, nor has she. Neither of us watch programs or read about UFOs, for all I know it could have been a natural phenomenon. She is not on any medications and has no medical illnesses like dementia and she has never lied to me about anything, and SWEARS she saw this. She was out on the deck smoking \"A couple nights ago\", I assume June 10th or 11th, 2012 while I was at a friends. It was a clear, quiet night. She enjoys watching planes and helicopters fly overhead at night as we live somewhat near a military airport. She spotted three white, bright orbs high up in the sky NW of our house. She first spotted one white orb (about the size of a star, but brighter and a bit larger)slowly flying north; so she went to grab her binoculars. She came back outside and noticed two more of the orbs NW flying towards each other, but they disappeared into thin air before they hit each other. The other orb (the first one she saw) was still flying north, but it then suddenly turned 90 degrees and started flying east, then disappeared. The lights were not flashing or blinking like on planes, and there was no sound of the engine and no trail. I posted that she saw something on my Facebook but didn't give the details. A friend of mine (who lives about a 20 minute drive away) commented saying that her and her boyfriend saw the same thing I just described, a week or two earlier. Only the three lights flew towards each other in a triangular formation then disappeared. I had not told anyone about this yet, nor had my grandmother. I would liked to have seen this myself, but I do believe my grandmother and know that she DID see what she said she saw. I would love a natural explanation because I do NOT want to believe in UFO's, too scary..."],"Sighting Duration":"Undisclosed","Log Number":"CA-06132012-0011","Date of the Event":"06/11/2012 10:00 UTC","Latitude":"44.621951","map":"<A HREF = \"http://maps.google.com/maps?q=44.621951,+-63.478585(39327)&iwloc=A&hl=en\"> mufon case (39327) map </A>","Object Features":"None"}