{"Region":"Minnesota","Longitude":"-92.926609","files":["/var/www/straped/mufon/html2text/39330.html.txt","/var/www/straped/mufon/org/39330.html"],"divs":["Sighting DetailsI was out on my front porch letting my dog outside before retiring for the evening...looking up to the sky to view the stars, which i like to do, i noticed quite a bright star (so i thought) and watched it for a few minutes, then, suddenly a smaller, less bright star-like object began following it. At first, when i saw the brighter star-like object, i thought it was a satellite, because it was behaving in the same manner, moving slowly across the night sky. When the smaller one began following it, changing direction around the brighter one, it also, began to change direction. Neither of them moved in a direction that could be said as normal, as the smaller one, from what i could tell, seemed like it wanted to make contact with the brighter one. after viewing this for more than 10 minutes, i looked around the neighborhood to see if anyone was outside that i could confirm what I was seeing. My next-door neighbor said he saw the very same thing. I scrambled back to my front porch after getting him over to my yard and we both viewed this and saw nothing strange for the next several minutes. I remember seeing something on TV about MUFON and decided to submit this report'"],"Disposition":"Unresolved","Object Features":"None","Summary":"witnessd bright star like object shortly, then dimmer star-like object hovered/chased around brighter one, then the second turned elongated with lights","Tags":"City","City":"Cannon Falls","Sighting Duration":"Undisclosed","Latitude":"44.498053","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Cannon Falls","There were no other sightings in Cannon Falls on or around June 13th 2012"],"Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=44.498053,+-92.926609(39330)&iwloc=A&hl=en\"> mufon case (39330) map </A>","Date of the Event":"06/13/2012 12:00 UTC","Date Submitted":"06/14/2012 12:18 UTC","Log Number":"US-06142012-0001","Object Shape":"Cigar, Star-like","Viewing Distance":"Over One Mile","Country":"United States","Source":"MUFON","Case Number":"39330"}