{"Case Number":"39333","files":["/var/www/straped/mufon/html2text/39333.html.txt","/var/www/straped/mufon/org/39333.html"],"Region":"Oregon","Tags":"City","Latitude":"42.155483","Date Submitted":"06/14/2012 01:03 UTC","Country":"United States","Summary":"my brother and i saw a oval, disk/egg, shaped object decend and land 35-45 ft from us","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Cave Junction","There were no other sightings in Cave Junction on or around May 7th 1990"],"Disposition":"Unresolved","Object Shape":"Disc, Egg, Oval","divs":["sighting detailsmy brother and i were in southern oregon choppin wood on the back porch. we both herd a noise, like something spinning at high speed, like a jet, or a turbo but quiet like a car idling. it sounded close like right above us. we looked up and saw a disk\\egg shaped silver, shinny, metallic looking object about 20ft across and 8 ft thick decend down thru the trees at about 10ft\\sec from about 80ft, and come to a stop a few feet above the ground 35-45ft from us. i had no idea what i was looking at except it was right infront of us and it was really there, i could have hit it with a rock. we observed it for a few seconds, then it emitted a red beam at us. we turn and ran into the house and when i grabbed the door handle i saw our silloette on the door the circomfrence of the beam was approximately 6ft. when we got inside we were yellin for my mom to come see, and when she did it was gone. my brother and i talked about it with my mom, im not shure what she thought of it. i have told others my story and usualy most dont beleive me so i didnt tell it for most of my early to late twentys. my brother went to the airforce and was gone for about 5 years, he had background checks and such for his clearance. he came home once i asked him about it , he kinda dismissed it and wouldnt talk about it. that bothered me, so recently i asked him again and he told it back to me the way i remembered it without any leading, all his words."],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"21-100 Feet","City":"Cave Junction","Log Number":"US-06142012-0004","Object Flight Path":"Stationary,Path then hovering","Longitude":"-123.634054","Date of the Event":"05/07/1990 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.155483,+-123.634054(39333)&iwloc=A&hl=en\"> mufon case (39333) map </A>","Source":"MUFON"}