{"Longitude":"-82.630295","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.552652,+-82.630295(39334)&iwloc=A&hl=en\"> mufon case (39334) map </A>","Object Features":"Unknown","Case Number":"39334","Country":"United States","Region":"Michigan","divs":["Sighting DetailsLeaving Harsens Island MI approx. 9:50. Stopped at end of drive to lock the gate when my boyfriend got out of the suv I looked up and saw numerous star like objects traveling in no such order but keeping in a controlled area assending into the upper atmosphere at a modest speed. They just kept coming from the east to the west until finally bringing up the end were 2 larger star like objects side by side and then they were gone. When my boyfriend got out of the suv he too looked up to the sky as he always does. He then turned to me and shouted do you see this? There was no one around on the road nor anywhere else we could see. We continued on our way to the ferry. I contacted 911 to report what we had seen and was told they had no other reports. When we arrived at the ferry we asked the deckhand if he saw anything unusual that evening and he said no. My boyfriend called Selfridge airbase if they were doing any maneuvers and they said no. I told my boyfriend that it looked like an alien field trip with the mentors bringing up the rear. Could they have been balloons like weather balloons? I think not. And could not be airplanes, too many too close to each other. Thats my story."],"files":["/var/www/straped/mufon/html2text/39334.html.txt","/var/www/straped/mufon/org/39334.html"],"Object Flight Path":"Straight-line path","Log Number":"US-06142012-0005","Date of the Event":"06/10/2012 09:50 UTC","Tags":"City","Source":"MUFON","Object Shape":"Bullet, Missile, Cylinder","Sighting Duration":"Undisclosed","Date Submitted":"06/14/2012 01:48 UTC","trends":["There has been one other sighting in Clay","There were no other sightings in Clay on or around June 10th 2012"],"Summary":"standing @ end of drive next to road & bay looked @ sky & saw 30+ star like objects assending into the western sky followed by 2 larger star like objects side by side and vanished.","Weather Factors":"Unknown","Latitude":"42.552652","City":"Clay","Disposition":"Unresolved"}