{"divs":["Sighting DetailsDate: 2008-12-24 Time: 22:46:00 Weather: Nightime, Very Clear Sky, No Wind, Quiet Duration: Lasted about 15 seconds Country: Australia Orientation: Inside Bedroom, spotted outside of bedroom window Number of UFOs: 1 Height: 100-150m Size: Golf Ball Number of Witnesses: 2 Details: Me and my sister were in my bedroom watching tv, when an advertisement came on, we were talking, the way i was facing her looked straight out my window. I saw something emitting blue light hovering around, silent, not a noise. My sister also watched. At first it was flat going slowly to the side, then it turned around and went the other way, then repeated a few times. When it turned it went on it's side, allowing me to clearly see the shape of the object, triangular, with a smaller triangle on the bottom - connected as one. It was blackish in appearance with the blue glow. After it did the turns, it just went..BANG..Silent, but it left so fast you couldn't see it. Here's the weird thing. What this means, I don't know, maybe one of you could help me out...Within 2 minutes of seeing this, i felt light headed, and i saw a massive meteorite crashing into the earth, like it was really happening, i was 100% awake, un drugged, like a premonition kind of thing. I went out and ran to my nan. To this day no-one believes me, even my sister says it was a plane or something? How could a plane move like that?! That was an extract from my submitted report. Please help if you can, maybe someone has something of relevance."],"Longitude":"151.543603","Object Shape":"Triangle","Region":"New South Wales","City":"Killingworth","Object Flight Path":"Path with directional change","Tags":"City","files":["/var/www/straped/mufon/html2text/39335.html.txt","/var/www/straped/mufon/org/39335.html"],"Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-32.933518,+151.543603(39335)&iwloc=A&hl=en\"> mufon case (39335) map </A>","Disposition":"Unresolved","Object Features":"None, Other","trends":["There have been no other sightings in Killingworth","This sighting has never been favorited."],"Latitude":"-32.933518","Viewing Distance":"101-500 Feet","Date of the Event":"12/24/2007 10:45 UTC","Log Number":"AU-06142012-0006","Summary":"Moved around in random directions slowly for around 13 seconds then shot off insnanely quick.","Country":"Australia","Sighting Duration":"00:00:15","Case Number":"39335","Date Submitted":"06/14/2012 05:41 UTC"}