{"Object Flight Path":"Path with directional change","Date of the Event":"06/10/2012 12:00 UTC","Case Number":"39338","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.125488,+-80.159565(39338)&iwloc=A&hl=en\"> mufon case (39338) map </A>","Date Submitted":"06/14/2012 12:19 UTC","trends":["There have been 17 other sightings in Stuart","There were no other sightings in Stuart on or around June 10th 2012"],"Log Number":"US-06142012-0009","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/39338.html.txt","/var/www/straped/mufon/org/39338.html"],"Summary":"2 red lights in the sky over Stuart Florida","Latitude":"27.125488","Country":"United States","City":"Stuart","Region":"Florida","Disposition":"Unresolved","divs":["Sighting DetailsLooking west, a small asprin sized red light came from the southwest,right above the treeline ,but on the horizon, and was travelling north at a steady climb, shortly, a second light appeared directly behind it, and flew identicle paths together..a slow climb untill I lost sight of them behind a cloud. the whole incident lasted just over a minute. the lights had the characteristics of an aircraft, no crazy speeds or manuevers. almost looked like two military jets on an afterburner climbing out, but just looked weird because they didn't change in intensity as veiwing angle changed, and I didn't hear a thing..expected at least a little rumble as it was very quiet, and very little wind. At first I thought it was a police helicopter, but then realized, here, the copters have flashing blue and red lights, and usually a spot light shining down when they're flying at low altitude Sure wish I had got my camera out, but had outside flood lights on, and honestly, was waiting to hear a sound, before I knew it, they were gone behind the cloud."],"Longitude":"-80.159565","Source":"MUFON"}