{"Region":"Kentucky","Object Features":"Unknown","Log Number":"US-06142012-0002","Country":"United States","divs":["Sighting DetailsMy wife has lived in the rural area of north Garrard County since she was little and has always told me stories of things she and her family had seen. I came from Lexington and until recently had always lived in the city where it is really hard to see anything more than street lights and traffic. After we got married and adopted our autistic son we purchased a small farm on the same ridge that she grew up on. I have always had an open mind that has always searched for answers and been filled with curiosity. Not long after moving in and getting our farm established I began seeing lights in the night sky that did not fit any known aircraft I had ever read about or seen. It has become a nightly routine of laying in bed watching out the window and counting how many we see and how many can be written off as a plane or helicopter. We do live fairly close to an Army Depot located in Richmond, but the shear number of what we see and the odd flight patterns don't seem to be \"typical\" aircraft. My mother who has always been very religious and a skeptic finally has began to open her mind a little with each visit she makes. I even joke with her about seeing her friends outside. I would love if anyone else close to the area could explain or confirm what I see."],"Summary":"Nightly occurences.","Sighting Duration":"Undisclosed","Latitude":"37.733656","Disposition":"Unresolved","Date Submitted":"06/14/2012 12:41 UTC","Date of the Event":"05/21/2012 12:00 UTC","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Lancaster","There were no other sightings in Lancaster on or around May 21st 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.733656,+-84.560153(39331)&iwloc=A&hl=en\"> mufon case (39331) map </A>","City":"Lancaster","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Circle, Diamond, Flash, Sphere, Star-like","Longitude":"-84.560153","Object Flight Path":"Stationary,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/39331.html.txt","/var/www/straped/mufon/org/39331.html"],"Case Number":"39331","Source":"MUFON"}