{"Object Features":"Patterned Surface, Appendage(s), Wings, Other","Region":"Virginia","Log Number":"US-06142012-0014","Country":"United States","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Norfolk","Tags":"City","Summary":"closest viewing of alien vehicle so far","Source":"MUFON","files":["/var/www/straped/mufon/html2text/39344.html.txt","/var/www/straped/mufon/org/39344.html"],"Longitude":"-76.269893","Latitude":"36.909594","Date Submitted":"06/14/2012 05:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.909594,+-76.269893(39344)&iwloc=A&hl=en\"> mufon case (39344) map </A>","divs":["Sighting DetailsThe sky was clear and dark. all the stars shone bright. The transit on Venus just a few weeks away, and solar and lunar eclipses imminent. A single giant cloud formed out of no where beyond a neighbors house and the blinking lights that made no sound began to emerge one by one, as if playing with each-other. I called them in closer by repeating my thoughts. First, one craft began to glide steadily toward my house, as if it and the others are lookout for something even more spectacular. Others move in a steady line over my home but i keep my camera on the closest one. They look like the shape of a giant sweet pea pod but black, with only one big pea in the center and the barren tips curve like wings. They and moved so randomly, blinking across the sky, back and forth, with one another and now they all focus and scan the area, in silence. The triangle formation of lights on each can be seen when they are just above and the three white lights blink in unison. As the closest of the pods passes over my house my eyes see a craft like I have never seen on t.v. or in movies or even on the internet. It pops up from behind my house, from down within the trees and moves toward me with great ease and purpose. The craft is in the shape of a crystal but made of metal and covered, seemingly randomly in yellow-orange lights. Some of the lights project a constant dull glow while others blink one by one. It was as large as a S.U.V, turned on it's end. It was conical in shape, pointed on top and bottom, and the many slivers of metal fit together in a very abstract way. It was in no way symmetrical or smooth. It glided so smoothly and dropped down less than a hundred feet from me, just over my rooftop. It proceeded to rise up just above the treetops and beyond them, toward the cloud formation that still lights up fiercely, every minute or so, like bright lightning but with absolutely no sound. the only sound was a soft hum as the metallic, crystal craft ascended upon me from the heavens. My soul, heart and mind were wide open with anticipation and lookout crafts remained circling my house for at least an hour, blinking and moving randomly and they in straight line patterns, in and out of the cloud mist."],"Date of the Event":"05/23/2012 09:30 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Other","Case Number":"39344","Object Shape":"Cone, Diamond, Star-like, Other","trends":["There have been 24 other sightings in Norfolk","There was one other sighting in Norfolk on or around May 23rd 2012"]}