{"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Other","Summary":"5 objects darting in different direction then coming together in a formation, interacting and then darting apart again. Repeat over and over.","City":"Northbrook","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"06/14/2012 10:08 UTC","Log Number":"US-06142012-0019","divs":["Sighting DetailsI went outside at 10:30pm to let my dog out and looked up in the sky and noticed 5 white circles darting across the sky in different directions and then coming together in a formation, interacting, twirling around and then they dispersed and all went in different directions very rapidly...in a split second. There were NO surface to air rays that would be visible if these were spot lights. I was watching them do this for about 15 minutes and then went inside to get my adult daughter to see if she could see what I was seeing. And she did. She went inside to get my digital camera and was snapping pictures of the objects. My daughter then went inside for a few minutes and handed me the camera. While my daughter was gone, I looked over the pictures she took but didn't see anything in them so I deleted them. She came back out and we were watching them for another 10-15 minutes repeatedly doing the above. Their position started moving westerly so they were almost directly over our house. My daughter went back inside and I stayed outside and continued snapping pictures for another 20 minutes or so. I then went inside for the night about midnight but they were still in the sky when I went in. After looking at the pictures I noticed an object that I hadn't seen in the sky. It was a solid circular object with a white glow around it. It wasn't the moon because the sky was cloudy and no moon was visible. There were 3 pictures that were all taken at the same time (11:54pm) split seconds apart. The 1st picture showed a solid white circular object with a glowing white ring around it. The 2nd picture showed nothing and the 3rd pictures showed the same solid circular object with the same glowing white ring around it but it was 3 times larger and in a different spot. Keep in mind these 3 pics were all taken in the same second...11:54pm. The next day, we uploaded the pictures to my daughter's computer and noticed faint circular objects in the sky that were not visible from the camera's view finder. My daughter put red circles around the objects so they were more easily seen. We live near Chicago Executive Airport, so I called them a few days later, described the incident to them and they requested that we email them the photos. We did and they gave us the standard \"we'll get back to you\" but haven't. We know what we saw was NOT spotlights but have no idea what it actually was. The pictures are still on the digital camera as proof that we haven't manipulated or tampered with them. Everyone we've showed the pictures to is stunned by them and have no explanation as to what they could be. So we're like your expert opinion on what they are or might be."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.090552,+-87.885623(39349)&iwloc=A&hl=en\"> mufon case (39349) map </A>","trends":["There has been one other sighting in Northbrook","There were no other sightings in Northbrook on or around June 3rd 2012"],"Date of the Event":"06/03/2012 10:30 UTC","Source":"MUFON","Latitude":"42.090552","Region":"Illinois","files":["/var/www/straped/mufon/html2text/39349.html.txt","/var/www/straped/mufon/org/39349.html"],"Longitude":"-87.885623","Object Shape":"Circle","Tags":"City","Country":"United States","Object Features":"None","Disposition":"Unresolved","Case Number":"39349"}