{"Summary":"Green fireball traveling from SW to NE parallel to the ground on a moonlit evening with sparse cloud cover","divs":["Sighting DetailsIn November (I don't remember exactly what day it was) 1992, I was traveling home on what is now I-99, heading WSW around 10:30 p.m. The sky had minimal cloud coverage and was moonlit providing fairly unobstructed visibility. I could see the red warning lights atop the three radio towers near the Barons on the horizon and while looking at them, noticed something green and what appeared to be the same size and height of the radio tower lights. My initial reaction was that one of the light's shell must have shattered and the light was arcing. As I continued I began to notice the object was appearing larger to me and realized that it was traveling toward me, maintaining it's altitude, which I guessed as approximately 500 - 1000 feet. As it got closer to me I pulled off the highway and parked, turned my engine off and rolled my driver window down. I could clearly see the object was emerald green in color with gold sparks emanating from all around the sphere. Because of the proximity of the local airport, the characteristics of the object and it's apparent flight path, I thought I was witnessing a small aircraft that was on fire trying to make it to the airport to land. There was absolutely no sound from the object. I watched the object maintain it's flight path to the eastern horizon, never changing altitude and eventually flying out of sight. I estimate the speed of the object approximately 125-175 knots. My evolving interest in air phenomena motivated me to finally share this observation publicly."],"Tags":"City","Object Shape":"Fireball, Sphere","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/39341.html.txt","/var/www/straped/mufon/org/39341.html"],"Date Submitted":"06/14/2012 02:20 UTC","Disposition":"Unresolved","Case Number":"39341","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.829543,+-77.839922(39341)&iwloc=A&hl=en\"> mufon case (39341) map </A>","trends":["There have been 10 other sightings in state college","There were no other sightings in state college on or around November 13th 1992"],"Sighting Duration":"Undisclosed","City":"state college","Longitude":"-77.839922","Latitude":"40.829543","Region":"Pennsylvania","Object Flight Path":"Straight-line path","Source":"MUFON","Date of the Event":"11/13/1992 10:30 UTC","Log Number":"US-06142012-0011","Viewing Distance":"501 Feet - 1 Mile","Country":"United States"}