{"Disposition":"Unresolved","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsI was at a friend's house when I was younger (11-12 yrs old), outside playing in his yard. He lived in a housing development at the time of the event. What made us notice the object was that it was night-time and a big object flew over us with red lights; it was hard to *not* notice it. We sat there in awe as it flew across, and after it passed, ran into his house a bit scared. We attempted to explain it to his mother, which was unsuccessful, thinking we were just fooling with her. It was during the night, so it was kind of tough to see exactly how this object was formed. It appeared to be triangular in shape, like a Dorito chip. Looking up, it had red lights on the surface underneath. I cannot recall how many; but it was in a pattern of a triangle as well. The object did not alternate a course, or speed. It couldn't of been more than 20-30 ft above the roof of his one story home. I can't recall if it had a low hum, or hardly any noise at all. It was definitely not loud at all. It was in our view for about 10 seconds, and exited our view once it went past the treeline. It wasn't going real fast, kind of just scoping the area out possibly? Being so young, I always dismissed this as a possible government project of some sorts. I just watched the show \"UFO's over Earth\", which featured sightings in Bucks County, PA; which is close to my county. I couldn't believe that there were collaborating stories about this triangular object. Whenever UFO's come into a conversation, I always think about this event. Until now, I have only told a few friends and my parents. I have nothing to gain from sharing this, and realize it is not very credible having it been almost two decades old. I just have nothing to gain for lying about it. I hope this account helps out in someway."],"Country":"United States","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.753488,+-75.606713(39368)&iwloc=A&hl=en\"> mufon case (39368) map </A>","Date of the Event":"07/01/1994 12:00 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Longitude":"-75.606713","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Slatington","There were no other sightings in Slatington on or around July 1st 1994"],"files":["/var/www/straped/mufon/html2text/39368.html.txt","/var/www/straped/mufon/org/39368.html"],"Source":"MUFON","Latitude":"40.753488","Summary":"I saw a triangular shaped object w/ red lights hover over a development of houses.","Region":"Pennsylvania","Date Submitted":"06/15/2012 05:00 UTC","Object Shape":"Boomerang, Triangle","Log Number":"US-06152012-0011","Case Number":"39368","Tags":"City","City":"Slatington"}