{"Tags":"City","Log Number":"US-06152012-0008","Disposition":"Unresolved","Latitude":"44.059702","Date of the Event":"06/14/2012 09:50 UTC","Date Submitted":"06/15/2012 12:42 UTC","Country":"United States","Summary":"out for our nightly ride with our dogs","Case Number":"39364","map":"<A HREF = \"http://maps.google.com/maps?q=44.059702,+-69.78659(39364)&iwloc=A&hl=en\"> mufon case (39364) map </A>","Weather Factors":"Unknown","trends":["There has been one other sighting in perkins","There was one other sighting in perkins on or around June 14th 2012"],"Longitude":"-69.78659","Sighting Duration":"Undisclosed","Region":"Maine","files":["/var/www/straped/mufon/html2text/39364.html.txt","/var/www/straped/mufon/org/39364.html"],"Source":"MUFON","Object Features":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Shape":"Cigar, Chevron, Sphere, Triangle","Object Flight Path":"Path with directional change,Path then hovering","City":"perkins","divs":["Sighting Details On my CB radio i had been hearing a high frequency pattern of sounds all day long so i thought it would be a great night to go out and investigate to see if we could see anything in the skies again so we got our dogs and went for a ride at around 2150hrs last night we got to the lake where we have seen things in the past, when we looked out over the lake and saw more strange lights in the distance above the tree tops, and hovering over the mountain. I then looked into the sky toward the southwest and saw an object traveling on a path toward our direction. I saw that it was not a commercial airplane because there was no beacon light on it. What caught my eye about it was the fact that i saw a bright burst of light in the sky and then saw it. There were so many different colors of light coming from it. We watched it come even closer to us and noticed that it was wavering in its path looking like it was rising and falling in its movement. The lights ranged from red to blue with no constant pattern that they blinked in. I saw that this object was being followed by what looked like a trail of light that was approximately 2 miles in length. About 10 minutes after watching it move across the sky we observed another object coming from the western part of the sky this object was low enough for me to see an outline and know that it was not man made aircraft, the object was at least 3 football fields in length and had lights that were in the shape of a chevron the colors all varied but were the same on the opposite side, you could not hear any sounds coming from it, only way to know that it was there is to have seen it moving in slowly toward us and then moving toward our local Mountain. All this time that these things are taking place there was some lights hovering in different spots above the mountain and they did not move. I know that these lights are not supposed to be there because they were about 1000' above the mountains highest point. While this is happening my dogs are both shaking and growling at whatever this was. We all lost sight of the objects when the last one came to a very abrupt stop and vanished like it went behind a star. There was the Chevron shaped one, One that was in the shape of a cigar that had 4 blue lights on it, the next was in the shape of a triangle that had purple and yellow lights coming from it, and the last object that vanished into thin air was a round shaped orb that was solid orange. I was feeling fine before all this happened when i woke up this morning i was not feeling well at all. I am not going to give this location to anyone unless they can prove to me who they are."]}