{"Summary":"Multiple red lights in the sky at night. Went diffrent directions at diffrent times. Sometimes hivering and slowing down or speeding up.","Object Shape":"Circle, Star-like","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/39366.html.txt","/var/www/straped/mufon/org/39366.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.960222,+-82.778939(39366)&iwloc=A&hl=en\"> mufon case (39366) map </A>","Tags":"City","Viewing Distance":"Over One Mile","Latitude":"32.960222","Weather Factors":"Unknown","Object Features":"None","Date Submitted":"06/15/2012 04:57 UTC","Region":"Georgia","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Sandersville","There was one other sighting in Sandersville on or around June 13th 2012"],"Source":"MUFON","Object Flight Path":"Path with directional change","Country":"United States","Log Number":"US-06152012-0009","City":"Sandersville","Longitude":"-82.778939","Date of the Event":"06/13/2012 10:25 UTC","Case Number":"39366","divs":["Sighting DetailsI was in my front yard letting my dogs out to do their nightly duties. And i looked up into the sky to see the stars and i thought i noticed somthing strange. so put the dogs back in the house and at that time my 14 yr old daughter came inside and told me \"The lights are back.\" (we have seen these lights before). So we went outside to see 6-10 glowing and blinking red lights in the sky. They started off in a straight line for aprox 1 min before scattering into diffrent directions at the same time. Then we continued to observe them in the sky for aprox 45 mins. Their movements seemed very random and irradict. Some would hover slowly then shoot off at very high speeds, changing direction with out notice. While others would move slowly and then suddenly dissappear. This started around 10:25 pm and my husband and i watched them untill a little after 11 pm when we got tired and came inside. My daughter and her friend continued to watch foe another 20-30 mins at which point they came in. When they came inside the lights were still present in the sky."]}