{"Log Number":"GT-06152012-0008","Date Submitted":"06/15/2012 02:56 UTC","Latitude":"15.785641","Date of the Event":"06/12/2012 12:31 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsAt June 12 i started takin picture randomly from different point of views from my yard since june 11....and i took various pictures but i start taking out the ones that are obviously birds or planes but i kept the ones that i consider to be irregular like the ones i attached. when i took the pictures i didnt saw directly the objects since i was taking pictures randomly as i told you from different angles and zoom angles when i downloaded to my computer I saw this pictures to be irregular probably you can explin them or probably not.......pic ufo7 clear and ufo11 clear are the most that im interested and pic ufo1 and ufo6 probably i took some real ufos without noticing it. p.s. probably you can analyze this pics and decide if they are real or some explain can be given to them. I took them with a digital camera Lumix 4x that days were clear and i make sure that it wasnt birds or planes flying around....if they were i didnt take pictures only when i realize that it was clear to take one randonly, with different zoom angles."],"Sighting Duration":"Undisclosed","City":"Guatemala","Object Shape":"Unknown","Object Features":"Unknown","Summary":"hovering probably when i took the pics","Source":"MUFON","Case Number":"39365","Region":"","files":["/var/www/straped/mufon/html2text/39365.html.txt","/var/www/straped/mufon/more/39365_submitter_file1__UFO7clear.jpg","/var/www/straped/mufon/more/39365_submitter_file2__UFO11clear.jpg","/var/www/straped/mufon/more/39365_submitter_file3__UFO1.jpg","/var/www/straped/mufon/more/39365_submitter_file4__UFO6.jpg","/var/www/straped/mufon/org/39365.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=15.785641,+-90.227629(39365)&iwloc=A&hl=en\"> mufon case (39365) map </A>","Weather Factors":"Unknown","trends":["There has been one other sighting in Guatemala","There were no other sightings in Guatemala on or around June 12th 2012","This sighting has never been favorited.",""],"Country":"Guatemala","Disposition":"Unresolved","Longitude":"-90.227629","Object Flight Path":"Unknown","Tags":"City"}