{"divs":["Sighting DetailsAt approximately 8:25 PM I was taking my dog out back so she could do her business. As I looked up, something large and green caught my eye. I was very startled and at first, it looked like an orb or fairy light, but then I could tell it was not. It was a neon green sphere that holding your arm out with a quarter, you could cover it up, and it glowed very brightly like a glowstick. It was hovering over the neighborhood across the street. After hovering for a few seconds it swirled irregularly, zig-zagged, went up and down, slowed down and sped up, all in the same area at a very slow pace. Then, the object came to a hault in the sky and three small white lights (about three times smaller) twirled around above the green light and then all joined together to make a vertical line right above the green orb. Then, it seemed as if they combined, and the green light glowed brighter for a second and then zoomed off to my left. It seemed to stayed in one place and blink in and out about four times and then, it zoomed down below the tree line and did not come back up. My dad had witnessed the end of this and he too, was speechless. I can assure you that this is no hoax, toy airplane, light, or ballon."],"Date Submitted":"09/24/2005 08:25 UTC","Date of the Event":"09/24/2005 08:25 UTC","City":"Harvest","Sighting Duration":"00:02:30","Source":"MUFON","Case Number":"3937","Region":"Alabama","Summary":"Green, Large glowing light, three white lights joined","Object Shape":"Sphere","trends":["There have been 2 other sightings in Harvest","There were no other sightings in Harvest on or around September 24th 2005","This sighting has never been favorited.",""],"Object Features":"None","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.855644,+-86.750832(3937)&iwloc=A&hl=en\"> mufon case (3937) map </A>","Viewing Distance":"101-500 Feet","Log Number":"US-10022005-0005","files":["/var/www/straped/mufon/html2text/3937.html.txt","/var/www/straped/mufon/org/3937.html"],"Tags":"City","Country":"United States","Latitude":"34.855644","Longitude":"-86.750832","Weather Factors":"None","Object Flight Path":"Hovering then path,Path then hovering"}