{"divs":["Sighting Details I have always been interested in aircraft. When I was in school and went to the library I always read Janes Military and other aircraft books. Even at the time of my sighting I could indentify 95+ percent of any aircraft, military or civilian. During summer school vacation my parents would send my younger brother and I to stay a week or two with my grandparents in Wells Maine. I was approx 14 or 15 years old at the time. Their house sat 90 degrees to the road it was on. A small dirt parking lot about 40 ft wide and 100 ft long separated their house from the neighbors. My grandparents house was a two family with a garage attached to the rear of the house. Above the garage was a patio, accessible by the second floor apartment where my grandparents lived. Behind their house was a small field, 150 feet square. Beyond the field was a row of small trees, less than 25 feet tall. Beyond the trees was a water treatment facility under construction at the time. Beyond that was a large salt water marsh several hundred yards wide,a road, beach houses and then the ocean. Many times while at play here I noticed many,many military aircraft coming and going from the north. They were always rather low, less than 5000 ft. Due to their low altitude I always assumed there must be an air force base near by. I saw mostly C 130 cargo planes, but do recall one time seeing a b-1 swing wing bomber, again heading due south right over the house then out over the marsh. On night My grandmother, my brother, and I were just settling in to watch TV. It was around 8pm, but summer time, so it was still kinda light outside. All of a sudden my grandfather could be heard yelling \"HEY, COME HERE,HEY ,HEY COME HERE\" He was out on the patio above the garage. We all went out there, and when I turned to the right and looked there was a saucer shaped craft over the dirt parking lot about 20 feet off the ground. It was about 60 feet away and moving south very slowly. It was about 15 to 18 feet long and about 3 or 4 feet thick. It was a dark flat black color. I could not see any rivets or panels, or doors. the lower half was ringed with thin, almost lazer like lights. Green, Yellow, orange in color, with thicker \"bumps\" in the lines that moved back and forth. It made no sound. Nobody said a word, I could feel every hair on my body standing on end. It's height was even with my line of sight. It just cleared the row of small trees, went out over the marsh, then out over the ocean. Due to its slow speed this took some time. We all went into the house when it was just a dot of light in sky."],"trends":["There has been one other sighting in Wells","There were no other sightings in Wells on or around June 10th 1975"],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/39375.html.txt","/var/www/straped/mufon/org/39375.html"],"Latitude":"43.329543","Summary":"It either was spying on Loring AFB, or came from Loring AFB","Longitude":"-70.570541","Date Submitted":"06/15/2012 08:37 UTC","Case Number":"39375","Country":"United States","Object Features":"Other","Tags":"City","Region":"Maine","map":"<A HREF = \"http://maps.google.com/maps?q=43.329543,+-70.570541(39375)&iwloc=A&hl=en\"> mufon case (39375) map </A>","Date of the Event":"06/10/1975 12:00 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","City":"Wells","Object Shape":"Disc","Log Number":"US-06152012-0018","Source":"MUFON"}