{"divs":["Sighting DetailsI was driving home from having dinner at my daughter & son-in-law's home. I was on a main, well traveled country road about 1 mile from town when I noticed what, at first, appeared to be a red balloon or remote controlled object over some far off houses, although there were no people in sight outside the homes. I slowed down to watch object. As it headed towards me, I slowed down to watch it, trying to figure out what it was and who was operating it. As it was coming towards me, approximately 30ft off the ground, moving slowly, hovering and turning from side to side, I pulled my car over off the road, but parallel with it, so I could watch it go across road right behind my car. As I hung out my car window watching it go over the road above and behind my car, it seemed to hover for about 10 seconds while it turned back and forth like a periscope would on a submarine, I couldn't hear any sound at all coming from it. The shape appeared to be almost like a hollie hobbie bonnet with a BRIGHT white bulb in it, the bonnet was red, red. As it turned, scanning back and forth, kind of watching me?, I did a U turn in the road to continue watching it. It crossed the road and started across a field, as I pulled into the driveway of an old abandoned house to watch it, it suddenly zoomed up and out of sight so fast, that it startled me. Just before I came upon this object, my phone made the noise of shutting off, the battery was charged and the phone had not been used."],"Disposition":"Unresolved","City":"Hillsdale","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/39374.html.txt","/var/www/straped/mufon/org/39374.html"],"Region":"Michigan","Date of the Event":"06/12/2012 10:12 UTC","Viewing Distance":"21-100 Feet","Date Submitted":"06/15/2012 07:50 UTC","Object Shape":"Other","Tags":"City","Case Number":"39374","Country":"United States","Longitude":"-84.631384","Summary":"Slow moving, red w/bright white light inside, turning side to side, hollie hobbie hat shaped, hovered over road behind my car after I pulled over then zoomed away after I did U turn to watch it, went across field, then straight up & disappeared","map":"<A HREF = \"http://maps.google.com/maps?q=41.845452,+-84.631384(39374)&iwloc=A&hl=en\"> mufon case (39374) map </A>","trends":["There have been 4 other sightings in Hillsdale","There were no other sightings in Hillsdale on or around June 12th 2012"],"Weather Factors":"Unknown","Latitude":"41.845452","Object Features":"Other","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-06152012-0017"}