{"map":"<A HREF = \"http://maps.google.com/maps?q=50.821963,+-0.072854(39372)&iwloc=A&hl=en\"> mufon case (39372) map </A>","Object Flight Path":"Path with directional change","trends":["There have been 22 other sightings in Brighton","There were no other sightings in Brighton on or around June 4th 2012"],"Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"06/04/2012 12:00 UTC","Country":"United Kingdom","Region":"","Latitude":"50.821963","Log Number":"GB-06152012-0014","City":"Brighton","divs":["Sighting DetailsI was sitting at my desk by the window in my office, when I leaned back into my chair, and noticed Black dot in the sky. It was traveling in my direction, so I ran into the front room and grabbed my binoculars. My wife and daughters were in there at the time, and asked what I was doing. I then looked thru the binoculars out of the front room window and got a good visual on the object. This is where I swore out loud...the object was flipping over and over, tumbling horizontally??? It was Black, disk shaped with a proud centre. It was very odd! We all ran out to the garden to observe it, and that is when I shot video footage on my mobile phone. The object descended then changed direction and started emitting white lights. flash, then a red glow. The object would stop flipping, then start, it even flipped back on itself whilst maintaining a flight path. This object did not act like a balloon or look like one. We all saw a it through the binoculars. We watched as it disappeared in the distance."],"Object Features":"Dome","Case Number":"39372","Longitude":"-0.072854","Summary":"I first noticed a black dot in the sky,it was only when I looked through binoculars it became more interesting!","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/39372.html.txt","/var/www/straped/mufon/org/39372.html"],"Date Submitted":"06/15/2012 06:40 UTC","Sighting Duration":"Undisclosed","Object Shape":"Disc"}