{"Weather Factors":"Unknown","Case Number":"39384","Region":"Victoria","Object Features":"Unknown","divs":["sighting detailsjust after 730pm on 16th june 2012, i walked out my back yard as my dog was howling and i go to the 1st step and noticed an air plane flying from the south east heading toward the north west toward the airport. it travelled toward the horizon then there was a huge flash of light that filled the entire sky that was really strange. it was an unusual blue greeny color - almost started like a radiation outward of energy like an expanding light that went in all directions... i was shocked\\awed by what i saw and my heart was racing... its like something from twilight zone or the movies... it was quick but bloody enormous! whatever it was it cause the power in my house to go out and come back on... i have one witness to the affects it had on the power...(she was inside) i couldnt help but think immediately the idea of an em pulse but it wasn't an explosion as there was no sound at all and no wind. it definately was not lightning - it expanded outwards... the plane was still visible in the distance... no idea what is was other than unidentified"],"Longitude":"145.151764","City":"Blackburn North","Summary":"Massive Blue Green Pulse of Light in the Sky disrupted Power","Object Flight Path":"Stationary","Object Shape":"Unknown","Latitude":"-37.810329","Log Number":"AU-06162012-0003","Date of the Event":"06/16/2012 07:30 UTC","Date Submitted":"06/16/2012 10:36 UTC","Country":"Australia","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-37.810329,+145.151764(39384)&iwloc=A&hl=en\"> mufon case (39384) map </A>","Source":"MUFON","trends":["There has been one other sighting in Blackburn North","There were no other sightings in Blackburn North on or around June 16th 2012"],"files":["/var/www/straped/mufon/html2text/39384.html.txt","/var/www/straped/mufon/org/39384.html"],"Disposition":"Unresolved","Viewing Distance":"Unknown"}