{"Date Submitted":"06/16/2012 06:31 UTC","Object Features":"Unknown","Case Number":"39388","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.769131,+-117.905654(39388)&iwloc=A&hl=en\"> mufon case (39388) map </A>","Log Number":"US-06162012-0007","Sighting Duration":"Undisclosed","trends":["There have been 17 other sightings in Santa Ana","There were no other sightings in Santa Ana on or around June 15th 2012"],"files":["/var/www/straped/mufon/html2text/39388.html.txt","/var/www/straped/mufon/org/39388.html"],"divs":["Sighting DetailsMy wife, a friend of hers and myself were driving South on Fairview St. in Santa Ana California on the night of June 15, 2012 at 11:15 pm when my wife noticed some odd lights coming towards us in the sky. We pulled off the road at Seventeenth St. to look at them. They were moving slowly over Fairview St. in the opposite direction of our travel. At first there were two then three, then as they approached there were eight in total. They made no sound. They were not in an evenly spaced pattern and were possibly two thousand feet high. Each had what appeared to be bright lights. They did not have the form of helicopters or airplanes. They moved slowly above us and one by one they disappeared above a thin cloud cover. Two other people had also pulled off the road to observe them. I tried to call the local News agency's but got no response. At first I thought they were helicopters but there was no noise and the lights were different. I was reminded of the lights seen in Arizona but they were not evenly spaced. It could have been an Air force training mission but this was not logical over Santa Ana on Friday Night. They were lower than private aircraft are alowed to fly and Having seen many of the TV Shows about UFO sightings I was inclined to wonder if we were actually seeing UFO's. It was very strange. They flew over us, gained altitude over the thin cloud cover and disappeared."],"Date of the Event":"06/15/2012 11:23 UTC","Weather Factors":"Unknown","Tags":"City","Latitude":"33.769131","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Region":"California","Object Shape":"Diamond, Flash","Longitude":"-117.905654","Disposition":"Unresolved","City":"Santa Ana","Summary":"strange lights","Country":"United States"}