{"City":"San Francisco","Object Features":"Unknown","Tags":"City","Date Submitted":"06/16/2012 07:13 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Log Number":"US-06162012-0009","Source":"MUFON","files":["/var/www/straped/mufon/html2text/39391.html.txt","/var/www/straped/mufon/org/39391.html"],"Weather Factors":"Unknown","Date of the Event":"06/15/2012 12:00 UTC","Case Number":"39391","Region":"California","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy friend and I were sitting on my rooftop at 3am on June 15th, 2012. While admiring the city lights, My friend noticed this white light in the sky that was shaped like a circle. The light was ascending diagonally and we witnessed it vanish after about 10 seconds. We then immediately felt a strong energetic presence around and within us. For the next hour we continuously were experiencing full-body chills while trying to communicate and understand what was happening. The chills came in waves in regard to our emotional state and were ignited anytime we tried to communicate with them verbally. We were inside my apartment at this time and felt the entire room fill with this strong presence. Once we acknowledged their presence by stating that we were here with respect and recognizing that this energy was in the room, a sense of lightness would come upon us, but did not leave completely. We both heard static and decided to communicate with this energy via psychic-tarot cards and well as medicine cards. As I began to draw the medicine cards, the 3 that came up were: FEAR, GIVE-AWAY, and MEDICINE WOMAN (we are two females). At that moment we experience a synchronized connection with this energy. I then proceeded to pull cards from my psychic tarot deck and went through the entire deck in a storyline. Certain cards that were significant were: UNIVERSE, AUTHORITY, DESTINY, HARMONY, INTUITION, and AWARENESS. After pulling all the cards, the computer in the room began to beep and the energy began to diminish I pulled a pulled a few more card from the medicine deck and the final card was a jaguar that represent integrity. The energy in the room became still and we experienced extreme exhaustion. The entire experience was about an hour, but felt like 3 hours."],"Summary":"Witnessed a bright white light ascending in the sky and then vanished. Shortly after experience energetic contact for about an hour.","map":"<A HREF = \"http://maps.google.com/maps?q=37.74807,+-122.434662(39391)&iwloc=A&hl=en\"> mufon case (39391) map </A>","Sighting Duration":"Undisclosed","Latitude":"37.74807","Longitude":"-122.434662","Country":"United States","Object Shape":"Circle","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around June 15th 2012"]}