{"Disposition":"Unknown","divs":["Sighting Detailsat approx 0200 hrs jan 10 2001 i officer \"J\" and officer \"M\" witnessed a ufo at the terminal annex federal building USDOJ at 207 south houston st.dallas texas 75201. officer \"M\" observed the object first which was hovering approx 8 feet in the air next to the building. the object was approx 5 inches in diameter spherical,tranlucent and emitting it's own lumination. officer \"M\" advised me of the objects presence and we exited our vehicle to investigate. upon approaching the object it moved in a straight line approx 20 feet to the sw. where it continued to hover..we again approached the objet where it was hovering at approx 5 ft. upon our approach to within 5 feet it elevated to about 8 feet in the air and hovered for an additional 30 seconds. the object had a rotating corce and emitted a bluish light. the object them moved torwards the trees in the dealy plaze area gaining altitude and increasing it diameter to about twelve inches. it then weaved it way throught the trees and shot up into the sky. it became very large at this time continueing far up into the night sky and disappearing. officer \"M\" is uncomfortable talking about the event as it bothers him with regards to his faith. the event was recorded on surveilance tapes but have most probably been recorded over long ago. in our capacity as security for the federal goverment at this location we had never observed any unusual activity such as this before and i am unaware as to anthing like this since. thank you ,\"J\""],"Case Number":"3939","files":["/var/www/straped/mufon/html2text/3939.html.txt","/var/www/straped/mufon/org/3939.html"],"Longitude":"-96.761123","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around January 10th 2001"],"Object Features":"Other","Country":"United States","Source":"MUFON","Latitude":"32.811215","Date of the Event":"01/10/2001 02:00 UTC","Viewing Distance":"20 Feet or Less","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.811215,+-96.761123(3939)&iwloc=A&hl=en\"> mufon case (3939) map </A>","City":"Dallas","Weather Factors":"Unknown","Log Number":"US-08082011-0129","Sighting Duration":"00:02:30","Date Submitted":"01/10/2001 02:00 UTC","Summary":"hovering sphere","Object Shape":"Sphere","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering"}