{"Object Features":"None","Region":"Colorado","Disposition":"Unresolved","Case Number":"39404","map":"<A HREF = \"http://maps.google.com/maps?q=40.170697,+-105.093588(39404)&iwloc=A&hl=en\"> mufon case (39404) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Summary":"One I thought was a star found out not, the other started out bright very bright then dimmed to nothing","City":"Longmont","Latitude":"40.170697","Log Number":"US-06172012-0007","Source":"MUFON","Date of the Event":"06/16/2012 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/39404.html.txt","/var/www/straped/mufon/org/39404.html"],"trends":["There have been 30 other sightings in Longmont","There were no other sightings in Longmont on or around June 16th 2012"],"Longitude":"-105.093588","Date Submitted":"06/17/2012 02:30 UTC","Object Shape":"Disc, Oval, Star-like, Triangle, Other","divs":["sighting detailsthe first one i saw was in the sky for at least a couple hours, was talking to a friend on the phone, then out of no where started to move from its spot in the sky and head north. then just was gone i could no long see it. just happened to look up and watched another moving across the sky heading north and then after a while i was unable to see it as well. the first 3 i saw was like i described above. the fourth one i saw what at first i thought was a plane but then noticed that the blinking lights were not as planes and not in the same location as planes. \"my father was a pilot and flew a lot so i have seen and been around planes day and night\" any who this object would fly for a while and then hover in one spot for a moment and then move again this object was heading west towards the mountains. i then saw it fly towards an amber looking light in the sky and stop and hover and then the amber light that i noticed since i was sitting out side tonight just got really bright and then flashed a couple of times did like a jolt like movement and then just back to normal state and then the other object just flew off and just vanished. the main one that got my attention was when i was looking just straight ahead i noticed in the left corner of my left eye a bright bright white light. i looked to my left to see this rather good size bright light moving across the sky heading north. when i first saw it i would say it was just slightly bigger than a golf ball as it moved north i noticed that it was getting smaller in size and the light was getting dimmer as it went above me. the the light was gone and i saw a shadow type object and it was not round at all i can not explain the shape that i saw, however eventually i lost the ability to see it anymore. this is \"not\" the first time i have seen strange \"objects\" in the night sky here. i have always all my life been a night sky watcher just looking at the stars etc. i started to noticed odd\\strange \"objects\" since jan of 2012."]}