{"Log Number":"US-06172012-0009","City":"Hollister","trends":["There have been 4 other sightings in Hollister","There were no other sightings in Hollister on or around June 12th 2012"],"Region":"California","Case Number":"39406","map":"<A HREF = \"http://maps.google.com/maps?q=36.846249,+-121.375654(39406)&iwloc=A&hl=en\"> mufon case (39406) map </A>","Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/39406.html.txt","/var/www/straped/mufon/org/39406.html"],"Tags":"City","Country":"United States","Longitude":"-121.375654","Date of the Event":"06/12/2012 10:40 UTC","Object Features":"None","Summary":"seen from my back yard. looked like a satellite moving west to east changing direction and getting brighter and dimmer. Not a flair","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsI was in the back yard, looking up at the stars as I do when I am out smoking. I noticed what I thought was a satellite moving from west to East at a fast speed and then changing direction left to right and then it would slow down and stop. It would get brighter and as it moved , would get dimmer. I had trouble following it until it got brighter again. It would seem to move in circles before continuing Eastward. It would slow and speed up at will. There were no planes or any other objects in the area. I have seen many satellites and they move fast and in a straight line until fading out. I have seen bright flairs , so I know the difference. I have seen this object before when I was not looking for it. I was never looking for this sort of thing , but they are curious to see. I watched it for about four minutes until it disappeared in the East. It was, I think in low orbit and under intelligent control. I would like to know what others think this is. Thank-you very much."],"Latitude":"36.846249","Date Submitted":"06/17/2012 03:01 UTC","Viewing Distance":"Unknown","Object Shape":"Star-like","Object Flight Path":"Path with directional change"}