{"Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Over One Mile","Object Shape":"Circle","Longitude":"-94.933868","Country":"United States","Latitude":"32.731087","Region":"Texas","Summary":"2 UFOs Flashed as they traveled the night sky","Object Flight Path":"Path with directional change","City":"Gilmer","Object Features":"Unknown","Case Number":"39408","files":["/var/www/straped/mufon/html2text/39408.html.txt","/var/www/straped/mufon/org/39408.html"],"trends":["There have been 4 other sightings in Gilmer","There were no other sightings in Gilmer on or around June 17th 2012"],"divs":["sighting detailsmichele and i went out to watch the stars last night and caught a few ufos while we were out. i took a compass, cellphone for accurate time, a flashlight, a pen, and paper. 10:18 - spotted an object the size\\shape of a star traveling wsw to ene, solid, no brightness changes, slightly faster than a plane, about 60-deg on horizon to the south 11:16 - moving s=>n almost directly overhead as it passed the tail of the little dipper (not sure if it was little or big dipper), it increased brightness for about 2 seconds as it passed the 3nd and 2nd star in the ladle on the west side about 15% of the distance between these same 2 stars,and dimmed back down continued it's unchanged flight path. 11:23 - another object, same flight path this time it flashed before reaching the 3rd and 2nd stars in the ladle. as it flashed over 2 seconds witness 2 noticed it gradually arced it's path slightly west. 11:31 - a third object made a turn by the handle in the same spot but curved and turned more than any of the other objects. there was no flash from this object. all were silent, about the same size\\average brightness of a star in the sky, we seemed to notice these objects around the same place almost 90deg overhead (we were laying on the dock looking up) and we followed them across the sky until they were too dim to see. we saw planes that night and one meteor that was much larger (3-4x in size) and much brighter (2-3x)."],"Log Number":"US-06172012-0011","Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=32.731087,+-94.933868(39408)&iwloc=A&hl=en\"> mufon case (39408) map </A>","Date of the Event":"06/17/2012 11:16 UTC","Date Submitted":"06/17/2012 08:56 UTC","Weather Factors":"Unknown","Tags":"City"}