{"Source":"MUFON","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Unknown","Case Number":"39402","Log Number":"US-06172012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=41.267142,+-95.964874(39402)&iwloc=A&hl=en\"> mufon case (39402) map </A>","Object Shape":"Sphere","Weather Factors":"Unknown","Date Submitted":"06/17/2012 02:12 UTC","Summary":"saw an orange light just west of radio tower at benson high travel west to east & vanish before it would've went behind a tree. Second orange orb in a month to north of my home","Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path","Date of the Event":"06/17/2012 12:00 UTC","Latitude":"41.267142","City":"Omaha","divs":["sighting detailsi came out of my house at around midnight to smoke a cigarette out front of my house and saw an orange orb just to the west of the transmission tower at benson high school(which is 1 block north of my home) and it was just above(and west) of the highest light at the tower. i ran inside and grabbed my droid bionic work phone with 8mp camera. i shot 2 videos neither one turned out well because i'm not a photographer(saved both to camera). the orange orb appeared to the west and just above the tower but the distance behind it is unknown. it traveled to the east at a fairly moderate rate, just faster than you would expect an airplane to travel. from the time i saw this orb from the time it disappeared was 2 minutes or less it disappeared just before its path would have taken its line of sight behind a tall pine tree across the street. i thought it was odd for two reasons. #1 i live close enough to the airport in omaha where an airplane is obvious at a distance (white\\ red flashing lights) this was distinctly orange(no flashing). #2 i saw a similar object in very close proximity weeks earlier in early evening appear to rise from the city travel north then east before fading out as if a fire was dying."],"Longitude":"-95.964874","Country":"United States","trends":["There have been 83 other sightings in Omaha","There were 2 other sightings in Omaha on or around June 17th 2012","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/39402.html.txt","/var/www/straped/mufon/more/39402_submitter_file1__099.jpg","/var/www/straped/mufon/more/39402_submitter_file2__100.jpg","/var/www/straped/mufon/org/39402.html"],"Object Features":"Undisclosed","Region":"Nebraska"}