{"files":["/var/www/straped/mufon/html2text/39414.html.txt","/var/www/straped/mufon/org/39414.html"],"Longitude":"-74.597721","map":"<A HREF = \"http://maps.google.com/maps?q=40.629323,+-74.597721(39414)&iwloc=A&hl=en\"> mufon case (39414) map </A>","Source":"MUFON","Latitude":"40.629323","Object Features":"Unknown","Weather Factors":"Unknown","Log Number":"US-06172012-0016","Region":"New Jersey","trends":["There have been 2 other sightings in Bridgewater","There were no other sightings in Bridgewater on or around June 17th 2012"],"Date Submitted":"06/17/2012 12:19 UTC","Date of the Event":"06/17/2012 12:00 UTC","City":"Bridgewater","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Country":"United States","divs":["Sighting DetailsI was driving northbound on 287 between the exits for 202 and 76 at around 12:15-12:20 AM. To the left there was a light catching my attention. My first impression was that it was one of those spot lights that establishments frequently put outside to draw attention from a distance, with lights pointing towards teh sky, but then I realized that this wasn't like that at all because the light was coming from the sky, and not pointed towards the ground, but pointed horizontally. It appeared like a light house would, with a two beams of light pointing in opposite directions and spinning from their source, staying 180 degrees apart. The lights were parallel to the ground. This looked like if there was a large light house within the cloud and the beams of light continued to spin at a fixed rate and from a fixed location for the entire time I watched it, which was as I traveled down the highway. The beams of light were illuminated in the sky by the light cloud coverage. The beams of light were very strong and very wide, much wider than search lights typically appear on helicopters, and rotating from their source at a fixed speed and fixed angle. They came from inside of the cloud, and judging by the sky, if its elevation was normal for that type of cloud, the light source must have been a very very large bulb, because the beam of light appeared to be about as wide as a quarter when it passed parallel above my sunroof. After I passed 76 the treeline prevented me from watching it further, but I'm sure it continued."],"Disposition":"Unresolved","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Case Number":"39414","Tags":"City","Summary":"Cloud emitting two beams of lights which moved in a 360 spin like a lighthouse"}