{"Latitude":"43.468783","Country":"United States","Viewing Distance":"Unknown","Summary":"The object started off as an odd colored red light, It's shape became apparent as it drew closer and flew overhead. I lost sight of it because of trees.","Date of the Event":"06/16/2012 11:20 UTC","Source":"MUFON","Log Number":"US-06172012-0017","Sighting Duration":"00:02:00","divs":["Sighting Details Two friends and I were sitting outside of the store I manage. (after hours), Just like we always do rain or clear, warm or cold. One friend sat in his car with the door open, legs outside, feet on the pavement. The second friend sat in a plastic lawn chair that we have in front of the store, which he pulled over to sit next to where the first friend was sitting with his car door open. I stooped next to them, since I had grown tired of standing, and didn't feel like sitting on the pavement. Time: approx. 11:30-11:45. Every night we see the occasional plane fly overhead heading into MBS, our local airport. Once in awhile we'll spot the dot of a sat. going by. There are the few times when a helocopter will fly by also. You know, the usual. There was cloud cover, but it was beginning to break up. Temp was warm, with a pleasant breeze. The light caught my eye, and at first I thought it was just another plane, but the color of the light was odd. I said out loud to my friends, \"Well that dosen't look right,\" then stood up to view it better. The parking lot is lit, but not very well. The light had an almost Mars colored glow, maybe a bit more red. There were no other light being emitted from it, steady, blinking, or otherwise. It approached from the south, and moved steadily, and at the speed of an airliner, maybe a little faster. My friend in the chair got up, and suggested that it might be a copter, but changed his mind because of the objects speed, and lack of noise. In fact there was no engine sounds throughout the entire incident. I moved out into the parking lot and turned my back to the lighting of the lot, while keeping my eyes on the thing the entire time. There was only one light coming from the side of a building, so I used my ball cap to block it, which clarified my vision. Once it was nerly overhead, I tried to see if I could see any wings, or other light sources coming from the object, but to my suprise, I saw a clear view of a round, almost egg shaped object flying by. It was directly overhead, and its edges were clearly defined, and I remember saying \"Wait...What the **** is that!\" I knew that I had never seen anything like it before. Experimental aircraft? non Earth aircraft? Don't know. I have never sighted or reported a sighting before. This is a first for me, and a strange enough incident for me to report it. Don't be afraid to contact me, and thank you for your time."],"Disposition":"Unresolved","Date Submitted":"06/17/2012 03:06 UTC","Object Features":"Undisclosed","Object Shape":"Disc, Oval","files":["/var/www/straped/mufon/html2text/39416.html.txt","/var/www/straped/mufon/org/39416.html"],"Longitude":"-83.953485","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=43.468783,+-83.953485(39416)&iwloc=A&hl=en\"> mufon case (39416) map </A>","Object Flight Path":"Straight-line path","City":"Saginaw","Case Number":"39416","trends":["There have been 20 other sightings in Saginaw","There was one other sighting in Saginaw on or around June 16th 2012"],"Tags":"City","Weather Factors":"Unknown"}