{"Longitude":"-65.062266","Source":"MUFON","Region":"Nova Scotia","Disposition":"Unresolved","Date Submitted":"06/17/2012 09:56 UTC","trends":["There has been one other sighting in Middleton","There were no other sightings in Middleton on or around June 17th 2012"],"files":["/var/www/straped/mufon/html2text/39410.html.txt","/var/www/straped/mufon/org/39410.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.949735,+-65.062266(39410)&iwloc=A&hl=en\"> mufon case (39410) map </A>","Object Features":"Unknown","Tags":"City","Case Number":"39410","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date of the Event":"06/17/2012 02:49 UTC","Latitude":"44.949735","Log Number":"CA-06172012-0013","Summary":"Ufo's South facing June 17/2012","Weather Factors":"Unknown","Country":"Canada","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Triangle","divs":["sighting detailsi live in the annapolis valley and saw insane ufo activity last night approximately 3 am june 17\\2012, i saw ufo's bright orange going straight up, straight down, 90 degree turns, always just 'disappearing' into nothing so obviously not a star and no flashing lights, no trails, no sound at all and besides planes don't shoot up straight from the horizon then stop mid air then shoot straight up again, stop...hover. and a chopper would have been heard. anyhoo, one particular orb ship\\ufo seemed to fly up from the ground straight up got very very bright, stopped...and hovered directly below another 'star'. which then became two stars, then 3, one with a white light, original one, then a red light beside it, then a blue or green light it was difficult to tell. they pulsated from left to right white to blue\\green and remained stationary in their position for approximately a half hour or more. i've seen ufo's before but never like last night, which lead me to say 'holy crap how many are actually stars at all and how many are just hanging out?'. i must have seen at least 14 ufos and i've never seen that many in one sighting ever. i was watching south by the way in the annapolis valley facing the south shore."],"City":"Middleton"}