{"divs":["Sighting DetailsOn June 16, 2012 at around 10pm, my brother and I were driving South on Hwy 6, crossing the Grand River in Caledonia when we observed two orange, firelike balls to the South West, over the area of the Old Mill. The balls appeared to be the size of large hot air balloons, but were perfectly round and appeared to be illuminated, the colour of orange fire but not flickering. One object was higher than the other, maybe seperated by 100 yards and at about a 60 degree angle from each other. They were both in perfect syncronization and both travelled North. Another man and his wife pulled over as we did, for some reason, none of us got out of our vehicles. We joked, in an awkward way about 'war of the worlds', but it was very awkward as we were both seriously seeing something we never had seen before. We didn't know what to say to each other. As the objects continued north, they appeared to ascend then became very small, the colour changed to greenish blue then disapeared suddenly. Two more objects came from the South, in the exact same manner as the previous two, and followed the exact same path and, like dejavue, they both disappeared in the same manner. The initial speed would be compared to a small plane, but the ascent was uncomparable to any thing I've ever seen. We seperated from the other two witnesses and immeditatly attended a family function and told everyone what we saw, you can imagine their reaction. They had lots of suggestions as to what it may have been, but honestly, I don't think anyone could ever explain this to me. This weekend is the Hamilton Airshow but there is no plane that looks like or can do what these things did."],"Date Submitted":"06/17/2012 11:48 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/39413.html.txt","/var/www/straped/mufon/org/39413.html"],"City":"Caledonia","map":"<A HREF = \"http://maps.google.com/maps?q=43.073842,+-79.951799(39413)&iwloc=A&hl=en\"> mufon case (39413) map </A>","Object Shape":"Fireball, Sphere","Log Number":"CA-06172012-0015","trends":["There have been no other sightings in Caledonia","This sighting has never been favorited."],"Case Number":"39413","Tags":"City","Latitude":"43.073842","Weather Factors":"Unknown","Object Features":"Unknown","Longitude":"-79.951799","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"06/16/2012 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"Canada","Sighting Duration":"Undisclosed","Region":"Ontario","Summary":"2 orange firelike balls travelled N/B in sky, maybe 100 yards apart, one higher than the other, then ascended and disappeared, followed by two more doing the exact same thing."}