{"trends":["There have been 6 other sightings in Waterford Township","There were no other sightings in Waterford Township on or around June 17th 2012"],"Case Number":"39429","City":"Waterford Township","divs":["Sighting DetailsOk so i've been noticing these singular orbs or more like moving stars some times dim and small sometimes bright and larger possibly due to distance who knows. I've been seeing them in the skies over waterford michigan for the past 3 years, you can see them with the naked eye, i usually yell out to my neighbors and say hey check it out! i've taken a few pictures but they were lost over time with changing phones, i never cared much for the pictures anyway it wasn't that impressive in a picture anyway, most of the time the camera wouldnt pick the light up, and when it did it's not like you could tell what it was, just a ball of light int he sky like you took a picture of a bright sometimes dim star that was close. i have been able to see them on almost everynight that the skies are clear, maybe like 1 or 2 days out of the week i wont see any, probably because i wont stay out longer for 25 minutes usually if i dont see anything right away. They almost always, always travel north, or north east, again maybe 1 or two days out of the week i'll see one travaling south, or just plane west bound. Now the ONLY thing they could be are satellites, if they are not, than it is UNKNOWN. Infact over the 3 years, i've been able to prove to my self that some of them could infact be satellites, using GPREDICT i'm able to track many satellites and i've been also been able to \"possibly\" connect some of these sightings to satellites possibly passing in my overhead sky, all i have to do is look at the approx time and direction their orbits are and try to match it up in GPREDICT, sometimes i come to the conclusion that they could've infact just been satellites. now i'm not a professional and i'm not spending any time on this(other than just looking at the sky, i've recently started using binoculars but thats it) otherwise i'd have more legible and exact time and what not. like i said some of these could be satellites passing over the horizon and when the sun on the other side of the earth hits their reflective surfaces it makes the illusion that its glowing and than dimming after half a minute. Sometimes it's not so simple. Sometimes i'll see one that'll seem to be crusing along at a slow speed even for how far away is, untill it's to far way in space to see, even when you can see the stars around it it just disaperes and than usually approx 4-5 minutes later you'll se another, and in another 4 or 5 minutes you'll see another one, gradually going faster untill you'll see one travaling twice or three times the speed as the slow one you seen approx 12-20 minutes beforehand. Tonight i saw 7 or 8 consecutively mind you just in a small time frame of about from 10:25pm to 11:10pm traveling north and one going north east, the first couple were pretty close together time wise, like you could watch one untill it just disaperes into space and than 3-4 minutes later you'll se another going the same direction, at around the 5th or 6th they started getting 10-12 minutes apart, with the last one i saw moving way faster than any of the previous (who for how far away they look still look like they're moving as fast as a jet, but it looks like they're moving slow cause it's soooo far away) he was moving atleast 4 times that and looked equally as far away, It was very very bright when i first cought sight of it (i was looking north bound and it came over my south) but within 7 seconds as usual it just dims to a dim light, no blinking no nothing, just a hovering star. the only option for these things are satellites nothing else floats around that high up (or higher for all i know they look exactly like stars or moreso like planets because they dont flicker, they just get bright once, and than dim... i've seen maybe 2 or 3 out of 50 in which the same object would get very bright and dim twice with in the .5 minutes you can actually watch it fly across space untill it gets to far or high that the LIGHT CANNOT REACH YOUR EYES ANYMORE, it's not like theyre passing over the horoizon, or a treeline they just straight up get to high up and the light isnt powerfull enough to reach your corneass. IF YOU GUYS AT MIMUFON (or anyone else who wants to watch for that matter ) EVER FIND YOUR SELF IN THE AREAS OF OAKLAND COUNTY AND HAVE A CLEAR SKY LOOK UP, IF YOU WAIT LONG ENOUGH I GUARENTEE YOU WILL SEE ONE OR TWO AT THE VERY LEAST they always almost go north you can see them almost as soon as its dark enough that you can see stars in the sky."],"Sighting Duration":"Undisclosed","Longitude":"-83.363694","Log Number":"US-06182012-0001","files":["/var/www/straped/mufon/html2text/39429.html.txt","/var/www/straped/mufon/org/39429.html"],"Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Object Features":"None, Unknown","Tags":"City","Disposition":"Unresolved","Object Shape":"Circle, Sphere","Latitude":"42.630668","Date Submitted":"06/18/2012 12:18 UTC","Region":"Michigan","Date of the Event":"06/17/2012 11:00 UTC","Object Flight Path":"Straight-line path,Path with directional change,Other","Summary":"orbs, or single balls of light seen in skies for the last 3 years.","map":"<A HREF = \"http://maps.google.com/maps?q=42.630668,+-83.363694(39429)&iwloc=A&hl=en\"> mufon case (39429) map </A>","Viewing Distance":"Over 1 Mile, Unknown, N/A"}