{"Date Submitted":"06/17/2012 10:25 UTC","Summary":"Black circular like object, fast moving, made somewhat high pitched static noise, arrived quickly, hovered for a few seconds, then left.","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-87.345614","map":"<A HREF = \"http://maps.google.com/maps?q=30.37642,+-87.345614(39427)&iwloc=A&hl=en\"> mufon case (39427) map </A>","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around June 17th 2012"],"divs":["sighting detailsi was outside on the side deck of my home stargazing, it was a partly cloudly night, so a fair amount of the light from the city was blocked, and more stars were visible than normal. i quickly caught the object in my peripheral vision and turned my head automatically, thinking it may have been a bat or bird, until it suddenly stopped in midair, i could hear a faint static noise being emitted from it, it floated in place for several seconds, i could not see any motion from the object, a strange feeling fell over me, most likely a mix of excitement and nervousness\\fear that i was actually seeing it. i stood there motionless and silent as i stared. after a few seconds of staying motionless, the object made a semicircular motion, and left the area at an extreme rate of speed, disappearing from the horizon within about a second, maybe a second and a half. though this may be unrelated, the nearby military base is currently closed down to all but the personnel they deem necessary on it over the weekend."],"Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/39427.html.txt","/var/www/straped/mufon/org/39427.html"],"Log Number":"US-06172012-0025","Sighting Duration":"00:00:11","Latitude":"30.37642","Object Shape":"Circle","Case Number":"39427","Date of the Event":"06/17/2012 02:37 UTC","Tags":"City","City":"Pensacola","Object Features":"Unknown","Source":"MUFON","Region":"Florida"}