{"Summary":"A bright yellow light with glowing red bell shaped halo following it","City":"Kansas City","Object Flight Path":"Path with directional change","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around June 16th 2012"],"Disposition":"Unresolved","Object Features":"Other","Date of the Event":"06/16/2012 11:45 UTC","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsAt about 11:45 pm Saturday June 16 observed a bright star-like object in sky, similar in brightness and size to approaching aircraft landing light, only no blinking position lights, approaching from the east-northeast but then turn and continue at an apparent upward trajectory to the south-southwest with a glowing red bell-shaped halo or aura behind it larger than the star-like object, a very distinctive looking object. Thought it may be a small asteroid skipping off the atmosphere except for this directional change. It also seemed to accelerate as it headed south-southwest then flicker out as it was gaining altitude, the trailing red aura went out first then the yellow light dissolved into a thin line of intermittent light then vanished altogether. Before I could get my phone out it was over. It was certainly not an airplane hence this UFO report. My first thought was a missile test or something like it, only nothing was in the news anywhere I could find talking about any rocket launches visible from the midwest at this time."],"Object Shape":"Sphere, Star-like","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"39.270633","Viewing Distance":"Unknown","Region":"Missouri","Log Number":"US-06182012-0004","files":["/var/www/straped/mufon/html2text/39432.html.txt","/var/www/straped/mufon/org/39432.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.270633,+-94.543032(39432)&iwloc=A&hl=en\"> mufon case (39432) map </A>","Source":"MUFON","Date Submitted":"06/18/2012 01:06 UTC","Case Number":"39432","Longitude":"-94.543032"}