{"Date of the Event":"11/26/2003 07:30 UTC","Country":"United States","Object Shape":"Star-like","divs":["Sighting Detailsi had left at 5 am to go deer hunting and wanted to arrive at my stand before dawn. just minutes before dawn, an intense bright red light appeared above the ridge opposite of me no more than two hundred yards. as dawn approached, the light began to dim until, at first light, it disappeared. approximately ten minutes later, after dawn, i heard a loud noise on the ridge in front of me. overcoming my initial shock and petrification at sighting the light in the sky, i raised my 243 rifle and searched the ridge for the source of the noise hoping to spot a deer. instead, i sighted a figure behind a tree leaning out and lookng directly at me. i saw it through my scope very clearly and at first it seemed unreal and then possibly a large bear. but then it moved behind the tree as if it had noticed me. the figure leaned back out slowly and looked at me as i observed it right through my scope. it was at least seven feet tall, pasty grey, and thick like a large built man. its head was large and its eyes were large and dark colored, a solid dark brown or black. its head was not bald but was lined with small tentacle looking things which i find hard to describe. i was horrified and began to cry as the thing continued to look my way leaning beind and out from behind the tree continuously. for twenty minutes we watched one another cautiously at a distance of maybe 100 yards. after twenty minutes or so, i quickly climbed down from my stand which had been twenty feet up an oak tree and ran down the ridge terrified. in my mad dash, i looked behind toward the other ridge and saw the full body of the figure as it watched me retreat to my house. i have never told anyone about this event until this night."],"Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Marion","There were no other sightings in Marion on or around November 26th 2003"],"Object Flight Path":"Stationary","Tags":"City","Weather Factors":"Unknown","Latitude":"35.684013","City":"Marion","Log Number":"US-10032005-0001","Source":"MUFON","Date Submitted":"11/26/2003 07:30 UTC","Region":"North Carolina","Summary":"stared at strange grey figure in the woods through a scope on a gun at 100 yards","Case Number":"3943","map":"<A HREF = \"http://maps.google.com/maps?q=35.684013,+-82.009274(3943)&iwloc=A&hl=en\"> mufon case (3943) map </A>","files":["/var/www/straped/mufon/html2text/3943.html.txt","/var/www/straped/mufon/org/3943.html"],"Viewing Distance":"101-500 Feet","Longitude":"-82.009274","Disposition":"Insufficient Data","Object Features":"Unknown"}