{"Date Submitted":"06/18/2012 01:24 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/39433.html.txt","/var/www/straped/mufon/org/39433.html"],"trends":["There have been 24 other sightings in Grand Junction","There were no other sightings in Grand Junction on or around June 17th 2012"],"Object Features":"Unknown","Date of the Event":"06/17/2012 10:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.1039,+-108.512201(39433)&iwloc=A&hl=en\"> mufon case (39433) map </A>","Source":"MUFON","Sighting Duration":"00:02:00","Object Shape":"Cigar, Sphere","divs":["Sighting DetailsI had just finished watering horses and went into the back yard. I heard a jet and I looked up to locate it, and I saw what I thought was a \"weather balloon\" traveling s.w. to n.e. I was watching it drift in a wind current, then it would hover then start again. It was behaving like a \"weather balloon\" would behave. It moved to the left and I thought it had caught a different wind current. It came back to the right and started back in the n.e. dirrection when it changed it's shape to a cigar shape. I thought for a second my eyes were playing tricks, then it went back to the balloon shape and it looked like a smaller white orb dropped out of it and made a turn to the left and I lost sight of it. I thought o.k. I just saw cottonwood tree fluff floating in the air, but when the second orb dropped out and followed the same path as the first, going left then sort of disappearing I was stunned. I continued watching the \"weather balloon\" a couple of seconds more when the lady I work for called me for help and I had to assist her, so I don't know if the \"weather balloon\" continued in a n.e. direction."],"Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","Case Number":"39433","Summary":"Appeared to be a weather balloon, but then looked like it changed shape to a cigar then back to a balloon shape appeared 2 orbs exited.","Latitude":"39.1039","Region":"Colorado","Log Number":"US-06182012-0005","Longitude":"-108.512201","Viewing Distance":"Unknown","Country":"United States","City":"Grand Junction"}