{"Date Submitted":"06/18/2012 05:27 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.908322,+-87.834974(39436)&iwloc=A&hl=en\"> mufon case (39436) map </A>","Summary":"i seen a big circular object in the sky that seemed to change shape n move above the treeline & then vanish","Viewing Distance":"101-500 Feet","Latitude":"41.908322","Object Features":"Unknown","Disposition":"Unresolved","Case Number":"39436","Sighting Duration":"00:03:00","Object Flight Path":"Hovering then path,Unknown","Region":"Illinois","divs":["Sighting DetailsWell just got out of work and i was pulling out of the gas station. As i was coming up to the intersection i stopped at the light. When i noticed a an object in the sky directly infront of me. The reason i noticed it as much was because it was real real dark and circular and i have never seen that there before. At 1st i thought it was a huge fathersday ballon on top of sears. But then i realized how far i was from sears and that would have to be such a big ballon to see ot at my distance. Then it started to move from right to left. And as i stared at it, it slowly was changing shape. From being just a big circle. It became oval, then it looked like it was just spining in place while it moved. It was just like forming itself as if it were liquid or something. It slowly moved over the forrest preserve from my vantage point and i then lost sight of it. While i was looking at it i was like. Man what is that. Am i the only one looking at this. And when i lost sight of it i wanted to see if i could see it again so i drove down to next busy street and turned to go down that street to head towards the sears where i 1st thought it to be. But i could not find anything in the sky that was remotely like it. Or any were near anything like it. So i drove down the path it was taking but could not see it again. So i was kinda upset i could not get any evidence of it."],"files":["/var/www/straped/mufon/html2text/39436.html.txt","/var/www/straped/mufon/org/39436.html"],"Log Number":"US-06182012-0008","Tags":"City","Object Shape":"Circle, Egg, Oval, Teardrop","Longitude":"-87.834974","City":"Melrose Park","trends":["There has been one other sighting in Melrose Park","There were no other sightings in Melrose Park on or around June 17th 2012"],"Date of the Event":"06/17/2012 07:30 UTC","Country":"United States","Source":"MUFON"}