{"Object Features":"Other, Unknown","divs":["Sighting DetailsAround 10:15 pm, Friday, June 15th my wife and I were traveling south in our car on Highway US 131 in Three Rivers, Michigan. The sun was just disappearing to the west as it was dark to the east. I noticed a bright light object in the sky to my left (east) as I was driving. The immediate thought was to see if the light was from the top of a tower such as a cell phone tower and to see if it blinked like one. The object did not blink and the bright light of the object was moving closer toward us. Then I thought that it might be an airplane since it was moving. I realized that it was not an airplane because it didn't have the small classic lights or blinking lights (red or white) that you see from an airplane in the sky. As the object traveled closer, I realized that the object consisted of a bright fire-like orange glow. I immediately found the closest side street off of the highway and parked my car. My wife stayed in the car but I grabbed my cell phone, got out of the car and walked toward were the UFO was traveling overhead of us. I used my iPhone 4s to take pictures and a video of the UFO. While recording the object in video mode, my wife yelled out to me from the car that another one was coming over the trees. I moved my camera to record the other similar UFO. There were approximately 3 more bright fire-like orange glowing objects traveling across the highway in succession. A total of 5-6 UFO's seemed to be following each other in a pattern of about 30 seconds apart and were about 500 feet or more into the night sky above. I believe that each UFO was about the size of a very small house. The UFO's did not make any sound but just seem to glide effortlessly across the sky. I was simply amazed and in awe of how big and bright they were. Each one of the UFO's flew almost directly over us toward the west and disappeared over the trees and into the clouds. They seem to have come from over the trees and through clouds on the other side (east side) of the highway. This is a first time I've seen a UFO. I showed my Dad the footage I obtained and he told us that that was the same object he saw last year Memorial Day weekend. Although the bright orange glowing UFO my Dad saw traveled downward toward him and his friends and suddenly, at a very high rate of speed, changed directions at about 45 degrees and disappeared into the night sky."],"Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"41.94749","Object Shape":"Fireball, Sphere","Tags":"City","Log Number":"US-06182012-0013","Region":"Michigan","Country":"United States","trends":["There have been 4 other sightings in Three Rivers","There was one other sighting in Three Rivers on or around June 15th 2012"],"Case Number":"39442","Viewing Distance":"101-500 Feet","City":"Three Rivers","Source":"MUFON","Date of the Event":"06/15/2012 10:15 UTC","Longitude":"-85.651581","Object Flight Path":"Straight-line path","Date Submitted":"06/18/2012 01:00 UTC","Summary":"We saw 5 to 6 orange glowing UFO's traveling in a row about 30 seconds apart across the highway.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.94749,+-85.651581(39442)&iwloc=A&hl=en\"> mufon case (39442) map </A>","files":["/var/www/straped/mufon/html2text/39442.html.txt","/var/www/straped/mufon/org/39442.html"]}