{"map":"<A HREF = \"http://maps.google.com/maps?q=35.701731,+-96.880858(39441)&iwloc=A&hl=en\"> mufon case (39441) map </A>","Viewing Distance":"Over One Mile","Case Number":"39441","City":"Chandler","Longitude":"-96.880858","Object Features":"Unknown","Log Number":"US-06182012-0012","Object Shape":"Sphere, Star-like","Latitude":"35.701731","divs":["Sighting Detailsapprox 5:30 am Sunday June 17th driving east on the 44 at least 5 miles from the wellston toll exit traveling at speed of approx 55 miles an hour. It was a clear early morning slightly becoming light out. I noticed in the sky a bright light i could look straight ahead thru the center top of my windshield and see what looked like an aircraft still out at a distance in approach what caught my eye is that it seemed at such a distance still maybe over the chandler area but it was so bright I kept watching it and it didn't seem to be moving either away or towards me like i believed i should notice if it was a plane.It seem to be hovering but slightly bouncing up and down. One of my friends was in the car sleeping in the passenger seat i watched the light for a few minutes and wanted to be sure what i thought i saw before i woke her because i knew if it was a obviously a plane she would just laugh at me. Approx after i have driven another mile i wake her i tell her look see that light she says no i keep pointing till she sees (honestly she sort of likes her sleep so was not as enthused as i was)I ask her what she thinks by the time i look back over she has nodded back off and i feel slightly embarrassed wanting to pull over but feeling a little stupid for showing her so I slowed a little more but didn't want to stop on the highway as i exited the highway i approached the toll i could no longer see the light. I sort of wish i would of just stopped to know for sure myself so now that i am home thinking about it i figured i would contact you. I didn't know where to begin to check local area flights to dismiss it or not so i hope you can help thank you"],"Date of the Event":"06/17/2012 05:30 UTC","Weather Factors":"Unknown","Region":"Oklahoma","Tags":"City","Disposition":"Unresolved","Date Submitted":"06/18/2012 12:55 UTC","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Chandler","This sighting has been favorited 1 time."],"Source":"MUFON","Summary":"Bright Hovering light I-44 approaching Wellston, Ok","Object Flight Path":"Hovering then path","Country":"United States","files":["/var/www/straped/mufon/html2text/39441.html.txt","/var/www/straped/mufon/org/39441.html"]}