{"Object Flight Path":"Other","divs":["Sighting DetailsBeginning on June 14th, I noticed a blinking light in the night sky near the constellation Libra. After a while it blinked again, and I started counting as I watched; for the next hour it made a steady appearance every 12-15 seconds, moving very slowly and somewhat erratically from west to east through Libra. After an hour, sometime around 2200 hrs, I gave up and turned in, but it was still going and had moved perhaps a hand's with across the sky as I watched. The following night I looked again, and the incident repeated itself in a slightly different area, again moving every 12-15 seconds in a generally eastern path through Libra. The same thing happened again Saturday and Sunday evenings, and I'm guessing it will probably make an appearance again tonight. We're graced with very clear skies in Tecopa, California, about 25 miles southeast of Death Valley. Although the flashes of light are not intense, they aren't hard to see once you know where to look. I used a pair of 10X binoculars last night and located the flashes, but they didn't appear to be connected to anything, or it was so distant as to be invisible. Last night I lost sight of the flashes at 2215, so don't know if they went beyond that time on the previous nights."],"Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Case Number":"39452","map":"<A HREF = \"http://maps.google.com/maps?q=36.784661,+-119.415822(39452)&iwloc=A&hl=en\"> mufon case (39452) map </A>","trends":[],"City":"Undisclosed","Log Number":"US-06182012-0023","Tags":"City","Date of the Event":"06/17/2012 12:00 UTC","Region":"California","Country":"United States","Object Features":"Undisclosed","Object Shape":"Flash","Latitude":"36.784661","Summary":"light (or lights) blinked on and off every 12-15 seconds for over an hour, appearing to move very slowly through the constellation Libra.","Date Submitted":"06/18/2012 07:30 UTC","files":["/var/www/straped/mufon/html2text/39452.html.txt","/var/www/straped/mufon/org/39452.html"],"Longitude":"-119.415822","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}