{"files":["/var/www/straped/mufon/html2text/3945.html.txt","/var/www/straped/mufon/org/3945.html"],"Log Number":"US-10032005-0003","Longitude":"-95.495624","Country":"United States","Latitude":"41.023922","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","divs":["Sighting DetailsI HAVE SEEN THEM SO MANY TIMES DURING THE COURSE OF A YEAR.AS FAR AS THE CRAFT GO,THEY FOLLOWED OVER TOP OF MY VEHICLE, LARGE ROUND WITH WHITE ILLUMINATION UNDER CRAFT.SAW HIDING BEHIND A SILO ONCE,ROUND DISC.BEHIND A BARN ONCE,DIDN'T SEE THE CRAFT BECAUSE WAS BLINDED BY A SPOTLIGHT BEFORE IT ZIPPED AWAY.SAW ONCE PASS BETWEEN ME AND A FULL MOON,LOOKED LIKE A GLASS PLATE PASSING BETWEEN ME AND THE MOON.I HAVE ALSO MANY CONTACTS WITH THE BEINGS THEMSELVES.THEY NEVER REALLY COMMUNICATED WITH ME THAT I RECALL IN A WAKING STATE,THEY ALWAYS WATCHED US.THEY SEEMED TO BE HARD TO SEE, BUT YOU COULD SEE THEM BLOCK OUT LIGHT BEHIND THEM.THEIR EYES GLOWED GREEN.I HAVE NEVER HEARD OF THIS BEFORE,HAS ANYONE HAD SIMILAR EXPERIENCES?I HAVE MANY MORE RECOLLECTIONS THAT COULD FILL A BOOK IF ANYONE IS INTERESTED BUT MOST OF ALL I OFTEN WONDER IF OTHERS HAVE HAD THE SAME YEAR LONG VISITS AND IF MY OBSERVATIONS ARE COMMON OR NOT?I THINK THEY TOOK ME PLACES WHILE I SLEPT, I WOULD WAKE UP WITH MEMORIES OF BEING PLACES AND A NEW PIECE OF THE PUZZLED EXPLAINED TO ME.I HAVE HAD MEMORIES ALTERED THAT EVENTUALLY I RECALLED.I BELIEVE A HYPNOSIS SESSION WOULD BE ENLIGHTENING TO SAY THE LEAST.I SWEAR I AM AN HONEST PERSON AND THIS TRULY HAPPENED."],"Date Submitted":"10/01/1999 10:00 UTC","Date of the Event":"10/01/1999 10:00 UTC","trends":["There have been no other sightings in Hastings","This sighting has never been favorited."],"Summary":"MY DOGS WERE BARKING ONE NIGHT, I WENT TO SEE WHAT IT WAS AND SAW AN ALIEN FORM IN MY YARD,THEN IT SCRAMBLED AWAY AT INCREDIBLE SPEED.AFTER THIS THEY SEEMED TO DO A ONE YEAR STUDY ON ME.I HAVE MANY ,MANY EXPERIENCES FIRST HAND WITH THEM.WILL SHARE THESE.","Region":"Iowa","Case Number":"3945","Object Features":"Dome, Window(s), Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.023922,+-95.495624(3945)&iwloc=A&hl=en\"> mufon case (3945) map </A>","City":"Hastings","Sighting Duration":"12:28:31","Disposition":"Unknown","Object Shape":"Disc, Star-like"}