{"Longitude":"-95.911652","trends":["There have been no other sightings in Elk City","This sighting has never been favorited."],"Case Number":"3946","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/19/2003 07:15 UTC","Log Number":"US-10032005-0004","Object Flight Path":"Stationary","Sighting Duration":"00:15:00","Summary":"4 golden lights in a row, going out 1 at a time, then back on 1 at a time","files":["/var/www/straped/mufon/html2text/3946.html.txt","/var/www/straped/mufon/org/3946.html"],"Weather Factors":"None","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.289227,+-95.911652(3946)&iwloc=A&hl=en\"> mufon case (3946) map </A>","divs":["Sighting DetailsI was driving a van north on Hwy. 160 toward Elk City, Kansas. We had noticed that the stars were very bright so we were looking at them. I noticed that there were 4 very golden lights to the west, not silver lights like stars. They were not moving, but were stationary. To my suprise, the 1st on the right went out, then a second later the next on the right, then the next, and finally the one on the left. 1-2 seconds later, the first light on the left came back on, then the next, the next, and finally the one on the right. This process went on at least 4 more times before the lights finally went out. As I continued to drive north, the lights were directly over the small country town of Elk City. These lights were not towers, yard or street lights, because there are none out in the rural area. To see the lights I had to lean forward to look out the windshield, meaning if they were towers they had to be Very Tall ones. (Later I re-drove the area in daylight to confirm there are no towers in that area.) There is not a shoulder on the road so I could not pull over to see if stars were visible behind the golden lights. I should add that further to the west, there was another group of 4 golden lights, having the same stationary behavior. One of the passengers told me those were the same type lights he had seen about 3 months earlier, same county, but nearer the very small farm town of LaFountaine."],"Latitude":"37.289227","City":"Elk City","Tags":"City","Object Features":"Unknown","Date of the Event":"02/19/2003 07:15 UTC","Disposition":"Unknown","Region":"Kansas","Object Shape":"Star-like"}