{"Disposition":"Unresolved","trends":["There have been 16 other sightings in Rogers","There were no other sightings in Rogers on or around June 7th 2012"],"Sighting Duration":"00:02:00","Object Features":"Unknown","Region":"Arkansas","Summary":"Out fishin, clear starry night sky, orange fireball enters the atmosphere, dulls into a white star then travels north at speed of plane.","map":"<A HREF = \"http://maps.google.com/maps?q=36.33502,+-94.109637(39498)&iwloc=A&hl=en\"> mufon case (39498) map </A>","City":"Rogers","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Fireball","Country":"United States","Log Number":"US-06192012-0002","Latitude":"36.33502","Case Number":"39498","Date Submitted":"06/19/2012 02:24 UTC","Viewing Distance":"Over One Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/39498.html.txt","/var/www/straped/mufon/org/39498.html"],"Date of the Event":"06/07/2012 12:00 UTC","divs":["Sighting DetailsBuddy and I are out fishin on Beaver Lake about 11pm. I say, \"Hey, you see that....You SEE That!!\" \"Ya, YAA, I can see that! \"Look how bright that is, are you seein that?\" \"Ya I see it\" \"Man, that's a UFO, you done seen yourself a UFO!!\" To the East about 60 degrees up off the horizon (about 2 o'clock)we see a bright orange fireball (looked like it was fireball from a symmetrical round object entering the atmosphere coming toward us). not a fast streak of a meteor, not the big smoky or amorphous billowy burn like the shuttle, not a missile leaving the atmosphere. this started as a small orange point,in a split second got bright firey orange and as big as an pencil eraser held at arms length, way brighter than the stars (like a little orange sun). it was firey at the edges. over the next 5 or 7 seconds it got darker and darker orange and smaller in intensity. as it approached the size of big star, it lost its orange and was now white, bright as a medium star. the object was not moving in any direction at this point, like it was coming straight down at us. when it turned white, it started moving to the north about the speed of a plane, way slower than a satellite, and definitely on a different trajectory. there was a plane in the sky at the same time moving from northwest to southeast at high altitude (could still see lights blinking but couldn't hear it), and the object was going about the same speed. the object continued going north and the light from it slowly faded as it got further away. I spose it could have been space junk, but the white part stayed consistently white (no flux), and didn't look like it was falling or burning at all, it looked like a steady white plane light slowly going north... orange part definitely looked like something entering the atmosphere. maybe if it was space debris or a meteorite it would explain the booms heard in indiana and michigan, maybe even explain the radiation readings!"],"Longitude":"-94.109637","Object Flight Path":"Path with directional change"}