{"Log Number":"US-06192012-0012","Summary":"spotted a sphere-like ufo along a Finger Lake in NY","map":"<A HREF = \"http://maps.google.com/maps?q=42.707287,+-77.377535(39509)&iwloc=A&hl=en\"> mufon case (39509) map </A>","Country":"United States","Tags":"City","Disposition":"Unresolved","divs":["sighting detailsdriving along canandaigua lake,ny to naples, ny it was a bright sunny afternoon around 445pm and i looked to my left over the lake and approximately 200 feet from the road hovering above the tree lines i saw a round sphere about 20 to 30 feet across. it was a very bright metallic color with a glow around the outside of the sphere. at first i thought it was a helicopter but there was no sound it was just hovering there. i reached over on my seat to grab my cellphone to take a picture and when i turned to take the picture it was all the way on the other side of the lake barely seeble and then it disappeared this all took place within 3 seconds. i drove down the road further approximately 1\\8 of a mile looking and when i came to the next area of trees there it was again. it was approx. 2 minutes from the first sighting that i saw this sphere. i do not know if it was the same sphere or a second one. i had the phone in my lap and raised it to take a picture it was still hovering over the trees, as i went to focuse in for the photo, it shot off across the lake again and disappearred out of site within approx. 2 seconds. it has remained in my mind and i constantly have the needy feeling to return to the site. this has not been my first experience of seeing similar crafts. while i had lived in europe i had also seen similar ufo's in various areas."],"Object Shape":"Circle","trends":["There have been 3 other sightings in canandaigua","There were no other sightings in canandaigua on or around October 9th 2011"],"Latitude":"42.707287","Weather Factors":"Unknown","Date of the Event":"10/09/2011 04:45 UTC","Region":"New York","Date Submitted":"06/19/2012 03:33 UTC","City":"canandaigua","files":["/var/www/straped/mufon/html2text/39509.html.txt","/var/www/straped/mufon/org/39509.html"],"Viewing Distance":"101-500 Feet","Source":"MUFON","Object Features":"None","Longitude":"-77.377535","Sighting Duration":"Undisclosed","Case Number":"39509","Object Flight Path":"Stationary,Hovering then path"}