{"Date Submitted":"06/19/2012 10:05 UTC","Sighting Duration":"Undisclosed","City":"Sunnyvale","Longitude":"-122.03478","Object Shape":"Other","Object Flight Path":"Undisclosed","trends":["There have been 4 other sightings in Sunnyvale","There were no other sightings in Sunnyvale on or around October 18th 2011"],"Log Number":"US-06192012-0018","Source":"MUFON","Region":"California","Date of the Event":"10/18/2011 03:20 UTC","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/39515.html.txt","/var/www/straped/mufon/org/39515.html"],"Disposition":"Unresolved","Object Features":"Appendage(s)","Summary":"Greys terrorize me in my own bedroom","map":"<A HREF = \"http://maps.google.com/maps?q=37.37235,+-122.03478(39515)&iwloc=A&hl=en\"> mufon case (39515) map </A>","divs":["sighting detailsi had just went to bed and was dozing off when i was suddenly grabbed and felt a terrible shift in the atmosphere...i felt a paralyzingl bubble that enveloped my body and restricted most of. my movement and motorskills..i could physically see the aura of this energy pulsating around my body ..i was able to move my eyes to the foot of my bed and saw 4-5 non human grey entities..i was shocked and terrified for i had never seen such creatures in my life..they just stood there staring into my soul , owning me , dominating me..then with the precision of a world reknown surgical team, they began to evaluate me..one grey ran his fingertips over my frontal cranium like he was measuring. the being to his right grabbed my right ear and dropped what must have been an implant as i felt it settle deep in my ear canal. a. different grey had a tool in his hand that scared the crap out of me and my cat when he turned it on..imagine ur dentists drill on steroids..he applied the tool to my tooth. there was no pain but a tremendous vibration that shook my body..this team of greys were wearing what seemed like a et gas mask and one of them shouted orders in the most scary\\ancient sounding language i've ever heard...i could not believe how thin their legs were..i thought they had on prosthetics because the diameter around was no bigger than a quarter..they also smelled terrible..when they got what they wanted they faded out just as quickly as they portaled in..my bed was soo hot like it had been microwaved..the aura of energy that surrounded my body was powerful and left risidual effects for a good 3-5 mins...i lay wide awake in my bed trembling after their departure until day light..despite wanting to run for the hills, i was too frightened to do anything"],"Latitude":"37.37235","Weather Factors":"Unknown","Tags":"City","Case Number":"39515"}