{"Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=46.732883,+-94.68093(39510)&iwloc=A&hl=en\"> mufon case (39510) map </A>","Object Features":"None","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsOn Friday, June 14, 2012 myself, father, brother, and sister were enjoying an early Father's Day dinner out on our deck. Around 10:15pm my sister and brother came back outside on the deck and immediate my brother blurted out, \"What the heck is that?!?\" Sitting in my gazebo with my dad I was sure I was going to have to tell him that it was just a plane. It was a cloudy night so you couldn't see any stars or the moon. I bent down to get a better view and off to the west looking I immediately saw 3 hovering orange lights in a triangle formation. The lights didn't move and were as bright as street lights viewed a block away. I knew I wasn't seeing a plane, helicopter, or anything familiar. I quickly exited the gazebo and ran down the deck stairs toward the levy to get a better look. As the four of us ran, I called to my neighbor who was outside with 2 children. All three of them ran over and we watched what we now noticed were 4 orange lights hovering. I tried to record them with my camera phone but as anyone with a camera phone knows that even taking a clear picture of the moon is almost impossible. We watched for a minute as they seem to ascended into the clouds one by one. I'm not sure how long they were present below the clouds but we saw them for about a minute and a half total."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/39510.html.txt","/var/www/straped/mufon/org/39510.html"],"Case Number":"39510","Object Flight Path":"Other","Tags":"City","Object Shape":"Circle","Longitude":"-94.68093","trends":[],"Log Number":"US-06192012-0013","Date of the Event":"06/14/2012 10:14 UTC","Date Submitted":"06/19/2012 04:45 UTC","Source":"MUFON","Latitude":"46.732883","City":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"at least 4 large glowing orange object below cloud cover witnessed by 7","Disposition":"Unresolved"}