{"Summary":"saw object in the sky hovering/w blue and red light circling it object appeared to bounce around the sky.","Object Shape":"Undisclosed","divs":["Sighting DetailsI was at my cabin in northern minnesota with relatives(4 of us) we shut the yard light off to look at the stars and for passing satelites as I looked to the north I saw a bright star(about 10-20 miles away approx) between the trees. at first glance it looked normal but then it moved very abruptly downward then up again. thinking my eyes were playing tricks I pointed it out to my cousin, again it moved. so we moved to the open to get a better veiw then it zig-zaged to the right. by this time my cousins brother and law had joined us. he also saw it move I went to the car for my Binaculars the bright object had a blue and red light circling it, not flashing. we could see planes in the distance passing over it and behind it. knew it wasnt a plane or a helecoptor, thought maybe a weather baloon but there was about a 10 mile an hour wind, and we watched this thing for about 45 minutes it stayed in the same area and looked as if it were dancing in the sky. then it began to move further north but was still visible when we went to bed. we tried to take a picture with a camera and video recorder but it was to far away."],"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Washkish, mn.","This sighting has never been favorited."],"Date of the Event":"10/01/2005 09:30 UTC","Source":"MUFON","Date Submitted":"10/01/2005 09:30 UTC","Country":"United States","Case Number":"3951","Latitude":"48.15613","Region":"Minnesota","City":"Washkish, mn.","map":"<A HREF = \"http://maps.google.com/maps?q=48.15613,+-94.513094(3951)&iwloc=A&hl=en\"> mufon case (3951) map </A>","Tags":"City","Longitude":"-94.513094","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Log Number":"US-10042005-0005","Weather Factors":"Unknown","Viewing Distance":"Unknown","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/3951.html.txt","/var/www/straped/mufon/org/3951.html"]}