{"Object Flight Path":"Straight-line path","Date Submitted":"06/19/2012 05:08 UTC","Object Shape":"Disc","Region":"Magdalena","Disposition":"Unresolved","trends":["There have been no other sightings in Santa Marta (Distrito Turístico Cultural E Histórico)","This sighting has never been favorited."],"Longitude":"-74.20166","Case Number":"39513","Object Features":"None","Date of the Event":"01/06/2008 09:45 UTC","City":"Santa Marta (Distrito TurÃƒÂ­stico Cultural E HistÃƒÂ³rico)","Source":"MUFON","Log Number":"CO-06192012-0016","divs":["Sighting DetailsHello, greetings from Santa Marta, Colombia, South America. From childhood I have been convinced that we planted a seed here and genetically manipulated by beings from other worlds through the ages. I've always been fascinated by the Pleiades and Orion's Belt, do not know why, but I think we come from there. In 2008 I had the privilege of observing an object lens-shaped, reddish in full, no sound, no flashing lights and had traveled with a constant speed from east to west with direction to the Caribbean Sea. Unfortunately I have no photographic record of the event, neither witnesses because I was alone in the apartment, they were all traveling, it happened around 9 pm. What it made me curious is that after 10 minutes, a helicopter Bell 212 type base of the police anti-narcotics, flew over the city with the lights off for more than 15 minutes. On April 22, 2011, a nephew of mine, was taking photographs at sunset in the city of Barranquilla with a cell phone, and was surprised to see in the picture an object with the naked eye saw not, but I believe that emits light own, because they stay in the picture like a shadow (attached shipping the original photo)."],"map":"<A HREF = \"http://maps.google.com/maps?q=11.24725,+-74.20166(39513)&iwloc=A&hl=en\"> mufon case (39513) map </A>","Viewing Distance":"501 Feet - 1 Mile","Latitude":"11.24725","Country":"Colombia","files":["/var/www/straped/mufon/html2text/39513.html.txt","/var/www/straped/mufon/more/39513_submitter_file1__Viernessantoovni.jpg","/var/www/straped/mufon/org/39513.html"],"Summary":"Lenticular object round, reddish, without sound, fully illuminated.","Weather Factors":"Unknown","Sighting Duration":"00:00:40","Tags":"City"}