{"map":"<A HREF = \"http://maps.google.com/maps?q=33.294881,+-111.881029(39523)&iwloc=A&hl=en\"> mufon case (39523) map </A>","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around June 3rd 2012","This sighting has never been favorited.",""],"City":"Chandler","Sighting Duration":"Undisclosed","Object Features":"Other, Unknown","Object Shape":"Other, Unknown","Longitude":"-111.881029","Log Number":"US-06202012-0005","Viewing Distance":"Over One Mile","divs":["Sighting DetailsIt was a hot day approx. 103 degrees with thin cloud cover. I was outside and I looked northwest of my location and saw a group of vapor trails that looked to be angling downward. From what I can see there was at least 10 seperate vapor trails but all appeared to be going the same direction. The best way I can describe these trails would be as if all the objects broke the sound barrior at the same time and same altitude where it leaves a short puff of condensation or as if all objects went through a thin layer of moist atmosphere leaving a trail. All the objects trails were very close to the same altitude. I looked at it for a few minutes and picked up my cell phone and took a picture. The first picture clearly showed all the vapor trails and it looked just like what I was seeing with my naked eye. I then took a second picture making sure this time to include the roofs of the neighboring houses so you can see how large this formation was. What I found odd is that even between the 2 pictures you can see the clouds in the background were moving but the trails stayed close to the same place. You can also tell the trails were below the cloud cover. My best description would be that I saw the rements of a large group of objects that were in a formation... a group all about the altitude, leaving vapor trails of very close to equal length. When I looked at the photos it does appear that some of these objects were of different sizes. The pictures were taken by a Dell Streak 5 cellphone which I do believe has a 5 mega-pixal camera."],"Case Number":"39523","files":["/var/www/straped/mufon/html2text/39523.html.txt","/var/www/straped/mufon/more/39523_submitter_file1__IMG20120603132048.jpg","/var/www/straped/mufon/more/39523_submitter_file2__IMG20120603132034.jpg","/var/www/straped/mufon/org/39523.html"],"Weather Factors":"Unknown","Latitude":"33.294881","Date of the Event":"06/03/2012 01:20 UTC","Summary":"Group of 10 objects leave vapor trail all at the same angle.","Region":"Arizona","Date Submitted":"06/20/2012 02:25 UTC","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City"}