{"Viewing Distance":"501 Feet - 1 Mile","Region":"California","Summary":"Starting at 3:00 am observed a hovering object with bright multi-colored pulsating lights. This made to object brighter and more active than any of the stars and planets visible that night. It hovered for 45 min. then slowly moved to another location","Object Features":"Unknown","Date Submitted":"06/20/2012 01:46 UTC","Log Number":"US-06202012-0003","City":"Modesto","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","Date of the Event":"06/18/2012 03:20 UTC","Case Number":"39521","Weather Factors":"Unknown","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around June 18th 2012"],"Object Shape":"Star-like","divs":["Sighting DetailsUnable to sleep, I was up at 3:00 am PDT, Monday June 18 and looked out the window toward the Southwest, to see a peculiar looking star that was pulsating and emitting multiple colors randomly. These were bright emissions almost like a camera flash but very far away so the object appeared quite tiny. I then looked at the object through our 10 power Nikon binoculars and not only was the object larger but I could also resolve individual light sources as they flashed different colors randomly. I watched the object for 45 minutes and it remained solidly affixed to that spot in the nighttime sky until near the end of my observation when it slowly drifted to a point that was in a somewhat westerly direction and perhaps a lower altitude from the altitude while originally hovering.. This put the object behind some trees, so it was no longer visible to me. While on the stationary hover the object was approximately 45 degrees above the horizon and I estimate that the object was at least a mile away."],"Disposition":"Unresolved","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.651282,+-120.939281(39521)&iwloc=A&hl=en\"> mufon case (39521) map </A>","Latitude":"37.651282","Source":"MUFON","Longitude":"-120.939281","files":["/var/www/straped/mufon/html2text/39521.html.txt","/var/www/straped/mufon/org/39521.html"]}