{"Tags":"City","divs":["Sighting Details Back in 1987 my family went on a camping trip to Laurel Woods Creek Lake in Laurel County Kentucky. The account of the sighting is based on my mother's and stepfather's sighting. I was seven years old at the time and I didn't see the craft myself, but what has happened at that time. I beleive that I had some sort of encounter. The best I remember is that sometime during the night my stepfather claims he had seen the UFO flying around in the nightsky. After several moments the craft came to a hover near we where camped out at. My stepfather quickly woke my mom up and asked her if she wanted to see a UFO. Thinking that he was joking she poked her head out of the sleeping bag and saw the craft that was less than 100 feet away. She described the craft as less than 50 feet in diamater and had an octagon shape to it not the classic saucer shape. It had a silver like color and was metallic more of a glow. She said she only saw the UFO for a few seconds and what happened next scared the crap out of her. A beam of light shot out from the \"veiwport\" and as it shot out it suddenly went back into the craft. Then another beam shot out longer than the first and repeated the same action. She said that she hid under the sleeping bag and prayed to God that they wouldn't take her. She had heard stories of UFOS and never really believed in them because she was a really into church. My stepfather then said that the craft hovered over them for a few seconds then went over to the car that I was sleeping in. I was in the rear seat asleep at the time. The craft then shined down a beam of light over the car and stayed there for over 2 hours. Finally the beam shut off and the craft flew off into the sky."],"Longitude":"-84.266908","Date of the Event":"11/01/1987 12:00 UTC","Case Number":"3953","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/3953.html.txt","/var/www/straped/mufon/org/3953.html"],"Latitude":"37.842503","Log Number":"US-10052005-0001","Object Flight Path":"Hovering then path","Summary":"An octagon shaped craft, silvery metallic color, resembled the Jupiter 2 from lost in space had a similar shaped \"viewport\"","Country":"United States","Disposition":"Unresolved","Object Features":"Window(s)","Date Submitted":"11/01/1987 12:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Other","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=37.842503,+-84.266908(3953)&iwloc=A&hl=en\"> mufon case (3953) map </A>","Source":"MUFON","Weather Factors":"None","Viewing Distance":"21-100 Feet","Region":"Kentucky"}