{"Date of the Event":"10/03/2005 01:22 UTC","City":"Westwood","Longitude":"-121.005793","Region":"California","Log Number":"US-10052005-0004","files":["/var/www/straped/mufon/html2text/3956.html.txt","/var/www/straped/mufon/org/3956.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.306,+-121.005793(3956)&iwloc=A&hl=en\"> mufon case (3956) map </A>","Date Submitted":"10/03/2005 01:22 UTC","Source":"MUFON","Object Features":"Other","trends":["There have been 2 other sightings in Westwood","There were no other sightings in Westwood on or around October 3rd 2005"],"Viewing Distance":"101-500 Feet","divs":["sighting detailsthree friends and i were walking up busy weyburn avenue to jerry's deli for lunch. people looking up and pointing in the sky. there, flying waaaay too low, was a huge gray \"military\" \"transport-type\" american (i assume) jet aircraft banking a hard right over westwood village up and away toward what appeared the direction of the federal building (on wilshire a few blocks away). no planes ever fly this low and in this area - only helicopters which come in and out of ucla medical center - this was obviously wrong. dozens of people on the streets witnessed this, not just us. we tried to keep an eye on it; it banked upward and westward and began heading northerly, banked right and did a complete 180 and headed eastward\\southward (maybe not a complete 180 but opposite direction) at a much higher altitude and then, due to buildings, etc. we were unable to see it anymore. we were truly frightened! scared! my legs were shaking for at least 30 minutes! seemed like a plane trying to head possibly toward federal building which we have always thought could be a possible target since 9\\11, so hence the scariness..... once theory was that it was a waster transport jet for the fires which have been burning, but this plane was nowhere near a reservoir or ocean and nowhere near the fires....plus, the fires were pretty much under control yesterday..... checked on google, local news stations, etc. - nothing! this was just not right! if you can shed any light on this very obvious weird event, i'd be most grateful! lori"],"Object Shape":"Other","Object Flight Path":"Path with directional change","Country":"United States","Summary":"Well, not UFO per se, but NOTHING on the news about this strange obvious huge aircraft flying way too low over Westwood.","Sighting Duration":"Undisclosed","Latitude":"40.306","Disposition":"Unresolved","Case Number":"3956","Weather Factors":"None"}