{"Weather Factors":"None, Does Not Apply","files":["/var/www/straped/mufon/html2text/3957.html.txt","/var/www/straped/mufon/org/3957.html"],"Object Features":"Undisclosed","Date of the Event":"10/05/2005 08:00 UTC","Case Number":"3957","Log Number":"US-10062005-0001","Sighting Duration":"Undisclosed","Summary":"Orange lights over northern california appear, then move away","City":"Concord","Latitude":"37.979448","trends":["There have been 20 other sightings in Concord","There were no other sightings in Concord on or around October 5th 2005"],"Source":"MUFON","Viewing Distance":"Over One Mile","Date Submitted":"10/05/2005 08:00 UTC","divs":["sighting detailsi was on top of a hill in concord, california. looking out at the horizon to the north\\northeast, i could see a bright shining object which appeared orange and far brighter than any star in the sky. i thought it seemed awkward so i kept watching it. suddenly it's light dimmed very low, almost to where you couldn't see it at all, then faded completely about 10 seconds afterward. i thought it was odd so i continued watching the area. i had looked away for a moment, and when i looked back there were three dim \"stars\" slightly to the west of where the first object was seen. they took the shape of what resembled orion's belt. they each alternated in brightness, one minute the left one being brighter than the others, another minute the center one was brightest, for a few minutes. then the center one moved upwards, rearranging their position so that it was higher than the other two. at their brightest, the lights were much brighter than the brightest star in the sky. then, the one on the right dimmed to where it could just be seen, and moved in a horizontal line directly to the east, until it passed out of view behind a mountain. the center one then followed, and the third one followed after the center one had dissappeared."],"Tags":"City","Object Shape":"Sphere","Object Flight Path":"Stationary,Straight-line path","Country":"United States","Region":"California","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.979448,+-122.023073(3957)&iwloc=A&hl=en\"> mufon case (3957) map </A>","Longitude":"-122.023073"}