{"Disposition":"Unknown","Case Number":"3958","Sighting Duration":"00:35:00","files":["/var/www/straped/mufon/html2text/3958.html.txt","/var/www/straped/mufon/org/3958.html"],"Source":"MUFON","Region":"Virginia","Object Shape":"Star-like, Unknown","Viewing Distance":"Over One Mile","trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around October 5th 2005"],"City":"Richmond","Latitude":"37.543615","Country":"United States","Tags":"City","Longitude":"-77.432388","map":"<A HREF = \"http://maps.google.com/maps?q=37.543615,+-77.432388(3958)&iwloc=A&hl=en\"> mufon case (3958) map </A>","Summary":"a light 4-5 times brighter than any star in the NE sky, than would pulse from very bright to dim and stayed in the same place.","Date Submitted":"10/05/2005 10:20 UTC","Log Number":"US-10062005-0002","divs":["Sighting DetailsI took my dog out at the time above for him to use the bathroom for the night, and I could have a cigarette. When I walked around the side of my house and i noticed a bright light in the sky. I at first thought that it was an airplane, but it stayed in the same place and made no noise that i could hear, it was to low to be a helicopter either. As I stood there watching it, it did nothing the first five minutes. Then it started to dim until i could not see it any more. i had taken my binoculars out of my truck by then. After being dark for a minute maybe it started to light up again, and got very bright. At this point i went in the house to wake my wife up, and to get my video camera. The both of us went outside again, and it was still there. It continued to fade from non-existant to 4-5 times brighter than any star in the sky, for another maybe 6-8 minutes. Until my wife got scared and wanted us to go back inside. I was unable to get it on the video camera due to the fact we live at the bottom of a small hill, and at the top are two houses with a street light between the two. The video camera would not pick it up because of that. I was in the marines and was stationed on an airbase, and at night if I am outside I am always looking to the sky. I have never before seen anything like this before, however i have seen two other ufo's in my lfe the last was a couple of months ago and i reported it. I did not report the first one. Also my wife wan not a believer until last night."],"Object Features":"Unknown","Object Flight Path":"Stationary","Weather Factors":"None, Does Not Apply","Date of the Event":"10/05/2005 10:20 UTC"}