{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/39635.html.txt","/var/www/straped/mufon/org/39635.html"],"Date Submitted":"06/20/2012 04:56 UTC","Object Shape":"Circle, Egg, Sphere","Object Features":"None","Log Number":"US-06202012-0016","map":"<A HREF = \"http://maps.google.com/maps?q=36.814339,+-119.692599(39635)&iwloc=A&hl=en\"> mufon case (39635) map </A>","trends":["There have been 20 other sightings in Clovis","There were no other sightings in Clovis on or around June 4th 2012"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Latitude":"36.814339","Region":"California","Case Number":"39635","Summary":"Multiple orb sightings in Clovis, CA","City":"Clovis","Disposition":"Unresolved","Source":"MUFON","Country":"United States","Longitude":"-119.692599","divs":["Sighting DetailsStarting around the night of June 6th, 2012 I have been seeing unexplainable objects in the sky above and near my neighborhood. It started when me and another person were walking our dogs. It was a windy tuesday night with no clouds in the sky. We were walking down a dark road when a bright flickering light caught my eye. At first I dismissed it as a star, but when we continued walking the intensity of the light began to change and then it started moving! I quickly pointed it out to the person I was with and she could not explain it either. I have seen my fair share of satellites and this was not one. We live fairly close to the fresno airport and I have never seen a plane or helicopter behave in this manner and even then, their was no sound coming from it!Once it started moving it was going about 3x the average speed of a plane and headed NE towards the mountains. But the sightings dont stop there. I work outdoors during the day, I was standing near an intersection observing a jet passing over leaving behind a contrail when out of nowhere I am almost blinded by a metallic egg shaped object that appeared probly 700ft over the intersection. At first I though it was glare from the sun on my sunglasses. I moved my head and glasses around a bit, thinking my eyes were playing tricks on me. But this object was just hovering in the same position. It looked like it was emitting alot of light from it. It felt like I was staring at a mini sun. It was hoving for a good 10 seconds and then as quick as it appeared, it was gone. For the next 2 nights I saw the same star-like object as the night before, Heading in the same direction, with no sound coming from it, moving againts the heavy gusts of wind. After that the sightings stopped for 3 days. Then I started seeing the same star-like object almost every other night. In the past 2 weeks I have probly seen it about 10 times, at varying distances, ranging in movement from hovering, to a very fast straight path, to high speed precision turns. The wierdest recent sighting took place with the person who saw the first one with me. We saw the same bright light, make what I can only describe as a rollar coaster motion as it swooped down then arched back upwards and disappeared above the neighborhood not 500ft from us. We determined this thing to be about the size of a small bus. I havent noticed any missing time recently but ever since these sighting began I havent been able to recall a single dream I have had, which is wierd as I normally vividly remember my dreams. A couple mornings I have woken up and been very sore and achy all over, I also noticed a rash like burn that almost looked like a finger tip on the direct center of my chest which was not there when I fell asleep that night. I dont think I was abducted, just thought I would note the strange occurances that have been going on since this started. Sadly I dont have much money right now and have no access to a camcorder, and my flip phones crappy camera dosnt get me very far. I havent really told anyone about these sightings other than the person who has seen some with me, I think most of my friends would just laught me off as a kook! The activity has again quited down for the last couple of days, will be sure to report if I see anything more."],"Date of the Event":"06/04/2012 10:00 UTC","Sighting Duration":"Undisclosed"}