{"Viewing Distance":"21-100 Feet","Source":"MUFON","Country":"United States","Tags":"City","Latitude":"40.896968","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/39634.html.txt","/var/www/straped/mufon/org/39634.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was in the back yard having a smoke about 8.45 pm I saw was a craft round in size. Come over the east mountains It came towards me it was lower then helcopters usally fly. The disc like ufo was probley 100 ft away from me. It then stopped and hovered above me. No sound then this orange light came on and expanded it looked like dimples in the lighting. I called out to my son in law but he didnt come then I ran to the front door and told him to come outside and see this ran back to the back yard. Its still there. My son in law didnt come so I ran to front door and told him to come see. Ran back out it was still right ther above me. But the hugh orange lite was smaller. My son in law came out to see finnaly he said how weird, the orange like smaller. Then it went out and a bubble white light came on it appeared to be like it was in a cloud. A circle cloud and it was in the middle of the cloud. It went north then at a very slow pace."],"Longitude":"-111.861906","Disposition":"Unresolved","Summary":"came slowly over tne mountain then stopped in air. Hovered then hugh orange light expanded look like dimples in the light . tryed to get my son in law to wittness took him about 7 mins to come as it hovered. It was still hoverring when he saw","Case Number":"39634","Date Submitted":"06/20/2012 04:53 UTC","Sighting Duration":"08:45:15","map":"<A HREF = \"http://maps.google.com/maps?q=40.896968,+-111.861906(39634)&iwloc=A&hl=en\"> mufon case (39634) map </A>","City":"Bountiful","Date of the Event":"05/29/2012 12:00 UTC","Log Number":"US-06202012-0015","Object Shape":"Circle","Region":"Utah","trends":["There has been one other sighting in Bountiful","There were no other sightings in Bountiful on or around May 29th 2012"],"Object Features":"Dome, Patterned Surface"}