{"Summary":"2 lights. one started first then the other followed and the 2nd disappeared first..then a few minutes later the first one disapeared.","Date of the Event":"06/17/2012 01:00 UTC","Viewing Distance":"20 Feet or Less","Case Number":"39646","divs":["sighting detailsmy boyfriend and i were outside, smoking a cigarette before i left to go home. it was about between 1230am and 1am. we both were noticing how the stars were more clear than usual because we've had a lot of rain as of late. i looked to the north sky, and pointed out the first object drifting across the sky. then the second one came, what was a star, or i thought before was following the first one. i just stared at it and then the second one disappeared first. then the first one kept going for a good 1 and then was gone too. i was like \"omg finally we saw ufos!!\" my boyfriend brings me back to earth usually and says, \"what if it was a satellite?\" it couldn't of been, it just couldn't of. why would the second one show up and disappear first while the other one kept going? i wish it would stayed out later. i don't live near a swamp but i do live near dfw\\lovefield airports. nothing these lights were anything close to the lear jets or commercial jets. i've seen satellites and those stupid fire lanterns, these were nothing like it. it was amazing."],"Object Flight Path":"Straight-line path,Path then hovering","Weather Factors":"Unknown","trends":["There have been 8 other sightings in Burleson","There was one other sighting in Burleson on or around June 17th 2012"],"files":["/var/www/straped/mufon/html2text/39646.html.txt","/var/www/straped/mufon/org/39646.html"],"City":"Burleson","Object Features":"Unknown","Longitude":"-97.310288","Tags":"City","Region":"Texas","Date Submitted":"06/20/2012 06:25 UTC","Sighting Duration":"00:05:00","Log Number":"US-06202012-0023","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.510225,+-97.310288(39646)&iwloc=A&hl=en\"> mufon case (39646) map </A>","Latitude":"32.510225","Disposition":"Unresolved","Object Shape":"Sphere, Star-like","Source":"MUFON"}