{"City":"St Louis","Case Number":"39665","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around June 20th 2012"],"Disposition":"Unresolved","divs":["sighting detailsi was outside having a smoke, walking around some, when i turned around towards the west and immediately noticed a \"classic\" triangle flying in a normal commercial route to the st. louis airport over south st. louis (when the flights are landing from the west to east). it was initially the relative size of a golf ball at a 45 degree angle, southwest, in the clear sky. it was clearly an isosceles triangle of white lights, but all looked perfectly round and none were blinking. there was a red blinking light in the middle of the triangle. it made no discernible sound, even when there as there little ambient traffic noise when i can normally can hear a commercial plane as well as see it taking that route. after observing the lights\\object for about 5 seconds, the front light shut off! i see many planes who's front landing lights slowly become less visible as it passes by my house getting closer to the airport, but this front light definitely shut off. i could not see a structure, only lights, that appeared to be on a flying craft changing orientation as it was flying by. the normal commercial route is straight as they are flying as they pass my house until i can't see them through trees to the west anymore. tonight the craft banked left as it neared the point i usually can't see the planes continue in their straight course. the \"roundness\" and size of the white lights, the front light shutting off (while approaching an airport for a landing!), then veering away from the airport all prompted me to make this report of an unidentified flying object, but yet i would \"identify\" it as a \"triangle ufo\". i did not notice any other commercial planes on that route this evening."],"Date of the Event":"06/20/2012 10:13 UTC","Object Flight Path":"Path with directional change","Summary":"Triangle flies commercial route over south St. Louis towards airport then veers away","Object Shape":"Triangle","Country":"United States","Sighting Duration":"00:01:00","Source":"MUFON","Region":"Missouri","Date Submitted":"06/21/2012 12:03 UTC","Latitude":"38.562377","files":["/var/www/straped/mufon/html2text/39665.html.txt","/var/www/straped/mufon/org/39665.html"],"Longitude":"-90.249701","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Tags":"City","Log Number":"US-06212012-0001","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.562377,+-90.249701(39665)&iwloc=A&hl=en\"> mufon case (39665) map </A>"}