{"Sighting Duration":"Undisclosed","City":"Lawrence","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.981219,+-95.22655(39673)&iwloc=A&hl=en\"> mufon case (39673) map </A>","Date Submitted":"06/21/2012 01:58 UTC","Tags":"City","Log Number":"US-06212012-0008","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/39673.html.txt","/var/www/straped/mufon/org/39673.html"],"Latitude":"38.981219","Date of the Event":"05/18/2011 11:15 UTC","Summary":"orange orb seen by me then frantic phone call from friend seen 30 mi away 5 min later","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Longitude":"-95.22655","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"39673","Region":"Kansas","trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around May 18th 2011"],"Object Shape":"Sphere","divs":["Sighting DetailsI was at my girlfriend's college graduation open house and an orange orb was seen and caught the attention of a group of five people out in her parking lot including me. This orb was dismissed as a glowing latern and people went back to the event. I knew that it this was not the case. I stayed out and walked away from the parking lot light. I observed the orb start to head east towards Kansas City at a rapid rate. Less than 5 minutes later I got a phone call from a friend in Overland Park a suburb of KC. He said he saw an orange orb that he thought was watching him hovering above his house. He was outside on his back porch. This was strange because we have had a strange experience in rural Missouri if he was seeing what the night before easter 2011. We were going to bed and the room was dark as coal. I noticed shadow figures above us I asked him if he saw what I saw. He said yes and one sarted to hover over him and I saw a shadow almost like a smoke cloud of an alien head with a small chin come at me from above and dissapear like smoke. I yelled to turn on the lights. We drew what we saw on napkins and went to bed again with no night light. Thena red dot appeared on the wall and a white dot later too going in circles after about 3 minutes the lights dissapeared and the room turned to particles like tars and my friend told me to put my finger out and the stars followed my finger like a comet. Soon I asked if it was over and he said yes and we went to bed. Also the shadow figures were aparent throughout the whole experience. It I strange that it was him who called out of all people and so quickly and so far away."],"Weather Factors":"Unknown"}