{"Weather Factors":"Unknown","trends":["There have been 7 other sightings in Richmond","There were no other sightings in Richmond on or around June 21st 2012"],"Summary":"Oval Craft w/three white lights stationary and clearly just inside fast moving clounds. Observed for several minutes but gone when I returned.","Longitude":"-122.329997","Object Shape":"Oval","divs":["Sighting DetailsSF Bay Area - I stepped out on my patio at approximately 0125 hours Pacific time and was just looking around the sky since I'm up all night listening to the radio online. I saw what I thought at first was an passenger airplane until I noticed that it was not moving AT ALL. It was just hanging in the sky motionless. I watched it for approximately one minute to confirm it was not moving... then went inside and grabbed my bino's. I got a clear look at a craft which had 3 bright white lights. It was an elongated oval with the 3 bright lights spaced evenly on it. I could make out an outline of the oval as well. I watched it for several minutes with my Bino's and it remained motionless in the sky. The best way that I can describe the lights is as if seeing an auto's headlights thru a slight fog. This allowed me to see the outline of the object without the lights being to bright to do so. The object was dull gray in color. I was amazed at my luck so I went inside to grab my camera or video recorder but both had dead batteries. I was only inside about 30 seconds... I went back outside to see it again and this time it was gone... not a trace. No man-made aircfaft could disappear from the sky that fast. This object had been inside a slight low cloud cover which was moving briskly due to fast cold winds tonight. From where I was, the pan of the Big Dipper was behind this cloud cover and could NOT be seen through it. The cloud cover was there, and moving fast, the entire time I viewed this object... and like I said, the object was slightly inside the clouds but not deep inside because I could see it easily. After going inside for the camera the object was GONE but the clouds were still moving fast. When the cloud cover past completely I could easily see the entire Big Dipper but there was nothing else there that could have been the the craft... so I know for sure it was NOT any star. I will try and fax a sketch of the object to MUFON if it can be arranged."],"Case Number":"39678","Source":"MUFON","Log Number":"US-06212012-0013","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.973054,+-122.329997(39678)&iwloc=A&hl=en\"> mufon case (39678) map </A>","Date Submitted":"06/21/2012 05:50 UTC","Disposition":"Unresolved","Region":"California","Tags":"City","Country":"United States","Date of the Event":"06/21/2012 01:26 UTC","files":["/var/www/straped/mufon/html2text/39678.html.txt","/var/www/straped/mufon/org/39678.html"],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","City":"Richmond","Latitude":"37.973054","Object Features":"Undisclosed"}