{"Tags":"City","Latitude":"40.433792","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Longitude":"-79.696295","Date Submitted":"06/21/2012 09:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.433792,+-79.696295(39679)&iwloc=A&hl=en\"> mufon case (39679) map </A>","City":"Murrysville","Object Shape":"Sphere, Star-like","Date of the Event":"06/20/2012 11:20 UTC","Region":"Pennsylvania","Log Number":"US-06212012-0014","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around June 20th 2012"],"Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/39679.html.txt","/var/www/straped/mufon/org/39679.html"],"divs":["Sighting DetailsMy son and I had been observing many orbs and other unknown flying objects on this very active sky watching night. As we sat with our binoculars in hand we observed a very low glowing orb coming from the west heading east. It's movement was slow and graceful as it headed in our direction. It made no sound and had no structural form other than a glowing circle. As it moved closer it became somewhat brighter. Approximately 2 minutes of observance had passed at this point. My son then ran in to tell my boyfriend to come out to see the low flying object. Approximately 1 more minute had passed during this time. I continued to observe the object with my binoculars. They returned and we watched as the object slowed down and then became extremely brilliant in brightness. At this point the object was directly over our home. I am not a good distance estimator but I will say it was flying at the same height that a hot air balloon might fly at. Another minute passed and then the object (which had almost come to a complete stop at this point) began to move quickly toward the east dimming as it quickly sped away and then suddenly disappeared. It was amazing. I had goose bumps my son's heart was racing in excitement and my boyfriend was in awe."],"Case Number":"39679","Object Features":"None","Summary":"A glowing light flew toward my home in a gentle glider-like movement got extremely bright over my home then quickly flew away, dulled and disappeared","Source":"MUFON","Country":"United States"}