{"Log Number":"US-06212012-0007","Viewing Distance":"Unknown","Object Features":"None","Date of the Event":"06/20/2012 10:30 UTC","Object Shape":"Fireball, Triangle","Latitude":"42.986576","Region":"New York","Date Submitted":"06/21/2012 01:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.986576,+-78.891102(39671)&iwloc=A&hl=en\"> mufon case (39671) map </A>","Tags":"City","trends":["There have been 7 other sightings in Tonawanda","There was one other sighting in Tonawanda on or around June 20th 2012"],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Case Number":"39671","Source":"MUFON","Disposition":"Unresolved","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAt 10:30pm myself and another person witnessed a red triangle with orange center appear from the southwest horizon in the direction of the Niagara River it continued it's path heading northeast flying straight above us while sitting out back on our deck. The craft itself made no noise except for the hum of wind catching it and gained no altitude. As it grew closer the triangle seemed more curved almost oval but the color remained the same however the center seemed to be pulsating as well, where as before it seemed to steadily glow. The structure of the object seemed solid almost like a neon light filled with fire. After continuing northeast it gained altitude, perhaps even speed and marginally changed course east about a mile or two from where we were. The whole occurrence lasted roughly two minutes and we were able to catch a photo on a droid cell phone however the speed of the object and the camera's quality didn't capture anything near the image we witnessed. We were a bit excited so we decided to stay outside. After an hour of watching the sky we noticed a triangular bright light flying what would be below cloud coverage and noticeably higher than the first object. This triangle did not change shape it appeared from northwest in the direction of Grand Island and kept a straight path for about 30-40 seconds when the lights dimmed and then went out completely though we could still see the grey triangular shape as it kept the same course out of sight."],"Longitude":"-78.891102","Summary":"Two ufo's sighted with in hour apart.","City":"Tonawanda","files":["/var/www/straped/mufon/html2text/39671.html.txt","/var/www/straped/mufon/org/39671.html"]}