{"Viewing Distance":"Unknown","Object Shape":"Egg, Sphere, Star-like, Triangle","Region":"California","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.136098,+-122.127087(39688)&iwloc=A&hl=en\"> mufon case (39688) map </A>","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"06/21/2012 05:26 UTC","divs":["Sighting DetailsIt was a moonless night, and I was out sky watching with a friend between 10pm-3am. There appeared to be a lot of satellites traversing the sky, I counted more than 20, but only a couple of them traversed the sky in a straight and unwavering path as satellites do. We both had green laser pointers to point them out to each other, when suddenly one of the dim \"satellites\" I had pointed to flashed brightly back at me and stopped its forward motion. Thinking it was a fluke, I shone the laser back at it, and it again flashed brightly back. Did this several times, and each time the object flashed back at me, and then dimmed to where it could not be seen. Saw one very bright egg-shaped object just over the foothills near Hogsback, traveling south at a slow speed. Flashed the laser at it, it sped up. Flashed again, and it turned east and traveled very quickly out of sight. Many more of the objects either did not react or did not keep a straight pattern of flight or constant speed when hit with the laser. Several just went dark and unseeable. Saw a triangle of 3 lights over the western foothills. Two lights white, one light changing slowly from red to green to white. Big round lights, no rays like is usual with aircraft lights. It would travel a ways, make a banking turn right or left, travel a ways, come back, circle again. Did not have the laser light to see if it would react--this was on a different night around June 12. Devlin, call me. I lost your number and email addy. We really should talk...."],"Summary":"Multiple sightings of sentient and reactive lights in the sky","trends":["There have been 6 other sightings in Red Bluff","There were no other sightings in Red Bluff on or around June 18th 2012"],"files":["/var/www/straped/mufon/html2text/39688.html.txt","/var/www/straped/mufon/org/39688.html"],"Log Number":"US-06212012-0021","Latitude":"40.136098","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-122.127087","Case Number":"39688","City":"Red Bluff","Disposition":"Unresolved","Date of the Event":"06/18/2012 12:00 UTC","Object Features":"Unknown"}