{"Viewing Distance":"Unknown","divs":["Sighting DetailsWhile inside my friends apartment I noticed the time was 1:11pm. The tv and radio as well as the internet began to go crazy. I had the urge to go outside. I waited a few more minutes and then listened closely for the sounds of jets or airplanes flying by. The sound was very loud so I knew that it was no airplane. I finally walked outside and looked up to see where the noises were coming from. I could not see what had just passed but the next sound was louder than the first. I saw a triangle shpaed metal object flying very fast overhead. I asked my friend to come outside and witness. He ooked up and immediatly was amazed at what we were seeing. He then ran inside to get his sunglasses and noticed a bright circle with pinkish like fog or haze around it. We observed in total 5 metal triangles. It was very cloudy today which is no accident I assume and found it very difficult to see where they disappeared to. The noise immediately vanished after 5-10 seconds.I observed a very puffy cloud that looked like a \"turtle being stood on\" raise up into another smaller turtle then float up more into a smaller yet fluffier cloud. It looked like the funnel from the movie Thor raising above the last cloud."],"trends":[],"Object Flight Path":"Straight-line path","Longitude":"-79.01661","Case Number":"39689","files":["/var/www/straped/mufon/html2text/39689.html.txt","/var/www/straped/mufon/org/39689.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.765723,+-79.01661(39689)&iwloc=A&hl=en\"> mufon case (39689) map </A>","Object Features":"Unknown","Date of the Event":"06/21/2012 01:11 UTC","Weather Factors":"Unknown","Summary":"Jet-like noise in sky. 4-5 things flew by. I saw a triangle like jet making no sound just coasting flying very fast.","Tags":"City","City":"Undisclosed","Source":"MUFON","Latitude":"35.765723","Date Submitted":"06/21/2012 05:30 UTC","Object Shape":"Triangle","Log Number":"US-06212012-0022","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"North Carolina"}