{"City":"Albuquerque","Tags":"City","Date of the Event":"08/18/1996 12:00 UTC","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around August 18th 1996"],"Date Submitted":"06/21/2012 02:04 UTC","Case Number":"39686","Summary":"Gigantic black triangle, lights on each corner black out stars in clear sky.","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/39686.html.txt","/var/www/straped/mufon/org/39686.html"],"Log Number":"US-06212012-0020","Object Features":"Unknown","Latitude":"35.090971","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=35.090971,+-106.647197(39686)&iwloc=A&hl=en\"> mufon case (39686) map </A>","Longitude":"-106.647197","Source":"MUFON","divs":["Sighting Details1. I was living in Albuquerque around Tramway and Academy. I was out in the backyard and it was a clear starry night. 2. I suddenly had an urge to look up and notice the object. 3. I thought it was an alien spaceship. 4. It was a gigantic triangle appearing to be as big if not bigger than a football field. The craft had a bright light at each corner. It flew right over me very slowly not making a single sound. It was flying in a straight trajectory from south to north until it was out of sight. 5. I felt amazed and in awe of this craft. I watched it for about a minute ran inside were my family was watching T.V. and excitedly told them to come outside to see the craft. They blew it of so I begged my mother to come outside she did I pointed at the object and said what is that? She said she had no idea watched it for about a minute and went back inside. 6. It slowly cruised out of sight to the north. There was another sighting when I was about 10 or 11 years old of a blue tear drop shaped object that was stationary in the clear night sky and then disappeared and reappeared over the Sandia mountains about 15 miles away in the blink of the eye"],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Region":"New Mexico","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}