{"Country":"United States","City":"Myrtle Beach","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/39684.html.txt","/var/www/straped/mufon/org/39684.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.653811,+-78.887628(39684)&iwloc=A&hl=en\"> mufon case (39684) map </A>","Viewing Distance":"Unknown","Latitude":"33.653811","Source":"MUFON","Object Shape":"Star-like","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-78.887628","Log Number":"US-06212012-0018","Summary":"Flickering orange-red orb/light that split into 2","divs":["Sighting DetailsWe were sitting on the balcony of our hotel on the beach at approximately 10pm when my daughter saw an orangish, red light in the sky above the ocean. There were four of us there and at first we didn't see the light when she pointed to the sky but then it reappeared a few seconds later and all four of us saw it. It resembled a star although it was orange-red instead of white and brighter than the stars. It seemed to flicker and almost \"burn out\" and then would reappear in the same spot. It resembled a flare but it stayed in the same place and didn't appear to be moving. It appeared and disappeared in the same spot for what seemed like about 2 or 3 minutes. After that time, it reappeared to the right (what looked like quite a far distance from the original position) of where it had originally been and then split into two lights. Then the lights then disappeared. There were no planes in the area while we saw the lights, but soon after the lights disappeared a couple of planes flew into the area to land at the airport nearby. We were out for approximately another 30-45 minutes and didn't see the lights again. Unfortunely we only had a camera phone and it was dark so we couldn't get any pictures that would show the object(s) we saw."],"Date Submitted":"06/21/2012 01:13 UTC","Case Number":"39684","Weather Factors":"Unknown","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around June 14th 2012"],"Date of the Event":"06/14/2012 12:00 UTC","Object Flight Path":"Stationary,Other","Region":"South Carolina","Tags":"City"}