{"Tags":"City","Object Flight Path":"Path with directional change","Country":"United Kingdom","Latitude":"53.414194","Viewing Distance":"Unknown","Date of the Event":"06/17/2010 08:33 UTC","Date Submitted":"06/21/2012 05:42 UTC","Region":"England","Summary":"cigar shaped ufo over old swan/dovecot liverpool","Weather Factors":"Unknown","City":"Liverpool","trends":["There have been 17 other sightings in Liverpool","There were no other sightings in Liverpool on or around June 17th 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsUp until late 2010 I worked in a shop located on Prescot Road in the Old swan district of Liverpool. I commuted by bus daily, on the number 60, and got off on Derby lane to walk the quarter of a mile to my work. The day in question was warm and the sky was clear blue, i cannot recall seeing a cloud. That morning I walked down the road and crossed over the road and walked past the masons pub, as I approached the bus stop by the Nationwide bank I noticed a number of people at the bus stop ( a man,a woman and about 4 school kids)all looking in the direction of the block of flats called baden house. One of the young lads had his mobile phone out and had it pointed up toward that way, I followed their gaze and saw in the distance a cigar shaped craft which was stationary,It looked like it was about a mile away and in my vision was about the size of a grain of rice, I don't know how big that would make it? The craft looked solid and was dull grey in colour but looked like it was reflecting the suns light off part of it. I walked toward the man at the bus stop and asked him \"you see that!\" . He looked at me and nodded, I looked back and the object was moving slowly to the right, I suddenly thought about getting a video on my phone, I reached into my pocket keeping my eye on the craft, almost the same instant I pulled my phone out of my pocket the craft which was still traveling left to right suddenly shot at an impossible speed back left until I lost sight of it as the buildings obstructed my view. This caused a great deal of excitement to everyone who had seen it, and I left the people at the stop to walk fast in the direction of my work and to see if i could see anything further down the road. I got to my place of work but could see nothing. I scoured the papers and internet for any mention of what happened but was shocked to find nothing despite the road being very busy at the time, and I knew at least 6 other people had seen the same thing!"],"Object Features":"Unknown","Source":"MUFON","Log Number":"GB-06212012-0023","Case Number":"39690","Sighting Duration":"00:00:20","Disposition":"Unresolved","Longitude":"-2.907765","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/39690.html.txt","/var/www/straped/mufon/more/39690_submitter_file1__UFO2.png","/var/www/straped/mufon/more/39690_submitter_file2__UFO.png","/var/www/straped/mufon/org/39690.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.414194,+-2.907765(39690)&iwloc=A&hl=en\"> mufon case (39690) map </A>"}