{"Tags":"City","files":["/var/www/straped/mufon/html2text/39696.html.txt","/var/www/straped/mufon/more/39696_submitter_file1__UFO6212012.jpg","/var/www/straped/mufon/more/39696_submitter_file2__UFO6212012cropped.jpg","/var/www/straped/mufon/org/39696.html"],"Viewing Distance":"Unknown","Date Submitted":"06/21/2012 09:57 UTC","Log Number":"US-06212012-0029","Object Shape":"Bullet, Missile, Cylinder","divs":["Sighting DetailsWe have noticed this object flying by over our house about the same time each time we have seen it. It's very bright as if the sunset is reflecting off of it however if it was a plane you should be able to see the wings. Well tonight we saw it again. One went over our house, same flight path as others we've seen, no sound, no visible wings, appears to have red on the surface. One flew over then we looked up and saw another one heading our way. Same flight path as the first. I ran got my camera and took a pic. The object focused very well in camera but blurred before I could get a snapshot. It was sliver, no wings, no obvious windows or tail, or trail. It had two groved areas around the middle like the belly was groved or dipped inward. This is where the red color was from. As it passed over our roof we ran to the front yard to try to catch it and get another pic but it disappeared. Very clear blue sky at about close to sunset is when we saw it and have seen them each time."],"Region":"Alabama","Summary":"2 object flying one behind the other no sound, no wings, sunset reflecting off of them, took pic with camera, object very silver, groved center, no wings","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Latitude":"32.467544","Country":"United States","Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Prattville","Date of the Event":"06/21/2012 07:50 UTC","trends":["There have been 3 other sightings in Prattville","There were no other sightings in Prattville on or around June 21st 2012","This sighting has been favorited 1 time.",""],"Source":"MUFON","Longitude":"-86.453397","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.467544,+-86.453397(39696)&iwloc=A&hl=en\"> mufon case (39696) map </A>","Case Number":"39696"}