{"Object Shape":"Square, Rectagular, Other","Disposition":"Unresolved","Longitude":"-94.536722","Date Submitted":"06/22/2012 12:05 UTC","Latitude":"37.118511","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI'm visiting family in Joplin, Missouri, and Mom asked me to step outside and see a UFO. The sun set about an hour before, and what she pointed out to me was a slow moving, bright star in the South. I figured it was probably a reflection off a satellite, and it disappeared after about 10 minutes. It was moving due East, but it was unremarkable. While watching it, with the binoculars, I happened to see some flashing FAA lights in the North East and when I zoomed in on them another set zoomed across the frame. It was a little frightening, so I stopped and looked with the naked eye, and there was a section of sky kind of ablaze with activity. Once I got some perspective on it, there were 3 sets of FAA lights that seemed to be jets, they went NNW, and then one circled back and headed out of sight in the opposite direction, while the two others took up positions flanking some large lights that were not flashing. Those lights seemed to turn WSW, and they were not flashing. When I zoomed in with 7x35 mm binoculars, there were 3 distinct crafts, they seemed almost like cubes with backlighting that was more prominent on the corners of the craft highlighting the cube shape. My Dad wandered outside, and I hollered at my wife to come see the event, so we had 4 adults all seeing the same thing. It was definitely not Chinese Lanterns. They moved similar in speed to conventional jets, but their shape was different, with no apparent wings, and no FAA lights. The entire time there was an apparent roar, but it was deeper in tone than typical fighter jets or even commercial airliners. It seemed to be a very large type of engine, or something operating at very high power. Just as I ran in to post this, the were starting to near the Western Horizon, and the sound was at its loudest. I observed many other typical passenger jets after the sighting, and in comparison to those jets, these were much lower. The cubes were a little larger than the escort jets. The size change when zoomed in with the binoculars was significant, so I take that to mean they were fairly close to me, compared to other jets I observed through the binoculars. The roar was similar to a jet roar, but much deeper and rumbly. It reminded me seeing an F117A flyover at an airshow. The roar was significant enough to get the attention of the kids when they walked outside. The event stood out to me for the following reasons. The initial activity was a bit chaotic, with multiple craft and direction changes. I first thought it was fighter jets training or mock dog-fighting, but then the 3 larger crafts headed in a direct line and two of the jets took up flanking positions, while one zoomed out of sight in the direction from where they originated. They did not follow the same jet paths as any of the normal passenger jet flyovers, and the noise was significantly louder, deeper, and more rumbling than anything else I've ever heard at this location. The attached sketch attempts to capture the size comparison between the cubes and the escort jets. This is how it looked through the binoculars when zoomed in. The shape of the jet was easily discernible. The red wingtip lights were visible, and both white strobes, but the opposite green wingtip was not visible. The cubes seemed to be a yellowish, orangish strong middle glow, with whiter light concentrated at the tips. The light was steady, and seemed to be more of an internal glow instead of distinct exterior lights."],"Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Summary":"3 large illuminated cube-like structures escorted by Jets with FAA lights.","files":["/var/www/straped/mufon/html2text/39712.html.txt","/var/www/straped/mufon/org/39712.html"],"Case Number":"39712","map":"<A HREF = \"http://maps.google.com/maps?q=37.118511,+-94.536722(39712)&iwloc=A&hl=en\"> mufon case (39712) map </A>","Region":"Missouri","Source":"MUFON","City":"Joplin","Object Features":"None","Weather Factors":"Unknown","Date of the Event":"06/21/2012 10:30 UTC","trends":["There have been 11 other sightings in Joplin","There were no other sightings in Joplin on or around June 21st 2012"],"Log Number":"US-06222012-0011","Viewing Distance":"Over One Mile"}