{"map":"<A HREF = \"http://maps.google.com/maps?q=34.525884,+-117.976499(39719)&iwloc=A&hl=en\"> mufon case (39719) map </A>","Country":"United States","trends":["There have been 3 other sightings in Littlerock","There were no other sightings in Littlerock on or around June 20th 2012","This sighting has never been favorited.",""],"Date Submitted":"06/22/2012 07:43 UTC","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Approx 20 round orbs flying around, in and out of cloud formation. One disk shaped object hovering below cloud formation.","Object Shape":"Circle, Disc","Longitude":"-117.976499","Latitude":"34.525884","Date of the Event":"06/20/2012 10:08 UTC","Case Number":"39719","Disposition":"Unresolved","Object Features":"Undisclosed","Source":"MUFON","Region":"California","Log Number":"US-06222012-0017","City":"Littlerock","Weather Factors":"Unknown","divs":["Sighting DetailsI have been documenting geo engineering events for a some time using color and infrared video camcorders along with color and infrared Nikon digital cameras. This is not the first time I have captured these objects. On June 20, 2012 at approx 8:30 am I was taking video and photos of geo engineering events over the Antelope Valley Ca. At approx 10am an unmarked white tanker size jet flying east to west at a low altitude fired 4 explosive chemical charges from it's rear. The charges exploded some distance behind the jet forming a chemical looking cloud formations. Several minutes after this event numerous orbs flew in, flying around, in and out of the man made cloud formations. These orbs are round white objects all appearing to be the same shape and size. I observed the orbs flying, quickly changing directions, hovering, slow movement and very rapid movements. Some of the orbs appeared to be chasing each other in what appeared to be an attempt to keep them away from the cloud formation. I have one color digital photo of the saucer shaped object which was under one of the man made cloud formations. I have color and infrared photos along with infrared video of the orbs. I have many hours of past events involving orbs involved with geo engineering events. I have not had the time to go through all the footage. Every time I do carefully review past video and photos these things are there. I have tried contacting several other groups involved with these events but no one seems to be interested. Thank you for your time. Attached are several photos."],"files":["/var/www/straped/mufon/html2text/39719.html.txt","/var/www/straped/mufon/more/39719_submitter_file1__ChemcloudJune202012072Orbs1.jpg","/var/www/straped/mufon/more/39719_submitter_file2__ChemcloudJune202012072ORBS2.jpg","/var/www/straped/mufon/more/39719_submitter_file3__CHEMCLOUDS06202012001UFO3.jpg","/var/www/straped/mufon/more/39719_submitter_file4__CHEMCLOUDS06202012002UFO3.jpg","/var/www/straped/mufon/org/39719.html"],"Object Flight Path":"Stationary,Hovering then path"}