{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.998875,+-85.98199(39713)&iwloc=A&hl=en\"> mufon case (39713) map </A>","Latitude":"39.998875","Source":"MUFON","divs":["sighting detailsmy wife was outside watering the trees on june 20th 2012 at approximately 9:45 pm. she called to me \"look at this ship, i've never seen anything like this.\" i came outside and witnessed a dark boomerang shaped object located approximately 2000 ft from my home about 1000 ft off the ground. the object appeared to be about 300 ft in width and 150 ft in length. the object was traveling on a heading of 190 degress and passed directly over noblesville airport to our south. when first observed the object made a weird vibrating sound, but no other sounds came from the vehicle. the sound was sufficiently loud to make my dog start barking at the object. the color of the object is uknown but seemed to blend with the evening sky. there were three lights visible on the object. two white lights at each tip flashing in unison and a steady red light under the nose that did not flash at all. the object continued to travel south at a steady rate of speed until it was lost behind trees. no direction change was witnessed. the speed stayed constant. the speed was approximately 90 knots. my wife said she first heard the object pulsating before she saw it. the dog started barking at the object and that is when she turned to look at the object. she said that she knew immediately this was not an airplane and called for me to come and look. a few days before this sighting my brother in-law was staying overnight at our house. he observed two chinook helicopters and an unidentifiable (never seen this type before \\ looked very strange) helicopter that passed right over our house. they were clearly observed as not having any markings and all painted black. they were low enough to make the house shake and windows rattle. approximately 100 ft off the ground."],"Sighting Duration":"00:10:00","trends":["There have been 9 other sightings in Noblesville","There were no other sightings in Noblesville on or around June 20th 2012"],"Date of the Event":"06/20/2012 09:45 UTC","Longitude":"-85.98199","Country":"United States","files":["/var/www/straped/mufon/html2text/39713.html.txt","/var/www/straped/mufon/org/39713.html"],"Case Number":"39713","Region":"Indiana","Disposition":"Unresolved","Log Number":"US-06222012-0012","Object Flight Path":"Straight-line path","City":"Noblesville","Tags":"City","Object Shape":"Boomerang","Viewing Distance":"501 Feet - 1 Mile","Summary":"Traingular Aircraft with pulsating sound and non aviation lights sighted over Noblesville, IN.","Weather Factors":"Unknown","Date Submitted":"06/22/2012 12:52 UTC"}