{"Sighting Duration":"Undisclosed","Log Number":"US-06222012-0010","Object Features":"Unknown","Date of the Event":"06/15/1990 11:05 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.466091,+-80.027156(39711)&iwloc=A&hl=en\"> mufon case (39711) map </A>","files":["/var/www/straped/mufon/html2text/39711.html.txt","/var/www/straped/mufon/org/39711.html"],"City":"Pittsburgh","Country":"United States","Weather Factors":"Unknown","Summary":"Thought we saw 4 meteors was very excited to see them at our vacation cabin","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","Object Shape":"Sphere","Case Number":"39711","divs":["Sighting DetailsThought we saw 4 meteors was very excited to see them at our vacation cabin. Right after seeing what we thought were meteors about 4 objects were doing figure 8's in the sky. We shined a flash light 30 mins after watching them towards objects(they looked like stars moving at this point) one got very bright at one point and the perception that my father, friend and I it looked like it way heading strait for us. We ran away from the lake at that point. We got half way to the cabin and my friend turned and saw it was no longer coming towards us. These things kept moving very fast. about a hour into it we saw two very bright lights to the right of us over the lake. They seemed to meet together for about 10 mins (no notice) seemed small yet close to us at the time(half a mile out in the center of the lake). After 10 mins they took off at a great speed and nothing was seen after that. weather:clear sky:open no trees over a lake I was about 14 years old at the time. Just learned of this website today. We have carried this event with us for many many years."],"Latitude":"40.466091","Date Submitted":"06/22/2012 12:05 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-80.027156","trends":["There have been no other sightings in Pittsburgh","This sighting has never been favorited."],"Region":"New Hampshire","Tags":"City"}