{"Summary":"bright flash of light, saw reflective object,wobble side to side, then vanished.","City":"Syracuse","Case Number":"39728","Latitude":"43.043212","Log Number":"US-06232012-0003","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"06/16/2012 04:20 UTC","Sighting Duration":"00:00:30","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.043212,+-76.098594(39728)&iwloc=A&hl=en\"> mufon case (39728) map </A>","Region":"New York","Tags":"City","trends":["There have been 20 other sightings in Syracuse","There were no other sightings in Syracuse on or around June 16th 2012"],"Object Shape":"Oval","Object Flight Path":"Other","Weather Factors":"Unknown","Longitude":"-76.098594","Object Features":"None","divs":["Sighting Detailsat 1618hrs on june16,2012 i was in my driveway,just washed my car, i looked up at the sky facing west the sun was below the tree line i was watching a high altitude jet with two contrails ejected from the rear. iwas trying to guess if it was military or a passanger jet and where it was going traveling west the jet was so far away that i was unable to discern any fuselodge or wings. it was at this point that i saw a bright flash of light below the contrails of the jet. i could make out a body shape, it was sort of oval shape with its' front small, roundish then extending and widening out towards the rear. there were no lights, no sound, no visible exhaust trail no structural appendages ie. no wings,no tail wings no tail fin the craft apperaerd in the west but seemed to be traveling south or i should say was wobbling south it wobbled right to left so it wobled away from me then back to me, the object seemed almost out of control and then it just vanished. a couple of minutes passed by after this sighting occured iwas trying to digest what i just wittnessed when i stilll looking up i saw a jet traveling east this jet was approximattely the samme altitude as the ' u f o' i could discern wings, fuselodge, tailwings, and atailfin. ther was no contrail but i could hear the engine noiseof this 3rd. vehicle.. so dear mufon committee, muddle thru this and see what ya think.."],"Date Submitted":"06/23/2012 02:59 UTC","files":["/var/www/straped/mufon/html2text/39728.html.txt","/var/www/straped/mufon/org/39728.html"]}