{"trends":["There have been no other sightings in Jamestown","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.98479,+-85.06301(39725)&iwloc=A&hl=en\"> mufon case (39725) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"06/22/2012 11:52 UTC","Tags":"City","Source":"MUFON","Longitude":"-85.06301","City":"Jamestown","Latitude":"36.98479","Log Number":"US-06222012-0022","Region":"Kentucky","Summary":"3 lights in triangle pattern that brightened twice before slowly fading out.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI went outside around 9pm to check on my cat. I found him sitting under the bird feeder so I turned my attention to the stars. I was looking towards the South-Southwest at Saturn when I noticed what I thought was some extra stars that looked out of place. They were roughly around 0 magnitude. About as bright as the other brighter stars in the sky. As I tried to figure out what I was looking at, the \"stars\" brightened and slightly moved. I then realized that they wasn't stars but 3 lights in a triangle pattern. I said out loud to myself, \"Are you kidding me?\" They appeared to be hovering, but moved slightly. As I watched the lights, they brightened again I'm guessing to around -7 magnitude and then slowly faded out. After the lights went out, I was unable to see anything. The whole thing probably lasted less than a minute, but it's stuck with me ever since. Oddly, about an hour later, I developed a very bad headache. I don't know if this was related to the sighting or not but I never get headaches. And, this one never left till the following day. I've been into astronomy ever since I was a kid. I photograph and video lunar occultations, meteors, satellites, iridium flares and other astronomical objects. I've seen planes, satellites, meteors, just about anything you can think of that would be in the night sky. But, I ain't never seen anything like this."],"Case Number":"39725","Country":"United States","Object Features":"Unknown","Date of the Event":"06/19/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/39725.html.txt","/var/www/straped/mufon/org/39725.html"],"Object Shape":"Triangle","Viewing Distance":"Unknown","Object Flight Path":"Stationary"}