{"Date of the Event":"06/23/2012 04:15 UTC","Summary":"Multiple UFO sightings, precursed by strange aurora like rippling in sky and electronics turning on in household.","City":"Pensacola","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Square, Rectagular, Unknown","Longitude":"-87.296163","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.385182,+-87.296163(39734)&iwloc=A&hl=en\"> mufon case (39734) map </A>","Object Features":"Patterned Surface","Object Flight Path":"Stationary,Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/39734.html.txt","/var/www/straped/mufon/org/39734.html"],"Region":"Florida","Disposition":"Unresolved","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around June 23rd 2012"],"divs":["Sighting DetailsI was in the kitchen making myself an early morning snack, when the coffee pot in the kitchen turned itself on. the unit is not scheduled to turn on, and i checked. about a half minute later, the shop vacuum downstairs turned on, which it has never done before, as well as the main television unit in the living room. after turning off the electronics in the household, i went to check the time on my phone which i had on the counter. even though i had just taken it off the charger in my room, it had shut off, and was refusing to turn on for some reason. i heard an owl outside, or at least i thought it was an owl by the sound of it, i never saw what was making the noise, however, i went outside to check, when above me, i see what i though was the light from a car over my head, upon looking closer, it appeared more closely to four, aurora like ripples across about a quarter of the sky. I had seen something like this on another night where i saw a craft i reported, however, i had discarded this fact as unimportant at the time, thinking that it may have been my mind playing tricks on me, however, after early this morning, i know for certain what i saw wasn't an optical illusion or a case of a mistaken identification. about 5 minutes after seeing the ripple, i spotted the first craft i observed during the early morning, it was a elongated, cigar shaped ufo, flying below the early morning cloud layer at a slightly awkward angle(about 10-15 degrees off from how you'd expect an object of its shape to fly) and it flew in a straight line from the NW to the SE of the horizon, taking about 3-5 seconds to completely cover the distance and vanish beyond my line of sight beyond the treeline. its apparent size was to narrow to be the of a bird or bat, and no wings at all made it have the wrong profile. after another 30 seconds or so, a second object became visible for a few seconds towards the SE of my location, this object appeared to be glowing golden orange, with a deeper golden orange straight line patterning upon its surface. this object in only what i could describe as blinking into sight, the object remained immobile and eerily still for the time it was observable, and just as it had appeared, the object seemed to just blink out of sight. I remember feeling a sense of curiosity and anxiousness, as i usually feel when i observe these kinds of objects, however, i did feel a bit alarmed with the electronics turning on and my cell phone refusing to apparently turn on. After these incidents, i stood outside for a while longer, hoping to observe more phenomenon, as dawn began to break, i went back inside, only to discover my phone was now on with the main screen waiting to be unlocked, as though it had never been turned off. after going through the house a bit more to see if any other devices were having issues, i came to discover the downstairs door, which was locked and dead bolted around midnight, was now completely unlocked for some reason, what relevance this may have to events is unknown. both my mother and father, who live in the house with me, slept through the entirety of these events, and the dogs we have did not bark a single time, even with the shop vacuum turning out right outside their doors. i found this incredibly odd, as usually the slightest noise during the night will put the dogs in a barking frenzy, yet not once during the nights events, did i ever hear a peep from them."],"Latitude":"30.385182","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Log Number":"US-06232012-0009","Date Submitted":"06/23/2012 08:25 UTC","Case Number":"39734"}