{"map":"<A HREF = \"http://maps.google.com/maps?q=29.029669,+-80.919058(39733)&iwloc=A&hl=en\"> mufon case (39733) map </A>","trends":["There have been 9 other sightings in New Smyrna Beach","There were no other sightings in New Smyrna Beach on or around June 23rd 2012"],"files":["/var/www/straped/mufon/html2text/39733.html.txt","/var/www/straped/mufon/org/39733.html"],"divs":["sighting detailsi went out on my patio (i live on the top\\3rd floor of my building) as i could not sleep at about 1:40 am and saw this light in the sky coming towards me that was just over the top of the building across from me. i live on the intracoastal waterway and this object with flashing red and white lights was headed west through the trees on the other side of the water. there was no sound emitting from it and it was traveling pretty fast. as i watched it i thought that cant be an airplane as its flying too low. i have an airport a few miles from me and knew it was not a plane or a helicopter. from what i could tell it was round and not very big maybe 30 feet across. i also noticed dogs barking across the canal from me as it went over the homes there. it passed my building and i did not see it anymore. it was passing through the trees so i knew it could not be a plane. i live exactly 1 mile from the beach and it seemed that is where this object originated from. i wish i had taken out my camera but it passed by too quickly for me to get it,"],"Date of the Event":"06/23/2012 01:40 UTC","Summary":"I was looking at ths sky and saw this lighted object over the top of the 3rd floor buildings","Log Number":"US-06232012-0008","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Longitude":"-80.919058","Case Number":"39733","Latitude":"29.029669","Region":"Florida","Sighting Duration":"Undisclosed","Object Shape":"Disc, Oval","Date Submitted":"06/23/2012 08:02 UTC","Weather Factors":"Unknown","Tags":"City","City":"New Smyrna Beach","Country":"United States","Source":"MUFON","Object Features":"Dome, Unknown","Object Flight Path":"Straight-line path"}