{"Summary":"Sunday night (6/16/12) I watched five objects in the sky that I considered to be UFOs.","Log Number":"US-06232012-0019","Weather Factors":"Unknown","Object Features":"Dome","Tags":"City","Country":"United States","Case Number":"39746","Date of the Event":"06/16/2012 10:25 UTC","City":"Riverside","Sighting Duration":"Undisclosed","Longitude":"-94.613012","Object Shape":"Cigar, Egg, Oval","files":["/var/www/straped/mufon/html2text/39746.html.txt","/var/www/straped/mufon/org/39746.html"],"Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","divs":["sighting details last sunday evening about 10:20 pm (6\\16\\12) my neighbor and her two kids were sitting on her front step looking at the western sky. what they all three saw made her call me and tell me to go look to the west from my yard. my yard ends abruptly at a cliff that overlooks about 3\\4th of kansas city, missouri, all of kansas city, kansas and several small towns up the missouri river north of kansas city. i walked out into my yard and, against a very dark sky at about 10:25 pm, was startled to see a strange formation of reddish\\reddish-white, glimmering objects in the sky about 35 degrees above the horizon. there were four objects that appeared to be moving in trail formation, coming from the north, north-west flying on a heading of perhaps 160-170 degrees, a heading that i decided would take them to kansas city downtown airport. however, when they were almost straight west of me, they each turned, still in trail, and circled to the west, making a wide 360 degree turn until they were back in front of me. they then continued to the south, south-east and went out of sight, disappearing behind some trees. then a fifth object appeared flying the same course, but when it was straight west of me it suddenly vanished, totally disappearing from sight. these objects appeared to be shaped such that they reminded me of two old- fashioned glass telephone insulators joined at the flat part and upright so they seemed more tall than wide. they appeared narrow at the top and bottom and a little fatter in the middle. the color seemed more red at the top and bottom and became more reddish-white closer to the center. unlike the sharply, distinct, rotating beacon, and the more modern strobe lights on an airplane, these objects appeared to be emitting a fuzzy light from all over their surface. they reminded me of five japanese lanterns with the light coming from within the object. the speed of each object was simular to what i would expect of a small airplane, like a cessna 152. maybe the most unusual part of this whole experience was that there was absolutely no noise coming from these objects. they certainly appeared to be close enough that had they been any aircraft that i know of, i would have heard a noise. i have been a professional pilot for 58 years and most of my time was at very high altitudes where the weather was usually nice and clear. in all of my 20,000 plus hours in the air i have never seen anything that remotely resembled a ufo as described in most sightings ... until last sunday night. while flying at high altitudes i have watched satellites go over, but never a ufo. i can remember maybe 30 years ago when pilots were reporting ufo sightings on a regular basis."],"Latitude":"39.177503","Region":"Missouri","Date Submitted":"06/23/2012 07:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.177503,+-94.613012(39746)&iwloc=A&hl=en\"> mufon case (39746) map </A>","Object Flight Path":"Path with directional change","trends":["There have been 2 other sightings in Riverside","There were no other sightings in Riverside on or around June 16th 2012"]}