{"Case Number":"39740","Weather Factors":"Unknown","Object Features":"Window(s)","Longitude":"-79.381024","Source":"MUFON","divs":["Sighting DetailsI was at my appt and it was approximately between 1:30-1:45am on June 23 2012. I heard moaning and thought maybe someone was hurt, but when I looked out my window I saw a couple \"messing around\" down below. I then noticed what looked like to me a shooting star, coming straight down from high in the sky, it was very bright and very fast. Then all of a sudden it stopped, and was hovering above some buildings in the distance. It was not moving forward, backward, or side to side, it was stationary. The lights looked like headlights from a car and as I took a closer look I realized that the lights were moving in a rotating motion. That went on for about 2-3 mins. Then the lights went out but I could still see the object in the sky, it was disc shaped and large considering it was quite the distance away. It stayed in the same spot, did not move and lasted about 2-3 mins. Then the object emitted a large lightening like flash, then it went straight back up in the sky, faster then it came down. I would say it took 20 seconds for it to disappear from my view. I was in shock as i witnessed this, my phone was being charged and I honestly didn't even think to grab it to take a picture. I live in an appt building and I'm about 6 floors up, when I looked at the object it was straight in front of me hovering about 3 feet above where I was."],"Date Submitted":"06/23/2012 02:38 UTC","Disposition":"Unresolved","Object Shape":"Other","Sighting Duration":"Undisclosed","Log Number":"CA-06232012-0013","Viewing Distance":"Over One Mile","Date of the Event":"06/23/2012 01:35 UTC","Latitude":"43.653226","Tags":"City","Summary":"Saw object come straight down from the sky, hovered over buildings, lights turned off, still could see it, then big flash and it went straight up faster then it came down.","City":"Toronto","Country":"Canada","files":["/var/www/straped/mufon/html2text/39740.html.txt","/var/www/straped/mufon/org/39740.html"],"Object Flight Path":"Straight-line path,Path then hovering","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around June 23rd 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.653226,+-79.381024(39740)&iwloc=A&hl=en\"> mufon case (39740) map </A>","Region":"Ontario"}