{"Region":"Arkansas","Object Flight Path":"Other","Country":"United States","Log Number":"US-10082005-0002","map":"<A HREF = \"http://maps.google.com/maps?q=35.2072,+-91.828463(3974)&iwloc=A&hl=en\"> mufon case (3974) map </A>","Source":"MUFON","trends":[],"divs":["Sighting DetailsLooking out window facing north early am because everynight I wake up at the same time even if I have just gone to bed. I take this to mean to me to do yoga, meditate, or look out of the window. first noticed because planet is brighter than any other. Earlier in the eve you can see it farther away. It moves closer just like the planets do. This night shown like it was lighted by a bright white light not yellowish like planets reflecting the sun. Upon closer look with binocculars it would flash red, blue, white light clearly. It travels across the sky just as a planet does, not noticable only in perspective with the other planets. I thought it may be a satalite or something like taht. but every night i would look at it. On this night looking at it through the binocculars I thought I saw a gascious arrow like narrow beam coming at an angle away from the planet going more west towards earth. I put the binocs down and said did I see that? Picked them up again and yes it was there and moving steadly in sort of a go pause pattern like the second hand on a clock. Tears come to my eyes, fear and excitement but still what the hell is it. I called another person in the house to come see it. They were mad because I woke them. He came looked and said \"yes I see something, but I can't do anything about it.\" Then went back to bed. After that I tried to look at it again but I could not easily find it to look and when I did it seemed to bounce up and down back and forth so I couldn't focus. Decided to go to bed. It is up there every night. It's position has changed just like the planets so it goes off in another angled direction as the nights passes. Sorry no photos."],"Tags":"City","Longitude":"-91.828463","Object Shape":"Sphere","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/3974.html.txt","/var/www/straped/mufon/org/3974.html"],"Date of the Event":"10/05/2005 03:12 UTC","Weather Factors":"Unknown","City":"Undisclosed","Summary":"seen over the week. a bright light as star, flashing blue/red light with streams coming down towards earth.","Case Number":"3974","Date Submitted":"10/05/2005 03:12 UTC","Latitude":"35.2072","Sighting Duration":"Undisclosed","Object Features":"Unknown","Viewing Distance":"Unknown"}