{"Viewing Distance":"Unknown","Object Flight Path":"Hovering then path","Sighting Duration":"00:01:30","Object Shape":"Cigar, Oval","Source":"MUFON","divs":["Sighting DetailsI work in disability services and at the time I was walking with a client to play basketball at a nearby middle school. The sky was overcast and the temperature was neither overly warm or cool. As we were walking, we came to an intersection and I was looking to make sure it was safe to cross the street. As my gaze returned to what was in front of me, I saw on object hovering in the air. I was immediately curious as to what it was, as it wasn't making any sounds that I could determine, or if it was, it was either too far away for me to hear, or was drowned out by other sounds. I looked at it for a moment, while the realization dawned on me that I had no idea what I was looking at. It appeared to be a dark grey or black cylindrical oval. At first the points of the oval were pointing vertically, but the object was rotating counter clockwise along the more narrow axis, and the points of the oval moved from vertical to horizontal to vertical multiple times. The object was slowly moving to the East (left from my perspective) and eventually disappeared behind a large fir tree. I walked around the tree in an attempt to continue watching the object, but I was unable to find it in the sky a second time. As I was watching it, I felt very calm, but also energetic (yet not in a restless way). Once I had lost track of it, for the rest of the day I could not stop thinking about it and trying to analyze what I had seen. The client I was with saw it as well, but did not seem interested by the object."],"Object Features":"Unknown","Weather Factors":"Unknown","Latitude":"44.890928","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around May 15th 2012"],"Log Number":"US-06232012-0023","Country":"United States","Date of the Event":"05/15/2012 04:15 UTC","Case Number":"39751","Longitude":"-123.045061","files":["/var/www/straped/mufon/html2text/39751.html.txt","/var/www/straped/mufon/org/39751.html"],"Disposition":"Unresolved","City":"Salem","Summary":"Rotating black ovoid cylinder seen, then disappeared behind tree and could not be found again","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=44.890928,+-123.045061(39751)&iwloc=A&hl=en\"> mufon case (39751) map </A>","Date Submitted":"06/23/2012 10:57 UTC","Tags":"City"}