{"Date Submitted":"06/24/2012 02:08 UTC","Disposition":"Unresolved","Latitude":"40.187116","Summary":"4 lights (Red to yellow to white plume-like) eminating or reflecting from dark objects approx. 20-25 deg separation traveling straight line disappearing at highest altitude. Soundless.","Date of the Event":"06/23/2012 09:10 UTC","divs":["Sighting DetailsAt 9:10 EST tonight, June 23, 2012, my wife and I were saying goodbye to family visiting us for the evening. The sky was clear with a thin crescent moon nearing the horizon. My son-in-law, daughter, wife and I noticed 3 lights in the sky, one behind the other, with about a 20-25 deg separation, traveling in a straight WNW to ESE direction. We first noticed them at approx. 35 deg off the WNW horizon \"flying\" toward us over a neighbors house across the street. A fourth object also appeared from behind the neighbor's house but was perhaps 30 degrees behind the third object, a bit of a straggler. Helicopter exercises, I thought, but never saw lights on them like these, AND, they were completely silent! They seemed to be moving at a speed a bit faster than the helicopters I usually see around here. I said that these were really unusual. My wife went back into the house and retrieved my 15X70 astronomy binoculars and a regular 7X50 pair as well. While observing them with my astronomy binoculars the light which each one emitted appeared more as a flickering or wavering \"plume\" of light, like a propulsion kind of effect although at the same time the light seemed to be more reflective rather than coming from an energy source. As each object approached near it's highest elevation the light changed from a more reddish hew lower in the sky to a more yellowish hew to white and then went from dim to completely out having reached its highest elevation. Earth satellites do this as they cross overhead and into the shadow of the earth's horizon although they don't change color as these objects did. I observed the objects as well with my regular 7X50 binoculars which actually revealed a roundish dark structure about a third again as big, behind and surrounding the \"light\" the object seemed to be emitting. I actually had the impression that they could have been helicopters with large under-mounted reflectors attached to them. This may have been reflecting the remaining sunlight off the horizon but I don't think they were high enough since it was fairly dark by then. If they were helicopters, they were stealth in nature because there was no sound coming from these objects. We have military helicopters flying around here and often with 2, 3 or more at a time. There is a helicopter base within 20-30 miles of us. If I hadn't looked up as I normally do, going out at night, we would not have witnessed what we did. I know the sound of helicopters (normal ones anyway). They are loudest coming toward you and less \"thumping\" moving past and away from you. These objects made no sound at all and were close enough to do so if they were of the normal variety. These objects were really strange to witness."],"Country":"United States","Log Number":"US-06242012-0009","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/39761.html.txt","/var/www/straped/mufon/org/39761.html"],"trends":["There have been 2 other sightings in Ephrata","There were no other sightings in Ephrata on or around June 23rd 2012"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.187116,+-76.172859(39761)&iwloc=A&hl=en\"> mufon case (39761) map </A>","Tags":"City","Object Shape":"Oval","City":"Ephrata","Weather Factors":"Unknown","Object Features":"None","Object Flight Path":"Straight-line path","Case Number":"39761","Source":"MUFON","Longitude":"-76.172859","Region":"Pennsylvania"}