{"Summary":"police offeicer reports orange lights in night sky moving towards each other and converge","Case Number":"39763","Object Shape":"Unknown","Longitude":"-123.884555","Latitude":"46.983665","files":["/var/www/straped/mufon/html2text/39763.html.txt","/var/www/straped/mufon/org/39763.html"],"Date of the Event":"06/24/2012 11:14 UTC","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Hoquiam","There were no other sightings in Hoquiam on or around June 24th 2012"],"Region":"Washington","Country":"United States","Date Submitted":"06/24/2012 03:54 UTC","City":"Hoquiam","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unresolved","Sighting Duration":"00:30:00","Log Number":"US-06242012-0011","Object Features":"None","divs":["sighting detailspolice officer radio transmission to fello officer. witnessing officer, \"hey, do you see those lights in the sky?, orange lights, they seem to be at about 5000 feet or so north of me, and look to be moving, i'm on the 5th street extension. they seem to be converging, and they look be changing color from pink to orange. maybe if you were in a dark place you could view them\". i heard no communication from the 2nd officer. roughly 5 minutes later, 911 dispatcher reports that a resident on emerson street, resideing near the emerson grocery store is viewing an object in the sky. no further radio communication is heard. roughly a half hour later, 911 dispatcher calls the original officer and asks, \"do you still see the lights?\", two times she asked, and the officer didn't respond. other dispatcher reports that officer to be on another call and no further radio commuunication regarding the lights are heard. i was listening to these transmisiions on a police scanner in the neighboring town. it was about 11:00 pst, fairly clear, and some fog above the chehalis river, and a 1\\4 moon which at that time was west of town and low on the horizon."],"Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.983665,+-123.884555(39763)&iwloc=A&hl=en\"> mufon case (39763) map </A>"}