{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.79324,+-96.655812(39774)&iwloc=A&hl=en\"> mufon case (39774) map </A>","Date Submitted":"06/24/2012 01:19 UTC","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/39774.html.txt","/var/www/straped/mufon/org/39774.html"],"Summary":"I observed a large t-shape object that appearred to have blinking green and red lights. I thought wow, those are really bright port and starboard running lights but soon saw the blueish white lights and the shape of the object.","Tags":"City","trends":["There have been 12 other sightings in Mesquite","There were no other sightings in Mesquite on or around June 19th 2012"],"City":"Mesquite","divs":["sighting detailsi was on my way home from work and remembered i needed to pick up my prescription at cvs when i observed a large t-shape object that appearred to have blinking green and red lights. i thought wow, those are really bright port and starboard running lights. i soon saw the blueish white lights and the shape of the object and realized it was hovering. the light sequence was as follows: green, red, blueish white, blueish white, green and back to red. then the blueish white lights remained stationary for a few seconds before they began to twinkle. it also had what appeared to be long beacon antennas from each end of the points of the t. the large t-shaped object ascended straight up and then moved across to my right in such a straight angle that i thought how could something so large do that? there also appeared to be multiple levels that could be visibly seen due to the multiple lights spread throughout this object. when i first observed this object it appeared over buildings and homes but when it moved, it appearred to be hovering over another freeway i-635 (dallas\\garland area of the freeway). i kept checking on the object as i continued onto my destination and lost sight of it. i retrieved my prescription and returned home wondering about what it was that i had seen. the next morning i told my husband about it and he believed i had seen a ufo. my husband is very level headed and advised me to let it sink in, wait a few days and check to see if anyone else had reported anything. there was another person who reported seeing something. however, our accounts on the object are different."],"Object Shape":"Cross","Case Number":"39774","Viewing Distance":"Over One Mile","Log Number":"US-06242012-0022","Object Features":"Other","Date of the Event":"06/19/2012 11:10 UTC","Source":"MUFON","Weather Factors":"Unknown","Region":"Texas","Longitude":"-96.655812","Latitude":"32.79324","Disposition":"Unresolved","Country":"United States"}