{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"Indiana","divs":["Sighting DetailsIt was approximately 10:15pm on June 24, 2012. I was walking east down the alley from my best friend's house to my house (our backyard's adjoin) and I looked up through the trees and saw a large reddish orange object--startling large. Confused (and thinking it was a plane on fire or something like that) I sped up a little to get a good look at it--and when I saw how VERY LARGE and how luminous it was, I ran to get out from under the trees to get a better look. I stopped and observed the object for about 20 seconds and realizing that I wasn't seeing a plane, I ran into the house and told my mother to \"GET OUT HERE, NOW!\" And I ran back out to observe the object again. It was very large, a single light moving east in the sky. It was orange to orangish red. It was not a fireball, but it was similar in the luminous glow it cast. It was very bright. I did not see flames. It did not flicker or blink as a plane's lights do and it was about aspirin-sized, at least from our point of view. It didn't make a sound. The only thing I can compare it to is a glowing coal, only it didn't flicker like a coal does. My mother come out and observed the object as well, and made me go in and get my camera. I took a photo and a video, but the camera didn't pick up the object very well at all and my shaky hands blurred the photo, but I have circled it in the picture. The object can best be seen in the video during the first few seconds. I honestly didn't think it was picking up because it was so dark. As you can hear on the video, my mother called my best friend and told her and her husband to come look at it, but by the time they arrived, it was already disappearing into the clouds. It looked like when clouds scud across the moon, not like it faded out. While we were witnessing the object (during the video), my neighbors on the next street over let off a firework, but it was too low and it faded too fast to be related to the object--I also didn't hear any fireworks before I witnessed the object and I would have heard it in the house before I left, as I always have before. The object was too high in the sky, just below the clouds and then high enough to disappear into them. My best friend and I got in her car to see if we could find it, but the clouds were too thick and we did not see it again. She did not witness the ball of light. I mostly felt excited and confused when I saw the object and then grateful my mother saw it so no one thinks I'm lying or flat out nuts. I don't know what it was, but I have no frame of reference for it and even attempting to describe it seems to fall short of the experience. I posted about it Facebook and a friend of mine who lives in a nearby town said she knew someone who witnessed what sounds like the same thing on June 23rd. I cannot verify this."],"Tags":"City","Summary":"It was a ball of luminous light, very large and soundless, Did not flicker. Moving slowly to east. Vanished in clouds.","Object Shape":"Fireball, Sphere","Country":"United States","files":["/var/www/straped/mufon/html2text/39788.html.txt","/var/www/straped/mufon/org/39788.html"],"Case Number":"39788","Source":"MUFON","Longitude":"-85.004779","Date Submitted":"06/24/2012 11:25 UTC","Latitude":"40.149715","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Winchester","There were no other sightings in Winchester on or around June 24th 2012"],"Log Number":"US-06242012-0034","Object Features":"None","Viewing Distance":"Unknown","Date of the Event":"06/24/2012 10:15 UTC","Weather Factors":"Unknown","City":"Winchester","map":"<A HREF = \"http://maps.google.com/maps?q=40.149715,+-85.004779(39788)&iwloc=A&hl=en\"> mufon case (39788) map </A>"}