{"Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Dome","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Stationary,Path with directional change","Region":"Colorado","Summary":"I took photos with my binoculars of a UFO in the night sky. Also at another date I have a photo of a light on a power line down the canyon from our home.","Log Number":"US-06252012-0006","Longitude":"-108.047626","files":["/var/www/straped/mufon/html2text/39795.html.txt","/var/www/straped/mufon/org/39795.html"],"Object Shape":"Boomerang, Star-like","Date of the Event":"06/14/2012 12:00 UTC","divs":["Sighting DetailsI was looking out a window to see why my out side solar light kept going on and off. I noticed a colorful bright light in the sky. I got my photo binoculars and took several photos of the object as it moved around in the night sky. I was wondering what this object might be. I do not know what this object was but I had seen lights near a power line down the canyon from us a few months ago. Also my son in law and his father and my daughter had seen triangles over our property twice previous to this. The triangles were observed in the early evening while the family were out side finishing up picking up our newly bailed hay from a field. Because we were seeing the unusual activity in the night sky and near the power lines I purchased binoculars that I could take photos with. I really was not expecting to see this light in the sky that night, I expected to see possible toads or rabbits in my yard causing the solar light to come on. I really think this light is malfunctioning and not related to the lights in the sky. I watched the light for over a hour and finally went to bed."],"Weather Factors":"Unknown","trends":["There have been no other sightings in Olathe","This sighting has never been favorited."],"Case Number":"39795","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.56406,+-108.047626(39795)&iwloc=A&hl=en\"> mufon case (39795) map </A>","City":"Olathe","Latitude":"38.56406","Date Submitted":"06/25/2012 05:12 UTC"}