{"Sighting Duration":"00:03:00","Object Shape":"Circle, Sphere","Country":"United States","Source":"MUFON","Object Flight Path":"Path with directional change","Log Number":"US-06252012-0015","Date Submitted":"06/25/2012 05:07 UTC","Longitude":"-118.110415","Summary":"We were called outside by a family member, he pointed us towards the west over garage, we saw a bright light moving fast..","Region":"California","Date of the Event":"06/05/2012 09:40 UTC","trends":["There have been 5 other sightings in Norwalk","There were no other sightings in Norwalk on or around June 5th 2012"],"City":"Norwalk","Case Number":"39807","divs":["Sighting DetailsIt was june 5th, at night sometime around 9 40. I was in Norwalk, Ca watching a movie at my girlfriends house with her father, brother, cousin, my girlfriend and myself. At that time her cousin received a phone call and stepped outside so as to not disturb the movie, then after about two minutes he came quickly to the door and says \"guys, come quick, you gotta see this...come on!\" As he had been on the phone he saw something and came to get us, so I and everyone stood up and went outside the house in front of the garage and he pointed over the garage to the west towards the ocean and said\"guys what is that?\" \"do you see that moving fast over there?\"... I and everyone else there immediatley became aware of this very very bright light in the sky in the west moving quickly to the north of us. It looked like a star, it looked like the biggest star in the sky visible without a telescope, but much bright and moving fast. In a matter of about 30 seconds it made its way over the garage and quickly changed its course from north to northeast towards victorville..as it changed course we all noticed it would have busrts of speed from fast to very fast. It all the time it was moving, we never saw airplane markers, signs, signals, smoke or rocket trails and it never made any sounds, all the while my father in law watched through binoculars. As the object turned towards the northeast it began to get smaller and smaller and it eventually dissappeared over the neighbors house. We stood there and just took the sight of what we had just witnessed all in. I personally was very shaken up by the whole event...we all were in agreement that what we had seen was not normal."],"files":["/var/www/straped/mufon/html2text/39807.html.txt","/var/www/straped/mufon/org/39807.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.920343,+-118.110415(39807)&iwloc=A&hl=en\"> mufon case (39807) map </A>","Object Features":"Unknown","Latitude":"33.920343","Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City"}