{"Object Shape":"Other","Object Features":"Undisclosed","Log Number":"US-06252012-0019","Summary":"Observed object come into view make a turn and disappear only to reappear a second time within a short time to do the same thing.","Region":"Iowa","Latitude":"41.016029","map":"<A HREF = \"http://maps.google.com/maps?q=41.016029,+-92.408302(39811)&iwloc=A&hl=en\"> mufon case (39811) map </A>","Date Submitted":"06/25/2012 08:45 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/39811.html.txt","/var/www/straped/mufon/org/39811.html"],"Source":"MUFON","trends":["There have been 8 other sightings in Ottumwa","There were no other sightings in Ottumwa on or around June 22nd 2012"],"Object Flight Path":"Path with directional change","Case Number":"39811","Date of the Event":"06/22/2012 12:00 UTC","divs":["Sighting DetailsAt a large park waiting on 2 other people to rejoin our group. We had watched a fireworks display. We had been to see hot air balloons do a night glow on the ground as a group. Was sitting in a lawnchair just awaiting the others arrival when I noticed an orange glow in the sky traveling toward where I was sitting. I could see it through some tree branches but it started to turn and fly away from where I was sitting. It traveled at a steady pace and steady light. At first I thought it was a hot air balloon but I was told that balloons are not allowed to be up in the air after dark. It was 11 pm and all balloons had been deflated and packed away before fireworks display started. The object then just disappeared but returned a few moments later and followed the same pattern as before made an arc turn and then disappeared. I had the feeling it was the same object and it was circling but perhaps it was two. It was a clear night so after it had made the turn I could see it going away from me and then it was no longer visible like the lights just turned off."],"Country":"United States","City":"Ottumwa","Longitude":"-92.408302","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Unknown"}