{"Object Shape":"Cigar, Sphere","Log Number":"US-06252012-0018","Case Number":"39810","Date of the Event":"06/25/2012 01:06 UTC","divs":["Sighting Detailsi was in my truck facing ne was leaving the place i clean on my way to the bank. i saw a bright shiny object moving very fast across the sky maybe a mile away and id guess above clouds but the sky was pretty clear today. it was very sunny and bright. what really got me curious was it was spewing a chem trail but it was very short and was like disovling before it could leave a long trail. all the other things in the sky were very obviously jets leaving long chem trails. what i saw did not look like a plane. so i was driving through the parking lot watching this thing move across they sky thinking 'what kind of plane can that be?'. thats when i saw the white glowing orb like thing flying below it. it was about an inch below and just a little bit behind. they seemed to be going the same speed in the exact same direction. when i saw the orb i got really excited because i knew for sure that it was not a plane. all i could think was ' i wish i had a camera'. then i realized my phone has a camera. so i threw my truck in park and hopped out. i could not see my screen because it was too bright, so i snapped off three shots in the general area be fore i lost them behind some trees. they were moving fast. so i jumped back in my truck and turned ne onto ----- ave looking for them. i pulled into the bank just across ----- ave parked and searched the sky but they were gone. the pics on my phone were taken at 1:06pm. i went into the bank and told the teller i had just seen a ufo, she didnt believe so i didnt push the issue. my pics unfortunately have no visible proof of what i saw but my girlfriend is trying to clean them up."],"Summary":"fast cigar chased by glowing orb","Country":"United States","files":["/var/www/straped/mufon/html2text/39810.html.txt","/var/www/straped/mufon/org/39810.html"],"Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Iowa","Longitude":"-91.660263","Source":"MUFON","Date Submitted":"06/25/2012 07:00 UTC","Latitude":"41.98577","map":"<A HREF = \"http://maps.google.com/maps?q=41.98577,+-91.660263(39810)&iwloc=A&hl=en\"> mufon case (39810) map </A>","Object Features":"Undisclosed","trends":["There have been 17 other sightings in Cedar Rapids","There were no other sightings in Cedar Rapids on or around June 25th 2012"],"City":"Cedar Rapids"}