{"Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"Undisclosed","divs":["sighting detailswas having a fitful night of sleep when awakened by a very loud rumbling\\roaring sound. the sound was a great distance away and advancing very slowly. after listening for a while and realizing \"something wasn't quite right\" about the sound, (it was taking too long of a time to finally arrive in my area and was making vibrating feeling occur), i got up and went all the way across the house to the back door deck area where best view of the sky would be. just in time to see a very intense, brite light, the size of a dime held at arms length pass over the tall trees in our woods. was more oval in shape tho. woods animals reacted strongly with various screeching, howls, and such. some dogs barking nearby. the craft took a northeasterly heading. the sound was the most disturbing part of the sighting...could hear it for a long time as it advanced and then left the area...almost a full minute in all. seemed to be moving too slow for the size of it. very loud. feeling unsettled and unnerved after this incident. have had other sightings in the past also. have been in contact with mufon before. thanx."],"Date of the Event":"10/12/2005 01:15 UTC","Disposition":"Hoax","City":"Bossier City","Summary":"Loud, noisy craft, oval, red-orange color, like a dime at arms length.","trends":["There have been 8 other sightings in Bossier City","There were no other sightings in Bossier City on or around October 12th 2005"],"Latitude":"32.515985","files":["/var/www/straped/mufon/html2text/3982.html.txt","/var/www/straped/mufon/org/3982.html"],"Country":"United States","Object Shape":"Undisclosed","Longitude":"-93.732123","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.515985,+-93.732123(3982)&iwloc=A&hl=en\"> mufon case (3982) map </A>","Object Flight Path":"Undisclosed","Case Number":"3982","Sighting Duration":"Undisclosed","Log Number":"US-10122005-0003","Date Submitted":"10/12/2005 01:15 UTC","Region":"Louisiana","Tags":"City"}