{"City":"Somerville","Tags":"City","Latitude":"35.243697","Object Flight Path":"Path with directional change","divs":["sighting detailswas heading into somerville, tn where hwy 59 meets hwy 79, around 9:10pm. suddenly saw a very bright light in the sky right above the road. at first i thought it was the top of a radio tower, then did a double take when i remembered there were no towers in that area. person driving stopped the car in the road to look at the light. it was bright red and not flashing, then slowly began to change from red to white as if fading in and out. it was then suggested that maybe the item was a flare, since it definitely appeared to be falling slowly and getting closer. we rolled the windows down on the vehicle to see if we could hear a helicopter, everything was silent. after watching it a while we realized it was actually spinning. flares do not spin with color changes, so we became a bit alarmed and curious. a car came up behind us so we pulled into an abandoned church parking lot to view it w\\out being in the road. once in the parking lot we pulled out a camera phone and began trying to take a picture but almost as soon as we did this it changed directions, moving sw very rapidly and gaining altitude as it went. it eventually disappeared completely like the lights had just been shut off entirely. the entire experience lasted maybe five minutes tops, but probably not that long. it was bigger than a star or an airplane, about the same size as the red lights on top of a radio tower when you are very close to them. it was a very exciting experience. both the driver and i were not quite sure what to make of it and as soon as it vanished started talking at once in excitement. whatever it was, we both know we have never seen anything like that before in our life. ever. we ended up with two very low quality cell phone images of the object, but it was already moving rapidly away at the time we took the photos. one picture shows it next to the moon (white object) to help with size. it was bright enough to show up when the stars present did not."],"Sighting Duration":"Undisclosed","Longitude":"-89.350071","Object Shape":"Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=35.243697,+-89.350071(39823)&iwloc=A&hl=en\"> mufon case (39823) map </A>","Source":"MUFON","trends":["There have been no other sightings in Somerville","This sighting has never been favorited."],"Summary":"Very bright, first thought to be flare. Red/White spinning lights. Suddenly shot up fast moving SW and out of site.","Disposition":"Unresolved","Region":"Tennessee","Country":"United States","Date Submitted":"06/26/2012 02:46 UTC","files":["/var/www/straped/mufon/html2text/39823.html.txt","/var/www/straped/mufon/org/39823.html"],"Object Features":"Undisclosed","Log Number":"US-06262012-0008","Weather Factors":"Unknown","Case Number":"39823","Viewing Distance":"101-500 Feet","Date of the Event":"06/25/2012 09:10 UTC"}