{"files":["/var/www/straped/mufon/html2text/39825.html.txt","/var/www/straped/mufon/org/39825.html"],"Disposition":"Unresolved","Latitude":"12.1","Source":"MUFON","Case Number":"39825","map":"<A HREF = \"http://maps.google.com/maps?q=12.1,+-85.366667(39825)&iwloc=A&hl=en\"> mufon case (39825) map </A>","Date Submitted":"06/26/2012 06:17 UTC","divs":["Sighting DetailsI was in the backyard of my house in Juigalpa, Chontales (Nicaragua), at 00:40 with my cousin. We were looking the nightsky as we usually do with our telescope. That night the sky was covered by scattered clouds so we wouldn't see as much as usual. The only star we could see was Fomalhaut, from Piscis Austrinus constellation. Then I saw this dark triangle-shape object, with red-orange lights in each of the triangle vertices. The lights weren't too bright, but still visible. The object was darker than the nightsky dark blue. I yelled at my cousin to come over and watch the UFO but he wouldn't see anything. I drove him in the backyard for a while (at most 5 to 10 seconds) but he still didn't see the object. The UFO moved from Southeast to South and I thought we couldn't see more of it. We came back to our former position in the backyard (with Fomalhaut star in front of us). I was trying to explain what I saw to my cousin when we both saw exactly the same object coming from South to Southeast. I was getting fast heartbeat by that time but we remained watching the UFO. The three lights were now hovering and then got closer to our backyard. We both sensed a feeling of being in the wrong place at the wrong time, the heartbeats getting faster and faster. We can describe the UFO as getting closer for the triangle-shape was getting bigger. At that moment, I can hardly describe it any different, we just wanted to get in the house, to be anyplace else. The lights, normally in the three vertices of the triangle, were now changing to a \"V\" shape. Not that the UFO's shape changed. Just the red-orange ligths. I could count six of them forming the \"V\". Then the rest of the story isn't that hardcore. We ran like hell into our house. The flying object was clearly getting over our heads, approching at an extremly fast speed, we wouldn't have stand there any longer. It was clearly a once in a life experience. No one told the other to run, but we did at exactly the same time. We could hardly speak for a while. It has been three days now since it happened, and one cannot watch the nightsky as before."],"Longitude":"-85.366667","Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"101-500 Feet","City":"Juigalpa","Weather Factors":"Unknown","Object Shape":"Triangle","trends":["There have been no other sightings in Juigalpa","This sighting has never been favorited."],"Sighting Duration":"00:00:30","Date of the Event":"06/23/2012 12:00 UTC","Country":"Nicaragua","Summary":"Black triangle UFO over Juigalpa, Nicaragua","Object Features":"Unknown","Log Number":"NI-06262012-0010","Region":"Chontales","Tags":"City"}