{"Longitude":"-88.079869","trends":["There have been 8 other sightings in Schaumburg","There were no other sightings in Schaumburg on or around June 25th 2012"],"files":["/var/www/straped/mufon/html2text/39824.html.txt","/var/www/straped/mufon/org/39824.html"],"Tags":"City","Weather Factors":"Unknown","Latitude":"42.033825","Disposition":"Unresolved","Case Number":"39824","Object Features":"Unknown","Object Shape":"Sphere, Star-like, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.033825,+-88.079869(39824)&iwloc=A&hl=en\"> mufon case (39824) map </A>","Region":"Illinois","Sighting Duration":"00:20:00","Log Number":"US-06262012-0009","City":"Schaumburg","Country":"United States","Date Submitted":"06/26/2012 03:00 UTC","Date of the Event":"06/25/2012 10:00 UTC","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Path then hovering,Other","divs":["sighting detailshaving a cigarette on the porch of my home, i had noticed what i thought was a shooting star while i had looked south. upon investigating, i had noticed that the moving star-like entity was rapidly changing it's flight path. it had maneuvered several times making an elongated figure-eight pattern. shocked at seeing how this vessel had maneuvered, i then saw a different and brighter faster-moving light, travelling on a straighter path. the maneuvering entity in question was of a faint whitish and radiating orange color. the second was a solid brighter white color. the maneuvering ufo had moved and changed direction too fast so as to rule out a satellite, falling debris, or any sort of human air\\spacecraft. the way that the first strange light was maneuvering, along with it's speed, had frightened me because it gave me the feeling that the vessel's technology is very much so beyond human means. i eventually lost track of the vessel it's path was so erratic."],"Source":"MUFON","Summary":"Strange movement of fast-moving lights in the sky, constantly changing direction. Second light appeared minutes after noticing the first."}