{"trends":["There has been one other sighting in Melville","There were no other sightings in Melville on or around June 24th 2012"],"Object Features":"Unknown","Viewing Distance":"101-500 Feet, Unknown","divs":["Sighting DetailsMy sister and I were driving when in front of us in the air I saw a bright light, sort of like a search light but just pointing forwards. As we drove closer, we see an aircraft with a smaller red light on one side and a bluish-white light on the other. At first it seemed as though this was a plane with wings, but it was not moving. It was hovering. It was hard to tell whether the two smaller lights were attached to wings but it looked like a disc, with the two lights on either end and the one bright light in the center. It made no sound (had had the windows open). Following the bend of the road, we made a left and momentarily our view was obstructed by trees. Once the trees pass, the aircraft should have been to the left, but it was gone. It dissapeared in a matter of seconds. The three main points of why I don't think this was a plane or helicopter was because the middle light was extremely bright, it was hovering and not moving, and it made absolutely no sound. In the picture attached, the white light highest up is the unidentified object. the other lights are on the road ahead of the car."],"Weather Factors":"Unknown","Summary":"bright hovering light on aircraft","Sighting Duration":"Undisclosed","Date of the Event":"06/24/2012 10:10 UTC","Case Number":"39821","Object Shape":"Circle, Disc, Oval, Sphere","City":"Melville","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.781397,+-73.406578(39821)&iwloc=A&hl=en\"> mufon case (39821) map </A>","Longitude":"-73.406578","files":["/var/www/straped/mufon/html2text/39821.html.txt","/var/www/straped/mufon/org/39821.html"],"Date Submitted":"06/26/2012 01:41 UTC","Tags":"City","Latitude":"40.781397","Log Number":"US-06262012-0006","Region":"New York","Object Flight Path":"Other","Source":"MUFON","Country":"United States"}