{"Object Shape":"Fireball, Sphere","Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown","Latitude":"48.137927","Date Submitted":"06/26/2012 02:05 UTC","Object Features":"None","Object Flight Path":"Path then hovering","trends":["There have been 6 other sightings in Port Angeles","There were no other sightings in Port Angeles on or around June 25th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.137927,+-123.406218(39822)&iwloc=A&hl=en\"> mufon case (39822) map </A>","Summary":"Large glowing ball rose up from foothills.","Tags":"City","divs":["Sighting DetailsI was sitting on my back porch smoking a cigarette I always look towards the foothills and the night sky all of a sudden bright reddish orange ball ascended up out of the foothills I immediately stood up and look through my binoculars to see if I could see if a body shape all I could see how was a bright bright red orb it slowly moved up a few degrees and then stopped at this time I noticed it was fluctuating in size and color I yelled for my son and my husband to look outside it then slowly moved to the east all this time it was below the mountains and the cloud cover but it was inside a thick level of a fog. I reached down for my phone so I could record it on video I turned my recorder on and saw it in the viewfinder and then it just disappeared. it did not move away it did not go behind a building or trees it just disappeared. the area that I witnessed this I am very familiar with it appeared right above franklin elementary school and there is no way a plane or helicopter could be flying in that low in that area. I stayed outside using my binoculars search for it but I wasn't able to find it anywhere or anything else there was no noise at all no planes no jets no helicopters in the area at the time it was still relatively light out oh I would have been able to see it if it's still there. another strange event in port angeles. I will keep a lookout for further objects."],"City":"Port Angeles","Log Number":"US-06262012-0007","Date of the Event":"06/25/2012 10:25 UTC","files":["/var/www/straped/mufon/html2text/39822.html.txt","/var/www/straped/mufon/org/39822.html"],"Longitude":"-123.406218","Region":"Washington","Viewing Distance":"Over One Mile","Source":"MUFON","Case Number":"39822","Sighting Duration":"Undisclosed"}