{"Date Submitted":"06/26/2012 02:14 UTC","Longitude":"-79.858702","Object Features":"Other","Disposition":"Unresolved","Country":"United States","Object Flight Path":"Stationary","Object Shape":"Disc","Latitude":"40.136289","divs":["sighting detailsi was young, i wasn't in school yet so it must have been 1969. we lived in the country of belle vernon. the house my mother grew up in. i woke up in the morning and went looking for my mom. i went from my room, walked through the adjioning room (sewing room) to head to my parents room. but something stopped me and i looked towards the window of the sewing room and saw hovering outside the window a silver\\metallic disk. the disk hovered, it appeared to be rotating but stayed in the same position. then the disk changed position suddenly, it darted to a new position hovered and changed position again. the disk - silver\\metallic, reflected light. small in size approx. dinner plate size. disk had contour to its shape, there was a point in the center like it came to a peak. it seemed more like i was looking down on it can't remember seeing the bottom of the disk. the disk hovered and rotated at same time. changed position with quick darting movements. the house was a 2 story home built on the side of a hill over looking a road, down to a creek, then the elevation went steep up to an abandoned slag dump and railroad tracks. the window from which the ufo was observed overlooked this view. i don't remember what happened next. i just remember the disk outside the window. my mother tells a story of one evening is a young girl while helping my grandmother take down clothes from the line. they observed a craft flying along the top of the slag dump and suddenly changed direction and flew up and off into the sky. there was no sound. my mother also commented that when we moved from that house the window to the sewing room had developed a haze to it, it had an opalesence like it had been exposed to high heat, but the lower windows did not."],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Log Number":"US-06262012-0017","files":["/var/www/straped/mufon/html2text/39835.html.txt","/var/www/straped/mufon/org/39835.html"],"Tags":"City","Date of the Event":"04/01/1969 12:00 UTC","City":"North Belle Vernon","trends":["There have been 6 other sightings in North Belle Vernon","There were no other sightings in North Belle Vernon on or around April 1st 1969"],"Region":"Pennsylvania","Sighting Duration":"Undisclosed","Case Number":"39835","map":"<A HREF = \"http://maps.google.com/maps?q=40.136289,+-79.858702(39835)&iwloc=A&hl=en\"> mufon case (39835) map </A>","Summary":"observed silver disk hovering outside 2nd story window","Source":"MUFON"}