{"Date of the Event":"11/26/1991 08:00 UTC","Object Features":"Undisclosed","Date Submitted":"11/26/1991 08:00 UTC","Summary":"The UFO at first looked like a massive orange star then it came over us and it was a triagular craft.","files":["/var/www/straped/mufon/html2text/3983.html.txt","/var/www/straped/mufon/org/3983.html"],"divs":["Sighting DetailsTemperature - About 5 - 10 degrees Shape - Triangle Direction - West Speed - About 10 - 20 MPH How many UFO's - One UFO Short description - Triangle with three orange lights and one big orange light in the center of the craft Account of Events - It was a normal Friday night I was outside with two friends at about 7:45pm we were talking to one another. I saw a big orange Light in the distance I said look at that star I thought it was a star at the time. My friends looked they said they had never seen a star that big before. We continued with our conversation it was now 20:00pm. But then the star started to change rapidly it was moving towards us. I stared at it and pointed to it, my friends looked and they were just amazed we started to say stuff to one another such as What the hell is that. It was amazing. It came over the house it was behind and we could just see this big black triangle with three Orange lights and one big one in the middle. At this point I new it was nothing like a helicopter or anything normal for that matter. I went inside as fast as possible I got the digital camera I alerted my parents I said - Come and look at this thing outside. They thought I was fooling around so they did not come. I went back out and by the time this had happened it started to disappear out of sight. I took a picture but it disappeared as soon as I took it. Later when analyzing the picture there was no sign of the UFO or anything on the picture. My parents had seen I had left the door open and heard me talking to my friends saying what the hex was that thing and other similar comments. They came out and asked what was going on I said what had happened and they could not believe it Thats the report that i have built up from my friends account of events and my account of events. If you have any questions contact me at my site www.alienationsam.tk"],"Region":"England","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"GB-10122005-0004","trends":["There have been 5 other sightings in Sunderland","There were no other sightings in Sunderland on or around November 26th 1991"],"City":"Sunderland","Disposition":"Unresolved","Case Number":"3983","Longitude":"-1.376091","Latitude":"54.910479","map":"<A HREF = \"http://maps.google.com/maps?q=54.910479,+-1.376091(3983)&iwloc=A&hl=en\"> mufon case (3983) map </A>","Object Flight Path":"Undisclosed","Country":"United Kingdom","Object Shape":"Undisclosed","Tags":"City"}