{"Viewing Distance":"Unknown","Object Flight Path":"Stationary,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=33.663797,+-117.992236(39840)&iwloc=A&hl=en\"> mufon case (39840) map </A>","Region":"California","Date of the Event":"11/18/2010 12:00 UTC","Sighting Duration":"Undisclosed","Summary":"I took this amazing picture from a fixed position with a fixed lens (50mm) late at night in my backyard, the aperture was open for 1.6 seconds. You can see the craft stop at two fixed positions and you can see it traveling FAST.","trends":["There have been 49 other sightings in Huntington Beach","There was one other sighting in Huntington Beach on or around November 18th 2010"],"Latitude":"33.663797","divs":["sighting detailsi took this picture from a fixed position with a fixed lens (50mm) late at night in my backyard, the aperture was open for 1.6 seconds. what looks like it might be two \"headlights\" when blown up, might also just be a reflection from the moon. i did not see it with my eyes as i was just trying to take a time-elapsed pic of the stars. all i know is that it's not a plane, helicopter or weather-baloon and that \"it\" is doing a lot in 1.6 seconds like being in two stopped positions--one closer and one farther back from where i was. the original pic just appears as a little light streak that goes across 40% of the frame and that you've seen many times before, but---because of the pro-sumer hi-def camera used and it being in a fixed position--when you blow it up it clearly looks like an amazing circular craft caught at both a stand-still position and in motion. here it is: [link moved to fi section\\cms\\tg] and here: [link moved to fi section\\cms\\tg] note: all the info i filled out on this form is based on the image i linked to. i did not see the craft with my own eyes but i can verify and prove that whatever it is, it's the real deal; the photo was not altered in any way shape or form---i only made copies to crop and reverse horizontally and vertically. i have the original camera i used and the old laptop i uploaded it to. the camera information at the site i linked to above is incorrect regarding the date and time of photo, the correct camera info is listed below (taken from http:\\\\www.adoramapix.com where i originally uploaded the photo file which was about 34mb's): camera nikon d700 exposure 1.6 sec (16\\10) aperture f\\ exposure mode manual exposure exposure bias 0\\6 ev white balance auto white balance flash not fired focal length 50 mm compression no compression color space srgb date & time 2010:11:18 00:33:19 date & time (digitized) 2010:11:18 00:33:19 file size 13.9 mb image width 2704 pixels image height 1800 pixels i will be putting an article up on headlinezoo.com and would be happy to provide the image files to muffon if they are interested in analyzing and validating it to the extent possible. please feel free to contact me to discuss."],"Log Number":"US-06262012-0022","Longitude":"-117.992236","Country":"United States","Date Submitted":"06/26/2012 07:11 UTC","files":["/var/www/straped/mufon/html2text/39840.html.txt","/var/www/straped/mufon/org/39840.html"],"Weather Factors":"Unknown","Object Features":"Unknown","Case Number":"39840","Tags":"City","Disposition":"Unresolved","Source":"MUFON","Object Shape":"Circle, Disc","City":"Huntington Beach"}