{"Date Submitted":"06/26/2012 09:53 UTC","Latitude":"31.282499","City":"Pidcoke","divs":["Sighting DetailsTriangle-shaped craft observed just to the south of Gatesville, Texas. On June 6, 2012, at approximately 0525 hours and while traveling northbound on Highway 116 just north of the city of Pidcoke, I had a UFO sighting. I had observed the object as I entered the south side of Pidcoke a few minutes earlier. At that point, I thought it was just an airplane. All I could see was a white light to the left side of the highway. I noticed the object move to the right side of the highway. As I barely passed the north side of Pidcoke, I saw the object much more clearly. It moved back to the left side of the highway in a zig-zag motion. At this time, I realized this was not an airplane. It was a triangle-shaped craft with three very bright white lights underneath the craft. The lights were so bright, that I could clearly make out the triangle shape of the craft. The craft was either moving very slow or virtually stationary in the air. It was flying at a relatively low elevation. The craft also had some sort of beam or scanning l! ight in the front of it that was moving back and forth in a horizontal motion at about a 45 degree angle from the craft. As I passed the craft, I looked back and it disappeared. Pidcoke is a small town in between Copperas Cove and Gatesville. I did manage a quick photo of the object with a cell phone."],"files":["/var/www/straped/mufon/html2text/39844.html.txt","/var/www/straped/mufon/org/39844.html"],"Log Number":"US-06262012-0025","Object Flight Path":"Path then hovering","Weather Factors":"Unknown","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"Texas","Case Number":"39844","Source":"MUFON","Country":"United States","Viewing Distance":"21-100 Feet, 101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=31.282499,+-97.886355(39844)&iwloc=A&hl=en\"> mufon case (39844) map </A>","Tags":"City","trends":["There have been no other sightings in Pidcoke","This sighting has never been favorited."],"Date of the Event":"06/06/2012 05:25 UTC","Object Features":"Patterned Surface","Longitude":"-97.886355","Summary":"Triangle-shaped UFO Observed to the South of Gatesville, Texas"}