{"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Falmouth","Object Shape":"Square, Rectagular","Disposition":"Unresolved","Tags":"City","Latitude":"41.540271","Object Flight Path":"Path with directional change","divs":["Sighting Details I took my binoculars to a beach near my home on Cape Cod to stargaze. The sky had a low lying cloud cover so not many stars to see, I watched the ferries going in and out to the islands and other occasional seafaring traffic. As I was facing the ocean ( south-east) over my left shoulder I see something coming in from a north west direction. It's length looked to be about the size of a telephone pole or larger(I noticed that as it coasted over a pole)was square, flat but somewhat curved on the top part. Underneath in each corner were green lights that did not blink ,in the middle on the bottom were red and white lights that flashed on and off extremely quickly while rotating in a circular fashion very quickly. The body of the object was a dull grey with Indistinct edges. It was a sight to behold that took my breath away!.As I was on a private beach next to the large public beach there was no one else around to say \"did you just see that? \"...Anyway as to it's direction...it came in over the utility poles maybe about 12 feet above them (there is a row of poles lining the beach) I'm looking at this in my binoculars ( it is probably a mile or two away from me) ...and it just glides horizontally, slowly heading toward the ocean at about the speed of a glider. It came in (leading with the corner ?)and within a few seconds slowly turns (away from me) the bottom lifting up so that I can see that it's square, and now seems to lead with it's side as it curves slowly in a big semi-circle over the shallow part of the ocean.After traversing (maybe a mile?)it becomes horizontal to the ground again and heads back from the direction it came (north-west.) There is a radio tower that lines up with the row of poles and it flew around that and then I couldn't see it any more because of trees. The whole event took just a few minutes, was the speed and movement of a glider, NO SOUND or emission , seemed to stay the same height to the ground the whole time. I ran to my car to write down and draw the details then I kept looking with my binoculars again..approx. 10 minutes later the whole thing happens again!! I go back to check my drawing and notes (since I got another look) for accuracy..then I wait around some more \"just in case\"... Not thinking it could happen again..and it does!!!..approx. another 10 minutes later. I wait around along time after but nothing like that happensThe whole thing happened between approx 10:30 and 11:00pm . This really blows my mind and I'm not sure who I can talk to about this!"],"Longitude":"-70.62837","Region":"Massachusetts","Summary":"Telephone pole length, square, flatish,dull grey body with unblinking green lights in corners & red & white lights flashing & rotating quickly in circular fashion. All lights on bottom.","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"06/26/2012 10:57 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/39845.html.txt","/var/www/straped/mufon/org/39845.html"],"Case Number":"39845","Log Number":"US-06262012-0026","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.540271,+-70.62837(39845)&iwloc=A&hl=en\"> mufon case (39845) map </A>","Date of the Event":"06/24/2012 10:30 UTC","trends":["There has been one other sighting in Falmouth","There were no other sightings in Falmouth on or around June 24th 2012"]}