{"Object Features":"None","Country":"United States","Weather Factors":"Unknown","Date Submitted":"06/27/2012 02:28 UTC","files":["/var/www/straped/mufon/html2text/39858.html.txt","/var/www/straped/mufon/org/39858.html"],"divs":["sighting detailswe were heading to fontana park in buchanan county iowa. we were a few miles south of the park when my son started asking \"what is that? look at that!\" he said it was a ufo. i was driving and couldn't immediately see the object but i was skeptical. then my wife saw the object out the passenger window. she said, \"oh wow, what is that?\" i still thought they were messing around, but my wife told me to pull the car over. i got onto the nearest gravel road, and i guess we were facing east when i turned onto the road. i stopped the car and got out and looked in the direction they were pointing. there was an object sort of sitting about ten feet up above the power lines. it was mostly white with not lights on it. there was an orange\\rust-colored tinge to it around the bottom and along the back of its far side. it made no noise and there were no wings, no exhaust trail. i didn't feel panicked, but i felt surprised that i was actually seeing this thing. it was clearly not a helicopter or an airplane or a balloon, which were the first three things i tried to rule out in my mind. i leaned into the car to get the phone from my wife to take a picture of the object, but when i stood up, the object was gone. my wife and son said that it began to move to the south, following the path of the power line, and then it simply flicked off, or disappeared. i did not see this happen, but the object was there one second and gone the next. we tried to follow it and backtracked off the dirt road and south on the highway for a few miles in the direction we'd come from. we didn't see it again. after going to the park, as we took the 45 minute drive home, we tried to rule out anything it could have been. i've never seen anything like it. it was not a disk or a saucer shape, but really a sort of egg shape. absolutely weird."],"Sighting Duration":"00:02:00","Case Number":"39858","Source":"MUFON","Object Shape":"Egg","map":"<A HREF = \"http://maps.google.com/maps?q=42.620818,+-91.90017(39858)&iwloc=A&hl=en\"> mufon case (39858) map </A>","City":"Hazleton","trends":["There have been no other sightings in Hazleton","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"Iowa","Object Flight Path":"Hovering then path","Log Number":"US-06272012-0008","Summary":"Driving to Fontana Park in Buchanan County. Son saw object, then wife. Pulled over, watched it disappear.","Disposition":"Unresolved","Latitude":"42.620818","Date of the Event":"06/26/2012 06:02 UTC","Longitude":"-91.90017"}