{"Date Submitted":"06/27/2012 01:23 UTC","Tags":"City","Log Number":"US-06272012-0003","Disposition":"Unresolved","divs":["sighting detailsapproximately 10:50pm est, myself and my fiance walked outside to his car before he left for work. we were walking out, and he looked in the sky, and noticed strange lights. they were towards the se, and unsure of how high in the sky. they were formed in a triangle, and all moving slowly in that formation to the east. they were red, in color and were pulsating\\flickering like a star. they were only visible for a few mins, (i'm unsure how long before we went outside). my fiance snapped a quick picture with his camera phone, then ran inside to get the camera. i looked away for a second, and looked back, and one light had disappeared. he came back out with the camera, but the other two lights moved into a line, one above the other, and both disappeared. we were unable to get another picture with the digital camera. the pic included is zoomed in on a camera phone. the lights appear to be double on each light, but they were not. that is from his hand possibly moving when taking the picture. the orange light to the right is from a street light. once the lights were gone, there was no trace of them, and i did not see them again. there was no noise or anything in the sky."],"files":["/var/www/straped/mufon/html2text/39854.html.txt","/var/www/straped/mufon/org/39854.html"],"Source":"MUFON","Date of the Event":"06/26/2012 10:50 UTC","Object Shape":"Circle","Viewing Distance":"Unknown","Summary":"Strange lights in Waterford, MI.","map":"<A HREF = \"http://maps.google.com/maps?q=42.698374,+-83.399663(39854)&iwloc=A&hl=en\"> mufon case (39854) map </A>","trends":["There have been 6 other sightings in Waterford Township","There were no other sightings in Waterford Township on or around June 26th 2012"],"City":"Waterford Township","Latitude":"42.698374","Object Flight Path":"Other","Longitude":"-83.399663","Weather Factors":"Unknown","Country":"United States","Object Features":"None","Region":"Michigan","Case Number":"39854","Sighting Duration":"00:03:00"}