{"Object Shape":"Unknown","divs":["Sighting DetailsI was in my back yard Letting my dogs do their evening business before bed. Kitchen lights were on behind me, and I turned them off to help my night vision and observe the dogs better. When turned the lights out, I noticed in the sky traveling from the south to the north between 20 and 30 lights traveling in various formations. Some diamonds. Some triangles and some squares. They were moving at the same speed in the same direction. Tried to capture with my cell pone but lights were too weak to capture at all under the circumstances. And knowing my reputation for jokes, I immediately sought witnesses. My wife and two neighbors all observed. There was no noise coming from the objects. Difficult to determine distance but they seemed to be a good distance away. They gained altitude and disappeared into the cloud cover. Cannot imagine what the lights were. Maybe military? But that can be the only explanation. Lights remained constant. O blinking or pulsing. Just solid red or orange. The lights seemed almost like a convoy. Lights would come into view and then disappear into the clouds. In total could have number 30-40, but between 20 and 30 were visible at any one time."],"Longitude":"-88.089628","Source":"MUFON","Country":"United States","trends":["There has been one other sighting in Round Lake","There were no other sightings in Round Lake on or around June 23rd 2012"],"Latitude":"42.323211","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date of the Event":"06/23/2012 11:00 UTC","Date Submitted":"06/27/2012 12:18 UTC","City":"Round Lake","Sighting Duration":"00:20:00","Region":"Illinois","Log Number":"US-06272012-0003","Disposition":"Unresolved","Summary":"Observed 20-30 lights in the sky traveling South to North from backyard.","map":"<A HREF = \"http://maps.google.com/maps?q=42.323211,+-88.089628(39852)&iwloc=A&hl=en\"> mufon case (39852) map </A>","files":["/var/www/straped/mufon/html2text/39852.html.txt","/var/www/straped/mufon/org/39852.html"],"Object Flight Path":"Straight-line path","Case Number":"39852","Tags":"City","Object Features":"None"}