{"Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","City":"Montgomery","Summary":"brightly lit star began moving, flew overhead in gradual arc turned south then disappeared","Longitude":"-86.210475","Date of the Event":"06/26/2012 09:30 UTC","Case Number":"39862","divs":["Sighting DetailsIt was nine thirty at night and I was outside on my back patio. I have made it a habit to watch the sky and the treelines with my digital nightvision monocular.. I like to observe the wonders of the universe and with NV you can see stars that you normally cannot. I was scanning the North when I heard the roar of what I knew to be a fighter jet. We have a big USAF base here and I have gotten used to seeing and hearing various jet fighter aircraft. So I am scanning the sky trying to find the strobes on the fighter jet I am hearing when I pan to the left, which is West, and notice a very bright star. I continue panning to my left.. looking South.. then I move back to my right because it has become obvious to me that the sound cannot be in that direction. As I do I notice that that bright star isn't exactly where it was before. I must admit that it is surreal when something that your mind has acknowledged as staionary suddenly isn't. The things was moving..or so I thought it was... So I moved close to my privacy fence gate and lined up the object with a stationary reference point to see if it was indeed moving.. it was... I grabbed my Droid and selected pictures at 4X zoom. I shot six images through the digital night vision device as I watched in awe as this huge white \"thing\" - which by now obviously WASN'T a star - slowly ease across the sky..totally silent which only added to the extreme creepiness of the situation. It moved towards me (Easterly direction) then made a gentle 90 degree arc moving South. I kept it in my viewfinder when suddenly it was gone. I could not reacquire it. It just vanished. I wanted to go and grab the wife, pull her outside and show it to her but I was afraid she wouldn't see it or maybe it would be gone any second.. or maybe disturbing her while she's watching TV wouldn't be a prudent thing to do.."],"Object Flight Path":"Path with directional change","trends":["There have been 659 other sightings in Montgomery","There were 5 other sightings in Montgomery on or around June 26th 2012","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Log Number":"US-06272012-0012","Date Submitted":"06/27/2012 09:08 UTC","Latitude":"32.38988","Object Shape":"Cylinder","Region":"Alabama","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.38988,+-86.210475(39862)&iwloc=A&hl=en\"> mufon case (39862) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/39862.html.txt","/var/www/straped/mufon/more/39862_submitter_file1__IMG20120626213157.jpg","/var/www/straped/mufon/more/39862_submitter_file2__IMG20120626213214.jpg","/var/www/straped/mufon/more/39862_submitter_file3__IMG20120626213233.jpg","/var/www/straped/mufon/more/39862_submitter_file4__IMG20120626213255.jpg","/var/www/straped/mufon/org/39862.html"],"Country":"United States"}