{"Case Number":"39861","Object Flight Path":"Unknown","Disposition":"Unresolved","Longitude":"-78.875037","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around June 27th 2012"],"files":["/var/www/straped/mufon/html2text/39861.html.txt","/var/www/straped/mufon/org/39861.html"],"Latitude":"36.019585","Summary":"This was not a UFO but a someone in my bedroom","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.019585,+-78.875037(39861)&iwloc=A&hl=en\"> mufon case (39861) map </A>","Region":"North Carolina","Log Number":"US-06272012-0011","Country":"United States","Weather Factors":"Unknown","Object Features":"Appendage(s)","Object Shape":"Other","Tags":"City","Source":"MUFON","divs":["Sighting DetailsI do not recall hearing any strange noises, though I am used to hearing rumbles due to my proximity to a major street in my town. Many trucks rumble by late at night. It was a strange night to start. Before getting in the bed It appeared as though the moon and stars were in the wrong location in the sky. I dismissed it because I usually do not track such things...it just felt out of place. Anyway, I was in my bed and I saw something just walk through the wall from outside.(I live on the second floor) It looked sorta like a floating pale double \"S\". It was strange...I dismissed this too and decided It was due to my exhaustion. It was at this point that I felt like someone else was in the room with me. I woke up my girlfriend and told her...she just rolled over and went back to sleep almost immediately. I attempted to go back to sleep but this being got right in my face...as if testing to see if I could detect it. I could not see it fully...mainly like a ghostly outline and some facial features. It was hunched over so I estimate that It may have stood around 3 to 4 feet tall. It had an oblong shaped head with huge eyes. I could only see an outline of the creature...it was invisible mostly. As it was almost directly infront of my face, my right eye began to feel strange...as if I just got over a migraine headache...but it only felt uncomfortable on the right eye. It sort of looked like a Zeta type being or gray alien...but it was smaller than I would expect and it appeared much skinnier. I didnt feel threatened by it but It did startle me when it got right in my face..it appeared as though I was walking through the object (my dog's kennel) right next to my bed to get in my face. I asked it to leave and it did...needless to say I did not sleep very well last night. Not out of fear, just perplexed."],"Viewing Distance":"20 Feet or Less","City":"Durham","Date of the Event":"06/27/2012 12:00 UTC","Date Submitted":"06/27/2012 07:32 UTC"}