{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.241766,+-81.431057(39860)&iwloc=A&hl=en\"> mufon case (39860) map </A>","files":["/var/www/straped/mufon/html2text/39860.html.txt","/var/www/straped/mufon/org/39860.html"],"Object Features":"None","Log Number":"US-06272012-0010","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"Ohio","Country":"United States","Source":"MUFON","Longitude":"-81.431057","Object Flight Path":"Stationary","Latitude":"41.241766","Case Number":"39860","City":"Hudson","Date Submitted":"06/27/2012 03:36 UTC","Date of the Event":"06/24/2012 10:30 UTC","divs":["Sighting DetailsMyself and a friend were driving towards hudson ohio from twinsburg ohio at approximately 1030 PM sunday evening heading south on State Route 91. As we were approaching hudson we noticed in the sky 6-8 red lights in the sky in a formation in the sky. As we spend up to find a pull off so we could get our cameras out to take some pictures the lights seemed to know we were coming so they started to flicker out. As we got to a pull off and stopped the car the lights went bring again and started to go out one by one. The last light to go off went off then flickered on again and then disappearing. Or so we thought. As we went to hudson to take some photos of the city I couldnt help but shoot some photos of the sky after what had transpired. So I began shooting some time lapse shots when I caught what I thought was a shooting star. Well upon further investigation at home I seem to have caught the red lights again with some white lights mixed in this time which wasnt seen before, plus one red light which is venturing from the clustered formation of red lights. This is my first time seeing anything in the sky and first time using this website. if you guys have any questions please feel free to contact me. I will say the cluster of lights I am referring to is on the right side of the picture between the clouds. if you would like the full picture size please email me and I can get it to you for further examination."],"Weather Factors":"Unknown","Tags":"City","trends":["There has been one other sighting in Hudson","There were no other sightings in Hudson on or around June 24th 2012"],"Summary":"pulsating lights that went out without any rhyme or reason."}