{"Date Submitted":"06/27/2012 06:41 UTC","Weather Factors":"Unknown","Longitude":"6.150816","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.200142,+6.150816(39873)&iwloc=A&hl=en\"> mufon case (39873) map </A>","Latitude":"46.200142","City":"Geneva","Tags":"City","Object Shape":"Fireball","Summary":"two orange fireballs, a small one right behind the large one, two nights in a row same time","Country":"Switzerland","Disposition":"Unresolved","trends":["There have been 2 other sightings in Geneva","There were no other sightings in Geneva on or around June 12th 1967"],"Object Flight Path":"Straight-line path","Region":"Geneva","Viewing Distance":"Over One Mile","Date of the Event":"06/12/1967 12:00 UTC","Object Features":"None","Case Number":"39873","divs":["Sighting DetailsI was a teenager living in Geneva Switzerland. We lived in a 16 story apartment at the top. My bedroom window looked out over Mt. Blanc and the Alps. I had severe insomnia so as usual I was awake around 11:30 every night. I was in bed, and heard an unusual dull roar or rumble so i sat up and looked out the window. My immediate reaction was \"oh no, there goes Italy\" because what looked to be a HUGE meteor followed by a smaller one was crossing the sky and went down behind Mt. Blanc. Nothing happened. No explosion, no bye bye Italy. I looked all through the newspapers and tv news the next day and nothing was mentioned. That next evening I was laying in bed as usual and was remembering what I had seen the night before. At the same time of night, I again heard the same dull roar, again sat up and watched the exact same orange fireball with the smaller one behind it take the same trajectory across the sky and go down behind Mt. Blanc. When i saw it both times it was going from the Alps over near the \"Aiguilles du Midi\" or past there,heading SE towards Mt Blanc and went down behind this tallest Alpine peak. One thing that has become of further interest to me is that a family member who was at that time very high in US government dealing with aviation and airspace matters came to visit us. He was doing a conference in Geneva. This was very soon after my sighting. He came into my bedroom the morning of the conference and asked me if I believed in UFO's. He then proceeded to show me some photos the gov't was looking into. He said he was a part of this and part of his job was to question air force pilots who had seen them. I am not at all sure of the month or year this happened as it was a long time ago. It seemed to be summer as i don't remember snow or heavy coats around. I've come to think the timing of that was interesting. I also think it is interesting that orange fireballs are now being seen in this country."],"files":["/var/www/straped/mufon/html2text/39873.html.txt","/var/www/straped/mufon/org/39873.html"],"Source":"MUFON","Log Number":"CH-06272012-0018"}