{"Log Number":"US-06282012-0002","Object Shape":"Saturn-like, Sphere","City":"Salem","Country":"United States","Disposition":"Unresolved","Longitude":"-122.992161","Latitude":"44.945492","Sighting Duration":"Undisclosed","Date of the Event":"06/26/2012 12:00 UTC","divs":["Sighting Details Two friends of mine and I saw a helicopter leaving the Salem airport, heading from South-West North, making a wide turn towards South-East. Went back in the house and could hear the same helicopter, getting louder(assuming it had decided to go North once more). Considered this to be strange, so I went back outside to see what was going on. Mind you, I watch military helicopters, air traffic and planes spraying chemtrails daily; what I saw that night was undoubtedly irregular, to say the least. There were two orbs about the size of our perception of the stars, though you could tell they were close. One was red and one was white, opaque, moving in a steady line from South to North, almost directly over 440 Lancaster Dr. At about 100ft.(give or take), it seemed as though the same helicopter was being towed by the orbs, as it was about ten feet from the orbs, matching their speed, though slightly wobbling, giving the impression that it was being pulled. What my friend described as a \"wafer-like craft\", pulsating white light in a circular pattern around the craft, followed the helicopter about five minutes behind. It was too low and too quiet to be an airplane or helicopter, and was reflective in nature. It sustained a straight line and speed, going from South-West to North until it disappeared over the apartments. My friends and I continued to watch the sky for a whole hour, witnessing a \"star\", heading south from North, this time appearing as though it had much more altitude. It sustained a straight line and red light, flashing white and disappearing. Then two more orbs, racing each other from North-West to North-East, until they too disappeared. The one on the left sped past the right one, and the two disappeared. Finally, ANOTHER occurence...only that time, it was a single white orb, moving from North-East to South-East before disappearing. It seems the valley is INCREDIBLY popular this time around."],"files":["/var/www/straped/mufon/html2text/39879.html.txt","/var/www/straped/mufon/org/39879.html"],"Object Flight Path":"Straight-line path","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=44.945492,+-122.992161(39879)&iwloc=A&hl=en\"> mufon case (39879) map </A>","Case Number":"39879","Date Submitted":"06/28/2012 05:40 UTC","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"101-500 Feet","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around June 26th 2012"],"Region":"Oregon","Summary":"High Traffic Above Lancaster Dr.","Tags":"City"}