{"Disposition":"Unresolved","Object Features":"None","Sighting Duration":"Undisclosed","Longitude":"-88.92757","divs":["Sighting Details My husband and I had went outside to smoke......2 out of our 6 children followed. the girls noticed these lights flying back and forth moving quickly, faster than any plane or jet. The girls pointed this out n then my husband pointed them out to me. I could not believe what I was seeing. These lights moved so quickly and would just disappear then reappear in completely different areas. The turns they made impossible for a plane, way to much movement to b a meteor falling from the sky. Then, as my husband and I are watching this one light move through the sky it vanishes the reappears about a foot away and starts to become very bright. It begins to fade just a hair then gets so bright it was as if someone was bringn a lightbulb straight at our faces. I had goosbumps and was ready to run. One again, it just disappeared. As we were discussing what had just happened my step daughter had mentioned something as she was walking back into the house. After we had seen that bright light n then witness it vanish with out a trace, all the dogs around our home started to bark. I had thought this myself but didnt want to say anything, she did though n it was odd but i figured I was being silly compared to what we had just witnessed. These things had looked like normal stars, until that one had become extremely bright that is. I dont believe in this sort of stuff and try to ignore all the hub bub about it but after that night...im a little creeped out. I live in Southern Illinois and nothing like that happens round here....we were all a little wierded out, especially when they just disappeared without a trace. Now i look for them every night to try to make sense of this."],"files":["/var/www/straped/mufon/html2text/39878.html.txt","/var/www/straped/mufon/org/39878.html"],"Latitude":"37.820605","Case Number":"39878","map":"<A HREF = \"http://maps.google.com/maps?q=37.820605,+-88.92757(39878)&iwloc=A&hl=en\"> mufon case (39878) map </A>","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Region":"Illinois","Log Number":"US-06282012-0002","Country":"United States","Object Shape":"Circle, Star-like","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering,Other","Viewing Distance":"Unknown","Date Submitted":"06/28/2012 05:28 UTC","trends":["There has been one other sighting in Johnston City","There were no other sightings in Johnston City on or around June 23rd 2012"],"Summary":"{nd} these lights kept flying around n back the got very bright and vanished","City":"Johnston City","Date of the Event":"06/23/2012 09:30 UTC"}