{"Sighting Duration":"00:03:10","Region":"Florida","Case Number":"39887","Object Shape":"Oval, Square, Rectagular","Summary":"two witnesses observed bright red-orange object traveling from east (ocean) heading west-southwest toward moon, then before passing front of moon it slowed, almost hovering and began to disappear while appearing to turn sharp left and it was gone.","City":"North Palm Beach","Date Submitted":"06/28/2012 11:02 UTC","files":["/var/www/straped/mufon/html2text/39887.html.txt","/var/www/straped/mufon/org/39887.html"],"Source":"MUFON","Weather Factors":"Unknown","Longitude":"-80.070641","divs":["Sighting DetailsWhile waiting for me to return to our vehicle, my husband began to observe this bright red-orange object coming from the direction of the ocean (east coast of Florida). As I joined him in the car I noticed he had his driver's side door open and was standing outside of the car looking up, then I asked what he was looking at and began to look up, too. This bright red-orange oval or roundish rectangular object was passing high above us moving slowly in the direction of the less-than-half-moon that was out on this very clear, cloudless night, tonight. I said, \"What is that?\" And he said he had no idea. We are former journalists and now also continue to work in a field involving great powers of observation and ability to describe accurately what we see. And neither of us has ever observed anything that we could not reasonably identify before. The object began to slow and almost becoming stationary, start to flicker as its glowing red-orange light began to disappear, as if it were turning sharp left - as if we had been observing the 'broadside' of the object. I shot video of it with my cell phone which captured the unique color of the object, shows it moving toward the moon, slowing, and flickering to a state where it was no longer able to be observed, as if it were turning, and then, it simply disappeared. Had it not disappeared that way, we probably would have thought it was some kind of aircraft, though an unknown aircraft to both of us. But it moved too slowly, behaved too strangely, and had a color completely new to both of us. When it disappeared the way it did, we both realized we had probably seen something quite special. We are hoping we are not the only ones to have seen it."],"map":"<A HREF = \"http://maps.google.com/maps?q=26.812126,+-80.070641(39887)&iwloc=A&hl=en\"> mufon case (39887) map </A>","trends":["There have been 4 other sightings in North Palm Beach","There were no other sightings in North Palm Beach on or around June 28th 2012"],"Country":"United States","Latitude":"26.812126","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Date of the Event":"06/28/2012 09:16 UTC","Log Number":"US-06282012-0010","Object Features":"None"}