{"Sighting Duration":"09:30:01","Object Features":"Unknown","Date of the Event":"06/24/2012 09:30 UTC","Longitude":"-119.415302","trends":[],"Summary":"Starlike lights disappearing several times & reappearing in various locations.","Date Submitted":"06/28/2012 08:09 UTC","Case Number":"39882","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=36.787261,+-119.415302(39882)&iwloc=A&hl=en\"> mufon case (39882) map </A>","Region":"California","divs":["Sighting DetailsIt was approx. 9:20 to 9:30p.m. I was outdoors getting my dogs in the house for the night looking at the sky while waiting for them to come in. I noticed an object originally thinking it was a brillant sparkling star, but not many stars were in view yet & it started moving extremely fast & was sparkling bright. It went to the SE horizon & just dissapeared. I thought at first it must have disappeared in cloud cover but didn't think there were any clouds. I kept looking around & it apeared again in a different location, but still Eastward, then went across the sky a short distance & disappeared again. I seen it approx. 3 or 4 times then ran in the house to get my husband. He came quickly but we didn't see anything for a few minutes, although noticed a helicopter in the same area now. Beale AF Base it not far from our location. A few minutes later it appeared again overhead moving extremely fast toward the SE again & disappeared. It appeared to resemble a very brillant star, shape, size etc. No trails, sounds, beams or other noticable features, just a very fast moving, disappearing starlike object. Shortly after the sightings there were a couple planes in that area but the object appeared to be gone or disappeared from view. My thoughts are nothing moves, looks or disappears & reappears in different locations like that."],"Viewing Distance":"Unknown","Object Flight Path":"Other","Disposition":"Unresolved","Latitude":"36.787261","Country":"United States","files":["/var/www/straped/mufon/html2text/39882.html.txt","/var/www/straped/mufon/org/39882.html"],"Weather Factors":"Unknown","City":"Undisclosed","Log Number":"US-06282012-0005","Tags":"City","Source":"MUFON"}