{"Sighting Duration":"Undisclosed","Summary":"11 foot diameter circle in grass with 5.5 inch wide grey ring","Object Shape":"Unknown","Country":"United States","Log Number":"US-06282012-0004","Latitude":"38.012297","divs":["Sighting DetailsThree generations of one family (witnesses from youngest to oldest G1, G2, and G3) live in the house at the location of the circle in Greenville, VA. Witness G1 notified his mother (witness G2) on Monday 18-Jun-2012 that there was a grey circle in the backyard. Witness G2 sent a text message Monday 18-Jun-2012 to her friend (witness S1) in Stuarts Draft, VA about the circle. Witness S1 and her husband (witness S2) went to Greenville, VA on Tuesday 19-Jun-2012 to view the circle and took two pictures (see attached pictures greenville1.jpg and greenville2.jpg). Witness S2 contacted Rob Swiatek of MUFON, and Rob Swiatek recommended soil samples be taken that day due to impending rain. During a second visit on Tuesday 19-Jun-2012 to Greenville, VA, witness S2 took four soil samples as suggested by Rob Swiatek and took measurements of the circle which was approximately 11 feet in diameter with the grey ring around the circle having a width of approximately 5.5 inches. During the Tuesday 19-Jun-2012 visits to Greenville, all five witnesses were present at the site of the circle. During a subsequent visit to the site on Sunday 24-Jun-2012 by MUFON FI Don Braffitt and witness S2, the circle was still visible in the grass, and more detailed measurements and pictures were taken. Unfortunately no additional soil or vegetation samples were obtained Sunday 24-Jun-2012 because the homeowner (witness G3) asked MUFON and witness S2 to leave the property before any additional samples could be taken."],"Tags":"City","files":["/var/www/straped/mufon/html2text/39881.html.txt","/var/www/straped/mufon/org/39881.html"],"Source":"MUFON","Region":"Virginia","Weather Factors":"Unknown","Case Number":"39881","City":"Greenville","map":"<A HREF = \"http://maps.google.com/maps?q=38.012297,+-79.152643(39881)&iwloc=A&hl=en\"> mufon case (39881) map </A>","Date of the Event":"06/18/2012 12:00 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Disposition":"Unresolved","trends":["There have been 2 other sightings in Greenville","There were no other sightings in Greenville on or around June 18th 2012"],"Date Submitted":"06/28/2012 07:51 UTC","Longitude":"-79.152643","Viewing Distance":"Unknown"}