{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.764633,+-79.01721(39909)&iwloc=A&hl=en\"> mufon case (39909) map </A>","Date of the Event":"06/26/2012 08:45 UTC","Log Number":"US-06292012-0005","Date Submitted":"06/29/2012 01:48 UTC","Disposition":"Unresolved","divs":["Sighting DetailsDay one June 26, 2012 friends and family at home on farm farm back patio in mount airy by Virginia border. Young child noticed bright star before dark at 8:45 pm.. Star got brighter then popped bright to dim then split into 2 first stayed stationary, second looted downward. Then both disappeared after 30-45 seconds. Day 2 june 27, 2012 family same time same description only star appeared to move from 60 degrees north overtop of family slowly. Called friend across town to validate seeing what I see, he did and was approximately 10 miles away as the crow flies. Starlike object stopped then simulated the same as night before by bright popping and turning into 2. Objects appears to change direction then disappeared being replaced by 2red lights immediatelynin a cross fashion with white light steady on flying to east towards Winston-Salem NC. Day 3 June 28,2012 tonight. Drove to Winston-Salem to purchase high power spotting scope.made purchase then stepped put of store into parking lot at 8:45-8:50 and wife and kids all were looking at 2 objects again overhead of Winston-Salem NC. Commercial aircraft flew over at roughly same elevation a minute or so after and could be seen clearly but other 2objects looked like night before with 2 red lights on again and no noise at all. Commercial aircraft was heard with NP. Common pattern here is 8:45 or so before darkness falls. Tried recording video on day 2 when in sight but recording just was black with gargles buzz shot another video of two red lights in cross formation for only couple seconds as it flew overhead. Now have digital camera iPod and spotting scope ready for night 4 if we are lucky we can catch it again and maybe shoot some fireworks up at it. Maybe just star wars project from DOD."],"files":["/var/www/straped/mufon/html2text/39909.html.txt","/var/www/straped/mufon/org/39909.html"],"trends":[],"Summary":"Have seen this 3 days in a row at 8:45pm to 8:55pm","Object Shape":"Cross, Flash, Star-like","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.764633","Country":"United States","City":"Undisclosed","Case Number":"39909","Region":"North Carolina","Tags":"City","Longitude":"-79.01721","Object Features":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change"}