{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Yreka","Case Number":"39919","Log Number":"US-06292012-0015","Latitude":"41.721142","files":["/var/www/straped/mufon/html2text/39919.html.txt","/var/www/straped/mufon/org/39919.html"],"Object Features":"Unknown","Date Submitted":"06/29/2012 02:21 UTC","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.721142,+-122.639357(39919)&iwloc=A&hl=en\"> mufon case (39919) map </A>","Country":"United States","Longitude":"-122.639357","Viewing Distance":"Unknown","divs":["Sighting DetailsWe were at Les schwab tires getting a blown out tire replaced, we were done and went out back to hook up the travel trailer when we saw the lights. Fast bright streaking lights to South caught our attention. Didn't know what it was, we stopped and watched them, I ran back up front and caught the tire guy before he went home, he didn't know what is was. They looked like bright lights, small in size, they moved very fast like a blur, they appeared to be chasing each other 2 of them at time most of the time, 3rd would just come in and out randomly, sometimes more of them 2 or 3 more could be seen out to the sides in the distance. Several time 2 of them were travel in a parallel direction and the 3rd would speed in from the other direction and pass between them. Excited, very excited, it something I have never seen before, couldn't explain what it was but I liked it, we tried to get video on a cell phone but battery was too low and would not record. We watched this for about 15 to 20 minutes or more, we finally had to leave to keep on schedule for home work time, on our way to the Interstate we drove past what we thought was area they were in, I forgot to look but the other passenger looked and saw nothing. I am very serious about talking to someone from MUFON, if there were other people who saw this I am interested, I would like to hear an opinion from the experts to verify if they think this was a non terrestrial sighting."],"Object Flight Path":"Path with directional change","Date of the Event":"06/26/2012 10:38 UTC","trends":["There have been 6 other sightings in Yreka","There were no other sightings in Yreka on or around June 26th 2012"],"Region":"California","Weather Factors":"Unknown","Object Shape":"Flash, Unknown","Summary":"2 to 3 objects appeared to be chasing each other, occasionally a 4 to 6th would appear out to the sides in the distance."}