{"Disposition":"Unresolved","Longitude":"-117.144123","Summary":"\"Sparklers\" undulating/dancing through the sky","Region":"California","City":"San Diego","Latitude":"32.828391","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/3991.html.txt","/var/www/straped/mufon/more/3991_submitter_file1__1st-sighting.png","/var/www/straped/mufon/more/3991_submitter_file2__2nd-sighting.png","/var/www/straped/mufon/org/3991.html"],"Source":"MUFON","Object Shape":"Star-like","Weather Factors":"Windy, Light","divs":["Sighting DetailsI saw these UFOs twice. I do not claim they are extraterrestrial in origin, but I've never seen anything like them before. First time was when changing out some RAM in a server at work. As I walked out of the data center in our Kearny Mesa complex, I saw what appeared to be a \"dancing\" street light, sodium yellow, leaving strange trails in the sky, close to the horizon. It eminated no sound at all, but was quite distant. The light source was HIGHLY specular -- like very bright pinpricks of sodium-yellow light. Behind them were trails of sparks. It was weaving very slowly back and forth, slowly descending until it disappeared behind the trees, where I could see the light source extinguished. My initial reaction was that this was some kind of night-time gimmick of the air shows that Miramar Marine Base was putting on at the time. However, as my house is used as the turn-around point for nearly all the aircraft that seems to fly in these shows, I must note that NO aircraft was flying over my home at the time, and these objects made NO sound at all. Therefore, it is strongly unlikely to be airshow related, at least using military jets. Then, as I was driving home, having just merged off the Clairmont Mesa onramp, south-bound on the 163, heading towards 52 West, I noticed a *pair* of these things gliding through the sky. One was flying a straight line, while the other was undulating sinusoidally around it. Both were leaving spark trails, that often seemed to drop reasonably close to the ground. They appeared to be flying in a westerly direction, almost heading in the same direction as my home, and did not appear to be over Miramar base at the time. When arriving home, I didn't see anything, and didn't hear anything either."],"Object Flight Path":"Straight-line path,Path with directional change,Other","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around October 15th 2005","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Date Submitted":"10/15/2005 07:15 UTC","Viewing Distance":"Unknown","Date of the Event":"10/15/2005 07:15 UTC","Country":"United States","Log Number":"US-10152005-0003","Case Number":"3991","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.828391,+-117.144123(3991)&iwloc=A&hl=en\"> mufon case (3991) map </A>"}