{"trends":["There have been 2 other sightings in York","There were no other sightings in York on or around June 20th 2012"],"files":["/var/www/straped/mufon/html2text/39928.html.txt","/var/www/straped/mufon/org/39928.html"],"Weather Factors":"Unknown","Summary":"An on going event that started 6/20/12. We are scared any help or info please.","map":"<A HREF = \"http://maps.google.com/maps?q=43.11785,+-70.676701(39928)&iwloc=A&hl=en\"> mufon case (39928) map </A>","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Region":"Maine","Date Submitted":"06/29/2012 09:50 UTC","Case Number":"39928","Log Number":"US-06292012-0024","divs":["Sighting DetailsAt about 12:15am eastern time my wife and I went to sit out on the deck for some fresh air after a very hot and humid day. The temperature had gotten in to the nineties on the 20th of June 2012. We sat over looking the woods for almost an hour, it was the first night that the fire flys had come out. As we sat we both began to notice that all the sounds of the woods ceased. All the crickets stopped, all the peepers stopped in the pond behind the house. It was at this time I noticed something in the yard. At first I thought it may be a skunk because all I could make out was a little bit of white. As I stood up off my chair to investigate, the patch of white that I had seen began to back up and admit a very dim glow. At first I was bit taken back my this and told my wife to stand up and take a look. By the time she stood up the glow of the life form had gotten a small amount brighter and backed off to the other side of the fence where it stopped and seem to focus towards us. My wife stepped towards the glow now about 5 yards in front of us and again then glow got a bit brighter. It was very noticeable that when you took a few steps towards forward it got one step brighter. We felt that this thing was observing us but we did not feel threatened. For twenty minutes or so this had gone on and that is when we decided to try to get closer. No sooner that we thought about getting closer a second glow appeared out of nowhere five feet to the left of the first glow. The second glow was a lot brighter and was clearly moving side to side. At this point my wife and I got frightened and walked back up on to the deck not taking out eyes of the two glowing forms for a second. Once back on the deck the second glow started moving towards us at a fast pace about ten to fifteen yards in front of us. Once it cleared the fence and was clearly in our yard we retreated to the house. We were to scared to go out side again so we decided to call it a night. June 21st 2012. After the events of the previous night my wife and decided that we would investigate in the back yard to see if what we saw the night before would return. The night was very reminiscent of the first night. There were no sounds of the Maine night life to be heard. We laid out on the deck observing the sky for a an hour when my wife noticed something up in the air. Best described as an extremely white bright light shooting across the sky. The main shape of the object was oblong or rice like. It was brighter then anything we had ever seen and moving very fast. The most bizarre characteristic of this bright oblong light where what appeared to be almost appendage or tentacle like things coming of from each side of it. They moved side to side extending and retracting as it made its way across the sky west to east out towards the ocean. We both found this to be very strange and proceeded to do some research on the iPad that we had brought out. It was at this time that I had focused my attention back towards the woods where we had seen the glow the night before. After looking for only a couple of seconds the glow started to appear again slowly on the opposite side of the fence. I alerted my wife to the arrival of the glow but this time it was not as bright as the night before. We were a few yards further away then the first night and we had observed that the closer we got the brighter it got, the further away we got the dimmer it got. There was only the glow which we both felt was the"],"Tags":"City","City":"York","Longitude":"-70.676701","Latitude":"43.11785","Date of the Event":"06/20/2012 01:15 UTC","Object Features":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON"}