{"Latitude":"40.934743","Case Number":"39935","Country":"United States","Log Number":"US-06292012-0031","map":"<A HREF = \"http://maps.google.com/maps?q=40.934743,+-73.903504(39935)&iwloc=A&hl=en\"> mufon case (39935) map </A>","divs":["Sighting Detailshalfway thru the concert an illuminated object slowly started appearing from asoutherly direction aprox 25 miles per hour at aprox 3 to 500 ft above and crossed dirictly over the pier while van morrison performed on the stage on the pier. the object an oval set of lights moved steadily on an unwaivering path no audidle sounds of engines or propulsion were heard unfortunately video cameras or recorders were not allowed or on the market during the mid 80s .the object seemed dark to transparent in the center and appeared to be atleast 300 ft long. some other people at the concert also observerd the object and pointed at it. it took about 30 minutes to cross over the pier from first visibility to the time it finally disappeared into yhe horizon its an unforgetable event for and i can still recall it clearly. my coworker and close friend was seated next to me and we were both in awe. i never heard any other reports about it.in the news or in the papers all i can say is i will never forget it and what isaw was not of this world."],"Object Shape":"Oval","City":"Yonkers","Disposition":"Unresolved","Date of the Event":"07/10/1986 09:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Source":"MUFON","Region":"New York","Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-73.903504","trends":["There have been 6 other sightings in Yonkers","There were no other sightings in Yonkers on or around July 10th 1986"],"Date Submitted":"06/29/2012 11:19 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/39935.html.txt","/var/www/straped/mufon/org/39935.html"],"Summary":"u,fo,slowly appeared from south along the hudson river crossing over the pier during van morrison concert and slowly disappeared on anothernly straight line path","Weather Factors":"Unknown"}