{"Summary":"Large diamond shaped object came out of 6 lights and hovered over my head as im standing on the roof of building","Disposition":"Unresolved","Country":"United States","divs":["Sighting Detailswatching 6 round lights slowly move up the east river. changed directed and appeared near the empire state building. then appeared over our heads as a single solid white radiating light object over our heads as we stood on the roof of a six story building. A transparent white aura emanated from the object and fell upon us. there were no windows and the object looked like the star of Bethlehem. its pointed edges gistened and sparkled. this object inspired the fear of death from being thrown off the roof of the building in case it would land on the roof. as we became more hysterical and frightened. the object seemed to be aware of our mental state and blinked off. we didnt see it anymore. it didnt fly away. it simply disapeared. It was the size of a tall building. it lasted from 9:50pm to 10pm. after this event, i was visited by 3 reptilian beings, in the middle of the night, who scared me. right before they appeared, i became paralyzed and couldnt see, move or speak. they had alligator skin, charcoal in color, almost black. they were about 3 to 4 feet tall. they wore tight blue uniforms. only their faces and hands were uncovered. one of them was missing feet, one was missing a head, and the last one had all body parts. they spoke to me telepathically as they had no mouths. they had huge eyes and 2 small dots where the nose is supposed to be. i also saw no ears. telepathically they told me that if they could paralyze me, they could paralyze our nuclear weapons. the instant this thought was conveyed, they put me asleep, even though they never touched me. put me to sleep and next thing i know, i woke up in the morning with terrors, and fears which lasted for weeks. i couldnt tell anyone. for fear i would be seen as insane. as i look back, they didnt really hurt me or probe me, and i have never missed any time. i have had other visitations and as a result wrote and entire record which was recorded and published. the record was a documentation of some of my ufo sighting and visitations. thanks for listening. jane allyson"],"Weather Factors":"Unknown","Region":"New York","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 4th 1979"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/39939.html.txt","/var/www/straped/mufon/org/39939.html"],"City":"New York","Viewing Distance":"21-100 Feet","Tags":"City","Longitude":"-73.996773","Date of the Event":"07/04/1979 09:50 UTC","Case Number":"39939","Source":"MUFON","Date Submitted":"06/30/2012 12:38 UTC","Object Shape":"Diamond, Star-like","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.722713,+-73.996773(39939)&iwloc=A&hl=en\"> mufon case (39939) map </A>","Log Number":"US-06302012-0002","Latitude":"40.722713","Object Flight Path":"Stationary"}