{"Country":"United States","Tags":"City","divs":["Sighting DetailsUFO appeared to be bright object in dark sky around 11:30 p.m. over a golf course. Very bright lights on small? object blinked, and I believe two very bright red lights were on each side of object. Object was shaped like a cone hovering for a long time in one spot. No sound was emitted. Then object moved very slowly to the left, then hovered again. I was walking the dogs. We waited for about 15 minutes in which it moved very slowly, and finally rose higher skyward and appeared to disappear, or dim as it rose. It was a perfectly clear night, but appeared to disappear into \"clouds\" that weren't there, as it rose and just \"went out\". When I came into the house, my friend had been observing it from the deck of the house and was shocked as it was her first \"sighting\". I am always looking as I have seen several over the years. I contacted our weather authority at the local news station, but he said none were reported by anyone else that he knew of. Trust me, it was there. Strange that I have lived her for several years, and this is the second sighting I have had in two weeks or less...both being very different in structure, and one at night and one during the day. Both vanishing before my eyes."],"Date Submitted":"06/29/2012 10:21 UTC","Region":"Ohio","Longitude":"-84.626164","files":["/var/www/straped/mufon/html2text/39933.html.txt","/var/www/straped/mufon/org/39933.html"],"Latitude":"39.263561","Object Shape":"Cone","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 82 other sightings in Cincinnati","There were 2 other sightings in Cincinnati on or around June 19th 2012"],"City":"Cincinnati","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Other","Log Number":"US-06292012-0029","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.263561,+-84.626164(39933)&iwloc=A&hl=en\"> mufon case (39933) map </A>","Date of the Event":"06/19/2012 12:00 UTC","Summary":"Appeared to spin/hover. Flashed bright white lights with what appeared to be two red lights across from each other.","Viewing Distance":"101-500 Feet, Unknown","Case Number":"39933"}