{"Viewing Distance":"101-500 Feet","Region":"Missouri","Log Number":"US-06292012-0032","Object Shape":"Sphere","Date of the Event":"06/26/2012 10:50 UTC","Tags":"City","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around June 26th 2012"],"Case Number":"39936","divs":["Sighting DetailsAs reported to ASD by phone: I was walking to my the house at 10:15 PM when I saw what I thought was the B-2 Stealth Bomber fly over or near Lake City Army Ammo plant in Independence, Missouri which is not far from my house. This is a no-fly-zone so I was surprised to see anything flying over the area. The plane had three bright lights shining down and it was very loud. At 10:50 PM I was getting ready for bed and turning the lights off in the house when I saw a bright white light through my window. It was hovering at approximately 200 feet above the ground in the area of Lake City. The trees are approximatley 100 feet tall and this object was another 100 feet above them. It looked very strange, so I called my wife and we both went outside to get a better look at it. It would take at half-dollar held at arm's length to cover it up, so it was larger than a star or planet. The light was extremely bright, like a big spot light, and it had a red glow around the outside of it. There were planes in the distance at the same time as this event. We watched this object for about 10 minutes then the object suddenly shot straight up into the air at a very high rate of speed, then to the south, then to the west, than back to its original location. There was no sound at all. At this point we were rather shaken. Then it moved away from west to east very slowly and out of sight. This was definately not a plane or helicopter. It moved too fast and there was no sound. I'd like to know if other people saw this."],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=39.074245,+-94.263959(39936)&iwloc=A&hl=en\"> mufon case (39936) map </A>","City":"Independence","Summary":"Large bright white object with red glow hovered then shot straight up into the sky","Disposition":"Unresolved","Weather Factors":"Unknown","Date Submitted":"06/29/2012 11:33 UTC","files":["/var/www/straped/mufon/html2text/39936.html.txt","/var/www/straped/mufon/org/39936.html"],"Country":"United States","Sighting Duration":"Undisclosed","Object Features":"None","Source":"MUFON","Longitude":"-94.263959","Latitude":"39.074245"}