{"City":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-06292012-0027","Longitude":"-81.159684","Source":"MUFON","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=33.839371,+-81.159684(39931)&iwloc=A&hl=en\"> mufon case (39931) map </A>","Latitude":"33.839371","divs":["Sighting DetailsI took several photos of my car at a scenic location. Several of which where taken in quick order. The first two were nearly identical and no more than a second or two apart. I did not notice anything out of the ordinary. Weeks later when enhancing the first photo for black and white effects and sharpening the image I got the neat picture I was looking for which enhanced the suspension details. When I then went back to the full picture to see if it was what I wanted as a total picture I noticed something above the mountain in the background that stood out. I looked at the original and in that picture it appeared to be a small horizontal cloud hanging parallel to the mountain top. I checked the other photos the second of which was taken a second of two after the first photo. No such cloud. It was a hazy but cloudless day. When zoomed it appears as a cigar shaped object. A zoom of the enhanced black and white startled me. I don't think it was a cloud which would have appeared and disappeared within a second or so. It appears to be a solid object. It is unidentified to me. I've checked the camera and nothing is on the lens or the sensor. The camera was a Nikon D90 digital. I have attached the original in HD and the enhanced black and white showing the \"cloud\" and the picture taken a second of so later."],"Country":"United States","Object Flight Path":"Unknown","trends":[""],"Region":"South Carolina","Date of the Event":"05/15/2012 12:00 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"39931","Tags":"City","files":["/var/www/straped/mufon/html2text/39931.html.txt","/var/www/straped/mufon/more/39931_submitter_file1__DSC0414.JPG","/var/www/straped/mufon/more/39931_submitter_file2__WTF.jpg","/var/www/straped/mufon/more/39931_submitter_file3__blowup.jpg","/var/www/straped/mufon/more/39931_submitter_file4__blowupwth.jpg","/var/www/straped/mufon/more/39931_submitter_file5__DSC0415.JPG","/var/www/straped/mufon/org/39931.html"],"Date Submitted":"06/29/2012 10:07 UTC","Viewing Distance":"Over One Mile","Summary":"when exhaming photos I found an object in first photo which wasn't present in 2nd photo a second later","Object Features":"Other, Unknown"}