{"divs":["sighting detailsdescription from witness (from e-mail): last week, on either thursday or friday, september 22 or 23,2005, i was traveling south on the 605 freeway. i had just passed the intersection of the 605 and the 60 freeway, near el monte, ca. the time was around 6:30 pm, and the sub had just gone down. there was still adequate daylight in the sky, when i noticed a long line of white smoke in the sky. a flying object was leaving this white smoke trail, doing several loops in the sky. i could not see the type of flying object, but the white smoke trail was coming from the west and the object was travelling quickly towards the east. thge object was not directly above me, but maybe 40-50 miles to the southwest. the end of the smoke trail was dissipating and colored orange\\red by the sun that had just set in the west. i watched it for about 5 minutes as i travelled south on the 605, and i noticed that other drivers were also gazing upwards and perplexed. suddenly, the flying object stopped emitting the strong white smoke trail, but i could still see by its shadow that it was moving eastward. in an instant, it turned 90 degrees and seemed to jet in a southernly direction. the object moved quickly and was at a very high altitude from what i would estimate. i initially thought it was some air force plane dumping gas, or maybe the combination of the setting sun's light on the high altitude plane's emissions, but the 90 degree turn threw me off."],"Object Flight Path":"Path with directional change","Latitude":"34.075821","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.075821,+-118.022477(3994)&iwloc=A&hl=en\"> mufon case (3994) map </A>","City":"El Monte","Case Number":"3994","trends":["There have been 7 other sightings in El Monte","There were no other sightings in El Monte on or around September 22nd 2005"],"Viewing Distance":"Over One Mile","Log Number":"US-10172005-0001","files":["/var/www/straped/mufon/html2text/3994.html.txt","/var/www/straped/mufon/org/3994.html"],"Sighting Duration":"06:30:00","Object Shape":"Unknown","Disposition":"IFO","Tags":"City","Summary":"Flying object with white smoke trail makes 90 degree turn.","Date Submitted":"09/22/2005 12:00 UTC","Object Features":"Unknown","Source":"MUFON","Country":"United States","Longitude":"-118.022477","Region":"California","Date of the Event":"09/22/2005 12:00 UTC"}