{"Region":"Massachusetts","Object Features":"None","Date of the Event":"06/29/2012 11:20 UTC","City":"Boston","Sighting Duration":"Undisclosed","Longitude":"-71.083297","Disposition":"Unresolved","Latitude":"42.283449","Object Flight Path":"Path with directional change","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around June 29th 2012"],"Summary":"Blue, red, white flashing rather large object hovering!","Object Shape":"Flash","divs":["Sighting DetailsIt first started on the 27th of July, I am intrested in UFO activity so I just happened to look out of my bedroom window is was about 11.10pm and there seemed to be no stars in the sky then all of a sudden I spotted one, as I looked at it I thought I saw a hint of blue in it so I got my telescope and focused in on as much as I could and it was blue, red, white green all sorts of colours it seemed to be quite a distance I couldn't make out a shape just extremely bright lights I watches it for about a hour and it seemed to move slowly to the right then up down but very slow, following night it was very cloudy but at about 12am there was a break in the cloud and it was in the exact same place! ... I watched for only a minute as the clouds came back over the following night I stood at the window looking at that spot and it wasn't there and I really wanted to show my partner I stop there for about 10 seconds looked back and it appeared out of nowhere looking bigger then the previous nights I looks through my telescope but I still couldn't make out a shape. My partner looked at it through the telescope and he couldn't understand it ... And then last night at around 11pm again low n behold it was there much closer this time but again still can't make a shape out.... I'm going to drive towards it tonight if it shows up see if I can get some footage!"],"Tags":"City","Date Submitted":"06/30/2012 07:46 UTC","Viewing Distance":"Over One Mile","Country":"United States","Log Number":"GB-06302012-0011","map":"<A HREF = \"http://maps.google.com/maps?q=42.283449,+-71.083297(39949)&iwloc=A&hl=en\"> mufon case (39949) map </A>","files":["/var/www/straped/mufon/html2text/39949.html.txt","/var/www/straped/mufon/org/39949.html"],"Source":"MUFON","Case Number":"39949","Weather Factors":"Unknown"}