{"Viewing Distance":"Unknown","Date Submitted":"06/30/2012 12:55 UTC","Object Features":"Unknown","divs":["Sighting DetailsMe and two other friends had been out in the street after a terrible storm that included wind over 80mph. Many trees were down and we had been standing in the driveway looking at one of them. There was still lightening and I looked up and immediately said \"LOOK!\" It was an orange ball almost resembling fire racing across the sky under the (already low) clouds. It then came to a complete halt in the sky and hovered all the time flickering like fire. Then the sky flashed an orange tone very different from the lightening that was happening. It got smaller and smaller and eventually flickered out and left a black circular looking cloud or trail. When looking at a plane which we saw at the same time, this object was 3 to 4 times the size of a normal airplane light. It was moving much faster than anything I had seen before in the sky. I called and reported it about an hour later after being told to do so. I was informed that over the last 11 months there have been a very very high number of reported sightings of this. On of the people I was with did get a short video of it hovering and getting smaller then disappearing."],"Case Number":"39953","Longitude":"-87.961399","Sighting Duration":"Undisclosed","Log Number":"US-06302012-0016","Object Flight Path":"Undisclosed","Summary":"Orange fiery ball of light races across sky,hovers and disappears","Weather Factors":"Unknown","trends":["There have been 23 other sightings in Homer Glen","There was one other sighting in Homer Glen on or around June 29th 2012"],"Object Shape":"Fireball","Region":"Illinois","files":["/var/www/straped/mufon/html2text/39953.html.txt","/var/www/straped/mufon/org/39953.html"],"Country":"United States","Date of the Event":"06/29/2012 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.622894,+-87.961399(39953)&iwloc=A&hl=en\"> mufon case (39953) map </A>","Disposition":"Unresolved","Latitude":"41.622894","Tags":"City","Source":"MUFON","City":"Homer Glen"}