{"Viewing Distance":"Over One Mile","Sighting Duration":"00:01:00","divs":["Sighting DetailsAround 9:30pm central, I was in my home in Altona IA. I went to shut the blinds on the east windows when I noticed a large lit object on the horizon. It caught my attention because it was larger and lower than an airplane. As it approched, traveling from east to west, I observed that it appeared to be made of 3 hoizontal bars of white light in an oval shape. I then went on the back deck to get a better view because I had never seen anything like this before. As the object got closer, the bars of light appeared to somewhat merge. The moon was just coming up and was also almost full. When the object passed behind the radio tower it was glowing and seemed as big as the moon and I then knew I would get a good look at it because it was going to pass in front of the moon. The object seemed to slow down after passing by the tower and when it got to the moon, the light completely dissappeared and a very small black disc traveled across it's face. The light reappeared after the disc had completely travelled across the moon. It then slowed to almost a stop and then the light disinegrated. I watched the sky for about 5 minutes but nothing else occurred. I have never seen anything like it before and still find the event unbelievable."],"Longitude":"-93.450683","map":"<A HREF = \"http://maps.google.com/maps?q=41.657199,+-93.450683(39954)&iwloc=A&hl=en\"> mufon case (39954) map </A>","Date Submitted":"06/30/2012 02:52 UTC","Disposition":"Unresolved","Case Number":"39954","Date of the Event":"06/01/2012 09:30 UTC","Tags":"City","Log Number":"US-06302012-0017","files":["/var/www/straped/mufon/html2text/39954.html.txt","/var/www/straped/mufon/org/39954.html"],"Region":"Iowa","Latitude":"41.657199","City":"Altoona","Object Features":"None, Unknown","Country":"United States","Weather Factors":"Unknown","trends":["There has been one other sighting in Altoona","There were no other sightings in Altoona on or around June 1st 2012"],"Object Flight Path":"Straight-line path","Summary":"Large light in sky that crossed moon & then disinegrated","Object Shape":"Disc, Oval, Sphere, Other","Source":"MUFON"}