{"divs":["Sighting DetailsI am a newspaper motor carrier. Just a few minutes before 4 am, the morning of saturday june 30th 2012, I was traveling westbound on east indiana highway 46, heading back to my hometown of greensburg indiana. I just completed my new point route, where a bright blue light suddenly appeared in the darkness, and captured my total attention. I first looked down near the railroad track, on my left side, thinking it might have been a local train. There were no reflective blue light above the treetops, where I typically would see a light of a train going through. At this 45 degree angle, where this light was, I pondered if this could have been fireworks, lightening, or a blown transformer. This object was so bright it was brighter than a football fields' stadium lights, and although as baby blue in color,I knew it could not have been fireworks or a transformer, as high up in altitude it was and how fireworks seemed to go up explode out and then dissipate. this seems to just appear out of nowhere and seemed almost as bright as a star and it's immense size seemed to be more than several city blocks in diameter by the depth of perception I saw from my car as I was going 55 miles per hour with no traffic, and a perfect view from my dashboard. The object just disappeared out of plain sight within about 3 seconds. I wondered if I should call 911 as I thought this could have been like a bomb, and thought surely others may have seen it as well. Then the rational thought of law enforcement hearing this case and them searching my vehicle was not a proper channel I thought I should take. I consulted a friend and decided to send this directly to mufon. I have no idea of what this object was or could be but I do know it is nothing that we have seen before."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.336522,+-85.491888(39958)&iwloc=A&hl=en\"> mufon case (39958) map </A>","Weather Factors":"Unknown","Object Features":"Undisclosed","Log Number":"US-06302012-0021","Date Submitted":"06/30/2012 08:03 UTC","Region":"Indiana","Longitude":"-85.491888","Summary":"massive emission of a bright blue light, 3 seconds duration, no sound","Sighting Duration":"00:00:03","City":"Greensburg","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere","Source":"MUFON","Case Number":"39958","Latitude":"39.336522","Date of the Event":"06/30/2012 03:56 UTC","Country":"United States","trends":["There have been 13 other sightings in Greensburg","There were no other sightings in Greensburg on or around June 30th 2012"],"files":["/var/www/straped/mufon/html2text/39958.html.txt","/var/www/straped/mufon/org/39958.html"],"Object Flight Path":"Stationary"}