{"trends":["There have been 3 other sightings in Auburn","There was one other sighting in Auburn on or around June 30th 2012"],"Source":"MUFON","Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Circle","City":"Auburn","Longitude":"-76.601168","Region":"New York","Case Number":"39978","Disposition":"Unresolved","Summary":"Saw 15 red orbs while looking South, orbs were traveling East , circling each other .","Date Submitted":"07/01/2012 02:11 UTC","Viewing Distance":"Unknown","Log Number":"US-07012012-0007","files":["/var/www/straped/mufon/html2text/39978.html.txt","/var/www/straped/mufon/org/39978.html"],"Latitude":"42.941515","Object Features":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsI was at work on my break and noticed other co-workers looking at something in the sky, it drew my attention. I then saw 15 red orbs circling each other across the horizon moving in an Eastward direction while looking South in the sky. I was unsure of what the objects were as I have never seen anything like it before. The red orbs didn't flash or blink, it was solid red light, from the distance I was standing at they appeared to be approximately softball sized. The light was too big to be any normal aircraft and it was not fireworks based on the fact that if it were fireworks they would travel vertically and then possibly drift a little and go out. These red orbs traveled quite a distance across the sky in a short period of time and as I said they were circling each other. It was too dark out and too great of a distance away to tell if it was one object with several lights or if they were separate objects circling each other, in all I counted 15 lights which in my opinion appeared to be separate objects. The 15 red orbs traveled out of our line of sight and disappeared. Myself and my 3 other co-workers were shocked at what we were seeing, all of us were in awe and disbelief and ruled out every ordinary explanation....what we saw were 15 UFO's."],"Date of the Event":"06/30/2012 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.941515,+-76.601168(39978)&iwloc=A&hl=en\"> mufon case (39978) map </A>","Weather Factors":"Unknown"}