{"divs":["sighting detailsjune 9th 2012, long beach ca around 9:20pm. i heard helicopters flying over our house and looked out my window to see what was going on, i could see a red\\orange pulsing orb and then i saw another one appear. i looked for helicopters and couldn't see any so i grabbed my phone (htc andriod) an i ran outside in my backyard. there were red orbs over my neighbors house pulsating turning a metallic white pink, yellow orange color and then red i starting taking photos and video i couldn't beileve it- the orbs were breaking off from each other and they would dissapear and then reappear.( i went in front of our house to get a bette shot\\ video) i saw about 8 total but i couldn't get more then two in a shot ( i was trying to watch what was going on as i was filming so sorry for the shaky video.) at one point they would align into a straight line then dissapear they were moving fairly slow- i felt like it was almost a triangle at one point. after about 20 mins they disappeared. i saw a couple riding their bikes and asked them if they knew what they were and they were shocked and didn't know. i've been seeing white metallic orbs during the day off and on for a couple years there always high above the atmosphere they'll move sided to side and just hover in one spot- i remember taking a photo of one of them and a red orb appeared out of know where and almost flashed to make it self known- it def. scared me!!!!"],"City":"Long Beach","map":"<A HREF = \"http://maps.google.com/maps?q=33.765108,+-118.148107(39976)&iwloc=A&hl=en\"> mufon case (39976) map </A>","Object Shape":"Fireball, Sphere, Triangle","Viewing Distance":"Unknown","Object Features":"Unknown","Tags":"City","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"39976","Longitude":"-118.148107","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around June 9th 2012"],"Weather Factors":"Unknown","Country":"United States","Log Number":"US-07012012-0005","files":["/var/www/straped/mufon/html2text/39976.html.txt","/var/www/straped/mufon/org/39976.html"],"Region":"California","Source":"MUFON","Summary":"Red pulsing Orbs long beach Ca","Date of the Event":"06/09/2012 09:20 UTC","Latitude":"33.765108","Date Submitted":"07/01/2012 01:15 UTC"}