{"Viewing Distance":"101-500 Feet","Object Features":"Undisclosed","Region":"Michigan","Case Number":"3997","Longitude":"-85.592604","Weather Factors":"Unknown","Date of the Event":"10/18/2005 07:28 UTC","Log Number":"US-10182005-0001","City":"Undisclosed","Object Shape":"Triangle","Date Submitted":"10/18/2005 07:28 UTC","trends":[],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"44.316884","map":"<A HREF = \"http://maps.google.com/maps?q=44.316884,+-85.592604(3997)&iwloc=A&hl=en\"> mufon case (3997) map </A>","Summary":"Appeared in same position in sky, triangle shaped, w/lights at each angle of the triangle","files":["/var/www/straped/mufon/html2text/3997.html.txt","/var/www/straped/mufon/org/3997.html"],"divs":["Sighting DetailsI was driving down Randall toward East St. when I saw what appeared to be a airplane ahead of me in the sky. I kept my eye on it as I approached East St. I realized that something didn't seam right, and that it was not moving. As I was driving down the road it looked like a straight row of lights with two blinking lights on each end in the sky. I stopped my car and rolled my window down and starred directly up at this \"thing.\" At that moment I realized that it was not an airplane, and that it had the shape of a triangle with a big white light at each angle of the triangle. There was no sound coming from it either. If I had to guess, I would say that it was about two football fields high, and about the size of a small airplane. I sat there about 30 seconds, when it took off in the direction of Ravenna and I could still see it, but the lights were gone, and there were two blinking lights on each end that were visible. I pulled into the parking lot were I had to drop off my kids, and continued to watch it at a distance, only seeing the two blinking lights. I went in to the building to drop off my kids, and when I came out it was gone. I know that there has to be others that witnessed this, due to the time is occured, and that I was stopped in the middle of the road , and there were cars behind me."],"Object Flight Path":"Hovering then path","Source":"MUFON","Tags":"City","Country":"United States"}