{"Disposition":"Unresolved","Country":"United States","Log Number":"US-07012012-0002","Object Flight Path":"Path with directional change","trends":["There have been 3 other sightings in Auburn","There was one other sighting in Auburn on or around June 30th 2012"],"Source":"MUFON","Longitude":"-76.561513","City":"Auburn","Object Shape":"Triangle","Latitude":"42.932834","Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.932834,+-76.561513(39973)&iwloc=A&hl=en\"> mufon case (39973) map </A>","divs":["Sighting DetailsWe were traveling north from Lansing NY towards Auburn NY along a straight stretch of road. We were admiring the bright pink along the horizon, and I saw 5 bright star like objects in a perfect triangular formation. The sky was still quite bright above the horizon and I thought it strange to be able to see such bright stars. I slowed down to watch them as they appeared to be moving, I thought it may have been an optical illusion. 4 more objects came up from underneath and lined up along the bottom to close in the triangle, and I pulled over, asking my daughter, are they really moving? She replied yes, they are moving and moving fast. We watched them for about another minute, they looked to be traveling straight north, then veered NE and disappeared. The rest of the way home to Syracuse I keep looking for stars and it wasn't until after 10 pm I saw any. I just keep thinking, wow... it was such a perfect formation, and no blinking lights, steady just like stars. I just wish I had of grabbed my phone quicker to get a picture."],"files":["/var/www/straped/mufon/html2text/39973.html.txt","/var/www/straped/mufon/org/39973.html"],"Sighting Duration":"Undisclosed","Tags":"City","Case Number":"39973","Viewing Distance":"Over One Mile","Region":"New York","Summary":"saw in the N saw a few bright starlike objects that appeared to be moving, more joined, counted 9 , they veered NE then vanished","Date of the Event":"06/30/2012 09:30 UTC","Date Submitted":"07/01/2012 12:25 UTC"}