{"Disposition":"Unresolved","Date of the Event":"06/30/2012 09:30 UTC","Log Number":"US-07012012-0012","Object Shape":"Disc, Fireball","Summary":"3 Glowing objects flying across the sky.","files":["/var/www/straped/mufon/html2text/39983.html.txt","/var/www/straped/mufon/more/39983_submitter_file1__UFOoverBelton.jpg","/var/www/straped/mufon/more/39983_submitter_file2__UFOoverBelton2.jpg","/var/www/straped/mufon/org/39983.html"],"divs":["Sighting DetailsI was inside playing a video game while my wife and daughter were taking the dog out to potty. The told me to come outside and watch some fireworks that someone was shooting off. They went back outside while i stayed in playing my game. Around 9:30pm they seen an orange glowing orb like object go from south to north. Then 30 minutes later around 10:00pm They seen another orange object come over 71 highway from across the horizon coming from the west and going to the east. They told me that the object was glowing orange and was shaped like a Jack like from a Jacks Game with a flame coming out of the top like an Olympic torch. When they had told me what they have seen, I decided to go outside with them. I was outside about 30 - 40 minutes at 11:30pm and I could see the moon through some clouds coming in from the east. And sure enough, here comes this orange glowing orb like object coming over the highway out from the horizon coming from the west going to the east. This object was moving much faster than a plane. It looked to me just a little smaller then what the moon looked to the naked eye. Very close, and it looked about the size of a private jet. Maybe around 30-40ft. I watched it go across the sky and into the clouds over my house. And as it went into the clouds, I seen the orange glow fade out. When It faded out I got to see what it looked like. It was a round silver disc shaped object with a small round dark circle. And it had a half line on one side of the circle. We stayed outside for another hour but it was all over."],"Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.819964,+-94.508257(39983)&iwloc=A&hl=en\"> mufon case (39983) map </A>","Weather Factors":"Unknown","Object Features":"Other","Date Submitted":"07/01/2012 08:58 UTC","Country":"United States","City":"Belton","trends":["There have been 8 other sightings in Belton","There was one other sighting in Belton on or around June 30th 2012","This sighting has never been favorited.",""],"Sighting Duration":"01:30:00","Object Flight Path":"Straight-line path","Longitude":"-94.508257","Latitude":"38.819964","Case Number":"39983","Source":"MUFON","Viewing Distance":"Over One Mile","Tags":"City"}