{"Summary":"Four bright, multicolred lights flew over in a square formation soundlessly and without blocking stars.","Object Features":"Unknown","Sighting Duration":"00:07:00","files":["/var/www/straped/mufon/html2text/39984.html.txt","/var/www/straped/mufon/org/39984.html"],"Object Shape":"Square, Rectagular","Latitude":"41.90537","divs":["Sighting DetailsI was camping near the river and looking at the stars at approximately 11:00 p.m. when I saw a bright light through the trees. At first I assumed it was a plane, as it moved in a perfectly straight path at a fast but not impossible speed. When it moved into an open patch of sky, I was able to see that there were four lights total, each in a different color, arranged in a large square pattern. The lights pulsated one at a time, but never went out completely. Planes had passed over earlier that night, and differed from this object in that their lights were much dimmer, blinked on and off, and produced an easily audible sound. These objects however, produced absolutely no sound, which I can be certain of as the only other sound present that night was produced by my campfire. The object followed the course of the river until it moved out of my sight. As the objects passed in front of stars, the stars remained visible through the space between the objects, indicating that it was not one solid object. I vaguely recall all of the lights turning a yellowish color after they passed overhead, but I can not remember well enough to be certain this occured. As the objects passed by, several large waves came ashore in a way that resembled a boat's wake. This may have been unrelated, although there were no boats on the water at that time. I made an attempt to film the objects with a handheld digital video camera, but the camera was incapable of filming clearly at night."],"Tags":"City","Date of the Event":"06/30/2012 11:00 UTC","Longitude":"-73.976249","City":"Port Ewen","Case Number":"39984","Country":"United States","Date Submitted":"07/01/2012 10:17 UTC","Weather Factors":"Unknown","trends":["There have been no other sightings in Port Ewen","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.90537,+-73.976249(39984)&iwloc=A&hl=en\"> mufon case (39984) map </A>","Region":"New York","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"US-07012012-0013"}