{"map":"<A HREF = \"http://maps.google.com/maps?q=38.775007,+-95.18636(3998)&iwloc=A&hl=en\"> mufon case (3998) map </A>","City":"Baldwin City","Date Submitted":"10/15/2005 02:30 UTC","Latitude":"38.775007","Summary":"very large shiny silvery object","Longitude":"-95.18636","Region":"Kansas","Tags":"City","files":["/var/www/straped/mufon/html2text/3998.html.txt","/var/www/straped/mufon/org/3998.html"],"Country":"United States","Date of the Event":"10/15/2005 02:30 UTC","trends":["There have been 2 other sightings in Baldwin City","There were no other sightings in Baldwin City on or around October 15th 2005"],"Log Number":"US-10182005-0002","Object Flight Path":"Unknown","Object Shape":"Unknown","Case Number":"3998","Object Features":"Unknown","Source":"MUFON","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband was driving (five kids in van) and I was in the passenger seat on Highway 59 in Kansas. Headed west, we had just turned off K-33 hwy (Douglas Cnty) and sign said five miles to Baldwin City. There was a very large silvery shiny object in the sky ahead (west) above the tree line to the north (approx. 1 mile ahead of us in the sky). I first thought of an airplane. As we continued west, you could still see the object and as we got closer the trees, which were to the north of the road, blocked our view. After we passed the trees I looked to see if I could see the airplane and the object was gone. I said to my husband \"did you see that shiny thing in the sky?\" and he said he also saw the object. One child in the seat behind me also said he had seen it. It was there for many seconds (in front of us as we were heading west) and then as the trees blocked its view, it just disappeared. There was nothing. I thought to myself if it was an airplane we would have surely been able to see it. If it was an airplane flying that low, it would have still been visible. That night driving home around 8:00 p.m. around the same vicinity, there were several lights that were not airplane lights. One stayed in the same spot in the horizon as we headed south on K-33 (towards K-68). If it was an airplane, it did not have any blinking lights and it did not seem to go anywhere."]}