{"divs":["Sighting DetailsI was going fishing at the fishing pier in Cape Henlopen State park on the night of June 28th at a little after 10 PM EDT. Also present were my father, brother, and 2 nephews as well as many other people who were on the pier that night. As we started to walk out the pier a triangular shaped object appeared from the Western sky. It seemed to be solid black with lights at each corner. The lights seemed to have a red-orange flicker to them. the object silently and very slowly went over the bay, the pier and ultimately over the Atlantic Ocean. It seemed to rotate as it passed overhead very slowly. It was very low in the sky seeming to be no more than 200 feet overhead. It was moving with the wind and climbing steadily as it went. It was being immediately followed by 2 other objects which were only detectable because they had a single light on them. The lights they had were the same color as the triangle's and had the very same flicker. A minute or so after the second single light object went overhead a third single light object appeared from the same origin and followed the same exact path. It too had the same light and the same flicker. They moved so slowly that I took a cell phone picture of the triangle and shot a cell phone video of the event. After we lost sight of the objects over the Atlantic Ocean, my immediate group and the other people around us who had just watched the whole event began to discuss what had just happened."],"Date Submitted":"07/01/2012 12:29 UTC","Case Number":"39987","Log Number":"US-07012012-0015","Disposition":"Unresolved","Source":"MUFON","Region":"Delaware","Object Shape":"Triangle, Other","Latitude":"38.775966","Date of the Event":"06/28/2012 10:10 UTC","Tags":"City","Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown","City":"Lewes","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Longitude":"-75.12949","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/39987.html.txt","/var/www/straped/mufon/org/39987.html"],"trends":["There have been 6 other sightings in Lewes","There were no other sightings in Lewes on or around June 28th 2012"],"Summary":"Triangle with lights at corners appeared followed by 3 single point of light objects that floated out to the ocean.","map":"<A HREF = \"http://maps.google.com/maps?q=38.775966,+-75.12949(39987)&iwloc=A&hl=en\"> mufon case (39987) map </A>"}