{"Object Features":"None","Tags":"City","Longitude":"-73.788342","files":["/var/www/straped/mufon/html2text/39992.html.txt","/var/www/straped/mufon/org/39992.html"],"Log Number":"US-07012012-0021","Date Submitted":"07/01/2012 03:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.737074,+-73.788342(39992)&iwloc=A&hl=en\"> mufon case (39992) map </A>","Source":"MUFON","Object Shape":"Star-like","City":"New York","Object Flight Path":"Path with directional change","Case Number":"39992","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"40.737074","Summary":"multiple orange glowing objects","Viewing Distance":"Unknown","Weather Factors":"Unknown","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around June 30th 2012"],"Date of the Event":"06/30/2012 09:35 UTC","Region":"New York","divs":["Sighting DetailsThis report was summitted by Sttephen Cox, Chief Field Investigator NY-Mufon Good evening, I would like to report multiple orange glowing objects on the evening of June 30, 2012 at approximately 9:35pm, which lasted for about 6 minutes. I would just like to say that I have NEVER reported anything like this, ever. I live in Queens, NY - about 4 miles south of La Guardia Airport. I recorded multiple orange glowing objects while walking my dog. These objects came in from the south west (probably over Brooklyn, NY) and flew in single, double and triple formations (silently) heading north east towards La Guardia airport. Strangely enough there were NO aircraft landing or taking off during this sighting. I did manage to take a few short video clips from my cell phone. They were orange, no blinking lights (not planes ! I live by the airport and see planes landing and taking off constantly) they seemed kin of translucent, like they didn't have a solid core and they were the size of an baby asprin. They also seemed to be only a few thousand feet in altitude, I would guess 3 - 4 thousand feet high. There were also multiple witnesses. Thank you,"]}