{"Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere","Weather Factors":"Unknown","Object Features":"Unknown","City":"Phoenix","Date of the Event":"10/07/2011 12:00 UTC","Country":"United States","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 7th 2011"],"files":["/var/www/straped/mufon/html2text/39991.html.txt","/var/www/straped/mufon/org/39991.html"],"Summary":"saw these spheres over my neighborhood and took pics with my Cannon Powershot","Longitude":"-112.091232","Date Submitted":"07/01/2012 02:37 UTC","Region":"Arizona","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.512412,+-112.091232(39991)&iwloc=A&hl=en\"> mufon case (39991) map </A>","Latitude":"33.512412","Object Flight Path":"Stationary,Other","divs":["Sighting DetailsI was coming home at about 10pm.when I saw these spheres hovering over the neighborhood above the houses. I was amazed to see them and was takong pics at the First Friday Art Walk so I pulled over and took these pics . I did not have the time to set the camera for night shots as I was in a hurry to get these. I was staring at three red-orange objects that seemed to pulsate with ther rich colors.One was more red than the others and shimmered with a buitiful color. I took a few pics and was hoping to set my camera for night pics when I noticed that the spheres were getting smaller and then realized that they were ascending straight up and were then gone. I was with a friend who was sitting in the passenger side and asked him what he thought as I was pointing them out to him and talking about them while shooting the pics. He told me he did not see them which I could not believe as they were rather very large and hovering above the houses and the distance was hard to guage. I was told by my friend that he blacked out and does not remember even though he does rememberbeing in yhe car with me but had seen them in the past when he was younger and had dreams about them in past. As soon as I saw the spheres Iinstantly thought about the phoenix lights that were seen before. I was amazed as I had soken to my mom just a few weeks before and we both said to each other thatr we would like to see them ourselves. I was amazed at the site."],"Case Number":"39991","Source":"MUFON","Tags":"City","Log Number":"US-07012012-0020","Disposition":"Unresolved"}