{"Source":"MUFON","Summary":"A friend and I observed five lights,another friend the next day witnessed crash and military removal","trends":["There has been one other sighting in Clay City","There were no other sightings in Clay City on or around July 22nd 1988"],"Date of the Event":"07/22/1988 12:00 UTC","Object Features":"Unknown","Region":"Kentucky","Disposition":"Unresolved","Log Number":"US-07012012-0022","Object Shape":"Star-like","Date Submitted":"07/01/2012 04:27 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","City":"Clay City","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsMy highschool friend and I had been riding around we were heading home on lower paint creek rd.going to clay city from Stanton and i noticed there were cars in the ditches and parked on the curb this was very strange.then I saw the lights over the lake.there was five orbs the one on the end left would race off to the west and return in the east only to go back into formation and after a few minutes it would race off again then vanish only to reapear in another location ,it looked like time travel.My friend said ,it's those big spot lights bouncing off the clouds! He was trying to find a explanation and I new he was freaked out because I was to.so we wrote if off as lights and went home,at school the next day my other classmates were telling me about a UFO crashing at the north fork rd near the red river George area.he said there was armed Gaurds blocking off the rd. He also said that covered military semi trucks hauled out the wreckage .After hearing this very credible friends explanation of events then I realized that i couldnt lie to myself any longer i had to face the reality that what we saw was no spot lights.now 20 plus years latter theres alot of people on t v who support my experience .that's just one incident there many more that I'm going to report,thanks mufon!"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.861128,+-83.913772(39993)&iwloc=A&hl=en\"> mufon case (39993) map </A>","Longitude":"-83.913772","Weather Factors":"Unknown","Latitude":"37.861128","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"39993","files":["/var/www/straped/mufon/html2text/39993.html.txt","/var/www/straped/mufon/org/39993.html"]}