{"Date of the Event":"07/01/2012 10:07 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-75.271927","City":"Brantingham","Summary":"A redish-orange globe. Very bright, appeared to move slowly.","files":["/var/www/straped/mufon/html2text/39999.html.txt","/var/www/straped/mufon/org/39999.html"],"Region":"New York","Case Number":"39999","Tags":"City","Country":"United States","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.6875,+-75.271927(39999)&iwloc=A&hl=en\"> mufon case (39999) map </A>","Log Number":"US-07012012-0028","trends":["There have been no other sightings in Brantingham","This sighting has never been favorited."],"divs":["Sighting DetailsI went to my girlfriends vehicle between 10:02 to 10:07pm. I noticed a light above the trees, some distance away, that was moving slowly in a south-easterly direction, though the distance may have just made it appear to move slow. It was a bright orange to a redish colored globe or sphere. It was in the north-east above the treeline across the road from my house. It did not pulsate or flash or appear to shift in color. There was no sound that I could hear and I tried to hear if there was any engine noise of any sort. After noting its direction of travel, I ran inside my house to get my video camera, hoping to get some footage of it. My camera was on the table seven-feet from the door in my house, so I lost little time getting it and getting back outside to my driveway. I waited with the camera on, searching the sky in all directions, but I could not see the object anywhere. Nor did I hear anything or see other objects like planes and such. I guess it must have changed direction or was traveling faster than I had thought because it did not appear in the area I had hoped it would when I got back outside. We have low clouds and an almost full moon out. No stars were visible in the area I saw the object, only a learing near where the moon itself was to the south of me. I'm still shaking from the excitement of seeing the lighted object (it has only been 40 minutes from the time I saw it until I reported it). I knew of MUFON from different TV shows and came inside to see if I could report it somehow and here we are. I'm still happy for the experience, though I have no idea what I saw and wish I could have seen more to help this report. I'm quite certain it was not an airplane or helicopter of any sort."],"Weather Factors":"Unknown","Date Submitted":"07/01/2012 11:00 UTC","Latitude":"43.6875","Source":"MUFON","Object Shape":"Sphere, Star-like"}