{"Latitude":"30.461765","divs":["Sighting DetailsOkay, I don't know if this was a UFO, but here is a description of what I saw and a few facts to go with it. At between 2 and 2:15 AM, I saw two enormous flashes of distinctively blue lights. They were low elevation wise, but high enough to where I could see the light reach up over the top of the other apartment buildings. I am on the third floor of mine. I was on my balcony at the time. Each pulse of light was approximately 1 second apart and the light seemed circle or sphere like. Both flashes happened in the same exact spot. There was no sound. I've also checked the storm radar. The only activity that is being detected is West of here. Nothing that would produce that kind of lightning to be visible from this far away. And I double checked. The direction that I saw these pulses of light were in the Northeast direction. Not the West. It's been suggested to me that it may have been a power transformer exploding, but I would think that a light that seems to be that close by and being that strong, I would have heard some kind of sound. I have none the less contacted my apartment office to see if they may be alerted of any kind of power transformers exploding in the area. I will let you know immediately if I find this to be the case. Since I was unable to get this happening in video or photo, I'm including a short sketch to illustrate what it is that I saw."],"files":["/var/www/straped/mufon/html2text/40006.html.txt","/var/www/straped/mufon/more/40006_submitter_file1__Image0010.JPG","/var/www/straped/mufon/org/40006.html"],"Date of the Event":"07/02/2012 02:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.461765,+-97.750686(40006)&iwloc=A&hl=en\"> mufon case (40006) map </A>","Summary":"Strong flashes of blue light","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"N/A","Disposition":"Unresolved","Region":"Texas","Sighting Duration":"00:00:03","Longitude":"-97.750686","City":"Austin","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Case Number":"40006","Object Features":"Unknown","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around July 2nd 2012","This sighting has never been favorited.",""],"Date Submitted":"07/02/2012 05:24 UTC","Object Shape":"Unknown","Log Number":"US-07022012-0004"}