{"Summary":"Four extremely bright bluish-white lights resembling field lights in a row but hovering and with no supporting structure hovering to the west of a mountain ridge line between Sylmar and Santa Clarita, CA.","Date Submitted":"07/02/2012 01:08 UTC","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Tags":"City","Date of the Event":"07/01/2012 08:35 UTC","files":["/var/www/straped/mufon/html2text/40005.html.txt","/var/www/straped/mufon/more/40005_submitter_file1__UFO1july2012newhallpass.jpg","/var/www/straped/mufon/more/40005_submitter_file2__UFO1july2012map.jpg","/var/www/straped/mufon/org/40005.html"],"divs":["Sighting DetailsMy roommate and I were in the car; I was driving us to Fresh 'n Easy grocery store, heading northwest on Sparks St. in Burbank, CA, approaching the Olive Avenue intersection. Between the trees, we each saw directly ahead hovering just west of the mountain ridge line four extremely bright bluish-white lights resembling field lights, in a row but hovering and with no supporting structure. No object was visible; just the lights. This mountain ridge line lies between Sylmar and Santa Clarita. The row of lights did not appear to move. We could only see the lights for the briefest of moments, because as we drove through the intersection at Olive Ave., our view of the mountain was blocked by nearby buildings. It would've been approx. 17 miles from our location in Burbank to that spot. If the lights were actually located next to the mountain ridge as they appeared, they would've been roughly over Interstate 5 in the New Hall Pass. Instead of stopping at the grocery store as we'd planned, I continued heading in that same northwest direction on Reese Pl., then turned east onto Clark St., then northwest again on Victory Blvd. to try to see that exact area again, but by the time we could see the mountain, the lights were gone. This took less than 5 minutes. I circled back to the original siting location on Sparks St. to retrace our route, but the lights were gone and nothing else was evident. There were no other lights, planes, choppers or even stars visible. At 8:30 p.m., it was just sunset, so the sky wasn't dark in the northwest. We both were intensely curious, I was excited, I wanted to follow it. Now, writing this description, I am baffled and eager to find out if anyone else saw it. On the way back to our apartment after shopping, we discussed whether it had been four lights attached to an object, or four distinct lights in formation. There was no way to tell. I did feel a little creeped out by the discussion of whether it was one something or four somethings, but that passed quickly."],"Case Number":"40005","Latitude":"34.400944","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.400944,+-118.540236(40005)&iwloc=A&hl=en\"> mufon case (40005) map </A>","Country":"United States","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","City":"Santa Clarita","Weather Factors":"Unknown","Log Number":"US-07022012-0003","Object Shape":"Unknown","Object Features":"Unknown","Region":"California","Longitude":"-118.540236","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around July 1st 2012","This sighting has never been favorited.",""]}