{"Region":"New Hampshire","Longitude":"-71.329769","Latitude":"42.88143","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Date Submitted":"07/02/2012 12:33 UTC","Object Shape":"Fireball, Sphere, Triangle","Tags":"City","divs":["Sighting DetailsMy wife and I had been out on our porch directly facing a busy intersection in Derry NH. We were having a cigarette when I saw these 3 balls of light just drifting pass. I immediately told her to look. It was flying pretty slowly over the horizon about 1,000 feet away from us would be my best guess and it appeared to be about 500 feet in the air. When I first saw it I could only think to describe it as what a small plane trailing a banner would look like in the dead of night with no lights but 1 burning basketball on the tip of each wing and another 80 feet back where the banner was connected by a line. Yet I could not make out any structure or hear any planes. There were about 4 or 5 obvious planes off in the distance at various high altitudes before during and after this sighting. All had blinking lights. The 3 lights we saw did not blink or change pace at all. They stayed simultaneously moving at a constant pace until they disappeared behind a tree across the street and did not become visible again. I did attempt to pull my camera out and video tape the event but I was unable to get a good enough view of the 3 lights. Briefly make out one of them in the video. Mostly it's just me desperately trying to describe them as they went out of sight. It was shocking, very freaky, and still boggling me. Every time I think about it or try and talk about it my eyes almost begin to well up as I get shivers down my back. I have read reports of exactly the same sighting. It's kind of scary if you ask me."],"Object Features":"None","Source":"MUFON","City":"Derry","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/40004.html.txt","/var/www/straped/mufon/org/40004.html"],"Country":"United States","Case Number":"40004","map":"<A HREF = \"http://maps.google.com/maps?q=42.88143,+-71.329769(40004)&iwloc=A&hl=en\"> mufon case (40004) map </A>","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07022012-0002","Date of the Event":"06/29/2012 12:00 UTC","Summary":"My wife and I clearly watched 3 balls of light slowly fly over and disappear behind the tree across from our home","trends":["There have been 7 other sightings in Derry","There were 2 other sightings in Derry on or around June 29th 2012"]}