{"Longitude":"-99.942932","Tags":"City","Country":"Canada","Date Submitted":"07/02/2012 04:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.848745,+-99.942932(40016)&iwloc=A&hl=en\"> mufon case (40016) map </A>","Object Shape":"Triangle","Source":"MUFON","Log Number":"CA-07022012-0013","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThe past few days it was supposed to rain, and it never. Thunder showers where forecast in the news and weather channel but they never happen. We left to visit family in the morning July 1st 2012 around 11.30am. at the gas station located on the 18th street by the river bridge the clerk informed us that the power went out and the gas pumps were not working. There fore we had to go somewhere else so we insisted we would go along the way my girlfriend and her sister, on the way to visit family, we cant say who. on the way back we where driving past portage, and noticed few firework displays along the way home and at about 11:30pm and there was traffic build up and the traffic lights where out. we where on the 18thstreet bridge heading south and on a 90 degree angle i noticed three stars. theses stars where different, like lights 3 of them in a perfect triangle. looking up they where clear to see. There was black space and no object in between. You may ask how, what is different from a star of the stars? There was no stars and it was cloudy. I told my girlfriend, and she noticed too. and the lights faded into the clouds and my girlfriend looked at second time and the were gone. Coincidence, around 11:30 AM AND PM there was a power outage. I took a picture but the camera wasn't working properly. so scratch that picture idea. 1. I was in a car going home. 2. I don't know. 3. Stars. 4. Lights similar to fire and fading out into the cloud coverage. 5. Expression word:Cool!.girl friend thought \"what the hell?\" 6. the object moved away."],"Latitude":"49.848745","Region":"Manitoba","trends":["There have been 3 other sightings in Brandon","There were no other sightings in Brandon on or around July 1st 2012"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/40016.html.txt","/var/www/straped/mufon/org/40016.html"],"Object Features":"None, Unknown","Disposition":"Unresolved","Case Number":"40016","Summary":"We where driving in car, cloud coverage and noticed stars, but it was cloudy how?","City":"Brandon","Object Flight Path":"Stationary","Date of the Event":"07/01/2012 11:30 UTC","Viewing Distance":"101-500 Feet"}