{"Log Number":"US-07022012-0009","City":"Independence","Object Flight Path":"Straight-line path","Case Number":"40012","Object Features":"None","Date Submitted":"07/02/2012 01:47 UTC","divs":["Sighting DetailsI am the ASD for Missouri and had this sighting myself along with my entire family and some friends (total 17 of us with 10 adults and teenagers included) while we were at a birthday party for my granddaughter. I was looking at the moon under clear skies when I noticed a object moving through the sky southeast of my position headed northwest. At first I thought it was a plane, but realized it wasn't after seeing the triangle shape and three very bright white lights pointing downward, and one red light in the center which was flashing sequentially at first. There was no red or green lights where wings should be, no wings, and no tail, and absolutely no sound. If this had been a commercial jet or the B-2 there would have been some type of sound since it was so close to us. I estimated the distance to be above 500 feet and under a mile due to the size of it. It would take a golf ball or larger to cover it up at arm's length. There were no flashing white beacon lights, only the red one in the center. After a minute, the front light on the point of the triangle went out for a few seconds then back on, and the other lights all started flashing randomly, which was completely out of the ordinary for any commercial or military craft. The object continued on its path and out of sight. I did not have my camera with me at the time. A few minutes later, my daughter wanted to take a picture of the porcelain doll I gave my granddaughter- so I held the doll up and as my daughter snapped the picture she saw a bright white orb in front of me through the viewfinder which startled her. A bright white streak showed up on the picture. We can't find a source or logical explanation for this. No one had a flashlight and this did not appear any any of the other photos. I don't know if this is related or not but am including the photo just in case it is."],"Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40012.html.txt","/var/www/straped/mufon/org/40012.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.048137,+-94.457643(40012)&iwloc=A&hl=en\"> mufon case (40012) map </A>","Region":"Missouri","Longitude":"-94.457643","Date of the Event":"07/01/2012 09:50 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"Large black triangle flew overhead - with changing lights - no sound at all","trends":["There have been 67 other sightings in Independence","There was one other sighting in Independence on or around July 1st 2012","This sighting has never been favorited.",""],"Tags":"City","Object Shape":"Triangle","Latitude":"39.048137"}