{"Latitude":"41.468081","Case Number":"40014","Date of the Event":"Unknown","Summary":"We saw SEVEN round flying objects at 1030pm on Saturday obove our house on Westwood Road","Longitude":"-81.925859","Object Shape":"Circle, Fireball, Oval, Sphere","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.468081,+-81.925859(40014)&iwloc=A&hl=en\"> mufon case (40014) map </A>","Tags":"City","trends":["There have been 2 other sightings in Westlake","There were no other sightings in Westlake on or around"],"Object Features":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","City":"Westlake","divs":["Sighting DetailsI was pulling into the drive about 1030pm -Bob didn't have the light on outside and I noticed FIVE round Orange objects, they were going east and I thought maybe it was fireworks. So I stood by the car and yelled for Bob while I was watching if they would disintigrate. Then I saw the three go into a triangle pattern, then two more came behind them. Bob saw them and just said \"Oh they're planes\" and I said Nooo my brother was an Air traffic controller, planes aren't allowed to fly so close together like that. So I thought, maybe a helicoptor, but they were silent, and why would there be 7 copters around? Especially BRIGHT ORANGE?? So I started taking pics with my phone (doesnt take the greatest pics but at least I have five pics that show the flying objects. They flew East and ended up in the clouds, I lost track of them. WHat was funny is that last year, I saw the same type of object on Westwood after 6pm, I called Bob and couldnt get a pic because I was driving. The one last year was bright orange, round (oval) and didn't make any noise--I was so surprised how low it was and how traffic wasn't stopped or pulling over to check it out?? I never reported this. The other time I remember something like this was in a feild by NDBaker Jr High at night sitiing with my friend Cathy. Soo I don't know what I am seeing..just odd and pretty cool if it is something. Just surprised more people haven't seen this. I dont know how to download from my camera, so I was going to send you the memory card instead. I can also try to send it via phone to the above number as well first--Thanks"],"Country":"United States","Log Number":"US-07022012-0011","Weather Factors":"Unknown","Region":"Ohio","Source":"MUFON","files":["/var/www/straped/mufon/html2text/40014.html.txt","/var/www/straped/mufon/org/40014.html"],"Date Submitted":"07/02/2012 03:23 UTC"}