{"City":"Brantford","Country":"Canada","Region":"Ontario","files":["/var/www/straped/mufon/html2text/40017.html.txt","/var/www/straped/mufon/org/40017.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"43.141313","Longitude":"-80.28475","Case Number":"40017","Summary":"The object moved like a large satilite orange-red colour, then slowed almost to a stop then excellered away.","Viewing Distance":"Unknown","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=43.141313,+-80.28475(40017)&iwloc=A&hl=en\"> mufon case (40017) map </A>","divs":["Sighting DetailsI should begin by stating I am ex-military. I know all kinds of aircraft. What they look like, as well as manoeuvres they are capable of. Also I have been amateur astronomer for some 15 years. I was walking my dog around my building, and got around to the back parking lot. There were people about (6-8) on the upper belcony waiting for the Canada Day fireworks to begin for 10:30pm. When as I was talking to them I noticed a large orange-red ball of light, I thought it was a satelite but it was very large. The object was about the size of an aspirin at arms length, moving from north to south. I assumed it was the same satelite or object I seen aweek before. I told the people on the belcony to look up and checkout the Object. I had already noticed it for about a minute or so before, and didn't say anything until it got over the building enough for then to see it. Just as I pointed to the direction to look it slowed almost to a full stop, for about 2-3 seconds brightened up to a yellow-red and quickly accelerated away No noise at all. With it being almost a full Moon you could see a circular vortex waves around it, like when a jet goes through the sound barrier. with in 2 seconds it was gone to the south. Very cool experience. My friend Dennis told me the next day when we were talking about the object, that about 2 hours later he spotted two more very bright objects, but going east to west. These two I did not witness."],"Object Flight Path":"Straight-line path,Path then hovering","Log Number":"CA-07022012-0014","Tags":"City","Date Submitted":"07/02/2012 04:36 UTC","Date of the Event":"07/01/2012 10:25 UTC","trends":["There have been 9 other sightings in Brantford","There were no other sightings in Brantford on or around July 1st 2012"],"Object Shape":"Circle, Disc, Sphere, Star-like"}