{"divs":["Sighting DetailsI was putting a fan in front of the door to bring in fresh air when i looked up and noticed a pattern of lights. first seen it way off in the distance just above he trees. A triangle pattern of lights pointing up. about the size of a quarter at arms length. My first thought was a bunch of fire flys just above the lawn. looked down to turn on fan in front of the door. Realizing bugs dont fly in a pattern that dont make sense... So I walk out the door looked back up and it now much closer but not moving that fast. now its size was about baseball size and definitely a triangle of five lights. With one at the point. The sky was dark blue just before sun up, didnt see anytype of body to it. went right over my house. Looking almost straight up (now football size at arm lenght) it was making a slow turn from the east, northeast to the west southwest. The fan in the door was on low so if it made any sound at all the fan on low over powered it. The air did have a feel strange to it, but that may have been the excitement of seen what i saw..."],"trends":["There have been 9 other sightings in Lapeer","There were no other sightings in Lapeer on or around July 2nd 2012"],"Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/40010.html.txt","/var/www/straped/mufon/org/40010.html"],"Object Features":"None","Date Submitted":"07/02/2012 07:48 UTC","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-07022012-0007","Object Shape":"Triangle","Source":"MUFON","Summary":"first seen way off in the distance just above he trees. A triangle pattern of lights pointing up. looked down to walk out the door looked back up and it went right over my house. it was making a slow turn from the east, northeast to the west south west","Viewing Distance":"501 Feet - 1 Mile","Latitude":"43.041855","Case Number":"40010","map":"<A HREF = \"http://maps.google.com/maps?q=43.041855,+-83.316256(40010)&iwloc=A&hl=en\"> mufon case (40010) map </A>","Country":"United States","Weather Factors":"Unknown","Longitude":"-83.316256","Disposition":"Unresolved","City":"Lapeer","Date of the Event":"07/02/2012 04:15 UTC","Region":"Michigan"}