{"Case Number":"40028","Country":"United States","Sighting Duration":"00:01:00","City":"Rancho Cordova","Summary":"A bright light in the distant shooting up into the sky at incredible speed then disappearing out of sight.","Latitude":"38.59789","Object Features":"Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","Region":"California","Disposition":"Unresolved","Date of the Event":"07/02/2012 01:00 UTC","divs":["Sighting DetailsI was sitting in the backyard of my home in Rancho Cordova, CA, as I do most nights, looking at the sky. Lately, i have been watching the area of sky around the big dipper because I have seen a few lights in that part of the sky recently, in which, I cannot explain away as a meteor, satellite, airplane, or other man-made aircraft. My girlfriend and I, a week ago, in the same area of sky, had witnessed a blue flash of light (happening multiple times) but not continuous, just every now and again, sometimes blinking twice and then nothing for awhile. This occurred a couple of nights in a row. We named it \"Blinky Light.\" Then, early this morning (July 1st, 2012) at approximately 1 am, as I'm sitting in my backyard watching the sky, I began tracking a satellite coming from the west. I watch it for a moment until the light reflecting off of it begins to dim and I cannot see it very well anymore. Then, I decided to fix my eyes north toward the big dipper and just then what I saw was an object ascending at incredible speed out into space. At first I thought it might be a meteor, but i don't believe meteors fall up into the sky. I immediately new it was something other than a man-made aircraft. It must've been moving thousands of miles per hour cause it had a bright light trail behind it and disappeared in a flash. There were no clouds and it was a perfectly clear night. No obstructions. The high speed object disappeared as it accelerated at speeds ive never seen anything move before. I continued to watch the sky for awhile after that and saw nothing more."],"Object Shape":"Flash, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.59789,+-121.308633(40028)&iwloc=A&hl=en\"> mufon case (40028) map </A>","Date Submitted":"07/02/2012 07:24 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","trends":["There have been 18 other sightings in Rancho Cordova","There were no other sightings in Rancho Cordova on or around July 2nd 2012"],"Log Number":"US-07022012-0025","Longitude":"-121.308633","files":["/var/www/straped/mufon/html2text/40028.html.txt","/var/www/straped/mufon/org/40028.html"]}