{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsThis occurred 2-3 years ago. The date and time are by no means certain. I was in my backyard, after returning from taking my dog on a late walk. I looked up at the stars, as there were no adverse atmospheric conditions, and the view was fantastic. From the south-west, three lights, moving in single file, made their way into my field of vision. Their intensity and size was consistent with an airplane at approximately 1000ft AGL (I live on the down-wind leg for a small airport, and am a pilot myself). They made no noise, and proceeded to fly more-or less directly overhead. Now, an airplane has multiple lights, each a different color. Red is on the port wingtip, blue on the right, a white landing light is on the leading edge, and a white strobe is sometimes on the upper portion of the fuselage. The orientation of the lights to the observer (or nearby aircraft) can be used to indicate an aircraft's heading relative to you. However, none of these were present. Instead, a white light was emitted from all directions, making the objects look like bright stars. As they passed overhead, and then began to continue away to the north-east, two of them accelerated (I don't remember which two), and began to ascend, one veering off to the north more, the other to the east. The third maintained its' heading and speed, but also ascended, though not as mush as the other two. At that point, all three stopped, forming a v in the sky. It is difficult to say what their altitude was at that point, so I will not muddy the waters with an incorrect altitude. However, after they were in position, their lights dimmed so that they were indistinguishable from the stars above them. Fortunately for me, from where I was standing, the light at the bottom of the \"v\" was right in line with the top of a large, easily-identifiable tree. For over a week, I would check on the lights each night, and each night they were there. On or around the tenth night, they were gone. I tried using binoculars, however I say nothing unusual in that quadrant of the sky during the day."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.001459,+-116.851553(40026)&iwloc=A&hl=en\"> mufon case (40026) map </A>","Country":"United States","Date of the Event":"06/01/2009 12:00 UTC","trends":["There have been 3 other sightings in Ramona","There were no other sightings in Ramona on or around June 1st 2009"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"Formation flight, then multi-day hover","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/40026.html.txt","/var/www/straped/mufon/org/40026.html"],"Longitude":"-116.851553","Latitude":"33.001459","Tags":"City","Weather Factors":"Unknown","Date Submitted":"07/02/2012 07:02 UTC","Case Number":"40026","Object Flight Path":"Path then hovering","Disposition":"Unresolved","City":"Ramona","Source":"MUFON","Region":"California","Object Shape":"Unknown","Log Number":"US-07022012-0023"}