{"Viewing Distance":"Over One Mile","Object Shape":"Star-like","Source":"MUFON","Date Submitted":"07/02/2012 10:16 UTC","Weather Factors":"Unknown","Longitude":"-73.17676","Sighting Duration":"00:03:00","Region":"New York","Case Number":"40032","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Latitude":"40.733853","divs":["Sighting DetailsCase entered into CMS by Stephen Cox, CFI NY Mufon hello. on saturday night june 30 around 9:30.pm i was out side and i look at the sky like i allwasy do. and i saw this bright orange object .from what i can see it was round and it was pulsing bright orange color for like 3 mins and after 3 mins it got dimmer and dimmer and then it was gone. i could see planes flying around it was no plane. it could have been over another part of long island but i know what i saw .. Questions asked on first email here are his answers: 1 i saw the ufo south east it looked like it was over the great shore bay or another town close to the bay 2 i live in east islip suffolk county 3 south east 4 i saw the object for a good 3 mins or more it was a bright orange glow like plusing and it got dimmer and dimmer then it was gone 5 clear night 6 the ufo was pretty far but it was kinda big i saw small planes flying around they had to see it. 7 viewing angle its hard to say i guess it was 90 dregrees. 8 i saw the ufo south east and it just vanished after it truned off the bright light. steve iam so glad i can help. i know iam not crazy i knw what i saw and other people had to see it you dont see this when u look in the sky. iam allwasy looking for ufos, and i allways had an intrest in them from a really early age. i guess iam a ufo hunter,, iam trying to find a nice video camara so i have it with me at all times plz keep me updated on this case chris"],"Tags":"City","Summary":"ufo over long island update","files":["/var/www/straped/mufon/html2text/40032.html.txt","/var/www/straped/mufon/org/40032.html"],"trends":["There have been 3 other sightings in East Islip","There were 2 other sightings in East Islip on or around June 30th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.733853,+-73.17676(40032)&iwloc=A&hl=en\"> mufon case (40032) map </A>","Date of the Event":"06/30/2012 09:30 UTC","City":"East Islip","Log Number":"US-07022012-0028","Object Features":"Undisclosed","Country":"United States"}