{"Log Number":"US-10192005-0001","Latitude":"39.963676","Case Number":"4003","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around October 19th 2005"],"City":"Columbus","Date of the Event":"10/19/2005 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.963676,+-82.997744(4003)&iwloc=A&hl=en\"> mufon case (4003) map </A>","Country":"United States","Region":"Ohio","Disposition":"Insufficient Data","Tags":"City","files":["/var/www/straped/mufon/html2text/4003.html.txt","/var/www/straped/mufon/org/4003.html"],"Longitude":"-82.997744","divs":["Sighting DetailsAt around 12:30 or 1:00 AM on October 19th I saw and pointed out to a friend what appeared to be a meteorite travelling through the upper atmosphere at extreme velocity. I noticed a second object traveling near the first object, that soon went at a diffrent trajectory consistant still with a meteorite breaking up in the atmosphere. The second object left sight while the first object continued a fast decent traveling due west. The object quickly closed to around 20,000ft and was then apparent to be a delta wing style aircraft traveling silently at high speed. The aircraft had lights flashing in the rear that seemed to be red and blue. The aircraft continued at around 20,000ft due west until i lost sight. Another aircraft that seemed to be the exact same traveled along roughly the same path came not 5 minutes later. The second aircraft had a distinct bright white glow that lasted about a second. My friend and I figure it was a military test aircraft. I know alot about aircraft and physics and what this one did was astounding. I doubt any human could have withstood the G forces from the massive decent the object made, apparently from space. While I can't understand why the military would fly stuff like that over a city, i believe it was a US aircraft of some sort and not intergalactic visitors. And from what I know about fighter jets and G forces, it would have had to be unmanned to pull off that decent manuever."],"Viewing Distance":"Unknown","Object Shape":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"10/19/2005 12:00 UTC","Object Features":"Undisclosed","Summary":"Conteolled aircraft seemed to make a quick decent through the atmosphere to about 20,000 ft and flew over head.","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}