{"Longitude":"-109.052593","Date Submitted":"09/29/2005 10:01 UTC","trends":["There have been 3 other sightings in Window Rock","There was one other sighting in Window Rock on or around September 29th 2005"],"divs":["Sighting DetailsI was sitting outside on the porch, having a cigarette. The porch is west facing. I had been sitting there for about a minute when I noticed that there was a bright light to the left of me, hovering just above the trees. It struck as me as very peculiar because it was about the size of a pencil end at arm's length and it was a very bright orange. It continued to hover there and I watched it, trying to figure out what it was. It would flash a pale green color intermittently. I had no clue what it was. The only thing of that magnitude in that direction would've been Venus and it wasn't Venus. After about a couple minutes of watching it, I decided to put out my cigarette and go in to tell my parents in law, whom we are staying with, about the light in the sky. They followed me outside and it had already dropped about half an inch in the sky and was skirting the tops of the trees. We watched it for 15 minutes in kind of a morbid fascination as it seemed to move away from us and drop down further until it was partially obscured by trees. When we could no longer see it clearly, we all went back into the house, unsettled. None of us had any explanation for what we saw and were a little frightened. There was more air traffic (military jets) that evening than the usual and they seemed to be flying very high over the orange flashing ball. I thought perhaps that we had seen a large flare for some sort of practice but this did not make sense to me. Why would they drop it over the capital of the Navajo Nation? It also hovered in the sky for a long period of time and I am unsure that a flare could last as long as it did. We never saw it blink out, even after 20 minutes of watching it."],"Case Number":"4005","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/4005.html.txt","/var/www/straped/mufon/org/4005.html"],"Object Shape":"Sphere","Date of the Event":"09/29/2005 10:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.680573,+-109.052593(4005)&iwloc=A&hl=en\"> mufon case (4005) map </A>","Weather Factors":"Unknown","Log Number":"US-10202005-0001","Region":"Arizona","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"35.680573","Summary":"Large bright strobing orange ball","Sighting Duration":"Undisclosed","City":"Window Rock","Object Flight Path":"Hovering then path","Tags":"City","Object Features":"None","Country":"United States"}