{"Source":"MUFON","trends":["There have been 66 other sightings in South Kingstown","There were 54 other sightings in South Kingstown on or around July 2nd 2012"],"Longitude":"-71.477331","files":["/var/www/straped/mufon/html2text/40068.html.txt","/var/www/straped/mufon/org/40068.html"],"Date of the Event":"07/02/2012 02:30 UTC","Country":"United States","Disposition":"Unresolved","divs":["Sighting Details At about 2:30 AM, July 2, 2012 my son saw an object through the 2nd floor bathroom window of our house in the northwest area of the sky(NW oriented from that position). The object was stationary not moving at all! It had 3 lights in a horizontal alignment, but rather close together. The middle light was pink or light red, and the light on each side of it was a pale shade of yellowish green. The pink light was blinking or flashing on and off irregularly. Object was in a horizontal or flat shape, more linear or disc(saucer-like?) than anything else. Since object was rather far away it was difficult to get a real accurate look at it's exact shape, or to tell it's actual size. It hovered where we could see it for about 10min. then drifted below the tree line. All this was between 2:30AM and 2:45AM. All our observations were made using Bushnell 8x42WA 430ft at 1000yds binoculars. My wife saw all this too. At this point we all went back to bed, but about five minutes later my son called to us that he had sighted another such flying object. This one was visible only from the front of our house, in the northeast area of the sky, relative to our house(position), at least 120degrees away from the position of the 1st flying object. This second flying object was either the first object we had seen in the NW quadrant of the sky or one exactly like it, with the same lights and horiZontal shape. We all watched this 2nd stationary, hovering flying object from approx. 2:50AM to 3:20AM, and the object didn't move at all!!! It stayed right in the exact same position where it was when my son first sighted it. By 3:20 or so we got tired of watching the motionless object and went back to bed again. At just about 4:00AM, since I couldn't get back to sleep, I got up to take one last look. The object was still there, although it had moved about five degrees to the east. This report is respectfully submitted to MUFON of RI or nearest chapter to RI. We invite and hope to have questions or other communications from MUFON. Thank you very much."],"Tags":"City","Summary":"Floating objects, both clearly visible from west east sides of our house. Looked like stars, but had blinking pink/white/green lights.","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Log Number":"US-07022012-0053","Region":"Rhode Island","Date Submitted":"07/02/2012 10:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.416267,+-71.477331(40068)&iwloc=A&hl=en\"> mufon case (40068) map </A>","Object Features":"Other, Unknown","Case Number":"40068","Viewing Distance":"Over 1 Mile, Unknown","City":"South Kingstown","Weather Factors":"Unknown","Object Shape":"Star-like, Other","Latitude":"41.416267"}