{"Disposition":"Unknown","trends":["There have been 3 other sightings in Window Rock","There were no other sightings in Window Rock on or around October 19th 2005"],"Longitude":"-109.051343","Viewing Distance":"Unknown","Object Features":"None","City":"Window Rock","Latitude":"35.683663","Date of the Event":"10/19/2005 12:00 UTC","Region":"Arizona","Weather Factors":"None","Tags":"City","Source":"MUFON","Case Number":"4007","Date Submitted":"10/19/2005 12:00 UTC","files":["/var/www/straped/mufon/html2text/4007.html.txt","/var/www/straped/mufon/org/4007.html"],"Summary":"Large bright strobing orange ball","Country":"United States","Log Number":"US-10202005-0003","map":"<A HREF = \"http://maps.google.com/maps?q=35.683663,+-109.051343(4007)&iwloc=A&hl=en\"> mufon case (4007) map </A>","Object Flight Path":"Hovering then path","Sighting Duration":"00:25:00","divs":["Sighting DetailsMy husband and I were standing on the walk way outside our inlaw's home while I was having a cigarette. We were watching a satellite pass over the sky. My son got my attention at the screen door and I spoke with him for a moment and then, turned around. That is when I spotted the orange ball in the sky again. It was nearly as large as a pencil end held at arm's length and was to the right (NW) this time. Again, it was above trees. I pointed it out to my husband and we both moved out onto the lawn to watch it. It was the same object that myself and my inlaws had seen just a couple weeks ago. It was bright orange and seemed to strobe what looked more like blue and perhaps white this time. We watched it for several minutes and both of us felt uneasy. I looked over and could still spot Venus in the sky, low on the horizon, so I am certain it was not Venus, which is very bright and white. This very orange bright ball seemed to simply be hovering in the sky. All the dogs in the neighborhood were going barking like mad. My husband did not like it and said that maybe we should go inside, so we did. We went inside for a couple minutes and my husband changed his mind and asked his parents to go outside and take a look at it. We all went back outside and it was still there. About 15 minutes had passed at this point. It seemed to be a little further off and a little lower than when we had initially seen it. We all stood in the front lawn near the porch watching it and could barely make out a plane that seemed to be flying in circles around it though it seemed very small and dim in comparison. My father in law asked where his binoculars were so that he could get a better look but none of us knew. We watched it as it slowly drifted to the right and descended into the treetops across the street. The next door neighbors had started a fire next door so woodsmoke began to obscure things considerably. At this point, everyone went in except for myself and my father in law. We watched it for a couple minutes more, talking to each other about how strange it was. It was still barely visible when we finally went back in ourselves. None of us have any idea what this thing is. This is the second time that my inlaws and I have seen it, the first time for my husband. It is really unnerving to all of us and we have no explanation for what we have seen. The one thing that we all noticed this time was how the neighborhood dogs were behaving. They were all very upset and remained so for even 2 hours later."],"Object Shape":"Sphere"}