{"Weather Factors":"Unknown","Summary":"I saw a red/orange glowing UFO that appeared to be desending from mid sky until it disappeared behind the trees/view line,","Date of the Event":"06/29/2012 11:30 UTC","files":["/var/www/straped/mufon/html2text/40092.html.txt","/var/www/straped/mufon/org/40092.html"],"Longitude":"-76.538628","Date Submitted":"07/02/2012 11:53 UTC","Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","City":"Parkville","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.385489,+-76.538628(40092)&iwloc=A&hl=en\"> mufon case (40092) map </A>","Log Number":"US-07022012-0058","divs":["sighting detailsi live in towson\\parkville md. on friday june 29th approx one hour after the horrible thunder storm we had on the east coast i saw a large glowing tri color ufo. we lost power at about 10:30pm during the storm and i was sitting in my living room reading by candle light. at about 11:30 (i didnt have power so i am quessing at the time)i went to the door to see what damage there was on my street. instead i was amazed to see in the sky a round sphere type object that was white in the middle,with rings of yellow,orange and a glow of red. it was slowly desending until it was out of my view obscured by trees and buildings. my entire sighting lasted about 45 secs. it was after the storm but there was still a soft steady rain. as far as i could tell it was silent. i have no idea about the distance.i thought to go get someone else to see it but could tell i wouldnt have enough time. after it disappeared i continued to stare at the are dumbfounded. it was the first time i saw a ufo. i would like to find others who saw this that night. it had to of been seen by others. it was amazing,if you saw this please report it."],"Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Parkville","There were no other sightings in Parkville on or around June 29th 2012"],"Object Shape":"Circle, Fireball","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"39.385489","Case Number":"40092","Region":"Maryland","Disposition":"Unresolved"}