{"Sighting Duration":"00:06:00","Object Flight Path":"Path with directional change","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.666969,+-84.065064(40099)&iwloc=A&hl=en\"> mufon case (40099) map </A>","Tags":"City","divs":["Sighting DetailsIn Fowlerville,Michigan also July 2nd 2012, I was outside lighting smoke bombs with my son, we had a couple bottle rockets so i lit them off for him, as we were looking in the sky at the bottle rockets , i noticed a star started to move, at first i thought my eyes were playing tricks on me, but then, it started to go in a down and westward, then it started to go up and eastward, then down and westward again, it was very far away from the looks of it, like i said, I thought it was just a star at first, after it moved around for a little while (this was about 4 minutes) it started going up and then slowly faded and disappeared. I personally have never seen anything like that in my life. I was so excited, my father was outside and i called for him in such a hurry he believed that something bad had happened, the old man watched it with me. It was sphere shaped, emitted a soft white light, nothing else. I did see it flicker on and off about 10 minutes later to the far east sky, it appeared moved around, then disappeared, reappeared moved around and flickered out like a candle and disappeared... very lucky to see this!!"],"trends":["There have been 3 other sightings in Fowlerville","There were no other sightings in Fowlerville on or around July 2nd 2012"],"Disposition":"Unresolved","Log Number":"US-07032012-0006","Latitude":"42.666969","Object Features":"None","Longitude":"-84.065064","Date Submitted":"07/03/2012 06:55 UTC","Viewing Distance":"Over One Mile","Summary":"Saw White Star-Like UFO move around dif directions, for app. 6 minutes, it faded away and disappeared afterwards.","Date of the Event":"07/02/2012 09:20 UTC","Weather Factors":"Unknown","City":"Fowlerville","Country":"United States","Case Number":"40099","Source":"MUFON","Object Shape":"Circle, Sphere","files":["/var/www/straped/mufon/html2text/40099.html.txt","/var/www/straped/mufon/org/40099.html"]}