{"Latitude":"40.55202","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.55202,+-75.965958(40107)&iwloc=A&hl=en\"> mufon case (40107) map </A>","Disposition":"Unresolved","Country":"United States","trends":["There have been 4 other sightings in Hamburg","There were no other sightings in Hamburg on or around June 27th 2012"],"Viewing Distance":"501 Feet - 1 Mile","City":"Hamburg","Case Number":"40107","divs":["Sighting Details The night of June 27th, 2012 at around 10:45 P.M. I went outside for a cigarette and to watch the stars as I do several times every night when I spotted what I thought was a plane. I was facing west and this thing was hovering about 35 to 40 degrees off the horizon and seemed closer than an aircraft should be (maybe about a quarter mile away if not closer). But, the more I stared at it I noticed that it had 3 horizontal round white lights in a straight line with red and green lights underneath flashing at a very fast rate. The 3 white lights did not blink and I could see them lit the entire time and remained in a straight line. I believe the 3 lights were portholes since they were not very bright. The object was moving slowly but strangely. I went inside to grab my binoculars and came back out and the object was still hovering in about the same spot but, doing a circular motion and moving up and down and sideways. I focused the binoculars on it and played with the zoom in and out trying to get a clear look when I noticed the 3 white lights started to turn vertically and then kept turning until it did a 360 degree turn. This is when I went inside and told my husband to come outside. He tried using the binoculars and even went inside to get his hunting spotting scope but could not get a perfect view of it since we have a light on a pole close to our deck which makes it harder to see the sky. He still thought it was a strange sight and not a plane. I had a better view of it since I was a little further away from that pole lamp. We watched it for several minutes before it finally took off slowly and finally went behind a tree where we could still see some lights through the leaves before it finally disappeared from our view. The whole episode must have lasted about 10 minutes and I could never get a clear view of the body of the object because the green and red lights were flashing so bright and fast (and I was shaking a bit) but it seemed to have a dark (maybe black, gray or silver) body. I could not tell the shape of the body but if I had to guess it appeared to be cigar or disc shape. I have never seen anything like this in my entire life. Every night I watch the planes, stars, planets, satellites and occasionally shooting stars in the sky and am very familiar with objects in the night sky but this was a new experience for me. It was both exciting and a bit scary."],"Log Number":"US-07032012-0014","Tags":"City","files":["/var/www/straped/mufon/html2text/40107.html.txt","/var/www/straped/mufon/org/40107.html"],"Object Shape":"Cigar, Disc","Region":"Pennsylvania","Date of the Event":"06/27/2012 10:45 UTC","Object Flight Path":"Path with directional change","Date Submitted":"07/03/2012 01:33 UTC","Weather Factors":"Unknown","Summary":"Red and Green Flashing Lights below 3 Round White Portholes","Object Features":"Window(s)","Longitude":"-75.965958"}