{"Object Shape":"Unknown","Case Number":"40101","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=35.723028,+-86.336342(40101)&iwloc=A&hl=en\"> mufon case (40101) map </A>","Summary":"Possible abduction","Source":"MUFON","trends":["There have been no other sightings in Christiana","This sighting has been favorited 1 time."],"Disposition":"Unresolved","City":"Christiana","Longitude":"-86.336342","divs":["Sighting DetailsOn either the 26th or 27th of June 2012 I awoke that morning with a burning sensation in my right sinus, like a couple of drops of some caustic fluid had been put there - as if I were laying on my back & it dripped in.. kinda hard to explain. Anyway, I rolled over to tell my partner about it & noticed two fresh marks on his back; circular & below the shoulder blade which later turned into bruises. I have photos of the bruises & will submit them if there is a place for it. There was nothing in the bed that would have caused this bruising, that was the 1st place I looked. I also scoured the house & found nothing that would make marks like that, so perfectly aligned. Later, when I stepped out of the shower, I noticed several small bruises & marks on my upper body [like I had been in a fight]. Neither of us remember dreaming that night nor any memory of how we got those marks on us. The dogs didn't alert us to anything that night [they didn't bark & wake us up]. Another odd thing is, the garage door was open that morning. Could all be coincidence & who knows about the garage thing but I thought I should share."],"Latitude":"35.723028","Sighting Duration":"Undisclosed","Region":"Tennessee","Object Flight Path":"N/A","Tags":"City","Country":"United States","Weather Factors":"Unknown","Date Submitted":"07/03/2012 09:28 UTC","Object Features":"Unknown","Log Number":"US-07032012-0009","files":["/var/www/straped/mufon/html2text/40101.html.txt","/var/www/straped/mufon/org/40101.html"],"Date of the Event":"06/26/2012 04:00 UTC"}