{"Log Number":"US-10212005-0002","Weather Factors":"Unknown","divs":["Sighting DetailsI went out on my porch to have a cigarette. I was there for about a minute before I noticed the object hanging silently above the treeline. Out of the corner of my eye, I figured it for a plane, but it didn't move, and that's what got my attention. It was probably a few blocks away from me, but hanging right above my street. It was a row of strobing lights, tilted at about 25 or 30 degrees. The lights strobed very fast, from left to right, emerging from around the side of the object, and disappearing around the other side. They were mostly white and red, with a few blue strobes near the middle of the object. The way the lights disappeared made the object appear to be either circular or triangular shaped. It hung in the air silently for about one minute after I noticed it. It was still hovering when I ran inside to try and get it on camera. (I did what I could, but I used the video setting of my digital camera, and it came out very dark, and I don't have the technology to lighten it.) After I returned, and tried to film it, it began to slowly move southward, down my street it seemed, and then curved to the southeast, out of my view. It frightened me when I first saw it. Really scared me. It took awhile for me to realize I could capture it on film. When I got my camera, I fumbled it around a lot. I was shaken. I know it was not a plane. Two planes flew by later, following their normal east to west, or west to east paths that I see all day. This object was very low in the sky. Probably less than 500 feet above the ground. It was close enough that I should have heard some sound from an engine. It was also huge. I can't say how big, but from one end of the strobing lights to the other, it was far bigger than any plane I've seen. I'm even familiar with the sight of C-130's flying at night, having lived for two years at the Marine Military Academy, right next door to the Confederate Air Force, and an airport that allowed C-130's to practice touching down and lifting off. This object had a solid row of strobing lights that moved in one direction. I've seen no plane look like that before. It was not a plane. It was also not a helicopter. The only thing it COULD have been, besides being an unknown craft, is a blimp. Actually, come to think of it, it couldn't have been even that. A blimp would have blocked out the sky above the lights, and that was not the case. I'll attach the films, perhaps you can clean them up. The second film is the longest. The strong row of lights you see are streetlamps. Please remember, I was very shaken when I took these, and it's a crappy digital camera recording. Thanks for all your diligent work in taking these reports. ~~Kevin"],"Case Number":"4010","Object Shape":"Disc, Triangle","Summary":"Tilted Saucer or Triangular Object Just Above Treeline","Disposition":"Insufficient Data","Source":"MUFON","trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around October 19th 2005","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Date Submitted":"10/19/2005 10:45 UTC","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Longitude":"-87.905004","Country":"United States","files":["/var/www/straped/mufon/html2text/4010.html.txt","/var/www/straped/mufon/more/4010_submitter_file1__ufo_sketch1.jpg","/var/www/straped/mufon/org/4010.html"],"City":"Milwaukee","Region":"Wisconsin","Latitude":"43.040422","map":"<A HREF = \"http://maps.google.com/maps?q=43.040422,+-87.905004(4010)&iwloc=A&hl=en\"> mufon case (4010) map </A>","Date of the Event":"10/19/2005 10:45 UTC","Tags":"City","Object Features":"Unknown"}