{"Case Number":"40117","Summary":"Seen in sky with strange movements and interacted with airliner flying beside it then zooming straight upsnd blinking out!","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-118.862556","Date Submitted":"07/03/2012 08:07 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Region":"California","Disposition":"Unresolved","Tags":"City","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","City":"Thousand Oaks","Date of the Event":"07/01/2012 09:15 UTC","files":["/var/www/straped/mufon/html2text/40117.html.txt","/var/www/straped/mufon/org/40117.html"],"Latitude":"34.192884","Object Shape":"Sphere","divs":["Sighting DetailsI was setting at my table underneath my back patio as my wife was BBQing, I noticed a yellowish light (like a sodium vapor light) in the diastance. Given the angle from my perspective I would imagin it to be around 15 miles out. It seem to me at first to be a helicopter. As it got closer it made am abrupt turn north then totally reverse direction and proceeded south for maby 3 seconds and stopes and hovered in place and glowed incredibly bright. At this point it was mabey 5 miles out. I called over my wife and she seen it also. Something else I want to point out is we live under the approach to LAX for planes coming in from the north, it's like a highway in the sky. I would guess there altitude to be 5500'. We had a near full moon at the time and the object was at the 7:00 position to the moon. It stayed stationary for 5 minutes then moved into the path of incoming planes, as one plane approached I noticed the object moved to avoid it at the same time it's light intensity decreased then it started to move into the glow of the moon then it blinked a few times then disappeared straight up. I kept an eye out for it but it was gone. As all this was happening I had an uneasy feeling about it and I also felt it was observing the air planes flying into LAX. I've observed alot aircraft but nothing has these traits that I witnessed that night, it seemed like it was intelligently operated although somewhat indecisive in what direction to fly in. Also I felt like it knew I was observing it and as it flew off it did so by bleeding in with the moon glow."],"trends":["There have been 17 other sightings in Thousand Oaks","There were no other sightings in Thousand Oaks on or around July 1st 2012"],"Sighting Duration":"00:10:00","Object Features":"Unknown","Log Number":"US-07032012-0023","map":"<A HREF = \"http://maps.google.com/maps?q=34.192884,+-118.862556(40117)&iwloc=A&hl=en\"> mufon case (40117) map </A>"}