{"Region":"Florida","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around May 24th 2012"],"Disposition":"Unresolved","Source":"MUFON","Log Number":"US-07032012-0024","divs":["Sighting DetailsMay 24, 2012 about 9:00 PM. We were on the beach at the entrance to Ft. Pickens when we noticed a bright object that suddenly appeared in the sky to the north of Gulf Breeze, FL. The object bobbed around for a few minutes and began to descend. The light patterns did not match conventional aircraft running lights and were stunningly bright. At first we thought it may be a plane coming into to land at the airport, but it would descend, ascend, and then descend again, sometimes winking out and then reappearing a few degrees higher. After a while we became curious and chased the object down for several miles, driving back into town to an area referred to as \"East Hill\". When we finally got close enough to it to see what it was (approximately 100-300 feet away) we made out a distinct triangular outline with 3 lights on each corner. (From a distance of three miles the object appears as a glowing golden disk which I presume is due to viewing it \"edge on\".) My friends who had accompanied me were in a second car closer to the object and stated it made no noise and \"glided\" over the treetops. After a while it hovered out of our line of sight over the treetops. This incident was one of two that were witnessed by a number of people both within 9 days of each other. The second incident occurred approximately 9 days later on June 2, 2012. A similar object was sighted and photographed by two different people around the same time period. One photo was taken by each person with a gap of approximately 10 minutes between each sighting. A third and fourth witness whom we met later that night described a similar object that resembled a triangular pattern of lights confirming the earlier sighting. Three photos were included with this report, the first was taken by me, the other two by the the other witnesses 9 days later. The objects in question have been circled in each photos."],"Sighting Duration":"01:00:00","Weather Factors":"Unknown","Case Number":"40118","Viewing Distance":"101-500 Feet, Over 1 Mile","Summary":"May 24th -June 2nd 2012 Pensacola UFO Wave, triangular/disc-like objects observed by multiple witnesses on two different dates","Object Features":"Other","Date Submitted":"07/03/2012 08:52 UTC","Longitude":"-87.214385","Object Shape":"Disc, Star-like, Triangle","Latitude":"30.430639","Country":"United States","Object Flight Path":"Hovering then path","Date of the Event":"05/24/2012 09:00 UTC","City":"Pensacola","map":"<A HREF = \"http://maps.google.com/maps?q=30.430639,+-87.214385(40118)&iwloc=A&hl=en\"> mufon case (40118) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/40118.html.txt","/var/www/straped/mufon/org/40118.html"]}