{"Object Shape":"Disc, Sphere, Star-like","Country":"United States","Source":"MUFON","Region":"California","files":["/var/www/straped/mufon/html2text/40116.html.txt","/var/www/straped/mufon/org/40116.html"],"Latitude":"36.782051","Viewing Distance":"Unknown","divs":["Sighting DetailsApproximatly 10pm Pacific time, I went into my back yard to observe those guys when they are around. This night, one was observed doing a figure eight pattern directly above my house but still at a very high altitude. As usual, I began signaling with my light as I mostly get a signal plash response back. This time, five others instantly zipped into view from all directions directly over me, but at a lower altitude. One dimmed out as it decended down to me. This was the first time I had ever gotten this kind of reaction from flashing my light at them. I ran into my house in a panic and imidiatly called my friend and then my neighbor, informing them that I may have made a mistake and pissed off either the grey guys or the blue guys. Either way, I have no plans on going anywhere so if I can't be found than expect foul play. The next morning it was on the news, many sightings where reported. The news broadcaster said that NASA insists it was just a new kind of meteor that comes down in different directions and hovers etc. Sightings of it where recorded in Corona Ca. and Arizona. But this is just one of many ongoing sightings I am and have witnessed for many years. I also have photos of past sightings, but it has become more interesting since I discovered a way to communicate with them. I believe that where I made my mistake was using my hand held spot light, I think that made them upset. If anyone uses a light, don't use anything larger than a Surefire light, I have had better results with my tac light. One day I will share my experience with the blue guys, but I wont go into to much detail as, since it is top secret military stuff, I won't disrespect their privacy and right to secrecy, but it was very interesting as I was on duty at the time in full uniform. Knowing what I know now, I am sure they where laughing their ass's off at me."],"Summary":"Personal contact & communication","Sighting Duration":"Undisclosed","Object Features":"None","Disposition":"Unresolved","Weather Factors":"Unknown","Date Submitted":"07/03/2012 07:36 UTC","Object Flight Path":"Stationary,Other","Log Number":"US-07032012-0022","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=36.782051,+-119.410042(40116)&iwloc=A&hl=en\"> mufon case (40116) map </A>","Tags":"City","Date of the Event":"10/10/2011 12:00 UTC","Longitude":"-119.410042","City":"Undisclosed","Case Number":"40116"}