{"Region":"Missouri","Latitude":"39.428684","Object Shape":"Fireball, Sphere","Viewing Distance":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.428684,+-94.196254(40113)&iwloc=A&hl=en\"> mufon case (40113) map </A>","Summary":"{ck} Watkins Woolen Mill Camping UFO","divs":["Sighting DetailsOur family was camping at Watkins Woolen Mill State Park and it was about to rain, so we were rushing to put the rain guard on our tent. About halfway through, my wife asks \"What is that up in the sky?\" I am a firm disbeliever of alien life visiting this planet and UFOs attributed to them, so I looked-up and saw something I could not explain. It was a slow moving ball of light that flickered as it moved. It was completely silent. About 2 minutes into viewing it, the light shut off and then turned back on. It was slowly descending into the horizon, which was trees, when it turned to the left of the horizon very quickly, went really fast, there was a flash and then it disappeared. I could not explain the object, so I told my wife it might have been an experimental govt aircraft, a meteor, or something else scientific. I had this eerie feeling all night afterwards and in the middle of the night my wife and the other 3 women in our party walked-up to go to the bathroom, leaving me all alone in our tent. While they were gone I got extremely paranoid because it felt like something was watching me or spying on me. My heart was racing and I was so relieved when my wife came back. To tell you the truth, Im not sure what happened that night, but it has left me feeling awkward ever since."],"Case Number":"40113","Object Features":"Unknown","trends":["There have been 2 other sightings in Lawson","There were no other sightings in Lawson on or around June 30th 2012"],"Longitude":"-94.196254","Sighting Duration":"00:10:00","Tags":"City","files":["/var/www/straped/mufon/html2text/40113.html.txt","/var/www/straped/mufon/org/40113.html"],"Object Flight Path":"Path with directional change","Date of the Event":"06/30/2012 09:00 UTC","Weather Factors":"Unknown","Log Number":"US-07032012-0019","Source":"MUFON","Country":"United States","City":"Lawson","Date Submitted":"07/03/2012 04:26 UTC"}