{"Date Submitted":"07/03/2012 11:25 UTC","Tags":"City","Case Number":"40124","Date of the Event":"08/07/1986 12:00 UTC","Latitude":"32.702964","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Features":"Unknown","Object Shape":"Triangle","Region":"Texas","Log Number":"US-07032012-0030","City":"Fort Worth","Disposition":"Unresolved","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around August 7th 1986"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.702964,+-97.389868(40124)&iwloc=A&hl=en\"> mufon case (40124) map </A>","divs":["Sighting DetailsI was about 16 years old, and I was sitting in the back seat of my mother's Volvo on our way home. She was driving, and her friend was in the front passenger seat. The moon roof of the vehicle was open, and we were talking about a tragic auto accident that was in the news. We were at the intersection of Hulen St. and I-25 in fairly heavy traffic at the stoplight to turn left under the bridge and drive towards Overton Park. It was night, and I was talking while looking out of the moon roof from the back seat. I saw something unusual, and I sat forward to focus in on it. In the sky, hovering low, were three orange-red lights in a triangle formation. I appeared to be directly above the traffic in the right oncoming lanes. It was a triangle formation, and I remember getting my mother's attention to look at it. It seemed to be hovering, then as our light turned green and my mother moved forward into the intersection to make the left turn, I could tell the lights were moving slowly in the same direction and at one point were directly above us. I could not see any body or mass to whatever it was, but I remember that I thought it was really strange that it blocked out the view of what little stars were in the sky. I remember feeling a bit of panic, and I didn't take my eyes off of it. As we drove under the bridge, I watched to see it as we came out of the other side and it was completely gone. Vanished. I have ways wondered what it could have been and speculated that perhaps I had witnessed a UFO or strange military craft."],"files":["/var/www/straped/mufon/html2text/40124.html.txt","/var/www/straped/mufon/org/40124.html"],"Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Summary":"Medium invisible triangle with red corner lights hovered then moved.","Longitude":"-97.389868"}