{"trends":["There have been 3 other sightings in Aguilar","There were 3 other sightings in Aguilar on or around October 1st 2007"],"Date of the Event":"10/01/2007 12:00 UTC","Object Features":"Undisclosed","Date Submitted":"07/04/2012 12:13 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.326352,+-104.884868(40129)&iwloc=A&hl=en\"> mufon case (40129) map </A>","Country":"United States","Latitude":"37.326352","files":["/var/www/straped/mufon/html2text/40129.html.txt","/var/www/straped/mufon/org/40129.html"],"Weather Factors":"Unknown","City":"Aguilar","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Case Number":"40129","Region":"Colorado","Source":"MUFON","Summary":"Daughter claims a little gray man was in her bedroom looking at her toys then her.","Object Shape":"Unknown","Longitude":"-104.884868","Log Number":"US-07042012-0003","divs":["Sighting DetailsWe had just moved to the mountains near Trinidad, CO. My daughter was about three at the time. She did not want to go to bed because she was scared. I went to her room and laid down with her. I asked her what she was scared of and she described an event she said happened the night before. She said she woke up in the night and saw a little person standing next to her bed. She said it was looking at her toys. She then said it turned and looked right at her and she said she then ran to my room. I asked her what the person did, and she just said tha it was standing there. Mind you, this is coming from a three year old and I didn't want to hate her with questions because I wanted only her account of the event. Some of it was sketchy, but I did manage to get her to tell me that it didn't touch or hurt her. I then got a piece of paper and a black marker and asked her if she could draw Mommy a picture. She drew a fairly good picture of what looked like a little man that she said was gray in color. She did emphasize to me that it's eyes had these lines on them like a bumble bee stripes but in a grid pattern. I She said it was yellow and black. I got her a yellow marker and she colored in the eyes a bit and wanted me to help her draw the grid pattern in black. I asked her if it had a mouth or did it talk to her and she said it had sharp little teeth but didn't speak. I asked her if the face scared her and she said no, only when it looked at her did she get scared. That's all the info I could get. I don't know if it was a dream, fantasy, or true, but I never allowed her access to anything remotely like it on tv or books, so I'm not sure where she suddenly got such a detailed image. I'll always wonder about it, though. She suffers from a learning disability, dyslexia, and has trouble with focusing on a task. As a baby, we never had any notion that she might have these difficulties. They began after we moved to that house. Now we live in Texas and she is doing much better. She's eight now. She insisted back then that she wasn't dreaming and that it was real. It was pretty frightening for her and me."],"Disposition":"Unresolved","Viewing Distance":"Unknown"}