{"Object Shape":"Disc, Oval","files":["/var/www/straped/mufon/html2text/40135.html.txt","/var/www/straped/mufon/org/40135.html"],"Sighting Duration":"00:10:09","Object Features":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.387654,+-81.372054(40135)&iwloc=A&hl=en\"> mufon case (40135) map </A>","Source":"MUFON","Weather Factors":"Unknown","Region":"North Carolina","Summary":"short time over tree tops feeling no noise but having a light electric feel in the air","City":"Cherryville","trends":["There have been 3 other sightings in Cherryville","There was one other sighting in Cherryville on or around July 3rd 2012"],"Object Flight Path":"Path with directional change","Date Submitted":"07/04/2012 12:22 UTC","Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting DetailsI was comming home from the fire works that the city put on. I did not want to go home right away so I started driving out on the outskirts of town where there is no people living and mostly old abondon houses. I drive a newer car so no problems with the raido. The music started to fade in and out and cut out all together. But before that happen a weird noise came apon my speakers and it sounded like a half of some type of word. It is a sound that will always be in my head. As i glance out my window I saw some lighting as i thought it was more fireworks but the lights were still at first. Then I stopped on the side of the road and saw the lights started to move. They were moving up and down but in a slow moving way. It kind of felt like time was slowing down. I could not belive what i was seeing. I have seen a few UFO's in Mississippi but not this close to me. With in the time i was able to grasp at what i was looking at it started to flot up and into the clouds and disappered like it had a camo of the clouds that were comming in from a storm. This area has open farm lands in this area also. I will keep watch on any news of missing or dead animals. The Ufo itself was hard to see for what shape it was. As i moving around the shape was not fully oval but more of a triangle with a oval end. The lights on it were a light green with hints of white in them. and it also had a single light that was i redish orange. When i fist saw the UFO it made my heart skip because it was like walking up on a snake. The feeling of a low electric current start comming over my body. I was able to move and pull over my car to step out to get a better look. My judgement the ufo was there some time before i got there and was in the process of leaving when I drove up."],"Case Number":"40135","Latitude":"35.387654","Log Number":"US-07042012-0009","Disposition":"Unresolved","Date of the Event":"07/03/2012 10:25 UTC","Longitude":"-81.372054"}