{"Disposition":"Unresolved","Object Features":"Unknown","Weather Factors":"Unknown","Log Number":"US-07042012-0007","map":"<A HREF = \"http://maps.google.com/maps?q=39.954524,+-83.082819(40133)&iwloc=A&hl=en\"> mufon case (40133) map </A>","Date of the Event":"07/03/2012 09:30 UTC","Object Shape":"Disc, Oval","Latitude":"39.954524","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","City":"Columbus","files":["/var/www/straped/mufon/html2text/40133.html.txt","/var/www/straped/mufon/org/40133.html"],"Region":"Ohio","Case Number":"40133","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around July 3rd 2012","This sighting has never been favorited.",""],"Date Submitted":"07/04/2012 12:17 UTC","divs":["sighting detailswe were leaving the red white and boom fireworks in columbus ohio. the fireworks ended at approximately 10:25pm as we were leaving the bridge,where we were viewing the fireworks. at approximately 10:30pm my girlfriend stops me and says whats that in the sky, so we stopped and i looked at the objects which had a blue\\purple glow almost like a black light. i had no idea what they were, i just know they were not any aircraft i have ever witnessed. there were 5 to 6 in the main group,and in a very loose formation with one of the objects trailing behind the others. they moved very slowly in a straight path in a slight northeast direction for close to 3 minutes,before they faded out. there were many helicopters and planes in the sky as this is a huge event and these were distinctly different. i tried to get video on my camera and i believe i caught the trailing object for a brief moment as the others were obscured by the street lights, but cannot be sure it is not just an artifact of the street lights. i know the people we were standing beside during the fireworks stopped with us to view the objects. im not sure how many people saw this as there were thousands leaving the area. i was very excited to witness this, my girlfriend seemed a bit less enthusiastic about it but kept calling them aliens,as we discussed what we saw while walking back to our vehicle."],"Longitude":"-83.082819","Summary":"witnessed 6-7 glowing bluish glowing objects in a loose formation 1 trailing behind","Country":"United States","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile"}