{"Disposition":"Unresolved","Object Shape":"Star-like","Longitude":"-81.027334","Date of the Event":"07/04/2012 01:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.01039,+-81.027334(40138)&iwloc=A&hl=en\"> mufon case (40138) map </A>","Date Submitted":"07/04/2012 01:43 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 22 other sightings in Columbia","There were no other sightings in Columbia on or around July 4th 2012"],"Tags":"City","Log Number":"US-07042012-0012","Object Features":"None","divs":["Sighting Details I just opened the door to take my dogs out for the night when I looked up an saw this very bright orange light traveling Southeast then East. As soon as I saw it I yelled for my brother to come outside. When he got there it was behind the trees but we moved to a better view and we saw it move East in a wobbly motion. When I first saw it I thought It was a firework, but after a few seconds of it not going off or falling to the ground I did not know what to think of it, neither did my brother. We both looked at it in amazement and confusion because we did not know what it was and when it was gone my brother told me I should have gotten my camera, but told him I would have missed everything if I had went inside. We lost sight of the object after about 3-5 minutes when it moved into the distance and below the distant trees. As it moved away it was still very bright but just a little dimmer. There were fireworks going off but to the west of my location, where as the object was to the south. I waited for along time to see if there was any fireworks in that area and there was not. I only put my email. If you email me I will get back to you 100% where as I almost never have my phone on or near me."],"files":["/var/www/straped/mufon/html2text/40138.html.txt","/var/www/straped/mufon/org/40138.html"],"Case Number":"40138","Country":"United States","Region":"South Carolina","City":"Columbia","Latitude":"34.01039","Summary":"Orange light above the tree line moving south then east","Sighting Duration":"00:05:00","Object Flight Path":"Path with directional change"}