{"Region":"Capital Federal","files":["/var/www/straped/mufon/html2text/4013.html.txt","/var/www/straped/mufon/org/4013.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=-34.608418,+-58.373161(4013)&iwloc=A&hl=en\"> mufon case (4013) map </A>","Longitude":"-58.373161","City":"Buenos Aires","Sighting Duration":"00:03:07","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 17 other sightings in Buenos Aires","There were no other sightings in Buenos Aires on or around October 19th 2005"],"divs":["sighting details19\\10\\2005 other intensive ufo wave is record tonight (were produced mysterious light blackouts ) . 20h18m a fire ball\" of - 1 m (pos v.e.d) ,rut the sky of the federal capital from the southwest toward and northeast , happening next to venus , but then and already in full urban center of the city of bs.as (almagro ,palermo ,once) the mysterious fire ball ,sheen yet but and then disappeared almost by on the river of the plate ,the hard phenomenon but of 3 minutes and it was very impressive hardly seconds before the observation of this phenomenon and exactly , by on that zone of the city it was produced a light court (almagro) ., minutes after intensive and iterative \" light pulses\" thoroughly abnormal and of magnitude gleamed in several sectors , but always in the zenith on the city. a misfit have incessant quantity of outlines of smaller magnitude were observed , also in several sectors of the capital celestial vault . 20h50m other outline of great sheen ,crossed also the city but this time from the southeast northward ,modifying your abnormal way course westward . several you take of relevancy were registered in video even fractions of the light pulses. http:\\\\groups.msn.com\\glaucoart"],"Latitude":"-34.608418","Source":"MUFON","Date of the Event":"10/19/2005 08:18 UTC","Log Number":"AR-10212005-0005","Viewing Distance":"Unknown","Country":"Argentina","Disposition":"Unresolved","Object Shape":"Undisclosed","Case Number":"4013","Tags":"City","Date Submitted":"10/19/2005 08:18 UTC","Summary":"Not Provided","Weather Factors":"Unknown"}