{"Summary":"3 lights becoming long then small, starlike then long again. triangle shape. white lights. camera would not pick up. each light different appearance and movement. 3 witnesses","files":["/var/www/straped/mufon/html2text/40144.html.txt","/var/www/straped/mufon/org/40144.html"],"Date Submitted":"07/04/2012 07:13 UTC","Longitude":"-86.136343","Object Features":"Appendage(s)","Latitude":"40.534006","Date of the Event":"07/04/2012 05:00 UTC","Tags":"City","Disposition":"Unresolved","Object Shape":"Flash, Star-like, Triangle, Other","Sighting Duration":"Undisclosed","Case Number":"40144","City":"Kokomo","map":"<A HREF = \"http://maps.google.com/maps?q=40.534006,+-86.136343(40144)&iwloc=A&hl=en\"> mufon case (40144) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Path then hovering","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsI Was on the computer when my 19 yr old son calls me from his cell phone, he says come outside you won't believe this. When I went outside it was 5am and still dark here. In the eastern sky I saw 3 lighted objects. They together formed a flat triangle with the point of the triangle angled more upward then the back 2 corners and the point was toward the north, the 2 corners toward the south. Each light had a different brightness to it which made me believe they one furthest away was dimmest, the brightest closest. The point of the triangle object was the more active of the 3 as it constantly dimmed and brightened and changed shape in what appeared to go from like a star to a long stick figure like shape. Up and down. All 3 objects did the same type of shape change but all at different times, and at different speeds. The 2 corner objects appeared as if one was above the other but as already said, the dimmer of the two I believe was further away. This iS also the one which appeared to be over the top of the other. The lower, brightest of the 3, was the least active and stayed brighter longer, changing shapes less often but was also the one most easy to see clearly. It appeared to have 2 appendages going outward from the top with 2 others going upward from the middle and 2 leg-looking things below. The appendages would disappear from bottom upward making the light look starlike briefly then the appendages would return. Each object shape changed like the same way but at different intervals. Me, my son and husband watched for an hour trying to come up with logical explaination but could not. And the just as my husband and I were about to go back inside, a 4th lighted object came flying out of nowhere and look like it was going to fly between the 2 south corner objects. And just as it approached them, the 4th flying object vanished. We continued watching a while longer and the flying object never was seen again anywhere in the sky after that. When we came inside the point object was no longer visible but the 2 southern objects continued as before. It was very hard to determine if the objects were hovering and stationary or if they were moving at an upward angle ever so so slowly. All of us thought at times we saw them ascending upward but yet never move. I can't find the right words to explain it all really let alone fully comprehend it. But I cannot logically explain any of it as being of human origin. This I know."],"Log Number":"US-07042012-0018","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around July 4th 2012"],"Region":"Indiana"}