{"City":"Huntington Beach","Summary":"red orange lights moving around in the sky over huntington beach","Weather Factors":"Unknown","Tags":"City","Latitude":"33.666247","Longitude":"-117.991576","Case Number":"40145","Date of the Event":"07/03/2012 09:30 UTC","Region":"California","Object Flight Path":"Path with directional change","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.666247,+-117.991576(40145)&iwloc=A&hl=en\"> mufon case (40145) map </A>","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around July 3rd 2012"],"Viewing Distance":"Unknown","Log Number":"US-07042012-0019","Object Shape":"Fireball, Sphere","files":["/var/www/straped/mufon/html2text/40145.html.txt","/var/www/straped/mufon/org/40145.html"],"Object Features":"Unknown","Date Submitted":"07/04/2012 08:04 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI first saw these lights on july 1 2012 around 11:20pm I had just got off work and as I was walking to my car I noticed a bright red-orange light moving east from the west. I noticed there were no blinking lights like you see on airplanes. Then a second light just popped out a little north of the first. I went inside to get my manager and when we walked back outside there were now 6 lights spread out in the sky they would move fast then slow down and then stop and just sit there. Also a plane went by and it was way lower than the lights but the lights were much brighter than the airplane. Now it is july 3rd at around 9:30pm I am outside on my break talking to a coworker about what my manager and I saw and I pointed to where the lights were and it showed up again this night there was a lot of cloud cover so it must have been low but it was bright and moving south as if from seal beach. This time about a group of 20 or so people had gotten together in front of the store. It moved slowly changing directions instantly and it seemed to be pulsing and would go out and come back like a light bulb going on and off till it stoped and shot straight up. I was at the corner of beach blvd and slater ave at Walgreens."],"Country":"United States"}