{"Summary":"4 objects sighted between st-leonard and grand-falls, new brunswick","Weather Factors":"Unknown","City":"New Brunswick","Longitude":"-74.441869","files":["/var/www/straped/mufon/html2text/40157.html.txt","/var/www/straped/mufon/more/40157_submitter_file1__ufo1.jpg","/var/www/straped/mufon/org/40157.html"],"Date Submitted":"07/04/2012 10:27 UTC","Latitude":"40.492586","Sighting Duration":"Undisclosed","Log Number":"CA-07042012-0026","Viewing Distance":"Over One Mile","Date of the Event":"07/01/2012 05:45 UTC","Case Number":"40157","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.492586,+-74.441869(40157)&iwloc=A&hl=en\"> mufon case (40157) map </A>","divs":["Sighting DetailsI was outside when i heard a buzz...at first i thought it was someone flying and motorized hanglider (with a large propeler and a parachute on top). Then i saw the RCMP (police) helicopter...this helicopter routinely flies over the st-john river, patroling the Canada-US border. A few seconds after seeing the helicopter, i noticed coming from the south 1, then 2, then 3, then 4 objects, appearing like flying balls, but flattened a little bit, and grey colored, in formation. These objects appeared to be following the helicopter. the helicopter flew straight over St-Leonard, but the objects turned and flew a perpendicular path, crossing somewhere between St-Leonard and Grand-Falls, a town about 10 miles away. It was difficult to tell the height of the objects. They continued for a few miles then turned and seemed to head away from us, and then proceeded into the low cloud cover. The sky was partly cloudy at the time. At first my wife could't see them because they were so small, but she eventually did see the last 2 before they went into the clouds. Strange thing...the helicopter flew a bit further north of town and then circled a large area for about 30 minutes, something i had never seen it do before. I theorize they had radar and were keeping track of the objects, until they eventually went out of radar range. I spent the while evening ready with my video camera but didn't see the objects again."],"trends":["There have been 6 other sightings in New Brunswick","There were no other sightings in New Brunswick on or around July 1st 2012","This sighting has never been favorited.",""],"Region":"New Brunswick","Object Shape":"Sphere","Source":"MUFON","Disposition":"Unresolved","Country":"United States","Object Features":"Unknown","Object Flight Path":"Path with directional change"}