{"Country":"United States","trends":["There have been 2 other sightings in Lowell","There were 2 other sightings in Lowell on or around July 4th 2012"],"Sighting Duration":"Undisclosed","Date Submitted":"07/05/2012 12:05 UTC","Object Shape":"Circle, Diamond, Fireball","Log Number":"US-07052012-0003","Case Number":"40165","Summary":"Many glowing moving objects, from several directions, some single, some in groups. Appeared to fade out, but more or same ones reappeared.","divs":["Sighting DetailsWe were coming home from taking my sister-in-law home. We were driving on a rural road, when my husband commented \"that's a funny looking airplane.\" At that point, we took a closer look and realized that it was not an airplane. The object was moving west to east, and had a pulsating, reddish-orange glow. It was dusk, not quite dark yet. The object seemed to move with purpose, not too fast or too slow. My husand thought the object was round, but when it was directly over our car, I thought it was diamond shaped. We watched it as long as we could, until it eventually faded out. We thought that was the end of it. When we got closer to home, approximately 5-6 miles from where we originally saw the object, we noticed another one. We live in a different town than my sister-in-law. This object appeared to be the like the one we saw earlier, approximately 10 minutes after we saw the first object. It was also moving west to east. Then, when we turned on the road leading to our house, we saw another object straight ahead. This object was moving west to east as well. We followed it as far as we could, until it faded out. We turned around and went to our house. As I got out of the car, I saw another object, this time moving north to south. My husband ran into the house to grab some binoculars. He ran out of the house, and tried to get a better look at the object, but wasn't successful. The object moved out of the range of our vision. Within several seconds, we saw another object moving north to south. Again, we were unable to get a clear picture. My husband grabbed his telescope, but by that time, we could no longer see the object. Shortly after that, we saw another one, this time moving south to north. We watched this one until it faded away. My husband turned around and saw approximately 6 of the same objects coming over the trees on the west side of our house. These objects were moving in a north to south-easterly direction. By this time, my husband ran to our neighbors house, they were outside doing fireworks. He asked if they had seen the lights, and they responded that they thought they might be chinese lanterns. However, upon coming indoors, I looked chinese lanterns up on the internet and found that they \"float\" along with the direction of the wind. There was no wind blowing in any direction. These objects appeared to be moving in several different directions, so that does not seem to make sense. I also looked up images of chinese lanterns, and they did not resemble what we saw at all. We realize that this was July 4th, however, please be assured that what we saw was not fireworks."],"files":["/var/www/straped/mufon/html2text/40165.html.txt","/var/www/straped/mufon/org/40165.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.316465,+-87.41932(40165)&iwloc=A&hl=en\"> mufon case (40165) map </A>","Date of the Event":"07/04/2012 08:30 UTC","Region":"Indiana","Object Features":"None","Source":"MUFON","Disposition":"Unresolved","City":"Lowell","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Latitude":"41.316465","Tags":"City","Viewing Distance":"Unknown","Longitude":"-87.41932"}