{"Sighting Duration":"Undisclosed","Object Shape":"Circle, Oval, Sphere","Case Number":"40166","Viewing Distance":"Unknown","Latitude":"39.146973","Object Features":"None","Object Flight Path":"Straight-line path","Country":"United States","City":"Severn","Longitude":"-76.690472","trends":["There have been 3 other sightings in Severn","There were no other sightings in Severn on or around July 4th 2012"],"Source":"MUFON","Summary":"Orange-red orb flew in a straight line past the trees out of eye sight. Then 5 minutes later was seen again.","Weather Factors":"Unknown","divs":["Sighting DetailsI was in my boyfriend's florida room watching fireworks because it was extremely hot out and there were a lot of mosquitos. All of a sudden he pointed at the sky and said what was that. we ran outside to see an orange-red orb floating fast through the sky at the tree lines. it was about the size of a basketball and it didn't seem to far away. we live near an airport so the first thing we thought of was a plane or a helicopter, but there was no sound or flashing lights it was just a constant glowing circle moving faster than any of the planes we see daily. it moved from left to right through the sky and about maybe 10 minutes or more after we saw it again, making the same flight pattern. first thought that came to my mind was a meteor or something like that but i feel like the light would have at least pulsated instead of staying a constant glow. we kept asking each other what the \"f**K\" is that and could not believe our eyes. after the second time i ran inside to grab my camera, but we never saw it again."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.146973,+-76.690472(40166)&iwloc=A&hl=en\"> mufon case (40166) map </A>","Disposition":"Unresolved","Region":"Maryland","Tags":"City","Date of the Event":"07/04/2012 10:30 UTC","Log Number":"US-07052012-0004","Date Submitted":"07/05/2012 12:06 UTC","files":["/var/www/straped/mufon/html2text/40166.html.txt","/var/www/straped/mufon/org/40166.html"]}