{"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/40171.html.txt","/var/www/straped/mufon/org/40171.html"],"Date Submitted":"07/05/2012 12:42 UTC","Country":"United States","Date of the Event":"07/04/2012 10:25 UTC","Region":"Illinois","Longitude":"-87.753728","divs":["sighting detailswatching fireworks as all the neighborhood - earlier saw many orange red orbs that did not fit regular airline traffic or firework patterns. after the major fireworks went off by the major organizations, i just watched the neighborhood folks in their yards displaying their fireworks. i went to move my car to the street and saw a huge bright red led square hovering over a tree - i watched it and it did not move, i stood there for about a minute or two and moved on - but the square red light did not. after i moved my car from the driveway - i saw the huge orange full moon, i ran into the house and came back out to my backyard and found a huge orange red triangle hovering over the neighbors yard and moving towards mine. the neighbors were looking at it to. as , the object came over to my yard, several objects were coming out of the horizon towards the triangle. the triangle just disappeared over the house and the objects just kept coming one by one or two by two. the electricity to the house went haywire and the air conditioners stopped and turned back on like they were going to explode. the garage light went on by itself, the neighbors then came out and asked me if the power went crazy at my house and i said yes. the red orange lights floated in\\out and disappeared over about half hour."],"Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Tags":"City","Latitude":"41.715746","map":"<A HREF = \"http://maps.google.com/maps?q=41.715746,+-87.753728(40171)&iwloc=A&hl=en\"> mufon case (40171) map </A>","Object Shape":"Sphere, Square, Rectagular","Sighting Duration":"Undisclosed","Log Number":"US-07052012-0009","Weather Factors":"Unknown","Object Features":"Undisclosed","trends":["There have been 13 other sightings in Oak Lawn","There were no other sightings in Oak Lawn on or around July 4th 2012"],"Summary":"large triangle floats over with red orange lights that follow - electricity goes crazy","City":"Oak Lawn","Case Number":"40171","Source":"MUFON"}