{"Weather Factors":"Unknown","Tags":"City","Longitude":"-111.736558","Object Shape":"Sphere","Object Features":"None","Date Submitted":"07/05/2012 02:05 UTC","files":["/var/www/straped/mufon/html2text/40188.html.txt","/var/www/straped/mufon/org/40188.html"],"Case Number":"40188","Country":"United States","Log Number":"US-07052012-0026","map":"<A HREF = \"http://maps.google.com/maps?q=33.367734,+-111.736558(40188)&iwloc=A&hl=en\"> mufon case (40188) map </A>","Source":"MUFON","Region":"Arizona","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Latitude":"33.367734","Date of the Event":"07/04/2012 09:16 UTC","City":"Mesa","Disposition":"Unresolved","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around July 4th 2012"],"divs":["Sighting DetailsWhile in my backyard looking to observe fireworks in the sky my attention was drawn to a bright orange orb. It was at first assumed to be a plane as I am located in a direct path of commercial planes heading for sky harbor airport. The brilliant orange light emission is what kept my attention on the object. It made no sound and moved at a seemingly slow but steady speed. It appeared from the east and took a path heading north west. After 10 seconds of viewing the object and ruling out the possiblilty of it being a conventional craft I called for my daughter from the living room to come and verify what I was seeing. As soon as she came out I pointed at the object and asked her what color she was seeing. She confirmed that it was orange. She asked me what it was and I dismissed her question and asked her to go and fetch her mother. In a panic I also asked her to bring my phone which I later realized was in my pocket. While she summoned her mother I snapped one picture of the object but realized that the flash was on and the photo was probably not going to show anything since it was quite dark in the sky. As my wife was stepping out to see what the fuss was I turned off the flash on my phones camera and snapped another photo dissappointed because at this time the object was much further away than before. My wife also attempted to capture a picture of the object but by this time it was simply a small light in the very distant sky. I kept my eyes on the object until it eventually dissappered into the sky as it moved on a north western path further and further away. After much backyard discussion and conjecture on what we all just witnessed I ran into the house and scanned through the news channels to see if there was any coverage on the event. Nothing. I sent the photos from my phone to my email account and played around with the zoom to see if there was any compelling evidence that what we saw was explainable. The pictures are not very good to that end but what is very starnge to me is that the first picture I took with the flash on appears to be a picture taken in the daytime. You cannot tell at all that it was night. I know nothing about photography but this is very odd. You can even see clouds. I went back out and snapped several pictures in the night sky with the flash on and could not get anything but blackness. I don't get it."],"Summary":"Bright orange orb that seemed to move at slow but steady speed"}