{"map":"<A HREF = \"http://maps.google.com/maps?q=48.060764,+-122.168982(40181)&iwloc=A&hl=en\"> mufon case (40181) map </A>","Country":"United States","divs":["Sighting DetailsAt approx 10pm on July 4th I was outside viewing the fireworks when I saw what I thought was a glowing unexploded firework, but then it wasn't going away. It finally (about 20 seconds later) dissapeared behind the clouds. It traveled slowly across the sky, shortly followed by another red starlike light in the same direction and speed. I observed this for 3 more lights before I witnessed two coming into view at the same time, circling eachother for about 20 seconds before they also dissapeared. These were the only lights I viewed circling eachother, but in all I counted a total of 20 lights. I finally left our deck and came inside. After the 17th light I made my husband come outside to make sure I wasn't seeing things. He also saw them. They were not stopping when I came inside. I'm not sure how many came by before I noticed them either. I am very freaked out right now. I know for a fact that they were not fireworks. I also know that they were not conventional airplanes, as 3 planes flew by when they were also going by. these planes went right by these \"lights\", they looked completely different, also I was able to hear the airplanes and when these lights went by there was no sound."],"Date of the Event":"07/04/2012 10:00 UTC","trends":["There have been 9 other sightings in Marysville","There were no other sightings in Marysville on or around July 4th 2012"],"Tags":"City","Object Features":"Unknown","Region":"Washington","Longitude":"-122.168982","Case Number":"40181","Summary":"Starlight, red, circling eachother","Latitude":"48.060764","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"07/05/2012 01:27 UTC","Sighting Duration":"Undisclosed","Object Shape":"Circle, Fireball, Sphere, Star-like","City":"Marysville","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/40181.html.txt","/var/www/straped/mufon/org/40181.html"],"Object Flight Path":"Path with directional change","Source":"MUFON","Log Number":"US-07052012-0019"}