{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.568794,+-122.021549(40183)&iwloc=A&hl=en\"> mufon case (40183) map </A>","Date of the Event":"07/04/2012 09:45 UTC","Country":"United States","Summary":"3 orange to red pulsating lights heading north to south","Latitude":"37.568794","Tags":"City","Object Features":"Unknown","Date Submitted":"07/05/2012 01:50 UTC","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/40183.html.txt","/var/www/straped/mufon/org/40183.html"],"Disposition":"Unresolved","Case Number":"40183","Object Shape":"Sphere, Star-like","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Union City","There were no other sightings in Union City on or around July 4th 2012"],"divs":["Sighting DetailsStarting around 9:45PM, myself, my mother, aunt and uncle all witnessed a large bright orange orb north of our house , quickly moving south. As it moved across the treetop level (at unknown distance) it gradually started to change from a bight orance to a deep red, then reverting back to orange. it continued south for approximately another minute untill completely dissappearing from sight, as if someone blew out a candle. About 10 minutes later, a second orange orb appeared in the same spot that the first one had originated. This one appeared to be moving at the same altitutde, but much faster on a north to south flightpath. After about 30 seconds or so the orb started to change from orange to red, but then started to dim much sooner then the first. When the orbs light diminished the boject was not in silhouete. I was a Oval type ball about the size of an asprin (more then likely still a large distance away from my position). And it want into the hover I witnessed the object change direction rapidly from a hover to decent to ascent to left and right before dropping below the tree line and out of sight. And about 15 minutes after that my mother and I noticed a thrid object. Once again, an orange orb, at same altitude moving on a north to south flightpath. This time as it approached the point where the second ones light went out, this one started a slow decent still fully illuminated and dissappeared behind the tree line. I can tell you this was not a conventional aircraft. There were airliners all over the sky that night an none were flying as fast, manuvered as quick, or went completely dark as these three objects did."],"Region":"California","Longitude":"-122.021549","City":"Union City","Log Number":"US-07052012-0021","Object Flight Path":"Path with directional change,Path then hovering"}