{"Source":"MUFON","Longitude":"-122.382348","Date Submitted":"07/05/2012 04:15 UTC","Log Number":"US-07052012-0037","trends":["There have been 2 other sightings in Burien","There were no other sightings in Burien on or around July 4th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.450377,+-122.382348(40199)&iwloc=A&hl=en\"> mufon case (40199) map </A>","Date of the Event":"07/04/2012 10:40 UTC","divs":["Sighting DetailsIt was around 1030 pm on July 4th, 2012 when I had walked down the street to the edge of the bluff to overlook the Puget Sound and see all of the fireworks shows from all the different cities across the water - on the different islands. I was watching the Gig Harbor show alone at this point as everyone else in the group had gone in different directions to try and find other vantage points, and the Three Tree Point show had just started and was very close to me, but somewhat obscured from the 150ft+ tall bluff that was standing on. At some point, I see what appears to be just another firework that had just been launched, but this one was traveling at an extremely acute angle from the water and was passing behind the tree tops below me. As I am watching that, the Gig Harbor show is hitting the crescendo and really popping, as well as about 15 more shows that I can see from there when I realize that this \"firework\" is still going. I mean, it hasn't detonated yet. Now, the thing is totally unobscured and ascending at a nice steady pace on the slightest ever, upward-curving arc of a trajectory, almost in a straight line. About this time I am thinking \"This is a UFO!\" -When suddenly from behind me and elevated even more than I, was a large group of folks in a yard were asking \"What is that?!\" I turned and asked \"You see that too?!\" The entire group saw it and one guy kept repeating, \"That ain't right, that ain't right\" The children were asking if it was a helicopter or plane, and we all studied it as it left our atmosphere in a fading glint as it got so small we could no longer see it. At which point I said, That was not one of ours... I asked if they had seen where it came from and if had exited the water and they said they didnt witness that part, it was just there and started it ascent. The group were all silent now and I see my family walking back down the hill right by their yard, and I could hardly contain myself and asked DID YOU SEE THE UFO?! To my dismay they started laughing at me and said no in an incredulous manner. As they were snickering I said all those people right there saw it, right? They all agreed and were astounded amazed and talking about it as we returned back home, up the hill. I would estimate the object was roughly in between 1-2 miles away from me, leaving the surface or from under the surface of the Puget Sound between Three Tree Point and Vashon Island. The object itself was glowing an orange color and slightly pulsating at an irregular rate. It's tought to estimate the size, as most of it appeared to be corona, so it could have been anywhere from 20ft across to 40ft. Its speed was slow and steady, no unusual changes in course or disappearances. We were looking SSW and it was on a trajectory that was leaving away from us at a SSE direction. It continued to climb slow and steady, on an almost arc-like line, but ever so slight, until it slowly faded out against the hazy sky. The entire event taking place in about 1 minute. It looked like a firework that was shot horizontally from a boat out in the middle of the bay, that slowly climbed into space, never detonating. I suppose it could have been a dud of a firework, but it was the best dud I've ever seen! And it actually was way cooler than the awesome shows that we got to see!! There literally had to be hundreds and hundreds of people that witnessed that from down below. And I doubt there will be a whisper about it in the news."],"files":["/var/www/straped/mufon/html2text/40199.html.txt","/var/www/straped/mufon/org/40199.html"],"Weather Factors":"Unknown","Country":"United States","Region":"Washington","Summary":"4th of July Fireworks/UFO Event - Three Tree Point / Burien, WA","Latitude":"47.450377","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"None","Tags":"City","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Case Number":"40199","Sighting Duration":"00:01:00","Disposition":"Unresolved","City":"Burien"}