{"Source":"MUFON","Object Flight Path":"Straight-line path","City":"Portland","Longitude":"-122.669467","Date of the Event":"07/04/2012 10:25 UTC","files":["/var/www/straped/mufon/html2text/40198.html.txt","/var/www/straped/mufon/org/40198.html"],"Weather Factors":"Unknown","Case Number":"40198","trends":["There have been 158 other sightings in Portland","There were 3 other sightings in Portland on or around July 4th 2012"],"Country":"United States","Object Features":"Unknown","Tags":"City","Object Shape":"Circle, Disc, Fireball, Oval, Sphere, Star-like","divs":["sighting detailsi was sitting right on the river across the way from downtown portland, when i noticed one red-orange glowing orb. i watched it for about 40 to 50 seconds before it disapeared, about 5 minutes later i saw another... and another... and 2 more came from behind the first 2 within seconds of each other untill a set of 3 apeared in a perfect triangle formation with at least 5 or 6 following behind. my geuss is i saw more than 20 of those orbs in only a few minutes, they just wouldnt stop! every orb went in the same line each time for about 1 minute before dispearing. i wasnt the only person that saw them, i was with at least 20 other people and was loud enough to get every one to see the orbs right as the triangle formation apeared. sadly nobody seemed to care and blamed them on firworks\\flares\\baloons ect....(the big fireworks show had already been finished for at least 20 minutes) when i got home i hopped online to see if there were other reports, i was shocked to see others from all over the usa were seeing the same thing i saw and roughly at the same time! cheers!"],"Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=45.526862,+-122.669467(40198)&iwloc=A&hl=en\"> mufon case (40198) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2012 04:07 UTC","Latitude":"45.526862","Log Number":"US-07052012-0036","Summary":"red-orange g;owing ords over ne/se portland. triangle formation+ 15 or more crafts"}