{"Date of the Event":"06/21/2012 04:09 UTC","Object Features":"Unknown","Longitude":"-95.338522","Case Number":"40197","Object Shape":"Oval","Disposition":"Unresolved","divs":["Sighting DetailsI was on vacation on EUA (June), and my family and i went to lunch to China Buffet on June 21, located on 2001 West Southwest Loop 323, Tyler, TX 75701, and when we were leaving the restaurant, and while my aunts are talking, i decided take a photos serial of the place, and i take three photos on less than a minute, and my family and i did not see any object, or airplane or similar at that moment. But, when i was reviewing all the photos of the trip, i found one photo of this series and saw this amazing object in the sky on the second (of three) photos serial from this angle. I was really surprised, and i talked to all my aunts that was on the restaurant, and ask they if they remember an airplane, helicopter or sound of that kind of ships, but they didn't remember nothing. The sun was very shiny at the moment of the shoot, and i did not have sunglasses, and was very annoying see the sky, that was the reason because i only shot without saw what exactly i was captured. The object looks like a fish, but i think the was oval o like a boomerang. Is important to note, that the hour and date of the register of my camera has one hour early and a wrong date, because, i had the Honduras hour and because i had wrong configuration of the am-pm item, i did not change during my vacation. The object had to fly very fast, because i captured the object in one picture of three takes that i made in less than a minute. Sorry by my english, but i am learning. Thank for made the analysis of these material y sharing with me the results. I blurred the faces of my family. Regards"],"Source":"MUFON","Summary":"I took a photographic, and i capture an object","Log Number":"US-07052012-0035","Weather Factors":"Unknown","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around June 21st 2012","This sighting has been favorited 1 time.",""],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Unknown","Tags":"City","City":"Tyler","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.30059,+-95.338522(40197)&iwloc=A&hl=en\"> mufon case (40197) map </A>","Date Submitted":"07/05/2012 03:56 UTC","files":["/var/www/straped/mufon/html2text/40197.html.txt","/var/www/straped/mufon/more/40197_submitter_file1__UFOTYLER.JPG","/var/www/straped/mufon/org/40197.html"],"Latitude":"32.30059","Country":"United States"}