{"Country":"United States","Date Submitted":"07/05/2012 03:41 UTC","divs":["Sighting DetailsMy daughter lives in n.w. Boise, ID. She and family were outside doing fireworks. She noted a red glowing orb(marble-sized at arms-length) generally moving north to south. She said it looked like it was on fire(just the color....not smoke or flames). That first one seemed to split in two just before it disappeared to her south. Then shortly thereafter three more came from the north and were all three in her view at the same time. Later two more passed her position with one actually seeming to curve to the southeast and disappear. I, she and her family are all airplane buffs(airshows etc;), so know what different aircraft look and sound like. These made no sound. She called me to make the observation to me(I had seen UFO's in my earlier life)and I went out with 10x binoculars to look for myself. There was a moderate cloud cover starting from over my house(Meridian, ID)and stretching towards her area. I did use the stars to get my binoculars adjusted for infinity but thought I would not see anything because of the cloud cover. After waiting for about 10 min. I noted a bright red 'largest-star'-sized moving object moving generally north to south roughly between her house and mine. So that confirmed(to me)her general observation. I used a steady-rest to stop the wobbling and watched the object move slowly and then actually slow almost to a stop. Then, it either slowly diminished in brightness or it got into the clouds. It then was no longer seen by me. Length of time observed 5-10 min. Waited a while longer and no other appeared. Came inside to write this report. My daughters observation was probably within an hour of my sighting, in case you want to verify this with other reports possibly from the Boise area. Secondarily, my daughter tried to use a cellphone camera to get a picture but it just didn't work. I don't have any useable cameras at the present time."],"Summary":"Daughter lives 4 miles from me. She seen multiple(6) red moving orbs and called me. I went out, looked in her dir. and seen the one.","files":["/var/www/straped/mufon/html2text/40194.html.txt","/var/www/straped/mufon/org/40194.html"],"Source":"MUFON","Sighting Duration":"00:10:00","Date of the Event":"07/05/2012 12:00 UTC","Region":"Idaho","Disposition":"Unresolved","Longitude":"-116.421666","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Tags":"City","City":"Meridian","Log Number":"US-07052012-0032","Object Shape":"Fireball, Sphere","Latitude":"43.583642","map":"<A HREF = \"http://maps.google.com/maps?q=43.583642,+-116.421666(40194)&iwloc=A&hl=en\"> mufon case (40194) map </A>","trends":["There have been 5 other sightings in Meridian","There were 3 other sightings in Meridian on or around July 5th 2012"],"Object Features":"None","Case Number":"40194"}