{"Date of the Event":"07/04/2012 09:40 UTC","Log Number":"US-07052012-0044","Summary":"3 bright orange lights moving east in \"formation\", 2 together, 1 off to the side","Sighting Duration":"Undisclosed","Case Number":"40209","map":"<A HREF = \"http://maps.google.com/maps?q=41.8719,+-88.097403(40209)&iwloc=A&hl=en\"> mufon case (40209) map </A>","City":"Wheaton","Latitude":"41.8719","Region":"Illinois","trends":["There have been 5 other sightings in Wheaton","There were 2 other sightings in Wheaton on or around July 4th 2012"],"Viewing Distance":"Unknown","divs":["Sighting DetailsI've been watching airplanes all my life, and I'm a star-gazer too. I've seen countless airplanes, satellites, the International Space Station, and the space shuttle fly over. And these orange lights have me spooked. I've never seen anything like it. And they were orange, not red-orange, and not yellow-orange, just a deep orange color. There were at least 3 (I saw them between trees). I noticed one at first, and the solid orange, size, and speed were enough to make me take notice and be curious. But then I noticed the other two, which seemed to be in \"formation\", with one ahead of the other. Then I tried to locate the first one again, but I couldn't find it. I stood and watched the other two as they moved away, and saw one catch up with the other and seemingly pass it, before it faded away, as the eastern sky either had haze or clouds. Then I watched the remaining one until it, too, faded into the distance. I should also point out that there was a large full moon rising in the southeast at this time. But these lights were headed pretty much due east. If they were moving slower, and weren't orange, I would think they were a formation of 3 helicopters, with one being way off the side. But not likely. First, no sound at all. I live in a quiet area, and it was very quiet at the time, and even though they had already passed me, if they were helicopters, I would have heard something beforehand, and still heard it fading away as I stepped outside. But not a sound. Second, the speed in which they were moving wasn't correct. If you've watched the ISS fly over, this was about 1.5 times that speed, meaning if they were at high altitude, they were moving FAST. At first I thought I was seeing the ISS, except that it was way too large, and bright orange, almost glowing. Then of course the fact that there were 3 of them. And at this speed, and the distance they seemed to be from me, I don't think helicopters can move that fast. Third, I was also seeing planes in the distance, in a pattern, that had taken off from O'Hare Airport and heading south. So if these lights were helicopters, or any other aircraft, I don't think they would have had clearance to pass through Chicagoland like that, in that direction (west to east), crossing the airplane traffic. Unless they were at a VERY high altitude and would not interfere with other planes in the area. I am perplexed, and I can't stop thinking about this. Whatever I saw was definitely not ordinary. It was either aircraft with a new type of lighting (no flashing, just solid orange, is that even allowed?), or some type of experiment, such as planes traveling at high altitude with large, solid orange lights, or something very spectacular. I have never, ever seen anything like it before. And I can tell you this, if these lights moving any faster, I actually would have been scared. At the speed they were moving, it did seem like they were possibly man-made, and felt that there could be some explanation. But I cannot explain what they could have been, or what altitude, or what speed. I REALLY hope that I wasn't the only one that saw them, and also hope that they can be explained, because it's really bothering me."],"Object Shape":"Circle","Object Features":"None","Longitude":"-88.097403","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/40209.html.txt","/var/www/straped/mufon/org/40209.html"],"Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"07/05/2012 09:54 UTC","Weather Factors":"Unknown","Country":"United States","Source":"MUFON"}