{"Object Features":"Unknown","divs":["sighting detailsi live in the belle isle\\pine castle area near lake conway. my wife and i were out watching fireworks last night (july 4th) around 9:00 pm when we saw 3 reddish lights moving at the speed of a helicopter travelling in a line. the can not really be determined, but seemed like they were travelling south to north. there was no change in size until all of a sudden the first one seemed to get smaller and disappeared, followed by the second one and then the third with about 15 seconds apart. i am glad my wife was with me to witness this as she would have thought i was completely nuts. we know what planes look like and even helicopters which tend to circle this area. i also know that the airport would not have let planes fly this close to each other. they were not high in the sky but rather low on the horizon, almost at the same level that planes on fnal descent are on, yet these seemed to be moving in the opposite direction. maybe 5-10 minutes passed and a 4th light appeared in the same area following the same pattern. my wife ran into the house to grab our binoculars, but before she could return, this one two disappeared in similar fashion as the other three."],"Object Shape":"Sphere","City":"Orlando","Viewing Distance":"Over One Mile","Date of the Event":"07/04/2012 09:15 UTC","Log Number":"US-07052012-0043","map":"<A HREF = \"http://maps.google.com/maps?q=28.43134,+-81.30844(40207)&iwloc=A&hl=en\"> mufon case (40207) map </A>","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around July 4th 2012"],"Tags":"City","Case Number":"40207","Disposition":"Unresolved","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2012 09:43 UTC","Longitude":"-81.30844","files":["/var/www/straped/mufon/html2text/40207.html.txt","/var/www/straped/mufon/org/40207.html"],"Summary":"Red lights travelling near Orlando International Airport","Source":"MUFON","Latitude":"28.43134","Weather Factors":"Unknown","Region":"Florida"}