{"Object Shape":"Circle, Cylinder, Sphere","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"07/05/2012 09:55 UTC","Date of the Event":"07/04/2012 10:00 UTC","Source":"MUFON","trends":["There have been 52 other sightings in Lee's Summit","There were 2 other sightings in Lee's Summit on or around July 4th 2012"],"City":"Lee's Summit","Case Number":"40211","Weather Factors":"Unknown","Longitude":"-94.37463","map":"<A HREF = \"http://maps.google.com/maps?q=38.932093,+-94.37463(40211)&iwloc=A&hl=en\"> mufon case (40211) map </A>","files":["/var/www/straped/mufon/html2text/40211.html.txt","/var/www/straped/mufon/org/40211.html"],"Latitude":"38.932093","Summary":"They looked like Chinese Lanterns. But we actually started seeing them on July 3, 2012.","Object Features":"Unknown","Country":"United States","Log Number":"US-07052012-0046","Disposition":"Unresolved","divs":["Sighting DetailsI was at my home on July 3, 2012 outside in my back yard. I have a large yard, so a lot of clearance overhead for me to see things in the sky. My mom had called me and said she saw something floating over the sky, so I looked up and immediately saw something. It looked like a Chinese Lantern, though there were 5-6 of them that followed shortly after. It was a white orb like object that's center was a glowing red. When the object was floating, it appeared to be shining a spotlight. I was convinced it was a Chinese Lantern, until I saw them again on July 4, 2012. They were moving from south to north in a straight line. At one point I saw 3 of them together, going south to north. There were over 10 of them within an hour. They never backtracked, just kept going north. I tried to get a video of one which I'm attaching, as well as the pictures, but they're not very clear. I basically set up camp out back waiting for more but they stopped at about 10:30 pm on July 4, 2012. The objects had no noise whatsoever. They appeared to be traveling about 40-50 mph."],"Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Region":"Missouri"}