{"Country":"United States","Summary":"3rd sighting of Red-Orange \"Firey\" Orbs over Madison Heights Michigan","divs":["Sighting DetailsWe have now seen these \"red orbs\" 4 times in the last month. The first sighting was in mid-June. We were on the back deck of my house at night. Relaxing, star gazing. We looked back up to the sky and saw 2 red-orange orbs kind of flickering. the best way to describe these is kind of like a hot air balloon, because of the shape, and because there seems to be a flickering firey quality to them. It was almost 2 a.m., so no doubt they were not hot air balloons. The drifted in a South East Direction, sometimes hovering, sometimes ascending or changing direction. They were moving relatively slow (slower than a plane and then disappeared into the atmosphere. I know others witnessed this, because there was a party 2 houses down with people also on their deck, staring and pointing into the sky...\"did you see that??\" There have been three more sightings. June 30th, July 3rd and July 4th. All of these times, we were also in the backyard or walking in our neighborhood. On the 3rd, we saw them from the back yard again. Last night, on the 4th, we were walking and saw one also moving SE in the sky. Each time, the orbs were unmistakably the same size, shape, color, and behavior. Last night, many other people were out watching fireworks (an insane amount of them went off). We saw another couple of people staring up and watching this orb float through the sky. At first, it almost looked like a firework remnant, but we watched for several minutes. It was the orb again, moving faster this time, almost as fast as a plane. Again, it disappeared into the atmosphere as it traveled South East. As for the feeling I got, it was a strong curiosity. I didn't feel that these orbs were here to harm people. They feel like \"silent observers\" in the sky. Now, looking through all of the other reports here from across the U.S., I know we're not crazy. I just wish I had a better camera to snap photos. My boyfriend did try to take a video on June 30th, although by the time he grabbed his phone, the orb had drifted away and it just looks like a flickering star int he video. WHAT ARE THESE RED-ORBS!? We will keep sky-watching. I have a feeling they'll be back...."],"trends":["There have been 4 other sightings in Madison Heights","There was one other sighting in Madison Heights on or around July 3rd 2012"],"Sighting Duration":"Undisclosed","City":"Madison Heights","Date of the Event":"07/03/2012 12:00 UTC","Date Submitted":"07/05/2012 11:18 UTC","Case Number":"40214","Tags":"City","Longitude":"-83.098625","Log Number":"US-07052012-0047","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Object Shape":"Fireball, Sphere","Region":"Michigan","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/40214.html.txt","/var/www/straped/mufon/org/40214.html"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=42.479905,+-83.098625(40214)&iwloc=A&hl=en\"> mufon case (40214) map </A>","Latitude":"42.479905"}