{"Longitude":"-83.551812","Date Submitted":"07/05/2012 11:12 UTC","Latitude":"35.346482","map":"<A HREF = \"http://maps.google.com/maps?q=35.346482,+-83.551812(40212)&iwloc=A&hl=en\"> mufon case (40212) map </A>","City":"Bryson City","Tags":"City","divs":["Sighting DetailsThis happened near crisp and prince boat docks at Fontana lake. My family and I were sitting in our boat in the middle of the lake viewing neighbors blast off fireworks from their houseboats when we noticed a reddish orange glow behind the top of the tree line due north. At first we thought the tree had caught fire because of the ember like glow but it would fade in and out. We really began to take interest, ignoring the fireworks, when the glow began to rise and follow along the mountain top, making movements that planes and helicopters don't normally make. It would fade in and out slowly and then reappear behind the tree line only to rise again with two others and circle the mountain. The mountain is a part of national park and there are no landing zones or landable terrain. These series of strange manuvering endured for nearly 5 minutes. We have yet to figure out what it was. It didn't blink like normal man-made flying crafts, it hovered, faded, brightened, unnaturally shifted directions, and put us all in awe. We were curious, had little fear, but it gave us chills. Eventually the lights faded and didn't return. We had attempted to take a picture but not even a nearby bright house light would pick up on our cams, which is truly unusual."],"Log Number":"US-07052012-0045","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/40212.html.txt","/var/www/straped/mufon/org/40212.html"],"Weather Factors":"Unknown","trends":["There have been 3 other sightings in Bryson City","There were no other sightings in Bryson City on or around July 4th 2012"],"Object Shape":"Star-like","Case Number":"40212","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Date of the Event":"07/04/2012 12:00 UTC","Viewing Distance":"Over One Mile","Region":"North Carolina","Disposition":"Unresolved","Summary":"3 reddish orange lights circling mountain top with inconsistent manuvering.","Sighting Duration":"00:05:00","Source":"MUFON"}