{"divs":["sighting detailsi was on the way to nashville's downtown fireworks celebration. it was about an hour before the event. we're near the city at this point, so few stars are visible and only a few clouds. i look up and see a small pulsing orange light moving very slowly across the sky. it appeared to be fairly high. i look for running lights (like an airplane has) and couldn't see any. i watched as it moved very slowly across the sky and finally disappeared behind some taller buildings near the horizon. it was an odd shape, nearly completely round, which is strange for an aircraft of any kind. it was also moving very slowly for an aircraft, especially as i was facing west and the object was moving on a north\\south path above my head. the light pulsed and had an irregular border. there were so many other noises i couldn't hear if any plane sounds were coming from the object. but, when i saw the descriptions here, i was shocked, because i saw the same object. drone? test craft? i'm not sure. no one else looked up because they were busy setting up for the fireworks, attending to blankets and things."],"City":"Nashville","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Log Number":"US-07052012-0046","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Circle, Fireball","Sighting Duration":"Undisclosed","Summary":"reddish orange pulsing circle that went very slowly across the sky near downtown","Longitude":"-86.777563","Case Number":"40213","Date Submitted":"07/05/2012 11:16 UTC","Viewing Distance":"Unknown","Country":"United States","Object Features":"Undisclosed","Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=36.171967,+-86.777563(40213)&iwloc=A&hl=en\"> mufon case (40213) map </A>","Latitude":"36.171967","Date of the Event":"07/04/2012 12:00 UTC","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around July 4th 2012"],"Tags":"City","files":["/var/www/straped/mufon/html2text/40213.html.txt","/var/www/straped/mufon/org/40213.html"]}