{"Log Number":"US-07052012-0060","trends":["There have been no other sightings in Woodland Hills","This sighting has never been favorited."],"Disposition":"Unresolved","Summary":"With binoculars I saw blue light that intermittently emitted bright white lite (like electricity) with red a tip. Looked like large start without binoculars","Object Shape":"Triangle","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"40225","map":"<A HREF = \"http://maps.google.com/maps?q=34.167866,+-118.60627(40225)&iwloc=A&hl=en\"> mufon case (40225) map </A>","divs":["Sighting DetailsI was at Warner Center Park on Topanga Blvd in Woodland hills, relaxed on my back, looking up at the sky waiting for the fireworks to begin at 9:00 pm. My friend said \"look, that's a UFO up there\". She has had many sitings and seems to be attuned to these things. I have never seen any UFO's. Though I have remained open minded, I never had seen one. She pointed out the coordinants and all I saw was what looked like a large star. She then gave me her binoculars and what I saw astonished me. It was clearly a bright blue somewhat amorphous sort of triangular shaped object. A very bright, unmistakable, bright white lite (kind of a horizontal line) would emit for a number of seconds and then disappear. The light had a red tip--possibly another light. The object hovered in what i estimate was the Northwesternly direction at approximately 75 degrees. It slowly moved in a southerly direction and would disappear and then reappear over a period of about 10 minutes. I was very excited. I felt like a little kid. Joyful. Like finally being allowed to \"enter the club\"--sort of , but not quite as thrilling as my recent experience with the dolphins. My friend and my husband said that they thought the reason that the colors were blue, white and red was because they were tuned in to the Fourth of July. I have no opinion about that. My friend this morning (July 5) told me that she received general news on her smart phone and that other sightings were reported on the Fourth this year. I am very excited and believe that the ones I saw are here to help us. Like everything in the universer there are benevolent and malevolent forces and what we put our attention on is what we attract. So lets ask for help from the benevolent forces whatever their form or consciousness."],"Country":"United States","Region":"California","Date Submitted":"07/05/2012 12:44 UTC","City":"Woodland Hills","Longitude":"-118.60627","Tags":"City","Weather Factors":"Unknown","Object Features":"Other","Latitude":"34.167866","Object Flight Path":"Hovering then path","Date of the Event":"07/04/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/40225.html.txt","/var/www/straped/mufon/org/40225.html"]}