{"Viewing Distance":"Unknown","Case Number":"40226","trends":["There have been 4 other sightings in Renton","There were no other sightings in Renton on or around July 4th 2012"],"Disposition":"Unresolved","Summary":"Multicolor changing orb seen slowly ascending, then coming back zigzag pattern behind tree","Longitude":"-122.104549","Country":"United States","Date of the Event":"07/04/2012 10:30 UTC","Log Number":"US-07052012-0061","Tags":"City","Object Flight Path":"Path with directional change,Other","Latitude":"47.476731","Date Submitted":"07/05/2012 12:46 UTC","divs":["Sighting DetailsMy girlfriend was having a cigarette on the back porch last night on the 4th trying to see some fireworks when this starlike-multicolor changing orb caught her eye. It ascended into the sky slowly, but came back down in a zig zag pattern before it hid behind the tops of some trees and disappeared. It looked as if it was copying the flashes of light from all of the fireworks, or maybe the fireworks were being reflected off of this object? It was changing from red to orange, to blue and green and everything in between. The light that was emitted from this object was undeniably shiny, as it gave off similar rays that we get when looking at the sun, or an art piece depicting the lines of light coming from a light source like spikes. It's pattern of movement was very random, but at the same time it seemed to follow some kind of pattern nonetheless. I felt as if I was really seeing something that I could not explain for the first time, and it honestly kind of frightened me. I began looking for July 4th, 2012 reports of UFO sightings when I stumbled on this site where a lot of people are seeing similar orbs across the entire nation for the past few days... Very exciting."],"Weather Factors":"Unknown","Object Shape":"Cross, Oval, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=47.476731,+-122.104549(40226)&iwloc=A&hl=en\"> mufon case (40226) map </A>","Region":"Washington","Source":"MUFON","files":["/var/www/straped/mufon/html2text/40226.html.txt","/var/www/straped/mufon/org/40226.html"],"Object Features":"Unknown","City":"Renton","Sighting Duration":"Undisclosed"}