{"Latitude":"29.35738","Object Features":"Unknown","Date Submitted":"10/14/2005 09:30 UTC","Disposition":"Unknown","trends":["There has been one other sighting in Castroville","There were no other sightings in Castroville on or around October 14th 2005"],"divs":["Sighting DetailsI was staying at my friends house in Creekwood,a nieghborhood half way between Castroville and Hondo, for the weekend. My friend Jesse and me were outside on his porch hanging out and talking and looking at the stars, it was a clear night with a good size cloud over head. I was looking towards the east approximately(compared with HWY 90) then I turned towards the west approx.I looked up at about a 45 degree angle in which I was looking over the roof of the house. And I saw what I thought was a satilitte because it was a white light a little yellowish and it was going in a straight line going east. I even told my buddy Jesse \"Hey look there's a satelitte right there\". And almost as soon as I said it, it did a rapid turn between 45 and 90 degrees to my right(it's left) staying the same speed. And it did the same thing after a few seconds in the oppisite direction. It then it was just sorta \"swirving\" left to right like a bug. Which by then I already realized that satelitte do not do that. So I called my other friend JR out of the house to look at it. By this time it was still in clear sight but under the cloud i mentioned earlier that moved a litte towards the east. So that gave off that it had to be in the Earth's atmosphere for it to be under a cloud. It was still moving rather buglike, it almost seemed to be moving up and down but very little. It could of been just the angle because it was further away going towards the south east about(still in referance to the highway). After about 30 more seconds it was from under the cloud where you could see just stars and black. Then it just disappears. It was how it looked before but it just vanishes like someone flipped a light switch and it went out. During all of this i didn't get all excited about it so i can remember everything about it and i didn't want to get it mixed up with something it's not. And i kept my self concentrated and normal so i don't get rapid eye movement so it doesn't look like it's moving in odd directions. With out getting excited over it. But it wasn't close enough to actually increase heart rate and it wasn't wierd enough even tho it wasn't anything I could explain. The only thing I did not account for was time but it felt like a few minutes. I am a person who is into watching UFO Files on the History channel. And I do reading on UFO happenings, I would even on day to even do some research my self with people's sightings in the field. I hope i have provided enough information to show that it was something unexplainable or explainable."],"files":["/var/www/straped/mufon/html2text/4022.html.txt","/var/www/straped/mufon/org/4022.html"],"Country":"United States","Object Shape":"Star-like","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Log Number":"US-10232005-0004","Region":"Texas","Summary":"Not Provided","Date of the Event":"10/14/2005 09:30 UTC","Viewing Distance":"Unknown","City":"Castroville","Tags":"City","Longitude":"-98.868969","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.35738,+-98.868969(4022)&iwloc=A&hl=en\"> mufon case (4022) map </A>","Source":"MUFON","Case Number":"4022"}