{"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsWife and I were at a fireworks display at a park in Coral Springs, FL. About 10 or 15 min into the show she noticed what she thought was a parachute or and object that came out of the fireworkes that were going off. I noticed the object, it was either a white or a dull grey boomerang shaped craft moving smoothly but very quickly through the air. I kept my eye on the object although it was a bit difficult because it had no lights and was very hard to see against the night sky, even with the light of the fireworks. The object moved much faster than a plane could, and was way too high up to be a person on a hang glider or any similar object, just too fast and too high. I observed for about 10 minutes losing sight a few times as it just circled the perimeter of the sky. I had to turn around continuously to keep my eyes on it as it moved smootly through the sky. No abrupt movements just floated around and around until I finally lost sight. The way it kept circling overhead and how it came into view right behind the light of the fireworks almost makes me think it wanted to be seen by the thousands of people there. However it was very hard to make out and I'm sure at least one other person had to have witnessed it as well but from what I saw I was the only one looking around at the sky rather than the fireworks display. I was very intrigued by it, cool experience! Oh, and I tried to record it on my phones camcorder but way too hard too see, no lights, just a boomerang moving quickly and quietly."],"Sighting Duration":"Undisclosed","Region":"Florida","City":"Coral Springs","Source":"MUFON","Object Features":"Unknown","Longitude":"-80.268694","Log Number":"US-07052012-0072","Date of the Event":"07/04/2012 09:30 UTC","Object Flight Path":"Path with directional change","Tags":"City","Case Number":"40237","Summary":"Boomerang shaped object moved very quickly and circled the sky around and around until i lost sight of it. Made no sound.","files":["/var/www/straped/mufon/html2text/40237.html.txt","/var/www/straped/mufon/org/40237.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.276322,+-80.268694(40237)&iwloc=A&hl=en\"> mufon case (40237) map </A>","trends":["There have been 18 other sightings in Coral Springs","There were no other sightings in Coral Springs on or around July 4th 2012"],"Object Shape":"Boomerang, Chevron","Disposition":"Unresolved","Latitude":"26.276322","Date Submitted":"07/05/2012 01:57 UTC","Weather Factors":"Unknown","Country":"United States"}