{"Object Flight Path":"Straight-line path","divs":["sighting detailsi live in west seattle about 1\\4 mile south of the fauntleroy ferry dock. about 9:30pm last night two friends and i went up on my roof and sat in chairs facing west, giving us a sweeping view of puget sound, vashon, baimbridge and blake islands and the olympic mountains. it was twilight, and there were multiple fireworks going off both on our side of the sound and across on the islands. suddenly all three of us noticed two bright reddish orange lights flying southward, in tandem, down the sound. i would estimate that they were at 5,000 feet altitude, flying slightly faster than a jet, maintaining equal distance from one another, and completely silent. they were about the size of a large jet, but were just glowing lights, with no visible structure. as they flew over the north tip of vashon island, they both appeared to slow down, and the one that was slightly ahead began to dim. they continued on their course until we could no longer see them (behind some trees in my yard). we were amazed and were discussing what they possibly could have been when another light, this time solo, followed the exact same path down the sound. at this point, i ran down to grab some high powered binoculars, and within a few minutes another light followed in the same path as the prior three. this time i was able to get a much closer look, focusing in on it with the binoculars. it looked like a fireball, with a red glow behind it. this one too slowed and dimmed but never fully faded. over the course of the next half hour, five more of these lights came down the sound. we saw one jet, flying northwesterly from seatac airport, clearly make a large turn to avoid the passing light. i cannot stress enough that these lights were no part of the fireworks displays. they were much higher in the sky, and we had a clear view of each one for at least 30 seconds as it flew from north to south. even though the main firework event was going on 10 miles north of us over lake union in seattle, i'm sure there were thousands of people watching fireworks over puget sound and it would have been impossible to miss these lights traveling down the sound. i thought there would be a story about it on the news this morning, but i didn't hear a word about it."],"Weather Factors":"Unknown","Latitude":"47.61029","Longitude":"-122.325681","Log Number":"US-07052012-0066","files":["/var/www/straped/mufon/html2text/40231.html.txt","/var/www/straped/mufon/org/40231.html"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=47.61029,+-122.325681(40231)&iwloc=A&hl=en\"> mufon case (40231) map </A>","Disposition":"Unresolved","Date of the Event":"07/04/2012 09:40 UTC","Case Number":"40231","Object Shape":"Fireball","Country":"United States","Tags":"City","City":"Seattle","trends":["There have been 110 other sightings in Seattle","There were 10 other sightings in Seattle on or around July 4th 2012"],"Region":"Washington","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2012 01:32 UTC","Source":"MUFON","Summary":"Multiple lights flying South down Puget Sound"}