{"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-94.446835","Tags":"City","City":"Independence","Object Shape":"Egg","Log Number":"US-07052012-0071","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"40236","Source":"MUFON","Date of the Event":"06/04/2012 10:45 UTC","Summary":"Red glowing object at low altitude moved quickly S to N followed by a helicopter","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.080218,+-94.446835(40236)&iwloc=A&hl=en\"> mufon case (40236) map </A>","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around June 4th 2012"],"Latitude":"39.080218","Region":"Missouri","divs":["Sighting DetailsI am the ASD for Missouri and was watching fireworks with six family members at my daughters house last night when we saw a very bright red flickering object moving from South to North on a straight-line path at 25 degrees off the horizon. At first I thought it was a sky lantern, but realized that there was no wind and that the object was moving at a very fast pace without the normal characteristics of a sky lantern floating through the sky. As it moved North, I saw white lights come on in sequence across the back of it, revealing an arched shaped back section with a flat bottom (see drawing). Bright white lights came on the top section starting at the right and moving to the left, when the lights at the end lit up the rest began go out in the same order (right to left). A row of dim white lights appeared at the bottom. The size of it was surprisingly large in comparison to the red light so this leads me to belive that the red object was a light on a larger craft. The object continued North out of sight. There was no sound. A few minutes later, a very bright, large white light appeared in the area to the North where the first object went out of sight. This appeared to be a helicopter with a white searchlight on it, and it was moving very quickly from West to East, where we lost sight of it behind trees. Ive never seen a helicopter move that fast. There was no sound, but it may have been too far away to hear. We expected it to appear on the other side of the trees but it did not (possibly turned). I then left to drive home and again saw the red object to the North of my position again, but it was now heading West to East. I lost sight of it through the trees. I took videos but it is very difficult to see the object in the film."],"Weather Factors":"Unknown","Object Features":"Other","Date Submitted":"07/05/2012 01:56 UTC","files":["/var/www/straped/mufon/html2text/40236.html.txt","/var/www/straped/mufon/org/40236.html"]}