{"Case Number":"40249","Sighting Duration":"00:45:00","files":["/var/www/straped/mufon/html2text/40249.html.txt","/var/www/straped/mufon/org/40249.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.555345,+-84.961481(40249)&iwloc=A&hl=en\"> mufon case (40249) map </A>","City":"Columbus","Summary":"Object hovered and then floated west to east, made a sharp turn north zigzagging","Country":"United States","Tags":"City","Date of the Event":"06/05/1983 08:00 UTC","trends":["There have been 22 other sightings in Columbus","There were no other sightings in Columbus on or around June 5th 1983"],"Region":"Georgia","Log Number":"US-07052012-0075","Longitude":"-84.961481","Object Features":"None","Weather Factors":"Unknown","Latitude":"32.555345","Source":"MUFON","Disposition":"Unresolved","divs":["Sighting DetailsOne evening in June 1983 my wife and I were on the patio about 8 PM and spotted a bright glowing light in the east about two miles away. The object was hoovering over a wooded area for about fifteen minutes and then began to dim and brighten alternately mainly bright white in color. It then began to move slowly from east to west towards us. As it was moving it began to pulsate from white to a bright blue to blue green light as bight as a standard street light. After 30 minutes it stopped near us and hoovered above an interstate highway (I-185) for 5 minutes. The interstate is located about 150 yards from where we were standing. There was no sound. The object then began to move north following the approximate path of the interstate. Its movement remained slow but it began to blink on and off as if drifted away from us and developed a zigzag as it moved. The zigzag was also random but continual from left to right then low left to a higher altitude right and the low right to higher left. Altitude remained about 500-800 ft as it disappeared. When the object was at it closest to us I held my thumb up with my arm straight to gauge its size. It was about twice the size of my thumbnail. My Guess is that the object was between 100 feet to 300 feet in diameter. During this event my mind went from curiosity to amazement to uneasiness."],"Date Submitted":"07/05/2012 03:10 UTC","Object Shape":"Circle, Sphere"}