{"Disposition":"Unresolved","Tags":"City","Source":"MUFON","Summary":"About 6 Red Lights Coming from the Lake going in a southern Direction","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"40251","Sighting Duration":"01:00:00","files":["/var/www/straped/mufon/html2text/40251.html.txt","/var/www/straped/mufon/org/40251.html"],"Latitude":"41.861797","Viewing Distance":"Unknown","Date Submitted":"07/05/2012 03:38 UTC","Longitude":"-80.949483","Weather Factors":"Unknown","City":"Geneva-on-the-Lake","trends":["There has been one other sighting in Geneva-on-the-Lake","There were no other sightings in Geneva-on-the-Lake on or around July 4th 2012"],"Date of the Event":"07/04/2012 09:30 UTC","Object Shape":"Cross, Diamond, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.861797,+-80.949483(40251)&iwloc=A&hl=en\"> mufon case (40251) map </A>","Log Number":"US-07052012-0076","Object Features":"Unknown","divs":["Sighting DetailsWhile a friend of mine and myself were sitting outside Waiting for the fireworks to start on the stripe at Geneva on the Lake. From the corner of my eye I noticed a bright red light. A fireball looking object that at first moved quickly across the sky in a southern direction towards the city of Geneva. The further it got the slower and dimmer the light got. It would change from a bright red to an orange before it would completely disappear. When the first one appeared I thought it was just a stray firework. Since it was the 4th. It wasn't until a third appeared from the same direction that I pointed it out to my friend. The third light came out from the lake and once it got to a area of threes the two previous lights I had seen before Lit back up. The two were quite a ways off but the third light then went in the direction of the other two lights and then all three disappeared again. Two or three more red lights exactly like the previous appeared from the lake direction and made their way across the sky before disappearing. this went on all through the firework display. We only lost sight of the objects when the lights would completely disappear. It was hard to say exactly what they looked like but the were very bright at first and would blink and change to orange before they would disappear. I would say they were a diamond shaped light. I felt incredibly unease and it wasn't till when the third light had appeared and the previous two lighting back up when I got legitimately concerned. From the crowd I think there were only two or three other people that seemed to notice the lights."],"Country":"United States","Region":"Ohio"}