{"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been no other sightings in Clawson","This sighting has never been favorited."],"divs":["Sighting DetailsWent out to close the garage...and this was during the Clawson 4th of July fireworks. Usually you can't see the show from our house because of the treeline and distance...but there was a stray firework which lit up close enough to the house to see. I watched a light continue flying (through the light of the firework) and expected it to explode (thinking it was a stray as well) but it kept flying. The light was an orb in shape...orange and yellowish...pulsating somewhat (although hard to tell at night because bright lights wobble anyway) but neither diminishing nor increasing in color. It also didin't change direction and I followed its path with my eyes (which took me to the front of my house)...and I watched for at least 30 seconds until it was so far I could no longer see it. The object was flying from west to east and I would guess 30-40 degrees from where I stood. As I walked back to the garage...a second one flew by...same speed and distnace parameters and like the other...no sound. Neither orb changed direction and both were large enough to have me think they were a plane circling to land at the Troy Airport...but again the objects had no sound and no jet stream of any sort. That's the sum of it. I didn't think UFO at all...because there didn't seem to be anything startge other than the lack of souond. You know...no funny angles or hovering or \"Close Encounters\" music. But it was different enough for me to want to follow it and see where it flew and whether it WOULD do anything funky."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.518979,+-83.122823(40253)&iwloc=A&hl=en\"> mufon case (40253) map </A>","Date Submitted":"07/05/2012 04:06 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/40253.html.txt","/var/www/straped/mufon/org/40253.html"],"Country":"United States","Summary":"Saw two orbs during fireworks show. Thought it was astray, but kept flying until I could no longer see it","Latitude":"42.518979","Log Number":"US-07052012-0078","City":"Clawson","Tags":"City","Disposition":"Unresolved","Object Features":"None","Case Number":"40253","Region":"Michigan","Object Flight Path":"Straight-line path","Date of the Event":"07/04/2012 12:00 UTC","Object Shape":"Sphere","Longitude":"-83.122823"}