{"Case Number":"4025","Longitude":"-110.923939","files":["/var/www/straped/mufon/html2text/4025.html.txt","/var/www/straped/mufon/org/4025.html"],"Latitude":"32.226733","Log Number":"US-10242005-0001","Tags":"City","Weather Factors":"Unknown","Summary":"7 or 8 orange sparkling lights in a loose formation flying north to south at an extremely high altitude, no sound.","Object Features":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Undisclosed","divs":["Sighting DetailsI was outdoors sitting on a park bench on the west side of my home, with no outdoor lights on, talking on my cell phone to my mother. It was a very pleasant evening, about 80 degrees temp. I was looking up at the stars as I was taliking to my mother when I noticed what at first I though was a satellite. However instead of one white light moving at a uniform speed and direction as satellites do there were seven or eight lights and they were orange and sparkling in appearance. Also they did not fly uniform but moved closer to each other and farther apart and they fell back or moved ahead of each other. There was no consistency but rather it was an erratic formation. Definately not a meteor, too slow, and too many. Not a jet or satellite. I could tell the objects were very high because they were not bright, but aboout the same intensity as the stars around them. I observed them for about 15 seconds as they moved north to south, until the went behind some trees. the formation was about as wide as my hand at arms length. We have an air force base here in Tucson and I see alot of jets day and night, this was nothing like I have ever seen, and I know that these objects were at an extremely high altitude, most likely in orbit or close to. I was very intrigued by what I saw, Did anyone else in the southwest United States make a similar report?"],"Sighting Duration":"00:00:15","Date Submitted":"10/23/2005 07:40 UTC","City":"Tucson","Source":"MUFON","Region":"Arizona","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around October 23rd 2005"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=32.226733,+-110.923939(4025)&iwloc=A&hl=en\"> mufon case (4025) map </A>","Object Flight Path":"Undisclosed","Date of the Event":"10/23/2005 07:40 UTC","Country":"United States"}