{"Country":"United States","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40264.html.txt","/var/www/straped/mufon/org/40264.html"],"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 13 other sightings in Lockport","There were no other sightings in Lockport on or around July 4th 2012"],"Tags":"City","City":"Lockport","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.171633,+-78.68241(40264)&iwloc=A&hl=en\"> mufon case (40264) map </A>","Object Flight Path":"Path with directional change","Case Number":"40264","Longitude":"-78.68241","Date of the Event":"07/04/2012 11:00 UTC","divs":["Sighting DetailsI stepped outside my home around 11PM to let my dog out before bed. I'm an avid sky watcher and I happened to look up in a slightly ESE direction. At first I noticed what I thought was the ISS flying over because I like to watch it as often as I can with binoculars and to the unaided eye it appears to be the brightest star in the sky as it is moving. I have since checked though and the ISS wasn't due to make a visible flyover in Lockport, NY last night. I'm assuming it may have been a satellite? Almost at the same time I noticed a very large bright orange \"shape\" following the \"satellite.\" It was roundish in shape but irregular. You could obviously tell that it wasn't perfectly round or sphere shaped. At first I thought it was a plane but it only took about 2 seconds to completely discount that aspect. I also discounted that it might have been a Chinese lantern. It deliberately followed the path of the \"satellite.\" What I keep referring to as a possible satellite visually appeared to be nothing other than what a satellite appears to be when viewed from the ground.......\"a moving star.\" At all times the UFO exactly followed the same flight path(which was mostly straight) of the \"satellite,\" maintaining the same distance. After approximately 30 seconds both objects disappeared suddenly and completely. It moved in a southerly direction. I've only seen one other UFO in my life so I was quite excited while at the same time trying to make note of all details that I could. At first I was hesitant to talk about it but I happened to mention it to a good friend that I communicate regularly with on Facebook and he posted the following reply to me: \"this was posted on the Local News Station here in Tulsa, Oklahoma FaceBook Page....Any one else see a strange orange light move soundlessly across the sky from SSW to NNE last night about 9:45. I had another friend see it and said it was 5 orange lights when it came by her..it was moving as fast as a plane, but it wasn't a plane.\" Now Tulsa is a long ways from here but it sure seemed that it might not be a coincidence. I'm sorry I don't have alot of evidence. I have no camera and my cell phone won't take photos at night."],"Log Number":"US-07052012-0088","Summary":"Huge round yet irregularly shaped orange object following what appeared to be a satellite.","Date Submitted":"07/05/2012 06:47 UTC","Region":"New York","Latitude":"43.171633","Object Shape":"Sphere","Weather Factors":"Unknown"}