{"Source":"MUFON","Date of the Event":"07/04/2012 12:00 UTC","trends":["There have been 45 other sightings in Grand Rapids","There were no other sightings in Grand Rapids on or around July 4th 2012"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.96931,+-85.665126(40270)&iwloc=A&hl=en\"> mufon case (40270) map </A>","Case Number":"40270","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40270.html.txt","/var/www/straped/mufon/org/40270.html"],"Weather Factors":"Unknown","Summary":"Red Orb during firework show..obvious not a firework.","Log Number":"US-07052012-0094","Region":"Michigan","divs":["Sighting DetailsWatching the fireworks downtown Grand Rapids MI. The main site of launcing the fireworks was directly in front of us, the view was between 2 buildings. Will call that 12 oclock position. During an small pause in the show, between launchings, noticed a pulsing red orb in the distance moving directly horizontal in the sky, at about the 3'oclock location on the other side of one of the buildings. My first thought was an errant launch or flare from the show, but noticed it moving at very strange slow speed and direclty horizontal..with no up-down movement, like a firework or flare falling would have. I knew from the glow that it wasnt a plane or helicopter. It then passed from view behind another set of buildings. I normally would just let that go as a wierd firework anomally, untill another witness (also there for the firework show) next to me, that i didnt know, commented on it. Saying that it was a ufo, after i was thinking the exact same thing. Wasnt in a position to run around the buildings to continue to view, as i was with a date at the time. It was a very quick view, but thought i would share."],"Object Features":"Unknown","Longitude":"-85.665126","Tags":"City","City":"Grand Rapids","Latitude":"42.96931","Object Shape":"Oval, Sphere","Object Flight Path":"Straight-line path","Date Submitted":"07/05/2012 08:13 UTC","Country":"United States"}