{"Weather Factors":"Unknown","Tags":"City","divs":["sighting detailsi was just going into my computer room to download 4th of july photos i had just taken. i kept hearing fireworks, so i decided to shut off the bedroom light, opened the blinds and looked out to my left at a 45 degree angle and saw a bright red glowing orb. i yelled to my husband \"what is that red glowing object ih the sky?!\" he jumped out of bed and ran to the window in our bedroom. he suggested we look from the back porch. we ran down the stairs to the back porch. by the time we got out on the porch, we saw 3 red\\orange orbs angling toward us. there was no noise... but on occassion there was a firework or two. the 1st orb banked left and seemed to ascend into the atmosphere and just disappeared. the 2nd orb seemed to slow down as if to wait for the 3rd orb at which point the 3rd orb seemed to glow a brighter red and seemed to speed up. then the 2nd one followed the same path as the 1st orb and disappeared into atmosphere. the 3rd one seemed to hang around longer. it took a longer path closer to us and then, finally, banked left like the other 2 and just disappeared into the atmosphere. there was absolutely no noise of planes or anything except the fireworks intermitently. we just stood there in awe and watched entire thing... it lasted approximately 5-8 minutes."],"files":["/var/www/straped/mufon/html2text/40279.html.txt","/var/www/straped/mufon/org/40279.html"],"Region":"Washington","Summary":"I saw 3 red glowing orbs travelling on a path in my direction only to disappear into the atmosphere after a sharp left turn upward.","Date of the Event":"07/04/2012 11:20 UTC","City":"Yelm","Object Flight Path":"Path with directional change","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.948933,+-122.602718(40279)&iwloc=A&hl=en\"> mufon case (40279) map </A>","Sighting Duration":"Undisclosed","Latitude":"46.948933","Disposition":"Unresolved","Case Number":"40279","Object Shape":"Sphere","Source":"MUFON","trends":["There have been 3 other sightings in Yelm","There was one other sighting in Yelm on or around July 4th 2012"],"Date Submitted":"07/05/2012 10:48 UTC","Log Number":"US-07052012-0102","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-122.602718","Object Features":"Unknown"}