{"Log Number":"US-07052012-0097","City":"Andover","Date Submitted":"07/05/2012 08:30 UTC","Tags":"City","trends":["There have been 2 other sightings in Andover","There were no other sightings in Andover on or around July 4th 2012"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.237668,+-93.28881(40273)&iwloc=A&hl=en\"> mufon case (40273) map </A>","Summary":"Orange/amber glowing sphere, ball of fire, low flying across the sky, return 3 times within 5 min period","Object Shape":"Circle, Fireball","Case Number":"40273","Weather Factors":"Unknown","divs":["sighting detailsi live in andover, mn and right around the time fireworks began (cant remember if it was right before or after) and me and 4 other witnessed the very same object, it was flying fairly low compared to other sightings ive witnessed in the past but it was so close that it was literally mesmerizing. it was an orange\\amber glowing sphere that looked like a ball of fire. it passed over us while we all were taking an evening swim so i quickly jumped out and turned on the lights for our pool and at night it makes the whole pool glow 7 different colors depending on the setting its on. i put it on the setting which makes it continuously change from one color to another hoping this would catch the attention of what ever was flying right above us.. im not sure if it worked but after it passed, a minute later it flew over in the same exact path as before. to make things even more strange after it passed the 2nd time it came back for a 3rd time just as before. only if my battery on my camera wasnt dead im sure i couldve filmed some pretty darn amazing footage, details and all, it was that close."],"Disposition":"Unresolved","Longitude":"-93.28881","Viewing Distance":"101-500 Feet","Country":"United States","Latitude":"45.237668","files":["/var/www/straped/mufon/html2text/40273.html.txt","/var/www/straped/mufon/org/40273.html"],"Date of the Event":"07/04/2012 09:00 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","Region":"Minnesota","Sighting Duration":"10:00:00"}