{"Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"Pulsating stationary orange light with falling embers","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around October 23rd 2005"],"Log Number":"US-10242005-0003","Region":"California","files":["/var/www/straped/mufon/html2text/4027.html.txt","/var/www/straped/mufon/org/4027.html"],"Tags":"City","divs":["Sighting DetailsMy girlfriend and I were driving south across Mission Bay in San Diego on Ingraham St. when we saw a light in the sky. At first I thought it was a helicopter or maybe a plane, but it didn't have the standard blinking lights required by the FAA. It was simply an orange light that slowly pulsed about every second or two. I thought it might be Mars, but it was too bright, and I quickly determined that the object was in our atmosphere and probably at a low altitude. When we first entered the bridge from Crown Point, the object was in front of us, but, by the time we got to Vacation Island (in the middle of the bay), it was behind us. It hadn't moved. We had driven under it. So it wasn't a star or planet. Determining its exact altitude, however, is difficult, since it appeared as a point light. We parked on the island and got out of the car. The object was silent and stationary and continued its slow pulsing. I looked at it through my binoculars, but I couldn't make out any structure. It just appeared as a point of light. It appeared to perhaps be burning, and twice we saw glowing debris or embers fall off it. The \"debris\" appeared as another light, same color but smaller and dimmer, and it disappeared after falling quickly for a second. We watched the object for about five minutes total. It didn't move at all during that time. Then a low cloud bank came in from the ocean and obscured our view. The clouds continued through the night, and we didn't see the object again. It couldn't have been a meteor, since it was stationary. My best guess is that it might have been a road flare or firework attached to a kite, but even that's improbable, since it didn't move at all. It wasn't a missile launch, either. I've seen one of those, and they move way across the sky and leave a trail. I haven't seen anything this mysterious in 30 years. I didn't have my camera with me, but I doubt a picture would've revealed much, if it came out at all."],"Source":"MUFON","Date Submitted":"10/23/2005 10:50 UTC","Longitude":"-117.148235","Latitude":"32.722909","Object Shape":"Saturn-like","Object Features":"None","Sighting Duration":"00:05:00","Case Number":"4027","Country":"United States","Object Flight Path":"Stationary","City":"San Diego","map":"<A HREF = \"http://maps.google.com/maps?q=32.722909,+-117.148235(4027)&iwloc=A&hl=en\"> mufon case (4027) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/23/2005 10:50 UTC"}