{"Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Lancaster","There were no other sightings in Lancaster on or around July 5th 2012"],"files":["/var/www/straped/mufon/html2text/40283.html.txt","/var/www/straped/mufon/org/40283.html"],"Sighting Duration":"Undisclosed","Longitude":"-84.553933","Latitude":"37.736776","Disposition":"Unresolved","Summary":"4 Lights Circling Above","Object Flight Path":"Other","Object Features":"Unknown","City":"Lancaster","Object Shape":"Unknown","Weather Factors":"Unknown","Date of the Event":"07/05/2012 10:20 UTC","Region":"Kentucky","Country":"United States","Case Number":"40283","map":"<A HREF = \"http://maps.google.com/maps?q=37.736776,+-84.553933(40283)&iwloc=A&hl=en\"> mufon case (40283) map </A>","Tags":"City","divs":["Sighting DetailsI had went outside at 10:15 p.m. to do my nightly rounds of checking on my livestock and make sure pens and cages were secure when I noticed the chickens making a lot of noise. I searched the area to make sure no raccoon or possum were around then headed back towards the house. I observed 4 white lights rotating clockwise then meeting in the center then spreading out and circling again. At first I thought it to be spotlights or something of that sort but then I realized where I was and that it is a Thursday night with no grand events going on in or around town not to mention this place dies after Jeopardy goes off. It has been really humid and hazy \"we live very close to the Kentucky River\" with a lot of cloud cover so it was hard to get a good detailed look, and the fact that with all the haze and fog no source for the light could be spotted coming from the ground. I then went and got my wife to make sure I wasn't just imagining it and she as well saw what I saw. I tried to capture it on video with a camera and cell phone but was not very successful at getting anything other than a pitch black picture. The event lasted about 15 minutes then stopped. My wife then went inside and posted about it on facebook, low and behold a friend that lives on the other side or Garrard County had witnessed it as well. She stated her sons told her to come outside and see the \"aliens\", she described exactly what we did with the same duration. Still unsure about what it could have been."],"Log Number":"US-07052012-0105","Date Submitted":"07/05/2012 11:35 UTC","Source":"MUFON"}