{"Tags":"City","Case Number":"40288","Longitude":"-75.481593","files":["/var/www/straped/mufon/html2text/40288.html.txt","/var/www/straped/mufon/org/40288.html"],"Object Features":"None","Latitude":"40.61503","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-07062012-0003","City":"Allentown","Country":"United States","Region":"Pennsylvania","divs":["Sighting DetailsI was enjoying sparklers with the kids in my neighbors back yard. Noticed a bright amber light to the south-west about 40 degrees above the horizon. Caught my eye because of its size and relative brightness. It was as bright and as large as venus would be but amber colored. There were no other lights to indicate it was an airplane. It moved rapidly from west to east across the horizon. As it moved farther away to the east the cloud cover obscured the view. Just as we lost interest and looked back to the west we noticed another one with the exact same properties. That is when I started recording. Took a few moments to get the video recording started so it was south east by the time the video starts. They did not make a sound. In the beginning of the video I was walking down the slope of the yard and around a tree to get a better view as it moved away, so the jerky motion near the tree was just me moving around. As the second object became obscured by the clouds we saw a third, again with the same properties and behavior."],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.61503,+-75.481593(40288)&iwloc=A&hl=en\"> mufon case (40288) map </A>","Date Submitted":"07/06/2012 12:44 UTC","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around July 4th 2012","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Date of the Event":"07/04/2012 09:30 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Fireball, Star-like","Summary":"{ck} Three bright amber objects traveling quickly from west to east"}