{"Object Features":"None","Source":"MUFON","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Date Submitted":"07/06/2012 12:23 UTC","Longitude":"-89.28601","Date of the Event":"07/05/2012 10:15 UTC","files":["/var/www/straped/mufon/html2text/40287.html.txt","/var/www/straped/mufon/org/40287.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"Illinois","Latitude":"40.926299","Log Number":"US-07062012-0004","City":"Washburn","Country":"United States","divs":["Sighting DetailsJuly 5th 2012 around 10:15 pm. Wife and I were outside watching stars in Northern Sky behind our house which is a cornfield. Very low corn with complete open view of horizon and sky. We both noticed at the same time, a very bright red light appear in the sky about a mile or so out to the north west. The light hovered for several minutes before changing colors to a whiteish-yellow light. It proceeded to move left and right but hovered in its general area. I ran in the hose to grab my camcorder which unfortunately was NOT charged up. I ran back out in hopes of seeing the object ( my wife was still out watching it.) It was still in the air but appeared to be moving closer to us in a southward direction. Several beams of light shot from it and at one point an object seemed to go INTO the object. The object appeared to change to a \"mechanical\" look nd as it flew directly overhead our house we saw that it was a very large triangular craft with a light at each corner with one very bright white light in the center. Another ting we noticed were several searchlights came on off the horizon from the north and the northwest. The object flew directly over our house and headed to the south. where we lost sight of it. a few minutes after the object passed, a dark double rotor helicopter with a searchlight flew in the area the object came from. The helicopter flew over the cornfield for a few minutes and then left the area. The searchlights also went off when the copter left the area. I've never seen these searchlights before. The object was appearantly to us very large we guess larger than a jumbojet."],"Object Shape":"Sphere, Triangle","trends":["There have been 2 other sightings in Washburn","There were 2 other sightings in Washburn on or around July 5th 2012"],"Sighting Duration":"Undisclosed","Summary":"Saw bright red light in Northern sky. Very bright. Hovered. Then flew over my house. Saw a triangluar CRAFT.","Case Number":"40287","map":"<A HREF = \"http://maps.google.com/maps?q=40.926299,+-89.28601(40287)&iwloc=A&hl=en\"> mufon case (40287) map </A>","Tags":"City"}