{"map":"<A HREF = \"http://maps.google.com/maps?q=37.791964,+-122.497278(40289)&iwloc=A&hl=en\"> mufon case (40289) map </A>","Longitude":"-122.497278","Source":"MUFON","Object Features":"None","Object Shape":"Circle","Log Number":"US-07062012-0004","City":"San Francisco","files":["/var/www/straped/mufon/html2text/40289.html.txt","/var/www/straped/mufon/org/40289.html"],"trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around July 4th 2012"],"Weather Factors":"Unknown","divs":["Sighting DetailsMe and my friend both saw it. We were on the grass behind the log cabin in the Presidio watching fireworks. We were facing toward the Bay Bridge watching fireworks but noticed on our left what appeared to be a red orange orb, smallish, could have been a balloon but I noticed it didn't seem to be jumping in the strong westerly wind. And it glowed. and continued to glow as it first hovered in the direction of the fireworks and then floated, although with very very steady pathing to the east across the SF bay and continued until it went out of sight. We didn't hear chopper sounds. We didn't see blinking lights. Just a constant glow and speed. Nobody noticed but us as everyone was watching the fireworks. A bit later a helicopter came over toward the Golden Gate bridge and but it went back out toward the back and then south to see the fireworks too I assume. We think it was a bobbyist floating craft of some sort as it didn't \"feel\" like a UFO. But it was the weird how it didn't bounce around in the wind. So that's why I figured it worth reporting."],"Object Flight Path":"Path with directional change","Country":"United States","Date Submitted":"07/06/2012 12:52 UTC","Viewing Distance":"Unknown","Date of the Event":"07/04/2012 09:41 UTC","Tags":"City","Disposition":"Unresolved","Case Number":"40289","Region":"California","Summary":"Small red orb hovers towards fireworks and then out east","Latitude":"37.791964","Sighting Duration":"Undisclosed"}