{"Weather Factors":"Unknown","City":"Pheonixville","Disposition":"Unresolved","Date of the Event":"07/04/2012 10:15 UTC","Latitude":"41.209512","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was walking with my girlfriend, a few blocks from my house to go watch some firewoks. Once we had chosen a spot to stand and watch, the show had already begun. We were standing infront of three small trailer type venders selling ice cream and snacks. All three of the venders had elctricity, with lights and ice boxes, radios. We had been watching for approx. 10 min. When my girlfriend pointed out to be a redish orange orb object. The object seemed to glow and had no exterior lights. It did not glow with a brightness that hurt your eyes but yet still very bright. My first thought was that it was a peice of burning ash from the fireworks, but it came from my right side a good distance away from the fireworks when I first noticed it. After a min. The ball had moved and appeared to be heading on a path directly above the fire works. By this time I thought it was not ash because it had not burned out and had been moving a steady straight path. I did not see any lights so I thought it could not be a plane. After another min. The orb was just about out of my sight because of a tree line, all the power goes out in the venders stations behind me! The one stations lights flickered for an few seconds and I could here one of the venders say. Does anyone know what just happend to the power. A min. Later the lights came back on and the light in the sky was gone. When I noticed I could not see this object any more, I did notice a plane, which immediately reminded me that this is not what I just saw. The plane headed in the direction I origanally saw the object. This was a big gathering of people, there must have been 1500 people in the surrounding blocks, all outside looking up. My girlfriend and I could not have been the only two to see this, if u were watching the fireworks u could not miss it, And I was very mad I did not have my phone on me to record all of this"],"Summary":"Bright redish orange ball traveling north at steady pace.","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/40291.html.txt","/var/www/straped/mufon/org/40291.html"],"Object Flight Path":"Straight-line path","Country":"United States","Object Shape":"Circle, Sphere","trends":["There have been no other sightings in Pheonixville","This sighting has never been favorited."],"Longitude":"-77.190265","Case Number":"40291","map":"<A HREF = \"http://maps.google.com/maps?q=41.209512,+-77.190265(40291)&iwloc=A&hl=en\"> mufon case (40291) map </A>","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Source":"MUFON","Tags":"City","Date Submitted":"07/06/2012 01:08 UTC","Log Number":"US-07062012-0006"}