{"City":"Flatwoods","Country":"United States","Date of the Event":"07/05/2012 11:30 UTC","files":["/var/www/straped/mufon/html2text/40298.html.txt","/var/www/straped/mufon/org/40298.html"],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Object Features":"Unknown","Source":"MUFON","Region":"Kentucky","Tags":"City","Disposition":"Unresolved","divs":["Sighting DetailsOutside of my apartment my husband and I were standing talking to our neighbor. I happened to look up at the sky, which I often do, and noticed this bright ball. It startled me because for a brief moment I was going to comment on how odd it was to see Venus in the sky at this time of night during this time of year. I immediately realized this wasn't a planet or start. It was moving. It was moving in the direction towards the Ohio River, which is roughly north east. It moved it a straight line, had no tail or anything that could make it a potential shoot star. As it moved it hovered up a little bit than back down and was dimming as it moved.It got brighter again and then dimmed and disappeared. This only lasted a minute tops. I tried to rationalize it as best I could but shortly after and right before the sighting, some airplanes had flown over head. I compare the two and knew for a fact that this ball of light could not have been a plane, because I never lost sight of any of the planes that flew over head after the sighting and of course they didn't dim the way this ball did nor did the ball have the flashing lights like the planes. I can't say I was surprised or frightened by this, this isn't my first sighting of a UFO."],"Latitude":"38.517445","Log Number":"US-07062012-0013","Case Number":"40298","Summary":"Bright Ball Moving","Longitude":"-82.707575","Object Shape":"Circle, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.517445,+-82.707575(40298)&iwloc=A&hl=en\"> mufon case (40298) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"07/06/2012 02:07 UTC","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Flatwoods","There were no other sightings in Flatwoods on or around July 5th 2012"]}