{"Disposition":"Unresolved","Country":"United States","Latitude":"36.156182","Object Features":"Unknown","Date Submitted":"10/25/2005 02:26 UTC","Viewing Distance":"Over One Mile","City":"Tulsa","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Case Number":"4029","Summary":"alternating lights in east-southeast of Tulsa, OK","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around October 25th 2005"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.156182,+-95.985535(4029)&iwloc=A&hl=en\"> mufon case (4029) map </A>","Longitude":"-95.985535","divs":["sighting detailsi was standing in my front yard enjoying the crispness of the evening, and looking at the stars. my wife's father recently passed away, and he always wanted to be an astronaut (even built his own mock cockpit) and thinking of him makes my eyes drift skyward. i made mental notes of the few constellations i knew, and when i turned in a east, southeast direction: i first noticed it. due to how bright it was, and it's roundish shape, i thought it might possibly be venus, but then i noticed the colors beginning to change. at first a very slow pulse between white and blue, but as i called to my wife to come see, it began to speed up, and ultimately reach a sort of \"flicker\". this process took about 3-4 minutes. we went inside and got our binoculars, and went back to looking. then it began to move. sharp, sudden jerks to the side, and back again. still doing the blue\\white flicker. my wife is an instructional pilot here at tulsa's spartan school of aeronautics, and could verify that the object did not move in a fashion that a plane or helicopter would. common sense would tell most people it wasn't either of those things. after watching it for several minutes, i know this sounds odd, but i got a feeling of foreboding. like we were risking our own safety by observing it. honestly, i got scared. my wife did as well, so we grabbed our things and went back inside. i didn't go back out to see if it was still there. but i did call the police non-emergency number, and filed a report. the officer wasn't particularly helpful when i asked if other people had seen it to, but he said he would put a call out to patrolling cars. not exactly sure what good that would have done. if you have any questions about what happened, you have my email address. not sure what else to say. thanks."],"files":["/var/www/straped/mufon/html2text/4029.html.txt","/var/www/straped/mufon/org/4029.html"],"Tags":"City","Date of the Event":"10/25/2005 02:26 UTC","Log Number":"US-10252005-0002","Weather Factors":"Unknown","Object Shape":"Oval, Sphere","Region":"Oklahoma"}