{"map":"<A HREF = \"http://maps.google.com/maps?q=44.603826,+-72.312571(40301)&iwloc=A&hl=en\"> mufon case (40301) map </A>","Object Shape":"Blimp, Boomerang, Bullet, Missile, Cigar, Circle, Fireball, Flash, Square, Rectagular, Star-like, Triangle","Tags":"City","Date Submitted":"07/06/2012 04:22 UTC","Region":"Vermont","divs":["sighting detailsits been happening for several months almost daily at my home in craftsbury common vermont. many different things have happened. there are several orange\\red lights glowing and flickering in the field and mountains behind my home. they get really bright then sometimes seperate into 2 and one takes off or dims out. they also begin as one small orage light and turn into 3-4 they are fast and move from the mountain tops to the field in front of my house. they also appear to go into or near a farm on the mountain. this farm has a lot of activity from different colored lights\\objects.. they come close to the house when im asleep or about to be and shine lights inside. these lights glow from celing to floor and sometimes random blue or red lights similar to a laser flash on the wall. they always seem to know where i am despite being sneaky and in complete darkness. there are also lights that illuminate the backyard and roof to chicken barn, despite a large canopy of trees. these lights come to the corner of the windows and glow. they glow from onr room to another as there are several hollow knots in the wood. these lights appear to be like flashdrones i researched online. they illuminate in the thick leafy trees and undergroth. today i saw a path through thr row of trees and vegetation that appeared to be blown out on all sides from center flattening and killing all the plants which were totally healthy yesterday. there are several different flying objects from what sound and appear to be a helacopter yet when on video they shoot all over the screen while flickering and changing color. in one video there were 2 small glowing blue lights in the sky when one dimmed out and left what appear to be smoke trails that go all over on the screen in the video. there have been what sound like military jets chasing after a flying object. one night when my house began to light up at 1am i called a friend to check it out,and as he circled around on the loop rd he saw someone squatted by the boat in the driveway. i heard him yell and ran to the window in time to see him chase and illuminated object\\person with his car until reaching the edge of field, while then jumping out and beginning a foot chase. eventually the person got away and when my friend came back i could still see the person glowing\\illuminating a couple acres away at the end of the field. i then began to ask what? who? how? when we herd a click and the backyard that had been light up for hours suddenly went pitch black. then a massive round saucer with red blinking lights appeared overhead and continued on its way. i have also herd footsteps all throught the night causing branches to break and snap. when this happens i usually hear coyotes howl and loons beinning to sound. twice ive herd a loud growl unlike anything ive ever herd before. its as though im completely surrounded. i can totally feel myself being watched!! erie!!"],"Longitude":"-72.312571","Case Number":"40301","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","trends":["There has been one other sighting in Craftsbury Common","There was one other sighting in Craftsbury Common on or around May 1st 2012"],"Object Features":"Dome, Wings, Other","Latitude":"44.603826","Weather Factors":"Unknown","Date of the Event":"05/01/2012 09:01 UTC","files":["/var/www/straped/mufon/html2text/40301.html.txt","/var/www/straped/mufon/org/40301.html"],"Country":"United States","Disposition":"Unresolved","Summary":"several hovering objects, orange/red flickerin lights on mountain, flash drones, illumination, growing, planes flying etc...","Viewing Distance":"20 Feet or Less, Over 1 Mile","Log Number":"US-07062012-0016","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Craftsbury Common"}