{"Log Number":"US-07062012-0015","Summary":"Yellow/orange light hovers then accelerates along a path, blinks at random intervals.","Weather Factors":"Unknown","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around July 5th 2012"],"Region":"Michigan","Date Submitted":"07/06/2012 03:04 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/40300.html.txt","/var/www/straped/mufon/org/40300.html"],"Object Shape":"Star-like","Latitude":"42.693778","divs":["Sighting DetailsI had just gotten out of work and was at the nearest gas station with a coworker. At the same time, we noticed a yellow-orange light that twinkled like Mars sometimes does. We were both immediately intrigued and were certain it wasn't a planet. There were no clouds in the sky and it was stationary at first, but difficult to judge its distance, but it appeared to be far overhead. The twinkle-effect changed to a slow blink remained still in the sky, at roughly 70 degrees from the horizon to our west. After about 25 seconds, it accelerated eastward and flew directly over us. It was the size and luminance of a bright star visible in a city. It travelled eastward, accelerating twice in bursts. The acceleration pattern reminded me of shifting a car into a higher gear, but between shifts the speed was constant. It continued blinking at roughly 35bpm for the entire travel time. At about 85 degrees above the eastern horizon, after it had passed over our heads, it arced roughly 5 degrees southward toward I-96E. During it's acceleration process, the object \"up-shifts\" from stationary to what would roughly be 800-1000mph if it were flying in the upper atmosphere where it appeared to be. When it reached about 60 degrees above the eastern horizon it appeared to either slow to a stop or change trajectory to match our path of eyesight. My coworker and I watched it return to a flicker or twinkle pattern, grow slightly dimmer, and then disappear (as if towards orbit and out of sight). As soon as it disappeared, we both said \"There it goes.\" I have no idea what it was."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.693778,+-84.495802(40300)&iwloc=A&hl=en\"> mufon case (40300) map </A>","Case Number":"40300","Country":"United States","Longitude":"-84.495802","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Date of the Event":"07/05/2012 10:25 UTC","Object Features":"None","City":"Lansing"}