{"divs":["sighting detailsiwas in the front passenger seat as my husband was driving to work. i was riding along so i could have the car. we were travelling south on shephardsville road and eventually turned left (east) on poplar level rd. my daughter had said something the night before about the moon being almost full so i glanced up at it. my eye caught a very small white object near the moon. visually it was about 1 inch to the left of the lower \\mid left side of the moon. visually,it was about the size of the head of a plastic ball topped straight pin (used for sewing). it was descending to the left in a slow arc and had reached a point where i could still see this small object between the power lines, this is the point where we turned east (away from the object) and lost sight of it. by the time we parked it was out of our sight. the object had such a light color and even tho the sky was clear it had that early morning light blue\\white hew to it. the object was just white enough that you could see it. it was too far to make out any discerable features. lapsed time 2 min at best. the arc didnot seem to be a true arc as the path varied\\wavered a little. no sound (way too far away for any sound to be heard if there was any). no contrails. no lights that i could see (again really to far away to discern)."],"Sighting Duration":"Undisclosed","Summary":"Looking at morning moon saw small white object up at the moon.It travelled down towards earth.Not a straightline trajectory, sort of an arc trajectory.","Log Number":"US-07062012-0020","files":["/var/www/straped/mufon/html2text/40305.html.txt","/var/www/straped/mufon/org/40305.html"],"Latitude":"38.184731","map":"<A HREF = \"http://maps.google.com/maps?q=38.184731,+-85.699819(40305)&iwloc=A&hl=en\"> mufon case (40305) map </A>","Disposition":"Unresolved","Case Number":"40305","Tags":"City","Object Flight Path":"Other","Country":"United States","Source":"MUFON","City":"Louisville","Region":"Kentucky","Date of the Event":"07/06/2012 07:27 UTC","Object Features":"None","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-85.699819","Date Submitted":"07/06/2012 08:43 UTC","Object Shape":"Circle","trends":["There have been 67 other sightings in Louisville","There were 2 other sightings in Louisville on or around July 6th 2012"]}