{"Date of the Event":"07/05/2012 11:30 UTC","Object Shape":"Sphere, Other","Date Submitted":"07/06/2012 01:34 UTC","trends":["There have been 12 other sightings in St John","There were no other sightings in St John on or around July 5th 2012"],"divs":["sighting detailsi was staying overnight at my friends house...i went outside in her backyard to have a cigarette before retiring for the evening. i was very relaxed, enjoying how warm a night it was when all of a sudden out of nowhere, there appeared this bright neon green round\\hexagon shaped object. the object appeared as though it was breaking up into particles and dividing into two seperate objects but then it pulled back into one object and instead of it looking like it was particles breaking up, it became a solid bright neon green colour and in the center, it appeared to have a small black hole. then a purple haze appeared all around the outisde of it. this object appeared through the open branches in a tree...it was hovering there approximately about 8 feet high...it looked to be the size of a basket ball...it was approximately 20 - 30 feet away from me. this object made no sound, i surprisingly wasn't afraid of it, considering i was thinking it was not something of this planet, that i know of...i was captivated by it and i just smiled while looking at it wondering what the heck it was. i was extremely calm and in awe of this object. i witnessed this for about 1-2 minutes, max. i came into the house to get my friend, i asked her to come quickly and within 30 seconds we came back outside, however, the object was no longer there. i am curious as to what this was and i would like to know if anyone else in this area, has reported experiencing anything similar? thank you!"],"Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/40319.html.txt","/var/www/straped/mufon/org/40319.html"],"Object Features":"Unknown","Longitude":"-66.087769","Latitude":"45.281206","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.281206,+-66.087769(40319)&iwloc=A&hl=en\"> mufon case (40319) map </A>","Region":"New Brunswick","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"Canada","Case Number":"40319","Summary":"I witnessed an orb like round/hexagon shaped object last night, which was a bright neon green in colour, with a purple outlined haze.","City":"St John","Tags":"City","Log Number":"CA-07062012-0033","Object Flight Path":"Stationary"}