{"City":"Elliston","Country":"United States","Tags":"City","Case Number":"40315","Region":"Virginia","trends":["There has been one other sighting in Elliston","There were no other sightings in Elliston on or around July 5th 2012"],"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","divs":["sighting detailsi walked outside to smoke a cigarette, and i always look up in the sky at the moon and stars in the sky because i feel that they are beautiful. i then hear this very loud airplane that was flying lower than normal for this area at that time of night, it was flying from the east heading west above poor mountain, once i seen it, i thought that plane was enormous it must have been air force one or a government plane. i was looking towards the southwestern sky, and noticed what i thought was a star at first moving towards me in the sky, then it turned towards the eastern direction at rapid speed, i did not know what to think, once it got above me i could see the triangular shape and a black\\grey color. i then noticed a plane heading from the south right in the path of the ufo, the ufo then made an abrupt maneuver to avoid the plane and continued on its eastern path at a rapid speed, then just disappeared. a few minutes later, i witnessed a black helicopter heading in the same direction as the ufo, as well as various types of planes a few minutes later, sort of like they were chasing the ufo. i immediately went inside and told my girlfriend what i had witnessed, she believed me because this type of story is not normally what comes out of my mouth. i personally did not know what to think and could not believe what i had witnessed and did not know what to do. as the night went on, i started to have these weird feelings of getting really hot, and exhausted like i had run a marathon, and that is not normally me, that may not have anything to do with what i saw but i can't explain the feelings my body was having, it was out of the ordinary. i hope that you will be able to tell me what i saw, so i know that i am not crazy."],"Longitude":"-80.228179","files":["/var/www/straped/mufon/html2text/40315.html.txt","/var/www/straped/mufon/org/40315.html"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Summary":"Looked Like A Star At First, Then Noticed Moving Fast And Changed Directions To Avoid Another AirCraft","Log Number":"US-07062012-0030","Date Submitted":"07/06/2012 11:01 UTC","Object Features":"Unknown","Date of the Event":"07/05/2012 10:30 UTC","Latitude":"37.241962","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.241962,+-80.228179(40315)&iwloc=A&hl=en\"> mufon case (40315) map </A>","Weather Factors":"Unknown","Object Shape":"Star-like, Triangle"}