{"Disposition":"Unresolved","Object Features":"Undisclosed","Tags":"City","Summary":"3 Triangle UFO's as well as 10 single orange orbs","Latitude":"45.541946","files":["/var/www/straped/mufon/html2text/40328.html.txt","/var/www/straped/mufon/org/40328.html"],"Date Submitted":"07/06/2012 05:43 UTC","Region":"Oregon","Longitude":"-122.378713","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsmy family had just came inside and my brother stayed outside to have a smoke. he came running in the house yelling that he needs a camera because there is a triangle ufo over the house. we all (10 people kids and adults) ran outside to see 3 triangle ufo above the tree line floating over the house. as they moved another 10 or more orange orbs came behind. as they moved in an south east direction they started disappearing (each in the same place as the one in front). you have to know the neighborhood was packed full of people doing fireworks and there were no huge firework displays in troutdale on this day. these were not sparks from fireworks. they moved in triangle patterns. myself and a neighbor walked up the street to look beyond the tree line to see how many more where coming and if we could see anything else. they eventually all disappeared. we thought they may have been chinese lanterns until i was doing research on the event and saw someone posted the same sighting but in ne\\se portland which is 13 miles from troutdale, oregon. crazy stuff!!"],"Country":"United States","Object Shape":"Triangle","Date of the Event":"07/04/2012 12:00 UTC","City":"Troutdale","map":"<A HREF = \"http://maps.google.com/maps?q=45.541946,+-122.378713(40328)&iwloc=A&hl=en\"> mufon case (40328) map </A>","Case Number":"40328","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-07062012-0041","trends":["There have been 4 other sightings in Troutdale","There were no other sightings in Troutdale on or around July 4th 2012"],"Source":"MUFON","Object Flight Path":"Straight-line path"}