{"Object Shape":"Circle","Longitude":"-70.947778","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/40322.html.txt","/var/www/straped/mufon/org/40322.html"],"Object Flight Path":"Path with directional change","Region":"Massachusetts","Summary":"Bright orange light, slowly moving silently witnessed by my wife and I.","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Bridgewater","There were no other sightings in Bridgewater on or around July 4th 2012"],"Latitude":"41.989878","Tags":"City","Source":"MUFON","Country":"United States","Date of the Event":"07/04/2012 12:00 UTC","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Case Number":"40322","Disposition":"Unresolved","divs":["Sighting DetailsIt was around 10 PM, Wednesday, July 4th. My wife and I were watching the July 4th celebration with Keith Lockhart performed on the Esplanade in Boston Massachusetts. We took our dog Charlotte outside, one last time for the evening when my wife said \"Chris, look!\" I said \"What?\" She said, \"there, look at that light.\" I looked up and right over the tree line was a bright orang light that appeared to be the size of a softball moving slowly without making a sound. I could see it moving steadily right above the tree line as it did ascend and change direction slightly. We only witnessed it for a couple of minutes. I thought the light might be flashing. My wife thought that it wasn't. Perhaps looking at a moving object at night through branches of trees, caused it to look like lights were flashing. I couldn't smell, hear, feel any vibrations of any kind. It just quietly flew over the backyard leaving us to wonder what this was and why it would be flying over our backyard. I would love to hear if anyone else saw this. Just an FYI. My wife and I have never reported this kind of occurrence before to anyone or to any medium. This is the first time I have seen something like this. Neither of us were drinking or impaired in any way."],"City":"Bridgewater","map":"<A HREF = \"http://maps.google.com/maps?q=41.989878,+-70.947778(40322)&iwloc=A&hl=en\"> mufon case (40322) map </A>","Log Number":"US-07062012-0036","Date Submitted":"07/06/2012 02:27 UTC"}