{"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.775266,+-86.148484(4036)&iwloc=A&hl=en\"> mufon case (4036) map </A>","Object Flight Path":"Stationary","Sighting Duration":"00:00:05","Disposition":"Unresolved","Log Number":"US-10262005-0003","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","City":"Indianapolis","Source":"MUFON","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around October 26th 2005"],"files":["/var/www/straped/mufon/html2text/4036.html.txt","/var/www/straped/mufon/org/4036.html"],"Region":"Indiana","Weather Factors":"Unknown","Longitude":"-86.148484","Latitude":"39.775266","Case Number":"4036","divs":["Sighting DetailsI was heading North in my car on Craig Street in the Castleton, Indiana area. I had just got done working out and was feeling relaxed as I was driving home. Ever since I was a child, I have always took note of the sky to look at stars and to watch planes going by. At around 8:00 pm on October 26th, 2005, I noticed an airliner coming from the Northeast. This seems to be a pretty normal flight pattern for commercial airlines. On this night, it was partially cloudy with low level clouds. The plane I noticed was flying higher than some of the other flights I have noticed of prior times. My townhome is close to vicinity of where I took note of the airliner coming from the Northeast; because of this, I have taken note of the particular flight patterns of this area pretty well. As I was glancing up at the sky this particular night, I noticed there were about 6-7 orange lights in the sky towards the Northwest. I immediately slowed down to safely keep an eye on them without losing sight. The lights were too big to be of highflying airline lights. They were evenly spaced apart and formed a single row. They appeared to be the same size and they did not seem to be moving. The lights did not look real close at all. They seemed to be far out in distance unless the lights outlined something bigger. I was in utter shock and almost did not believe I was seeing this. I did see this, though. I probably watched these lights stay stationary for a mere 5 seconds, and one by one, the lights disappeared; just like when someone turns a light bulb off. I just find it all odd."],"Object Features":"Unknown","Date of the Event":"10/26/2005 12:00 UTC","Date Submitted":"10/26/2005 12:00 UTC","Summary":"6-7 orange balls of light arranged in a row. There were no blinking lights. Much bigger than airline lights."}