{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40434.html.txt","/var/www/straped/mufon/org/40434.html"],"divs":["Sighting Details location:Pawtucket, Rhode Island On July 4. 2012 at 9:30 pm I was in the backyard of my girlfriends house attempting to view some of the neighborhood fireworks through the spaces between the trees and houses. I was successful to a small degree and witnessed the burst of a few small aerial fireworks. While I was waiting and watching for more,I noticed a short orange line emerge from behind a distant tree top. My first thought was \" WOW..that`s one big rocket and it`s going to make one hell of a bang !\". However, it never exploded.Instead, it continued to travel in what appeared to be an upward direction and then I noticed it was traveling toward me. I watched the slightly oblong orange glow intently as it traveled slowly across the sky under a thin cloud cover. I squinted to try and get a better look at it to see if I could make out any type of form inside the orange glow,but all I could see was the orange glow itself. There was no sound that I could detect and there were no white,green or red flashing lights that would have indicated to me that it was a jetliner or other normal aircraft. If I did detect any of these things, I would have thought it was an aircraft on fire and doomed to crash any minute. If I had to guess, I would say it was at about 5K feet and it traveled from the SW to the NE and was moving at the pace of a passenger jet. I lost sight of the object when it passed behind a neighboring house. It never changed direction or altitude, just sailed along as if it belonged there. I`ve seen meteors,large and small and have watched satellites,even the space shuttle fly by,but it`s the first time I`ve ever seen anything like I have described. I wanted to call out to have someone witness it with me, but I figured there was no one within earshot and had I thought of it, I could have gone 25ft to my truck to get my binoculars. I was just too engrossed in the moment and didn`t want to miss any of it. As a passing note, there is an airport near by ( T.F.Green (PVD) ), the orange glow was traveling in a direction AWAY from the airport. In fact, about 20 minutes later, a passenger jet flew over in a similar direction,but towards the airport and there was no mistaking the lights,shape, and sound to identify it as a jet aircraft."],"City":"Pawtucket","Tags":"City","Summary":"WATCHED FUZZY ORANGE SLIGHTLY OBLONG GLOWING OBJECT TRAVEL SLOWLY THROUGH THE NIGHT SKY FROM A SW TO NE DIRECTION , NO SOUND,NO FLASHING LIGHTS. Y FROM A","Latitude":"41.858727","Date Submitted":"07/07/2012 02:27 UTC","Country":"United States","Object Features":"Unknown","Date of the Event":"07/04/2012 09:30 UTC","Log Number":"US-07072012-0009","Source":"MUFON","Weather Factors":"Unknown","Case Number":"40434","Object Shape":"Egg","map":"<A HREF = \"http://maps.google.com/maps?q=41.858727,+-71.410995(40434)&iwloc=A&hl=en\"> mufon case (40434) map </A>","Region":"Rhode Island","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","trends":["There have been 5 other sightings in Pawtucket","There were no other sightings in Pawtucket on or around July 4th 2012"],"Disposition":"Unresolved","Longitude":"-71.410995"}