{"Summary":"Bright orange large low flying UFO slowly passes, then hovers over us. My wife and I in our backyard, neighbors in their backyard simultaneously witness event.","map":"<A HREF = \"http://maps.google.com/maps?q=33.743837,+-116.929869(40430)&iwloc=A&hl=en\"> mufon case (40430) map </A>","Source":"MUFON","Country":"United States","trends":["There have been 11 other sightings in Hemet","There were no other sightings in Hemet on or around July 6th 2012"],"Latitude":"33.743837","Sighting Duration":"Undisclosed","divs":["sighting detailsthe event lasted about a full minute or so. bright orange firey \"solid\" round\\disc looking object slowly comes into our area. hovers above our houses for nearly a minute at very low altitude (~ 1000 ft above us, nearly directly overhead). at this time, the shape of the object began to reveal, and the bright orange fiery hue was toned way down. the shape was not flat-disc, but more like two cones base to base with longitudinal lighted stripes. as i stood there, hands on hips, shouting to the object \"very interesting\" over and over again it seemed to suddenly have the outline of a door (rectangle) come into view. then the object faded back quickly. it then turned into a small point of light and disappeared. the view could not have been better; time of day was perfect. it was so very close. the whole time there were sirens going also very close by as if a cop were in pursuit of this thing. our neighbors witnessed this event simultaneously from their backyard. when the craft was ascending into the sky we noticed an airplane in the vicinity."],"Disposition":"Unresolved","Date of the Event":"07/06/2012 08:45 UTC","Case Number":"40430","City":"Hemet","Region":"California","Date Submitted":"07/07/2012 12:43 UTC","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-116.929869","Object Features":"Patterned Surface, Other","Weather Factors":"Unknown","Log Number":"US-07072012-0004","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc","Tags":"City","files":["/var/www/straped/mufon/html2text/40430.html.txt","/var/www/straped/mufon/org/40430.html"]}