{"Date Submitted":"07/07/2012 02:51 UTC","Country":"United States","Weather Factors":"Unknown","Case Number":"40437","divs":["Sighting DetailsIt was about 10 pm on the 4th of July in 2012, so about 2 days ago. me and my dad were outside, watching the fireworks, as well as lighting off a couple of bottle rockets. I looked up in the sky during a period where there were no firework explosions going off. It was eerily quiet. There was a red object in the sky. I told my dad, \"Look at that, that's not a helicopter, or a plane, or a firework.\" We observed it for a few minutes, and when I got my phone out to take a picture, my phone died. I had just charged it that morning. As we watched, it slowly moved towards us, then hooked to the south. Immediately afterword, it got dimmer and dimmer until it just disappeared. My dad then went to the store, and while he was gone, I looked north, towards the golf course. I saw two objects that looked like exact replicas of the first object. As i watched, they flashed slightly, then were gone. As soon as my dad got back, I saw another one of these objects to the East, the same direction as the first one. As it got closer, it slowly got dimmer, then it increased in brightness momentarily, then was gone. The next day, my mom was told by one of her coworkers that him and his wife had observed the final object just as we had. The only difference is that they saw one go towards the ground and possibly land to the west. When they tried to take a picture, their camera was malfunctioning, not allowing them to snap an image of the craft. None of us could hear any sound whatsoever."],"files":["/var/www/straped/mufon/html2text/40437.html.txt","/var/www/straped/mufon/org/40437.html"],"Object Features":"Unknown","Log Number":"US-07072012-0012","trends":["There have been 4 other sightings in Chewelah","There were no other sightings in Chewelah on or around July 4th 2012"],"Date of the Event":"07/04/2012 12:00 UTC","Longitude":"-117.711271","Source":"MUFON","Object Shape":"Disc, Sphere","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Summary":"I saw multiple stange objects in the sky, and they weren't fireworks","Tags":"City","Viewing Distance":"Unknown","City":"Chewelah","map":"<A HREF = \"http://maps.google.com/maps?q=48.282967,+-117.711271(40437)&iwloc=A&hl=en\"> mufon case (40437) map </A>","Region":"Washington","Latitude":"48.282967","Disposition":"Unresolved"}