{"Disposition":"Unresolved","Region":"Oregon","Longitude":"-122.673767","Summary":"Two orange stars close to the gibbous moon; one large fireball moving at speed of a plane.","trends":["There have been 158 other sightings in Portland","There were 4 other sightings in Portland on or around July 6th 2012"],"Object Flight Path":"Straight-line path","Log Number":"US-07072012-0010","City":"Portland","Object Features":"None","Case Number":"40435","Sighting Duration":"00:01:30","map":"<A HREF = \"http://maps.google.com/maps?q=45.528512,+-122.673767(40435)&iwloc=A&hl=en\"> mufon case (40435) map </A>","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/40435.html.txt","/var/www/straped/mufon/org/40435.html"],"Object Shape":"Fireball","Weather Factors":"Unknown","divs":["Sighting DetailsCouldn't sleep, outside to smoke. Noticed that the stars by the moon were orange and thought it interesting. Then noticed a larger object like an orange fireball moving at the same speed a plane or helicopter would move about 45 degrees above horizon; maybe twice the size of how a low-flying plane would look. Freaked me out at first; I wanted to turn around and go back inside, but had to get a better look. Object continued on a straight trajectory from north to south and became fainter and fainter, not so much like it was going farther away, but more like it was burning out. It ultimately became as small as the orange stars by the moon. I had no idea what it was, but after it had faded speculated that it could have been a meteorite (never seen one of those, either; just \"shooting stars\"). I was just awed at the sight, as in \"Holy crap\" awed. Went back inside and googled god knows how many different terms related to UFOs and meteors in my area and came up with nothing. No meteor showers are \"scheduled\" by mother nature at this time; nobody else reported seeing it. So...early stages of schizophrenia, meteorites, or something else? I've never seen anything like it."],"Date of the Event":"07/06/2012 02:30 UTC","Tags":"City","Latitude":"45.528512","Date Submitted":"07/07/2012 02:48 UTC","Country":"United States"}