{"files":["/var/www/straped/mufon/html2text/40438.html.txt","/var/www/straped/mufon/org/40438.html"],"Log Number":"US-07072012-0013","Longitude":"-112.006713","trends":["There have been 10 other sightings in West Jordan","There were no other sightings in West Jordan on or around July 4th 2012"],"Sighting Duration":"Undisclosed","Date of the Event":"07/04/2012 12:00 UTC","Tags":"City","divs":["sighting detailson the fourth of july, we were watching fireworks. in the corner of my eye i saw a red orb like light in the sky. at first i thought that it was a firework that was going up into the sky about to go off, however, it stayed in the orb like state and started to move west to east over the top of some homes in the area. i had my camera that takes hd video and filmed the object. then it gradually turned and went back west and then disappeared over the oquirrh mountains. i live near an airport that has both civilian and military aircraft and it did not look like an aircraft that we have seen before. as it was all red and orange and was a sphere shape . where on an airplane there is a blue\\green light on one wing and a red light on the other and one in the middle.it was not flying in the normal flight path from north to south or south to north. it was moving east to west across the flight path. there were airplanes in the area looking at the fireworks in the area flying north to south at around the same elevation. they do this every year to watch the fireworks. this was much bigger then a helicopter or an airplane and it was a solid sphere shaped object. we could not figure out what this could be, as we have lived here for 13 plus years and are very familiar with all kinds of aircraft flying over our home. after watching the video that we took of it we couldn't come up with an answer to what this was. the area over the oquirrh mountains has many sightings of strange objects and has also been featured on many tv shows for issues like this."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.61303,+-112.006713(40438)&iwloc=A&hl=en\"> mufon case (40438) map </A>","Object Features":"Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"40438","Summary":"Red orb like light in the sky","Object Shape":"Sphere","Region":"Utah","City":"West Jordan","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Latitude":"40.61303","Date Submitted":"07/07/2012 03:25 UTC"}