{"Object Features":"None","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Region":"Illinois","Source":"MUFON","Date Submitted":"07/07/2012 02:50 UTC","Weather Factors":"Unknown","City":"Homer Glen","Date of the Event":"06/30/2012 09:35 UTC","files":["/var/www/straped/mufon/html2text/40436.html.txt","/var/www/straped/mufon/org/40436.html"],"Country":"United States","Summary":"3 silent objects moved slowly across my point of view while I was driving home.","Longitude":"-87.961241","Case Number":"40436","Log Number":"US-07072012-0011","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:20","Latitude":"41.599298","trends":["There have been 23 other sightings in Homer Glen","There was one other sighting in Homer Glen on or around June 30th 2012"],"Tags":"City","divs":["Sighting DetailsI was driving home after work, at about 9:30 pm on Juune 30, 2012. Travelling North on Bell rd., I was distracted by a triangular formation of 3 blue-white lights on my left that were particularly low on the horizon(about 15 degrees). Confused at their unusual color and formation, I slowed down to about 20 mph in order to look for any flashing avaition indicators and could find none evident during the incident. Since there was not enough shoulder I was unable to stop and get out. Coming from out of the west, and travelling a straight line path from 10 o'clock to 4 o'clock it became obvious as they passed over the road that they were glowing spheres and not any lights associated with any normal avaiton lights associated with conventional aircraft. They did not appear to be part of a single craft but it was too dark behind the spheres bo be sure. After about 20 seconds they had moved too far east of my position to see while I was still driving the car. Unfortunately I did not get out of the car to continue further observation and they passed overhead and out of sight. I estimate their size at around 30-50ft in diameter, spaced about 150-200ft apart, at an elevation of approximately 1000-1500ft, with a speed no greater than 150-200mph. I have seen plenty of aircraft in the area, as there are many that are on their descent paths to Midway Airport from there, but they travel south north and are still at least 10 times higher than these objects. their warning lights are also clearly visible even at that altitude."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.599298,+-87.961241(40436)&iwloc=A&hl=en\"> mufon case (40436) map </A>","Disposition":"Unresolved"}