{"City":"Scranton","Object Flight Path":"Hovering then path,Path with directional change,Unknown","trends":["There have been 28 other sightings in Scranton","There were no other sightings in Scranton on or around July 4th 2012"],"files":["/var/www/straped/mufon/html2text/40549.html.txt","/var/www/straped/mufon/org/40549.html"],"Case Number":"40549","Disposition":"Unresolved","Object Features":"Unknown","Longitude":"-75.67295","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"07/04/2012 11:02 UTC","Object Shape":"Oval, Saturn-like, Sphere, Star-like","Viewing Distance":"Unknown","Latitude":"41.423807","Log Number":"US-07072012-0122","Date Submitted":"07/07/2012 05:35 UTC","Region":"Pennsylvania","Tags":"City","Source":"MUFON","divs":["Sighting DetailsI would like someone there to check this out & see what they can make of it, if you will. Myself as well as several others were here celebrating the 4th & happened to notice the full moon, one deciding to take some pictures with his fairly expensive camera. Nothing incredible showed up at first glance, but then the photographer decided to zoom in & started getting different sized red, white, & blue lights appearing in the digital photographs, which were not apparently visible through the camera scope alone, nor to the naked eye. He showed a few others his pics, & upon seeing them I ran to get my telescope. It is not much for a tele mind ya, but I couldn't see the objects with it either. We took turns looking through the tele as the photographer continued taking pictures, almost all of which captureded these mysterious lights, but in different locations each time, as if they were moving. I messed with the digital images on my pc some, magnifying some pictures to try & gain a better understanding of exactly what we may be looking at.. but retained the originals as well as their filenames when saving magnified images. I'm not in a good situation financially at the moment, so mailing or 'ups'-ing may not be the best means for me at this time, but I have all the pictures both on my pc & on flashdrive here, if there is some way I can email or otherwise post them(?) Also, only lately have I begun 'looking up' quite so much, as recent sightings while out with freinds have been recurring to the point it's almost impossible not to notice.. Awhile after dusk on June 10 2012, while finishing up a game of 21 (basketball) at the Lawrence township recreation park in Clearfield PA, one of the 5 adults & 5 children there at the time (I think it was Amber, my fiance') made a comment to the effect of \"wow, wtf is that?!\" & pointed to an extremely bright light in the sky. All of the adults & all but 1 of the children took immediate notice of the almost unnaturally bright light seemingly hovering motionlessly overhead, & in as little time as it took for me to think \"whoa that can't be venus because it just passed in front of the sun a few days ago & isn't out this early in the night this time of year\" the object suddenly decreased significantly in luminousity, then accellerated towards what I believe to be a south-eastern-ish direction. It continued it's direction of travel for several seconds while the light faded & brightened several times before apparently vanishing into thin air. About a week later, while saying our so-longs & such, a younger brother of one of the witnesses to the first sighting was preparing to leave my place when I noticed a very similar bright white light in the southern sky traveling at a fairly quick rate of speed in an eastern direction. I pointed it out to my freind, and he 'kept an eye on it' as I ran to get my telescope. But, of course, by the time I returned with it, according to my friend, it had also just disappeared. Neither of the first 2 encounters were photographed, unfortunately, & those incedents may or may not be related in any way, but seeing as these are the first we've managed to actually photograph I would love for someone who has seen much more than I could hope to have a look and see what they think of it all.. Thanks for your time!"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.423807,+-75.67295(40549)&iwloc=A&hl=en\"> mufon case (40549) map </A>","Summary":"red, white & blue lights near moon 7-4-12, brightly pulsating, accelerating, disapearring white lights 6-10-12","Weather Factors":"Unknown"}