{"Object Features":"Unknown","divs":["Sighting DetailsI was enjoying a lite dinner at my local beach. The sky was covered in a solid mass of thick clouds and the ceiling was low in preparation for heavy, late night thunderstorms. I happen to look up and noticed a trail in the cloud cover. Looking closer I realized there were two trails traveling in parallel. I could visually follow something which was traveling just under the bottom of the ceiling. It disturbed the cloud cover, and left the parallel trail behind as it moved. It never seemed to break the surface of the clouds however. Suddenly, while following the movement I lost site of it. I searched the sky carefully, checking back where it came from, to the north, as well as an anticipated path off to the north east. Nothing. So, I went back to where I had lost site and began searching there again. Suddenly, it seemed to pop out below the cloud cover. Surprisingly though, the object remained covered in clouds. I was unable to identify anything about it except that it appeared to be oval in shape and there were no wings. That was interesting! I continued to observe it as it traveled a short distance along the shoreline before mading another small directional change which took it out through Conscience Bay to Port Jefferson Harbor where I lost site of the trail. When the object was visiable, it seemed to serge through the clouds almost like a dolphin's push as it breaks the water's surface while moving forward. It did not however bend it's body as it settled back down. I heard no noise as I watched. I'm not sure how low the cloud cover was. This information would be easily located in local weather reports. I viewed the trail and accompanying object at approximately a forty-five degree angle from the beach. Its approximate size was difficult to estimate. However, I believe if you held a nickel out and up at arms length it would be a good indicator of the width of the parallel trail. This in turn would identify the width of the object. The speed is more difficult to identify. It was definitely a little faster than a private plane and obviously much slower than an airliner. This was a very interesting sighting."],"Date of the Event":"07/02/2012 06:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.948876,+-73.100514(40540)&iwloc=A&hl=en\"> mufon case (40540) map </A>","Tags":"City","Sighting Duration":"00:02:00","Case Number":"40540","City":"East Setauket","Weather Factors":"Unknown","Object Shape":"Oval","Region":"New York","Log Number":"US-07072012-0115","trends":["There have been no other sightings in East Setauket","This sighting has never been favorited."],"Viewing Distance":"Unknown","Longitude":"-73.100514","Date Submitted":"07/07/2012 02:14 UTC","Latitude":"40.948876","Source":"MUFON","files":["/var/www/straped/mufon/html2text/40540.html.txt","/var/www/straped/mufon/org/40540.html"],"Object Flight Path":"Path with directional change","Country":"United States","Summary":"eWhile visiting my local beach early one evening I observed a disturbance in the cloud cover.","Disposition":"Unresolved"}