{"map":"<A HREF = \"http://maps.google.com/maps?q=47.892307,+-122.308792(40548)&iwloc=A&hl=en\"> mufon case (40548) map </A>","Country":"United States","Latitude":"47.892307","Object Shape":"Sphere","City":"Edmonds","files":["/var/www/straped/mufon/html2text/40548.html.txt","/var/www/straped/mufon/org/40548.html"],"Weather Factors":"Unknown","Date Submitted":"07/07/2012 05:28 UTC","Object Features":"None","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsPicnic Point Area, between Edmonds, Lynnwood and Mukilteo, WA. 12:30 AM the morning of July 5, after a night of shooting fireworks and cleaning up in front of my house, I was moving my vehicles back into my driveway when I noticed an unusual light in the sky. It appeared bigger than most low flying plane lights. It did not resemble a satellite or ISS. It was traveling generally from north to south at constant speed, It was glowing orange in color, which I found unusual for the usual objects I normally see in the night sky. This is what drew my attention to the object. I live by Paine Field and see all kinds of aircraft flying thru the night sky. It appeared to be pulsating or flashing. At first I thought it might be a plane. I rushed to my vehicle and retrieved my binoculars. The object looked like a big orange ball of light with a brighter smaller light at it center. It did not appear to change course. As it approached closer to me the whole object seem to fade and then disappear without a trace. It made no sound at all."],"Region":"Washington","Longitude":"-122.308792","Tags":"City","Date of the Event":"07/05/2012 12:00 UTC","trends":["There have been 3 other sightings in Edmonds","There were no other sightings in Edmonds on or around July 5th 2012"],"Log Number":"US-07072012-0121","Case Number":"40548","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Summary":"Observed with naked eye and binoculars a pulsating orange orb traveling in straight line above house then slowly faded away into completely clear night sky","Viewing Distance":"Unknown"}