{"Date Submitted":"07/07/2012 05:47 UTC","City":"Canton","Longitude":"-76.817198","Latitude":"41.620599","Weather Factors":"Unknown","Object Shape":"Other","Object Flight Path":"Straight-line path,Path then hovering","Source":"MUFON","Date of the Event":"10/10/1986 09:15 UTC","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","trends":["There have been no other sightings in Canton","This sighting has been favorited 1 time."],"Log Number":"US-07072012-0126","Country":"United States","files":["/var/www/straped/mufon/html2text/40556.html.txt","/var/www/straped/mufon/org/40556.html"],"Region":"Pennsylvania","divs":["Sighting DetailsIn the fall of 1986 I was headed up Lake Hill RD which is route 154. As I neared the top where there is a sharp left turn I noticed the trees blowing like crazy I found strange for a calm night. I slowed and notice a massive object and I mean massive this thing was 100 or so feet above tree tops and huge. The size of a football field or bigger. I stopped in the road in disbelief. This thing just slowed as I watched it and had lights but not real bright or directive. As I watched it headed toward the west. The wind calmed and it was gone. This thing was massive and very quiet other than the wind around it. I was about 18 years old at the time and didn't tell anybody figuring they would just laugh and call me crazy. Years later I was talking to a cousin who was on the other side of the mountain had seen the same thing. The same night. At first sight I thought it may be a plane or blimp. But this thing was way to big way to quite and way to strange. Had I had a camera or technology we do today I would have been filming like crazy. I know this happend I seen it I'm not nuts crazy or insane. I wish I had talked about it when it happend. In the field apparent size. If you held an aircraft carrier at arms length you might cover it."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.620599,+-76.817198(40556)&iwloc=A&hl=en\"> mufon case (40556) map </A>","Sighting Duration":"Undisclosed","Object Features":"None, Unknown","Summary":"A massive object caused the wind to blow the trees almost bent from the force.","Case Number":"40556","Tags":"City"}