{"divs":["Sighting DetailsI WAS ON DUTY AS THE MASTER-AT-ARMS THAT NIGHT WE WERE ON THE ATLANTIC OCEAN COMING HOME TO MAYPORT,FL. THE SHIP WAS STATION OUT OF MAYPORT ,FL. OUR AFTER LOOKOUT STOPPED SOMETHING IN THE SKY BEHIND THE SHIP AND REPORTED TO THE BRIDGE TO THE OOD(OFFICER OF THE DAY) ,HE ASK CIC IF THEY HAD ANY THING ON THEIR RADAR AND THEY SAID NO,SO THE AFTER LOOK OUT WAS VERY SACRED SO THE OOD SEND ME BAACK TO CHECK OUT ON WHAT THE AFTER LOOKOUT WAS LOOKING AT ,SO I WHEN TO FIND OUT ,I HAD TO HUNT FOR THE AFTER LOOKOUT BECAUSE HE WAS HIDING FROM THE THING IN THE SKY,SO I FOUND HIM AND ASKED HIM WHAT IS ALL THIS ABOUT AND HE SHOWED ME BY POINTING AT SO I SAID LET ME WHAT I SEE SO I LOOK AND HE WAS RIGHT IT WAS A DISC(A UFO ,FLYING SAUCER, THEN I ASKED HIM FOR THE SOUNDPOWER PHONES WE USE FOR THE LOOKOUTS ON WATCH. I ASKTO SPEAK TO THE OOD AND I TOLD HIM WHAT I AM LOOKING AT AND HE SAID WAIT,NEXT THING I KNEW THE XO SHOWED UP BACK THERE WHERE I WAS AND THE AFTER LOOKOUT WAS STANDING . I SHOWED THE XO WHERE TO LOOK AND HE SEEN THE SAME THING BOTH OF US SEEN ,HE ASKED FOR THE SOUND POWER PHONES AND TOLD THE OOD TO GET THE CO ,AND HE CAME BACK THERE TO SEE WHAT US 3 WERE TALKING ABOUT HE SEEN FOR HIMSELF AND HE GOT IN TOUCH WITH CIC TO SEE IF THEY HAVE ANYTHING ON THE RADAR AND CIC SAID NO THEY DON'T AND ASKED THEM WHY THEY DON'T AND HE WENT TO CIC TO CHECKED IT OUT FOR HIS SELF AND HE CAME BACK TO US AND SAID THAT THERE WAS NOTHING ON THE RADAR ,SO I KNEW THAT IT WAS A UFO FOR REAL,YES I DO BELIEVE IN UFO'S .NEXT THING I KNEW THE SPOOK TEAM CAME BACK THERE WITH HIGH POWER CAMERA'S AND NEXT THING A LOT OF THE CREW CAME BACK THERE WITH THEIR CAMERA'S ,BUT WHEN WE PULL INTO MAYPORT AND TIRED OUT TO THE PIER ,NEXT THING I KNEW THERE WE MEN IN BLACK SUITS CAME ON BOARD AND COLLECTED ALL THE CAMERA'S FROM THE CREW AND THE SPOOK TEAM ,AND A LOT OF US WERE INTERGATED ON WHAT WE SEEN OUT AT SEA . TO WHOM IT MAY CONCERN I STILL REMENBER THAT NIGHT,I WAS 25 YEARS OLD AT THAT TIME NOW I AM 64 YEARS OLD NOW .I WAS AT THAT TIME A GUNNERSMATE THIRD CLASS ,( MASTER- AT -ARMS). I DO NOT REMENBER THE MONTH BUT I KNOW THE YEAR ."],"Object Flight Path":"Stationary,Path then hovering","Latitude":"27.669287","map":"<A HREF = \"http://maps.google.com/maps?q=27.669287,+-81.512804(40558)&iwloc=A&hl=en\"> mufon case (40558) map </A>","City":"OUT ON THE ATLANTIC OCEAN","Log Number":"US-07072012-0128","Sighting Duration":"Undisclosed","Date Submitted":"07/07/2012 06:03 UTC","Date of the Event":"03/16/1972 12:00 UTC","Object Shape":"Disc","Region":"Florida","Disposition":"Unresolved","Object Features":"Undisclosed","Country":"United States","Source":"MUFON","Case Number":"40558","Summary":"THE SIGHTING WAS WHEN I WAS IN THE NAVY ABORAD A NAVY SHIP SAILING ON THE ATLANTIC OCEAN IN 1972 .","Tags":"City","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/40558.html.txt","/var/www/straped/mufon/org/40558.html"],"Longitude":"-81.512804","trends":["There have been no other sightings in OUT ON THE ATLANTIC OCEAN","This sighting has never been favorited."],"Weather Factors":"Unknown"}