{"Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Latitude":"34.12144","Object Shape":"Disc","Summary":"2 silver disc shaped with red portholes beaming out","Object Features":"Dome, Window(s)","Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around January 10th 1981"],"divs":["Sighting DetailsI was at a friend's house in January 10th of 1981 in L.A. Calif. He was in the shower so I was the only witness. Something told me to look out the window so I did and I saw one ufo on the far right of of Hollywood Hills and saw it slowly glide towards my center vision and it was hovering in front of the Maxfield Building downtown L.A. I was estastic. I looked at the clock. It was 6:30 p.m. pacific time. It was silver in color disc shaped and had red lights beaming out of the portholes. It was in plain view and the craft's metal shined from the sunset. It hovered for approximately seven minutes. It then slowly glided to the left upwards towards the moon. As I saw it, there was another one exactly like the first one. I was indoors looking out a bay window but heard no sound. I was estatic and overwhelmed. Excited. All my life I wanted to be a witness to such an event. And, it happened. I told my friend about it who was taking a shower at the time but he didn't believe me because he did not see them but as God as my witness, I saw them with my own two eyes."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.12144,+-118.344739(40551)&iwloc=A&hl=en\"> mufon case (40551) map </A>","Date of the Event":"01/10/1981 06:30 UTC","Date Submitted":"07/07/2012 05:37 UTC","files":["/var/www/straped/mufon/html2text/40551.html.txt","/var/www/straped/mufon/org/40551.html"],"Weather Factors":"Unknown","Longitude":"-118.344739","Log Number":"US-07072012-0124","Region":"California","Case Number":"40551","Viewing Distance":"101-500 Feet","Object Flight Path":"Path then hovering","City":"Los Angeles","Source":"MUFON"}