{"trends":["There have been 6 other sightings in Monroe","There were no other sightings in Monroe on or around July 4th 2012"],"Latitude":"47.78636","Longitude":"-122.010252","Sighting Duration":"00:30:00","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.78636,+-122.010252(40559)&iwloc=A&hl=en\"> mufon case (40559) map </A>","Object Shape":"Fireball","Disposition":"Unresolved","divs":["Sighting DetailsI started out the 4th of July by taking shots of the neighborhood fireworks with my new digital camera, started taking the pictures at twilight. Had my digital camera set to \"fireworks\" mode for the longer exposure. (Side note: NOT happy with the new camera. Extended exposures create terrible halos, not a continuous exposure either.) I immediately caught sight of a red orb moving parallel to the ground, at approximately the height of a low-flying passenger jet. I caught sight of it so quickly, in fact, that the first sighting was my fifth photo of the night! At first, I thought it was a plane catching the remaining light from the setting sun, but it couldn't be because I saw the same type of orb THREE times over about 30 minutes and by then all light was gone. The orb was bright like fire. It moved at a steady pace without deviating from its path...with the exception of one orb. Each time I saw the orb (or orbs), it was following the same North to South direction through the Monroe valley. I have digital photos (poor quality - see note at beginning) and a couple of videos (better quality). The still photos were taken with the \"fireworks\" setting of the new camera (Canon PowerShot ELPH 110 HS). Instead of the usual streaking of light you would see with a typical long-exposure, this camera took three pics in quick succession and overlapped them. So, the three pictures I have show three orbs connected...this is NOT the case. It was ONE orb. (I need a better camera!) The video was taken on the same camera and gives a much better view of the orb. In the shorter of the two videos you can clearly see how bright red (& pulsing?) the orb was against the night sky. In the longer video, you see the orb drastically change directions a few times."],"Date Submitted":"07/07/2012 06:03 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/40559.html.txt","/var/www/straped/mufon/org/40559.html"],"Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"Unknown","Region":"Washington","Log Number":"US-07072012-0129","Summary":"July 4, 2012 - Monroe, Wa - Red Orb(s) moving North to South","Case Number":"40559","Object Features":"None","Date of the Event":"07/04/2012 10:00 UTC","City":"Monroe","Country":"United States","Source":"MUFON"}