{"Log Number":"US-07072012-0134","Summary":"Burning light that hovered over city then dissapated.","Viewing Distance":"21-100 Feet","City":"Lee's Summit","Weather Factors":"Unknown","Longitude":"-94.36508","Date Submitted":"07/07/2012 07:31 UTC","Date of the Event":"07/04/2012 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.924516,+-94.36508(40565)&iwloc=A&hl=en\"> mufon case (40565) map </A>","files":["/var/www/straped/mufon/html2text/40565.html.txt","/var/www/straped/mufon/org/40565.html"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 52 other sightings in Lee's Summit","There were 2 other sightings in Lee's Summit on or around July 4th 2012"],"Object Shape":"Cylinder, Fireball, Sphere","Tags":"City","Case Number":"40565","Object Features":"Other","Region":"Missouri","Latitude":"38.924516","divs":["Sighting DetailsIt was the 4th of July in Lees Summit, MO and we saw a burning ball of light that almost looked like one of those Chinese lanterns. It hovered and came right to us, within 100 feet then took off in the distance and disappeared. We got into Independence, MO and saw them all over the sky about 5 of them. We stopped at a stop sign and one was hovering over a house and again it was the same thing we seen in Lees Summit, it was a burning ball of fire it looked like with a slight tail behind it. We then drove towards our house and seen yet another in the distance and decided to follow it out of town. As we followed it, it kept getting higher and higher in the sky and started to pulsate light and then disappeared. We then went home and stood out on our back deck with binoculars and seen that the object definatly had a tail, was a burning ball of fire almost, and it looked to have a \"eye\" that was robotic that was looking all around! We watched about 5 more within the hour go west of our house and get higher in the sky, headed north and they would start pulsating and finally burn out high in the sky."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States"}