{"Sighting Duration":"00:04:00","Longitude":"-89.318838","trends":["There has been one other sighting in Perkinston","There were no other sightings in Perkinston on or around July 10th 1995"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/10/1995 09:30 UTC","Latitude":"30.665106","Object Flight Path":"Straight-line path","Case Number":"40563","files":["/var/www/straped/mufon/html2text/40563.html.txt","/var/www/straped/mufon/org/40563.html"],"divs":["Sighting DetailsOn a clear night in the country at my 2 story home, with 2nd story balcony's on both sides of my house. i walked out onto the southern balcony, and saw a cigar shaped huge UFO. it was black and made no sound. it was about 3 to 4 football fields long. at least 100 feet thick. it had windows in the front, the direction it was going and for 4 seconds they lit up from the inside and i could make out figures, human shaped, inside the craft. they had heads and necks. i could make out the outlines of them only. than the light inside the windows went off. it was heading east to west. across my 50 acre property. over the tall pine tress across the pond on the side and behind my home. i had a clear view of it. i was stunned, and watched it fly slow, about 50 or 60 mph, across my property. it made no sound what so ever. and it was totally black. my thoughts were that it was so low and could be seen so easily, who ever or what ever they were, they weren't trying to hide. i know what aircraft are and look like. i am world traveled and have seen all types of military and commercial aircraft. this was a real as it gets. at the time i was watching Tv, and got up to stretch and enjoy the evening sky at night. i had wonderful views from my balconies. i could not have helped but to see this object, it was so huge. when i first saw it, i thought it was maybe, military. they are many military aircraft that fly over southern mississippi. it flew right out of my sight over the trees and across my property. it never changed speed. speed was steady. it was not a blimp. i have seen blimps and they make sound, with there engines. this made no sound at all. and the windows of it were not below it, but in the front of it. in the nose. and it was metal. some kind of metal. i could make out that much."],"Object Shape":"Cigar","Weather Factors":"Unknown","Country":"United States","Date Submitted":"07/07/2012 06:40 UTC","Summary":"i saw a Cigar Shaped UFO 3-4 football fields long, low flying,silent,black","Region":"Mississippi","Source":"MUFON","Disposition":"Unresolved","City":"Perkinston","Object Features":"Window(s)","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.665106,+-89.318838(40563)&iwloc=A&hl=en\"> mufon case (40563) map </A>","Log Number":"US-07072012-0132"}