{"Region":"Colorado","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Log Number":"US-07072012-0131","Object Shape":"Blimp, Other","Latitude":"39.929629","files":["/var/www/straped/mufon/html2text/40561.html.txt","/var/www/straped/mufon/org/40561.html"],"Object Features":"None","Date Submitted":"07/07/2012 06:18 UTC","Case Number":"40561","Tags":"City","City":"Thornton","Longitude":"-104.955076","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Summary":"I was walking my dog and saw a silent, dark, huge, ship shaped like a milano cookie (not really an oval), very slowly moving across the sky as a dark shape against the clouds. It was dusk and it had no lights on it, and made no sound.","trends":["There have been 7 other sightings in Thornton","There were no other sightings in Thornton on or around August 10th 2007"],"divs":["Sighting DetailsI let my dogs out and was standing there while they did their business, and looked up. It was a cloudy evening, and the sun had started to go down, but there was still some light behind the clouds, and I saw a huge, silent, completely dark thing moving across the clouds. It was shaped like a milano cookie; not really an oval, but similar. It made no sound at all, and moved very slowly. I watched it in disbelief for a couple minutes, and it just moved across the sky. Every UFO sighting I ever heard of was an aircraft with lights, but this thing had no lights on it at all, and I wouldn't have even seen it except for the glow behind the clouds. It was just a huge, dark, silent, moving oval-like shaped thing. I doubt this report is any help at all, but all those reports I see on TV had lights on the UFO, and I saw something with no lights, so maybe this is helpful."],"Date of the Event":"08/10/2007 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.929629,+-104.955076(40561)&iwloc=A&hl=en\"> mufon case (40561) map </A>"}