{"Object Features":"None","Disposition":"Unresolved","Latitude":"33.718218","Sighting Duration":"00:15:00","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Date Submitted":"07/07/2012 07:15 UTC","divs":["sighting detailswas walking on my nightly walk down the road.heading easterly.always have on reflective vest and have flashlight. was about at the end of my turnaround, probably a half mile from my house when i saw a orange glowing ball or orb coming out of the north over the small mountains we have here into our valley. it was to the best of my reckoning to be under five hundred feet, maybe less.it didn't pulse or have any exhaust that i could see. it was about halfway or more up from the horizon from being directly overhead of me. when it got above the highway i flashed my flashlight at it. it immediately stopped, started to glow a brighter reddish orange on it's side and was gone like a shot in the direction it came from. the best i can describe it's leaving is that it went so fast it was like it left tracers behind it.i continued my walk not sure what i saw. when i reached my turnaround and continued back towards the house (westerly), i had gone a 1\\4 of the way back , constantly looking behind me, and the object came into view coming from the east(following the highway?) towards me. it didn't seem closer then the first time,just came from another direction.once again i shined my flashlight at it and it went in the exact direction it came from, brightening up to the reddish orange color and gone in a blink.haven't told anyone but my immediate family."],"Case Number":"40564","map":"<A HREF = \"http://maps.google.com/maps?q=33.718218,+-86.346088(40564)&iwloc=A&hl=en\"> mufon case (40564) map </A>","Longitude":"-86.346088","Source":"MUFON","Viewing Distance":"101-500 Feet","Summary":"walking, saw object moving towards highway, shown flashlight on it, it left in direction it came.","Date of the Event":"10/14/2011 10:00 UTC","Weather Factors":"Unknown","Object Shape":"Circle, Sphere","Log Number":"US-07072012-0133","files":["/var/www/straped/mufon/html2text/40564.html.txt","/var/www/straped/mufon/org/40564.html"],"trends":["There have been 2 other sightings in Ashville","There were no other sightings in Ashville on or around October 14th 2011"],"Region":"Alabama","City":"Ashville","Tags":"City"}