{"Case Number":"40576","files":["/var/www/straped/mufon/html2text/40576.html.txt","/var/www/straped/mufon/org/40576.html"],"Date Submitted":"07/07/2012 11:22 UTC","Log Number":"US-07072012-0145","City":"Santa Fe","Longitude":"-105.942566","divs":["Sighting DetailsAt 9:01 PM, I was seated on my sofa, facing west, viewing TV set as well as my macbook screen, when two bright, wide, very white lights very circular appeared in my picture window. These two circular and stable lights were part of some flying vehicle that was headed away from me. There was no sound. My sliding glass doors are both open east and west. As i rose from the sofa and headed to the window, the two circular and steady bright white lights became only one light, as though the one to my right had gone off. Soon after, the direction of the flight began to change by turning left in a curve, very smooth. Then I noticed a typical aircraft blinking red light. As I have a set of condos directly across the street from my own, and the craft descended a bit, I could no longer see what it was doing. This craft seemed to have no engine, and no heat from the lights. Lights I see normally affect the atmosphere and the eye recording them differently than these lights did. I have never seen lights like these. I know that there was no normal sort of propulsion happening with this craft as one observes with jets, airplanes, rockets, etc. I tried to make out details on the material, but, could see only the lights. There was a material body, however, as the clouds in the distance which had darkened against the dusk were blocked out between the lights."],"Disposition":"Unresolved","Country":"United States","Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=35.714908,+-105.942566(40576)&iwloc=A&hl=en\"> mufon case (40576) map </A>","Object Shape":"Other","Object Features":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"35.714908","trends":["There have been 20 other sightings in Santa Fe","There were no other sightings in Santa Fe on or around July 7th 2012"],"Viewing Distance":"101-500 Feet","Summary":"two bright lights at rear of object became visible flying over my condo through my picture window","Date of the Event":"07/07/2012 09:01 UTC","Source":"MUFON","Object Flight Path":"Path with directional change"}