{"Country":"United States","Case Number":"40579","Object Shape":"Unknown","trends":[],"City":"Undisclosed","Date Submitted":"07/08/2012 12:03 UTC","Summary":"This has been ongoing for most of my life","divs":["Sighting DetailsFirst, I never remember seeing a UFO. I didn't even know I was being abducted until 2 days ago. I read some reviews of the book \"Taken\" and some red flags went up for me. I will start with how an abduction usually begins: Usually night but it has happened during the day. I am in bed and I feel a presence in the room (I'm a psychic nothing amazing) then I feel like a heavy wait is on me, I cant move my body but can move my eyes and control my breathing. Then I fall asleep or at times it seems like nothing happened , the feeling just goes away. I only remember bits and pieces like a dream things like being in water I can breath. One afternoon, I remember lying facedown and hearing someone say \"the disease resides at the base of the spine\" but I now think it said device, the device resides at the base of the spine. I felt little tingled at the small of my back, no pain. On another night years later, a presence came into my room and said \" you have no idea what's in store for you tonight\" then it left. During the night I awoke to the worst pain on the left side of my face. I went to the emergency room, was admitted by a nurse but I left before being seen by a doctor. The worst part about this is I know when this is going to happen before they come. But when I get in bed I suddenly don't care! It's like it ok to be taken from my bed for whatever reason. Even as I type this its like there is nothing to worry about. It really makes no sense to me I know I do not want this to happen to me. I feel like a prisoner in the back of my mind I know there is nothing I can do, and I must go. So this has gone on at least since I was in the 6th grade, I'm 30 now. Being a psychic I thought it was a sprit or demon messing with me. This was nothing new, and I always felt I could handle whatever came my way... as a very small child I would follow \"clear people\" around the house. But I never told my family about it. I could also give a description of one face I saw but it is not like anything I have ever seen."],"Object Flight Path":"Undisclosed","Date of the Event":"07/06/2012 12:00 UTC","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/40579.html.txt","/var/www/straped/mufon/org/40579.html"],"Tags":"City","Region":"New Jersey","Sighting Duration":"Undisclosed","Longitude":"-74.401261","map":"<A HREF = \"http://maps.google.com/maps?q=40.064154,+-74.401261(40579)&iwloc=A&hl=en\"> mufon case (40579) map </A>","Disposition":"Unresolved","Object Features":"Undisclosed","Log Number":"US-07082012-0001","Weather Factors":"Unknown","Latitude":"40.064154"}