{"divs":["Sighting DetailsI know it has been several years now since an unexplainable incident occurred that my husband and myself witnessed, but I have decided it's time to finally share what happened with people who will hopefully believe me. One night, in July of 2009 (I'm not sure of the exact date), my husband and I were outside in the front yard of our home. At the time we lived in a home on my husband's employer's ranch. The home we lived in was situated with dense woods in the front and left side of the house, with a horse pasture in our backyard, and a rural street on the right side of the house. The view to the street was obscured with a few trees as we were set a little ways away from the road and the only way to access our home was down a short dirt road. We lived in a very rural town and as you can tell we were isolated from any neighbors. This night in July was hot and still. There was no wind and the sky was completely clear of clouds or rain. I was pregnant at the time and despite the fact the night was very hot, I followed my husband outside to help him place a call on my cell phone to his father who lives in another country. It was about 10 o'clock at night and very dark. I don't recall seeing the moon out that night, so either it was hidden by the trees or its was a moonless night. The only lights that were visible were my porch light and one security light outside right by my house. My husband and I got in touch with his father and as he was talking to his dad, I decided to star gaze and listen to their conversation at the same time. I have always enjoyed star gazing and have never even thought of spotting UFO's until this night. Anyways, I was standing in the middle of our front yard looking up at the sky in the direction on the rural street, and listening very intently to my husband's conversation at the same time. (I was listening intently because the conversation was in Spanish and since my native language is English, I really needed to concentrate in order to understand what was being said.)I was so concentrated on the conversation it took me about 30 seconds to realize that where I had been looking at the night sky was no longer pure blackness marked by little white stars. I blinked several times and upon opening my eyes I realized that there was a huge reddish-orange globe of light hovering in place in the sky, where before there had only been tiny stars. Before I could even process what I was seeing, 10 more lights of the same color and size blinked into existence from pure blackness all around the first light. The lights were about a football field's distance away from us, hovering over the woods on the other side of the rural street and each looked about three times bigger than an average star. At first I had thought they were stars, humungous stars, but stars all the same (I now realize I was in denial and shock). Then I started realizing that stars are not that color and they don't appear all at the same time in a group, nor were they ever that large. The time it took me from realizing that the first light had appeared to understanding that all those lights couldn't be stars was about 20 seconds. At this time I noticed that these 11 or 12 lights were grouped in a tight, uneven circle. The lights weren't just outlining a circle, they were outside the circle also. So there was an uneven circle made of these brilliant reddish-orange lights that were just hovering there in the sky. Then I noticed the lights move apart from each other, still in a circle, but expanding the distance between themselves. I was in complete shock to see them move in this way, and in even more shock when I noticed about five more of these blink into existence in the circle from seemingly complete nothingness. At this point the lights in the center of the circle began circling and twisting around each other. It's hard for me to describe exactly what it looked like, but they were circling and twisting in ways that I realized no air craft could move in. They were moving incredibly fast, making absolutely no sound, despite their closeness to me, and making sharp turns and circles around each other. At that point I was terrified and shouted my husband's name -, who hadn't noticed anything as of yet since he was deep in conversation. I said, \"-, look at those lights right there, Oh my God, those are not normal, I'm scared!\" He looked at them while still talking to his dad and said to me that they were probably from some sort of government experiment and not to be afraid. He is a skeptic, just like I use to be, and since he grew up in a very poor, third world country with little technology, doesn't fully understand that the U.S. doesn't have technology that can move like that. He and I both looked back up at the lights and by now every single light was moving in circles and wiggling around each other, while picking up speed and going faster and faster. At this time I felt an all consuming fear that I can't put into words. I don't consider myself special in any way psychically or spiritually, but I've always trusted my instincts. At that point my intuition was telling me to run as far away as I could get. I felt as though those lights were intelligent and knew I was down there looking up at them. I strongly felt like they were putting on a show for me and that whatever those lights were, were NOT of this world. I felt pure negative energy, every hair on my body stood up and I had goosebumps all over. I remember sobbing and crying out God's name and begging Him in prayer in my head to not let these lights take me. I felt positive that these lights were either alien craft or the aliens themselves and that they were showing themselves to me for a reason. Within that short space of time I went from skeptic to a complete, terrified believer. I ran towards my porch and stood on the steps screaming for my husband to get in the house. He stood there looking at the lights and laughed a little and told me there was nothing to be afraid of and that those lights were just planes, to which I informed him that they were NOT planes, U.S. planes can't move that way. He said he didn't believe in aliens and told his father what was going on because he could hear me screaming and crying over the phone. My husband just sat there looking at the lights like they were a fireworks show or something, and I'm sure he had misgivings about what he was seeing. He later told me that he did think the lights odd, but he was raised to be strong and not show fear to strange types of occurrences. (This incident did affect our relationship, but we have since fixed our problems). Anyways, I ran to my car and locked myself in since I was too afraid to go into the house by myself and I wanted to be close by to make sure my husband was okay and continue watching the lights. I watched the lights for several minutes from my car, and watched as they slowed down and eventually just sat in the sky hovering, before they slowly blinked off one by one until they were gone. The whole experience lasted about 15 minutes start to finish. I have since seen these exact same lights do the exact same thing twice since then. Once outside of my new house where I live now, and the last outside a field on a country road I was driving on. Both took place at night as well as while I was alone. My only regret is being too frightened to take pictures of these incidents since I was terrified out of my mind. I wish I had proof! Nobody in my family believes what I saw, or they think it was secret government planes practicing maneuvers. I've been laughed at for my new interest in UFOs, so I had to share my experience with you to get this weight off my shoulders. Thank you so much for your time, it's greatly appreciated! Yours Sincerely, A New Believer"],"Sighting Duration":"Undisclosed","City":"Keysville","map":"<A HREF = \"http://maps.google.com/maps?q=33.233756,+-82.232344(40587)&iwloc=A&hl=en\"> mufon case (40587) map </A>","Date of the Event":"07/10/2009 12:00 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","trends":["There have been no other sightings in Keysville","This sighting has never been favorited."],"Object Flight Path":"Path with directional change,Path then hovering,Other","Case Number":"40587","Object Shape":"Circle, Fireball, Star-like","Viewing Distance":"101-500 Feet","Date Submitted":"07/08/2012 01:52 UTC","Latitude":"33.233756","files":["/var/www/straped/mufon/html2text/40587.html.txt","/var/www/straped/mufon/org/40587.html"],"Longitude":"-82.232344","Object Features":"None","Summary":"I saw several orbs preforming miraculous feats in the night sky.","Log Number":"US-07082012-0008","Tags":"City","Region":"Georgia"}