{"Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=41.884247,+-84.600377(40585)&iwloc=A&hl=en\"> mufon case (40585) map </A>","Date Submitted":"07/08/2012 01:13 UTC","divs":["Sighting DetailsWas leaving home east of Hillsdale @ 10:30Pm, my pickup truck was outside of the garage and I was taking my dog with me for the ride to the party store. Our neighbor is in the hospital in Ann Arbor, so I glanced at their house to make sure everything was ok, just as I was opening the back of the extended cab to let the dog jump in. I noticed the UFO over their house decending on an appareant steep decending glide. I observed it for approx 10 seconds, and became very alarmed at what was obviously not a normal event. Actually I became quite scared and ran in the house with the dog yelling for everyone to come on our back deck which I thought would give us a pass over or receeding view. From the time I last observed it until the time I was on the back porch with Wife, Daughter and Son in Law was no more than 25 seconds. None of us could see anything, although there were other planes lit up in the horizon. I drew a image of what I saw. While observing I had the strong feeling that it was not normal and since our neighbor is in the hospital in Ann Arbor in grave condition on life support, my very first thought was that she had passed and this was her spirit over her home. I was very excited and this made an impact on me that is hard to describe, I almost think I observed something supernatural, at least highly unusual"],"Summary":"Entering vehicle with dog for run to party store, observed and ran to get other witnesses.","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/40585.html.txt","/var/www/straped/mufon/org/40585.html"],"Latitude":"41.884247","Disposition":"Unresolved","trends":["There have been 4 other sightings in Hillsdale","There were no other sightings in Hillsdale on or around July 7th 2012"],"Date of the Event":"07/07/2012 10:30 UTC","Tags":"City","Longitude":"-84.600377","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Appendage(s), Wings","Object Shape":"Cross, Teardrop, Triangle","Case Number":"40585","City":"Hillsdale","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"US-07082012-0006"}