{"Tags":"City","Country":"United States","Source":"MUFON","Summary":"2 orange glowing orbs in different directions over my house","Object Features":"Undisclosed","Region":"Michigan","Log Number":"US-07082012-0003","City":"Escanaba","Longitude":"-87.06222","Date Submitted":"07/08/2012 12:22 UTC","Date of the Event":"07/07/2012 12:00 UTC","Object Shape":"Fireball","Sighting Duration":"00:03:00","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.754347,+-87.06222(40582)&iwloc=A&hl=en\"> mufon case (40582) map </A>","Case Number":"40582","trends":["There have been 9 other sightings in Escanaba","There was one other sighting in Escanaba on or around July 7th 2012"],"Latitude":"45.754347","divs":["Sighting DetailsWent outside around 11 p.m. to see if I could tell where the noise was coming from. When I got outside I realized the neighbor was shooting off left over fireworks. lame stuff, nothing big. I sat in my lounge chair ouside, nice night out and looked up. I thought it was weird to see 3 airplanes flying west all at the same time at night. I knew they were planes cause of the light pattern and I could kind of hear them. i was puzzled though that 3 planes would be going the same direction a second apart from eachother. I figured they were chemtrail planes and spraying at night to hide their agenda. Just when I could no longer see the planes I happen to catch this weird orb like orange glowing object in the sky goin North to South. didn't seem high up, but it was dark out and couldn't judge it. Of course my first thought is what is the government up to now. then right before that one got out of my sight another orb same exact size, color, shape, speed comes from the east and goes west. Once they were out of my sight I came in turned on my computer...and started looking for info. Seems there are a ton of people reporting the same thing. Very interesting."],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/40582.html.txt","/var/www/straped/mufon/org/40582.html"],"Viewing Distance":"Unknown"}