{"Longitude":"-71.278736","Region":"New Hampshire","Summary":"Orange orb cross night sky followed by a second with path change Tuftonboro NH","files":["/var/www/straped/mufon/html2text/40598.html.txt","/var/www/straped/mufon/org/40598.html"],"Case Number":"40598","Date of the Event":"07/07/2012 12:00 UTC","Object Features":"None","Country":"United States","Date Submitted":"07/08/2012 11:00 UTC","Tags":"City","Viewing Distance":"Unknown","trends":["There have been no other sightings in Tuftonboro","This sighting has never been favorited."],"divs":["Sighting DetailsTuftonboro NH, I saw it first through the trees and I thought \"that's gotta be darn bright to be shining through like that\", we were sitting around a campfire. The light eventually went into a clearing. The orb was bright orange fireball so bright that it gave a star pattern, the first appeared at10:12 and disappeared in the southeast horizon over the lake, total flight across sky about 1.5 minutes, it appeared to be moving quite fast. My Father came and claimed that we (my daughter and mother) were seeing things as it had faded out by that time. About 2 minutes later a second appeared in the same, if not slightly more west, location approximately 10:17 pm. This time my father came out and he immediately asked for binoculars, this was no joke he's ex-Navy. Looking through them it was a circular orb for sure. There was a plane coming from the south and my father said \"look it's going for the plane\" then it stopped went north, then north west and finally disappeared in the southwest horizon leaving the small plane alone. My daughter wants to add that to her it was half orange and half yellow. I want to stress that the entire time there was absolutely no sound at all...."],"Latitude":"43.617333","Log Number":"US-07082012-0015","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.617333,+-71.278736(40598)&iwloc=A&hl=en\"> mufon case (40598) map </A>","City":"Tuftonboro"}