{"Disposition":"Unresolved","Case Number":"40606","Date Submitted":"07/08/2012 02:55 UTC","Date of the Event":"07/07/2012 09:00 UTC","Country":"United States","City":"Watsonville","trends":["There have been 4 other sightings in Watsonville","There was one other sighting in Watsonville on or around July 7th 2012"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.937893,+-121.87186(40606)&iwloc=A&hl=en\"> mufon case (40606) map </A>","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/40606.html.txt","/var/www/straped/mufon/org/40606.html"],"Object Features":"Undisclosed","Object Shape":"Fireball","divs":["Sighting DetailsHusband and I arrived home at 9 pm, he gets out of car and points \"Look, look!\" I turn and over the roof of our house we see 4 or 5 red lights, the lead light brighter than the rest and looks to be traveling at different altitudes. At first I thought they were flares or fireworks, but they traveled rather quickly with a slight back and forth or sinusoidal movement, no sound at all (and it's very quiet at our house). There was some marine layer cover, not sure how low, but the lights were clearly visible and lit the clouds. They traveled from south to north, we watched them for about 2 minutes and when they were directly overhead they began to move together and ascend out of sight, one at a time, with the lead and brightest light disappearing last. Obviously throughout this sighting husband and I are asking \"What are they?\" Neither of us has ever seen anything quite like this before. They did not drop like flares and did not drop any phosphorous material. The movement just before they ascended and disappeared was in keeping with flare movement. The lights did not blink, as one would expect from a plane or other aeronautical device."],"Region":"California","Latitude":"36.937893","Object Flight Path":"Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Log Number":"US-07082012-0023","Longitude":"-121.87186","Summary":"4-5 red unblinking lights traveling north, loose formation, moved together ascended out of sight"}