{"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.069748,+-81.785161(40604)&iwloc=A&hl=en\"> mufon case (40604) map </A>","trends":["There have been 2 other sightings in Auburndale","There were no other sightings in Auburndale on or around July 12th 1966"],"Sighting Duration":"Undisclosed","City":"Auburndale","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"07/08/2012 02:46 UTC","Case Number":"40604","Object Flight Path":"Hovering then path","Log Number":"US-07082012-0021","files":["/var/www/straped/mufon/html2text/40604.html.txt","/var/www/straped/mufon/org/40604.html"],"Object Shape":"Circle, Sphere","divs":["Sighting DetailsI was at my friend's house on a 5 mile lake with 3 other 14 year-old friends. This bright light came through the cracks of the window shutters inside the bedroom. The other girl noticed it first. Her brother said that it couldn't be their mom because she worked till 10 o'clock,(another hour away). We noticed that the light became brighter, and closer to the house as if it were coming down the dead end lane. they lived at the end of a lane along a 5 mile long lake. it was maybe a mile or less wide. He opened the shutters, and there in front of us was a ball of light that had red and blue lights rotating around the middle of the object. they flashed on and off as they rotated. We stood there together side by side, all 4 of us for an undetermined time. It seemed like a minute, but it seemed longer too. The window was big enough to fit all 4 of us, and to allow us to equally see the object. It was silent. we were all dumbfounded, and stared at it, not moving, not screaming, no-one was afraid. It then moved up, over the house; so we ran down the stairs and through the sliding glass doors that were already open. that probably took us 10-15 seconds to do. their backyard was on the lake shore, so we stood next to the water and watched it in a standstill position across the 5 mile lake, and way up in the sky. It was so small that it looked like an over-sized star. No more could you see the red and blue lights. It sat stationary for about 4-5 minutes, when it moved straight up quite slowly for another minute; and then zoomed to the northwest until it disappeared. This action took less than 4 seconds. There was never a sound made by the object. We immediately called the police station and they blew us off, saying it was a weather balloon and so did our parents. I moved to southern Fla. after that, and all was forgotten until a friend turned me on to tapes of other UFO sightings. I would like to be hypnotized to see how accurate my memory is, to which i think I haven't left anything out, or to see if we were in fact, abducted. I've heard that some people that have seen them, were abducted, but don't remember. Oh, and none of us had a clue what it was, because we hadn't heard of UFO's. Our parents had, but they didn't believe they existed."],"Tags":"City","Viewing Distance":"20 Feet or Less","Latitude":"28.069748","Longitude":"-81.785161","Summary":"4 14 year-olds observed a bright light through a bedroom window . upon curiosity, opened shutters to see a round ball of blinding light that had red and blue flashing lights around the middle of the object. after time, it went up over the house, and to t","Object Features":"None","Source":"MUFON","Date of the Event":"07/12/1966 12:00 UTC","Country":"United States"}