{"Country":"United States","divs":["Sighting DetailsWe were sitting on the beach facing South watching the waves. The sun had just set and was covered by clouds. We had been watching a fireworks show about 2 miles to our west. during the show a small lightning storm had formed over the ocean. The firewors ended and light rain had started. I faced east looking at a few camp fires down the beach. when I noticed some objects glowing orange appear to come around montauk point. They flew out over the ocean and one by one dissapeared. I thought it was strange but said nothing. Then appeared 3 more but flying in a formation so I told my girlfriend to check out the lights flying in formation. We watched for a minute, then they seperated and dissapeared over the ocean. not slowly, but they were just gone. we both were like whoa. more came from around the point. and proceded to do the same kind of actions I was not really thinking ufos until they formed a triangle and a fourth one appeared way to our left.(north) and joined them and dissapeared as well. this went on for 20 mins or so. the lights mostly started low in the sky and gained height before dissappearing. There was noise in the area, random fireworks and thunder rumbles as well as ocean noise and people talking, but I heard no man made craft noises. I had a small digital camera wth me and I tried to shoot video and stills of the lights, but the camera was new and it was so dark that I really could not see the function buttons. I did get some video but it is a bit shakey and none of the stills came out.(I have not imported it yet).. So now I get frustrated and it starts pouring rain. So I suggest we go to our hotel room and set the camera right and then go to montauk point about 6 miles away and see if we can get closer to these lights. My girfriend was exited and nervous along the way and was actually scared about abduction. We got to camp hero in Montauk point and it was pitch black. Not one light in the sky. There where 10 to 15 fishing? boats in the area off the point. I would assume they would have also seen something. We then went back west about 4 miles to see if we could spot the lights again but they did not reappear and it was raining too hard. I am not looking for anyhing and have no reason to lie. We are both professionals and educated. I am a pro cameraman who works for a major news organization. Wish I had my pro gear on vacation with me. I am also an avid fisherman who has spent countless hours looking at the sky at night. I have watched satellites and the glow of the sun off the sides of planes, plenty of helicopters with varying light schemes too but this was very very odd. I have no problem talking with an investigator if you find that warrented. Thank You."],"Weather Factors":"Unknown","trends":["There have been 4 other sightings in Montauk","There were no other sightings in Montauk on or around July 7th 2012"],"Object Features":"Unknown","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.043935,+-71.952515(40601)&iwloc=A&hl=en\"> mufon case (40601) map </A>","Date of the Event":"07/07/2012 12:00 UTC","Case Number":"40601","Summary":"My Girlfriend and I where sitting on the beach from sunset till after dark.We witnessed 15-20 orange objects fly from MTK point to over the ocean and dissapear.","Date Submitted":"07/08/2012 12:07 UTC","Sighting Duration":"Undisclosed","Log Number":"US-07082012-0018","Region":"New York","Tags":"City","Longitude":"-71.952515","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/40601.html.txt","/var/www/straped/mufon/org/40601.html"],"Latitude":"41.043935","Disposition":"Unresolved","Viewing Distance":"Over One Mile","City":"Montauk","Source":"MUFON"}