{"Object Flight Path":"Path then hovering","Object Features":"Undisclosed","Object Shape":"Circle, Disc, Oval","Country":"United States","files":["/var/www/straped/mufon/html2text/40619.html.txt","/var/www/straped/mufon/more/40619_submitter_file1__20120708IMG0524.jpg","/var/www/straped/mufon/more/40619_submitter_file2__20120708IMG0551.jpg","/var/www/straped/mufon/more/40619_submitter_file3__20120708IMG0541.jpg","/var/www/straped/mufon/more/40619_submitter_file4__20120708IMG0726.jpg","/var/www/straped/mufon/more/40619_submitter_file5__20120708IMG0525.jpg","/var/www/straped/mufon/org/40619.html"],"Sighting Duration":"Undisclosed","Longitude":"-118.447307","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"07/08/2012 07:10 UTC","Date Submitted":"07/08/2012 11:46 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsWe were sitting outside on the front lawn when my sister looked up and saw a rotating object in the sky that seemed to be falling. She called my name and said \"Look, is that a plane falling?\" I then looked at it and became a bit nervous about it because it seemed to be falling. I ran inside to get everyone else's attention. When my husband came out with his camera we saw a second similar object. The first one began to go higher in the sky towards the mountains. The second object followed the same pattern like the first one, stopping, rotating, and then ascending in the same direction as the other. A third object much longer looking but duller in whiteness zoomed in the same direction as the first object. It was too fast to be captured on camera. After approximately 15 to 20 minutes, the two objects seemed to become closer to each other but never did they intercept. We even called our neighbor to witness it and she too was amazed by the sight. The feeling of witnessing these foreign objects was exciting and a bit nerve rattling at the same time. The objects just kind of seemed to disappear into the sky... maybe because of the distance of the objects. We had never witnessed something that left us questioning its truth like these three objects we saw this evening."],"City":"Los Angeles","Summary":"What was that?","Region":"California","trends":["There have been 404 other sightings in Los Angeles","There were 3 other sightings in Los Angeles on or around July 8th 2012","This sighting has been favorited 1 time.",""],"Source":"MUFON","Log Number":"US-07082012-0035","map":"<A HREF = \"http://maps.google.com/maps?q=34.310528,+-118.447307(40619)&iwloc=A&hl=en\"> mufon case (40619) map </A>","Tags":"City","Latitude":"34.310528","Case Number":"40619"}