{"Object Features":"Patterned Surface, Wings","City":"Undisclosed","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI am sketchy about the actual dates because at the time I was a kid. But it has always been on my mind and I remember it so clearly. My dad & I were driving back from Brinkley Ar late at night on interstate 40 toward Little Rock. It was around 8:45 or 9pm. My dad looked out in the night sky and said, \"Hey, look at that bright star!\" We drove a little bit further he looked again & said, \"It must be a shooting star. Make a wish.\" It caught his eye again because usually a shooting star will go out eventually. But this one didn't. I asked my dad, \"What do you thik it could be?\" He said maybe it's a search helicopter. It seemed to be moving in a zig zag pattern. So we kept on driving down the road & the light kept getting stronger and closer. And eventhough we were moving too it seemed to be moving with us. We kept watch on it and when it came really close my dad pulled off the road onto the shoulder. We stayed in the truck until it was about to fly over us then we both got out. About the time it was flying over I looked over at the road to see the other drivers. I wanted to see if anyone else was seeing what we were seeing. When I looked over at the other cars most everyone was stopped even in the middle of the interstate. Even some big rig trucks were stoped. All looking up at what we were looking at. I looked back up and it started to fly over us. It was so BIG I couldn't even describe it's size. It was huge. It had a pointed nose, wings and fire coming out the back. The fire was like that of a space ship. It was the same shape too, round and tube like. The ship was a flat black with no reflection on it. It looked like a stealth bomer. The wierdest thing I remember about it, ther was no sound. It was calm and quiet. You would think a ship that size and with rocket like fule coming out of the back of it it would be extremely loud. But it wasn't. It seemed to move very slow as if it were gliding though the air. We had pulled over right by a row of power lines and it just continued to decend slowly over those power lines until it was out of sight. I was never scared and almost in a calm state. I should have been in a panic, but no I was accepting of what was happening & wathcing it disappear. We got back in the truck talked about it for a minute then drove away. It didn't seem like anyone on the interstate that night said anything to each other or even paid attention to each other. We all just calmly accepted it and went on our way. When we arrived home my mother was watching the news and we began to tell her about what had happened. I don't think at first she believed us until they started to do a news segment on it. We all listened and the news reported that it was a fragment of a satelite that was falling to earth. They also said it landed in Romance AR. And that was all that was ever reported about it that I know of."],"Region":"Arkansas","Disposition":"Unresolved","Tags":"City","Summary":"dark stelth plane looking object with no sound flew over I40 in AR","Case Number":"40610","Longitude":"-91.825013","Viewing Distance":"21-100 Feet","Object Shape":"Triangle","trends":[],"Date of the Event":"06/06/1987 12:00 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/40610.html.txt","/var/www/straped/mufon/org/40610.html"],"Country":"United States","Log Number":"US-07082012-0026","Date Submitted":"07/08/2012 06:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.20831,+-91.825013(40610)&iwloc=A&hl=en\"> mufon case (40610) map </A>","Weather Factors":"Unknown","Latitude":"35.20831"}