{"Summary":"silver ovoid craft spotted over city on the Canadian side (North Shore) of Lake Erie","Date Submitted":"07/09/2012 11:01 UTC","Date of the Event":"07/08/2012 07:05 UTC","Object Features":"Undisclosed","City":"Chatham-Kent","Object Flight Path":"Hovering then path","Country":"Canada","Disposition":"Unresolved","Region":"Ontario","Case Number":"40627","Object Shape":"Disc, Oval","Viewing Distance":"Over One Mile","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"CA-07092012-0008","Latitude":"42.419217","files":["/var/www/straped/mufon/html2text/40627.html.txt","/var/www/straped/mufon/org/40627.html"],"divs":["Sighting DetailsOn Sunday July 8 2012 at 7:05EST my husband and I witnessed a silver coloured oviod shaped object in the skys above Chatham, Ontario Canada. We had happened to be watching the little pair of Red Tailed Hawks battle off the Turkey Vultures in our neighbourhood. That is what had our attention trained on the skys. All of a sudden we both spotted the object hovering in the sky. It appeared to be reflecting a silver colour and was ovoid in shape. Silent and no lights blinking. It was very high in the sky. As high as the plane appeared to be. There was also a commerical airliner (that was leaving a vapour trail) behind the object in the sky. My husband and I watched the oval shaped object hover in the sky for at least a minute once we had seen it. Once the jet seemed to cross behind it, it (ufo) began to move RAPIDLY (neither of us have ever seen anything manmade move that fast) in a southwestern direction. We both could not believe what we had just saw. I have seen things in the evening sky that may be questionalbe, but this is the first time I have seen a daytime object that strange. We are only 30 miles from the Northern shores of Lake Erie, that in the past has seen its share of strange UFO activity on the lake. Just curious if anyone in the area spotted this activity as well. Thanks"],"Tags":"City","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Chatham-Kent","There were no other sightings in Chatham-Kent on or around July 8th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.419217,+-82.202275(40627)&iwloc=A&hl=en\"> mufon case (40627) map </A>","Longitude":"-82.202275"}