{"Date Submitted":"07/09/2012 12:18 UTC","Weather Factors":"Unknown","City":"Scranton","divs":["Sighting DetailsI was sitting on the front porch at my workplace (which is a single family home) on a cool clear evening around 9:30 pm when I observed a green light move rapidly across the telephone lines on the opposite side of the street, about 100 feet away and 30 feet up the pole. Thinking it was just a plane's lights, I waited in vain for it to pass by. I heard no engine and saw no light for a few minutes, then the light passed over a nearby tree. The light was approximately 20 feet across in diameter, large enough to light up the whole treetop which was fully grown, similar to a helicopter search light (but dark green). It moved quickly, passing over the tree as if searching for something. I saw no object at all, and heard no sound. The light was gone as quickly as it came. About 5 minutes passed, then I saw it again, the same large green light, over another tree further away, approximately 200 feet from me. The light covered the entire treetop, and appeared to be about 20 feet in diameter as it passed over the tree as if looking for something. It disappeared again and then lit up a different tree on a side street further away, before it vanished for good. I sat there confused as to what I had seen because there was no helicopter or plane sound at all. I still wonder what cast that light? I researched this sighting online, and found a similar sighting from August 2010 in nearby Duryea, Pa., affecting a woman in her car. Sounded very similar to what I saw."],"files":["/var/www/straped/mufon/html2text/40632.html.txt","/var/www/straped/mufon/org/40632.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.394979,+-75.647606(40632)&iwloc=A&hl=en\"> mufon case (40632) map </A>","Source":"MUFON","Tags":"City","Viewing Distance":"101-500 Feet","Object Flight Path":"N/A","Log Number":"US-07092012-0013","Sighting Duration":"Undisclosed","trends":["There have been 28 other sightings in Scranton","There were no other sightings in Scranton on or around May 25th 2012"],"Region":"Pennsylvania","Country":"United States","Object Shape":"Unknown","Latitude":"41.394979","Disposition":"Unresolved","Summary":"Saw green lights similar to a helicopter searchlight moving across treetops","Date of the Event":"05/25/2012 09:30 UTC","Case Number":"40632","Longitude":"-75.647606"}