{"trends":["There have been no other sightings in Williamston","This sighting has never been favorited."],"Object Features":"Unknown","Case Number":"40638","Date Submitted":"07/09/2012 06:04 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/40638.html.txt","/var/www/straped/mufon/org/40638.html"],"Object Shape":"Disc, Egg, Oval","City":"Williamston","map":"<A HREF = \"http://maps.google.com/maps?q=35.854604,+-77.055511(40638)&iwloc=A&hl=en\"> mufon case (40638) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"observed odd object in sky for about 3 mins. Hovered, then shot off in a diagonal manner","Source":"MUFON","Object Flight Path":"Hovering then path","Date of the Event":"07/09/2012 12:00 UTC","Longitude":"-77.055511","Country":"United States","divs":["Sighting DetailsWhile at work, a coworker and I stepped outside to talk for a minute. We then noticed a rather large, metallic object that a looked like it was hovering above the field just adjacent to us. It was hard to judge the distance but we don't think it was very high, maybe 1k feet or so and to the best of our ability wed judged the size to be somewhere in the neighborhood of 50 to 60 feet in diameter. It just hovered there. We watched it for a few minutes freaked out as to what is could be. Ive seen crop dusters in the area for years, and the helicopters that fly in and out of the hospital and this was nothing like that. While we watched it it made no sound at all, absolutely none. Then spontaneously the object darted off. It didn't travel horizontally very fast at all rather it accelerated vertically extremely quickly. It was gone within a few seconds. I have no idea what I saw today and have spent the past hour or so searching the internet looking at pics and for information. That is how I happened across this site. Whatever it was, it was worth reporting"],"Sighting Duration":"Undisclosed","Region":"North Carolina","Latitude":"35.854604","Weather Factors":"Unknown","Log Number":"US-07092012-0019","Disposition":"Unresolved"}