{"Summary":"Bright missle shaped with black band in middle","Log Number":"US-07092012-0015","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Object Shape":"Bullet, Missile","Viewing Distance":"Unknown","City":"Tulsa","Country":"United States","Date Submitted":"07/09/2012 01:19 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.141695,+-95.845333(40634)&iwloc=A&hl=en\"> mufon case (40634) map </A>","Case Number":"40634","Latitude":"36.141695","Weather Factors":"Unknown","Object Features":"Other","Longitude":"-95.845333","Region":"Oklahoma","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/40634.html.txt","/var/www/straped/mufon/org/40634.html"],"Date of the Event":"07/08/2012 06:45 UTC","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around July 8th 2012"],"divs":["Sighting DetailsI was standing on my back deck, which faces south, and was observing the color of the clouds reflecting the sun. I am always watching the sky because of the multiple UFO sightings I've had in my lifetime. While looking straight up I noticed a very bright, reflective object with a black band in its mid-section traveling from north to south directly over our house. It was below the clouds at this time (there were different levels of clouds at this time). At first glance I thought it was a jet liner but then realized that it was to low and did not have wings (that were visible). It didn't match up at all with the thousands of jet planes I've seen while watching the skies. I heard no noise being produced. It kept a fixed speed as far as I could tell and never changed course while in my view. At this time I was excited as this was the most detailed UFO sighting by me. Its outline was crisp and the black band was pitch black and the bright white surface I compare to a military luminary flare (I'm an army veteran). My 18 year old daughter came home at this moment and I called her outside and she witnessed about the last 15 seconds of its appearance until it disappeared into thick clouds. I estimate it disappeared into the clouds about 30-40 degrees above the southern horizon. Just 1-2 hours before the sighting I had watched the video of the UFO with the black band over Germany. I immediately grabbed my laptop and showed my daughter the video I had just watched and we were both in agreeance that what we had witnessed was very similar to the internet video. I've found other videos today which are very similar to what we seen. Sadly, I do not own a photo or video camera to document my sightings but they are so common to me now that I kind of expect to see one on a semi regular basis."]}