{"Log Number":"US-07092012-0018","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","Case Number":"40637","Date of the Event":"07/03/2012 08:30 UTC","Latitude":"41.546977","Date Submitted":"07/09/2012 04:47 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/40637.html.txt","/var/www/straped/mufon/org/40637.html"],"Disposition":"Unresolved","Region":"Connecticut","Longitude":"-72.804607","Country":"United States","Object Shape":"Sphere","City":"Meriden","Tags":"City","trends":["There have been 7 other sightings in Meriden","There were no other sightings in Meriden on or around July 3rd 2012"],"Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Summary":"The Object that I saw was orange red it appeared to be sperical in nature but it also seemed solid I saw an outline but could not make it out.","Sighting Duration":"00:03:30","map":"<A HREF = \"http://maps.google.com/maps?q=41.546977,+-72.804607(40637)&iwloc=A&hl=en\"> mufon case (40637) map </A>","divs":["Sighting DetailsMe and three other passengers were driving down I 691 west at approximately 8:30 p.m. on Jul 3rd 2012. Ironically we were having a conversation about the movie independence day and ufo's I turned to the left facing I 691 east and strangely enough I observed an orange red object that appeared to be a sphere I could not make out the exact shape but it was def not a conventional aircraft I see all kinds of planes and aircraft flying around and I've been on a couple military bases so I know how to distinguish most things in the sky besides natural phenomenon I'm knowledgeable on ufo's and know one when I see it. It started off hovering over the east side of the highway I was on the west side. After I observed the object I turned to the passenger next to me and said what is that light. As soon as the driver saw it he freaked out and started yelling at that point it was traveling over the east side over our car and it hovered for a few seconds at a low altitude probably 500-700ft it then traveled across the highway towards hubbard park the object basically flew east a few seconds than went across the highway over our car (west side) than hovered off the highway I lost the object after we passed exit 3 on 691 east. We deduced that it was not a meteorite (that was my very first conjecture as I am a little more serious than the passengers they wanted to assume it was a ufo I tried to deduce it down to something logical but could not and this even alarmed me I have other ufo events I would like to discuss with an investigator in private but do not wish to disclose them here you can contact me anytime on the house line"]}