{"Region":"Utah","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Case Number":"40635","Source":"MUFON","files":["/var/www/straped/mufon/html2text/40635.html.txt","/var/www/straped/mufon/more/40635_submitter_file1__RoundSphereUFO.jpg","/var/www/straped/mufon/more/40635_submitter_file2__RoundOrangeSphere.jpg","/var/www/straped/mufon/more/40635_submitter_file3__OrangeStarlikeobjectpassingoverheadatabout1800to2000feetAGLCopy.jpg","/var/www/straped/mufon/org/40635.html"],"City":"Salt Lake City","Longitude":"-111.979284","Date Submitted":"07/09/2012 03:13 UTC","Summary":"Two Orange Spheres seen within 10 minutes apart. First one disappeared","Disposition":"Unresolved","divs":["Sighting DetailsI was outside with my 23 year old nephew. We were sitting on the steps in front of my place. We both had 10x50 binoculars mounted on tripods. We were sky watching. At about 10:30 pm, I spot a glow round sphere moving north. It is moving away from us. It just seemed to appear....it glowed bright orange. It seemed to be accelerating. It went for about a mile northward and dimmed and disappeared. It was probably about 4,000 feet in altitude. It was about 4 or 5 miles away from us. The second one came alone about 10:42 pm. It was almost straight above us when we saw it. It was moving very slow when we first saw it. It had a slight orange white glow to it. It was up higher than the first one. This one was at about 8,000 ft in attitude. Within seconds of me getting it in view with my binoculars....... it speed up and continued to speed up for a few moments. It wasn't an instantly fast acceleration, but it got up to a very fast rate within a short distance. It was impressive. Then it seemed to maintain this speed. It disappeared over the horizon. We saw this object for over a minute, but less than two minutes. This object moved in a straight line path and went north northeast. Neither of these objects had any blinking light, no FFA marker lights. They glowed brightly, a solid steady light. No sound was heard. We have both seen these types of objects a few times and some were much closer than the two we observed on this night."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.663899,+-111.979284(40635)&iwloc=A&hl=en\"> mufon case (40635) map </A>","Object Flight Path":"Straight-line path","Latitude":"40.663899","Country":"United States","Tags":"City","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around July 8th 2012","This sighting has never been favorited.",""],"Date of the Event":"07/08/2012 10:40 UTC","Log Number":"US-07092012-0016","Weather Factors":"Unknown","Object Features":"Unknown"}