{"Date of the Event":"07/08/2012 09:30 UTC","Longitude":"-83.948117","Region":"Michigan","Log Number":"US-07092012-0020","Tags":"City","City":"Saginaw","files":["/var/www/straped/mufon/html2text/40639.html.txt","/var/www/straped/mufon/org/40639.html"],"Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsIt was 7-8-2012. I went outside at about 9:30 pm to take out the trash.I was with a friend. we stayed out there and talked for about 5 minutes and when we were about to go inside, he looked up, and seen something. we thought it was a shooting star, so we made wishes. but then, it did a 180 degree turn, and flew slowly over by the stars, and got dimmer until it faded away. so we talked about it, and looked around the sky. we seen about 5 more of those. they looked like stars, but seemed to be intelligently flying. we must have seen about 6 planes fly in the same direction over the span of 10 minutes, so we figured they know something is going on. we were laying on the blacktop driveway, looking at the stars. I remember seeing an abnormal amount of triangle shaped constellations, they were all perfect triangles. we noticed every time we seen one of those things, it faded away into a triangle constellation. after about 10 minutes of seeing nothing, a bright white light shot by , fast , and it left no trail. It was small compared to the sky, it only looked a few meters long. But from the ground it will look smaller. so after that, we freaked out. we were talking about it as even more planes flew by, and we kept seeing those things , they looked like stars, and kept fading away into the triangle constellations. Then we seen one, we were watching it fly by, then we seen a bright white light flash, and it was gone. that was the last time we seen the bright light. It only felt like an hour, but it was late, so he was going to go home.But then we seen ANOTHER one. so we watched it. to our amazement it stopped dead in its tracks along the outline of a triangle constellation.He could not see it anymore, but I could, I tried to point it out to him but he could not find it, so he watched my reaction to what I seen. It was hovering there, moving a tiny bit around. then, I flipped out. I saw a black shadow looking think shoot out of it at super speed. the another, and another. I was freaking out then. Another plane passed and the reddish think faded away before the plane passed it. then it re-appeared! It was amazing! then, it took of fast as light. and my friend left and i went inside. It was the weirdest thing iv'e seen in my life.We are going to look again tonight."],"Object Shape":"Cigar, Sphere, Star-like, Triangle","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.42444,+-83.948117(40639)&iwloc=A&hl=en\"> mufon case (40639) map </A>","Sighting Duration":"Undisclosed","Object Features":"Other","Source":"MUFON","Summary":"Alot of things me and my friend both seen.this was on 7-8-2012","Date Submitted":"07/09/2012 07:01 UTC","trends":["There have been 20 other sightings in Saginaw","There were no other sightings in Saginaw on or around July 8th 2012"],"Country":"United States","Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"43.42444","Case Number":"40639"}