{"City":"Stevenage","Object Shape":"Unknown","Date of the Event":"10/31/1977 12:00 UTC","Source":"MUFON","trends":["There have been no other sightings in Stevenage","This sighting has never been favorited."],"divs":["Sighting DetailsI was aged 11 at the time and out in the street outside my friend's house. I remember the date because it was my parents' wedding anniversary. My brother and I had gone out so they could have a meal together at home. The road to my friend's house curved upwards, south and east and then levelled out facing east. As I reached the top of the hill and looked own the street I could see 3 red lights in the sky. They were spread out and appeared to be some distance away. The sky was completely clear and the lights were totally stationary. I pointed them out to my brother. I knocked on my friend's door and told him to come outside. His brother also came out. While we were looking at these lights they very rapidly changed formation, moving in an anti-clockwise direction from my perspective. having moved very quickly they stopped immediately and then remained stationary for 2-3 minutes. The lights were not flickering and there was nothing else in the sky. We were all very excited by this. The lights continued to change positions, sometimes extremely quickly and other times more slowly. Their proximity to each other was not regular and they formed larger or smaller triangular shapes. To the best of my knowledge, the land in that direction was largely agricultural. We watched this for about half an hour until we (unbelievably now!) got a bit bored of watching it. I seem to remember seeing a small article in the local newspaper the following week, reporting on a sighting by a policemen of a red light in the sky over a village to the east of Stevenage. I was only 11 but these were not aircraft. I didn't bother telling any adults given that it was Halloween. All 4 of us saw it. I don't know if the others remember it."],"Country":"United Kingdom","Log Number":"GB-07092012-0014","Latitude":"51.903761","Case Number":"40633","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.903761,+-0.196612(40633)&iwloc=A&hl=en\"> mufon case (40633) map </A>","files":["/var/www/straped/mufon/html2text/40633.html.txt","/var/www/straped/mufon/org/40633.html"],"Summary":"3 red lights changing positions VERY fast in triangular formation","Viewing Distance":"Over One Mile","Longitude":"-0.196612","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"07/09/2012 01:05 UTC","Object Flight Path":"Path with directional change","Region":"England","Weather Factors":"Unknown"}