{"Region":"Indiana","Log Number":"US-07102012-0004","City":"Vincennes","Tags":"City","Longitude":"-87.538713","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path","Object Shape":"Triangle","Date Submitted":"07/10/2012 01:56 UTC","divs":["Sighting DetailsI was outside to enjoy the cool moist air after the record breaking heatwave just days earlier, also having alot of family issues on my mind, so I decided to go outside and enjoy the fresh air and peace and quiet. I was looking at the Moon rising in the east but noticed a yellow-white light behind a tree next to our road to my northeast. I pulled out my cell phone from my pocket to look at the time, that way I would know what time it was when I first noticed the object just in case it turns out to be an unknown object. I watched the light closely, at first it seemed stationary, but after about a minute it gradually started to move in a southwesterly direction. I went to my truck to grab my camera but I forgot that I brought it inside with me earlier. I turned on the camera on my cell phone and zoomed in as close as I could. I couldn't see the object on the screen, but I went ahead and took a picture of it anyway for further research on here. As it got directly in line with the Moon (just above the Moon) I could see a red blinking light underneath as well as a bright white light on the front, the back there was another white light, as it got to my southeast I noticed another white light, where I could see the lights were in a triangular formation. There was no sound that I could hear other than the traffic noise since I live less than a quarter mile from highway 41 and a CSX railroad crossing. At 1:18 AM 10 minutes after I first noticed the object, it moved to my south and disappeared in a bank of clouds, and never regained visual on it. I took a total of 8 photo's of this thing, neither of them turned out, but I am hoping further research might reveal what this object really was for sure. I will need to figure out how to upload photo's to this site with my cell phone because it's a replacement for my other one that I broke about a month ago."],"files":["/var/www/straped/mufon/html2text/40652.html.txt","/var/www/straped/mufon/org/40652.html"],"trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around July 10th 2012"],"Weather Factors":"Unknown","Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.597274,+-87.538713(40652)&iwloc=A&hl=en\"> mufon case (40652) map </A>","Case Number":"40652","Summary":"Triangular object moving towards Mount Carmel, IL","Country":"United States","Latitude":"38.597274","Sighting Duration":"00:10:00","Date of the Event":"07/10/2012 01:08 UTC","Viewing Distance":"Over One Mile"}