{"Weather Factors":"Unknown","Sighting Duration":"00:12:00","Object Flight Path":"Straight-line path","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/40651.html.txt","/var/www/straped/mufon/org/40651.html"],"divs":["Sighting DetailsOn July 1st at my girlfriend and I were watching a few distant fireworks when we noticed a flying orange orb to the right of us. At first we belived it was a firework but when it did not alter shape, color or trajectory we dismissed that theory. It flew in a straight line across the sky smoothly. Its appearance did not alter at all We were not scared of it but were more curious of what it was. We watched it for several minutes and then were distracted by more fireworks. When we looked back it was gone. a couple of minutes latter another orb appeared to our left. It looked excatly the same and appeared to be following the same flight pattern. We watched this one for a while till it slowly faded away. On July 4th my sister and her husband were observing fireworks when they noticed a orange orb flying through the sky. After observing it for many minutes it faded out. Several minutes latter they noticed another identical orb and observed it for a similar amount of time till that one too faded out. She only told me about this about an hour ago so when she descirbed the orbs in the almost exact way that I observed them I was shocked. None of us has observed the orbs again."],"Tags":"City","Region":"Michigan","Latitude":"43.123727","Date of the Event":"07/01/2012 10:00 UTC","Summary":"Flying Orange orb travrling straight acrosse sky. Faded out and latter another identical orb appeared on the opposite side of the sky and traveled the same straight path.","Source":"MUFON","Object Features":"None","Date Submitted":"07/10/2012 12:54 UTC","trends":["There have been 6 other sightings in Rockford","There was one other sighting in Rockford on or around July 1st 2012"],"Longitude":"-85.553132","Disposition":"Unresolved","Log Number":"US-07102012-0004","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.123727,+-85.553132(40651)&iwloc=A&hl=en\"> mufon case (40651) map </A>","City":"Rockford","Case Number":"40651"}