{"Case Number":"40654","Source":"MUFON","Longitude":"-99.329824","files":["/var/www/straped/mufon/html2text/40654.html.txt","/var/www/straped/mufon/org/40654.html"],"Date Submitted":"07/10/2012 02:24 UTC","Summary":"Sighted flying saucer as it came to hover about 1000 ft. away.","Country":"United States","Date of the Event":"10/15/1954 07:40 UTC","Object Shape":"Disc","Region":"Oklahoma","trends":["There have been 3 other sightings in Altus","There were no other sightings in Altus on or around October 15th 1954"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.646605,+-99.329824(40654)&iwloc=A&hl=en\"> mufon case (40654) map </A>","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsI was just a child going to school on a bicycle in Altus, Okla. heading south just at intersection before school. I saw the saucer come in very fast and come to an abrupt hover, about 400 to 500 ft. above ground. The traffic cop who was directing traffic at the intersection that morning saw cars stop next to me and the people got out and were staring up at the saucer as I was and the officer turned and watched too. Everyone around was looking up at it as it hovered, then panels of windows appeared around the center of the disc and human form persons were looking out. This lasted about 20 to 30 seconds and then the panels became opoaque again and then the saucer moved westward at an astonishing speed without sound and did a 90 degree turn south and went out of sight in that direction. A few seconds later it returned to the same spot it had left and came to a hover again. It only hovered there about 15 seconds more before it moved west at a high rate of speed and suddenly went straight up and disappeared at an astonishing rare of speed. Then an F-86 jet fighter left the nearby air force base and went westward as if to look for the object. The air force meteorologists said it was a reflection of light from one of the shiny new B-47's at the base shining on a cloud of moisture above the town. It was clear as a bell that morning and not a cloud of anything in the sky. Nothing was ever mentioned about it again. My father was in the US Air Force at the time and in 1959 revealed to me that he was in the crew of the first airplane to arrive on the scene of the Roswell crash and gave me details on the clean-up there and that he was the one that gave the weather balloon to the commander of Carswell AFB and helped him concoct the story the government wanted to cover it up. My father told me not to tell anyone of the story while he was still alive because he knew of several officers that were there let out some facts and they each met mysterious deaths shortly afterward. The bulk of the surviving ship was taken away on board a flat bed truck with a tarp covering it, in the dark of night. There WERE bodies recovered and the last one died before they left the scene. They were packed in crates with dry ice to preserve them and were taken in a plane, but he did not reveal where the planes' destination was."],"Latitude":"34.646605","Log Number":"US-07102012-0006","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Features":"Dome, Window(s)","Disposition":"Unresolved","City":"Altus","Weather Factors":"Unknown","Tags":"City"}