{"Object Shape":"Square, Rectagular","Tags":"City","divs":["Sighting DetailsI was going to airport to pick up my husband. I turned onto 6th ave and drove a half a block when I seen two of the objects, I pulled the car over and parked got out my cell phone to take pictures.I got out of the car and took some pictures, the objects went slowly across the sky then paused for a second then started to go up higher they turn to red dots the farther from me.There was a man and his children getting his mail at the mail box in front of my car I heard the little girl say daddy look at that but I did't talk to them I was taking pictures then they left when the two objects disappeared. Then as I was getting back in my car and over my shoulder I seen like a fire ball object coming torge me, I got out of the car again and took a few pictures but the object was getting to close and I was afraid I would get burned so I got in my car and slowly drove south on 6th ave and watched the third object do the same as the other two pause and go up to the same spot and disappear. When I got to the corner of 17th street two teenagers where on the corner and I asked them if they seen the things and said ya what was that I said I didn't know but there were three of them the afro-american boy said three,I guess they didn't see the first two,then he ssked if I was falling the objects I told he no I was going to the airport to pick up my husband, the boy asked where my husband was coming in from I told him Mississippi then he said wow is it hot down there. With that I drove to the airport.when my husband and I arrived home my husband transfered the pictures to the computer and we printed the awesome pictures. I took the pictures to the newspaper in town and sent copies to Ken at the Reflector newspaper. P.S. unable to send copies right now"],"Longitude":"-122.543932","Disposition":"Unresolved","Object Features":"None","Viewing Distance":"21-100 Feet","City":"Battle Ground","Case Number":"40665","Sighting Duration":"00:05:00","Source":"MUFON","Country":"United States","Region":"Washington","trends":["There have been 5 other sightings in Battle Ground","There were no other sightings in Battle Ground on or around June 26th 2012"],"Summary":"Looked as thought they where on fire","files":["/var/www/straped/mufon/html2text/40665.html.txt","/var/www/straped/mufon/org/40665.html"],"Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=45.792244,+-122.543932(40665)&iwloc=A&hl=en\"> mufon case (40665) map </A>","Date of the Event":"06/26/2012 09:30 UTC","Latitude":"45.792244","Log Number":"US-07102012-0015","Weather Factors":"Unknown","Date Submitted":"07/10/2012 11:42 UTC"}