{"Summary":"2 Glowing lights, slow descent","Weather Factors":"Unknown","Latitude":"42.954196","Date of the Event":"07/09/2012 10:45 UTC","Source":"MUFON","Case Number":"40666","divs":["Sighting DetailsMy family and I live in a home that sits very high on a ridge. It's largely fields all around,so we know well the usual lights we see every night. The night of July 9th, 2012, my wife went to get something out of her car around 10:45, and noticed 2 hovering lights a few miles due South in the distance. The lights were definitely out of place and interesting, and seemed to hover for 3 or 4 minutes in the same place (one a little higher and to the right of the other), and then both slowly descended below the distant horizon at what seemed to be a synchronized descent. If there were any sound, I would've thought it was 2 helicopters searching for something, but there was no sound, and two helicopters wouldn't be a common occurence either (and we didn't see any news stories referencing any searches). We tried to break out my son's telescope to get a closer look, but we're not very telescope savvy, and the descent below the horizon came a little too quick. Nothing crazy or scary about the incident, we were just curious if anyone else had seen anything similar, as we were left saying, \"Huh?, that was interesting\" :)."],"Tags":"City","Disposition":"Unresolved","City":"Ada Township","trends":["There have been no other sightings in Ada Township","This sighting has been favorited 1 time."],"Object Shape":"Circle, Fireball, Star-like","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Michigan","Longitude":"-85.488912","files":["/var/www/straped/mufon/html2text/40666.html.txt","/var/www/straped/mufon/org/40666.html"],"Object Features":"Unknown","Log Number":"US-07102012-0016","map":"<A HREF = \"http://maps.google.com/maps?q=42.954196,+-85.488912(40666)&iwloc=A&hl=en\"> mufon case (40666) map </A>","Country":"United States","Date Submitted":"07/10/2012 01:07 UTC"}