{"Object Features":"Undisclosed","Region":"Pennsylvania","Object Flight Path":"Unknown","trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around July 9th 2012"],"Disposition":"Unresolved","Summary":"jelly-like sphere dropping smaller opague orbs","Date of the Event":"07/09/2012 12:00 UTC","Case Number":"40664","map":"<A HREF = \"http://maps.google.com/maps?q=40.464746,+-79.661438(40664)&iwloc=A&hl=en\"> mufon case (40664) map </A>","Country":"United States","Viewing Distance":"Unknown","Latitude":"40.464746","City":"Murrysville","Longitude":"-79.661438","Tags":"City","Log Number":"US-07102012-0014","Date Submitted":"07/10/2012 10:55 UTC","files":["/var/www/straped/mufon/html2text/40664.html.txt","/var/www/straped/mufon/org/40664.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting on my back patio watching and filming wild life and observing the clouds. I saw a glowing sphere coming from the East moving toward the Northwest and upwards very slowly. I grabbed my camera and began filming. I couldn't see the object in the view finder so I only got a few seconds of footage. The orb appears much smaller on film than it did to my eyes. After one minute I grabbed my binoculars to get a closer look at the object. I have drawn what I saw. I have never seen an orb in the daytime and have never seen anything like what I saw before. I am feeling extremely disturbed and perplexed. I don't know if what I saw was machine or organic or some sort of entity. I watched it for 5 or 6 minutes until it disappeared into or out of the upper atmosphere. Sequence: 1. main orb appeared. I tried to film it. 2. Decided to look at it with binoculars. 3. Observed sphere pulsating colors. 4. Observed a small group of white specks above sphere. 5. Observed 3-4 small orbs dropping from large sphere. 6. Observed white specks above sphere elongate upwards. Lost sight."],"Object Shape":"Oval, Sphere","Source":"MUFON"}