{"Longitude":"-118.401649","Case Number":"40672","Region":"California","Weather Factors":"Unknown","Date Submitted":"07/10/2012 06:13 UTC","Disposition":"Unresolved","Object Shape":"Circle, Cylinder","files":["/var/www/straped/mufon/html2text/40672.html.txt","/var/www/straped/mufon/org/40672.html"],"Source":"MUFON","divs":["Sighting DetailsMy friend and I were hanging out on his 3rd floor balcony, facing north. A helicopter was flying by so I looked up at it and as I did I happened to notice a strange orange light in the sky beyond it. I told my friend to check it out, and after about a second he agreed that the light was a strange color. It was almost the same shade of orange as a street light. The lights were flashing in some kind of pattern, but it remained too blurry for us to actually focus on the sequence. We really had no doubt that we were seeing an 'unidentified flying object.' The craft descended from the north eastern sky for about ten seconds, appeared to hover in what we think was the vicinity of Bob Hope Airport. It then jiggled a little bit, kind of moving randomly in different directions but never very far. After that, it made a sharp movement Eastward and made two more sharp turns that resulted in shape like 2 sides of a triangle. It then hovered for a few more seconds, then accelerated in a Northern direction as well as upward at about a 45 degree angle, and eventually faded away. We were watching this object so intently that we could not tear ourselves away to grab a video camera. He even said 'Get a camera! Get a camera!' But I knew my cell phone camera would likely not catch what we were seeing and I did not want to miss it. I also considered that the balcony we were on has a screen on it and that would mess with the focus on the camera. Afterwards, we went to turn on the news because we felt that somebody else obviously saw this, but we saw nothing. We called a few friends to tell them what happened. Today, we looked up sightings in Los Angeles and found all these reports about similar colored objects in the last 10 days, so we felt compelled to add a report."],"Date of the Event":"07/09/2012 10:40 UTC","Summary":"Single orange lit object over NE San Fernando Valley","Country":"United States","Object Features":"Unknown","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","City":"Los Angeles","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"34.160615","Log Number":"US-07102012-0023","trends":["There have been 404 other sightings in Los Angeles","There were 3 other sightings in Los Angeles on or around July 9th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.160615,+-118.401649(40672)&iwloc=A&hl=en\"> mufon case (40672) map </A>"}