{"Log Number":"US-07102012-0038","Case Number":"40687","City":"Tinley Park","Date Submitted":"07/10/2012 11:52 UTC","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.578567,+-87.775394(40687)&iwloc=A&hl=en\"> mufon case (40687) map </A>","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Country":"United States","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around July 8th 2012"],"Date of the Event":"07/08/2012 12:00 UTC","Longitude":"-87.775394","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/40687.html.txt","/var/www/straped/mufon/org/40687.html"],"divs":["sighting detailsunusual objects in night sky on july 8, 2012. at approximately 12 midnight, i and 5 friends observed 6 objects flying in a southernly direction. objects were unusual in the following measures: objects were bright (brighter than commercial aircraft landing lights); objects (lights) were orange in color; quite (no sound, either approaching or departing); low in sky (considerably below cloud level, estimate 1000 ft); objects approximately 1\\2 - 1 mile west of our position; flying in staggered formation and to a specific flight pattern; flying in a southerly direction; steady approach (appeared faster than commercial aircraft and military helicopters that frequent our sky); changed course almost directly west of our position (17300s, 9200w) to a southwesterly heading; appeared to exhibit significant increase in air speed immediately after course change; lights dimmed after course change; or lights off; or lights indistinguishable soon after course change; last craft passed by at approximately 12:10 a.m.; clear cool night, windy, partly cloudy at higher elevations, dark sky; moon low in eastern sky; bright stars visible between clouds. observations: two craft led, almost side by side with a considerable safe distance between (10 degrees of separation at initial observation). one appeared to move slightly ahead of the other. not racing, but positioning. the third trailed approximately 30 degrees behind. the fourth trailed approximately 40 degrees behind the third. the fifth trailed approximately 40 degrees behind the fourth. the sixth trailed approximately 40 degrees behind the fifth. the 1st, 2nd and 3 rd craft had changed course, accelerated and were out of sight above tree line as the fourth craft approached and made its course change. the fifth was in turn out of sight as the sixth made its course change. all craft followed the same flight pattern. all craft were at the same altitude. all craft traveled at the same speeds. all craft behaved in identical manners. notes: all craft came out of o'hare controlled air space. checked weather underground; clouds at 10, 17 and 25 thousand feet. took video and panned as craft approached and departed. took picture of weather underground weather stats. took print screens of weather underground weather radar approximately one hour later. suspect stealth or drone military aircraft using orange forward facing landing lights to distinguish themselves from commercial and private aircraft."],"Object Flight Path":"Straight-line path,Path with directional change","Latitude":"41.578567","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Illinois","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Unusual objects (lights) in Tinley Park, Illinois night sky on July 8, 2012"}