{"City":"Peterborough","Date of the Event":"07/10/2012 12:00 UTC","Date Submitted":"07/11/2012 03:05 UTC","Source":"MUFON","Summary":"It was like a plane but did not blink . It also went straight up into the sky at a high altitude then veered south.","Country":"Canada","Object Shape":"Flash, Star-like","Latitude":"44.298567","Log Number":"CA-07112012-0004","Longitude":"-78.309093","Weather Factors":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Peterborough","There was one other sighting in Peterborough on or around July 10th 2012","This sighting has never been favorited.",""],"Tags":"City","Case Number":"40691","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/40691.html.txt","/var/www/straped/mufon/more/40691_submitter_file1__P1060497.JPG","/var/www/straped/mufon/more/40691_submitter_file2__P1060506.JPG","/var/www/straped/mufon/more/40691_submitter_file3__P1060514.JPG","/var/www/straped/mufon/more/40691_submitter_file4__P1060513.JPG","/var/www/straped/mufon/more/40691_submitter_file5__P1060496.JPG","/var/www/straped/mufon/org/40691.html"],"divs":["Sighting DetailsOMG OMG OMG. we had 3 or more anomolies tonight. The first was what we thought was a plane but soon realized it was not. It came in on the angle of a plane but we realized it was not blinking like a plane does, it then went straight up in the sky not on an angle as a plane would to gain altitude. We watched as it ascended straight up into the sky then hover for a second then it veered of to the North West before it disappeared. We were still chatting about that incident which lasted 5 minutes when a Big Orange Red sorta Oblong object appeared in the sky very bright, it travelled from North to South ascending into the sky at an even pace. It was about the size of a Hot Dog Bun if held out at arms length. It also dimmed and brightened as it was travelling across and then went up into the night and disappeared. This incident lasted about 5 minutes in total but we are not done with our story yet, theres more to tell. 5 minutes after that incident the Moon came out of no where from the east very low in the sky almost like it came from out of the water, then rose slowly for a bit then picked the pace up. But the Moon does not rise at 1245 AM in the evening,nor does it look the color it did, a Bright Orangish red too. Unfortunatly all I got was some Pictures of the Moon as The Other Objects would not show up on my camera. Don't know why, but we also seen a few Blinking stars that Flickered Brightly then dimmed they never stopped flickering the whole time we were there. Duration of time for flickering and other anomolies 1 hour. My friends also took pics of what they belived to be anomolies but I thought they were building lights. Will add the Pics I have including an Orangish Red Moon shot to represent the color of the Oblong thing we seen. My friends also claimed they seen a beam like a pen light come down from the sky on the 8 th. of July and it appeared to be moving across the water. We we at our local downtown Marina for all the incidents reported here."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.298567,+-78.309093(40691)&iwloc=A&hl=en\"> mufon case (40691) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"501 Feet - 1 Mile, Unknown","Region":"Ontario"}