{"trends":["There have been 3 other sightings in Tamuning","There were no other sightings in Tamuning on or around July 7th 2012"],"Sighting Duration":"00:15:00","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting DetailsOn July 7th around 8pm I was having a smoke outside my house looking west towards the beach and noticed a orange orb moving north up the coast line slowly, I often stargaze and at first glance the object was out of place and what I'm use to seeing. Other orbs started to appear with the original one, total of 5 to 7 at the climax of the event stacked in groups of 3's. I made some phone calls at that point to close friends but was unable to get a wittness my BB was not able to take vid or pics quality sucked I tried. The event ended with the orbs fading out till all were gone. There were 2-sets of groups about a 10-15 sec lag between with one last solo orb that ended the sighting. I also feel that last orb was looking at me for a few seconds by the way I was feeling, kinda like we know who you are and be ready. I have not seen any reports in our area of what I saw I'm sure others saw the event Guam is small and they lite up the sky. I had choices to call the local newspaper TV and even military but decided not to for personal reasons. On the qestionare above, I have noticed some extra Helichopter activity in my area mainly the time of day they are flying around and duration. We have choppers with the military bases in Guam but usually they are on a pretty routine schedule, these guys are out more than before and continue to be flying around at night while I right this."],"Tags":"City","Longitude":"144.813237","Log Number":"GU-07112012-0005","Object Shape":"Sphere","Latitude":"13.510645","files":["/var/www/straped/mufon/html2text/40693.html.txt","/var/www/straped/mufon/org/40693.html"],"Case Number":"40693","Disposition":"Unresolved","Country":"Guam","map":"<A HREF = \"http://maps.google.com/maps?q=13.510645,+144.813237(40693)&iwloc=A&hl=en\"> mufon case (40693) map </A>","Date of the Event":"07/07/2012 12:00 UTC","Viewing Distance":"Over One Mile","Date Submitted":"07/11/2012 03:55 UTC","Object Features":"Unknown","Region":"","Summary":"Orange orbs sighting in Guam","City":"Tamuning","Source":"MUFON"}