{"Source":"MUFON","Case Number":"40696","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.009892,+-97.091827(40696)&iwloc=A&hl=en\"> mufon case (40696) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-07112012-0007","Object Flight Path":"Path with directional change","City":"Undisclosed","Summary":"Moving star /orb.","Weather Factors":"Unknown","divs":["Sighting DetailsI took off alone from an uncontrolled airport in Tulsa OK at night in a C-172 to practice maneuvers for my commercial pilot license. It was at night around 11pm. I had the plane at a high angle of attack and low power because I was practicing slow flight. My D.G and VOR demonstrated false headings all of a sudden and it concerned me.I am IFR rated and had a visual line of sight to the airport so I banked left to return and land assuming something was wrong with my instruments.I was heading on a 45 degree angle directly to the airport at around 3500 feet. I dipped my right wing to scan for traffic because the C-172 is a high wing aircraft.At the time I had accumulated around 200 hrs of night time flight. Thats when I saw what I can best decribe as a moving star flying at my same descent rate and airspeed at my 3 oclock about 1500 to 2000 feet above me.Initially I thought it had to be some relection from my instruments making a light appear in my window,but the object was clearly there and moving against the still background of stars. I then noticed that my DG was rolling back and forth and that my VOR was pointing in the direction of the moving star. I made a right bank and ignored my instruments and made a left bank using situational awareness to gain runway alignment.I noticed when I banked that my vor would still aim at the object.On descent I saw the object shoot up at a high velocity out of sight.I then clicked to light up the ILS lights for landing and at this point was very concerned. On final approach at around 500 feet, the object suddenly shot straight down and appeared at the end of the runway hovering at around 600 to 700 feet.I could not fathom what it was and assumed it was a helicopter or some experimental? I prepared to reconfigure for a touch and go when the object flew in an instant to about 50 to 100 feet directly infront of me in a blink of an eye, and then proceeded to maintain my airspeed and descent rate? It was very bright,around 12-20 feet in diameter,sort of orangy yellow orb.I could feel heat from it.I am -ex Airforce and I worked on the flight line and have seen all types of aircraft take off and land. Whatever it was , it was not an airplane, it had no fuselage, no wings, ect.I was concerned because the light was so bright that I could not see the runway clearly.It then shot strait up out of site and I landed soon after. When I tied the plane up with my hands shaking my buddy Rob, who is also a pilot, ran out and told me he saw the orb also.He said the orb shot at me and circled around my aircraft from top to bottom and then trailed me at a distance of about 50 feet on final desecent and shot straight up at a high velocity and disappeared right before wheels down.I never reported the incident, we just assumed noone would believe us anyway, and Rob feared losing his job as a flight instructor for being deemed a nut case."],"Disposition":"Unresolved","Object Features":"None","Viewing Distance":"101-500 Feet","Object Shape":"Circle, Cylinder, Star-like","files":["/var/www/straped/mufon/html2text/40696.html.txt","/var/www/straped/mufon/org/40696.html"],"Tags":"City","trends":[],"Latitude":"35.009892","Country":"United States","Date Submitted":"07/11/2012 05:29 UTC","Date of the Event":"04/04/2000 12:00 UTC","Longitude":"-97.091827"}