{"City":"Flemingsburg","Tags":"City","trends":["There have been 3 other sightings in Flemingsburg","There were no other sightings in Flemingsburg on or around June 26th 2012"],"Disposition":"Unresolved","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/40709.html.txt","/var/www/straped/mufon/org/40709.html"],"Longitude":"-83.649545","Viewing Distance":"Unknown","Date of the Event":"06/26/2012 10:55 UTC","Object Features":"Unknown","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Straight-line path","Object Shape":"Star-like","Case Number":"40709","map":"<A HREF = \"http://maps.google.com/maps?q=38.383364,+-83.649545(40709)&iwloc=A&hl=en\"> mufon case (40709) map </A>","Log Number":"US-07112012-0020","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was in a rural location going to my car and looked up for no particular reason and saw a \"star\" flying much faster than any plane. I only saw it for a few seconds traveling from east to west before it just disappeared. At first I thought it was a plane but saw no blinking lights at all and realized it was moving much too fast to be a plane. It appeared to be much below the stars and barely above the treeline. This is the fourth star-like object I have seen whiz through the sky at this same location. I continued to stare up into the sky for at least another ten to fifteen minutes to see if I would see any more. Last time I saw three right in a row and almost exactly at the same time of night. This one was more bright white in color than the other three that appeared to be almost gray. The sky around it appeared extremely dark and although I did not notice it blocking out the stars as it was a clear night, the sky almost looked fuzzy. I was amazed that I was seeing another one and wonder if there is a reason for this or if it is just a coincidence."],"Date Submitted":"07/11/2012 01:54 UTC","Latitude":"38.383364","Summary":"Saw star-like object zoom across sky at much higher speed than any plane.","Source":"MUFON"}