{"Date Submitted":"07/11/2012 01:13 UTC","Viewing Distance":"Over One Mile","Object Features":"Unknown","divs":["Sighting DetailsWhile sitting at a camp fire in the back yard, approx 11:00 pm my wife and I noticed what we thought was the moon through the trees to the east of our location. After less than a minute I noticed it was moving and was not the moon. We moved about 30 feet to a clear view and noticed what appeared to be an orange flare like light. At first I thought maybe it was fireworks. We suddenly realized they were moving through the sky heading north. We followed the lights through the sky. Most of the duration they were flashing white lights, but at times would flare like light. It was hard to tell if the flare light and the flashing lights were the same object. They mave have been separate objects. After a minute or so the flashing lights continued north, we no longer could see the flare like lights. We watched the flashing objects continue north until they were too far north and no longer visible. At no time did we hear anynoise!. We went inside and posted on Facebook to see if anyone else had seen them. There were responses by people who did see them as well. One in Alanson area. Approx 10 minutes after seeing the objects I called 911 to see if they had calls about lights in sky. I know the dispatcher and he said they had MANY calls from Petoskey east to Cheboygan and Petoske north to Harbor Springs. 911 would have many documented calls as to the same lights. Many calls stated the same \"flare like\" or \"sparks\". The callers indicated to 911 that they did not make noise. The only craft I could think of that would be similiar is military craft dropping flares, such as anti heat seeker missle flares. Why would they do this at night, over N. Michigan?"],"Country":"United States","Latitude":"45.322978","City":"Petoskey","Source":"MUFON","Date of the Event":"07/10/2012 12:00 UTC","Disposition":"Unresolved","Log Number":"US-07112012-0017","map":"<A HREF = \"http://maps.google.com/maps?q=45.322978,+-84.955536(40706)&iwloc=A&hl=en\"> mufon case (40706) map </A>","Summary":"2 object/lights with flare like trail at times. 911 had many calls about these.","Region":"Michigan","Tags":"City","Longitude":"-84.955536","trends":["There have been 5 other sightings in Petoskey","There were 2 other sightings in Petoskey on or around July 10th 2012"],"Case Number":"40706","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/40706.html.txt","/var/www/straped/mufon/org/40706.html"],"Sighting Duration":"Undisclosed"}