{"Country":"United States","Source":"MUFON","Region":"Michigan","City":"Grand Rapids","Weather Factors":"Unknown","Latitude":"42.979246","Case Number":"40719","Log Number":"US-07112012-0028","Longitude":"-85.744219","Date Submitted":"07/11/2012 08:04 UTC","Date of the Event":"08/09/2009 11:30 UTC","Disposition":"Unresolved","trends":["There have been 45 other sightings in Grand Rapids","There were no other sightings in Grand Rapids on or around August 9th 2009"],"files":["/var/www/straped/mufon/html2text/40719.html.txt","/var/www/straped/mufon/org/40719.html"],"divs":["Sighting DetailsApproximately around 11:30 PM EST, a friend and myself were heading northwest on remembrance rd from leonard st when I noticed a strange light in the sky above a neighborhood. At first I thought it was a helicopter, however the light pattern was completely different and there was no noise. I looked back at my passenger and she was starring up at it as well. I pulled over into a large driveway on the north side of the road to get a better look. Once I shut off my motorcycle we both noticed that the object had no noise. The object was approximately 100-150ft in the sky and about 100 yards away from me. Initially I noticed three bright lights, equally spaced apart, and two smaller blue lights between the larger white lights. All of these were solid. Once I removed my helmet I immediately noticed a solid red light which appeared to be on the underside of the object. Three smaller white lights surrounded this red one. Since the object was stationary, and it was dark out, I could not make out a shape to it. Within 30 seconds of observing the object, it suddenly started moving at about 5-10 mph in a southward direction. We continued to watch it slowly move, and with 10-20 seconds another side of the object was revealed. This was the most startling point in the observation. On this nearly viewable side, a series of white rectangle lights, side by side, we're pulsating from left to right, like a light bar. The object appeared to be a triangular shape. The object continued to head south at a slow pace and disappeared over the tree line. Having always been uncomfortable, yet fascinated, with the subject of UFOs, I was extremely anxious and confused. My passenger as well was frightened. I proceeded to drop her off a couple miles away (northwest). I did not decide to try and follow the object, regretfully, because of how frightened I was. As I was heading home, I started crossing the Grand River, near downtown Grand Rapids, on Ann St. (US-131S exit) and going over the river there is a perfect view south of downtown Grand Rapids. I did not see any sign of the object. Once upon arriving home I did some research online and what I saw matched other sightings in Grand Rapids."],"Object Flight Path":"Hovering then path,Straight-line path","Tags":"City","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Object Shape":"Triangle","Summary":"Witnessed UFO hovering over houses, then suddenly headed south at slow speed.","map":"<A HREF = \"http://maps.google.com/maps?q=42.979246,+-85.744219(40719)&iwloc=A&hl=en\"> mufon case (40719) map </A>","Sighting Duration":"Undisclosed"}