{"Date Submitted":"07/11/2012 07:55 UTC","City":"Undisclosed","Latitude":"39.32258","Object Shape":"Boomerang, Triangle, Other","trends":[],"Longitude":"-111.087901","Source":"MUFON","divs":["Sighting DetailsI walked out to check on mail and was instantly focused on the amazing cloud formation with the sunny day, with patches of rain. The clouds I believe were MAMMATUS CLOUDS after comparing on-line. This is when I noticed the 2 ...shapes in the air, at first I thought they where eagles or a large bird , but realizing how high up it could not possibly be a bird or anything but something very large. I followed them kinda floating it seemed then moved south in a pattern that 2 planes might make, there was no after trail and they kept together then slowly turned east and then abruptly vanished... i suppose into the cloud formation which would have made their altitude higher than I previously thought. I have seen many planes circle or come into the city day and night and this is where I draw my comparative size from, the size was very large and I understand the disappearing\" into the clouds would seem that way from the ground ... but the way they seemed to move in the sky was strange to begin with , I then went back into house and took a picture of the sky and clouds, took my phone back inside then remembered I forgot mail and went back out and clouds had dispersed and a bright sunny day, all seemed surreal. Probably a few planes from hill air-force, but after I came inside and started to look to see if anyone else might have seen them this day."],"Summary":"large plane shaped, but not a long tail (if any) Thought at first eagles or hangliders, but very large for how high in the sky, shortly after was able to compare to commercial passenger plane. dark kinda smokey look to both \"aircraft\"","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Case Number":"40718","Date of the Event":"07/11/2012 04:05 UTC","Tags":"City","Log Number":"US-07112012-0027","Weather Factors":"Unknown","Object Features":"Wings","Disposition":"Unresolved","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.32258,+-111.087901(40718)&iwloc=A&hl=en\"> mufon case (40718) map </A>","Region":"Utah","files":["/var/www/straped/mufon/html2text/40718.html.txt","/var/www/straped/mufon/org/40718.html"],"Country":"United States","Sighting Duration":"00:01:00"}