{"files":["/var/www/straped/mufon/html2text/40713.html.txt","/var/www/straped/mufon/org/40713.html"],"Object Flight Path":"Path with directional change","Country":"United States","Source":"MUFON","Date of the Event":"06/12/2012 10:45 UTC","Object Shape":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.291243,+-119.490072(40713)&iwloc=A&hl=en\"> mufon case (40713) map </A>","Date Submitted":"07/11/2012 05:04 UTC","City":"Benton City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Longitude":"-119.490072","Case Number":"40713","Weather Factors":"Unknown","Summary":"Lights moving along hilltop then across sky then up and away,","divs":["Sighting DetailsTri-Cities Washington On June 12, 2012 about 10:20pm I took our dogs outside to do their normal nightly stuff before we go to bed. We live outside of town on 5 acres, \"it is quite out here at that time of night\", while I was standing outside in my back yard with our dogs I noticed a couple of lights running along the ridge on a hillside behind our house to the south. The lights appeared at first, to be a couple of fire trucks running the hillside chasing a fire or something (the lights were heading west away from me at that time). As I watched I started to listen for engine noise, \"nothing\" I heard nothing, no motor vehicle sound, jet noise, humming - nothing. I continued watching the lights wondering what these trucks were doing up there how come I couldn't hear them and at that time of night. The lights then came to the end of the hillside and continued into the skyline now heading west, northwest. I started yelling for my wife to come look at them, but she was brushing her teeth in the master bathroom which has some windows facing the skyline in which the lights were now moving. I ran in and had my wife look out the window. She saw the lights moving across the horizon which now seemed to be moving more northerly. The lights continued across the valley towards the hillside to the north of us. We then moved to the front of the house, which faces north and stepped outside on the front walkway and saw that the lights started moving east, northeast. At that time my wife went to grab her camera and tried to video the lights, but she had forgotten to put a memory card in the camera, so she didn't get any pictures or video. I then tried to take a video with my phone but it was very dark and I couldn't see anything thru my phone. The lights continued till they went behind the hillside directly north of us. A few seconds later re-appearing a long distance away, due north of the hilltop and high in the sky. The lights then started ascending till they were completely out of sight. Just moments after they were no longer visible I noticed a satellite or something move across the sky moving from the WSW towards ENE. We were both speechless and left wondering what we had seen. The lights appeared to be connected and about 900 ft apart. Feeling like I needed to come to a conclusion regarding what we had seen several days later I went online o find anything similar to what we saw and found that similar lights to these have been seen all over the country and in other countries as well. Pretty interesting, but..... on July 7th I took my wife and another out to dinner and as we were telling our friend about what we had seen I looked at my gallery in my phone and noticed that I had recorded a video the night of the sighting and I decided to see if I had got any video of the lights and not just black like I thought. Turns out I did! The video is shaky and short but it did happen to catch the lights and I even zoomed in for a moment. Not a high quality video but it is what it is and what ever it was we saw was real and big. Whether or not it was from out of this world or just something that the Government is flying around, we will probably never know but just wanted to share what we had seen."],"Log Number":"US-07112012-0023","trends":["There have been 3 other sightings in Benton City","There were no other sightings in Benton City on or around June 12th 2012","This sighting has never been favorited.",""],"Tags":"City","Latitude":"46.291243","Disposition":"Unresolved","Object Features":"None","Sighting Duration":"Undisclosed","Region":"Washington"}