{"Latitude":"34.160419","Date of the Event":"12/30/1977 12:00 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around December 30th 1977"],"Summary":"bright, white light object , reversed direction with incredible ease","Country":"United States","Object Shape":"Circle","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn Dec 30th, 1977, at approximately midnight, I and my parents got home from visiting friends and my dad went for an evening stroll. He came back to our home within minutes and told us to go outside with him to view a light in the sky which was making unconventional maneuvers. My mom and I went outside and looked up where he had seen the object and we saw a white, bright object in the sky. The visibility was perfectly clear, and i could see it was definitely not one of the stars in the sky, or a plane, or helicopter. The object was directly above us, at about a 90 degree angle to the horizon, and it appeared to be at a high altitude. It was moving from North to South across the sky but it then reversed direction entirely and took off at a faster speed in the opposite direction. It then reversed direction again and took off again in a Northern direction. The light did not pulsate and it did not give off any glare. We observed it until it moved beyond our visibilty."],"files":["/var/www/straped/mufon/html2text/40721.html.txt","/var/www/straped/mufon/org/40721.html"],"Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Los Angeles","Case Number":"40721","Date Submitted":"07/11/2012 10:26 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Longitude":"-118.519498","Log Number":"US-07112012-0031","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.160419,+-118.519498(40721)&iwloc=A&hl=en\"> mufon case (40721) map </A>","Region":"California","Viewing Distance":"Over 1 Mile, Unknown"}