{"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Galesburg","Latitude":"40.942265","files":["/var/www/straped/mufon/html2text/40729.html.txt","/var/www/straped/mufon/org/40729.html"],"Log Number":"US-07122012-0003","Date Submitted":"07/12/2012 01:50 UTC","trends":["There have been 5 other sightings in Galesburg","There were no other sightings in Galesburg on or around July 7th 2012"],"divs":["Sighting Details My friend and I were talking near the front porch July 7, approximately 10-10:30 pm. I was facing the direction where the object came into view. I thought it was a shooting star about to hit the ground near us, but I didn't tell my friend, thinking it would be gone before he could turn around. But it didn't land or burn out, and I actually knew it wasn't what I had first thought, and that a shooting star was just the logical thing for me to think. It was so close and so bright that my friend saw it in the corner of his eye and turned immediately. We both kept saying, \"What is it? What is it?\" It had all the characteristics of a bubble, seeming to change shape a little, as a bubble would, almost round, slightly oblong. In the middle was an extremely bright gaseous-looking fire. Around the fire was a glow, and around the glow was a duller glow which filled in the remaining shape of the bubble. It came from the NE and was traveling SW, and seemed to be about 3 feet in diameter, and traveling approximately 20 mph. It first came into view after passing over the house clearing the roof. It seemed to be at least 80 feet from the ground because it was not hitting houses or trees. It also appeared to be approaching in a downward direction, maybe down to 60 feet, then leveling out. I said to run into the street to get a clear view away from trees. We had a fairly clear view anyway because it was so bright that it shined through the tree branches, similar to the light in a kerosene lamp, only much larger. We watched it move in a very deliberate manner, as if it knew where it was going, without hitting anything. It didn't burn out at all or change speed while we could see it. I think I saw it about a minute, and my friend saw it longer, because I ran into the house to get a camera and car keys so we could follow it. Too late. No photo. We could not find it after driving around for about 10 minutes. It was too fast and houses were in the way before we even got out of the driveway. I reported it to the police. There was a shift change and they did not yet know if any other reports had come in before mine. The officer believed me, saying he'd seen things also, that could not be explained. I'm glad I was with someone. I'd like to see it again. However, when I saw a \"flying saucer\" many years earlier, hovering just above, or landed on the next door neighbor's house, I was so shocked that I never wanted to see anything like that again. Being with another witness makes it easier to keep composed. It has affected me greatly, to the point where I want answers and can't get it off my mind."],"Viewing Distance":"21-100 Feet","Country":"United States","Summary":"transparent 3 ft bubble w/bright flame in center moving appr 20 mph 80 ft high, missing trees/bldgs, 2 witnesses","Object Flight Path":"Straight-line path","Region":"Illinois","Tags":"City","Disposition":"Unresolved","Case Number":"40729","Longitude":"-90.341597","map":"<A HREF = \"http://maps.google.com/maps?q=40.942265,+-90.341597(40729)&iwloc=A&hl=en\"> mufon case (40729) map </A>","Object Shape":"Blimp, Circle, Fireball, Oval, Sphere","Date of the Event":"07/07/2012 10:30 UTC","Source":"MUFON"}