{"map":"<A HREF = \"http://maps.google.com/maps?q=40.76095,+-73.910218(40728)&iwloc=A&hl=en\"> mufon case (40728) map </A>","Object Flight Path":"Straight-line path","Latitude":"40.76095","Source":"MUFON","Object Features":"Unknown","Region":"New York","Longitude":"-73.910218","Country":"United States","Date of the Event":"07/12/2012 12:00 UTC","City":"New York","Disposition":"Unresolved","Viewing Distance":"Unknown","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 12th 2012"],"Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/40728.html.txt","/var/www/straped/mufon/org/40728.html"],"Weather Factors":"Unknown","Sighting Duration":"00:01:18","Case Number":"40728","divs":["Sighting DetailsI live near an airport and live in a 4th floor apartment on the Eastern side of Queens, NY and have a pretty clear view from my balcony of the area between the border of Queens and Manhattan, and good views of the Manhattan skyline. I often see plans that appear to be heading towards La Guardia airport for a landing, and these plans are always flying in the same direction...sort of along the East River in a Northeasterly direction towards La Guardia airport. Tonight I thought it odd that a plane appeared to be flying at a 90 degree angle to that of most planes. Instead of flying in a Northeasterly direction it was flying more East. I watched as it flew just south of my apartment building continuing East and deeper over Queens. I wondered 'COULD this be a UFO?!'.so I decided to bend down towards the ground and look upward as the plane was flying closer to my building. While it looked plane like, I thought the lights were odd....I seemed to see lights in four perfect corners....whereas usually with a plane I think you see the wing lights (and the wings are naturally spread out wider than the rest of the plane) and then I think you might see flashing lights maybe at the nose and the tail? But with this object, all the lights seemed to be solid...no flashing lights..and again, it was the fact that the four lights were each in a corner of what appeared to be shaped like a perfect square. Maybe it was just my imagination but that coupled with the unusual flight direction got me wondering....."],"Summary":"plane-like behavior and appearance except for unusual flight pattern considering I live near an airport","Tags":"City","Log Number":"US-07122012-0002","Date Submitted":"07/12/2012 01:07 UTC"}