{"Summary":"Fireballs in the sky above West Los Angeles, Calif. July 7, 2012@ 1035pm","Longitude":"-118.450571","files":["/var/www/straped/mufon/html2text/40720.html.txt","/var/www/straped/mufon/org/40720.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.026571,+-118.450571(40720)&iwloc=A&hl=en\"> mufon case (40720) map </A>","City":"Los Angeles","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around July 7th 2012"],"Object Features":"Undisclosed","Log Number":"US-07112012-0029","Date Submitted":"07/11/2012 09:43 UTC","Source":"MUFON","Country":"United States","Viewing Distance":"101-500 Feet","Object Shape":"Fireball","Sighting Duration":"Undisclosed","Latitude":"34.026571","Region":"California","Date of the Event":"07/07/2012 10:35 UTC","Case Number":"40720","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsOn the night of July 7th, 2012 @ 1035pm I took my dog out in the backyard before bed. Only he just kept crying and then he sat down and looked towards the sky. I turned around and looked to my right and there was 3 glowing fireballs hovering in the sky then I noticed another one fly up and join them. Never seeing anything like this in my life, I ran in the house and yelled for my son to come outside and see what I was seeing. He came outside along with my brother. We noticed more of these fireballs flying in a crooked line but very evenly spaced. They just kept coming!!! then they looked to stop and hover in a certain section of the sky then one by one would accend upward. My son ran into the house and grabbed his I phone and was able to take a few picture's and a 5 second video. I counted at least 22 of them. They would follow the same path one after another then hover in a certain area of the sky, then start accending one by one then they would fade out. They were north of the Santa Monica Airport and to the south of the 10 fwy..They were coming in from the ocean going in a south-easternly direction. They made no sound at all. It was also a overcast night with no winds. Never in my life have I seen anything in the sky that bright..It took my breath away and left me shaking with excitement. Its something that you cant take your eyes off of..WOW!!!"]}