{"Summary":"Hovering oval shaped craft, black helicopters shined spotlights on it","Latitude":"34.154809","Object Features":"Undisclosed","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary,Other","Case Number":"40722","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 1st 1982"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.154809,+-118.514358(40722)&iwloc=A&hl=en\"> mufon case (40722) map </A>","Object Shape":"Egg, Oval","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsMy mother and I and our large dog were in the car headed to the supermarket at dusk, approximately 8pm-ish, and the sky was still light because it was early September and still Summer weather. We were on a backroad in the residential area and when we turned a corner to head into the back parking lot area of the supermarket, we were entirely shocked to see a glowing, red-orange, oval-egg shaped, solid object hovering in a stationary position, approximately 8 stories above the ground. My mom was intrigued and she drove the car closer to the object, so we were almost right under it but far enough away so we could still see it through the front windshield, and she put the car in park but left the engine running. Our dog put his head out the window and he looked up and saw the object and began to bark incessantly while staring at it. The object was solid, and it seemed to be made of a light silver white metal in appearance, but it glowed with a deep orange red hue that changed its intensity and color distribution over the object, almost as if the hue was a product of high heat, or some type of propulsion by product. The orange red hue did not give off any glare whatsoever. The object was spinning at a moderately slow pace, in a clockwise direction. We observed it for about 3 to 5 minutes and it did not move up or down, but hovered and kept on spinning at the same pace. Then my mom and i saw in the distance, in the area past and behind the object, and at a higher altitude, two black helicopters flying towards the object at a fast pace. They quickly were over the object and decended to the objects altitude and each helicopter took up a position on each side of the object and facing the object. Each helicopter had its side door open, and in each helicotper a male in dark Military looking \"fatiques\" went to the open door and used spotlight to shed light on the object. The object had not moved from its position during the entire time the helicopters moved in on it, but when the spotlights fell on it, it began to spin faster and glow more intensely in the red orange hue. Within 1 minute approximately, the object accelerated upward incredibly quickly and entirely vanished, seemingly because it accelerated even more quickly out of range. The helicopters were left with the beams of light still shinning where the object had been, and then they both took off very quickly, one going upwards in the direction the object had gone, and one back in the direction they had come from."],"files":["/var/www/straped/mufon/html2text/40722.html.txt","/var/www/straped/mufon/org/40722.html"],"Country":"United States","Log Number":"US-07112012-0031","Sighting Duration":"Undisclosed","Date Submitted":"07/11/2012 11:11 UTC","Region":"California","City":"Los Angeles","Longitude":"-118.514358","Date of the Event":"09/01/1982 12:00 UTC","Disposition":"Unresolved"}