{"Latitude":"41.050604","trends":["There have been 10 other sightings in Stamford","There were no other sightings in Stamford on or around July 6th 2012"],"Object Shape":"Fireball, Sphere","Viewing Distance":"21-100 Feet","Summary":"UFO'S over dora st and seaside ave ..stamford ct.","files":["/var/www/straped/mufon/html2text/40730.html.txt","/var/www/straped/mufon/org/40730.html"],"Region":"Connecticut","divs":["sighting detailsevery night around 11pm i walk my two dogs,a doberman and an irish setter ...tonight 7\\6\\12 at around 11pm i left my house heading north on seaside .at around 200 ft. looking eastward jut above the tree line about 30ft in the air and 30 to 50 ft away from me...i saw what i can only discribe them as three very bright orange fire balls moving north\\east in a triangle formation...an orange color so vivid and bright with a darker center. nothing i have ever seen before ...they were moving nort\\heast at around five miles an hr..very slow ..as i lost them behind a bulding three more came from the same location then three more and three more.i counted twelve ufo's flying in the same triangle formation...moving \"floating more likely\" with movements so pricise,thru our sky . every so often one would dim to just a flashing light .wow what a night. while all this was going on. my heart was beating so hard and racing like a race horse im able to think of getting my droidx2 and film this amazing once in lifetime event.. but with two dogs pulling me in multiple directions i was only able to take three shaky short videos..i wanted to run and call every one but i just could not take my eyes off of them i didnt want to miss a second of it(you blame me ) i know of nothing that can fly that speed, move in silence ,with such precision and stay up in the air, made on earth .....to all the people that think these were chinise lanterns you werent there so dont tell me what i saw...ps,,these were no plane no helicopter [think of the sound these would make at that altitude] ... no chinise lantern no jupiter venus or mars .these were truley ufo's ....wow thank god i was there to witness this amazing event ...."],"Tags":"City","Object Flight Path":"Path with directional change","Longitude":"-73.509216","Sighting Duration":"Undisclosed","Case Number":"40730","Object Features":"Unknown","Log Number":"US-07122012-0004","City":"Stamford","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"07/06/2012 11:15 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.050604,+-73.509216(40730)&iwloc=A&hl=en\"> mufon case (40730) map </A>","Disposition":"Unresolved","Date Submitted":"07/12/2012 02:36 UTC"}