{"Weather Factors":"Unknown","Summary":"These balls of orange light started to appear. About seven of them. They hovered and moved accross the sky and dissapeared.","Date Submitted":"07/12/2012 05:09 UTC","Case Number":"40733","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=-34.06463,+18.458999(40733)&iwloc=A&hl=en\"> mufon case (40733) map </A>","Object Shape":"Sphere","Sighting Duration":"00:05:00","Date of the Event":"07/11/2012 07:00 UTC","Latitude":"-34.06463","Tags":"City","Log Number":"ZA-07122012-0007","divs":["Sighting DetailsLast night on July the 11th 2012 in the town of Somerset West South Africa, Near the city of Cape town. On our main road . I was the passanger in a stationary Vehicle at the traffic light. I was looking around to see what was happening around me at the time when I saw about three round balls of light. They where rather high up at the time. Then After about a minute or so. More Started to appear and eventually there was about 7-9 of them in the sky. They started to move towards one side of the town. Flying Right in front of us in the sky. At the time i noticed that i was not the only one looking at these strange objects. A couple of other people in cars where paying their attention to them. With This now seen, the hair on my back was standing up and i started to feel notious. After about 7 minutes from this sighting they started to dissapear into thin air with the last one rising and slowly dissapearing. My whole family saw these objects. Even though there was much discussion over what it could or rather should be. The object was then now called a chinease lantern. My mom and I. Knew 100% that it was not a plane, helicopter or chinease lantern for these objects were far to bright and fast to be that."],"Country":"South Africa","Object Features":"None","Object Flight Path":"Hovering then path","Source":"MUFON","Region":"Western Cape","files":["/var/www/straped/mufon/html2text/40733.html.txt","/var/www/straped/mufon/org/40733.html"],"Longitude":"18.458999","Disposition":"Unresolved","City":"Cape Town","trends":["There have been 4 other sightings in Cape Town","There were no other sightings in Cape Town on or around July 11th 2012"]}