{"Longitude":"-77.016841","Case Number":"40739","map":"<A HREF = \"http://maps.google.com/maps?q=38.710488,+-77.016841(40739)&iwloc=A&hl=en\"> mufon case (40739) map </A>","City":"Fort Washington","trends":["There have been 4 other sightings in Fort Washington","There were no other sightings in Fort Washington on or around May 19th 2012"],"files":["/var/www/straped/mufon/html2text/40739.html.txt","/var/www/straped/mufon/org/40739.html"],"Source":"MUFON","Object Shape":"Oval, Other, Unknown","Disposition":"Unresolved","Log Number":"US-07122012-0013","Weather Factors":"Unknown","Date Submitted":"07/12/2012 12:38 UTC","Latitude":"38.710488","Country":"United States","Date of the Event":"05/19/2012 08:00 UTC","Summary":"Phenomenon of Alien Probes in Washington DC Metro Area","Object Features":"Unknown","Region":"Maryland","Viewing Distance":"101-500 Feet","Tags":"City","divs":["Sighting DetailsOver the past several months, I have been witnessing a phenomenon of UFOs appearing in the Washington D.C. Metropolitan Area. On 18 May 2012, I was at the Fort Washington Park in Fort Washington, M.D. and I observed a UFO hovering in the distance. I could not identify the hovering object as a model aircraft and its movements did not dictate that it was a model airplane. The object is capable of hovering for lengthy periods of time and is engulfed within a light that obscures the actual vessel from ground based observation. This object has been observed on multiple occasions and mimics the planet Venus' position within the sky. After some research, this type of activity has been recorded. Yemme discussed similar observations made by United States military observers within the book \"UFO - Evaluating the Evidence\" describing a accident when a military aircraft collided with an unknown object in midair. \"At the time of the sighting, Venus was in a position which coincided with that of the UFO. The planet's angular distance from the sun was rather small, but it was still bright enough to be seen by day. It is possible that Venus was the cause of this sighting and was observed by some of the witnesses on the ground.\" (51) The unidentified object within this video will shift its position very slightly and in the background you can hear an airplane flying overhead. I attempted to zoom in with my camcorder but was not able to obtain a clear view of the object emanating the light. I am always in awe to observe these objects. After observing the object, I departed the location for home. I seek assistance to document other UFO activity within the area. Please feel free to have this video analyzed for authenticity."],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"00:35:00"}