{"City":"Golden","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around July 12th 2012"],"Longitude":"-105.394994","map":"<A HREF = \"http://maps.google.com/maps?q=39.925542,+-105.394994(40732)&iwloc=A&hl=en\"> mufon case (40732) map </A>","Source":"MUFON","Tags":"City","Region":"Colorado","Case Number":"40732","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Star-like","divs":["Sighting DetailsI was outside smoking a cigarette and listening to one of my favorite songs on my ipod. The sound of the helicopter slightly overpowered the music in my headphones and that's what made me look up. Since I live in the mountains, I figured it was another interesting event in the sky, given that I've seen a few up here. However, never have I come across helicopters, especially at around midnight. I took my headphones off, and at that same time the outdoor lights went dark. This was not too much of a surprise as they are on a timer, but that was not my main concern. I decided to let all lights stay off and observe what was going on. My first thought was a military mission coming back from some top-secret in the middle of the night and I took off my headphones to give a look and listen. What I saw was a helicopter with just one light on and something in front of it. I knew it was a military helicopter because of the sound and speed it was producing. It past almost overhead and that's when I noticed that it looked like it was chasing somehint... or escorting it? Swear on my life I watched this helicopter follow what looked like a dim star moving at the same speed as the aircraft but a few hundred feet in front of it. This was when I thought to myself \"Am I actually witnessing my first UFO? After all the video I've researched online... It was uncanny. Something that looks like a star but is moving in Earth-real-time speed, not to mention being chased by a military chopper! My only other guess would be a drone or some other very small aircraft being covered by the helicopter, but the situation just doesn't add up for me. I saw and heard a modern U.S. Military helicopter following what looked to me like a dim star moving at the same speed as its pursuer. It seemed like a pursuit and not an escort."],"Summary":"Military helicopter in pursuit of a dim star-like light.","files":["/var/www/straped/mufon/html2text/40732.html.txt","/var/www/straped/mufon/org/40732.html"],"Object Flight Path":"Straight-line path","Log Number":"US-07122012-0006","Object Features":"Undisclosed","Sighting Duration":"00:01:30","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","Latitude":"39.925542","Date Submitted":"07/12/2012 03:27 UTC","Date of the Event":"07/12/2012 01:01 UTC"}