{"Source":"MUFON","City":"Rochester","Tags":"City","Summary":"Spoted bright light traveling parallel to their car followed them for 3 miles engine and radio died and light made a left hand trun in front of car and shot off to the north at a rapid speed","Object Features":"None","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"07/12/2012 02:57 UTC","Sighting Duration":"00:05:00","Log Number":"US-07122012-0005","divs":["Sighting DetailsMother and Father were riding in there Lincoln heading east from the Zumbro river to highway 63 when the spotted a bright light out in the field about 15 to 20 feet off the ground keeping pace with their car. When they stopped at a stop sign the objected stopped and his engine died as well as his radio going dead. His headlights and all lights in the car went out at the same time. The light then took off in the same easterly direction and my Dad then was able to restart the car and all electronics came back to normal function. They then chased the light that was on there right side (south side) of the road and it gained speed and crossed in front of the car and shot off to the north at an incredible speed and disappeared. This is the story that they told me when they got home and called me about the episode. That's all I know about it. There names were Joe and Oddie. Mine is Jary, there son."],"Longitude":"-92.467629","Case Number":"40731","Latitude":"44.027301","Object Shape":"Sphere","Date of the Event":"03/24/1966 11:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.027301,+-92.467629(40731)&iwloc=A&hl=en\"> mufon case (40731) map </A>","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/40731.html.txt","/var/www/straped/mufon/org/40731.html"],"Region":"Minnesota","trends":["There have been 13 other sightings in Rochester","There were no other sightings in Rochester on or around March 24th 1966"],"Object Flight Path":"Straight-line path,Path with directional change","Country":"United States"}