{"Log Number":"US-07122012-0010","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.21672,+-73.138974(40736)&iwloc=A&hl=en\"> mufon case (40736) map </A>","Disposition":"Unresolved","Longitude":"-73.138974","Object Features":"None","divs":["Sighting DetailsInitially looked jut like a fireworks being shot into air, but not exploding. Instead it morphed into a large pulsating red light attached to a cylindrical shaped object, and. From 1000 fett awat, began moving towards me, like I was the reason it appeared! It came right over my head. Photos taken.then it changed direction and moved very slowly away from me. Estimated height 700-1000 feet! I was in front of my house. I'm a retired police officer. I've seen ufo's before, but at high altitude, such as most videos out there. I have never seen anything like this! I estimate it was launched from ground about 1000 feet from my house, which is all houses. It's initial launch ans stop in mid air was identical to fireworks. What caught my initial attention was it didn't explode. Instead, it Developed into an object with a very bright large pulsating red light, ans slowly came towards me! As it moved away from me , slowly, I took two photos. It gradually moved away very slowly with only light being in its center, the large red pulsating light!"],"Date Submitted":"07/12/2012 08:48 UTC","Summary":"Red light shot up into air from ground and developed into an object with pulsating red light, coming to my location, then turning.","Date of the Event":"06/16/2012 12:00 UTC","City":"Stratford","Source":"MUFON","Sighting Duration":"00:07:00","Case Number":"40736","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/40736.html.txt","/var/www/straped/mufon/org/40736.html"],"Object Flight Path":"Path with directional change","Object Shape":"Cylinder","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 10 other sightings in Stratford","There were no other sightings in Stratford on or around June 16th 2012"],"Country":"United States","Region":"Connecticut","Latitude":"41.21672"}