{"Case Number":"40738","Country":"United States","Object Shape":"Sphere","trends":["There have been 2 other sightings in Hartwell","There were no other sightings in Hartwell on or around November 20th 2007"],"Object Features":"Undisclosed","divs":["Sighting DetailsI was going Deer hunting one morning and I was hunting near Paynes creek area of Hart county. I pulled into the land and was early. So i was sitting in my truck til closer to time to go into woods. I see a round object i thought was a star. I was watching it and notice it was moving from side to side. It came closer and closer. It floated in front of my truck for 15-20 mins. Then it slowly moved behind my truck while i kept my eyes on it. It finally got out of sit and I waited until daylight to go into the woods. A few days later I go back one morning and it was raining and saw the same thing just as before. A few days later I go back one morning and there is a big ditch next to where i park my truck. As i was pulling in I thought to myself that a friend of mine was there hunting also that morning because there was lights in the parking area. As i get closer the lights dim and go away. all that was there was a ditch. There is no other way out or in to the area. After that i quit hunting in the area and have not been back. There is no houses around the area. It was about tree top high."],"Region":"Georgia","Date of the Event":"11/20/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.355732,+-82.929287(40738)&iwloc=A&hl=en\"> mufon case (40738) map </A>","Tags":"City","Weather Factors":"Unknown","Longitude":"-82.929287","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Date Submitted":"07/12/2012 12:18 UTC","City":"Hartwell","Log Number":"US-07122012-0012","Source":"MUFON","Latitude":"34.355732","Summary":"Glowing orb floating in front of my truck and moved above and behind me.","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/40738.html.txt","/var/www/straped/mufon/org/40738.html"],"Sighting Duration":"Undisclosed"}