{"Summary":"\"Exploding\" Satellite-like Lights","Longitude":"-80.118727","Country":"Canada","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Case Number":"40745","Disposition":"Unresolved","Object Shape":"Star-like","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.07072,+-80.118727(40745)&iwloc=A&hl=en\"> mufon case (40745) map </A>","Tags":"City","Source":"MUFON","Log Number":"CA-07122012-0019","divs":["Sighting Details11pm My daughter and I went outside to look at the night sky. We watched a satellite-like light quickly zip past Arcturus. It flared up brilliantly as if it had exploded. A few seconds later it reappeared further along its same trajectory and zipped Northward until it faded. As we were watched the first light fade, in my peripheral vision near Cygnus, I saw what looked like a quick falling star. I pointed out the area of the sky to my daughter and as we stared at the area another short burst (line) of light appeared and then flared up as if it had exploded. It disappeared, reappeared a couple of seconds later, flared up and disappeared again. It did this a few times (continuing on in a straight line) until if faded off into into the horizon. I don't know what these lights were. I would guess people would say they were meteors skimming along the atmosphere or that they were spinning and glinting satellites, but I have never seen a meteor fall in such a manner nor have I ever beheld a satellite behave in such manner either. As far as I am concerned they were truly unidentified flying objects. I thought the lights were quite amazing but my daughter felt frightened and anxious by the sight of them."],"Weather Factors":"Unknown","Object Features":"Undisclosed","trends":["There has been one other sighting in Ohsweken","There were no other sightings in Ohsweken on or around July 11th 2012"],"files":["/var/www/straped/mufon/html2text/40745.html.txt","/var/www/straped/mufon/org/40745.html"],"Latitude":"43.07072","City":"Ohsweken","Date of the Event":"07/11/2012 11:00 UTC","Region":"Ontario","Date Submitted":"07/12/2012 03:48 UTC"}