{"Date Submitted":"07/12/2012 05:45 UTC","Weather Factors":"Unknown","Object Features":"None","City":"Duluth","Region":"Minnesota","Case Number":"40749","Tags":"City","files":["/var/www/straped/mufon/html2text/40749.html.txt","/var/www/straped/mufon/org/40749.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.783164,+-92.095082(40749)&iwloc=A&hl=en\"> mufon case (40749) map </A>","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","trends":["There have been 16 other sightings in Duluth","There was one other sighting in Duluth on or around June 19th 2012"],"Longitude":"-92.095082","Latitude":"46.783164","divs":["Sighting DetailsJune 19th 2012 on my way to work about 5 AM I stopped in the Duluth Minn. Ship canal to take some pictures of a beautiful sunrise just coming up over Lake Superior. I noted a light in the sky to the north east about 20 degrees up and approximately 3-5 miles away which I passed off as sun reflection or something ... not really paying notice to it. I got to work and discussed the sunrise with another work mate and he mentioned \"Did you see that weird light\" I stated yes what was it? we then reviewed the pics and agreed it was unusual. The object we saw was glowing gold like the sunrise and did not move or moved very little but was under the cloud cover so as not to be a satellite or star and I have noted that the moon is in the SE at this time in morning.I took my pics for about 10 minutes and left for work, The object was there when I left. After viewing the photos and enlarging them I thought I should notify MUFON. I have lived on Lake superior all my life have watched hundreds of sunrises and have never seen anything like that before. I was in the military and was a trained observer, I know this was no conventional aircraft and have checked the scene several times since and have seen nothing in that area of the sky such as stars,satellites or planets. nothing visible in the sky at all at that time of morning except the sunrise. I may add that the area had been having heavy storms for a few days and the area of Duluth MN. neighboring Superior WI. and nearby areas were severely flooded the following day Could you please contact me and let me know what you folks think?"],"Log Number":"US-07122012-0023","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Oval","Date of the Event":"06/19/2012 05:10 UTC","Country":"United States","Source":"MUFON","Summary":"Taking pic of sunrise cauht object in frames. several pictures over several minutes"}