{"Object Features":"Undisclosed","Tags":"City","Summary":"Summer 2000, large V shaped craft at low altitude, night sighting","Weather Factors":"Unknown","Object Shape":"Boomerang","Object Flight Path":"Path with directional change","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/40758.html.txt","/var/www/straped/mufon/org/40758.html"],"Sighting Duration":"Undisclosed","Latitude":"36.120656","Date Submitted":"07/12/2012 10:48 UTC","divs":["Sighting DetailsI was in the parking lot of the very quiet and secluded community I lived in. It was a little after 1:00am, and I had just returned home from my job where I had the late shift. I looked up at the sky, on my way towards my apartment front door, and directly above me was a HUGE boomerang shaped craft gliding silently from a Northern direction and headed in a Southern direction. It was completely silent, and it almost entirely blocked out the sky from my view as it flew over my head. The body of the craft was very dark and smooth in appearance, it looked almost black, and there were five large circular lights in total, on the underside of the craft. There was two lights on each wing of the boomerang and one at the head of the boomerang. These lights were very large perfect circles which were white in color and they did not give off any glare or reflective light. They looked like they were fairly deep circular recesses in the craft and the light seemed to be almost gaseous because the light seemed to ripple though it did not waver in intensity. I was dumbfounded on how it could be so huge and make no noise. It was at a very low altitude, approximately 10 stories high, would be my best quess. It flew over my head and I could see it completely clearly in detail, and it proceeded to fly over the two story apartment building that was about 30 feet in front of me. It then changed direction easily and turned left and proceeded to fly over the very dark golf course which was directly behind the apartment building. I watched it until it flew beyond my range of sight. I told a co-worker about it the next day, and he told me about the Phoenix Lights sightings which I had not heard about before. I researched it and recognized that what I had seen was the same exact type of craft as the V shaped craft seen over Arizona, and it had very similiar characteristics. Since then, I have also read online about how a tourist fairly recently videotaped the same exact type of V shaped craft with five white lights on its underside, right over Las Vegas near the Treasure Island Hotel. That hotel is very close to where I had my sighting in 2000. Perhaps the craft is alien in origin, or perhaps it is a covert Air Force craft."],"Log Number":"US-07122012-0031","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 1st 2000"],"Date of the Event":"08/01/2000 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.120656,+-115.167176(40758)&iwloc=A&hl=en\"> mufon case (40758) map </A>","Region":"Nevada","City":"Las Vegas","Case Number":"40758","Longitude":"-115.167176","Disposition":"Unresolved"}