{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/40760.html.txt","/var/www/straped/mufon/org/40760.html"],"Case Number":"40760","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"07/13/2012 01:30 UTC","Region":"Rhode Island","Tags":"City","Latitude":"41.966667","Log Number":"US-07132012-0002","Summary":"Small starlike object dancing around like a fly, about as small as stars in the little dipper. changed color blue/white to yellow/orange while dancing around. watched for 10 minutes until it floated behind treeline.","Object Flight Path":"Path with directional change,Other","Longitude":"-71.432778","trends":["There have been 2 other sightings in Cumberland","There were no other sightings in Cumberland on or around July 13th 2012"],"City":"Cumberland","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Object Shape":"Circle, Fireball, Other","Date Submitted":"07/13/2012 02:06 UTC","divs":["sighting detailsstanding in my doorway at home waiting for food to cook, went outside to look at the sky (i dont know what made me do it). after surveying the sky, i noticed that this light was just barely changing and moving at the same time. to make sure it was moving, i sat down, and lined it up with the trees, and sure enough this thing was dipping down and dissapearing behind the trees, then shooting right back up. i first though it was a star, but our stars don't move like that. this object wasa small ball\\star like orb changing colors from a cold blue color, to a warm strongish color. this thing flew around like a bug or something, small, unpredictable motions, as if it were its own life form. this is the second time i have taken the time to look up at the sky and noticed something strange like this. it leaves me in awe. object dissapeared behind tree line, haven't seen it since."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.966667,+-71.432778(40760)&iwloc=A&hl=en\"> mufon case (40760) map </A>"}