{"divs":["Sighting DetailsI was awake last night becuase i could not sleep. I could not get to sleep so i was on my cell phone looking up random things and my email around 3am or so. At apprx. 3:30am i began to hear a noise and it became very loud, at first i thought it was a plane, but nothing like i've heard before. It seemed to be hovering above my house for some time but I could not see anything in the sky. the Sky seemed to have a slight glow and was a little cloudy. I have been around aircraft my whole life and I can recognize almost anything but I have never heard a craft sound like that. It also did not have a doppler effect, the noise when it did start to move did so from North to South. One would expect the noise to drop off quickly when leaving but it did not do that, is seemed to be emitting noise from all directions. After 3 mins it disapated, while moving south, the noise dispeared because of distance and not direction of \"engines\" which is what would be expected if it was an aircraft of some kind. I am not sure if anyone else heard this, although the noise was very very loud it did not rattle any widows or doors, which is strange. I have never reported on this type thing before. I am hoping that perhaps this group knows what it could have been or have had other reportings of this in this area. If I ever hear this again I will try to record it. Thank you."],"Source":"MUFON","Country":"United States","Region":"Ohio","Date of the Event":"07/13/2012 03:30 UTC","Summary":"Very loud noise, did not have a usally doppler like effect with other known objects that fly. Last about 3 mins and seemed strange with a soft glow and cloudy.","Latitude":"40.419307","Object Shape":"Unknown","Disposition":"Unresolved","Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"07/13/2012 10:21 UTC","files":["/var/www/straped/mufon/html2text/40765.html.txt","/var/www/straped/mufon/org/40765.html"],"trends":[],"Tags":"City","Longitude":"-82.903423","Object Flight Path":"Hovering then path","Case Number":"40765","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.419307,+-82.903423(40765)&iwloc=A&hl=en\"> mufon case (40765) map </A>","Log Number":"US-07132012-0006"}