{"Case Number":"40764","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","divs":["Sighting DetailsOn February 1st 2003 I was at work and stepped outside just before daybreak to smoke a cigarette. It was still dark outside when I noticed a huge orange ball of fire tumbling slowly gliding overhead travelling in a north easterly direction. It was very large and absolutely silent as it drifted toward earth and although I could not observe its trajectory, I knew it was falling and would probably hit the earth within 20 to 40 miles from where I was standing. At one point I tried to measure it by holding my arms open and positioning my left and right hands as if I were holding the object. My hands were approximatyely 18 inches apart, it was big. As it neared the tree line, I ran back into the building and alerted one of my co-workes to take a look at this unusual phenomenon. It must have taken her a few minutes to gather her things because when she and I exited the building, day had broke, the fire ball had vanished leaving no visible evidence that it had ever existed, no trail of smoke, nothing. A co-worker who happened to be driving to work at the time stated that she had seen a glowing orb falling from the sky at approximately 120 degree angle. She concurred that it was travelling rather slow but claimed that it did not appear that large (which meant that the fire ball must have been closer to where I was). She was travelling from Vacaville to the Sonoma Developmental Center, Eldridge California and I was at SDC at the time I observed the ball of fire. Later that day I learned of the Space Shuttle Columbia's disintigration shortly after it reentered the earths atmosphere. When I told friends what I had seen they suggested that perhaps I had seen parts of the space shuttle columbia. I am quite certain that what I saw was not peices of burning debria from the columbia because what i saw was bigger than the space shuttle itself and...I learned that the columbia did not begin to fall apart until it was somewhere above Nevada. I saw a film clip of the columbia disintigrating above Texas, it was still relatively high in the sky and you could discern the shape ofthe craft, what I saw was engulfed in flames, it was round and did not appear to resemble the shape of a space shuttle. I know of only one other person who saw a tumbling ball of fire that morning. If you know anythingabou this I would appreciate it if you could pass that along to me"],"Tags":"City","Sighting Duration":"Undisclosed","Latitude":"38.342837","trends":["There have been no other sightings in Eldridge","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/40764.html.txt","/var/www/straped/mufon/org/40764.html"],"Summary":"Huge tumbling ball of fire falling silently","Date Submitted":"07/13/2012 08:05 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.342837,+-122.512046(40764)&iwloc=A&hl=en\"> mufon case (40764) map </A>","Country":"United States","Longitude":"-122.512046","Source":"MUFON","Log Number":"US-07132012-0006","Weather Factors":"Unknown","Disposition":"Unresolved","City":"Eldridge","Object Features":"Undisclosed","Date of the Event":"02/01/2003 05:45 UTC"}