{"Longitude":"-122.329137","Object Flight Path":"Path then hovering","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=48.422256,+-122.329137(40761)&iwloc=A&hl=en\"> mufon case (40761) map </A>","Viewing Distance":"Unknown","Summary":"3 Orbs in the sky that just \"went out\"","Tags":"City","Weather Factors":"Unknown","Region":"Washington","Date of the Event":"07/04/2012 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/40761.html.txt","/var/www/straped/mufon/org/40761.html"],"Latitude":"48.422256","Date Submitted":"07/13/2012 02:26 UTC","Log Number":"US-07132012-0003","Disposition":"Unresolved","divs":["sighting detailswhile setting off fireworks and watching the city fireworks (on the 4th of july) from my parents house my mom, brother, wife, sister, and i saw three separate red\\orange\\white orbs in the sky. this was shortly after the city fireworks display. the objects were changing colors and moved slowly. at first they appeared to be at a low altitude(slightly above the maximum height of the professional fireworks),and then gained altitude. two objects were side by side while the third object was at a greater distance the lower right. i followed the two and went to look at the third while the other two objects just vanished. the third object then disappeared as well within a few seconds of the others. since we were filming the fireworks i was able to get video of the 3rd object once i realized the objects did not appear to be a plane\\helecopter\\firework\\balloon. i looked up on the internet today after going through our vacation pictures and wondered if anyone else saw the objects. i noticed on the site that someone else did as well so i thought i would report it as well."],"Object Shape":"Oval","trends":["There have been 4 other sightings in Mt Vernon","There was one other sighting in Mt Vernon on or around July 4th 2012"],"City":"Mt Vernon","Case Number":"40761","Source":"MUFON"}