{"City":"Tigard","Log Number":"US-07132012-0005","Case Number":"40763","Weather Factors":"Unknown","trends":["There have been 11 other sightings in Tigard","There were no other sightings in Tigard on or around July 13th 2012"],"Date Submitted":"07/13/2012 07:17 UTC","divs":["Sighting DetailsMy Roommate and I were outside on the porch having a cigarette when I noticed in the distance a red and white light going from left to right through a tree that was blocking my visual path. It then stopped and moved right to left, pulsating red and white. There was no pattern to the lights in any way. It seemed as if it were rotating. I quickly grabbed my binoculars while my roommate watched it. It continued going back and forth on the horizon while lowering elevation. It then started moving closer to our location. We then decided to get in our car and get closer to the object. We ended up a town over and more closer then we expected. it was still moving back and forth and circling. It was maybe 20 ft above the tree line then just circled around and changed course. One big figure eight pattern. Then left and right. I told my roommate it added light-blue lights to it's pattern as it was circling he responded with, \"I can only see red and white. No blue at all\". It was so close not to see the colors. It then went behind another tree line were we lost track of it. We followed it in the direction it seemed to head but it just vanished. No sign of it after it headed south. I called my friend up and she had told me some of her friends in our area had witnessed the same craft at the same time. I've seen U.F.O's before but this time I never expected to get so close to it."],"Source":"MUFON","Date of the Event":"07/13/2012 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.43318,+-122.797029(40763)&iwloc=A&hl=en\"> mufon case (40763) map </A>","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40763.html.txt","/var/www/straped/mufon/org/40763.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Unknown","Region":"Oregon","Disposition":"Unresolved","Country":"United States","Longitude":"-122.797029","Latitude":"45.43318","Object Features":"Unknown","Summary":"Bright white and red lights travelling in a non-conventional way."}