{"Case Number":"40777","Latitude":"41.226972","Region":"Indiana","Object Flight Path":"Hovering then path,Path with directional change","Longitude":"-86.415855","Source":"MUFON","Log Number":"US-07142012-0002","Summary":"Hovering reddish orb with white glowing dome like light","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40777.html.txt","/var/www/straped/mufon/org/40777.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.226972,+-86.415855(40777)&iwloc=A&hl=en\"> mufon case (40777) map </A>","divs":["sighting detailsat approx 10:25pm (tonight 7\\13\\2012), i was coming home from work. i was travelling south bound on a well known road that i drive everyday. by this time, it was darker than normal possibly due to cloud cover. i was driving over a hill and over to my right view, i noticed a reddish light\\orb hovering in the sky within 500 feet from my car. it just just above tree top. it caught my eye immediately and i thought to myself \"they didn't put a cell phone tower there.. what the heck is that?\" it was approx that height of a smaller tower. but as i got closer to the light, it stayed hovering, still, no movement. i started to slow my car down to approx 10mph and while looking at it closer, i noticed a reddish type of light that had a different look to it almost as if a candlelight warmth glow. but underneath the red light appeared to have a white glowing light. almost as if they were the same light.. top side red, underneath white. as i'm driving slowly, south bound, i noticed an suv parked on a side road watching this light as well. she was parked facing east and the light was to her left side. i drive about 100 ft and turn around to face north bound to watch this light.. during that 10 sec of me turning around, the light moved about 2000 ft due west from the original hovering spot. i'm watching this light and notice the person in the suv sped off quickly. i wave to stop her to talk about the sighting but she drives off and she looked to be upset. my eyes turn back to this light and within a fraction of a second, the light took off at the most unimaginable speed that i have ever seen. it looked to have taken off northwest. i sped home, upset, chills with an uneased eerie feeling. i don't know if i can sleep tonight. i feel the need to report this immediately."],"Disposition":"Unresolved","Date Submitted":"07/14/2012 12:15 UTC","Country":"United States","trends":["There have been 5 other sightings in Culver","There was one other sighting in Culver on or around July 13th 2012"],"Date of the Event":"07/13/2012 10:25 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Culver","Weather Factors":"Unknown","Object Shape":"Egg, Fireball","Object Features":"Dome","Tags":"City"}