{"Date Submitted":"07/14/2012 02:14 UTC","Object Shape":"Unknown","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Case Number":"40779","Log Number":"US-07142012-0004","map":"<A HREF = \"http://maps.google.com/maps?q=44.42324,+-69.476163(40779)&iwloc=A&hl=en\"> mufon case (40779) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"09/01/2000 12:00 UTC","Region":"Maine","Source":"MUFON","Country":"United States","Object Features":"Unknown","Summary":"SILENT UFO APPROACHED, I FLASHED HEADLIGHTS, OBJECT TURNED ON BRIGHT MULTICOLORED LIGHTS DIRECTLY AT US, THEN TURNED OFF AND SLOWLY DRIFTED AWAY.","files":["/var/www/straped/mufon/html2text/40779.html.txt","/var/www/straped/mufon/org/40779.html"],"City":"China","Longitude":"-69.476163","Latitude":"44.42324","divs":["Sighting DetailsIn roughly September of 2000 my cousin and I were sitting in my car which was stationary, parked with all lights and power off watching the lights of planes from the south 5 miles away move along the horizon and disappear to the eastern horizon. All planes had flashing indicator lights and produced sound except for one which was by itself and approached much closer at about 1-2 miles toward the horizon. The object moved very slowly at about 20-30 miles per hour and had a bright fixed headlight like a searchlight, but made no sound, had no blinking indicator lights and had no visible outline even as it approached 500 feet maximum from our position. When the object was directly in front still at 500 feet maximum and above a field at altitude of no more than 200 feet, I jokingly told my cousin \"watch this\" and flashed my headlights which were off . Within 1-2 seconds of flashing my headlights the object which had no visible lights except the spotlight suddenly illuminated us with a staggered row of colored lights. After 5 seconds the lights completely turned off and the object which was almost completely in a hover, changed course and moved slowly and silently away from us and toward the treeline. There were no other lights from the object and it slowly disappeared into the night without a sound. Additionally my friend who had stayed in a cabin on the opposite side of the hill years before had been awakened one night by lights outside the cabin with tremendous shaking of the structure. He who was a brave and courageous individual whom I never saw afraid said he was mortally terrified as he hid in a ball from the object and event taking place. Thank you for your time, the experience still captivates and haunts me."],"Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in China","This sighting has never been favorited."]}