{"Case Number":"40786","Region":"Arkansas","Summary":"Triangle UFO seen up close in great detail.","Viewing Distance":"101-500 Feet","City":"Camden, AR","Date Submitted":"07/14/2012 04:16 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/40786.html.txt","/var/www/straped/mufon/org/40786.html"],"trends":["There have been 2 other sightings in Camden, AR","There were 2 other sightings in Camden, AR on or around September 19th 2011"],"Source":"MUFON","Date of the Event":"09/19/2011 07:45 UTC","Weather Factors":"Unknown","Object Features":"Louvres, Other","Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=34.244254,+-91.279884(40786)&iwloc=A&hl=en\"> mufon case (40786) map </A>","Object Flight Path":"Straight-line path","divs":["sighting detailsseptember 19th, 2011 7:45 pm arkansas hwy 167 in camden, ar black triangle ufo with many little red, green, and blue colored lights and two rectangular pulsating light panels with light from pale yellowish to bright white pulsations. craft hovering and moving slowly at about two to three miles per hour in a stright line path headed south above tree tops about 200 feet over the ground. could see the craft in great detail. silent. crossing the hwy at a diagonal just inbetween the newly built sherrif's complex and a business called steel deals, metal sales yard and building. headed north in my vehicle into camden, ar just past the railroad tracks where they cross hwy 167, i saw a light in the distance just over the tree tops flashing colors there are cell towers that have white flashing lights as you approach this area and as i noticed this light flashing different colors that caught my attention. in the distance it looked like a tower light except as i got closer to where i would see it directly overhead the size was getting larger while the tower lights remained normal size. there was absolutely no sound. the other traffic did not seem to notice the craft or at least i was the only one stopped and looking at it from the side of the road. the panels went from steady bright\\dim pulses to getting real bright. like it was powering up. it then took off at breakneck speed headed south, where it was seen by another witness 15 miles from where i saw it in a community called frenchport, ar. i found this out later when a friend told me that he was talking to someone on the phone in frenchport who discribed the dame craft at the same time. so it went 15 miles in an instant. see drawing attached then, just as i got to where the sherrif's complex is on the right, and steel deals on the left, i pulled over on the shoulder and put my vehicle in park and rolled the window down. i was awe stricken as i watched this craft that was lit up like a christmas tree float silently and pass directly overhead so close that i could see the roundness of each little colored light which were grouped in sections all along the underbelly of the triangle ufo. in the midsection were two pulsating"],"Tags":"City","Latitude":"34.244254","Log Number":"US-07142012-0011","Disposition":"Unresolved","Longitude":"-91.279884","Object Shape":"Triangle"}