{"Tags":"City","files":["/var/www/straped/mufon/html2text/40797.html.txt","/var/www/straped/mufon/org/40797.html"],"Object Flight Path":"Path with directional change","Country":"Canada","Case Number":"40797","Object Shape":"Star-like","trends":["There have been 33 other sightings in Vancouver","There were no other sightings in Vancouver on or around July 12th 2012"],"Longitude":"-123.124316","Date Submitted":"07/14/2012 07:01 UTC","Object Features":"Unknown","Disposition":"Unresolved","Summary":"Night vision monucular capture Extremely fast star or meteor like object changing multiple direction,","Latitude":"49.273958","City":"Vancouver","map":"<A HREF = \"http://maps.google.com/maps?q=49.273958,+-123.124316(40797)&iwloc=A&hl=en\"> mufon case (40797) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsAt approximately 1130 at night I observed a fast moving object with my night vision monucular at about 60 degrees above the horizon just above Ursa Major. I filmed the episode on a cheap portable DVR for about 5 seconds until I lost it. I was on my balcony in the heart of Yaletown, Vancouver, there were no clouds or airplanes in the vicinity or anything observable with the naked eye except a few stars. I was hoping to view a sateliite, which I did moments before ( also filmed) or at least it looked like one. When I first noticed the fast moving object, I thought it was a meteor but it soon changed direction moving from right to left then it immediately when straight down, lost it for a second and then it immediately when straight up but slow down, twirled like a toy and then picked up speed until I lost it...really have no idea what this could be ..no way it is a bird or any land object due to the monucular was focused to the stars at 5x power, a bug or bat would not be observed due to the size. I would love answers!! I have a 5 sec video but on MP4 format 11MB and can't attach as too big unless I figure a way to compress..please contact me and I can send via email. Thank you Charles"],"Date of the Event":"07/12/2012 11:30 UTC","Region":"British Columbia","Log Number":"CA-07142012-0019","Weather Factors":"Unknown"}