{"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Summary":"To me it resembled a train boxcar flying across the sky. It did not fly very fast but it was flying faster than an airplane.","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Window(s)","Weather Factors":"Unknown","divs":["Sighting DetailsMy cousin and I, were sitting on my front porch. We looked directly in front of us and up and we saw 2 very bright lights as if a plane was approaching. But then we noticed that it was flying sideways and not towards us. I immediately recognized that it was not an air craft because it did not have the blinking lights on it. It was very bright and weird looking. It looked like a train car flying through the air with two big windows on the side. This is where the two lights were coming from. It moved swiftly but not \"whoosh\" like. It was faster than a plane though. It flew silently by us and we tried to get it on video but my phone was not picking it up. It was in our visual sight for about five minutes. Immediately after that a plane flew by, very very high in the air but we could see the flashing lights on it. Right after that a military jet, solid black, it looked like a stealth bomber, flew over us and turned around as if it was chasing the boxcar shaped object. The jet also had flashing red, white and blue lights on it. I have never seen a stealth bomber in person so I cannot describe them but I think that is what the jet was. I have never seen anything like this before, it was weird and creepy but very exciting because now I am a complete believer!!!! Thanks guys and keep up the good work! Amber N. Stewart"],"Log Number":"US-07142012-0017","files":["/var/www/straped/mufon/html2text/40795.html.txt","/var/www/straped/mufon/org/40795.html"],"Country":"United States","Date of the Event":"07/13/2012 12:00 UTC","City":"Dallas","Object Shape":"Square, Rectagular, Other","Case Number":"40795","Tags":"City","Latitude":"32.720426","Date Submitted":"07/14/2012 05:23 UTC","Longitude":"-96.775817","Viewing Distance":"Unknown","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around July 13th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.720426,+-96.775817(40795)&iwloc=A&hl=en\"> mufon case (40795) map </A>","Region":"Texas"}