{"Log Number":"US-07142012-0015","Longitude":"-77.406737","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.571585,+-77.406737(40792)&iwloc=A&hl=en\"> mufon case (40792) map </A>","Object Shape":"Circle, Disc","Disposition":"Unresolved","City":"Mifflintown","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Other","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/40792.html.txt","/var/www/straped/mufon/org/40792.html"],"Date of the Event":"07/04/2012 09:30 UTC","Date Submitted":"07/14/2012 11:38 UTC","Latitude":"40.571585","Region":"Pennsylvania","Case Number":"40792","Country":"United States","Viewing Distance":"Over One Mile","Summary":"PULSATING L IGHTS3 INTRIANGLE 1 MUCH BIGGER IN MIDDLEOTHER PEOPLE SAW IT TOO COLOR BLIND SO DON<T KNOW COLORS CAME NEXT 2 HIGHTS ALOT OF PLANES LIKE 10 WERE FLYING ATFER 1ST NIGHT WITH DOUBLE PROP HELICOPTERS HAVE MORE IMFORMATION CALL IF NEEDED","trends":["There has been one other sighting in Mifflintown","There was one other sighting in Mifflintown on or around July 4th 2012"],"divs":["Sighting DetailsI HEARD FIREWORKS GOING OFF OUTSIDE SO I WENT OUT AROUND 9:30 OR 9:45. i WALKED TO THE TOP OF MY YARD BECAUCE I COULD SEE A STRANGE LIGHT COMING OVER THE MOUNTAINS IN THE MIDDLE OF MIFFLIN. IT LOOKED LIKE IT WAS SPINNING, SO I RAN INSIDE TO GET MY BINOCULARS. THE STRAP FOR THEM WAS TANGLED UP WITH SOME WIRES SO I BROUGHT EVERYTHING OUT WITH IT. THE LIGHT HAD STARTED TO THE LEFT OF ME BUT BY NOW LIKE A MINUTE LATER IT WAS ALMOST DIRECTLY IN FRONT OF ME OVER THE MOUNTAIN RIDGE ACROSS TOWN LIKE A MILE OR SO AWAY BY NOW WITH THE BINOCULARS I COULD SEE IT VERY CLEARLY AND WITHIN A VERY SHORT MOMENT IT SHOT OFF IN A STEAK. I DIDN'T THINK I WOULD SEE ANYTHING AFTER THAT BUT I WAS PRETTY STUNNED SO I STOOD THERE AND IN LIKE A MINUTE ANOTHER ONE CAME FROM EXACTLY THE SAME PLACE AND FOLLOWED THE VERY BOTTOM EDGE OF THE CLOUDS. THEY KEPT APPEARING THE SAME AMOUNT OF TIME APPART AND WENT EXACTLY THE SAME WAY. I WAS SO EXCITED I LOST COUNT OF THEM, BUT THERE WERE AT LEAST 7 TO 8 THAT I SAW. THEY ALL LOOKED THE SAME DARKENED DISK SHAPES WITH 1 BIG LIGHT IN THE CENTER AND 3 SMALLER ONES IN A TRIANGLE FORMATION AROUD IT WITH CURVED LINES OF LIGHT BETWEEN THE 3 OUTER LIGHTS, BUT NOT CONNECTING THEM. THE LIGHTS WERE PULSATING AND SORT OF LIKE FLASHING, IT REMINDED ME O IT F 1 OF THOSE OLD SIMON SAYS GAMES FLOATING UPSIDE DOWN. I AM PARTIALY COLOR BLIND SO I DON'T KNOW WHAT COLORS IT HAD,BUT THERE WERE A FEW DIFFERENT ONES FOR SURE. I HAVE A FRIEND THAT SAW 1 OF THEM THE FIRST NIGHT FOR ABOUT 45 MINUTES AND ALSO SAW THEM ON THE 4 AND THE 5TH AND 6TH TOO. I AM TWENTY EIGHT AND I HAVE SEEN THESE LIGHTS AROUND H,LIKE PROBABLY JUST A COUPLE OF HUNDREDERE BEFORE,BUT NEVER MORE THAN 1 AT A TIME. ABOUT A HLF AN HOUR LATER I HEARD A DOUBLE PROP HELICOPTER FLYING THE SAME DIRECTION AS THE CRAFTS E ARLIER. I KNEW IT WAS THAT KIND OF HELICOPTER BECAUSE BLACK ONES FLY OVER MY HOUSE ALOT,REALLY LOW, MAYBE A COUPLE HUNDRED FEET ALL BLACK NOTHING ON THEM. I WOULD LIKE TO HEAR BACK FROM YOU IF ANYONE ELSE HAS REPORTED THIS EVENT OR IF YOU NEED ANY ADDITIONAL INFO. AND ONLY 2 OF THEM SREAKED OFF THE OTHERS JUST BLINKED OUY. IT WAS SOME CRAZY LOOKINK STUFF THATS FOR SURE. I DON'T KNOW HOW TO SEND DRAWING SORRY BUT HAVE 1 MADE."],"Sighting Duration":"Undisclosed"}