{"files":["/var/www/straped/mufon/html2text/40801.html.txt","/var/www/straped/mufon/org/40801.html"],"Source":"MUFON","Summary":"2 silver crescent shaped craft over Southern California, Sept 2011","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.143056,+-118.736944(40801)&iwloc=A&hl=en\"> mufon case (40801) map </A>","divs":["Sighting DetailsI was walking out of the post office in a somewhat rural neighborhood at around noon, and it was a bright clear day with a blue sky and no visible clouds. As I walked to my car, i looked up and saw what i assumed were just two small, silvery-white planes heading from the West towards the East. Then I saw them change direction rather randomly several times. Both of the craft were able to hover and then move to left or right easily, unlike anything i have ever seen. Seeing their unconventional abilities, I took out my cellphone and took a picture of them but they were too far away, and on the picture they only showed up as two very small silver blurs. After viewing them for about 2 to 3 minutes approximately, a commercial airline passed over them, and it was at a higher altitude then the two unidentified crafts. I noticed that the two crafts where much smaller than the plane, each being only about a third as big as the commercial plane. After approximately 1 to 2 more minutes of watching them do unconventional changes in direction, they both proceeded to head due East, and they flew directly over my head. I was then able to clearly confirm that they were both entirely solid, silvery white in color, perfectly crescent shaped craft that looked like they were made out of metal, and they seemed to be flying slightly faster than the typical small plane i have seen from time to time in the same area. They were definitely not conventional craft, but perhaps military drones or other such terrestrial craft that is still covert, or perhaps they are alien in origin."],"Sighting Duration":"Undisclosed","Date Submitted":"07/14/2012 08:21 UTC","Log Number":"US-07142012-0022","Tags":"City","Country":"United States","Object Flight Path":"Other","Disposition":"Unresolved","Latitude":"34.143056","Region":"California","Date of the Event":"09/10/2011 12:00 UTC","City":"Agoura","trends":["There has been one other sighting in Agoura","There were no other sightings in Agoura on or around September 10th 2011"],"Longitude":"-118.736944","Object Shape":"Other","Object Features":"Wings, Other","Case Number":"40801"}