{"Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Longitude":"-119.412082","Log Number":"US-07142012-0024","Summary":"10 silvery white objects, unconventional maneuvers","files":["/var/www/straped/mufon/html2text/40803.html.txt","/var/www/straped/mufon/org/40803.html"],"Object Features":"Undisclosed","Latitude":"36.788061","Country":"United States","divs":["Sighting DetailsIn April of 2012, I was leaving a hair salon and I looked up at the sky. It was a beautiful, clear, blue sky day. I had seen unconventional aircraft in the general area in Sept 2011 on two occasions (case study 40801 & 40802) so I definitely made sure to check the sky on a routine basis in case I might see unconventional craft in the area again. When I looked up, I saw what appeared to be 10 silvery white objects flying in formation. They were too high in altitude for me to see their shape clearly, but the general shape would be that of a fat, almost crescent shaped,chevron. I assumed they were seagulls. I decided to watch them longer and I noticed there was no wing strokes or any means of propulsion that I normally observed when viewing flying seagull and egrets frequently in the area. Then 3 of the objects became entirely stationary and hovered, while two of the other objects reversed direction, and then took up position by two of the other unidentified objects they had been flying in front of. I then saw one of the other objects reverse and fly directly at one of the objects that was flying behind it but they did not collide, and instead the object that had reversed passed under the other object and continued in its reversed direction. I realized one of them must have been of course at a slightly lower altitude to successfully complete that very, very unusual maneuver. The reversed object then reversed direction again and proceeded to head in its original direction heading towards the East. I will add that the reversal of direction was entirely effortless and the objects that I had seen reverse direction could do so without having to make a wide arc like a normal aircraft. The 10 objects proceeded to fly in a Eastern direction, very close in their flight path to where I had the two other sightings in the area in Sept 2011. These definitely were not conventionally known aircraft, though they certainly could be drones or some other type of covert terrestrial craft."],"Case Number":"40803","City":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Region":"California","trends":[],"Date Submitted":"07/14/2012 09:42 UTC","Object Shape":"Chevron, Circle","Viewing Distance":"Unknown","Disposition":"Unresolved","Date of the Event":"05/01/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.788061,+-119.412082(40803)&iwloc=A&hl=en\"> mufon case (40803) map </A>"}