{"Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-07142012-0028","Latitude":"40.451698","Disposition":"Unresolved","Case Number":"40807","Longitude":"-75.336667","Region":"Pennsylvania","Date of the Event":"07/14/2012 09:15 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Quakertown","Tags":"City","Sighting Duration":"Undisclosed","Summary":"multiple bright lights appeared in the sky on after another like helicopters they flew up in a upward line and disappeared in the clouds. no sound was heard","Country":"United States","divs":["Sighting DetailsSeveral of us were sitting on the patio when I looked up in the sky and seen a light appear over the hill. It appeared to be a helicopter because of the blinking bright lights so I watched it and them another appeared behind it. I told the people I was with that it was strange for a helicopter to be in our area when all of a sudden another light appeared. we could not tell the shape of the objects because of the bright light but they looked like helicopters but there was no sound and then 4 more appeared. They flew up into the sky and disappeared as soon as they went into a light cloud. There was approximately 9 flying objects that flew in a upward angled path. We all sat there trying to figure out what we had just seen but could not come up with an explanation. They flew almost in a formation like pattern. If they were helicopters we would have heard some type of sound because they were close enough to our location. The sky had some over cast but the sky was clear above the cloud were they all disappeared. We kept waiting for the to reappear but they didn't."],"files":["/var/www/straped/mufon/html2text/40807.html.txt","/var/www/straped/mufon/org/40807.html"],"trends":["There have been 12 other sightings in Quakertown","There was one other sighting in Quakertown on or around July 14th 2012"],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date Submitted":"07/14/2012 11:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.451698,+-75.336667(40807)&iwloc=A&hl=en\"> mufon case (40807) map </A>","Object Shape":"Unknown"}