{"Object Flight Path":"Stationary,Straight-line path,Path then hovering","divs":["Sighting Details A nearby relative of us called and told us to look outside and up at the sky because something unusual was happening. She told us that there were around 8 white orbs in the sky starting low in the air and going above cloud cover, and they were all fairly close to each other. By the time we went outside, there were 3 or 4 doing the same thing. What amazed me the most was how low they were to the ground (relative to a plane), the distance between each craft, and how fast they were moving. They were moving 2X the speed of a military plane, but were not as close together as military aircrafts were. They kept a constant direction and didn't blink their lights keeping an orb like shape. It was hard to tell, but they looked like they were spinning. Our relative said she saw red light, but i could only see white BRIGHT light, brighter than any plane I have seen. At first glance I started going through the things it could not be, I quickly came to the conclusion it was extraterrestrial. It was a really cloudy night here in PIttsburgh, so in about 20 minutes, all of the spacecrafts went above the clouds and disappeared. A couple of them appeared in a break in the clouds later, they looked like meteors or satellites."],"Longitude":"-79.966792","Latitude":"40.635287","Log Number":"US-07142012-0026","Summary":"a orb with white light hovered then flew in straight path more than 50","Country":"United States","Object Shape":"Circle, Disc, Sphere, Star-like","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There has been one other sighting in Gibsonia","There were no other sightings in Gibsonia on or around July 14th 2012"],"Date of the Event":"07/14/2012 09:45 UTC","Viewing Distance":"101-500 Feet","City":"Gibsonia","Disposition":"Unresolved","Object Features":"Unknown","Weather Factors":"Unknown","Case Number":"40805","files":["/var/www/straped/mufon/html2text/40805.html.txt","/var/www/straped/mufon/org/40805.html"],"Date Submitted":"07/14/2012 10:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.635287,+-79.966792(40805)&iwloc=A&hl=en\"> mufon case (40805) map </A>","Region":"Pennsylvania"}