{"divs":["Sighting DetailsI was watching tv in my family room, my daughter was upstairs and said she heard a weird humming sound, I heard it too but it was probably from washer in basement, I said I was going to check the perimeter which is a running joke in our family anytime anyone thinks they hear or see something outside, anyway I went out and looked up and right over my house there was a red object glowing brighter then dimmer. I watched for a long enough time to see there were no navigation lights blinking, so I ran into the house and grabbed my binoculars, went back outside which took about ten seconds, my wife was reading and asked me what I was doing and I said there was something over the house, I went back and was watching and I could slowly start to actually see the structure, and at the same time the light was dimming until it completely blinked out and I could clearly see the whole shape of the object, completely round and black, my wife came out and I told her where to look without putting down the binoculars, when she said she could see it I looked with my eyes and could see it too, I then kept looking with my binoculars until it disappeared over some houses it never made a sound that I could hear. I was amazed to actually be able to see the structure so clearly, mind blowing! Total time was about two minutes"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.552432,+-88.195483(40808)&iwloc=A&hl=en\"> mufon case (40808) map </A>","Case Number":"40808","files":["/var/www/straped/mufon/html2text/40808.html.txt","/var/www/straped/mufon/org/40808.html"],"Object Shape":"Sphere","Date Submitted":"07/14/2012 11:40 UTC","Tags":"City","Longitude":"-88.195483","Summary":"Red glowing bright/dim object over my house got my binoculars and watched as the light slowly dimmed then blinked out saw a black round object","Date of the Event":"07/14/2012 09:10 UTC","Disposition":"Unresolved","Log Number":"US-07142012-0029","Country":"United States","Source":"MUFON","Object Features":"Undisclosed","City":"Plainfield","Latitude":"41.552432","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Region":"Illinois","trends":["There have been 20 other sightings in Plainfield","There were no other sightings in Plainfield on or around July 14th 2012"],"Sighting Duration":"Undisclosed"}