{"Disposition":"Unresolved","trends":["There have been 11 other sightings in Barstow","There were no other sightings in Barstow on or around July 8th 2012"],"Source":"MUFON","City":"Barstow","Object Features":"Unknown","Date of the Event":"07/08/2012 04:05 UTC","Latitude":"34.902166","Date Submitted":"07/15/2012 04:18 UTC","Viewing Distance":"Unknown","Log Number":"US-07152012-0007","map":"<A HREF = \"http://maps.google.com/maps?q=34.902166,+-117.013423(40816)&iwloc=A&hl=en\"> mufon case (40816) map </A>","Country":"United States","Case Number":"40816","Summary":"2 lights which merged (1 bright white 1 red) became red ring of more than 10 lights then shot straight at me at great speed then disappeared.","Sighting Duration":"00:20:00","divs":["Sighting DetailsDriving (long-haul Truck Driver)North on I-15 between the cities of Baker and Barstow, California. on July 8, 2012 at 4:00 AM I observed 2 unfamiliar bright lights. One was an extremely bright white and the other was red. I said to myself \"These lights do not belong here!\" because I'm familiar with the night sky. After driving several minutes I decided to stop as I wanted to get a better look. The known lights in the sky (Venus and or Jupiter and a reddish light) were stationary and the newly observed lights to the north (left) were slightly moving. I wanted to make sure I wasn't seeing things so I parked on the freeway onramp (see diagram #2)after driving through the rest area outside of Barstow. The truck is still running at this point with 'sirius' radio on. I grabbed my brand new \"smart phone\" that I had never used for photography (so was unfamiliar with it's functionality) and began to take a still photo. What I didn't know was the camera had switched to video mode so my first shot is a video of a red ring of lights. My initial target was the Bright white light but then the red light merged with the bright white light becoming a ring of red lights. I tried to focus on these lights but they were moving. This video is 15 seconds in length only because when I hit the shutter again thinking I was taking a second photo thereby stopping the video. It's possible I had zoomed in. I then realized what I had done. I was standing on the top step outside of the drivers door. I got down to the ground and walked around the front of the truck to right side and out into the field 50+feet away from the truck. As I'm standing there I focused on the bright white light and took the first of 4 still photos. When I took the 2nd pic the light got larger and changed to red-orange. As I got ready to take the 3rd shot suddenly the light shot straight at me increasing in brightness and size. I then hit the shutter. I was able to get 1 more shot before the light disappeared. At this point, I was truly afraid for my life. Poof! it was gone. See diagram #1 for overview of rest area and field depicting where objects seen in sky and relation to nearest cities and freeway. Lastly Diagram #3 shows the sequence of events."],"files":["/var/www/straped/mufon/html2text/40816.html.txt","/var/www/straped/mufon/org/40816.html"],"Weather Factors":"Unknown","Region":"California","Object Shape":"Circle, Sphere, Other","Object Flight Path":"Hovering then path,Straight-line path","Tags":"City","Longitude":"-117.013423"}