{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=49.270626,+-123.105927(40817)&iwloc=A&hl=en\"> mufon case (40817) map </A>","Date Submitted":"07/15/2012 04:30 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was about to get ready to do a night observation with my night vision monocular after watching movie with my brother. I stepped outside my balcony where I observed a UFO 2 nights before, then I noticed a bright red almost Flare like orb moving slowly directly above our condo complex, altitude seemed to be under 5000 feet like plane or helicopter red light but double the size and brighter. I yelled at my brother to look, he first said its a helicopter light then soon light brighttened orange and diamond like, then began to dim to pinpoint and disappeared within 2 secs. I was astonished and wasn't even thinking of hooking up my night vision to my DVR but I did observe the orb, the light was not flashing, pulsating and when it disappeared I could not see it in my night vision monocular and it did not seem far away so it completely disappeared. The sighting lasted approximately 30 seconds from East to West in straight path. This was no re entry meteor or satellite as was too slow, unless this can occur. I know the night sky especially from my own balcony, have owned a few telescopes and this is a first for me as it was 2 nights ago...my brother a complete skeptic was baffled...what is going on this week!!!??? About 10 mins after the disappearance a high flying helicopter circled the area 3 times even taking the same flight path of the object. This helicopter was not making a terrestrial search as he was too high... Anybody else see this object directly over False creek passing over Granville and Burrard Bridge before disappearing...answers please!!!.."],"Region":"British Columbia","files":["/var/www/straped/mufon/html2text/40817.html.txt","/var/www/straped/mufon/org/40817.html"],"City":"Vancouver","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","trends":["There have been 33 other sightings in Vancouver","There was one other sighting in Vancouver on or around July 14th 2012"],"Latitude":"49.270626","Object Shape":"Diamond, Sphere","Case Number":"40817","Longitude":"-123.105927","Summary":"Slow moving bright red orange orb over Vancouver False Creek to English Bay","Object Flight Path":"Straight-line path","Object Features":"Unknown","Date of the Event":"07/14/2012 10:30 UTC","Source":"MUFON","Log Number":"CA-07152012-0008","Country":"Canada"}