{"files":["/var/www/straped/mufon/html2text/40823.html.txt","/var/www/straped/mufon/org/40823.html"],"Date of the Event":"07/15/2012 12:00 UTC","Log Number":"US-07152012-0014","divs":["Sighting DetailsMy husband and I decided to go outside, to look at the night sky, in hopes of witnessing a meteor shower around 2-2:30 am. As we looked up at the night sky, facing south east, looking up, when I saw, what I thought was a satellite but, it seemed to flash. I thought its just a plane. But taking a closer look, it was traveling very,very fast. Too fast for a plane, even a jet and the flash was not consistent. And there was no noise. It traveled across the night sky, looking like a star, but was moving at a exceptional rate of speed and at times traveled erratically,left,right seemed to stop and hover and go again. They looked to be in our atmosphere, in front of stars I was excited, because this was unknown to us. A UFO!!! But what started to happen from that point is still unbelievable to me still. As we watched, another one, just like it came from a totally different direction. As we followed that one and it started to fade out the further they traveled away from us. We noticed another, and then another and so on. Some where dimmer, no flashing, others flashed a little more. They differed in directions, some stopped for more then a second or two, and go again. At times we saw 2 at a time. Traveling in different directions. We couldnt believe what we were seeing, we even woke our oldest daughter, and her friend up, just to verify we werent mistaken. They saw the same objects. We all stood there mystified and in AWE, at what we where witnessing. We continued to see them until the dawn,(4am ish) when they started to come few between, until we saw no more. I lost count around 20. And NO they were NOT shooting stars. WHAT WERE THEY???"],"Latitude":"43.533483","Case Number":"40823","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.533483,+-116.536221(40823)&iwloc=A&hl=en\"> mufon case (40823) map </A>","Date Submitted":"07/15/2012 09:44 UTC","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Other","City":"Nampa","Region":"Idaho","Summary":"Went outside in hopes to see meteors. I witnessed, what looked to be like a satellites,,traveling at HIGH speeds across the night sky . It flashed but unlike an airplane.","Longitude":"-116.536221","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There have been 15 other sightings in Nampa","There were no other sightings in Nampa on or around July 15th 2012"],"Country":"United States","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown"}