{"Region":"Michigan","Log Number":"US-07152012-0016","Summary":"Strange Red Orb like Object in Sky","Object Flight Path":"Hovering then path","Latitude":"42.638849","divs":["Sighting DetailsI was in Rochester Hills driving through to do a drive by check on my mother, I looked up for a second and saw a red glowing object in the sky. At first my thought was \"Oh I wonder if I'm looking at Mars\", sometimes you can see the planets; but then I thought that it wouldn't be right the clouds were blocking the moon and stars so there was no way that this object was Mars, it was located in front of the clouds not behind. So then I thought maybe someone was shooting off fireworks- but that wouldn't work out either because the object was hovering. If it was a firework flare then the force gravity would send it back down, therefore it couldn't hover. This strange object just hovered there for a good minute or two, and then it did a weird dip down, crossed over the right and shot back up to its original spot, creating a triangle like affect. It hovered a few seconds and then it began to wiggle a little; so by that time I pulled down a street to watch it; it moved a little, it kinda glided back and forth. And then it just disappeared. Personally this isn't the first time I've come across a UFO- I've had one sighting a year since 2010, prior to that I saw none. But my parents saw one back in the seventies. And the only physically problem I had was from straining my eyes, it was just some mild dizziness, and eye muscle pain. It was an interesting sight this one was. I wish I would have had the time to fully grab my phone and snap some pictures."],"files":["/var/www/straped/mufon/html2text/40825.html.txt","/var/www/straped/mufon/org/40825.html"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"07/14/2012 12:00 UTC","Object Shape":"Fireball, Sphere","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.638849,+-83.094604(40825)&iwloc=A&hl=en\"> mufon case (40825) map </A>","Date Submitted":"07/15/2012 10:12 UTC","Viewing Distance":"101-500 Feet","trends":["There have been 10 other sightings in Rochester Hills","There were no other sightings in Rochester Hills on or around July 14th 2012"],"Case Number":"40825","City":"Rochester Hills","Longitude":"-83.094604","Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown"}