{"Object Features":"Unknown","Summary":"large metalic object on ground","Object Flight Path":"Stationary","Latitude":"39.971628","Object Shape":"Blimp, Cylinder","Date of the Event":"06/09/2012 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting Detailsindian rock dam. man made concrete lined gully.that has small bridge crossing over it.and road that can be used to reach other locations in area. small town called york new salem. etc.,i was driving towards bridge. and could see very very large object in gully. what looked like a giant water tank. or silo laying on its side in gully.my first reaction was how did they and why. put that in there.i stopped on bridge. got out of car walked around car to passenger side to get a better look.i was still thinking to my self why was it put in there and how.nothing scary just curious.it covered the majority of the gully to my front.i was just scanning from my front to the far end of it.what i will say is the top part.it just fit init width size.i leaned over some to view end below me. not far thou.thats when i noticed movement below. what i thought were kids playing. that ran under bridge from my view.i just saw them for a second or two.not long enough to get a good look. but they looked awkward to me.i got back in my car and drove off.still wondering what i had saw.the road i was on can be driven in a full circle about a mile or two back to bridge.i was so curious by now i drove back to get another look. it was gone.i dont want any reconition or to get any. what i saw was real.some kind of machine,if it wasnt for the fact that it was me who saw it.i did not beleive these these kind of stories in the past"],"Longitude":"-76.722695","Case Number":"40839","Region":"Pennsylvania","trends":["There have been 16 other sightings in York","There were no other sightings in York on or around June 9th 2012"],"Log Number":"US-07152012-0029","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","City":"York","Date Submitted":"07/15/2012 04:23 UTC","files":["/var/www/straped/mufon/html2text/40839.html.txt","/var/www/straped/mufon/org/40839.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.971628,+-76.722695(40839)&iwloc=A&hl=en\"> mufon case (40839) map </A>"}