{"Tags":"City","trends":["There have been 72 other sightings in Nashville","There was one other sighting in Nashville on or around July 15th 2012"],"Latitude":"36.190105","Object Features":"None","Date of the Event":"07/15/2012 02:00 UTC","divs":["Sighting DetailsMy fiance' and I stepped outside to smoke a cigarette before going to bed. Despite living within city limits, we have a wide open view of the sky, so we always admire the stars on clear nights. Last night was a mostly cloudy night, but we happened to both be looking in the same direction when an object appeared out of nowhere and immediately descended, at a slight angle, and seemed to be landing. The orb shaped object was a blueish-white color, and was unlike any shade of color either of us had ever seen. It was bright, yet dull and quickly yet gracefully fell at a steady, constant speed. We followed it with our eyes until it fell out of sight behind the house directly behind ours. It appeared to be many miles away though, to the east. We immediately asked one another if we had just witnessed the same thing, and we had. We stood there in shock for a minute, wondering what else we were about to witness, and then began excitedly talking about it. We had never seen anything even similar to it before. It was amazing. We continued to watch the sky's for awhile expecting to see a helicopter or something searching for whatever had fallen, but there was nothing."],"City":"Nashville","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/40834.html.txt","/var/www/straped/mufon/org/40834.html"],"Object Shape":"Circle, Sphere","Summary":"Dull blue-white object suddenly appeared, immediately descended, and appeared to be landing many miles away.","map":"<A HREF = \"http://maps.google.com/maps?q=36.190105,+-86.674824(40834)&iwloc=A&hl=en\"> mufon case (40834) map </A>","Log Number":"US-07152012-0025","Case Number":"40834","Disposition":"Unresolved","Country":"United States","Longitude":"-86.674824","Region":"Tennessee","Date Submitted":"07/15/2012 02:39 UTC"}