{"Date of the Event":"07/14/2012 10:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Region":"Pennsylvania","Date Submitted":"07/15/2012 02:04 UTC","Log Number":"US-07152012-0023","Latitude":"40.300596","divs":["sighting detailswhile walking our dogs in our front yard, we observed between 8 and 12 red\\orange lights in the sky. they were the approximate color and intensity of road flares. they were in a straight line and evenly spaced. they were moving at a steady pace (the approximate speed of a single engine aircraft) in a sse to nw direction. when the first two were observed they were thought to be a blimp although no other normal marker lighting was observed and no craft outline was visible. after the initial 2 lights were observed, 6-10 more appeared in the same flight path. i moved from the yard to the rear of the house, getting binoculars to further observe the object(s). even with the binoculars no clear outline of a craft, or additional marker lighting was observable. the last light to appear was more yellow in color. no engine noises were ever heard. the lights moved steadily and slowly to the northwest before disappearing into the clouds of an approaching thunderstorm. i routinely sit on the deck at night observing the night sky. this area is heavily traveled by commercial and private aircraft, and medical helicopters. i have also seen the iss overfly the area on occasion as well as almost nightly satelite overflights. the lights observed in this incident were unlike any previously seen. they were much lower and much brighter."],"Object Shape":"Unknown","Case Number":"40832","Viewing Distance":"501 Feet - 1 Mile","Summary":"series of bright red/ orange lights flew silently overhead in a straight line pattern","Longitude":"-79.681608","Object Features":"Unknown","Country":"United States","Object Flight Path":"Straight-line path","City":"Irwin","Source":"MUFON","trends":["There have been 7 other sightings in Irwin","There were 3 other sightings in Irwin on or around July 14th 2012"],"files":["/var/www/straped/mufon/html2text/40832.html.txt","/var/www/straped/mufon/org/40832.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.300596,+-79.681608(40832)&iwloc=A&hl=en\"> mufon case (40832) map </A>"}