{"Sighting Duration":"Undisclosed","City":"Chillicothe","Longitude":"-89.472262","Latitude":"40.905414","Region":"Illinois","Weather Factors":"Unknown","Object Shape":"Disc, Oval","Disposition":"Unresolved","divs":["Sighting DetailsI was in my living room talking to my sister when I noticed out the front window a bright glowing orange object, just above the tree line. The object appeared rather close and maybe the size of a dime. I pointed it out and asked my sister if she saw it. She saw it too, and I hurriedly ran outside while directing her to get her camera. As I went outside it was slowly moving northeast and gaining altitude. At first I thought it was a Chinese paper lantern. I realized this was not the case as it was moving side to side without gaining altitude, and would stop moving side to side whilst it was ascending. It was moving far too fast to be a paper lantern, as well. Also, while it was moving side to side, it was glowing a dull, pulsing red-orange, and I could make out an overall disc shape to the object. When it was ascending it was glowing a brighter yellow-orange, and the shape of the object was harder to make out. I was really excited, and quickly moving down the street away from the tree line to keep track of it. By the time my sister made it outside with the camera, it had already moved a considerable distance away, to the point where it became a star-like object and disappeared. Directly thereafter, we noticed 4 airplanes moving in the same direction, and they were travelling at a much lesser speed. After covering most of the distance, 3 of the planes turned around and headed back in the direction they came. My sister didn't get the camera in time, but saw enough to confirm that it was indeed a UFO, and actually was the first to notice the 3 additional planes in the vicinity. We were both very excited, as we have both had UFO sightings, but never together. It felt like confirmation, and totally was in line with the other UFO's we have sighted individually in the past several years."],"Object Features":"Other","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"07/16/2012 12:22 UTC","trends":["There have been 2 other sightings in Chillicothe","There were no other sightings in Chillicothe on or around July 15th 2012"],"Object Flight Path":"Hovering then path,Path with directional change","Log Number":"US-07162012-0001","Tags":"City","Case Number":"40848","Summary":"Bright yellow-orange to dim red-orange with dark/gray disc saucer shaped body","files":["/var/www/straped/mufon/html2text/40848.html.txt","/var/www/straped/mufon/org/40848.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.905414,+-89.472262(40848)&iwloc=A&hl=en\"> mufon case (40848) map </A>","Source":"MUFON","Date of the Event":"07/15/2012 10:35 UTC"}