{"Country":"United States","Object Features":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/40849.html.txt","/var/www/straped/mufon/org/40849.html"],"Date Submitted":"07/16/2012 12:40 UTC","trends":["There have been 28 other sightings in Blue Springs","There were 3 other sightings in Blue Springs on or around July 15th 2012"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Region":"Missouri","Tags":"City","Date of the Event":"07/15/2012 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.997886,+-94.256304(40849)&iwloc=A&hl=en\"> mufon case (40849) map </A>","City":"Blue Springs","Disposition":"Unresolved","Sighting Duration":"00:04:00","Latitude":"38.997886","Log Number":"US-07162012-0002","Object Shape":"Fireball","Source":"MUFON","Summary":"viewed 5 bright orange flying objects 2 in front, 3 following behind in triangular formation, then vanished one at a time with no trace into the night","divs":["Sighting DetailsMy fiance and I were sittting on our back deck at 10pm on July 15, 2012, when we noticed 5 very bright orange lights traveling from the east heading west over Blue Springs. There were 2 in front side by side but with some space between them, and then they were 3 following behind in a triangular formation. After I first noticed them they were probally in the sky about 3 minutes. One by one starting in the front they flickered slightly and simply vanished into thin air one at a time until all 5 were not visible anywhere. Mind you they didn't fly further away so that they faded into the distance and I did not see any clouds in the sky just stars. It was extremely strange. I tried my hardest to see some shape or something in the sky after they vanished to explain it, you know like they were really still there, but they were not. I did see an airplane high up in the sky probally 5 minutes later, however that is the only other activity I saw in the sky for probally 5 minutes before and after.I simply lost sight of them when they vanished before my very eyes."],"Case Number":"40849","Longitude":"-94.256304"}