{"Viewing Distance":"Over One Mile","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.137154,+-80.076639(40842)&iwloc=A&hl=en\"> mufon case (40842) map </A>","Object Features":"None","Latitude":"42.137154","Log Number":"US-07152012-0031","trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around July 15th 2012"],"Summary":"Saw multiple silent, white, cigar shaped objects of identical size and size in differing altitudes.","Object Shape":"Cigar","Region":"Pennsylvania","Object Flight Path":"Straight-line path","Date Submitted":"07/15/2012 08:19 UTC","Longitude":"-80.076639","Tags":"City","Date of the Event":"07/15/2012 07:15 UTC","Case Number":"40842","Disposition":"Unresolved","divs":["Sighting DetailsWe (two adults, one teenager)were sitting on our patio facing south, when we noticed a single odd-looking plane. The object moved slowly and silently from west to east, with no contrail. Then we began to see more and more, they were not in a group or formation. They were all, however, moving towards the same area. A minute or two after seeing one, we'd occasionally see another object coming from the east and heading west, they would sometimes pass by another object heading west to east. They appeared to have no wings, and were entirely white except for what seemed to be a black spot directly in the center of the craft. These objects were cigar shaped and moved at a constant sustained speed. They were in an area of the sky that was unusual to see planes in, we live in a busy area for planes and we rarely see aircraft in this particular area or at their altitude. We did notice that birds seemed to be fleeing from the direction these objects were flying towards. We finally stopped watching when clouds covered the sky and it began to rain."],"City":"Erie","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/40842.html.txt","/var/www/straped/mufon/org/40842.html"],"Sighting Duration":"Undisclosed"}