{"Object Features":"Other","files":["/var/www/straped/mufon/html2text/40855.html.txt","/var/www/straped/mufon/org/40855.html"],"Sighting Duration":"Undisclosed","Summary":"Ultra Bright Huge square over pacific ocean at nightI","divs":["Sighting DetailsI was driving south on the 405 freeway from the town of San Juan Capistrano to my home in Oceanside. It was around 930. I drive this frequently. Between San Onofre Powers Plant and Oceanside,is a military base Camp Pendelton. I have observed military operation many time,and feel I can identify most of their vehicles. The ocean was to my right,and there was average traffic for that time of night.The light over the ocean I first noticed as I passed the power plant. It was so bright that it was distracting from my driving. I assumed I would pass it soon,but it stayed to my right as I continued driving. It reminded me of camera lights the kind they use in movies.Very white,bright. I continued driving maybe another 10 minutes,and kept glancing to my right. I knew there was a look out up ahead nearing Oceanside. I couldn't take it anymore,I had to pull over and look. I pulled into the look out. There was a family who where having car problems.Beside them it was just me,my dog,and no parking lot lights. I stood there maybe 15 just looking at it. Helicopters practice out there dropping supplies to ships. That was my first thought.I eliminated that,as there where no flashing red light,or movement.Plus I couldn't see a ship. Maybe a oil derrick ? No, not unless they built it in a day. It wasn't any find of a ship or boat,as there was zero reflection on the water. The longer I looked, the more confused I got. I could barely see the horizon as there was fog that night.Once I could see the line I could tell the light wasn't sitting on the ocean,but was above. I kept waiting for it to move,and one time it jerked a little but remained it place. I would describe the light as a huge bright square.I could only see the front but it looked like it was dived evenly into four lights. Like a 4 on dice..Each light put out the same white color,but randomly fluttered. I wouldn't call it blinking.I finally had to get home so I don't know what happened with it. I have a young family member who said she saw the same thing a few nights later. Her's were flying,& there was 8.That was in San Clementa, at 1130 pm. I tried to use my cell phone for a picture,no luck."],"Disposition":"Unresolved","Region":"California","Tags":"City","Longitude":"-117.372023","City":"Oceanside","Object Shape":"Square, Rectagular","Log Number":"US-07162012-0008","Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.20251","Source":"MUFON","trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around July 11th 2012"],"Country":"United States","Weather Factors":"Unknown","Date of the Event":"07/11/2012 09:30 UTC","Case Number":"40855","Object Flight Path":"Undisclosed","Date Submitted":"07/16/2012 11:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.20251,+-117.372023(40855)&iwloc=A&hl=en\"> mufon case (40855) map </A>"}