{"Tags":"City","Date of the Event":"07/10/2010 12:00 UTC","Longitude":"-121.449439","Object Flight Path":"Stationary,Hovering then path,Straight-line path","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around July 10th 2010"],"Latitude":"38.532529","Summary":"watching the air traffic of cargo jets to mather field","Region":"California","files":["/var/www/straped/mufon/html2text/40853.html.txt","/var/www/straped/mufon/org/40853.html"],"Case Number":"40853","Source":"MUFON","Log Number":"US-07162012-0006","Object Shape":"Flash, Square, Rectagular","Date Submitted":"07/16/2012 06:15 UTC","Object Features":"Patterned Surface, Appendage(s)","Sighting Duration":"00:01:00","Disposition":"Unresolved","divs":["Sighting DetailsI have always been pretty sure that we are not alone. I also have a bit of healthy scepticism. For me to claim to have seen a UFO there had to be no \"grey area\"and beyond the shadow of doubt -period! Probably won't happen...so I thought . My girlfriend and I were roller blading at night becouse there is less auto traffic.We were at an park near our house and noticed we could see all the way up the valley. It was a very clear night and we must have been on high ground. We could also see the cargo jets on .the final approch to Mather Field (formally mather a.f.b.). It was so clear we could see about seven jets , starting from one passing directly over our heads ,2 ,3,4,then 5 at the end of the valley banking to the right ,6 dessending then the 7th touching down. Actual \"air traffic \" very cool. Then Bam! as if the crafts cloking device suddenly failed we can see this craft so close I can see the panles and what looked like some markings like on military planes. Take a pack of cigarettes turn it sideways and hold it at arms lenghth from you . That's the size . Ok, strange but there are possible explainations. Except for the fact that it was motionless - not hovering, but motionless. It's difficult to convey how odd it looks for somthing to be truly airborne and motionless. When it leaves, part of the craft stays until the forward portion gets to a certain point, then at the speed of light-its gone! About week later I saw a program about scientist attempting to find absolute zero. On the way there they proved the Einstine Bolles condensate. They used a gas that was so dense it slows light to the speed of a bicycle. To demonstrate the shot a laser through a clearchamber of this gas. It behaived EXACTLY like that craft accelerated as it took off."],"City":"Sacramento","map":"<A HREF = \"http://maps.google.com/maps?q=38.532529,+-121.449439(40853)&iwloc=A&hl=en\"> mufon case (40853) map </A>","Country":"United States","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown"}