{"Log Number":"US-07162012-0004","divs":["sighting details i was outside just looking at stars. a red glow caught my attention. standing still looking thru trees using branches as marker i saw they were moving. no wind or breeze. then i saw thy went in erratic directions and move 5-10 degrees with north being the origin and shifting 15 degrees to the west. when airplane closer to ground appeared under the red & altering white light the closest light would erratically move. circle, oval, straight line and fast. when the one light was moving the other 4 were stationary. my wife saw same thing. i was interested and watched for 1-1\\2 hr. my wife only watched 15 munites. i gave up about 1:45 to go in and get ready for bed. no structured shape was evident. they were orange\\red for 75% of the time the remainder they were more yellow. no wind tonight. this allowed me to use tree branches as marks to verify they were moving. lightening bugs were out but their light god on and off. the 5 objects never stopped glowing one of the colors."],"Country":"United States","Longitude":"-86.361125","Date of the Event":"07/16/2012 12:00 UTC","Date Submitted":"07/16/2012 02:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.827268,+-86.361125(40851)&iwloc=A&hl=en\"> mufon case (40851) map </A>","Source":"MUFON","Viewing Distance":"Unknown, N/A","Disposition":"Unresolved","Object Shape":"Sphere","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","City":"Buchanan","Case Number":"40851","Region":"Michigan","Summary":"5 lights when 1 moved the other 4 remained stationary. When planes were under them the went in erratic circle-ovoal . They went all direction-FAST","files":["/var/www/straped/mufon/html2text/40851.html.txt","/var/www/straped/mufon/org/40851.html"],"Sighting Duration":"Undisclosed","Latitude":"41.827268","trends":["There has been one other sighting in Buchanan","There were no other sightings in Buchanan on or around July 16th 2012"],"Object Features":"None","Weather Factors":"Unknown"}