{"Region":"Arizona","trends":["There have been no other sightings in Yarnell","This sighting has never been favorited."],"Weather Factors":"Unknown","Log Number":"US-07172012-0001","Date of the Event":"10/08/1994 11:26 UTC","files":["/var/www/straped/mufon/html2text/40867.html.txt","/var/www/straped/mufon/org/40867.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.20581,+-112.7833(40867)&iwloc=A&hl=en\"> mufon case (40867) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"40867","Longitude":"-112.7833","Country":"United States","Disposition":"Unresolved","Latitude":"34.20581","Sighting Duration":"00:05:00","Date Submitted":"07/17/2012 12:13 UTC","divs":["Sighting DetailsMy son and I were on our way home to Spring Valley Az. from a funeral in California. We pulled off the road to take a small break out in the middle of nowhere. The location is 5 miles north of Jarnel, Az. on Hwy 89. It was a little past 11:00 pm. We somehow started talking about UFO. I mentioned to my son, 12 years old at the time that I think most UFO sightings are military related or non- military related vehicles possibly from the future like a time machine. I told my son that some day time travel could be possible. He asked if I could prove time travel. I said maybe, do you want to try it. Well it's Oct. 8 1994 11:26pm we are 5 miles north of Jarnel on hwy 89 waiting for a time machine. We both said if anything happens we will remember this date and time. OH MY GOD WHAT IS THAT my son yells out. I turn my head and it comes right up to us, approx. 100' from us. A small vehicle 50' off the ground looking right at us. We could see two people in the craft, they were looking at us. Sheldon looked at me at jumped into the car and shut the door. I stood still and took it all in. After about 5 seconds I waved and they waved back. I looked back at my son and he smiled. When I turned back to look at the craft it was backing up I waved again and they waved too. The craft turned, picked up speed and altitude and within a matter of seconds was out of sight. I got in the car looked at my son and he said that was me dad, from the future. YOU DID IT YOU PROVED TIME TRAVEL TO ME. We drove off in a daze. We stopped at the nearest payphone and called home. I told my wife, what just happened and we would be home soon. When we got home my son was still shaken by the event and told his mom and his sister that he came back from the future in a time machine that dad builds. We have a plaque on the wall with the date time and place. I have some ideas that might speed up the development of time travel. We are also considering an attemp at producing a movie. If you find our story interesting and would like to get more details, let me know."],"Object Features":"Window(s), Other","Tags":"City","Object Shape":"Other","Summary":"Out in the middle of nowhere and a UFO showed up.","Source":"MUFON","City":"Yarnell","Viewing Distance":"21-100 Feet"}