{"Date Submitted":"07/17/2012 01:26 UTC","Case Number":"40878","Disposition":"Unresolved","Summary":"Bright orange, shaped like a star fruit, I have photo's","Region":"Maine","Country":"United States","Log Number":"US-07172012-0010","Longitude":"-70.407716","Weather Factors":"Unknown","Latitude":"43.42248","Object Flight Path":"Straight-line path","Tags":"City","trends":["There have been 2 other sightings in Biddeford","There were no other sightings in Biddeford on or around July 16th 2012"],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Other","Date of the Event":"07/16/2012 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.42248,+-70.407716(40878)&iwloc=A&hl=en\"> mufon case (40878) map </A>","Source":"MUFON","divs":["Sighting DetailsHello, Last night I was sitting on my deck about 9:30 p.m., than I notice something approaching me from the south, heading north, it was traveling at about 40 mph, at about 600 feet, I am a pilot for your information, to describe it, it looked like the Bethlehem star, it was the color of a lit cigarette, bright orange and it had spokes of pointed lights up-down-front-back and was very bright, I had a camera, but did not want to miss this, since I would of had to go fetch it, so it came directly over me, it made no sound whatsoever, and the tree did not move by turbulence, it was beautiful. So it left and disappeared heading towards Portland ME. Well about 5 minutes later another one showed up, I ran inside found my camera, and by that time it had gone by the house so I took 2 photos of it. Brian, either this object was from another planet of it was from Heaven. When I magnified the photo, it looked like a ball of energy, like fire inside a sphere, simply amazing, I have seen all those other UFO photo's, this was nothing close to all the others, it literally took my breath away, it was so peaceful and silent. Irrefutable proof, either from another world of it was from heavenly, simply incredible!!!!! Richard Delage 207-283-0243"],"City":"Biddeford","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/40878.html.txt","/var/www/straped/mufon/org/40878.html"]}