{"Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-82.886194","Country":"United States","files":["/var/www/straped/mufon/html2text/40884.html.txt","/var/www/straped/mufon/org/40884.html"],"Date of the Event":"07/15/2011 11:30 UTC","Source":"MUFON","Date Submitted":"07/17/2012 04:29 UTC","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","divs":["sighting detailssaw a linear formation of 5 slowly moving objects as i was approaching the off ramp of us 10, turning north onto 115 returning to traverse city michigan at about 11:30 pm on july 17, 2012. at first, they appeared to be very bright redish stars, but it became obvious that they were moving south west and were clearly solid as i got closer over the course of about a mile, with bright red single, slightly undulating light near the lower portion of the objects, which reflected off of the body slightly. i rolled my window down as i passed under them and they made no sound, and appeared to be about 500-1000 ft up. i probably traveled about 2 miles from the time i first sighted them to the time i passed beneath them. these may well have been chinese lanterns, but they were quite large, maybe 15\\20 feet across, and very bright, and flying at about 30, 50 mph in a very straight line formation. at first i thought they might have been helicopters because they were about the right altitude and size, but the nav lights were all wrong and there was no sound. really just curious if any one else reported seeing these."],"Latitude":"42.474514","City":"St Clair Shores","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Case Number":"40884","map":"<A HREF = \"http://maps.google.com/maps?q=42.474514,+-82.886194(40884)&iwloc=A&hl=en\"> mufon case (40884) map </A>","trends":["There have been 9 other sightings in St Clair Shores","There were no other sightings in St Clair Shores on or around July 15th 2011"],"Region":"Michigan","Summary":"Formation of glowing objects moving south west at 30-50 mph","Log Number":"US-07172012-0016","Object Shape":"Square, Rectagular","Tags":"City","Object Flight Path":"Straight-line path"}