{"Object Features":"Undisclosed","Date Submitted":"07/17/2012 09:46 UTC","Case Number":"40886","trends":["There has been one other sighting in Temple Terrace","There were no other sightings in Temple Terrace on or around November 17th 1991"],"Log Number":"US-07172012-0018","files":["/var/www/straped/mufon/html2text/40886.html.txt","/var/www/straped/mufon/org/40886.html"],"Object Shape":"Sphere","Summary":"I awoke to an orb hovering above my bed.What I saw was not what my husband saw.","Longitude":"-82.38622","Latitude":"28.057361","City":"Temple Terrace","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband and I were asleep in our second story condo in Temple Terrace. It was either in the fall or spring about 1991,as our north facing window was open. I was asleep on my back,my husband on his left side facing the wall. He snores. I awoke to see an orb, about the size of a basketball , hovering just above my shins. It was an oily swirrling of teal blue and salmon pink inside the orb. I said to my husband,\" Do you see that?\" He said, \"Uhuh.\" He had not moved. I said \"Good\" , and slowly raised my right arm to touch it. It slowly moved to my right...perhaps through the wall. I went straight back to bed. This is odd since when I am awake I can not get back to sleep. Another odd thing is that I am really nearsighted, but saw the beautiful colors swirrling clearly. The next morning, I asked my husband what he saw. He became angry and did not want to talk about it. I wanted to know, I was excited. Everytime I brought it up, he was angry. I never saw this side of him. After abouty a week, he relented. This is what he saw: an orb, green like the old IBM computer screens, longitude and latitude lines. Wow! I ask what numbers he saw,he could not tell me. He told me not to tell anyone about this. At this time, I was taking a gifted course in which they taught us about right brained and left brained people. I am right brained, my husband left. Whatever this was, was speaking to our dominant brain side. It took a little over a month for him to be comfortable with me telling anyone. My husband and I are college graduates, pretty scientific. This was not explainable. Since then, I have shared this with family and friends. He remains uncomfortable speaking about it to this day."],"Date of the Event":"11/17/1991 12:00 UTC","Viewing Distance":"20 Feet or Less","Region":"Florida","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=28.057361,+-82.38622(40886)&iwloc=A&hl=en\"> mufon case (40886) map </A>","Object Flight Path":"Hovering then path","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed"}