{"Case Number":"40880","Summary":"Watched the object for half an hour, then went to bed. Looked like it was moving away, then changed direction.","Object Shape":"Sphere, Star-like","Date of the Event":"07/17/2012 02:05 UTC","Sighting Duration":"Undisclosed","Date Submitted":"07/17/2012 03:30 UTC","Tags":"City","Object Features":"Window(s)","Country":"United States","Log Number":"GB-07172012-0012","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"37.998888","Source":"MUFON","Viewing Distance":"Over One Mile","Longitude":"-105.910016","Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/40880.html.txt","/var/www/straped/mufon/more/40880_submitter_file1__UFO17July20122am002.JPG","/var/www/straped/mufon/org/40880.html"],"City":"Moffat","divs":["Sighting DetailsI first noticed the object opposite my house, a mile away maybe, which would be just to the north-west of the town of Moffat in Dumfriesshire.It was 2am and I had gone outside for a walk and some fresh air before going to bed. The sky was clear and full of stars so this object stood out as it was moving around erratically and was a flashing. There was a green light on the object and it looked as if a beam was reflecting off the sky around it from time to time. It cannot have been a plane, due to the abrupt movements it was making. I took a photograph of it with a telephoto lens, which just looked like a dot in the sky. However once downloaded to my computer and magnified some more, it looked like a wide silver object with \"windows\" around the edge. After half an hour, it was still there but having had a busy day I was so tired I just had to go to bed! The last time I saw a UFO, was in 1979 about a mile from my current home and near some power lines. It was about 100ft above me and about 200 ft in diameter. It completely lit the ground around me as if it were daylight. It was about 12.15 am and dark when I first saw it. I lost about an hour of time on that occasion and the last thing I remember was seeing the object move slowly to my left for about 200 yards, then accelerate forward so fast that it disappeared in about 5 secords. This time the object was so far away that it just looked like a moving star to the naked eye and I could not be sure what it was."],"trends":["There have been no other sightings in Moffat","This sighting has never been favorited."],"Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=37.998888,+-105.910016(40880)&iwloc=A&hl=en\"> mufon case (40880) map </A>"}