{"Object Features":"Unknown","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Straight-line path","Object Shape":"Star-like","Date of the Event":"07/17/2012 08:00 UTC","divs":["Sighting DetailsWas in backyard with friends and someone in pool said they seen a very bright light in sky at VERY HIGH Altitude. I stated it might be a early star or maybe even the ISS but after I viewed the unknown light source, it appeared to be not moving as the ISS would. I did have a pair of very expensive Low Glare, HD yellow tint sunglasses. When viewed with these on, it appreared to be 2 to 4 seperate large lights. NO TWINKLE, NO FLASHING, just bright and ON. The people that first spotted the objected has said it seems to be moving but after I watched for about 10 minutes, NO MOVEMENT. There were a few HIGH ALTITUDE clouds that may have given the object the appreance of movement but was not moving. Once thing we did notice was after about 10-15 minutes watching this 2 military aircraft in formation flying low- to medium-altitude were spotted within the area while these lights continued to shine. I remember how bright the sun was on these military aircraft that they shined bright as well but were banking right and left, so we could see it was known aircraft in formation. They seemed to disappear due to ascent I believe. I had to stop watching due to neck getting sore.. I tried several times to get video with phone but could see them, but with naked aya we could we them just fine.."],"Region":"Michigan","files":["/var/www/straped/mufon/html2text/40885.html.txt","/var/www/straped/mufon/org/40885.html"],"Country":"United States","Date Submitted":"07/17/2012 09:32 UTC","Weather Factors":"Unknown","City":"Sterling Heights","Tags":"City","Sighting Duration":"01:30:28","Source":"MUFON","Log Number":"US-07172012-0017","Latitude":"42.582972","Case Number":"40885","Summary":"2-3 VEry Bright Lights during Sunny Day, High Altitude","Longitude":"-83.027203","trends":["There have been 13 other sightings in Sterling Heights","There were no other sightings in Sterling Heights on or around July 17th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.582972,+-83.027203(40885)&iwloc=A&hl=en\"> mufon case (40885) map </A>","Disposition":"Unresolved"}