{"Summary":"ON 7/16/2012 AT 10:35PM...I SAW A WHITE FLASH IN THE WESTERN SKY OUT OF THE CORNER OF MY EYE. THE FLASH APPEARED THREE TIMESIN 4 TO 5 SEC. INTERVALS ,THEN STOPPED, IT WAS LIKE A BRIGHT STAR .","map":"<A HREF = \"http://maps.google.com/maps?q=41.921133,+-71.435027(40890)&iwloc=A&hl=en\"> mufon case (40890) map </A>","trends":["There have been no other sightings in Lincoln","This sighting has never been favorited."],"Log Number":"US-07172012-0022","Source":"MUFON","Tags":"City","Latitude":"41.921133","Case Number":"40890","Sighting Duration":"Undisclosed","Region":"Rhode Island","Object Features":"Unknown","Date Submitted":"07/17/2012 11:13 UTC","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Stationary","Weather Factors":"Unknown","City":"Lincoln","Object Shape":"Star-like","divs":["Sighting Details ON JULY 16, 2012 AT 10:35PM I STEPPED OUTSIDE FOR SOME AIR BEFORE RETIRING FOR THE EVENING. I JUST HAPPENED TO LOOK UP IN THE WESTERN SKY STARING AT THE STARS FOR A MOMENT AND AS I STARTED TO TURN MY HEAD TO THE RIGHT I NOTICED A SMALL FLASH OUT OF THE CORNER OF MY EYE. I TURNED BACK TO WHERE I WAS ORIGINALLY LOOKING AND AT FIRST SAW NOTHING. SUDDENLY, THERE WAS A FLASH OF BRIGHT WHITE LIGHT,SIMILAR TO THE FLASH OF A CAMERA. THE SKY WAS THEN BLACK AGAIN UNTIL ABOUT 4 OR 5 SEC. LATER A SECOND FLASH FROM THE EXACT SAME SPOT. I CONTINUED TO STAY FIXED ON THIS SPOT WHEN SUDDENLY I SAW A THIRD FLASH JUST SLIGHTLY LEFT OF THE FIRST TWO AGAIN ABOUT 4 T0 5 SEC. AFTER THE PREVIOUS FLASH. IT LOOKED LIKE A STAR , ROUND AND WHITE IN APPEARANCE ONLY MUCH BRIGHTER. THERE WERE MANY STARS VISIBLE IN THE SAME AREA THAT NEVER CHANGED IN BRIGHTNESS OR IN ANY OTHER WAY. THERE WAS NO SOUND,NO OTHER COLORS OF LIGHT AND NO TAIL OF ANY KIND. AFTER THE THIRD FLASH I NEVER SAW ANOTHER, EVEN AFTER STARING AT THIS VERY SPOT AND SURROUNDING AREA FOR THE NEXT 20 MINS. OR SO. I MUST NOTE THAT THIS IS THE SECOND TIME THIS MONTH THAT I HAVE WITNESSED SOMETHING ODD IN THE NIGHT SKY. THE FIRST BEING JULY 4, 2012 WHEN I WITNESSED AN ORANGE OBLONG GLOW MOVE SLOWLY ACROSS THE SKY.I MIGHT ADD THAT I DO NOT DRINK AND AM NOT ON ANY MEDICATION, NOR AM I IN THE HABIT OF MAKING UP STORIES. FOUND IT ODD AND DECIDED TO SHARE IT. THANKS."],"Date of the Event":"07/16/2012 10:35 UTC","files":["/var/www/straped/mufon/html2text/40890.html.txt","/var/www/straped/mufon/org/40890.html"],"Disposition":"Unresolved","Longitude":"-71.435027"}