{"map":"<A HREF = \"http://maps.google.com/maps?q=38.816392,+-76.94118(40904)&iwloc=A&hl=en\"> mufon case (40904) map </A>","Sighting Duration":"00:05:00","Tags":"City","Region":"Maryland","files":["/var/www/straped/mufon/html2text/40904.html.txt","/var/www/straped/mufon/org/40904.html"],"Country":"United States","Object Flight Path":"Path with directional change","Object Shape":"Unknown","Date of the Event":"05/17/2012 09:00 UTC","City":"Temple Hills","Object Features":"Unknown","Date Submitted":"07/18/2012 04:07 UTC","Disposition":"Unresolved","divs":["sighting detailsprobes hovering over the skies in washington d.c #2 on 17 may 2012, i am at the local park capturing video of ufos hovering in the sky. i could not identify the hovering object as a model aircraft and its movements did not dictate that it was a model airplane. this probe\\ufo has been observed on multiple occasions during different times of the day. the probe normally appear from dusk till dawn. below is a comparison of two videos of possibly the same ufo. (view document for images) this particular ufo within the video \"alien probe displaying images #2\" not only altered its trajectory within the night sky at a rapid pace but it also fluctuated in color. similar to another possible probe, this ufo is engulfed within a light that obscures the actual vessel from ground based observation and produces a field that can generate images of objects. the images can be viewed when the video is paused. below are some examples of the images the craft can generate when the video is paused. (view document for images) submitting files and report to mufon for review and analysis."],"Longitude":"-76.94118","Log Number":"US-07182012-0012","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"38.816392","Source":"MUFON","Case Number":"40904","Summary":"UFO/Probes Hovering Over Washington DC","trends":["There have been 3 other sightings in Temple Hills","There were no other sightings in Temple Hills on or around May 17th 2012"]}