{"trends":["There have been 8 other sightings in Beverly Hills","There was one other sighting in Beverly Hills on or around June 18th 2012"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.08062,+-118.397826(40901)&iwloc=A&hl=en\"> mufon case (40901) map </A>","Viewing Distance":"Over One Mile","Longitude":"-118.397826","Country":"United States","Object Features":"Unknown","Object Shape":"Circle, Oval","Object Flight Path":"Path with directional change","divs":["sighting detailsso i went outside to video a navy ch-46d that was circling the neighborhood at a low altitude. three circles was odd,, only one ch-46d was odd as well, since lately they've been in 3's. by the time i grabbed my camera and got to the backyard the helicopter was out of view and leaving the area. just as i was turning to go back inside i saw a brilliant flash of light extremely high up in the sky. what i saw was what looked like a tear\\hole in the blue sky. it looked like there was a small window, with a brilliant bright center, that looked out into space. this is when i saw many bright objects all around the edge of the tear. as the flash of light went away the hole or tear seemed to \"seal\" back up. the blue sky filled in the \"window\" and i no longer could see the objects. well, all but one. the one i watched come out and descend from that area of sky. all that happened within seconds as i was turning to leave. so i turned on the camera and began to film. i apologize for the shaky camera. i was pointing the camera in the area i thought the object should be in,, since i no longer could see it with my naked eye. whatever the object is it could cloak itself and uncloak itself. if you look very closely, at times, you can barely see the object moving while it is cloaked. in slow motion you can see the object very well, and at one point the object appears to power up (it became brighter for a second) and then accelerated at a right angle of it's original flight path before cloaking itself once again."],"Latitude":"34.08062","Date of the Event":"06/18/2012 08:40 UTC","Tags":"City","Disposition":"Unresolved","Log Number":"US-07182012-0009","files":["/var/www/straped/mufon/html2text/40901.html.txt","/var/www/straped/mufon/org/40901.html"],"Case Number":"40901","Source":"MUFON","City":"Beverly Hills","Sighting Duration":"Undisclosed","Summary":"DAYTIME UFO","Region":"California","Date Submitted":"07/18/2012 11:18 UTC"}