{"Object Flight Path":"Stationary","Object Features":"Other","Weather Factors":"Unknown","Longitude":"-121.28384","City":"Lodi","Region":"California","files":["/var/www/straped/mufon/html2text/40908.html.txt","/var/www/straped/mufon/org/40908.html"],"Date of the Event":"02/04/2011 06:30 UTC","Object Shape":"Square, Rectagular","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Latitude":"38.22339","Viewing Distance":"101-500 Feet","Sighting Duration":"00:00:45","map":"<A HREF = \"http://maps.google.com/maps?q=38.22339,+-121.28384(40908)&iwloc=A&hl=en\"> mufon case (40908) map </A>","trends":["There have been 20 other sightings in Lodi","There were no other sightings in Lodi on or around February 4th 2011"],"Case Number":"40908","Date Submitted":"07/18/2012 09:42 UTC","Log Number":"US-07182012-0016","Country":"United States","Summary":"A large cloud of mirror-finish, 1-inch squares suddenly came from nowhere and appeared by the freeway.","divs":["Sighting DetailsI was driving South on California 99 approximately 3 miles North of Lodi, CA. Suddenly, a cloud of sparkly, mirror-like squares appeared next to the slow lane on my side of the freeway. When I first noticed it, I thought it was a skyrocket someone set off but when I got closer, I could see that all of the pieces were square and were reflecting the very bright, white lights of a service station. The cloud was elongated and looked like an upside down drop of water. The bottom of the cloud was probably 30 feet off the ground and the top was probably 50 feet off the ground. After it appeared, it was expanding rapidly, getting fatter, and the squares were spinning, creating the sparkling effect. I was past the service station in a few seconds so I then lost sight of the cloud. I remember reading about a sighting on Earthfiles where a cloud of sparkly glitter-like squares descended into a tree in a lady's back yard. After awhile, the cloud of squares came out of the tree and rose straight up in the sky where they had come from. Also, in my own bedroom at night less than a year ago there was a stream of the same kind of squares that seemed to be exiting from a large bookcase and flowing into the next room. It seems logical that the squares might be some kind of information gathering tool."]}