{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.251833,+-89.91624(40906)&iwloc=A&hl=en\"> mufon case (40906) map </A>","Longitude":"-89.91624","City":"Kewanee","Weather Factors":"Unknown","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Date of the Event":"09/12/2000 12:00 UTC","Tags":"City","Region":"Illinois","divs":["Sighting DetailsIt's been some time now since this event has actually happened but I finally feel the urge to get it out. As a sophomore in high school I enjoyed riding around in my car any time that I could. My favorite time to cruise of course was night time. I was doing my normal route around town and noticed that it was was 11pm so I figured I better start heading back. I took a few backroads around town and drove towards Windmont Park. When I approached the stop sign at the end of the road I noticed something out of the corner of my eye from just above the treeline ahead of me. I saw one blueish-white light that was amazingly bright heading what looked like upwards. I sat at the stop sign for a few seconds more to observe it. As I kept watching the light rose up a little more and then I noticed that there were 3 lights in total in a delta formation and this thing was huge... I would say at least 200-300 feet if not more. I immediately started freaking out and I went to put my car in to first gear when I noticed that this object was not making a noise and it just turned on a dime to face me with one of its points. And by turned on a dime I mean I watched the 3 lights swivel around a central axel turn... I really started to get worried especially with it facing towards me now, it's almost like it realized that I saw it. So, once I saw it facing towards me I quickly threw my car in reverse and started to back up. And here's where it gets really interesting... In the center of the bottom of the craft there was a pinpoint light between all the triangulation lights. The craft started moving towards me actually shot a beam of light down from the center of it. The only thing that I can compare this light to is that of those direct spot lights that they use at concerts to shine on band members. It was a solid very skinny spotlight and it swiveled almost like the spotlights on a search and rescue helicopter would. The spot light was directed towards the ground in front of me and I started reversing my car to keep it out of the light. The light crept closer and closer to my car so I threw my car in drive and sped in the other direction. I didn't stop driving until I reached my house and when I got home my mother looked at me and asked if I was okay. Apparently I was pale white and had the shakes. I told her about everything that happened and she thought I was crazy. I am also an artist so I started drawing the object on paper to match it to any other aircraft that I've seen around town and never came up with a match for it. It still bugs me to this day. One other thing to note. My room was on the 2nd story of our house and when I was laying down getting ready to go to sleep I noticed a light shine in through my blinds for a split second then it was gone."],"Disposition":"Unresolved","Date Submitted":"07/18/2012 06:15 UTC","files":["/var/www/straped/mufon/html2text/40906.html.txt","/var/www/straped/mufon/org/40906.html"],"Summary":"Triangular (Delta) UFO Hovering near Windmont Park, Kewanee","Object Flight Path":"Hovering then path","Latitude":"41.251833","Viewing Distance":"101-500 Feet","Object Features":"Undisclosed","trends":["There has been one other sighting in Kewanee","There were no other sightings in Kewanee on or around September 12th 2000"],"Case Number":"40906","Log Number":"US-07182012-0014","Country":"United States"}