{"Latitude":"34.148613","City":"Florence","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Over One Mile","divs":["Sighting DetailsTwo blinking orbs were flying above my house with what sounded like jet engines. The lights would change position of leader between flashes(orb a was in the front, when its light disappeared and orb b would light up, it would then be in the front. Then vice versa, this kept going back and forth until I could no longer see them.) As there was a commercial jet in the air also, I was unsure if the sound was coming from it. A solid orb shot in front of the two flashing orbs in what seemed like a blink of an eye, it moved so quickly it had the what looked like a light tail. The solid orb stopped and hovered in place for a few minutes before it began slowing moving across the sky, flashing randomly. The flashes would get more intense as it moved across the sky until a final bright flash before it disappeared. After this another orb appeared in the sky, with solid light. It floated across the sky in a swaying motion, as a boat in water would rock left and right. At certain moments it was as if the light would \"skip a frame\". In the past 5 months, this has been ongoing on a nightly basis. I am 25 and before the past 5 months, I can only recall one sighting of anything like this in my life. Since March of this year, I have probably seen more than 100 of similar objects. I am completely aware of the air traffic as I live near the Florence Airport. I have compared sightings to satellite paths, space station, etc. and was able to explain maybe 6 of over 100 objects. The rest, the way they moved, there is no way they were commercial, meteors, etc. I have never seen anything move they way these objects do. I believe that Florence, SC would be a great place for your research purposes. The skies have been keeping me awake at night as these objects have been on my mind constantly. I have become a \"sky watcher\" if you will."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.148613,+-79.770556(40917)&iwloc=A&hl=en\"> mufon case (40917) map </A>","trends":["There have been 11 other sightings in Florence","There were no other sightings in Florence on or around July 18th 2012"],"Object Features":"Unknown","Object Shape":"Sphere","Weather Factors":"Unknown","Summary":"Two blinking orbs in unison, paths crossed by solid orb.","Region":"South Carolina","files":["/var/www/straped/mufon/html2text/40917.html.txt","/var/www/straped/mufon/org/40917.html"],"Object Flight Path":"Path with directional change,Path then hovering","Case Number":"40917","Longitude":"-79.770556","Tags":"City","Date Submitted":"07/19/2012 12:43 UTC","Country":"United States","Date of the Event":"07/18/2012 11:00 UTC","Log Number":"US-07192012-0002","Sighting Duration":"Undisclosed"}