{"Tags":"City","City":"longs","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"40911","files":["/var/www/straped/mufon/html2text/40911.html.txt","/var/www/straped/mufon/org/40911.html"],"Region":"South Carolina","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","Summary":"many flashing lights going to and coming from multiple directions, many formations","trends":["There have been 2 other sightings in longs","There were no other sightings in longs on or around July 18th 2012"],"Source":"MUFON","Date of the Event":"07/18/2012 09:00 UTC","Object Shape":"Flash, Sphere","Date Submitted":"07/18/2012 10:27 UTC","Longitude":"-78.674007","Object Features":"Unknown","Latitude":"33.885962","divs":["Sighting Detailstonight at 9pm est may family and i noticed flashing many flashing lights in the sky, they were coming from many directions and in many formations. the lights also had different sequences of flashes and sometimes they would light up so bright in a lantern fasion, but this light would get intensly brigh, they had become the brightest lights i have ever seen in ther night sky(not including the moon) i am very aware of what a plane looks like coming at me at night and this was a different intesnsity and almostg a color of its own,if thats possible. we have a normal airport flight path west of our house(15 miles or so) and during this activity we did not see any plane in the sky in any direction for 30 minutes. after this occured we had many vehicles turn around on our strret(we are at the end of a turnaround) and when all lights were gone ,plane activity resumed with great numbers, including helicopter, all aircraft were at many different altitiudes. I am an ametuer sky watcher and planed on watching keenly tonight because of previos activity. we have seen amazing triangles and lights flashing like this before with other witnesses and videos. we were unable to get any video or pics, our APPLE products we use just dont pic up the images ever! I feel the necessity of mentioning that we live on the coast and just down the beach a pilot lost all power in his single engine plane today and had crashed in the ocean close to shore. THESE LIGHTS WERE ALSO SEEN LAST NIGHT IN THE SAMER LOCATION, I HAVE MANY WITNESSES AND WILL BE ADDING OTHER PEOPLES VIDEOS AND PICS. I WISH I HAD SOMEONE TO CALL EVERY TIME I SEE THESE THINGS, SOMEONE WHO WONT BRUSH ME OFF. i am a serious person who wants no attention but frankly i am blown away at the happening in the last 6 months. if any one wants to see a ufo, please come to my house and spend a week here, i GARAUNTEE you will be blown away. i dont even belive this site takes the matters serious, i have written and called before and i wish i just called police myself, i expect them to blow me off"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.885962,+-78.674007(40911)&iwloc=A&hl=en\"> mufon case (40911) map </A>","Disposition":"Unresolved","Log Number":"US-07182012-0019"}