{"Longitude":"-118.344982","trends":["There have been 4 other sightings in Hawthorne","There were no other sightings in Hawthorne on or around July 17th 2012"],"files":["/var/www/straped/mufon/html2text/40920.html.txt","/var/www/straped/mufon/org/40920.html"],"Weather Factors":"Unknown","Object Flight Path":"Other","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.922209,+-118.344982(40920)&iwloc=A&hl=en\"> mufon case (40920) map </A>","Case Number":"40920","Tags":"City","Disposition":"Unresolved","Sighting Duration":"00:10:14","divs":["Sighting Detailsi was reading some documents online i saw a big flash on my door and i was like who is flashing inside because i live in a back unit and is dark and typically that was a very strong white lights in the sky. i didn't get a chance to see the object it was to fast i tried to record but the flashes where to fast and very bright. well honestly i was just curious who was flashing so i step outside to see the source of light. and i stood outside for 10 minutes and i saw the second flash five minutes later. by the time i went to grab my camera no more flashes. i wait outside for 30 minutes and nothing. Two flashes of white light one around 10:50 pm and the other big flash was 5 minutes later. Also two 3 years ago i saw some thing that left me unspeakable i saw one unknown flying object traveling on top of my house is was shaped like triangle and it was transparent. they way i was able to see the plane because i saw 6 lights moving at the same speed and i was able to see the outline of the craft. i never report these because i was scared the gov would come and knock my door. so i only told my sister and one friend."],"Country":"United States","Object Features":"Unknown","Date of the Event":"07/17/2012 10:50 UTC","Source":"MUFON","City":"Hawthorne","Object Shape":"Flash","Log Number":"US-07192012-0005","Summary":"Two flashes of white light","Latitude":"33.922209","Date Submitted":"07/19/2012 02:35 UTC","Viewing Distance":"501 Feet - 1 Mile"}