{"Case Number":"40923","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","trends":["There has been one other sighting in Hindman","There was one other sighting in Hindman on or around January 15th 2002"],"Viewing Distance":"101-500 Feet, Over 1 Mile","City":"Hindman","map":"<A HREF = \"http://maps.google.com/maps?q=37.335931,+-82.980441(40923)&iwloc=A&hl=en\"> mufon case (40923) map </A>","Summary":"Football cut in half covered in logitech lihts","Latitude":"37.335931","Object Shape":"Other","Object Features":"None","files":["/var/www/straped/mufon/html2text/40923.html.txt","/var/www/straped/mufon/org/40923.html"],"Longitude":"-82.980441","Source":"MUFON","Date of the Event":"01/15/2002 10:30 UTC","divs":["Sighting DetailsI was driving home from work when i noticed that some of the stars seemed very large. Then I noticed they were moving across the sky from left to the right and something fairly large was blocking out the real stars behind it as it moved. It vanished behind a small hill for just a couple seconds only to reappear on the other side. It made no sound at all and it was covered in large bright white lights that didn't seem to light up the ground under it. But it passed over a small lake you could see it reflected in the water. My first reaction to seeing it was amusement I thought it was now I'm going to be a nut that sees a UFO but instantly I was completely terrified and just wanted to get away as fast as my vehicle could take me, I've never been that afraid in my life and I don't want to be that scared ever again. I knew my life was in danger and I had to get away. This happened in 2002 I told my father and he laughed at me and said I just didn't understand what I saw that night. He was right I didn't. Even my memory of the event seems fuzzy as more and more time goes by. I need to tell some before I can't remember it any more."],"Region":"Kentucky","Date Submitted":"07/19/2012 08:08 UTC","Log Number":"US-07192012-0008","Weather Factors":"Unknown","Tags":"City","Country":"United States"}