{"Object Features":"None","Case Number":"40921","Longitude":"-87.628188","City":"Chicago","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Disposition":"Unresolved","Viewing Distance":"Unknown","Region":"Illinois","Latitude":"41.886494","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around July 17th 2012"],"Log Number":"US-07192012-0006","map":"<A HREF = \"http://maps.google.com/maps?q=41.886494,+-87.628188(40921)&iwloc=A&hl=en\"> mufon case (40921) map </A>","Date Submitted":"07/19/2012 03:52 UTC","Summary":"Three red lights in sky forming wide, loose triangle shape.","Weather Factors":"Unknown","divs":["Sighting DetailsI went into my mother's room on the second story of my home to retrieve my daughter since it was bedtime. My daughter noticed the lights first and was having a conversation with my mother about what they might be. Note: my daughter is four, so this was a preschooler's speculation. I looked out the window and saw three red or red-orange lights straight ahead, above the houses across the street. They formed a wide, loose triangular shape, with two lights equidistant from each other, and the third slightly below and in between the first two. My heart jumped. I'd always heard other folks' accounts about odd sightings, and kept an open mind, but never thought I'd see something myself. I felt right away that this was important and was not \"normal.\" My mother claimed it was helicopters or fireworks and said that someone as smart as myself should know better, which pissed me off. When you have a sense or feeling about something, you shouldn't doubt yourself. I knew that what I was seeing was amazing, and NOT some weird fireworks or soundless helicopters. I ran to find my camera but could not locate an SD card, so I ran back to the window empty handed. By this time, the light on the far right had extinguished, and the other two lights had moved closer together. If the third light had still been visible, I imagine it would have formed a tighter triangle. We watched, and the lights remained steady. Then I began to feel like they were fading, but couldn't be sure, like when you see something clearly with peripheral vision, but when you look straight on it disappears. That's what this felt like. I squinted, and indeed, both lights extinguished slowly, one after the other. I put my daughter to bed and there was no other sign of these lights. I'd also like to note that I live rather close to an international airport and planes constantly descend over our house every couple of minutes, but during these four or five minutes we observed the lights, there were no airplanes whatsoever. I did a Google search this evening and discovered that similar lights in similar triangle formation have been seen in several places such as Florida, New Mexico, and the UK. I'm desperate to see and find out more!"],"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/40921.html.txt","/var/www/straped/mufon/org/40921.html"],"Date of the Event":"07/17/2012 12:00 UTC","Country":"United States"}