{"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"07/19/2012 09:58 UTC","Object Shape":"Unknown","trends":["There has been one other sighting in Hopkinton","There were no other sightings in Hopkinton on or around July 2nd 2012"],"Country":"United States","Latitude":"41.440095","City":"Hopkinton","Disposition":"Unresolved","Summary":"bright yellow light with green and pink lights on the sides","Date of the Event":"07/02/2012 04:17 UTC","Region":"Rhode Island","files":["/var/www/straped/mufon/html2text/40925.html.txt","/var/www/straped/mufon/org/40925.html"],"Sighting Duration":"00:15:00","divs":["Sighting DetailsIn the early morning hours of July 2,2012 I woke up around 4AM. When I couldn't fall asleep I decided to go outside to smoke a cigarette, that was at 4:17AM. When I sat down and looked around the yard I saw a bright light in the distance. The light was to the south of my house in Hope Valley, RI. I was able to see the light clearly although it seemed far away. My first thought was, that's a really bright and big star. Then I realized there were no other starts in the sky. It appeared to be a yellowish light. I watched more closely because I thought it was an airplane but then realized it wasn't moving at all. I sat and stared at this light trying to figure out what it was, It was a big yellow light in the middle and on one side of the yellow light was a pinkish colored light and on the right a greenish colored light. The two smaller lights did not remain on but rather faded in and out. I watched this for approximately 15 minutes and in that time the only movement was ever so slightly to the side then back again to it's original position. I probably wouldn't have even noticed that if I hadn't been staring so closely. After watching it for about 15 minutes I went into the house. When I woke up again and went outside around 6 it was gone. I was the only one awake to witness this."],"Longitude":"-71.731809","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.440095,+-71.731809(40925)&iwloc=A&hl=en\"> mufon case (40925) map </A>","Object Features":"Unknown","Object Flight Path":"Stationary","Log Number":"US-07192012-0010","Case Number":"40925","Tags":"City"}