{"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"40929","Object Shape":"Disc, Flash, Oval, Sphere","Object Features":"None","Weather Factors":"Unknown","Longitude":"-89.198695","Date Submitted":"07/19/2012 03:12 UTC","Latitude":"30.326517","City":"Long Beach","Tags":"City","Viewing Distance":"Unknown","Country":"United States","Summary":"3 different sitings with same characteristics different place in sky","files":["/var/www/straped/mufon/html2text/40929.html.txt","/var/www/straped/mufon/org/40929.html"],"Object Flight Path":"Path with directional change","Source":"MUFON","Log Number":"US-07192012-0013","divs":["Sighting DetailsWhile sitting on the back porch on July 4 2012 we witnessed an unusual object in the sky. The object moved slowly the gained speed and altitude until it blinked 2 then disapeared. Approx 10mins later a similar object apperead and flew exactly the same pattern and ended the same way. Approx. 45mins later in a different part of the sky a similar object was seen, only closer, and we could see a distinct bottom as the craft hovered. It moved slowly, very slowly, proceeded to ascend at which time it also blinked and the gone. I served in the AF for 10yrs and I am very familiar with jets as well as prop planes and this was neither. Yes it was the fourth of July, but there is nothing not even a flare that can fly the exact same path within a few minutes. Rarely can a human flown jet fly the EXACT path twice. Third time it moved so slow and may no sound it could not have been an aircraft currently known, to civilians or even speculated to exist. I thought the first time was most likely some sort of flare but it moved oddly. The second time I started questioning the possibilities of what it could be. The third time was a fluke, I had turned to chat with my wife and noticed the EXACT same type of object only moving slower and closer. It was orange, glowing, hard to get a true structure design. The 3rd time it was easy to see the black bottom and it was flat. The top was still orange, but not some much a glow as the color."],"Region":"Mississippi","trends":["There have been no other sightings in Long Beach","This sighting has never been favorited."],"Date of the Event":"07/04/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.326517,+-89.198695(40929)&iwloc=A&hl=en\"> mufon case (40929) map </A>"}