{"Disposition":"Unresolved","Viewing Distance":"Unknown","Summary":"Contact with 3 entities in our home/ this occurs every 6 months","files":["/var/www/straped/mufon/html2text/40936.html.txt","/var/www/straped/mufon/org/40936.html"],"divs":["Sighting DetailsThursday night, approximately midnight to 3am, my brother who is the contactee had another visit. We live together. I went to bed early since I had work in the morning and do not recollect any of the details. This is what happened to him: about midnight he was going to sleep and three \"greys\" appeared in his room. He usually feels them coming a few days ahead and is at least somewhat prepared; not this time. After they entered the room they made him black out and put him in a trance like state playing a fake memory in his head of our old house and our dead father. They showed him UFO's outside the bedroom window and he ran downstairs to tell our Dad. They both went outside to look at them. This was the false memory they put in his head. Obviously. He woke up and realized what had happened but has no memory of what happens during the 3 hour time span. These visit occur generally every 6 months. We pretty much expect them. They were a lot more frequent when he lived in Maine or even at our mother's house in PA. He lost 3 hours this time. I was completely unaware. I had negligible contact as a child but they lost interest in me when I was 6. Any help would be appreciated. Thank You."],"Region":"Pennsylvania","Weather Factors":"Unknown","Object Features":"Undisclosed","Date Submitted":"07/19/2012 09:51 UTC","Longitude":"-75.655302","Object Shape":"Unknown","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.411369,+-75.655302(40936)&iwloc=A&hl=en\"> mufon case (40936) map </A>","Latitude":"41.411369","Log Number":"US-07192012-0020","Sighting Duration":"Undisclosed","trends":["There have been 28 other sightings in Scranton","There were no other sightings in Scranton on or around July 15th 2012"],"City":"Scranton","Date of the Event":"07/15/2012 12:00 UTC","Case Number":"40936","Object Flight Path":"Undisclosed","Country":"United States"}