{"files":["/var/www/straped/mufon/html2text/40930.html.txt","/var/www/straped/mufon/org/40930.html"],"Disposition":"Unresolved","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Region":"Arkansas","Tags":"City","City":"Undisclosed","Date of the Event":"01/25/2012 09:30 UTC","Viewing Distance":"101-500 Feet","Object Shape":"Triangle","Summary":"Black triangular shape with rounded corners. Maybe 20' in height and over 120' per side. 3 pulsating lights without emitting light, almost moist looking light","Object Flight Path":"Straight-line path","divs":["Sighting DetailsApproximately 3rd week of January 2012 I was going to put up my dogs from their dog run. I do this around 9:30pm every night. While walking toward the pen I caught movement out the corner of my eye. I turned and observed a black triangular shaped object with smooth rounded corners moving down the valley that we live in. The object was less than 400' off of the ground and at an approximate 75 degree angle from me. First thought was military aircraft on low run but I have lived in this home for almost 20 years and have never seen any military aircraft on low flight manuevers. The object was perhaps 20' thick and 120' on each side. There were 3 white lights underneath that were almost a moist milky white but yet now light was being emitted. There were no aircraft running lights observed as well as no forward lights. The object was moving at a slow rate for something in the air. I would estimate the object was moving at slightly less than 50 mph. There was no engine noise, just a gentle swoosh of moving air. Object moved linear with no change except a gentle manuever to adjust for a slight change of the valley topography. My dogs, two male Great Pyrenees, who would normally bark at the movement of a leaf both were sitting and watching the object without reacting. That is almost as strange as seeing the object. I observed the object move out of view down the valley and then contacted a distant neighbor to see if he had observed anything. Unfortunately he had not been outside."],"trends":[],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.20305,+-91.825593(40930)&iwloc=A&hl=en\"> mufon case (40930) map </A>","Date Submitted":"07/19/2012 04:29 UTC","Case Number":"40930","Object Features":"Undisclosed","Log Number":"US-07192012-0014","Latitude":"35.20305","Longitude":"-91.825593"}