{"City":"Little River","Weather Factors":"Unknown","Log Number":"US-07192012-0021","Viewing Distance":"Over One Mile","Longitude":"-78.636156","Date Submitted":"07/19/2012 10:48 UTC","Tags":"City","Region":"South Carolina","Case Number":"40937","Object Shape":"Sphere, Star-like","Summary":"Initially saw orange spheres to the East over ocean. Then multiple series of white twinkling lights moving north to south and then south to north. Orange lights would periodically glow bright and then fade out.","Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"07/18/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/40937.html.txt","/var/www/straped/mufon/org/40937.html"],"Latitude":"33.898293","trends":["There have been 2 other sightings in Little River","There were no other sightings in Little River on or around July 18th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.898293,+-78.636156(40937)&iwloc=A&hl=en\"> mufon case (40937) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"United States","Source":"MUFON","divs":["sighting detailswalked outside with visiting family members and my kids to enjoy how the night had cooled off. while glancing toward night sky, eastward, toward ocean (4 miles away, as the crow flies), my daughter and i initially noticed bright glowing orange sphere-like objects (two), that brightened, appeared to revolve and then fade. we then saw a large number of twinkling, white lights, pulsating and moving south to north along coast and then north to south again. the orange sphere like objects made one more appearance. we were mesmerized by these objects to the point that we brought out lawn chairs to just watch for nearly 2 hours from 9-11pm. we have never in our life seen anything like this. on a side note... on the night of 7\\19, i saw a few more of the twinkling lights in the southern and western skies around 9:30pm, but not like the night of the 18th."],"Disposition":"Unresolved"}