{"Date Submitted":"07/20/2012 01:55 UTC","Object Flight Path":"Hovering then path,Path with directional change,Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.516358,+-84.391966(40948)&iwloc=A&hl=en\"> mufon case (40948) map </A>","files":["/var/www/straped/mufon/html2text/40948.html.txt","/var/www/straped/mufon/org/40948.html"],"Latitude":"39.516358","Case Number":"40948","Summary":"filmed four bright white objects. Three were stationary and the four orbited around them, leaving a long stream of orange/red flame. Too agile and fast for a known plane or helicopter. Looked like flying Meteors with intelligence and flying formations.","Sighting Duration":"00:05:00","Date of the Event":"07/14/2012 09:30 UTC","Viewing Distance":"Over One Mile","trends":["There have been 13 other sightings in Middletown","There were no other sightings in Middletown on or around July 14th 2012"],"Object Shape":"Circle, Fireball, Sphere","Object Features":"None","Log Number":"US-07202012-0009","divs":["sighting detailsfilmed four bright white objects. three were stationary and the fourth orbited around them, leaving a long stream of orange\\red flame. too agile and fast for a known plane or helicopter. looked like flying meteors with intelligence and flying formations my girlfriend and i were driving down a very populated road in middletown on april, 14, 2012 at about 9:30 pm i believe. we were talking about something then i looked up at the sky and saw four lights. i thought they were stars at first, then one of them did something odd. one of the four lights began flying around the other three lights, giving off a long trail of orange\\red flames making it look more like a meteor with intelligence. as i looked at it i stopped mid sentence, sluring the last couple of words that came out of my mouth and droned off, completely forgetting what we were talking about and mesmerized by the objects. then the fourth one began flying back and forth in front of the three lights and stopped. after this, the three lights aligned them selves and drifted into the clouds, came back and then disappeared again. the fourth one sat there, motionless for a bit, then went to follow them behind the cover of the clouds. after about thirty seconds the fourth one (or what i had assumed was the fourth one due to it's similar agile 'personality') had reappeared. we pulled over to the side of the road and video taped the rest of it. the fourth one began doing some back and forth motions for about one minute then disappeared into the clouds again for the last time. we sat there for roughly another ten minutes to make sure that they had gone. i had been so focused on the experience that i had forgotten where i was for a second. i blinked a bit and began looking around, searching the area for other people who might have witnessed this phenomenal sighting, but there were none. i honestly couldn't believe that there were no other people around that had stopped like we did. both of us were speachless as we drove on home. if there were any other reports in the area i would like to hear them. the video was taken with my iphone so the quality isn't that great. next time i think i'm going to carry a decent video camera with me at all times. it is also in two sections because i had to email the video from my phone to my computer and the video had to be split since it was to large of a file to email."],"Source":"MUFON","Longitude":"-84.391966","Weather Factors":"Unknown","Region":"Ohio","Country":"United States","Disposition":"Unresolved","City":"Middletown","Tags":"City"}