{"Disposition":"Unresolved","Case Number":"40941","Date of the Event":"07/19/2012 08:58 UTC","Object Shape":"Other","Date Submitted":"07/20/2012 05:13 UTC","Tags":"City","Log Number":"US-07202012-0002","Latitude":"37.29205","Weather Factors":"Unknown","Country":"United States","trends":["There have been no other sightings in Hartville","This sighting has never been favorited."],"Longitude":"-92.636664","Object Features":"Other","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsWe were in the frount yard moving hay from the yard to the barn.I was sitting in the truck keeping the cows from coming throught the gates. I had the radio on and could not get a clear channel so I shut it off. I had my cell phone in the seat and decided to put it on the dash expecting to get a text mesage from my sister. When I put the cell phone on the dash I noticed a bright red glarring pulsating light coming out of the south and towards us.At first I thought it was a helicopter,thinking it was our life flight we use for emergency transport for critical patients. The closer it came I realized the shape was not the shape of a helicopter or a plane.When it was almost over us, it made a sharp turn to the east,then slowly turned to the north and hovered for just a few seconds,changing from a burning red to a soft charcole black,darker than a dark gray.It began to travel,much slower,towards Lebanon Missouri.We watched it about 10 to 15 minutes as it slowly dissapeared over the tree line,north of our home.We did get some moving pictures of the object before it changed color.In the past years we have witenessed many unusal objects in the sky around and above our home,and do have pictures. Recently we realized these objects are getting very close to our home. This has become a major concern for us to deal with and wish we had never seen these objects or were made aware of them.It has cost many sleepless and diturbing nights.In the past three years,we have lost two healthy young cows with missing parts of their body and no blood pools. Their bodies were never bothered by wild animals or buzzards.We have had floating white lights in our bottom land that filled our home with a bright white light that made it look like it was daylight,only it was late,late,at night,and for several weeks there was a ball of blue light in our woods that would travel,5 to 7 feet above the ground,east and west,just inside of the tree line.Even though we have neighbors who have seen these things,it still makes us feel very uncertain about what we have witnessed. If it weren't for the neighbors and the pictures we have,I think I would loose my senses."],"Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=37.29205,+-92.636664(40941)&iwloc=A&hl=en\"> mufon case (40941) map </A>","Source":"MUFON","Summary":"Low in sky,over head,bright burnning red pulsating light changed to soft charcole color bottom, made 2 distinct turns, hovered,slowly traveled north towards Lebanon Missouri.","City":"Hartville","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40941.html.txt","/var/www/straped/mufon/org/40941.html"]}