{"trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around July 20th 2012"],"Longitude":"-89.645748","Log Number":"US-07202012-0005","Date of the Event":"07/20/2012 12:00 UTC","Viewing Distance":"Unknown","Summary":"Bright starlike object appeared to be flipping across sky then disappearing, suddenly reappears in same place","Region":"Illinois","Object Shape":"Flash, Star-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.790361,+-89.645748(40944)&iwloc=A&hl=en\"> mufon case (40944) map </A>","divs":["Sighting DetailsI was standing outside a restaurant after dinner with friends chatting when suddenly in the northern sky at about a 45 degree angle I saw what I first thought was the ISS,it was a very bright white light, being that my husband has an app on his phone to track satellites and the ISS, I have seen the ISS many times as well as many satellites. This time it was different, it seemed to be tumbling across the sky for about 10 seconds. I yelled at my husband \"LOOK\" and pointed to the spot where I witnessed it. All my friends looked, but it had disappeared. I thought that it must have been the ISS and continued to chat with friends. Approximately 1-2 minutes later I saw the exact same thing in the exact same place in the sky doing the exact same tumbling flash sequence. I yelled out and one of the friends with me said she saw it as well. Strangely as my friend and I were driving downtown about 20 mins after said event, we saw another object that was a solid light with a yellowish tint heading east at a fairly quick pace, we both saw this as well but I was unable to tell if it could have been a plane, as it flew off into the distance. This week has also been strange, I woke up several days ago with two marks on my left palm, one of them a small cut I did not have before I went to bed and a pain to the right of my bellybutton that almost felt like I had a hernia, as I felt something in the area when I pressed. Over the past few days the pain subsided but it is sore when I press on the area. Also since that day I am very very anxious and nervous feeling. I don't know if any of this is related, I just though I would add any strange events that seemed to happen this week."],"Weather Factors":"Unknown","Date Submitted":"07/20/2012 10:28 UTC","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Other","Object Features":"Unknown","Case Number":"40944","City":"Springfield","files":["/var/www/straped/mufon/html2text/40944.html.txt","/var/www/straped/mufon/org/40944.html"],"Latitude":"39.790361","Country":"United States"}