{"Sighting Duration":"Undisclosed","Summary":"Observed intense whitish light perhaps 1-2 miles distant, changing in intensity, projected rotating beam downward, multiple smaller orbs around, beneath clud cover 4:30 AM July 19th","Date of the Event":"07/19/2012 04:30 UTC","Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unresolved","trends":["There have been no other sightings in Sharpsburg","This sighting has never been favorited."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.376657,+-84.648655(40951)&iwloc=A&hl=en\"> mufon case (40951) map </A>","Latitude":"33.376657","Weather Factors":"Unknown","City":"Sharpsburg","Object Flight Path":"Stationary","Longitude":"-84.648655","Region":"Georgia","Tags":"City","Object Shape":"Unknown","divs":["Sighting DetailsI was unable to sleep around 4:30 AM at my sister's house in Sharpsburg GA. There is a 2 acre pond in her backyard, the house is far from any city lights. I observed a very bright light perhaps 1-2 miles distant, in the direction of the pond at exactly 4:30 AM. I believed it to perhaps be the North Star or a planet, but on closer examination the object was obviously below the scattered cloud cover as the clouds were backlit by this object. The sky was mostly clear except for slightly scattered clouds. All the other stars in the sky looked completely different from this one object. It appeared to hover in the sky, but on closely looking I could see that the object appeared to \"bounce\" around in the sky slightly where it was hovering. It projected 4 beams, one each left, right, up, and down from my point of view. The beam that projected down I could clearly see was rotating around in various directions, while the other 3 were stationary.I could also see , at times, a number of other much smaller \"orbs\" that moved around in the sky around this object. I watched the object for about 30 minutes until I saw the sun begin to rise about 5:00 AM . I went back to bed around this time and the object was still visible in the morning sky. I remember the way I felt during this sighting was a spine chill and perhaps the same feeling as when you know someone is observing you when after about ten minutes of watching I realized the object was not stationary in the sky and was below the clouds. There was a good amount of air traffic in the sky also at much higher altitudes than this object, the aircraft easily distinguished by flashing red and green port-starboard lights and flight paths out of and into the area."],"Date Submitted":"07/20/2012 04:22 UTC","files":["/var/www/straped/mufon/html2text/40951.html.txt","/var/www/straped/mufon/org/40951.html"],"Log Number":"US-07202012-0011","Object Features":"None","Case Number":"40951"}