{"map":"<A HREF = \"http://maps.google.com/maps?q=37.847633,+-84.263138(40956)&iwloc=A&hl=en\"> mufon case (40956) map </A>","Date Submitted":"07/20/2012 09:09 UTC","Country":"United States","Object Flight Path":"Straight-line path","Log Number":"US-07202012-0017","divs":["Sighting DetailsWe were in the pool out the front of the house, taking note of a weird cloud formation that had appeared on the approaching storm front. This cloud (which i have pictures of) Looked like a rainbow mist that was balanced on the very edge of this tall cloud systems. We watched it glow and change colour from blue hues, through to orange, purple until it discipated into a green haze then vanished. While i was looking at this cloud, i noted slightly higher than this cloud, it would have come from the very centre of it (to be precise) a cylindrical tube, length of about 30-100 feet, perfectly straight and curved at each end rather like an American football. The middle of this object appeared a grey colour, a midish shade. The nose and tail were glinting clearly in the sunlight, i of course called out for the camera as everyone had noted the cloud, but i was looking further south away from this formation trying to locate where it went to. Sadly through due to the excitement of the cloud we were filming and the *wow* factor of the colouration, i never spotted again. It was travelling south from our home towards lexington, This was at approx 7pm just before we had the extreme thunder storms about 30 minutes later."],"files":["/var/www/straped/mufon/html2text/40956.html.txt","/var/www/straped/mufon/org/40956.html"],"Latitude":"37.847633","trends":[],"Object Shape":"Cigar, Cylinder","Sighting Duration":"Undisclosed","Summary":"Cylindrical tube, appeared from above an approaching storm cloud","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-84.263138","Region":"Kentucky","Object Features":"None","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"07/19/2012 12:00 UTC","City":"Undisclosed","Tags":"City","Case Number":"40956","Weather Factors":"Unknown"}