{"Date of the Event":"07/04/2012 10:20 UTC","files":["/var/www/straped/mufon/html2text/40955.html.txt","/var/www/straped/mufon/org/40955.html"],"Latitude":"40.760996","Longitude":"-73.28146","Case Number":"40955","map":"<A HREF = \"http://maps.google.com/maps?q=40.760996,+-73.28146(40955)&iwloc=A&hl=en\"> mufon case (40955) map </A>","Object Flight Path":"Path with directional change","Log Number":"US-07202012-0016","Weather Factors":"Unknown","Region":"New York","Object Shape":"Circle, Fireball, Oval, Sphere","Date Submitted":"07/20/2012 07:50 UTC","Source":"MUFON","City":"Bay Shore","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAfter a brief shower on the 4th of July around 9:45 PM, I went outside with Spanky, my dog, and saw some fireworks. The heaviest fireworks were mainly in a south-east direction,(on the next block) While watching these, I looked to my right a little and noticed an object that was red, orange and yellowish, flaring and it seemed the light at times would fade in and out. It would cross the sky, get to a certain point, (where the heaviest fireworks were) and fade out. A total of 7 objects did this exact pattern. Staring at the direction of the fireworks, to the left of those (my left) is when these other objects, same description as the previous, about 7 - 9 objects would pick up again, same pattern, they would travel from south to north then at a certain point bank to the east. 7 or so objects. As soon as I saw the first object I knew it wasn't a plane or a helicopter. At first after the second set of sightings, I thought it was a run off from the fireworks, but they had a flight pattern. I was ecstatic and anxious viewing this event. The objects headed east and faded from sight. I hoped the photo and video I supplied helps."],"Viewing Distance":"501 Feet - 1 Mile","Summary":"I witnessed a total of 14 - 16 objects, red, orange and yellow glowing and pulsating lights.","Country":"United States","Tags":"City","trends":["There have been 16 other sightings in Bay Shore","There were no other sightings in Bay Shore on or around July 4th 2012"],"Object Features":"Unknown","Disposition":"Unresolved"}