{"Date of the Event":"07/18/2012 02:02 UTC","Object Features":"None","Log Number":"US-07202012-0025","Region":"Colorado","files":["/var/www/straped/mufon/html2text/40964.html.txt","/var/www/straped/mufon/org/40964.html"],"Source":"MUFON","Object Flight Path":"Stationary","Case Number":"40964","Summary":"Observer what I thought was a brightly twinkling star just above the horizon. Through binoculars it appeared to be spinning and changing color.","Object Shape":"Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.71955,+-105.167779(40964)&iwloc=A&hl=en\"> mufon case (40964) map </A>","Disposition":"Unresolved","divs":["sighting detailsfrom the deck on the west side of my house about 2:00 a.m. 7\\18\\12 i observed what i thought was a brightly twinkling star. since it appeared, with the naked eye, to be much brighter than the other stars and changing colors i went into my house and got my binoculars. through the binos the object appeared to be spinning and changing colors. the colors were white, red, blue, and green. while watching the object an airliner appeared to fly directly behind it. after watching it for 15 to 20 minutes i decided to try to get an picture of it. i took three pictures with my digital camera with an 18x power lens. only one of the pictures had a decent image and it was just an orange blur. i observer the object for about one hour and it didn't appear to get any closer to the horizon as did the stars. the next night (actually about 12:30 a.m. 7\\19\\12) i went back out on the deck to see if the object was where it had been the night before. it wasn't. today, 2:00a.m, i again observer the same object low to the horizon but about a hand width to the south of where it was two nights before."],"Sighting Duration":"01:00:00","Viewing Distance":"Over One Mile","City":"Golden","Tags":"City","Latitude":"39.71955","Longitude":"-105.167779","Country":"United States","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around July 18th 2012"],"Date Submitted":"07/20/2012 11:51 UTC","Weather Factors":"Unknown"}