{"Country":"United States","Object Shape":"Sphere","divs":["Sighting Details It was about 10:00 PM on July 20, 2012. I was laying on my bed, talking on my cell phone to a coworker. I looked out the window to my left and saw an orangish-red light flying soundlessly through the sky. I kept watching it to see what it was as we often see helicopters and small airplanes, but I have no idea what this was. As I laid watching it another orange-red light appeared below and behind the first. I told my friend that I was seeing something weird in the sky. Then I saw a third light behind the second and at what appeared to be the same altitude. The 3 lights were flying behind some tall trees so I got up off the bed and walked over to my window seat and looked out a side window and they were flying free of the trees. As they came into clear view the first just kind of disappeared, then the second, until finally all 3 were gone. My first thought was that these were obviously unidentified flying objects, no doubt. No sound, no normal aircraft lights, just 3 orangish-red glowing balls of light flying through the air."],"Summary":"3 lights moving across sky together that were all red-orange, then disappeared.","Case Number":"40961","Date of the Event":"07/20/2012 12:00 UTC","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"07/20/2012 11:19 UTC","Longitude":"-83.919798","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.620743,+-83.919798(40961)&iwloc=A&hl=en\"> mufon case (40961) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40961.html.txt","/var/www/straped/mufon/org/40961.html"],"trends":["There have been 20 other sightings in Howell","There were no other sightings in Howell on or around July 20th 2012"],"Source":"MUFON","Latitude":"42.620743","Disposition":"Unresolved","Region":"Michigan","Weather Factors":"Unknown","Viewing Distance":"Unknown","Log Number":"US-07202012-0022","City":"Howell"}