{"Date Submitted":"07/21/2012 06:00 UTC","Viewing Distance":"Unknown","Longitude":"-96.654262","map":"<A HREF = \"http://maps.google.com/maps?q=33.013854,+-96.654262(40978)&iwloc=A&hl=en\"> mufon case (40978) map </A>","Object Flight Path":"Straight-line path","Summary":"2 ovals made up of red lights. lights blinked out but some moved and then went out","Object Features":"None","Tags":"City","Country":"United States","Weather Factors":"Unknown","Latitude":"33.013854","files":["/var/www/straped/mufon/html2text/40978.html.txt","/var/www/straped/mufon/org/40978.html"],"Log Number":"US-07212012-0014","trends":["There have been 25 other sightings in Plano","There were no other sightings in Plano on or around December 24th 2011"],"Disposition":"Unresolved","Object Shape":"Oval","Source":"MUFON","Date of the Event":"12/24/2011 10:45 UTC","Sighting Duration":"Undisclosed","Case Number":"40978","divs":["Sighting Detailson Christmas eve of 2011 I left my sister's house in Plano to drive home to Rowlett around 10;45 PM- as I came to the stop light at 14th street I observed 2 large ovals made up of red orange lights. The larger one had about 9 lights and the smaller one was made up of 7 or so. I stopped the car to observe and could see they were quite high and seemed very large across. The direction would appear to be over north Dallas. The lights in the smaller oval just blinked out one at a time until the highest light started moving in a straight line to the larger oval which was to it's left and slightly higher. Then the large oval lights starting disappearing as well until the one in the 10 o'clok position started moving to the last remaining light and when it got there they both blinked out. I remember thinking \" oh no- they are going to crash!\" The lights were not electrical but seemed to flicker or plusate and were not steady- it was almost like they were the back of a jet engine or rocket. I do not think they were a solid object with lights encircling them but rather 2 rings made up of individual objects rather evenly spaced. Sure would like to know what they were. I am not a fanciful person and I pondered for a long time on how to share this story. I have only told one good friend- if I heard this story from someone I doubt I would believe it. I do not know what I saw but I do know it wasn't anything I have ever seen before or since. It was mainly a sense of wonderment that I felt."],"City":"Plano","Region":"Texas"}