{"Region":"Kentucky","Longitude":"-85.533434","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around July 15th 2012","This sighting has never been favorited.",""],"Disposition":"Unresolved","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date Submitted":"07/21/2012 06:44 UTC","Source":"MUFON","Object Shape":"Cone, Oval, Square, Rectagular","City":"Louisville","Date of the Event":"07/15/2012 08:15 UTC","divs":["sighting detailson 7\\15\\2012 at approximately 8:15 p.m., my wife and i were standing on our deck behind our house. we both looked up and saw a oval shaped object with a red ring underneath it and three round lights along its keel. this object appeared to be approximately 3500 feet in the air, traveling west to east, in a straight line. as the object got closer to us my wife ran inside the house and brought out our 35mm camera with 30 power zoom. by the time i could get focused on the object, it was directly above us still traveling east, however the red ring and the 3 lights were no longer visible. the object had also changed shape to a cube and then to a cone of sorts. the object made no sound during the entire sighting. i was able to get a short video clip of this which i would like you to see. my wife saw a ufo several years ago while driving home late one night, however this is my first sighting. this object just suddenly disappeared from view. i ran out to the front of our house where i was clear of trees, but it was gone. i have no pictures, just the video clip"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/40971.html.txt","/var/www/straped/mufon/org/40971.html"],"Summary":"7/15/2012 UFO SIGHTING LOUISVILLE, KY. 40241","map":"<A HREF = \"http://maps.google.com/maps?q=38.322783,+-85.533434(40971)&iwloc=A&hl=en\"> mufon case (40971) map </A>","Tags":"City","Latitude":"38.322783","Log Number":"US-07212012-0007","Object Features":"Unknown","Case Number":"40971"}