{"map":"<A HREF = \"http://maps.google.com/maps?q=40.62455,+-74.091694(40974)&iwloc=A&hl=en\"> mufon case (40974) map </A>","City":"New York","Summary":"while facing westward direction bright orange glowing orb appeared, hovered sped away then returned 3 times. much higher than horizon.","Longitude":"-74.091694","divs":["Sighting DetailsWe were sitting on the side porch unwinding from a long day as the power had gone out a couple of hours prior. While conversing with my sister-in-law and brother i noticed a strange orange glowing sphere in the sky that was getting brighter and larger in size. I pointed it out to the others and they turned to see the oddity. In complete silence we starred in amazement trying to figure out what this strange light was as it hovered in the skyline. My sister then pointed out she had seen a similar light in the same skyline a few months prior. So as we were watching through the trees it seemed to hover over the lake area for a few minutes and then it just zoomed away at a significantly fast speed. you could almost see what looked like a miniture \"space craft\" as it disappeared. A few minutes later as we were still talking about the light and trying to determine what we just saw it appeared again in the same area from a what appeared to be a small dot turning into a large orange orb...again the same thing we had seen minutes before. After a few minutes it disappeared again in the same fashion. We then noticed some blinking lights (possibly helicopters) in that same area. Then some neighbors let off fireworks approx. 10 of them. The light returned for a third time while the fireworks were going off. we still just watched the light in amazement and then it disappeared just the same. after that we went inside and about 30 minutes later the power returned and all has been well since."],"Source":"MUFON","Disposition":"Unresolved","Tags":"City","Viewing Distance":"Over One Mile","Date Submitted":"07/21/2012 12:54 UTC","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Region":"New York","Log Number":"US-07212012-0010","Case Number":"40974","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Country":"United States","Latitude":"40.62455","files":["/var/www/straped/mufon/html2text/40974.html.txt","/var/www/straped/mufon/org/40974.html"],"Date of the Event":"07/20/2012 09:55 UTC","Object Features":"Unknown","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around July 20th 2012"]}