{"map":"<A HREF = \"http://maps.google.com/maps?q=41.301183,+-81.891356(40984)&iwloc=A&hl=en\"> mufon case (40984) map </A>","Country":"United States","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/40984.html.txt","/var/www/straped/mufon/org/40984.html"],"Object Features":"Unknown","Log Number":"US-07212012-0020","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Latitude":"41.301183","City":"Columbia Station","Weather Factors":"Unknown","Summary":"Witnessed several red glowing objects in a pattern in the sky. The glow dimmed until they faded from site like they flew away.","Date of the Event":"07/21/2012 10:00 UTC","Longitude":"-81.891356","Date Submitted":"07/21/2012 11:05 UTC","Viewing Distance":"Unknown","trends":["There has been one other sighting in Columbia Station","There were no other sightings in Columbia Station on or around July 21st 2012"],"Object Shape":"Sphere","Region":"Ohio","Disposition":"Unresolved","Case Number":"40984","divs":["Sighting DetailsWe were driving home at 10pm EST and came around the bend and in front of us in the sky framed by the trese were several (over 10-15) red glowing objects in a formation in the sky. My first thought was that it was the residue embers from a firework morter but they did not disappear just stayed there glowing. Then it looked like a constalation or a farris wheel but it was bright red and in the sky and not where anything ever is. They appeared to be very slowly moving away from each other like how a firework would react but in slow motion and with no trails... just red glowing objects. We first pulled over to the side of the road in front of out house to stare but then we pulled in the drive way, parked, then walked 75 feet back out to the street to see if they were still there and they were! Still in formation but a bit further away from each other. It is a busy road (blind curve in a rural area) and cars kept driving by so we had to keep getting out of the road and but each time we came back to the center they were still there. The lights appeared to fade gently like they were getting farther away. I only saw one or two go out of formation but the basic shape stayed the same- they also appeared to pulse softly. We observed these for about 5-10 minutes in total. My husband and I just keep looking and saying \"what ARE they?\", \"what IS it?\". It was definatly a sight to see! I have never seen anything like it. I then came into the house to get a camera - I walked back out and they were gone. No trace at all. I have no idea what this could be. I googled to see if any one else reported something or to see if there was anything going on around here but there was nothing. There was also nothing on the news. This site popped up so I decide to post it. It was really something to see - I wish I had a picture! :("]}