{"Weather Factors":"Unknown","Log Number":"US-07212012-0018","Date of the Event":"07/21/2012 09:00 UTC","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Old Lyme","This sighting has never been favorited."],"Country":"United States","Object Features":"Unknown","Case Number":"40982","divs":["Sighting DetailsI was sitting on my back porch smoking a cigarette when I noticed an Orange light coming over the top of the trees. I then saw 2 more Orange objects following the first. I called my wife and daughter out to look at them. I thought they were fighter jets as I have seen a flight of 3 before, though heading in the opposite direction and they had red and white lights on them. We watched the objects, which were on in triangle formation, for approximately 35-40 seconds. The lead object continued on across the horizon and disappeared. The second object reached approximately half way across the horizon and disappeared. The third object disappeared before it came from behind the trees. We heard no engine noise what so ever. Neither prop nor jet. Approximately 2-3 minutes later, we saw 3 more Orange objects come over the trees. I reached inside the house for my binoculars and tracked on of the objects. I could see no definite craft or shape bit it was still Orange. These 3 objects disappeared before coming out from behind the trees. The last object followed approximately 15-20 seconds after the last 3 disappeared. This object traveled from horizon to horizon before disappearing. My wife was able to take a picture of it with her cell phone. The photo just showed a white dot. All of the objects traveled along the same plane but several degrees apart. Our feelings at first were that we were watching jets fly by but when we did not hear any sound and saw they rest of the objects flying on the same path, some disappearing and some not, we were convinced we had seen something unusual. Just to be sure, we checked our Space Junk, NASA and ISS apps to make sure that there was nothing that could explain what we had seen."],"Tags":"City","City":"Old Lyme","map":"<A HREF = \"http://maps.google.com/maps?q=41.358965,+-72.301346(40982)&iwloc=A&hl=en\"> mufon case (40982) map </A>","files":["/var/www/straped/mufon/html2text/40982.html.txt","/var/www/straped/mufon/org/40982.html"],"Latitude":"41.358965","Longitude":"-72.301346","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"07/21/2012 10:23 UTC","Summary":"I witnessed 7 orange objects traveling from S to N. 2 went from horizon to horizon. 1 went 1/2 horizon and 4 dissapeared.","Disposition":"Unresolved","Object Shape":"Sphere","Region":"Connecticut"}