{"Source":"MUFON","Object Shape":"Circle, Disc, Fireball, Flash, Oval, Sphere, Star-like, Triangle","City":"Fitchburg","files":["/var/www/straped/mufon/html2text/41026.html.txt","/var/www/straped/mufon/org/41026.html"],"Summary":"We observed an object that traveled in a straight line west to east directly over our house.","Latitude":"43.009915","Disposition":"Unresolved","divs":["Sighting DetailsWe were sitting on our deck looking at stars and my daughter noticed a bright orange light approaching from the west traveling toward us eastward. I mentioned that it was probably a medical helicopter as we are directly in the flight path of UW Med flight. I started to take notice as it got closer to us, the object emitted a bright white searchlight flash and then turned orange in color. It continued to do this as it got closer. I assumed it was a helicopter and it would turn toward the hospital but it continued its path directly over our house at an altitude of 1000 ft I estimate. As it neared our house, the lights started to fade and the object became dimmer. As it flew directly over, I looked straight up at it and saw a solid odject with a haze surrounding the edges. I could not make out any outline other then my daughter thought it was circular in shape. It was not a helicopter. No sound was emitted. As it flew over the object started to disappear until it faded away a few seconds after crossing over our home. Clear sky, 75 degrees, many planes flying typical commercial flight paths. Afterward, we just tried to figure out what we saw."],"Object Flight Path":"Straight-line path","Case Number":"41026","Country":"United States","Date of the Event":"07/21/2012 10:20 UTC","Region":"Wisconsin","Viewing Distance":"101-500 Feet","Date Submitted":"07/22/2012 12:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.009915,+-89.417862(41026)&iwloc=A&hl=en\"> mufon case (41026) map </A>","Tags":"City","Weather Factors":"Unknown","Log Number":"US-07222012-0002","Longitude":"-89.417862","trends":["There have been 60 other sightings in Fitchburg","There were 60 other sightings in Fitchburg on or around July 21st 2012"],"Sighting Duration":"Undisclosed","Object Features":"None"}