{"Object Features":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsWas approaching Amboy Road in Asheville, NC at approximately 2030 hrs from I-240 East and noticed what looked like a constellation of bright lights towards the Asheville-Buncombe Technical College. There were at least 15 lights and upwards to 25 hanging in the air with only slight movement as we were driving towards them. As we approached the intersection of Lyman Street, Meadow Road and Amboy Road (one intersection) the lights had moved towards the south, towards us and since we were so close to them, they no longer looked like a constellation of stars, but separate, intense mercury vapor like spheres slowly floating away from the campus area. Some begin to immediately disappear down to about 4-6 lights and then some reappeared as we were moving towards the campus itself. When we reached the top of the road at the campus, we could look south and still see about 6 of them there towards the south. We stopped up the road and turned around and when we came back to the top of the campus, the lights were gone. We went the route we had travelled back down to Amboy, but did not see the lights any longer. My gut instinct is that these might have been very nice military level flares that were suspended from helium balloons or had been dropped by unobserved aircraft, but the lights were not dropping, they were moving from between 10 to 30 degrees above the flat horizon down on the road there. There were other witnesses, one was even taking pictures and said that he was \"a bit scared sh!tless\" while trying to do so, but I was not able to get his name since I had to continue on to my destination at that point. My son was with me as was my wife and daughter and he was able to get a picture of this with his cell phone. You can see about 9 lights in the picture, as well as the yellow and red stop light where the intersection was. The picture is of little value other than to show that something was there."],"Latitude":"35.566474","files":["/var/www/straped/mufon/html2text/41047.html.txt","/var/www/straped/mufon/more/41047_submitter_file1__0721122226.jpg","/var/www/straped/mufon/org/41047.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.566474,+-82.574904(41047)&iwloc=A&hl=en\"> mufon case (41047) map </A>","Region":"North Carolina","Country":"United States","Tags":"City","Log Number":"US-07222012-0062","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-82.574904","trends":["There have been 28 other sightings in Asheville","There was one other sighting in Asheville on or around July 21st 2012","This sighting has never been favorited.",""],"Source":"MUFON","Date Submitted":"07/22/2012 12:23 UTC","City":"Asheville","Sighting Duration":"Undisclosed","Case Number":"41047","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Summary":"15 -25 intense mercury vapor like lights over local college moving south","Object Shape":"Sphere","Disposition":"Unresolved","Date of the Event":"07/21/2012 10:30 UTC"}