{"Disposition":"Unresolved","Latitude":"37.361466","map":"<A HREF = \"http://maps.google.com/maps?q=37.361466,+-118.389723(41057)&iwloc=A&hl=en\"> mufon case (41057) map </A>","Country":"United States","Longitude":"-118.389723","Object Shape":"Sphere","Object Features":"Unknown","City":"Bishop","Object Flight Path":"Path with directional change","Case Number":"41057","Viewing Distance":"101-500 Feet","trends":["There have been 3 other sightings in Bishop","There was one other sighting in Bishop on or around May 21st 2012"],"Date Submitted":"07/22/2012 04:50 UTC","files":["/var/www/straped/mufon/html2text/41057.html.txt","/var/www/straped/mufon/org/41057.html"],"Sighting Duration":"00:02:30","Log Number":"US-07222012-0072","Date of the Event":"05/21/2012 09:40 UTC","Tags":"City","Region":"California","Summary":"Dark sphere with multiple bright red lights flew at about 15 mph no more than 200 feet above my car.","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsOn my way home from work on Monday, May 21, 2012 at about 9:40 PM, I was driving west on West Line Street just past Barlow lane, heading to my home which is north of Bishop. It is a fairly dense residential area. Suddenly, through the trees to the north, my attention was drawn to a very bright red light. It outshown every other light in view. Since it was low, no more than a hundred yards off the ground, I was confused by what I was seeing. At first, I thought it was a light on top of some radio tower, but there isn't any such tower in the area. Then, I could see it was slowly moving in my direction. I thought it was too low to be an aircraft, and I have never seen such a bright red light on an aircraft. I slowed my car, and watched intently as the light passed over the trees and into the clear sky above me. It passed slowly over the two-lane road on which I was driving, no more than two or three hundred feet in front of and above me. I would estimate it's speed as no more than ten to fifteen miles per hour. What had first appeared as a solid red light wasn't solid at all. It was a spherical object, made up of a geometric assembly of very bright red lights, each apparently identical and equally bright. The lights didn't blink on and off, and did not vary in intensity. I would estimate the size of the sphere as no more than ten or fifteen feet in diameter, about the size of a small car, and as it moved, it was quite clear that the lights were evenly spaced, geometrically all around the sphere. I counted five lights on one hemisphere. It looked like some kind of huge lighted Christmas ornament. And it was beautiful. I was amazed and completely awe-struck by what I was watching. I pulled the car to the side of the road, stopped and rolled down the window, which provided a clear and distinct view of the sphere, which was by now no more than 200 feet away. I was able to estimate its height and distance by comparing it to trees alongside the road. It was completely silent, seemingly floating in the air. It continued it's southward course, and as it passed by, the rear of the object came into view. I was struck by how evenly spaced the lights were all around the outside of the sphere. The red lights had an intense, radiant quality. They were very bright, and I could make out each individual light. It was like a ball of evenly-spaced red lights. My view to the south was completely clear, unobstructed by trees or buildings. I watched the sphere as it continued slowly south for perhaps a half-mile, clearly silhouetted against the dark night sky. The red lights remained on. Then, it accelerated abruptly, and moved up so quickly that it disappeared in the darkness. There was nothing left to see but the stars. The entire episode lasted about two minutes, perhaps less. I looked at the clock in my car when I first realized what I was seeing, and again after the object disappeared. I wasn't drinking, or under the influence of any substance. I have never seen anything like it. I am convinced that it wasn't any kind of aircraft; not an airplane, or a helicopter, or any kind of balloon. There was no wind, and absolutely no sound whatsoever."]}