{"Source":"MUFON","Disposition":"Unresolved","City":"Linn","Tags":"City","files":["/var/www/straped/mufon/html2text/41056.html.txt","/var/www/straped/mufon/org/41056.html"],"Longitude":"-91.053658","Country":"United States","Sighting Duration":"00:10:00","Region":"Missouri","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Straight-line path","trends":["There have been 6 other sightings in Linn","There were no other sightings in Linn on or around June 15th 1977"],"Date Submitted":"07/22/2012 04:34 UTC","Log Number":"US-07222012-0071","Date of the Event":"06/15/1977 12:00 UTC","Latitude":"38.56051","Summary":"Immense triangle white lights at apexes stars blocked out by black body","Case Number":"41056","divs":["Sighting DetailsI had just gotten my driver's permit in the summer of 1977 at the age of 15 and was with a friend in my vehicle at the ball park in Linn, Missouri watching a game end. We left the ball park to meet with another 2 people in another car at a local gathering spot atop a ridge overlooking town at a county highway department facility about a mile north of HWY 50 on the east side of HWY 100. Both cars pulled into different entrances of the circular road and parked facing each other. The night was perfectly devoid of clouds and from the elevated viewpoint the stars could be seen in brilliant definition. There was no wind and it was a very beautiful, still and quiet night. I laid on the hood of my car facing due north, my back against the windshield, gazing at the night sky. We really hadn't been there long at all. The other 3 were talking when I noticed a triangular object (or 3 unwavering white lights in a perfect triangular formation) heading directly toward us from the north. I watched it with growing interest as it slowly traversed a southerly direction in a perfectly straight line. It's speed and elevation never changed. It was if it were on auto pilot. As it got closer I realized how huge it was and that it was completely blocking the view of the stars inside the lights in a triangular pattern as it passed between us and them. That area had the same appearance of the night sky without the stars. My guess is that it was at 10,000 to 20,000 feet and it was at least 50 times the size of a commercial aircraft (maybe 100 or more times). I cannot stress enough the apparent immensity of the object even though it was relatively high in the sky. I pointed it out to my friends before it got halfway to us because as much as anything of it's large size. I went into my car and turned the music off to listen for it. We all watched it in dead silence, dumbfounded. We were all commenting on it and the fact that we couldn't hear anything. It continued on a straight line south bound path directly overhead and we strained to hear any sign of sound from an engine. To make some kind of sense of it. There was absolutely no sound at all. The percentage of the sky that was obscured when it was directly overhead was astonishing. We simply stood and watched in complete awe as it slowly disappeared southward over the horizon. I'm guessing it took a full 10 to 15 minutes for it to traverse the sky from horizon to horizon. It was a steady, slower moving object. Although this event may not sound all that spectacular, the impression it left on me as a teenage has been indelible and absolutely unforgettable."],"Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=38.56051,+-91.053658(41056)&iwloc=A&hl=en\"> mufon case (41056) map </A>","Weather Factors":"Unknown","Object Features":"Unknown"}