{"Latitude":"41.085054","Viewing Distance":"Unknown","Case Number":"41051","Country":"United States","Date of the Event":"07/21/2012 10:00 UTC","City":"New London","Longitude":"-82.399889","trends":["There have been no other sightings in New London","This sighting has never been favorited."],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"US-07222012-0066","divs":["Sighting DetailsMy sister and I were driving home at 10pm and as I neared my home, I noticed a strange formation in the Western part of the sky. It seemed to appear out of nowhere. It consisted of four pulsating reddish lights. Three of which were in a triangular shape, like a boomerang. The fourth light was to the upper left of the triangular shape. The lights seemed to change color slightly, ranging from red to an orange-red. They seemed to glitter like stars at times, but I'd definitely describe them as pulsating. We pulled into our driveway and went out to the road to see if we could still see them. They were still there. My sister suggested that perhaps they were fireworks, but they were barely moving. They seemed to be kind of drifting very slowly, but that may have just been an effect from the pulsation. I went back into the yard, behind some trees, to look for my dog. After I found her, I went back into the road and the lights were gone. My sister also had taken her eyes off of the lights. When we tried to look at them again, they were completely gone. They were probably in the sky for a good five minutes. I instantly felt fear when I saw the lights. I felt the urge to continually ask \"what is that?\" I felt very anxious."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.085054,+-82.399889(41051)&iwloc=A&hl=en\"> mufon case (41051) map </A>","Summary":"Four pulsating reddish lights seen in a formation at 10pm","Tags":"City","Date Submitted":"07/22/2012 01:40 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41051.html.txt","/var/www/straped/mufon/org/41051.html"],"Source":"MUFON","Object Shape":"Boomerang","Region":"Ohio"}