{"files":["/var/www/straped/mufon/html2text/41069.html.txt","/var/www/straped/mufon/org/41069.html"],"Case Number":"41069","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.721281,+-81.471365(41069)&iwloc=A&hl=en\"> mufon case (41069) map </A>","Source":"MUFON","divs":["Sighting DetailsI was at my in-laws house swimming when my wife's aunt called and said she had just stepped outside to have a cigarette when she spotted what appeared to be a group of helicopter search lights in the sky. She watched them for a few minutes and noticed that they had a very unusual fight path. She then asked if I could see them. I went into the front yard and quickly spotted the lights for myself. They did not appear to be helicopters with search light on to me at all as there was no beams of light being cast and absolutely no sound. They were just balls of bright light. At first they were clearly spread out four separate and distinct balls of light. Then in just a few short minutes three of them converged into the one central light and quickly separated again. the three that separated from the one then began to circle and orbit the central light in an almost dancing fashion. This happened several times over and over again for more than an hour. My wife's aunt made her husband come out to see these lights and he was beyond dumbfounded. They also called his brother who lives several miles away in Tuslaw, just to see if he could also spot these lights. To our surprise he could also see them and confirmed what we were viewing."],"trends":["There have been no other sightings in Navarre","This sighting has never been favorited."],"Disposition":"Unresolved","Country":"United States","Object Flight Path":"Undisclosed","Sighting Duration":"01:15:00","Latitude":"40.721281","Region":"Ohio","Tags":"City","Object Shape":"Circle, Star-like","Weather Factors":"Unknown","City":"Navarre","Summary":"We thought they were search lights at first.","Longitude":"-81.471365","Date of the Event":"07/22/2012 12:00 UTC","Log Number":"US-07222012-0032","Date Submitted":"07/22/2012 05:11 UTC","Viewing Distance":"Unknown"}