{"files":["/var/www/straped/mufon/html2text/41070.html.txt","/var/www/straped/mufon/org/41070.html"],"divs":["Sighting Details We were riding home at appox. 10;20 P.M. We came out from the underpass and noticed several bright orange lights in the sky almost straight above us we turned east and race to get in front of the objects.At first we thought they were helicopters from Beale A.F.B.But they were orange and silent. By the time we got off the motorcycle and got the camera out they were moving apart and turning south toward downtown Roseville.As soon as I started taking pictures they turned dark at different times and kept going south.After the had all gone from site there was one object following on the same path the rest took, but much lower{just above the tree tops} Just before the object went behind some trees it turned dark and then we lost site of it.My picture turn out badly but I did get several large bright orbs that seemed to be in the same flight path with the darkening orange lights.This my or my not have anything to do with the objects.I slept for 14 hours straight and woke up with swollen joints a pressure head ache and weak and thirsty. Sort of feels like a hangover but I only had one beer all day."],"Source":"MUFON","Object Flight Path":"Path with directional change","Date of the Event":"07/21/2012 10:20 UTC","Country":"United States","Sighting Duration":"00:04:00","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around July 21st 2012"],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"38.749539","Log Number":"US-07222012-0033","Tags":"City","Date Submitted":"07/22/2012 05:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.749539,+-121.324076(41070)&iwloc=A&hl=en\"> mufon case (41070) map </A>","City":"Roseville","Summary":"several orange objects in a tight formation moving straight toward us from the west then spead apart turned spreading apart","Object Shape":"Sphere","Weather Factors":"Unknown","Object Features":"Undisclosed","Disposition":"Unresolved","Case Number":"41070","Longitude":"-121.324076","Region":"California"}