{"Date Submitted":"07/22/2012 10:56 UTC","Latitude":"31.975719","Object Features":"None","Disposition":"Unresolved","Summary":"Floating object that changed direction, floating down street. Black in color with rippling lights.","City":"Undisclosed","divs":["Sighting DetailsI was standing outside late this evening, approximately midnight and I was smoking. I was facing NW looking out at the Big Dipper. As I was smoking I saw a faint rippling light that caught my eye, almost reflective but the shape of the light was curved , almost like the edge of an object. I had to refocus my eyes because I was not sure I had seen anything, but as I looked I could see an object moving in the sky, just out in the street in front of my house. At first I thought it might be a bat, but the way it moved, just floating made me think that it was not organic. The object was the same color as the night sky. Then it changed direction and floated down the street to the NE. I walked out to the street and continued to watch it float down the street. It never moved up or down or seemed to change speed. I was still not sure I had seen anything until I saw its silhouette with the city lights in the back ground. I watched it as it floated out of sight. It was round-ish in shape, being a little more pointed at the end. I was solid and not see through. At this point I could not deny that I had seen something. The hair on the back of my neck stood up and I thought I must be crazy. I am still not sure what it was I saw. My guess would be that it was a probe of some sort, based on its size and continues floating, and the strange way it followed the street. I witnessed this all on the far west side of El Paso."],"Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/41076.html.txt","/var/www/straped/mufon/org/41076.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.975719,+-99.896373(41076)&iwloc=A&hl=en\"> mufon case (41076) map </A>","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Log Number":"US-07222012-0029","trends":[],"Region":"Texas","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Object Shape":"Circle, Teardrop","Longitude":"-99.896373","Date of the Event":"07/20/2012 12:00 UTC","Case Number":"41076"}