{"Country":"United States","Weather Factors":"Unknown","Log Number":"US-07222012-0032","Longitude":"-99.900193","Date Submitted":"07/22/2012 11:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.977889,+-99.900193(41079)&iwloc=A&hl=en\"> mufon case (41079) map </A>","files":["/var/www/straped/mufon/html2text/41079.html.txt","/var/www/straped/mufon/org/41079.html"],"Region":"Texas","Object Shape":"Circle","City":"Undisclosed","Latitude":"31.977889","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","Disposition":"Unresolved","divs":["Sighting DetailsLate this evening, approximately around 12:45 am, I went outside for a smoke. I looked out at the sky at approximately 298 degrees NW I saw a green light with a flashing red light. At first I thought it was a plane so I paid no attention to it. The sky was partly cloudy with patches of stars through the cloud cover. I finished up my smoke and looked back out at the lights and noticed that they had not seemed to move. So now I paid attention to them. For about ten minutes I watched the lights. They did not move up or down or grow faint or brighter. I went inside and grabbed my phone and binoculars(15X70), I use them for stargazing. I used sky google to see if there was a planet or star in that location. There was no planets in the area and no stars of that magnitude. Then I set out to observe the lights with my binoculars. Through my binoculars I could define no shape of the object, all that I was able to see was a green light and white light with what seemed to me a random flashing red light. Still the lights have not moved and continue to flash. Through the binoculars I could see a faint star and this is what I used as a reference to the lights. For approximately 35 minutes I watched the light through the binoculars, not once noticing that it moved. Then the lights began to pulse,slowly, for approximately fifteen minutes. Then the lights went back to their previous routine. After about ten minutes the lights disappeared. I watched the night sky for another twenty minutes and nothing appeared."],"Viewing Distance":"Unknown","Case Number":"41079","Date of the Event":"07/21/2012 01:59 UTC","Summary":"Green light, White light, red flashing light that hovered 298 degrees NW of El Paso.","trends":[]}