{"trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around July 21st 2012"],"Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-90.511764","files":["/var/www/straped/mufon/html2text/41088.html.txt","/var/www/straped/mufon/org/41088.html"],"Object Flight Path":"Stationary,Straight-line path","City":"St Charles","Log Number":"US-07232012-0009","Object Shape":"Star-like","Source":"MUFON","Country":"United States","Disposition":"Unresolved","Case Number":"41088","divs":["sighting detailsit was a little before midnight, i was alone on my sister's back patio smoking a cigarette and looking up at the stars. i noticed what appeared to be a star traveling across the sky at a steady pace (seen this before but always thought it was satelites orbitting the earth). as the \"traveling star\\satelite\" made its way closer to a \"brighter star\" (at arm's length, measuring with my fingers, approximately an inch away). the \"brighter star\" casted a light towards the \"traveling star\". at first, the light looked spread out but quickly narrowed to more of a beam. like it \"focused\" onto the traveling star\\satelite. the \"focus\" took less than a second, almost instantly but slow enough to see it happen. the light being casted lasted for about 3-5 seconds then the light went out and less than a second later, the \"bright star\" dissapeard as the traveling star\\satelite kept traveling through the sky. the entire experience was only a matter of seconds and i know the \"bright star\" was not an airplane as there were no other lights(green\\red flashing). before it casted its light, it just looked like a star."],"Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.788698,+-90.511764(41088)&iwloc=A&hl=en\"> mufon case (41088) map </A>","Latitude":"38.788698","Summary":"what i thought was a star and a possible satelite now has me wondering","Viewing Distance":"Over 1 Mile, Unknown","Region":"Missouri","Date of the Event":"07/21/2012 11:45 UTC","Date Submitted":"07/23/2012 05:08 UTC"}