{"files":["/var/www/straped/mufon/html2text/41081.html.txt","/var/www/straped/mufon/org/41081.html"],"Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.352481,+-82.792641(41081)&iwloc=A&hl=en\"> mufon case (41081) map </A>","Object Shape":"Disc","Sighting Duration":"Undisclosed","Summary":"My friend, our brothers and I were swimming when we looked over and noticed a large object hoovering above my grandmas house","trends":["There have been 2 other sightings in Marengo","There were no other sightings in Marengo on or around July 17th 2001"],"Object Features":"Dome, Window(s)","Object Flight Path":"Hovering then path,Path then hovering","Case Number":"41081","Region":"Ohio","Longitude":"-82.792641","Date of the Event":"07/17/2001 12:00 UTC","Source":"MUFON","Latitude":"40.352481","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Log Number":"US-07232012-0002","Country":"United States","divs":["Sighting DetailsI'm not for sure exactly what date this was or if it was 2000 or 2001. I was 13 or 14 at the time and my friend, our 2 younger brothers and I were swimming in our back yard. I lived in a house directly across from my grandmothers. We were just playing around when my brother got our attention and thought he saw a ufo way off in the distance, we told him it was probably a plane and went back to swimming about 5-10 minutes later he got our attention again and had this terrified look on his face and all he said was \"guys look\". We looked over above my grandmother's house to see this huge thing just hoovering in the sky very very low. It made no noise at all and for being that big of an object and as low as it was you would think you would here something, but it was totally silent. It was bigger than my grandmother's house and probably 6 - 10 ft above her TV anttena. It looked round in the front and like it had windows all around the front, you could see something like shadows in the windows, but I can't be sure that it was not just how it looked. I'm not exactly sure if it was completely round to the back because it was dark and the only place we could see lights was the part that was facing towards us. We honestly only looked at it for about 3-4 minutes in shock and jumped out of the pool and ran inside to get my mom. Our pool was located right off our back porch and my mom's room was right in the back door. By the time we came back out to show my mom, which was probably only 2 minutes, It was clear across the sky on the other side from where we first saw it."],"City":"Marengo","Date Submitted":"07/23/2012 12:33 UTC"}