{"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41095.html.txt","/var/www/straped/mufon/org/41095.html"],"Sighting Duration":"Undisclosed","Log Number":"US-07232012-0016","Region":"Illinois","City":"Willow Springs","Disposition":"Unresolved","trends":["There has been one other sighting in Willow Springs","There were no other sightings in Willow Springs on or around July 22nd 2012"],"Object Features":"Unknown","Latitude":"41.718259","Tags":"City","Longitude":"-87.909303","divs":["Sighting DetailsIt was about 4:30 am, and I was sitting on my back porch with two friends (Tracey and Matt) talking about shooting stars we had seen in the area and watching the skies. Remarkably, in the middle of our conversation Tracey said she noticed something moving slowly, but she lost sight of it behind the trees. We didn't think much of it at first, but about 5 minutes later she said \"There it is!\" It was a bright white light, resembling a star or a planet. The light was constant, like a bulb, and did not flicker or pulsate. At first it was Hovering, and moving back and forth slightly. And then it began to move across the sky, but stopping to hover several times and changing direction. We watched it sort of wander through the sky, generally moving northeast, but not in a straight line, and it definitely paused a few times. It also appeared to be making small erratic movements side to side. It moved from our location toward Chicago (about 15miles from us) and disappeared behind the treeline. The sighting lasted roughly 2.5 minutes. The trees were close to us, and we lost track of it still about 45 degrees off the horizon, and still heading northeast. We all talked clearly about the details of the sighting and all three of us agreed to this account."],"Date Submitted":"07/23/2012 09:40 UTC","Summary":"Observed by 3 people from backyard. A bright white light resembling a star or planet hovered and moved across the sky.","Case Number":"41095","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"07/22/2012 04:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.718259,+-87.909303(41095)&iwloc=A&hl=en\"> mufon case (41095) map </A>","Country":"United States","Object Shape":"Sphere"}