{"Source":"MUFON","Sighting Duration":"00:05:00","Object Features":"None","City":"Chelsea","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Log Number":"US-07232012-0018","Case Number":"41097","Date Submitted":"07/23/2012 10:09 UTC","Object Shape":"Fireball, Sphere","Summary":"Saw a fireball coming nw across sky, red in color, turned to sw, and flew away.","trends":["There have been 7 other sightings in Chelsea","There were no other sightings in Chelsea on or around July 20th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.330302,+-84.131333(41097)&iwloc=A&hl=en\"> mufon case (41097) map </A>","Weather Factors":"Unknown","divs":["sighting detailson friday night, 07\\20\\2012, we were camping at sugar loaf lake, in the waterloo recreation area, 8200 loveland, chelsea mailing address, 48118. this camp ground is approximately 5 miles west of the town of chelsea. it was a cloudless night, and the sky was clear. while sitting by the camp fire at 11:20 pm we observed an object that looked like a red fireball crossing the sky, traveling from nw to se. it was red in color with no distinct edge to it. it appeared to look like a fireball, but it was traveling slowly, 25 to 30 degrees off the horizon in se direction. we attempted to take a picture with the cellphone, but it would not work. there was no noise, and it appeared to be within a mile or two from us. it was about the size of an eraser on a lead pencil in the sky. it's lights changed from bright red to red mixed with orange, and at one point a little bit of white light as it changed directions. it quickly changed directions from nw to se directly south of us, and headed away nne to ssw. it did not appear to be an airplane in that there was no defined edge to it's shape, no flashing lights, no noise, and no contrail. it started to travel away from us headed ssw, and seemed to pick up speed as it headed away from us. we watched it until it disappeared into space, still low on the horizon, 25 to 30 degrees. the entire incident took approximately 5 to 6 minutes. we were curious in trying to figure out what the object was, knowing it was very unusual."],"Object Flight Path":"Path with directional change","Latitude":"42.330302","Disposition":"Unresolved","Tags":"City","Region":"Michigan","Date of the Event":"07/20/2012 11:20 UTC","Longitude":"-84.131333","Country":"United States","files":["/var/www/straped/mufon/html2text/41097.html.txt","/var/www/straped/mufon/org/41097.html"]}