{"Date of the Event":"07/23/2012 08:20 UTC","Object Shape":"Other","Sighting Duration":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41109.html.txt","/var/www/straped/mufon/mufon_json/41109.json","/var/www/straped/mufon/org/41109.html"],"Region":"California","Date Submitted":"07/24/2012 12:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.441977,+-117.642202(41109)&iwloc=A&hl=en\"> mufon case (41109) map </A>","trends":["There have been 3 other sightings in Pinon Hills","There were no other sightings in Pinon Hills on or around July 23rd 2012"],"Log Number":"US-07242012-0002","Object Features":"None","Tags":"City","Latitude":"34.441977","Country":"United States","Case Number":"41109","divs":["Sighting DetailsMy brother was on the phone with a girl living in Oregon and I was putting silicone on my shed preparing it for painting. My brother was watching something above the horizon and was discusing what he was seeing to his friend. She asked him where I was and that was when my brother Rod called to me and said \"Hey Craig, WTF is that?? I said What because I didnt see what he was seeing. Then he walked around the fence and pointed towards the setting moon and said there. WTF is that. I looked and it seemed to me that it was a cloud that was disapating as they do after sun down. But he said no look, its mooving. There was a dark mass that was moving South (against the wind) and that then turned into two dark masses with lots and lots of other little dark objects all around the bigger dark masses . After telling my brother that I had better eye sight than he does, I went to get some binoculars so I could tell him definitly that what we were seeing were birds. Through the binoculars I still couldnt recognize what I was looking at. First there were probably 1000's then they seemed to merge into about 50 or so then they seemed to disolve. I estimate they were about 4000 feet above the ground. If they were birds, what are they doing migrating at this time of year??? Or flying so high at that time of night??? Not sure what they were not much else to say Interested to see if anybody got a better look..."],"City":"Pinon Hills","Summary":"First thought they were birds. Binoculars showed black things....","Object Flight Path":"Other","Longitude":"-117.642202","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Over One Mile"}