{"Date Submitted":"07/23/2012 03:42 UTC","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Straight-line path","Source":"MUFON","Weather Factors":"Unknown","City":"Myrtle Beach","map":"<A HREF = \"http://maps.google.com/maps?q=33.758084,+-78.796533(41102)&iwloc=A&hl=en\"> mufon case (41102) map </A>","Region":"South Carolina","Latitude":"33.758084","Case Number":"41102","Summary":"Orange Spinning Fireball over the Atlantic Ocean at 2 AM Myrtle Beach SC","Disposition":"Unresolved","Date of the Event":"07/17/2012 12:00 UTC","divs":["Sighting DetailsMy sister-in-law and I, were sitting, on a 10 floor balcony, at a resort hotel, in south Myrtle Beach, on July 17, 2012, at 2 AM in the morning, when we saw a large orange fireball looking object, coming from a southwest direction, down the coastline, right in front of us. It was low enough for us to see that the object was spinning in different directions as it traveled in a straight line down the beach. There was no sound or noise. We couldn't believe what we were seeing and yelled for my daughter, who was inside, to come out and look. By the time she got out there it had traveled down the beach and had disappeared. We witnessed it for a total of about 2-3 mins. We stayed outside for a while, to see if it would return but didnt see it again that night. On July 20, 2012, on the same balcony, around 1AM, My sister-in-law and I were sitting there again, when we saw two of the same color objects. They were further out over the ocean and much higher up than the one before. They would appear for a few seconds and then disappear. This happened about 3 times that night. These were not a ship, as they were too high up and were not an airplane, as we did see an airplane and the lights were white and red and completely different than the orange fireballs. I am 56 years old and can remember seeing a similar orange object, on the side of a mountain in WV about 40 years ago. Members of my family and I watched it most of the night, until it just disappeared around 5AM. It was fairly close to us as we lived across the road from the mountainside. I also had a strange experience when I was 16 years old and learned 30 yrs. later that it could have been an abduction. I had never thought about that being the case, until I saw a TV show that described abductions 30 yrs after my experience."],"Longitude":"-78.796533","trends":["There have been 52 other sightings in Myrtle Beach","There was one other sighting in Myrtle Beach on or around July 17th 2012"],"files":["/var/www/straped/mufon/html2text/41102.html.txt","/var/www/straped/mufon/org/41102.html"],"Object Features":"None","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-07232012-0023","Object Shape":"Fireball"}