{"Region":"Oregon","Object Flight Path":"Straight-line path,Path with directional change","trends":["There have been 2 other sightings in Aloha","There were no other sightings in Aloha on or around July 21st 2012"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07242012-0011","Country":"United States","files":["/var/www/straped/mufon/html2text/41118.html.txt","/var/www/straped/mufon/mufon_json/41118.json","/var/www/straped/mufon/org/41118.html"],"Source":"MUFON","Date of the Event":"07/21/2012 12:20 UTC","divs":["Sighting DetailsI was in the passenger seat in a car with my friend, driving west on Hwy 26 heading towards Helvetia, pointing out airplanes & cloud shapes with my boy & my friend's son (who were both in the back seat). I then saw this large, slow moving cyclindrical object quite clearly in the near distance. It seemed large because it was moving so slowly, though it was hard to judge precisely how big or fast it was, since there was nothing near it to give a scale of reference. It was flying east, so I saw it on its front and left side, like I would see any oncoming traffic. It had no wings or propellors and left no jet trail. At first I thought it was a plane, but it had no wings and was the wrong shape. As we kept driving, it slowly turned to its right and headed south, so I could see what was apparently the back end of it, all while I watched it, looking for an engine of some kind. I then though it could possibly be a weather balloon, even though it was the color of rusted copper and looked too solid to be a balloon. Soon after the object had turned south fully, it very slowly seemed to disappear while I watched it. The whole sighting last maybe a minute, and I talked about it with my friend who was driving while it happened. I didn't want to tell the 5-year-olds in the back, because I was afraid that it would scare them. I was a little excited and nervous about seeing it but not afraid to talk about it with anyone. I lost sight of the object by its apparent vanishing in front of my own eyes. I was too awestruck to pull out my iPhone camera and didn't want to lose site of it for one second, for fear it was be gone if I averted my eyes even for an instant."],"Latitude":"45.497914","Case Number":"41118","Object Shape":"Cigar, Cylinder","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.497914,+-122.862465(41118)&iwloc=A&hl=en\"> mufon case (41118) map </A>","Tags":"City","Date Submitted":"07/24/2012 07:23 UTC","Summary":"Large rust-colored metallic object flew straight, turned 45 degrees then slowly vanished","Sighting Duration":"Undisclosed","City":"Aloha","Disposition":"Unresolved","Longitude":"-122.862465","Object Features":"Unknown"}