{"Source":"MUFON","Country":"United States","Date of the Event":"07/23/2012 08:10 UTC","Longitude":"-110.998285","Tags":"City","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around July 23rd 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.27725,+-110.998285(41113)&iwloc=A&hl=en\"> mufon case (41113) map </A>","Date Submitted":"07/24/2012 07:13 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was sitting at my computer desk at home at about 8pm or so in the evening when I happened to glance out of the window over my desk and I saw a triangle craft with a bright white lights at each corner and a red light in the center of the craft, all on the underside. It was flying from east to west just over my backyard and made no sound at all the I could hear and I had my window wide open so I should have heard something. I see and hear planes flying over my house all day long because we are on the flight path for all of the planes coming in to Davis Monthan AFB and I enjoy watching the different type of planes coming in for a landing. This was totally different because the craft was like it was 'gliding' perfectly smooth and silent and the lights were perfectly spaced at the 3 corners of the triangle with the red light in the center. No green lights or flashing strobes whatsoever were seen and they should have been prominent because this craft was so clearly visible to me and when I watch planes flying at night I automatically look for the required FAA lights and this is the first craft I have seen at night without those required lights. Also I am an avid UFO researcher and have had my fair share of actual UFO sightings in my life as well as reading and educating myself on what to look for to determine if a sighting appears to be genuine or not and this triangle stood out as unique to me. First of all we had major thunderstorms in the area all afternoon and evening and so there were no other planes flying in this area because of the severe wind-shear and downdraft effects being present, and because of the flight path of the triangle being totally out of the normal direction of air traffic for this zone being strictly north-south and the triangle was going from east to west. Also the craft SLOWED to less than a stall speed and seemed to hover very briefly (about 3-4 seconds) and then speed back up and make a severe turn to the north in waaaay too short of an amount of time for a craft of that size (747 or larger from my perspective)to be able to execute. All of this took place in a very short space of about 15-20 seconds before it flew out of my view over the house and by the time I was able to pull myself together and get outside the craft was GONE. That right there combined with the super sharp turn and no sound just spelled UFO to me. I intend to contact the civil aviation authorities in the morning to see if any craft were in my area last night to confirm my sighting. UFO's are very real and always exciting to witness in person and this one is no different for me in that regard. I appreciate MUFON for giving us a platform for reporting our sightings."],"files":["/var/www/straped/mufon/html2text/41113.html.txt","/var/www/straped/mufon/mufon_json/41113.json","/var/www/straped/mufon/org/41113.html"],"City":"Tucson","Log Number":"US-07242012-0006","Summary":"Triangle craft flew over the house","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Object Features":"Unknown","Latitude":"32.27725","Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Arizona","Case Number":"41113"}