{"Tags":"City","Viewing Distance":"Over One Mile","Longitude":"-104.870743","files":["/var/www/straped/mufon/html2text/41124.html.txt","/var/www/straped/mufon/mufon_json/41124.json","/var/www/straped/mufon/org/41124.html"],"Summary":"Black ball appeared to take off south of Centennial airport going south, changed direction east","Date Submitted":"07/24/2012 10:18 UTC","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-07242012-0017","Object Flight Path":"Path with directional change","trends":["There have been 16 other sightings in Centennial","There were no other sightings in Centennial on or around July 24th 2012"],"Disposition":"Unresolved","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"07/24/2012 09:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.590515,+-104.870743(41124)&iwloc=A&hl=en\"> mufon case (41124) map </A>","Region":"Colorado","divs":["Sighting DetailsI walked outside of work, which is just a few blocks to the northeast of Centennial Airport (off of Arapahoe Rd. in the Tech Center), to have a cigarette this morning, looked up to watch a Lear take off, and saw what I originally thought was a weather balloon being launched from the airport. After a moment, though, I noticed that instead of climbing at a fairly constant rate of speed (I launched weather balloons in college for my meteorology class), it seemed to level out at about 30deg. above the horizon south of the airport, then change direction from south to east and descended to about 20deg. above the horizon. It continued to seem to drift slowly on a stable flight path to the East, and if I were to guess, it was right around County Line Road or a little past there. It seemed black, but I noticed that the sun was reflecting off of it occasionally as it moved. It couldn't have been doing more than about 60 knots the entire time I observed it, but there was no contrail or characteristic wing wobble as it it were an aircraft, and no main or stabilizing rotors like a helicopter. Plus, there was absolutely no sound or jetflare. I watched it for about 3-4 minutes before it disappeared from view behind my building. I don't know if I actually saw something unidentifiable or not, but the more I've thought about it today, the more I think that it didn't match any known aircraft I can place. I do know that there are a few military contract agencies that make drone aircraft out that way, but it didn't match any of the current drones in the U.S. arsenal, either. The more I watched it, the more I thought that this was something unique. So, I Googled you up and thought I would report it."],"Country":"United States","Latitude":"39.590515","Case Number":"41124","City":"Centennial","Object Shape":"Circle"}