{"Source":"MUFON","Date of the Event":"04/20/1998 12:00 UTC","Longitude":"-121.080747","trends":["There have been no other sightings in Cambria","This sighting has never been favorited."],"Summary":"Visitation by aliens and spaceship; possible implant","Object Flight Path":"Undisclosed","Case Number":"41128","map":"<A HREF = \"http://maps.google.com/maps?q=35.564138,+-121.080747(41128)&iwloc=A&hl=en\"> mufon case (41128) map </A>","divs":["Sighting DetailsThis is the 2nd time I tried to fill this out and it disappeared, so I will try again. My experience occurred around 14 years ago and I just can't forget it so I thought it would be helpful to describe it. Around 2 in the morning I was awakened from sleep and there was a large brightly lit disc object anchored over my bedroom. There was hieroglyphic like writing on all sides of the disc. I felt paralyzed and was surrounded by alien beings who were doing some sort of operation on me and inserted some sort of object in the area of my right ovary. it was painful but I wasn't particularly scared. I woke up the next morning, wrote down the experience and told myself this must have been a lucid dream. I have studied dreams for years and this truly felt different;I am not convinced this was a dream. A few months later I was having pain in my abdomen and the colonoscopy detailed the lack of continual vascular markings in the same area where i felt something was placed. I never went further with this but have always wondered what happened to me that night. Before I moved to this location in Cambria I had also experienced some telepathic contact with some sort of intelligence. I am less comfortable talking about this but feel it could be related. I hope this will all be confidential and for your scholarly purposes. Thank you."],"Weather Factors":"Unknown","Object Shape":"Disc","Log Number":"US-07252012-0001","Latitude":"35.564138","Disposition":"Unresolved","Tags":"City","Date Submitted":"07/25/2012 12:36 UTC","Object Features":"Patterned Surface","Region":"California","Country":"United States","files":["/var/www/straped/mufon/html2text/41128.html.txt","/var/www/straped/mufon/mufon_json/41128.json","/var/www/straped/mufon/org/41128.html"],"Sighting Duration":"Undisclosed","City":"Cambria","Viewing Distance":"Unknown"}