{"Object Flight Path":"Stationary,Unknown","Latitude":"40.268194","City":"Undisclosed","Object Shape":"Square, Rectagular","Viewing Distance":"501 Feet - 1 Mile, Unknown","Tags":"City","Summary":"Strange events occurred while inside home followed by sighting of stationary glowing object outside of home that seemed somehow connected to the event.","Region":"Indiana","Log Number":"US-07252012-0009","map":"<A HREF = \"http://maps.google.com/maps?q=40.268194,+-86.132702(41136)&iwloc=A&hl=en\"> mufon case (41136) map </A>","Object Features":"Other, Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy dog was uncharacteristically sick immediately prior to the event, and had repeatedly released diarrhea upon the living room floor. The dog's sickness may have been connected to the event. After repeatedly cleaning up such messes I decided to shower, and then proceeded to read some articles online and participate in the comments thereto before bed. As I was in the process of typing a comment I suddenly and uncharacteristically blacked out. Upon my next thought I noticed that I was blacked out and was perplexed as to why, and willed myself to come-to. I observed what I had been typing, collected my thoughts, and returned to making my comment to the article. I then blacked out again. This process repeated for a total of five black out events. Moments after rousing from the fifth it appeared as though the artificial lighting within my home increased in brightness, and I could see waves of heat rippling across my vision. I then felt as though my skin was burning. I went and turned the lights off and the effect ceased. (I would later remember that a similar event had occurred sometime in late 2011 with the indoor lighting seemingly becoming brighter and feeling as though they were burning my skin.) After many seconds standing in darkness I turned on a different set of lights and returned to my seat. I was shaken, but in an attempt to return to normalcy I allowed the feeling to quickly pass and returned to what I had been doing. Moments later the lights around me again appeared to increase in brightness, I again saw waves of heat ripple across my vision, and I again felt as though my skin was burning. I also felt a sensation like there was some sort of beam coming down from above and passing through me. I again went and turned the lights off, and now I was greatly shaken and perplexed by what was occurring. I paced around the house with my mind racing as I pondered the implications of what was occurring and its possible causes. I considered the possibility that an electrical malfunction was occurring in my apartment, and was concerned because it was late at night on a weekend so it would be difficult to find a resolution to such a problem if that was, in fact, the cause. I decided to go outside in the bitter cold for some fresh air and to collect my thoughts. The dog was also reacting excitedly in response to my anxiety and I felt it was best to take the dog out in case it was still sick or otherwise needed to relieve itself, as there was a greater risk of it doing so inside in response to my anxiety. As we stepped outside the lights that illuminate the apartment building's hallway also felt like they were bothering me, and I noticed that there was a relatively loud and energetic sound all around for how late it was at night. There are also security lights surrounding the complex so it was difficult to find a relatively dark spot in which to stand, but I attempted to do so. As I stood in the best refuge from light that I could find I looked around and then casually glanced up and observed that the sky was choked with what appeared to be a thick cloud cover, illuminated a uniform orange from the light pollution, and almost directly above me was a bright glowing blue-white rectangle that remained stationary. I quickly processed what I was seeing and quickly looked away, almost afraid to acknowledge what I had seen. I then walked to the front of the building and looked up again, observing the same thing as before. I then heard a brief electronic chirp off in the distance and at the same time red lights appeared within the bright glowing blue-white rectangle near each of its corners. These were illuminated only briefly and were not seen again thereafter, but as it occurred it seemed to make apparent a rectangle within the overall rectangle such as in the case of an emerald-cut stone. I looked away again. I returned to the rear of the building and started walking the dog around in the grass to give it an opportunity to relieve itself, occasionally verifying in my peripheral vision that the \"object\" remained above. As I was doing so, I began to notice that if I stood still or walked in a predictable pattern I would begin to feel or continue to feel very nauseous, but if I moved in an unpredictable way (such as unexpected sidesteps, zigzags, or walking backwards) the nausea would immediately subside while I continued to do so. This experimentation with the nature of the phenomena continued for several minutes and then I decided to return inside. I remained inside in the dark, and put on protective clothing and a hood to shield myself from the light. After some time passed I returned outside and observed that the \"object\" remained. Although it was the middle of the night I considered leaving to a public place or to visit nearby relatives in order to attempt to observe the \"object\" from a different vantage point, to see if it would pursue me, or just in an attempt to flee from it, but my anxiety appeared to be making the dog too afraid to even enter the vehicle and I had to abort such plans. I returned inside again, and after awhile went out and looked again. The \"object\" was no longer overhead, as it now appeared more toward the WNW, and the intensity of its glow was greatly faded. The cloud cover was also beginning to break up. I returned inside again and after a few minutes went out and looked and the \"object\" was gone along with most or all of the cloud cover. The portion of the sky where it was last seen appeared somehow distorted compared to other portions of the sky, and I could make out what appeared to be a string of three faint dots of light in that location in a configuration that resembled Orion's Belt, but I did not see the remainder of the constellation and do not believe from how faint the points of light were that I was actually looking at the stars that make up Orion's Belt. Notes: This event may have included some sort of \"lost time\" as it lasted approximately four hours but did not seem to contain four hours' worth of actions and experiences. For some time after the event I wondered whether or not the object I observed was the thin crescent of the moon illuminating the clouds and its appearance along with everything else was mere coincidence surrounding a different phenomena, even though it seemed too bright to be the moon (particularly through cloud cover) and inconsistent with the manner in which the \"object\" faded out and the lack of a visible moon somewhere in that general part of the sky after the cloud cover dissipated. The included Moon Positioning Data would appear to support the conclusion that the moon was not a contributor to the event."],"Disposition":"Unresolved","Longitude":"-86.132702","Source":"MUFON","Case Number":"41136","files":["/var/www/straped/mufon/html2text/41136.html.txt","/var/www/straped/mufon/mufon_json/41136.json","/var/www/straped/mufon/org/41136.html"],"Date Submitted":"07/25/2012 04:16 UTC","Weather Factors":"Unknown","Date of the Event":"02/19/2012 12:00 UTC","Country":"United States","trends":[]}