{"Source":"MUFON","Log Number":"US-07252012-0012","Date of the Event":"07/23/2012 12:00 UTC","Region":"Idaho","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Latitude":"43.49758","divs":["Sighting DetailsI was standing outside of my house on the front porch looking at the stars while talking with my mother-in-law. She said, \"look at that\" and when I looked up I saw a large oval shaped light, and it flew extremely fast right over the top of our neighborhood from north to south. It was not man made, the speed it was traveling was outrageously fast, and made NO sound at all. It couldn't have been more than 500 ft above us, unless it was so large that it looked low to the ground, but I am pretty sure it was lower to the ground judging from where it was in the sky in relation to the stars in the sky. At first I tried to rationally explain away what we had both just saw, but there is no explanation for it. With my background as a Marine Crash Fire Rescue Specialist it was required of us to know everything about every aircraft that we encountered in the military, and I know for a fact that I have never seen or heard of anything like this before. We lost sight of it after it flew over our house, and I ran to the back yard to see if I could see the tail end of it, but it was moving so fast that it was gone when I got to the back yard."],"Tags":"City","trends":["There has been one other sighting in Kuna","There were no other sightings in Kuna on or around July 23rd 2012"],"Weather Factors":"Unknown","Longitude":"-116.409967","files":["/var/www/straped/mufon/html2text/41139.html.txt","/var/www/straped/mufon/mufon_json/41139.json","/var/www/straped/mufon/org/41139.html"],"Summary":"Flew over my house from north to south.","Object Shape":"Oval","City":"Kuna","Case Number":"41139","Sighting Duration":"00:00:05","Viewing Distance":"101-500 Feet","Country":"United States","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.49758,+-116.409967(41139)&iwloc=A&hl=en\"> mufon case (41139) map </A>","Date Submitted":"07/25/2012 12:42 UTC"}