{"Country":"United States","Object Flight Path":"Straight-line path,Other","Date of the Event":"07/25/2012 12:00 UTC","trends":["There have been 5 other sightings in Missoula","There were no other sightings in Missoula on or around July 25th 2012"],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"07/25/2012 03:10 UTC","Sighting Duration":"00:00:03","Latitude":"46.860519","divs":["Sighting DetailsI was driving, and turning north on a side-street near my house, I had the window rolled down and turned to look down the street before turning, when I saw a bright object blaze out of the sky over the city, flying at about a 40 degree angle to the ground (southwest to northeast). It seemed to be falling toward the airport. This thing was only visible for about 3 seconds; time enough for me to think \"meteor? no. Airplane? no. What the hell!?\" then it was gone. It left a streak in the sky, but was no meteor. i saw the object and since I spent years driving a nightly (365 days a year route) between Missoula dn Helena I know what meteor looks like. This was an object. It was an elongated diamond (flying fat-end first), golden in color, metallic, with a kind of ornate design or pattern all over the surface in darker (black?) colors. It seemed to rotate slightly as it fell, so that I could see a refraction of light along its smooth, flat side -the side roughly facing me. I kept watching the sky, but saw nothing until I got back to my apartment (about 3 blocks away). I just parked and sat looking out my window for a while, and about two minutes later, I saw a very bright (VERY bright) flash in the sky, roughly in the place I had seen the object fall from, but I could see no object or source for this brilliant flash. When i say i saw i bright flash, i could compare it to this: After the flash I sat there in my car for a few more minutes watching the sky through the open window and saw a satellite pass over. When the Sat was very high overhead, it too flashed (I guess reflecting the sun), but that flash was not even a tenth of the flash that had preceded it a few minutes before in a different part of the sky. The first flash actually shocked me a bit. the sky was clear and there seemed no source for the flash I saw. thought i should drop a note. I have another strange sighting from years ago i will also file."],"Region":"Montana","Case Number":"41133","Object Shape":"Diamond, Teardrop","Source":"MUFON","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=46.860519,+-114.019501(41133)&iwloc=A&hl=en\"> mufon case (41133) map </A>","Longitude":"-114.019501","Object Features":"Patterned Surface","City":"Missoula","Log Number":"US-07252012-0006","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41133.html.txt","/var/www/straped/mufon/mufon_json/41133.json","/var/www/straped/mufon/org/41133.html"],"Summary":"Elongated golden diamond streaked across sky, varigated surface, later a bright flash"}