{"Latitude":"36.159098","map":"<A HREF = \"http://maps.google.com/maps?q=36.159098,+-115.291326(41145)&iwloc=A&hl=en\"> mufon case (41145) map </A>","City":"Las Vegas","Weather Factors":"Unknown","Summary":"silver ball way above class A airspace gliding toward me, slowed when I noticed it then hovered each time I stopped walking","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date Submitted":"07/25/2012 07:01 UTC","files":["/var/www/straped/mufon/html2text/41145.html.txt","/var/www/straped/mufon/mufon_json/41145.json","/var/www/straped/mufon/org/41145.html"],"Tags":"City","Disposition":"Unresolved","Source":"MUFON","Country":"United States","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around July 25th 2012"],"Object Features":"None","Object Shape":"Sphere","Date of the Event":"07/25/2012 03:28 UTC","divs":["sighting detailsi was walking across an almost empty parking lot from charleston blvd to barnes & noble and looked up specifically to see the strange clouds and the plane ascending from mccaran like i usually do. just happened to notice a silver orb gliding toward me nnw\\almost directly above me. i had to look almost straight up. the plane flew under it. at almost the same time a black helicopter came from the direction of mt. charleston. i can't be sure it was deliberate because i was watching the orb the whole time waiting for my eyes to distinguish wings or a tail to rule it out as a military plane flying above commercial airspace. however, it remained an orb without a trail the entire time. it was too high to hear any sound it may have been making. i noticed it slow as i stopped walking and just stood in the parking lot looking up. i know people driving by thought i was crazy but i couldn't take my eyes off of it. i took a few steps and it moved with me. as i stopped it stopped. as i moved it moved. as i sit here in barnes & noble writing this my eyes keep scanning the bright blue sky out the window. it had no visible lights or windows that could be seen at 3:30 on a clear day. it seemed to float but at an amazing speed with the ability to slow & stop at an amazing speed. all i can think is, \"what did i just witness?\" and \"i hope it's still out there when i'm done here.\" this is the 2nd sighting i've had in my life. the first time was from the top of our backyard swingset looking out over the fence to sf bay. the same rush of adrenaline and goosebumps. peace"],"Region":"Nevada","Log Number":"US-07252012-0018","Longitude":"-115.291326","Case Number":"41145","Object Flight Path":"Path then hovering"}