{"Object Features":"None","Date Submitted":"07/25/2012 06:04 UTC","Summary":"Two large glowing beach ball size orange orbs. The color looked like molten lava or thermite.","divs":["Sighting DetailsOn the night of July 4th around 10:15 p.m. in downtown Lexington, Ky., four of us were sitting outside an establishment at cafe tables that were equipped with umbrella's centered in the tables. We were watching fireworks which appeared be about 350 yards away from us. We could only see the fireworks that cleared the taller buildings in the background when all of a sudden about 70 feet above us was one bright orange glowing beach ball size orb that appeared to have the color of molten lava or thermite. It crossed over the street from our left to our right coming towards us at a slow but controlled pace then disappeared above the building where we were sitting. About 3 seconds later another identical glowing object crossed over at the same speed on the same flight path and disappeared like the first. I tapped a stranger sitting in front of me to make sure he was seeing what I was seeing and he confirmed 'Yes', he also saw it. Only one of my friends sitting at our table saw the two glowing objects because we were sitting outside the umbrella. The orange glowing objects in contrast to the black sky didn't appear to be giving off any heat."],"Date of the Event":"07/04/2012 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.048309,+-84.497843(41143)&iwloc=A&hl=en\"> mufon case (41143) map </A>","Latitude":"38.048309","Longitude":"-84.497843","Log Number":"US-07252012-0016","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41143.html.txt","/var/www/straped/mufon/mufon_json/41143.json","/var/www/straped/mufon/org/41143.html"],"Sighting Duration":"Undisclosed","Case Number":"41143","Object Shape":"Sphere","Object Flight Path":"Straight-line path","City":"Lexington","trends":["There have been 43 other sightings in Lexington","There was one other sighting in Lexington on or around July 4th 2012"],"Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"21-100 Feet","Region":"Kentucky","Tags":"City"}