{"Sighting Duration":"Undisclosed","Date of the Event":"07/24/2012 11:10 UTC","Country":"United States","Object Features":"Wings","Source":"MUFON","Date Submitted":"07/25/2012 07:43 UTC","Summary":"Looked like small bright star above large bright star w/ connecting light, transparent wings, but could see florescent outline of triangular wings from top light source to mid section.","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Star-like, Teardrop, Triangle, Other","Case Number":"41146","Latitude":"39.734296","Disposition":"Unresolved","divs":["sighting detailsi am my family were returning home, around 11:00 pm. after getting items out of trunk (~11:10) noticed moving light source just above and to the south. this was adjacent to one of the radio\\tv towers but was moving into the clouds at an angle, then disappeared. as i continue looking up into the sky, i noticed several more similar objects moving across the sky: each resembled a star, but there was one small one atop a much larger one, connected with a light source. from the mid\\bottom section of the top star-like object to the mid-section of the connecting light source, there appeared to be some form of triangular wing (2), but they were not solid; you could see directly through to the sky beyond, but the outline of each wing was fully florescent--resembling \" <> \" on the outsides of the \"teardrop\"? like objects. the objects were flying extremely slow in comparision to the planes that i notices much higher above.... there were not many planes, just a couple here and there within the two hour period we observed (even my neighbors viewed this). the objects were not only moving slowly, they hovered for indefinite periods of time. moving in all directions before stopping... there were no lights other than the entity itself; no flashing lights, and absolutely no sound."],"Tags":"City","Weather Factors":"Unknown","trends":["There have been 40 other sightings in Dayton","There were no other sightings in Dayton on or around July 24th 2012"],"Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=39.734296,+-84.245044(41146)&iwloc=A&hl=en\"> mufon case (41146) map </A>","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-84.245044","Log Number":"US-07252012-0019","files":["/var/www/straped/mufon/html2text/41146.html.txt","/var/www/straped/mufon/mufon_json/41146.json","/var/www/straped/mufon/org/41146.html"],"City":"Dayton"}