{"Date of the Event":"07/25/2012 10:45 UTC","City":"Kelowna","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Log Number":"CA-07262012-0008","Case Number":"41157","Longitude":"-119.407076","Date Submitted":"07/26/2012 12:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.893876,+-119.407076(41157)&iwloc=A&hl=en\"> mufon case (41157) map </A>","Latitude":"49.893876","Summary":"5 lights traveled across the sky with the area between them seeming to be trying to cloak against the night sky","Object Shape":"Unknown","divs":["Sighting DetailsMyself and two other friends were outside of my house in my back yard talking. I looked up at the sky and saw 5 lights (one in front, three in the middle and one at the end) moving strait in the north west direction. I also noticed that the area between the lights was rippling like it was trying to cloak itself. I didn't really believe what I was seeing so I closed my eyes, opened them again and focused really hard on the object. It was still there. At first I thought it was some kind of lantern in the sky as the lights very faintly streaked across the rippling surface. After a few more seconds of focusing in on it, I realized it wasn't some kind of lantern. At this point I got spooked and asked my friends \"can you guys see those lights!?\" One of my other friends also saw the light moving in the north west direction. This lasted about 15-20 seconds in total with my friend catching about the last 7 or so seconds of it before it disappeared in the horizon. After discussing the sighting afterwards, he said he didn't see the rippling between the lights as I did. Needless to say, I was pretty spooked afterwards and couldn't fall asleep for a few hours."],"Region":"British Columbia","trends":["There have been 9 other sightings in Kelowna","There were no other sightings in Kelowna on or around July 25th 2012"],"Tags":"City","Disposition":"Unresolved","Sighting Duration":"00:00:15","Country":"Canada","files":["/var/www/straped/mufon/html2text/41157.html.txt","/var/www/straped/mufon/mufon_json/41157.json","/var/www/straped/mufon/org/41157.html"],"Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Unknown"}