{"Longitude":"-94.288583","Viewing Distance":"501 Feet - 1 Mile, Unknown","Case Number":"41151","Source":"MUFON","Tags":"City","Country":"United States","City":"Blue Springs","Date of the Event":"07/19/2012 09:54 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/41151.html.txt","/var/www/straped/mufon/mufon_json/41151.json","/var/www/straped/mufon/org/41151.html"],"divs":["Sighting DetailsWhile sitting on our back deck that faces north we saw 3 brilliant red orange objects flying in the shape of a check mark.They were coming from the east flying in a southwesterly direction. The passed directly over the top of us and continued on until we lost sight of them. I noticed that one of them (the one in the video that is the bottom of the two)was pulsating and putting off a goldish color on the underneath side as it flew directly over us. They did not make any sound that we heard and were moving fast.It takes a second for us to find them in our camera lens even though they are very bright. We focused mostly on the two flying together at the bottom of the check formation. The other one comes in occasssionally there on the left. They did not video the brilliant red orange color that we viewed with our eyes. Also there are additional objects in the video that we did not see with the naked eye, only once we viewed the video did we see the objects sometimes right next to the two main ones, and then down in the right corner of the video as well."],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Log Number":"US-07262012-0002","Latitude":"39.016585","Sighting Duration":"Undisclosed","Region":"Missouri","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=39.016585,+-94.288583(41151)&iwloc=A&hl=en\"> mufon case (41151) map </A>","Summary":"3 brilliant red orange objects flying in check mark pattern","Date Submitted":"07/26/2012 02:26 UTC","trends":["There have been 28 other sightings in Blue Springs","There was one other sighting in Blue Springs on or around July 19th 2012","This sighting has never been favorited.",""],"Weather Factors":"Unknown"}