{"files":["/var/www/straped/mufon/html2text/41172.html.txt","/var/www/straped/mufon/org/41172.html"],"trends":["There have been 6 other sightings in Florence","There were no other sightings in Florence on or around July 17th 2012"],"Country":"United States","Region":"Arizona","City":"Florence","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Viewing Distance":"Unknown","Summary":"Corroboration of MUFON report 41159, Phoenix, AZ.","Tags":"City","Source":"MUFON","Longitude":"-111.479844","Date of the Event":"07/17/2012 10:02 UTC","Latitude":"33.106481","Case Number":"41172","Object Shape":"Circle","Object Features":"None","Date Submitted":"07/27/2012 02:34 UTC","divs":["Sighting DetailsOn July 17, 2012, a little after 10:00 pm Arizona time, I stepped out the back door of my home with my dogs for their final chance to run before bedtime. For a moment, I was paying attention to them and which way they were heading. Then I glanced across my pool area, and noticed a very bright orange light about 3 to 5 degrees above the horizon, located about 15 to 20 degrees south (to my left) of where the sun sets. At first, although the color was a bit strange, I thought this was a plane with the landing lights on approaching one of the airports around Phoenix, and paid little attention to it. My dogs had found one of those 6\" centipedes we have roaming the desert out here, and I was busy trying to keep them away from it. When they were under control, I glanced back at the light to see which airport it was heading into, and was very surprised to now see 2 identical bright orange lights, side by side, both the orange color I had first noticed. They were VERY slowly ascending as a horizontal pair, and as they did, their intensity was steadily increased. When they had reached a point about 5 degrees above the horizon, they became stationary in the sky, and began SLIGHTLY and SLOWLY pulsating independently in brightness. I live in and near the approaches to both major airports here (Phoenix Sky Harbor and Phoenix-Mesa Gateway), and have seen literally hundreds and hundreds of planes in the night sky, but they have never looked like these 2 orange lights. They were such an oddity to me that I decided I should try to photograph them with my cellphone. I saw the digital clock on the phone change from 10:03pm to 10:04pm as I flipped it open to access the camera. I judged that about 2 minutes or so had elapsed since my first catching sight of the original light. I pointed the phone at the lights and tried to get them in the view screen, but couldn't. As I swept the camera across that area of the sky, I could not get the lights to appear on the screen. I lowered the camera and looked past it, only to find that there was a good reason for this. The lights were simply no longer there. So, to sum it all up, I have no evidence of what I saw, but it was the same orange lights, seen on the same day, and at exactly the same time as reported by the witness from Mesa in MUFON report #41159. I reported this to let that witness know that I saw the orange lights, too. And to tell them that there seems to be more of us out there than you would think."],"Log Number":"US-07272012-0004","Disposition":"Unresolved","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.106481,+-111.479844(41172)&iwloc=A&hl=en\"> mufon case (41172) map </A>"}