{"Date Submitted":"07/27/2012 02:03 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Tags":"City","Region":"Washington","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around July 26th 2012"],"Longitude":"-122.362961","Log Number":"US-07272012-0003","Weather Factors":"Unknown","Case Number":"41171","files":["/var/www/straped/mufon/html2text/41171.html.txt","/var/www/straped/mufon/org/41171.html"],"Object Features":"None","Object Shape":"Cigar","Country":"United States","Latitude":"47.634993","Source":"MUFON","City":"Seattle","Viewing Distance":"101-500 Feet","Summary":"Saw an object flying in a straight line and then stop on a dime","Date of the Event":"07/26/2012 05:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.634993,+-122.362961(41171)&iwloc=A&hl=en\"> mufon case (41171) map </A>","Object Flight Path":"Stationary,Straight-line path","divs":["Sighting DetailsI saw an object fly over Queen Anne just behind the hill over South Lake Union. It was traveling at the speed of a jet engine before it stopped abruptly in midair in a manner of seconds. It started off with my friend and I working on Phinney Ridge. We heard a report on NPR about a strange anomaly being monitored by NOAA. An hour after the report we saw a black military helicopter fly over our heads. It was a completely sunny day until after work when we noticed a large thunder head to the east with clouds the color of stark white. Thinking that all these events where a strange coincidence we headed home down 15th ave towards the Ballard Bridge. I was looking at the sky when I saw a cigar like object flying at a speed faster than any comercial airliner. I could judge the speed that day because there were several, and I mean several, commercial airliners flying that day. Everything happened within a manner of seconds after that. The object I was monitoring was flying between Queen Anne hill and the Space Needle from what I could observe. After having a tree obscure my view I found the object again with my eyes thinking that my friend and I could rejoice in seeing another military aircraft for the second time that day. Instead of finding the object at a particular location ahead of where I had last seen it, given its trajectory, I was instead surprised to see that it had stopped in mid air. I can tell you that it had definitely changed speeds significantly enough for me to registor that it had slowed down to a halt in the time it took for a tree to obscure my view. We were driving at the time, so the time frame between animation and motionless was seconds. After that I lost sight of the object completely behind a series of trees obscuring my view. I would have loved for my friend to throw the car in reverse but that was something only an insane person would do during rush hour. I wish I could give you guys more info but that all I got. I also wish I had observed the object for more than a few seconds. Good luck with disclosure! P.s. My friend was driving and unfortunately did not witness the object I am describing to you. I wish he had!"]}