{"Summary":"orange light crossing the sky west to east","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/41188.html.txt","/var/www/straped/mufon/org/41188.html"],"Region":"Oregon","Date Submitted":"07/27/2012 06:19 UTC","Longitude":"-123.138346","map":"<A HREF = \"http://maps.google.com/maps?q=44.022526,+-123.138346(41188)&iwloc=A&hl=en\"> mufon case (41188) map </A>","City":"Eugene","Case Number":"41188","Latitude":"44.022526","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-07272012-0019","Object Flight Path":"Straight-line path","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around July 26th 2012"],"Disposition":"Unresolved","Object Shape":"Fireball, Sphere","Country":"United States","divs":["Sighting DetailsMy wife and I were outside talking at the back patio table and as I talked I looked out at the stars and noticed an orange light moving across the sky. It looked like it was high enough to be a plane but didn't look like one at all. I pointed it out to her and we were both amazed right away because we'd never seen anything that looked like that. It was like a glowing orange spherical shaped thing just cruising along in a straight line. The light didn't appear to be coming from a light that was attached to it (like how on planes you can see the flying object and then on a wing or something you can see a light attached), it seemed like the whole thing was just glowing. It looked like it had a halo around it sort of how the moon does sometimes. It was going west to east in the sky. It was about 2 millimeters big from my point of view, maybe about the size of the brightest star in the sky. I don't know how big it actually was and it was hard to tell how high it was flying. When it was passing by us it faded a little as if it was a ball of fire that was losing fuel. It sorta looked like a candle flameIt wasn't flickering exactly, it was more like fading in and out of brightness, kinda sputtering (if that makes sense, no sound though). My wife said it looked like it was going behind thin clouds but I don't think there were any clouds. But when it faded we couldn't see anything, so we never saw what was making the light. The whole time it never changed direction, speed, height or distance it just kept going eastward. The color was kind of light orange or tangerine color. There was no sound. It took maybe 1 minute to fly past us to where we couldn't see it anymore."],"Object Features":"Unknown","Date of the Event":"07/26/2012 10:00 UTC","Weather Factors":"Unknown","Source":"MUFON"}