{"Object Shape":"Sphere","Date Submitted":"07/27/2012 04:16 UTC","files":["/var/www/straped/mufon/html2text/41185.html.txt","/var/www/straped/mufon/org/41185.html"],"Latitude":"39.023561","Longitude":"-94.271765","Case Number":"41185","Log Number":"US-07272012-0016","Region":"Missouri","Tags":"City","divs":["Sighting DetailsIt is 1:36 AM and for the last half hour my girlfriend and I have been watching a blue, green, white and red sphere in the sky to the Northwest of our house towards Independence, Missouri. It has not moved, and through binoculars it seems to be spinning. It is NOT a disc shape, it is a sphere. There is no sound coming from it. The lights seem to fade in and out. When I checked my Google Sky Map it was not a known object. Also checked on my satellite app and it wasn't that, either. I'm not flat out saying it is a UFO but would like to know what it might be. Feel free to contact me if you have any questions. I'm not looking for publicity and would like my name left out of any reports, but I will answer any questions that will help. The witness sent the above e-mail to me and then I spoke to him by phone. He stated that after watching the object for about 40 minutes he and his girlfriend then went back inside the house. Later, at approximately 3:00 AM he went back outside to see if the object was still there but it was gone. Missouri ASD."],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Disposition":"Unresolved","City":"Blue Springs","trends":["There have been 28 other sightings in Blue Springs","There were no other sightings in Blue Springs on or around July 27th 2012"],"Weather Factors":"Unknown","Object Features":"Unknown","Date of the Event":"07/27/2012 01:30 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.023561,+-94.271765(41185)&iwloc=A&hl=en\"> mufon case (41185) map </A>","Summary":"Spinning green, red, white, blue object over Independence, MO","Country":"United States","Viewing Distance":"Over One Mile"}