{"Longitude":"-112.315128","Country":"United States","Weather Factors":"Unknown","Latitude":"33.597009","Tags":"City","Region":"Arizona","Log Number":"US-07282012-0004","files":["/var/www/straped/mufon/html2text/41199.html.txt","/var/www/straped/mufon/org/41199.html"],"Summary":"This Alien is the third one, I have drawings of the other one as well all at different dew fact!!!illings.","Viewing Distance":"20 Feet or Less","Date Submitted":"07/28/2012 01:01 UTC","divs":["Sighting DetailsI was in bed and had been asleep at the time. i knew someone was in the room because this has happened more time then I would like. I scare it more then it did me. he or it did not expect me to awake. it was talking to the others in the ship. I have a drawing of it and the very first one I was abducted by to. I have never reported them because I did not know where and I did not think anyone would believe me. I have been abducted twice and have meet 3 different species of aliens. i will take a lie detective test if you wish and I will pass with flying colors. I have filled most of your paper work out, but i am much better at telling and talking to someone. i still remember most of all of them and have written them down as well. You may not believe me but ever word I will tell you is all true. Thank you for your time Lorena Simon 623-933-6767 P>S I live by and air force base as well and that is not good in the future. I am sending you a drawing of the very first Alien that took me to there ship and came back again 11-21-09 to take me again. They said they will be back again and know how to find me no matter where I go."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.597009,+-112.315128(41199)&iwloc=A&hl=en\"> mufon case (41199) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Unknown","Case Number":"41199","City":"El Mirage","trends":["There have been 3 other sightings in El Mirage","There were no other sightings in El Mirage on or around January 7th 2011"],"Object Shape":"Unknown","Date of the Event":"01/07/2011 03:03 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path"}