{"Object Shape":"Circle, Diamond, Disc, Oval, Sphere, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.20169,+-100.623039(41202)&iwloc=A&hl=en\"> mufon case (41202) map </A>","divs":["Sighting Detailsi was working out of town in oberlin kansas. as we came back towards mccook nebraska a storm formed overhead fairly rapidly. i began taking pics of the lightning and cloud cover above our work truck. oddly enough there was no rain, but the clouds were very dark, and murky. i took several pics in a short time and suddenly had my watch go haywire, the truck began to chug, and stop running, and my cell phone died all at once. not thinking too much of it we got the truck running and my watch back to normal and we went on our way. after i got home i plugged my phone in and looked back on the pictures and found this thing in the frame of one of them. it was metalic, and black, clearly castin a shadow and reflecting light from the surroundings of the highway. i never saw it up close only looking back at the pic so its alittle fuzzy on what its exact speed, size, and orientation must have been. seeing as how im the only guy on our work crew who noticed it period, i personally think it must have been moving extremely fast to not have been seen."],"Object Features":"Dome","Longitude":"-100.623039","Region":"Nebraska","Date Submitted":"07/28/2012 01:47 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","trends":["There have been no other sightings in McCook","This sighting has never been favorited."],"Date of the Event":"06/30/2012 03:30 UTC","Latitude":"40.20169","Summary":"coming home from work and took pics of the storm with phone, looked back over them and saw this pic of ufo which explains inferference","Country":"United States","Disposition":"Unresolved","Log Number":"US-07282012-0007","Viewing Distance":"Unknown","Case Number":"41202","Tags":"City","Source":"MUFON","City":"McCook","files":["/var/www/straped/mufon/html2text/41202.html.txt","/var/www/straped/mufon/org/41202.html"]}