{"Object Features":"Unknown","Summary":"observed 2 metalic objects almost playing with each other and then vanished","Log Number":"US-07282012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=27.010111,+-82.057637(41200)&iwloc=A&hl=en\"> mufon case (41200) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Disc","trends":["There have been 11 other sightings in Port Charlotte","There were no other sightings in Port Charlotte on or around March 16th 1997"],"Tags":"City","Case Number":"41200","Date Submitted":"07/28/2012 01:39 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was on my way to my baseball game with my mom. She was driving and i was sitting in the backseat. Nothing out of the ordinary happend yet, it was just another normal day. Then out of nowhere, my mom seen rappid movement out of the corner of her eye in the sky. She said oh my god! Whats that up in the sky? She was pointing with her finger. I immedialtly went from the backseat to the frontseat to see what she was talking about. She pointed exactly to the objects and thats when my jaw just dropped! When i first noticed the objects, i immediatly thought its u.f.o's, and thats what i still think today! So there we were, watching two metalic, disc shaped, objects. I would say they were a couple miles up in the sky. They seemed to almost be dancing in the sky or playing with each other. The one on the left went to the right and the one on the right went to the left. Then they went up and down changing position but not realy moving very far from that spot, just mocving extremely fast. They moved faster than anything I know about! Faster than jets, planes, helicopters, ext. So they were moving extremly fast back and forth, then they stopped for a split second and then took off into space, vanishing before our eyes! It happend so fast, but i will never forget it! We were right down the street from the baseball field during the sighting. So once we arrived, i asked anybody else if they seen what me and my mom just saw. Nobody seen anything! Im not crazy, i know what i saw! I've been to airshow's and seen jets, helicopters, and planes fly near, far and these objects were nuthing like those."],"files":["/var/www/straped/mufon/html2text/41200.html.txt","/var/www/straped/mufon/org/41200.html"],"Region":"Florida","City":"Port Charlotte","Longitude":"-82.057637","Disposition":"Unresolved","Latitude":"27.010111","Source":"MUFON","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Date of the Event":"03/16/1997 12:00 UTC"}