{"Case Number":"41210","City":"Lucas","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Circle, Oval, Teardrop","Country":"United States","Viewing Distance":"21-100 Feet","Summary":"Formation of big shaped looking clouds but not clouds. In formation.They shift","Longitude":"-82.419823","Date Submitted":"07/28/2012 11:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.704033,+-82.419823(41210)&iwloc=A&hl=en\"> mufon case (41210) map </A>","Date of the Event":"07/21/2012 12:00 UTC","divs":["Sighting DetailsJuly 21, 2012 around 10:45 PM I got a text from my young daughter who was attending the Christmas in July at Pleasant Hill Lake which is about 10 minutes south of where I live. She was a little frantic and said there were lights or something in the sky. I walked outside to look at the night sky toward that direction. I saw nothing. I turned around to come back to my porch, glanced over to my left and there were these objects right in front of me. I called out to my oldest who was sitting on the porch to get my husband. We were totally mesmorized by these objects! We all witnessed this. They were so close and low! Four cloud appearing objects in formation that did not appear to be light but had light to them. One at top, bottom and one to each side. They hovered, made a huge shift clockwise, all sucked into the middle to become one..disappeared into what appeared like a black hole.. it was so quick..came back out..in the same formation and then started all over again. This contined for 10-15 minutes I believe. I was on the phone with the police when it eventually disappeared for the night. The next night, July 22, 2012, a little after 11:00 PM..the same object was there again but this time not quite in the same place..it had moved more to the right(NE) direction, but still fairly close to the same place. Again, the same object but now going in a circular motion. At first I only noticed one but then stepped out further into my yard and saw 2. One on top of the other but not touching. Very Strange! My youngest daughter stated the object was exactly what they had seen the night before in Pleasant Hill. I was now video taping with my phone. I know what I saw...but what did I see? July 23, 2012 around 10:45 to 11:30 PM My oldest daughter and I were outside ready to film if they appeared again but then we did not see what we had the prior 2 nights. However, traveling from Southeast to a northerly direction we saw something that appeared mostly green in color, with a tint of electric blue traveling straight not in a downward path like a meteor would travel. This object was simply trucking along at a pretty good clip. I found it odd that it had what I would call a trail to it. Like when something would have when it hit the atmosphere. This object was low and big. This experience has left me baffled and wondering if I should stay in at night."],"Latitude":"40.704033","Region":"Ohio","Log Number":"US-07282012-0015","Disposition":"Unresolved","trends":["There have been no other sightings in Lucas","This sighting has been favorited 1 time."],"Tags":"City","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/41210.html.txt","/var/www/straped/mufon/org/41210.html"],"Sighting Duration":"Undisclosed","Object Features":"None"}