{"Object Flight Path":"Undisclosed","Log Number":"US-07282012-0020","Sighting Duration":"01:24:00","files":["/var/www/straped/mufon/html2text/41215.html.txt","/var/www/straped/mufon/org/41215.html"],"divs":["Sighting DetailsI went to sleep around 11 pm in July 12. When I was sleeping I started feeling burning in my lowest left back. it was intense feeling. Suddenly i was floating at the top of the ceiling and I could see my body in the living room where I was sleeping I could see 4 white kind human people ( very skinny body where they were doing something in my body. when I was floating in the ceiling and watching my body, there were two two white of these creature next to me. They want me to see what they did to me like telling me I was selected for something. I saw in my back that they inserted in my lowest left back like piece of wire that went trough the center of my back to the right upper shoulder, then it went back the same way to the right of my lowest back following the same trace. Then it went back again to the left upper on my shoulder and went back to the lowest left of my back. They took that piece wire of my back. I woke up around 5 am and I went to bathroom to see the burning part to see it was a dream or what. Well I saw the burning part the little hole where looks they put the wire in there. I do not know what to think about that. I hope someone had these experience like mine. I remember very clear they showed me it because they want me to understand I was chosen for something soon. In May of these year 2012 I was taking pics to airplane and birds and I notice something when I see and airplane from my back yard. I took a pic and it looks like ufo. If you zoom to that object it look like ufo."],"Source":"MUFON","Viewing Distance":"Unknown","Case Number":"41215","Summary":"Abduction in my house","Region":"Arizona","Tags":"City","Object Features":"Undisclosed","Date Submitted":"07/28/2012 02:45 UTC","Country":"United States","City":"Phoenix","Longitude":"-112.069597","Latitude":"33.453097","Weather Factors":"Unknown","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around July 12th 2012"],"Date of the Event":"07/12/2012 12:00 UTC","Disposition":"Unresolved","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.453097,+-112.069597(41215)&iwloc=A&hl=en\"> mufon case (41215) map </A>"}