{"Object Features":"Window(s)","Tags":"City","Object Flight Path":"Hovering then path","Source":"MUFON","City":"Brooksville","Date of the Event":"04/24/1974 08:30 UTC","Object Shape":"Disc","Summary":"Saucer type craft reacts to blinking flashlight","divs":["Sighting Details This sighting took place around 1974 near Brooksville, Maine. My friend and I were going smelt fishing around 8 or 9 pm. We walked through the woods to Walker's Pond and the inlet where we were going to fish. I carried a large cell flashlight, like an electric linesman would use. It was dark enough to use the light to watch your step along the path. Other fishermen were positioned around the pond, we could faintly hear them talking and occasionally see their flashlights. As we approached the waters edge, I noticed flashing, colored lights off to my right.I said out loud, \"What the hell is that?\", my friend said \"I don't know.\" The other fishermen were too far away and from their angle could not see into the small cove where to lights were. We had watched it for about a minute when I decided to blink the flashlight at it. Suddenly the lights began moving silently toward us, hovering just above the water. I could plainly see it wasa saucer shaped craft with a dome-like bubble on top. The lights were going around the edge under the craft, yellow, red and white. I thought I could see shadows in the dome part. I was freaked out and said to my friend let's get out of here! We were standing right beside each other as we turned to run. I took about 3-4 steps, slipped and fell down. I immediately got back on my feet and called to my friend, silence. He didn't answer, which I found very odd since he had been within 5 ft. of me not 30 secs. before. I called again and he answered me from about 100 yds. away. He made his way back and asked what happened. I was confused and didn't know what had taken place. As we regrouped to make our way out of the woods, we suddenly realized all the fishermen on the pond were gone.There was no one fishing, they had left. To us it had been less than 5 min., I cannot account for the time that was lost that evening.We don't know if we were abducted, but somehow a period of time is unaccounted for from that night. I'm 59 yrs old, ex-marine and this experience has stayed with me my entire life, I have wanted to be hypnotized or regressed to find out about that night but haven't actually done it. I will tell you this, after my experience I KNOW Ufo's are real and I believe others who tell their stories. I recently learned about the Allagash Abductions and it kind of scared me, they also attracted the attention of the saucer by flashing a light at it. Weird!"],"Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-68.684787","Weather Factors":"Unknown","Case Number":"41214","Date Submitted":"07/28/2012 02:09 UTC","trends":["There have been no other sightings in Brooksville","This sighting has been favorited 1 time."],"Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/41214.html.txt","/var/www/straped/mufon/org/41214.html"],"Latitude":"44.346991","map":"<A HREF = \"http://maps.google.com/maps?q=44.346991,+-68.684787(41214)&iwloc=A&hl=en\"> mufon case (41214) map </A>","Disposition":"Unresolved","Region":"Maine","Log Number":"US-07282012-0019"}