{"Date of the Event":"04/12/2010 01:36 UTC","Case Number":"41224","divs":["Sighting DetailsThe pulsating blue lights and feeling them them work me. I could see the blue light as I was sitting up. it was so beautiful, but i was frightened. I knew they had been in my room again, but not as orbs this time. Then my blinds opened up like you would spread them wide with both hands to look out and this big and I mean huge human eye appeared. It scared the hell out of me and I ran from my bed room. Later I went into the garage and got two large peaces of cardboard and put them in the windows and I just took them down about 4 months ago. I have a drawing of the eye, but it was much bigger. The next week I started having flash backs, oh my god The pain!!!!! They too have been able to find me even though I have moved from WA state to AZ How is that??????????? There are more encounters to shear. No one is going to believe me except Connie who worked with me for 11 years and my friends because they know me not to be a lair. I sometimes wish they had never found me and yet I have always know they exists and know I know for a fact they do and I have meet 3 of them there is still one more and to be honest I do not want to meet them at all. The info they have shared is a lot and I can hear each one of the species. Thank you Lorena Simon"],"Log Number":"US-07282012-0029","files":["/var/www/straped/mufon/html2text/41224.html.txt","/var/www/straped/mufon/org/41224.html"],"Summary":"The greys did abduct me and they shoud up again.","map":"<A HREF = \"http://maps.google.com/maps?q=33.601109,+-112.306328(41224)&iwloc=A&hl=en\"> mufon case (41224) map </A>","trends":["There have been 3 other sightings in El Mirage","There were no other sightings in El Mirage on or around April 12th 2010"],"Weather Factors":"Unknown","Country":"United States","Object Shape":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"Arizona","Object Flight Path":"Unknown","Object Features":"Unknown","Tags":"City","Source":"MUFON","Date Submitted":"07/28/2012 08:24 UTC","Latitude":"33.601109","Longitude":"-112.306328","Disposition":"Unresolved","City":"El Mirage"}