{"Latitude":"40.79306","Object Features":"None","Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Date of the Event":"07/28/2012 09:15 UTC","Tags":"City","Region":"New Jersey","Case Number":"41229","City":"North Arlington","divs":["sighting detailsi was out side on my street corner, i was walking towards my house i looked up and caught sight of approximately 7 glowing or shining red and orange orbs. they were hovering, then moving slow from west to south. there is cloud cover and as they slowly drifted into the clouds , they went out of sight. perhaps they were chinese lanterns, but they were pretty bright they were not flares, because they moved up...into the clouds not down towards the ground. i live in a very heavy airplane traffic route. between newark and teterboro airport , i see and hear planes and helicopters all the time. the objects made no sound that i could hear and moved too slow to be planes. there were no blinking lights, just the red\\range glow. a bit of a scintillation to them, but it's has been raining and there is clouds and some humidity in the air. i only observed the objects for about 5 mins, before they moved up into the cloud cover, this is were the dimmed and i could no longer se the lights. i went home looked out my window at the same area of sky for some time, but only saw the regular air traffic of planes. i went online to the weather channel and local airport radar to see what the cloud cover height was, it says \"broken clouds at a height of 1400 feet\" \"winds at 10 mph from the north\" i can't be sure how high in the air they were. but the did move along the horizon for just a bit before the moved upward into the clouds."],"Summary":"7 Red/Orange orbs","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41229.html.txt","/var/www/straped/mufon/org/41229.html"],"Date Submitted":"07/28/2012 10:11 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Object Shape":"Sphere","Log Number":"US-07282012-0035","Disposition":"Unresolved","Country":"United States","Longitude":"-74.131203","trends":["There have been 3 other sightings in North Arlington","There were no other sightings in North Arlington on or around July 28th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.79306,+-74.131203(41229)&iwloc=A&hl=en\"> mufon case (41229) map </A>"}