{"Object Features":"None","Tags":"City","Date of the Event":"07/28/2012 06:00 UTC","Source":"MUFON","Sighting Duration":"00:25:00","Region":"Texas","trends":["There have been 17 other sightings in Brownsville","There were no other sightings in Brownsville on or around July 28th 2012"],"Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsDuring todays event at exactly the time and date mentioned, my family and I got home from having dinner. For some reason I looked up at the sky, although its a bit overcast and sunny with temperatures in the upper 90s. I saw what appeared to be a silver, oval looking object traveling from East to West at around 2000 ft, I would estimate cloud cover to be the same, object flew in straight path, no wobble, no noise, flew straight into a cloud but failed to come out the other side. My family and I saw it. Wife, 3 kids, all stared but object did not re-emerge. As we turned to head into the garage again we looked up and there was a star like object just there, Western sky, not moving at a higher altitue. I would estimate it to be at around 20 thousand feet. Small, faint, star like not moving. Then, poof, its gone and an orange-red color orb appears in the Southern sky. Again I would estimate it to be at around 10 thousand feet. This one was bigger. It moved very slowely in an Eastern direction then stopped and seemed to climb. Not in an upward direction but like if it was moving away from our vantage point. It moved and became faint until we lost sight of it. After that my family went in the house and one of my daughters stayed a bit with me and Lord and behold another star looking object just above the moon, maybe 30 degrees higher or East of the moon. Bright, slow, very slow moving. We tracked it till it got from a 50 degree elevation to about the 120 degree elevation over head as we looked in a southern direction. My son brought the binoculars but I could not focus on the object due to the suns brightness and glare. It became faint and as it did another Oval metalic looking sphere raced from East to West until it too became lost in the clouds heading in the suns direction. The Star like object overhead got dimmer then pulsed very bright and disappeared. All this in a span of over 25 minutes. I called my younger brother during the event so he could bring his hi resolution camera since he is a photographer but no other objects appeared. I also tried to video tape with my phone but nothing came out. For the record, my mother saw an orb last week over Brownsville too, stationary then flew off to the East."],"Longitude":"-97.437777","Object Flight Path":"Hovering then path,Straight-line path,Other","Summary":"5 ufos, 2 stationary and climbing, 2 traveling fast, one stationary orange in color and climbing","Country":"United States","Log Number":"US-07282012-0031","City":"Brownsville","map":"<A HREF = \"http://maps.google.com/maps?q=25.968456,+-97.437777(41225)&iwloc=A&hl=en\"> mufon case (41225) map </A>","Viewing Distance":"Unknown","Date Submitted":"07/28/2012 08:30 UTC","Latitude":"25.968456","Case Number":"41225","Object Shape":"Oval, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/41225.html.txt","/var/www/straped/mufon/org/41225.html"]}