{"Viewing Distance":"21-100 Feet","Case Number":"41230","Region":"Maine","Object Flight Path":"Path with directional change","Date Submitted":"07/28/2012 10:16 UTC","trends":["There have been 2 other sightings in York","There were no other sightings in York on or around January 7th 1995"],"Weather Factors":"Unknown","Longitude":"-70.678837","Source":"MUFON","Object Features":"Window(s)","Latitude":"43.134818","Object Shape":"Disc","Date of the Event":"01/07/1995 12:15 UTC","Summary":"A circular cake pan shaped ufo with lights & hatch landed in a small field near me. The hatch opened, no one came out it shut and flew away.","files":["/var/www/straped/mufon/html2text/41230.html.txt","/var/www/straped/mufon/org/41230.html"],"Disposition":"Unresolved","divs":["Sighting DetailsI was near my mother's house next to a small field about to light a cigarette, when I saw a large ufo land in the field near the ocean and some trees. I was looking in that direction anyway. I thought it was a ufo because it didn't look like a human air vehicle. The object I saw was about 15 feet in diameter & about 5feet high. It flew in quickly and landed in the snow. I remember seeing windows or lighted windows on the ufo. There was a hatch, like a door. It opened & no one came out. It shut and the uof ascended into the sky over the water and went right down the York River. I was so amazed, just leaving Hawaii where I had studied Astronomy. There was no one around, so I didn't have anyone to tell at first, but I eventually told my mother I had seen a ufo. It was really close to me so I felt lucky to see it. This is the second time I was at my mother's house that I had seen a ufo, but she has difficulty believing me. The ufo disappeared behind the trees as it made it's way down the York River."],"City":"York","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.134818,+-70.678837(41230)&iwloc=A&hl=en\"> mufon case (41230) map </A>","Log Number":"US-07282012-0036","Tags":"City","Sighting Duration":"00:15:00"}