{"Country":"United States","Object Features":"Other, Unknown","trends":["There have been no other sightings in on the beach","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/41233.html.txt","/var/www/straped/mufon/org/41233.html"],"Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"07/27/2012 10:45 UTC","Region":"Florida","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-78.543594","Sighting Duration":"00:06:00","Source":"MUFON","Object Flight Path":"Path then hovering","Object Shape":"Fireball, Sphere, Star-like, Unknown","City":"on the beach","Case Number":"41233","Date Submitted":"07/28/2012 11:14 UTC","Tags":"City","Summary":"{nd} i saw 4 balls of glowing orange show up out of nowhere then one by one disappear leaving no trace, other witness saw as well","divs":["Sighting DetailsOn July 27 Fri night at10:30pm Myself and friend were on deerfield beach in broward county florida. We turned to view the NW sky as a I saw a light which was a different color from the planes over the ocean. It looked like it was just hovering in a glowing pulsating manner, it stayed there about a minute then slowly turned into nothing, just as it was almost gone another exact same object appeared. I linked it with a palm tree for reference and realized it too wasnt moving just hovering. As it also began shrinking in color another exact same object appeared next to it and that made three. It did what the others did and slowly disappeared. Then the fourth one was seen and did exactly the same as the last three. No noise was heard, no clouds in sky, very strange. For sure it was no bird, plane, helicopter, remote plane or chopper or machine or kite with light. They appeared out of thin air and left in the same spot they began. Very wierd for surely a UFO because it cant be identified as any known craft. It was maybe 2 miles away, but my video cam in my phone didnt catch the light."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.922542,+-78.543594(41233)&iwloc=A&hl=en\"> mufon case (41233) map </A>","Latitude":"35.922542","Log Number":"US-07282012-0039"}