{"City":"Holland","Object Shape":"Sphere","Longitude":"-86.10403","Weather Factors":"Unknown","Region":"Michigan","Tags":"City","files":["/var/www/straped/mufon/html2text/41246.html.txt","/var/www/straped/mufon/org/41246.html"],"divs":["sighting detailsas i was taking teenage son's friend home. i noticed a rather bright amber light in the nne sky over holland, mi. the observation was made on 32nd street & washington, one block e from washington. the light\\sphere was from that location coming across the sky at a different elevation or relationship to the horizon than a plane would typically follow. it was pronouncely different. at fist notice, it was far away (like over the north side of town or holland heights) and tracking to the ssw. i stopped vehicle in center lane on 32nd across from auto zone turned on hazard lights and got out & watched it track arcoss the sky. i looked at clock in my vehicle & it was minutes before midnight. the amber sphere\\light moved very quickly but seemed to be moving purposefully. it appeared very, very high in the sky. it went overhead at a very high altitude. it did not waver from course. there were no flashing lights like one sees on an airplane. it was in sight for about 4 minutes. i checked to see if a satellite or iss was overhead -i cud not find anything that was passing overhead at my lat\\long. i've seen the iss overhead before -this seemed different. the teenager who was with me observed the same. it was a clear night & the moon was out (1\\2 moon was in view) i wud like to know what that was, especially if it was clearly not a satellite."],"Summary":"Bright light/sphere traveling from NNE to SSW","Latitude":"42.791784","map":"<A HREF = \"http://maps.google.com/maps?q=42.791784,+-86.10403(41246)&iwloc=A&hl=en\"> mufon case (41246) map </A>","Case Number":"41246","trends":["There have been 20 other sightings in Holland","There were no other sightings in Holland on or around July 27th 2012"],"Source":"MUFON","Country":"United States","Object Features":"None","Date of the Event":"07/27/2012 11:54 UTC","Log Number":"US-07292012-0011","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Date Submitted":"07/29/2012 11:23 UTC"}