{"Disposition":"Unresolved","Country":"United States","Viewing Distance":"Over One Mile","trends":["There have been 18 other sightings in Lubbock","There was one other sighting in Lubbock on or around July 27th 2012"],"divs":["sighting detailsi started walking towards the entrance of a store and looked north as there was a big thunderhead off in the distance and it looked pretty impressive. as i got closer to the door, a light caught my eye so i glanced northwest to see a metallic sphere (i assumed it was metallic because it had a definite glare from the sun) off in the distance. (i estimated it was several miles away from me, probably on the nw side of town, just a guess) the entire thing probably happened in 5-6 seconds but as i walked it shot off northwest in a rapidly increasing rate of speed and with what looked like a slight curvature in it's trajectory. (note: it was already moving when i first saw it, but it's speed did increase rapidly in the last few seconds of viewing it.) oddly enough, after i left the store (still pondering what i had seen a short time before) i noticed an airliner to the northeast of me. the sphere i saw moved many, many times faster than that airliner. i've also seen several weather balloons in the evening\\dusk sun before but those are fairly stationary. this sphere was extremely fast."],"Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/41247.html.txt","/var/www/straped/mufon/org/41247.html"],"Sighting Duration":"00:00:06","Object Features":"None","Source":"MUFON","Log Number":"US-07292012-0012","map":"<A HREF = \"http://maps.google.com/maps?q=33.529807,+-101.870302(41247)&iwloc=A&hl=en\"> mufon case (41247) map </A>","Case Number":"41247","Date of the Event":"07/27/2012 07:00 UTC","City":"Lubbock","Summary":"Reflective sphere with rapidly increasing rate of speed and slight curvature in trajectory (Heading due NW)","Longitude":"-101.870302","Weather Factors":"Unknown","Object Flight Path":"Other","Region":"Texas","Tags":"City","Latitude":"33.529807","Date Submitted":"07/29/2012 11:46 UTC"}