{"divs":["sighting detailswas walking my dog in highland, in (northwest corner of indiana) west along the \"highline\" on laporte st. dog paused around 9:48\\9:49 pm to sniff a post, so i turned southeast to watch\\wait. noticed a commercial jet approaching; he was relatively low and so i assume he was headed toward chicago airports. to his right from my perspective and behind him at a higher altitude was a yellow ball, like a bonfire. the outline was \"fuzzy\" but not flickering. when both were a little southeast of me, the jet continued on his course to the northwest, but the yellow - thing - was moving due west. the yellow form slowed greatly and i could see a bluish-white aura that seemed to be generated from above the yellow glowing mass or flames or whatever, with waviness seen in the bluish-white glow, like heat or exhaust (or whatever!). my dog moved to the west of me and i glanced down at him, then looked up again and the yellow thing was ascending quickly and silently toward the southwest. within less than two seconds, it appeared as nothing more than a pinpoint and then disappeared completely in the next instant. from my perspective, it was a bit below the moon when it disappeared from sight. the yellow thing's ascent reminded me of seeing rocket launches on tv, but with no noise or trail. when i first saw the yellow ball, i wondered for a split-second if a plane or jet was on fire, but that obviously was not the case. afterwards, while i was freaked out, i wondered if it could have been some sort of bizarre military aircraft, but the flight made no sense - why would it seem to shadow a commercial jet until over northwest indiana, then veer off and ascend at that speed? i was and continue to be stunned by what i saw. and by the way, no drinking or drugs were involved. i'd estimate that the entire viewing lasted perhaps 15 seconds. i looked at the time on my cell phone as soon as the thing had disappeared from view because i wanted to text my best friend about it, if it was not too late."],"Latitude":"41.558934","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-07292012-0013","Date Submitted":"07/29/2012 12:36 UTC","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/41248.html.txt","/var/www/straped/mufon/org/41248.html"],"Region":"Indiana","Longitude":"-87.452426","City":"Highland","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.558934,+-87.452426(41248)&iwloc=A&hl=en\"> mufon case (41248) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"07/28/2012 09:49 UTC","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Case Number":"41248","Summary":"Yellow ball w/bluewhite aura, moving NW behind commercial jet, then slowed, then ascended SW & disappeared w/in 3 secs","Disposition":"Unresolved","Country":"United States","trends":["There have been 3 other sightings in Highland","There were no other sightings in Highland on or around July 28th 2012"],"Weather Factors":"Unknown"}