{"Date Submitted":"07/29/2012 03:02 UTC","files":["/var/www/straped/mufon/html2text/41251.html.txt","/var/www/straped/mufon/org/41251.html"],"Date of the Event":"07/28/2012 12:00 UTC","Object Shape":"Sphere, Star-like","Object Features":"Other","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-75.666702","trends":["There has been one other sighting in Clayton","There were no other sightings in Clayton on or around July 28th 2012"],"divs":["sighting detailsmyself and family were outside at about 11 pm.(1st.night),and i had noticed what looked to be a falling star,object is usually a white color and round;when the object was lighting up and disappearing but you could still see it flying around in the sky because the surroundings would reflect off of the object.you can see that the object is using a camouflage effect. i see this object every night continuously to present day.i have noticed the object also in a different area were i used to live; one night like it was following me. although the object then came up to me and my 2 children.it was then flashing a red and blue continuously,color.it was the size of a baseball. this object seemed intelligent, i think this because i had walked up to it and it backed away a bit.when i stepped back it came closer to me.my children were scared and so was i. this object seem to toy with me a bit. there was no sound to it. right now i see this object at my mothers house witch i'm only visiting but it has been over a week and it seems to be getting closer meaning it's flying\\hovering over my mothers house. iv'e seen ufo's in the past and i'm wondering if they are trying to make contact. it just seems to be more and more i'm seeing objects in the night sky but also lights flashing in and around the area i'm in. soooo, i'm also wondering if anyone else is seeing these lights\\objects in my area.(kent county and newcastle county)areas. i'm going to try to video tape this object for the first time tonight.we will see what happens. if successful i will send it in to mufon. thanks. stacey in newark."],"Region":"Delaware","Case Number":"41251","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"39.220624","City":"Clayton","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.220624,+-75.666702(41251)&iwloc=A&hl=en\"> mufon case (41251) map </A>","Log Number":"US-07292012-0016","Summary":"Object is appearing star like with a camoflouges itself you can see our surroundings reflecting off of the object.Object appears every night for 2 weeks now.","Viewing Distance":"20 Feet or Less","Tags":"City"}