{"trends":["There have been 6 other sightings in Mt Clemens","There were no other sightings in Mt Clemens on or around July 28th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.57669,+-82.888069(41250)&iwloc=A&hl=en\"> mufon case (41250) map </A>","files":["/var/www/straped/mufon/html2text/41250.html.txt","/var/www/straped/mufon/org/41250.html"],"Tags":"City","Object Shape":"Other","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-82.888069","Viewing Distance":"Over One Mile","Case Number":"41250","Sighting Duration":"Undisclosed","Summary":"Bright orange tulip shaped soundless object","divs":["Sighting DetailsAt around 10:15 pm, 7-28-2012, I was sitting on my front porch swing, looking out at the sky looking for bats, which I do each evening. Out of the North I see an orange glwoing object hovering, then it lowered down some, flew slowly towards the south then it went back up again hovered for less than a second, then proceeded to go across the night sky slowly. As I said it was tulip shaped, brigter orange along it's edges, a bit duller orange in center. It made no noise at all. I see airplanes at night frequently, and this object DID NOT behave as any aircraft I had ever seen before. There were no other auxillary lights around it, and it stayed the same color. It never flashed. Midway thru this, I called my husband to come and look. He saw this also. Together we watched it proceed southward, then it became obscured by the tree tops. We watched to see it come out the other side of the tree foliage, but then there was NOTHING THERE. It is as if it had just disappeared. What I find strange today is, that I am in a total state of exhaustion, for no good reason. I feel I could sleep at the drop of a hat. I do not know if this has anything to do with this sighting, but earlier at sundown, in the southeast sky, I saw what looked like what was maybe a commercial airliner flying by and the sun reflecting on it. But what was strange was there another reflection following close behind it. I know aircraft are not suppose to 'tail gate', but that is what it looked like. it only lasted maybe 3-4 seconds, and then it was gone. My husband tried to say maybe it was an optical illusion of sorts, that maybe one air craft was actually many thousnd feet above the other, yet it appeared that they were flying together at a very close distance. Last but not least, my neighbor had an incident in either early spring or fall, he canot remember, but the trees wer still bare. It was night time. His 2 nieces were visiting and they yelled for Uncle John to come look at something. He looked to where the girls were pointing, and he and the girls saw what he described as an orange colored Orb moving thru the tree tops, going slowly. He said it shocked him, it was so close. It emitted light, but he did not see anything else on it. It made no noise at all. it when on a path for a few seconds, then shot straight up into the air and disappeared. He told us he hadn't told many people for fear of being called crazy. Ok, that is about all I can say about this incident. All I can ask is did anyone else report something like this last night?? It was just too strange. Thank You, Lisa Simon Please, can someone contact me about this if possible?"],"Country":"United States","Log Number":"US-07292012-0015","Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Michigan","City":"Mt Clemens","Date of the Event":"07/28/2012 10:15 UTC","Object Features":"Appendage(s)","Latitude":"42.57669","Date Submitted":"07/29/2012 02:34 UTC"}