{"Disposition":"Unresolved","Date Submitted":"07/29/2012 10:15 UTC","Tags":"City","Longitude":"-73.749697","Object Shape":"Square, Rectagular","Latitude":"45.45764","Case Number":"41258","Viewing Distance":"Unknown","Region":"Quebec","Country":"Canada","Object Flight Path":"Straight-line path","City":"Montreal","Weather Factors":"Unknown","Log Number":"CA-07292012-0022","Sighting Duration":"Undisclosed","divs":["Sighting DetailsGood for me, have seen 2 UFOs in 2011 and this year. Both sittings occurred in Transport bus from Ottawa to Montreal. First sitting happened close to Dorval Airport. I was watching the sky in case seeing an airplane. The sky was blue with 40% of small clouds all over the area. Now, suddenly, on my left, saw a big cross travelling at an incredible speed, to my right then, evaporated. Who am I, an astronomer, CG and VFX Producer. I Observed an object appearing when background is blue and disappear while over a small dense cloud, back to vision on blue and so on. It last between 1 or 2 seconds. Second sitting: Again in a transport bus from Ottawa to Montreal on 22 June 12 at 0900am on hi way 417 close to Casellman. This time it last between 5 and 10 minutes. At that moment, Cloud formation was beautiful and kept watching the sky, forget my camera at home for the last time. That object was stationary and maybe 10000 feet up, elongated white not shinny with very tiny device attaching the second part, very weird indeed. but the most bizarre feeling is that nobody said something or no reaction at all. Recall that UFO last, in front the bus, between 5 and 10 minutes and it was big.We passed over and I stand up in the bus, chin against the rounded window and at the zenith, it was the end of my sight view. Thank you and hope to report others and know the truth. In time, will recreate my sittings in CGI."],"Date of the Event":"08/13/2011 10:11 UTC","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around August 13th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.45764,+-73.749697(41258)&iwloc=A&hl=en\"> mufon case (41258) map </A>","Summary":"Like a Cross passing extremely fast from my left to right and evaporated wow","files":["/var/www/straped/mufon/html2text/41258.html.txt","/var/www/straped/mufon/org/41258.html"],"Source":"MUFON","Object Features":"Unknown"}