{"Sighting Duration":"01:30:00","trends":["There have been 22 other sightings in Denton","There were no other sightings in Denton on or around January 26th 2012"],"Object Flight Path":"Hovering then path","Latitude":"33.146023","map":"<A HREF = \"http://maps.google.com/maps?q=33.146023,+-97.090905(41255)&iwloc=A&hl=en\"> mufon case (41255) map </A>","Log Number":"US-07292012-0019","Longitude":"-97.090905","Viewing Distance":"Over One Mile","Region":"Texas","Source":"MUFON","Tags":"City","Country":"United States","Date of the Event":"01/26/2012 11:00 UTC","City":"Denton","Object Shape":"Disc, Sphere, Star-like, Triangle","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"squirmed arouns, elevated, serantine motion, side to side motion","Date Submitted":"07/29/2012 06:34 UTC","Object Features":"Window(s)","divs":["Sighting DetailsAt first I thought it was a star, the north star, but it was in the west sky. As I was goin back in my house, it moved, I grabbed my door frame n case I was moving, and it moved again. I stepped back outside and hunkered down grabbing my knees so I could be sure I wasn't moving, it moved again. I went inside to get my brother n law, n we watched it for 45min. It would squiggle around, then elevate, then go into a serpantine motion, like a snake on water, then it would skip left to right to left almost without seeing it move, it also orbed colors, blue, red, and green. He went to bed after 45 min, I got in truck to try n drive under it, it then started flyin away. At 12:30 midnight I go back home, going inside my house I think I see others, tired, coming off this rush, I blow it off. The next night I have others at my house, same things happened. I have been seeing them since. They look like stars. I've seen them glow the clouds, move outta oncoming planes way, fly across sky n stop, fly towards moon then right before it goes under moon fly around moon, seen triangle shaped ufos one red one white follow each other, seen them move around, fly straight, fly in serpantine type motion, and seen them in broad daylight, 20 years ago at 12:30 at night I watched one fly into outerspace with unreal speed after lighting the sky up. After a month n half of watching a half dozen or so I started studying the rest of the stars in the sky, after looking at one for several seconds it would move, then I'd study another, it would move, then another, then another,,,, every star in the sky is a UFO. Want proof? Set a manual telescope on the moon, it will move outta scopes site in seconds, the earth rushes thru orbit at 18.5 miles a second, now set scope on a star, any star, they will stay in site for quite awhile, this shouldnt be. They should be moving fast outta site. Now about who they are, genesis 11:1-9 explains bout tower of babel, God said, I can see when man comes together, nothin is impossible,, then God destroyed the city not the tower. They are humans, in NASAs studies they've learned that you can't develope babies without gravity. In Texas, in the 50's our govt did autopsies on pregnant aliens. They are in the skies developing their babies. They are humans that have lived up there for thousands of years, they are smarter than we are. This shouldn't surprise anyone, we have only been able to fly for around 109 years, and we can already keep people in space for years at a time. God wants them to be restored, malachi 3:5 do not deprive the aliens of justice. God never let's his people wander forever and he always reserves a remnant. Jesus said he is coming SOON, he said that 2000 years ago. Every star in the sky. They got my attention, then I awoken spiritually."],"Case Number":"41255","files":["/var/www/straped/mufon/html2text/41255.html.txt","/var/www/straped/mufon/org/41255.html"]}