{"Object Flight Path":"Unknown","divs":["Sighting DetailsI was driving up a road near my house from Centennial Golf Course and spotted two white to silver thin objects in the sky over lake Glenida in Carmel NY July 10th at 11am. Thought they were planes at first but being me and always looking up for something, I followed the road towards them. As I went up the road (bright sunny day with moon above them) I noticed they were equal in size but traveling next to each other. Then one kept on left and the other stopped then slowly hovered right then in about 1 minute back left. Then it was gone. I had pictures on my iPhone but had restored my phone since then and can't find them. When I texted my girlfriend about it there were helicopters flying loudly over my house in that direction and even circled a few times (this isn't common for where I live) she mentioned on her way to work about two hours earlier that she heard helicopters as well. I didnt think much of it again until I saw a new NAT GEO show UFO chasers. The craft in one of the episodes from 2004 was exactly what I saw. Silver and thin with no visible wings (I believe the sighting was in Colorado). Kind of like a straight line of white drawn on a blue piece of paper. I lost sight of the object almost instantly at some point. On the type of clear day with 100% visibility, and being used to seeing aircrafts all day long and at a large array of different altitudes, the fact these two object disappeared quickly was strange. I look for things constantly, and am constantly finding answers to what things were but this time was the first time I felt nearest to saying this was 100% a UFO from outside our Earth. Anyway not sure what to do with this info but better you guys have a record of it for data or something. Hudson Valley area I've heard has had a lot of sightings. I know many people who witnessed the greatly reported craft in the 80s, along with some other convincing sightings near sunken mine road up 301 near Spring Lake."],"Summary":"Carmel NY UFO thin white grey line cigar shape possible in blue sky","Log Number":"US-07302012-0006","Latitude":"41.43","Disposition":"Unresolved","trends":["There have been no other sightings in Carmel","This sighting has never been favorited."],"Date Submitted":"07/30/2012 12:53 UTC","Object Features":"Other","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"07/10/2012 11:00 UTC","Longitude":"-73.680556","Case Number":"41268","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.43,+-73.680556(41268)&iwloc=A&hl=en\"> mufon case (41268) map </A>","Object Shape":"Bullet, Missile, Cigar","City":"Carmel","Country":"United States","Region":"New York","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41268.html.txt","/var/www/straped/mufon/org/41268.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}