{"Region":"Missouri","Viewing Distance":"101-500 Feet","Date of the Event":"07/29/2012 08:15 UTC","files":["/var/www/straped/mufon/html2text/41263.html.txt","/var/www/straped/mufon/org/41263.html"],"Object Shape":"Circle","Object Features":"Dome","Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=38.950852,+-92.305787(41263)&iwloc=A&hl=en\"> mufon case (41263) map </A>","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around July 29th 2012"],"Country":"United States","Weather Factors":"Unknown","Latitude":"38.950852","Summary":"Object moving southeast, came near cloud and cloud and object faded and disappeared","Date Submitted":"07/29/2012 11:29 UTC","Case Number":"41263","Tags":"City","Disposition":"Unresolved","Longitude":"-92.305787","City":"Columbia","divs":["Sighting DetailsI was at Stephen's Lake Park taking pictures of the sunset. I was looking at the sky and I noticed the object moving southeast. The object was circular, with a dome on top and two rails on the bottom. I saw the object and it did not look like any object I was familiar with. I am prior military and I am familiar with current, known aircraft. It had 6 lights - 1 red, 1 green, 2 white and 2 yellow on the bottom. The cloud looked like a cloud but it wasn't there earlier. Part of the craft lifted up as it faded. The object was moving slowly to the southeast. It came near a \"cloud\" and both the object and cloud faded and disappeared. I ki8cked myself afterward because in my left hand I had my digital camera and I did not even think about turning it on, bringing it up and starting video of the object. Once I got home I checked what shots I had and there wasn't a cloud where I saw the object fade and disappear. I did check with the local police if anyone had reported an unknown or strange object in the sky - there were no reports."],"Sighting Duration":"Undisclosed","Log Number":"US-07292012-0027"}