{"Tags":"City","Weather Factors":"Unknown","City":"Pensacola","Case Number":"41275","Date of the Event":"09/20/2005 10:30 UTC","Log Number":"US-07302012-0011","Summary":"Large insect like object with random flashing red light at Pensacola Beach.","Object Shape":"Other","Disposition":"Unresolved","Source":"MUFON","Latitude":"30.332804","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around September 20th 2005"],"files":["/var/www/straped/mufon/html2text/41275.html.txt","/var/www/straped/mufon/org/41275.html"],"Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-87.14977","divs":["Sighting DetailsI was with my brother and we were at Pensacola beach at night, we liked going after the sun went down because the beach was less crowded and strong breezes with the cooler temps were a definite plus. We were sitting near the shore just talking and listening to the waves when I noticed some movement in the corner of my eye. I looked to the right of me to see this object that appeared to move like a moth or butterfly (Very erratic) there was a randomly blinking red light (in the center of the object) that would pulse at random intervals. We could make out what appeared to be wings (Like an insect) going at incredible speed. But there was absolutely no noise that we could hear from it. It appeared quite far away, I remember both of us rubbing our eyes, making sure that our eyes were not playing tricks on us. It was flying near a condo(about 25 stories high) the condo's distance from us(as I can only describe) was far enough away that if it were daytime, the condo would have been slightly masked by that blue haze that large objects get when far away. We were trying to figure out how large this object was, then we noticed it started flying toward this condo, and it went behind it. So I know that it must have been farther from us then the condo(that was estimated at about half a mile from us) From where we were, using our fingers it measured about two and a half inches. So, I'm sure the math can be done to determine how large this was. When it flew behind the condo, that was the last we saw of it. When it got close to the side of the condo(from our perspective) It appeared to be about as big as one of the stories, but who knows how far behind the object was from the condo. I don't claim to know what this was, I only know what both of us saw."],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=30.332804,+-87.14977(41275)&iwloc=A&hl=en\"> mufon case (41275) map </A>","Object Features":"Wings","Region":"Florida","Date Submitted":"07/30/2012 04:29 UTC","Object Flight Path":"Path with directional change,Other"}