{"Disposition":"Unresolved","Tags":"City","Region":"Connecticut","files":["/var/www/straped/mufon/html2text/41279.html.txt","/var/www/straped/mufon/org/41279.html"],"Case Number":"41279","Latitude":"41.545715","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Object Shape":"Sphere, Triangle","Date Submitted":"07/30/2012 10:10 UTC","Longitude":"-73.189603","Object Features":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-07302012-0016","Country":"United States","Summary":"hovering/glowing red craft paired with hovering white orb","divs":["sighting detailsmy roommate and his girlfriend went outside our apartment to smoke a cigarette, minutes later his girlfriend rushed dramatically upstairs insisting my girlfriend and i come outside immediately. upon looking to the north\\northwest direction in the night sky, 2 visible and unidentifable lights were present 1.) red triangular\\sphere shape hovered around unlike any identifiable aircraft i've ever seen, it made no noise and no other identified aircraft were visible at this time, beside the red craft seemed to be a white light sphere\\orb, smaller than the red craft beside it (my roommate claims that the white orb was originally the same as the red craft beside it and dimmed to a white orb before i made it outside.), it is unsure weather the sighting was one craft or two crafts attached. i took out my iphone and filmed for about 15 seconds before i realized the crafts were too far and my digital video was sub par in terms of substantial evidence, however to the naked eye this phenomena was clearly a ufo sighting. after about 10-15 minutes of speculation and astonishment the red craft flickered and dimmed until it was the same color and size of the smaller white orb, at this point it was evident the crafts were trying to conceal themselves, slowly the orbs dimmed into the horizon (this all took place within a 45 minute to an hour period) 7\\29\\12, woodbury ct"],"Source":"MUFON","City":"Woodbury","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.545715,+-73.189603(41279)&iwloc=A&hl=en\"> mufon case (41279) map </A>","trends":["There has been one other sighting in Woodbury","There were no other sightings in Woodbury on or around July 29th 2012"],"Date of the Event":"07/29/2012 09:30 UTC"}