{"Object Flight Path":"Straight-line path","Date of the Event":"07/05/2012 12:00 UTC","Object Shape":"Triangle","divs":["Sighting DetailsIt was almost midnight and my wife and I were sitting on our couch catching up, as I had been at work and school all day. My wife was sitting up, facing me, and I was lying down with my head on the couch's arm rest, looking towards my wife. Our living room window was in my line of sight as well behind her head and all of our lights were off. As we were chatting, a huge triangular craft flew over our neighborhood, with a large, bright white light under each corner facing downward and one larger red, pulsating domed light in the middle of the underbelly. It filled up half of our large window. The craft was not traveling perfectly horizontally but was at a slight angle, allowing me to see its underside. For the first fraction of a second I naturally thought airplane, but I quickly realized it wasn't a typical plane. I said, \"what's that?\" and my wife turned and saw it through our other window. We both watched it glide noiselessly into the night (all of our windows were open as we don't have AC), and were struck by its size and triangular shape. It was within view a total of about 15 seconds or so, and flying slower than an airplane. My wife is a skeptic of things like this but is adamant this was no regular airplane. We would like to know what it was."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.480063,+-122.624742(41270)&iwloc=A&hl=en\"> mufon case (41270) map </A>","Date Submitted":"07/30/2012 01:23 UTC","Viewing Distance":"501 Feet - 1 Mile","Latitude":"45.480063","Log Number":"US-07302012-0007","Disposition":"Unresolved","Summary":"Triangular craft flew silently over our neighborhood","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Case Number":"41270","Longitude":"-122.624742","Country":"United States","Region":"Oregon","City":"Portland","trends":["There have been 158 other sightings in Portland","There were 4 other sightings in Portland on or around July 5th 2012"],"Sighting Duration":"00:00:15","files":["/var/www/straped/mufon/html2text/41270.html.txt","/var/www/straped/mufon/org/41270.html"]}