{"Date Submitted":"07/30/2012 04:24 UTC","Object Shape":"Circle, Disc, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=42.346216,+-122.919112(41274)&iwloc=A&hl=en\"> mufon case (41274) map </A>","Region":"Oregon","Weather Factors":"Unknown","Latitude":"42.346216","Log Number":"US-07302012-0010","Object Features":"Unknown","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around July 29th 2012","This sighting has been favorited 1 time.",""],"Longitude":"-122.919112","Summary":"Very Bright Hovering Lights Dimmed then Decended","Country":"United States","Tags":"City","Date of the Event":"07/29/2012 11:56 UTC","Disposition":"Unresolved","Case Number":"41274","City":"Medford","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAbout 11:55pm on Sunday, July 29th I was brushing my teeth in our upstairs bathroom when I looked out the window and saw the brightest white light hovering in the sky. (I realized later that it was about 7 bright lights in a disc formation.) I yelled for my spouse because it was brighter and bigger than anything in the sky, except for the moon. We both stared it for a good 2 minutes before I grabbed the cell phone and went running outside to get a better view. My spouse stayed upstairs and called a family member who lives near by. While outside I saw the bright lights dim and slowly descend and it looked like it was slowly spinning as it flew in a strange flight path towards the ground (towards where our family member lives) and I didn't see it after that. Although I did notice that a commercial airplane in it's usual flight path flew by. While upstairs, my spouse saw a tiny replica of the bright disc formation fly off towards Jacksonville which is southwest of us. My spouse also saw the object dim it's extremely bright lights and fly down towards the ground in a very unusual northeast flight pattern. The whole time, my spouse was on the phone with the family member who lives less than 2 miles away from us. The family member and another person in their household also saw the bright lights in a disc formation descend but they couldn't figure out where it landed or if it did. We lost sight of the lights as it went down towards the houses and trees. This light or lights were brighter and bigger than any airplane or star and it was about 50-100 ft across. I thought at first it was a very bright and very big planet. Once it started moving, the lights dimmed significantly, but it was still brighter than any aircraft lights or star. We are about 10 miles away from the Rogue Valley International Airport and we see planes all the time and this was NOT within their regular flight path and it was moving too slow, it was too bright, too big, and making absolutely no noise. Someone had to have gotten this on radar. My cell phone takes horrible pictures and video but I did get both. Will probably only attach the picture. I included 2 pictures, the first is the bright lights and the 2nd is of an airplane about 10 minutes after sighting. You can tell the difference in size and brightness between the two."],"Object Flight Path":"Hovering then path","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/41274.html.txt","/var/www/straped/mufon/more/41274_submitter_file1__UFO.jpg","/var/www/straped/mufon/more/41274_submitter_file2__Airplane.jpg","/var/www/straped/mufon/org/41274.html"],"Source":"MUFON"}