{"Tags":"City","Latitude":"38.615953","Object Shape":"Star-like","Date Submitted":"07/30/2012 02:52 UTC","Sighting Duration":"00:01:00","trends":["There have been no other sightings in Huntingtown","This sighting has never been favorited."],"Summary":"Multiple and varied sightings","Date of the Event":"06/01/2012 10:00 UTC","divs":["Sighting DetailsWe live in an area of Calvert County, and have a great night view of the sky. My husband and I often go out to our deck at night after we get our children to bed. This summer, both of us have seen a lot of strange sightings in the sky above us and to our East. I'm not sure if the objects to the east of us would have been over the Chesapeake Bay or over the Eastern Shore, their distance from us was something we could not determine. They appeared to be higher then any airplane would travel. We do have an airplane flight path to the west of our house for the nearby airports, their airplanes are obvious. We have seen multiple objects through out the summer that not only just appear, but glide across the sky at what seems like the distance of the stars, however within a few seconds, they basically appear to just fade out.. Recently we were able to observe the space station fly over - using this as a comparison, they were half the size and not nearly as fast or same path. Sometimes we see the objects more then once a night, sometimes there are a few nights in between. There have been a few times that almost directly above our house, we have both seen a very bright star like shape and just as we fix our eyes on them, they burn out. I have also seen what appears to be closer then these other objects, what would be described as a sideways shooting star with a curve to it."],"Disposition":"Unresolved","Weather Factors":"Unknown","Region":"Maryland","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-76.613015","map":"<A HREF = \"http://maps.google.com/maps?q=38.615953,+-76.613015(41286)&iwloc=A&hl=en\"> mufon case (41286) map </A>","Log Number":"US-07302012-0022","Country":"United States","Object Flight Path":"Stationary,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/41286.html.txt","/var/www/straped/mufon/org/41286.html"],"Case Number":"41286","Object Features":"Unknown","City":"Huntingtown"}