{"Longitude":"-97.678058","Object Features":"Unknown","Object Shape":"Circle, Fireball, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.309249,+-97.678058(41288)&iwloc=A&hl=en\"> mufon case (41288) map </A>","City":"GAP","Disposition":"Unresolved","divs":["sighting detailsi live in gap, pa, which is on the border of lancaster county \\ chester county. last night, july 29th, 2012. i was traveling eastbound on us rte. 30. i was driving when i saw 6-7 large \"fireballs\" traveling towards me. i knew pretty quickly these were not airplanes, due to how they were grouped together and i have been in this area for 12 years and i am accustomed to the airplanes that travel in this area, commercial aircraft travel much higher than what i had observed. they were a bright burning red color, they were constant with their color and did not dim out or flash \\ blink. i pulled over on the side of the road and began filming with my iphone 4gs. the first 4 were traveling in two pairs and the others were traveling in singles behind. i drove to another location off the highway about 150 yards west of where i was positioned on the highway. this is when the objects started to align in a triangle, then they positioned themselves in a straight line 90 degrees above the ground, i have the triangle on video, however i do not have when they aligned in a straight line. they started to disappear shortly after they were in triangle formation."],"Sighting Duration":"00:15:00","Country":"United States","Object Flight Path":"Straight-line path,Path then hovering","Log Number":"US-07302012-0024","files":["/var/www/straped/mufon/html2text/41288.html.txt","/var/www/straped/mufon/org/41288.html"],"Weather Factors":"Unknown","Latitude":"41.309249","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"07/30/2012 03:47 UTC","Region":"Pennsylvania","Date of the Event":"07/29/2012 09:30 UTC","Summary":"Red-like fireballs unusual objects changing alignment many times in sky.","trends":["There have been no other sightings in GAP","This sighting has never been favorited."],"Source":"MUFON","Case Number":"41288","Tags":"City"}