{"Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.296288,+-88.404223(41289)&iwloc=A&hl=en\"> mufon case (41289) map </A>","Date of the Event":"07/13/2012 10:15 UTC","Viewing Distance":"101-500 Feet","Longitude":"-88.404223","files":["/var/www/straped/mufon/html2text/41289.html.txt","/var/www/straped/mufon/org/41289.html"],"City":"Hartford","Country":"United States","divs":["Sighting DetailsOn July 13, 2012 my 30 yr. old Daughter was leaving my home with my grandson around 10:15 pm. I was in the driveway talking to her standing by her van when she looked passed me and noticed a bright light up in the sky yelling \"Mom what is that\"? I was standing too close to the garage that I couldn't see anything right away. She was freaking out and told me to go to the corner of the garage which is a few steps away to see in the back yard. I had yelled back to her \"I SEE IT, I SEE IT\"! We both went to the side of the garage to watch this HUGE object covered with lights. It was very low to the ground just above the trees in the back of our yard. When my daughter saw it before I had she said it was hovering over our back yard and covered the sky. So Huge never saw anything like this before ever! By the few seconds that it took me to get to the side of the garage it had already moved at high speed to travel so we had watched it from the yard heading east in the sky. Still very HUGE in the sky. It NEVER made a Sound!!! Lower set of lights were red flashing and the other lights were white. Shaped like a lamp shade or cone with out the peak. We watched it till we couldn't see it anymore. This all happened probably like 20 seconds. Believe me every emotion that can hit the human body will happen when you experience this. My heart was pounding, I was shaking and and wanted to cry. Same for my daughter. All we could say over and over as we watched it was what is it but We both knew what we saw but who would believe us. We were so scared. She went home to tell her husband and I ran in the house to get my husband but of course by then it was gone. I will forever be looking in the sky."],"Object Shape":"Cone, Circle","Case Number":"41289","Region":"Wisconsin","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Hartford","There were no other sightings in Hartford on or around July 13th 2012"],"Date Submitted":"07/30/2012 05:13 UTC","Log Number":"US-07302012-0025","Object Features":"Unknown","Latitude":"43.296288","Summary":"Huge object with bottom red lights and as white lights went up on it became less lights to shape like a cone with out the peak. Amost shape of a lamp shade.","Object Flight Path":"Hovering then path"}