{"Object Features":"Unknown","Case Number":"41280","Log Number":"US-07302012-0016","files":["/var/www/straped/mufon/html2text/41280.html.txt","/var/www/straped/mufon/org/41280.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"07/30/2012 12:14 UTC","Latitude":"41.397075","Source":"MUFON","Summary":"Viewed three \"fireballs\" in triangular formation","divs":["Sighting DetailsI was driving home with my son on Saturday night, July 28th. We came to a stop sign at approximately 9:15 pm, when a very bright white object caught my attention in the sky. There had been storms in the area, and a dark cloud behind the object made it stand out. I quickly asked my son if he saw this object, which he acknowledged he did. There were no other vehicles on the road, so we stayed stopped at the intersection and observed the object for a moment. I had never seen anything like this before in person, and reached for my iphone to begin filming. When I fixed the screen into the sky, we noticed a second object appear to the left. It was also white in color. Not a moment later, a much brighter and somewhat larger red object appeared to the right. All of the objects can best be described as fireballs. My son quickly pointed out that they were in a triangular formation. They stayed in that formation for a very short period of time, while they began to slowly change color from red, orange, and white. The object on the lower left of the triangle began to disappear, almost as if it was a burning out fire. At this point we pulled over to the side of the road, and got out of our vehicle to continue viewing the objects. The two remaining objects continued to change color, and their brightness would vary. At times, they were very brilliant. They slowly moved closer, while also changing elevations. Once they were at what appeared to be the same elevation, the object to left seemed to disappear in similar fashion to the first. I wanted to view the object without looking through the iphone screen, so turned the video off at this point. A few seconds later, the final object also simply disappeared. We drove up the road in the direction of the objects, trying to see if we could locate them again. We did not have any luck, they had just vanished. In general, these fireballs were much brighter than any star, satellite, or space station. They were also roughly 5 times greater in size than a star. No sound was audible at any point. I am 39 years old, and my son who was with me is 11."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.397075,+-79.704043(41280)&iwloc=A&hl=en\"> mufon case (41280) map </A>","Disposition":"Unresolved","Region":"Pennsylvania","Viewing Distance":"Unknown","trends":["There have been no other sightings in Seneca","This sighting has never been favorited."],"Date of the Event":"07/28/2012 09:15 UTC","Tags":"City","Object Shape":"Fireball","Country":"United States","City":"Seneca","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Longitude":"-79.704043"}