{"trends":["There have been 76 other sightings in Calgary","There were 2 other sightings in Calgary on or around July 22nd 2012"],"Longitude":"-114.111199","Tags":"City","City":"Calgary","Object Shape":"Sphere","Disposition":"Unresolved","divs":["Sighting Detailswe had just arrived home from a trip to BC.. my wife and I tucked our children into bed then went to relax where my wife caught some fresh air on the balcony. she called me to come have a look at some things to see in the sky I came and when I looked up observered four small lights flying in a distict and static formation.directly behind the objects a little lower was an airplane flying with its lights distinctivly blinking. The objects travelled very slowly from east to west maintaining formation.just before the lights crossed behing my line of sight obstructed by our condo buildi.ng the rear object disappeared.i then ran downstairs as we live on the third floor facing east and observed the other three objectsalso disappelightar one at a time...i called my wife to inform her what i seen as she was still on the balcony she said one had reappeared near where the lights were first observed..i then ran around to the east side of the condo and observed a single light for a brief second before it was gone again..i proceeded to walk three blocks into a darker area hoping to catch another glimpse but to no avail however i did walk past another guy on his phone i heard him mention ufo...i began to talk to him he was talking to his brother on the phone he said he had seen the one object seen reappearing by my wife...he said he was alerted to the light by a group of teens in the ajecant fieldi showed him the brief video i managed to take on my phone of the four object and the two of us then walked for some time hoping to see it again..his name is mikka and lives in my building ...i believe what we all observed was very unussual as i spent alot of time in the evenings on my balcony and have never seen anything of the sort."],"Case Number":"41294","Source":"MUFON","Weather Factors":"Unknown","Region":"Alberta","Object Flight Path":"Straight-line path","Latitude":"50.898376","files":["/var/www/straped/mufon/html2text/41294.html.txt","/var/www/straped/mufon/org/41294.html"],"Country":"Canada","Viewing Distance":"Over One Mile","Date Submitted":"07/30/2012 08:14 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=50.898376,+-114.111199(41294)&iwloc=A&hl=en\"> mufon case (41294) map </A>","Summary":"observed 4 lights flying slow and low in a static formation ..one disappeared before leaving sight...went to new location to view and the others dissapeared aswell. then began to reappear where they started.","Object Features":"Undisclosed","Log Number":"CA-07302012-0030","Date of the Event":"07/22/2012 10:15 UTC","Sighting Duration":"Undisclosed"}