{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/41296.html.txt","/var/www/straped/mufon/org/41296.html"],"Disposition":"Unresolved","Country":"United States","City":"Lake St Louis","trends":["There have been 3 other sightings in Lake St Louis","There were no other sightings in Lake St Louis on or around July 27th 2012"],"Log Number":"US-07302012-0032","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.789816,+-90.772251(41296)&iwloc=A&hl=en\"> mufon case (41296) map </A>","Longitude":"-90.772251","Weather Factors":"Unknown","Object Flight Path":"Stationary","Object Shape":"Other","Summary":"Clear starry night, large bright light in northeast part of sky, peanut shaped, and remained stationery hovering in same spot . Still there after 30 mins.","Region":"Missouri","divs":["Sighting DetailsIt was around 9:30 pm and my husband and I let our dogs out to use the bathroom. It was a beautiful starry night with no clouds. We were admiring the stars when we saw something that looked out of place: A very bright peanut shaped light in the northeast part of the sky. It was the only place in the sky that had no stars in it, just dark backdrop and this very bright, odd shaped light. When we first saw it we looked at each other and said, \"What's that?\" We knew it wasn't a star. And we knew it wasn't a satellite. The more we looked at it, the more we were certain we were looking at something that was a UFO, either of secret high technology of this world, or something of the supernatual world. It didn't move at all during the whole time, just shone very brightly. When checking back 30 mins. later, it hadn't moved. That night we did some research and found out that the same description of this object was seen by someone else on 24th of July in Columbia, Mo, and on 28th of July in Bean Station, TN. That was confirmation to us that this thing was real."],"Date Submitted":"07/30/2012 09:10 UTC","Viewing Distance":"Over One Mile","Latitude":"38.789816","Case Number":"41296","Date of the Event":"07/27/2012 09:30 UTC"}