{"Case Number":"41290","Object Features":"Unknown","Region":"Florida","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unresolved","Summary":"Two circular orb-like flying objects with red and orange pulsating lights seen on the Fourth of July","trends":[],"files":["/var/www/straped/mufon/html2text/41290.html.txt","/var/www/straped/mufon/org/41290.html"],"Date Submitted":"07/30/2012 06:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.672447,+-81.514314(41290)&iwloc=A&hl=en\"> mufon case (41290) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Latitude":"27.672447","divs":["Sighting DetailsOn the night of July 4, 2012 at around 10pm my 8 yr old daughter and I went outside our place of residence getting ready to do some pop its(things that pop when you throw them on the ground)in the parking lot of our building of residence. We also were going to watch fireworks going on around us. About 2 minutes of walking outside i noticed 2 objects in the distance flying side by side so i did a double take because it seemed strange to me. They both had lights that were pulsating red and then orange very, very fast. This kinda struck me as odd seeing that most airplanes and helicopters don't fly side by side like that, but regardless of that at first I thought it was either planes or helicopters that had lights pulsating for Fourth of July to be entertaining, but as it got closer i realized it was impossible for it to be planes or helicopters. First of all because it had no sounds and secondly the lights were pulsating way to fast. So, I immediately after this point ran inside to get my husband to show him. He came out and all three of us just stood there watching it in amazement, but still freaking out a little bit because we didn't know what it was. After my husband had come out it was flying pretty low, but not low enough to really see any structural visuals accept the pulsating lights of red and orange. They both were flying level with each other and were circular in shape almost orb-like. About 1 minute after flying over us it started to fly higher and higher and one of them started to change speeds and then turned and went in another direction toward the clouds and disappeared. After the first one left I looked to the right of where we were standing, and saw a plane up in the sky in the distance. I then compared the two and the plane and they were apparently different. The other one kept flying straight then started going different speeds,turning different directions. Around this time a firework went off up and to the right of where we were standing and when this occurred the object stopped toward the direction the fireworks were going off. It was the strangest thing, and as soon as the fireworks were over a few seconds later it turned around slowly and went toward the same direction as the other one did and went fast and disappeared just like the first one had. It was such an amazing sight we have never seen or experienced before. Totally baffled us that night. I was literally shaking a bit afterwards because it was just such a shock to me, well to both of us. You go out expecting to see fireworks and stuff and you end up seeing something like that. It was just crazy. We wished we would have video of it to have proof but we didn't think about it at the time. It was pretty cool to watch though."],"Longitude":"-81.514314","Object Shape":"Circle, Sphere","Tags":"City","Date of the Event":"07/04/2012 12:00 UTC","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Log Number":"US-07302012-0026","City":"Undisclosed"}