{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.098059,+-121.280212(41299)&iwloc=A&hl=en\"> mufon case (41299) map </A>","divs":["Sighting DetailsI was with my best friend laying down in his back yard on a blanket. We were both in our sleeping bags reclining and stargazing. As I was pointing out a nebula of stars, a massive dark (pitch black) oval-shaped object, approached slowly and silently from behind and hovered above us totally obliterating all the stars overhead from view. I had no idea what the object could have been at the time. I just knew that it was enormous. We observed the object in position for approximately eighteen to twenty minutes. During that time it did not move or make a sound. Then a loud noise behind us startled us. It was a thirty foot tall pine tree bent over literally in half. Needles were falling and the tree was shaking. Then suddenly the upper portion flew back up in position. There was rustling and movement that made it appear that someone or something was in the tree. We saw the silhouette of a large head and neck tipped up from amid the branches in the direction of the object overhead. Suddenly the head turned and stretched towards us menacingly. There was no light with which to see facial details. We left the backyard at this time. We tried to watch the television for local news details, but it was inoperable. We attempted to listen to the radio, it was also inoperable. There was no one else in the house that evening. We literally hid under the bed for an additional twenty minutes or so. During this time we didn't hear anything unusual or out of the ordinary, or see any flashing lights. We then went to the window which overlooks the backyard and we could once again see the stars overhead. There was no evidence of anything having happened other than the piles of pine needles left behind which appeared to have come from the interior branches of the tree. There were no marks left on the tree that could be visually seen. Two years later the tree still had no new pine needles on those branches and no new vertical growth of the tree. We managed to sleep, though I have no memory of falling asleep. The morning following the event I awoke with a healed scar on my abdomen, lower left quadrant. It was not from any previous surgical procedure or injury. It did not hurt then, and it does not hurt now. That side of my abdomen feels slightly \"heavier\" than on the other side, as if there were more \"mass.\" I believe that we observed an unnatural phenomenon and that I may have been experimented on."],"City":"Bend","Object Shape":"Blimp, Oval","Summary":"I was stargazing with a friend in his backyard when an enormous dark object approached and hovered overhead totally obliterating the stars from view.","Latitude":"44.098059","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Path then hovering","Case Number":"41299","Tags":"City","Date of the Event":"08/04/2008 01:10 UTC","Longitude":"-121.280212","trends":["There have been 20 other sightings in Bend","There were no other sightings in Bend on or around August 4th 2008"],"Region":"Oregon","Date Submitted":"07/30/2012 10:42 UTC","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07302012-0034","files":["/var/www/straped/mufon/html2text/41299.html.txt","/var/www/straped/mufon/org/41299.html"]}