{"Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Waukegan","There were no other sightings in Waukegan on or around November 5th 2011"],"City":"Waukegan","Country":"United States","Longitude":"-87.846926","Object Shape":"Sphere","Object Flight Path":"Stationary,Straight-line path","Log Number":"US-07312012-0001","Summary":"Hovered at one place beaming a light at building then a straight path to another location and beamed at person and through the person.","Latitude":"42.364997","files":["/var/www/straped/mufon/html2text/41302.html.txt","/var/www/straped/mufon/org/41302.html"],"divs":["Sighting DetailsI was inside my apartment meditating with marujuana, then felt a need to be outside. As i step through the door-frame i noticed in my right-side peripheral vision of odd lights flickering, as if i took witness to a neighbor's building going-up in flames; but to my relief i was wrong. What i began see'ing was a UFO, a classic disc. This object had a lot of various colors moving about its exterior structure. It was at or near the top-floor(third-level) window, 15 feet away. It beamed a light into it, or at it, within its beams was a silhouette of a child-size thing in a horizontal position going toward the building structure, level to the top-floor. This took only a 35 seconds. At a second in time, it was in-front of me. between the \"c\" shaped structure of the residence. Its a two floor building. It space-craft hovered there for less than a second and began beaming its light into me and possibly the apartment exterior wall into a transparency of that wall, because i was worried that maybe a creature might have beamed down behind me. Not sure what was going on, but i felt warmth from the light. The light had a purplish-green, and goldish-yellow colors swirling about me and the wall. There was no communication between the object and i. Nearly three minutes it hovered in front of me than it lit-brightly and in a flash took off in a northern curve like direction toward Lake Michigan, but to where, i don't know. There was noting left as evidence on the ground or the building structures. No sound what so ever during the whole time."],"Region":"Illinois","Source":"MUFON","Date of the Event":"11/05/2011 02:10 UTC","Viewing Distance":"20 Feet or Less","Date Submitted":"07/31/2012 09:18 UTC","Object Features":"Patterned Surface","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.364997,+-87.846926(41302)&iwloc=A&hl=en\"> mufon case (41302) map </A>","Weather Factors":"Unknown","Case Number":"41302"}