{"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","divs":["sighting detailsdate: 7-29-2012 time: 9:55 pm - 10 pm location: portland, oregon zip code 97202 just arrived at cleveland high school track & field myself & 2 other witnesses. vantage: just n. of bleachers at field. observation: lights\\orbs\\fireballs direction s.e towards powell blvd estimate 2~ miles distance, they were mostly white slightly yellow, total of 10 to 12 light orbs moving slowly, & chaotically in all directions; all moving independent of each-other; some appeared stationary. they eventually faded out then in, and finally, gradually all faded out. the observed sighting was 5 minutes in length. by 10:00 pm they were gone. no way in hell were any of these airplanes! after the first minute they were forming a rough circle, which about 20 seconds later then resembled more of a pentagon, and there appeared to be only 5, or 6 of them in this pentagon formation. direction of lights: s.e. estimated height: 2,000 - 3,000 ft there was a tall coniferous tree approx. 1 street south of powell -- from my vantage point at the field. the orbs were directly above tree, by about 1\\3 of the tree's height."],"Country":"United States","Sighting Duration":"00:05:00","Date Submitted":"07/30/2012 11:56 UTC","Tags":"City","Log Number":"US-07302012-0036","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.498243,+-122.633551(41301)&iwloc=A&hl=en\"> mufon case (41301) map </A>","Disposition":"Unresolved","Case Number":"41301","Weather Factors":"Unknown","City":"Portland","Object Features":"Unknown","Summary":"TEN WHITE/YELLOW FIRE BALL ORBS HOVERING OVER S.E. PORTLAND","files":["/var/www/straped/mufon/html2text/41301.html.txt","/var/www/straped/mufon/org/41301.html"],"trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around July 29th 2012"],"Date of the Event":"07/29/2012 09:55 UTC","Viewing Distance":"Over One Mile","Longitude":"-122.633551","Object Shape":"Fireball","Latitude":"45.498243","Region":"Oregon"}