{"Case Number":"41300","Date Submitted":"07/30/2012 11:52 UTC","Latitude":"44.318954","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Longitude":"-85.597444","Source":"MUFON","trends":[],"Date of the Event":"07/30/2012 08:20 UTC","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=44.318954,+-85.597444(41300)&iwloc=A&hl=en\"> mufon case (41300) map </A>","Summary":"Shining disc hovering over Pontiac MI","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","City":"Undisclosed","Object Flight Path":"Hovering then path","divs":["Sighting Details Today I went out in the evening about 8:20 to let out the dog, I stepped out the front door with my binoculars to take a look at the sky. In the southeastern sky at about 80 degrees I noticed a bright white shining metallic disc about the size of an aspirin. It was very high up and from my perspective I would guess about 6-10,000 ft, much higher than I have ever seen a helicopter for sure. It was hovering with just a thin layer of haze under it. I did not see it at first with the naked eye but after spotting with my binoculars I could make it out faintly with just my eyes,It was still disc shaped once I was able to see it. I continued to watch it through my binoculars for another 15-20 seconds,I had the impression of somewhat of a donut shape with the center of the disc being somewhat different from the shinier edges and somewhat darker in appearance in the center. It suddenly shot to the left out of my binocular view with incredible speed. There was a bright reflective flash as it darted away. The craft was extremely bright from reflection and was much brighter on the western (sun) facing side of the object. It did not appear to have any glowing lights on it. The entire sighting lasted less than two minutes and I get the distinct impression that this thing knew I was watching it. The experience left me with a very eerie sensation, I have been creeped out since. Strangely enough as soon as the disc left the haziness in that area of the sky seemed to evaporate as well. I scanned the sky further for the next 15 minutes or so and was unable to locate anything out of the ordinary. Because of the distance the object was up in the sky its very hard for me to say exactly how large this object was, other than it was very high up."],"Log Number":"US-07302012-0035","files":["/var/www/straped/mufon/html2text/41300.html.txt","/var/www/straped/mufon/org/41300.html"],"Disposition":"Unresolved","Region":"Michigan"}