{"map":"<A HREF = \"http://maps.google.com/maps?q=40.23331,+-81.841069(41311)&iwloc=A&hl=en\"> mufon case (41311) map </A>","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"Appeared to be a small moon with craters some emitted smoke","divs":["Sighting DetailsThis has been with me since I was 7 years old. I never told anyone. It was early morning the sky was just becoming light. I was in my parents bed and something made me wake up and look out their window. It must have been around 5:30am. I saw what I thought was a small moon. I rubbed my eyes and thought this can't be. Very clearly I could also see craters on the surface and a few mini volcano like structures with smoke occasionally puffing out the tops. It was right over the street at the end of our block. It was hoovering maybe 40 feet higher than the highest trees. It also looked orange on the side facing my view as the sun was hitting it from the east and my view was looking west. It suddenly began moving forward as if it realized I had seen it. It move slowly forward and exactly following the street below. As it passed my view I leaned my face against the window to follow it as far as I could. I ran out to the living room window which faced east and could faintly see the dark silhouette as it quickly ascended into the eastern sky. Has anyone ever reported the same type of object? If it's rare I thought at least I could add another sighting which might help validate the same type object. This was so long ago and I can remember as if it happened this morning. At this age I didn't have any idea what it could be so I wasn't sure if it was this was something normal or not. Thank you and best regards Donald Hamilton"],"trends":["There have been 2 other sightings in Coshocton","There were no other sightings in Coshocton on or around August 15th 1967"],"Source":"MUFON","Case Number":"41311","Object Features":"Other","City":"Coshocton","Date Submitted":"07/31/2012 07:24 UTC","Region":"Ohio","Date of the Event":"08/15/1967 05:30 UTC","Object Shape":"Sphere","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","Log Number":"US-07312012-0010","files":["/var/www/straped/mufon/html2text/41311.html.txt","/var/www/straped/mufon/org/41311.html"],"Latitude":"40.23331","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-81.841069"}