{"Case Number":"41312","Weather Factors":"Unknown","City":"Sodus Point","map":"<A HREF = \"http://maps.google.com/maps?q=43.271598,+-77.015678(41312)&iwloc=A&hl=en\"> mufon case (41312) map </A>","trends":["There have been no other sightings in Sodus Point","This sighting has never been favorited."],"Summary":"I was at a campfire and a light in the sky got brighter and it made me look up, then I saw 2 lights in a line moving with each other.","Viewing Distance":"Unknown","Log Number":"US-07312012-0011","files":["/var/www/straped/mufon/html2text/41312.html.txt","/var/www/straped/mufon/org/41312.html"],"Date Submitted":"07/31/2012 07:51 UTC","Object Features":"None","Date of the Event":"07/21/2012 10:30 UTC","Region":"New York","Country":"United States","Object Shape":"Unknown","Latitude":"43.271598","Longitude":"-77.015678","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsWe were at our summer home at Sodus Point, NY for the weekend. Between 10 & 11 PM on Saturday evening July 21st, 2012.there was some really strange clouds a few minutes before and then all of a sudden the wind stopped and there were no animals or birds making any sounds. It just got very still. I was sitting at my campfire looking at the fire and a light got really bright in the sky, that's why I looked up. I thought it was a shooting star. There were 2 lights, but only one got bright like it was accelerating to keep traveling at the same speed or balancing itself out, you could have drawn a straight line from light to light. I got my husband out of the camper and he first only saw the one light and said\" It's a satellite\". I said, \"what about that light above it?, I don't think they travel in pairs\". the lights weren't on top of each other, but you could tell they were together. The lights traveled NW instead of traveling east like most of the satellites we see up there, they go a bit faster as well. We couldn't see any object, but it could have been there. It seemed to be blocking stars between the 2 lights as it was moving by. once the 2 lights passed, the wind started up again. I felt like I was seeing things, but then I realized it was exactly what I was seeing. My husband didn't believe it at first, until he watched it. It went away, over trees and disappeared, it didn't go over Lake Ontario in our line of sight."],"Tags":"City","Disposition":"Unresolved"}