{"Region":"Oregon","Object Shape":"Sphere","Viewing Distance":"Unknown","Country":"United States","City":"Portland","Object Features":"Unknown","Case Number":"41319","files":["/var/www/straped/mufon/html2text/41319.html.txt","/var/www/straped/mufon/org/41319.html"],"Log Number":"US-08012012-0004","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date of the Event":"07/31/2012 10:10 UTC","Weather Factors":"Unknown","Summary":"Red pulsing light ascends high into the sky and then flickered out","Sighting Duration":"00:01:30","map":"<A HREF = \"http://maps.google.com/maps?q=45.525422,+-122.668747(41319)&iwloc=A&hl=en\"> mufon case (41319) map </A>","Tags":"City","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around July 31st 2012"],"Source":"MUFON","Latitude":"45.525422","Date Submitted":"08/01/2012 01:40 UTC","divs":["Sighting DetailsWhile facing north in Sunnyside Portland (right by Reed College), I saw a gently pulsing red light ascend from behind the tops of some buildings; the building tops were an estimated 15 degrees above the horizon from where I was viewing it. The pulsing was not as intense as you would find with a normal aircraft's navigational lights (the light just got dimmer, never went all the way out). The frequency of the pulsing intensity of the light was not quite consistent (like you would see with airplane nav lights)--nor were there any accompanying green lights. The light continued to ascend and appeared to be coming closer as it did so (tho this could be an illusion caused by the curvature of the earth I suppose). As it ascended it decelerated to what appeared to be a short hover for 2-3 seconds and then it continue to ascend at an even faster rate. At about 80% of the way into the sighting, the lights began to flash much more quickly and erratically, and when it reached about 75 degrees from the horizon, it just flickered out. Nothing too impressive, but certainly not your everyday aircraft. Anyone else see this? I wanted to run in the house and grab my phone to take some video, but the quality would have been so terrible it didn't seem worth the risk of missing the rest of the sighting. (Plus, do we really need any more pixelated videos of unidentified lights in the sky?... hopefully someone with a quality video camera and a better viewing position got some footage)."],"Longitude":"-122.668747","Disposition":"Unresolved"}