{"map":"<A HREF = \"http://maps.google.com/maps?q=46.154619,+-67.57663(41315)&iwloc=A&hl=en\"> mufon case (41315) map </A>","Viewing Distance":"101-500 Feet","Latitude":"46.154619","Object Shape":"Sphere","Tags":"City","Object Flight Path":"Straight-line path","Summary":"2 orb like objects about 3 mins apart flying a straight line, then the light turned off, but the objects keep moving","Country":"Canada","Date Submitted":"07/31/2012 09:58 UTC","divs":["Sighting DetailsWe were out walking the dog and looked up to look at the stars and seen a yellow orange orb like object.It was moving too slow and was too big for a shooting star so we kept watching. The orb did not leave a light trail behind it, nor did it make any sound. It moved in a straight line northward, went through some clouds and then went dark, but kept moving in the same direction as a black dot across the sky. It's light lasted about 5 seconds from when we noticed it until it darkened. once the object was completely out of sight we kept our eyes to the sky. A second one appeared roughly in the same area the first one had. it was traveling parallel to the first one a little off to the right. it also went dark as it went through a cloud and kept traveling a straight line just as the other one had. Two older gentlemen had overheard us while we were watching the first one go across the sky and also witnessed this event. We asked them on the way back by to make sure it wasn't only us who had seen it."],"Sighting Duration":"00:06:00","Disposition":"Unresolved","Region":"New Brunswick","Object Features":"Unknown","Log Number":"CA-07312012-0014","City":"Woodstock","Weather Factors":"Unknown","Case Number":"41315","Longitude":"-67.57663","trends":["There have been 4 other sightings in Woodstock","There were no other sightings in Woodstock on or around July 30th 2012"],"Source":"MUFON","Date of the Event":"07/30/2012 09:30 UTC","files":["/var/www/straped/mufon/html2text/41315.html.txt","/var/www/straped/mufon/org/41315.html"]}