{"Date of the Event":"07/30/2012 09:25 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Case Number":"41310","Viewing Distance":"101-500 Feet","Region":"Missouri","divs":["sighting detailsas called in to asd by phone: (witness wishes to remain anonymous) i am the pilot of a regularly scheduled commercial aircraft flight from st. louis to kansas city and was on approach to kci when my co-pilot said he saw an unidentified object to the right of the aircraft that appeared to be following us. it was not yet in my range of view, so i asked him to confirm that and the object remained. i radioed the tower and asked for radar confirmation but there was none. then the object came into my view to the right front of the aircraft. at that point we were approximately 35 minutes out from the airport. the object was a silver\\gray color and had three blue\\white lights on the bottom and one on the top. it was a disc-shaped craft with a low dome on top. it was approximately 300 feet from our aircraft and nne of our position. then the object suddenly moved underneath us and to the left, and continued at the our same rate of speed. i discussed this with my co-pilot and we decided not to tell the tower what we saw because of what happens when reports like this are made. the tower then asked us to confirm an unidentified object and i said it was no longer in view. i was concerned, however, that it might be a problem. the object stayed with us for approximately 22 minutes. when i decreased aircraft speed for approach, the object slowed as well, then went directly south of our position at a very high rate of speed - faster than any aircraft i've ever seen. i was a military pilot for 14 years and know what type of aircraft we have. it was definitely not a man-made aircraft. some pilots have lost their jobs when they report a ufo, and i would like to keep mine so am not providing my name or contact information. some of the passengers were discussing this as they left the plane but we did not discuss it with them. other crew members saw it as well, but did not report it. i just wanted to tell someone about it. note: phone number is for asd since witness would not provide a number"],"Weather Factors":"Unknown","Latitude":"39.297546","Longitude":"-94.716064","Log Number":"US-07312012-0009","files":["/var/www/straped/mufon/html2text/41310.html.txt","/var/www/straped/mufon/org/41310.html"],"trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around July 30th 2012"],"Object Features":"Dome","Country":"United States","City":"Kansas City","Date Submitted":"07/31/2012 07:13 UTC","Object Shape":"Disc","Summary":"Commercial Pilot saw UFO on approach to KCI airport","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.297546,+-94.716064(41310)&iwloc=A&hl=en\"> mufon case (41310) map </A>","Disposition":"Unresolved"}