{"files":["/var/www/straped/mufon/html2text/41336.html.txt","/var/www/straped/mufon/mufon_json/41336.json","/var/www/straped/mufon/org/41336.html"],"trends":["There have been 5 other sightings in Walla Walla","There were no other sightings in Walla Walla on or around July 31st 2012"],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Longitude":"-118.325193","City":"Walla Walla","Source":"MUFON","Object Features":"None","Date of the Event":"07/31/2012 12:00 UTC","divs":["Sighting DetailsI live in a rural town in SE Washington. I was looking up at the sky and noticed what I thought was a meteror, but quickly dismissed that because the object was very low and approaching me in an almost downward swoop, coming parallel to the ground. It appeared from the South in such a way I felt like it had come in at a very fast speed or just materialized or \"ripped through\", by the way that the light or glow looked initially. It seemed to be very low, at a height just above the top of the pine in my yard. It slowed considerably as it approached. I had time to stand up, collect my thoughts, and follow it visulally as it came in over the top of he neighbors house and above my yard. This was my first sighting and I have always been on the fence, not believing or disbelieving. It was not very large, it was completely silent, and my first thought about it's shape was soft Nerf Boomerang. It was orange and dull, with a slightly yellow orange dull aura; it was not bright. No lights, no discernible outer features. I feel like it was flying with the apex of the boomerang arms to the rear. The most odd thing was my reaction to the event. I felt like it slowed down for me, that it wanted me to see. Psychologically I became very calm and felt at peace, with a sense of joy. Time seemed to slow very slightly as this was happening, and I became emotional and started crying. I wanted it to pass over again so that I could be sure I wasn't crazy. I always thought I would be terrified if I ever saw one so my response was quite shocking to me. I really don't know what to think about this event."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.083599,+-118.325193(41336)&iwloc=A&hl=en\"> mufon case (41336) map </A>","Summary":"As I was watching for falling stars I witnessed a boomerang shaped object fly over my yard.","Object Shape":"Boomerang","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Path with directional change","Region":"Washington","Case Number":"41336","Latitude":"46.083599","Date Submitted":"08/01/2012 04:42 UTC","Country":"United States","Log Number":"US-08012012-0017","Sighting Duration":"Undisclosed"}