{"Region":"Michigan","Weather Factors":"Unknown","divs":["sighting detailsmy friend and i were returning from from a day with friends in mio, heading west on m72 just outside of grayling. the time was approximately 11pm edt. it was a perfectly calm, moonlit night, with a nearly 3\\4 full moon just risen and to our immediate southeast. as we passed the north shoreline of lake margrethe, we both noticed, above the trees, three objects hovering motionless in the air, approximately 2000ft from the road (over eagle point), and approximately 500-1000ft above the shoreline of that area. the objects were stationary; they did not move during our observation. they were not aligned; ie the northernmost object was approximately 500ft high; the centre object approximately 800ft high, and the southernmost object approximately 1000ft high. they were arranged in a straight line running north-south, directly over the shoreline of eagle point. the objects appeared to be shaped like a \"fat\" cigar, or an elongated egg, they were a dark colour, and i did not observe any markings, windows or patterns. the top and sides of each object glowed\\emitted a soft, yet bright orange light. the light did not flicker or pulsate, but remained steady. neither my friend nor i observed any wings, or rotor-blades; the objects remained perfectly motionless during the entire sighting. we both realised that we had seen something quite unusual, and that we should report it to someone. the surface of the water was completely calm, like a mirror, reflecting the lights perfectly. we did not stop or slow down; there were other cars on the road. the lights remained in the sky motionless and we continued past, heading west on m72 and on our way home."],"Latitude":"44.649853","map":"<A HREF = \"http://maps.google.com/maps?q=44.649853,+-84.786381(41330)&iwloc=A&hl=en\"> mufon case (41330) map </A>","City":"Grayling","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08012012-0011","Summary":"Three craft with bright orarnge lights, hovering over Eagle Point on Lake Margrethe","Date Submitted":"08/01/2012 10:13 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/41330.html.txt","/var/www/straped/mufon/mufon_json/41330.json","/var/www/straped/mufon/org/41330.html"],"Source":"MUFON","Longitude":"-84.786381","Disposition":"Unresolved","Case Number":"41330","trends":["There have been 3 other sightings in Grayling","There were no other sightings in Grayling on or around July 28th 2012"],"Sighting Duration":"Undisclosed","Date of the Event":"07/28/2012 12:00 UTC","Object Features":"Undisclosed","Object Shape":"Blimp, Cigar, Cylinder, Egg, Other","Tags":"City"}