{"Latitude":"37.309433","Date Submitted":"08/01/2012 02:56 UTC","divs":["Sighting DetailsI was outside watering the yard at dusk, about 830 pm and saw the moon through the tree and thought it would make a great picture so i grabbed my phone and went to take a shot. When I looked at the picture there was a round light, pretty good sized right next to the moon. It was a glowing orb and then i noticed that i couldn't see it with the naked eye, only on the phone camera. I called my husband out to bring the camera and the night vision binoculars so i can get a better picture and a closer look and make sure i wasn't just seeing things. We took pictures and videos with the camera but that didn't show anything there even with different settings. The orb was still there through the night vision binoculars and my phone camera. It made no noise, it didn't move or pulse. It was just hanging there by the moon glowing. It was about the size of an asprin or a little larger if i held it at arms length. I went back out at 430 am the next morning after dropping my husband at work and took some more pictures, It was still the same as earlier. It seemed to follow the moon perfectly at the same distance.I also checked my google sky map and there was nothing listed there and that program is through gps in realtime. I honestly believe that it was a ufo of some kind. I have never seen anything like it before and im always watching the sky and taking pictures of the moon. It was still there at 430 am but after that i stopped watching but you can be sure i'll be out there tonight to check for it again."],"Country":"United States","Case Number":"41334","Log Number":"US-08012012-0016","Viewing Distance":"Over 1 Mile, Unknown","City":"Merced","map":"<A HREF = \"http://maps.google.com/maps?q=37.309433,+-120.478498(41334)&iwloc=A&hl=en\"> mufon case (41334) map </A>","Region":"California","trends":["There have been 10 other sightings in Merced","There were no other sightings in Merced on or around July 31st 2012"],"Object Flight Path":"Stationary","Object Shape":"Circle, Sphere","Date of the Event":"07/31/2012 09:00 UTC","files":["/var/www/straped/mufon/html2text/41334.html.txt","/var/www/straped/mufon/mufon_json/41334.json","/var/www/straped/mufon/org/41334.html"],"Object Features":"None","Weather Factors":"Unknown","Summary":"Went to get a picture of the moon and seen a light that only showed in camera.","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Longitude":"-120.478498","Sighting Duration":"Undisclosed"}