{"Weather Factors":"Unknown","Date Submitted":"08/01/2012 07:09 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI saw an object that was glowing from a light inside it that was about 4' tall and 3' in diam. move toward our house at about 100 feet high. I saw it about 300 yards from house at first and about it took about 1.5 min. for it to move over our house and then I lost site of it in the trees. I dismissed it first as someone that left something like a white trash bag go with some kind of light inside as a prank or just for kicks. I wouldn't have even considered reporting it but since the event my health has gone down hill and nothing has changed to cause it. This object also was on a direct path traveling 90 degrees from a lite breeze. This didn't make sense to me as it should have followed the same direction as the wind that nite. I had one other sighting in my life and that was 37 yrs. ago and now another one. has anyone seen this object on the nite that I mentioned? These are events that I deeply regret ever happened. I cannot go outside without having my eyes on the sky and the thoughts are constantly on my mind. I can't even enjoy the day to day things that I like to do without being consumed with the thoughts of UFOS or whatever you call what I am seeing. I need to do something about it but what? I know it's not an obduction and so glad it isn't but it feels pretty major to me and is effecting my life in ways that I don't like."],"Object Features":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/41338.html.txt","/var/www/straped/mufon/mufon_json/41338.json","/var/www/straped/mufon/org/41338.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.487621,+-79.932874(41338)&iwloc=A&hl=en\"> mufon case (41338) map </A>","City":"Cochranton","Log Number":"US-08012012-0019","Tags":"City","Disposition":"Unresolved","Date of the Event":"07/07/2012 12:00 UTC","Object Shape":"Unknown","Summary":"3'-4' DIA. AT 100 FEET MOVED SLOWLY OVER HOUSE","Longitude":"-79.932874","trends":["There have been no other sightings in Cochranton","This sighting has never been favorited."],"Case Number":"41338","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet, 101-500 Feet","Region":"Pennsylvania","Source":"MUFON","Latitude":"41.487621"}