{"Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","City":"North Platte","Object Features":"Unknown","Object Shape":"Sphere","Region":"Nebraska","Log Number":"US-08022012-0002","Weather Factors":"Unknown","Case Number":"41344","Date of the Event":"08/01/2012 12:15 UTC","Sighting Duration":"00:04:00","trends":["There have been 5 other sightings in North Platte","There were no other sightings in North Platte on or around August 1st 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.10193,+-100.764209(41344)&iwloc=A&hl=en\"> mufon case (41344) map </A>","Country":"United States","Longitude":"-100.764209","Disposition":"Unresolved","Date Submitted":"08/02/2012 01:09 UTC","divs":["Sighting DetailsA friend and I were heading north in his car on Hiway 83 heading towards town for lunch and as we were coming to the South Platte river bridge, I noticed two objects up in the sky in front of us. They were really reflecting the sun and that is what first caught my attention. At first I thought they were two ballons that had gotten loose and were floating upwards. But as I really looked at them I realized they were really reflective and did not move like balloons in the wind would behave. The one on the left was moving in a straight path up and the right one was a bit lower and was moving in an arch towards the east. When I first saw them they were not too far apart from each other as they were moving straight up. The right side one reached the height of the left one and then moved in a direct northeastery path and rapidly disappeared. The left one moved towards the west in a slightly northerly path. They were really shiney and when I first saw them I thought they were Mylar ballons, but at the height they were I would not have been able to see them, and they moved so smoothly in their respective paths. In fact, when I first saw them and was beginning to realise that they were not what I first thought they were, I said to my friend \"Hey! Look at those UFOs up there.\" Really almost joking but quickly we were asking each other what in the heck are those? We watched as long as we could until the left one just disappeared out of sight. They were so shiney and moved so smoothly it was amazing to watch. There were no wings, no exhaust, no lights that we could see and it almost appeared to me like they were \"dancing\" with each other. The lower right side object was appeared to be following the left objects movement until it started to arch to the east."],"Latitude":"41.10193","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/41344.html.txt","/var/www/straped/mufon/mufon_json/41344.json","/var/www/straped/mufon/org/41344.html"],"Summary":"Saw 2 bright spheres flying and watched as they changed direction"}