{"Summary":"Some odd activity around the Kansas City International Airport (MCI).","divs":["Sighting DetailsSome odd activity around the Kansas City International Airport (MCI). I live in the intersection of the International and Kansas City regional airports. This is just stuff thats been going on that is really abnormal. 1. I have been seeing this wide body aircraft flying over in kind of a zig-zag pattern at night. I think its a 747 but unable to tell. It has large bright lights down the side of the body located about every 3-4 window locations. Both sides of the aircraft are like this. The aircraft looks like a glowing orange cigar shape at about 20-30 miles out if it is travel orthogonal to you. Its brighter then the full moon when right over head with the lights on. Its elevation is also odd, it seems to stay around 10,000-15,000 ft. Its been flying around since Saturday. With the lights on and off (Normal aircraft lighting is always on). If some one saw it at a distance on a side profile, it would totally look like a UFO. If its heading to you, it looks like a plane with odd landing lights on. 2. This has happen several times in the last month, and on clear days and nights. The typical approach to MCI is east to west. You can sit here at night and spot the planes up to 50-60 miles coming for in for landing. I have been living here for almost 20 years and I have seen this happen with one or two planes, but not serval hours of landings. Whats been going on is that you can the planes in the distance. Then they the take a B-Line south then U-turn back to the north heading almost directly over my house. then go north of me to take a sharp left heading back to the airport. They will do this for up to a few hours. They will route planes in a similar northern direction as well. No aircraft are coming the east-to-west path during time. There is NO weather activity other then freaking hot... There was an instance last month were they were after the the aircrafts had done all that and going into the approach to MCI, and then get diverted south. and probably forced to use the southern approach to MCI (2nd runway). They didn't change the course for almost 10 flights."],"Date Submitted":"08/02/2012 05:26 UTC","Latitude":"39.22657","Log Number":"US-08022012-0006","Source":"MUFON","Tags":"City","Object Features":"None, Unknown","Object Flight Path":"Path with directional change","trends":["There have been 134 other sightings in Kansas City","There were 2 other sightings in Kansas City on or around August 1st 2012"],"Country":"United States","Case Number":"41348","Region":"Missouri","Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Kansas City","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date of the Event":"08/01/2012 01:00 UTC","Longitude":"-94.54091","files":["/var/www/straped/mufon/html2text/41348.html.txt","/var/www/straped/mufon/mufon_json/41348.json","/var/www/straped/mufon/org/41348.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.22657,+-94.54091(41348)&iwloc=A&hl=en\"> mufon case (41348) map </A>","Object Shape":"Unknown"}