{"Summary":"Saw a very large white bright light in the sky that sat there for about 4 minutes, until a plane that spotted it went towards it and then the light just slightly faded and vanished as if it was never there.","Region":"North Carolina","Latitude":"34.259602","Disposition":"Unresolved","Log Number":"US-08012012-0022","Case Number":"41341","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41341.html.txt","/var/www/straped/mufon/mufon_json/41341.json","/var/www/straped/mufon/org/41341.html"],"Weather Factors":"Unknown","trends":["There has been one other sighting in Whiteville","There were no other sightings in Whiteville on or around July 22nd 2012"],"Object Shape":"Circle","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsWalked outside to have a smoke and something in the sky got my attention, when I looked it was a very bright white round light that was very large just sitting there, up above was a plane way up that did a turn around my house, then another plane appeared and was going towards the light at this point it vanished I mean just disappeared when the other plane started towards it which took off after it. This light was huge and very white and it actually was beautiful, I was amazed, it didn't frighten me at all. There were a lot of other people that saw strange lights in this area all week I have been told. Whatever it was it was not ours. The first reaction I had was it's a ufo. This was on Sunday July 22nd. I have looked in the sky every night since. On that Thursday night July 26 I was outside around 9:30 and I looked in the sky and saw 2 objects moving very wierd in crazy motions at each other as if they were playing with one another, at one point I thought they were gonna collide, and then they too disappear. Would like to know if anyone else has seen this. I strongly believe we have company in our universe, we are sharing it with others, and I strongly believe our government knows but want tell us."],"City":"Whiteville","Date Submitted":"08/01/2012 08:27 UTC","Country":"United States","Longitude":"-78.729795","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=34.259602,+-78.729795(41341)&iwloc=A&hl=en\"> mufon case (41341) map </A>","Date of the Event":"07/22/2012 10:00 UTC","Object Features":"None"}