{"Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"US-08012012-0021","Summary":"7/30 N Phoenix near Cave Creek Glowing Orb flew from Sonoran desert","files":["/var/www/straped/mufon/html2text/41340.html.txt","/var/www/straped/mufon/mufon_json/41340.json","/var/www/straped/mufon/org/41340.html"],"Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"08/01/2012 07:33 UTC","Object Shape":"Disc, Star-like","Sighting Duration":"Undisclosed","Date of the Event":"07/30/2012 08:30 UTC","Latitude":"33.452397","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.452397,+-112.071217(41340)&iwloc=A&hl=en\"> mufon case (41340) map </A>","City":"Phoenix","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around July 30th 2012"],"Object Features":"Unknown","Case Number":"41340","divs":["Sighting DetailsNOTE: TIME IS PHOENIX TIME My husband and I witnessed several UFOS in North Phoenix near Cave Creek over the Sonoran Desert the other night, and I reported that to MUFON. Well, I saw one the other evening in the same exact place taking a walk. We decided to look in the same place as we had seen the others a few nights ago. I pointed it out to him, but after about ten minutes he thought it was just a star and went back home. I wondered if it was a star or (when it became larger) a planet even. However, I just had a feeling it was not and stared at it for another ten minutes. I was about to leave when it began to slip closer very slowly. The sky was very clear. It was not very late, so the horizon still had the afterglow of a purple twilight across the mountains. It was now stationary and looked more like a glowing orb. To be more precise, what seemed to be its interior was glowing (like it would be if it was lit up inside a craft). However, it stayed stationary for several minutes before it went along the same southern direction that we had seen several others do a few nights before. As it went in this direction, it changed shape and \"looked\" more plane-like (I suppose for camouflage) though it was completely soundless and there were no sounds, no cars, nothing else at the time making a noise. I felt as if it were waiting for others (like the ones that appeared the other night) to \"escort\" them along their way. Finally, I felt that it \"gave up\" on this mission for the evening and left. I had the feeling no others would be there because the \"escort\" was not there. I lost sight of it when it traveled directly south in the same direction where we had seen the others go the other evening in this area. EXTRA NOTE: Since it came \"out\" of the same place I had seen others, I am now thinking that there is some type of portal in this area. There have been scientists that have presumed that we could time travel if the wrinkles in time (wormholes) were big enough & we knew where they are. I am convinced that there are those that do know where & how to use them. I will try to work on some footage. I don't think they are going away. My husband and I are both professional and highly-educated and responsible people and have no reason to make any of this up."],"Tags":"City","Longitude":"-112.071217","Source":"MUFON"}