{"files":["/var/www/straped/mufon/html2text/41346.html.txt","/var/www/straped/mufon/mufon_json/41346.json","/var/www/straped/mufon/org/41346.html"],"trends":["There has been one other sighting in Somerset","There were no other sightings in Somerset on or around July 31st 2012"],"Object Shape":"Unknown","Tags":"City","Region":"Wisconsin","Country":"United States","divs":["Sighting DetailsThere have been brilliant meteor showers at night from about 1am until 3am. As I am on vacation, I've been taken extra privilege to spend these hours star gazing. My bedroom faces the east, out over the back yard. The head of my bed is directly under the double hung picture windows. On the night of the 30th, just as I was about to lay my head down on the pillow for sleep, I caught what I thought to be a reflection of orange tail lights in the right pane of my bedroom window. However, my window doesn't face the highway. These lights were huge. My ring finger blotted out one light, there was a pinky gap, and then another large orange light. They glowed in a dull like fashion, and definitely cast a strange ... not so much light, but 'space'. By space I mean there was a sense of light -- of space -- between the glow and the dark light of the gloaming. The lights seemed to hover for thirty seconds, to too terribly far up in the sky, about the extent of a lower flying light aircraft. The lights were not getting near or far, just seemingly stationary -- then, after some fashion they slowly seemed to dim, then just blip out of the sky. It was strange enough that I just closed my eyes and put the covers over my head. This is the third time seeing interesting things on my summer vacation. I am now wondering if there are military bases around here ? Best - Fellow Stargazer."],"Weather Factors":"Unknown","Log Number":"US-08022012-0004","Date of the Event":"07/31/2012 04:47 UTC","Date Submitted":"08/02/2012 03:41 UTC","Latitude":"45.124411","map":"<A HREF = \"http://maps.google.com/maps?q=45.124411,+-92.673536(41346)&iwloc=A&hl=en\"> mufon case (41346) map </A>","Sighting Duration":"Undisclosed","Case Number":"41346","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-92.673536","City":"Somerset","Source":"MUFON","Object Flight Path":"Straight-line path,Path then hovering","Summary":"Twin Orbs","Object Features":"Unknown"}