{"City":"Newport Beach","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Summary":"5 bright red lighted UFOs that were grouped closely together","trends":["There have been 16 other sightings in Newport Beach","There were no other sightings in Newport Beach on or around August 2nd 2012"],"Latitude":"33.598847","Longitude":"-117.957958","Date Submitted":"08/02/2012 04:56 UTC","Log Number":"US-08022012-0005","divs":["sighting detailsi was watching the olympics and then i looked out my window to see the bright red lights. i live very near the beach in newport and the view from my window looks out over where the ocean is. i hurriedly grabbed my iphone to take video of it which of course doesn't do the siting justice as i can't zoom in to capture the largess of the objects nor the luminosity. their are commercial airlines that fly out over the ocean on their way to jwa but the siting definitely wasn't that as the objects were grouped so close together and of the same apparent size. they weren't helicopters either b\\c they wouldn't be flying so close together and their was no uniform blinking white lights. a white light would appear occasionally but it wasn't uniform. it appeared as if they were spinning and occasionally the bright red flaming objects would display a short burst of white light. a couple of the 5 appeared to blink out of existence but what actually seemed to happen is they just elevated to points beyond what my iphone could pick up and eventually beyond what my vision could pick up. i stopped filming after about 3 minutes of the first video to just focus on the objects w\\ my eyes without distraction but then another object came out from off the ocean at a fairly rapid rate to join the three remaining objects and then their were 5 again eventually. i've never seen ufos before and this was amazing to say the least! i wanted to shout to my neighbors to wake them up and observe but i didn't. after they were gone i went outside to go on the beach to see what i could observe and came across a couple different groups of people partying on their patios. i asked one of the groups if they had witnessed the lights and they said no. it doesn't surprise me though as they were drinking and once again, these crafts were completely silent!"],"Region":"California","Source":"MUFON","Weather Factors":"Unknown","Case Number":"41347","files":["/var/www/straped/mufon/html2text/41347.html.txt","/var/www/straped/mufon/mufon_json/41347.json","/var/www/straped/mufon/org/41347.html"],"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.598847,+-117.957958(41347)&iwloc=A&hl=en\"> mufon case (41347) map </A>","Disposition":"Unresolved","Object Shape":"Fireball","Date of the Event":"08/02/2012 12:00 UTC","Object Features":"Unknown"}