{"files":["/var/www/straped/mufon/html2text/41349.html.txt","/var/www/straped/mufon/mufon_json/41349.json","/var/www/straped/mufon/org/41349.html"],"Country":"United States","Object Flight Path":"Other","Latitude":"33.730554","Summary":"I was taking pictures of house surrounds and captured 2 disks. One in air and second disk to the left and in front of mountain. Sun just beginning to rise. I didn't hear any sound at all.","Date Submitted":"08/02/2012 06:14 UTC","Source":"MUFON","Sighting Duration":"00:00:15","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.730554,+-116.364926(41349)&iwloc=A&hl=en\"> mufon case (41349) map </A>","Weather Factors":"Unknown","Object Shape":"Disc, Oval","trends":["There have been 8 other sightings in Palm Desert","There were no other sightings in Palm Desert on or around July 5th 2011"],"divs":["Sighting DetailsI was taking pictures of house surroundings because friends wanted to come visit and would help them decide. I took many pictures but only one in that direction. I took this picture around 5:50 A.M. on July 5th, 2011. I didn't notice disks until I was downloading pics into laptop. There are 2 disks in the picture. There is one in the air, which looks pink and orange and the second one is to the left and below, in front of mountain. Objects are on upper left corner of picture. After, I say 9:30 A.M. I noticed several black helicopters flying around my house and what it looked like examining where they came out from. I believe they came out of the canyon directly below them on the picture. I went up to check about a month and a half later. A friend and I climbed to the canyon, difficult hike, and looked around but found nothing, no animals, no tracks, no debris. My friend's watch stopped working as soon as we got into the canyon and began to work again as we exited the area. I also felt very weak for months after. I have not gone back since. I'm a little afraid because I felt so weak after going there. I was waiting for another sighting this year (2012) on July 5th because I thought they might have been attracted to the firework display on the 4th but I waited in vain. This time I took lots of pictures but I saw nothing."],"Region":"California","Log Number":"US-08022012-0007","Object Features":"Unknown","Disposition":"Unresolved","City":"Palm Desert","Case Number":"41349","Tags":"City","Longitude":"-116.364926","Date of the Event":"07/05/2011 05:50 UTC"}