{"files":["/var/www/straped/mufon/html2text/41342.html.txt","/var/www/straped/mufon/mufon_json/41342.json","/var/www/straped/mufon/org/41342.html"],"Region":"New Jersey","Object Flight Path":"Path with directional change","divs":["sighting detailsi was in my car at 9th and west ave sitting at the light about mid block. i noticed between the telephone\\electrical wires and the corner of luigi's restuarant a red light that was wavering slowly back and forth and slowly going up and down to a lesser degree than it was going back and forth. the light turned green and i waited about 3\\4th of a light cycle to turn left. i entered the mcdonalds which is on the corner of 9th and west and proceeded to the far side of the parking lot. i parked my car and saw that the red light was still in the sky at approximately the same position it was when i observed it at the light. i watched it for about a minute before it occured to me that i have a camera on my phone. i opened my car door and i took one picture of it. then i remembered that i also have a movie mode on my camera on my phone. i looked down at the phone to switch it to movie mode and looked back up it was gone. i looked away for less than 5 seconds. i do not know what happened to it. the picture is grainy, but it does show the red light and the only reference point is a light pole from the parking lot which was in front of my car in the foreground."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.279425,+-74.576946(41342)&iwloc=A&hl=en\"> mufon case (41342) map </A>","Date Submitted":"08/01/2012 09:36 UTC","Case Number":"41342","Longitude":"-74.576946","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"Solid bright red light making S shaped movement","Source":"MUFON","Object Shape":"Circle","City":"Ocean City","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"08/01/2012 08:45 UTC","Object Features":"Unknown","trends":["There have been 3 other sightings in Ocean City","There were no other sightings in Ocean City on or around August 1st 2012"],"Sighting Duration":"00:07:00","Latitude":"39.279425","Tags":"City","Log Number":"US-08012012-0023","Country":"United States"}