{"Object Shape":"Triangle","Longitude":"-117.68276","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41353.html.txt","/var/www/straped/mufon/mufon_json/41353.json","/var/www/straped/mufon/org/41353.html"],"Case Number":"41353","map":"<A HREF = \"http://maps.google.com/maps?q=34.144195,+-117.68276(41353)&iwloc=A&hl=en\"> mufon case (41353) map </A>","Latitude":"34.144195","Tags":"City","Date Submitted":"08/02/2012 12:02 UTC","Country":"United States","Region":"California","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsI WENT OUTSIDE TO RETRIEVE BAGS LEFT IN THE TRUNK OF MY CAR, ACCOMPANIED BY MY DAUGHTER AND GRANDDAUGHTER. I DON'T KNOW WHY BUT I LOOKED UP TOWARD THE EASTERN SKY AND SAW ONE VERY BRIGHT, LARGE RED STAR THAT KIND OF QUIVERED AND THEN SPLIT INTO THREE THAT FORMED A TRIANGLE THAT REMAINED STATIONARY BUT SEEMED TO GROW LARGER. I TOLD MY DAUGHTER TO LOOK, THAT WE WERE SEEING A UFO AND SHE AGREED THAT SHE THOUGHT SO AS WELL. I RAN INTO THE HOUSE TO HAVE MY HUSBAND COME OUT TO SEE. MY DAUGHTER AND GRANDDAUGHTER REMAINED OUTSIDE. WHEN I RETURNED, MY DAUGHTER TOLD ME TO HURRY AS TWO OF THEM HAD FADED AWAY AND THEY HAD ALSO CHANGED FROM RED TO A DARK ORANGE COLOR. ONE REMAINED AND AS MY HUSBAND EMERGED FROM THE HOUSE, IT TOO BEGAN TO FADE. WE ALL WATCHED AS IT DISAPPEARED. NONE OF US HEARD ANY SOUND. MY GRANDDAUGHTER, WHO IS TWO YEARS OLD, BEGAN TO ACT QUITE ODD FOR HALF AN HOUR OR SO AFTER. SHE SEEMED LIKE SHE WAS IN A TRANCE AND THEN SAID \"TWO WEEKS, TWO WEEKS, BIG,BIGGER BUT WILL MISS\". SHE WAS QUITE EMOTIONAL AS SHE SPOKE, HAD TEARS IN HER EYES BUT DIDN'T CRY AND SHE WASN'T AFRAID. IT ALL SEEMED QUITE ODD FROM A TWO YEAR OLD CHILD. THE NEXT DAY SHE TALKED ABOUT THE PRETTY RED STARS AND SEEMED COMPLETELY UNAFFECTED BY IT."],"Summary":"I SAW ONE LARGE RED LIGHT THAT BROKE INTO THREE IN A TRIANGLE FORMATION. LIGHTS CHANGED TO ORANGE THEN ONE BY ONE THEY FADED AWAY","Weather Factors":"Unknown","City":"Upland","Object Features":"Unknown","trends":["There have been 6 other sightings in Upland","There were no other sightings in Upland on or around July 28th 2012"],"Object Flight Path":"Hovering then path,Other","Log Number":"US-08022012-0011","Date of the Event":"07/28/2012 12:00 UTC","Source":"MUFON"}