{"Summary":"Several white lights which merged into one, then that one hovered over us","Longitude":"-121.427259","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around July 11th 2012"],"Viewing Distance":"Unknown","divs":["Sighting DetailsDriving to a store, several white lights caught my attention to my right. There were 4 or 5 which were going toward one slightly larger. The smaller ones were about the size of a dime held at arms length, the larger one, only slightly larger. I am not sure how high they were, nor how far from us. I immediately pulled into the nearest parking lot. My passenger asked what I was doing, and I told him I just saw something strange and I want to get a better look. Upon stopping the car, we both got out and saw above us the one of the \"orbs\". We watched it for about 15 minutes. In that time we saw it \"jump\" a couple of degrees to the south, then go back to its original position. It would appear to grow smaller, then larger again. It then sat motionless. We got a pair of binoculars from the car and viewed it was them. Neither of us saw any wings, tail, string, or markings. When viewed through the binoculars it appeared to glow. Then, while I was watching it, it just disappeared. I scanned the sky, thinking maybe it was doing one of its \"jumps\" but I didn't see it again. Unfortunately I did not have my camera on me, so was unable to take a photo of it. It should be noted that during our observation a couple of people came out of the near-by store and asked what we were looking at. When we pointed out the \"Anomaly\" and said we were watching a UFO, they just smiled, shrugged, and drove off."],"Log Number":"US-08022012-0015","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41357.html.txt","/var/www/straped/mufon/mufon_json/41357.json","/var/www/straped/mufon/org/41357.html"],"Date of the Event":"07/11/2012 11:15 UTC","Latitude":"38.474146","Source":"MUFON","Object Shape":"Circle","Sighting Duration":"Undisclosed","City":"Sacramento","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.474146,+-121.427259(41357)&iwloc=A&hl=en\"> mufon case (41357) map </A>","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Case Number":"41357","Date Submitted":"08/02/2012 03:33 UTC","Region":"California","Country":"United States","Tags":"City"}