{"Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsSo I was standing watch on my ship at Pearl Harbor pier and I was standing starboard side on the foc'sle looking right. It was 0513 AM, August 2nd, (I know because I have to make sure I report every hour) when a flash of blue light filled the sky. I noticed it originated behind me so I looked to the left side of the ship, thinking that I was about to hear thunder or see lightning (it rains a lot in hawaii randomly). That's when I saw, about 70 degrees in the sky, a star fall. As soon as I saw it, I was thinking it might've been a shooting star. What made me stop thinking that was the fact that this falling star left trail of circular smoke behind (I should note that this thing fell diagonally from left to right). And then after that, another star fell in the distance behind it and at that point I thought, now that's a shooting star, not the first one. The trail of smoke disappeared within 3 seconds. No sound, no other flashes of light, nothing. If it weren't for the trail of smoke, I'd assume it was a regular shooting star, entering the atmosphere showing for a second and leaving the atmosphere. And I should also note that I saw a flashing light in that same area as the first \"falling star\" (east). Flashing as in, 'pure darkness, pure star bright, pure darkness, pure starbright. I went to the bridge to get one of those heavy duty binoculars but by the time I did that, it was gone. I see a couple of those during deployment. Maybe its RIMPAC that's causing all this UFO activity. I can honestly say I saw 2 UFO's today, along with the rest of my watch team"],"files":["/var/www/straped/mufon/html2text/41354.html.txt","/var/www/straped/mufon/mufon_json/41354.json","/var/www/straped/mufon/org/41354.html"],"Object Shape":"Flash, Star-like","trends":["There have been no other sightings in FPO","This sighting has never been favorited."],"Case Number":"41354","Region":"Hawaii","Country":"United States","Object Features":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-155.573922","map":"<A HREF = \"http://maps.google.com/maps?q=19.906086,+-155.573922(41354)&iwloc=A&hl=en\"> mufon case (41354) map </A>","Date Submitted":"08/02/2012 02:20 UTC","City":"FPO","Sighting Duration":"00:00:20","Disposition":"Unresolved","Summary":"Flash of Light, Then a star falling with a trail of smoke behind","Log Number":"US-08022012-0012","Date of the Event":"08/02/2012 05:13 UTC","Tags":"City","Latitude":"19.906086"}