{"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-08022012-0014","Tags":"City","Summary":"UFO hovering over Pontiac for second night","Date of the Event":"07/31/2012 08:05 UTC","Case Number":"41356","files":["/var/www/straped/mufon/html2text/41356.html.txt","/var/www/straped/mufon/mufon_json/41356.json","/var/www/straped/mufon/org/41356.html"],"Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.693323,+-83.290653(41356)&iwloc=A&hl=en\"> mufon case (41356) map </A>","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Shape":"Disc","Longitude":"-83.290653","City":"Pontiac","divs":["sighting detailson 7\\30\\12 i witnessed an object hovering over my house that suddenly disappeared at amazing speed. the object appeared again on 7\\31\\12 at about 8:05 pm. the object was bright white and reflective, and hovering at a very high altitude, like the day previous it was spotted with binoculars and shortly after sighting it suddenly disappeared, it returned farther east in the sky than previously spotted. i would also like to note that on this occasion the craft was witnessed by three people, myself, mygirlfriend and my roomate all saw the craft and observed this encounter from start to finish. the duration of the sighting was over 35 minutes with the craft disappearing from view at 8:47 pm. the object seem to float in the sky and appeared to be moving and wobbling causing different light reflections at different times of the sightings, initial appearances of the craft were round and disc shaped with a slightly darker center. the object appeared metallic and was reflecting the sun on the western most side of the craft. it appeared through 10x50 binoculars to be changing shape or its attitude towards us causing it to look like it was shifting shape. while this object appeared to be drifting one thing i would like to note is that what clouds that were present appeared to be drifting much faster than the actual craft was. when the object disappeared and returned in the east i noticed a grayish appearance and the object looked like a disc on edge from this angle."],"trends":["There have been 16 other sightings in Pontiac","There were no other sightings in Pontiac on or around July 31st 2012"],"Disposition":"Unresolved","Object Features":"Undisclosed","Date Submitted":"08/02/2012 03:31 UTC","Latitude":"42.693323"}