{"Source":"MUFON","Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 31st 2012"],"Tags":"City","Date Submitted":"08/02/2012 11:58 UTC","City":"New York","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"New York","Object Features":"Appendage(s)","map":"<A HREF = \"http://maps.google.com/maps?q=40.750962,+-73.892568(41352)&iwloc=A&hl=en\"> mufon case (41352) map </A>","Summary":"A reflective sphere flying from NE to SW about as high as a hawk can fly.","files":["/var/www/straped/mufon/html2text/41352.html.txt","/var/www/straped/mufon/mufon_json/41352.json","/var/www/straped/mufon/org/41352.html"],"Country":"United States","divs":["sighting detailsi was in the kitchen of our 6th floor corner apartment. i often look for hawks out this window and more often see planes and sometimes helicopters as we are near laguardia. i had been feeling a little obsessive about scanning the skies lately and it irritated me, but i really wanted to do it anyway. i really didn't expect to see anything. our local hawk hadn't been around for some time which disappointed me a lot. it is a real joy to see him in the city. i was shocked to see this thing that i didn't recognze and blinked a couple times to try to see more clearly, but the shape was still that of a sphere. it didn't become a plane or helicopter as i thought it might if i just blinked. it was flying below cloud, and the sky was not fully overcast so i could see clear blue sky behind it and clouds passing beyond it. at one point the sun glinted off it, so that was what made me think it was spherical. it was silent and held a steady course. it seemed to have a very much lighter (visually) short, straight 'tail'. at first i thought it might be a vapor trail, but it steadily travelled with the object staying the same size. it was about 3\\4 of the length of the sphere, so not quite as long as the main object. very pale in density\\color (this 'tail'). it seemed i had leisure time to watch it as it wasn't fast, but it was too far away to see any real detail. i didn't have my binocs nearby, but i may have not used them anyway as i am not quick to spot a moving object (birds), so i prefer to just enjoy with my unaided eyes. i put the binocs by the window tho now. i would say it was about as high as a hawk can fly. it flew directly over my window, our building, and disappeared over it. i now feel stupid that i didn't go to my bedroom as i may have been able to see it come over the opposite side! afterwards i felt quiet, happy, composed as if i'd shared a mystery and i knew it was real now. i didn't tell my husband as he would have poo-pooed it, but i put it on whitley streiber society facebook page which i just joined i think last week. someone there asked if i'd reported it to mufon, and honestly, it never occured to me to do so. but, here it is. since then i've told one friend via email, but i don't think i'll tell anyone else. i don't move in ufo circles. when i wrote about it in my journal, just a couple sentenses, i drew a little sketch of it...i'm an artist and this is natural for me. but i got the lighting backwards in reference to the tail and the direction it was moving, so i'll probably do another one at some point. i always note the exact time of a hawk sighting, so fortunately i looked at the clock near the window out of habit."],"Date of the Event":"07/31/2012 03:23 UTC","Longitude":"-73.892568","Log Number":"US-08022012-0010","Case Number":"41352","Object Shape":"Sphere","Latitude":"40.750962","Sighting Duration":"00:01:00","Viewing Distance":"Unknown"}