{"Sighting Duration":"Undisclosed","City":"Kansas City","Country":"United States","files":["/var/www/straped/mufon/html2text/41369.html.txt","/var/www/straped/mufon/mufon_json/41369.json","/var/www/straped/mufon/org/41369.html"],"Summary":"Longer than the jet it flew above. Cigar shape very visable until it dissapeared after passing the jet at the highest alltitude. I saw the jet smoke this silver grey hugh object had no smoke trail. The sky was clear blue. I was at work on smoke break.","trends":["There have been 134 other sightings in Kansas City","There were 2 other sightings in Kansas City on or around July 31st 2012"],"Tags":"City","Object Shape":"Cigar","Date Submitted":"08/02/2012 09:18 UTC","Object Features":"Unknown","Case Number":"41369","Log Number":"US-08022012-0027","Latitude":"39.029831","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-94.505959","divs":["sighting detailsit was july 31st 2012 a little after 1pm cst. i was on a ciggerette break in the back of the building where i work. i work for the city ambulance service in this town. i was looking in the sky at a jet at the highest cruse level an airliner can fly when i noticed this grey\\silver long cigar like object about 50ft or more above it coming from behind the jet. it continued to fly over the jet, in front of it until it dissapeared in a small thin cloud. i waited for it to reappear after it existed the cloud but it never did. this day the sky was clear blue with very few thin clouds not to mention we had triple digit temperature's. i was not hallucinating from the heat as my co-workers joked about when i told them. i have never witnessed a ufo in my life but that day i know i saw one. i can't get this thing out of my head now. and the chilling thing about it is that night channel 5 kshb reported a story from a pilot who said one trailed there plane as they landed at kci airport the day before on monday july 30th. the jet looked like a reflective dot with a very long smoke trail. this object stretched five times that of the jet if not more at that altitude, it was amazing. i am no-longer a doubter, i know what i saw and it was not man made. i wish i had had a camera but i did not i just hope i was not the only one who saw it."],"Region":"Missouri","Viewing Distance":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.029831,+-94.505959(41369)&iwloc=A&hl=en\"> mufon case (41369) map </A>","Date of the Event":"07/31/2012 01:05 UTC"}