{"Object Features":"None","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"08/02/2012 08:46 UTC","Date of the Event":"07/26/2012 12:00 UTC","Case Number":"41367","files":["/var/www/straped/mufon/html2text/41367.html.txt","/var/www/straped/mufon/mufon_json/41367.json","/var/www/straped/mufon/org/41367.html"],"Source":"MUFON","divs":["Sighting DetailsMy wife actually had this sighting. We both had been winding down that evening sitting in the garage with the door open. It had been a stormy night but the storms had waned. I became tired and went to bed. She said that a short time after I had went in, around 11:30 PM EST, she noticed a \"fireball\" moving slowly across the sky from west to east. She thought of waking me but, I had taken muscle relaxers and would be hard to arouse, decided otherwise. According to her this event lasted a considerable amount of time, approximatley 3 minutes. After the object disappeared over the eastern horizon, she said that she expected to hear a crash or explosion, but did not. I feel that she is a credible witness because she doesn't believe in UFO's. She was even wary of telling me for fear of me making fun of her. She couln't think of any other discription than a \"fireball\" or \"something on fire\". I asked her to use the full moon as a reference and tell me the size of the object. She said it was only slightly smaller but just as bright. She was also amazed that there were no other sightings reported. She said that she thought she would see something about it on the morning news but did not."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.344074,+-85.890512(41367)&iwloc=A&hl=en\"> mufon case (41367) map </A>","Summary":"wife saw large fireball descending slowly from west to east.","Latitude":"38.344074","Region":"Indiana","trends":["There have been no other sightings in Floyds Knobs","This sighting has never been favorited."],"Tags":"City","Longitude":"-85.890512","Disposition":"Unresolved","Object Shape":"Fireball","City":"Floyds Knobs","Log Number":"US-08022012-0026","Viewing Distance":"Unknown","Weather Factors":"Unknown"}