{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting Details I was standing on my front porch facing East observing Venus and Saturn. I took a few pics of them moments before the sighting, but not with a tripod. I also observed with 10 power binoculars. While looking with the naked eye, a large glowing object travelling very fast came into view from the South behind trees and flew visually between Venus and Saturn to the North. It appeared as bright as Venus, which it was closer to. For a moment I was able to make a side by side comparison. It was huge and appeared larger than Venus. My reaction was to exclaim \"wow-wow-wow-wow-wow-wow!\" even though I was alone! It was low enough on the horizon for trees to get in the way, so I ran out in my yard to follow it as long as possible. I lost sight of it as it went behind distant trees. It covered aproximately 35 to 40 degrees of sky in the aprox. 7 seconds I viewed the object. The trajectory and size was not one I have ever observed in a satellite, low on the Eastern horizon and going South to North, which is what made me think I may bee seeing something else."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=47.735698,+-122.286942(41368)&iwloc=A&hl=en\"> mufon case (41368) map </A>","Country":"United States","Sighting Duration":"00:00:07","Date Submitted":"08/02/2012 08:46 UTC","Date of the Event":"08/02/2012 04:23 UTC","Case Number":"41368","Viewing Distance":"Unknown","City":"Seattle","Source":"MUFON","Summary":"While observing Saturn and Venus, object bright as Venus flew S to N between them","files":["/var/www/straped/mufon/html2text/41368.html.txt","/var/www/straped/mufon/mufon_json/41368.json","/var/www/straped/mufon/org/41368.html"],"trends":["There have been 110 other sightings in Seattle","There was one other sighting in Seattle on or around August 2nd 2012"],"Longitude":"-122.286942","Latitude":"47.735698","Region":"Washington","Object Shape":"Sphere","Object Features":"Unknown","Tags":"City","Log Number":"US-08022012-0026"}