{"trends":["There have been 2 other sightings in DuBois","There were no other sightings in DuBois on or around August 2nd 2012"],"Country":"United States","Weather Factors":"Unknown","Tags":"City","Region":"Pennsylvania","Latitude":"41.116411","Date of the Event":"08/02/2012 09:00 UTC","City":"DuBois","Sighting Duration":"00:01:00","Disposition":"Unresolved","Log Number":"US-08022012-0033","Case Number":"41375","Object Flight Path":"Unknown","Longitude":"-78.758224","Viewing Distance":"Unknown","Date Submitted":"08/02/2012 10:35 UTC","divs":["Sighting Details i just posted this report but only half of it came up and i put 07 for the month instead of correctly putting 08. apologies. im not sure what i saw but it appeared to be a large black crack in the surface of the moon. massive! almost as though a piece were breaking off. while driving with my friend i noticed the moon was orange brown (harvest) i saw the black mark and thought tree branch, but as we were moving it did not. my friend also witnessed this. we pulled over to further inspect after i shouted \"pull over\" we both saw what i had thought was the moon breaking apart. i immediately wanted to come home and check the web, fearing the worst. not even thirty seconds later, it was gone. the black mark seemed to encompass the surface from \"in reference to a clock\" 4 minutes after 12 to 4 on the hour. the \"line\" varied in width and was not straight. as i said before it looked like a massive crack in the surface. the line did not extend past the surface area, ruling out a jet trail or possibly meteor or fiery object smoke trail. in size, from me to the moon, if this were indeed a craft its size would have to be Manhattan island. or larger ruling out a satellite or space station. i hope someone else saw this. it scared the crap out of me. being a sailor im very well aware of the moons role in our tides. the duration of the time i saw this to the time it was gone, as i said i saw it initially we pulled over and observed it for a minute and decided to continue driving to get a better view. about 20-30 seconds later it was completely gone from the visible sky, which is up on the top of hill, so alot of visible sky. i will keep my eyes open on the web for anyone else reporting this. i have never seen a UFO nor do i think i would want to. but being an educated person in celestial bodies, aircraft, and weather patterns i have no reasonable explanation other than we saw a massive free moving object moving across the light of the moon."],"Object Shape":"Other, Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.116411,+-78.758224(41375)&iwloc=A&hl=en\"> mufon case (41375) map </A>","Summary":"it looked like a giant crack on the surface of the moon.","files":["/var/www/straped/mufon/html2text/41375.html.txt","/var/www/straped/mufon/mufon_json/41375.json","/var/www/straped/mufon/org/41375.html"],"Object Features":"Other"}