{"divs":["Sighting DetailsWe were outside watching for the flashing lights and orbs, since we have seen them for the last week now. I noticed one of the flashing light star-like ufo's up in the sky to the north. I then noticed about 15 minutes later two more to the east. About 5-10 minutes after that their was an orange hovering bright orb light that came into view. It came from the east, and it was very bright. It hovered close to the flashing stars in a horizontal line that was turned sideways a bit. Then about 10 minutes later an even brighter orange orb was seen behind the trees to the northeast. It slowly hovered upwards into our view from below the treetop and it stayed there until we went inside around 4:45 am. It appeared around 4am exactly. The orb moved very slowly into our view, and about 10 minutes later started climbing again into the air slowly until it was just above the power lines. It didn't move very far and very slowly. It would sway from side to side while moving upward just barely. While it wasn't in motion it stood still completely. The first flashing star was seen around 3:30 when all of this began. The orb didn't flash like the other 3 star-like objects. I took a video of two of the flashing ones to the east and got the hovering orange orb to the east, as well on the video. I took several pictures of the two hovering orange orbs and they didn't turn out looking like orange orbs. They are blue and stringy, electric, lightning looking things. It's very, very strange looking. While watching this phenomenon, I was just amazed. My husband watched it too with me awhile, but fell asleep a little bit after we saw the orange orb behind the trees at 4 am. We were both very tired while it was happening, but we had to see this happening. I am not as scared anymore as I was on the first ones I saw, so we were both a little calmer this time. The 5 different objects were all still present when we left and went inside. I included two of the same photos below. One is enhanced and the other is not."],"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Region":"Oklahoma","Longitude":"-97.145827","map":"<A HREF = \"http://maps.google.com/maps?q=34.195309,+-97.145827(41372)&iwloc=A&hl=en\"> mufon case (41372) map </A>","Case Number":"41372","Date of the Event":"08/01/2012 04:06 UTC","Tags":"City","Source":"MUFON","Sighting Duration":"01:00:00","Object Shape":"Diamond, Flash, Oval, Star-like, Triangle","Latitude":"34.195309","Date Submitted":"08/02/2012 09:43 UTC","Log Number":"US-08022012-0030","Disposition":"Unresolved","trends":["There have been 4 other sightings in Ardmore","There were no other sightings in Ardmore on or around August 1st 2012"],"Country":"United States","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/41372.html.txt","/var/www/straped/mufon/mufon_json/41372.json","/var/www/straped/mufon/org/41372.html"],"Summary":"3 Flashing Lights & 2 Hovering Orange Orbs","Object Features":"Unknown","City":"Ardmore"}