{"Disposition":"Unresolved","Date of the Event":"07/10/2006 03:00 UTC","Log Number":"US-08032012-0011","Summary":"I saw the alien coming toward me and a thick white light wooshed past me as I ran away. the grass was burned where I saw the alien, the next day after I inspected the area and I smelled somthing there (like sulfur) the next day.","Source":"MUFON","Viewing Distance":"N/A","divs":["Sighting DetailsI was home alone I lived feet from a recreational park with thihg high woild grass and some mowed areas for human activies in the day. It was in the iddle of the morning. Where I lived there were no street lights it was dark as dark just the moon light to light your way. Nobody goes out at that time cause of the wild life and the open land. Behind my home maybe 200 feet away was a streem where the ducks would contrgate to under a small bridge in the middle of the night. Nights I was alone I would wonder over to the bridge and watch the ducks join eachother. I was never afraid as I was so close to home. That night I was on my way back home from the ducks and I saw someone crouched down below a treen that was slightly lit by the moon light. I remember thinking who the hell would be out this late on the runners path...crazy people. I thought maybe they wer tieing their shoes. I grew up in a big city and am skepotical of strangers in the night. So I kept my eye on them as I passed by, maybe 20-30 feet from them. They then rose from the crouching psotioion...I was haunted by what I saw then. The way they rose was not human like not possible. They rose completely straight without a bend without use of the arms as they remained straight down. I starred and think I may have stopped for a moment in fright as I could see the them more clearly in the moon li8ght as they rose up to stand straight. It was not human at all. It was greyish maybe as tall as I am ( I am 5 foot six inches) and the head was a tear drop shape just like the alien I saw some years back. The eyes glowed dark and glassy, large eyes and almond shaped. The silouette of the body was very thin without any defined shape just smooth and thin arms and legs. I could see the fingers were strange and long and spread apart enought to see from so far away. It faced in my direction as it saw my starring. It began to walk toward me getting faster by the second. I realized I was walking att his point fast and sidways as I starred back. I broke out into a run as I was afraid the creature was about to as well. I had to run through the field to a old woden fence that ran along a few town homes. (yes town homes in the middle of nowhere, it is colorado). The path between the fence and the homes was about 5-6 feet width and maybe 20 feet long. I ran through it telling myself not to panick not to look back just keep going get home!. AS I ran a thick white light that was not clear not able to see through wooshed past me and surrounded me as it ran through the alley way I was running down. There was a familiar humming from my last encounter and a loud woosh. The noise nor the light affected my ears or eyes. I rememeber looking down at my arm as I ran and could see myself but not through the light. I couldnt see the fence nor the houses beside me. The light may of lasted a few minuites and disapeard suddenly . I ran to my front porch, ran inside locked the door made sure all my wiondow were locked as I ran threw the house in hysteria. I grabbed my 9 tauraus and the phone....called my mother as I leaned against the wall facing my door waiting for the creature to show up. I was screaming in hysterics and cat remember what all I said but knew I was miles from my family and friends. I sat there for hours till the morning never slept just waited for an invasion like the last encounter and waited for sun rise for the safety of people who would contrigate at the field in the morning. When morning came I waited for people to come to fish and play in the field before going to investigate what hapened that last night. I went down the path along the fence and no signs of anything. I went to the tree where I first saw the creature and there was a cirle of burned grass where I saw the creature standing and the faint smell of sulfur maybe. I waited for my husband to come home that day to tell him what happened and show him the evidence. The smell was gone though and the burned grass remained. I never saw the aliens again and hope to god I never do."],"Weather Factors":"Unknown","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around July 10th 2006"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.565986,+-105.045851(41388)&iwloc=A&hl=en\"> mufon case (41388) map </A>","Object Features":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"41388","Region":"Colorado","Date Submitted":"08/03/2012 12:22 UTC","Object Flight Path":"N/A","Object Shape":"Other","Longitude":"-105.045851","Latitude":"40.565986","City":"Fort Collins","files":["/var/www/straped/mufon/html2text/41388.html.txt","/var/www/straped/mufon/mufon_json/41388.json","/var/www/straped/mufon/org/41388.html"],"Tags":"City"}