{"Weather Factors":"Unknown","Longitude":"-95.104664","divs":["Sighting DetailsI'm an insomniac, so I am frequently awake at odd hours. Last night I went outside to smoke a cigarette and heard a strange sound. At first I thought it was thunder, but then I noted the the sky was clear. I looked up, and saw a diamond shaped craft. The sound could best be described as rumble, silence, rumble, silence. It made me think of someone that didn't know how to drive a stickshift driving a car. It's difficult to put to words, but think of how the engine sounds when that car is being driven...the engine races then slows over and over. The sound wasn't that of a car engine, just the pulsing of the sound was like that. It was alomost like a jet engine doing what I described. Racing, then slowing, racing then slowing. I ran back into the house and grabbed my camera, because the thing was just sitting there, then it started to slowly move off to the northwest. I only have a digital camera, and after reviewing the pictures, I was unable to capture an image. The lights on it that were visible were red, and they flashed like landing lights on an airplane. As it moved away, the sound continued, and it took no less than five minutes for it to move all the way across the sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.362613,+-95.104664(41384)&iwloc=A&hl=en\"> mufon case (41384) map </A>","Tags":"City","Latitude":"33.362613","files":["/var/www/straped/mufon/html2text/41384.html.txt","/var/www/straped/mufon/mufon_json/41384.json","/var/www/straped/mufon/org/41384.html"],"Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","Summary":"I stepped outside last night and noted a strange sound, I looked up and saw a diamond shaped craft","Region":"Texas","trends":["There have been no other sightings in Talco","This sighting has been favorited 1 time."],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08032012-0007","Sighting Duration":"Undisclosed","Case Number":"41384","Disposition":"Unresolved","Date Submitted":"08/03/2012 07:13 UTC","City":"Talco","Date of the Event":"08/03/2012 01:30 UTC","Object Features":"Undisclosed","Object Shape":"Diamond"}