{"map":"<A HREF = \"http://maps.google.com/maps?q=40.641845,+-89.390708(41387)&iwloc=A&hl=en\"> mufon case (41387) map </A>","Object Features":"None","Source":"MUFON","Region":"Illinois","Latitude":"40.641845","Weather Factors":"Unknown","trends":[],"Viewing Distance":"N/A","files":["/var/www/straped/mufon/html2text/41387.html.txt","/var/www/straped/mufon/mufon_json/41387.json","/var/www/straped/mufon/org/41387.html"],"Object Flight Path":"Other,N/A","Tags":"City","Log Number":"US-08032012-0010","Object Shape":"Other","Sighting Duration":"Undisclosed","Summary":"I saw the light blanket across the street, my dog was paralized and the creature came in my window I have a mark on my arm and lost sense of time","Country":"United States","Date of the Event":"08/16/2001 01:00 UTC","Case Number":"41387","Disposition":"Unresolved","Longitude":"-89.390708","City":"Undisclosed","Date Submitted":"08/03/2012 11:43 UTC","divs":["Sighting DetailsI was laying in bed w my dog by my feet. My bed was under a window. The neighborhood was quiet and it was dark out late at night in an suburban neighborhood. I saw this yellowish ornage light; it was thick and blanketed everything I could not see through the light but it covered the complete view from my bedroom window. It did not affect my eyes like the sun does. I also herd a strange humming while watching the light trying to figure out what it was. I never saw anything like it before. I am not certain how much time passed but it was not seconds nor hours...maybe 20 mins or so as I wsa stunned by this light display. I was scared and closed my wndow as I peered out into the light. The light disapeared and everything was in view again like normal. I could see the house across the street and see the street lights lit up dimly as always. Then I heard a noise at my other window just 8 feet from my bed. I looked as my doig began to growl (he is protective and a watch dog). He went to rise from the bed and suddelny froze. He was frozen stiff, just his eyes could move and I could see his breathing was heavy as he growled but stiff as a statue. I panicked and looked back to the window where I heard the noise. I remained in my bed by my dogs side. I saw a hand coming through the screen as it must have punched a hole through the screen. I had the window slightly opened as always. The hand was greyish and smooth w long fingers and strange bulbus joints and finger tips. I was terrified as the screen was then pulled out the window lifted further. A creature craweled into my now opned window and crouched in the window sill stairing at me. My dog still fozen and growling I knew the creature had some kind of power to do this to my dog. It was a small creature greyish all over smooth skin all over with large almond like eyes, black eyes that protruded they loooked like glass almost. No pupils just pitch black eyes. The head was the typical alien head as people say they have seen the tear drop head larger than expected in proportion to the small body. long arms very thin. The feet were long and it began to climb down from my window slowly as it stared at me and it never blinked. I think I was scared stiff I dont know if it paralized me to I think I was just scared stiff. I thought of running for the door but it was across from the window rthe creature was in. I would have never made it past the creature to get to the door and I cou;dnt carry my dog to help him as he is a 70 lb rottie pit bull. After the creature began to clinmd down from the window I dont remember anything until I awoke in the moring with everything normal and my dog was normal again and fine. I ran to the window remembering the nights events and the window was raised all the way which I never do...I know I didnt dream this. The screen was laying on the driveway below my woindow. I ran downstairs to the driveway to look for the hole in the screen and sure enough the small punched through hole from the creature was there. A day later I noticed a raised bump in my wrist. The skin was white on the raised area. It is rounded and small. I wondered if something was implanted in me or if I was scarred by the creature. It did that to my wrist it had to of done it when I lost time when it did what ever it came for. I still have the marki on my wrist and am afraid to have the bump looked at by doctors. This was not the last time I had a close encounter with this creature. I will write about the next encounter after this. Lacey"]}