{"Disposition":"Unresolved","Object Shape":"Square, Rectagular","Sighting Duration":"Undisclosed","Latitude":"34.058778","map":"<A HREF = \"http://maps.google.com/maps?q=34.058778,+-111.084411(41395)&iwloc=A&hl=en\"> mufon case (41395) map </A>","Longitude":"-111.084411","Viewing Distance":"Over One Mile","Date of the Event":"02/15/2009 06:45 UTC","Source":"MUFON","Case Number":"41395","Country":"United States","trends":[],"files":["/var/www/straped/mufon/html2text/41395.html.txt","/var/www/straped/mufon/mufon_json/41395.json","/var/www/straped/mufon/org/41395.html"],"Log Number":"US-08032012-0018","Weather Factors":"Unknown","Summary":"solid black rectangle; no lights; no sound; no movement","Tags":"City","Object Features":"None","Object Flight Path":"Stationary","Date Submitted":"08/03/2012 08:58 UTC","divs":["Sighting DetailsI was driving to work down 51st Ave sometime in the middle of February 2009. It was about 6:30 AM. About the time that I reached Cactus, I happened to notice a black rectangular-shaped object to my southwest. It had no lights and did not appear to be moving. I continued to watch the object as I drove south to W. Olive, and then turned west. It was now to my left and appeared to be 1,500 to 2,500 feet high. It was not moving to any significant degree. I stopped at the Circle K on 59th Ave and W. Olive to get coffee (as I usually did). When I got out of the car, I could still see the object to the south and a little east. I would estimate that it was somewhere between Northern and Glendale, still with no movement, no lights, and no noise. I called my wife to tell her what I was looking at. I went in to get my coffee and told the clerk (Marcus) that he should come out and take a look. He did briefly and verified what I was looking at. I then drove west about 15 blocks. When I got to my destination I looked back but could not see the object. I am 66 years old, flew several different light aircraft, and grew up around several military and municipal airports. What I saw was definitely solid, was not a fixed wing aircraft, not a helicopter, and certainly wasn't a balloon. Eliminating those, I cannot explain to this day what it was that I saw. I am submitting this to see if anyone else happened to report seeing this object."],"City":"Undisclosed","Region":"Arizona"}