{"Latitude":"37.335362","map":"<A HREF = \"http://maps.google.com/maps?q=37.335362,+-121.936416(41393)&iwloc=A&hl=en\"> mufon case (41393) map </A>","Disposition":"Unresolved","Longitude":"-121.936416","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around November 9th 2011"],"Sighting Duration":"Undisclosed","Summary":"White orbs (like pearls) going in and out of a huge cloud.","Log Number":"US-08032012-0016","Object Flight Path":"Other","Case Number":"41393","files":["/var/www/straped/mufon/html2text/41393.html.txt","/var/www/straped/mufon/mufon_json/41393.json","/var/www/straped/mufon/org/41393.html"],"Weather Factors":"Unknown","Date Submitted":"08/03/2012 06:14 UTC","Tags":"City","Viewing Distance":"Unknown","Region":"California","Country":"United States","divs":["Sighting DetailsNovember of last year (2011) I was with my son at his lawyers office in San Jose, Ca. Sitting, looking out the windows, waiting for them to finish, I saw a huge cloud in the distance (one of many that day). I noticed something was going in and out of the cloud, I thought birds, but in almost the same thought I realized at that distance birds probably wouldn't be visible. I saw what looked like giant pearls going in and out of this cloud. I watched as the \"orbs\" would leave the cloud, descend or ascend a bit and then go back into it. I went to the window and watched for 3 or 4 minutes until the trees outside the building blocked my view as the cloud slowly moved. The building across the street was a 2 story, we were on the 2nd floor of our building, and being on a busy street I knew there was no use going outside to try and see it again. I didn't say anything about what I saw until my son and I were in the car. I think he was too overwhelmed from his meeting (filing for divorce) because he had almost no reaction. When I saw my mother, I told her what I had seen and she was quite interested. Some time had passed when (at my mothers house) she called me into the room to show me a program she was watching. To my amazement it was showing another cloud with what looked like the same white orbs that someone had filmed. Before I saw the orbs, I thought life other than earth may exist, now I know we aren't alone. I look to the sky a lot more now."],"Object Features":"None","City":"San Jose","Source":"MUFON","Date of the Event":"11/09/2011 12:00 UTC","Object Shape":"Sphere"}