{"files":["/var/www/straped/mufon/html2text/41407.html.txt","/var/www/straped/mufon/mufon_json/41407.json","/var/www/straped/mufon/org/41407.html"],"Date of the Event":"08/04/2012 12:00 UTC","Sighting Duration":"00:00:02","Date Submitted":"08/04/2012 01:20 UTC","Tags":"City","Object Shape":"Circle, Sphere","Source":"MUFON","Weather Factors":"Unknown","Latitude":"40.480618","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around August 4th 2012"],"Summary":"Bright White Orb that moved unearthly fast and disappeared","Case Number":"41407","divs":["Sighting DetailsAt around midnight I walked out the back door of my house to go to my car. I looked up and saw a bright white orb appear. Nothing made me notice it because the sky was clear and I always see that part of the sky when walking out of my house. I didn't have to turn or look in any other than normal direction. The object was roughly the size of a round aspirin type pill and appeared to be around 10000 feet off the ground. The altitude looked to be what I would usually see a Cessna fly at. The object moved so fast that it blew me away. It made a very sharp turn (upwards of 120 degrees) and disappeared. It all happened in about two seconds. I was in the military and I love jets. I have never seen anything do what that could do. The speed and directional change it made was so fantastic. I've ruled out it being a meteor or shooting star because I'm seen plenty of those and none of them have been that close to the ground, that big, and make a drastic turn. Man made aircraft seem unlikely for nearly the same reason. If we have something that moves like that and can disappear I would be surprised. If anyone else saw it I would be thrilled to talk to them and not be anonymous in that case. I chose to be anonymous though because I don't want to risk it affecting my job or making people think I'm crazy."],"Longitude":"-79.975272","Region":"Pennsylvania","Object Flight Path":"Path with directional change,Other","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Log Number":"US-08042012-0008","map":"<A HREF = \"http://maps.google.com/maps?q=40.480618,+-79.975272(41407)&iwloc=A&hl=en\"> mufon case (41407) map </A>","City":"Pittsburgh","Country":"United States"}