{"Case Number":"41418","City":"Newtown","Date Submitted":"08/04/2012 11:01 UTC","Object Features":"Unknown","Object Shape":"Circle","divs":["Sighting DetailsThis incident happened in the early 70's. My friend and I, were about 13 or 14, were out visiting friends while my parents were out for the evening. We lived going up a huge hill and everyone else lived on top. It was getting late, around 10:00, and we thought we better get home before my parents as we were suppose to be home when the streetlights came on. As we were heading home, right about the top of the hill, we heard a humming like noise and saw this huge bright thing in the sky coming straight at us. At first we thought it was a large airplane flying lower than normal, but as it approached, it stopped in mid air right above us. It was a large circular object that was shiny and glowed and it seemed to have a million lights around it. At the time, the only way I could describe it was that it looked like our baseball stadium (Riverfront Stadium in Cincinnati) up in the sky. Neither of us said a word but just continued looking at it. It finally took off, faster than any plane and we lost sight within seconds. We both stood there for a while not saying anything, and then I looked at my friend and said \"did you see what I think I saw\" and she just looked shocked and said \"yes\". We went home and noticed the clock said it was about 10:30, which means we watched it for at least 15 minutes or more while it hovered above us. We were so insistent on what we saw, that I immediately called the police station in my town and asked them if there was anything reported. They kinda laughed at us and said no and not to call again. I believe they thought we were pranking them. I then called a local airport that was about 20 miles from my home. I didn't get through but the next day we called again and asked them what was the huge white thing in the sky last night and they didn't know what we were talking about. I described everything and they seemed to not believe me either. To this day, I know what I saw. I'm a divorced mother and grandmother and that image will always stay with me. Although no one ever believes me, I know what I saw."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.124083,+-84.355771(41418)&iwloc=A&hl=en\"> mufon case (41418) map </A>","Summary":"A huge circular object with bright while lights spinning and hovering above me.","trends":["There have been no other sightings in Newtown","This sighting has been favorited 1 time."],"Log Number":"US-08042012-0019","Latitude":"39.124083","Region":"Ohio","Date of the Event":"07/15/1972 12:00 UTC","Viewing Distance":"101-500 Feet","Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Longitude":"-84.355771","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41418.html.txt","/var/www/straped/mufon/org/41418.html"],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path then hovering"}