{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Undisclosed","Latitude":"-35.315523","Longitude":"148.207037","Weather Factors":"Unknown","trends":["There have been no other sightings in Tumut","This sighting has never been favorited."],"Tags":"City","Date of the Event":"08/02/2012 12:00 UTC","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI was visiting my brother and sister-in-law in Tumut N.S.W. On the night of Thursday 2nd August 2012 I went out to the shed about midnight and looked up at the full moon very high in the sky.I noticed a spherical object only slightly smaller than the apparent size of the full moon not far below the moon. It was as bright as the full moon but was sparkling orange all over, as if the sparkles from a sparkler were emitting from it, like an orange \"porcupine\". It seemed to be stationary for about a minute. An orange globule or teardrop seemed to form on the bottom of it then this detached and dropped off and disappeared. The sparkling ball then seemed slightly smaller after ejecting the globule. The ball started moving in an arc in an easterly direction at a fairly slow speed. The ball ejected a second orange globule which detached and disappeared like the first one. These globules seemed to form like a drip on the main object and were bright orange before detaching. After the second globule detached, the sparkling orange ball lost its sparkles and went black. The outline of a circular black object much larger than the original sparkling orange ball could then be seen in the moonlight - this black circular object appeared to be solid. It kept moving in an arc towards the east and disappeared from view behind some trees. I had called out to my brother and sister-in-law in the house to come out and have a look - and they did so about 1 minute into the sighting as the object had started to move east after being stationary."],"Country":"Australia","Date Submitted":"08/04/2012 08:58 UTC","Region":"New South Wales","City":"Tumut","Object Shape":"Sphere","Case Number":"41416","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-35.315523,+148.207037(41416)&iwloc=A&hl=en\"> mufon case (41416) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41416.html.txt","/var/www/straped/mufon/mufon_json/41416.json","/var/www/straped/mufon/org/41416.html"],"Summary":"Sparkiling orange spherical object about apparent size of full moon high in sky near moon was stationary for a minute then ejected orange tear drop, then moved to the east in an arc, then sparkles disappeared leaving a black circular solild looking object","Log Number":"AU-08042012-0017"}