{"Source":"MUFON","Disposition":"Unresolved","Tags":"City","Viewing Distance":"Unknown","Longitude":"-155.578212","Date of the Event":"07/31/2012 12:00 UTC","Sighting Duration":"Undisclosed","Region":"Hawaii","Date Submitted":"08/04/2012 01:58 UTC","Log Number":"US-08042012-0021","Object Flight Path":"N/A","Summary":"A bright light w/ accompanying luminescence(invisible to the naked eye) on 2 separate photos, taken at approx. the same time, from 2 separate locations approx. 50 miles apart","trends":[],"Object Shape":"Circle, Cross, Teardrop","divs":["Sighting DetailsWe wish to remain anonymous, but feel the need to share this. I am passing this info on for the photographers. I was not a witness to either of the photo shoots. Here is the email I received from one of the photographers- the notes in parentheses are my additions \"So today I was on the (Molokai) lanai and a huge Iwa bird(Frigate Bird) was just about 50 feet above the house. I ran to get my phone to shoot a photo and when I looked at it all I could see on the small photo was this strange green dot and the sun next to it. I posted it to ****** complaining that I missed the Iwa and almost instantly one of my friends on Maui said she got the same photo when she was trying to photograph an Iwa...ya sure, I thought. Then she posted her version...OK weird. Then I screen captured hers and made it larger and was totally freaked out. What the heck is that thing in the oval with the green dot. When I made mine larger I found the same image. I simply don't know what to think of it but thought you guys might like to be freaked out with me...I'm not going to sleep well tonite, \" Please note that the bird is visible in Photo 2."],"Object Features":"None","Latitude":"19.906506","map":"<A HREF = \"http://maps.google.com/maps?q=19.906506,+-155.578212(41422)&iwloc=A&hl=en\"> mufon case (41422) map </A>","files":["/var/www/straped/mufon/html2text/41422.html.txt","/var/www/straped/mufon/org/41422.html"],"Case Number":"41422","Weather Factors":"Unknown","Country":"United States","City":"Undisclosed"}