{"Object Flight Path":"Straight-line path,Other","City":"Fort Wayne","files":["/var/www/straped/mufon/html2text/41425.html.txt","/var/www/straped/mufon/mufon_json/41425.json","/var/www/straped/mufon/org/41425.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Disposition":"Unresolved","Summary":"Intense red object flying low from downtown Fort Wayne to Piere's spotlights..","Date of the Event":"08/03/2012 11:30 UTC","Tags":"City","Case Number":"41425","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around August 3rd 2012"],"Weather Factors":"Unknown","Log Number":"US-08042012-0024","Object Shape":"Circle, Disc, Fireball, Star-like","Date Submitted":"08/04/2012 03:16 UTC","Longitude":"-85.137351","Object Features":"Unknown","Latitude":"41.087643","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=41.087643,+-85.137351(41425)&iwloc=A&hl=en\"> mufon case (41425) map </A>","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsLast night (Aug 3rd, 2012) at around 11:30 a friend and I were outside on his front steps and witnessed a strange looking 'plane' in the sky. The entire thing was glowing a very, very bright red and it was not going out. We watched it not really thinking anything of it but then it went behind some trees and came out on the other side.. (This was about a mile or so away from us so all we could really see was this object from a distance.) Well when it came out it went a little higher in the sky and when it seemed to get close to the spotlights at Piere's night club it all of a sudden went dark - all forms of light on the craft vanished, went out, into a frame which then was gone. After that we continued to watch and saw nothing afterwards... no lights ever came back on whatsoever and nothing else was seen. Where we were standing it allowed us to see if it had maybe gone around the lights and came back on but this was not the case. Either way.. the lights were brighter than anything i've ever seen in the sky but the fact that as soon as it went by those spotlights it just.. was gone! It did not even dim.. it flashed out. We really hope that someone else saw this."]}