{"Region":"New Jersey","Summary":"Red/Orange Glowing Color, Round Orb Like, with Nucleus looking Center","Weather Factors":"Unknown","trends":["There have been no other sightings in Lyndhurst","This sighting has been favorited 1 time."],"Disposition":"Unresolved","Sighting Duration":"00:00:28","Tags":"City","Country":"United States","Source":"MUFON","Object Shape":"Fireball, Sphere","files":["/var/www/straped/mufon/html2text/41429.html.txt","/var/www/straped/mufon/org/41429.html"],"Object Flight Path":"Path with directional change","Date of the Event":"08/03/2012 11:05 UTC","City":"Lyndhurst","Viewing Distance":"Over One Mile","Log Number":"US-08042012-0027","Object Features":"Unknown","Latitude":"40.8034","Case Number":"41429","Longitude":"-74.117407","map":"<A HREF = \"http://maps.google.com/maps?q=40.8034,+-74.117407(41429)&iwloc=A&hl=en\"> mufon case (41429) map </A>","divs":["sighting details i saw my first ever real ufo, in lyndhurst, new jersey at about 11:00 pm, 8\\3\\2012, my son and i just came out of the store and got in the car, when i looked up and saw a red round object fairly high in the sky heading towards our direction, i jokingly said to my 16 year old son \"hey there's a ufo\"! we both looked up and stared intently, and then upon further staring, we both realized the object had no flashing lights common and mandatory with air planes and helicopters, or any type of aircraft for that matter. as it got closer we both realized this was no aircraft we had ever seen before, it was round, fairly large, it looked like a red bubble with red glowing lights all around it. kind of like a nucleus. it was not a meteor or comet or swamp gas or any of that other nonsense the government try's to make us believe, and it was not in any flight path for newark airport or teterboro airport. i know the flight paths very well. i see airplanes come past all day long, i know their exact flight paths, this object also had no \"sound\", totally silent, it was to see the least eerie but yet quite fascinating! the object flew over us then kept going fairly fast, then a few miles away it just \"vanished\", poof it was gone. my son was fortunate and smart enough to whip out his galaxy s cell phone and record a good 25 seconds or so of this ufo. and what is really great is it passed an airplane going in the opposite direction so you can see the comparison and to top it off new york city was the backdrop skyline of the ufo, so it is perfect for skeptics. it can be aligned perfectly and has a plethora of points of reference to prove it was definitely a real ufo! we kept looking for an hour afterwards but we did not see any more red glowing objects jutting across the sky! this was truly an amazing experience, i can't explain how totally and utterly great it is to experience such an event. i have been looking nearly my whole life and finally in my early 40's i see a bona fide ufo, how great is that? i will keep scanning the sky's night after nigh, looking for the other worldly visitors. signed, the lyndhurstinite"],"Date Submitted":"08/04/2012 09:31 UTC"}