{"Region":"Nevada","map":"<A HREF = \"http://maps.google.com/maps?q=39.505467,+-119.692686(41426)&iwloc=A&hl=en\"> mufon case (41426) map </A>","Summary":"I was driving, and in front of me I saw a huge light ball ascending in the sky, after a time, it stopped, hovered, then sped to the north, and upwards and out of sight.","Disposition":"Unresolved","Date Submitted":"08/04/2012 04:34 UTC","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/41426.html.txt","/var/www/straped/mufon/mufon_json/41426.json","/var/www/straped/mufon/org/41426.html"],"Object Features":"None","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around August 20th 1989"],"Date of the Event":"08/20/1989 09:35 UTC","City":"Reno","Source":"MUFON","Latitude":"39.505467","divs":["Sighting DetailsMy three children, at the time their ages were eight, twelve, and fifteen years of age, and I were driving home from the laundromat, when we noticed a HUGE bright light slowly ascending in the east sky, directly in front of us. At first, I thought it might be an airplane, since it seemed to come from the direction on the airport, several miles in the same direction. But my oldest son, interested in aviation, said, it didn't have any characteristics of an airplane. No flashing lights, and it was too large, it also moved in a manner none of us had ever seen an airplane, or helicopter move before. The light remained the same size the entire time it was ascending, and hovering. It didn't change size, until after, it stopped and hovered for a few minutes, before changing directions and speed. Very quickly, speeding in a diagonal north and upward at the same time, higher than airplanes fly, direction, and disappeared out of sight. It was late summer, and a cloudless night. Immediately, about 6 airplanes in pairs of two, followed, or attemted to. It was then, that I realized how enormous the object was, and that it had ascended from much further away than a few miles. The lights of the planes that followed were star size compared to the object, and the speed and movement in the night sky, of the planes were obviously identifiable as airplanes,(blinking lights, slow, even ascention, purposful direction). My oldest son and I, always interested in astrology, and believing in ufo's, realized and almost said at the same time, that it must have ascended many miles outside of the city, nearer to the military base located in the same direction, we were traveling, and the following airplanes, must have been military jets, because they were dispatched in pairs. There was no comparison in size, speed, or action of the object and the following aircraft. The airplanes couldn't even reach the same altitude, as the object. We were never afraid, but, more mesmerized, by the sighting. My children, now all in their 30's still remember it vividly, as if it happened moments ago. After all this time other odd experiences have happened to myself, and my oldest son, like being followed in our cars, late at night, by a small orange light, that disappears when cars pass going in the opposite direction. We believe them to be alien \"probes\",(that's the word that best describes it for us, anyway.) Since these occurances we have become true UFO enthusiasts, and unwavery believers in life on other planets, somewhere..."],"Longitude":"-119.692686","Case Number":"41426","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-08042012-0025","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Weather Factors":"Unknown"}