{"Summary":"Intense bright white orb type object moved at incredible spead, flashed, then disappeared","City":"Jersey City","files":["/var/www/straped/mufon/html2text/41420.html.txt","/var/www/straped/mufon/mufon_json/41420.json","/var/www/straped/mufon/org/41420.html"],"divs":["Sighting DetailsI live in Jersey City, NJ which is right across the river from NYC. It was about 9 pm at night on Aug 3, 2012 and I was sitting on my deck which faces east about to start a BBQ. My roommate had just walked into the apartment to get food ready. We are near all the major NYC airports so plans pass by in their approach and take off all day and night. There was a plane actually in its approach off in the distance. Helicopters are always in the area as well. The sky was overcast with clouds and I was about to get up to inside. This incredibly bright light orb type \"something\" appeared out of nowhere below the clouds, shot like a rocket at incredible speed, disappeared for a split second then flashed once then disappeared. I had never seen anything like it. My first thought, was that a meteor? but it was too close, big and it was below the clouds. A firework?, but there was no sound and the way it appeared then disappeared ruled that out. It was also too bright and not like a flame. More like an object. I couldn't actually tell its distance or how large it was since it all happened so fast. I sat for a bit in disbelief and daze. Now that I think about it, I actually couldn't really move. I just sat staring. I looked to see if the plane I was original watching was still in its approach in the distance and it was. What i saw was so fast and bright. It was almost like it popped into our world then popped out. If you weren't looking in the sky you wouldn't have noticed it. I told my roommate and of course he just said \"oh yeah\" and laughed. It happened the second he went inside unfortunately. We had no alcohol at that point and I am not on any medication or recreational drugs. Who knows maybe it was actually spiritual in nature. But if you think about it, major metropolitan areas would be perfect for UFO's to come and go if they can go undetected by radar. There are planes in the area at all times so no one is really looking or noticing. This is the first time I experienced something like this but I will never forget."],"Object Shape":"Bullet, Missile, Egg, Flash, Oval, Star-like","Source":"MUFON","Tags":"City","Case Number":"41420","Viewing Distance":"101-500 Feet, Unknown","Longitude":"-74.033047","Object Flight Path":"Straight-line path","Latitude":"40.716237","Date of the Event":"08/03/2012 09:00 UTC","Date Submitted":"08/04/2012 11:44 UTC","Country":"United States","Region":"New Jersey","trends":["There have been 7 other sightings in Jersey City","There were no other sightings in Jersey City on or around August 3rd 2012"],"Weather Factors":"Unknown","Log Number":"US-08042012-0021","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.716237,+-74.033047(41420)&iwloc=A&hl=en\"> mufon case (41420) map </A>","Sighting Duration":"00:00:02","Disposition":"Unresolved"}