{"trends":["There have been 6 other sightings in Golden Valley","There were no other sightings in Golden Valley on or around August 3rd 2012"],"Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsI was riding my motorcycle on the hwy outside wickenberg, AZ when I notice what looked like an airplane white strobe, then much larger red light appeared in its place. Then at the same time first light disappears another red light appeared some, maybe miles, from first light. This was a sequence of probably 4 lights moving equal distance from previous light location. This occured straight in front of me about 5 mile out 30 degrees from horizon. When last light went out another set appeared directly off my left still high in the sky and did the same action. After the last light went out I did not notice any more action. The strobe caught my attention and I thought it was an airplane, but when the first red light came on it was much larger and I found that curious. It held my attention and that is why I noticed the sequence of red lights poping on and off across the sky. Later I arrived in Wickieup, AZ I stopped at the gas station to ask if anyone had heard of sightings of lights in the sky and a man instantly reacted and explained what I saw before I described this to him. He saw them in the same area some 60 miles back down the road I saw them, with the exception that he saw white lights instead of the red I saw. I considered this a UFO because I've never seen any lights behave like that. Then the other curious thing was the instant relocation of the event maybe 10 or 20 miles across the sky. I consider that this might be a military op because of the small white strobe that could have been responsible for red light action across the sky."],"Date Submitted":"08/04/2012 07:01 UTC","Log Number":"US-08042012-0027","City":"Golden Valley","Latitude":"35.0217","files":["/var/www/straped/mufon/html2text/41428.html.txt","/var/www/straped/mufon/org/41428.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.0217,+-114.153244(41428)&iwloc=A&hl=en\"> mufon case (41428) map </A>","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-114.153244","Date of the Event":"08/03/2012 12:00 UTC","Tags":"City","Summary":"I saw strobe then large red light appear, disappear at that time another red light apear some distance repeating 3 or 4 times in strait line","Case Number":"41428","Object Flight Path":"Straight-line path","Object Shape":"Flash, Sphere","Region":"Arizona","Weather Factors":"Unknown"}