{"Country":"United States","Log Number":"US-08052012-0004","Object Flight Path":"Path with directional change","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.29595,+-84.74771(41439)&iwloc=A&hl=en\"> mufon case (41439) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/41439.html.txt","/var/www/straped/mufon/org/41439.html"],"Date Submitted":"08/05/2012 02:14 UTC","City":"Hicksville","trends":["There have been no other sightings in Hicksville","This sighting has never been favorited."],"Region":"Ohio","Object Shape":"Circle, Disc, Fireball, Flash, Sphere, Star-like","Sighting Duration":"00:20:00","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Unknown","Latitude":"41.29595","Case Number":"41439","divs":["Sighting Details I was sitting at my computer playing a game and decided to have a cigarette. On the way to the back door I checked the time on the microwave before walking outside, it was around 1:45am. I also took my dog outside with for a walk in the back yard. I usually star watch and look for UFOs late at night as a hobby. I have seen multiple throughout my life and one in particular that made me a believer. well, this night we had a bad thunder storm and had finished maybe 1hour before I had gone outside. We still have a lot of clouds going by with openings big and small. I noticed a white glowing orb, this isn't the first time I have seen them. It is the first time reporting them though. It was star like white glowing way off in the distance I cant say exactly how far away. It was directly above me in between clouds moving by. I watched it for about 5minutes, it stayed in a straight path. I thought maybe it was just a star and the fast moving clouds made it appear to be moving...well, the orb faded away and so I looked around to see if I saw anymore. I noticed many of the same type of objects in the sky some closer than others. Some appeared to pulsate others appeared to be spinning and some were fading in and out. The thing that was amazing to me was there were so many I couldn't count them, Im guessing 20 atleast. They were not stars because they were moving in all different directions, some would make sudden turns and others were going in the opposite direction. They are still outside in the sky as I write this. I tried to take pics with my cell phone but the objects were so far away that they wouldn't show up. I have seen these objects on multiple occasions from my back yard at night. My fiance, parents and friends have witnessed them with me also...I make it a strong point to show others so I know I'm not just crazy lol. If I spend 30min outside I almost always see atleast one of these objects. On an average week of going out a couple times a night for 15min each I see about 5 a week. Defiance seems to be a really active area for UFOs. I have seen multiple aswell as friends and family. Triangle shaped craft, spear shaped craft very low that make no noise, classic saucer shaped ufos, orbs, boxlike weird looking craft, and bright red airplane like craft. Going to go back out and watch them some more and call a buddy to watch also."],"Longitude":"-84.74771","Summary":"Multiple maybe 20+ white orb like objects flying high abobe the earth in and out of clouds.","Weather Factors":"Unknown","Date of the Event":"08/05/2012 01:45 UTC"}