{"trends":["There have been 6 other sightings in Exeter","There were no other sightings in Exeter on or around August 4th 2012"],"Date of the Event":"08/04/2012 10:15 UTC","Latitude":"42.981429","City":"Exeter","Object Shape":"Fireball","Object Features":"Unknown","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Several lights in the sky burning/glowing red/orange. Lights were holding formation, reminding me of the Big Dipper, but too bright, too big to be so. Other planes/jets could be seen flying across the night sky.","Source":"MUFON","divs":["sighting detailsmy wife and i were driving home with our dog from shopping in portsmouth, and were headed down to the local fresh water spring to fill up our water bottles. at the intersection of oak street and salem street, in exeter new hampshire, i noticed several bright lights in the sky. there were between 5-8 or so lights in the sky. they were red\\orange in color, and looked larger and brighter than anything else in the sky. i wish i actually counted them. these lights were unusual. they were in a formation that reminded me of the big dipper hanging in the sky, however if you think about the big dipper, at the bottom right of the spoon, there was another object flying in some sort of cirle while the other objects stayed motionless in formation. we continued to drive down, fill our water bottles up, and i pulled over to get a better look once we got back up the hill from the spring. at this point, the objects had broken formation, and were going their own ways. we drove home to brookside drive, and were only able to see one of the objects flying through the air. i called my brother to come out and see what we were seeing, and by the time he could come out, the object got a little bit smaller, and just blinked out. it was there one second, then gone the next before he could come out. this was when my wife realized that she had seen something unexplained. i had kind of joked it may be ufo's when we were saw them, but i'm convinced that we saw something unusual. i am an eagle scout, and have spent my fair share of time staring at the sky. i know that it wasn't typical airline flights, satellites, etc. this is unlike anything i've ever seen in my life. i would not take the time to write to you guys if what i saw hadn't left a serious impact on me."],"Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.981429,+-70.947755(41434)&iwloc=A&hl=en\"> mufon case (41434) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Region":"New Hampshire","Longitude":"-70.947755","Case Number":"41434","Date Submitted":"08/04/2012 11:46 UTC","Log Number":"US-08042012-0032","files":["/var/www/straped/mufon/html2text/41434.html.txt","/var/www/straped/mufon/org/41434.html"],"Country":"United States","Viewing Distance":"Unknown"}