{"Country":"United States","Date Submitted":"08/05/2012 02:55 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=24.711888,+-81.018415(41442)&iwloc=A&hl=en\"> mufon case (41442) map </A>","Summary":"4 hours of encounter witnessed and have lot of video of object","files":["/var/www/straped/mufon/html2text/41442.html.txt","/var/www/straped/mufon/org/41442.html"],"Region":"Florida","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Features":"Patterned Surface, Other","Date of the Event":"08/04/2012 02:30 UTC","Latitude":"24.711888","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-08052012-0007","Longitude":"-81.018415","divs":["Sighting DetailsMy wife and I are staying at our condo in Marathon FL. I awoke are 2:30 am and couldn't sleep. I decided to get some fresh air on the patio. At which time I saw the object in the night sky. I awoke my wife and she grabbed the binoculars. We both saw the object and a companion object we could not identify. The encounter lasted from 2:30am to approximately 6:30 am. I continued to film all morning until 6:30 am - my wife went back to sleep around 2:45 am. I was scared. I shot snippets of video throughout the entire evening. Some longer than others. At one time the object departed soon after I heard a jet noise - the main object began blinking bright red lights as it with it's companion moved off north westerly and disappeared (roughly 4:45am), then the object came back a few minutes later, hung around until the sun started coming up only a few minutes later. The companion (at least one, at one time appeared there may be multiple) at one point must have moved off and over to the south eastern portion of the sky and was moving in sort of a sweep which at one point swung around and appeared to me at least to be coming towards my location - at which point I dove inside my condo, but later went back out to film again. I have lots of video. The stills I'm attaching are some of the best images I could grab from the video on my laptop. They are not retouched. I am requesting the images not be published for public use or used in any other manner - and as they are taken by me are copyright 2012 Carl V. Smith, and not to be used, published or rebroadcast except for mufon analysis (you'll likely want to see the videos). I also took a few stills at the start of the encounter on my DSL but they aren't great."],"Case Number":"41442","Weather Factors":"Unknown","City":"Marathon","Object Shape":"Cross, Other","Tags":"City","trends":["There have been 13 other sightings in Marathon","There were no other sightings in Marathon on or around August 4th 2012","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed"}