{"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"British Columbia","Country":"Canada","Latitude":"49.267496","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=49.267496,+-123.109357(41445)&iwloc=A&hl=en\"> mufon case (41445) map </A>","Disposition":"Unresolved","Object Shape":"Star-like","trends":["There have been 33 other sightings in Vancouver","There was one other sighting in Vancouver on or around August 5th 2012"],"Summary":"Satellite like object sudden directional change opposite direction","Object Features":"Unknown","Longitude":"-123.109357","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","City":"Vancouver","Date Submitted":"08/05/2012 04:15 UTC","divs":["Sighting DetailsVancouver celebrated tonight \"Celebration of Lights\" fireworks.During the fireworks noticed one strange hovering object in the background , moving up and down, changing colors red, green and white, then disappeared below horizon. Afterwards, I went home and decided to check the night sky with my night vision monocular. I could not believe my eyes how many fast, hovering, satellite like objects I noticed and filmed. Even some came very close to the downtown core of Vancouver and what seemed to be a plane, hovered, red light went to bright white light, then just red dot and travelled very slow entire city,no sound and seemed to be about 1000 Ft. I did not capture this one on video as was quite stunned. Next I captured what i thought was a satellite definately turned out to be a UFO as it travelled from West to East approx. 60 degrees above the horizon for a few seconds and then suddenly before hiding behind a building, immediately stopped and \"bounced\" back traveling opposite direction, so amazing and captured on Night vision but pixelated due to cheap DVR...I hope many other people have reported what I have seen.I could not believe the amount of UFO's,!!!! I am 110% believer now.."],"Log Number":"CA-08052012-0009","Case Number":"41445","files":["/var/www/straped/mufon/html2text/41445.html.txt","/var/www/straped/mufon/org/41445.html"],"Date of the Event":"08/05/2012 11:50 UTC"}