{"Latitude":"39.329718","Date of the Event":"07/03/2012 09:45 UTC","Date Submitted":"08/05/2012 01:07 UTC","Region":"Indiana","Tags":"City","Viewing Distance":"21-100 Feet","City":"West Harrison","Case Number":"41456","map":"<A HREF = \"http://maps.google.com/maps?q=39.329718,+-84.848955(41456)&iwloc=A&hl=en\"> mufon case (41456) map </A>","divs":["Sighting Detailsmy wife and i were driving home from daughters house on country road in Franklin county Indiana,9:45 pm 7-3-2012. the objects were so low and brilliantly colored right in front of our wind shield.there were two objects about 50 feet apart. my wife said what are those things and my mind went to the only thing i have ever seen fly that low in formation and i said probably military copters. in the same breath i said no they aren't and slammed on the brakes. we just looked up at them. when the objects came directly over us they made a abrupt 90 degree turn. it was so strange like special effects in a movie. i couldn't beleave what i just saw. the objects i estimate to be traveling about 30 miles an hour, very slow. they went over the farm house on the left side of the road so i sped forward, pulled off the side of the road and my wife and i got out of the car,so we could remain in sight of them. we continued to watch them fly over a soybean field,still very slow. the man that lives in the farm house came along on his bicycle,i know him so i said hey Allen have you ever seen UFO and he said no,so i pointed them out to him ,so we all three watched the two objects fly away. about a minute later i looked up and another same as the first two flew over us following the first two's exact path.i said to my wife there's another one. about a minute later another same as first three flew right over us and same path. all three of us watched till out of sight,there was not a sound or exhaust trail emitted from any of the objects. these objects were pulsating orange to almost red like the beating of a heart. they were about the size of an automobile,they looked like four to six round balls about four feet in diameter fastened together. there were no wings or tail or sign of any engine. all the round balls were equally lite from the inside. these objects seemed not to be flying but just there and moving at will in any direction. they gave us the feeling of divinity or god like,the feeling that they are a living thing,not a space craft. we had a feeling of amazement,myself personally an obsession to know and understand what we had just witnessed."],"Log Number":"US-08052012-0019","Object Features":"Patterned Surface, Other","Longitude":"-84.848955","files":["/var/www/straped/mufon/html2text/41456.html.txt","/var/www/straped/mufon/org/41456.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Shape":"Oval, Other","Summary":"4 UFOs pass right over our car while driving home","Disposition":"Unresolved","Country":"United States","trends":["There have been 3 other sightings in West Harrison","There were no other sightings in West Harrison on or around July 3rd 2012"],"Source":"MUFON","Weather Factors":"Unknown"}