{"Region":"Texas","Viewing Distance":"Unknown","Longitude":"-96.345027","Date Submitted":"08/06/2012 12:28 UTC","City":"Cat Spring","files":["/var/www/straped/mufon/html2text/41468.html.txt","/var/www/straped/mufon/org/41468.html"],"Source":"MUFON","trends":["There have been no other sightings in Cat Spring","This sighting has been favorited 1 time."],"Date of the Event":"08/05/2012 12:00 UTC","Latitude":"29.885525","Disposition":"Unresolved","Log Number":"US-08062012-0001","Object Shape":"Star-like","divs":["Sighting DetailsMy dad and I had gone to walk our dog along the road as we do every evening around 10 PM. I had looked up at the stars as my dad I generally do because we love to look at them and contemplate the vastness of our universe. At first I thought I saw a bright star, but it was too bright and too big. It looked as if there was a plane flying with the brilliance 10 giant spotlights blending into one. It was very high up. Then I noticed it was moving across the sky. I said \"Look, do you see that?\" to my dad and I pointed up. My dad seconded my sighting. It moved steadily along the sky seeming to get dimmer and dimmer as it went.It never reached the horizon and never dipped below the tree tops. I assume this was its assent into space. It seemed to move so slow yet so fast at the same time. We just stared at it until it was out of sight repeating \"Wow\" and \"Look at that\". We both just continued our stroll with our dog discussing the fact that we had just seen a UFO, and how it was surprising. After that we continued to search the sky hoping to see another surprise in the sky. We noticed an increase in over head aircraft activity. We saw 5 or 6 airplanes in less then 10 minutes time."],"Country":"United States","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Tags":"City","Object Features":"Unknown","Case Number":"41468","map":"<A HREF = \"http://maps.google.com/maps?q=29.885525,+-96.345027(41468)&iwloc=A&hl=en\"> mufon case (41468) map </A>","Sighting Duration":"Undisclosed","Summary":"Spotted a bright light moving steadily across the sky from the southeast to northwest. UFO disappeared slowly."}