{"Tags":"City","trends":["There have been 2 other sightings in Chesterfield","There were no other sightings in Chesterfield on or around July 31st 2012"],"Weather Factors":"Unknown","Latitude":"42.66278","files":["/var/www/straped/mufon/html2text/41467.html.txt","/var/www/straped/mufon/org/41467.html"],"Viewing Distance":"Unknown","divs":["Sighting DetailsWent on my porch at around 9:45 pm. Noticed 2 pretty bright stars in sky that caught my attention in the sky above and past the treeline of my across the street neighbors house. Its was nearly dark but not quite totally. As i looked at the stars i saw what i can describe as a \"hockey puck\" shaped light or object. It was much much larger than any planes in the sky. So much larger that ir could not have been a plane at altitude. I live near an ANG base so i see and hear planes and helicopters all the time and i know i wasnt either. This thing would \"strobe\" like a light in a haunted house but was almost glittering also (hard to explain). It would strobe for a second or two, then go dark. You COULD NOT see it at all until it strobed. Every ten seconds or so it would strobe, but each time it would be slightly higher or lower than the time before. It was dead quite and stayed in a perfect vertical line (no left or right movement). Eventually as it strobed it slowly descended until finally it went below the treeline and i could no longer see it. I go out between 9 and 11 each night since, but havent seen it again. I tried to take pics but my cell phone cam kept having the autoflash go off so i couldnt get it. I tried to use the vid camera but by the time i fumbled around with it, it was gone. I will continue to look nightly in the hopes of getting a pic or vid."],"Sighting Duration":"Undisclosed","Case Number":"41467","Log Number":"US-08052012-0033","Date Submitted":"08/05/2012 11:17 UTC","Summary":"Strobe like white light in sky","Longitude":"-82.8425","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.66278,+-82.8425(41467)&iwloc=A&hl=en\"> mufon case (41467) map </A>","Date of the Event":"07/31/2012 12:00 UTC","City":"Chesterfield","Object Features":"None","Region":"Michigan","Object Flight Path":"Stationary,Hovering then path","Country":"United States","Object Shape":"Square, Rectagular","Source":"MUFON"}