{"Tags":"City","City":"Pickering","Object Shape":"Star-like","Latitude":"43.843312","Case Number":"41464","Date Submitted":"08/05/2012 10:38 UTC","trends":["There have been 2 other sightings in Pickering","There were no other sightings in Pickering on or around August 5th 2012"],"divs":["Sighting DetailsAs stated above, we were just walking the dog, and noticed a warm, bright red-orange light moving above us in the sky. It felt like it was much closer than an airplane would be, with no blinking lights, and moving faster than a plane does in the sky, hence feeling why the distance felt closer. There was no sound, as many airplanes, jets, helicopters make... and it was moving more organically, smooth and fast, yet not in a straight line. We watched it for a few moments as it passed over us, wishing we had our iPhones with us to catch it. We both were rather stunned, and I wished there were others walking so we could show them, and ask them what they thought. It felt like it was not of this Earth, and my partner is familiar with pyrotechnics, and this was not some random firework. (Also it lasted far too long for that.) Then, it faded into the night, but I didn't feel like it was distance that made the light fade. It was more like it went out, since it faded very quickly all of a sudden, and had been very bright throughout the trajectory above us. It was quite lovely, yet a little unnerving at the same time."],"Country":"Canada","Source":"MUFON","Region":"Ontario","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Longitude":"-79.080578","files":["/var/www/straped/mufon/html2text/41464.html.txt","/var/www/straped/mufon/org/41464.html"],"Object Features":"Unknown","Log Number":"CA-08052012-0031","Date of the Event":"08/05/2012 09:45 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Summary":"Walking home after dusk, dark sky we noticed a very bright, red-orange light moving across the sky right above us. It was NOT a plane, or a helicopter. It's path was smooth, not sinking, but it wavered... then it disappeared.","map":"<A HREF = \"http://maps.google.com/maps?q=43.843312,+-79.080578(41464)&iwloc=A&hl=en\"> mufon case (41464) map </A>"}