{"Case Number":"41469","Object Features":"Dome","Date Submitted":"08/06/2012 01:23 UTC","Sighting Duration":"Undisclosed","Log Number":"US-08062012-0002","Latitude":"46.733273","Weather Factors":"Unknown","City":"Undisclosed","Disposition":"Unresolved","divs":["Sighting DetailsMy fiance and I were in our apartment that has two levels. We went upstairs to the top level around 2am to go to bed and I looked outside and it was a very clear light. Above the buildings behind our apartment we saw a bright orange light and I noticed the light because it was brighter than all the stars in the sky. At first I thought it might be a planet because it was not moving, however I noticed that it started ascending slowing from east to west. At first, it would get brighter and then dim out and come back again. Eventually, it started getting brighter and brighter in the sky until it was clearly brighter than anything else in the sky. We watched the object hover and ascend for over two hours. It finally stayed the same brightness and at certain points it looked like a five point star. The pictures (we took 16 of them) looked like a small orb object and when we looked at the pictures we noticed that we really had something strange. While we were looking at the object, we were confused, excited, scared, and intrigued by the object. I wanted to keep watching the object, however it was so late that I went to bed. It was still hovering when I went to bed so I am not sure what happened after that with the object."],"Longitude":"-94.67791","Summary":"Brighter than a star-like object, orb, reddish, ascending, and pulsating.","Source":"MUFON","Date of the Event":"08/05/2012 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/41469.html.txt","/var/www/straped/mufon/org/41469.html"],"Object Shape":"Circle, Fireball, Star-like","Region":"Minnesota","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=46.733273,+-94.67791(41469)&iwloc=A&hl=en\"> mufon case (41469) map </A>","trends":[],"Object Flight Path":"Path then hovering","Viewing Distance":"Over One Mile"}