{"Date Submitted":"08/05/2012 07:47 UTC","Longitude":"-95.36591","City":"Houston","Tags":"City","Object Shape":"Blimp, Cigar","Date of the Event":"04/17/2010 08:30 UTC","Latitude":"29.768303","Disposition":"Unresolved","Region":"Texas","Object Flight Path":"Straight-line path","Country":"United States","Weather Factors":"Unknown","Log Number":"US-08052012-0028","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy friend and I were taking a short cut across a field to a neighborhood party. The open field is about 50 yards wide and separates the neighborhood from Buffalo Bayou. It was April 17, 2010, 8:30 p.m. on the west side of Houston, TX and had just started to get dark. Suddenly, up ahead and about 20 to 30 yards above the trees, a white, luminous cigar shape object a little larger than a bus was coming toward us. The object was very bright and glowed. We stopped in our tracks and just watched the thing cruise toward us at about 15-20 mph without any sound. The object was travelling in a straight line directly over the field and parallel to the bayou. I turned as it went past me and watched it as it disappeared behind the trees. It was then that I could faintly see a white structure underneath the luminous light. I was only able to see it for 10-12 seconds. It was surreal and I could not believe my eyes. I said to my friend, \"did you see that?\" However, it scared her so bad she said she did not want to talk about it. She said the last thing she needed was to get abducted. At that point, I have to admit that I got scared so were started walking very fast to our destination. I checked the internet to see if there were any reported sighting but did not see anything. I have never seen anything like this and I can't believe it was not spotted by someone else since it was so big, bright and low to the ground. I have no explanation to what it could have been besides a UFO."],"Case Number":"41462","Sighting Duration":"00:00:10","Summary":"We saw a white luminous cigar shaped object bigger than a bus fly overhead about 20 yards over the treetops. It went in a straight line with no sound.","map":"<A HREF = \"http://maps.google.com/maps?q=29.768303,+-95.36591(41462)&iwloc=A&hl=en\"> mufon case (41462) map </A>","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around April 17th 2010"],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/41462.html.txt","/var/www/straped/mufon/org/41462.html"],"Source":"MUFON"}