{"divs":["Sighting DetailsMy son and I pulled into our driveway at 11:05pm EST and witnessed 10 - 12 orange glowing spheres passing between the townhomes to our right and our building (approximately 80 degrees of sightline)at a slow pace. They did not blink but did appear to pulsate slightly (perhaps due to atmosphere). I can not estimate how far away they were but were approximately the size of a pencil eraser from our vantage point. We did unroll the windows and turn the car off to listen for sounds. There was no helicoptor or airplane noise (which is very common in our area). I did try to photograph with my cell phone but due to the brightness of the moon I was unable to get a photo of the objects). We watched for appoximately 5 minutes. I then put my son to bed and went upstairs to look our my east facing bedroom window. I witness two of the same speres continuing their eastward trek until I lost sight of them (due to trees obstructing my view). At first when I saw the first one, I thought it was a very bright planet, by the time the third one appeared I knew it was definately something else. I thought military helicopter but there was no sound (and they are not usually lit up as these were). Once we saw the whole \"parade\" I was thinking UFO. Objects went out of sight due to structural (building) and horizon (trees) obstructions."],"Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Latitude":"40.820074","Tags":"City","Object Features":"Unknown","trends":["There has been one other sighting in West Orange","There were no other sightings in West Orange on or around August 4th 2012"],"Date of the Event":"08/04/2012 11:05 UTC","files":["/var/www/straped/mufon/html2text/41471.html.txt","/var/www/straped/mufon/org/41471.html"],"Disposition":"Unresolved","Object Shape":"Sphere","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.820074,+-74.265596(41471)&iwloc=A&hl=en\"> mufon case (41471) map </A>","Log Number":"US-08062012-0004","City":"West Orange","Summary":"Orange spheres (12 - 14) slowly flying from south to east over northern nj/","Case Number":"41471","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Region":"New Jersey","Date Submitted":"08/06/2012 09:13 UTC","Longitude":"-74.265596"}