{"Log Number":"US-08062012-0006","Object Shape":"Star-like","Object Features":"Appendage(s)","Date of the Event":"08/04/2012 03:00 UTC","Tags":"City","Summary":"Brilliant White, star-like but immense in size, hovered and emitted a red orange beam, moved towards us then retreated.","Object Flight Path":"Other","City":"Cabot","trends":["There have been 3 other sightings in Cabot","There were no other sightings in Cabot on or around August 4th 2012"],"Latitude":"34.981234","Date Submitted":"08/06/2012 09:02 UTC","Viewing Distance":"Over One Mile","Country":"United States","divs":["Sighting DetailsAround 3AM on the 4th of August, I took my dogs outside for a walk near my apartment in Cabot, Arkansas. As I was headed for our front door, I noticed a very large, bright object above the the roof of the building. We have C-130's fly through here all the time on their approach to Little Rock AFB so I just assumed it was them but I stopped to watch it because the color of light seemed odd. I quickly realized this object was not a C-130 since I could not hear it like the others that fly over, and it never moved on, it just hovered there. I was not sure what it was, but it was large, brilliant white, and had what looked to be spikes of light all over it, especially the top. It was not round, it was more...horizontally oblong. I quickly went in to get my wife and my phone, not sure what I was seeing but certain it was something rare. When we got back outside, she was surprised by what she saw as well. But things got even stranger, and I realized this was no satellite or space station, or astral body we were seeing, when a red-orange beam slowly projected from the bottom of the object. It was not like a laser, it was broad and projected slowly, not suddenly, pointed off to our right, and looked to be miles long. By this time, we were startled by this development but became a bit frightened when it began moving toward us as though to pass over. I ran to get a neighbor up because I did not want this to be witnessed by just my wife and I. But by the time my neighbor got out there, it had backed off to its original position, and slowly retracted the beam. The neighbor did witness the object however, and said she also saw the white spikes of light on the object, and noticed how large and brilliant it was in the night sky. We have been told this was just swamp gas, a weather balloon, and the planet Venus, which we do not believe. Venus does present itself in that part of the sky, I observed but not until closer to 5 or 6 in the morning, and does not shoot out beams. At the time I shot my videos, and pictures, Venus was just coming into view over the horizon, and that view of the horizon is obstructed by dense trees."],"Region":"Arkansas","Longitude":"-92.016932","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=34.981234,+-92.016932(41473)&iwloc=A&hl=en\"> mufon case (41473) map </A>","Sighting Duration":"03:00:00","Case Number":"41473","files":["/var/www/straped/mufon/html2text/41473.html.txt","/var/www/straped/mufon/org/41473.html"]}