{"Viewing Distance":"Over One Mile","divs":["sighting detailsi was pulling into my work parking lot admiring the sun rise and as i began turn into the parking lot i noticed a bright orb above some cloud cover approximately 65 degrees above the horizon. i looked at the road to ensure i wasn't going to hit anything and looked back up. the orb was brighter and was descending through the clouds. i could see the brightness as one cloud completely enveloped it. as it passed through the orb was extremely bright and large - almost flame like, but with a definite 3-d definition to it. it was a yellow \\ white color (i am somewhat color blind, but am pretty certain this was the color). it appeared to me to hold the same characteristics as a large falling star, but was moving slowly and had no tail. i looked down at the road again to pull into a space and looked back up and it was gone. i searched the sky for another 10 minutes and couldnt locate anything out of the ordinary. as i think back on it the one thing that kept coming to mind was how 'real' it was. not like i just caught a glimpse of a small light briefly in the sky. no, this was as real as the clouds and trees around me. though i was an unknown distance away from it, i had the impression it was large in size - not real small. it was a bright, glowing orb with light that fluctuated (not a rhythm like pulse)."],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Longitude":"-83.913569","Object Features":"None","Summary":"Large bright orb decending through clouds","Latitude":"35.963158","Region":"Tennessee","Date of the Event":"08/06/2012 07:36 UTC","Source":"MUFON","Log Number":"US-08062012-0005","City":"Knoxville","map":"<A HREF = \"http://maps.google.com/maps?q=35.963158,+-83.913569(41472)&iwloc=A&hl=en\"> mufon case (41472) map </A>","trends":["There have been 50 other sightings in Knoxville","There was one other sighting in Knoxville on or around August 6th 2012"],"Sighting Duration":"00:00:05","Weather Factors":"Unknown","Tags":"City","Country":"United States","Date Submitted":"08/06/2012 09:21 UTC","files":["/var/www/straped/mufon/html2text/41472.html.txt","/var/www/straped/mufon/org/41472.html"],"Case Number":"41472","Object Shape":"Fireball, Sphere"}