{"Summary":"I just looked up, thought I saw something, snapped a picture","Object Shape":"Sphere","Source":"MUFON","Disposition":"Unresolved","Case Number":"41470","divs":["Sighting DetailsI was sitting in my back yard just relaxing. I was watching the clouds and I thought I saw something zip into view. It just seemed to appear and looked like a shiny, metallic ball floating under the clouds. I took out my phone and snapped several pictures. It only appeared in one picture and was gone. It only appeared for a few seconds and seemed to appear and then disappear very quickly. When I first saw it I was surprised because we see airplanes from the airport all the time. I know what they all look like and what their general flight path and speeds are. I knew right off that this wasn't an airplane. Although it was in the general flight path it was higher than I have ever seen a plane taking off and way faster. In fact, I snapped the pictures because I wasn't sure I saw anything at all. The picture is actually clearer than what I saw because it came and went very quickly. I actually felt more surprised when I looked at the pictures I took and saw that in one frame there was, in fact, something there. I was busy taking pictures and didn't see the object leave or which way it went. I did notice that the image appears to have a energy field around it in the photo. I didn't see that. All I saw was a metallic object with no wings, completely silent, and very fast. I will include a couple more pictures I took when I took this one. In an attempt to find the thing I took pictures at different angles but, it only appears in the one picture."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.959582,+-80.003808(41470)&iwloc=A&hl=en\"> mufon case (41470) map </A>","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.959582","Region":"North Carolina","Tags":"City","files":["/var/www/straped/mufon/html2text/41470.html.txt","/var/www/straped/mufon/org/41470.html"],"Object Flight Path":"Straight-line path","City":"High Point","trends":["There have been 5 other sightings in High Point","There were no other sightings in High Point on or around August 5th 2012"],"Sighting Duration":"00:00:10","Date Submitted":"08/06/2012 07:51 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Date of the Event":"08/05/2012 03:00 UTC","Log Number":"US-08062012-0003","Longitude":"-80.003808"}