{"divs":["Sighting DetailsDriving eastbound on rt 570 through Lakeland. Observed object at my 2 o'clock moving to my left and eventually behind my immediate tree line. Object was in the air for over 1 minute. From a distance appeared that it was sparks trailing from a plane engine. As I got closer realized it wasn't sparks, but rather lights rotating around a disc. The lights were sequentially lighting counter clockwise with occasional skips. The object wasn't exactly parallel to the ground, but rather pitched at an angle of 5-10 degrees. There were other cars on the highway and seemed to be a populated area. I was able to see the object from a few different angles as it moved from my right to left. There was enough daylight to clearly see it was not a plane, helicopter, blimp, or balloon. My jaw dropped when I saw it and called my family while seeing it. I regret not attempting to take a video or picture with my phone because I knew even while seeing it that I should, but between driving and watching the object was so astonished I really didn't care if there was proof."],"Date Submitted":"08/06/2012 11:18 UTC","Object Shape":"Disc","Summary":"Disk or saucer with rotating lights around the outer diameter of the object","Longitude":"-81.943364","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"Undisclosed","Tags":"City","City":"Lakeland","Date of the Event":"08/03/2012 08:30 UTC","Object Features":"None","Latitude":"28.047295","Source":"MUFON","Region":"Florida","Log Number":"US-08062012-0007","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41474.html.txt","/var/www/straped/mufon/org/41474.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.047295,+-81.943364(41474)&iwloc=A&hl=en\"> mufon case (41474) map </A>","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around August 3rd 2012"],"Case Number":"41474","Object Flight Path":"Straight-line path,Path then hovering"}