{"map":"<A HREF = \"http://maps.google.com/maps?q=39.107806,+-94.573307(41481)&iwloc=A&hl=en\"> mufon case (41481) map </A>","Log Number":"US-08062012-0014","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Circle","Source":"MUFON","Region":"Missouri","Object Flight Path":"Path then hovering","City":"Kansas City","Latitude":"39.107806","Date Submitted":"08/06/2012 05:34 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/41481.html.txt","/var/www/straped/mufon/org/41481.html"],"Case Number":"41481","Summary":"orange orb ascended and descended short distances, then moved laterally and gradually faded until gone","divs":["Sighting DetailsFive of us went to sit on my back patio around 9 p.m. We sat, talking, in an enclosed circle of chairs when, around 9:30 p.m., the two who sat facing south both said \"what in the world is that?\" and pointed to a large (approximately 5-6X the size of a large star in the night sky) orange orb to the south. The other three of us turned to observe, and we all jumped to our feet in excitement and curiosity. We saw the orb ascend vertically, slowly, over a bank of trees in the distance for approximately 10 seconds, then descend the same distance. It then moved horizontally, slowly, to our right for about 15 seconds before it gradually faded and disappeared over the next 15-20 seconds. We had sent someone into the house to get a camera after the first few seconds of our sighting the orb, but it had disappeared by the time she returned. Upon glimpsing the object, all of us recognized immediately that it was nothing we had seen before in the sky. The brightness and size of the orb, its vibrant orange color, and its ability to change directions alerted us to this being a UFO. We were all mesmerized and unafraid, then disappointed when it faded from view. One speculated that rather than the orb disappearing, it may have sped off away from us until it gradually faded from view. We all also speculated that it was perhaps moving toward Whiteman Air Force Base, since we were in south Kansas City and the object was south and east of us."],"trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around August 5th 2012"],"Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-94.573307","Object Features":"None","Date of the Event":"08/05/2012 10:04 UTC","Tags":"City"}