{"Weather Factors":"Unknown","Sighting Duration":"00:10:00","City":"Glendale","Disposition":"Unresolved","Case Number":"41488","Longitude":"-118.25943","Log Number":"US-08062012-0021","Tags":"City","Country":"United States","Date Submitted":"08/06/2012 08:59 UTC","Region":"California","files":["/var/www/straped/mufon/html2text/41488.html.txt","/var/www/straped/mufon/org/41488.html"],"Latitude":"34.163449","Date of the Event":"08/02/2012 12:00 UTC","trends":["There have been 13 other sightings in Glendale","There were no other sightings in Glendale on or around August 2nd 2012"],"Object Shape":"Circle, Flash, Sphere, Star-like, Unknown","divs":["sighting detailsi was on the telephone speaking w\\ a friend while smoking on my balcony. i noticed what i thought was a shooting star in the corner of my eye. so while still on the phone i just stared at it until i realized that it was moving. i just hung up on my friend and immediately yelled for my wife to wake up and to come see. bleary eyed she got up and noticed the light as well as noting the movement. this is not being the first object we have seen in the same general patch of sky. having reported the other as well about 6-7months ago. this time however, i actually managed to film the light for a minute or so w\\ my iphone. you can clearly see the light, and see that it is moving. i attempted to verbally shoot off any and all info as it was happening. i wanted to say that i thought it was a remote controlled toy of some kind but these factors changed my mind: 1. we face burbank airport as i've stated before and there was zero noise. i am very familiar w\\ various aircraft and this was simply a bright light. no shape. no noise. 2. i know of no toy that would have the kind of range that would be nescessary to controll this thing from ground. it simply covered to much ground before i started filming. 3. sighting was about midnight on thursday in a quite, upper middle class neighborhood . 4. immediately after it descended below the tree levels i heard all sorts of dogs barking from the general direction."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Object Features":"None","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Summary":"Bright blue star like object. Changed directions multiple times. No noise. Flashing","map":"<A HREF = \"http://maps.google.com/maps?q=34.163449,+-118.25943(41488)&iwloc=A&hl=en\"> mufon case (41488) map </A>"}