{"Date of the Event":"06/20/2012 11:30 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41482.html.txt","/var/www/straped/mufon/org/41482.html"],"Longitude":"-72.00963","Summary":"Three orange lights, larger than a/c nav lights in a triangle formation","Date Submitted":"08/06/2012 06:36 UTC","Region":"Massachusetts","Latitude":"42.087461","City":"Southbridge","map":"<A HREF = \"http://maps.google.com/maps?q=42.087461,+-72.00963(41482)&iwloc=A&hl=en\"> mufon case (41482) map </A>","Case Number":"41482","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Southbridge","There were no other sightings in Southbridge on or around June 20th 2012"],"Country":"United States","Disposition":"Unresolved","divs":["sighting detailsi had taken the dogs out for last break at 11:30 p.m. i'm accustomed to seeing jets at a very high altitude, as we're frequently under a flight path. our area is fairly rural, with not a lot of light pollution. as is usual, i initially heard, then saw, a commercial jet, very high, going west-east, south of my position. also, as is usual, i looked around to observe the stars. i looked ne, where there is even less light pollution, and saw three large orange lights in triangle formation flying in the opposite direction to most commercial traffic we see. the lights were larger than normal exterior a\\c lights, pure orange, and steady. they flew approximately east-west in a straight line, and held the same altitude. there was no sound. it couldn't have been a light a\\c from our local small a\\p, as there was no noise. having been in the airline industry, i recognize nav and other exterior a\\c lights, i also flew into us bases during desert storm, and recognize afterburners in night sky. these lights looked completely different. if the craft was at the height of a commercial jet, it was much larger than that. the speed was much faster than the time it normally takes for a commercial jet to overfly the clearing i was standing in. if it was a light a\\c, flying at a lower altitude, which would explain the size, (but not the size of the lights), then why was there no sound? haven't seen anything like it before or since."],"Object Shape":"Triangle","Sighting Duration":"00:00:04","Tags":"City","Object Features":"Unknown","Log Number":"US-08062012-0015"}