{"Case Number":"41483","City":"Southbridge","Tags":"City","Source":"MUFON","Country":"United States","Log Number":"US-08062012-0016","Date Submitted":"08/06/2012 06:57 UTC","Summary":"Two very shiny cylinder shaped craft, appx 20 lengths apart, conical contrail on 2nd one","Weather Factors":"Unknown","Disposition":"Unresolved","Region":"Massachusetts","divs":["sighting detailsat about 6:30 p.m., i pulled into the parking lot of local restaurant to p\\u t\\o food. it was a beautiful, clear blue sky, so i looked up. i saw two extremely shiny, silver, cylindrical (cigar shaped) craft, which seemed to be at a very high altitude, traveling approximately east-west. they were about 20 lengths apart, and seemed very large compared to commercial jet traffic in the area, particularly if they were indeed at that altitude. the 2nd one had a very short conical contrail, barely visible. the 1st one had no contrail. they seemed to cover the distance at a greater speed than normal commercial traffic. i waited about 2 minutes until they had completely disappeared from my view. i had lost them for a short time (it was a cloudless sky), and then found them again further west. i thought i would eventually be able to make out features like wings, tail fin, etc., once their orientation to me changed, but they remained featureless. i am ex-airline industry, and flew into us bases during desert storm, so i have a handle on distinguishing commercial and military aircraft. it was one of those things you see, and your gut tells you it's not normal. this event happened about a week after i had observed an odd flyover of 3 orange lights in a triangle formation at our rural home at about 11:30 p.m."],"Latitude":"42.067113","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/41483.html.txt","/var/www/straped/mufon/org/41483.html"],"Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=42.067113,+-72.008208(41483)&iwloc=A&hl=en\"> mufon case (41483) map </A>","Object Features":"None","Longitude":"-72.008208","Date of the Event":"06/28/2012 06:30 UTC","Object Shape":"Cigar","trends":["There have been 2 other sightings in Southbridge","There were no other sightings in Southbridge on or around June 28th 2012"]}