{"files":["/var/www/straped/mufon/html2text/41500.html.txt","/var/www/straped/mufon/org/41500.html"],"Latitude":"41.256806","Disposition":"Unresolved","Object Shape":"Cylinder","Date of the Event":"08/06/2012 10:33 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Tags":"City","Object Features":"None","Date Submitted":"08/07/2012 12:53 UTC","trends":["There have been 11 other sightings in Council Bluffs","There were no other sightings in Council Bluffs on or around August 6th 2012"],"Weather Factors":"Unknown","Source":"MUFON","Case Number":"41500","City":"Council Bluffs","Longitude":"-95.837246","Log Number":"US-08072012-0002","Region":"Iowa","divs":["Sighting DetailsI was using a social network on my iPod touch on my front step and periodically I looked up to the stars as I am an avid stargazer. I seen a light coming over the tree line to my left and didn't see a strobe like an airplane or hear any noise. I watched it till it came into perfect veiw above me and I knew I needed a witness. I ran in the door and grabbed my mom, when we got back outside the object was in the same place as it was when I left it then began it's flight path again. As it moved it preformed loops and sharp movement in all directions like it was being controled by a 4 year old with a joystick. We both watched for two more minutes until it was out of sight. When I attempted to report the event, my iPod had stopped working till exactly an hour had passed since I had began my attempts. After I still feel compelled to chase it down but I know it's not going to be found. I have seen three others in my life and I'm begining to believe that this town has many ufos."],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.256806,+-95.837246(41500)&iwloc=A&hl=en\"> mufon case (41500) map </A>","Country":"United States","Summary":"Was stargazing when I seen a bright white light come over the tree line,I a grabbed witness and returned to it bring in the same place after moving then it began again."}