{"Date Submitted":"08/07/2012 09:54 UTC","Disposition":"Unresolved","Source":"MUFON","Case Number":"41513","files":["/var/www/straped/mufon/html2text/41513.html.txt","/var/www/straped/mufon/org/41513.html"],"Object Flight Path":"Stationary","Log Number":"US-08072012-0014","Region":"Ohio","Date of the Event":"08/18/1972 12:00 UTC","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-84.622004","Sighting Duration":"01:00:00","Object Features":"Unknown","Country":"United States","Weather Factors":"Unknown","divs":["sighting detailsi was on my front porch watching the kids play in the front yard when i noticed this bright diamond shaped oject motionless in the sky. it was a bright cloudless day, and it was the only thing in the sky. i got out my mamyia 35 mm camera w\\ 205 mm telephoto lens and doubler and tripod. the only movement of the object was the rotation of the earth causing it to decend towards the horizon. i watched and photographed the object for almost an hour.i took 6 slides of the object before it dissappeared into the haze above the horizon.i still have the original slides. i believe it was in a stationary orbit beyond the atmosphere.for this object to appear diamond shaped to the naked eye at the distance it was would make it hugh. the sun was behind the hill to the west of my house (which was in the valley about 300 feet below the horizon.)the sun was below and left of the object (out of sight). i made an enlargement by projecting one of the slides across my basement(about 50 feet) onto a ground glass (from from an old bellows camera) and photographed the image from behind the ground glass. an ordinary enlarger did not enlarge enough to see any detail. the feeling of wonder came back to me as a result of my brothers recent sighting on july 3, 2012. i believe that it is time for the world to know what is out there that has been kept from us all these years. i'm not afraid to meet \"et\"."],"Latitude":"39.225273","Object Shape":"Diamond","City":"Cincinnati","trends":["There have been 82 other sightings in Cincinnati","There was one other sighting in Cincinnati on or around August 18th 1972"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.225273,+-84.622004(41513)&iwloc=A&hl=en\"> mufon case (41513) map </A>","Tags":"City","Summary":"Watched for an hour and photographed starlike object"}