{"Log Number":"US-08072012-0015","Weather Factors":"Unknown","trends":["There have been 18 other sightings in St Augustine","There were no other sightings in St Augustine on or around July 29th 2012"],"Latitude":"29.735153","Object Shape":"Other","Source":"MUFON","Object Features":"Other","files":["/var/www/straped/mufon/html2text/41514.html.txt","/var/www/straped/mufon/org/41514.html"],"City":"St Augustine","Longitude":"-81.354484","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.735153,+-81.354484(41514)&iwloc=A&hl=en\"> mufon case (41514) map </A>","Region":"Florida","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/07/2012 10:29 UTC","Date of the Event":"07/29/2012 02:23 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIn April 2012, while I was at work, I observed a very bright streak across the sky that then went upwards and suddenly disappeared. I work an overnight shift a frequently take my breaks outside. My place of employment is located in a very woodsy location right off the interstate. When I witnessed this first event it was about 2am and it made me jump to my feet and look all across the sky. The sky was very clear and other stars and planets were visible. I thought at first that it was a meteor falling to earth but then the light that was like a tail on it followed it and returned to the ball of light. At that point this light made and upwards turn and suddenly blinked out and it was gone. It came across the sky in an westerly fashion. A few weeks later on July 29, 2012 at approximately 330am I was seated on the same outside bench that I had been during the first occurrence and again I saw a streak across the sky. This time it was in a more south westerly fashion. This light was the same as the first but it seemed further up in the sky and therefore not as bright. Again the tail seemed to catch up with the light part of it and then it made a kind of sharp upward turn and then blinked out. This night was also clear and free of clouds or wind. During the first incident that happened in April I believed it to be a meteor at first until it made the upward turn and blink out completely. And now that I have seen the second incident I am really not sure what it could be. There was no sound like there usually is when a plane or helicopter flies by. Unfortunately since I was at work I did not have my video camera so I have nothing on film."],"Tags":"City","Disposition":"Unresolved","Case Number":"41514","Object Flight Path":"Straight-line path,Path with directional change","Summary":"Streak across the sky"}