{"divs":["Sighting DetailsSaturday night in St. Louis we had a lightning storm come through with some strong wind and some rain. I went out on the front porch to watch the lightning when all of sudden all of these bright lights started darting in and out of the main cloud bank that was producing the lightning, at first I thought it must be searchlights shining on the clouds from down below, but I kept watching because it was so strange, I couldn't count them but would guess there were around 20, they were going in all different directions in and out of the clouds in circles and loops. My roommate came out and watched with me and said he thought they were just searchlights shining on the clouds from the ground, right after he went inside one of the lights took off from the cloud formation and I watched it fly off from the main group and cross the sky, it went across a part of the sky where there were no clouds, and disappeared in the horizon, at that point I knew it was not searchlights from the ground. The best way to describe the lights and their movements was light fireflys zipping around in the clouds, but of course much larger than a firefly. They appeared at about 10:30 pm and ended at exactly 10:50 pm. I tried to film it with my camera phone but all I got was black. I live in South St. Louis and saw the lights in the clouds south east of my location. I went out a couple of more times during the night but did not see them again."],"Date of the Event":"08/04/2012 10:30 UTC","Log Number":"US-08072012-0018","map":"<A HREF = \"http://maps.google.com/maps?q=38.580418,+-90.276181(41516)&iwloc=A&hl=en\"> mufon case (41516) map </A>","files":["/var/www/straped/mufon/html2text/41516.html.txt","/var/www/straped/mufon/org/41516.html"],"Object Flight Path":"Other","Disposition":"Unresolved","Date Submitted":"08/07/2012 12:09 UTC","Summary":"Bright white lights dancing in the storm clouds","Latitude":"38.580418","Region":"Missouri","Tags":"City","City":"St Louis","Object Features":"None","Weather Factors":"Unknown","Longitude":"-90.276181","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"41516","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around August 4th 2012"],"Object Shape":"Sphere","Source":"MUFON"}