{"Longitude":"-89.831557","City":"Bartlett","Log Number":"US-08072012-0022","Date Submitted":"08/07/2012 02:18 UTC","Object Flight Path":"Straight-line path","Date of the Event":"08/06/2012 08:55 UTC","Summary":"I was watering flowers in our backyard garden when I looked up and saw a brilliant blue/white orr traveling from SE to NW ; no sound, not a plane no wing red/green lights or strobe; not landing lights as the orb was consistent as it passed me.","Weather Factors":"Unknown","divs":["Sighting DetailsThe object was a large and brilliant bluish white light that traveled at a consistent rapid speed from the SE to the NW in a straight line from a tree line I could see it several miles away past the SE tree line and several miles to the NW before it dissapeared behind roof tops to my NW. It was very clear that night and no clouds, It took less than 30 seconds to travel across the sky before it dissappeared on the horizon. I saw other airplanes in the distance with their stobes and red and green lights on. We are not in a landing or take off patteren of Memphis International which is over 20 miless away and realized this was not a plane with landing ligts on because I saw no other red or green wing lights, no silhouette of a plane and heard no noise. Also the lights stayed the same brilliant bluish white the full distance. I have seen planes with landing lights pass overhead at different locations and as they are facing forward as soon as the plane passes those lights change drastically, so I know this was not a plane with landing lights on. All other planes in the area were high in the sky and I could see their stobes and red and green wing tip lights (25K to 30K ft) and the landing pattern for the airport was about 10 mile to the West and the planes come in usually on a North to South inbound position. So chances are this was not a plane."],"Tags":"City","Object Features":"None","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Region":"Tennessee","Case Number":"41520","Sighting Duration":"Undisclosed","Disposition":"Unresolved","trends":["There has been one other sighting in Bartlett","There were no other sightings in Bartlett on or around August 6th 2012"],"Country":"United States","files":["/var/www/straped/mufon/html2text/41520.html.txt","/var/www/straped/mufon/org/41520.html"],"Object Shape":"Sphere","Latitude":"35.220455","map":"<A HREF = \"http://maps.google.com/maps?q=35.220455,+-89.831557(41520)&iwloc=A&hl=en\"> mufon case (41520) map </A>"}