{"Weather Factors":"Unknown","divs":["sighting detailsstar like object moved from south to north up to around the big dipper in the sky - something seemed to fall from it, and two shooting stars came down - the object then moved back to the southern direction - intermittently the object seemed to come to a dead stop looked like it went upwards and disappeared from view for several minutes - it then reappeared and moved to north west and then back to north again - moving at extreemely high speeds - then another shooting star like event happened object then seemed to stop move in a large semi circle and then moved to the south - saw the object appear to glow pinky orange almost like a large orb \\ bubble - few minutes later a much larger shooting star like object came down and within a few seconds a very large tail seemed to come from the falling object like a massive firework then it disappeared. the object then disappeared into the south west. during this time several aircraft were seen flying around in the sky, probably jet liners or some other aircraft as we live near a couple of air ports - one in vancover bc and the other in bellingham wa. couple of times the aircraft seemed to follow the flight path of the object as just before the large star burst a jet came from the north west. we noted that each time the object appeared it was followed by a shooting star like event. couple of nights prior we both witnessed seeing a craft in the sky - don't know if it was a jet liner or other plane - which flew over us - shapped like a v with several lights set out in two rows on the wings."],"files":["/var/www/straped/mufon/html2text/41528.html.txt","/var/www/straped/mufon/org/41528.html"],"trends":["There have been 7 other sightings in Blaine","There were no other sightings in Blaine on or around August 6th 2012"],"Tags":"City","Log Number":"US-08072012-0030","Case Number":"41528","Region":"Washington","Object Shape":"Sphere, Star-like","Country":"United States","Summary":"Extreemely fast moving object multi directional with star bursts flying around the sky south to north and back again","map":"<A HREF = \"http://maps.google.com/maps?q=48.965257,+-122.789575(41528)&iwloc=A&hl=en\"> mufon case (41528) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"08/06/2012 10:27 UTC","Latitude":"48.965257","Date Submitted":"08/07/2012 05:53 UTC","Source":"MUFON","City":"Blaine","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Disposition":"Unresolved","Longitude":"-122.789575","Object Features":"Unknown"}