{"files":["/var/www/straped/mufon/html2text/41526.html.txt","/var/www/straped/mufon/org/41526.html"],"trends":[],"Date Submitted":"08/07/2012 03:28 UTC","Weather Factors":"Unknown","divs":["sighting details i sat on porch on 7\\27\\2012 at 10:45 to smoke a cigarette, i took a puff looked into the sky and seen a blue light, i said to myself that is not an airplane, then i realized i was witnessing a ufo, i was in a state of aww, my friend shannon pulled up to my house, i said shannon look a ufo, she started freaking out, so i grabbed my iphone and started video taping, seeing that it was not coming up as big as we seen in real life, i ran into the house to grab my camera w\\ video option. in the mean time the blue\\red ufo was still out there, i went to record it and the batteries died on camera, eventually we got a good 13 second video. it hung around for about 20 minutes, appearing and reappearing shooting all over the sky! shannon left, i went and picked up my brother mike, we researched online all nite, i found that if you see a sighting 9 times out of ten it will come back the next night! it did, we all waited for 10:45pm just as predicted there it was a blue boomerang shaped object flashing neon blue, to red! i thought the night before was different and flashed blue, red and white? either way we called the neighbors to come and see because they seen the video of the one the night before. they witnessed it too. after this one left after about 20 minutes, we seen a saucer flying by the moon, it had no lights but the moon light lit it up, this is also on video. when we went through our footage, we got video of a boomerang shaped something? an orb, i don't know, like ten feet from us, we did not see in real time, but this is also on video. thank you! i would like to show video in person, not ready to show public, thanks."],"Sighting Duration":"Undisclosed","Region":"Michigan","Latitude":"44.318084","Object Shape":"Boomerang, Disc","Summary":"Appeared Two Nights In A Row, Have Video Footage, also of an Orb That went past us on Video along with a Saucer Which was lit up by the Moon Light!","Disposition":"Unresolved","Tags":"City","Case Number":"41526","map":"<A HREF = \"http://maps.google.com/maps?q=44.318084,+-85.594824(41526)&iwloc=A&hl=en\"> mufon case (41526) map </A>","Country":"United States","Log Number":"US-08072012-0028","City":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Longitude":"-85.594824","Source":"MUFON","Object Features":"Unknown","Date of the Event":"07/27/2012 10:45 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile"}