{"divs":["sighting detailsaround 09.30pm last night, i let my dog out in the back yard. the weather remains crystal clear today, as it was yesterday and last night. i looked up in the sky and saw an equalateral triangle with a very bright white lower left, not as bright white top, and a reddish right corner in the west\\southwestern sky about 45 dgress up in the distance. the sun had set over an hour ago, i believe. i called my wife out and she confirmed this not be of any constellation we know of or have seen before. previous to the sighting, our dog had acted very unusual and afraid to go outside, with her tail between her legs. this was about 30 minutes prior to the sighting. we calmed her down and she was then able to go out @ 09.30pm. while we were looking at the triangle, the top white light moved to the left, the lower right reddish moved up and in, to form an isocoles triangle on a tilt from the perfect equilateral triangle, which we had previously seen. it remained for about 20 minutes or so, until we gave up and went to bed. the very odd behaviour of our dog is what has led me to believe this was a possible ufo sighting. we both had never seen anything like this before, and are fascinated to have witnessed this event."],"files":["/var/www/straped/mufon/html2text/41527.html.txt","/var/www/straped/mufon/org/41527.html"],"trends":["There have been 4 other sightings in Orland Park","There were no other sightings in Orland Park on or around August 6th 2012"],"City":"Orland Park","Object Flight Path":"Stationary","Weather Factors":"Unknown","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.67002,+-87.8172(41527)&iwloc=A&hl=en\"> mufon case (41527) map </A>","Object Shape":"Triangle","Tags":"City","Latitude":"41.67002","Summary":"Equilateral Triangle of white, dull white and red lights changed to isocoles","Date of the Event":"08/06/2012 09:30 UTC","Longitude":"-87.8172","Case Number":"41527","Region":"Illinois","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Date Submitted":"08/07/2012 05:47 UTC","Source":"MUFON","Log Number":"US-08072012-0029","Sighting Duration":"00:20:00"}