{"Case Number":"41539","Object Shape":"Sphere, Unknown","Disposition":"Unresolved","Longitude":"-104.652223","Weather Factors":"Unknown","Source":"MUFON","Summary":"Starlike object. Not blinking. Traveling N. then NE. through clouds. Alt. approx. 7,000 ft","Latitude":"38.268215","Date of the Event":"08/07/2012 08:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.268215,+-104.652223(41539)&iwloc=A&hl=en\"> mufon case (41539) map </A>","Date Submitted":"08/08/2012 12:33 UTC","Log Number":"US-08082012-0001","divs":["sighting detailson tuesday, august 7th, 2012 i went out my backyard which faces south at approximately 8:30 - 8:35 p.m. to water the lawn. i noticed what i thought was a plane traveling in a north by northeast direction at about 5,000 - 7,000 feet. i looked away for a few seconds and then my gaze was drawn back to it. it looked more like a very bright star rather than a low altitude airplane although it was traveling at a speed similiar to that of a passenger jet on it's approach to an airport. i noticed that it did not have blinking or strobing lights like i'm use to seeing on aircraft in the evening or at night flying overhead. i went back into the house to get my binoculars hoping that it wouldn't be out of my line of sight by the time i returned which was probably less than a minute. by the time i got back to view it, i noticed that it was changing directions from from north to northeast on a course that would be relative from the steel mill to the pueblo airport. when i viewed it with my binoculars i could not make out a distinctive shape. it just looked much brighter in the binoculars. it did look somewhat boomerang in shape at times but it was hard to verify that since i did not have the binoculars on a steady tripod and also because the object was so bright. i did not see any blinking or strobing lights as you would see on an aircraft or helicopter. can't say what color it was either because i'm color blind but it did not appear to be red, or blue which i can distinguish. my best guess would be white. i noticed that it did pass through some clouds and almost disappeared a few times but i was still able to track it through the clouds until it emerged from them. by the way, i am an aircraft enthusiast, especially jet fighters and have seen many differnt aircraft in the day, evening and night. although it appeared to be an aircraft at first sight, what through me off when i started looking at it was the bright steady light and no sound. it just looked like a very bright star traveling in the sky and the intensity of the light did not change when it changed direction. i watch the object until it disappeared over the tree tops\\rooftops in the neighborhood. by that time it was just a faint light to the naked eye, but with the binoculars it still looked bright as it was leaving my field of view. i can't say one way or another if this was a ufo but it would be interesting to see if a few other people in the city made the same observation. i'm hoping i wasn't the only person in pueblo looking up tonight."],"Region":"Colorado","trends":["There have been 22 other sightings in Pueblo","There were no other sightings in Pueblo on or around August 7th 2012"],"Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Object Flight Path":"Path with directional change","City":"Pueblo","files":["/var/www/straped/mufon/html2text/41539.html.txt","/var/www/straped/mufon/org/41539.html"],"Viewing Distance":"Unknown","Tags":"City"}