{"Summary":"Very bright and large lights in half moon shape.","Country":"United States","Object Features":"Unknown","City":"Myrtle Beach","divs":["Sighting DetailsWe were in the water just after dark in front of the Best Western on the surf side. There were 5 or 6 very bright lights that appeared to the south. All were in a half moon shape and seemed fairly distant from one another but also seemed like they were all in line in the half moon shape. They all came on, and then went off and then back on in random order. Not flares for sure. Then later about 10 minutes,one glowed again by it's self but not the others. I asked another family walking by if they seen it and they said yes and that they just say the same thing further north about 30 minutes earlier and we both agreed we have never seen anything like it before. I am prior service in the Army and have seen choppers and A10 shoot their flares out in the day and night while serving in Iraq. This was certainly not the same thing. Very strange how they were all in perfect position in a half moon shape. Later there was some sort of plane that flew in the direction of the spheres that seemed to fly as fast as a jet but the spheres were quite a ways away and over the ocean so I could not tell what kind of plane. Also, a helicopter flew quite a ways out over the ocean in a circle around the surf, much further out that what the tourist choppers have been flying. I don't know what it was, but as far out as the spheres were and as bright as they were would make me think that it was not a normal occurrence. My son, myself, and the 3 other people from the other family, that I know of, seen this happen."],"Date of the Event":"08/07/2012 08:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Region":"South Carolina","Longitude":"-78.882684","Case Number":"41534","Latitude":"33.6961","Disposition":"Unresolved","Weather Factors":"Unknown","trends":["There have been 52 other sightings in Myrtle Beach","There were 4 other sightings in Myrtle Beach on or around August 7th 2012"],"files":["/var/www/straped/mufon/html2text/41534.html.txt","/var/www/straped/mufon/org/41534.html"],"Object Shape":"Sphere, Star-like","Object Flight Path":"Other","Date Submitted":"08/07/2012 10:21 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.6961,+-78.882684(41534)&iwloc=A&hl=en\"> mufon case (41534) map </A>","Log Number":"US-08072012-0035","Viewing Distance":"Over One Mile"}