{"Object Flight Path":"Stationary,Hovering then path","Date of the Event":"08/07/2012 02:30 UTC","City":"Fountain Hills","files":["/var/www/straped/mufon/html2text/41548.html.txt","/var/www/straped/mufon/org/41548.html"],"Region":"Arizona","Latitude":"33.636964","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date Submitted":"08/08/2012 12:12 UTC","Case Number":"41548","Log Number":"US-08082012-0010","Longitude":"-111.709595","Tags":"City","Object Shape":"Unknown","trends":["There have been 8 other sightings in Fountain Hills","There were no other sightings in Fountain Hills on or around August 7th 2012"],"Disposition":"Unresolved","Summary":"Pulsating star like object that emmitted 3-4 smaller craft with orange lights","divs":["Sighting Details2:30 am: I saw an uncharacteristically bright star in the north east sector of the sky. Lower than the Superstition Mountains and above the mesa in front of this mountain range. There is a flight path slightly to the west of this area but this was not the flight path and there were no other planes or helicopters in the area that I could see. The star was pulsating. I went to my upstairs balcony and looked at it thru binoculars. It had pulsating spikes of light around an empty or dark circle. The spikes of light brightened to a shocking length and emitted a line of 3-4 orange lights. This smaller craft flew away but stayed in the general vicinity. I then noticed that there were 3 other similar craft flying around in the area. They changed direction on occasion. After emitting the craft the white starlike craft blinked out entirely. Within 20 seconds it began to grow again. I see strange craft now and then but have never seen something like this. My mother claimed to have seen something similar a week earlier. However she described a super large white star that pulsated."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.636964,+-111.709595(41548)&iwloc=A&hl=en\"> mufon case (41548) map </A>"}