{"map":"<A HREF = \"http://maps.google.com/maps?q=35.699326,+-77.513026(41549)&iwloc=A&hl=en\"> mufon case (41549) map </A>","Tags":"City","Case Number":"41549","Disposition":"Unresolved","trends":["There have been no other sightings in Falkland","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"08/08/2012 01:01 UTC","Sighting Duration":"01:00:00","files":["/var/www/straped/mufon/html2text/41549.html.txt","/var/www/straped/mufon/org/41549.html"],"Summary":"Round shadow followed me. Moved off at low speed.","Country":"United States","Source":"MUFON","Date of the Event":"12/10/2011 04:00 UTC","Object Shape":"Sphere","Region":"North Carolina","Weather Factors":"Unknown","Object Features":"None","Longitude":"-77.513026","City":"Falkland","Latitude":"35.699326","Log Number":"US-08082012-0011","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI was driving home after a 1500 to 0300 hour shift as a RN in a trauma center. On my route home I saw a woman beside the road. It was late, dark and cold. She was dressed in normal grey clothing but with no coat. She was of average height and build. Nice looking. She was alone with no car. I passed by her and slowed. I backed up to ask if she was OK and to see if she needed help. She had the most perfect smile I have ever seen. She opened my car door and got in without speaking. I was completely at ease. I had a hand gun with me and I had no thoughts of needing it. In thinking back on what happened next she told me to back up into a nearby driveway but she did not open her mouth. I think she was speaking with me just by thinking. I pulled off the road and we began to have intercourse. She got on top of me. When we finished she got out of the driver side door and I never saw her again. I freaked out. Not so much that she was gone, but because I had just cheated on my wife. It lasted maybe 15 minutes. I talked to her but I never saw her mouth move and we carried on a conversation. I pulled up my pants got out of the car and looked around and did not see her. I yelled out with no response. I got into my car and headed home in a hurry. When I stopped at an intersection I noticed a round object that looked like a grey shadow behind me. It was maybe 1.5 times wider than the road and maybe 20 feet above the tree line. I drove away still headed to my home. I could not see it the entire time. When I pulled into my driveway I did not see it. When I got out of my car I saw it about 200 yards away at the same height. This was the first time I felt fear. I reached back into my car and got my gun. When I looked again it floated away to the west at low speed. No sound. I saw it for maybe a minute. I was afraid to shoot at it. I have not see her or the grey object again."]}