{"Log Number":"US-08082012-0025","Viewing Distance":"Over One Mile","Summary":"light in sky moved right across sky, vanished, then reappeared moved right, hovered, moved back left and then again vanished.","Date of the Event":"08/08/2012 08:52 UTC","Case Number":"41564","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"00:05:00","divs":["Sighting DetailsAround 8:50pm while sitting on the back porch overlooking the atlantic ocean I noticed a constant yellow-orange light without navigation lights moved right across the sky traveling away from Cape Lookout Lighthouse. It was visible for around 30sec then the light dimmed and changed colors to white and then dissipated. Around 2min passed and it reappeared over the atlantic and moved left across the sky traveling towards Atlantic Beach, Morehead City area. This time it moved twice as fast as previous. Then it abruptly stopped in between the lighthouse and the beach, then changed direction and moved right across the sky back over the ocean. The light again changed colors to a dimmer white light and vanished. My father, friend, and I were eye witnesses for the first sighting and only I saw the second sighting. I'm dumbfounded and have no clue what I saw, but I do want to know the truth on what others and I have been seeing in our sky."],"Date Submitted":"08/08/2012 09:35 UTC","Tags":"City","Weather Factors":"Unknown","Region":"North Carolina","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.70006,+-76.737171(41564)&iwloc=A&hl=en\"> mufon case (41564) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/41564.html.txt","/var/www/straped/mufon/org/41564.html"],"Latitude":"34.70006","City":"Atlantic Beach","Object Shape":"Unknown","Source":"MUFON","Longitude":"-76.737171","Disposition":"Unresolved","trends":["There have been 3 other sightings in Atlantic Beach","There were no other sightings in Atlantic Beach on or around August 8th 2012"]}