{"Date of the Event":"08/08/2012 09:30 UTC","Log Number":"US-08082012-0028","Longitude":"-81.46031","trends":["There have been 3 other sightings in New Philadelphia","There were no other sightings in New Philadelphia on or around August 8th 2012"],"Sighting Duration":"00:03:00","Date Submitted":"08/08/2012 10:43 UTC","Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.49767,+-81.46031(41567)&iwloc=A&hl=en\"> mufon case (41567) map </A>","files":["/var/www/straped/mufon/html2text/41567.html.txt","/var/www/straped/mufon/org/41567.html"],"Summary":"Solid, steady white light much too low to be satellite","Case Number":"41567","Object Shape":"Sphere","Latitude":"40.49767","Region":"Ohio","City":"New Philadelphia","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was in our backyard tonight to watch for some of the meteors from the meteor shower. I had seen airplanes pass overhead and even satellites. I am a casual skywatcher and I can distinguish stars, satellites, airplanes, and helicopters, as well as some constellations and planets. I first noticed the object because it was a bright white light moving, which I caught sight of out of the corner of my eye. At the same time, my partner noticed it as well. However, this was much, much brighter and much too low to be a satellite. There was absolutely no sound even though it looked as low as aircraft in the area. The object moved steadily from west to east. It appeared as one solid light and did not blink or make any noise. My partner and her son also saw this. We watched it until it disappeared from our line of sight due to the position of our backyard. Again, I know it was NOT a satellite and it was low enough that if it had been an aircraft we would have heard it. It appeared to be at or even below the altitude of aircraft in the area. I had heard the planes that looked to be at about the same altitude earlier. This object made absolutely no sound and moved in a steady motion. It looked to be moving a little faster than other aircraft in the area. Also, I have seen many planes fly overhead at night with various light configurations, such as when the bottom of a plane is lit. But, this object looked to be a solid white light, unlike any plane I had seen before."],"Source":"MUFON"}