{"Latitude":"36.885396","Case Number":"41562","Log Number":"US-08082012-0023","Summary":"Family on back deck/porch at night enjoying 2nd year new home","Source":"MUFON","Country":"United States","trends":["There have been 24 other sightings in Norfolk","There were no other sightings in Norfolk on or around June 15th 1996"],"divs":["Sighting DetailsSo it was a cool summer night. It was are first summer at the new home. I was a kid. The entire family witnessed it. We had been going on the back deck every night to enjoy the cool air and talk and look at the stars. My dad eventually noticed this red glowing orb hovering over the city. As we all start to observe this thing it starts to slowly hover over the sky like a very slight arch going upwards. Eventually it began to slightly arch lower just before going backwards and getting smaller. Kind of like it made a u-turn and was hovering in a large circle. My dad eventually noted that this looks to be right on top of the Norfolk Naval Shipyard. He was currently working there. We have a waterfront home with the Chesapeake bay connecting to our backyard to give you an idea of the geography. I noted that the orb appeared to be changing colors slightly, between a reddish glow and a orange glow, some what mixed, like fire. But mostly red with the orange only appearing in the center of it. After the UFO made a complete circle over the base it started ascending upwards slightly faster than it's movement before. It eventually disappeared from sight. It was moving as slow as a slug in a hurry and when it ascended upwards to leave it moved about as fast as a roach. I have only heard of a few UFO sightings with a similar orb. Ever since then I have been convinced that these UFO sightings are more than just hysteria. I hope this will be of help to your research. If you Google search the house you can see the deck and the view from there."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.885396,+-76.271872(41562)&iwloc=A&hl=en\"> mufon case (41562) map </A>","Object Shape":"Sphere, Star-like","Tags":"City","Date Submitted":"08/08/2012 07:58 UTC","City":"Norfolk","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Region":"Virginia","Weather Factors":"Unknown","Date of the Event":"06/15/1996 12:00 UTC","Object Features":"Unknown","Longitude":"-76.271872","files":["/var/www/straped/mufon/html2text/41562.html.txt","/var/www/straped/mufon/org/41562.html"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed"}