{"Latitude":"41.813335","Disposition":"Unresolved","Region":"New York","Date Submitted":"08/08/2012 06:49 UTC","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"High altitude Air plane or white Cigar shaped UFO photographed","divs":["Sighting DetailsDriving US 219 from Washington DC. to Ontario, just north of Bradford PA, I notice a clear white high altitude air plane looking north. From afar the object didn't seem to have any wings nor tail. That caught my attention so I park the car, grab my Canon Rebel XT camera and exit the vehicle. I was able to get a few pictures of the distant eastbound object, thinking that I could zoom in later and get a better look. As I made it south of Buffalo NY, I see a similar white object in the distance and snap couple of pictures. However, wings seemed to be visible and I included them for comparison. Taken with the same camera, same settings but merely aprox. 2 later that same day. Now having examined all the photographs, it is clear that the object south of Buffalo is simply a passenger jet and the attached picture will demonstrate that clearly. The photos taken near north of Bradford, PA show a different object. No visible wings and the camera does not zoom as easily on it as it did with the passenger jet. Strangely, one of the photographs also captured a black-ish jet along with the white object in distance. Now, I did not hear nor see the black jet when I took the pictures of the white object. It sure looks like a fighter jet (hardly a black private jet?) but the screaming noise alone should have alerted me but did not. Now this won't prove anything in the absence of a zoom lens but perhaps somebody will find this interesting to examine."],"City":"Bradford, PA","Case Number":"41560","Longitude":"-78.475194","Object Shape":"Cigar","Log Number":"US-08082012-0021","Country":"United States","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"06/25/2012 02:55 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/41560.html.txt","/var/www/straped/mufon/more/41560_submitter_file1__mynd2.jpg","/var/www/straped/mufon/more/41560_submitter_file2__mynd3.jpg","/var/www/straped/mufon/more/41560_submitter_file3__mynd4.jpg","/var/www/straped/mufon/more/41560_submitter_file4__mynd5.jpg","/var/www/straped/mufon/more/41560_submitter_file5__IMG2401.jpg","/var/www/straped/mufon/org/41560.html"],"trends":["There have been no other sightings in Bradford, PA","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.813335,+-78.475194(41560)&iwloc=A&hl=en\"> mufon case (41560) map </A>"}