{"Disposition":"Unresolved","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Cigar, Sphere","Object Features":"Undisclosed","Longitude":"-76.721471","Case Number":"41565","Source":"MUFON","Summary":"Saw several objects that moved in an irrational flight path that were not aircraft that I know of.","Date Submitted":"08/08/2012 10:16 UTC","files":["/var/www/straped/mufon/html2text/41565.html.txt","/var/www/straped/mufon/org/41565.html"],"divs":["Sighting DetailsI was outside, in front of my house smoking and listening to my headphones. It is a clear night so I was looking up at the stars and constellations. All of the sudden I caught something in the corner of my eye off to my right. I took off my headphones and turned to look. At first I thought it was a passing plane, but there were two objects flying from the northeast. They looked as though they were flying in a formation. I live near a military base so I see a lot of aircraft in my area. On occasion they fly sorties at night. You can usually see the running lights and the roar of the engines, but these objects flew too erratically to be any plane. The first thing I could think of was something similar to birds flying together or dragon-flies. On top of that, the lights, or glow, they were emmitting were too faint. They flew close together and passed directly over my head and in a southwesterly direction. After that, they were out of sight. I gazed down in bewilderment and just happened to look back up when I caught sight of something else. Flying from the south there was another object. It pulsated a red light in a sequential manner, off and on again. I couldn't make out its shape. There wasn't any sound that I could make out. It flew to the north and behind some trees obstructing my view. I walked down the sidewalk, to see if I could catch another glimpse of it again. When I reached the intersection it was gone. I'm still a little bewildered by what I saw. The third object might have been a helicopter, but I'm not sure on that either. The first two were definitely a sight! There movements were so fluid and graceful. At the same time I felt a sense of urgency almost as if one of them was having trouble and likely to fall. The third object just seemed to have a set path and then disappear out of view."],"Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-08082012-0026","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.720216,+-76.721471(41565)&iwloc=A&hl=en\"> mufon case (41565) map </A>","Latitude":"34.720216","trends":["There have been 3 other sightings in Morehead City","There were no other sightings in Morehead City on or around August 8th 2012"],"Region":"North Carolina","Date of the Event":"08/08/2012 09:42 UTC","City":"Morehead City"}