{"Longitude":"-121.272106","Log Number":"US-08082012-0033","Case Number":"41572","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.719812,+-121.272106(41572)&iwloc=A&hl=en\"> mufon case (41572) map </A>","Region":"California","City":"Roseville","Sighting Duration":"00:00:01","Date of the Event":"08/04/2012 05:00 UTC","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around August 4th 2012"],"Latitude":"38.719812","Disposition":"Unresolved","Tags":"City","divs":["sighting detailson august 4th at approximately 5 pm. took a picture of the clouds and an impending thunderstorm. reviewed the picture on my phone before downloading to fb and saw it had a ufo on it. i often see ufos in this same area, surrounding the roseville ca. rail yard\\fairgrounds.its bigger then the neighbors dish on their home, going very fast at a angle. you can see it has a green light in the middle and it is electrified with a currant of light around it. it is solid and not a bird or plane.i watch the skies every night and this is a very active area!hardly a night goes by i dont see something, either high or low, but this is my first solid sighting. always see the silent flairs, bright light then fade, zig-zags, flashes, just a few days before this at dusk in this same area i saw a slow moving hovering craft with a huge slow flashing light on the top and many red and white strobe flashes all around it. i called my son outside to see it because he never believes me, he saw it clearly and said, yup its a ufo and walked back in the house unaffected. so if he said it was, it was! the non believer now believes!it took 20 minutes to move across the sky it was so slow, it was a little too dark to get a pic, my camera phone bites! i was so lucky to get this pic!saw my first one in the summer of 85 in san diego ca!"],"Object Features":"Other","Source":"MUFON","Object Shape":"Cylinder","Country":"United States","Viewing Distance":"21-100 Feet","Summary":"Photo of UFO Roseville Ca. 8-4-12 @5:00 pm","Date Submitted":"08/08/2012 11:26 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/41572.html.txt","/var/www/straped/mufon/org/41572.html"]}