{"Region":"South Carolina","Longitude":"-78.886439","files":["/var/www/straped/mufon/html2text/41571.html.txt","/var/www/straped/mufon/org/41571.html"],"Object Features":"Unknown","Viewing Distance":"Over One Mile","Log Number":"US-08082012-0032","trends":["There have been 52 other sightings in Myrtle Beach","There were 4 other sightings in Myrtle Beach on or around August 8th 2012"],"Summary":"Hovering orange-red orbs blink then synchronize over the ocean","divs":["sighting detailswhile sitting on the beach waiting for the local fireworks show to start (there's one every wednesday), my boyfriend and i noticed a bright orange\\red ball of light directly east, out over the ocean, below cloud level. the first light appeared and disappeared, then another did the same. several minutes later, similar lights were seen doing the same. a few moments later, approximately 5 of these orbs synchronized and appeared in a slightly curved line and were equidistant from one another. they appeared for 5-10 seconds, then disappeared again, all at the exact same time. one more object appeared and disappeared afterward. the entire event occurred over the course of about 15 minutes. the orbs were roughly the color of a flare, but did not move as such. instead, they hovered and disappeared quickly, not slowly dying out like a flare would. several aircraft left myrtle beach airport around the time of the sighting, but when they flew near the orange orbs, they were much higher altitude. no sounds accompanied the sightings."],"Date of the Event":"08/08/2012 09:30 UTC","Sighting Duration":"Undisclosed","Date Submitted":"08/08/2012 11:06 UTC","Object Shape":"Fireball, Flash, Sphere","Case Number":"41571","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.694709,+-78.886439(41571)&iwloc=A&hl=en\"> mufon case (41571) map </A>","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Latitude":"33.694709","City":"Myrtle Beach"}