{"Date Submitted":"08/08/2012 11:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.6951,+-78.884754(41573)&iwloc=A&hl=en\"> mufon case (41573) map </A>","City":"Myrtle Beach","Latitude":"33.6951","Object Features":"Unknown","Source":"MUFON","trends":["There have been 52 other sightings in Myrtle Beach","There were 4 other sightings in Myrtle Beach on or around August 8th 2012"],"files":["/var/www/straped/mufon/html2text/41573.html.txt","/var/www/straped/mufon/org/41573.html"],"Region":"South Carolina","Case Number":"41573","Log Number":"US-08082012-0033","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-78.884754","Object Shape":"Oval","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date of the Event":"08/08/2012 08:20 UTC","divs":["sighting detailsi was sitting in my backyard in sc, speaking to my dil on my cell phone. i suddenly observed in the far ne over the ocean what appeared to be 4-6 bright orange\\red lights hovering above the ocean. i immediately called to my husband to come out back. what seemed to be simultaneous my dil is saying \"are you there, i can't hear you! hello, are you there? the objects split and three dispersed in different directions and two remained. by the time my husband came outside he had seen the one left. in what seemed like a few minutes there were what we believe to be helicopters and several military planes (but, no noise) many strobing white lights, that seemed to be in an irratic pattern .......following\\or chasing them or looking for them. i hung up the phone and my husband and i drove two mile to the beach. again there was an awful lot of planes and helicopters (by this time it is 10pm, this incident started at or around 8 - 8:15pm. the helicopters were definitely military, all the strobing lights with the iratic flight patterns i cannot say. what i am sure of is the unusual number of \"planes\" in the air over the beach tonight"],"Viewing Distance":"Over One Mile","Country":"United States","Summary":"Unusual orange/red lights over NE skies of MB, SC followed by what seemed to be dozens of white strobe lights with iratic flight paths"}