{"Country":"United States","Object Flight Path":"Other","Viewing Distance":"Over 1 Mile, Unknown, N/A","Latitude":"38.137577","Disposition":"Unresolved","Source":"MUFON","Object Features":"Unknown","Log Number":"US-08092012-0007","Sighting Duration":"Undisclosed","City":"Louisville","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.137577,+-85.869188(41581)&iwloc=A&hl=en\"> mufon case (41581) map </A>","Summary":"A bright white star like light sporadically flew almost like it was broken and fighting to fly in minutes it cover ground that i dont see any man made aerial vehicles ever covering!","files":["/var/www/straped/mufon/html2text/41581.html.txt","/var/www/straped/mufon/org/41581.html"],"Weather Factors":"Unknown","Longitude":"-85.869188","Date of the Event":"08/07/2012 10:16 UTC","Object Shape":"Star-like, Other, Unknown","Case Number":"41581","Region":"Kentucky","Date Submitted":"08/09/2012 05:19 UTC","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around August 7th 2012"],"divs":["Sighting DetailsI was walking to the corner store up the road from my apartments with my nephew and we seen some neighbors down the road on the way and as i was walking i shouted to my friend u guys need to be watching these skies because there was a triangle of three stars in the sky and i pointed at where it was located so they could see and as i turn my head and they do as well we all see a brighter star in the middle and as we look we notice that it is moving i asked are you guys seeing this and they said yes i scream what is that my adrenaline was pumping i was overwhelmed with excitement i was astounded by what we were all seeing shaking even kept screaming what is that then it started was moving it moved as if it was fighting to fly wobbly moving erratically but still flying it flew all the way around our apartment faster then any man made aircraft that we knew of that could move the way it was moving and with no sound at all as its flying its way around our buildings section of the apartment complex i have never seen any man made air craft move like this in all my life and all of my 5 other witnesses agree completely that what we seen was like nothing we have ever seen before and as we are all standing there i say i have to get my dad he has to see this and i also wanted to get my camera i ran and by the time we got back it was gone but my witnesses say that it just kept its same erratically movement and speed and just shrunk in the distance under the tree line behind our apartment complex we all talked for hours. I was up over half the night couldn't sleep cause i was so overwhelmed. i have watched the skies faithfully for the two nights after actually just came in from watching for a few hours. i have been a believer all my life have always wanted to see a ufo and finally i was graced with the presence of one. i am not sure how all this works but i look forward to hearing back from you and looking further into this thank u very much for your time."]}