{"Summary":"Small lights blinked from left to right then it lit up really bright white and pulsated like a strobe light!!!","Longitude":"-87.795115","Case Number":"41597","City":"Linden","Tags":"City","Date Submitted":"08/10/2012 12:40 UTC","Latitude":"32.24194","trends":["There have been no other sightings in Linden","This sighting has been favorited 2 times."],"divs":["Sighting DetailsI was coming home from work in demopolis, as I came from providence into linden I noticed a very big object in the sky with little lights in a band around the middle of the object lighting up one after the other! It did one round of the lights in the band before the whole object lit up like a strobe light very bright white blinking on and off, when it lit up it lit the whole sky around it and me! When I first noticed it I thought it was a radio tower lighting up, then I thought I've never seen a radio tower light up that bright before, as I was passing beside it all of a sudden with one of the flashing strobe off points it never came back on!! I came to my house and told my husband and we went outside and were looking up at the sky and we noticed something very far away jumping around in the sky pulsating and glowing white with a red tint, if you looked up at the trees across the street from our house it was like an inch up but it's going up and down and side to side, it would go in circles too.. We were trying to be dismissive of what it was like a helicopter, but a helicopter would not be up that high and couldn't change directions that fast!!! The whole thing made me very scared and even though it was up very high I was still scared it could see me!! We had been trying to get our iPhone and iPod to record it but all my husband got to work was a picture showed the dot when it blinked! I am very worried that it may come abduct us or something like that, if you knew me you would know I'm not this person that believes in this stuff, I'm a skeptic, but I believe now after what I saw!!"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.24194,+-87.795115(41597)&iwloc=A&hl=en\"> mufon case (41597) map </A>","Date of the Event":"08/09/2012 10:30 UTC","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Country":"United States","Log Number":"US-08102012-0001","Object Features":"Unknown","Sighting Duration":"Undisclosed","Region":"Alabama","Object Shape":"Sphere","Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/41597.html.txt","/var/www/straped/mufon/org/41597.html"]}