{"Object Shape":"Unknown","Latitude":"33.456077","Case Number":"41591","Tags":"City","Object Features":"Unknown","divs":["Sighting DetailsOne of my roommates was letting the dogs out back at around 2:15 AM on 7-26 when she saw this in the sky. She woke my other roommate and me up and all three of us watched it for minutes. It was about five miles or so off I would guess, and I would say it was hovering around 1000-2000 ft. I can't be sure, just my unqualified estimate. I would put it just west of the I-17 between Bethany Home and Thomas. Maybe closer, but definitely not farther. It looked like a really bright LED that would dim to a small starlike white, and then it'd get bright blue again. The lights didn't follow any pattern, appeared random, or perhaps it was somehow related to its movements. The only thing I could think of that could match this thing's maneuvers is an RC helicopter. But it seemed much too fluid and controlled... and they'd have to be controlling the lights too if it was RC. It seemed anti-gravity like. Here's the thing, a couple months earlier I saw the same thing way off to the North East (probably near Cave Creek) at around 4:30 AM as I was leaving for work. I didn't have time to stand there and watch it, but it gave me motivation to buy a camera so next time I could film it if I see it again. So I had the camera that morning of 7-26, and I tried filming it a couple times. I didn't record much because it was very dark, and I didn't think the camera was picking it up very well, which it didn't, but it did record better than I thought it would. Anyway, a few minutes after I gave up recording, the light descended until we couldn't see it anymore through the trees and houses."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.456077,+-112.071257(41591)&iwloc=A&hl=en\"> mufon case (41591) map </A>","Region":"Arizona","Summary":"blue flashing light doing antigravity dance","Viewing Distance":"Over One Mile","Longitude":"-112.071257","City":"Phoenix","Date Submitted":"08/09/2012 09:35 UTC","Date of the Event":"07/26/2012 02:30 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41591.html.txt","/var/www/straped/mufon/org/41591.html"],"Log Number":"US-08092012-0018","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around July 26th 2012","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Country":"United States"}