{"Country":"United States","trends":["There have been no other sightings in Marshallville","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.902277,+-81.734019(41606)&iwloc=A&hl=en\"> mufon case (41606) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"40.902277","Source":"MUFON","divs":["Sighting Detailsworking nights in the country I have seen all kind of things, this however was something unique. I first noticed three extremely bright white lights in a horizontal line, I had not seen before. I love star gazing and work at a farm so I am outside all night six days a week, so I knew these where not stars. I live close to an airport so I know what landing lights and ffa lights look like. I was not looking at a plane. I watched these lights and couldn't shake the feeling you get when you're being watched. I watched it for several minutes before a plane came into view as it was prepairing to land. I do not know what kind of plane it was but the three lights where much larger. Five to ten minutes after the plane the lights started to flicker and one after another went out. I don't know if all three lights where seperate or part of one object. For the roughly ten minutes I watched these lights they seemed to move up and down just slightly. when one moved they all moved keeping exact distance and situation to the others. This is why I refered to it as being one object at first but as I did not see a solid structure I can't be certain. After they had gone out I had to tell someone about what had just happened. I texted a friend and he was shocked. I am ex military so I don't just jump the gun when I see lights in the sky, and he knows it. When I called him later that night he was stunned, we have heard all these people say \"I saw a ufo\" and never really put much stock in it. I think I'll pay a little more attention from now on."],"Date Submitted":"08/10/2012 08:24 UTC","City":"Marshallville","Date of the Event":"08/07/2012 10:30 UTC","Case Number":"41606","Region":"Ohio","Object Flight Path":"Stationary","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Unknown","Summary":"Three lights in a line that seemed to flicker out in sequence`","Log Number":"US-08102012-0009","Object Shape":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/41606.html.txt","/var/www/straped/mufon/org/41606.html"],"Longitude":"-81.734019"}