{"Date Submitted":"08/10/2012 05:46 UTC","trends":["There have been 7 other sightings in Arnold","There were no other sightings in Arnold on or around August 10th 2012"],"Region":"Missouri","Weather Factors":"Unknown","Date of the Event":"08/10/2012 04:25 UTC","Summary":"I was sleeping and was awoken to what I believe was some sort of alien encounter","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-90.386774","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.422391,+-90.386774(41604)&iwloc=A&hl=en\"> mufon case (41604) map </A>","divs":["Sighting DetailsI was sleeping when I woke up and heard a loud buzzing noise. I attempted to open my eyes but could hardly open one, the laptop was open on the opposite side of the bed so I had some light and in front of me appeared to be a small humanoid. I then realized my mouth was completely open and I was unable to move it nor make a sound. I tried screaming for help but all that came out was some faint mumbles. Then I attempted to remove what was in my mouth with my arms but for reasons I can't explain I couldn't move them. I could move my legs but it was as if I was a fish out of water at that point. Soon after I was kicking my legs around my eyes seemed to close automatically and when I re-opened them everything was back to normal...besides my extremely dry mouth. I immediately looked at the clock, it read 4:27 A.M. I was extremely frightened to move, I was unsure what had just happened. I'm not sure if this was some sort of dream I was having, and I truthfully don't remember any dream of mine, or if it was indeed some sort of alien encounter."],"files":["/var/www/straped/mufon/html2text/41604.html.txt","/var/www/straped/mufon/org/41604.html"],"Log Number":"US-08102012-0007","Source":"MUFON","Disposition":"Unresolved","Case Number":"41604","Latitude":"38.422391","City":"Arnold","Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Unknown","Object Features":"Undisclosed"}