{"Date Submitted":"08/10/2012 11:05 UTC","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Summary":"Light moves then fades out","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.969333,+-92.325278(41608)&iwloc=A&hl=en\"> mufon case (41608) map </A>","Log Number":"US-08102012-0012","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Details3rd sighting in 2 weeks. Appears to be the same UFO. Each time I've seen it, it was somewhere between 3:30-4:00am CST. Again, I'm bicycling on my way to work at night. This time I'm keeping an eye on the region of sky I've seen the UFO appear 2 times before, to the right of Aldebaran. Also, this time I was able to write down more accurate details. It appeared at 3:38am CST. About 35-40 degrees on the horizon, looking east at Jupiter and Aldebaran. I would say within 1 second it went from the size of Jupiter in brightness to Venus. It immediately began to move in the direction of Aldebaran (north?). It stayed at relatively the same point in the sky, about 40 degrees from the horizon. Within a few seconds it diminished in brightness and then rapidly became very dim. It stayed as a small dim light in the sky as it continued to move, with a barely visible corona. Which to me indicated it had traveled much farther away. It then abruptly faded out of sight. The whole event took about 15 seconds. Then, about 15 minutes later after I had traveled southeast about 5 miles, a very bright light about the size of Venus suddenly appeared about 25 degrees from the horizon and shot straight down at nearly the speed of a \"shooting star\"; meteor. The event lasted about 1 second. It disappeared behind trees, when it reached 10 degrees on the horizon, so I could not see its full descent. What alarmed me was the brightness of the object, which could not have been a meteor. It also appeared suddenly, while I was observing the sky, appearing out of nowhere, and leaving no light trail as it descended rapidly. I suspect that because of the meteor shower in August, the increased UFO activity is taking advantage of this, to appear ambiguous. I actually saw a \"shooting star\" last week, which was very faint and left a trail as it burned up in the atmosphere. Furthermore, the meteor shower is supposed to be difficult to see, and what I witnessed was VERY easy to see."],"Object Features":"Unknown","City":"Columbia","Region":"Missouri","files":["/var/www/straped/mufon/html2text/41608.html.txt","/var/www/straped/mufon/org/41608.html"],"Source":"MUFON","Date of the Event":"08/10/2012 03:38 UTC","trends":["There have been 38 other sightings in Columbia","There was one other sighting in Columbia on or around August 10th 2012"],"Latitude":"38.969333","Country":"United States","Longitude":"-92.325278","Case Number":"41608"}