{"Source":"MUFON","Longitude":"-97.821895","Country":"United States","Object Shape":"Square, Rectagular","Summary":"It was rectangular in size, it just hovered up and down then flew away with a loud hum.","Date Submitted":"08/10/2012 05:14 UTC","Object Flight Path":"Hovering then path","Latitude":"30.489138","Disposition":"Unresolved","Tags":"City","Object Features":"Window(s)","Log Number":"US-08102012-0016","City":"Cedar Park","trends":["There have been 14 other sightings in Cedar Park","There were no other sightings in Cedar Park on or around August 8th 2012"],"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet, Unknown","files":["/var/www/straped/mufon/html2text/41612.html.txt","/var/www/straped/mufon/org/41612.html"],"Case Number":"41612","divs":["Sighting DetailsSo like usual I go outback at my house and the time was around 8:00 P.M. so I started looking up at the sky since I kept seeing different shapes in the stars then all of the sudden I could see this bright red and yellow light glowing and hovering above the tree's in my neighbor's backyard. My neighbor's moved so no one was home but the object just hovered above the tree's. After watching this for about five minutes I got out my IPhone and tried taking a photo of it but my camera wouldn't work, on top of my phone it said it had no service but I do have a drawing of what it looked like. Anyway after about ten minutes I heard some weird sound like a door opening in space, I looked at the object and it projected a white beam of light at the tree's then turned off. What was weird was when the beam went off so did the yellow and red lights. I honestly don't know what it did but after about twenty minutes of hovering there the red and yellow light's came back on and it just started making a humming noise then took off into the sky."],"Date of the Event":"08/08/2012 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.489138,+-97.821895(41612)&iwloc=A&hl=en\"> mufon case (41612) map </A>","Sighting Duration":"08:30:10","Region":"Texas"}