{"Sighting Duration":"Undisclosed","Log Number":"US-08102012-0021","City":"Reedley","Date of the Event":"06/20/2012 09:30 UTC","Longitude":"-119.41294","Object Shape":"Triangle","Latitude":"36.575205","Disposition":"Unresolved","Summary":"It flew overhead to the SW. Low toned sound. Red lights blinked in sequence around 2 sides. Flew low and slow. Saw it again about 5 minutes later going SE up to go over Sierras.","Date Submitted":"08/10/2012 06:19 UTC","Case Number":"41617","Object Flight Path":"Straight-line path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.575205,+-119.41294(41617)&iwloc=A&hl=en\"> mufon case (41617) map </A>","trends":["There have been no other sightings in Reedley","This sighting has never been favorited."],"Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/41617.html.txt","/var/www/straped/mufon/org/41617.html"],"Weather Factors":"Unknown","Tags":"City","Object Features":"Other","Country":"United States","Region":"California","divs":["sighting detailsi was standing at kitchen sink and heard a odd, low-toned sound\\noise that seemed close\\overhead. i went out on the back deck and looked up. i saw a large, dull black area (no stars shining in this area) in sky above me. i then saw 7 red, blinking lights (4 on right side, 3 on left. blinking in sequence up one side and down the other) around 2 sides of a triangle-shape moving low in the sky and slowly in a straight line. it flew overhead and to the sw. i lost sight of it over the near horizion of trees and buildings. i saw no lights on the back side or underneath. i was amaized at how low and slow this very large object was flying. heard the same noise, went out onto the deck and saw it again about 5 minutes later at a greater distance, going se flying up the mountain side to go over sierras. same dark shape with 8 sequentially blinking red lights - 4 on each side this time. object did not have a light at the tip between the lights on each side. there was no other lights such as an aircraft's wing lights. when i told husband who was in the house, he said he thinks it was a \"flying wing\" spi plane. i had an eirie, very wierd feeling watching this large thing fly so close and so slowly overhead- to the point that i thought i would find out if anyone else saw this or something like it or knows what it was."]}