{"Longitude":"-84.337507","Region":"Michigan","Object Flight Path":"Path then hovering","Object Shape":"Sphere","Disposition":"Unresolved","Log Number":"US-08102012-0022","Latitude":"46.49804","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41618.html.txt","/var/www/straped/mufon/org/41618.html"],"Case Number":"41618","Date Submitted":"08/10/2012 07:35 UTC","Country":"United States","Object Features":"None","Tags":"City","City":"Sault Ste. Marie","divs":["Sighting DetailsMy husband & I were living on Sugar Is. in Mi.upper peninsula the day of the event. We were eating lunch, our almost one year old daughter was in her stroller.I think what got our attention was the lack of sound , not just silence but like sound had been sucked out of the air.We both got up & went to the front window, our cabin is only a few yards from the water.There was a flock of ducks going east down the river , away from lake Superior.Right behind them very fast came this luminous orb.I should have said before that the wind was blowing so hard the trees were all bent over ( but no sound !)The orb stopped on a dime & hovered motionless.I dont know how much time passed we seemed paralyzed. Then it made circular motion & took off in the blink of an eye ,up & INTO the the wind. As soon as it left we looked at each other & said \" they know we saw them\" I dont know why.It gets Very stange after this.This was the night the Edmund Fitzgereld sank in lake Superior, one of the worst storms ever. We saw this craft in broad daylight before the storm hit.After we saw it at 2:00 pm. the next thing I remember is it being nighttime & putting my girl in her playpen & covering it with blankets in case the windows blew in. You could hear trees crashing down outside.I dont remember being afraid at all, my husband seemed real excited & took off to drive around the island! We could have been killed, I dont know why I wouldnt have tried to stop him.There seemed to be alot of people who saw ufo s that night but I havent read any thing about it.It seems as tho most sightings are also at night but this wasnt. 7"],"Viewing Distance":"101-500 Feet","Summary":"felt as if sound had been sucked out of room , preasure dropped, went to window & saw orb.","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Sault Ste. Marie","There were no other sightings in Sault Ste. Marie on or around November 9th 1974"],"Date of the Event":"11/09/1974 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.49804,+-84.337507(41618)&iwloc=A&hl=en\"> mufon case (41618) map </A>"}