{"divs":["Sighting DetailsI tend to sit outside once my wife turns in for the night. I sit and enjoy a cigar, read something, have a cold beer and let the dog do her business. I do this every night and on clear days I also take my small binoculars out and watch the stars, planets and the moon. I've witnessed meteors streak across the sky. I've watched satellites slowly move across the night sky. I've watched countless airplanes and helicopters be they civilian, military, commercial etc in the sky over my home throughout the years but I NEVER witnessed anything of the type I witnessed on the night of July 18th. 2012. I was out in my back yard around 10:30 pm having a cigar and waiting for my small dog to finish her \"ritual.\" My wife and I have a large, hand held floodlight we take with us to check for skunks before we allow the dogs out. On the night in question, I was standing approx. 20 feet from my porch so the sensor on the porch light timed out. There wasn't a cloud in the sky and i looked up and thought i saw movement coming from the Ursa Minor Constellation. It seemed as though one of the stars was moving in a northerly direction.I thought it might be a satellite so I paid it no mind until it \"Stopped\" moving and seemed to blink. As I watched it for a few seconds it seemed as though the \"air\" around the \"Star\" seemed to \"ripple' sort of the same way heat does when watching it rise from the ground at a distance. I it was then that I noticed it \"moving\" again and thought it odd as the stars that make up the Constellation of Ursa Minor don't MOVE! so I shined the flood light at the \"Star\" that was moving and That's when i realized I was watching something very strange. It seemed to \"absorb\" the light..It reminded me of the way water moves when a pebble is dropped and ripples. As I shined the light on it, it actually seemed to respond. It shined a light back at me! At first i thought it an optical illusion but when I did it a second time, and blinked the light several times, it repeated the sequence I had just done! This \"THING\" was massive! Made no noise and moved very slow across the sky. It blocked out the stars for a few moments that i shined the light at it as if to let me know it was actually there..i know that sounds silly but that's what happened. I watched it slowly fade as if \"cloaking\" again but i could make out the shape as it seemed to blink in and out as it moved. I lost sight of it as the tress blocked my view of it. That's what I witnessed and was wondering if anyone else witnessed this on the night in question."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.467627,+-88.1959(41616)&iwloc=A&hl=en\"> mufon case (41616) map </A>","Case Number":"41616","Sighting Duration":"Undisclosed","Longitude":"-88.1959","files":["/var/www/straped/mufon/html2text/41616.html.txt","/var/www/straped/mufon/org/41616.html"],"Viewing Distance":"Unknown","Disposition":"Unresolved","Object Features":"Other","Latitude":"41.467627","Source":"MUFON","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Log Number":"US-08102012-0020","City":"Channahon","Date of the Event":"07/18/2012 12:00 UTC","Country":"United States","Date Submitted":"08/10/2012 05:53 UTC","Tags":"City","Summary":"Witnessed a very large UFO over my home","trends":["There have been 2 other sightings in Channahon","There were no other sightings in Channahon on or around July 18th 2012"],"Region":"Illinois","Object Shape":"Boomerang"}