{"Date of the Event":"08/04/2012 12:00 UTC","Tags":"City","City":"New York","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-08102012-0024","Summary":"very bright and glowing orange light moved steadily south to north 1/2 hour intervals 4 total appeared same flight path shape and color","files":["/var/www/straped/mufon/html2text/41620.html.txt","/var/www/straped/mufon/org/41620.html"],"Object Shape":"Square, Rectagular","Object Features":"Unknown","Date Submitted":"08/10/2012 09:18 UTC","Source":"MUFON","Country":"United States","Latitude":"40.718383","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.718383,+-73.997233(41620)&iwloc=A&hl=en\"> mufon case (41620) map </A>","divs":["Sighting DetailsAround 10 pm, my family was on front porch facing due west looking out over lake ontario, elevation about 260 feet. It was a clear, hot night (82'F). Moon was waning gibbous and was behind us to the east, not yet risen. At about tree-top level (apparently) a box-kite like object moved into our vision moving south to north perpendicularly against about a 10 mph SW wind. It moved steadily and without any sound. Object was very bright, glowing bright orange and eventually disappeared in the distance. Six adults and 4 young children witnessed this. (Later we found out 2 neighbors also observed this event.) It was about 50 degrees above the horizon and about the size of a thumbnail when your arm was extended. It looked like a ball on fire was inside this \"kite.\" In fact we thought at first it was some kind of firework, which was strange because it retained a steady glow and a steady direction perpendicular against the wind, unlike a firework which would have faded and could not have moved so steadily against the wind. About 30 minutes later another one appeared from the same direction, going south to north (the same direction as the first). About 30 minutes after that a third one appeared and a fourth one appeared about 30 minutes after that. We waited another hour (until 12:10 a.m. Aug. 5, 2012), but nothing else appeared. None of us have ever seen anything like this although we frequently star gaze at this location in the summertime."],"Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around August 4th 2012"],"Longitude":"-73.997233","Sighting Duration":"Undisclosed","Case Number":"41620"}