{"Region":"Washington","trends":["There have been 9 other sightings in Spanaway","There were no other sightings in Spanaway on or around August 9th 2012"],"Latitude":"47.111698","divs":["Sighting DetailsIt was a dark summer night, I was getting ready to sit down in my living room. I looked outside briefly, as i always do. I see airplanes sometimes or the occasional helicopter. But this was none of those things. I saw a ball of light, almost like an orange, amber-red color. I told my dad ''What the h*ll is that? you have got to see this'' me, my father and my brother all went outside to see this mysterious object. I said to myself ''No, no this is nothing.'' But this was roaming around the trees and suddenly vanished. Another one came, and another one came in a straight line formation. They were all the same color. And when the color would go away, i saw a small dark object far up in the sky. A few more past and it was just breath taking to me, it stopped me in my tracks and i didn't know what to say or what to do. I started to cry and i couldn't breathe. I even had trouble sleeping last night and now it's all i can think about. I never thought i would see something like this. I waited to see if more of them would pass but they would become more bright and than slowly fade away as if turning off a light."],"Object Features":"Unknown","Log Number":"US-08102012-0025","Source":"MUFON","Longitude":"-122.426206","Country":"United States","Sighting Duration":"Undisclosed","City":"Spanaway","Object Flight Path":"Undisclosed","Object Shape":"Circle, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=47.111698,+-122.426206(41621)&iwloc=A&hl=en\"> mufon case (41621) map </A>","Date of the Event":"08/09/2012 09:00 UTC","Date Submitted":"08/10/2012 09:56 UTC","Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","Case Number":"41621","files":["/var/www/straped/mufon/html2text/41621.html.txt","/var/www/straped/mufon/org/41621.html"],"Summary":"Breathtaking, speechless.","Viewing Distance":"Unknown"}