{"Latitude":"44.785924","files":["/var/www/straped/mufon/html2text/41628.html.txt","/var/www/straped/mufon/org/41628.html"],"trends":["There have been no other sightings in Empire","This sighting has never been favorited."],"Country":"United States","Tags":"City","Object Flight Path":"Path with directional change","City":"Empire","Disposition":"Unresolved","Source":"MUFON","Longitude":"-86.001069","Object Shape":"Sphere","Date Submitted":"08/11/2012 12:41 UTC","Date of the Event":"08/08/2012 10:30 UTC","Weather Factors":"Unknown","Summary":"Star-like object flies over campground.","Case Number":"41628","divs":["Sighting DetailsWe were camping outside of Empire, Michigan on August 8 and had just noticed the sky had darkened enough to see many stars. My partner and I walked out to an open space and spent a moment watching the sky. We saw two different satellites and a meteorite and decided to walk back to our campfire to give our necks a rest from looking up. As we walked back I looked up through the trees towards the southwest and saw a very bright star through the trees. I immediately thought \"wow, Venus is really bright tonight\" and made a note to myself to look at it the next time we went to look at stars. When we sat down at the campfire I suddenly saw movement out of the corner of my eye and looked up to see a solid white light moving from the southwest towards the northeast. I first said \"hey, there's a really bright satellite\". The light was solid and unblinking and the object was moving (at first) in a straight line at a steady pace, like a satellite. However, it was bigger than a bright Venus (and was the object I mistook for Venus a moment before). We both watched it move past our campground. It was night with minimal clouds so it was difficult to judge the elevation, but it was too low and bright to be a satellite, and too fast and silent to be an airplane and had no blinking lights anywhere. The object at first seemed to have a large light, but soon we realized that the object itself seemed spherical and also seemed to glow from the inside. The light was very bright, similar to airline landing lights. However, it was low enough and close enough to us that we would have heard the engine if it had been an airplane. There was no noise. The forest was fairly silent (no moon yet) and we heard nothing from the passing of the object. We watched it move slightly overhead heading northeast, then it arched in a steep angle curving back to the west and descending. After that, it stopped in place and descended like a helicopter until it disappeared behind the tree line to the northeast. We did not see it again, nor did we see anything else like it the rest of the night. This campground is next to a small airport, but this object was completely silent, very bright, and running long distances in the dark. If it had been an airplane, we would have heard something. Earlier in the day we were listening to RC airplanes being run on the airport grounds, so we would definitely have heard something this big. Between the two of us we tried to come up with a logical explanation for the object. It was too low and bright for a satellite. It was too silent and moved illogically for an airplane, but was also too silent to be a helicopter. It had no other lights than the glow of the object itself. No strobes, or colored lights were visible. It was also too quiet, big, and bright to be an RC vehicle. We cannot come up with something that explains it."],"Log Number":"US-08112012-0003","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"Michigan","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.785924,+-86.001069(41628)&iwloc=A&hl=en\"> mufon case (41628) map </A>"}