{"Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Region":"Georgia","Viewing Distance":"Unknown","Object Shape":"Unknown","Tags":"City","Disposition":"Unresolved","Date Submitted":"08/10/2012 11:32 UTC","Country":"United States","Longitude":"-83.7783","Latitude":"31.100804","City":"Moultrie","trends":["There have been 3 other sightings in Moultrie","There was one other sighting in Moultrie on or around August 10th 2012"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/41623.html.txt","/var/www/straped/mufon/org/41623.html"],"Log Number":"US-08102012-0027","Summary":"Sighted At 10:28PM was east by north east next time at 10:56 PM right over my house","map":"<A HREF = \"http://maps.google.com/maps?q=31.100804,+-83.7783(41623)&iwloc=A&hl=en\"> mufon case (41623) map </A>","Case Number":"41623","divs":["Sighting Details AT 9:26 pm i spotted when i went to go outside to smoke. I went back in the house and ask my 13yr old granddaughter to come outside. i point to it and ask her she could see it moveing she said yes that was. at 9:28 pm was right over my house. AT 10:30 pm went outside took a short break my 7yr old came out with me and said papa we going to se any aliens and i said yes i look for the one my house it move to the west still doing grazy ivan's so i look around. found 7 more ufo's 4 were in like shallow arch to the north&north west i look to the west north west and their where 3 more in triangle form. the 1 at the top of the triangle stay still the 2 at bottom of the triangle were in motion they would move out and return . (a airplane with red nav lights only) pass under the one own top of the triangle. when i see these ufo's i am watching them with the naked eye how high they are i would said at least 80.000 ft are more. AT end this report i just went outside and all 8 of were still their doing grazy ivan's at 11:25 pm. THANK YOU"],"Weather Factors":"Unknown","Date of the Event":"08/10/2012 09:28 UTC","Sighting Duration":"Undisclosed"}