{"Case Number":"41632","map":"<A HREF = \"http://maps.google.com/maps?q=33.426022,+-104.530213(41632)&iwloc=A&hl=en\"> mufon case (41632) map </A>","divs":["Sighting DetailsAfter a long hot day, my husband and I decided to relax on our front patio. we were discussing our day at 10:00 pm and I happened to notice something above my large willow tree. It was like a triangle of faint stars...that were moving! I immediately leaned forward to see better and saw that there was a faint dark outline in what would best be described as a boomerang shape or a very wide v-shape. The center of the object seemed transparent or camouflaged like the stars...very hard to describe this.I had jumped out of my chair by this time to try to follow it as long as possible before the large tree-line obscured any further sight of it. My husband's veiw of it was totally obscured by trees unless he were to get up out of his chair. By the time he saw that I was really seeing something that had me shaken and got to where I was ...it was gone. He knows that I really saw exactly what I'm trying to describe because after 30 years of marriage he can tell when something is causing a real reaction from me. My actions in this case shocked him a little. I was extremely rattled and didn't go to sleep for quite some time even though I wake up before six every morning. I am not a real believer in aliens from other planets and I have seen alot of strange things in the sky in my 59 years...lights, flashes, oblong lights etc., but I have NEVER seen something so obviously a huge craft like this. I have never even told anyone about any other objects because they were so subjective. This was NOT! It was a giant craft that glided silently over my skyline. That's all I know. Thank you for allowing me to file this report as my son ( a well-thought of firefighter in our little city) begged me not to make a report with our local police! :-) This hopefully will help me to let this go now."],"Latitude":"33.426022","files":["/var/www/straped/mufon/html2text/41632.html.txt","/var/www/straped/mufon/org/41632.html"],"Date Submitted":"08/11/2012 01:31 UTC","Weather Factors":"Unknown","Longitude":"-104.530213","Object Flight Path":"Straight-line path","Source":"MUFON","Log Number":"US-08112012-0007","Object Features":"Undisclosed","Country":"United States","Object Shape":"Boomerang","Summary":"very large bommerang shape with very dim lights along front...like a moving formation of stars..","City":"Roswell","Date of the Event":"08/09/2012 10:05 UTC","Region":"New Mexico","Disposition":"Unresolved","Viewing Distance":"Unknown","Sighting Duration":"00:00:45","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around August 9th 2012"],"Tags":"City"}