{"Log Number":"US-08112012-0008","Object Features":"None","files":["/var/www/straped/mufon/html2text/41633.html.txt","/var/www/straped/mufon/org/41633.html"],"City":"Inglewood","Region":"California","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Longitude":"-118.340958","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.932605,+-118.340958(41633)&iwloc=A&hl=en\"> mufon case (41633) map </A>","Latitude":"33.932605","divs":["Sighting DetailsAs I was walking to home I noticed a large blinking light changing colors in which i called out my wife, brother in law and friends so i may not seem crazy the next day when i told them of what i saw. there were orbs around flashing on and off around it, the orbs would appear next to it then appear some other location in a blink. this was close to Los Angeles international Airport.At first i thought it might be a plane or helicopter but they were flying around area and you could tell from plane to this unkown object. It moved very slow then hovered then moved on then stopped on an area of sky for about 15min. then moved on for another 15min until for about an hour it disappeared from sight heading far in distance where it was hard to see with naked eye. in which . It was flashing colors really bright from blue, orange,red,and white. it would also turn off then begin colors once again. I do hope someone else did see this and reports with video. I tried taking photos but they wouldnt come out at all."],"Source":"MUFON","Summary":"As I was walking to home I noticed a large blinking light changing colors in which i called out my wife, brother in law and friends so i may not seem crazy the next day when i told them of what i saw. there were orbs around flashing on and off around it","Date of the Event":"08/10/2012 11:29 UTC","Tags":"City","Date Submitted":"08/11/2012 03:38 UTC","Case Number":"41633","Disposition":"Unresolved","Object Shape":"Diamond, Star-like","Viewing Distance":"Over One Mile","trends":["There have been 4 other sightings in Inglewood","There were no other sightings in Inglewood on or around August 10th 2012"]}