{"Disposition":"Unresolved","Viewing Distance":"Over One Mile","Source":"MUFON","Log Number":"FR-08112012-0023","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=48.866014,+2.357472(41648)&iwloc=A&hl=en\"> mufon case (41648) map </A>","Longitude":"2.357472","Country":"France","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI was in my appartment, which is located at the 11th floor (very high) and I've invited some friends over to check the sky because in France, we have a national tradition called \"the night of the stars\" (everyone looks at the falling stars). But early in the evening, when the sun was still up, I've seen a very bright orb, white color at first, at the end of the horizon. It was for sure way bigger than a star, and it was static and pulsating very fast. The strange thing is that the light was not affected by clouds, it was still very shiny. It was located North. After 20 mns of sighting, it started to become red, then white, switching positions in very short time. Then it litteraly disappeared. But 5 mns later, the orb was back, but to North-East, still playing with lights. After that I had to stop looking, because my friends were getting angry. I was extatic, and my friends were too at first, but they don't believe in UFOs. They all thought it was \"Mercury\" or a very bright star, but it was acting too weird to be that. I couldn't take a picture or video with my Iphone, the orb was too far away."],"Region":"Île-de-France","Date of the Event":"08/11/2012 12:00 UTC","trends":["There have been 11 other sightings in Paris","There were no other sightings in Paris on or around August 11th 2012"],"Case Number":"41648","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Latitude":"48.866014","Weather Factors":"Unknown","City":"Paris","files":["/var/www/straped/mufon/html2text/41648.html.txt","/var/www/straped/mufon/org/41648.html"],"Date Submitted":"08/11/2012 09:34 UTC","Object Features":"None","Summary":"Bright redish orb over Paris, France, doing strange stuff."}