{"Object Features":"Appendage(s)","Date Submitted":"08/11/2012 06:00 UTC","Latitude":"39.719343","Case Number":"41643","Weather Factors":"Unknown","divs":["Sighting DetailsMy girlfriend and I were returning from Olive Garden in my car(2004 Sonata).About 0.1 mile from home we descended a large hill.As we passed the last house on the road,an object materialized at the side(passenger side of car) of the road.We spotted it simultaneously,but did not know what it was.It was black,cubic,and about 2 feet on each side.Stacy said see could see 4 metallic legs under it.I thought I could see heat radiation coming off its surface.I tried to avoid it but it lifted up and rammed my right front fender hard as I passed,knocking off my fog light and folding the fender under the wheel well.The object had a metallic feel to it when it hit my car.Stacy rolled down her window because she said she \"heard something weird\".The car began vibrating roughly(I had kept going - I was frightened),as if it would stall.We both heard loud jet engine-like noises coming from the right side of the car.I told her to roll up the window and that I would try to get us home.The object was pushing laterally on my car.Suddenly the noises and force pushing against the car stopped. I coasted into my driveway. We got out and examined the car.The right side front fender shroud had been split.Plastic parts littered my driveway,including the foglight.We discussed what had happened and decided to go back to the impact site.We got in another vehicle,my truck,and went to where we saw the object,not more than 10 minutes later.Nothing was there.No debris was there either.Neither of us spoke about the objects appearance till this morning,I.E, the cubic shape.We were both sort of embarassed to admit to each other the weirdness of what we actually saw,but we agree about the basics.I didnt see the legs and she didnt see the heat signature.We both saw the shape and color,however.We walked up the hill today,along the road and found 4 more plastic pieces of my car.One has obvious melted areas as if heated."],"Country":"United States","Longitude":"-82.546334","files":["/var/www/straped/mufon/html2text/41643.html.txt","/var/www/straped/mufon/org/41643.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"08/10/2012 11:15 UTC","Tags":"City","City":"Lancaster","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","trends":["There have been 8 other sightings in Lancaster","There were no other sightings in Lancaster on or around August 10th 2012"],"Log Number":"US-08112012-0018","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=39.719343,+-82.546334(41643)&iwloc=A&hl=en\"> mufon case (41643) map </A>","Object Flight Path":"Straight-line path","Region":"Ohio","Summary":"small cubic black device materialized and rammed my car"}