{"map":"<A HREF = \"http://maps.google.com/maps?q=47.84097,+-120.016459(41642)&iwloc=A&hl=en\"> mufon case (41642) map </A>","Object Features":"None","Longitude":"-120.016459","Object Flight Path":"Straight-line path","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Country":"United States","Log Number":"US-08112012-0017","Summary":"Object in sky flashed bright white light","Latitude":"47.84097","Date of the Event":"08/09/2012 09:41 UTC","divs":["Sighting DetailsMy girlfriend and I were camping at Lake Chelan State Park at the most eastern part of the campground (can be found on Google Earth) and we were sitting on the table at our camp site on the night of August 09 2012. I was looking at the night sky above and around us and could see the stars clearly as there was no clouds at all. I saw a few planes flying across the sky on the opposite side of the lake and could clearly seeing the aviation lights on them. I was looking almost directly above us when I saw a dim light traveling in a straight path and steady pace in a northern direction. I have seen many satellites and believed that this was what I was watching. I said to my girlfriend \"look at the satellite above us.\" Her and I were looking at it and suddenly it got extremely bright and after about two seconds, returned to its previous dim light. The object traveled on its path at a steady pace for approximately 5 to 10 seconds or so and then just disappeared. There was no other lights emitting from the object. I immediately checked the time on my phone and it was 2141 hours. I was excited about the observation and told my girlfriend that I think we just saw a UFO that powered up. My girlfriend and I discussed what we saw and could not come up with an explanation for what we saw. My girlfriend is a skeptic and does not believe in UFOs. We star gazed for an hour or so after the sighting and saw shooting stars and agreed that it was no shooting star. We watched satellites cross the sky and were able to track them for a minute or so as they traveled out of sight. We both agreed that what we saw earlier did not behave like a satellite. I do have photos of the sky line at the approximate time but not of the object that we seen."],"Disposition":"Unresolved","Date Submitted":"08/11/2012 04:03 UTC","City":"Chelan","Case Number":"41642","Weather Factors":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/41642.html.txt","/var/www/straped/mufon/org/41642.html"],"Region":"Washington","Tags":"City","trends":["There have been 2 other sightings in Chelan","There were no other sightings in Chelan on or around August 9th 2012"]}