{"Source":"MUFON","Latitude":"38.899072","Region":"Washington","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","City":"Washington","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around August 6th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.899072,+-77.032926(41655)&iwloc=A&hl=en\"> mufon case (41655) map </A>","Log Number":"US-08112012-0029","Disposition":"Unresolved","Object Shape":"Diamond, Egg, Oval, Teardrop, Other","Viewing Distance":"101-500 Feet, Over 1 Mile","Country":"United States","Tags":"City","divs":["Sighting Detailsdriving south on i5 near marysville i see a bright planet sized object flying at a high altitude from the sw to the ne. after watching for a couple min. it changed direction and appeared to drift north directly over i5 then fly directly east dimming as it moved away. around south everett it descended over the hills to the east dropping to a very low altitude. it then flew back towards me (from the east,north east to west, southwest) in between exit 196th and 220th the object flew over me as i was driving down i5 south bound at an approx. altitude of 3-500 ft. with a blacked out helicopter chasing directly behind it about 2-500 ft behind the object. the helicopter had only one small red light on its tail on, the only reason i knew it was a helicopter is because i could see its silhouetted against the sky, the object had a kind of fluid bright blue-ish white light underneath the hole craft that was brighter in the center, the top was not lit at all and i could barely make out the shape the light from the bottom seemed to wrap up around the edges and the top which was also silhouetted against the sky seemed almond or pumpkin seed shaped. they flew over and as i approached the crest of a hill (the 220th exit) i could see that the object had moved away and the helicopter was slowly flying south on by its self."],"Weather Factors":"Unknown","Object Features":"Dome, Other, Unknown","Summary":"witnessed object for approx. 30 min various directions distances at one point closely tailed by helocopter with one red light","Date of the Event":"08/06/2012 09:45 UTC","Longitude":"-77.032926","files":["/var/www/straped/mufon/html2text/41655.html.txt","/var/www/straped/mufon/org/41655.html"],"Case Number":"41655","Date Submitted":"08/11/2012 11:05 UTC"}