{"Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Latitude":"37.983716","Date of the Event":"05/10/2012 08:35 UTC","trends":["There have been 6 other sightings in Athens","There were no other sightings in Athens on or around May 10th 2012"],"Log Number":"GR-08112012-0028","Longitude":"23.72931","Tags":"City","Region":"Attica","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.983716,+23.72931(41653)&iwloc=A&hl=en\"> mufon case (41653) map </A>","Source":"MUFON","City":"Athens","Date Submitted":"08/11/2012 11:01 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/41653.html.txt","/var/www/straped/mufon/org/41653.html"],"Case Number":"41653","Summary":"on cruise ship Serenade of the Seas, night before we port Athens Greece","Object Flight Path":"Path then hovering","Country":"Greece","divs":["Sighting DetailsMy friend Kathy and I were on our balcony outside of our room smoking a cigerette. I had just put mine out and was standing at the railing looking toward the front of the ship feeling the wind looking at the waves. Kathy sid \"oh my gosh what is that?\" I said what as I looked at her. She pointed straight ahead, I looked and there was 3 amber colored spheres coming at a high speed in a formation right at us. We did not have to look up as you do when you see an airplane. They were eye level, as soon as I said \" oh my\", they stopped. They hovered for a few seconds almost as if they stopped when we saw them or they saw the ship. The one in the middle then bumped (that is what it looked like) the one on the left side and then bumped the one on the right side, then all three did a little jiggle like dance , got back in formation and flew right toward us. They were not high at all. I was tranfixed on them and did not grab my camera. they flew over the ship and I bent down to look above me to watch them go over the ship. They were spheres not something with a spot light they were amber colored shperes. they made no sound at all, no engine sound as if they were an airplane, not rotor sound as if they were a helicopter, they were silent. We stood in awe for a few minutes just taking it in on what we saw. We did ask the next day (we asked several people) if they seen anything like we did....no one did. Surpisingly no one did or at least the ones we asked. Having several ufo experiences throughout my life I was glad I saw this. It did not make me frightened it made me feel like everything that has happened to me was real and not a dream."]}