{"Region":"Florida","City":"Wesley Chapel","divs":["sighting detailsmy wife and i observed 3 lights in the night sky between 9:00 and 9:30pm est on the night of august 11, 2012 in a city called wesley chapel\\new tampa, fl. we first observed the lights forming a transparent triangle shape just to the west of a sam's club (which would put the object somewhere around i-75 between sr 56 and sr 54 in pasco county florida). we pulled the car into the parking lot of sam's club to get a better look. upon exiting our car, we watched the object as it continued in an easterly path to the north of the sam's club. the object appeared to be under 1000 feet high, because it flew between the ground and the thunder clouds that were in the area at the time. also, the object appeared to be 200-300 feet in length. when we saw that the object was going to pass to the north of us, we attempted to pursue and intercept the path of the object. we drove north on bruce b downs, approximately 1 mile north of sr 56. we then pulled over to the side of the road as the object continued its flight path to the east. while we were observing, another couple and their children pulled over to the shoulder and observed this same thing. after a little research, we saw that some triangle shaped sightings are simply the noss satellites, which have been misidentified as a ufo. however, this was not that, because this object was flying below thunder cloud height, which is well below any satellite orbit."],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/41657.html.txt","/var/www/straped/mufon/org/41657.html"],"Disposition":"Unresolved","Longitude":"-82.353678","Date of the Event":"08/11/2012 09:15 UTC","Summary":"three lights forming a triangle formation or a transparent triangular shapped object.","Source":"MUFON","Object Features":"None, Unknown","Case Number":"41657","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Wesley Chapel","There were no other sightings in Wesley Chapel on or around August 11th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.185723,+-82.353678(41657)&iwloc=A&hl=en\"> mufon case (41657) map </A>","Tags":"City","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Straight-line path","Log Number":"US-08122012-0001","Latitude":"28.185723","Object Shape":"Triangle","Date Submitted":"08/12/2012 12:12 UTC"}