{"files":["/var/www/straped/mufon/html2text/41663.html.txt","/var/www/straped/mufon/org/41663.html"],"divs":["Sighting DetailsStanding at my local pool cleaning it with 2 friends 9:35pmish. seen three orbs appear out of thin air swirling around each <--- watched for around 20 mins I noticed them because I see jets and planes all day, but when you see s@$t jumping around and either silent or humming you KNOW its no from here, black triangles appeared as silent 747s before the illusion was seen thru by not only me but my two other witnesses all seen same thing, one witness seen them on aug 10 at around the same time as tonight he said we'd probably seen them again as they make their \"rounds\" apparently, thought he wasnt serious at first. then seen two \"objects\" appeared first like a commercial jet with a humming sound instead of jets, appeared to mist over when close then I realized it was no longer a very unusual jet but a black triangle with multi-colored flashing lights unlike planes here. when they appeared as a unusual jet couldnt make out markings but they changed appearance as they got closer first the tail end vanished first then it fogged over as the under side lights flashed in various orders, colors that planes and jets DO NOT use. emotionally it struck me as odd, uncomfortable its like it knew it was being watched. NOTE: two airports and an airforce base near me I am in direct flight paths and know what jets, planes and helicopters sound like. one of my neighbors sees the cloaked(illusionary) ufos 2-3 times a week Also I'll be out every night with my HD camera, I will video tape it hopefully a jet will be flying over to get perspective."],"Longitude":"-122.463219","Object Flight Path":"Path with directional change,Path then hovering","City":"Fairview","trends":["There have been no other sightings in Fairview","This sighting has never been favorited."],"Date of the Event":"08/11/2012 09:38 UTC","Disposition":"Unresolved","Log Number":"US-08122012-0007","Tags":"City","Region":"Oregon","Viewing Distance":"Over One Mile","Latitude":"45.537166","Object Features":"Other, Unknown","Case Number":"41663","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Boomerang, Other","Country":"United States","Summary":"3 glowing orbs swirling around, then 20 min later 2 objects change appearance","map":"<A HREF = \"http://maps.google.com/maps?q=45.537166,+-122.463219(41663)&iwloc=A&hl=en\"> mufon case (41663) map </A>","Date Submitted":"08/12/2012 04:05 UTC"}