{"Country":"United States","Weather Factors":"Unknown","Date Submitted":"08/12/2012 01:05 UTC","Date of the Event":"08/05/2012 09:30 UTC","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Object Features":"Unknown","Summary":"Three lights in a stright line stationary in the eastern Sky.. the center one started to move N to S then W to E","Object Shape":"Circle","Longitude":"-81.601742","Case Number":"41669","Tags":"City","trends":["There have been 2 other sightings in Davenport","There were no other sightings in Davenport on or around August 5th 2012"],"divs":["Sighting Details I was backing my car out of the garage I got out of the car and I don't know why but I looked up at the Sky to the East noticed what appeared 3 lights evenly spacedin a line I observed them for about a minute the one light in the middle started movingin a North and South direction back and forth maybe two or three cycles then it quickly changed moving west then east for what appeared to be two cycles and at the very end of the last cycleit made a turn in on it's self making what looked like a J with the bottom of the J pointing to the South.The color of the lights were yellowish white. Being familiar with the MUFON Field Investigators manual, I thought it could possibably be an optical Illusion. Did not think much about it .Till later that evening I noticed Bright Blue Flashes behind the Privacy Fence they were not lightening they were there was one flash and about ten minutes later there was another. There is an Untended Orange Grove there and it goes right up to a stand of large Pine trees which go almost to the edge of a State Highway. I lost sight of the Object Because I stopped watching it. After the flashes behind the fence I thought this is just to strange the earlier sightings might not be Optical Illusion."],"map":"<A HREF = \"http://maps.google.com/maps?q=28.161405,+-81.601742(41669)&iwloc=A&hl=en\"> mufon case (41669) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-08122012-0013","files":["/var/www/straped/mufon/html2text/41669.html.txt","/var/www/straped/mufon/org/41669.html"],"Latitude":"28.161405","Region":"Florida","Source":"MUFON","Viewing Distance":"101-500 Feet","City":"Davenport"}