{"Latitude":"47.053163","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Lacey","There were no other sightings in Lacey on or around August 12th 2012"],"Viewing Distance":"21-100 Feet","Source":"MUFON","Disposition":"Unresolved","Log Number":"US-08122012-0009","Summary":"was walking to the laundry room of my apartment complex and saw a light that caught my eye","Longitude":"-122.787876","Object Features":"Unknown","Case Number":"41665","Country":"United States","Region":"Washington","Date Submitted":"08/12/2012 07:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.053163,+-122.787876(41665)&iwloc=A&hl=en\"> mufon case (41665) map </A>","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Tags":"City","Object Shape":"Oval","divs":["Sighting DetailsI was walking to the laundry room of my apartments when I noticed a really bright light up in the sky. At first I thought it was really bright star so I paid it no mind. I went into the laundry room and started my clothes in the washer. As I came back out I looked back at the sky and the object was still there but brighter this time. When I looked at it I noticed it was an ovalish shape and it was just such a bright white that I was still thinking maybe its a star or something. It started to move slightly which really grabbed my attention. It was going back and forth in a left to right motion for a few seconds then started to drop down from the sky in a swift instantaneous motion. It stopped quickly then started to climb upward and then next thing I know it started moving backwards towards where I was standing. It was still out in the distance but I could make out it was a sphereical oval shape now clearly. It hovered in the distance and it felt as though I had eyes on me watching me. I have never felt that way before and I am a believer but never had an expereince like this one before. Anyways it hovered for what seemed like a really long time but was probably a few seconds and then darted forward and was gone in a second. I mean it was literally gone out of sight and no longer in the sky like it just vanished. I decided to instantly tell you guys since I have seen you on shows on tv and knew that you would need this information!"],"City":"Lacey","Date of the Event":"08/12/2012 04:12 UTC","files":["/var/www/straped/mufon/html2text/41665.html.txt","/var/www/straped/mufon/org/41665.html"]}