{"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Longitude":"-77.961477","files":["/var/www/straped/mufon/html2text/41660.html.txt","/var/www/straped/mufon/org/41660.html"],"Date Submitted":"08/12/2012 01:32 UTC","Case Number":"41660","Log Number":"US-08122012-0004","trends":["There have been 9 other sightings in Martinsburg","There were no other sightings in Martinsburg on or around August 10th 2012"],"Sighting Duration":"Undisclosed","Summary":"At county fair and saw lights in sky that was zig zaging.","Country":"United States","Latitude":"39.46211","Date of the Event":"08/10/2012 08:51 UTC","Region":"West Virginia","City":"Martinsburg","Tags":"City","divs":["sighting detailsi was at the youth fair for the county. i went down to the tracker pull area to meet some family members. the time was around 8:50pm. i was looking at the sky to see if any stars would be visible. i looked up and saw it was still cloudy. i was looking and saw this red\\red-orange object top of the clouds moving. i knew it wasn't a plane. i watched as the object zig zag across the sky. i watch as the cloud coverage move away and could see it wasn't a plane. it stopped and grew a bit brighter. then it abruptly went to the left, did a circle, and went back into the cloud. i stood at the spot i was at and notice that the object was going in and out of the cloud coverage. this lasted for a few mins. i decided to head up the hill to get some food. it only took me a min to walk up the hill to get in line for the food. the line was long, so i looked up in the sky again. this time the object had turned from red\\red-orange to white. it was still zig zagging around. it was still light cloud coverage, but very easy to see what it was doing. then an \"orb\" flew around the object. the main object was still when the \"orb\" went around it. then it started to follow the orb. i lost sight of the main object when more heavy cloud coverage came thru. i don't know if anyone else was looking into the sky when this happen. everyone else was too busy getting food. i have seen objects in this area before."],"Object Shape":"Sphere, Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.46211,+-77.961477(41660)&iwloc=A&hl=en\"> mufon case (41660) map </A>"}