{"Date of the Event":"08/12/2012 02:00 UTC","Latitude":"29.767993","Date Submitted":"08/12/2012 01:31 UTC","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around August 12th 2012"],"divs":["Sighting DetailsI was watching the Perseid Meteor Shower with my friend about thirty minutes north of Houston when what I thought was an airplane caught my eye because it was moving around in all different directions at a fast pace. I was flabbergasted by what I was seeing and curious to know what it was. I thought it could have been a helicopter but I could not hear it and it was moving in ways I have never seen a helicopter move. I was speculating and one other idea I had was that it could be is a government owned radio-controlled observational craft. At times it would sit completely still in the air. At one point it moved up and down a few times but mostly it moved in a chaotic, tangled manner. It stayed in one area of the sky not deviating from it. Based on Google Sky Maps the object was in the small patch of sky where the Perseid Meteors were coming from. The original distance of the flying item, my best guess because I cannot be sure of its size, was not farther than a large commercial passenger plane and not closer than lower flying private planes. We tried to drive closer, but it began to move up away. As time went on, 2am-6:30am, it ascended slowly (occasionally still wavering unpredictably) getting smaller and smaller until it vanished in the morning light. It did not travel into the horizon, but up into the sky until it was out of sight. I was visited by an officer while I was watching both the meteor shower and this item. I mentioned it briefly to him. I wish I had asked him to look too but I am shy. He was only concerned if I was safe or not. Another thing I noticed was that, until 6:30am, there were no actual airplanes or helicopters flying anywhere nearby. One thing I did see fly by at about 5:00am had a linear path and speed much like an airplane but it had one orange light that would blink on, then completely off and on again predictably."],"Longitude":"-95.36167","Case Number":"41670","Summary":"I witnessed a flying lighted object during the Perseid Meteor Shower that performed erratic maneuvers at speeds much greater than any helicopters I have seen before.","Region":"Texas","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","City":"Houston","Object Flight Path":"Stationary,Other","Sighting Duration":"04:36:00","Log Number":"US-08122012-0014","Object Shape":"Other, Unknown","Country":"United States","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/41670.html.txt","/var/www/straped/mufon/org/41670.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=29.767993,+-95.36167(41670)&iwloc=A&hl=en\"> mufon case (41670) map </A>"}