{"Latitude":"44.35157","Case Number":"41678","trends":["There have been 3 other sightings in Wisconsin Rapids","There were no other sightings in Wisconsin Rapids on or around August 11th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.35157,+-89.762398(41678)&iwloc=A&hl=en\"> mufon case (41678) map </A>","Longitude":"-89.762398","Log Number":"US-08122012-0022","Region":"Wisconsin","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Unknown","Date Submitted":"08/12/2012 04:39 UTC","Date of the Event":"08/11/2012 10:25 UTC","Sighting Duration":"00:05:00","Object Shape":"Fireball","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Summary":"orange/yellow light moveing from NW to SE, fading from veiw towards horizon.","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/41678.html.txt","/var/www/straped/mufon/org/41678.html"],"divs":["sighting detailsat approx. 10:20 p.m. 8\\11\\12 my wife and i went onto the back deck on the south side of our home to view some of the meteor showers that were supposed to be prominent that night,as many as 100 per hr. during peek. we had been out there a few minutes and had already seen several good ones. as they seemed to be orienting themselves in a southwesterly direction, that is where we were concentrating our attention. i began to notice a bright light in the corner of my right eye and so turning my attention towards it i was now facing the northwest. i said something to my wife like, \" what the heck is that? \" she did not see where i was looking so i physically took her by the shoulders, pulling her towards me first so she could see beyond the roof line then turning her body around in order to orient her field of vision to view what i was seeing. i think her first words after seeing it were \" wow, what is it? \" we both watched this orange\\yellow light for several minutes as it silently traversed the night sky from nw to se. as it got towards the se it's brightness waned until it was no more visible than a dimly lit star. it's largest apparent size was approximately 1\\4 to 1\\2 inch in diameter as seen from arms length. brightness was perhaps that of the luminosity of the moon or better on a clear night. there was no moon visible at the time of sighting. some clouds were in the sky though none were blocking the view of this object. it gave us the impression of what an earth orbiter might look like if it were reentering the atmosphere and burning up. there was no sound or smoke or trail visible. because it was steadily dimming as it head se, we suspected too it could be a satellite or space debris as it curved out of the suns light. it was very spectacular to view and we're just wondering what it may have been and did anyone else report seeing something like this over the state that night?"],"City":"Wisconsin Rapids"}