{"Sighting Duration":"Undisclosed","Region":"Florida","City":"Clearwater","Source":"MUFON","Log Number":"US-08122012-0030","Disposition":"Unresolved","Tags":"City","Latitude":"27.999174","Summary":"Boomerang with a wingman a tethered craft being towed and ejecting orbs over Clearwater.","Longitude":"-82.75779","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 31 other sightings in Clearwater","There was one other sighting in Clearwater on or around August 11th 2012"],"Object Features":"Unknown","Date of the Event":"08/11/2012 08:40 UTC","Country":"United States","divs":["sighting detailsmy self and 2 others were heading south on keene rd. north of sunset blvd. when we noticed a large group of lights heading toward us. there appeared to be 4 object the largest was at least 200 - 300 feet across the front and shaped like a boomerang with 3 or 4 lights that blinked and constant lights as well. the 2nd object appeared to be in a very tight wing man position of the left wing of the 1st object maybe 20 feet apart. the 3rd object looked like the 2nd object with a bright silver strobe red and green lights but not in the normal aviation layout as you could see both red and green from the port side. the 3rd object appeared to be tethered to the 1st object and trailing by a half mile with a single bright white\\silver strobe on the tether located about a 3rd of the way from the 1st object back to the 3rd object in tow. we pulled over and watched and i filmed from my phone. the 1st object released orbs from the bottom and they shot west. these objects appeared to be orbs but were very hard to see as they were a very dim white color and disappeared within 1-2 seconds of being launched. the objects past us to the west and headed north until approximately klosterman rd. were it banked right or east and headed toward an extremely large thunder storm. this is my second report but have witnessed dozens of ufo's in the last 4 years."],"Object Flight Path":"Path with directional change","Object Shape":"Boomerang, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=27.999174,+-82.75779(41686)&iwloc=A&hl=en\"> mufon case (41686) map </A>","files":["/var/www/straped/mufon/html2text/41686.html.txt","/var/www/straped/mufon/org/41686.html"],"Weather Factors":"Unknown","Case Number":"41686","Date Submitted":"08/12/2012 09:47 UTC"}