{"Date of the Event":"08/11/2012 03:00 UTC","divs":["Sighting DetailsMe and my girlfriend were on caladesi island for the night, there were meteor showers for this evening so we figured we would camp out. After stargazing for hours my girlfriend notice a star that seemed to slide in its position and sort of move about in the sky in a motor controlled like wobbly fashion. after being shocked and not sure if my eyes were fooling me,i did a simple effective test, I confirmed that it was indeed moving !, by looking through a fixed branch of a tree,it moved well outside of my fixed sight line. I was shocked. upon further inspection WE found 3 to 5 more of these objects, which looked just like stars but were ever so slightly and smoothly shifting around the sky. My explanation was that these were some sort of scout crafts watching this even bigger cloaked triangle shaped ship. After looking some more we found three lights that seemed to have been the edges of a gigantic cloaked triangle shaped ship. I kid you not this thing seemed cloaked and triangular. this ship appeared to be hovering above the gulf of mexico looking west from the ocean edge of caladesi park. Many of the Other single light sources which appeared like stars were present, these like I said appeared to be small ships, at one point there was one of these smaller ships directly above us seemingly miles above, intelligently moving as though they were suspended in a liquid like movements with precise, controlled shifts. to add to it all there appeared to be other lights on the surface of the water miles out under the large triangle which seemed to be connected to the triangle ship. these lights rapidly shifted from side to side."],"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.02795,+-82.765408(41681)&iwloc=A&hl=en\"> mufon case (41681) map </A>","Case Number":"41681","Viewing Distance":"Over One Mile","Object Shape":"Egg, Saturn-like, Triangle","Latitude":"28.02795","Object Features":"Dome","Object Flight Path":"Stationary,Path then hovering","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41681.html.txt","/var/www/straped/mufon/org/41681.html"],"City":"Dunedin","Date Submitted":"08/12/2012 06:21 UTC","Longitude":"-82.765408","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Dunedin","There were no other sightings in Dunedin on or around August 11th 2012"],"Summary":"Cloaked triangle ship with orbs or assistant ships nearby","Log Number":"US-08122012-0025","Country":"United States","Weather Factors":"Unknown"}