{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.443371,+-94.772424(41680)&iwloc=A&hl=en\"> mufon case (41680) map </A>","Source":"MUFON","Date Submitted":"08/12/2012 06:10 UTC","Object Flight Path":"Path with directional change","Disposition":"Unresolved","divs":["Sighting DetailsMy roommate, and two sons were getting ready for a Perseid's watch party in the front yard. We looked up and saw a slow moving object very high up, too high to be a plane, non blinking, flying from south to north. We started to move to the backyard and when I got about ten-thirteen feet from my chicken coop, saw a black whispy figure approximately four feet tall disappear at a high rate of speed. It headed west toward my neighbor's fence. It was solid black and I did not see it long enough to determine a shape but thinking back on it, it had a caped figure type appearance to it. Then we did not see it again. My teenage son tried to tell me it was him running past the coop so I would not see him but I was ten feet or so from it, know he cannot move that fast, and would know him if I saw him. My roommate and my other son also would have recognized him. It just floated and zip..gone. Then...we observed a few meteors when my youngest son said \"Mom, look a UFO!\" What we observed were two balls of light above the tree line moving from a west to south east direction. They were flying parallel to one another and moving pretty fast, then they decelerated in unison, banked, switched direction, and quickly disappeared below the tree line. The balls of light that were on it, non blinking, did not move or separate. My teenage son saw it too and asked me what the he** it was...and I told him it was a UFO that he had told me I was crazy for believing in! My room mate injured her wrist trying to get up in a hurry trying to go see if she could get a better look at it. Shortly afterward, we saw another small orb traveling high up, from south to north, but that could have been a possible satellite. I know the other object was not either a meteor or a satellite though."],"Weather Factors":"Unknown","City":"Jay","Latitude":"36.443371","files":["/var/www/straped/mufon/html2text/41680.html.txt","/var/www/straped/mufon/org/41680.html"],"Case Number":"41680","Tags":"City","Summary":"Black Shadowy Figure, 2 orbs, and parallel lights that changed direction.","Date of the Event":"08/11/2012 10:00 UTC","Object Shape":"Fireball, Sphere","Longitude":"-94.772424","trends":["There has been one other sighting in Jay","There were no other sightings in Jay on or around August 11th 2012"],"Sighting Duration":"00:02:00","Object Features":"None, Unknown","Log Number":"US-08122012-0024","Viewing Distance":"501 Feet - 1 Mile","Region":"Oklahoma"}