{"Date Submitted":"08/12/2012 09:32 UTC","Weather Factors":"Unknown","Source":"MUFON","Country":"Puerto Rico","files":["/var/www/straped/mufon/html2text/41684.html.txt","/var/www/straped/mufon/org/41684.html"],"Longitude":"-66.867756","Object Flight Path":"Straight-line path,Unknown","Disposition":"Unresolved","Latitude":"18.090875","Object Shape":"Other, Unknown","Log Number":"PR-08122012-0028","Region":"Yauco","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsLast night i was at my house until i started to hear this deep sound, i thought it was my hometheater i got hooked at my computer, but i shut it off thinking it was it, but the noise kept on going, and the noise started to get louder and louder, i quickly went outside, looking for any trace of the sound, as it came from the sky and it was night, i was wondering if it was some sort of Commercial Jet, Military Aircraft or a plain Ballistic Rocket, but not sure if i saw the shadow of it, but also the noise became louder, there were no signs of navigation lights, like strobes, or Red or Green lights, since then ive been looking what it was. And the noise lasted around 15 minutes or so, the possible navigation it had was from West to East. Probably at the distance and the noise lasting that long, something with a very strong engine flew by, probably rocket type, and lastely, over 5 to 10 years, the U.S. Airforce have diminished greatly its use of Jet Fighters in the area plus the only military Aircrafts that can be heard are Cargo Planes and those are propeller type aircrafts, like back then 2 to 4 times a week I could see the F-16's flying by doing their practices. Im very curious what it was and if the military are returning or not with their drills, also there was another sighting that went around the night before of a probable fast object and crashed and it is unknown if it was an helicopter crash in the southern area near where i live."],"trends":["There have been no other sightings in Yauco","This sighting has been favorited 1 time."],"Sighting Duration":"00:15:00","City":"Yauco","Summary":"Wondering what kind of object was it. if it is Human or unmanned","Case Number":"41684","Date of the Event":"08/11/2012 12:00 UTC","Object Features":"None, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=18.090875,+-66.867756(41684)&iwloc=A&hl=en\"> mufon case (41684) map </A>"}