{"Tags":"City","Longitude":"-79.64115","Disposition":"Unresolved","Summary":"4 to 5 bright objects appeared in the sky around a released red balloon","Sighting Duration":"Undisclosed","Case Number":"41689","trends":["There have been 20 other sightings in Mississauga","There were no other sightings in Mississauga on or around August 6th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.596205,+-79.64115(41689)&iwloc=A&hl=en\"> mufon case (41689) map </A>","Latitude":"43.596205","Object Flight Path":"Path with directional change","Object Shape":"Circle","divs":["Sighting DetailsThe sky was blue with no clouds and the sun was very bright right above our heads. It was our daughters birthday and we were in a open school soccer field so we chose to release one of her red helium filled balloons into the sky just for fun. We followed it go straight up as there was no wind. Suddenly what looked like a white star appreared near the ballon. Soon another white star appeared both stationary. Then one of the stars began to slowly cross the sky and we thought it may be a satalite. Then it suddenly make a \"L\" shaped turn and stopped. Then another bright light appeared beside the first one which was still stationary in the sky. It then dissapread after a few minutes then reappeared again in the same spot a few minutes later. Then another white light appeared and began slowly crossing the sky. Then two of the white star like objects began to circle the balloon and then dissapeared. A few minutes later another light appeared and began crossing the sky. This went on for about 20 minutes until we lost sight of the baloon and then all the lights just disappeared. The sun was still bright so it couldn't be stars. It was too high for planes so we were stunned especially by the movements of these lights. It seemed as though they were checking out the balloon as they moved around it for a while. We were two very sober professional adults so we are credible. Can anyone possibly explain what we witnessed? Thanks."],"files":["/var/www/straped/mufon/html2text/41689.html.txt","/var/www/straped/mufon/org/41689.html"],"Region":"Ontario","Source":"MUFON","Object Features":"None","Country":"Canada","Date Submitted":"08/12/2012 10:16 UTC","Date of the Event":"08/06/2012 01:10 UTC","City":"Mississauga","Viewing Distance":"Over One Mile","Log Number":"CA-08122012-0033","Weather Factors":"Unknown"}