{"Disposition":"Unresolved","divs":["sighting detailsmy brother and i had just sat on the bench in my front yard last night (7\\26\\12) around 9 pm. after just a few minutes, we happened to both see a light appear and go out toward the east. i live in wesley, tx, and we were facing east toward houston. it seemed to be over chappell hill, maybe closer. we continued to watch, but did not see it again. the light was only visible for about a second or two, so we were fortunate to spot it. the light was amber colored, or a light orange and appeared to be sweeping the underside of the object. i decided to see if my front gate security dvr picked it up, and indeed it did. barely. the attached wmv shows the light appear at the very top center, just above the word \"frame\", which is imprinted by the dvr. i could not figure out how to eliminate the text display from the file. i also attached the compressed .avc file from the dvr, so perhaps you can view it without the text. also attached is a daytime clip from the same camera for additional perspective. my dvr time had drifted, so the time stamp on the video is wrong. the time was actually about 9:09 pm, july 26. again, it is just about due east from my house in wesley, so it was over southeast brenham, bluebonnet hills subdivision, or chappell hill. i don't believe it was any further away than that."],"Object Features":"Unknown","Case Number":"41682","Sighting Duration":"00:00:02","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41682.html.txt","/var/www/straped/mufon/org/41682.html"],"Summary":"Short sweeping light shinig on stationary object surface","Viewing Distance":"Over One Mile","Region":"Texas","City":"Brenham","Tags":"City","Object Flight Path":"Stationary","Date of the Event":"07/26/2012 09:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.166883,+-96.397744(41682)&iwloc=A&hl=en\"> mufon case (41682) map </A>","Log Number":"US-08122012-0026","Date Submitted":"08/12/2012 07:40 UTC","Object Shape":"Unknown","Latitude":"30.166883","trends":["There have been 2 other sightings in Brenham","There were no other sightings in Brenham on or around July 26th 2012"],"Longitude":"-96.397744"}