{"Tags":"City","Sighting Duration":"Undisclosed","Case Number":"41698","Country":"United States","Log Number":"US-08132012-0006","Disposition":"Unresolved","Summary":"during pleiades meteor shower, many dispersed light points over small period of time. Also a reddish pair of lights that stayed together. All moved fast most faded out, most changed directions","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.888325,+-120.153041(41698)&iwloc=A&hl=en\"> mufon case (41698) map </A>","divs":["sighting detailsmy wife and i went out to look at the meteor shower. we saw awesome meteors. also we noticed a small point of light hauling ass across the sky. it flashed with a weird pattern of red blue and yellow lights. i thought it might be a plane, but the light pattern was irregular and the speed was very high. the night is very quite, but we didn't hear any sound. it crossed the sky from roughly se to n then faded out over a period of maybe thirty seconds. at some point i went for the phone. the camera did not pick up any lights or stars. i called a friend and he went out with his wife to look. we started seeing points of light one at a time moving very quickly across the sky by themselves in different directions over the next twenty to thirty minutes. we also saw several more meteors, they were nothing like the lights. we saw a pair of lights reddish or orange in color. they were next to each other moving at the same speed. i think they were part of the same thing. when i relaxed my eyes and looked at some of the white\\yellow points, it looked like they were in front of some larger mass. it was like a very subtle grey surrounding the light in an oval or cigar shaped patch several times the size of the light. they did not move like meteors, satellites, lighter than air craft, or helicopters. they seemed too fast for any plane, barring a military fighter. the lights were not like you would see on a military plane and there was no sound on a very quite night, tranquil."],"City":"Manson","Source":"MUFON","Object Shape":"Blimp, Circle, Egg","trends":["There have been 2 other sightings in Manson","There were no other sightings in Manson on or around August 12th 2012"],"Longitude":"-120.153041","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/41698.html.txt","/var/www/straped/mufon/org/41698.html"],"Date Submitted":"08/13/2012 02:56 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"47.888325","Region":"Washington","Date of the Event":"08/12/2012 11:10 UTC"}