{"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Sagola","This sighting has never been favorited."],"City":"Sagola","Object Flight Path":"Path then hovering","Region":"Michigan","Date of the Event":"08/11/2012 09:30 UTC","Country":"United States","Tags":"City","Source":"MUFON","Date Submitted":"08/13/2012 12:53 UTC","files":["/var/www/straped/mufon/html2text/41693.html.txt","/var/www/straped/mufon/org/41693.html"],"Object Features":"None","Longitude":"-88.107153","Object Shape":"Boomerang","Disposition":"Unresolved","Weather Factors":"Unknown","Latitude":"46.044841","Summary":"Triangular shape, pulsating white bright light (unknown if one or several), hovered","Case Number":"41693","Log Number":"US-08132012-0001","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.044841,+-88.107153(41693)&iwloc=A&hl=en\"> mufon case (41693) map </A>","divs":["Sighting DetailsOn Saturday, August 11, 2012, my wife and I went outside at 9:00 pm to view the Perseid Meteor showers. We live in the country where there is no light pollution so we have a very clear view of the stars. At 9:30 I was in the yard looking upward when a very bright light in the sky heading from west to east caught my attention. I thought it was a plane flying into Saywer Airport about seventy miles northeast of our location. As it flew closer, we realized there was no sound or flashing running lights. It appeared to be triangular in shape but was far enough away that we could not determine if the craft had one large light or several smaller ones. The light on the object seemed like it pulsated and made us think of an l.e.d. light. The wife ran into the house for a camera and when she returned the craft was already to the east of us and too far off to take a picture. It appeared to stop, hover and get very bright for about 45 seconds at about 15 degrees above the horizon before continuing its eastward flight. We watched the object for five to six minutes. We were excited as we discussed what we had just seen as we continued our meteor watch. Seeing is believing, we witnessed a U.F.O."]}