{"Date of the Event":"08/01/2012 02:00 UTC","Date Submitted":"08/13/2012 02:30 UTC","Object Features":"Patterned Surface","Latitude":"50.938403","Weather Factors":"Unknown","Summary":"a bright glowing sphere with a black 'scaffolding' like structure on the outside encasing the sphere","divs":["Sighting DetailsWe live in a small village with little or no public lighting. My property has lighting on it but we turn it off when viewing through our telescope My wife and I noticed a very bright starlike light hovering just above the eastern horizon. This light did not pulsate so much and it appeared, by the brightness, that it was much closer than any other light in the sky. We are stargazers usually but we were quite busy that evening and did not get a closer look at it. The next night it returned, same exact position in the sky, same approximate time. We decided to get a closer look at it through our telescope on this night and when we focused the telescope on it we viewed a rather strange ball of glowing light (a sphere - it was a perfect sphere) which seemed encased in some sort of superstructure much like a scaffold in that the superstructure did not cover the entire surface of the sphere, in fact, even though the superstructure seemed to completely encircle the sphere most of the sphere was still visible. This continued for many days (roughly one week) then it vanished and has not returned since. In all the days it appeared in the sky it never appeared anywhere but in the same eastern horizon position Note: My time zone is NOT in the list of available time zones. I live in Saskatchewan which has its own time zone due to no daylight savings time being recognized here."],"Region":"Saskatchewan","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"CA-08132012-0005","Object Shape":"Sphere","Object Flight Path":"Stationary","Case Number":"41697","trends":["There have been no other sightings in Markinch","This sighting has never been favorited."],"Disposition":"Unresolved","City":"Markinch","Viewing Distance":"Over One Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41697.html.txt","/var/www/straped/mufon/org/41697.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=50.938403,+-104.360301(41697)&iwloc=A&hl=en\"> mufon case (41697) map </A>","Longitude":"-104.360301","Country":"Canada"}