{"Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=42.297236,+-82.991885(41692)&iwloc=A&hl=en\"> mufon case (41692) map </A>","Summary":"Lots of Orbs","Object Features":"None, Patterned Surface","trends":["There have been 18 other sightings in Windsor","There were no other sightings in Windsor on or around August 10th 2012"],"Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsOrbs Seen Better With E-Camera Than Naked Eye by Roy Berger Windsor - The following photos of orbs were taken between 10PM and Midnight August 10, 2012 using a Fujifilm AX 500 - 14 megapixel camera in Windsor, Ontario. It was hand-held, in automatic mode with the flash enabled. The orb(s) phenomenon were captured sometimes on several frames in a row and other times only every third or fourth frame. I shot the 10 o'clock to 2 o'clock position in the sky. I just pointed the camera at the clouds randomly. I didn't actually see them with my own eyes. I only see them in the camera photos. There appears to be more of the globes when the sky is overcast. I believe that any e-camera pointed to the night sky will have a similar series of images. I'm not doing anything special or unique. I don't find any results in the afternoon sky. My neighbour has similar results with their camera at the same time. Now what? We can duplicate the observation in the field and take photos of a phenomenon that isn't seen with the naked eye. Everyone will be doing this shortly. I haven't a clue as to what it is but there it is. Since the photos only appear when the flash is on we know it reflects light. So, it's some kind of thing. It would be interesting to set up a film camera with a strobe flash light to pick up direction and movement. They are perfect spheres. They appear to be of different sizes and what looks like shadows of where they were. What is the relationship between orbs and storms? What is the relationship between orbs and solar flares? The next two nights were not overcast and photos revealed only a few orbs per frame or none at all as opposed to the earlier nights but they were certainly there. Anyway, the objects are easy as pie to take a photo of and it would be interesting to measure them in other ways. The photo copyrights are owned by Roy Berger."],"Object Flight Path":"Stationary,Straight-line path","Tags":"City","Latitude":"42.297236","Date of the Event":"08/10/2012 12:00 UTC","Weather Factors":"Unknown","Region":"Ontario","Case Number":"41692","City":"Windsor","Object Shape":"Sphere","Longitude":"-82.991885","files":["/var/www/straped/mufon/html2text/41692.html.txt","/var/www/straped/mufon/org/41692.html"],"Date Submitted":"08/12/2012 11:54 UTC","Source":"MUFON","Log Number":"CA-08122012-0036","Sighting Duration":"Undisclosed"}