{"map":"<A HREF = \"http://maps.google.com/maps?q=43.805223,+-120.545021(41701)&iwloc=A&hl=en\"> mufon case (41701) map </A>","trends":[""],"Longitude":"-120.545021","Date of the Event":"08/12/2012 11:30 UTC","Object Features":"Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Log Number":"US-08132012-0009","Latitude":"43.805223","divs":["Sighting DetailsI was outside smoking when i seen four orange lights off to the north. I called my girlfriend out to come look and we observed the objects moving toward us. Three of the four objects were going rather slow and seemed to be dropping stuff. The fourth object to our right started to speed up and go south over our house while the others kinda split up. As we watched i noticed a see through bubble like object floating between them. I asked my gf if she had seen it and pointed it out to her. She also seen it. She called for me to grab my phone so we could try to take a picture. We watched as they all went different directions and tried to track their paths. We lost site of a few of them but the ones we noticed still were dropping stuff. We were aware that tonight there was supposed to be a meteor shower which is why i was watching the sky in the first place, but this was unlike anything I've ever seen before. We decided to go for a walk cause a few of the places we noticed stuff dropping seemed close and we wanted to see if we could find anything. We walked a few blocks down past our house and toward a train station . We walked past the train station when we heard the crossing arms start to go off. We turned around to watch and they dropped, lights flashing and all. We didn't see or hear a train and the arms were down less than a minute before rising back up. We thought it was a little weird but turned around and started walking again when all of a sudden we heard a very loud banging noise coming from that direction. Its really hard to describe the noise. It was very loud like metal banging or shaking. It was loud and sounded like it was moving but the sound didn't appear louder and we never seen anything. My girlfriend walked out in front of where we were to see if she could see anything down the tracks but we never seen anything . We decided to walk toward the noise and after about 15-20 feet the noise suddenly stopped. We were a little scared at that point cause our daughter was walking with us and decided to head home and out in front of us where there was some rail tankers we heard a noise and got spooked. We didn't see or hear anything else strange on the way home."],"Case Number":"41701","Sighting Duration":"Undisclosed","Tags":"City","Region":"Oregon","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"08/13/2012 04:30 UTC","Object Shape":"Fireball, Oval","Country":"United States","Summary":"I was outside smoking when i seen four orange lights off to the north. I called my gf out to come look and we observed the objects moving toward us. Three of the four objects were going rather slow and seemed to be dropping stuff.","City":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41701.html.txt","/var/www/straped/mufon/more/41701_submitter_file1__imagejpeg2711.jpg","/var/www/straped/mufon/org/41701.html"]}