{"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","City":"Sciota","Case Number":"41706","Tags":"City","Object Shape":"Teardrop","Longitude":"-75.318115","Summary":"A bright object with three different colored lights, hovered almost stationary for more than two hours at a very high elevation.","files":["/var/www/straped/mufon/html2text/41706.html.txt","/var/www/straped/mufon/org/41706.html"],"Latitude":"40.929356","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWhile looking for the Perseid meteor shower to the Northeast, out my bedroom window, I noticed what appeared to be a planet in the sky. I live in eastern PA. This object in the sky seemed to be a planet because it was so bright. Three or four times, I did see a \"shooting star\" which was consistent with meteor showers I have observed in the past. After observing the \"planet\" for a few minutes, I realized it was not a planet because it had bright lights that appeared to be on its surface. These lights were very bright. I then considered this object to be a helicopter. However, it hovered in the same place from 11:30pm until at least 1:45 am. (At that time, I went to bed.) The object was at such a distance it may have been hovering over New Jersey. I began to use binoculars to more closely observe it. The object remained white and this white light was the brightest of the lights. Occasionally red and green lights would appear. These lights were not as bright as the white light. It appeared as though the object was rotating, which accounted for the color changes. I noticed it moving in an unusual way. It wobbled onto its sides a few times. It also changed position by moving to the left, to the right, up, and down a few times. These movements occurred after I noticed an airplane flying near it. I noticed three airplanes during the time I was observing the object. The airplanes did not seem to interact with the object, although their presence did seem to correlate with the times it moved or changed position. The shape of the object was almost saucer shaped, but it was much thicker. The best way to describe it would be a Hershey's kiss with the top cut off. My sixteen year old son observed the object for twenty minutes. He did witness it moving once. My wife briefly observed this object with and without binoculars."],"Object Features":"Unknown","Date of the Event":"08/12/2012 11:30 UTC","Log Number":"US-08132012-0014","Source":"MUFON","Country":"United States","Region":"Pennsylvania","Disposition":"Unresolved","trends":["There have been no other sightings in Sciota","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.929356,+-75.318115(41706)&iwloc=A&hl=en\"> mufon case (41706) map </A>","Object Flight Path":"Stationary,Other","Date Submitted":"08/13/2012 11:21 UTC"}