{"Disposition":"Unresolved","Object Flight Path":"Path with directional change","Latitude":"41.973796","Summary":"looked like fireflys or a slow firework in reverse, a cluster of amber lights about 30 or 40 heading West and then Skyward from Downtown Chicago","Date Submitted":"08/13/2012 01:17 UTC","City":"Chicago","Date of the Event":"08/11/2012 08:55 UTC","Viewing Distance":"Over One Mile","Region":"Illinois","Longitude":"-87.682151","files":["/var/www/straped/mufon/html2text/41711.html.txt","/var/www/straped/mufon/org/41711.html"],"trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around August 11th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.973796,+-87.682151(41711)&iwloc=A&hl=en\"> mufon case (41711) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Object Features":"Unknown","Log Number":"US-08132012-0019","divs":["sighting detailswe were watching a movie with our neighbors in a public park in ravenswood a suburb north of the city of chicago, saw the amber lights in a huge formation heading west about 15 lights then noticed another 20 or so lights ascending from near downtown. thought it was a air exhibition then noticed some of the flight path of the individual lights coming close together and then i figured it was military, the lights were bright i just happend to look to the right when i saw more of them leaving\\ascending from near downtown. my first reaction to seeing the first cluster was ufo it looked alot like the lights over phoenix back in the 90's... but these were moving journeying west, they appeared to have went straight up... i saw nothing in the western horizon after they had passed my view in the south. i was calm about this figuring an explanation would be in the newspaper or online. nothing has been reported as far as a departure or air event that the city knew was going to happen. they almost looked like hot air balloons at the pace they were ascending and from the distance i observed them. but then some of them got dangerously too close to each other. i feared the worse when i saw them almost touch. they basically disapeared after a few minutes."],"Case Number":"41711","Weather Factors":"Unknown","Tags":"City","Object Shape":"Star-like, Other, Unknown"}