{"divs":["Sighting DetailsI was wondering if you guys have heard of or could look into the glowing orbs that were flying over head in Salem Oregon out of the north heading south last night around 10:30pm? We have five people that were out side watching the meteor shower and then one orb came up out of the north glowing orange and flew over over us heading south. It made no sounds at all and was flying faster than a jet. Then a little later four more came up over the northern horizon flying south overhead. One orb was red and the others were orange. And they faded out. as they were over head heading south. One looked like there was a clear bag like thing over it with a dim red light in it. I looked at them with binoculars and I couldn't tell what they were. They were too low for satellites. I've never seen anything like that in all my life. Was wondering what they were? I looked around and other people saw them too. But no one knows what they were. I've seen weather balloons before but these didn't look like them. And there was no wind at all and it was a clear night."],"Weather Factors":"Unknown","Case Number":"41719","Tags":"City","City":"Salem","Log Number":"US-08132012-0027","Date of the Event":"08/12/2012 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.946758,+-123.031606(41719)&iwloc=A&hl=en\"> mufon case (41719) map </A>","Viewing Distance":"Unknown","Date Submitted":"08/13/2012 06:41 UTC","Object Features":"Other","Summary":"Glowing orbs while watching the persid meteor shower","Region":"Oregon","Disposition":"Unresolved","trends":["There have been 40 other sightings in Salem","There was one other sighting in Salem on or around August 12th 2012"],"Latitude":"44.946758","Country":"United States","files":["/var/www/straped/mufon/html2text/41719.html.txt","/var/www/straped/mufon/org/41719.html"],"Object Shape":"Sphere, Star-like","Longitude":"-123.031606","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path"}