{"Object Flight Path":"Straight-line path,Path with directional change","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=43.096117,+-78.915895(41716)&iwloc=A&hl=en\"> mufon case (41716) map </A>","Sighting Duration":"Undisclosed","Summary":"4 Orb's/ Fireballs after \"shooting star\"","trends":["There have been 19 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around August 2nd 2012"],"Latitude":"43.096117","Case Number":"41716","Object Shape":"Fireball","Tags":"City","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41716.html.txt","/var/www/straped/mufon/org/41716.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-08132012-0024","Date Submitted":"08/13/2012 05:06 UTC","Disposition":"Unresolved","Object Features":"None","divs":["Sighting DetailsMy cousin and I were outside our martial arts studio waiting to talk to the instructor. It was about 9:00 pm, still pretty light out, a nice clear night. When to the right of us we saw a shooting star. But after we thought about what we had seen it didn't look to much like a shooting star because the from where it started to where it ended looked to be way to close. Just didn't seem right to us but we were willing to call it a meteor. About 2 minutes later, he brings to my attention a very bright, orangey light coming from the South. At first I thought it was just a plane but as it came closer, we noticed there were no blinking lights and there was no object attached to the light. The light was the object. Luckily, he told me go get my phone to record it. By the time we realized it wasn't a plane or helicopter to when I got to my car and got my phone, it was basically right in front of us. It was extremely fast. As I'm recording the video of the \"Fireball,\" all of a sudden there's another one coming from where the first came from. This one was going straight rather then an angle and seemed much slower. As it was flying directly over us, we noticed it's features. It was orb-like, looked almost like a ball of fire. You could see the insides moving and flowing around. Very bright and absolutely no sound coming from it. Both our minds are processing what we had seen and we just can't believe it. About 4 minutes later, another appeared to be coming. This third one basically on the same path as the second, again same details as the rest, but this one was moving very fast. When I recorded this video, ( VIDEO0006) from 00:30 on I kept my phone perfectly straight. I wanted to show how quickly it was moving. It kept getting out of frame and I had a hard time keeping up with it. Sadly, it was so dark its hard to show how high it is. But I can tell you that, the video makes it look a lot farther away then it was. It seemed like it was about 350 ft up. If it was a lot higher, then that thing was huge and extremely fast. The fourth orb, was noticed from around the same spot as the rest but went completely East, a totally different direction then the others. I recorded a video of it, and I got the traffic lights, and cars in the video along with trees, but something is wrong with the video. Maybe you can fix it. Just wanted to add that I live 4 minutes away from the Niagara Falls Airport and Air Base, and my cousin lives 2 minutes away from it. We see a lot of planes and helicopters and this was definitely not one of them. On the Map, Yellow is #1. Orange is #2. The other orange that changes direction is #3. Red is #4"],"Longitude":"-78.915895","City":"Niagara Falls","Date of the Event":"08/02/2012 10:00 UTC"}