{"trends":["There have been 18 other sightings in Worcester","There were no other sightings in Worcester on or around August 8th 2012"],"Object Shape":"Circle, Sphere","Object Features":"Unknown","Disposition":"Unresolved","Longitude":"-71.797633","map":"<A HREF = \"http://maps.google.com/maps?q=42.268393,+-71.797633(41720)&iwloc=A&hl=en\"> mufon case (41720) map </A>","Weather Factors":"Unknown","Summary":"I did not see the \"orbs\" when taking the photo. When I down loaded the photos taken, I noticed the 5 \"orbs\" in the sky. I zoomed in and used some high resolution software at work. I could not explain the \"orbs\"","files":["/var/www/straped/mufon/html2text/41720.html.txt","/var/www/straped/mufon/org/41720.html"],"Date of the Event":"08/08/2012 09:21 UTC","Country":"United States","Date Submitted":"08/13/2012 06:48 UTC","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Region":"Massachusetts","Case Number":"41720","Source":"MUFON","Viewing Distance":"Unknown","Tags":"City","City":"Worcester","divs":["sighting detailsi attend a series of motorcycle meets at various pubs in the worcester\\glocestershire area every wednesday during the summer. i take many photographs at these meets, of the bikes and people that attend and also landscape shots. on this occasion i took 222 pics. i download them to the facebook site of the group. i did not notice the \"orbs\" at the time of taking the photo. nevertheless, i was not looking at the sky, but trying to snap a longer distance shot of the pub where the meet was being held. when i downloaded and posted the pics, i noticed the 3 \"orbs\" in a triangular formation, with 2 further \"orbs\" to the left and right of the triangular formation. i take many pictures of all sorts, with many hundreds of the bike meets. the camera i use is a fujifilm s5700 and i have never seen any of my photos with such objects in the sky. i have no information on the movement etc of the \"orbs\" as i only noticed them afterwards. i zoomed in on them using my own pc and a some powerful design software that can greatly magnify photographs with a colleague at work the next day. there did seem to be a darker object behind each of the \"orbs\" of light. i was puzzled by the photos and could not find an explanation. i consider that it was not a reflection or anything on the lense of the camera, as i had cleaned this prior to attending the event. as background information. i am fascinated by the ufo phenomenon and i'm firmiliar with the major cases. notwithstanding this, i do not have any preconceptions on what they are."],"Log Number":"GB-08132012-0028","Latitude":"42.268393"}