{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41728.html.txt","/var/www/straped/mufon/org/41728.html"],"Summary":"Possible military craft? Looked human.","Date Submitted":"08/13/2012 09:33 UTC","trends":["There have been no other sightings in Wetmore","This sighting has never been favorited."],"Object Flight Path":"Hovering then path","City":"Wetmore","divs":["Sighting DetailsI was driving late to meet my family at their cabin, and due to the time zone change in Michigan, it went from central to eastern time zone and made it seem later than it felt. I was in an area that was non-populated in the Hiawatha National Forest, and it was completely black on the road. Every so often I'd see the eyes of deer reflecting from my headlights, but that was the only sign of life at that hour. I lost radio signal as always once I hit the area with all the trees, so I turned it off, and my car was dark inside except for my speedometer. I happened to notice a red glow in my peripheral vision on my left (I was heading North on 13, so that'd be West when I noticed it), and I glanced at the object. My heart sort of sunk, because being alone that late at night, it freaked me out a little. It was a black triangle with a small red light in each corner. The lights were steady and looked ordinary. I immediately starting searching for explanations in my mind trying to eliminate what it would be, but as I went from airplane, helicopter, cellular tower, etc, I realized it was indeed an aircraft of some sort. I don't believe in aliens or whatever, but it was definitely an object hovering which is not yet known to the general public. I viewed the object for about 5-6 seconds, then I had to turn my attention back to the road. I automatically slowed down while I was gawking at the object, and while I turned to look straight at the road ahead of me then turn back to my left again, the object was completely gone. It was like it sped super fast West without a trace. I looked all around me in every direction looking for signs of it, but never saw it again. It was pretty odd. I started to drive faster through the woods after that because it rattled me and had me shaken, but ultimately, there was no denying what I saw. I had taken a nap earlier that afternoon and had a couple cups of coffee as I was on the road, so I knew I was very aware and alert and saw what I saw. I googled objects online and saw some of those stealth planes that I wonder if it was one of those. My dad also told me they were doing some military training exercises for terror training close by, so I'm sure there had to be a connection. Very weird. Also, just to add, I talked to some family members who are military and they weren't familiar with a craft of my description and said something about the color of lights meaning something and it didn't make sense why they'd have them on if they didn't want to be seen. I just had to report this, as my brother urged me to go to this site. Hope this helps!"],"Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=46.379722,+-86.620278(41728)&iwloc=A&hl=en\"> mufon case (41728) map </A>","Source":"MUFON","Region":"Michigan","Date of the Event":"08/07/2012 02:00 UTC","Longitude":"-86.620278","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-08132012-0036","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Latitude":"46.379722","Case Number":"41728","Object Features":"Unknown"}