{"Weather Factors":"Unknown","Object Shape":"Boomerang, Chevron","Date of the Event":"08/13/2012 09:28 UTC","Disposition":"Unresolved","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around August 13th 2012"],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/41737.html.txt","/var/www/straped/mufon/org/41737.html"],"Region":"New Mexico","Log Number":"US-08142012-0004","Longitude":"-104.521213","map":"<A HREF = \"http://maps.google.com/maps?q=33.433502,+-104.521213(41737)&iwloc=A&hl=en\"> mufon case (41737) map </A>","Source":"MUFON","Summary":"A large wide v-shaped craft passed ino my sight from my tree-line and silently headed northwest.","Object Flight Path":"Straight-line path","Object Features":"Wings","Sighting Duration":"Undisclosed","Latitude":"33.433502","Case Number":"41737","City":"Roswell","Date Submitted":"08/14/2012 02:39 UTC","Country":"United States","Tags":"City","divs":["Sighting DetailsI couldn't believe what I was seeing...My wife had just witnessed this several days before! I believed what she said she saw but I just really kind of shut it off I guess, now here I was sitting in the same place as when I was the night she jumped up yelling for me to come look, and I'm now seeing the same thing! An exceptionally huge craft shaped like a very widened V, very dark but not black, almost like you could see through it somewhat. I went in to tell my wife who was agitated that I didn't come call her. I didn't need to explain how little time there is to do anything but stare....she knows full well. As soon as I went in to tell her ...she mentioned that she heard something that sounded like a helicopter, so I wnt to check. It wasn't a helicopter but a handful of fighter jets racing in the same direction that the object disappeared into. We are not alien believers, in fact we always laugh when people ask us if all the stuff about Roswell is true. We say something like...lived here for 25 years and the oly aliens we've ever seen come from the border.....but we can't say that now! We WANT to know whats going on now...this is crazy! Can anybody shed some light on this?"]}