{"Summary":"Was watching two star clusters for about 20 min when a bright white light appeared for a minute, vanished, reappeared in the same location, and then vanished again. It did not reappear after this.","divs":["sighting detailsi was camping at harrison park in owen sound ontario. i had got the campfire going and was leaning back in a chair looking at two star clusters to the south. the sky was clear to the south. i was actually looking for satellites which i have seen many times in the past. the star cluster to my left had about 10 stars and the one directly ahead and located between two tree branches at a 60 degree elevation had about three bright stars and a fourth faint one. i was looking from one cluster to the other for about 20 minutes when i observed an aspirin\\penny size bright white light in the smaller star cluster. the light had not been there during the previous 20 minutes. the light was stationary and i could not discern any flashing wing or tail lights. it was a steady white light about a 1,000 times brighter than a star. it was at a high altitude. the light looked highly unusual to me. after about a minute i looked away to the larger cluster briefly and when i looked back to where the light had been it was no longer visible. after abut 4 minutes it reappeared in the same position (i had a fix on the adjacent stars and the two tree branches); once again it was stationary. after about 30 seconds it went out as i was looking at it. it seemed to go out from its right side to left side (looking at it)in a rapid action that took about a half second or less. i told my wife and about the light but she had not been looking at the sky. i remained looking at the sky in that sector for about thirty minutes but everything remained normal. i did not notice anything unusual in the sky for the next 7-days - which i spent in harrison park. i have been camping in harrison park in the first week of august for the past 6-years without ever having seen anything in the sky that i could not explain. during that time i would commonly spend about an hour a night looking at the stars on clear nights. i am familiar with planes, venus, and satellites. i was excited by this observation because i was unable to match the light to anything i had seen before."],"Source":"MUFON","Object Shape":"Circle","Sighting Duration":"Undisclosed","Country":"Canada","City":"Owen Sound","files":["/var/www/straped/mufon/html2text/41731.html.txt","/var/www/straped/mufon/org/41731.html"],"Viewing Distance":"Over One Mile","Latitude":"44.545521","map":"<A HREF = \"http://maps.google.com/maps?q=44.545521,+-80.93598(41731)&iwloc=A&hl=en\"> mufon case (41731) map </A>","trends":["There have been 4 other sightings in Owen Sound","There were no other sightings in Owen Sound on or around August 3rd 2012"],"Weather Factors":"Unknown","Object Features":"Unknown","Object Flight Path":"Stationary","Log Number":"CA-08132012-0039","Date Submitted":"08/13/2012 10:22 UTC","Region":"Ontario","Tags":"City","Disposition":"Unresolved","Longitude":"-80.93598","Case Number":"41731","Date of the Event":"08/03/2012 10:15 UTC"}