{"map":"<A HREF = \"http://maps.google.com/maps?q=-36.919731,+174.636256(41738)&iwloc=A&hl=en\"> mufon case (41738) map </A>","Longitude":"174.636256","Viewing Distance":"Unknown","Date Submitted":"08/14/2012 05:15 UTC","Weather Factors":"Unknown","Source":"MUFON","Latitude":"-36.919731","trends":["There have been 51 other sightings in Auckland","There were no other sightings in Auckland on or around August 14th 2012"],"City":"Auckland","files":["/var/www/straped/mufon/html2text/41738.html.txt","/var/www/straped/mufon/org/41738.html"],"Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Object Features":"None","Object Shape":"Sphere","Log Number":"NZ-08142012-0005","Object Flight Path":"Straight-line path","Date of the Event":"08/14/2012 08:10 UTC","Region":"Auckland","Country":"New Zealand","divs":["sighting detailsi've recently moved to glen eden, west auckland. whilst taking out the trash on the 14th of august i noticed what i first assumed was an airplane flying out of the north west, i would say there almost appeared to be two lights yellow and red. i assumed the yellow light was the white landing lights and the red was the port side light. as i continued to observe the light\\lights?? resolved into a singular pulsing orange light, then became red, then became a deep red\\crimson. it appeared to become brighter\\larger. it may have been closer. it then continued on a straight trajectory moving approx sth west. it grew dimmer eventually disappearing from sight. i had a sense that it accelerated away, but that would only be an alternative hypothesis of it's sudden dimming. at no stage did i hear any sound. i considered the possibility that it had disappeared into cloud, although no obvious cloud was present (it was very dark). moments later an aircraft appeared from the direction that the light had disappeared, it was not obscured by cloud, however my impression was that it was flying at a lower altitude."],"Case Number":"41738","Summary":"Red/Orange light/orb seen over Waitakere ranges 14/8/12"}