{"Viewing Distance":"Unknown","City":"Colorado Springs","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around August 13th 2012"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"38.775038","Object Shape":"Circle","Case Number":"41736","Object Features":"None","Summary":"objwct was a single round light, white in color, travelinng in a south east direction about 45 % above horizon. unable to even guess speed or distance.","map":"<A HREF = \"http://maps.google.com/maps?q=38.775038,+-104.727984(41736)&iwloc=A&hl=en\"> mufon case (41736) map </A>","Source":"MUFON","Disposition":"Unresolved","Date Submitted":"08/14/2012 02:27 UTC","Region":"Colorado","Log Number":"US-08142012-0003","Object Flight Path":"Straight-line path","Longitude":"-104.727984","divs":["Sighting DetailsI was looking out the front door of my residence at approx. 8:30p.m. on Aug. 13,2012 when I observed a strange white circular light. It was at about a 45% angle to the horizon and moving in a southeasterly direction. It is possible that it was travelling on an upward trajectory. There was no sound, no flashig lights as displayed by aircraft or any other distinguishig features. Just a white, round light. It was visable for approx.10-12 seconds then vanished behind cloud cover. This object appeared to be solid in form. It was obviously higher than the cloud cover but not extremely high such as an aircraft at 30,000 ft. I live just west of the the Colo. Spgs. Airport and Peterson AFB. I see all types of aircraft day and night landing and taking off, military and civilian, this light was not in any trajectory to approach or leave the airport. It was simply impossible for me to determine its real size, speed, or distance. I noticed the light because it was unusual and out of place and I could not determine what it was. My feelings were that I was seeing something that did not make a lot of sense and that I could not explain. My thoughts at this point are the same, it's 12:15 a.m. Aug. 14...4 hours later, I have discussed it with my wife and my son just to let them know I saw something..so here I am filling out this report because what else am I to do. At least this is something and will document the event."],"Date of the Event":"08/13/2012 08:30 UTC","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/41736.html.txt","/var/www/straped/mufon/org/41736.html"]}