{"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Wisconsin","map":"<A HREF = \"http://maps.google.com/maps?q=44.304542,+-88.373474(41741)&iwloc=A&hl=en\"> mufon case (41741) map </A>","Country":"United States","City":"Appleton","Case Number":"41741","trends":["There have been 12 other sightings in Appleton","There was one other sighting in Appleton on or around August 14th 2012"],"Sighting Duration":"00:10:00","Date of the Event":"08/14/2012 04:30 UTC","Summary":"3 UFOs zigzagging during meteor shower","Object Shape":"Star-like","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41741.html.txt","/var/www/straped/mufon/org/41741.html"],"divs":["Sighting DetailsMy boyfriend got home from work around 3:30am & we went for a walk to the park to watch some of the meteor shower. We got there around 4am & he kept seeing shooting stars & I would miss them. So he said we'd watch until I saw one. I sat and STARED at the sky for a good 10 minutes then I saw what I was sure was a satellite at first. I said, \"Isn't it amazing how fast satellites go?\" I watched it travel (in a straight line) from lower in the horizon to about the middle of the sky (around where Jupiter was at the time) then it went behind a small patch of clouds in an otherwise clear sky. My boyfriend had his eye fixed on it too & I said \"That's weird it should have come out the other side of that cloud by now\". He said, \"LOOK it went THAT way.. LOOK & ANOTHER ONE BEHIND IT\" Then I saw them moving (they looked like stars) in different directions from behind the cloud. The cloud patch had areas you could see through (patchy) you could see them moving. They zigged and zagged around, or would stop briefly. I would guesstimate we watched them moving around for 2-3 minutes. Then as they were out from behind the cloud they moved in the same direction (up) keeping the same distance between the two. My boyfriend said he saw a third! But my eyes were glued on the two I was afraid if I looked away they would be gone. Then they slowed & paused, moved again slowly and stopped. I said it was almost like they knew we saw them because they stayed in the same spot. They looked just like stars sitting there, it's perfect camouflage. The only thing that would give away that they were not stars is they didn't twinkle. They parked in the sky about 1\" apart from each other from my vantage point. Really watching them closely while they were stopped for about 5-10 min I noticed one had a reddish-brownish tinged glow & the other one had a blueish tinged glow. I never saw the third one because it stopped with the other two & blended in with the rest of the sky. I was very thrilled to get to see this & so disappointed when they stopped moving for us. I did see about 5 shooting stars then finally too. Then we reluctantly left & walked home."],"Longitude":"-88.373474","Disposition":"Unresolved","Latitude":"44.304542","Date Submitted":"08/14/2012 07:56 UTC","Log Number":"US-08142012-0008","Object Features":"Unknown"}