{"Country":"United States","Region":"North Carolina","Object Features":"Other","Longitude":"-78.213684","map":"<A HREF = \"http://maps.google.com/maps?q=33.907794,+-78.213684(41746)&iwloc=A&hl=en\"> mufon case (41746) map </A>","Object Shape":"Boomerang, Other","Object Flight Path":"Path with directional change","Summary":"Unidentified craft approached from the west over Holden Beach NC and preceeded in a straight course. It then turned NE and disappeared from Oak Island point of view.","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-08142012-0013","Date Submitted":"08/14/2012 01:24 UTC","City":"Oak Island","Latitude":"33.907794","trends":["There have been 5 other sightings in Oak Island","There were no other sightings in Oak Island on or around August 12th 2012"],"files":["/var/www/straped/mufon/html2text/41746.html.txt","/var/www/straped/mufon/org/41746.html"],"Source":"MUFON","Case Number":"41746","divs":["sighting detailson 8\\12\\12 at approximately 10:45 p.m., we were sitting on the back deck of our home looking out over the marsh and creek on the backside of oak island. we were watching for meteors from the present perseid shower. we noticed a bright, red\\orange light approaching from the west.it threw our attention because it was the brightest thing in the sky, and different in color than what you'd expect of any other aircraft. it was constant in color and intensity. the shape of it seemed cresent with a thickness in the middle and the ends tapered. it looked like it was bouncing or making small movements or perhaps rotation of lights? though the colors did not change. the altitude did not seem to adjust or elevate as it approached us. after it passed us and continued east, it took a turn to the northeast direction, accelerated and disappeared in the sky in an arch like movement. once the object disappeared we were at a loss for words, what was it, did we really see that, and what should we do, or should we call someone? i immediately got on the internet to seek any information about sightings of lights in this area. i found some information but not enough to stauch the curiousity of what we have experienced. due to the utter shock of what we saw, we did not try to film or photograph until it started moving away from us. by the time my friend got a camera to take a picture, it was beyond us and disappeared into the sky when it changed direction to the ne. the speed at which it moved away from us was so fast."],"Weather Factors":"Unknown","Date of the Event":"08/12/2012 10:45 UTC","Disposition":"Unresolved"}