{"Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Object Shape":"Fireball","Object Features":"Other","Viewing Distance":"501 Feet - 1 Mile","Log Number":"CA-08142012-0024","map":"<A HREF = \"http://maps.google.com/maps?q=43.776919,+-79.141979(41756)&iwloc=A&hl=en\"> mufon case (41756) map </A>","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around August 3rd 2012"],"Disposition":"Unresolved","Country":"Canada","Date of the Event":"08/03/2012 10:20 UTC","Summary":"A flame with yellowish and orange colours burning from a black centre sphere travelling with no sound, clearly visible on a night sky without clouds","Latitude":"43.776919","Case Number":"41756","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Ontario","divs":["Sighting DetailsAt 10:20PM on august 3rd, my wife and my mother in law were on the porch smoking a cigarette. Suddenly they have observed a bright light coming from the east just above the houses across the street. We can see small planes over here every night but what attracted their attention was the altitude that the object was travelling and the bright orange, yellowish light unusual for a plane. They have realized that this is something unusual and looked better at the object. They saw a ball on fire moving slowly across the top of the houses. When my wife realized that this is something unexplained she run into the house where she found me and my daughter in the kitchen. She couldn't explain what she saw but just told me to go outside in the backyard to see the object that is probably above the house now. I went outside in the backyard along with my daughter and then to my surprise I saw the object. Travelling slowly maybe 150 or 200 meters above my neighbour house. It's a little hard to explain how it looked like. The best way I can describe is to take the fireplace flame and bend it around in a circle. All flames were burning up and down and sideways with orange and yellow colours. I have asked my wife who was looking at the object through the back door screen to bring me the cell phone to record this event but was too late to do it because the object was already above the neighbour house that is backing my backyard. This was an awesome experience that all my family was able to witness."],"City":"Toronto","Longitude":"-79.141979","Date Submitted":"08/14/2012 10:01 UTC","files":["/var/www/straped/mufon/html2text/41756.html.txt","/var/www/straped/mufon/org/41756.html"]}