{"Region":"California","Summary":"During the Perseid meteor shower a friend and I observed Polaris move in a tight, random pattern. The movements occurred throughout the night at random times.","Country":"United States","Object Features":"None","Log Number":"US-08142012-0020","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41753.html.txt","/var/www/straped/mufon/org/41753.html"],"Longitude":"-121.569796","Object Shape":"Star-like","trends":["There have been 7 other sightings in Magalia","There were no other sightings in Magalia on or around August 11th 2012"],"Case Number":"41753","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Date Submitted":"08/14/2012 07:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.815396,+-121.569796(41753)&iwloc=A&hl=en\"> mufon case (41753) map </A>","City":"Magalia","Viewing Distance":"Unknown","divs":["Sighting DetailsWhile watching the Perseid meteor shower, on the night of Aug. 11-12, between 11PM to 2AM, a friend and I were seated outside facing North. Polaris was clearly visible. Viewing conditions were good. Several satellites were observed. Then I noticed that Polaris was moving smoothly and slowly, up, down, changing direction and speed, and finally moving back to its proper position. The total range of the movement was about the area of my thumb held at arm's length. Several minutes later the same type of movement was observed. This continued for most of our observation period. Through binoculars Polaris appeared as a normal star point of light and the movement was observed through the binoculars also. I confirmed the movement with my friend and each time the movement started we took turns describing the direction and speed. Both of us were seeing the same movements. Since we were observing for several hours, we could see that the stars surrounding Polaris had rotated normally. There seemed to be no pattern to the movements. No other stars displayed abnormal movement. Polaris did not waver, flicker or change brightness. Being an amateur astronomer I was totally mystified. Here was the only star in the sky that did not appear to move actually moving around in a random manner before settling back at its proper position. I searched for other reports of this type, but could find none. I feel a great need to know what we saw. Thank you for your service."],"Date of the Event":"08/11/2012 11:00 UTC","Sighting Duration":"03:00:00","Latitude":"39.815396","Tags":"City"}