{"Tags":"City","Case Number":"41757","Longitude":"-91.823253","Source":"MUFON","Date Submitted":"08/14/2012 10:56 UTC","Log Number":"US-08142012-0024","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsWatching a G rated movie for children outdoors at a large Missouri campground, facing basically west watching the projected movie with a few people nearby (but a couple of hundred campsites around) a significant white circular light passed seemingly close to the campground, over the outdoor movie screen during the movie at about 9:45 PM, from my perspective basically north to south, basically left to right and almost right over the cloth screen. I and those with me clearly saw something about the relative shape and size of a dime, fuzzy edged, bright white, come from behind some trees to the left and over the edge of the campground (maybe 5 degrees over the screen I was watching the movie) then lost in trees to the other side. I never looked directly at it, but it was clearly in my peripheral vision across the sky over the movie screen, where I was trying to lock on to it as it passed behind trees. It appeared to be an object not right over the campground, but not as high as planes might fly going across the sky: I and those with me would estimate about the relative size of a dime at outstretched arm's length. It kept a uniform speed, fast, where it traversed about 50 percent of the eastern sky in 2 seconds, but quite clear and distinct. An audible \"oohh\" went up over the campground just after it passed behind the trees to the south, like being at a fireworks show when a cool firework goes off, so loud of an audible sound made at the overall campground that many people in the campsites must have seen it as we did. I know there was an expected meteor shower that night - I AM 52 YEARS OLD AND HAVE SEEN MANY METEORS SINCE i WAS A CHILD, THIS WAS NOT A METEOR. The object traveled too slow and was much too big to be a meteor. As I myself and the other adult with me thought, there was no way the object was a meteor, nor any conventional human created craft we've ever seen or heard of - seemingly a truly unidentified flying object!"],"Viewing Distance":"Unknown","Object Features":"Unknown","City":"Leasburge","map":"<A HREF = \"http://maps.google.com/maps?q=37.968303,+-91.823253(41757)&iwloc=A&hl=en\"> mufon case (41757) map </A>","Summary":"Significant white light oohh's MO campground passing over","Sighting Duration":"00:00:02","Region":"Missouri","Object Flight Path":"Straight-line path","Latitude":"37.968303","trends":["There have been no other sightings in Leasburge","This sighting has never been favorited."],"Date of the Event":"08/11/2012 09:45 UTC","Disposition":"Unresolved","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/41757.html.txt","/var/www/straped/mufon/org/41757.html"]}