{"Object Flight Path":"Stationary","Longitude":"-118.236295","Country":"United States","City":"Los Angeles","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around August 14th 2012"],"files":["/var/www/straped/mufon/html2text/41764.html.txt","/var/www/straped/mufon/org/41764.html"],"Case Number":"41764","Source":"MUFON","Region":"California","Object Shape":"Bullet, Missile, Cigar","Summary":"bright solid white bar of light in absolutely clear western sky at 7:30 pm over los angeles not moving & just disappeared","divs":["Sighting DetailsI had just dropped off a friend and was driving west in Monrovia, CA. I noticed how absolutely clear the sky was as the sun was setting, around 7:30 pm PDT. There was one solid very bright line of light in the sky approximately 45 degrees above the horizon. It looked rectangular in shape, kind of like when you open a door into a lit room from a dark room, like a rectangular sliver... At first I thought it was a jet and its condensation trail, but the trail never got any longer or disipated like they do in the wind. The light never wavered and didn't seem to move its position at all as the surrounding sky continued to darken. I called somebody on the phone to go outside and look, but they had too many trees blocking their view. I rushed to go pick them up and as I now headed north, I kept glancing to the west to see if it was still there. It was there for about 10 minutes and then it was just gone. I didn't see it disappear, there was no sound, nobody around me seemed to be taking any notice of it. Sadly, it was gone before I could gather up another witness to it. I tuned into all of the AM radio stations, waiting for some mention of a bright white \"light bar\" in the western sky...to no avail. I don't know if it was eminating light or just highly reflective, but the intensity never changed."],"Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None","Latitude":"34.055444","Sighting Duration":"Undisclosed","Log Number":"US-08152012-0007","map":"<A HREF = \"http://maps.google.com/maps?q=34.055444,+-118.236295(41764)&iwloc=A&hl=en\"> mufon case (41764) map </A>","Tags":"City","Date Submitted":"08/15/2012 01:33 UTC","Disposition":"Unresolved","Date of the Event":"08/14/2012 07:30 UTC","Weather Factors":"Unknown"}