{"Viewing Distance":"Unknown","Latitude":"33.317233","Weather Factors":"Unknown","Summary":"saw object, got video vanished into\"portal\"? Couldnt see w/ naked eye. video tells all!","map":"<A HREF = \"http://maps.google.com/maps?q=33.317233,+-111.89249(41768)&iwloc=A&hl=en\"> mufon case (41768) map </A>","divs":["sighting detailsfirst... let me say \"i am not crazy!\" i know what i saw. and i have to say- if people would just pay attention to things around them, they may see that somethings definitely going on this year. i was driving on the 202w bout 1\\2 mile away from where it splits off toward tucson\\phx\\pecos rd. i'm always watching the sky cause there's alot i've seen this past month. something small, silver\\white caught my eye and for some reason i had the thought to grab my cell phone and record it. i had a feeling it wouldn't show up in my video since it was so far away, but for some reason something told me to do it. once the video camera came up, i pointed it in the direction where i saw the object and started to record (and drive at the same time) i glanced into my phone camera and couldn't believe what i was seeing! a sort of big bluish green light was up there along with a white streak of a cloud that appeared at the same time not far from it. i did the best i could trying to zoom in on it while trying to drive and my video stopped after 45 seconds for some reason so i don't know what happened to it. i do know that i could not see it with my naked eye! it appears to be some kind of portal (?)emitting a bright light. and i'm assuming that object went into it since i never saw it again."],"Date of the Event":"08/08/2012 12:15 UTC","Object Flight Path":"Stationary,Path with directional change","Tags":"City","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around August 8th 2012"],"Disposition":"Unresolved","Region":"Arizona","City":"Chandler","Source":"MUFON","Country":"United States","Date Submitted":"08/15/2012 03:14 UTC","Object Features":"Unknown","Case Number":"41768","Longitude":"-111.89249","files":["/var/www/straped/mufon/html2text/41768.html.txt","/var/www/straped/mufon/org/41768.html"],"Object Shape":"Unknown","Log Number":"US-08152012-0010","Sighting Duration":"Undisclosed"}