{"Longitude":"-122.94788","Case Number":"41773","Summary":"We observed 10 UFO's as they passed with at least 4 of them dropping something from the bottom","Date Submitted":"08/15/2012 11:46 UTC","Object Features":"None","Tags":"City","Country":"United States","City":"Lebanon","Date of the Event":"08/14/2012 11:15 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["sighting detailson august 12th, we were in the backyard on our deck watching the meteor shower. at around 11:15 pm we noticed 2 bright objects just over the top of our house but at a distance. we watched them and then they disappeared. then last night (8-14-12) at around the same time, we spotted those 2 objects again but then there was 2 additional ufo's. so we ran through the house to get to the front yard to watch them. we had trees in front of us, so we walked across the street and watched them in clear view. there was a total of 10 sphere-like objects that were bright yellow\\gold in color. they did not flash, there was no sound, and they traveled in various degrees of height. they were going from north to south. we observed at least 4 of them dropped something from the bottom of the sphere which looked like burning embers. shortly after that they disappeared. others brightened and then faded out completely. several traveled in jagged formation and 1 hovered for a short time. this was observed by my son, brother-in-law and myself. we were in awe of this event and will be most definitely watching for future sightings."],"Weather Factors":"Unknown","Region":"Oregon","Latitude":"44.549897","Source":"MUFON","trends":["There have been 5 other sightings in Lebanon","There were no other sightings in Lebanon on or around August 14th 2012"],"files":["/var/www/straped/mufon/html2text/41773.html.txt","/var/www/straped/mufon/org/41773.html"],"Object Shape":"Sphere","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.549897,+-122.94788(41773)&iwloc=A&hl=en\"> mufon case (41773) map </A>","Log Number":"US-08152012-0015"}