{"divs":["sighting detailsi was driving along a desolate and completely unlit dark country road that has cornfields and farms on either side. as i am about 2 miles from home i see to the left above cornfield a green light which then moved and i could see two other lights connected with it, all three different colors (i think copper\\red and white)forming a horizontal line. the object was moving about in a sinister fashion that resembled an insect but with more precision. it had animation, and moved about with a concious quality. my first thought was it was a remote controlled toy plane, but its movements were so bizarre i changed my mind. i stopped my car on the side of road to look closer and another one appeared. identical to the first. i could not make out anything other than the lights given it was pitch black on the road and there was nothing to illuminate the actual object. i could see that the three lights were part of one piece, moving together. the two objects seemed to be communicating and\\or following each other and were hovering and moving very low to the ground, about the height of a medium sized tree. i decided to pull away and as i did, both objects were visible in my rear view mirror, they came over from the cornfield and were now hovering over the road, as if watching me drive away. they quickly disappeared back over onto the cornfield."],"Log Number":"US-08152012-0020","Date of the Event":"08/14/2012 12:00 UTC","Source":"MUFON","Viewing Distance":"21-100 Feet","Date Submitted":"08/15/2012 04:18 UTC","Object Features":"Other","Latitude":"40.546397","Tags":"City","trends":["There has been one other sighting in Frenchtown","There were no other sightings in Frenchtown on or around August 14th 2012"],"Region":"New Jersey","Object Shape":"Other","Summary":"Two objects with three lights each hovering low above cornfields and interacting with each other","Case Number":"41778","Longitude":"-75.047989","Weather Factors":"Unknown","Object Flight Path":"Other","Country":"United States","Sighting Duration":"Undisclosed","City":"Frenchtown","map":"<A HREF = \"http://maps.google.com/maps?q=40.546397,+-75.047989(41778)&iwloc=A&hl=en\"> mufon case (41778) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41778.html.txt","/var/www/straped/mufon/org/41778.html"]}