{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.17759,+-81.943714(41779)&iwloc=A&hl=en\"> mufon case (41779) map </A>","Object Features":"None","Disposition":"Unresolved","Viewing Distance":"Unknown","Date Submitted":"08/15/2012 05:10 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41779.html.txt","/var/www/straped/mufon/org/41779.html"],"Weather Factors":"Unknown","Summary":"large, starlike object hovered briefly, then shrank to a small dot","Longitude":"-81.943714","Log Number":"US-08152012-0021","divs":["sighting detailsi stepped out of my front door (which faces south) at around 3:45am saturday august 11, 2012 to have a cigarette. i immediately saw a very large, starlike object to the east just hovering. at first i thought it was venus but quickly realized it was way too large and bright--my thumb at arms length didn't block it from my sight and it was about twice as bright as i have ever seen venus. i stepped down off of my steps and realized that the moon, which was at waning gibbous and still quite bright, was only a short distance from the moon. i held out my hand at arms length and it was about the distance from my thumb to little finger tip with my fingers spread as far as i could. if it was that bright that close to the moon then i think it may have been bright enough to see in the daytime. as i watched, it suddenly shrank it size\\brightness until it was a small dot, about as bright as one of the dimmer stars in the sky (a little dipper star maybe). i could barely believe my own eyes. then a small cloud moved in front of the object and when the cloud moved on the object was gone. i watched for a little while longer but it didn't come back."],"Object Flight Path":"Stationary","Tags":"City","Latitude":"39.17759","Country":"United States","Object Shape":"Star-like","Region":"Ohio","Case Number":"41779","City":"Coolville","Date of the Event":"08/11/2012 03:45 UTC","trends":["There has been one other sighting in Coolville","There were no other sightings in Coolville on or around August 11th 2012"]}