{"Summary":"Bright light, thought was a plane, no noise, slow moving, disappeared.","trends":["There have been 2 other sightings in Chatham-Kent","There were no other sightings in Chatham-Kent on or around June 30th 2012"],"Region":"Ontario","Date of the Event":"06/30/2012 12:00 UTC","Longitude":"-82.195471","map":"<A HREF = \"http://maps.google.com/maps?q=42.412788,+-82.195471(41777)&iwloc=A&hl=en\"> mufon case (41777) map </A>","Country":"Canada","Log Number":"CA-08152012-0018","Disposition":"Unresolved","Case Number":"41777","files":["/var/www/straped/mufon/html2text/41777.html.txt","/var/www/straped/mufon/org/41777.html"],"Sighting Duration":"00:05:00","Source":"MUFON","City":"Chatham-Kent","Object Shape":"Fireball","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Date Submitted":"08/15/2012 02:42 UTC","Latitude":"42.412788","Object Features":"None","Object Flight Path":"Straight-line path","divs":["Sighting DetailsAt a back yard BBQ that turned into a bon fire, my family, my best friend and his kids and I witnessed this anomaly. At first I thought it was simply a plane. But as it progressed towards us, I realized that there were no blinking lights and the entire object seemed to be on fire. It emitted no noise or discernible exhaust. As it was directly over my backyard it seemed to slow and then continue on it's path. IT started in the NE sky moving SW. After it passed over my house, we tracked it for about 30 seconds and then it disappeared. It should have still been visible to us. It was a cloudless night so it should not have disappeared. This is not the first sighting that has been seen in Chatham-Kent in the last year. Others have seen bright lights that look like planes- no blinking lights - that simply disappear when they should not be disappearing. Everyone was really stunned at what we were seeing. When we first thought it was a plane it was no big deal, but it was obviously fire (or giving off that impression) and bigger than a plane. Everyone went quiet and was watching intently. No one was really sure what to make of it at all. When it disappeared the kids yelled and I felt a chill go down my spine."],"Tags":"City"}