{"Disposition":"Unresolved","Viewing Distance":"101-500 Feet","trends":["There have been 4 other sightings in Chewelah","There were no other sightings in Chewelah on or around August 15th 2012"],"Case Number":"41787","Source":"MUFON","Object Shape":"Boomerang","Log Number":"US-08162012-0003","Latitude":"48.274007","Object Features":"Unknown","Country":"United States","City":"Chewelah","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=48.274007,+-117.729332(41787)&iwloc=A&hl=en\"> mufon case (41787) map </A>","Tags":"City","Weather Factors":"Unknown","Date of the Event":"08/15/2012 11:46 UTC","Summary":"OMG I just saw a UFO being chased by military helicopters!","divs":["Sighting DetailsI am at home, and about 14 minutes ago at the time of writing this narrative, I witnessed two military helicopters, all black, chasing a dark colored UFO. it was 11:46 pm, so it is nearly pitch black. i first noticed the UFO when i was on my computer, then i heard two helicopters outside. As there are normally no helicopters here this late at night, i was curious as to why there was multiple helicopters. I went out of my backdoor and looked to the northwest, where the sound was coming from. I saw two military helicopters, both painted black, hovering. I did not see anything immediately, but then i noticed a reddish orange light about 10 degrees to the upper right of the two helicopters. As i watched, the object rose about 25 degrees, then sped off at at least 300 miles per hour towards the southeast. The military helicopters immediately started to pursue the object as fast as they could. The object, last i saw of it, was easily outracing the military choppers. I believe that one of the helicopters was a Chinook, but I cannot be entirely sure. As I said earlier, it is pitch black in the sky and the helicopters were pitch black."],"Sighting Duration":"00:02:13","Longitude":"-117.729332","Date Submitted":"08/16/2012 03:10 UTC","files":["/var/www/straped/mufon/html2text/41787.html.txt","/var/www/straped/mufon/org/41787.html"],"Region":"Washington"}