{"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Region":"Arizona","Object Features":"Dome","Date Submitted":"08/15/2012 11:34 UTC","City":"Yuma","Viewing Distance":"21-100 Feet","Source":"MUFON","Object Shape":"Disc, Fireball","Date of the Event":"08/15/2012 08:15 UTC","Sighting Duration":"Undisclosed","trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around August 15th 2012"],"Tags":"City","Latitude":"32.68716","Summary":"Was waiting for family to come back, they yelled for me to come look, then saw the UFO","Country":"United States","Log Number":"US-08152012-0025","Case Number":"41784","files":["/var/www/straped/mufon/html2text/41784.html.txt","/var/www/straped/mufon/org/41784.html"],"Longitude":"-114.620284","Disposition":"Unresolved","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.68716,+-114.620284(41784)&iwloc=A&hl=en\"> mufon case (41784) map </A>","divs":["Sighting DetailsI was inside my room with my dog when I heard family come home from the back yard(heard gate opening). After a long while of them not coming in I went to look and they called out to me to look at the sky. I could see something in the sky but could not tell what it was. Went inside to get my glasses and I looked up and saw a huge UFO. I have never been a big believer of these things but boy did this change my mind, or anyone else who saw it for that matter. It was big and looked like what people usually think they look like(to an extent) it was hovering for what seemed very close to our location. Had bright lights and You could tell it was metallic like. It stayed close for what seemed a good while then just disappeared.After a few moments it reappeared shortly and then you could only see big balls of what I can only describe as fireballs that moved around randomly, then disappeared. Then they appeared and and made a circle (almost making the shape of the bigger one but it was only the small balls of light) after that they disappeared and reappeared making a line( appearing one at at time) They slowly went out and then disappeared all together."]}