{"Sighting Duration":"Undisclosed","Longitude":"-79.412607","Source":"MUFON","Object Features":"Unknown","City":"Orillia","files":["/var/www/straped/mufon/html2text/41789.html.txt","/var/www/straped/mufon/org/41789.html"],"Date Submitted":"08/16/2012 10:29 UTC","Summary":"conversing with family on porch, noticed bright sphere in what appeared close range,grabbed cell from home and took one shot before losing sight of object","Country":"Canada","Latitude":"44.60627","Tags":"City","Object Shape":"Sphere, Unknown","Case Number":"41789","Object Flight Path":"Stationary,Path with directional change","trends":["There have been 7 other sightings in Orillia","There were no other sightings in Orillia on or around July 1st 2012"],"Log Number":"CA-08162012-0005","Region":"Ontario","Viewing Distance":"Unknown","Disposition":"Unresolved","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.60627,+-79.412607(41789)&iwloc=A&hl=en\"> mufon case (41789) map </A>","divs":["Sighting Details1. at home residence sitting on front porch conversing with girlfriend and her mother. 2. My girlfriends mother joking pointed out the object, thinking it was nothing to really take seriously. 3. an extremely close view of the top portion of a hot air balloon. 4. the object first appeared above the trees across the road from my residence at first and it seemed completely stationary. after taking notice of the object it was only seconds when it began to ascend and distance itself from its point of sighted origin towards the direction of the city of orillia.while i noticed this occuring i ran inside to grab my cell phone and ran to the road to get a better view as it was leaving and took one photo of the object before literally zooming off towards the city and out of site. 5. excitement, need for captured proof, and relief of finally capturing my proof on my cell. 6. the distance and speed it traveled towards orillia was to far for my eyesight."],"Date of the Event":"07/01/2012 10:53 UTC"}