{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/41794.html.txt","/var/www/straped/mufon/org/41794.html"],"Weather Factors":"Unknown","Object Flight Path":"Stationary","Object Features":"Unknown","divs":["Sighting DetailsBeginning the night of August 13th 2012 at about 9:30 PM, three points of lights forming a triangular shape was noticed in the night sky to the west. There were two points of light vertically aligned and a third point of light to the right, equidistant to both. The points of light resembled bright, pulsating stars, so on the first night I dismissed it as a constellation. The object was again observed at the same time and in the same spot on the following night. There were enough clouds in the sky to make visibility difficult for almost all of the stars, but the object itself -- the three points of light described above -- remained clearly visible. The object looked exactly the same as it had the previous night. On the third following night, August 15th 2012 at about 9:30 PM, the object was again observed. This time, however, the arrangement of the points of light had reversed positions: The two vertically aligned lights remained where they had been before, but the point of light which had at first been to the right of them had reversed its position and now appeared to the left. Again, it was equidistant from both of the vertically aligned lights. The object did not move while being observed on any of the three consecutive nights."],"Source":"MUFON","Region":"Virginia","Longitude":"-80.018179","map":"<A HREF = \"http://maps.google.com/maps?q=37.230389,+-80.018179(41794)&iwloc=A&hl=en\"> mufon case (41794) map </A>","Latitude":"37.230389","Date of the Event":"08/15/2012 09:30 UTC","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"08/16/2012 04:02 UTC","Object Shape":"Triangle","Summary":"Three points of light forming a triangle; object was observed two nights, then was seen again a third night in the same spot but had reversed its position in the sky.","City":"Roanoke","Case Number":"41794","Country":"United States","Disposition":"Unresolved","trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around August 15th 2012"],"Log Number":"US-08162012-0010"}