{"Region":"Scotland","Object Features":"None","Summary":"2 blinking strips of red light in the sky, varying speed direction and elevation","Viewing Distance":"501 Feet - 1 Mile, Unknown","Weather Factors":"Unknown","Case Number":"41795","Date Submitted":"08/16/2012 05:15 UTC","trends":["There have been no other sightings in Carnoustie","This sighting has never been favorited."],"Object Shape":"Bullet, Missile, Cigar, Cylinder","files":["/var/www/straped/mufon/html2text/41795.html.txt","/var/www/straped/mufon/org/41795.html"],"Date of the Event":"08/16/2012 09:35 UTC","Disposition":"Unresolved","Latitude":"56.502565","Log Number":"GB-08162012-0011","Longitude":"-2.70325","divs":["Sighting DetailsI was at home, sitting in my room on the computer, unfortunately i was on my own so i have no one to back up this sighting. I saw something out of the corner of my eye outside and noticed 2 blinking red lights in the sky, roughly to the east. Of course at first I assumed they were coming from an aeroplane, but then the lights moved farther apart. I moved upto the window to get a better look, and the lights then appeared to not be just blinking dots of light like you see on planes, but strips of red light. i thought in between blinks i could make out a rough outline of the object, but it was too dark and too far away to to show any detail. They were very agile, changing speeds, moving past each other then the light in front would stop and hover for a few moments unti the other had reached it. They were changing elevation and direction quickly, and looked as if there were circling each other for a second. Being interested in UFO's, i was quite excited to see these objects, and I hope what i saw was genuine, but who knows! I lost sight of the oblects as they moved to the north east, until my house was blocking my line of sight. I went outside with the hope of relocating these objects but they were gone"],"Sighting Duration":"Undisclosed","Country":"United Kingdom","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=56.502565,+-2.70325(41795)&iwloc=A&hl=en\"> mufon case (41795) map </A>","City":"Carnoustie","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering"}