{"Latitude":"47.551655","Case Number":"41807","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsWent outside to let the dog do it's thing before bed. Was looking at the sky and saw this object. I recognized it as the same type of object I had seen about 10 years ago. The lights were the same colors and either strobing or rotating. It was too far away to tell much about it, even with binoculars. It is too low in altitude to be any type of sattellite. It is completely stationary, I observed this for 45 minutes, got bored and came back in the house. I am sure there is more than likely a man made explanation for this, but I do not know what it is? If it is the same type of object as I observed 10 years ago, it will be around for a while. I witnessed that object for several evenings then. Approximate location, about 25-30 degrees off the horizon and about 3 miles East of the town of Davenport, as observed from 8 miles South of Davenport. Lights are Red (top), White (center), and blue or green or both on the bottom. The red light appears to be twirling in a circular rotating manner around the perimeter. I would guess it to have been 10 to 15 miles away and an altitude of 10 thousand ft, but this is just a guess. I did not lose sight of the object, as far as i know it is still there."],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/41807.html.txt","/var/www/straped/mufon/org/41807.html"],"trends":["There has been one other sighting in Davenport","There were no other sightings in Davenport on or around August 16th 2012"],"Disposition":"Unresolved","Object Shape":"Unknown","Log Number":"US-08172012-0005","Region":"Washington","City":"Davenport","Tags":"City","Date Submitted":"08/17/2012 03:06 UTC","Summary":"Stationary object with multicolored lights. The red light appeared to be rotating.","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.551655,+-118.151183(41807)&iwloc=A&hl=en\"> mufon case (41807) map </A>","Object Flight Path":"Stationary","Longitude":"-118.151183","Date of the Event":"08/16/2012 12:00 UTC","Country":"United States"}