{"trends":["There have been 76 other sightings in Calgary","There were 2 other sightings in Calgary on or around August 16th 2012","This sighting has never been favorited.",""],"Case Number":"41805","Tags":"City","Country":"Canada","Summary":"Firey white object in the west direction falling from the sky in Calgary","Longitude":"-114.021798","Latitude":"51.059728","Log Number":"CA-08172012-0003","Date Submitted":"08/17/2012 01:18 UTC","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Straight-line path","Object Features":"Other, Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41805.html.txt","/var/www/straped/mufon/more/41805_submitter_file1__DSCN2105.JPG","/var/www/straped/mufon/org/41805.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsMe and my girlfriend were driving home from the Sunridge mall in Calgary at 9:00 PM, heading west on 16 Ave when we spotted a strange bright white object in the sky. At first we thought it could be a small cloud but there were no other clouds in the sky. It was very strange looking, not really round like a circle but more vertical in length. My girlfriend said \"It looks like a tear in the sky\". We stopped at the 19th street stop light to turn south and it didn't appear to be moving but it looked really odd. We ruled everything out that we thought it could be, its not an airplane, airbaloon or helicopter. We turned and headed home hoping that we might be able to see it from our house a short distance away (2 mins). When we arrived home it was still in the sky, so I ran into the basement and grabbed my spotting scope that I use for target practice at the shooting range. Its a Leupold spotting scope with 45X zoom. I quickly grabbed our recycling bin and set-up the spotting scope on the tripod. I zoomed it all the way out, got the object into view and then zoomed it all the way in, adjust the fine adjustment and could now wee it very well. It didn't look white now, it looked kind of orange in color (which may have been the sun setting on the horizon) It looked like something dropping with flames on the sides of it, but there was no real size to the object with the flames coming off of it. It was like there was a tiny object with flames or some time or aura shooting up off the sides of it and kind of a dark void off the top of it going up. My girlfriend then had a look and we were both astonished, we had never seen anything like it. It wasn't a plane or anything we had ever seen before. I had another look through the spotting scope and realized that the object was moving vertically straight down towards the earth, because it was getting lower in the spotting scope. I then asked my girlfriend to run inside and grab me a pen and paper so I could draw the object. She ran in and grabbed the pen and paper, I then proceeded to draw the object, taking turns with her looking through the spotting scope and making adjustments to the drawing. She also tried to take pictures of it with her IPhone but it would not focus in on it. After around 10 minutes of looking at it through the spotting scope we lost sight of it, as it dropped behind the tree line. Just as it was going behind the tree line I called my mother to see if she could see it, as she lives on the other side of the valley. The outgoing call was made at 9:14 PM. Keep in mind that the tree line is not in our yard, we live right on Deerfoot Trail which runs through a valley, we are on the east side of the valley, so the tree line is the trees on the west side of the valley. During the viewing of the object and after we discussed the possibility of it being a meteor or space debris crashing to earth, but we didn't think that it would take so long to drop. Were hoping that someone else might have seen it in Calgary."],"Region":"Alberta","map":"<A HREF = \"http://maps.google.com/maps?q=51.059728,+-114.021798(41805)&iwloc=A&hl=en\"> mufon case (41805) map </A>","Object Shape":"Bullet, Missile, Fireball","City":"Calgary","Sighting Duration":"Undisclosed","Date of the Event":"08/16/2012 09:00 UTC"}