{"Object Flight Path":"Stationary","City":"Wallkill","Date Submitted":"08/17/2012 04:43 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.587232,+-74.117541(41816)&iwloc=A&hl=en\"> mufon case (41816) map </A>","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/41816.html.txt","/var/www/straped/mufon/org/41816.html"],"Disposition":"Unresolved","Source":"MUFON","trends":["There have been no other sightings in Wallkill","This sighting has never been favorited."],"Latitude":"41.587232","Case Number":"41816","Country":"United States","divs":["Sighting DetailsI was in my study reading using a book light (I often read with the lights off in the room, using the book light for illumination). At approximately 3:30am I turned the book light off. Because my chair is situated next to the window, I immediately noticed an object with three lights in the distance. From my vantage point, it appeared about 45 degrees from the horizon. At first I thought it was a plane, but after a couple of minutes, I realized it wasn't moving (at least it didn't appear to be moving). The size of the object remained constant. After a few minutes, it slowly began to descend. Then it ever so slightly moved to its right (my left when looking at it). It again began to descend very slowly until I lost view of it behind trees. I was completely stunned. I don't necessarily believe in UFOs in the traditional sense (aliens from other worlds). But what I saw was truly an object that I could not identify. It moved unlike any plane I've ever seen. The fact that it hovered for so long, without ever appearing smaller freaked me out. At first I thought perhaps it was a plane that was flying away from me. After a couple of minutes I realized it was next to impossible for it to be. The way it moved to its left, vertically, and then descended was eerie (for lack of a better word). I don't know what I saw. It was not like anything I've ever seen."],"Weather Factors":"Unknown","Object Shape":"Oval","Region":"New York","Summary":"Early morning object above horizon - hovered constant and descended","Longitude":"-74.117541","Viewing Distance":"Over One Mile","Log Number":"US-08172012-0014","Date of the Event":"08/17/2012 03:30 UTC"}