{"Longitude":"-1.75962","Date of the Event":"08/03/2012 12:00 UTC","Case Number":"41811","Disposition":"Unresolved","Date Submitted":"08/17/2012 09:37 UTC","Object Shape":"Sphere","Sighting Duration":"Undisclosed","City":"Bishop Auckland","Log Number":"GB-08172012-0009","Tags":"City","Region":"","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=54.673894,+-1.75962(41811)&iwloc=A&hl=en\"> mufon case (41811) map </A>","files":["/var/www/straped/mufon/html2text/41811.html.txt","/var/www/straped/mufon/org/41811.html"],"Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Flight Path":"Path with directional change","trends":["There has been one other sighting in Bishop Auckland","There were no other sightings in Bishop Auckland on or around August 3rd 2012"],"Weather Factors":"Unknown","Country":"United Kingdom","Latitude":"54.673894","Summary":"electric blue star from distance. from closer distance green-blue turning red when it changed direction appeared to be aware of me","divs":["Sighting DetailsI was driving home from work in Bishop auckland a town in county Durham north east England on Friday the 3rd of August it was approx 22.00-22.10 at night. it was still a little light and there was some thin cloud, you couldnt see the stars. I was driving through a small little place called etherley a quite rural village on the edge of Bishop auckland only ten minutes or less after leaving work; I happened to see on the left side of my car high up an unusual looking thing in the sky it caught my attention immediately because it was quite beautiful it looked like a large elecric blue coloured star but there are no stars that colour here and it was too cloudy to see the stars. I am not sure if it was moving because obviously I was moving in my car the object appeared when I got the odd look at it to be on different sides of the road but as I say I was moving and the road twists and turns. when I was almost through this small village the object did appear to be moving because it looked to be above the houses and at one point above a small group of trees. I was desparate to stop safely on the edge of the road in a place with a clear view of the sky not obscured by houses and trees, I eventually pulled over outside a place called witton castle only a few minutes away from etherley. I got out of my car this place is very quiet surrounded on one side by fields on the other by woodland, there was nobody about, I got out of my car and looked in the direction of etherley and I looked at the sky expecting to see this thing but I was disappointed that I couldnt see it I must have been there about ten minutes or so and I was just about to get into my car and leave when I felt ice cold and afraid for no obvious reason, just then I looked accross a field and there it was just above the horizon it looked more blue-green now and it was really close just above the ground moving towards me I dont know where it had come from immediately before this. It seemed very close about the size of a basket ball it was spherical and all this blue -green colour very bright totally bizare it moved vertically straight up and changed to bright red then it moved down and away from me and turned blue-green again then moved towards me then went vertically up again and turned red every time it changed direction it was totally bizzare I have never seen anything like it. I thought I could detect a faint screeching sound on the edge of hearing. This thing never ot that far above the horizon moved towards me very close at times intesely bright then rushed away and shot up turned red and came back again I got frightened and got into my car then out again, in the end I was stood watching it and called my wife on my mobile phone and was describing what I was seeing to her,she said to me 'to film it on my phone instead of talking to her',I couldnt do it my battery was flashing it needed charging and when I looked up again it had gone. I drove round the back country roads hoping to see it again but it never came back. When I finally decided to drive home, I live only a few miles from there I felt so strange the whole thing was just totally outrageous I have never seen anything like it bizzare, I had to struggle when I was driving home to remember clearly what happened and that too is really odd. I don't know what happened to me but the whole thing is just so odd."]}