{"Summary":"Bright, moved quickly across the sky in Calgary NE","Country":"Canada","Source":"MUFON","Date Submitted":"08/17/2012 02:54 UTC","Sighting Duration":"Undisclosed","trends":["There have been 76 other sightings in Calgary","There were 2 other sightings in Calgary on or around August 16th 2012"],"Case Number":"41814","divs":["Sighting DetailsI was standing outside having a smoke when I looked up to the sky at the stars. I noticed a bright one and at first thought it was the North Star. Then it became apparent it was moving, so I thought it was a satellite. It crossed from the West side of the sky all the way across to the east side and was high up. It just looked like a super bright star. It moved in a curve to the north about midway across the sky. Then it did a diagonal sharp move back towards the west. It did a couple of these diagonal moves and they were far enough apart you could tell it was moving quick based on the stars around it. After it moved all the way to the east side of the sky it started to descend, but very slowly. At first I thought it had stopped moving but I watched it move down past another star. It stayed in one place for about 15-20 seconds and then there was a small flash of red light, followed by a much bigger and brighter flash. Suddenly it was gone. Completely gone. The star it had passed was still visible like normal. I've never witnessed something like this before and have no idea what it was, but I have never seen something move like that before. It was quick, bright, high up, made some diagonal moves, came down a little bit and then disappeared in a flash of red light. I really hope someone else saw it.. it was crazy."],"Object Features":"Unknown","Date of the Event":"08/16/2012 10:18 UTC","Viewing Distance":"Over 1 Mile, Unknown","Region":"Alberta","Object Flight Path":"Path with directional change,Path then hovering","Log Number":"CA-08172012-0012","Longitude":"-114.050511","Disposition":"Unresolved","Latitude":"51.048073","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41814.html.txt","/var/www/straped/mufon/org/41814.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.048073,+-114.050511(41814)&iwloc=A&hl=en\"> mufon case (41814) map </A>","Object Shape":"Sphere, Unknown","City":"Calgary","Tags":"City"}