{"Country":"Canada","Tags":"City","divs":["sighting detailson august 8th 2012 i was picking up my girlfriend from work. as she left her building i noticed a red\\orange glowing orb floating from behind the building about a mile away and 500 ft high. it simply floated at a steady pace and didn't change direction either up, down nor left or right. there had been an unusual amount of helicopters in the skies over the past few weeks so when i saw the orb my first thought was it's a helicopter. i turned off the car and rolled down the windows expecting to hear rotor blades and see a blinking light. the orb made no noise what so ever. it had no blinking lights just a pulsating red outer part and a orange core. my girlfriend got in the car and i pointed it out to her and she found it to be very strange as well. i tried to follow the orb but i was stopped by traffic lights. we watched it float away into the distance over highway 401 and disappear. i have always had an interest in ufo's and aliens but i never expected to ever see anything. at first i really thought it must have been something else but as time goes on it seems to set in that it was something strange."],"City":"Cambridge","Disposition":"Unresolved","Region":"Ontario","trends":["There have been 11 other sightings in Cambridge","There were no other sightings in Cambridge on or around August 8th 2012"],"files":["/var/www/straped/mufon/html2text/41815.html.txt","/var/www/straped/mufon/org/41815.html"],"Latitude":"43.447724","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"08/08/2012 10:01 UTC","Date Submitted":"08/17/2012 04:14 UTC","Summary":"Glowing orange red ball seen with no sound.","Viewing Distance":"501 Feet - 1 Mile","Log Number":"CA-08172012-0013","Object Shape":"Sphere","Object Features":"None","Object Flight Path":"Straight-line path","Longitude":"-80.290104","Case Number":"41815","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=43.447724,+-80.290104(41815)&iwloc=A&hl=en\"> mufon case (41815) map </A>"}