{"Date Submitted":"08/18/2012 02:34 UTC","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around August 17th 2012"],"Object Flight Path":"Path with directional change","Summary":"Blue lighted object, moving very rapidly, abrupt direction change, abrupt altitude change,","Region":"Arizona","Country":"United States","files":["/var/www/straped/mufon/html2text/41822.html.txt","/var/www/straped/mufon/org/41822.html"],"Source":"MUFON","Object Features":"None","Longitude":"-112.066077","City":"Phoenix","Tags":"City","Date of the Event":"08/17/2012 10:35 UTC","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Viewing Distance":"Over One Mile","Latitude":"33.454477","divs":["Sighting DetailsI was outside on front porch talking to my husband in the dark when we noticed the light. The night was very dark and relatively quiet, but we heard no noise from the object. It was unusual because of the color (a deep true blue), lack of noise and abrupt change of altitude and direction. We were very perplexed and kept trying to guess what in the world it could be. There was no beam nor afterglow. It appeared first at about 40 degrees and whipped in from the west to stop south of us. We live north of Phoenix. It proceeded to change direction and altitude, even disappearing momentarily into the clouds that were barely visible in the reflected light of the city. Although it moved very fast, its movements were smooth. We watched it for about five minutes before it rapidly moved off to the southeast and disappeared in the horizon. We continued watching the sky for some time after it left and discussing the possibilities of what it could be. It was a bit unsettling to say the least. We both checked the news for other sightings but it was too late for local news. Then we went online and searched."],"Object Shape":"Circle","Case Number":"41822","map":"<A HREF = \"http://maps.google.com/maps?q=33.454477,+-112.066077(41822)&iwloc=A&hl=en\"> mufon case (41822) map </A>","Disposition":"Unresolved","Log Number":"US-08182012-0002"}