{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41830.html.txt","/var/www/straped/mufon/org/41830.html"],"Country":"United States","Log Number":"US-08182012-0010","Region":"New York","Object Shape":"Oval","Latitude":"40.893927","Tags":"City","Date Submitted":"08/18/2012 11:26 UTC","Sighting Duration":"00:01:00","divs":["Sighting DetailsOn Sunday August 12, 2012 at 1313 hours. I was taking photos outside of small mall. My wife had just finished shopping and was returning to car when I took a look at sky above BJ's store and noticed a while small object hoovering in the sky about 40-45 degrees. I expected it would continue moving and that it would become the familiar shape of an airplane or bird but it did not. I took my Canon 60D camera with the 18-135mm lens and took four pictures of the object. I had the lens zoomed in to 135mm to get the best shot of it and hopefully see what the object was in the sky. I went to take a video of it and by the time I switched the mode switch on camera to video the object was gone. My wife also observed the object. I went home and uploaded pictures. The pictures were numbered 006, 007, 008, and, 009. In picture 007 when you zoom into the object you can see another less clear object. I thought it could be dust on lens but it did not appear on next two pictures. I think the object may be a drone used by police but even when you zoom in on it, it is difficult to tell what it is. I will upload pictures. This is the truth as observed by me on August 12, 2012 at 1313 hours. Tony PS I just looked over the other pictures I took at the mall that day and at 12:42 PM I had taken several shots and one was facing more North East than the other shoots (006-009). In it you will see an American Airlines plane flying by and to the left and close to poll you will observe another object that is darker. I did not observe this object myself and only spotted it in the picture just now. It could be dust or something on the lens but it did not show up in later pictures. I have added this photo for your review (photo 003)."],"Date of the Event":"08/12/2012 01:13 UTC","City":"Pelham Manor","map":"<A HREF = \"http://maps.google.com/maps?q=40.893927,+-73.822361(41830)&iwloc=A&hl=en\"> mufon case (41830) map </A>","Case Number":"41830","trends":["There have been 2 other sightings in Pelham Manor","There were no other sightings in Pelham Manor on or around August 12th 2012"],"Viewing Distance":"Over One Mile","Longitude":"-73.822361","Object Flight Path":"Stationary","Object Features":"None","Source":"MUFON","Disposition":"Unresolved","Summary":"White rice size object."}