{"divs":["Sighting DetailsThis event happened over 45 years ago. My dad at the time was a high ranking officer in the Air Force stationed at Bangor, Maine. One day my dad said he wanted to show us something and that we were going for a ride. He took my mom and my brother and I on the Interstate 95 going North to Palmyra, Maine. We were coming from our hometown Augusta, ME. When we were getting closer to the area my dad tols us to be quiet and observe all the military vehicles on the right side of the highway. I remember the spot very well. As we passed by we saw a path mowed down through the trees in a swampy area and many personnel were walking around the brambles (downed trees and brush. I remember my dad saying that they already picked it up. My dad was afraid to be recognized so he drove past the area and turned around several miles past the site and we headed back home. He told my brother and I that there was a UFO that crashed and that he was not to tell anyone about it for security reasons. Back then one did what they were told especuially for an officer in the military! I was reminded about this event just a while ago when someone else from Maine said something about the UFO accident in Palmyra, Me. Remind you that I'm now in Alaska and the news is still active about thi incident. Nothing can be found about this event but I believe it to be better than Roswell incident."],"Object Shape":"Blimp, Unknown","Latitude":"44.807662","Summary":"no","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","City":"Bangor","Region":"Maine","Date Submitted":"08/18/2012 02:13 UTC","Longitude":"-68.776674","map":"<A HREF = \"http://maps.google.com/maps?q=44.807662,+-68.776674(41832)&iwloc=A&hl=en\"> mufon case (41832) map </A>","Case Number":"41832","Country":"United States","Date of the Event":"06/01/1967 12:00 UTC","Disposition":"Unresolved","Object Features":"None","trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around June 1st 1967"],"Object Flight Path":"Stationary","Weather Factors":"Unknown","Log Number":"US-08182012-0012","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/41832.html.txt","/var/www/straped/mufon/org/41832.html"]}