{"Weather Factors":"Unknown","Latitude":"33.930078","Sighting Duration":"Undisclosed","Date of the Event":"08/18/2012 12:00 UTC","Case Number":"41837","map":"<A HREF = \"http://maps.google.com/maps?q=33.930078,+-117.414893(41837)&iwloc=A&hl=en\"> mufon case (41837) map </A>","Log Number":"US-08182012-0017","Country":"United States","files":["/var/www/straped/mufon/html2text/41837.html.txt","/var/www/straped/mufon/org/41837.html"],"City":"Riverside","Object Flight Path":"Straight-line path","Longitude":"-117.414893","Summary":"Strange light at 3am. Then two \"vehicles\" near trees. Sky was full of them.","Object Shape":"Oval","Object Features":"None, Dome","Viewing Distance":"21-100 Feet","Tags":"City","Region":"California","trends":["There have been 38 other sightings in Riverside","There was one other sighting in Riverside on or around August 18th 2012"],"Date Submitted":"08/18/2012 06:18 UTC","divs":["sighting detailsat 3 am on 8\\18\\2012,i was extremely hot and couldnt sleep. as i was turning a light out, i noticed a strange light outside my window. its 3 am? looked outside my sliding glass door and saw two flying vehicles zoom thru the very tall trees in my backyard. they came from the east very fast, i thought i was hallucinating. they were blackish and misty, for lack of a better term. i went outside, there i saw about 40 or so \"orb shaped\" objects eerily close to my house. i tried to take pictures with my cell, whaddaya know? not working!!!! i watched for a good two hours as their sizes diminished before i woke up my roommate. she said it looked like really big stars. it was 5am. she was sleepy and told me they were really big stars...i got my phone to take a few pics...nothing great, but definitely something on one picture. at approximately 7 am. the lights went away and the squirrels who live in the trees went absolutely apeshit crazy. i took a video of that as well. i dont get scared of these kinds of things. this one spooked me...there were soooo many. i never lost sight of the objects. the sun came up and i couldnt see them anymore...as soon as i lost sight of them is when the squirrels started chatting like crazy"],"Source":"MUFON","Disposition":"Unresolved"}