{"Longitude":"-93.663216","Case Number":"41847","Date of the Event":"08/17/2012 10:30 UTC","Region":"Minnesota","Disposition":"Unresolved","Object Features":"Unknown","divs":["sighting detailson august 17th 2012, around 10:30pm, 3 miles north of onamia mn next to hwy 169, i saw a small diamond (star-like) shaped craft moving from nw to ne at around 20,000ft. i witnessed this event with a family member. i initially thought the object was circular and that my eyes saw a more diamond shape due to fatigue from being up to late. i looked at other light emitting objects in the area such as street lights and planes, but without seeing the eye fatigue affect. this is how i concluded that whatever i was looking at was not normal. the area where this happened is a flight route for commercial and private airplanes going north and south. in addition, there is a hospital about 2 miles down the road (south) that has medical helicopters. i am good at identifying conventional aircraft and whatever this was it was not using the proper faa navigation lighting (white strobes and green\\red lights). this was not a satellite, because it was lower than the commercial planes. it lasted for about two minutes and then switched from a bright white light to a faded dark red\\brown and fizzled out of view. it was incredible and something i will remember forever. side note: i sent the other witness back into the building to get the camera, but by the time they were back out the ufo had disappeared."],"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 3 other sightings in Onamia","There were no other sightings in Onamia on or around August 17th 2012"],"Log Number":"US-08182012-0025","Summary":"Small diamond shaped craft flying at around 20,000 ft from NW to NE over HWY 169.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.075225,+-93.663216(41847)&iwloc=A&hl=en\"> mufon case (41847) map </A>","Object Flight Path":"Straight-line path","Date Submitted":"08/18/2012 10:33 UTC","Sighting Duration":"00:02:00","Country":"United States","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41847.html.txt","/var/www/straped/mufon/org/41847.html"],"Object Shape":"Diamond, Star-like","City":"Onamia","Latitude":"46.075225"}