{"Date Submitted":"08/18/2012 10:26 UTC","Latitude":"38.457393","Case Number":"41845","Summary":"Saw UFO teleport, 5 orbs shaped to a traingle flashing lights communicating with brightest ufo.","Date of the Event":"08/18/2012 01:45 UTC","Region":"California","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around August 18th 2012"],"Sighting Duration":"Undisclosed","City":"Santa Rosa","Object Flight Path":"Stationary","divs":["Sighting DetailsI woke up to thunder and bright flashes of light. I went outside to see the thunder storm, I was surprised because it's summer and there was no storm weather in the forecast, although I did find out later a tropical storm from Mexico was blowing in. There was one big blanket of cloud across the street over my friends house stretching to the side of mine, within those clouds were spirals of sky, as if someone wiped away the cloud in spots to make circles and spirals. About every 5 minutes a BRIGHT flash of white would sweep the whole block, this happened several times. I thought it was lightning at first, but there was no origin point of the light, it was just a \"blanket\" flash of white. I walked further out to the street, and saw a bright star like object in the sky. This week had meteor showers, but meteors do not sit in the sky for 3 hours like this did, all my friends are telling me UFO's are not real, yet this is the second sighting I've had around 1 am, and being 15 years old apparently I'm prone to imagine things. It flashed VERY bright, then dimmed to not being there. It did this several throughout the whole time it was here. It was over the left half of my neighbors roof, but very high in the sky so it was the size of a planet. All of the sudden it teleported to the other side of the sky, from my view about 3 inches, but probably miles for the craft. I lost my breathe and was completely shocked. It just MOVED very very fast to another location in the sky. I continued to watch this light fade. A bright flash of white swept over the block again, just as this happened the star-like craft faded and a few minutes later got to be extremely bright again. It moved slightly upward, and a few minutes later disappeared entirely. The clouds, still having circles and spirals appearing through them, and perfectly straight lines, moved towards where I was seeing this craft. Now this whole time there was absolutely NO wind. Just as the craft vanished the wind picked up very cold and very swift. Within 5 seconds of this wind the cloud had heat lightning, in purple and blue colors. The wind lasted for 7 minutes then died instantly. The craft again came into view, this time with a second smaller and dimmer one below and to the right of it. They flashed lights back and forth, changing sequence and speed of flashing. After a few minutes of this, four other small dim star like object appeared next to the smaller dimmer one that had been communicating with the big bright craft. The alignment of all the smaller lights was in the shape of a triangular front and square back. After about 2 minutes of the triangular shapes appearance, it was suddenly gone. The bright craft I had first seen was still there for a few more seconds, then gone. Another sudden gust of wind came, and it started instantly pouring rain. Not like gradual sprinkles to rain to pouring, but unrealistic movie kind of rain. No warning, just being water falled on. By the time I had reached my moms car to take shelter from the rain (I was hiding under the car) it stopped raining. INSTANTLY. It only rained for about 10 seconds, and was so much that the street was completely darkened with water. Then the clouds started shifting again, I could see through the spirals and circles a star like object flying around. Not like a satellite, but zipping around behind the clouds. I lost track of it as it went into thick cloud area. The original bright starlike craft I had seen before was back. But was alone glowing, and NO the clouds were not over it to hide it, and make me think it disappeared. It was clear sky in that area. I went inside to get my camera, by this time it was nearly 5 am and the sun was peaking. The craft was gone, but Venus was in that area. Everyone is telling me that I saw Venus this whole time. Planets Do Not Teleport."],"Weather Factors":"Unknown","Source":"MUFON","Longitude":"-122.73929","Object Shape":"Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/41845.html.txt","/var/www/straped/mufon/org/41845.html"],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=38.457393,+-122.73929(41845)&iwloc=A&hl=en\"> mufon case (41845) map </A>","Log Number":"US-08182012-0023","Tags":"City","Country":"United States","Disposition":"Unresolved"}