{"Summary":"very deep blue, intense light E, SE of 35th ave and Thunderbird rd in Phoenix drifting in sky.","Case Number":"41841","Log Number":"US-08182012-0020","Region":"Arizona","divs":["Sighting DetailsSaturday august 17th at approximately 10:40 pm, had several friends over preparing to go out for my girlfriends birthday. My sisters boyfriend left the house to go pick her up and about 2 min after leaving he calls to tell me that the strange blue light that I had seen hovering and meneuvering in the sky abut 3 weeks prior was in the sky again to the east of my home instead of due south where it had appeared the first time. Immediately I told the friends who were over and about 6 of us went outside to observe it. Like he said, there was a very deep blue, almost star like light about 45 degrees up from horizon, somewhere over north central phoenix if I had to give my best estimate. The light would pulse at aregular interview from deep blue to completely off and then back again while it moved around in the sky. It had an erratic path and would suddenly go very high up just under the cloud cover and then abrubtly turn in another direction and then drop in alttitude and then suddenly move in another direction and then go up and so on and so forth almost like a kite or something. However there was no wind whatsoever near the ground or up higher because there are several tall trees in the area and not a single leaf was moving in a breeze. We all watched this thing for about 10 minutes or so and then, just like the first time I had seen something like this a few weeks back, the light kind of cruises around on its erratic path and then finally decides to get lower and lower until it dips below the trees around here until I lose sight of it and then isn't seen again rising up. Atleast not while I have been outside watching it. At first I thought maybe they could be helicopters or something but the changes in direction or alttitude are too quick and dramatic for a manned air craft or remote controlled toy that I've ever witnessed. I live on the Deer Valley airport flight path so both times I've witnessed this phenomena there have been several helicopters and planes in the air that I've used to compare the lights to and they are definetely, definetely not the same types of objects."],"Object Shape":"Star-like, Unknown","Latitude":"33.542432","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Other","City":"Glendale","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around August 17th 2012"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Date Submitted":"08/18/2012 07:55 UTC","Longitude":"-112.179727","map":"<A HREF = \"http://maps.google.com/maps?q=33.542432,+-112.179727(41841)&iwloc=A&hl=en\"> mufon case (41841) map </A>","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41841.html.txt","/var/www/straped/mufon/org/41841.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"08/17/2012 10:43 UTC"}