{"divs":["Sighting DetailsAt early dawn in May 2004,I had prepared for my usual work day, then as I always did went to the kitchen for my morning coffee. As I entered the kitchen I looked out the north east facing window. From my elevation of 85-90 meters and a distance of 7 km I observed a orange circular orb, which I instantley thought was a sea king helicopter as their base is at CFB Shearwater approx. 6-7 km from UFO also. However, after watching it for about 10 seconds, I realized that I was witnessing a UFO because the orange light was much too large at a distance of 6-7 km. When I first spotted the UFO it was below my elevation at approx. 50-60 meters and hovered for 10 seconds over Cole Harbour NS. Then headed slowly to the south for approx. 30 seconds, traveling a total distance of about 350 meters. The UFO then made a slow descent to an elevation of approx 10 meters and hovered over the Dartmouth Skeet and gun club for close to one minute. After hovering over the gun club the UFO maintained same elevation and very slowly headed due North. When it returned to the approx location of where I first spotted the UFO it Slowly moved up to its origional elevation of about 50-60 meters, then seconds later flew off in a north easterly direction at a rate of speed, not known to exist on this planet. I was very excited during the encounter, so much so that I did not want to let the UFO out of my site. I did not want to miss a thing. Yes I decided to share my experience that morning with a few select co-workers, who seemed to think, I now had a couple of screws loose so I just kept it to myself until now."],"Region":"Nova Scotia","City":"Dartmouth","Longitude":"-63.504948","Country":"Canada","Date Submitted":"08/19/2012 08:03 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.67344,+-63.504948(41859)&iwloc=A&hl=en\"> mufon case (41859) map </A>","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Dartmouth","There were no other sightings in Dartmouth on or around May 5th 2004"],"Viewing Distance":"Over One Mile","Case Number":"41859","Summary":"Witnessed UFO hoover slowly, decended to 7-10 meters over cole harbour gun club stayed stationary for 1 minute then very slowley hovered to my left, assended to 50-60 meters then headed due north over tree tops at a rate of speed, not possible on Earth.","Tags":"City","Object Shape":"Circle","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/41859.html.txt","/var/www/straped/mufon/org/41859.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Latitude":"44.67344","Source":"MUFON","Disposition":"Unresolved","Date of the Event":"05/05/2004 12:00 UTC","Log Number":"CA-08192012-0007"}