{"Latitude":"29.620221","City":"Houston","Disposition":"Unresolved","Case Number":"41857","Log Number":"US-08192012-0005","Tags":"City","Summary":"Cloud ship shines Heavenly Light on me","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.620221,+-95.519396(41857)&iwloc=A&hl=en\"> mufon case (41857) map </A>","Country":"United States","Object Shape":"Other","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around August 18th 2012"],"Sighting Duration":"00:00:30","divs":["Sighting DetailsIt was a very cloudy day today. I was on my back patio smoking, and I glanced at the sky and imagined what Nibiru will look like when it passes and how terrible that day will be for Earth. I glanced back up to the sky and prayed to God that me and my family be raptured before this happens, and i lowered my head. Immediately, I was overcome with a strong urge to cry tears of joy that was very hard to hold back. Then, I was told to look back up to where I had just prayed to God, and what i thought was the sun was shining directly down on me. I tried to look directly at it, but the light was full of love and overwhelmed my emotions and eyesight. I had to look back down and i felt the warm embrace of the light leave me. I immediately looked back up but the light was gone. There was a low roaring sound like that of a carpet cleaner that was fading away, and I noticed it was coming from a cloud that was surrounding the light i had just seen. The cloud, with the light inside flew away. The sun was not out. I watched it fly away and disappear in the clouds. I was overcome with hysterical laughter of joy and then sobbing tears of happiness. As it all happened, I had no time to think about what it was, I didnt even realize what really happened until it flew away. But after the fact I have no doubt that it was definately Heavenly and Angelic if not God Himself. Praise Him!!!!"],"Viewing Distance":"20 Feet or Less","Object Features":"Unknown","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41857.html.txt","/var/www/straped/mufon/org/41857.html"],"Date Submitted":"08/19/2012 07:12 UTC","Region":"Texas","Date of the Event":"08/18/2012 04:30 UTC","Longitude":"-95.519396"}