{"Case Number":"41858","Country":"United States","Summary":"hovering in one place, thought it was a star until i realized it's overcast, there's light pollution from the strip, and it's flashing different colored lights.","Longitude":"-115.238348","files":["/var/www/straped/mufon/html2text/41858.html.txt","/var/www/straped/mufon/org/41858.html"],"Object Flight Path":"Stationary,Other","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.255123,+-115.238348(41858)&iwloc=A&hl=en\"> mufon case (41858) map </A>","Tags":"City","Date Submitted":"08/19/2012 07:43 UTC","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 19th 2012"],"Date of the Event":"08/19/2012 03:49 UTC","Source":"MUFON","Object Features":"Unknown","Region":"Nevada","City":"Las Vegas","Disposition":"Unresolved","Log Number":"US-08192012-0006","Latitude":"36.255123","divs":["Sighting Detailsi'm outside in my backyard, having a cigarette, and noticed what i thought was a star but realized it's overcast and there is too much light pollution to see any stars, then i realized that it was changing shape and pulsating different colored lights, then i noticed other very quick flashes of light, extremely bright zooming into it and being consumed by it. I live by the airport and i know what helicopters and airplanes look like and this isn't it. after 40 minutes normally even stars or a planet will be in a different position but this is still in the same EXACT place. And even with the sun almost rising it's getting brighter rather than duller. it seems to be on a horizontal slant with the lights rotating around it but then will balance itself out and pulsate an EXTREMELY bright white light. little bit of lights seem to be coming in and out of it, but they are too quick to really pinpoint a destination but are coming out of and into it from all directions. It's very far away, but VERY VERY bright. now it's moving from side to side on a horizontal slant and just zig zagged, i've never seen anything do that before.now it's spinning like a top and is less bright. moving in a circle in the same horizontal slant. it keeps scooping lower and lower. (sorry, i'm relaying all this as i'm watching it in real time) now i'm just waiting to see if and how it reacts when the planes start coming in, it appears to be coming closer, because it's getting bigger in size. it's split into two separate lights now. wow. they just blinked a bright flash of teal-ish light and disappeared. just ran across my backyard for a better view and i can't see them anymore. wow. finally after over an hour they are gone. hope this helps."],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Shape":"Circle, Fireball, Flash, Oval, Star-like"}