{"Latitude":"41.400994","Country":"United States","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Brook Park","There were no other sightings in Brook Park on or around August 18th 2012"],"Date Submitted":"08/19/2012 06:27 UTC","Date of the Event":"08/18/2012 11:02 UTC","divs":["sighting detailsi was standing outside my apartment, pacing back and forth for about 30 mins while talking on the phone with my mother when this orb comes over my building \\ treeline behind my building. as soon as i seen the object, i knew it was out of place. we live close to the airport and are familiar with air-crafts that land here. this was brighter, different color, much lower, much slower than it should be.i quickly ran inside and grabbed my ipad 3 to record a video. about 20 seconds had elapsed from when i first spotted it. the object was red ish orange, that almost looked like it was on fire. i called for my girlfriend to come outside and see it as well, which she jokingly asked \"is that a plane on fire?\" the sighting lasted for about 2 minutes. it's flight path from my point of view was from south east to south \\ south west. i was able to get 1 video that lasted about 1 minute before i ran out of storage space. i quickly cleared up some more space and shot another 45 seconds or so. the second footage shows the object ascend greatly into the sky, rather quickly too. it eventually went far enough for us to not be able to make it out, but it do not disappear due to obstructions in our view."],"files":["/var/www/straped/mufon/html2text/41856.html.txt","/var/www/straped/mufon/org/41856.html"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","City":"Brook Park","Disposition":"Unresolved","Object Shape":"Fireball, Sphere","Region":"Ohio","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.400994,+-81.825231(41856)&iwloc=A&hl=en\"> mufon case (41856) map </A>","Object Features":"Unknown","Case Number":"41856","Object Flight Path":"Path with directional change","Longitude":"-81.825231","Log Number":"US-08192012-0004","Summary":"Redish Orange Orb seen in SE Sky Near Hopkins Airport","Sighting Duration":"00:02:00"}