{"map":"<A HREF = \"http://maps.google.com/maps?q=44.989646,+-89.592089(41868)&iwloc=A&hl=en\"> mufon case (41868) map </A>","Date of the Event":"08/17/2012 09:45 UTC","Disposition":"Unresolved","City":"Wausau","Object Features":"None","Longitude":"-89.592089","Viewing Distance":"Unknown","Case Number":"41868","Source":"MUFON","Object Shape":"Flash, Other, Unknown","Weather Factors":"Unknown","Log Number":"US-08192012-0016","Object Flight Path":"N/A","Summary":"Three flashes emanating from nothing...","trends":["There have been 5 other sightings in Wausau","There was one other sighting in Wausau on or around August 17th 2012"],"divs":["Sighting DetailsMy wife and I are non smokers but we used too, as a matter of habit we still step outside occasionally and conversate. We have tall white pines in our back yard that give us a limited view of the southern sky so the small patch of sky we do have is a familiar site. Almost instantly my wife found a satellite traveling in the western part of the sky headed south that she drew my attention to. The task to find the next one often turns into a game. One satellite then two then three then four, five and six were traveling in a pair mabey a inch apart in the sky. Over the course of a few minutes we found more satellites traveling in all different directions than we've encountered on any other night of sky viewing ever... This was strange enough and not note worthy by itself however, six satellites was not the total for this instance. From the direction of the double satellites ( East North-east ) after the two had passed, what appeared to be a flash from just behind the tree line but very high in the sky startled my wife. Within a few seconds, just as she asked me if I saw it, there was another flash from the same origin. I know that a flash in the sky isn't much for the UFO speculative community, the only reason I have to document this is these were not flashes of light. Ill try to describe it a way that other people can try to associate with but it is difficult. These flashes in the sky cast almost no light. There was no white light at all, it wasn't brite light, it wasn't blue or green or yellow. Both our eyes were completely fixed on the sky straight above our heads.. I had my hands crossed behind my head holding it up to keep from cramping. My wife was complaining of strain as well but there were still satellites soaring across the sky ( the count was up to eight in less then five minutes ). Then again directly above me very high in the sky there was another flash... This emanated from absolutely nothing visible. The \"flash\" was black like a hole being ripped in the sky with a dull black-red border extending outward from the origination point. The flash didn't seem like an actual flash of visible light at all but rather a transparent shockwave of some sort. I asked my wife \" did you see that one? \" and her response was \"I did, I think, I don't know what I saw.\" she gave me a quick description of what she saw and became frustrated her lack of comparisons and gave up trying to describe it. Over the coarse of the next five minutes everything besides the stars disappeared from site and we couldn't look up any more."],"Region":"Wisconsin","Country":"United States","files":["/var/www/straped/mufon/html2text/41868.html.txt","/var/www/straped/mufon/org/41868.html"],"Tags":"City","Date Submitted":"08/19/2012 03:40 UTC","Latitude":"44.989646","Sighting Duration":"Undisclosed"}