{"Date of the Event":"08/19/2012 09:00 UTC","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around August 19th 2012"],"Object Features":"Other","Longitude":"-83.125466","Disposition":"Unresolved","City":"Detroit","Object Shape":"Fireball","Region":"Michigan","Latitude":"42.41823","Log Number":"US-08192012-0025","files":["/var/www/straped/mufon/html2text/41878.html.txt","/var/www/straped/mufon/org/41878.html"],"Sighting Duration":"00:15:00","Country":"United States","divs":["sighting detailson 8\\19\\2012, i was driving home in detroit, mi. i was looking for unusual clouds to capture on my cellphone camera to use as background for video editing productions. while gazing at the clouds, i suddently noticed an orange object in the sky. i first thought it may have been fireworks, but, thought, no it could not have been. it was too high up in the sky. i alerted my two brothers who were in the car with me to look at the object in the sky. i asked what is that? it is not an airplane or hellicopter. both brothers got out of the car to get a better look. in there excitment and wonder, they too could not identify the object. there were first three objects hovering in a row together in one place beneath the clouds, over the homes in the area of the street in detroit,mi - clarita and fairfield. i held my cellphone in one place to see if the object would decend closer, but, one of the three objects just disappared, leaving two to hover. my brothers and i could see that it could not be a plane, because it moved a little, then stopped high up in the sky in one place. a plane does not hover in a stationery position in the sky. this object did. the second object then disappeared. it was a pretty orange color, and looked like a fireball. neither myself, nor my brothers could explain what we saw, nor had we ever seen anything like this in our lives. it was an amazing and unforgettable experience for us all."],"Object Flight Path":"Hovering then path","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.41823,+-83.125466(41878)&iwloc=A&hl=en\"> mufon case (41878) map </A>","Summary":"3 orange objects seen high up in the sky, hovering below the clouds, first one dissapeared, then the second, and finaly the 3rd largest one. Hovered in same place for approximately 15 minutes. Was not a plane of any sort. Seen by 2 brothers also.","Date Submitted":"08/19/2012 10:57 UTC","Case Number":"41878","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON"}