{"Viewing Distance":"Unknown","Latitude":"38.985193","Date Submitted":"08/20/2012 12:51 UTC","files":["/var/www/straped/mufon/html2text/41885.html.txt","/var/www/straped/mufon/org/41885.html"],"Source":"MUFON","City":"Florence","Object Shape":"Cylinder, Oval","Disposition":"Unresolved","Log Number":"US-08202012-0003","Country":"United States","Case Number":"41885","Date of the Event":"08/19/2012 07:30 UTC","Tags":"City","Weather Factors":"Unknown","Longitude":"-84.658048","map":"<A HREF = \"http://maps.google.com/maps?q=38.985193,+-84.658048(41885)&iwloc=A&hl=en\"> mufon case (41885) map </A>","trends":["There have been 5 other sightings in Florence","There were no other sightings in Florence on or around August 19th 2012"],"Summary":"Black banded cigar ufo sited twice in florence ky. on way to the park and at the park 30 minutes later. going very slow. no sounds.","Region":"Kentucky","divs":["Sighting DetailsMy family and a friend were on our way to Boone woods park on August 19th, 2012 (today) and while on US 42 I spotted a strange white shape flying above an airplane descending to CVG airport. This occurred around 7:00 pm. I pointed it out while we were driving but it was very very hard to see. It was cigar shaped but as small as a star it was so high up. We arrived at the park, and we played for around 30 minutes. As we were walking by the fort that is located at the park, I spotted the same object closer, this time very detailed. It had absolutely no sound, no emissions for propulsion and seemed to be going very slow, as if surveying the area. It was a cigar shape, long, white and reflective but no lights, and with 2 black bands dividing it equally. It had no wings, no jets, we thought maybe it was a strange blimp at first. But then it picked up speed and zoomed off very quickly. There were no windows, and no tail. It looked like a giant tube of chapstick! The sighting lasted approximately around 10 minutes in total. I attempted to take a picture of it on my phone, but it ended up looking like a white ball from being so far away. I have heard of these types of UFOs but never really thought I would ever witness one."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Object Features":"Other"}