{"Date Submitted":"08/20/2012 12:58 UTC","files":["/var/www/straped/mufon/html2text/41887.html.txt","/var/www/straped/mufon/org/41887.html"],"Viewing Distance":"Unknown","Case Number":"41887","Country":"United States","Latitude":"26.717663","map":"<A HREF = \"http://maps.google.com/maps?q=26.717663,+-81.939018(41887)&iwloc=A&hl=en\"> mufon case (41887) map </A>","Log Number":"US-08202012-0005","Object Features":"None","Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-81.939018","Object Shape":"Star-like, Triangle","Region":"Florida","Object Flight Path":"Stationary","City":"Cape Coral","Summary":"observed three lights in triangle shape in sw sky","trends":["There have been 16 other sightings in Cape Coral","There were no other sightings in Cape Coral on or around August 19th 2012"],"Source":"MUFON","divs":["Sighting DetailsI was looking for ufo's, I always look for them, every night and day. Tonight around 8 pm I saw 3 star like lights in the sw sky that I had never seen before. I felt immediately it was a ufo. They formed a triangle shape and the two at the top appeared white (like a star) in color and the bottom light appeared to be orange in color and flashed or pulsated. The triangle appeared to be slightly longer than wide. Somewhere around 9:30 pm one of the lights went out (kind of like when a bulb blows out) then another went out and the one at the upper right stayed on. Storm cloud cover started coming in and I went inside. Also,during my observation an airplane was on the landing pattern into Fort Myers Regional airport. The plane was heading south and was west of my location and would soon bank east to the airport. I'm sorry but I can't remember if it was earlier or later in the sighting. The triangle never seemed to change it's location. In the intrim I had to do a errand which took me south on Del Prado Blvd to Veterans Pkwy and I followed it all the way there and back. Also, I looked for a solid form but could not tell in the darkness."],"Date of the Event":"08/19/2012 12:00 UTC","Sighting Duration":"Undisclosed"}