{"Region":"California","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-117.485443","trends":["There have been 38 other sightings in Riverside","There was one other sighting in Riverside on or around August 19th 2012","This sighting has never been favorited.",""],"Object Shape":"Circle","Log Number":"US-08202012-0002","Tags":"City","files":["/var/www/straped/mufon/html2text/41884.html.txt","/var/www/straped/mufon/org/41884.html"],"Object Features":"None","Case Number":"41884","Object Flight Path":"Straight-line path","City":"Riverside","Country":"United States","Viewing Distance":"Over One Mile","Date of the Event":"08/19/2012 08:51 UTC","divs":["Sighting DetailsI was sitting in the backyard of my home and star gazing as I do frequently. I noticed what appeared to be a very bright star at 20:51pst from the N, NW direction heading E in a straight line. The object did not blink nor did it have any caution lights like commercial planes in the area. There were two commercial planes flying in from the E in a NE direction. At first I thought it might be a satellite or small plane, but it was moving too fast, I got really excited and I immediately called for my wife to come have a look.In the time it took her to come out, which was about 10 seconds the object was directly above us. She couldn't see the object so she went in to get her glasses, but it had already started to disappear. It seemed to be flying in an upward path. It started out big, that is why I think it was flying upward, because it started to shrink in size.Funny thing is, I have seen something like this in the past, I even videotaped it, and notified your office. No one has contacted me about this yet. Why am I seeing these so often, there are two military bases nearby, March AFRB and to the E is Fort Irwin in the desert. Sorry, wish I was a better witness."],"Summary":"Saw a solid starlike light coming from the NW to the E at 20;51pst","Sighting Duration":"00:03:08","Latitude":"33.896375","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.896375,+-117.485443(41884)&iwloc=A&hl=en\"> mufon case (41884) map </A>","Date Submitted":"08/20/2012 12:25 UTC"}