{"Region":"New York","Sighting Duration":"00:02:30","trends":["There have been 2 other sightings in Patchogue","There were no other sightings in Patchogue on or around August 19th 2012"],"Viewing Distance":"Unknown","Country":"United States","Disposition":"Unresolved","Latitude":"40.76595","City":"Patchogue","divs":["sighting detailsi was smoking outside with three of my coworkers when i looked at the sky to my right and noticed two orangey\\red orbs that resembled stars. when they started to moved and two others appeared i noticed they weren't that. they pulsated between red and orange and moved in a weird pattern around each other a bit. i brought it to the attention of my coworkers and one of them said there was a plane crash in shirley and that they must be helicopters. i told him they weren't because helicopters didn't fly that high neither did they have orange lights on them. he then said it was possibly a plane. then an actual airplane went by and my other coworker told him it can't be since that airplane that went by went quite a bit faster. i tried to get pictures but the light posts were reflecting off of my camera. they slowly started to disintegrate and after a good two mins and half the last one disintegrated. before it disintegrated it was moving in a barely noticeable wave pattern. i know that these are ufos as i've seen similar orbs in the last couple of months over the island and so have many other people. i find it weird i had just been telling my coworker about what had happened before about a month ago on the 4th of july and then this happened ten minutes later."],"Summary":"Smoking with coworkers and saw four ufos","Longitude":"-73.020334","files":["/var/www/straped/mufon/html2text/41882.html.txt","/var/www/straped/mufon/org/41882.html"],"Date of the Event":"08/19/2012 08:55 UTC","Tags":"City","Object Features":"Unknown","Log Number":"US-08202012-0001","Object Shape":"Fireball, Sphere","Case Number":"41882","map":"<A HREF = \"http://maps.google.com/maps?q=40.76595,+-73.020334(41882)&iwloc=A&hl=en\"> mufon case (41882) map </A>","Object Flight Path":"Straight-line path,Path with directional change,Other","Date Submitted":"08/20/2012 12:02 UTC","Source":"MUFON","Weather Factors":"Unknown"}