{"Summary":"a flying craft of some sort soundless with 4 large engine lights and two colored blinking lights. water cloud seamed to surround it.","Case Number":"41890","City":"plymoth","Date of the Event":"08/19/2012 09:45 UTC","Latitude":"43.198822","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Country":"United States","Date Submitted":"08/20/2012 10:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.198822,+-71.566245(41890)&iwloc=A&hl=en\"> mufon case (41890) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Oval","Source":"MUFON","Longitude":"-71.566245","Disposition":"Unresolved","Tags":"City","Object Features":"Other","divs":["Sighting DetailsI was watching Bar rescue on television in my bedroom and dogs came over to my and acted like they needed to go out to bathroom, so i got up and took them outside as i stepped outside i threw my dog her toy and then looked up to admire the clear sky and the stars. when i did i noticed a low flying object very slowly fly directly overhead in a straight path. I did a double take in awe because there was no sound and there seemed to be something strange about the object like it was surrounded by some sort of transparent water shroud. The object was emitting two flashing lights one was a quick flash at one side which split into two and each went around the object and met 180 degrees on the other side and then went out only to repeat again. as the object flew by i saw four larger blue-white lights that seemed to define the back because it was now flying away from me at an angle and they were positioned in a manner that gave objects back side to be sort of a butterfly shape. I could see a red blinking light in the middle of this pattern on the back side of object. I yelled and ran into the house to get my two sons 13 and 16 to get out here quick and see this object along with my 16 yr old son's girlfriend the all ran out and we all observed the object. None of us could believe what we were seeing and i said to them can you believe this. I told my oldest son to run upstairs and grab my high powered spot light quick so i could try and signal this and possibly get a response. He did and when he came out i grabbed the light and started to pull trigger and aim it at object. they asked what i was doing and i told them trying to get a response. the object went below tree line and they went inside. i stayed outside and ran up on my pool deck because it looked like the object had stopped and was hovering over near the beach Hill dam area which is past the large power lines about a couple hundred yard next to my house. when i got up on my pool deck i began trying to signal with my light again. I saw this object close and my kids did as well. as it past over it seemed like it was covered in a transparent shroud of water. like when you look at water and can see the mountains and trees as a reflection it was so strange. when it went by it was like you could see stars through it. I knew this object wasn't any normal sighting, being a former Marine i have been around aircraft and i have never seen anything like this sh*t. Everything makes noise. planes and helicopters fly over my house regularly from Dart med flights and military training to recreational craft. My kids where freaked out. Me personally, unless our gov't has a top secret flying aircraft unknown to the public that can fly low low level making no sound with these characteristics i have described then it would be a unidentified object in my opinion. If anyone else know's or could give me an intelligent answer as to what the hell could look and have these types of characteristics then i am all ears.It flew in a straight line and then appeared to stop and hover. This was an incredible event my son an i almost got into my vehicle and got on route 25 north to see if we might get another glimpse due to its path but didn't. i finally lost sight behind the treeline.I wish i had my HD video camera handy because it would of been an incredible video.I did a real quick sketch on the back of an envelope immediately after so i didn't loose what i saw. a few minutes after i looked up and noticed a wide mist like trail from direction it came from. so i got my 16yr old back outside to view it as well he saw this too. i stayed outside for about 15 min after event just looking up and towards direction it went."],"Region":"New Hampshire","files":["/var/www/straped/mufon/html2text/41890.html.txt","/var/www/straped/mufon/org/41890.html"],"trends":["There have been no other sightings in plymoth","This sighting has been favorited 1 time."],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08202012-0009"}