{"trends":["There have been no other sightings in Regina Beach","This sighting has never been favorited."],"Object Features":"Unknown","divs":["Sighting DetailsOn Saturday August 18th, 2012 I was at a cottage on Last Mountain Lake near Glen Harbour, Saskatchewan. It was approximately 11:30pm -6GMT and I was on the deck enjoying the night. The night was clear with no moon and a light east breeze. The deck faces the lake to the SW-West. I noticed a bright orange light in the south west sky. It was moving towards the west on a slight incline. I immediately thought \"what the hell is that?\" I watched as it moved further away until the light faded and I lost track of it. I thought well it could be anything as I could hear other people down the beach enjoying themselves and thought maybe a chinese lantern but it was moving to fast for that or a flare. As I was thinking about what it could be, another object of the same size, color, brightness appeared moving at the same speed and along the same flight path as the first one. I watched as it too kept cruising and eventually lost sight of it. This all happened within about 3 minutes. I didn't have a camera or my cell phone on me to take a quick picture or video which is unfortunate. The objects were much larger than a plane or satellites that appear in the night sky and were moving much faster than an airplane. There was no sound or exhaust trails. I still don't know what it was but thought if I report it maybe someone else saw something and will report it as well. I did some internet searches and there have been other reports of strange lights in around the same area."],"Log Number":"CA-08202012-0012","Case Number":"41894","Summary":"2 large bright orange glowing objects","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=50.792207,+-104.98571(41894)&iwloc=A&hl=en\"> mufon case (41894) map </A>","Date of the Event":"08/18/2012 11:30 UTC","Object Flight Path":"Straight-line path","Country":"Canada","files":["/var/www/straped/mufon/html2text/41894.html.txt","/var/www/straped/mufon/org/41894.html"],"Disposition":"Unresolved","Date Submitted":"08/20/2012 12:44 UTC","City":"Regina Beach","Region":"Saskatchewan","Latitude":"50.792207","Object Shape":"Sphere","Longitude":"-104.98571"}