{"Country":"United States","Log Number":"US-08202012-0024","Sighting Duration":"00:00:02","Region":"Oregon","Tags":"City","Longitude":"-122.408871","files":["/var/www/straped/mufon/html2text/41906.html.txt","/var/www/straped/mufon/org/41906.html"],"Weather Factors":"Unknown","trends":["There have been 19 other sightings in Gresham","There was one other sighting in Gresham on or around August 11th 2012"],"Summary":"A dull, silver disc","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, Unknown","Object Flight Path":"Straight-line path","Case Number":"41906","Latitude":"45.50156","Object Features":"None","Object Shape":"Disc","divs":["Sighting DetailsI was outside on the patio with my wife, talking about the movie we just saw in the theater. Five different times she saw lights in the sky. They were distant, and looked like large, slow-moving teardrops. I missed every single one. She was getting a little anxious, not knowing what they were. We knew there was a meteor shower that night, and what we saw was wasn't even close to what meteors should look like. I kept asking her if she thought she was seeing UFOs, and she kept saying that's the best description for her... she's never seen anything like those lights before. While she was telling me what the lights looked like, this dull, silver disc flew between the trees nearby and the neighbors house. There was no sound. It was so fast, I was completely taken by surprise. The disc was flying on its side, and spinning at the same time. There were no lights coming off of it, but the lights from the street reflected off the surface. I believe what I saw was the bottom of the disc. after I saw that, I grabbed my wife and went (partially ran) into the house. I didn't want to be sitting outside when there was some unknown thing flying around the neighborhood. The disc was flying just over the houses. The whole event, everything I saw, only took a couple of seconds. It was disconcerting, and a little scary. It took me a couple of hours for me to fall asleep afterward. -August 11, 2012 Around 10:30pm"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.50156,+-122.408871(41906)&iwloc=A&hl=en\"> mufon case (41906) map </A>","Date Submitted":"08/20/2012 09:02 UTC","City":"Gresham","Date of the Event":"08/11/2012 10:30 UTC","Source":"MUFON"}