{"Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/41904.html.txt","/var/www/straped/mufon/org/41904.html"],"Date Submitted":"08/20/2012 07:17 UTC","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"Pennsylvania","Summary":"At least 30 seperate reddish flickering lights moving SE to NW then disappearing","Source":"MUFON","Longitude":"-80.136972","Country":"United States","Date of the Event":"08/18/2012 09:00 UTC","Log Number":"US-08202012-0022","map":"<A HREF = \"http://maps.google.com/maps?q=42.088295,+-80.136972(41904)&iwloc=A&hl=en\"> mufon case (41904) map </A>","divs":["sighting detailsi stopped at our local giant eagle grocery store to pick up some things after work. i exited the store at approximately 9pm and was walking across the parking lot to my car. i always look at the sky at night because i love seeing the stars, constellations, etc. but as i glanced over the top of the store several (appx. 7-8) red lights were moving from se to nw without making any sound. there may have been no sound because i was too far away...the lights did appear to be the size of a light you'd see on an airplane, but they flickered almost like a campfire would..flashing red\\reddish orange. the lights would appear over the distant horizon (the treeline\\first point of visibility was at appx. 30 degrees) in the se and slowly travel to the nw where they would simply just fade out (at appx 45-50 degrees from my vantage point) only to be replaced by more objects from the se. some of the lights would assume a formation (chevron, side-by-side) after floating for awhile and would remain in the formation until disappearing. all in all about 30 \"flying campfires\" were sighted from about 9pm-9:30pm. i tried taking pictures and video with my cell phone but the lights in the parking lot were too bright for any of the ufos to register or show up in my pictures or videos. i called the employee who was gathering carts in the lot to come look and he saw them too. then he and i flagged a couple down who had just parked their car and they witnessed the objects too. i lost sight of the objects after they stopped appearing at about 930pm."],"Latitude":"42.088295","City":"Erie","Disposition":"Unresolved","Tags":"City","Case Number":"41904","trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around August 18th 2012"],"Object Shape":"Fireball, Sphere"}