{"Object Shape":"Egg, Fireball, Teardrop","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","Summary":"UFO sighting in Battle Ground WA on Aug. 19th, 2012 at 9:45 pm approx.","Tags":"City","Case Number":"41905","divs":["sighting detailsi was sitting outside in my garage, with the garage door open, talking on the phone. i noticed this large bright object flying in circles at a very low speed. it descended down and started to hover and make circles. i got off the phone, stared at it for about a minute and ran inside to get my husband to look at it. he came outside and we started walking around the neighborhood to look at it from different angles. we used the light pole in our neighborhood as a rough measuring tool for how far away this object was approximately from us. we felt that it was somewhere between 700-1000 ft above us and about 500-700 away from us. there was absolutely no sound from the air craft. there were no other planes in the area or any other noise; it was very quiet. the top of the light pole has a box, that provides the light, and this aircraft seemed about twice as large as the lit box. it was kinda egg shaped, but also looked like it might be considered a tear drop shape. it was a bit difficult to determine the exterior because there were so many lights and it was very bright. at first we thought maybe this aircraft was reflecting light from the light poles, but after moving around the pole...it was clear that this aircraft was emitting its own light source and the light pole had nothing to do with the strange colors. it also appeared as though it was on fire, the whole exterior. it did not leave a trail or anything, but it did radiate the area around it slightly. it had horizontal red and orange lights in the middle or the aircraft that were flashing\\pulsating. the fire color reminded me of the sun, but not directly looking at it; it had this orangish\\fire moving color. my husband saw primarily red & orange lights on the craft, and i saw rays of the full color spectrum coming off the craft in vertical beams, in sets of 3, around the whole aircraft. i also saw the red & orange lights that were horizontally placed in the mid section of the aircraft. this thing was making big, slow circles as we watched it. there was no set pattern and it bounced back and forth between hovering and making circles. my husband ran into the garage to get his binoculars, but was unable to bring the craft into focus to determine what it was we were looking at. something else strange happened, neither of us were alarmed or frightened, but heavily intrigued with the experience. before it started to ascend upward, it \"blinked\" at us a few times (3 or 4), almost as though saying \"you saw me...i see you...good bye\" it then picked up speed, there was no noise, and the lights went out as it headed south east towards vancouver washington. there was an overwhelming feeling of calmness, as if this is totally normal; no strangeness here. i did have the feeling that this thing was not we kept staring at the sky, in the same location, for a couple minutes afterward...but it never returned. the whole session lasted about 7-10 minutes approx. my husband just recently retired from the us air force, serving 22 years, and said he has never seen anything like that before and has no idea what that was."],"Date Submitted":"08/20/2012 08:23 UTC","trends":["There have been 5 other sightings in Battle Ground","There were no other sightings in Battle Ground on or around August 19th 2012"],"Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/41905.html.txt","/var/www/straped/mufon/org/41905.html"],"City":"Battle Ground","map":"<A HREF = \"http://maps.google.com/maps?q=45.788018,+-122.51763(41905)&iwloc=A&hl=en\"> mufon case (41905) map </A>","Latitude":"45.788018","Weather Factors":"Unknown","Object Features":"Unknown","Log Number":"US-08202012-0023","Region":"Washington","Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"08/19/2012 09:45 UTC","Longitude":"-122.51763","Sighting Duration":"Undisclosed"}