{"Date Submitted":"08/20/2012 06:55 UTC","Log Number":"US-08202012-0021","Object Features":"Patterned Surface","Weather Factors":"Unknown","Latitude":"42.336946","divs":["Sighting DetailsOn Oct,19 2009 at around 6:30pm, I was working on the 18th floor of my apartment building in downtown Detroit, when I noticed something floating around the two smoke stacks on the power plant near my place. It seemed to be hovering directly through the smoke of the stacks, and then around the two stacks,in between the two stacks, and then it would float a few blocks away and then back to the stacks. At this point I had been watching this thing for about 8 minutes or so when I ran to grab my camera and returned with my girl friend and my brother in law. So I snapped off these pics which I can't explain. My camera batteries died so I left my brother in law to keep an eye on it while I went for more batteries. By the time I got back he said it had slowly flew to the South and he lost it behind some taller buildings. It seems to be pretty small (about the size of one of those little smart cars?) I sent these photo's to UFOs Northwest shortly after taking them. They're still up on that site, nobody seems to have an explanation for them.If you have any questions I'd be happy to try and answer them."],"Date of the Event":"10/19/2009 06:30 UTC","Object Shape":"Sphere, Star-like, Other, Unknown","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Summary":"Took eight photos of ufo over detroit edison power plant, Detroit Mich","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around October 19th 2009"],"City":"Detroit","files":["/var/www/straped/mufon/html2text/41903.html.txt","/var/www/straped/mufon/org/41903.html"],"Region":"Michigan","Disposition":"Unresolved","Source":"MUFON","Case Number":"41903","Longitude":"-83.046683","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=42.336946,+-83.046683(41903)&iwloc=A&hl=en\"> mufon case (41903) map </A>"}