{"Object Shape":"Circle, Sphere, Star-like","Object Features":"Appendage(s), Wings","Source":"MUFON","Date of the Event":"08/20/2012 08:30 UTC","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Country":"United States","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around August 20th 2012"],"Date Submitted":"08/21/2012 12:46 UTC","divs":["Sighting DetailsMe and a female friend were sitting outside in her backyard and she looked up and said what is that. The stars were not visible yet but it was getting dark and was slightly overcast. I looked up and saw two white lights and a red light in the middle. It would fly as though it was a plane and the two white lights would be on the wings and the red light on the belly. It suddenly stops starts darting around and pulsing. When it moved it was like a frog in water kinda kicking its legs then \"coast.\" Or maybe like a jellyfish.Then would kinda \"blow apart\" then come back together. Then we noticed 4 to 5 others just all directions over the sky. They were about the size of stars and looked very high up. They all did the same motions but I mostly paid attention the first one we noticed which was directly above by the way. To high for helicopters. They are still there right now. I tried to take photos with me cell but they didn t come out. I ve seen satellites and to me they look like little blips that pass by. These are not sats."],"City":"Albuquerque","Summary":"Crazy \"frog\" lights.","map":"<A HREF = \"http://maps.google.com/maps?q=35.072291,+-106.742542(41909)&iwloc=A&hl=en\"> mufon case (41909) map </A>","Region":"New Mexico","Longitude":"-106.742542","Case Number":"41909","Weather Factors":"Unknown","Log Number":"US-08212012-0001","files":["/var/www/straped/mufon/html2text/41909.html.txt","/var/www/straped/mufon/org/41909.html"],"Latitude":"35.072291","Disposition":"Unresolved","Viewing Distance":"Over One Mile"}