{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41908.html.txt","/var/www/straped/mufon/org/41908.html"],"Date Submitted":"08/20/2012 11:43 UTC","Object Features":"None, Unknown","Log Number":"US-08202012-0026","Region":"Illinois","Summary":"v shape with at least 5 lights that did not blink","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There has been one other sighting in Peru","There was one other sighting in Peru on or around August 20th 2012"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.323992,+-89.129324(41908)&iwloc=A&hl=en\"> mufon case (41908) map </A>","Longitude":"-89.129324","Sighting Duration":"00:00:45","Case Number":"41908","Source":"MUFON","Date of the Event":"08/20/2012 09:30 UTC","Viewing Distance":"101-500 Feet","Latitude":"41.323992","City":"Peru","divs":["Sighting DetailsIt was 9:30 pm and I went to shut the front door. I stood there for a minute to enjoy the cool breeze. All of a sudden I looked to the west and about my driveway a V shaped flying object was silently heading north at about 45 mph. It could have been faster. It was above the tree tops and it appeared to have 5 lights. The lights did not blink. It was in my line of sight for about 1 min. At first I couldn't believe what I just saw, I was nervous and excited at the same time. I tried to call my friend but only fumbled with the phone. I needed to calm down. I then looked for my shoes to run outside and see if I could see it again from the road. By the time I got outside it was gone, but two of my neighbors just happened to be outside at that time. I asked them both if they has=d seen anything and they both said no. They were not outside when I first saw the object. It is now 10:13 pm and a helicopter has just flown by going south. It is just above the tree tops at the same height as the V shape object I saw going north a hour ago. I would say it was about 500 feet in the sky, give or take a few feet either direction."],"Object Shape":"Triangle","Tags":"City"}