{"Tags":"City","trends":["There have been 3 other sightings in Milano","There were no other sightings in Milano on or around July 14th 2012"],"divs":["Sighting DetailsThis morning at 05:20 AM Saturday, 14 July, 2012, I was riding in the front seat as a passenger coming back from a gig in Brazoria, Texas. We switched positions in the truck just prior to this event. I was sitting in the front seat passenger side of the truck. We were traveling on State highway 36 going Northwest bound just out of Milano. Steve, the driver, and I saw what looked like to be lights on what we thought could have been a tower a mile or so away. As we got closer, we realized that the lights were not on a tower but seemed to be suspended over the road. The lights were part of an object that seemed to be shaped like a pentagon. The light in the center was brighter than the other five and was located in the center of the underside of the object. The five other lights were located close to the end of each corner of the underside of the pentagon-shaped object. All the lights were white and pulsated about once a second. We could see that the object had shape and a surface with seams or vents. The object seemed to be dull black or charcoal in color. It seemed to hover over the road approximately 30 feet in altitude as we passed underneath it going about 60 mph. The object appeared to be 20-30 ft across. We saw it fade in the rear view mirror as we drove farther away. It made no noise that we could hear over the noise of the car engine. Our vehicle was positioned approximately at the following coordinates: 30.728556,-96.893921"],"Latitude":"30.699189","Longitude":"-96.841611","Summary":"Observed Hovering Pentagon-Shaped Craft","files":["/var/www/straped/mufon/html2text/41918.html.txt","/var/www/straped/mufon/org/41918.html"],"City":"Milano","Country":"United States","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=30.699189,+-96.841611(41918)&iwloc=A&hl=en\"> mufon case (41918) map </A>","Log Number":"US-08212012-0009","Disposition":"Unresolved","Date of the Event":"07/14/2012 05:20 UTC","Object Flight Path":"Stationary","Source":"MUFON","Case Number":"41918","Region":"Texas","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"08/21/2012 04:24 UTC","Object Features":"Louvres"}