{"Date Submitted":"08/21/2012 10:33 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Date of the Event":"08/20/2012 05:50 UTC","City":"Leeds","Region":"England","Country":"United Kingdom","Summary":"Smooth grey sphere-shaped object moving slowly in circles at fixed altitude of about 700/800 feet.","Sighting Duration":"Undisclosed","Case Number":"41914","files":["/var/www/straped/mufon/html2text/41914.html.txt","/var/www/straped/mufon/org/41914.html"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=53.802986,+-1.538171(41914)&iwloc=A&hl=en\"> mufon case (41914) map </A>","Latitude":"53.802986","Log Number":"GB-08212012-0006","Object Flight Path":"Other","Longitude":"-1.538171","Disposition":"Unresolved","divs":["sighting detailsi was at work yesterday, we work 4 floors up. something caught my eye in the sunlight to the east, looked to be about 700\\800 feet in the air, about the size of a large beach ball, but a solid light grey colour. the ojbect kept the same altitude but moved slowly in an anti-clockwise circle, probably with a diameter of 100 feet. there was a dark rain cloud near the object, as it made the circle it disappeared into the cloud, then came out again, as it came out of the cloud each time it really caught the sunlight and reflected brightly for a second, then went round again. i went to the office window and was watching the object with a work colleague for at least 5 minutes, neither of us could work out what it was. it was probably travelling at about 30\\40 feet per second. if i had been much further away i might have just said it's probably a bird or something, but because i was close enough to see it was a sphere, and also because it seemed to repeat the exact same circle over and over again, there is no way it was a bird. i had my mobile phone with me but knew it would be too small to show up on the camera it has."],"Object Features":"None","trends":["There have been 9 other sightings in Leeds","There were no other sightings in Leeds on or around August 20th 2012"],"Weather Factors":"Unknown"}