{"Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Other","Sighting Duration":"00:10:00","Latitude":"41.883814","Date Submitted":"08/21/2012 07:31 UTC","Viewing Distance":"20 Feet or Less","City":"Chicago","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around July 13th 2010"],"Source":"MUFON","Object Shape":"Other","Longitude":"-87.622338","Case Number":"41912","Date of the Event":"07/13/2010 11:10 UTC","Summary":"chasing me, hovering over me, intensual allowing me to see them","files":["/var/www/straped/mufon/html2text/41912.html.txt","/var/www/straped/mufon/org/41912.html"],"Tags":"City","Log Number":"US-08212012-0004","Object Flight Path":"Hovering then path","Region":"Illinois","divs":["Sighting Detailsseen the ufo from 6-8 feet from me. No noise, no wings, no propellers, no wheels. My encounter was for ov er 1 year, on going. They were following me home, paceing me all the time, would constantly dive down at me track me sit motionless above my garage, so many times it was upsetting me. One of these \"scout craft\" first chased me down western ave at night about 10 feet above the cars. I have film footage. One of them came down 6-8 feet in front of my car, it was startling. They completely have defied gravity, there is too much to tell. I dont want to tell anyone my name just want you to know that they are here. Not disk shaped, these are more in shape of lets say a small car almost, with a pipe running along the the bottom edge with lights attached to the pipe. The main body is a very bright white light, making it impossible to see any details inside the craft, but the shape is easy to see and the bottom piping along the edge. No noise, as I said I have film of it. But who to trust, I am not certain. Just understand this, at times they appear to be a star, other times the have colored lights so that when it moves one may think its a plane. This is the most fantastic thing that ever happened to me, my encounter has to be unique. Mr. Bob"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.883814,+-87.622338(41912)&iwloc=A&hl=en\"> mufon case (41912) map </A>","Country":"United States"}