{"Country":"United States","Latitude":"41.208022","Object Flight Path":"Path with directional change","divs":["Sighting DetailsIt was a partly cloudy day in late April or early May, my wife and I were in Cambelltown PA visiting her brother, his wife, and their young son. After awhile I decided to step outside to have a smoke. Since none of them did, I went alone. I wasn't out more than a minute when I herd a sound toward the south. It sounded like a blow torch being ignited. (There was a pop and then a wooshing noise.) I looked up in the sky in that direction and saw a dark object with a blue-green fan of flame behind it comming toward me but a little to the right. Initally,I thought, if this is a meteor than it was going to hit farely close and I hoped that it wasn't a big one because it looked like it could be. But then to my suprise it flamed out, banked left, leveled off and shone bright yellow as if it was reflecting sunlight. A solid ball of light with a starburst with no smoke or tail behind it. As it crossed the sky in a clearing where there were no clouds, It seemed to be moving slower than a meteor would have been, fading to black as it headed east. (I believe that it turned solid black because I was no longer looking at the side of it but rather the back of it that was faceing away from the soon to be setting sun.) It almost seemed to speed up just before it abruptly banked right to the SW and went behind a large group of clouds that streched into the horizion where I lost sight of it. I took a minute to gather my thoughts and comtemplate what I have just witnessed. I was expecting ridicule when I went inside to tell the others my story. Needless to say they didn't let me down. What it was, I dont know. Everyone that I tell looks at me like Im crazy, but i can't hold it in any longer. I had to tell those who may have some understanding and dont think Im crazy. I know what I saw!"],"Date of the Event":"04/25/2012 12:00 UTC","trends":["There have been no other sightings in Cambelltown","This sighting has never been favorited."],"Case Number":"41922","Log Number":"US-08212012-0013","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41922.html.txt","/var/www/straped/mufon/org/41922.html"],"Object Shape":"Fireball, Sphere, Unknown","Weather Factors":"Unknown","Summary":"Burned twards me blue-green through atmosphere, banked left and leveled off reflecting sunlight, turned solid black , sped up banked right and dissapeared into clouds.","Date Submitted":"08/21/2012 10:41 UTC","Sighting Duration":"00:00:09","Disposition":"Unresolved","Tags":"City","City":"Cambelltown","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=41.208022,+-77.192185(41922)&iwloc=A&hl=en\"> mufon case (41922) map </A>","Longitude":"-77.192185","Object Features":"Unknown"}