{"Longitude":"-76.161864","files":["/var/www/straped/mufon/html2text/41925.html.txt","/var/www/straped/mufon/org/41925.html"],"Case Number":"41925","Disposition":"Unresolved","Log Number":"CA-08222012-0002","Sighting Duration":"00:08:30","Latitude":"44.330618","divs":["Sighting DetailsMyself and two friends were walking away from the boat line in gananoque one summer evening, up a little street beside the GOLDEN APPLE RESTAURANT. We had just directed a few out-of-towner's to the waterfront during the celebration of \"pirate days\". i was walking with a bicycle and i felt a strong energetic presence coming from ahead of us, but i couldn't see anything. i noticed a light in the sky, snd turned my eyes skyward just in time to see something disappearing behund the tree line. i knew as soon as i saw it that it was a UFO, it made absolutely no noise and moved in one straight path across the sky MAYBE 100 feet above us. i hopped on my bike and told my friends to keep up, we turned the corner and headed east down king street. we watched this shape drifting across the sky slowly and silently, followed it for about 3-4 blocks more, and lost it over a few trees just before bay road. immediately after we lost sight of the object, a police cruiser rounded the corner beside us to a stop sign. i'll never forget the night i chased a ufo and lost it.."],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.330618,+-76.161864(41925)&iwloc=A&hl=en\"> mufon case (41925) map </A>","City":"Gananoque","Region":"Ontario","Tags":"City","Date Submitted":"08/22/2012 01:11 UTC","Summary":"UFO Sighted after 1 am in gananoque","Object Shape":"Blimp, Cigar, Other, Unknown","Country":"Canada","Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change","Date of the Event":"07/18/2012 01:36 UTC","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Gananoque","There were no other sightings in Gananoque on or around July 18th 2012"]}