{"Object Flight Path":"Straight-line path","Date of the Event":"08/20/2012 03:00 UTC","Summary":"Bluish Green Boomerang over the coast of Dana Point, CA. Fuzzy glowing and moving West/NW","Sighting Duration":"Undisclosed","Latitude":"33.466911","Log Number":"US-08212012-0011","City":"Dana Point","files":["/var/www/straped/mufon/html2text/41920.html.txt","/var/www/straped/mufon/org/41920.html"],"Region":"California","Object Features":"Wings, Other","Case Number":"41920","Date Submitted":"08/21/2012 06:02 UTC","Longitude":"-117.702183","Object Shape":"Boomerang","Weather Factors":"Unknown","divs":["sighting detailson monday, august 20 (afternoon), dana point, ca. casually looking out my living room sliding windows, which face west, i observed a glowing boomerang shaped object moving across the sky for 5-10 seconds until it vanished. i had just been talking with my family as i noticed it. i said \"dude, look at that\" pointing out the window, and as i walked towards the window, it disappeared before i could discern what it was. the object was a squat boomerang shape, bluish green in color, and was moving towards the west\\nw over the pacific ocean. the sky was partly hazy and the temperature outside was cooler than it had been sunday. it moved along the \"ceiling\" or in and beyond the haze, 15-30 degrees up in the horizon and mile or two out from the coast. my view of the object was looking out my upstairs apartment living room window, so size, distance and altitude was hard to determine and will be approx. from my vantage point it looked large, almost the way a flood light reflects off the clouds at night (it wasn't past 3pm i believe). in fact i thought it was some sort of reflected light at first, but it's glowing and movement gave it a feeling of mass to me. it seemed to be in the haze rather than be reflected by it. the perspective of it's path made it seem huge, as if it was moving with the curvature of the earth before vanishing, if that makes sense. it reminded me of aurora borealis but with a shape and defined edges to it. the object was only visible for 5-10 seconds, but again, it seemed like it had a path out across the ocean. it was not losing altitude, but rather maintaining and even gaining. it's edges were soft but defined, glowing with the rest of it but almost seeming to \"wisp\" with it's movement in a way, like a trail. it was difficult to see if it was solid or only made of light. it's color was soft, bluish green, and seemed to fluctuate very slightly. that's the best that i can describe it. no noise was associated with it, i wouldn't have even seen it if i didn't look out the window. i am posting this to see if anyone else witnessed this and can tell me what it was, if they know? i have been thinking about it all night and day and feel i have to describe it to someone. i was the only one in my house who saw it. i have all kinds of theories, but i want facts if possible. i included a very simple drawing and a map showing the direction in which i think it was traveling. thank you, -w ps. i don't want to sound too crazy, but i've even guessed that it could be the afterburner glow from a certain hypersonic jet that was supposed to have \"crashed\" this weekend. i dunno..."],"Source":"MUFON","Country":"United States","trends":["There have been 18 other sightings in Dana Point","There were no other sightings in Dana Point on or around August 20th 2012"],"Disposition":"Unresolved","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.466911,+-117.702183(41920)&iwloc=A&hl=en\"> mufon case (41920) map </A>"}