{"map":"<A HREF = \"http://maps.google.com/maps?q=35.47508,+-97.509768(41934)&iwloc=A&hl=en\"> mufon case (41934) map </A>","files":["/var/www/straped/mufon/html2text/41934.html.txt","/var/www/straped/mufon/org/41934.html"],"Object Flight Path":"Stationary","Object Shape":"Disc, Egg","Country":"United States","Viewing Distance":"21-100 Feet","Object Features":"Window(s)","Case Number":"41934","Log Number":"US-08222012-0011","Tags":"City","Longitude":"-97.509768","Weather Factors":"Unknown","Latitude":"35.47508","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around August 7th 1989"],"Summary":"me and my dad were leaving cousins house, pulled up to hwy 193 and saw UFO. vehicle desencded to us and creatures approached us.","divs":["Sighting DetailsMe and my dad were leaving our cousins house at the port of Catoosa in Oklahoma. We had pulled up to the edge of the road(HWY 193), Thats when i noticed what looked like an egg shaped ,but also saucer shaped vehicle in the sky, hovering above the ground. It was making no noise, but was emitting a variety of orbs and beams of light. I knew immediatly that this was no helicopter or airplane. I was very frightened. But i could not look away. We never lost sight of the craft. After a few minutes , the craft approached our car and then there were four to five beings standing around our car. We were taken aboard their craft and i believe that we were implanted with some sort of device. I still to this day have the device in my arm. and would be willing to have it removed for research sake. THIS IS NOT A HOAX OR ATTEMPT TO GET \"15 MINUTES OF FAME\" These were very real occurances and would like very much to speak with MUFON about what to do, as i am plagued everyday about what happened to me and my father. Thank you for your time, Michael J Thomas 918-592-4925"],"Date of the Event":"08/07/1989 12:00 UTC","Date Submitted":"08/22/2012 02:11 UTC","City":"Oklahoma City","Region":"Oklahoma","Disposition":"Unresolved"}