{"files":["/var/www/straped/mufon/html2text/41931.html.txt","/var/www/straped/mufon/org/41931.html"],"Object Flight Path":"Stationary,Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsI saw this this last night!!! A thing flew past my house as my friend and I were walking outside to smoke! It came from the north. I live in eugene oregon and it flew right over river rd! At first we thought was a plane leaving the airport but then realized the airport isnorth west of my house by quite a ways. Then noticed all of these blinking lights that were off in the distance in all directions. east, west, north, south...I had a video on my phone BUT have been havng problems with the custom rom so flashed a new one. I hope I did the backup AFTER we saw them so can restore it. anyway, this was probably around 9-930 at night. My roommate gets home around 1100 and we help her bring stuff inside(we moved in not long ago) and went outside and right above our house was a large isosceles shaped triangle of three blinking lights and a smaller one to the norteast. they held steady for quite a while and if hadnt already saw what we did I never would have noticed it. There were still other faint blinking lights all over the sky but not as many as when the BIG one flew what seemed like right by us. I looked at the flight schedule for the airport and at the time we saw the bright light fly down river rd, no plane would have been in the sky anyway. Plus, there is no way that many flying aircrafts would be in the same airspace anyway!!! I always made fun of people, but I know what I saw. If I didnt back up that video, I will do a partition recovery!!!"],"Region":"Oregon","trends":["There have been 68 other sightings in Eugene","There was one other sighting in Eugene on or around August 21st 2012"],"Summary":"went outside to smoke. extremely low large craft of lights from the north I thought was plane until saw a bunch of small blinking lights all over the sky. Those were at high altitude. then saw a large triangle of lights directly overhead. smaller one no","Object Shape":"Oval, Triangle, Other","Disposition":"Unresolved","Log Number":"US-08222012-0008","Date of the Event":"08/21/2012 08:30 UTC","Date Submitted":"08/22/2012 09:20 UTC","City":"Eugene","Longitude":"-123.085604","Case Number":"41931","Country":"United States","Latitude":"44.056179","map":"<A HREF = \"http://maps.google.com/maps?q=44.056179,+-123.085604(41931)&iwloc=A&hl=en\"> mufon case (41931) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Tags":"City"}