{"Disposition":"Unresolved","Tags":"City","Country":"United States","Summary":"Flickering orange lights that faded out","Date of the Event":"08/21/2012 08:50 UTC","Date Submitted":"08/22/2012 12:26 UTC","Source":"MUFON","City":"Kenosha","Log Number":"US-08222012-0010","map":"<A HREF = \"http://maps.google.com/maps?q=42.593992,+-87.816095(41933)&iwloc=A&hl=en\"> mufon case (41933) map </A>","Weather Factors":"Unknown","Longitude":"-87.816095","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/41933.html.txt","/var/www/straped/mufon/org/41933.html"],"Latitude":"42.593992","trends":["There have been 15 other sightings in Kenosha","There were no other sightings in Kenosha on or around August 21st 2012"],"Object Flight Path":"Straight-line path","Object Features":"Unknown","Object Shape":"Unknown","Case Number":"41933","Region":"Wisconsin","divs":["Sighting DetailsAt approximately 8:50 PM on Tuesday August 21st I spotted one orange light that was slightly flickering moving in a Northwestern direction in a straight line. Object was maintaining level flight. I first believed object to be a Chinese lantern or a home made mini hot air balloon so I pulled over and checked the wind, the wind was very calm and the object was moving fairly quickly so my lantern and balloon theory didn't seem plausible as the object was moving in a straight line and maintaining a level flight and the lack of wind would minimize any horizontal movement from a lantern or balloon. After a few seconds of watching this object it began to dim and eventually the light went out, I was able to still see the object moving in the same direction with no lights before I lost sight of it, a few seconds after I lost sight of the first object another orange light came into my view that looked exactly the same as the first object. This object followed the exact same path as the first one and was also maintaining level flight, the light on this object also slowly dimmed and eventually went out I was also able to follow this object moving through airspace with no lights on for a few seconds before I lost sight of it. Both of these objects appeared to have an altitude of 1000FT and appeared to be just offshore of Lake Michigan. Neither objects displayed navigational or landing lights as required by all aircraft flying at night The day before on Monday August 20th I saw another object that looked exactly the same as the objects mentioned above but was in a different location. This object slowly ascended and slowly dimmed until it went out. At that time I dismissed this object as a likely lantern or home made mini hot air balloon because it had characteristics of such, but seeing the exact same type of objects the following day performing unlike a lantern or balloon makes me believe these objects deserve further looking into. -Nathan Tomisich Ex MUFON Investigator and State Director"]}