{"Object Flight Path":"Straight-line path,Path with directional change,Other","Sighting Duration":"Undisclosed","Log Number":"US-08222012-0013","Disposition":"Unresolved","Latitude":"34.056958","Object Shape":"Sphere","Source":"MUFON","Region":"Arizona","divs":["Sighting DetailsI am a trained amateur astronomer and avid sky watcher.I Went outside on my back porch at about 7:30 August 20th to check on monsoon cloud developement.The sun had set and the sky was darkening.I looked to the east and Noticed a bright bluish green light lazily moving up and down near storm clouds.It seemed to move rather like a roller coaster car,slowly up then a quicker descent(but not free fall).Sometimes it would move laterally a bit and then the up and down movement again.During these curvy dips sometimes it would dim or vanish before quickly brightening again.I interpreted it to be an interaction with the clouds but can not be certain of that.. After about 5 minutes a helicopter shows up (I can not say for certain it was connected to light.) The helicopter appeared to move toward the light which then seemed to quickly recede into the east and out of sight.The helecopter also continued to move in that direction until I could not see it. I did not have time to break out my telescope but did look thru a 10X pair of binoculars.The light had no apparent details and was ball shaped."],"Longitude":"-111.085701","Case Number":"41936","trends":[],"Weather Factors":"Unknown","Date of the Event":"08/20/2012 07:30 UTC","Tags":"City","City":"Undisclosed","Object Features":"None","Country":"United States","Date Submitted":"08/22/2012 02:41 UTC","Summary":"would move up and down, around and in and out of clouds. Green in color, could not have been a remote control plane.(To high) observed for approx 5 minutes before a helicopter showed up and seemed to move toward it.The light receded to east.","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/41936.html.txt","/var/www/straped/mufon/org/41936.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.056958,+-111.085701(41936)&iwloc=A&hl=en\"> mufon case (41936) map </A>"}