{"Date of the Event":"08/11/2012 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"41947","Object Flight Path":"Path with directional change","trends":["There have been 6 other sightings in Cañon City","There were no other sightings in Cañon City on or around August 11th 2012"],"Viewing Distance":"Unknown","Latitude":"38.447719","map":"<A HREF = \"http://maps.google.com/maps?q=38.447719,+-105.217827(41947)&iwloc=A&hl=en\"> mufon case (41947) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/41947.html.txt","/var/www/straped/mufon/org/41947.html"],"Longitude":"-105.217827","Region":"Colorado","Country":"United States","divs":["Sighting DetailsIm a Pilot, Commercial and instructor, over 5000 thousand hours, retired Dept of Justice Officer, former marine and a published author in quantum machanics. During a routine training flight at around midnight I had a student pilot and another Commercial pilot on board as I was providing instruction. The flight was conducted under part 91 FAR from 1v6 to kcos and a return path of kcos kpub 1v6. On the return portion of the flight between kpub and 1v6 at apprx. 15 dme from the pub vor at 8500ft decending to 1v6. Our heading was 290 and it appeared 20 degrees to the left of our coarse. We all saw a large bright light around four times larger than the brightest star and it wasn't moving. It was about twenty degrees above the horizon. Distance unknown however I had the impression it was well above 40 thousand feet at a distance of about 15 miles from our aircraft. Now this light was near a victor airway but this wasn't any aircraft Ive ever seen nor did my passangers. I know what an aircraft looks like and this wasn't an aircraft. Then this light moved! It was stationary then moved at an increadable rate to a heading of around 330 degrees, just a guess again because I don't know how far it was but based on impression again, well beyond the speed of sound. It slowed and made another turn to the west, almost stopping again. About ten seconds later now heading west it made a an approx. 30 degree climb and blasted off at an huge speed vanishing leaving a multi colored trail that was self illuminated. The Sun at 12am was on the opposite side of the earth so no contrails should be visable, again this wasn't a contrail, hard to explain more of a small contrail but very wide and although dime easy to see with the naked eye. Then we observed two very bright lights at the heading of 330, much brighter than the first. This time we had a reference, Pikes Peak stands at 14500ft at its peak. These two lights were slightly west of the peak and under the peak, I'd be accurate at saying these lights were at 10 thousand feet msl stationary or hovering west of the peak. I fly out of 1v6 all the time an never before seen these. The other pilots were also set back as well."],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Sphere","Log Number":"US-08222012-0022","Date Submitted":"08/22/2012 07:07 UTC","Object Features":"None","Tags":"City","City":"CaÃƒÂ±on City","Summary":"White light, four times as big as the largest star in the sky"}