{"Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/41945.html.txt","/var/www/straped/mufon/org/41945.html"],"Date of the Event":"03/20/2009 08:18 UTC","Log Number":"US-08222012-0020","Region":"California","Longitude":"-121.9484","City":"Concord","Summary":"Bright light flying over east Concord","Date Submitted":"08/22/2012 06:11 UTC","Source":"MUFON","divs":["Sighting DetailsI was on my front porch looking up at the sky and I noticed a very bright star toward the Southeast that I haven't seen before. I then realized that it was moving. Not fast but faster than the commercial airliners that fly in the area. It was flying Northeast toward the Travis AFB area. The object was bright white. I'm former Air Force and this thing was brighter than any landing lights I have ever seen. No strobe, wingtip, or formation lights. As it crossed the sky it slowly changed color from white to dull red and dissappeared out of my line of sight. This was not the ISS,The Space Shuttle or a satellite. Satellites are really hard to see here as only the brightest objects are visable due to all the city lights in this area. The ISS and Shuttle travel west to east in orbit. This object was going Northeast. About 30 sec after the object left my 12 o'clock position a commercial airliner flew over at a lower alt headed East. I put in a call to the Travis AFB information center and the person I talked to said they had nothing on radar and had no idea what I was talking about. I don't know what i saw but it was something I have never seen before or after."],"Disposition":"Unresolved","Viewing Distance":"Unknown","Latitude":"37.950812","Tags":"City","Object Flight Path":"Straight-line path","Object Shape":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.950812,+-121.9484(41945)&iwloc=A&hl=en\"> mufon case (41945) map </A>","trends":["There have been 20 other sightings in Concord","There was one other sighting in Concord on or around March 20th 2009"],"Case Number":"41945"}