{"divs":["sighting detailsmy wife and i had just left the grocery store near our neighborhood when she asked me \"what is that in the sky?\". i looked to my left from the passenger seat through the windshield towards the north. we both saw what at first appeared to me to be possibly some kind of flare. there was no trail of a flare going into the sky upward, and as i looked at a bit more i could not see any kind of parachute, etc. we turned left onto a residential street and had a clear view of whatever it was. it almost appeared to be moving slowly and just kind of floating in a downward motion. i am former military, and it almost reminded me of a flare, but as we were watching it the red orb\\fireball or whatever it was actually disappeared. not out of view into the clouds or anything, but just disappeared right where it had been. it looked to be in an area right over interstate 10 near john martin rd. most flares i have seen out on the range flicker a bit when they go out (and sometimes may even come back on for a short time) and have a smoke trail of some sort and a mechanism to keep it in the air longer (parachute for example), but this thing had none of that and just disappeared without a trace. it was a bit cloudy in the area, and there appeared to be some rain storms off to the east, but those appeared to be a ways off. i was in air defense in the military and worked at white sands missile range with a top secret security clearance, and i have never seen anything just disappear the way that did. the wind at the time was minimal, just a slight breeze where we were at. it was sunny other than the few sporadic rain cloud or two moving through the area. thats another thing. it did not disappear into a cloud, it was out in the open when it disappeared."],"Weather Factors":"Unknown","Case Number":"41949","Region":"Texas","files":["/var/www/straped/mufon/html2text/41949.html.txt","/var/www/straped/mufon/org/41949.html"],"Country":"United States","Sighting Duration":"00:01:00","Source":"MUFON","Object Features":"Unknown","Object Shape":"Fireball, Sphere","Date Submitted":"08/22/2012 07:22 UTC","Longitude":"-94.967677","Latitude":"29.739595","Object Flight Path":"Other","Log Number":"US-08222012-0024","trends":["There have been 7 other sightings in Baytown","There were no other sightings in Baytown on or around August 22nd 2012"],"Date of the Event":"08/22/2012 05:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.739595,+-94.967677(41949)&iwloc=A&hl=en\"> mufon case (41949) map </A>","City":"Baytown","Disposition":"Unresolved","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Summary":"Red Ball floating over Hwy I-10 in Baytown Texas"}