{"Region":"Colorado","Disposition":"Unresolved","Object Features":"Unknown","divs":["Sighting DetailsI'm an amateur astronomer and was out with my wife observing. We have a 16 inch dobsonian telescope and have been using it for several years. This is the story that occured that night. Well sometime just before midnight my wife noted that there was a \"car\" coming down the hill. I looked over to the east and noticed a very bright seemingly single source light near the top of the mountain. It then appeared to be getting closer, always very near the ground. The light was about the apparent size of a penny and appeared \"yellowish.\" It did not project a beam of light, like aircraft landing gear, it was more of a \"glow.\" But as I watched it the brightness would intensify and then go back to the \"glow.\" It then displayed erratic flight pattern in both horizontal and vertical motion close to the ground. My wife and I just looked at it for about 30 seconds trying to understand what we were looking at. I then thought to use my 16 inch scope to check it out. My wife told me not too because it was way too bright. But I had to try. I then disengaged both clutches on the scope and actually got the object is focus, it also at this time appeared to be getting further away. To my astonishment when I looked into the eye piece I did not see a single light but 4-5 clearly distinguished round yellowish steady lights evenly spaced in roughly a large \"smile\" formation. I could not believe what I was seeing! I told my wife to look and she only saw a single red light. Then it was gone. I have since made some calculations about the actual size of the object. Because I know far away the mountain range was and the apparent 1 degree size, I came up with a size around 640 feet."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.78334,+-105.165554(41946)&iwloc=A&hl=en\"> mufon case (41946) map </A>","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Source":"MUFON","Summary":"Amateur astronomer witnesses “car” coming up and over hill.","trends":["There have been no other sightings in Gardner","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Latitude":"37.78334","Viewing Distance":"Over One Mile","Country":"United States","Case Number":"41946","Tags":"City","Log Number":"US-08222012-0021","Date Submitted":"08/22/2012 06:37 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/41946.html.txt","/var/www/straped/mufon/org/41946.html"],"Longitude":"-105.165554","Object Shape":"Unknown","Date of the Event":"08/19/2012 11:40 UTC","City":"Gardner"}