{"Date Submitted":"08/23/2012 01:15 UTC","Object Features":"None","Log Number":"US-08232012-0004","Sighting Duration":"00:00:06","Latitude":"40.137212","Summary":"UFO darted across sky, stopped on a dime, then took off at 90degrees away from me","Region":"Pennsylvania","trends":["There have been 3 other sightings in Oaks","There were no other sightings in Oaks on or around August 17th 2011"],"divs":["sighting detailslast year i was driving to work early in the morning. i was going in an hour later than usual on this day. the sun was coming up i would say it was sometime last summer, i'm definately going to find out the day now. i'm writing this because i've been telling this story for a year now and someone just asked me if i had googled my story to see if other people saw what i did, and they did.!!! i'm freaking out right now, so back to my story i was driving on 422 in pennsylvania heading towards conshohocken. as i was approaching the \"oaks\" exit, the sky opens up right there. i noticed a white ball of light in the corner of my eye. i looked over and this thing darted across the sky all the way to my left, so fast, like a shooting stars speed, maybe even faster. the weird thing is, it stopped on a dime. dead stop. hovered for about a second, maybe two, and then shot off towards philly. it was moving so quick it was out of sight before i knew what the hell was even going on. but i definately saw it, when i got to work i told everyone and have been obsessed w\\ this phenomenon ever since. like i said, it's been reported over oaks pa before i just wanted to share and say...i saw it too !!!! i thought i was alone but apparently not !!!"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.137212,+-75.457482(41958)&iwloc=A&hl=en\"> mufon case (41958) map </A>","Date of the Event":"08/17/2011 12:00 UTC","Object Flight Path":"Path with directional change","City":"Oaks","Tags":"City","files":["/var/www/straped/mufon/html2text/41958.html.txt","/var/www/straped/mufon/org/41958.html"],"Source":"MUFON","Longitude":"-75.457482","Case Number":"41958","Weather Factors":"Unknown","Object Shape":"Fireball","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Country":"United States"}