{"Region":"Pennsylvania","trends":["There have been 3 other sightings in Brookville","There were no other sightings in Brookville on or around July 28th 2012"],"Date Submitted":"08/22/2012 08:50 UTC","Latitude":"41.175117","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.175117,+-79.074805(41951)&iwloc=A&hl=en\"> mufon case (41951) map </A>","Object Shape":"Egg","Disposition":"Unresolved","divs":["Sighting DetailsArrived home from a day trip with family at 8:30 pm to let family dogs outside. It was shortly before dusk. The rest of family left to go pick up Pizza for dinner. There were scattered clouds and blue sky after a day of off and on rain and storms. While standing on back patio waiting for dogs, something made me look up. When I looked over our neighbors roof between two trees I saw an odd object. It was egg shaped with what I first thought was fire on the bottom. The rest of surface was dark grey, not smooth but I could not see any other detail. I thought it may be a hot air ballon but there was no basket, no ropes and it was too wide at the bottom where I saw the yellow orange color. That was when I noticed it was also very quiet. There was no noise from the object or even the surroundings (i.e. No car traffic noises, or hot air balloon noises from when the air is heated). I ran in house to get digital camera. Attempted two photos but camera had no memory card. NO PICTURE. Video camera in car with rest of family so I just stood there and watched. I wasn't scared. After trying to take picture the object went from hovering to a jerking movement. The top jerked forward then the bottom followed so the object was aligned again. It did this movement twice. It then moved in a steady southwesterly direction possibly descending. I lost site as it moved behind one of the trees. I looked and no one else in the neighborhood was outside at the time. No one was home that I could tell. The dogs never noticed."],"files":["/var/www/straped/mufon/html2text/41951.html.txt","/var/www/straped/mufon/org/41951.html"],"Object Flight Path":"Hovering then path","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","City":"Brookville","Summary":"just before dusk viewed egg shaped object from back patio in sky while looking over neighbors roof and between two trees, no sound,it moved in a jerking wobble then a steady path lost sight because of trees","Date of the Event":"07/28/2012 08:30 UTC","Tags":"City","Case Number":"41951","Log Number":"US-08222012-0027","Longitude":"-79.074805","Country":"United States","Viewing Distance":"Unknown"}