{"divs":["Sighting DetailsMontana, Paradise Valley, Sunday morning, August 19. Driving Rt 89 toward the north entrance of Yellowstone, I wanted to get to the Lamar Valley for sunrise to perhaps see grizzlies as well as buffalo. It was probably between 5:30 and 6:00 a.m. and I could discern shapes of mountains to the east of 89. I was aware of the dangers of Montana driving, especially in the dark: the drop offs rather than road shoulders, large animals, yee-ha 70+ mph pickup truck passings, unexpected grip the wheel canyon running, and I was a little smug about seeing a blue pulsing light in the distance on an apparent arc to the left thinking that I'd come upon a kid in a pickup truck stopped by a cop, not that I had seen any trucks passing me that morning. The pulsing blue light appeared at road level, perhaps a mile ahead and very slightly down a grade. There was some vegetation that I had to bypass to arrive at the anticipated scene, but very suddenly I saw this staccato streak of blue to my left about 30 or 40 feet off the ground and I thought \"oh, this is a plane taking off!\" But then the blue light was behind me in my side view mirror, not having risen more than 50 feet or so, and it just stalled there and I lost sight of it as I rounded the bend. There was no cop car in front of me. I had no idea of what I just saw. It was too quick to be logical. If I had mistaken a flashing light on a plane as a cop car, the speed at which we passed was nonsensically fast. The light in front of me was suddenly in back of me and I have no idea of how that happened in what seemed an instant. I related this experience to a pilot friend who said that planes are lit white, green and red, not blue. I can't explain this, but perhaps somebody in the region can. A plasma ball on a power line? I can say when I first saw the light it seemed to have elements of black and white, like a dark core. It was not a pure blue at first observation. The staccato streak by, however, seemed neon blue."],"Country":"United States","Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Summary":"Assumed blue police strobe in distance suddenly streaks by and is seen in driver side mirror","Log Number":"US-08232012-0003","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"08/19/2012 05:30 UTC","files":["/var/www/straped/mufon/html2text/41957.html.txt","/var/www/straped/mufon/org/41957.html"],"Object Flight Path":"Stationary,Straight-line path,Path then hovering","trends":["There have been 3 other sightings in Livingston","There were no other sightings in Livingston on or around August 19th 2012"],"City":"Livingston","Date Submitted":"08/23/2012 12:58 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Case Number":"41957","Latitude":"45.614916","map":"<A HREF = \"http://maps.google.com/maps?q=45.614916,+-110.578525(41957)&iwloc=A&hl=en\"> mufon case (41957) map </A>","Region":"Montana","Object Shape":"Sphere","Longitude":"-110.578525"}