{"Object Features":"Unknown","Date Submitted":"08/22/2012 11:05 UTC","Latitude":"34.064474","Summary":"We heard a noise, then went outside... and then it happened","Log Number":"CA-08222012-0030","trends":["There have been 3 other sightings in Ontario","There were no other sightings in Ontario on or around August 22nd 2012"],"Country":"United States","Object Shape":"Circle, Disc, Flash, Oval, Star-like","Object Flight Path":"Hovering then path","Longitude":"-117.647098","Viewing Distance":"Over One Mile","Source":"MUFON","Region":"Ontario","Case Number":"41954","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.064474,+-117.647098(41954)&iwloc=A&hl=en\"> mufon case (41954) map </A>","files":["/var/www/straped/mufon/html2text/41954.html.txt","/var/www/straped/mufon/org/41954.html"],"Weather Factors":"Unknown","Date of the Event":"08/22/2012 09:45 UTC","Disposition":"Unresolved","divs":["sighting detailsmy boyfriend heard a loud smash and a scream at around 9:45 est, almost like someone broke something or there was a car accident, so we went outside on our balcony to see what had happened. we kept looking around our building and saw nothing (we have a front street view with no road behind us, and he says it sounded like it happened right outside our building. after not being able to see anything, i looked up into the distance, a typical thing i do (i have a pretty good view from my balcony) and my boyfriend noticed it first. \"what is that?\" he said. it was this beaming, white\\orange light in the sky, just ne of my place. it was weird because it wasn't moving at all. i had both stars in the sky, and airplanes passing by to compare it to, but this was unlike something i've never seen before. i'm pretty into stars, constellations and planets, and i can confirm it was not a siting of a planet or anything like that. after about 30\\45 seconds, the object started to move, at first going somewhat up and across into the sky, but then eventually disappearing, not like going across the sky like an airplane, but almost like leaving the atmosphere. i quickly called my mom freaking out to see if i was going crazy, and just as i got on the phone with her, maybe 45-70 seconds after it disappeared, it came back, this time a bit more west of where it was, and you could tell it was further away from where i had originally saw it. it stayed in the sky for about 15 seconds, and then again disappeared up into the sky. i just remember staring at the light both times, and my head feeling cloudy, and my eyes feeling tight. it were almost as if i wasn't able to focus on it properly. after the events i was fine."],"City":"Ontario"}