{"City":"Salem","Log Number":"US-08232012-0013","Source":"MUFON","Summary":"Abduction. History of myself, now my child.","Country":"United States","Object Features":"Unknown","Latitude":"38.693283","Disposition":"Unresolved","Tags":"City","trends":["There have been 5 other sightings in Salem","There were no other sightings in Salem on or around September 15th 2008"],"Object Shape":"Unknown","Longitude":"-86.12643","Case Number":"41968","map":"<A HREF = \"http://maps.google.com/maps?q=38.693283,+-86.12643(41968)&iwloc=A&hl=en\"> mufon case (41968) map </A>","Region":"Indiana","files":["/var/www/straped/mufon/html2text/41968.html.txt","/var/www/straped/mufon/org/41968.html"],"Sighting Duration":"01:00:00","Object Flight Path":"N/A","Date of the Event":"09/15/2008 12:00 UTC","Date Submitted":"08/23/2012 05:04 UTC","Viewing Distance":"N/A","Weather Factors":"Unknown","divs":["Sighting Details*Important back story* I myself believe, I was abducted several times. Most noticeably were almost exclusively here In the state of Indiana. These occurred at the country address above. This being said, I have not let my child watch anything on aliens. I know for a fact I have never either shared my experience with her, nor has she ever watched movies containing anything about abduction. That being said, I'll continue with the report. I was sitting in the car talking with my daughter today. We had just picked her up from school. I was joking with her and told her that I was going to give her away to the aliens. Immediately she because distraught, more so then I thought she would, and I told her that I was just kidding, that I would never do that. I told her she didn't even know what an alien was anyways. She then told me yes I do daddy. I asked her how, she said I had a dream about them. I asked her when, she says that she now has a dream about them a lot. I asked her when these started, she told me that It started when she was 2 or 3, Her response was actually \"A long time ago.\" I then asked her, where it was, \"She said in the old house\" To clarify I asked specifically if it were the yellow house. The same that my own experiences were from. \"Her response was a simple yes\". I asked her what had happened at this point. Her words were approximately as such \"They do stuff to my head, and it hurt. And then they make me little again.\" Not so sure about that last bit, but again she is only 5. So at this point slightly perturbed, I asked her what they looked like. She said first \"They were green like (My sons name* favorite color. I said honey what did there heads look like, she said \"They were big and oval.\" I simply said \"What about the eyes honey\" she responded with \"They were big\". At that point I changed the subject, took her mind off it and told her not to worry about it. This was very disturbing to me considering the past events at the same location and how young and naive she is. At that time I started to seek professional help as discretely as possible."]}