{"Object Shape":"Circle, Oval, Sphere","Tags":"City","Date Submitted":"08/23/2012 01:12 UTC","files":["/var/www/straped/mufon/html2text/41963.html.txt","/var/www/straped/mufon/org/41963.html"],"Weather Factors":"Unknown","Case Number":"41963","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.604843,+-82.181642(41963)&iwloc=A&hl=en\"> mufon case (41963) map </A>","Country":"United States","Object Features":"Unknown","Source":"MUFON","Log Number":"US-08232012-0008","trends":["There have been 5 other sightings in Bristol","There was one other sighting in Bristol on or around August 22nd 2012"],"Longitude":"-82.181642","Latitude":"36.604843","Disposition":"Unresolved","Date of the Event":"08/22/2012 11:00 UTC","Viewing Distance":"Over One Mile","Object Flight Path":"Path then hovering","Region":"Virginia","divs":["Sighting DetailsOn Wednesday night (8-22-12) I went out on my porch to smoke a cigarette. I sat down on the flagstone at the foot of my steps and watched the stars as I usually do. I noticed what looked a star, but I saw that it was extremely bright, brighter than the north star. I thought this was unusual but did not put much stock into it. As I am sitting there, I notice this thing is moving only very slowly almost as if it is hovering. Occasionally it would move a much greater distance at a much greater rate of speed. At this time my curiosity was already peaked because I was hearing a plane but could not find it at first. Finally far off to the right of the object I see the plane in the sky. It was when I watched the plane I noticed a second light. This object appearing to be an orb or glowing ball of light almost a dull yellow color. The object was adjacent to the plane and coming my way. It was slightly cloudy that night and I watched the object fly right into the cloud. I waited patiently waited scanning the sky while checking up on the first object that I had seen which was behaving the same as I previously described. After a minute or so the object emerged from the other side. The object continued on its path for another 30 seconds or so (also moving at a slow pace) until it made a 90 degree turn which was very strange. At this point it did not travel much further before ascending. I knew it was ascending because the object kept getting smaller but was no longer traveling. When it reached its peak this object turn a crimson red color (almost as if it was cloaking itself to look like a star). The object sat in the air for the longest time. After witnessing this, I called for someone that was in the house to come out and look at the object for a second opinion in which the response I got was \"That is a star!\" I was absolutely appalled. Now I have children so I went in to check on them and vowed I would come back out in half an hour. After doing so I returned back out to make a second observation. Keep in mind that I am expecting to return the objects are in their rightful place and I am just crazy. However, upon returning both objects were gone! The most obvious being the first object observed. I told myself I would not report this but this is something I feel I should share. I made the decision to share after listening to Inception Radio and there was a report made the day before my observation about 1 mile away (they reported west state street) from where I made my observation. (Also, if you look on YouTube for the rainbow UFOs in Canada this will give you an idea of the first object I observed) I should also note that even though this is my first report, it is not the first time I have seen the explainable. When I was young I would watch orbs of light hover all over the sky which occurred for several weeks then were never seen again despite me looking every night. Also, I saw a report on MUFON that there was a report at twin city drive in off of the parkway in Bristol TN. In their report an object come over the tree line across the street. When I was in high school myself and a friend went out to watch a movie at the same location and arrived early (still light out). We were sitting on the hood of the car when an upright triangle with lights at each point hovered up from the tree line hovered quickly and silently to the tree line back and to the right of the tree line behind the drive in and descended. That was the most incredible sighting I ever had the craft was only a couple hundred feet in the air. It was not ANY know craft. Before this event I had no interest and never believed in such things."],"City":"Bristol","Summary":"Star-Like (rainbow flashing) UFOs in the sky"}