{"City":"Izmir","Case Number":"41967","Viewing Distance":"Over One Mile","Date Submitted":"08/23/2012 04:07 UTC","Date of the Event":"08/22/2012 09:00 UTC","Longitude":"27.13434","divs":["sighting detailsthe case was observed in city izmir, turkey on 22\\august\\2012. around 21:00 pm i was resting in my balcony while watching sea in front of me. suddenly i noticed a star-like object which blinking red. i thought that it was a scout airplane, since we've got military airfield in the near proximity. then i saw two more of them around, but still i didn't care about it until i got aware off the less colourful red star-like objects around them almost 60 in number. they carelessly moved in flock and guided by three pioneering them. there was no science-fiction thing happened, but the amazing thing about them was they were seen by careful naked eye and they're like sheep herd strolling through the sky in large number which shocked me with my jaw drop down. they didn't disappeared suddenly but i lost sight of them since they went far away on the horizon. one more thing noticalbe, this is not the first time i witnessed such event, at the time 17\\august\\1999 in izmit, turkey we as a family witnessed the same sort of the flock and at that night the big earthquake happened in izmit. 150 thousand people lost their lives. you can search on web to see the details. hope information above shed light on your research, regards,"],"Log Number":"TR-08232012-0011","Sighting Duration":"00:30:00","Region":"Izmir","Summary":"More than 60 star-like red objects flying in all together, only three of them flashing.","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/41967.html.txt","/var/www/straped/mufon/org/41967.html"],"Object Features":"None","Country":"Turkey","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.42134,+27.13434(41967)&iwloc=A&hl=en\"> mufon case (41967) map </A>","Tags":"City","Object Flight Path":"Hovering then path","trends":["There have been 3 other sightings in Izmir","There were no other sightings in Izmir on or around August 22nd 2012"],"Latitude":"38.42134","Weather Factors":"Unknown","Source":"MUFON"}