{"Object Shape":"Sphere, Star-like","Region":"Illinois","divs":["Sighting Details I have been seeing this starlike sphere for sometime now but just havent reported it all the time. Its to the point now that I know it will be out there, like Im drawn to go outside, and there it is. Yes, I to think this is strange, but something even stranger happened that Im more concerened about. To everyone who reads this let me say, Im not a nut case. Ive been observing objects in the sky for some years now, but now I think I have started something that I thought to be inocent by flashing these objects with my flashlight to see if it would communicate some how by flashing back, or coming closer. Well it did and it has been. What concerns me the most now is that I believe they have come into my home. Two nights ago I was in the bed for the evening with my husband sound asleep, I woke up and saw a ball of light (white) to the right of the bed about 3ft off the floor, and at the foot of the bed there were 3 forms-beings, 2 of them were about 3ft tall, and the other one was about 4ft tall and was standing behind one of the shorter ones, it was dark in the bedroom so I could not make out any features only thier outline. I did not feel scared, I watched them just standing there and then the next thing I know its mourning and time for me to get up. I have my cup of coffee, then go and get dressed, thats when I notice this clear dried stuff around and in my belly button, it freaked me out!, I grabbed a washcloth and start wipeing it off, Im freaking out that something is badly wrong here, as Im cleaning the inside of my bellybutton I notice what seems to be a puncture mark of some sort, now Im really freaked. The only thing I can say is that I dont know how I got it, it wasnt there when I went to bed, and it didnt hurt, if it wasnt for the clear dried up stuff I wouldnt have even noticed it. I said something to my husband about everything, his response was, well what can you do about it. Nothing. Well Im here to say, there is something out there and they are coming into our homes. So, what can we do about it?"],"Case Number":"41974","trends":["There have been 14 other sightings in Decatur","There was one other sighting in Decatur on or around August 23rd 2012"],"Object Features":"Unknown","Source":"MUFON","Date Submitted":"08/23/2012 11:18 UTC","Latitude":"39.798656","Summary":"Bright white - pulsating - starlike sphere","map":"<A HREF = \"http://maps.google.com/maps?q=39.798656,+-88.928334(41974)&iwloc=A&hl=en\"> mufon case (41974) map </A>","Log Number":"US-08232012-0018","Date of the Event":"08/23/2012 08:42 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/41974.html.txt","/var/www/straped/mufon/org/41974.html"],"Disposition":"Unresolved","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-88.928334","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Straight-line path","City":"Decatur"}