{"divs":["Sighting DetailsWatching from the backyard facing south, witnessed what looked like a helicopter. Red and green lights flashing. Stopped and hovered for a moment or two, then proceeded north towards Cleveland, Ohio. Flew directly above me, saw what appeared to be cigar shaped vehicle. However, this seemed to have 2 white lights extending from the sides, like an airplane. With no visible attachments. No sounds of helicopter, or airplane, no sounds at all. Watched vehicle fly north, then turn right to a position and stayed there for hours. Just east of this position was a very very bright white light in the sky. Not a planet, not a star, but a large circular shaped light hovering in one spot. Just south east of this very bright light was another vehicle with the red and green lights flashing. Watched this from approximately 11pm till 3:15am. Turning to go back in the house, I saw another red green lighted vehicle come from the same direction as the first (from the south). This traveled north and was not able to view it when it was behind the trees."],"Source":"MUFON","Object Features":"Other","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=41.322534,+-81.723224(41978)&iwloc=A&hl=en\"> mufon case (41978) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/41978.html.txt","/var/www/straped/mufon/org/41978.html"],"Date Submitted":"08/24/2012 01:18 UTC","City":"North Royalton","Date of the Event":"08/23/2012 11:00 UTC","Latitude":"41.322534","Sighting Duration":"Undisclosed","Region":"Ohio","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path,Straight-line path","trends":["There have been 10 other sightings in North Royalton","There was one other sighting in North Royalton on or around August 23rd 2012"],"Longitude":"-81.723224","Summary":"Flashing lights hovering high above the ground","Log Number":"US-08242012-0001","Case Number":"41978"}