{"Country":"United States","Summary":"Sighting of craft with unusual flight pattern and low noise","Disposition":"Unresolved","Case Number":"41988","Longitude":"-116.667175","Object Features":"Unknown","Sighting Duration":"Undisclosed","Latitude":"33.46229","files":["/var/www/straped/mufon/html2text/41988.html.txt","/var/www/straped/mufon/org/41988.html"],"divs":["Sighting DetailsI suspect this was probably a sighting of a 'stealth' type military aircraft, but thought I would pass it on to you anyway. This is the fourth time I have observed the flight of the same or a similar aircraft in the past two weeks. I am quite familiar with normal jet aircraft behavior, having lived near airports, and having spent a fair amount of time over the years star gazing. I have seen and heard many conventional aircraft over the years, and am quite familiar with their behaviors. I live along the flightpath of aircraft (fixed wing and helicopters) flying to and from Miramar Navy Base or Camp Pendleton, and am familiar with their behaviors and sounds. We also experience frequent overflights by commercial aircraft at various altitudes. The behavior of this craft did not resemble any of them. For what it is worth, I extended the flight path of the craft to the north, and it would go very close to the Groom Lake, NV area. These sightings have all occurred about around 10:00 - 11:00 PM PDST. Might wife and I like to sit outside, talk and stargaze prior to going to bed. Each time it has been travelling from north to south from inland towards the Pacific Ocean. The first three times I saw it I believe it was travelling at about the normal cruising altitude of a commercial aircraft based on the intensity of its lights. What was different about it, and what caught my attention, was that it was clearly travelling at a very high rate of speed, much faster than a commercial aircraft. I am not an aeronautical expert, but I would guess it was travelling at least twice, and perhaps three times as fast, as a commercial jet. The place I heard its sound in the sky was much further behind it than it has been for any other aircraft I have observed during the day or at night. However, the sound was much fainter than than any aircraft I have ever heard (regardless of the altitude. It was more of a whish than a roar, and was not audible during the entire time I observed it. Last night's sighting was different in several respects. My wife was sitting in a place where she could not see the craft during the previous three sightings but this time she observed and confirmed most of what I saw. The craft was clearly flying at a much lower altitude based on the intensity of its lights. However, the sound it made followed as far behind it as before, and was if anything fainter than on the previous occasions, not louder as one would expect at a lower altitude. When it had covered most of the sky from north to south it headed into what appeared to be a banking maneuver to the east that continued around to the west and then east again. It was at this time that I noticed that the lights appeared to be along the wings rather than the nose as they are on many commercial aircraft. The position of the lights would seem to indicate the wings were quite long and triangular, though I could not really tell. This is where things get a little strange(r) and what prompted me to report this sighting to you. The craft appeared to dip below the horizon and disappear and I assumed I would not see it again. However, just a few seconds later it reappeared at a location significantly further west than where I had seen it disappear, and well above the horizon. If I had held a ruler out at arms length, I would say it reappeared at least nine inches further to the west from where it disappeared, and about three inches above the horizon. I have no way of knowing how accurate this is, but if I were forced to estimate its distance from me I would say it was between 10 and 20 miles. It then continued on its previous path to the south and disappeared for good. Please contact me if you would like more details, and also please put me in contact with any UFO or stealth aircraft tracking groups in Southern California who might have observed a similar craft or be interested in my report. Thank you."],"City":"Anza","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.46229,+-116.667175(41988)&iwloc=A&hl=en\"> mufon case (41988) map </A>","Source":"MUFON","Log Number":"US-08242012-0011","Viewing Distance":"Over One Mile","trends":["There have been 2 other sightings in Anza","There were no other sightings in Anza on or around August 23rd 2012"],"Date Submitted":"08/24/2012 03:04 UTC","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Object Shape":"Unknown","Tags":"City","Date of the Event":"08/23/2012 10:00 UTC"}