{"trends":[],"Country":"United States","Date of the Event":"08/20/2012 09:40 UTC","Object Features":"Other","Longitude":"-94.6777","Disposition":"Unresolved","City":"Undisclosed","Object Shape":"Sphere","Log Number":"US-08242012-0008","Sighting Duration":"Undisclosed","Region":"Minnesota","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/41985.html.txt","/var/www/straped/mufon/org/41985.html"],"divs":["Sighting DetailsSeen your article on your website about the Illinois ufo you sighted and took a picture of after I seen something and typed into google: aircraft with only a circular white light on bottom. After reading your article I realized how similar our sightings were. You saw it 2 days ago in Illinois and I seen it tonight at 9:40pm, 10 minutes after the time you saw yours, and it was traveling mainly East but slightly South towards the local airport. It was at a high altitude and a lot bigger than the aircraft going in and out of the airport. I could compare the two because about 10 minutes after I seen the ufo I saw an airplane at a lower altitude and it was a lot smaller than the ufo. I couldn't make out the shape but I could somewhat make out a tin-silver color of it through the very bright circular white light on the bottom of it. I would say the white light was medium size compared to the large ufo it was attached to. I went downstairs to show it to somebody else but when I looked out the window I couldn't see it anymore and assumed it was because of the trees(which wouldn't be blocking it anyway). Went back upstairs and continued to look for it and it was officially gone. It was not a star that my eyes were playing a trick on me with because I could really focus on them now and they were small in comparison. Just thought I'd let you know because I live near the Minneapolis airport and you said you saw yours in Illinois, just south of me. I just wish I would have continued watching it and seen where it had gone and any maneuvering it used."],"Object Flight Path":"Straight-line path","Latitude":"46.736293","Case Number":"41985","Summary":"UFO near MSP Airport","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.736293,+-94.6777(41985)&iwloc=A&hl=en\"> mufon case (41985) map </A>","Date Submitted":"08/24/2012 12:47 UTC","Tags":"City","Source":"MUFON"}