{"files":["/var/www/straped/mufon/html2text/41987.html.txt","/var/www/straped/mufon/org/41987.html"],"Latitude":"40.899662","trends":["There have been 3 other sightings in Northumberland","There were no other sightings in Northumberland on or around August 23rd 2012"],"Tags":"City","Sighting Duration":"Undisclosed","Case Number":"41987","City":"Northumberland","divs":["Sighting DetailsI was outside on my deck, grilling, between 10 and 1030 pm. The sky was very clear and I was star gazing. There were several planes in the sky at various times, all audible and easily identified. Then I saw a bright white \"orb\" ascend from behind the mountain. It was moving very slowly and the light was so bright and unwavering. My first thought was that a large aircraft with a strange light was flying very low, and I found it odd that I couldn't hear it. It moved in a straight line, ascending, until it was directly over my house. I still could not hear anything and it was so low in the sky that I find that to be quite impossible. By now I was watching it intently, waiting for a noise. It was an unwavering ball of bright white light, but every once in awhile it would shift into the shape of a boomerang, but never changed size, and didn't keep that shape long. It was almost like a hologram. As it coasted over my house, it began to shrink into a tiny red dot and then it was just gone. It went from the size of an M&M in the sky to nothing in less than 3 seconds. There were no clouds (the reason I was star gazing to begin with) it made no sound and it did not compare to any plane I've ever seen. This is not my first sighting or my first report to MUFON. I have seen many things that I have not reported because I feel that I may lose credibility if I report every 'little' thing that happens here. This, however, was incredible enough to share. There is something very strange happening in the mountains around Northumberland PA, and my hope is that other people are seeing it as well."],"Summary":"Bright white light moved slowly across sky, then shrunk into a red dot and was gone","Source":"MUFON","Disposition":"Unresolved","Date Submitted":"08/24/2012 02:37 UTC","Object Flight Path":"Straight-line path","Country":"United States","Longitude":"-76.791335","map":"<A HREF = \"http://maps.google.com/maps?q=40.899662,+-76.791335(41987)&iwloc=A&hl=en\"> mufon case (41987) map </A>","Object Shape":"Boomerang, Sphere","Date of the Event":"08/23/2012 12:00 UTC","Object Features":"Unknown","Log Number":"US-08242012-0010","Viewing Distance":"501 Feet - 1 Mile, Unknown","Region":"Pennsylvania","Weather Factors":"Unknown"}