{"Source":"MUFON","Log Number":"US-08242012-0016","Object Features":"Unknown","Longitude":"-95.171041","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change,Other","Latitude":"30.034771","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=30.034771,+-95.171041(41992)&iwloc=A&hl=en\"> mufon case (41992) map </A>","Object Shape":"Circle, Flash, Oval, Sphere, Star-like, Other, Unknown","Summary":"Single star like object that grows to basketball joined by 10+ independent moving orbs forming triangles moving very rapidly independently disappearing coming into view numbers random.","files":["/var/www/straped/mufon/html2text/41992.html.txt","/var/www/straped/mufon/org/41992.html"],"Case Number":"41992","divs":["sighting detailsi was sleeping, when my 16 yr old daughter woke me, urging me to go out to our 3rd floor balcony, now! i scrambled to my feet and we went out to our balcony, facing the east sky. she pointed to an area, exclaiming \"look, their mom! look.\". i look and see what appears to be a rather large bright star. i concluded it's just a star. she says, \"no mom, wait.\" i patiently watch and after a few minutes, the object just suddenly and quickly became larger. it went from a large bright dot to the size of a penny and appeared to be pulsating and bright for 30 seconds or so and became the small original dot. we continued watching. a few minutes later, it began becoming brighter and colors ( rainbow) of spiral arms of lights started pulsating for about 30 seconds. it continued this pattern for about 3 or times. all of sudden it appeared to be coming right at us! we ran inside! it was huge! after a couple of minutes we went back out. it was back to the same dot, so we took a seat on our patio funiture and continued to observe. after a few minutes it disappeared. we continue to watch and in another few minutes it appears, grows larger then begins moving at accelerated speed moving southeast and disappears. we continue to observe. in less than a minute, from the southeast it appears and is moving quickly to the east, behind it trailing from the southeast is 4 more objects following the first one in a unorganized pattern, the other 4 objects start moving independently in small circles all over the east southeast sky, disappearing and coming into view. they move toward the original still bright object hovering in the east sky. three form a triangle as they approach large original object still hovering. when they are next to each other (5 now), the original bright object grows and they are moving around each other. they all move southeast and 4 disappear. the original bright object is hovering. now suddenly, the other objects are appearing and moving rapidly all over the east\\southeast sky. they looked like orbs. this kept up for 5 minutes or so. then as the other objects were appearing randomly and independently, suddenly there 10 or so, moving rapidly and independently, all over our viewing horizon! up, down, left, right! they appeared and disappeared. the orginal one suddenly grew very bright and large still hovering while this was happening. suddenly, they about 6 other orbs formed two triangles (3 in each) joined in formation and began following the original bright object from southeast to east and they all hovered becoming brighter. the orginal object was always larger and brighter. the two triangles hovered around the original as it began growing bigger and brighter, then small again. then all (including orginal) of them began"],"Country":"United States","Viewing Distance":"Over One Mile","Date of the Event":"08/24/2012 05:15 UTC","Tags":"City","Weather Factors":"Unknown","Region":"Texas","City":"Kingwood","Date Submitted":"08/24/2012 07:01 UTC","trends":["There have been no other sightings in Kingwood","This sighting has never been favorited."]}