{"Country":"United States","files":["/var/www/straped/mufon/html2text/41991.html.txt","/var/www/straped/mufon/org/41991.html"],"Date Submitted":"08/24/2012 06:20 UTC","Case Number":"41991","Longitude":"-74.735151","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"08/16/2012 08:40 UTC","trends":["There have been no other sightings in Shamong","This sighting has never been favorited."],"Log Number":"US-08242012-0014","Summary":"TRAVELING N. ON RT 206 AT 8:40PM AUG 16 2012 4 IN OUR CAR SPOTTED THREE BRIGHT LIGHTS BANKING OVER 206 LOOKED LIGHT A PLANE WAS GOING TO LAND ON THE HWY. IT VEERED TO THE LEFT OF US AND CONTINUED TO FLY RIGHT PAST US AS I STOPPED ON THE ROADSIDE.","City":"Shamong","Object Features":"Unknown","Disposition":"Unresolved","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Region":"New Jersey","Latitude":"39.777578","divs":["Sighting DetailsON AUG 16 2012 MY WIFE ,DAUGHTER AND GRANDDAUGHTER WERE DRIVING NORTH ON RT206 IN SHAMONG TWP. NEAR THE ENTERENCE OF ATSION LAKE ,A NJ STATE PARK. WE WERE RETURNING HOME FROM OCEAN CITY NJ. AS WE APPROACHED THE AREA OF ATSION LAKE I SAW IN FRONT OF US THREE BRIGHT LIGHTS IN TRIANGULAR FORM. I FIRST THOUGHT IT WAS A PLANE THAT WAS TRYING TO LAND ON THE ROAD SURFACE. IT BANKED TOWARD THE HIGHWAY THEN TURNED TO MY LEFT TO AVOID THE ROAD AND CONTINUED TOWARD US ON MY LEFT JUST OFF THE HIGHWAY AT TREE TOP HEIGHT.IT WAS DOING ABOUT 40 TO 50 MPH.THE LIGHTS WERE SO INTENSE AS NOT TO BE ABLE TO SEE THE OBJECTS REAL SHAPE OR TO DISTINQUISH ANY MARKINGS.I PULLED TO THE SIDE OF THE ROAD TO GET A BETTER LOOK. THE TWO CARS IN FRONT OF US CONTINUED ON. THAT AREA HAS NO ROAD LIGHTS AND IT IS VERY DARK WITH NO LIGHTING. THERE WERE ABOUT 10 TO 15 CARS BEHIND US ABOUT A HALF MILE.THERE WERE NO AIRPORTS IN THE IMMEDIATE AREA TO HANDLE A PLANE OF THAT SIZE.I KEPT TRYING TO LOOK AT THE SHAPE OF THE CRAFT BUT THE 3 LIGHTS WERE SO BRIGHT AND POINTED DOWN TO THE EARTH I REALIZED THEY WERE NOT LANDING LIGHTS.THE LIGHTS WERE POINTED DOWN AS IT CAME AT US AS IT WENT BY AND ALSO AS IT WAS BEHIND US.WE ALSO NOTICED A RED BLINKING LIGHT NOT AS INTENCE AND SMALLER NEAR THE CENTER OF THE VEHICLE AS IT PASSED US.MY WIFE COMMENTED THAT IT WAS SILENT AND I CONCERED. IT MADE NO NOISE AT ALL.I WANTED TO PERSUE BUT IT HAD PASSED US AND WITH TRAFIC BEARING DOWN ON US I WOULD NOT HAVE HAD A CHANCE TO FOLLOW BEING IN THE FORREST WITH NO ROADS LIKE A TOWN TO DRIVE ON. WE DID NOT NOTICE ANYTHING BEING REPORTED IN LOCAL PAPERS AND I AM SURE PEOPLE DID SEE WHAT WE DID ESPECIALLY THERE WAS A WORK CREW ABOUT 30, 8 MILES BACK NEAR RT30 IN HAMMONTON. MY WIFE AND I OVER 50 YEARS AGO SAW A SIGHTING IN DELRAN NJ . IT WAS 4 RED LIGHTS THAT DID THINGS NO PLANE WE HAD AT THE TIME COULD DO. THEY MANOVERED IN THE SKY AND ONE HOVERED DOWN WHILE THE OTHER CRAFT STOOD STILL. WHEN THE SHIP CAME BACK TO THE OTHERS THEY SHOT OUT OF SIGHT IN A MILSECOND HEADING WEST. THIS SITTING WAS REPORTED IN CAMDEN NJ AND ALSO IN NEVADA SOME MINUTES LATER."],"Weather Factors":"Unknown","Tags":"City","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=39.777578,+-74.735151(41991)&iwloc=A&hl=en\"> mufon case (41991) map </A>"}