{"Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/42008.html.txt","/var/www/straped/mufon/org/42008.html"],"Case Number":"42008","divs":["Sighting DetailsOn the way back from an educational event, on Presque Isle State Park, a coworker mentioned an orange ball in the air. We were across the bay from the city of Erie, on the Park. We turned around and stopped in a parking lot to obeserve. There were four of us in the van. We all saw the object. I didnt observe it moving, but saw it stationary. The others said it was moving. Two of us were able to keep eyes on it as it simply disappered, and two of us noticed it was there, and a second later it was not there. At first I thought it was a satellite, but I didnt see it moving in a satellite like fashion. It was simply a large ( no scale to measure against ) orange orb. It was moving then to the North maybe slightly Northeast in relationship to the city of Erie, over the bay.I had it in sight up until I exited the vehicle and then looked up and it was gone. The others said they watched it and saw it disappear. It didnt blink as in aircraft lighting. We all thought it was really cool to be able to have our first \"ufo\" sighting. After all, we really didnt know what it was."],"trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around August 24th 2012"],"Object Flight Path":"Straight-line path","Log Number":"US-08252012-0010","Source":"MUFON","Longitude":"-80.080059","Latitude":"42.131274","Country":"United States","Date Submitted":"08/25/2012 02:46 UTC","Summary":"Orange Orb over Presque Isle bay","Disposition":"Unresolved","Date of the Event":"08/24/2012 09:45 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.131274,+-80.080059(42008)&iwloc=A&hl=en\"> mufon case (42008) map </A>","Region":"Pennsylvania","City":"Erie","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Tags":"City"}