{"files":["/var/www/straped/mufon/html2text/42017.html.txt","/var/www/straped/mufon/org/42017.html"],"City":"Hamilton Township","Tags":"City","Date of the Event":"08/24/2012 07:20 UTC","Case Number":"42017","Weather Factors":"Unknown","Date Submitted":"08/25/2012 09:06 UTC","Viewing Distance":"Unknown","Log Number":"US-08252012-0018","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.231111,+-74.675278(42017)&iwloc=A&hl=en\"> mufon case (42017) map </A>","Sighting Duration":"Undisclosed","divs":["sighting detailsi was coming out of charlie browns where i had just had dinner with my girlfriend, i looked up at the sky and saw a bunch of jet trails\\jet streams. not an uncommon site since we live close to maguire air force base in nj there are jets in the sky all the time. but what caught my attention was an object in the sky not leaving a jet trail followed by an object leaving a jet trail and the first object appeared to be moving faster than the follow object leaving the jet trail. i really know nothing about planes and jets but i thought, \"jet trail equals moving really fast\" so it surprised me to see the object not leaving a jet trail was the lead object and moving faster than the tail object which was leaving a jet trail. i assume these were just normal military exercises and i am just mistaken about \"a faster moving object should be the one leaving a jet trail\". i would appreciate any feed back from someone who knows about jets and jet trails\\jet streams. i tried to first take a video with my iphone but i wasn't able to pinch and zoom in video mode so i switched to camera mode, pinch and zoomed, took two pictures(one of each object) then switched back to video and took a video of the second object leaving a jet trail\\jet stream but the first object was already gone. (photos attached and video). any knowledge and feedback would be much appreciated. thanks, scott c."],"Country":"United States","Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Hamilton Township","There were no other sightings in Hamilton Township on or around August 24th 2012"],"Longitude":"-74.675278","Latitude":"40.231111","Source":"MUFON","Region":"New Jersey","Disposition":"Unresolved","Object Shape":"Other","Summary":"object flying in the sky followed/chased by second object leaving jet stream"}