{"trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around August 25th 2012"],"Disposition":"Unresolved","Latitude":"28.533665","map":"<A HREF = \"http://maps.google.com/maps?q=28.533665,+-81.310377(42018)&iwloc=A&hl=en\"> mufon case (42018) map </A>","Log Number":"US-08252012-0019","Sighting Duration":"00:07:00","Object Shape":"Sphere","divs":["Sighting DetailsAt around 8:30pm I went out to my car and noticed about 8 lights, 40 degrees viewing angle, in the sky. They were in a box formation, and traveling extremely steady and slowly. They were SW from my grandmother's house near downtown Orlando. I couldn't make out how far it was, but I was sure it was nothing I've seen. Not a flare, plane, helicopter, etc. The lights were red-orange and flickering, as if the light of a fire. Identical to each other. They were perfectly spherical, resembling very large stars. The formation changed to a V, then to a Y, and continued to shift formation in the same area. They were very steady the whole time. Then, from the treetops a new orb (identical, but brighter) rose up diagonally from below and to the right of the formation. As it steadily approached the other lights began to fade. By the time it rejoined there was a single orb left, very dim, which eventually faded out. The new orb stayed motionless and then also faded out. About 40 seconds later a new orb appeared from where the last one did and made another straight diagonal path to the spot the other's were. Halfway to the spot, another appeared from the same place. They both moved at the same speed and same angle. As they moved they slowly faded. The first one got to the formation area and stayed about 15 seconds before fading out. The second faded out upon reaching the spot, about 10 seconds later. The color, shape, size, and fading looked strikingly similar to footage I've seen of the Phoenix Lights."],"Longitude":"-81.310377","Object Features":"None","Country":"United States","Summary":"8+ glowing red-orange orbs (flickering like fire, completely round, star-like) making various formations in perfect paths. New light rises to join, others fade out, then new light fades.","Region":"Florida","files":["/var/www/straped/mufon/html2text/42018.html.txt","/var/www/straped/mufon/org/42018.html"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Source":"MUFON","Case Number":"42018","Date Submitted":"08/25/2012 09:27 UTC","City":"Orlando","Date of the Event":"08/25/2012 08:37 UTC","Tags":"City"}