{"Summary":"Abrupt turn VERY fast, temporary straight line trajectory NW to SE followed by amazing ascent and then disappeared.","Longitude":"-85.606071","Date of the Event":"08/24/2012 09:30 UTC","Date Submitted":"08/25/2012 09:06 UTC","files":["/var/www/straped/mufon/html2text/42016.html.txt","/var/www/straped/mufon/org/42016.html"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Unknown","Region":"Indiana","Object Shape":"Sphere","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","trends":["There have been 12 other sightings in Anderson","There were no other sightings in Anderson on or around August 24th 2012"],"Source":"MUFON","City":"Anderson","divs":["Sighting DetailsMy brother and I were outside on my porch so he could smoke a cigarette at roughly 9:30 PM Eastern time on 08-24-2012 near Anderson Indiana. While on the porch I turned my head to talk to him when I noticed a flying object make an unusually abrupt 180 degree turn close to the planet Venus. Venus was in the background and very bright in the sky W to NW of our position. I pointed it out to my brother and we began to watch the object which appeared as a solid white light (no pulsing). I made the assumption it was a commercial aircraft and my eyes had played a trick on me as my head turned that direction (to explain the unusual change of direction). We both began to watch the object closely. We first noticed the speed of the craft. It was moving VERY fast from NW to SE in a straight line trajectory, and yet despite the speed it was completely silent. Because of the speed of the craft, we then speculated it might be a military jet from Edwards Air Force base in Ohio (but again, it was completely silent). Then as we continued to watch waiting to see FAA blinking lights, or another sign that it was indeed a regular aircraft, it suddenly began an amazing ascent. It headed straight up at amazing speed and we watched the light grow smaller and smaller till finally vanishing altogether (this was absolutely an ascent, it was an amazing climb). This ascent the craft took from the altitude of it's initial flight path to what appeared to be out of our atmosphere; lasted about three seconds. It was amazing! This was not a regular commercial or military aircraft. This was not a meteor or anything naturally occuring. It was a craft the likes of which I've never seen in my 41 years (including military service). It was a UFO. My brother and I know what we saw. Unreal. I kind of believed before, but now \"I KNOW\" and my brother knows. Quite the life altering experience."],"Case Number":"42016","Weather Factors":"Unknown","Log Number":"US-08252012-0017","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.072538,+-85.606071(42016)&iwloc=A&hl=en\"> mufon case (42016) map </A>","Latitude":"40.072538"}