{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Date Submitted":"08/26/2012 02:46 UTC","Source":"MUFON","Latitude":"41.894322","files":["/var/www/straped/mufon/html2text/42025.html.txt","/var/www/straped/mufon/org/42025.html"],"Object Features":"None","divs":["Sighting DetailsIt was about 10:30 at night and I was driving with my boyfriend and his friend. We were driving down the street so I could drop his friend off and my boyfriend pointed to the sky. He happened to be looking out the window and when we looked there were 3 orange dots in the sky in the form of a triangle. I thought maybe they were airplanes since they were about the same size and many airplanes drive over us. But they had no blinking lights on them like airplanes and they were entirely orange. They were also hovering in their triangular formation. We turned the corner onto my friends street and lost view for a second due to a tree. But when we looked again they were in a straight line, but now there were only 2. Just like that. Then right before our eyes a second one dimmed out as if a lightbulb had gone out and it disappeared. We watched the last dot as it flew through the sky at a fast rate; faster than an airplane. Then it, too, dimmed away. I personally am incredibly afraid of aliens and began to panick. I knew it was nothing near normal because they disappeared so quickly. My boyfriend thought it was kind of cool, and an interesting experience. He was pretty freaked out though, also knowing it wasn't normal. And out friend didn't seem to care at all. It was very interesting, as may cause me to lose sleep tonight."],"Date of the Event":"08/25/2012 10:30 UTC","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=41.894322,+-87.979944(42025)&iwloc=A&hl=en\"> mufon case (42025) map </A>","Case Number":"42025","Weather Factors":"Unknown","Log Number":"US-08262012-0004","Object Flight Path":"Hovering then path,Straight-line path","trends":["There have been 4 other sightings in Villa Park","There were no other sightings in Villa Park on or around August 25th 2012"],"Country":"United States","Longitude":"-87.979944","Viewing Distance":"Unknown","Summary":"Orange ball of light about size of an airplane from a distance","Region":"Illinois","City":"Villa Park","Tags":"City"}