{"Date Submitted":"08/26/2012 09:01 UTC","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around August 15th 1979"],"Source":"MUFON","Sighting Duration":"00:10:00","Object Features":"None","Latitude":"35.468596","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/42033.html.txt","/var/www/straped/mufon/org/42033.html"],"Tags":"City","Viewing Distance":"101-500 Feet","Date of the Event":"08/15/1979 11:00 UTC","Case Number":"42033","divs":["Sighting DetailsI observed this UFO between school years in the summer of 78-79. From my parents home in a residential neighborhood. I was outside late one evening enjoying the cool night air and I heard a loud rumbling noise overhead. It appeared to be a large fireball coming down near my location. As I watched I could only think of a large meteor impact and I would not be able to outrun the blast. I watched as the fireball slowed as it grew nearer to the ground. Still traveling fast, at about 100 yards from the ground, the object inside the fireball made a sudden 90 degree turn out of the smoke cloud and floated away from the cloud at a much slower pace than it's decent speed. I noticed that the smoke cloud and trailer were not being blown around by the object like a jet engine or prop would do. The object glided without a sound, at a slow steady speed. I observed wisps of smoke still coming off the apparently very hot object. It was a dull gray metallic disk, with no color or sound. As it was moving overhead my line of sight on the object was blocked by the house so I ran inside to get a better look from my second floor. Inside a paused for a couple of minutes looking for a camera. Unsuccessful in locating a camera I quickly moved to my room on the second floor and out the window and onto the roof. From that vantage point I could see the object about a block away now had started to glow a vivid violet blue color. It seamed to pause a few times as it moved further off to the northeast. After a few more minutes it turned to the northeast and began accelerating until it was out of sight. Since Tinker Field air force base is close by I always wondered if they had picked it up entering the atmosphere on their radar. About a year later I saw an article in Omni Magazine asking if you had ever seen a UFO and I wrote in with the details. I never saw or heard anything else."],"Country":"United States","Log Number":"US-08262012-0011","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.468596,+-97.551854(42033)&iwloc=A&hl=en\"> mufon case (42033) map </A>","City":"Oklahoma City","Object Shape":"Cigar","Longitude":"-97.551854","Summary":"UFO Entering Atmosphere","Object Flight Path":"Other"}