{"Longitude":"-108.489054","divs":["Sighting DetailsAt around 8 p.m. I went out back to the patio. I sat down facing the north. It was mostly cloudy and the sun was setting. I was looking around and saw the two lights. The lights caught my attention. This one cloud was illumated by the lights. As I looked into these two lights they appeared about 4 inches apart, and was so bright that it almost hurt my eyes. I looked a little bit longer and they shot apart at the speed of lightening and changed shape to a beam of light appearing 12 inches long in the sky. It all happened so fast and they came back together to the two very bright lights as before, then they repeated the sequence of changing shape. The beam changed back to the two very bright lights and disappeared without moving in any direction. While all this was going on, only the one cloud was illumated. When it left, it was pure darkness. When I saw this I knew we definately are not alone."],"Region":"Colorado","Object Features":"Unknown","Object Shape":"Circle, Other, Unknown","Source":"MUFON","Latitude":"39.119585","Sighting Duration":"00:00:45","trends":["There have been 24 other sightings in Grand Junction","There were no other sightings in Grand Junction on or around August 22nd 2012"],"City":"Grand Junction","Date Submitted":"08/26/2012 01:50 UTC","Date of the Event":"08/22/2012 08:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.119585,+-108.489054(42037)&iwloc=A&hl=en\"> mufon case (42037) map </A>","Country":"United States","Summary":"I was on the back patio and observed 2 very large bright lights the size of golfballs approx. 4 inches apart. The zipped away from each other to approx. 12 inches apart, came back to 4 inches then repeated the movement.","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42037.html.txt","/var/www/straped/mufon/org/42037.html"],"Object Flight Path":"N/A","Log Number":"US-08262012-0016","Disposition":"Unresolved","Case Number":"42037"}