{"Longitude":"-0.167046","Country":"United Kingdom","Object Flight Path":"Stationary","Latitude":"53.919775","Summary":"red light moving over the north sea in sequence","Date Submitted":"08/26/2012 08:17 UTC","Date of the Event":"08/22/2012 09:30 UTC","Disposition":"Unresolved","Sighting Duration":"00:10:00","Region":"","Log Number":"GB-08262012-0009","files":["/var/www/straped/mufon/html2text/42031.html.txt","/var/www/straped/mufon/org/42031.html"],"divs":["Sighting DetailsI was sat on Hornsea seafront with two friends who both saw this \"event\", The object appeared in the sky were Jupiter normally is about 2.30AM, I turned to my friends and said i think that's Jupiter but its up to early to be up. After i said the the first light faded they then reappeared two right lights next two each other the first one i saw was part of them, They then both faded again the the other one reappeared, That again faded and we saw nothing for about two minutes, Three lights came one one after another in the angle of an obtuse triangle the bottom one then faded and one appeared next to the top one in the same shape as the first two we saw, then all disappeared again, Again nothing for about two minutes then just one appeared then disappeared. This object or objects were heading north i have looked on the internet and a few other people in this area saw the same thing and there were videos from Scotland of a similar object heading north. There were no anti collision lights, There was no sound, They wasn't Chinese lanterns and they were not a weather balloon. I am very interested in plants, stars and meteors and have been for years now so when i saw something i personally couldn't explain i was freaked out i have wanted to see something like this along as i could remember, i had a gut feeling when i saw it and have done since i saw it, My actions were to tell whoever walked past to keep an eye on the sky and a few people did i haven't seen these people since to ask if they saw it. The object looked as it should of appeared again further north but i waited for about half an hour but i never saw these lights again."],"Weather Factors":"Unknown","trends":["There have been no other sightings in Hornsea","This sighting has been favorited 1 time."],"Source":"MUFON","Tags":"City","City":"Hornsea","Viewing Distance":"Unknown","Object Shape":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=53.919775,+-0.167046(42031)&iwloc=A&hl=en\"> mufon case (42031) map </A>","Case Number":"42031"}