{"Disposition":"Unresolved","Object Flight Path":"Stationary","Object Shape":"Circle, Flash, Oval, Star-like","files":["/var/www/straped/mufon/html2text/42049.html.txt","/var/www/straped/mufon/org/42049.html"],"City":"Palmetto","Date Submitted":"08/26/2012 11:27 UTC","Source":"MUFON","Date of the Event":"08/26/2012 10:30 UTC","Longitude":"-84.664175","map":"<A HREF = \"http://maps.google.com/maps?q=33.521381,+-84.664175(42049)&iwloc=A&hl=en\"> mufon case (42049) map </A>","Region":"Georgia","Summary":"Red amoeba shaped with green lights circling","Country":"United States","Case Number":"42049","divs":["Sighting DetailsAround 10:30 pm at our home in Georgia, a light caught my eye throught a window and I went outside to see if it was an airplane or a star. It was a sparkling light and I saw it move slightly upward, then downward and then to the left. I woke up my husband to come see. It was sparkling red, blue, green and white but when I looked at it through binoculars, it is red and amoeba shaped, sometimes looking like a paisley shape going to a round shape. There are green lights around it but then it will just be a strip of green lights, like maybe it turned on its side. I have been watching it for about an hour and it is still there. I did see another one that was smaller, coming toward it and then it disappeared. At one time, I saw a slight white light falling out of it but only for a second so I don't know if that was actually a part of it. I saw an airplane pass under it by maybe a thousand feet (?) but other than that, nothing has come close to it. I keep going outside to see it but am getting a little scared of it for some reason. It is definately not of this world. I just checked and it is still there just sparkling."],"Viewing Distance":"501 Feet - 1 Mile","trends":["There has been one other sighting in Palmetto","There were no other sightings in Palmetto on or around August 26th 2012"],"Latitude":"33.521381","Sighting Duration":"Undisclosed","Object Features":"Dome","Tags":"City","Weather Factors":"Unknown","Log Number":"US-08262012-0025"}