{"Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/42042.html.txt","/var/www/straped/mufon/org/42042.html"],"Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Summary":"Five glowing orbs traveling in slight formation, circling one another, and suddenly changed altitude.","Disposition":"Unresolved","Longitude":"-85.602265","Log Number":"US-08262012-0021","divs":["Sighting DetailsWe were having a family campfire in the backyard on this early summer evening (my father age 51, mother age 47, sister age 23, and my 6 year old daughter). The sun had just gone down, but it was still rather light outside. My daughter looked up in the sky and said to my sister \"Look at those planes Aunt Sarah!\" My sister looked up in the sky and said, \"I don't think those are airplanes..\" I turned around in my chair to look and immediately stood up and realized I was witnessing something extraordinary. My mother and father were both looking puzzled at the sky. From where we sat looking North, we saw 5 glowing orange orbs flying in formation with one another. They were flying with one another, though they were weaving in and out chaning positions in their flight. They changed directions around one another, some acending and others decending at angles that airplanes could not maneuver. The objects were all flying from North East to North West. I tried to get the camera on my phone out but it could not pick up the objects in the sky. My mom was holding her camera but could not get it to focus on the objects as they were flying. Just as the orbs passed our line of sight over the tree line, a 6th orange orb came flying up behind them at a speed much faster than the others were traveling; like it was trying to catch up to them. That's when we were all just stunned. Halfway across the sky, in our line of sight the object changed from orange to black and began to ascend and accelerate. The black object zoomed out of our sight. My mother kept saying over and over \"what the heck was that?!\" My father, who is quite the skeptic, sat puzzled and had no theory to what he saw in the sky. I have always been a firm believer in alien theory and my entire family knows my feelings on the subject. It has been a long standing joke in the family. After June 9th, they don't poke fun at me anymore. We have no explanation as to what we saw, other than it being a group of UFOs."],"Latitude":"43.026955","Object Shape":"Fireball, Other","Region":"Michigan","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Date of the Event":"06/09/2012 09:56 UTC","Case Number":"42042","City":"Grand Rapids","map":"<A HREF = \"http://maps.google.com/maps?q=43.026955,+-85.602265(42042)&iwloc=A&hl=en\"> mufon case (42042) map </A>","Date Submitted":"08/26/2012 05:13 UTC","trends":["There have been 45 other sightings in Grand Rapids","There was one other sighting in Grand Rapids on or around June 9th 2012"]}