{"Latitude":"45.519837","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=45.519837,+-123.059829(42047)&iwloc=A&hl=en\"> mufon case (42047) map </A>","Log Number":"US-08262012-0023","Case Number":"42047","Object Shape":"Circle","Object Flight Path":"Path with directional change","divs":["Sighting DetailsAt 2100 hrs I was driving the back roads (Hornecker Road) headed west between Hillsboro and Cornelius I had a clear view of the southern sky. I noticed some of the stars were orange in color and didn't think anything about it.I continued down Susbauer road headed south and noticed the orange stars seemed to be closer together. I turned west on Long Road and had another clear view of the southern sky. It was then that I noticed the stars were actually moving closer together. I turned south down Cornelius Schefflin road, and the the orange stars were clustered together, I pulled over on Holladay St and witnessed 12 orange lights come together in a zig zag pattern (up and down). They were evenly spaced with the 13th off to the western side closed to the moon. They were stationary southeast of my position with the moon just a little southwest. This occurred at 2105. This was the time I Called my friend in Hillsboro so he could confirm. He could not see the same part of the sky from his position. as we talked the 12 lights begain to fade in no direct pattern. The 13th light was the last to fade. The fading took about 5 min till the 13 light faded out of sight. I was unable to take pictures or video due to their distance from my position. This is my very first UFO sighting and I was very excited to come upon this. I am a firm believer in extraterrestrials and this just affirms my belief."],"Weather Factors":"Unknown","Summary":"13 moving lights spread out then came together in a zigzag pattern with 1 lone light then all faded 1 at a time","Sighting Duration":"Undisclosed","Country":"United States","Region":"Oregon","files":["/var/www/straped/mufon/html2text/42047.html.txt","/var/www/straped/mufon/org/42047.html"],"Source":"MUFON","Tags":"City","Longitude":"-123.059829","Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Cornelius","Date Submitted":"08/26/2012 11:00 UTC","Date of the Event":"08/25/2012 09:00 UTC","trends":["There have been no other sightings in Cornelius","This sighting has never been favorited."]}