{"divs":["Sighting DetailsSTANDING OUT SIDE TALKING WHEN SON HAPPEN TO LOOK UP, POINTING OUT STRANGE OBJECT IN NIGHT SKY. (LOOKING SW JUST ABOUT TREE TOP) CROSSING TO THE N TILL AFTER ABOUT 30SEC IT TOOK A LEFT AND FADE OUT OF SITE. CALL OUT WIFE TO SEE THIS UNUSUAL OBJECT WITH US TO VERIFY. (NOW 3 PERSONS WITNESSING & SEEING THE SAME OBJECTS---WAS NO AIRCRAFTS! OR ANY THIGN ANY OF US WOULD KNOW OF!) FIRST OBJECT PATH STRAIGHT ACROSS AND STOP AT A POINT IN SKY. IT STAYED THE LONGEST OF ANY OTHERS. SECOND AND THIRD CAME ACROSS IN CLOSER FORMATION MORE LESS TOGETHER BUT NOT JOINED. FOURTH CAME ON SAME PATH BUT BACK OF THE OTHER TWO. IF I HELD MY HAND UP IN FRONT OF MY FACE (MY FINGER TIP TO ELBOW ACROSS WOULD BE ABOUT THE SEPARATION BETWEEN THEM. EQUALS ABOUT 18\" IN LENGHT! SIZE OF OBJECT IN THE SKY WOULD BE ABOUT THAT OF A DIME IN THE SKY OR YOUR THUMB NAIL AT ARMS LENGHT.) NOTE:IF I WAS STANDING FACING WEST, AN WEST IS 12:OO ALL FOLLOWED STRAIGHT PATH ACROSS THE NIGHT SKY, THEN ALTER PATH SLIGHTLY AN TURNED AT DIFFERENT POINTS AND TIMES IN THE SKY, SLIGHTY CHANGED DIRECTIONS. ALL UFOS CAME IN AT 10:00 (OFF MY LEFT SHOULDER) WENT THROUGH TO 1:00 (IN FRONT OF ME FACING WEST) ALL SEEN AT ABOUT ESTIMATED 25DEG ABOVE HORIZON JUST ABOUT TREE TOP LEVEL OF OUR AREA AN VIEWING DIRECTIONS. TIME WAS 9:27PM OR 21:27 EST FIRST ONE: (NOTICED BEING OUT OF PLACE IN THE NIGHT SKY AS IT WAS NOT A STAR OR AIRCRAFT!) WE SAW OBJECT APPROACHING AT 10:00 WENT TO 1:OO AND STOP IN SKY SEEMED TO BE WAITING ON THE OTHERS, THEN AFTER ALL TURNED TO WEST, IT THEN WAS GONE IN SAME DIRECTION! WEST! SECOND AND THIRD: CAME IN REALITIVELY SAME PATH ONE HIGHER AND FURTHER AWAY, CLOSE BUT NOT TOUCHING, HAD SEPARTATION BETWEEN THEM ABOUT ONE FINGERS WITH APART (IF YOU HELD YOUR FINGER OUT AT ARMS LENGTH.)CHANGED FLIGHT PATH SLIGHTLY WHILE COMING CLOSER ALMOST AS ONE. CAME IN AT 10:00 AND WENT TO 12:00 TURNED WEST IN FRONT OF FIRST ONE BEING STOP AND STATIONARY PLACE IN SKY AND FADED OUT OF SITE. HEADING WEST. FOURTH OBJECT CAME IN ON SAME PATH 10:00 AND WENT TO 12:30 AT WHICH TIME IT STOP AND WENT WEST AS THE SECOND AND THIRD. THEN THE FIRST ONE WHICH REMAINED FOR A WHILE, LEFT TOO. VERY DISTINGUISHED LOOKING OBJECT. ALL OBJECTS FADED AWAY HEADING WEST. THEY ALL TOOK SLIGHTLY DIFFERENT PATHS AN TURNED AT DIFFERNET TIMES. LOOK VERY CONTROLLED WITH INTENTIONS... ALL OBJECTS WERE RED-ORANGE LOOKING WITH A GOLD HUE AROUND VERY OUTSIDE OF ALL OF THEM. PULSATING WITH DIFFERENT INTENSITY. THIS WAS SOMETHING VERY DIFFERENT THAN NORMAL, THE SKY WAS VERY CLEAR AND I AM 15-20 MILES FROM YOUNSTOWN REGIONAL AIRPORT. WE ALL KNOW PLANE,METEORS AND OTHER SITES IN THE SKY. 1-OUTSIDE RESIDENCE TALKING TO SON ON FRONT SIDEWALK. 2-SON POINT AND I TOOK CLOSE NOTICE AS I AM VERY INTERRESTED IN THE SKYS. THE OBJECTS COLOR AND MOVEMENTS. 3-IT WAS SO UNUSUAL I DID NOT KNOW...I HAVE SEEN MANY PLANES AND METEORS AND THE OBJECT FIT NONE I EVER SEEN OR ANY OF US FOR THAT MATTER. 4-THE OBJECT TOOK A PATH OF DETERMINED VARIANCE WITH SPEED AND DIRECTION. 5-EXCITED, INTRIGUED, WANTING TO NOW WHAT THESE WERE! ALL OF US KEPT EYES FIXED ON OBJECTED WHILE IT HAPPENED. AFTER DISCUSSING WHAT IT WAS NOT IN THE SKY! VERY POSITIVE EXPERIENCE! 6-CHANGE DIRECTION AND FADED OUT OF SITE. SORRY WAS SO EXCITED TO GET INFO AND BE CORRECT. FORGOT TO GET PICTURES, THOUGH I DO NOT THINK I WOULD HAVE HAD TIME. HOPE THIS DETAIL HELP YOU! I AM 59 AND THIS IS MY 3RD SITING. I LISTEN TO C2C AND KNOW WHAT TO LOOK FOR AS YOU INFORMED ALL."],"Object Features":"Unknown","Date of the Event":"08/25/2012 09:27 UTC","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","Longitude":"-80.531276","Latitude":"41.235506","trends":["There have been no other sightings in Masury","This sighting has never been favorited."],"Object Shape":"Circle, Oval, Sphere","City":"Masury","Tags":"City","Summary":"3 PERSONS SAW, CROSSED THE SKY WITH 3 OTHER FOLLOWING WITH SHORT DISTANCE BETWEEN. CHANGE DIRECTION AFTER STRAIGHT PATH, WENT OUT OF SITE. 4 DISTINCT OBJECT OF THE SAME TYPE!","Log Number":"US-08262012-0024","Case Number":"42048","map":"<A HREF = \"http://maps.google.com/maps?q=41.235506,+-80.531276(42048)&iwloc=A&hl=en\"> mufon case (42048) map </A>","Region":"Ohio","Disposition":"Unresolved","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Date Submitted":"08/26/2012 11:26 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42048.html.txt","/var/www/straped/mufon/org/42048.html"],"Sighting Duration":"00:01:33"}