{"Sighting Duration":"Undisclosed","Case Number":"42050","Longitude":"-98.806377","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=29.432067,+-98.806377(42050)&iwloc=A&hl=en\"> mufon case (42050) map </A>","City":"San Antonio","trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around August 26th 2012"],"Tags":"City","Country":"United States","Region":"Texas","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42050.html.txt","/var/www/straped/mufon/org/42050.html"],"Latitude":"29.432067","Object Shape":"Circle","Weather Factors":"Unknown","Date Submitted":"08/26/2012 11:32 UTC","Summary":"Large white Orb glowing brightly then going dark at the moment video was going to be taken.","Date of the Event":"08/26/2012 09:15 UTC","divs":["Sighting DetailsMy partner, Tasha, was leaving the house in order to do some last minute school shopping. She returned a few minutes later due to an issue with her power steering on her 2007 Dodge Grand Caravan. I went outside in order to see what the problem was. She began to explain to me that as she was trying to leave the neighborhood, her steering began to malfunction and she was having a hard time turning the van around. I turned on the van and checked the power steering fluid, all seemed okay and her steering was working fine. As we were talking about the steering, she looked past me and stated, \"That is a weird star.\" As I turned around to see, however, there was nothing in the direction she was pointing. She told me, that was weird, it just vanished. She told me that it was not that high up and seemed to be at the end of our street, or at least, close to it. As I was looking around the sky, I observed a bright Orb shaped object in the near distance. I asked her if that was what she was looking at, she said that it could not be, because it was too far and too high from the first location it was observed. However, I did notice that this new Orb of light was moving from the north of our residence S.E. not really going that fast. I did not observe any flashing lights on this object and it was a steady glow of only white light. As this object was to the east of our house, still heading S.E. we heard the sound of a Helicopter, which was south of our house and heading in a direction, as if to intercept this object. Tasha and I both pulled out our iPhones and pointed them toward the object to try and get some video, however as we did this, the object started to dim very quickly, as if it, one, knew we were going to try and capture it on video, or it noticed the Helicopter heading towards it's location. It just went totally black and we could not see it any longer. Note: Possibly affected Tasha's vehicle as she was leaving the neighborhood. It was in the very general location as she would have been as she was leaving. Helicopter heading it's direction or us attempting to shoot video caused it to black out. Possibly two objects, not just one due to the location of the objects seen by the two of us. Eddie Patrol Sergeant Texas"],"Object Features":"Unknown","Log Number":"US-08262012-0026"}