{"Case Number":"42056","City":"Cullman","Viewing Distance":"Over One Mile","Object Features":"None","Date Submitted":"08/27/2012 12:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.173119,+-86.869785(42056)&iwloc=A&hl=en\"> mufon case (42056) map </A>","Longitude":"-86.869785","Summary":"saw a glowing orb that changed shape and color as it moved. followed in car before it dissapeared","files":["/var/www/straped/mufon/html2text/42056.html.txt","/var/www/straped/mufon/org/42056.html"],"Log Number":"US-08272012-0005","Date of the Event":"08/26/2012 10:35 UTC","Object Shape":"Chevron, Diamond, Sphere, Triangle","Object Flight Path":"Stationary,Path with directional change","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 2 other sightings in Cullman","There were no other sightings in Cullman on or around August 26th 2012"],"Disposition":"Unresolved","Latitude":"34.173119","divs":["Sighting Detailswent outside at about 1045 central time to take my dogs for a walk. i noticed a bright glowing object in the western sky that i first thought was a bright star or maybe a planet. i came back around to the front of the house and noticed that this thing was changing color and pulsating. now that it had my attention i went inside and got my binoculars. when i came back outside i noticed that the position had changed, but it was stationary. as i looked through the binoculars i could clearly tell that it was not a star nor a planet. it began to change shape rapidly and would also change color as it morphed. i came back inside to get my wife so she could see it. i was inside no longer than 20 seconds and when i came back out it was gone. i jumped in my car and headed west to see if i could find it again and sure enough i did. this time i was able to watch it move in a southwern direction. it stopped several times as i watched it continue to change size and color. it was almost as if this thing knew i was watching and it was putting on a show for me. finally it moved off beyond the horizon and i lost track of it. i made several attempts to find it again with no luck. the whole incident lasted about 35 minutes. please fell free to contact me if youd like. i wouldnt mind knowing if anyone else saw this thing. i know for a fact it wasnt flares or a plane or any kind of helicopter ive seen before. im sort of a military buff and take pride in being able to point things out in the sky. thanks, chris brewer"],"Weather Factors":"Unknown","Tags":"City","Region":"Alabama","Source":"MUFON"}