{"Summary":"Green Lights Over Lubbock","Case Number":"42059","trends":["There have been 18 other sightings in Lubbock","There were no other sightings in Lubbock on or around August 27th 2012"],"Source":"MUFON","Object Shape":"Star-like, Other","divs":["Sighting DetailsThis is the second time I am reporting this object. The first sighting I submitted was on July 28, 2012. This was a star like green light in the sky that appeared as two separate green lights through a pair of binoculars. I spotted it in the exact same spot in the sky. The only difference was that I could see an additional red light on this object during the sighting. It flashed on and off randomly and floated from left to right, and also hovered in place. The entire sighting lasted possibly about thirty minutes. I lost sight of the object as it lowered beneath the trees. This time I hopped in the car with my husband who drove in the direction of the lights. At this point I am trying to figure out if I am viewing a possible RC plane with LED lighting. I tried to film it, but my camera was unable to focus on the light for any length of time. When I first saw the object I was excited that I had an additional witness with me. At one point through the binoculars it seemed as though a much, much smaller white light possibly collided with this green object. I always watch the sky, and even looked at the sattelite trackers for my area only an hour or so before because I saw the ISS pass overhead and wanted to make sure that was what I was viewing. I am quite excited about this sighting. I simple want to know what RC planes are capable of, such as how high they can fly, if they can hover in place, and exactly how far away the lights can been seen with the naked eye. I found the movment of the light quite unusual and fascinating."],"Region":"Texas","Log Number":"US-08272012-0008","Latitude":"33.582443","Date of the Event":"08/27/2012 11:20 UTC","Longitude":"-101.845516","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.582443,+-101.845516(42059)&iwloc=A&hl=en\"> mufon case (42059) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/42059.html.txt","/var/www/straped/mufon/org/42059.html"],"Object Flight Path":"Hovering then path","Object Features":"Unknown","Disposition":"Unresolved","Date Submitted":"08/27/2012 01:56 UTC","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","City":"Lubbock"}