{"trends":["There have been 7 other sightings in Moline","There were no other sightings in Moline on or around August 26th 2012"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/42063.html.txt","/var/www/straped/mufon/org/42063.html"],"City":"Moline","Object Features":"Dome, Patterned Surface","Longitude":"-90.511294","Sighting Duration":"Undisclosed","Date Submitted":"08/27/2012 03:32 UTC","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Source":"MUFON","Country":"United States","Object Shape":"Disc, Teardrop","Latitude":"41.50782","divs":["sighting detailsdriving west on avenue of the cities in moline, il towards i-74. observed bright golden\\copper streak in the sky. at first thought it was a plane with trail but object remained stationary and solid in the sky. it was either a long or slightly tear drop shape and almost vertical in appearance and was very bright. several minutes later observed (while still driving in the same direction) a large grey disc shaped object with slight low profile dome was observed hovering near first object. then suddenly 3 very bright round blue lights flashed several times on the side of the large grey object. and just after the bright flashes the grey object tilted slightly and began flying south. shortly after that visual contact was lost briefly. the grey object was not observed again. when turning back around in an attempt to regain visual contact, the large golden object was observed once again and still appeared to be stationary. visual was shortly thereafter lost due to trees. object was not observed again. i'm not sure how long the object had been there before i made visual contact. i tried taking video with my smart phone but it did not turn out well. i was able to get a photo of the gold\\copper colored object but not the grey object."],"Summary":"2 separate and completely different objects were observed.","Log Number":"US-08272012-0012","Date of the Event":"08/26/2012 07:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.50782,+-90.511294(42063)&iwloc=A&hl=en\"> mufon case (42063) map </A>","Tags":"City","Region":"Illinois","Case Number":"42063","Weather Factors":"Unknown"}