{"divs":["Sighting DetailsI was living at a sober house with multiple residents right on post road in Guilford, CT. That evening, around midnight, I went out for a smoke and saw an incredibly bright star that also looked to be very close, it was odd enough for me to text my friend to ask him to look at it with me (I have always been an avid observer of the skies and all weird things in it). He agreed that it was very strange, and we went off to bed. Around 3 am, I was still awake and still curious about the object, especially whether or not it was still there. So I went outside alone for another smoke. This is when my memory starts getting very fuzzy. I remember locating the object Very easily. It was like Venus but much larger and even brighter. I took out my cell phone to take a video. I couldn't pick up the light with the normal light effect on so I switched to a negative light filter. I was happy with the results and also very suprised at how much closer it seemed. This is when the object began moving erratically. I remember just being in awe at how it was moving, up down zooming to right above me to miles away then right back. It was incredible! After this, I have no memory until around 5:30am then nothing again til 7am. My memory around 5:30 is of me sitting on the front lawn with my cell phone video on, smiling, very happy and saying out loud \"Come on! This is your last chance for me to videotape you before everyone starts waking up! Come on out! It's ok!\". Around 7am I started talking with the residents from the house about it, though I didn't remember what I had told them until I asked the day after. I rememeber thinking that I had been with ghosts and that was what I told them. I actually told them that I had \"a rough night\", that I had seen orbs in the driveway, that there was a presence that communicated with me, that the presence wanted me to have my cat Buddy with me. I also had left a voicemail for my twin sister telling her about the star that was moving when it was happening. She said I was crying but that it didn't sound like I was sad but rather that I was witnessing something incredibly beautiful and amazing. I also remember when I was talking with my friends that I had my cell phone out, trying to make sense of these videos taken in negative effect. I remember showing them and asking \"What the hell can that be? Where am I that I could film the roof?\" Later that day I went to download the videos and pictures from my phone to my computer, where I saw I actually had 12 videos of that night already on it plus another 6 on my phone! I must've been going up to my room during all of this to empty my phone when it ran out of memory! So I have 18 videos and 15 pictures. It took months to see any of it somewhat cleary as I don't have the equipment to view the videos in their positive image other than my cell phones which do not do these videos justice. There are videos of me with my cat, at least 2 small craft, an entity opening and closing my car door, more entities, multiple orbs in multiple colors, one of me in my bedroom filming out the window of 2 hovering craft and then this very strange and geometrical light on my ceiling...you just have to see them. I felt very strange after all this and have since constantly seen lights, felt a presence, and mostly seen hovering lights in the woods where there are absolutely no homes. I actually didn't sleep with the lights out for months and have gathered hundreds of videos. I am looking for someone to help me view these videos to put some of my fear to bed. That my one memory was of me laughing and happy, I know no harm came to me, especially since my cat interacted so readily with me during all this. But every time I get that feeling (feels like electricity running through my skull and the outter edges of my vision starts to flutter with a white light) I just get terrified, and I don't want to be terrified of something with such majesty. I also feel burdened with the reality that I have the videos that I've Always wanted to see when I hear someone has evidence of UFO's. That this entity, this phenonema allowed me, encouraged me even to film it. I also have had very strange things happening with my skin and my hair. White thread-like but plastic-like substance coming out of my pores and out of my hair, my nose...just weird stuff and I can't help but think that being That close to these objects had some sort of effect on me. Buddy had the same symptoms but he has since disappeared (a couple weeks ago). By the way, I didn't click the abduction option above but the interaction the videos show along with my loss of memory as well as the height at which I seem to be filming from, I don't know what happened. I really don't."],"Object Features":"Dome, Window(s), Appendage(s), Wings","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Region":"Connecticut","Summary":"multiple hours with only minutes of memory, videos, pictures","map":"<A HREF = \"http://maps.google.com/maps?q=41.310203,+-72.73441(42078)&iwloc=A&hl=en\"> mufon case (42078) map </A>","Latitude":"41.310203","Disposition":"Unresolved","Object Shape":"Disc, Fireball, Flash, Oval, Star-like, Other","Longitude":"-72.73441","City":"Guilford","Weather Factors":"Unknown","Source":"MUFON","trends":["There has been one other sighting in Guilford","There were no other sightings in Guilford on or around September 3rd 2011"],"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, Unknown","Date of the Event":"09/03/2011 03:00 UTC","Log Number":"US-08272012-0027","Date Submitted":"08/27/2012 06:23 UTC","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"42078","Country":"United States","files":["/var/www/straped/mufon/html2text/42078.html.txt","/var/www/straped/mufon/org/42078.html"]}