{"Date Submitted":"08/27/2012 09:52 UTC","Country":"United States","Object Shape":"Star-like, Triangle","Longitude":"-87.908492","Source":"MUFON","City":"Burr Ridge","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Summary":"Got up at 3:50 Am and saw a strange object in the night sky through my skylite in my bathroom. I watched for a while and then took a picture of the object. When enlarged it is definitely something unknown.","Log Number":"US-08272012-0034","trends":["There has been one other sighting in Burr Ridge","There were no other sightings in Burr Ridge on or around August 26th 2012","This sighting has never been favorited.",""],"Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsAt around 3:50 AM on Sunday, August 26th, 2012, I noticed a strange object in the night sky. I was looking through a sky light in my bathroom and noticed a small star, plane or satellite moving across the sky. It was moving north and I was looking east. I thought that it might be a satellite because it was going too slowly to be a plane. It then did something strange. It stopped and started to descend a bit. It then lined itself up between two stars that I could see in the sky. From where I stood it appeared to have a triangular form. Not sure how to describe this but it had three seperate areas where the light was emitted. The object shone like a star, but it was very different. I watched it line up with the stars but I knew that this was not a star at all. I quickly ran and got my IPhone. I took two seperate video's of the object and they didn't look like much, but the interesting thing is that the other stars did not show up on the video but this one did. I also zoomed in and took a picture of the object. I enlarged it on my TV set the next day and it was remarkable. It looked like some kind of ship although the picture is very grainy. It had three large dark circles under it and it was emitting light. It was definitely not a star. Again, none of the other stars even showed up on my phone. It was late and I was tired and I went back to bed. I got up 20 minutes later and checked to see if it was still there. It was still there. I went back to bed, but this time I fell asleep. It rained hard the next night so I did not have the chance to see if it would return. In my opinion, it was hovering over the city of Chicago for some reason. I guess we are not alone in this big universe as it seems that someone is watching us!"],"Latitude":"41.75362","Date of the Event":"08/26/2012 03:50 UTC","Tags":"City","Case Number":"42085","map":"<A HREF = \"http://maps.google.com/maps?q=41.75362,+-87.908492(42085)&iwloc=A&hl=en\"> mufon case (42085) map </A>","Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/42085.html.txt","/var/www/straped/mufon/more/42085_submitter_file1__IMG2072.JPG","/var/www/straped/mufon/org/42085.html"],"Object Features":"Unknown","Region":"Illinois"}