{"Object Shape":"Star-like","Date Submitted":"08/27/2012 08:25 UTC","files":["/var/www/straped/mufon/html2text/42082.html.txt","/var/www/straped/mufon/org/42082.html"],"Source":"MUFON","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","City":"Portland","Object Features":"None","Weather Factors":"Unknown","Log Number":"US-08272012-0030","Country":"United States","Summary":"nine \"unidentified flying objects\" over Portland's Waterfront Park on Thursday, August 23rd, 2012. I was then walking at the Waterfront Park between the Morrison Bridge and the restaurant/hotel section during the evening at about 8:40 pm. I began to see v","Longitude":"-122.667667","map":"<A HREF = \"http://maps.google.com/maps?q=45.528072,+-122.667667(42082)&iwloc=A&hl=en\"> mufon case (42082) map </A>","divs":["sighting detailsi am still feeling stunned by a huge sighting of nine \"unidentified flying objects\" over portland's waterfront park on thursday, august 23rd, 2012. i was then walking at the waterfront park between the morrison bridge and the restaurant\\hotel section during the evening at about 8:40 pm. i began to see very bright yellow lights moving across the darkening blue sky and flying in-line over the willamette river, coming from the west side and over the business buildings. they travelled at about 500 feet above ground and were moving at a slow paced jagged-line procession with a single object leading at front, with random groups of three, two, and ones following within a relatively even spacing about 100 yards apart. each light-object made the same right turn over the river and following an upriver direction and disappeared as they went into the dark misty clouds. there were no sounds coming from the objects and there were no \"flashing white or red lights\" on any of the objects, as would be expected on normal aircraft."],"Disposition":"Unresolved","Date of the Event":"08/23/2012 08:40 UTC","Latitude":"45.528072","Case Number":"42082","Tags":"City","Region":"Oregon","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around August 23rd 2012"],"Sighting Duration":"Undisclosed"}