{"Source":"MUFON","Log Number":"US-08272012-0036","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","City":"Houston","Object Shape":"Star-like","Country":"United States","Longitude":"-95.572353","map":"<A HREF = \"http://maps.google.com/maps?q=29.739224,+-95.572353(42087)&iwloc=A&hl=en\"> mufon case (42087) map </A>","Latitude":"29.739224","divs":["Sighting DetailsI was outside taking out the trash. I noticed a light that looked different. It wasn't moving insanely fast, which is an easy way to discern UFOs. But the quality of the light is unlike anything I've ever seen before. It most definitely wasn't the front lights of a plane. As a comparison there were a few other planes in the area. Also, I stopped walking when I saw it and saw it zig once or twice, in ways that are impossible. It wasn't a big movement, but just enough to notice and not be an eye glitch. I watched it go, and then it went behind a very thin cloud, never to return. The cloud wasn't large, and I kept watching. Based on the velocity, it had to have come out the otherside, but instead it just disappeared. Also, when it went behind the cloud, the light still didn't light up like headlights. Still no directionality, the ball of light just got more focused to a pinprick of light. The coolest part is that as I watched, it was the most natural thing in the world. I always imagined I would be scared, but I wasn't. I felt like, \"Oh, I think that's a UFO. I should watch it. Hmmm...yep, pretty sure that was a UFO. I'll have to tell my wife.\" It was as natural as the planes. :-) Just different."],"Case Number":"42087","Date Submitted":"08/27/2012 11:22 UTC","Region":"Texas","Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/42087.html.txt","/var/www/straped/mufon/org/42087.html"],"trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around August 26th 2012"],"Date of the Event":"08/26/2012 09:30 UTC","Disposition":"Unresolved","Summary":"Bright solid light, small zigs in path, disappeared behind small cloud","Tags":"City","Object Flight Path":"Straight-line path,Other"}