{"Log Number":"US-08272012-0031","Object Shape":"Cylinder","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"42083","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"33.708857","City":"Huntington Beach","map":"<A HREF = \"http://maps.google.com/maps?q=33.708857,+-117.995253(42083)&iwloc=A&hl=en\"> mufon case (42083) map </A>","Date Submitted":"08/27/2012 08:45 UTC","files":["/var/www/straped/mufon/html2text/42083.html.txt","/var/www/straped/mufon/org/42083.html"],"Tags":"City","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around August 26th 2012"],"Region":"California","divs":["sighting details huntington beach, ca. beach blvd runs n-s. washing dish. looked out the window which faces s. i saw 2 tall orange objects in the sky slightly sw. we normally get a lot of noisy hb helicopter activity but i knew instantly these were not police copters with flashing white lights with red underneath, plus the objects were glowing all orange and were much larger\\taller than police copters and they were silent. from my view point one was less than 1 mile away about 1300ft up and the other was a little further away and about 1100ft. up . i ran outside to get a better look. both hovering in position for 1min. there was no sound, then appeared to be floating\\descending in my direction n-ne. clear skies. they were glowing kinda pulsing orange to dark orange, no distinguishable features. they both stopped, hovered for about 30 seconds then changed direction again descending to about 900ft. moving very slowly south aligned directly above beach blvd. so i thought maybe i should get my binocs to see them better. at this point i had observed both for about 4 mins. ran into house grabbed my binoculars and camera taking about 30 secs. when i got back outside the one that was farthest away was gone. i looked through binocs and couldn't see it. the closest object was ascending while moving away from me heading south. i tried turning on the camera but couldn't fiddle with the zoom and saw nothing on the led screen. looked through binocs and could see object still rising slowly to about 1200ft and apprx. 1.5mi. away. the shape seemed to be more starlike or like a big round orb and not elongated like i first saw it. as it moved away it became darker in color with a little bluish glow on one side. it faded with a flicker as if it it was a controlled by a dimmer. then it was gone. there were no clouds over the coast which is 3mi. south from me and i could clearly see stars through binocs. i looked around the sky for about 5min. to see if the objects would return but they did not. about 2min. after they disappeared an airplane flew overhead flying west to east. i called the police dept and asked if anyone had reported anything and was told no. he asked how long i watched and where i had seen the objects. the officer asked if the objects made noise and when i said no he said, \"then you know it wasn't poiice helicopters\"."],"Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"08/26/2012 11:35 UTC","Object Features":"None, Unknown","Summary":"2 Orange cylinder objects seen at different altitudes floating","Source":"MUFON","Longitude":"-117.995253","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}