{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.279388,+-84.231013(42091)&iwloc=A&hl=en\"> mufon case (42091) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Circle","City":"West Branch","Object Flight Path":"Path with directional change","Case Number":"42091","trends":["There have been 2 other sightings in West Branch","There were no other sightings in West Branch on or around August 16th 2012"],"Latitude":"44.279388","Object Features":"None","Log Number":"US-08282012-0003","Date Submitted":"08/28/2012 01:15 UTC","divs":["Sighting DetailsOn Thursday, Aug. 16, 2012, my husband and I were returning to our cottage from a day trip to Mackinaw City. We had traveled to Mackinaw from the Tawas Area on back roads, and chose to return on I-75. We exited I-75 in West Branch and headed east on M-55 (towards Tawas). Upon leaving West Branch we became aware of a heavy amount of traffic traveling west bound on M-55. A few miles outside of West Branch I made a comment about the Ogemaw County Fair that was taking place, and that this \"must be some of the traffic\"... A few more miles down the road, the oncoming traffic was bumper to bumper, and at approximately 10:10 p.m., when we reached Rifle River Trail (the road to the fairgrounds) it was a major traffic jam, with vehicles turning off of Rifle River Trail onto M-55 (both east and west). We were now following a long line of cars going east... We continued east on M-55 for maybe 10 minutes, when all of a sudden my husband became acutely aware that we no longer had any traffic around us, and he said to me, \"Where did all the traffic go...??? There is no one in front of us anymore, and no one behind us\". I immediately looked out the back window... he was right. There were NO signs of any other vehicles as far as we could see (behind us or in front of us). This stretch of M-55 is STRAIGHT.... really straight...!!!!... There was an eerie moment of silence between us, and then we started talking about how odd it was that we had been in so much traffic from the fairgrounds just a few minutes earlier. Then, my husband, in an attempt to lighten the mood, said, \"This would be a perfect time for a UFO to come\". (PLEASE NOTE: This comment was made in a teasing type manner due to the multitude of experiences that I have had... some of which, he has experienced with me.) My reaction to his \"teasing\" comment was to light heartedly say, \"Oh GREAT....!!! Why don't you just summons them...???\" .... and we both laughed... Almost instantly I caught sight of a light in the sky, out the passenger window (due south). It was approximately 45-50 degrees off of the horizon. It was a solid, round, white flashing light that seemed to be traveling east at a rather rapid rate of speed. When I first noticed this light it was perpendicular to our vehicle, and it was moving faster than we were. It seemed to be traveling east (parallel to M-55). This object would flash \"out\" then reappear along a straight line path heading east. It was a steady, constant flash of light, maybe one second \"off\" and one and a half to two seconds \"on\"... (Note: if my index finger stretched out in front of me was representative of the light , the distance between each flash of light was about 2 inches)... I instantly thought that it was an airplane, but there were no red or green lights, only a white one.... AND... the fourth or fifth steady flash of light didn't continue in a straight line... it went \"UP\", then back \"DOWN\", then forward one or two flashes, then \"BACKWARDS\" one flash, then \"DOWN\" one flash, then back \"UP\" to the original path, then forward along the original path.... This whole sequence (to this point) had taken about 15 to 20 seconds (my best guess), and I thought to myself, \"Here we go again...!!!\"..... At which time, I said to my husband, as calm as could be.... \"I think you better turn right at the next road going south so you can stop and get a good look at that\", and I pointed out the window. He leaned forward and looked out the front window towards the south and saw the object flashing on and off heading east in a straight line, and said to me, \"That's an airplane\". AND....my response was, \"Airplanes don't fly in high speed reverse and go up and down and then go back to what seems to be a straight flight path...!!!!\" I continued to watch this object, with its sporadic flight (for maybe another 40 to 50 seconds) and at the very next road south, my husband turned right and stopped the vehicle. He observed it for maybe 20 to 30 seconds out his driver's side window... (it was still heading east) until it dropped below the tree line. I was not able to see it once we turned off M-55.... but I asked him if he still thought it was an airplane, and he said that he wasn't sure. We returned to M-55 and continued east without seeing the object again. Please Note: I do not know the name of the road that we turned south on... It was somewhere between Rifle River Trail and M-65. Also... there was heavy cloud cover and there were no stars or moon as it had rained off and on all day. It was a damp, chilly evening and we saw little to no traffic for the 30 minute drive from this point back to our cottage. For the remainder of the drive, we were mostly quiet.... I did talk a little bit about what I had just seen and I teasingly accused him of \"summoning\" whatever it was. Once we got to the cottage I figured the subject was closed, but when we got inside, he asked me if I was going to file a MUFON Report. I asked him why I would file a report if it was just an airplane, and he said that when we pulled off M-55 he had observed the object heading east in a straight line and that it really \"bothered\" him when it changed directions and flew backwards at the same rate of speed that it had been going forward. He seemed quite concerned by this sighting and stated, \"That was no airplane...!!!\" I jokingly said, \"See what happens when you make fun of me...!!!\"...."],"Summary":"White flashing light that seemed to follow a flight path... abruptly changes direction... then returns to original flight path...","Date of the Event":"08/16/2012 10:15 UTC","Region":"Michigan","Country":"United States","Disposition":"Unresolved","Longitude":"-84.231013","files":["/var/www/straped/mufon/html2text/42091.html.txt","/var/www/straped/mufon/org/42091.html"],"Viewing Distance":"Unknown","Source":"MUFON"}