{"Latitude":"36.779941","Object Features":"Unknown","Case Number":"42094","map":"<A HREF = \"http://maps.google.com/maps?q=36.779941,+-119.416412(42094)&iwloc=A&hl=en\"> mufon case (42094) map </A>","Longitude":"-119.416412","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Region":"California","Log Number":"US-08282012-0006","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/42094.html.txt","/var/www/straped/mufon/org/42094.html"],"Object Shape":"Sphere, Star-like","trends":["There have been no other sightings in Cayon Country","This sighting has never been favorited."],"divs":["Sighting DetailsWas at Fair Oaks county public park walking my dogs with my husband. I saw a blue orb, star like then it moved NE and changed colors to green, neon pink and back to blue. Then it dissappeard behind the mountains and houses and then it came back. It changed direction to SE and changed color to white, violet and back to neon blue. Made a few cicles and disappeard behind the houses and came back NE. Then it hovered for a few minutes making circles and the lights went off and for a couple secounds I saw it move SE and then I lost it. I always look up at the stars when I go out at night and I know the difference between a plane, helicopter and spot lights. This was nothing like what I have seen before so it stood out because it was very bright neon blue. My husband thought it was a plane but there was no sound. I was kind of in awe and just stood there keeping an eye on it. There was a lot of people at the park but no else seem to look up and care or notice it. It was after it disappeared the 2nd time that my husband tried to convince me it was a helicopter until it came back, hovered and all the lights went off. I knew then it was a UFO."],"Summary":"Star like orb","Viewing Distance":"Over One Mile","City":"Cayon Country","Source":"MUFON","Date Submitted":"08/28/2012 04:30 UTC","Date of the Event":"08/27/2012 08:20 UTC"}