{"Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was walking out to my car at 11:55pm when I saw a triangle formation of lights with a red light blinking in the center heading my direction. The craft was flying from the north to the south.It made a very quiet rumble, almost the way a jet would make at a very high altitude only this object was extremely low. Followed by another craft exactly like it 1 minute later. I tried to take a picture with my phone's camera but it is quite a worthless phone. I have heard many types of jets, and this was very quiet. It was probably traveling at least 20 to 30 miles an hour, but that is just a guess. I could barely make out the shape and it was definitely triangular. I thought it might be a stealth craft of military type since there were two in a row. The first flew over my house followed by the second about a minute later. I have a tactical flashlight (Fenix PD30) that I carry at night and attempted to signal it, just goofing around, but it didn't do anything but continue on it's southern trajectory ( i checked it with a compass later). The two craft then flew out of my field of view as they continued south. These may very well have been military aircraft but I have never heard a jet that big fly so quietly."],"Tags":"City","trends":["There have been 5 other sightings in Greenwood","There were no other sightings in Greenwood on or around August 27th 2012"],"files":["/var/www/straped/mufon/html2text/42093.html.txt","/var/www/straped/mufon/org/42093.html"],"Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","City":"Greenwood","Log Number":"US-08282012-0005","Latitude":"34.2088","Disposition":"Unresolved","Case Number":"42093","Date Submitted":"08/28/2012 04:04 UTC","Date of the Event":"08/27/2012 11:55 UTC","Region":"South Carolina","Longitude":"-82.18969","map":"<A HREF = \"http://maps.google.com/maps?q=34.2088,+-82.18969(42093)&iwloc=A&hl=en\"> mufon case (42093) map </A>","Object Shape":"Triangle","Country":"United States","Summary":"3 white lights in perfect triangle, red light in center blinking, flying very slow, muffled rumble noise","Object Features":"Unknown"}