{"files":["/var/www/straped/mufon/html2text/42106.html.txt","/var/www/straped/mufon/org/42106.html"],"Sighting Duration":"Undisclosed","Region":"Illinois","Case Number":"42106","trends":["There have been no other sightings in Middletown","This sighting has never been favorited."],"Longitude":"-89.579269","Viewing Distance":"101-500 Feet","Object Shape":"Disc","Source":"MUFON","Tags":"City","Latitude":"40.098181","Date of the Event":"05/30/2012 06:37 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsIn late May of this year I was taking pictures while walking my dog in a field in rural Illinois. After taking the pictures I shelved the camera until my next outing. I always have a camera on my walks to take shots of my dogs and in nice settings and of anything else I may run across. Father's Day my wife had purchased me a new camera so there the camera sat for 2 months. Well I finally dusted off the old camera the other day and decided to get the pictures off of it to add to my albums. When I was looking at one of the pictures I took I noticed a object in the corner of the picture. I blew it up and can not identify it. I have had the Illinois Audubon society look at it and they tell me it is not a bird. I've had a meterologist take a look to ensure it is not a weather balloon. I have even asked someone I know in law enforcement about the possiblility of it being a unmanned drone for marijuanna plant detection and they assured me that my area had none of those. Would it be possible to have someone take a look to see if you can identify what this may be? I know what it looks like at first glance, but I would like your opinion on this. This is a cropped version of the original picture and has been enlarged. If you would like a copy of the original please let me know. Thank You for your time, Richard Bonnett"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.098181,+-89.579269(42106)&iwloc=A&hl=en\"> mufon case (42106) map </A>","Country":"United States","City":"Middletown","Disposition":"Unresolved","Date Submitted":"08/28/2012 02:27 UTC","Summary":"reviewing photo of my dog and discovered the object in the upper portion of the photo","Object Flight Path":"Stationary,Unknown","Log Number":"US-08282012-0018","Object Features":"Unknown"}