{"Summary":"Lights in the sky that changed direction and disappeared. Several brightened or flashed once.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42119.html.txt","/var/www/straped/mufon/org/42119.html"],"divs":["Sighting DetailsAll of the lights we saw were about as bright as the dimmest stars you could see clearly with the naked eye that night, moved faster than airplanes and slower than shooting stars. We saw all of them while sitting with our heads leaned back, and all of the lights were more or less directly straight above us in the sky. I'm not sure how to measure this sort of thing, so I used the width of my thumb, held at arms length with one eye closed. August 25th, around 2 am we were on a dock at Daisy Bay in Lake Vermilion. The entire horizon was ringed with clouds and there was lightning in several directions but the sky above us was perfectly clear. We were watching stars and suddenly saw some lights that didn't look like any of the planes or shooting stars we had been watching every night for a few days. The first light was pretty much straight up in the sky. It was a steady light about as bright as the smallest stars we could see. It was moving faster than an airplane west to east, and after moving about 5 thumb widths, it disappeared. We were both surprised but before we could say much, 2 more lights appeared 1-2 thumb widths east of the spot where the first one disappeared. They were the same brightness and about a thumb width away from each other. They moved about 1-2 thumb widths northeast, turned about 15 degrees at the same time, then continued north about 5 thumb widths before very slightly brightening and disappearing. They were both moving the exact same speed and stayed the same distance apart the entire time. A few minutes later, the same type of light appeared, maybe 10-15 thumb widths northeast of the spot the first 3 appeared in, moved 5 thumb widths going northwest and brightened or flashed much brighter than the others right before it disappeared. We both got the impression somehow that they were extremely high up. There were no sounds, smells, vapor trails or anything besides this small light. We sat on the dock for hours, looking at different parts of the sky and didn't see anything else like it. August 27th, around 2 am again we saw two more of the lights. Again they were almost straight above us and the same brightness as the smallest star visible. One moved west to east about 3-4 thumb widths and went out. Almost as soon as it went out, another one appeared and moved south to north, brightened or flashed once, and went out. Their paths would have made an x if they were flying at the same time. Again, the night was perfectly clear. We were tired, so we only sat out watching the stars about an hour that night, but did see several planes and shooting stars during that time. I'm not sure if that's anything worth reporting, but here's my explanation of how they were different from any planes or shooting stars that we saw both nights. There were no clouds anything could have disappeared behind and if they had, none of the objects reappeared even when we kept staring for many minutes after they vanished. The planes we saw always had a steadily blinking light, even if they were flying so high you could barely see. They never disappeared and only turned in wide arcs or stayed straight. These lights appeared at least twice as fast as any plane we saw in any part of the sky, but were not as fast as any shooting stars we saw. The shooting stars sometimes changed brightness but they never turned or flashed the same way. We both kinda figured it was some sort of plane, but couldn't explain why they disappeared in a clear sky or why they would have shut off their lights. If they were planes, they would have had to keep their lights off for quite a distance, because we were staring straight up at the sky most of the night and never saw them reappear anywhere. We sat out 2 other clear nights and one night with scattered cloud cover and didn't see anything else similar."],"Longitude":"-92.274605","Latitude":"47.805475","City":"Tower","map":"<A HREF = \"http://maps.google.com/maps?q=47.805475,+-92.274605(42119)&iwloc=A&hl=en\"> mufon case (42119) map </A>","trends":["There have been no other sightings in Tower","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Region":"Minnesota","Tags":"City","Date Submitted":"08/29/2012 02:01 UTC","Object Features":"None","Log Number":"US-08292012-0001","Case Number":"42119","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"08/25/2012 12:00 UTC","Object Shape":"Star-like","Country":"United States"}