{"Country":"United States","Date of the Event":"08/19/2012 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.06304,+-74.750374(42114)&iwloc=A&hl=en\"> mufon case (42114) map </A>","Log Number":"US-08282012-0025","City":"Stone Harbor","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Summary":"watched a black ball shaped craft with a flame propellent within minutes a second one showed up, changed shape and disappeared","Case Number":"42114","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Latitude":"39.06304","files":["/var/www/straped/mufon/html2text/42114.html.txt","/var/www/straped/mufon/org/42114.html"],"Object Shape":"Circle, Other","Object Features":"Unknown","trends":["There have been no other sightings in Stone Harbor","This sighting has never been favorited."],"Region":"New Jersey","Weather Factors":"Unknown","Longitude":"-74.750374","divs":["Sighting DetailsI was relaxing after a day at the beach, sitting on my deck enjoying the view as the sun was low and near setting. As I was looking in the Southwestern sky, over the Mainland, I noticed an object that I nearly dismissed as a plane. The orange-ish glow emanating from the craft reminded me of a sighting I had a year earlier. It moved like a normal aircraft, but as I focused on it, I realized it was unusually \"black\". It appeared to have a flame-like propellent that eventually disappeared. The dot of black remained visible in the sky until it disappeared. within a minute, my husband joined me and I excitedly told him about what I saw and almost immediately saw another craft on the same flight pattern. He went inside to get our binoculars. I asked him to describe what he was seeing, as it was a great distance away. He described the same flame and black circle. It appeared to be moving away, on an angle and the flame disappeared again. I was unable to see it with the naked eye, but he could see the black shape, it changed from being solid and circular to \"stretched out sideways and up and down. After it \"morphed\" a few times, it simply disappeared. All this happened while the sky was still light. No other foreign objects were seen after that, but a lot of normal air traffic, easily identified by their flashing lights etc... I was excited to see the same kind of anomaly in the sky and my first thought about the disappearance was a possible \"worm hole\". I believe it is a natural way of time-space travel. I did not have any fear of this sighting, just very glad for the \"shared\" experience with my husband."],"Date Submitted":"08/28/2012 06:39 UTC","Source":"MUFON"}