{"Weather Factors":"Unknown","Object Shape":"Square, Rectagular, Other","Latitude":"33.512764","City":"Phoenix","Log Number":"US-08282012-0023","map":"<A HREF = \"http://maps.google.com/maps?q=33.512764,+-112.109382(42112)&iwloc=A&hl=en\"> mufon case (42112) map </A>","Longitude":"-112.109382","Date Submitted":"08/28/2012 05:30 UTC","Date of the Event":"08/03/2012 10:34 UTC","Case Number":"42112","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Wings, Other, Unknown","Region":"Arizona","files":["/var/www/straped/mufon/html2text/42112.html.txt","/var/www/straped/mufon/org/42112.html"],"Summary":"Flew towards me did a u-turn then flew away and I followed it","divs":["Sighting Details1. I was driving home one night from a friends house in my truck headed east on Indian school rd. 2. I'm always lookin in the sky tryin to fInd something but all I ever usually see are planes and helicopters but this time I looked out my drivers side window above a loan buIlding I see a bunch of lights and my first thought was a helicopter but then I realized that's way to many lights for a helicopter so I pulled over into the Parking lot of a bussiness called Kelly paper and I took a picture but it must've been of another part of the sky cause it came out black and I was so amazed or astonished at what I was seeing I couldn't even think to take another picture I felt like if I looked away it would disappear . The object looked to be snapped like a cross with a very dark coloring with four lights going down the middle and the lights were nearly as wide as the object. It circular in shape and there was one light under each \"wing\" of the cross with two sets of beam like lights running down the front and. Ack of each \"wing\". When I was in the parking lot it flew towards me and did a u-turn directly above me and my truck which I w as still inside of and as it turned around it began to fly farther away and I expected to like go to \"light speed\" if u wanna call it that but it didn't it started accelerating away and I instantly thought this is a once in a lifetime thing I've gotta chase it so I got back on Indian school rd and headed west the direction the object was now flying but it was flying kinda diagonally over the streets so it was more like south west for the object and from the back it looked like a trapezoid I think is the right shape with 4 large lights running down the back also circular in shape and as wide as the object. As I drive down the road I noticed it stop over some neighborhoods just down the street and when it stopped for lights shown from the four corners of the \"wings\" and they were like a blue beam that might have extended 10 feet from the source and moved erratically. While it was stopped I turned south at 23rd ave and Indian school and zig zagged through the neighborhood and when I began to get close to the object again the four blue lights shut off or stopped or something and it took off again still south west and as I chased it through the neighborhood I had to stop cause here was a dead end but I nearly jumped out my truck and chased it on foot I felt like I was in a star wars movie or something the whole time and my hear was poVunding in my chest an I almost couldn't believe what haPpened to me that night. And I'll add on here the pic I have I believe is of a black sky but I kept it anyways but I do have a few \"drawings\" I made on the computer but my iPhone I'm guessing won't let me use your attach file buttons so please email me or something and I can attach the pics to an email response"],"Disposition":"Unresolved","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around August 3rd 2012"],"Viewing Distance":"21-100 Feet","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON"}