{"City":"Grandview","divs":["Sighting Details5:30 am Out on back deck drinking coffee and smoking a cigarette, saw a flashing light in my peripheral vision and looked up into sky, saw what I thought to be a star at first, but it was twinkling. Upon closer inspection, was able to see that there was a white light in the middle, then a green light flashing on one side and a red light flashing on the other side. Object appeared to be hoovering in the same area above a tree line high in southeast sky, early morning about to be sunrise. Husband came out and witnessed same thing and he reported seeing it when he was out earlier in the morning around 5 am, it was still there when I came out at 5:30 am. I went in house and came back out half hour later and it was gone. Husband reports that he continued to watch it and as the morning got lighter object appeared to float away into the distance. I did not see it anymore as the sky was lighter now and it was gone. We have since seen the same object the next day as well at the same time and the same actions from the object."],"Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Latitude":"38.898177","Longitude":"-94.492409","Log Number":"US-08282012-0027","Date Submitted":"08/28/2012 07:32 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.898177,+-94.492409(42116)&iwloc=A&hl=en\"> mufon case (42116) map </A>","Object Shape":"Disc, Flash, Star-like","Country":"United States","Date of the Event":"08/27/2012 05:30 UTC","Viewing Distance":"Over One Mile","Summary":"blinking orb with white, red and green lights flashing","Object Flight Path":"Hovering then path","trends":["There have been 4 other sightings in Grandview","There were no other sightings in Grandview on or around August 27th 2012"],"files":["/var/www/straped/mufon/html2text/42116.html.txt","/var/www/straped/mufon/org/42116.html"],"Case Number":"42116","Object Features":"Unknown","Region":"Missouri","Tags":"City"}