{"map":"<A HREF = \"http://maps.google.com/maps?q=46.835081,+-92.068976(42110)&iwloc=A&hl=en\"> mufon case (42110) map </A>","Object Shape":"Star-like","Date Submitted":"08/28/2012 04:45 UTC","Log Number":"US-08282012-0021","Viewing Distance":"Unknown","Summary":"Saw a star or satellite like object, followed by two additional lights, cross the sky","divs":["Sighting DetailsI am back home visiting Minnesota from my permanent residence in Oklahoma. I was with an old friend at a cliff we frequented throughout our childhood in the woods. No city lights makes for great star-gazing. We were smoking cigarettes and enjoying conversation. We observed several airplanes, and later a helicopter. My friend is an amateur pilot and so he pointed out their approximate altitude, the flashing indicator lights, the noise that we could just faintly hear as they passed by. My friend saw a shooting star as we were standing talking. The week before he and I and another friend observed another shooting star while on a fishing trip. Not wanting to miss another, if there were to be any, I laid on the ground and we stared upwards. After some time without seeing any movement, I noticed what I thought was a shooting star. But it was traveling much too slowly to be a shooting star. We thought perhaps it was a satellite, which it could have been, but my friend thought it was moving too quickly to be a satellite. It entered our field of view from the left (S-SW) and made its way across the sky to our right (N-NE). To me it seemed to be extremely high altitude. Much higher than any of the airplanes or helicopter we saw earlier in the evening. There was no noise, no blinking lights. It passed overhead and continued to the right of our field of view. As it was crossing to the right, it got bright for a brief moment, and then disappeared. We did not see it again. We talked about what a strange thing it was to have observed, and guessed and discussed what it could have been. Not more than 5 minutes later, we saw a pair of star-like lights. They again entered from the left, and crossed our field of view to the right. They maintained equal distance from one another, and they flew behind one another. We tracked both of them much further across the sky than where we lost the first light. Eventually we lost sight of them, too. All three lights were no bigger than a distant star. Not as bright or as large as the stars of the big dipper. Much smaller, like a pinhole. They did not appear to make any sudden movements, they followed a straight path. But that path did not appear to me to orbit the earth. My friend suggested we lost sight of them as the moonlight stopped reflecting off their surfaces. I thought them to be extraterrestrial. My friend thought them to be perhaps military testing unmanned high-altitude vehicles. We stared at the sky for 30+ more minutes, but saw nothing more except another airplane at a much lower altitude."],"Latitude":"46.835081","Tags":"City","City":"Duluth","Weather Factors":"Unknown","Object Features":"Unknown","Case Number":"42110","Date of the Event":"08/26/2012 10:30 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","trends":["There have been 16 other sightings in Duluth","There were no other sightings in Duluth on or around August 26th 2012"],"Longitude":"-92.068976","Country":"United States","Disposition":"Unresolved","Region":"Minnesota","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42110.html.txt","/var/www/straped/mufon/org/42110.html"]}