{"Country":"United States","trends":["There have been 18 other sightings in Troy","There were no other sightings in Troy on or around October 22nd 2011","This sighting has been favorited 2 times.",""],"Summary":"{nd} 4 glowing/smoldering looking yellow/gold colored lights without sound traveled slowly above Troy, MI","Sighting Duration":"Undisclosed","Date Submitted":"08/28/2012 10:40 UTC","Longitude":"-83.14389","Region":"Michigan","divs":["sighting detailslast oct. while visiting troy, michigan my family member and i were driving into the subdivision where she lived when we noticed a bright smoldering looking orb floating slowly, without sound, approx. 500ft. above our car. my family member first saw it, since it was so bright from the car window. we slowed down and pulled over on the street we were on, got out of the car, when we saw 3 more lights appear. they maintained a diamond shape, and traveled in a sw direction. initially, when we saw the first light, it was so bright and large we knew we had never seen anything like it. i stepped away from the car to try and get a picture with my blackberry. as soon as i took the first picture i noticed the yellow\\gold lights seemed less bright. i continued taking 4 pictures in all and thought i actually didnt get anything on the last shot since it just looked like a dark night sky. when we drove one street away in the subdivision and looked closer at the pictures i took, we were very surprised to see each light look like 3 lights. then on the last picture, when enlarged it looks like a large ball of multi-colored lights. its been almost a year, weve asked family that works out of selfridge air base if they had anything to do with them, and they said \"no\". we remain curious of what it was we saw that evening."],"Object Features":"Unknown","City":"Troy","Weather Factors":"Unknown","Date of the Event":"10/22/2011 07:30 UTC","Log Number":"US-08282012-0027","Disposition":"Unresolved","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42117.html.txt","/var/www/straped/mufon/more/42117_submitter_file1__IMG1658.jpg","/var/www/straped/mufon/more/42117_submitter_file2__IMG1659.jpg","/var/www/straped/mufon/more/42117_submitter_file3__IMG1660.jpg","/var/www/straped/mufon/more/42117_submitter_file4__IMG1661.jpg","/var/www/straped/mufon/org/42117.html"],"Case Number":"42117","Object Shape":"Diamond, Sphere","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.610889,+-83.14389(42117)&iwloc=A&hl=en\"> mufon case (42117) map </A>","Latitude":"42.610889","Object Flight Path":"Straight-line path"}