{"Tags":"City","Country":"United States","Latitude":"36.131296","Case Number":"42122","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 29th 2012"],"Weather Factors":"Unknown","Log Number":"US-08292012-0004","Date of the Event":"08/29/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.131296,+-115.292338(42122)&iwloc=A&hl=en\"> mufon case (42122) map </A>","files":["/var/www/straped/mufon/html2text/42122.html.txt","/var/www/straped/mufon/org/42122.html"],"Summary":"Lights above clouds","Date Submitted":"08/29/2012 06:18 UTC","Region":"Nevada","Source":"MUFON","Viewing Distance":"101-500 Feet, Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was home in my backyard at night, I can only see them at night and only when there are clouds. I always look up whenever I'm outside so when I saw these lights, on top of a giant cloud, it caught my eye. I had no idea what it was when I saw this light show, but I thought it was very strange. I see groups of lights, hard to tell how many, but at least 4. They move around quickly and seem to each have their owna pattern, as if each one goes a different route but all traveling the same pattern. I live in Las Vegas so at night I can always see the beaming light from the Luxor, however I cannot see a source for these cloud lights. I have gone looking in my car and tried to find a source for these lights, and since Vegas is relatively small, I could not find any source on the ground that would explain why there are lights above the clouds. I first noticed these lights maybe a year or so ago. I saw them many nights on top of the clouds, then they just stopped for a few months and they have started up again. I lost sight of them when the clouds move. Also, I'm sure you'll think I'm crazy, but the clouds have all kinds of faces on them. I had my daughter look at them sometimes to see what she thought it looked like and she saw the same thing as I did I think I've covered all your criteria but if you'd like anymore info, I will do my best to get it for you. Any ideas what this could be?"],"Object Shape":"Circle, Cylinder, Oval, Sphere, Unknown","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Longitude":"-115.292338","Object Features":"Unknown","City":"Las Vegas"}