{"Longitude":"-84.34278","Sighting Duration":"00:03:30","Latitude":"46.526838","Country":"Canada","Source":"MUFON","Region":"Ontario","Object Features":"Unknown","Summary":"3/4 lights moving SE to NW and ascending, 1/4 moving SE to NW, ascended last","Date of the Event":"08/25/2012 09:12 UTC","divs":["sighting detailsat 2112-2115 pm, on aug 25, 2012, as i was standing outside my cab, speaking to my wife on my cell phone, i observed 3, then a fourth, bright objects my brain interpreted as flying orbs, or lights, travelling rapidly from the se horizon to the nw sky. 3 of the objects 'disappeared' by apparently ascending to the sky above. the 4th object stayed brightest longest, but then was obscured by a nearby tree, and was not observed either ascending, descending or anything else after it was obscured by the tree. as i was speaking on my cell to my wife, and trying to describe what i was seeing,she tried to see it too from our home, but didn't have her glasses on at the time, so was unable to corraborate what i described to her over the phone. when i first noticed them appearing over the horizon, i thought it was just some airplanes or helicopters. but as i watched them, and as all four appeared, it occurred to me they were travelling possibly 3 times faster than normal aircraft would, and the lights on them didn't blink or change colors. just stayed solid red\\pink, with what appeared to be a blue\\white haze around them. the half moon was about 35-40 degrees over the horizon, and from my perspective, all the anomalies travelled in a 'straight' path that took them 'under' the moon. they were in a staggered formation, with the lead one lower, then the next one higher, the third one lower and the forth one higher. that's what made me think at first they were helicopters. the last one to appear was the first one to ascend out of sight, the next one to ascend out of sight was the first one to appear. [i think it was the first one.] i don't know what happened to the second one in the formation, but the third was the one that stayed in my field of vision the longest, maybe up to a minute, and stayed the brightest. when it was obscured by a nearby tree, that was the last i saw of it. when i had a chance to reflect a little while later, i was reminded of the lights over lake erie, and they resembled them in appearance, from what i could remember from seeing youtubes of them. only these ones were moving, not standing still. well, that's the end of my ufo experience. they remain unidentified, flying objects to me. unidentified. hmmmm......"],"Weather Factors":"Unknown","City":"Sault Ste. Marie","Log Number":"CA-08292012-0003","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 6 other sightings in Sault Ste. Marie","There were no other sightings in Sault Ste. Marie on or around August 25th 2012"],"Disposition":"Unresolved","Object Shape":"Sphere, Star-like","Case Number":"42121","Object Flight Path":"Straight-line path,Path with directional change","Tags":"City","files":["/var/www/straped/mufon/html2text/42121.html.txt","/var/www/straped/mufon/org/42121.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.526838,+-84.34278(42121)&iwloc=A&hl=en\"> mufon case (42121) map </A>","Date Submitted":"08/29/2012 05:12 UTC"}