{"Date Submitted":"08/29/2012 04:11 UTC","Sighting Duration":"Undisclosed","Summary":"shape and size of a large star","Region":"Attica","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"Unknown","Log Number":"GR-08292012-0009","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.985286,+23.73546(42127)&iwloc=A&hl=en\"> mufon case (42127) map </A>","Object Shape":"Star-like","City":"Athens","Latitude":"37.985286","Date of the Event":"08/18/2012 10:30 UTC","files":["/var/www/straped/mufon/html2text/42127.html.txt","/var/www/straped/mufon/org/42127.html"],"Source":"MUFON","Country":"Greece","divs":["Sighting Details1. i was sitting at the balcony of my home around 22.30, eating watermelon and looking at the stars. no moon that night and no clouds. 2. as i was looking up high, suddenly and unexpectedly, a ''star'' showed up in the middle of the sky and started orbiting vertically upwards. i couldn't understand its direction because it looked like it was moving in a vertical route. its orbit lasted about 4 minutes and then disappeared in the same way as it appeared. after a couple of minutes i saw the same star that appeared from a different point with an east-to-south direction and it disappeared again after 2 minutes but AGAIN after 10 minutes (i think-more or less) i saw exactly in the middle of the sky a very shinny star which appeared out of nowhere, it was bigger than the one i saw before and it was shining steadily for about 3-5 seconds and then i saw something like a flash ligh and abruptly, it disappeared. (this last part was the most exiting of everything i saw that night). i didn't leave my spot. i was waiting there for the next 2 hours hopping to see something, anything..but nothing happened. 3. if we assume these were 3 different objects then they all were looking like shiny stars except the last one which was shinier and bigger than the other 2. 4. the first ''star'' showed up in the middle of the sky and it was moving about 4 minutes in a steady route vertically upwards, then it disappeared. suddenly, 2-3 minutes later i saw it again coming from east and moving south in a steady orbit which disappeared some seconds later and the third and last time was when i saw after 10 minutes, a very shiny star that showed up in the middle of the sky, it stood there for 3-5 seconds and then it made something like a flash light and unexpectedly disappeared. i have to say there were no clouds. i also saw one airplane before and 2 after this event. what i saw had nothing to do with airplanes..because their lights were steady all the time..their orbits were awkward, they appeared and disappeared out of the blue..in the middle of nowhere. there was no airplane sound and these things appeared very high up in the sky. they had almost the same altitude with the other stars. 5. my feelings .. i don't know, curiosity, no fear at all. i enjoyed it, it was a very out of the blue spectacle. 6. i've already answered this question. thank you"],"Longitude":"23.73546","trends":["There have been 6 other sightings in Athens","There were no other sightings in Athens on or around August 18th 2012"],"Tags":"City","Case Number":"42127"}