{"Object Flight Path":"Straight-line path","City":"Bundaberg","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Date of the Event":"03/15/2011 05:03 UTC","Log Number":"AU-08292012-0011","Summary":"I witnessed 3 groups of 2 black spheres travelling in a north-east, south-west direction.","Latitude":"-24.864963","Longitude":"152.348653","Tags":"City","divs":["Sighting DetailsI was picking up my Son from daycare, and as we were walking to the car I look up to the sky and notice 3 groups of 2 black spheres (the groups themselves were spaced away from each other, but the objects themselves were about 10 metres away from each other) flying straight as an arrow making no sound and emitting no light. The 2 following in the rear, suddenly switched positions with each other. They did not slow down, nor did it look like that they were affected at all by the atmosphere! I didn't know what to make when I first saw them, I even looked away to make sure that my eyes weren't playing tricks (which they weren't). The objects were black in colour, no light was being emitted from them and the same can be said for sound. Nothing. From the north-east to the south-west they flew, steady no deviation from their flight path. And the 2 in the rear when they switched, if I blinked at the same time, I would not of noticed. I only lost sight of the objects once they flew behind trees and buildings. I was in such shock and awe! I could not explain what I was seeing, but, plain as day they were there. I went back home told my wife and she was just as amazed as I was. Since then I have not seen anything like it, and even before the sighting I'd never seen anything remotely close to what I saw. Thank you for reading, Matt."],"Region":"Queensland","Source":"MUFON","trends":["There has been one other sighting in Bundaberg","There were no other sightings in Bundaberg on or around March 15th 2011"],"Sighting Duration":"Undisclosed","Country":"Australia","map":"<A HREF = \"http://maps.google.com/maps?q=-24.864963,+152.348653(42129)&iwloc=A&hl=en\"> mufon case (42129) map </A>","Object Features":"None","Case Number":"42129","Object Shape":"Sphere","Weather Factors":"Unknown","Date Submitted":"08/29/2012 06:48 UTC","files":["/var/www/straped/mufon/html2text/42129.html.txt","/var/www/straped/mufon/org/42129.html"]}