{"divs":["Sighting DetailsI have been coming outside almost every other night with my mom to see the stars, ever since we first witness pulsating strange lights in 2010. We never knew what it was. We saw them two more times since 2010. Anyways, we have been seen strange things happening in the sky ever since. We have seen white lights or objects that look like satellites, disappearing. We have seen airplanes chasing these lights. But, we are now witnessing ORBS that fall from the sky. They look like shooting stars, but they fall down, just like a meteor would. At first, we thought they were meteors, but then we saw that they fell almost a the same direction and they were frequent. They are also different colors,sometimes they are blue, red , orange, white, and yellow. Another weird thing we notice is that when we see these strange lights, orbs. EXACTLY, DAYS later there is an earthquake happening. So we decided to do research and this and so far we found out that they might be EARTHQUAKE LIGHTS. I don't know what they are, but there is a strange thing going on here."],"City":"Santa Clarita","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"08/30/2012 12:01 UTC","Case Number":"42139","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around August 25th 2012"],"Object Features":"None","Source":"MUFON","Summary":"Meteros, Shooting Stars look-a-like ORBS.(EARTHQUAKE LIGHTS)","Date of the Event":"08/25/2012 09:00 UTC","Object Shape":"Fireball, Star-like","Weather Factors":"Unknown","Country":"United States","Log Number":"US-08302012-0001","Latitude":"34.415755","Region":"California","Longitude":"-118.533886","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/42139.html.txt","/var/www/straped/mufon/org/42139.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.415755,+-118.533886(42139)&iwloc=A&hl=en\"> mufon case (42139) map </A>"}