{"divs":["Sighting DetailsI was out taking pictures, in the back yard, of the moon a bit after sunset because it's very smokey in our area which makes the moon glow with an orange or red hue. I turned around to return to the house and saw what I thought for a moment might be Mars. It was really red-pink, like neon or florescent. I snapped a quick photo of it and went into the house to get my son so he could see how strange and bright it was. When we went out the front door we could not see it anymore, I thought maybe it was the trees in the way, so we walked around to the back yard again and it was there again- but this time it was moving though. Both my son and I saw it move, I was not fast enough to catch a photo of it because at the time we were looking for more, we thought it might be a meteorite or something like that- and the color would be because of the smoke. But as we looked around to see if there were more, it diapered. Then we saw an airplane, at first I thought, \"Oh it was just a plane.\" But the airplane had no lights on, whatsoever. I tried to snap 2 photos of the airplane and they didn't come out at all. That made me think that the light must have been even brighter than I had originally believed. I don't have a super powerful camera, but I could see the airplane with my naked eye, easily. I was about 20-25 feet from the house in the first photo and more like 10 feet in the 2nd and 3rd attempts to photograph the plane. My son agreed the bright pink object was moving and that it must have been incredibly bright to show up like that as even my pictures of the moon were not that impressive. I will include a photo of the moon which is in the opposite direction, East, as the strange light, West. Neither my son nor I saw the plane before the light even as we were looking into the sky to find more meteorites. The plane would have been right of the bright light if it had showed up. I only included the plane photos because I'm not any sort of expert and don't know if it's worthy of analysis. Don't know if it's anything at all- but hey, why not have fun with it. Note: While my time is approximate it is definitely within 5-10 minutes."],"Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"Strange star-like light at dusk, then moved slowly, bright, got one photo.","Country":"United States","Latitude":"45.174356","Region":"Idaho","Weather Factors":"Unknown","Date Submitted":"08/29/2012 11:27 UTC","Date of the Event":"08/29/2012 08:35 UTC","Case Number":"42136","Object Shape":"Sphere","Log Number":"US-08292012-0018","files":["/var/www/straped/mufon/html2text/42136.html.txt","/var/www/straped/mufon/org/42136.html"],"trends":["There have been 3 other sightings in Salmon","There were no other sightings in Salmon on or around August 29th 2012"],"Longitude":"-113.900524","Disposition":"Unresolved","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=45.174356,+-113.900524(42136)&iwloc=A&hl=en\"> mufon case (42136) map </A>","Object Flight Path":"Hovering then path","City":"Salmon","Source":"MUFON"}