{"Object Flight Path":"Other","divs":["Sighting DetailsI was driving home from the night shift at a grocery store in Escanaba Mi.. I had gotten off work a little earlier than usual (it was between 4-5am) and was driving along US 2 & 41 M-35 north headed home to Gladstone. I came along the stretch of Highway right before Gladstone where you travel along lake Michigan for about a mile or so and happened to look up at the sky over the bay. What I saw has changed my life. I saw three very bright lights. I would describe them as being much brighter than the brightest stars in the night sky. But these were not stars, satellites, meteors, planes, jets, ball lightning, etc. . All three of these lights were traveling very fast and turning around each other in a very erratic manner. They would come close to each other and twist around each other making 90 degree turns without slowing down or touching. These strange maneuvers lasted about 20 seconds. Then all three lights spread out along the horizon (over Gladstone), stopped, and then streaked north simultaneously at a fantastic rate of speed over the horizon. Now I have watched the sky for years and have never seen anything like this. These could not have had human pilots as they should not be able to withstand the forces involved in making 90 degree turns without slowing down (from what I have read the laws of physics would have some problems with this also)or traveling at the speeds I saw. I have also seen plenty of aircraft over the years from the KI sawyer Air Force base north of here when it was still operational and this was nothing like any of those. (it closed in the1990s) When I had seen this I had thought that this was a once in a lifetime experience but I was wrong. Two weeks later as a friend and I walked out of my house at around 2am we both happened to look up and saw one of those same lights speed above us, stop, and then streak north just like the last time except I was below it this time. I was happy that someone else had seen this. Now I don't know what these lights were but every possible conclusion I come up with is somewhat troubling."],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","trends":["There have been 4 other sightings in Gladstone","There were no other sightings in Gladstone on or around September 15th 2001"],"City":"Gladstone","map":"<A HREF = \"http://maps.google.com/maps?q=45.857044,+-87.013575(42130)&iwloc=A&hl=en\"> mufon case (42130) map </A>","Date Submitted":"08/29/2012 06:56 UTC","Region":"Michigan","Date of the Event":"09/15/2001 12:00 UTC","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Case Number":"42130","Latitude":"45.857044","Weather Factors":"Unknown","Longitude":"-87.013575","files":["/var/www/straped/mufon/html2text/42130.html.txt","/var/www/straped/mufon/org/42130.html"],"Object Shape":"Sphere","Sighting Duration":"00:00:20","Summary":"I witnessed 3 orbs making very chatoic manuevers around each other until they streaked north.","Log Number":"US-08292012-0012","Country":"United States"}