{"divs":["Sighting DetailsWalking my dog in st Johns church yard Workington UK, at approximarely 9.30 I saw a stationary red light to the North East. I had just before seen a low flying plane, and I was trying to keep my eyes on it's flight path, I always do that, I'm a bit of a plane geek. I noticed the object appearing to hover above wind turbines on the coast about 2 miles distant from where I was. However there was no visual comparison to know if that is where it was hovering, or closer or further away. Because of it's deep red colour I knew it wasn't any kid of star or planet and also the cloud cover was comprehensive. Whatever this was, it was below cloud cover. I did think maybe, that because there is a new bridge being built after our 2009 floods, it might have been some kind of warning light on a crane cable or something like that, but as I continued to walk towards the bridge, it kept it's orientation above the wind turbines. It was unblinking, it was steady it was about the magnitude I would expect from Jupiter when visible, but looked bigger than a star, it was not a pin prick, it was a red disc. And I mention the colour again, it was a proper deep artificial red. While walking towards the bridge, various buildings put it out of sight, but when I had clear line of vision it was still there, in the same spot, not apparently travelling as a fixed light closer to me would have done. I am an amateur astronomer, I have had an interest in the night sky since I was 6. I know when I have seen a star or planet or sattelite. I do notknow what this was. I am prepared to believe that somewhere it may have been a fixed light on something, but knowing the coastal area as I do, at that elevation and with no \"apparent travel\" as I moved, I can only assume it quite far away and not suspended by any cable I know of. The closest red lights of that colour at Anthorn early warning detection system about 25 miles away, and they are not visible ever from that location. eventually after it not moving I had to take my dog back indoors. This is where I always walk my dog of an evening and I have never seen it before, I will look again tomorrow but do not expect to see it I do not know what it was"],"Summary":"bright stationary, deep red light, under cloud cover, No stars visible","files":["/var/www/straped/mufon/html2text/42134.html.txt","/var/www/straped/mufon/org/42134.html"],"Country":"United Kingdom","City":"Workington","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=54.644299,+-3.554065(42134)&iwloc=A&hl=en\"> mufon case (42134) map </A>","Log Number":"GB-08292012-0016","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"08/29/2012 09:30 UTC","Case Number":"42134","Date Submitted":"08/29/2012 09:16 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Star-like","trends":["There have been no other sightings in Workington","This sighting has never been favorited."],"Object Features":"None","Latitude":"54.644299","Longitude":"-3.554065","Region":"England","Object Flight Path":"Stationary","Weather Factors":"Unknown"}