{"Region":"Kansas","Tags":"City","Object Shape":"Oval, Square, Rectagular, Star-like","Latitude":"38.308351","Disposition":"Unresolved","Date of the Event":"08/29/2012 09:57 UTC","Log Number":"US-08292012-0020","City":"Hartford","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"Unknown","Country":"United States","Case Number":"42138","files":["/var/www/straped/mufon/html2text/42138.html.txt","/var/www/straped/mufon/org/42138.html"],"Source":"MUFON","divs":["Sighting DetailsMy wife and I were driving through the country for a night drive, we often look at stars. We were 5 miles outside of town to the east of Hartford. On our way back, my wife saw what appeared to be a brilliant orange star off to the SE of Hartford. I had pair of bushnell10x24 binoculars which I used to look at the \"star\" because we have never seen something like that before. The object I estimate was 3 to 4 miles away from our position and in the binoculars pulsated orange red and yellow in that order. Unsure of what it was we drove closer towards it to get a better view. As we were driving towards it estimated two miles closer, we pulled over and turned the lights off in our van, I got out, I steadied my arms on the van and looked through the binoculars. The object then started racing towards us. My wife and I both became scared, we got into our vehicle and took off down the dirt road at 45 MPH. The object then ran parallel with the van until it was positioned directly over us at which we stopped the vehicle. I have no idea why we stopped we were both so scared. We looked at the object directly above us, no more than two telephone poles higher than our van, then it slowly took off towards the east with just a very low humming noise that sounded like a distored motor underwater. And then the object just took off, in the blink of an eye it just took off to the East. Now that my wife and I are sitting here writing this when I think of this I have goose bumps and eerie feeling and unable to comprehend what I've seen and how fast it was traveling."],"Longitude":"-95.955823","Viewing Distance":"21-100 Feet","Date Submitted":"08/29/2012 11:55 UTC","trends":["There have been no other sightings in Hartford","This sighting has never been favorited."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=38.308351,+-95.955823(42138)&iwloc=A&hl=en\"> mufon case (42138) map </A>","Summary":"was thought to be a star then flew towards vehicle at highspeed then hoverd,then high speed flew away."}