{"Weather Factors":"Unknown","trends":["There have been 16 other sightings in Ocean City","There were no other sightings in Ocean City on or around August 28th 2012"],"files":["/var/www/straped/mufon/html2text/42131.html.txt","/var/www/straped/mufon/org/42131.html"],"Object Shape":"Sphere","Longitude":"-75.077316","City":"Ocean City","Date Submitted":"08/29/2012 08:22 UTC","Tags":"City","Sighting Duration":"Undisclosed","Region":"Maryland","Source":"MUFON","Case Number":"42131","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.340503,+-75.077316(42131)&iwloc=A&hl=en\"> mufon case (42131) map </A>","Date of the Event":"08/28/2012 11:15 UTC","divs":["Sighting Detailswe were walking on the beach. my wife and i and our kids.. we were walking north on the beach and we noticed a bright orange light at waters level as far up the coast as we could see . the light moved at an angle up and toward the ocean. sseveral minutes later another appeared in the same spot and traveled in the exact path as the other. then a ghird appeared in the same spot and once again followed the others. once the first one got ao far it just dissapeared. it didnt fade out just vanished. as the second and third got to the same point theu also vanished. the fourth cam shortly after thetird but this one stopped several times and then moved left and right slightly and thrn ascended farther up . this happened several times.my wife and i tried taking a photo o my pho e but nothing showed up unfortunatley. the lights were all spaced uniformly and teaveled at a high rate of speed. it is hard to gauge size because ofth distance but the lights were very bright and pilsating. fhere were no other colors other then the orange to which i could have attributed it to an aircraft. this in my oponion was a ufo sighting. unless theilitary was doing something over the ocean last night."],"Log Number":"US-08292012-0013","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path,Path with directional change","Summary":"bright orange lights spaced evenly starting on horizon moving upward and easterly last one moved left and right and also stood still","Latitude":"38.340503","Disposition":"Unresolved"}