{"Disposition":"Unresolved","Summary":"Pulsating White with green/red/blue lights stationary like a star for30 minutes then shot away","Date Submitted":"08/30/2012 12:08 UTC","Tags":"City","divs":["sighting detailsaugust 28th 2012: this is my third sighting of this in the last 4 days. i go outside 4 or 5 times a night to get air. 4 days earlier saw a star out of place from what i normally see. i study the stars i can see every night. in the se sky at 40 degree or so. unlike normal stars this one was pulsating white\\green\\red\\blue thought it was a plane though i see them all the time and it didn't seem to be anything i had seen before. as i was watching it for 2 or 3 minutes it suddenly darted right at incredible speed and then just disappeared. i tried to forget about it though i told my son. two nights later i saw it adain except this time in the nw sky and for about twice as long. i ran to get a camera after 5 minutes of obsercing it. and wheni came back outside it was gone. chalked it up to just weird stuff, then the following night, last night, i saw it again in about the same position as the night before only the time was later than the night before. this time it stay stationary for at least 40 minutes and i filmed it. i also studied it with binoculars. then as i stop filming and put my camera down i looked back up and it was speeding away much faster the any plane could move. that when i decided i would report it. the film i will have to unload from 8mm to digital so i can submit it. it will take a few days."],"trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around August 28th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.3446,+-80.02415(42140)&iwloc=A&hl=en\"> mufon case (42140) map </A>","Source":"MUFON","Region":"Pennsylvania","Log Number":"US-08302012-0002","Object Features":"Unknown","Longitude":"-80.02415","Date of the Event":"08/28/2012 12:00 UTC","City":"Pittsburgh","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Circle, Unknown","Case Number":"42140","Object Flight Path":"Stationary,Other","files":["/var/www/straped/mufon/html2text/42140.html.txt","/var/www/straped/mufon/org/42140.html"],"Latitude":"40.3446","Sighting Duration":"Undisclosed"}