{"Source":"MUFON","Latitude":"34.338891","Tags":"City","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.338891,+-118.420485(42147)&iwloc=A&hl=en\"> mufon case (42147) map </A>","Case Number":"42147","Date Submitted":"08/30/2012 02:12 UTC","files":["/var/www/straped/mufon/html2text/42147.html.txt","/var/www/straped/mufon/org/42147.html"],"Object Shape":"Diamond, Sphere","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around August 25th 2012"],"Object Flight Path":"Path with directional change","Object Features":"Unknown","Disposition":"Unresolved","Country":"United States","divs":["Sighting DetailsWe witnessed a RED Orb Lift off out of a pit at the Mcclay Airfield, it had white sparkler like rods out of the side, the person flying it could be seen in an outline. Later at home this device had been placed below the moons orbit and to a casual observer it looked like a RED Orb was below the Moon, white stars shot off to the sides and did 90 degree directional shifts. I believe this to be a hoax set off by someone at the airstrip, they tried to hide while launching it, we were the only witness to the launch. Other valley reports can be debunked if you consider the location of the airstrip in relation to where it was seen, at the correct angle it can appear to be miles high. The red sphere was probably a balloon with an RC motor, the white stars were probably gliders with some sort of bright lights, I suspect the balloon and glider were controlled for ultimate hoax, I have pix of it taking off but not very clear. This would have made a great hoax because of all the people looking at the moon due to Neil Armstrongs passing."],"Date of the Event":"08/25/2012 11:00 UTC","Log Number":"US-08302012-0009","Longitude":"-118.420485","City":"Los Angeles","Sighting Duration":"00:12:30","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"RED SPHERE WITH WHITE ORBITING DOTS (3), WENT AT 90 Degrees Very Fast"}