{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.954338,+-117.476891(42144)&iwloc=A&hl=en\"> mufon case (42144) map </A>","divs":["Sighting Details In the summer of 2003 or 2004, myself and another witnessed two UFOs in the rural Deer Park vacinity in Washington state. One was directly to our right just above the tree line and one dead ahead (I believe north). I Primarily focused on the one to my right which was quite close, not realizing for a time that there were two. The other individual did the same with the other object. I did see that one briefly also, if it had maintained it's path prior, it had flown directly over our building. While outside to smoke a cigarette I noticed a very obvious change in the abundant wildlife sounds of the area. All insects went still suddenly shortly after dogs in the vacinity all began to bark, could hear dogs barking for miles. It raised the hair on the back of my neck. At that time I noticed three lights in a triangular patten just above the treeline. I attempted to point it out and my companion and while he searching he saw a second craft a half an acre in front of us just above where the treeline began. At this point all animals became silent. Have to this day have never heard a silence similar in a wooded area during summer months. I could not make out the craft in detail but I believe it was either triangular or boomerang shaped. Both had 3 lights at least on bottom. The color of the lights are hard to describe they may have changed colors. But I did see orange and possibly red. The thing that struck me most about the craft was firstly, they moved so slow that they should have fallen out of the sky. They moved perfectly straight and without wavering or variation as you may expect if watching an ultralight aircraft or something of that nature. In addition to this they were completely silent. Incredibly spooky. Not long after the craft were out of sight(while we were vigorously debating whether there was any possibility that they were military), a huge roar of helcopters coming in low and super hot flew directly over us and in the same direction the craft were headed. I have spent time in Guam and Pensacola and numerous other places where there is heavy military flight activity, I have even seen stealth bombers, I have never seen helicopters in that big of a hurry, that low. I am sure the whole area heard this. There is a \"POW training camp\" somewhere in that area. We experienced a stange light coming in the bedroom window that winter that came in at a very difficult angle that jarred us awake and shut off imediately as we sat up, not sure if that was related but definitely got my attention...lol I did report this at the time with much more detail and received interest but lost the e-mail somehow and the ancient computer went down. Thought I would follow up, better late than never."],"Date of the Event":"08/29/2004 12:00 UTC","Country":"United States","Object Features":"Unknown","Disposition":"Unresolved","Case Number":"42144","files":["/var/www/straped/mufon/html2text/42144.html.txt","/var/www/straped/mufon/org/42144.html"],"Log Number":"US-08302012-0006","Object Shape":"Boomerang","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Latitude":"47.954338","Viewing Distance":"101-500 Feet","Longitude":"-117.476891","City":"Deer Park","Summary":"2 craft, helicopters, 2 witnesses","Region":"Washington","Source":"MUFON","trends":["There have been no other sightings in Deer Park","This sighting has never been favorited."],"Tags":"City","Date Submitted":"08/30/2012 01:36 UTC"}