{"Date Submitted":"08/30/2012 10:11 UTC","Date of the Event":"08/30/2012 03:30 UTC","Viewing Distance":"Over One Mile","Object Shape":"Star-like","divs":["Sighting DetailsI went onto my back porch for a smoke break while working late at home. I noticed a very bright star-like object in the distance (a little less than a mile away). I thought this may be sirius, but then noticed it was ascending in the sky at jumped up about 60 degrees in approximately 45 seconds and hovered there for a LONG time. Not the most exciting encounter I know, but I feel it should be reported. Knowing what I know about perspective, I first assumed it was a plane heading towards me. But, to my surprise, it never came any closer. I thought it may be a star, but a star doesn't move up in the sky that quickly and then just stop. It just ascended and hovered there. It was really bright and large for the distance to be any sort of plane. If it were a plane, it would to have came overhead and some point! I waited for about a half hour for a plane to pass, but no planes passed at all. I came back out about an hour later, and the object was still there hovering. Again I waited about 10 minutes or so, but noticed no more movement, except for maybe a bit of wiggle. If it were a star, it would not have been so bright, especially because we have a lot of light pollution and the moon was very full and bright which cast even more light. So by the process of elimination: Not a star- moved too rapidly, too bright, too large (resembled a plane's light) Not a plane- didn't move at all after the initial movement. What the heck? Not a helicopter- no sound. hovered waaaaay too long So, it is literally an unidentified flying object. Post and let me know if you saw this as well! I've never seen a ufo before. Didn't take a photo, cause my cam stinks and nothing shows up at night. I'm not interested in showing people a photo of a tiny white dot on black. Next time, I'll have a telescope cam handy. If I had it to do over, I would have also drove around to find the source."],"Disposition":"Unresolved","Latitude":"41.483266","Weather Factors":"Unknown","Region":"Ohio","Tags":"City","City":"Lakewood","Source":"MUFON","Longitude":"-81.826057","trends":["There have been 8 other sightings in Lakewood","There were no other sightings in Lakewood on or around August 30th 2012"],"Country":"United States","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Summary":"BRIGHT starlike object ascended slowly (approx 45 seconds). thought it was a plane, but then it just hovered for well over an hour. got bored. went to bed.","map":"<A HREF = \"http://maps.google.com/maps?q=41.483266,+-81.826057(42150)&iwloc=A&hl=en\"> mufon case (42150) map </A>","Log Number":"US-08302012-0012","Case Number":"42150","files":["/var/www/straped/mufon/html2text/42150.html.txt","/var/www/straped/mufon/org/42150.html"]}