{"Log Number":"US-08312012-0007","trends":["There have been 23 other sightings in Beaverton","There were no other sightings in Beaverton on or around August 23rd 2012","This sighting has never been favorited.",""],"Country":"United States","Viewing Distance":"Unknown","Case Number":"42168","Object Features":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42168.html.txt","/var/www/straped/mufon/more/42168_submitter_file1__20120823074913242.jpg","/var/www/straped/mufon/more/42168_submitter_file2__object1.jpg","/var/www/straped/mufon/more/42168_submitter_file3__20120823074918906.jpg","/var/www/straped/mufon/more/42168_submitter_file4__faintobject2.png","/var/www/straped/mufon/org/42168.html"],"divs":["Sighting DetailsOn August 23rd around 750 am I was heading home from work following a night shift. I was traveling west and stopped at a stop light at the intersection of Farmington road and SW Hall Blvd. in Beaverton, Oregon. It was early morning and the sky was clear. As I waited, I noticed a small object in the sky to the west, the direction I was traveling. It was almost round in shape but slightly elongated vertically. It did seem to have a slight bell shape, meaning the bottom was wider than the top. This was very subtle. It appeared to be about 45 degrees above the horizon. The color was dull, silver-gray with no discernible features other than the slight bell shape. After a few seconds it began to move to my right. I grabbed my cell phone and when I looked up it was gone, only to appear again on the other side of the trees to the right and was continuing to move towards the SW. I held my phone at about arms length and was able to take two pictures. At that point I glanced at the stop light and it was green. When I looked back toward the object I didn't see it any more. The entire sighting from the time I first noticed the object until it disappeared was about 20 seconds. I continued on down Farmington Road and went home. When I got home I pulled up the pictures from my phone onto my computer for a closer look. At first I thought I had only captured one image but as I was looking at the second photograph at high magnification I noticed a very faint white dot in the general area where the object last appeared."],"Date Submitted":"08/31/2012 02:17 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.486959,+-122.804014(42168)&iwloc=A&hl=en\"> mufon case (42168) map </A>","Summary":"Sighting of small, silverish gray object that moved off to the right of the road and disappeared.","Date of the Event":"08/23/2012 07:49 UTC","Latitude":"45.486959","Tags":"City","Object Flight Path":"Straight-line path","Region":"Oregon","Weather Factors":"Unknown","Longitude":"-122.804014","Object Shape":"Other","Disposition":"Unresolved","City":"Beaverton","Sighting Duration":"Undisclosed"}