{"Latitude":"32.980607","Log Number":"US-08312012-0009","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date Submitted":"08/31/2012 03:31 UTC","Disposition":"Unresolved","Country":"United States","Date of the Event":"08/30/2012 09:15 UTC","Object Shape":"Circle, Cylinder, Disc, Fireball, Sphere","Object Features":"Unknown","Longitude":"-115.526667","Region":"California","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=32.980607,+-115.526667(42170)&iwloc=A&hl=en\"> mufon case (42170) map </A>","Source":"MUFON","City":"Brawley","Summary":"fireworks that split into two separate pieces on top of each other (like small balls of light). They would disappear and then come back as if they were rotating around something. Two objects N and E same description. one in E flew up behind cloud, bright","divs":["sighting detailsmy family and i were driving into town at about 9pm on 8\\30\\12. we were stopped at an intersection facing north when we noticed the objects. objects looked like fireworks that split into two separate pieces on top of each other (like small balls of light). they would disappear and then come back as if they were rotating around something. the first one appeared in the east and then another appeared in the north. as i was looking at the one in the north the one in the east shot up behind a cloud and illuminated the cloud but left a sparkle trail behind it. it stayed behind the cloud for a bit and then disappeared. my wife, and two children witnessed the event with me. my wife and i were very excited (my children were very scared) to see the objects as there have been recent sightings in a town an hour east of here. i hope to see them again."],"Case Number":"42170","files":["/var/www/straped/mufon/html2text/42170.html.txt","/var/www/straped/mufon/org/42170.html"],"trends":["There have been 4 other sightings in Brawley","There were no other sightings in Brawley on or around August 30th 2012"]}