{"Sighting Duration":"Undisclosed","Object Shape":"Other","Latitude":"36.152638","Object Flight Path":"N/A","Summary":"physical encounter in my home","Tags":"City","Region":"North Carolina","Longitude":"-80.362275","Log Number":"US-08312012-0015","Disposition":"Unresolved","Date Submitted":"08/31/2012 02:36 UTC","Date of the Event":"06/01/1995 01:06 UTC","Viewing Distance":"20 Feet or Less","trends":["There have been no other sightings in Pfafftown","This sighting has been favorited 1 time."],"divs":["Sighting DetailsThis is an event that happened many years ago. For a long time, I couldn't even think about it, much less discuss it with anyone. As the years have gone by, it's gotten easier to do so, and I've decided to share it with you. Make of it what you will. I had moved back home to take care of my mother after my father died in 1991. My mother died in Dec of 1999, so it happened during this time frame. I can narrow it down a little more. A specific job I had until 1996, I know it happened during this time because of the guy I was dating while I worked there. I'm afraid I can't be any more specific than this. He had been over to the house that evening to hang out. I lived in the basement of my parents house. We watched tv and drank a beer from a six pack of some very unique foreign beer that he had brought with him. I'd never seen this beer before, and it had a very pretty colorful label on a brown long neck bottle. I have no idea what brand it was. Maybe something german. He left around midnight and I worked on going to bed. The next thing I remember, I was laying in bed, on my right side. I had my right arm under my head, stretched out. My left arm was kinda slung behind my back. The room was dark. I was just trying to drift off to sleep, but was still fully conscious of my surroundings. The next thing I remember was hearing a very soft shuffling of lots of little footsteps (carpet) coming into the room and surrounding my bed. I opened my eyes to see a typical gray alien standing right in front of my bed, about 3 feet away from me. Behind him, in the shadows, I could make out several smaller ones, kinda like children, surrounding my bed. The bigger one was a rubbery gray, but unlike pics that I've seen, he was wearing this gray kinda puffy (quilted?) vest that crossed over his shoulders, like an X over his chest. Don't know if that makes sense, but it's the best I can describe it. I tried to move, but realized I was unable to do so. I kept trying to pull my left arm from behind my back, but it was completely frozen in place. The only thing I could move was my eyes. I realized this was really happening because I saw one of those beer bottles sitting on my bedside table. I know there's no way I could have dreamed that. The time on my bedside clock was six minutes after 1. I'll never forget that. I finally managed to talk a little and for some reason, it seemed important at the time to make sure the alien knew that I could see him, that he (it?) had been caught. I kept croaking out the words, \"no, not tonight\", over and over. It's the only thing I could say. After a minute, he reached out and touched my arm with either a long thin wand, or his finger. I don't know which, but there was a small light on the end of it. When he touched my arm, they were all gone, and I could move again. It was over. I remember just laying there, trying to remember to breathe, looking at that beer bottle and clock by my bed. I did tell my mom about it the next morning. She didn't remember anything strange from the night before. I had a second encounter some several months later. this one is extremely difficult to write about, but I figure if I'm going to share, I might as well share all. Again, I was laying in my bed, this time more on my stomach, when I felt something climb up on the bed with me. Again, when I tried to move, I found I was paralyzed. I then felt something being inserted into my rear end, like a long probe, maybe? It generated a pulse, which after a couple minutes, brought me to an orgasm. After that, I felt it being removed, someone slowly climb off my bed, and then I could move again and it was over. I was never able to see anything. What's even more crazy is I again looked at the time. It was six minutes after 1, same as before. The next morning, my mother asked me if I'd had \"another visit from my little friends?\" because she had gotten up around 1am to use the bathroom and saw some strange lights outside the bathroom window, down in the woods behind the house. In my heart I know these events were very real. I have no idea what was going on, or what they were doing. I've never had any other encounters that I'm aware of. I've thought over the years about possibly going through hypnosis to find out. But I think I don't really want to know. This is my story. Make of it what you will...."],"Case Number":"42176","map":"<A HREF = \"http://maps.google.com/maps?q=36.152638,+-80.362275(42176)&iwloc=A&hl=en\"> mufon case (42176) map </A>","Object Features":"Unknown","Country":"United States","City":"Pfafftown","files":["/var/www/straped/mufon/html2text/42176.html.txt","/var/www/straped/mufon/org/42176.html"],"Source":"MUFON","Weather Factors":"Unknown"}