{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.510351,+-94.107982(42177)&iwloc=A&hl=en\"> mufon case (42177) map </A>","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Log Number":"US-08312012-0016","Object Shape":"Circle, Diamond, Disc, Flash, Oval, Sphere, Star-like","Latitude":"36.510351","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/42177.html.txt","/var/www/straped/mufon/org/42177.html"],"Object Features":"Unknown","City":"Pineville","Longitude":"-94.107982","Source":"MUFON","Date Submitted":"08/31/2012 02:39 UTC","Date of the Event":"08/27/2012 12:00 UTC","trends":["There has been one other sighting in Pineville","There were no other sightings in Pineville on or around August 27th 2012"],"Weather Factors":"Unknown","divs":["Sighting Details My friend and I were walking home from the store when we walked past the site of her and another friend's car crash of the night before, that incident also having been highly suspicious. The other friend was waiting at home for us. That whole evening the animals had been acting very odd, on the road we witnessed a deer zigzagging across the road only stopping to stare at us, not being spooked despite a passing car, this went on for about 20 seconds before the deer simply disappeared. There was a very large non-native spider that was behaving similarly. The friend waiting at home heard owls right before the occurrence. The one walking with me panicked and told me to look in the sky because there was light other than the moon. It didn't come from any direction, it just appeared, the other 2 witnesses confirmed it. It appeared static at first then moved west at very rapid speed, too fast to be a helicopter, behavior not matching a plane, with a rainbow of light sort of trailing it. I felt delirious, and as if there was a message \"We see you too\". The friend who was with me felt fear, nausea, and panicked. The friend who was waiting at home felt entranced. We lost sight when the object just dissipated in the sky after it started Westward motion."],"Summary":"Lights in the sky and delirium","Region":"Missouri","Country":"United States","Case Number":"42177","Viewing Distance":"501 Feet - 1 Mile"}