{"Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Summary":"one light dropped another light directly from it. They both made irregular hovering paths and hovered for at least 13 minutes","Object Features":"None","Date Submitted":"09/01/2012 10:57 UTC","Date of the Event":"09/01/2012 06:27 UTC","Tags":"City","Latitude":"33.659143","Object Shape":"Circle, Sphere, Star-like, Other","Region":"Arizona","Case Number":"42206","files":["/var/www/straped/mufon/html2text/42206.html.txt","/var/www/straped/mufon/org/42206.html"],"divs":["Sighting DetailsI had walked outside into my backyard with my 2 dogs and cat in my arms. after standing and admiring the sunset to the west for maybe 5 seconds, I noticed what looked to me like a round sundog emitting light through refraction of the clouds. But this light was completely away and seperated from the other clouds in the sky.. which was odd to the sight. But as i noticed the object, it started to dim over 15-20 seconds. Once it dimmed down to the size of a star, was the exact same time that another star like object descended directly from underneath the 1st object. ( it looked like it was on a path directly to the surface of the earth. after descending down 4-5 inches from the 1st object it turned its course to south just a bit and then stopped. and then it hovered stationary for about another minute. About this time the 1st object was sort of descending down towards the 2nd light but almost going a bit to the north. then it stopped above and to the north of the 2nd object, where they both stayed stationary and hovered for the bulk of the time. I ran inside to get the binoculars out of my garage and ran back outside to find that i could only spot 1 of the objects now. After viewing the object for 8-10 minutes VERY CLEARLY through my binoculars that i had mounted on the fence separating my yard and my neighbors, The clouds in the sunset were starting to obstruct my view. So i kept a spot on it until eventually the clouds completely obstructed my view. i also recorded a video on my iphone of the 2 objects after the 2nd object was dropped. before i got my binoculars. Also the 2 objects seemed to come into a visual clarity of some sort where they appeared to be both rod shaped both pointing directly up and down. One end of each rod object pointing at the earth and the other end pointing opposite. (directly up towards space)"],"Source":"MUFON","City":"Glendale","Sighting Duration":"Undisclosed","Longitude":"-112.163815","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=33.659143,+-112.163815(42206)&iwloc=A&hl=en\"> mufon case (42206) map </A>","Log Number":"US-09012012-0024","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around September 1st 2012"]}