{"Object Features":"Unknown","City":"Plaistow","Object Shape":"Circle","Weather Factors":"Unknown","trends":["There has been one other sighting in Plaistow","There were no other sightings in Plaistow on or around September 1st 2012","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"New Hampshire","Latitude":"42.83125","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/42207.html.txt","/var/www/straped/mufon/more/42207_submitter_file1__20120901212821.jpg","/var/www/straped/mufon/org/42207.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.83125,+-71.09442(42207)&iwloc=A&hl=en\"> mufon case (42207) map </A>","Longitude":"-71.09442","Date of the Event":"09/01/2012 09:28 UTC","Summary":"Orange orb flies silently in straight line South to North","Log Number":"US-09012012-0025","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"09/01/2012 11:55 UTC","Case Number":"42207","divs":["sighting detailswalking down a hill on a wide lane looking up at the stars and noticed a large orange light in the sky over head. the shape was round but fuzzy. it was larger than a planet, considerably smaller than the moon, which is just past full tonight. the object appears about 1\\4\" wide in the photo that was taken at 9:28pm. there were no red or green navigation lights. the phone photo shows it as yellow-orange, but it was more red-orange. the feelings of the observer - \"strange and eerie, what the heck is it? is there a shape? it can't be a spotlight on a cloud because it is going across the whole sky and is not changing shape. trying to run through every thing it could possibly be.\" it took about a minute to traverse the sky from south to north. it was silent and did not change direction. there was no reference point with which to estimate altitude because it is a clear night. because the angle toward the orange glow was about 70 degrees above the horizon it appears to be flying high. since there were tall trees on the side of the road the object could no longer be seen once it got to the edge of the sky defined by the trees. is this somehow associated with the exeter ufo festival which was today and is in the direction the orange orb was heading?"]}