{"Object Shape":"Boomerang, Circle, Cross, Diamond, Disc, Egg, Fireball, Flash, Oval, Other, Unknown","Disposition":"Unresolved","Country":"United States","City":"Taylorsville","Date of the Event":"07/25/2012 12:00 UTC","Log Number":"US-09022012-0009","trends":["There have been 3 other sightings in Taylorsville","There were no other sightings in Taylorsville on or around July 25th 2012"],"Case Number":"42216","map":"<A HREF = \"http://maps.google.com/maps?q=40.658082,+-111.95436(42216)&iwloc=A&hl=en\"> mufon case (42216) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-111.95436","Tags":"City","files":["/var/www/straped/mufon/html2text/42216.html.txt","/var/www/straped/mufon/org/42216.html"],"divs":["Sighting DetailsOn July 25, 2012 about nine nine thirty I was siting there haven smoke watch the kids light of fire works. In Ut july 24 is celebrated pioneer days its about 1 week in half that they celebrate. Light fire works and have fun... But what I saw that night was not firework. Taylorville ut. Out of no where this disc flys up above ther fire works and it hovers for about a min. Then suddenly it shoot up in the ski a turns yellow light drops down and turns orange light. Then it shoots up at angler turns deep red drop back shows green yellow light. But then this thing get bigger like a real big livingroom window it had slats it was cobolt blue. It spread open I run to get my sister and camera but could take my eye off it. Then it gets small turns yellow and its gone. So I told my sister about it . Oh yea right. I saw another one a month earlier In a another area. Which I reported eailer this last month. Its not like I see these thing on a regular basis. I have seen 4 thing in my life time that I question. Metoright I was ten years old then in the 80 I saw craft way high in the sky with wittness at lake powell. This 2 crafts in a months time. My sister didnt realy belive me. Well her daughter so happen to call her the next day her friend told her she saw ufo by reams in taylorsville. Thats where I saw it. She belived me after that. I do not know this friend of my niece. I was relieved that some one else saw that knew my family. I am 55 years old."],"Object Features":"Dome, Window(s), Patterned Surface","Region":"Utah","Source":"MUFON","Summary":"kids were lighting fire work that eveing and this just showed up","Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"09/02/2012 03:10 UTC","Latitude":"40.658082"}