{"files":["/var/www/straped/mufon/html2text/42214.html.txt","/var/www/straped/mufon/org/42214.html"],"trends":["There have been 2 other sightings in Kingsley","There were no other sightings in Kingsley on or around August 27th 2012"],"Country":"United States","Longitude":"-85.535899","Viewing Distance":"501 Feet - 1 Mile","Summary":"Abnormal lights all week long","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI stepped outside to check out the sky with a few others. Since Monday, August 27th, 2012, there have been weird lights all over the sky. One was a pinpoint of white light, it grew huge, turned orange and flew off at supersonic speed to the west. It was not a helicopter, plane, balloon or anything I or the others had ever seen. Nightly, a bright pulsating light has been sighted towards the NW at around 10 to 10:30 pm. It pulses, changes colors, hovers and then disappears. Last night, we saw two craft, rotating lights, hovering and then shoot off towards the west. The strange thing is that right after tonight's sighting, a jet and small plane were suddenly in the area. We saw the bright white object \"drop\" a faint red orb. It stayed under the original bright light for about 2 minutes, just hovered and then turned white, flickered and then it looked like it was gone.A few minutes later, it turned \"on\" again and would shut on and off as it circled the larger light and then turned and went due west again. So, since MOnday night, today is early Sunday morning, the 2nd they are still around. I have seen one before right behind my home and had MI MUFON out here. The news is writing about puzzling helicopters and not one agency is claiming responsibility. I am excited, apprehensive yet curious. I seem to \"know\" when they are there. I am always the one who has a desire to go outside and when I feel that way, I see \"something\" I can't explain. I have been seeing these things in Kingsley for years. I live high on a hill, used to fly and this is unreal. I have multiple witnesses and they are of all ages. I used to be in denial but now I want to know who or what they are. If I get the feeling to go check the sky, are they communicating this to me so I will see them? We had a report here in Kingsley on August 9th, 2012. It's not just me seeing them."],"Tags":"City","City":"Kingsley","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Circle","Case Number":"42214","Latitude":"44.584725","Disposition":"Unresolved","Date Submitted":"09/02/2012 02:44 UTC","Source":"MUFON","Region":"Michigan","Object Features":"Unknown","Date of the Event":"08/27/2012 10:26 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.584725,+-85.535899(42214)&iwloc=A&hl=en\"> mufon case (42214) map </A>","Log Number":"US-09022012-0007"}