{"City":"New York","files":["/var/www/straped/mufon/html2text/42217.html.txt","/var/www/straped/mufon/org/42217.html"],"divs":["Sighting DetailsI was told to request New York MUFON to investigate. The event occured in 1971 or 1972. I was between 3-5 years old. I was living with my family at 15 Greencroft Ave Staten Island New York. I awoke sometime after 11pm, I know it was after 11pm because my parents were sleeping it may have been after 11:30pm because they would watch the evening news. Our bedrooms were on the secondfloor of the house. I was lying in my bed I woke up and saw the Peanuts character Charlie Brown walking in the door of my room. He was very tall and sort of floated. His head rocked side to side and his head grew larger like balloon being inflated. His head became very large then suddenly his whole body including his head shrunk very small in mid air. Then I saw the tiny speck buzzing around in circles like a house fly but very quickly and the buzzing noise was a bit louder than an insect. It last only a second the speck then darted to the corner of the room nearest to my bed and into the floor at the corner where the walls and floor intersect. I jumped out of my bed and clawed with my finger tips at the carpet trying to find the speck. I feel as if I were trying to chase it and I knew I could not catch it because it was shrinking smaller and smaller. I read people discribed ships folding into themselves or shrinking out of sight. There was no space ship in my room. What I saw took on the appearence of the cartoon character Charlie Brown. I believe now it my have been a grey alien."],"Source":"MUFON","Log Number":"US-09022012-0010","Tags":"City","Summary":"I witnessed an entity that looked like Charlie Brown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.574594,+-74.114249(42217)&iwloc=A&hl=en\"> mufon case (42217) map </A>","Date Submitted":"09/02/2012 04:06 UTC","Region":"New York","Object Features":"None","Object Flight Path":"Unknown","Viewing Distance":"20 Feet or Less","Date of the Event":"04/07/1972 12:00 UTC","Case Number":"42217","Country":"United States","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around April 7th 1972"],"Longitude":"-74.114249","Object Shape":"Other","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Latitude":"40.574594"}