{"Object Features":"Unknown","Region":"Newfoundland and Lab","Object Shape":"Disc","Source":"MUFON","Date of the Event":"09/02/2012 05:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.025944,+-61.353298(42222)&iwloc=A&hl=en\"> mufon case (42222) map </A>","City":"Happy Valley-Goose Bay","Date Submitted":"09/02/2012 08:27 UTC","Country":"Canada","Case Number":"42222","Tags":"City","Disposition":"Unresolved","Longitude":"-61.353298","Sighting Duration":"Undisclosed","Log Number":"CA-09022012-0015","Summary":"I was out taking pictures of the sunrise. I did not see the craft, only after downloading pictures into the computer did I notice it.","divs":["Sighting DetailsIt was around 5:45-5:50am that I had gone out to take pictures of the sunrise as the pinks on the clouds were quire striking. I took a number of pictues in the same spot and only one had the object show up. I did hear a strange noise twice, and also earlier at 4:45am when putting the dog out. At 4:45 it was very loud, sounding like creaking, but multiple sounds upon each other, sort of out of sync. When the dog came to the door to be let in I had to speak to it to settle down so as to undo the leash and the sound stopped immediately ? The dog wanted to get in the house quickly but it does this all the time so I can't equate it to the noise. The second sound at 5:45 was much lower in tone, sounding like something turning,starting, very loud....I've never heard anything like it before. It did it twice and each time I stopped and looked around, it was just so different from anything I've ever heard ? I did not see the object while taking the picture. It was only after downloading to my computer did I notice it. I took a number of pictures in the same direction,West, and only one shot captured the object. I am a retired federal civil servant, have lived near an Air Base for over 60 years. There were no aircraft flying, or weather ballons. I smelled nothing and the only thing I was aware of during the episode was the sounds I heard. The temperature was 6 degrees Celcius ( 43F ),humidity around 70% and the winds were calm. The sun had not yet come up directly but seeing outside was good. I was outdoors for about 10 minutes. I had zoomed the camera and it had gone beyond optical to digital so the quality of the picture is less than it could have been, but at the time I just didn't see anything."],"Latitude":"53.025944","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42222.html.txt","/var/www/straped/mufon/more/42222_submitter_file1__DSCF0438.JPG","/var/www/straped/mufon/more/42222_submitter_file2__DSCF0438A.jpg","/var/www/straped/mufon/more/42222_submitter_file3__DSCF0438B.jpg","/var/www/straped/mufon/org/42222.html"],"trends":["There have been 2 other sightings in Happy Valley-Goose Bay","There were no other sightings in Happy Valley-Goose Bay on or around September 2nd 2012","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Object Flight Path":"Unknown"}