{"Source":"MUFON","Tags":"City","City":"Cannock","trends":["There have been no other sightings in Cannock","This sighting has never been favorited."],"Longitude":"-2.011607","Region":"England","divs":["Sighting DetailsI was at work about to have a ciggarette when i exited the large shutter doors I could see a bright light in the distance, there was a colleague outside allready and i asked him what that was and pointed at it. He said he didnt know maybe a helicopter or something and i said at that distance it would be very loud. a supervisor came to join us and said exactly as i had. It was low in the sky and right in front of our workplace so very easy to spot. at first i thought it was a ufo. this was confirmed when 2 more appeared as if out of nowhere. I knew at that point this was something special. I reached for my phone but something made me stop recording before id even started, im still not sure what that was. The objects began to float around each other slowly, and started to pulsate. after a few moreminutes of us standing there silent in awe, they eventually floated towards the west and dissapeared behind a building. they didnt reappear the other side asexpected, its like they just vanished. I know the area has a few sightings before but id never ever think id see one up close like that. I could see no real detail on the objects but you could tell by movement they were under intelligent control."],"Case Number":"42227","Disposition":"Unresolved","Latitude":"52.693606","Sighting Duration":"00:08:00","Date Submitted":"09/02/2012 11:00 UTC","Date of the Event":"08/25/2012 01:26 UTC","Log Number":"GB-09022012-0020","Weather Factors":"Unknown","Country":"United Kingdom","Object Shape":"Egg, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=52.693606,+-2.011607(42227)&iwloc=A&hl=en\"> mufon case (42227) map </A>","files":["/var/www/straped/mufon/html2text/42227.html.txt","/var/www/straped/mufon/org/42227.html"],"Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Summary":"looked like something from youtube only it was right in front of us, above the houses","Object Features":"None"}