{"Object Features":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/42234.html.txt","/var/www/straped/mufon/org/42234.html"],"Latitude":"30.269833","Longitude":"-97.733881","Tags":"City","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around October 17th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.269833,+-97.733881(42234)&iwloc=A&hl=en\"> mufon case (42234) map </A>","City":"Austin","Case Number":"42234","Date Submitted":"09/02/2012 05:28 UTC","Object Shape":"Sphere, Triangle","divs":["Sighting DetailsMy girlfriend called from Pflugerville, Tx, she said go outside and look up, about 8:45, I saw all these vehicles that covered the sky with spinning red and white lights and blue lights, some jumping, some were in unison, I was very scared. I had her on one line and my truck driver brother on the other. They looked round with spinning lights. She said her and Pam are getting the kids and coming to get me, I said I going to the atm, she hung up Iistayed on the phone with my brother, I went to the atm at the shell diagonally across the street. I told them to go outside and look up, I got my money out of the atm and left as I was crossing the street a large triangle with a charcoal black bottom descended so close I was running so fast the very quiet vehicle almost scared the bottom of the tree. I kept running til I got to my apartment office, my girfriend picked me up with the kids in the car, she wanted to check on the dogs , we went back to pflugerville, and saw several vehicles descending simultaneously, I have gotten pics and clear videos since"],"Region":"Texas","Summary":"I was told to outside and look up, alot of vehicles in the sky, one descended over a tree almost scraping the bottom, it had no sound, sine it is one that live whereever I move, I can hear them talk, I have an impression of a handlike print on my frigi","Source":"MUFON","Country":"United States","Log Number":"US-09022012-0027","Date of the Event":"10/17/2009 09:05 UTC"}