{"Date of the Event":"08/22/2012 09:30 UTC","Sighting Duration":"04:00:00","Tags":"City","Disposition":"Unresolved","Latitude":"40.925758","map":"<A HREF = \"http://maps.google.com/maps?q=40.925758,+-80.861163(42245)&iwloc=A&hl=en\"> mufon case (42245) map </A>","files":["/var/www/straped/mufon/html2text/42245.html.txt","/var/www/straped/mufon/org/42245.html"],"divs":["sighting detailsi noticed lights blinking about 2 weeks august 22, 2012 in the night sky starting about 9:30-10:00pm. first i thought it was a plane because the white lights were flickering and occasionally i would see a red light flash. but after watching for a while, i noticed it was not moving. i have seen jets fly above this so i know it's not a star or planet. it can look like one light\\star\\planet and then split into 3 lights: a combination of white lights and red lights. then they will merge into one light again. tonight i saw 2 tiny spurts of white light come out from the main large light source. this 'light' will stay in the sky for hours at a time and not really move. it will flicker and seem to dart around but does not move far from the original spot. i have noticed these lights every night since that first night (unless there is cloud cover). others have seen it and also wonder what this phenomenon is. we do not have a clue but it has to be something. it is as high as a plane but not as high as a commercial jetliner. i have no clue what this could be but am curious to see if anyone else in this area has seen something similar and if they possibly have an explanation. would a weather balloon be put up every night in the same location? i feel there has to be an explanation to this since it's happening nightly."],"Country":"United States","Source":"MUFON","Object Flight Path":"Stationary","Object Features":"Unknown","Date Submitted":"09/02/2012 10:39 UTC","Object Shape":"Blimp, Flash, Oval","Summary":"Only seeing lights that blink/pulsate.","Log Number":"US-09022012-0037","Weather Factors":"Unknown","City":"Salem","Region":"Ohio","Case Number":"42245","trends":["There have been 4 other sightings in Salem","There were no other sightings in Salem on or around August 22nd 2012"],"Longitude":"-80.861163","Viewing Distance":"Unknown"}