{"Region":"Michigan","Sighting Duration":"Undisclosed","Log Number":"US-09022012-0038","Object Features":"Other","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","map":"<A HREF = \"http://maps.google.com/maps?q=44.705391,+-85.672758(42246)&iwloc=A&hl=en\"> mufon case (42246) map </A>","Weather Factors":"Unknown","Longitude":"-85.672758","Viewing Distance":"Unknown","Case Number":"42246","City":"Traverse City","Date Submitted":"09/02/2012 10:45 UTC","divs":["Sighting Detailsaproxamatley 1030 pm every nite I take my dog out to potty, this nite was very clear with no moon, I will check with my mom to get an exact date,I stepped out to let him do his thing and I noticed that in the southwest sky there were 4 very brite red orbs. The redness was very clear and not obscure in any way like a flashlite being shown thru a piece of red plastic.They were in a stairstep fashion at what looked like a 45'degree angle going to the east. Then the 2 lower ones moved into a higher position and all 4 looked as if they were in a perfact box formation. Then what looked like small dim white lines \"X\"them together and they started to turn counter clockwise. I ran inside and got my Mom and said \"come NOW!\" so we then went outside out our garage and looked and we only saw 1, I said dang Mom I saw 4 and then told her what I saw. we both gazed at the orb and we used our heat stack out our door to judge position and it moved in many diffrent quick changing positions. then 1 more appeared next to the one we were observing and it changed color to a very white clear lite and moved our way in an arking fasion I said Mom that is no satilite as You can clearly see it's to close to the ground and being the son of an FAA radar tech was acting like no other satilite that I have see my whole life even at my Dads radar stations growing up with seeing many types of of objects in the sky at nite with my dad.the orb moved overhead and then shot stright up out of site. We observed the original red orb for 20 more minutes as it shot around the sky again using the heat stack as an observation point. Mom went to bed I watched for another 5 min approximatly, and the 4 orbs rejoined circled each other again, my camera which is pretty good could not pick up anything. I will add that I am an observer of the lites over Phoenix, and I-10 east of tucson later that nite being a truck driver my son and I saw the same at I-10 San Samone AZ. Being the son of an FAA tech I have witnessed many other things what I thought was \"Normal\" my whole childhood Learned as an adult they supposedly were not. I really wish that someone would listen to what I have to say because as my father has now passed, I need to tell my story but have been afraide of what people would think. My Father worked at Cedar Radar site (UT) for many years and his radar was one that covered A-51 and as a child every weekend of my growing up years I have observed many things that need to be told, my Mom knows them aswell, thank you."],"files":["/var/www/straped/mufon/html2text/42246.html.txt","/var/www/straped/mufon/org/42246.html"],"Disposition":"Unresolved","Tags":"City","Country":"United States","Source":"MUFON","trends":["There have been 13 other sightings in Traverse City","There were no other sightings in Traverse City on or around August 21st 2012"],"Latitude":"44.705391","Object Shape":"Circle, Disc, Flash, Sphere, Star-like","Date of the Event":"08/21/2012 10:35 UTC","Summary":"4 very brite orbs red then white 1 went overhead then vanished 1 observed 4 25 min, then 4 then vanished"}