{"Tags":"City","files":["/var/www/straped/mufon/html2text/42254.html.txt","/var/www/straped/mufon/org/42254.html"],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"29.89395","Object Shape":"Sphere, Teardrop","Sighting Duration":"00:00:50","Region":"Texas","Source":"MUFON","Country":"United States","Date Submitted":"09/03/2012 12:08 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"Large Object Falling From the Sky","trends":["There have been 4 other sightings in Port Arthur","There were no other sightings in Port Arthur on or around September 2nd 2012"],"Date of the Event":"09/02/2012 10:05 UTC","Object Features":"None","City":"Port Arthur","map":"<A HREF = \"http://maps.google.com/maps?q=29.89395,+-93.938487(42254)&iwloc=A&hl=en\"> mufon case (42254) map </A>","Case Number":"42254","Object Flight Path":"Other","Longitude":"-93.938487","Log Number":"US-09032012-0001","divs":["Sighting DetailsI had just gotten out of work around 10pm and waiting outside for my ride. One of my coworkers was with me, he and I were smoking a cigarette and talking when all of a sudden this object appeared in the sky. At first I thought I was observing some sort of firework because it just seemed to appear out of nowhere. It almost seemed as if it was hovering for a few seconds before it fell towards the ground leaving behind a sparkling trail. Both of us witnessed this which lasted about almost a minute before it dissipated completely. My coworker was excited and asked if I had seen it to which I replied that I had. We talked about it and he said he had never seen anything like it before. We discussed if it was a shooting star and we both decided that we had never observed a shooting star lasting that long, nor had we seen a shooting star so large. What we witnessed was a large ball of light that seemed to pulsate almost. It was a greenish white color and the trail it left behind was like a bunch of sparkles. To our left was the building where we work at and there were a few others outside and Im sure they witnessed as well, not sure though but I will find out. To our right was Wal-Mart with loads of people so I know he and I couldnt possibly have been the only witnesses to this. It was a very odd shape, almost tear like. Im not quite sure what I saw but I dont believe it was a shooting star. It seemed a lot different than what I have seen in the skies."]}