{"Source":"MUFON","Longitude":"-72.791578","Tags":"City","Country":"United States","Log Number":"US-09032012-0012","Viewing Distance":"Unknown","Date of the Event":"09/01/2012 08:25 UTC","trends":["There has been one other sighting in Heath","There were no other sightings in Heath on or around September 1st 2012"],"Summary":"4 orange orbs slowly moving south to noth aprox 30-45 min duration","Object Shape":"Circle, Sphere","City":"Heath","Weather Factors":"Unknown","Case Number":"42265","map":"<A HREF = \"http://maps.google.com/maps?q=42.678884,+-72.791578(42265)&iwloc=A&hl=en\"> mufon case (42265) map </A>","Object Features":"Other","Latitude":"42.678884","files":["/var/www/straped/mufon/html2text/42265.html.txt","/var/www/straped/mufon/org/42265.html"],"Region":"Massachusetts","Disposition":"Unresolved","Date Submitted":"09/03/2012 08:58 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","divs":["Sighting Detailsfour people were camping in Heath Masachusetts. On Sept 1, 2012 nearing the end of fireworks display we noticed a large orang orb moving slowly through the sky. one person thought it was a meteor but the rest of us decided it was going too slow and no tail was visible. we watched it until it went behind cloud cover in the north which took about 3-5 min. we were discussing what it could have been when another one appeared about 30 min later. my husband was facing south and said it rose from the horizon directly in front of him heading north slightly changed direction and then continued north. we all were watching that when it was followed by two other orbs appox 1 min apart all orange and moving slowly. I tried to put my phone on to take a picture but it took too long about 5 min because of no service in the woods. all the orbs then vanished behind cloud cover by that time. My husband said when it was coming up over the horizon and directly toward him it looked to be orange around the outside and a black diamond in the middle. it then turned slightly and appeared more orange. I only saw it from the side and it appeared to be a round orange orb. There was no sound that we could hear. There was occasional small ground fireworks and cars driving at some points during the sighting. there were a few moments of quiet and none of us heard any motor sound of any kind. we had no idea what it could be. it wasn't a hellicopter or plane or anything of that nature. It was approx 8:25 pm when we saw the first one. we were hoping to see them again to take pictures but none returned. we all were pretty sure we had never seen anything like it before. I personally have been camping there since the 60's and have never before seen anything like it."]}