{"map":"<A HREF = \"http://maps.google.com/maps?q=34.219894,+-119.028212(42269)&iwloc=A&hl=en\"> mufon case (42269) map </A>","Longitude":"-119.028212","Weather Factors":"Unknown","Country":"United States","Date of the Event":"09/03/2012 04:24 UTC","Summary":"Bright starlike object, stationary at times then moving back and forth in ways no aircrafts could.","Latitude":"34.219894","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/42269.html.txt","/var/www/straped/mufon/org/42269.html"],"Source":"MUFON","Log Number":"US-09032012-0016","Viewing Distance":"Over One Mile","Object Features":"None","Date Submitted":"09/03/2012 12:25 UTC","trends":["There have been 7 other sightings in Camarillo","There were no other sightings in Camarillo on or around September 3rd 2012"],"Disposition":"Unresolved","divs":["Sighting Details The bedrooms in the house were being painted so I slept on the couch. I kept waking up every hour throughout the night drenched in sweat probably because I am taking the dietary supplement creatine and drinking lots of water. At approximately 4:24 a.m. I am awake again and looking out the window in front of me at a bright object that looked like a star but brighter. There were 2 for about 15 minutes and when I came back from the bathroom there was just 1. It moved back and forth from different direcions in ways no normal aircraft could. After about 30 minutes I woke up my mother to see so I could have some verification and not be that \"crazy guy\". She witnessed it to and by then I had been watching it for 45 minutes and I decided to go back to sleep. I opened my eyes a few times every couple minutes to see it still there. Then next time I woke up around 6 when dusk was setting in it was gone. I don't have video capabilities on my oldschool blackberry which was low on battery and I only had a car charger. I'm one who would probably believe in ghosts before ufo's but I know what I saw and I know theres going to be a division between those who will take my word."],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","City":"Camarillo","Region":"California","Case Number":"42269","Tags":"City"}