{"Object Shape":"Boomerang, Triangle","Latitude":"33.926993","Country":"United States","Source":"MUFON","Object Features":"Unknown","Date of the Event":"09/02/2012 10:10 UTC","Log Number":"US-09032012-0024","City":"Atlanta","Viewing Distance":"501 Feet - 1 Mile","Case Number":"42277","Date Submitted":"09/03/2012 07:36 UTC","divs":["Sighting DetailsLast night, Sunday, September 2, 2012 at approx 10pm... I was sitting in my car gathering my items for my shift that was about to start. A guy came over to my car to give me a compliment but when I rolled my window down to speak to him I saw behind him (above his head) a bunch of orange lights in the sky come out of nowhere followed by and aircraft and then a second bunch of lights appear flying from west to east in Atlanta, GA. I was on Roswell Road at the time. The siting lasted for about 2-3 minutes. I wish I would have taken a picture or video -aped it with my phone but I was in shock. I freaked out. I literally thought, \"is this the end?\" It was so surreal; I felt like I was in a movie. Despite the many other witnesses around, no one else cared about it but me. The guy that was speaking to me was intoxicated (I work at the club) so he was definitely no help. I immediately called my mother, and then my sister, but neither picked up the phone. I then told my co-worker what I saw (who also seemed to not care.) So I left and went to fill my tank up with gas in case this was indeed an invasion. I didn't want to be stranded with no gas if so. I called a friend while at the gas station and he laughed at me. Unfortunately, no one was interested or intrigued, so I let it go. Until I woke up this morning and still had it on my mind, so I Google'd what I saw and found the description to match what others described as a UFO. Then I found this website."],"Summary":"nearly a dozen or so orange lights in a triangular form","files":["/var/www/straped/mufon/html2text/42277.html.txt","/var/www/straped/mufon/org/42277.html"],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around September 2nd 2012"],"Tags":"City","Sighting Duration":"00:03:00","Disposition":"Unresolved","Region":"Georgia","Longitude":"-84.382711","map":"<A HREF = \"http://maps.google.com/maps?q=33.926993,+-84.382711(42277)&iwloc=A&hl=en\"> mufon case (42277) map </A>"}