{"divs":["sighting details my father and i were on a short weekend trip to mercer wi, to stay with friends and do some fishing. the friend we know owns a small resort on the lake where we were staying. he fished with us all day and into the evening. after dark, we docked the boat and headed back to the cabin. we then went inside the resort owners house, watched some tv, and caught up on old times. we stopped fishing about 8:30pm. right around 10:00pm, we heard screaming and yelling coming from outside. we knew some of the people staying in one of the rental cabins were having a campfire that night and we were worried something might have happened to them. the owner and i ran outside to see what was going on. a group of 6 or 7 people were standing out in the yard away from their cabin and fire pointing into the sky. they were very excited telling us they just saw something they couldn't explain. a female from the group explained that they were just sitting around the fire when two bright lights on the horizon began moving very fast in their direction, passed close to overheard, and out of sight over the woods. they were very scared, and we both knew they definitely saw something. suddenly, someone else from their group started pointing at two more lights on the horizon. nobody said a word as we all watched. the lake we were on was a 200 acre lake and the lights were on both sides of the water well above the tree lines. they were large balls of with light, with orange light emitting from the underside. there was some sort box like structure above the light source (i don't really know how to describe it). we all started getting nervous because one light passed directly over our heads. there was zero sound, they were also moving fast. from the time they were on the horizon to over our heads and out of sight was just a matter of seconds. we could see them through the trees as they separated and disappeared. just as those two lights that the owner and i saw with the group vanished, two more lights appeared just above the horizon and followed close to the same path. again, moving fast with no sound. the event lasted only a matter of minutes for all 6 lights to be on the eastern horizon to the western horizon. they all followed the same path and disappeared in the roughly the same area at 45 degree angles to the horizon up. none of us had a cell phone on us because there is no need for one where the cabins are because there is no cell service. i had my droid phone with a great video camera sitting on my lap inside the owners house, but when we initially heard the screaming, i left my phone sitting on the couch. i stayed outside around 10:00pm the following night, but did not see any more lights. we talked about this all night 9\\1\\12 and all day 9\\2\\12 trying to figure out what we saw. nothing makes sense. the owner of the resort wants to stay private because he is worried this might hurt his business. i do no know who the people were in the rental cabin."],"Case Number":"42280","Date of the Event":"09/01/2012 12:00 UTC","Object Features":"None","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Tags":"City","Country":"United States","Date Submitted":"09/03/2012 09:20 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Wisconsin","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, Over 1 Mile, Unknown","Longitude":"-90.059","Object Shape":"Circle, Disc, Fireball, Oval, Sphere, Square, Rectagular","Summary":"A small group of people observed 6 lights move moving very fast over head a d off in the distance","Latitude":"46.170337","Log Number":"US-09032012-0027","map":"<A HREF = \"http://maps.google.com/maps?q=46.170337,+-90.059(42280)&iwloc=A&hl=en\"> mufon case (42280) map </A>","Source":"MUFON","City":"Mercer","trends":["There has been one other sighting in Mercer","There were no other sightings in Mercer on or around September 1st 2012"],"files":["/var/www/straped/mufon/html2text/42280.html.txt","/var/www/straped/mufon/org/42280.html"]}