{"Summary":"Three sets of two (2) blue-ish white lights moving swiftly from East to West, passing over our car and changing direction, heading to the North.","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/42281.html.txt","/var/www/straped/mufon/org/42281.html"],"Longitude":"-98.486038","City":"San Antonio","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"Unknown","Region":"Texas","Object Features":"Unknown","Object Shape":"Other","Latitude":"29.433712","Case Number":"42281","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around September 2nd 2012"],"Log Number":"US-09032012-0028","map":"<A HREF = \"http://maps.google.com/maps?q=29.433712,+-98.486038(42281)&iwloc=A&hl=en\"> mufon case (42281) map </A>","Country":"United States","Date of the Event":"09/02/2012 08:40 UTC","Source":"MUFON","divs":["Sighting DetailsMy wife and I were in our car traveling east on Potranco Road, between State Highway 211 and Loop 1604, in far West San Antonio, Texas. My wife looked straight ahead and upward, watching two sets of two lights, one light positioned directly above the other light, as they traveled toward us, appearing to be maybe 1,000 feet high. She asked me what the lights were and I told her it was maybe an airplane steeply banking. However, the lights were blueish white and not blinking. So, I pulled the car over and stopped. We stepped out of the car and watched them approach. Without a sound, one set of lights followed the other set and flew over us. They then turned toward the north after they passed over. They seemed to pick up speed and moved toward a third set of two lights that was already to the north of us several miles away. We continued to watch until they were out of eye-sight, which took about another minute or so. We saw no craft, no ship, no blinking lights...nothing but the sets of two lights, one above the other. We could not see anything between the two lights. As they passed over us, we never lost eye-sight of any of the lights, which would indicate that there not a craft or fuselage between the top and the bottom lights. There was never any noise from these lights. The sun had gone down and the sky was getting dark, but it was still twilight and we could have seen an airplane fuselage and wings against the sky. There was nothing there but the lights."],"Date Submitted":"09/03/2012 10:00 UTC","Disposition":"Unresolved","Object Flight Path":"Path with directional change"}