{"City":"Orlando","Date of the Event":"05/10/2010 11:45 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.567621,+-81.321844(42283)&iwloc=A&hl=en\"> mufon case (42283) map </A>","Longitude":"-81.321844","Viewing Distance":"21-100 Feet","Tags":"City","Object Flight Path":"Stationary","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Object Shape":"Fireball","divs":["Sighting DetailsDriving home late at night after work. There was roadwork so had to detour around the lake. I was at the light on S.R50 and noticed orange lights in the sky.Was very noticeable, quite large! Made the left, the road twists and turns around the residential area. It was distracting, didn't want to take my eyes off it. They didn't move. I checked the road and turned my head back and a third orange light had appeared, a bit smaller than the others. They made a diagonal line. As I was making my right turn, a helicopter flew over the apartment building on my left.Flying directly at it! I drove home really fast and ran upstairs to tell my boyfriend. He looked out our bedroom window and said he couldn't see anything but he could hear the helicopter. He drove around to the lake and couldn't see anything. No orange lights and no helicpoter! I have tried to explain it away but can't,The lights were directly over the lake and there are no buildings large enough to consider someone's apartment lights. Don't really know what I saw, but have seen similar things reported in England and out west."],"Disposition":"Unresolved","Region":"Florida","Log Number":"US-09042012-0002","Date Submitted":"09/04/2012 12:27 UTC","Latitude":"28.567621","Object Features":"Unknown","Case Number":"42283","Summary":"Two orange lights above Lake Baldwin","files":["/var/www/straped/mufon/html2text/42283.html.txt","/var/www/straped/mufon/org/42283.html"],"trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around May 10th 2010"]}