{"Case Number":"42298","trends":["There have been 20 other sightings in Concord","There were no other sightings in Concord on or around September 1st 2012"],"Source":"MUFON","Region":"California","Tags":"City","City":"Concord","Latitude":"37.984728","map":"<A HREF = \"http://maps.google.com/maps?q=37.984728,+-122.022803(42298)&iwloc=A&hl=en\"> mufon case (42298) map </A>","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Weather Factors":"Unknown","Date of the Event":"09/01/2012 08:54 UTC","Sighting Duration":"Undisclosed","Log Number":"US-09042012-0017","Summary":"Glowing fireball moving horizontally south - southwest leaving no trail","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unresolved","Longitude":"-122.022803","Country":"United States","Object Features":"Unknown","Date Submitted":"09/04/2012 07:17 UTC","divs":["sighting detailson saturday i ame out of the house to enjoy the night air. as it was almost 9 pm the sky was predominantely dark with the night sky lit up with stars and identifiable known planets. as i looked east i noticed an excessively large star (brighter than the iss when it flies over head) moving approxiamtely s\\sw horizontally with no deviation in altitude. i use the term fireball as the colors eminating from it were of a redish orange fluctuations, almost as if it were on fire, but not trail of any kind to indicate pieces falling off. as time went on its speed, which wasn't fast, began to decrease, changing direct to almost due west, then ceasing movement all together. at one point it almost appeared to drop, not fast, but movement didn't last long. as it slowed down i went into the house looking for a camera and when i came out the object was gone. i walked out into the middle of my court which would give me a commanding view of the sky and there was nothing there. no glowing object, no planes, no satellites. just stars."],"files":["/var/www/straped/mufon/html2text/42298.html.txt","/var/www/straped/mufon/org/42298.html"],"Object Shape":"Fireball, Star-like"}