{"Tags":"City","Date of the Event":"09/02/2012 08:38 UTC","Case Number":"42301","trends":["There have been 3 other sightings in Huron","There were no other sightings in Huron on or around September 2nd 2012"],"Country":"United States","Viewing Distance":"Unknown","Log Number":"US-09042012-0020","files":["/var/www/straped/mufon/html2text/42301.html.txt","/var/www/straped/mufon/org/42301.html"],"Date Submitted":"09/04/2012 10:58 UTC","divs":["Sighting DetailsWalking along he south shore of Lake Erie about 2000 EST on 2 September 2012. We were about midway between Vermillion, OH and Huron, OH. It was a clear night. My wife notice a light in the sky to our East and pointed it out to me. The light had the appearance of a \"baloon glow\" but was moving at a high rate of speed from East to west along the south shore of Lake Erie. There was absolutely no sound associated with the light. It was dark so altitude was hard to judge but I am estimating about 2000 feet. It moved in a straight line going west and seem to maintain altitude until out of sight miles down the line. The appearance of the light as it was overhead was that of a \"whitish color\". It looked like a whitish light inside of a large clear bag. The appearcne seemed to be more redish in color as the distance increased. My estimate of speed was about 200-250 mph. The lack of any sound associated with something moving that fast was remarkable. I had a camera with me but it took a while to get it out and get a picture. The object had moved West by the time I could get out the camera and get into position to get a photo. My camera is a Canon SX 230HS so it is not the best in a dark environment. The next day I Googled \"ufo, Lake Erie, 2 Sept 2012 and there was an account of a sighting in Mentor, OH (about 50 miles East of Ruggles Beach) at about the same time moving West. The light we saw may have been the same one sighted in Mentor."],"Object Flight Path":"Straight-line path","Region":"Ohio","Summary":"looked like a \"baloon glow\" moving at speed of a fast single engine plane","Longitude":"-82.549013","map":"<A HREF = \"http://maps.google.com/maps?q=41.399529,+-82.549013(42301)&iwloc=A&hl=en\"> mufon case (42301) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"41.399529","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Blimp","City":"Huron","Object Features":"None"}