{"Longitude":"-83.67435","Date of the Event":"07/12/1982 12:00 UTC","Latitude":"34.683982","Disposition":"Unresolved","Case Number":"42306","Region":"Georgia","Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Unknown","Weather Factors":"Unknown","Summary":"Beams of light from hovering craft visible through windows","Date Submitted":"09/05/2012 01:09 UTC","City":"Sautee Nacoochee","Country":"United States","Object Features":"Unknown","trends":["There have been no other sightings in Sautee Nacoochee","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/42306.html.txt","/var/www/straped/mufon/org/42306.html"],"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.683982,+-83.67435(42306)&iwloc=A&hl=en\"> mufon case (42306) map </A>","divs":["Sighting DetailsAlthough this happened a very long time ago, I still remember several of the details explicitly. In 1991, I asked my mother if ever said anything about seeing a UFO when I was a child (approx 8-10) at our old house which she did not. Later, my family (father, mother and sister) asked me to come and recite my experience. After reciting my experience, my father confirmed he too recalls the experience, all except the noise. He recalls more but that is his story, not mine. I will only recite the parts of the story confirmed by my father. I recall my father, sister (3 yrs old) and I were watching project blue book. This always made me doubt that what I saw was real. My mother and Grandmother were in Cornelia taking ceramics class that evening. I recall that some time during the show I heard a noise that resembled the shaking of the clothes washing machine during spin cycle. I remember seeing beams of light \"going by\" the windows at the end of the house. The old house was 90' angle in design, with the dinning room at the end of the leg of the angle facing the road. That end of the house had two windows forming a \"bay\" window design. I recall I could see 4 beams of light through the window. The beams of light were going by the window as though the source or craft the light sources were attached to were rotating or spinning like a plate with the lights along the edge. I am describing the craft abstractly because I did not see it, rather I only saw the beams. The end of the house had 4 flood lights on which were very bright. Even with these lights on, I could see the beams very clearly so the source was obviously very bright. They were so bright that they almost seemed tangible. I recall looking up to see the source but could not as the eave of the roof obstructed my view. There were some other aspects of my experience but my father was unable to confirm them."],"Log Number":"US-09052012-0002","Sighting Duration":"Undisclosed","Source":"MUFON"}