{"Object Features":"Unknown","Sighting Duration":"Undisclosed","Latitude":"55.346902","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09052012-0003","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=55.346902,+-131.640311(42307)&iwloc=A&hl=en\"> mufon case (42307) map </A>","Weather Factors":"Unknown","Date Submitted":"09/05/2012 02:36 UTC","Summary":"Steady still light in sky that hovered accompanied by rotating beam of light emanating from main light","Case Number":"42307","Longitude":"-131.640311","City":"Ketchikan","divs":["Sighting DetailsTonight we all went out to dinner but we took two different vehicles because we arrived from two different directions. After dinner I took our five-year-old and drove behind my husband (who took his mom and our two-year-old). Let me stop really quickly to explain that the island we live on is very remote and the city is very small. There's only a two-lane road, no freeways, and only one airport with one major airline that comes in and out several times per day (with exception to FedEx and UPS, etc.). After dark all float plane activity stops and there no helicopter activity either unless the coast guard gets an emergency rescue call. We were about half-way home (a six mile trip one-way) when my daughter exclaimed \"Mom! Look at that thing!\" and she pointed up to the sky where this bright orangish-colored light (similar to the color of your typical high pressure sodium street light) high up in the sky. At first I thought it was a light from a tall pole but then realized it was waaaay up in the sky (at cloud level) but it was not moving like a helicopter or airplane (and there were no blinking lights on it). There was, however, this second source of light that was rotating from it like giant surge light. This light was coming from a very thin cloud in a relatively clear sky. My husband saw it too and he pulled over to the side of the road. I parked behind him and met him in front of his car and we both just looked up in amazement trying to figure out what this \"thing\" was! We both could see the revolving light and were dumbfounded by the lack of any blinking lights (as seen on helicopters or airplanes) and the stationary way it moved - which was very slow and going upwards. Then, after only a minute, it turned 180 degrees away from us, and totally disappeared. The cloud that it was near was too thin for it to have completely concealed it. Furthermore, my mother-in-law saw it and was positive it was not any type of air craft she has ever seen. When I got back in my truck, my daughter said, \"Mom, that was an alien spacecraft!\" Now mind you, we haven't talk about aliens with out kids because they're so young and the subject hasn't come up yet. Then she just HAD to see my cell phone. She took it and said \"I'll show you what that was!\" 45 seconds later she shows me this picture (from a coloring book application I have on my phone) of a flying saucer with a beam of light emanating from it! I was like \"Whoa!\" My husband has absolutely no explanation for what that was - and he's an engineer that has a logical explanation for everything! And I have never witnessed anything like it. But it definitely caught all of our attention. We all felt really excited by this event. Neither my husband, mother-in-law, or myself were scared. It was very intriguing and, for some reason, not surprising (maybe because we're not skeptical of UFO's, etc.). We really wish we could have witnessed it longer."],"files":["/var/www/straped/mufon/html2text/42307.html.txt","/var/www/straped/mufon/org/42307.html"],"Object Flight Path":"Hovering then path","Region":"Alaska","Source":"MUFON","Object Shape":"Circle","Date of the Event":"09/04/2012 08:20 UTC","trends":["There have been 5 other sightings in Ketchikan","There were no other sightings in Ketchikan on or around September 4th 2012"],"Country":"United States"}