{"Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.017366,+-117.984857(42305)&iwloc=A&hl=en\"> mufon case (42305) map </A>","Longitude":"-117.984857","Log Number":"US-09052012-0001","Weather Factors":"Unknown","Object Shape":"Star-like","Case Number":"42305","Latitude":"34.017366","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path then hovering","trends":["There have been 27 other sightings in Whittier","There were no other sightings in Whittier on or around September 4th 2012"],"Sighting Duration":"Undisclosed","Summary":"Laser on tripod shined at 2 stars, stars shifted position repeatedly.","divs":["Sighting DetailsI was in my back yard at 8:30. A few weeks earlier, I was walking the dogs when out of the corner of my eye, I saw a star brighten. I thought I was seeing a super nova of a star or something, but instead, it was a star that suddenly moved out of position and beging to move eastwardly then ascend. It was trailed by a dimmer starlike object. I had seen two stars move and ascend, so I thought I might catch that kind of event by chance again or maybe I could force it by shining my green laser randomly at various stars. The laser is meant to be used as a star pointer, only when I pointed it at this particular star the star seemed to move. I then ran inside and placed the green laser on a tripod and aimed it at the starlike object , which was now stationary again and again it moved away from my laser light about a centimeter across the sky. I engaged it repeatedly and it shifted repeatedly at least eight times. I was afraid after a bit that that thing was going to swoop down and attack me for annoying it, but it didn't. I went back outside after about a half hour and it was no longer there. I was excited to have affected the UFO."],"Date Submitted":"09/05/2012 12:42 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/42305.html.txt","/var/www/straped/mufon/org/42305.html"],"Region":"California","City":"Whittier","Object Features":"None","Date of the Event":"09/04/2012 08:22 UTC","Disposition":"Unresolved"}