{"Object Shape":"Disc","divs":["Sighting Detailswe were driving down a country road. i was the passenger. it was right above our car pacing us. if i did' nt look up i would have never seen it for it was silent.my friend was driving and i told him to look and when he saw it he took off. it followed us easily. we saw a farmhouse and my friend skidded to a stop right in the road and ran up to the farm house and banged on the doors and windows, igot out of the car and started bouncing rocks off it.10 or 15 ft above the car.my friend scared the lady in the house so i told her to look out the window. she said o.m.g. and came out and joined us. spinning counter clockwise. a hatch opened up on the bottom half and it had that turquoise colored light inside. kept spinning slowly.started to eject a cloud as it rotated an it clung to the ship.wind did'nt move it.when the cloud finally disapated the ship was gone.never saw it leave.seemed like about 20 minuets but we lost about 3 or 4 hours.lots of details. so close. i will never forget it. i was'nt afraid at all. it was amazeing.we all werent having the same halucination. you cant bounce rocks off something that wasnt there. that i know. it wasnt venus."],"Date of the Event":"08/10/1980 12:00 UTC","files":["/var/www/straped/mufon/html2text/42315.html.txt","/var/www/straped/mufon/org/42315.html"],"Summary":"it followed our car. ten feet above us.stopped when we stopped we lost about 4hours","Object Features":"Other","Source":"MUFON","Tags":"City","Longitude":"-74.617086","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"US-09052012-0011","Case Number":"42315","City":"Sharon Springs","map":"<A HREF = \"http://maps.google.com/maps?q=42.795907,+-74.617086(42315)&iwloc=A&hl=en\"> mufon case (42315) map </A>","Object Flight Path":"Other","Latitude":"42.795907","Country":"United States","Region":"New York","Viewing Distance":"20 Feet or Less","trends":["There have been no other sightings in Sharon Springs","This sighting has never been favorited."],"Weather Factors":"Unknown","Date Submitted":"09/05/2012 04:15 UTC"}