{"Date Submitted":"09/05/2012 02:28 UTC","Object Features":"Unknown","Summary":"4 orange orbs over New Hudson, MI September 2, 2012","Latitude":"42.510867","Date of the Event":"09/02/2012 09:45 UTC","trends":["There have been no other sightings in Lyon Township","This sighting has never been favorited."],"Viewing Distance":"Unknown","Case Number":"42311","divs":["sighting detailsmy wife and i along with our good friends are camping near new hudson. sunday, 9\\2\\2012, right as it got dark, my wife and i saw the first orangish orb slowly appearing over the tree tops. then a second one appeared coming from the same direction (west). the first one stopped in mid air and the second one moved in and closed the gap to where they were both now close to each other. both stayed in one spot in the air. then they both started moving again, in a northwest direction, moderately fast. then the original first one accelerated extremely fast and was out of sight (disappeared). the second one increased in speed also and finally was out of sight. it was moving very fast also, just not as fast as the first one. during this time, our friends did not get up to see the event. my wife could see it from where she was sitting. i was already standing when it happened and described to our friends what we were seeing. i then sat down and kept talking about it. our friends adult son and his girl friend showed up. during our discussion of what i saw, off to the sw and thru an opening in the trees, 2 more orbs moved slowly thru the sky. this time everyone (6) got to see them briefly, just before they moved behind some trees and then were gone."],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","Disposition":"Unresolved","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/42311.html.txt","/var/www/straped/mufon/org/42311.html"],"Log Number":"US-09052012-0007","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","City":"Lyon Township","map":"<A HREF = \"http://maps.google.com/maps?q=42.510867,+-83.615495(42311)&iwloc=A&hl=en\"> mufon case (42311) map </A>","Longitude":"-83.615495","Region":"Michigan"}