{"Summary":"Object first spotted above. Looked like plane initially then it went straight up until lost to sight.","divs":["Sighting DetailsI was on Pembrey beach in West Wales UK.Exact location 51deg 40'16.0N and 4 deg 18'09.90W. It was a clear sunny virtually cloudless day. Several hours previously two or more military jets had been flying in circles out over the bay then inland then back out. They did this probably 10 times while I was there. This isn't unusual there are nearby air bases and they seem to train quite frequently. They fly fairly low and make quite a noise. I'd walked for quite a distance and was just getting back to the car parking area so I sat down, had a drink and a cigarette and lay back on the sand and shut my eyes. A couple of minutes later I opened my eyes and saw what I at first thought was a white aeroplane but the shape seemed wrong and it appeared to be stationery. I then thought maybe it's a seagull just riding the currents but I dismissed that because it was angular, white diamond shaped and almost translucent. All this happened really quickly about 2-3 seconds. Then as I watched it became smaller and smaller and in 1-2 seconds it was gone. Straight up I imagine as the reduction in size strongly suggested a rapid increase in distance. I was totally stunned, couldn't believe what I had seen. High above what I assume was a commercial aircraft lazily crossed the sky leaving a contrail as if to highlight the strangeness of the earlier craft. There were few people in the vicinity and nobody else appeared to have seen anything."],"Log Number":"GB-09052012-0013","Weather Factors":"Unknown","Tags":"City","Case Number":"42317","Latitude":"51.680886","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/42317.html.txt","/var/www/straped/mufon/org/42317.html"],"Object Features":"None","Longitude":"-4.160248","Disposition":"Unresolved","Object Flight Path":"N/A","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been no other sightings in Llanelli","This sighting has never been favorited."],"Source":"MUFON","Region":"Wales","Object Shape":"Diamond","Date Submitted":"09/05/2012 05:14 UTC","City":"Llanelli","map":"<A HREF = \"http://maps.google.com/maps?q=51.680886,+-4.160248(42317)&iwloc=A&hl=en\"> mufon case (42317) map </A>","Date of the Event":"09/05/2012 06:20 UTC"}