{"Longitude":"-85.715316","Country":"United States","Object Shape":"Circle","Latitude":"44.980936","Date of the Event":"09/02/2012 08:50 UTC","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=44.980936,+-85.715316(42321)&iwloc=A&hl=en\"> mufon case (42321) map </A>","Date Submitted":"09/05/2012 07:08 UTC","Object Flight Path":"Path with directional change","City":"Lake Leelanau","files":["/var/www/straped/mufon/html2text/42321.html.txt","/var/www/straped/mufon/org/42321.html"],"Region":"Michigan","trends":["There have been no other sightings in Lake Leelanau","This sighting has never been favorited."],"Tags":"City","Disposition":"Unresolved","Log Number":"US-09052012-0017","Summary":"Observered reddish-orange bright light near South Lake Leelanau","Source":"MUFON","divs":["Sighting DetailsI was sitting on my deck, located on the east side of my home at about 8:50pm on the evening of Sept 2nd. I was hoping to see the moon rise. I could hear the boat traffic from the lake so the evening wasn't exactly quiet. I was looking SE and noticed a small blinking light from a small plane. There was enough light yet that the stars were not visible. I turned my head to look due east at the sky and then as I was turning my head back to look SE, I observed a bright reddish-orange light just pop on above a distant tree line. It was headed towards my direction, NW. I don't believe it made any noise but I can't be positive because of all the boat traffic. It moved at a steady rate of speed for the most part. I looked at it for about 10 seconds then went to get my camera, but it was too dark for my camera to pickup on it. About 30 seconds after I first saw it, it got dimmer and began ascending and I believe turned due east and then it disappeared. It's almost like a super bright headlight that is coming toward you but this was reddish-orange. By the way, I saw the moon rise by 9:09pm and I laughed because it was the same reddish-orange color of the object I observed. I am just amazed when I see something like this. It's fascinating and just a bit unsettling. I have observed white lights such as this a few times over the past few years. It's my first time reporting such an incident."],"Case Number":"42321","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}