{"Date Submitted":"09/06/2012 06:37 UTC","Case Number":"42329","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Springfield","Date of the Event":"09/06/2012 04:50 UTC","Disposition":"Unresolved","Region":"Missouri","Latitude":"37.160244","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/42329.html.txt","/var/www/straped/mufon/org/42329.html"],"Source":"MUFON","Longitude":"-93.264536","divs":["Sighting DetailsAround 3 am, my 5 year old son woke me up and said he was scared because he heard a \"loud airplane\". So he climbed in bed with us, and about 4:45 am, I woke up for work. Upon waking, I walked out into my dining room and noticed my husband did not close the blinds overlooking our backyard which faces east Springfield. As it was still dark, I went to close the blinds and noticed a large blinking star-like object. Obviously at first I thought it was a star, but it seemed to be pulsating with light, or flickering. It almost appeared triangular in shape when it was at it's closest point to me. Then I noticed that it was actually moving, but very slowly. Sometimes it would move slightly in a southerly direction and then back to it's apparent path east and away from my location. It appeared smaller in size which is why I knew it was moving away. I was trying to be skeptical and thought it was an airplane or helicopter and was about to leave the window when an orb appeared above it. It would blink once or twice,randomly, then the light would go out and appear to the left of the starlike object working it's way around it. The entire event lasted about 30 minutes before both light objects disappeared east. I noticed when it was farther away, almost out of sight, there appeared to be a halo or light around the area where both objects were. Unfortunately I do not have pictures, my camera didn't work in the dark. I will be happy to answer any questions though."],"Tags":"City","Country":"United States","Viewing Distance":"Over One Mile","Log Number":"US-09062012-0004","map":"<A HREF = \"http://maps.google.com/maps?q=37.160244,+-93.264536(42329)&iwloc=A&hl=en\"> mufon case (42329) map </A>","Object Features":"Unknown","Summary":"Triangular starlike object hovering, moving slowly, while blinking orb moved around starlike object.","Object Shape":"Sphere, Triangle","trends":["There have been 31 other sightings in Springfield","There were no other sightings in Springfield on or around September 6th 2012"]}