{"Tags":"City","Region":"Pennsylvania","Sighting Duration":"00:05:00","Latitude":"40.79451","Summary":"My friend and I took his dog outside, only to discover what we though was a UFO.","Object Features":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.79451,+-80.136727(42326)&iwloc=A&hl=en\"> mufon case (42326) map </A>","Case Number":"42326","Date of the Event":"08/26/2012 10:00 UTC","Object Shape":"Circle, Fireball, Sphere","Disposition":"Unresolved","Source":"MUFON","Country":"United States","trends":["There have been 4 other sightings in Zelienople","There were no other sightings in Zelienople on or around August 26th 2012"],"City":"Zelienople","Object Flight Path":"Stationary,Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/42326.html.txt","/var/www/straped/mufon/org/42326.html"],"divs":["Sighting DetailsOn the night of August 26th I was hanging out at my friends apartment, located in Zelienople, Pennsylvania, just watching some TV. With some commotion coming from his dog, we decided to take it outside to go to the bathroom. While waiting on the dog, my friend and I were having a conversation, just enjoying the night. He was facing south at the time of the conversation while I was facing north, looking directly at him. My buddy, who rarely states his opinion on anything paranormal or unidentifiable, in the middle of conversation yells, \"what the **** is that?\" Astonished about the manner in which he says this, I immediately turned around. Sitting barely above the treeline, all of about 100 feet in the sky, is an orange-ish red orb. It really took us off guard, as neither of us could describe what we were looking at. This orb was decently sized, and was giving off a type of glow, or pulsation. This orb-like object we were staring at had the most lackadaisical movement I had ever seen. It was nearly hovering at the moment we turned around, and had no real eagerness to get anywhere. If anyone has ever snagged a fly, shook it up, and then let it fly away, that is the best way I can describe the movement of this object. Either that or towards the likes of a hummingbird. The orb was at times, hovering stationary, moving slightly higher, slightly lower, and slightly west. We watched it moving like this for all of 2 to 3 minutes before it started to slowly move behind the treeline. Unfortunately, my friend couldn't get his phone out fast enough to snap any sort of picture before the orb ducked behind the trees. My friend took off through the parking lot we were in to try and follow where this object was headed. I soon ran after him, able to spot the orb in-between the trees during mid run. Once I caught up to him, 15 yards away, the object seemingly disappeared behind the trees. This was a bit odd for the fact there was many gaps among the trees and the object would have been at a very low elevation at this time Also, had the object decided to drift up higher, we should have been able to spot it, but nothing more came of the sighting. The whole encounter last around 5 minutes. There is an airport about a mile from my friends apartment, but considering the look of the object, as well as the altitude, I can't say this was any type of airplane. My friend and I were equally shocked at what we saw, nearly at a lose for words. The color and movement of this object is what really intrigued me. The color was almost that of a gradient, being brightest on the inside and fading a bit darker to the outside. Yet, the movement of the object was what had me questioning what this object really was."],"Date Submitted":"09/06/2012 12:13 UTC","Log Number":"US-09062012-0001","Weather Factors":"Unknown","Longitude":"-80.136727"}