{"Tags":"City","Weather Factors":"Unknown","Region":"North Carolina","Date Submitted":"09/06/2012 02:33 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Date of the Event":"09/05/2012 08:47 UTC","Log Number":"US-09062012-0011","Summary":"Orange, star-like orb disappears/reappears, shape-shift to triangular craft. Event followed by military aircraft search","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42336.html.txt","/var/www/straped/mufon/org/42336.html"],"trends":["There have been 4 other sightings in Dunn","There were no other sightings in Dunn on or around September 5th 2012"],"Latitude":"35.316164","Object Shape":"Circle, Disc, Oval, Sphere, Star-like, Triangle, Other, Unknown","Viewing Distance":"101-500 Feet","Country":"United States","City":"Dunn","Case Number":"42336","map":"<A HREF = \"http://maps.google.com/maps?q=35.316164,+-78.602883(42336)&iwloc=A&hl=en\"> mufon case (42336) map </A>","Object Features":"Dome, Other, Unknown","Longitude":"-78.602883","divs":["sighting detailsmyself and two friends were outside having a conversation when i noticed an object too large to be a star in the skyline behind my friends head (he was seated across from me). i observed this dim orange\\yellow \"orb\" for about 45 seconds, it lightly pulsing, thinking it may be a plane (i have lots of military\\airplane\\helicopter traffic in my area, this was nothing of the sorts). as i am about to turn my head away, the object disappears for 3 seconds, then reappears, it continues to stay bright with no pulsing or movement as it had before. at this point, i tell my friends we must get up and look because this craft was similar to a sighting of three crafts about 4 months ago (which were also followed\\searched by familiar aircraft after the incident). as we are watching, the object appears to hover, while still being bright, next it begins to disappear again, then return, as i am saying out loud to my friends (excitedly), \"this isn't a normal aircraft, this is something else!\", the object goes completely black and moves (what i would guess) to be between 100-300 feet across the sky within a matter of 5 seconds, taking a different shape of a triangular bottom with two white lights and a rose-colored light and what appeared to be two spheres on the top, with two small lights reflecting off of the spheres. this object did a complete shapeshift. the object was first a pulsating\\glowing orb that changed to what i could best describe as something trying to mimic an aircraft. the lights underneath and above did not flash like regular aircraft. i was very passionate about it dissapearing the final time, then reappearing, although i had a feeling overcome me like that of \"maybe i shouldn't have seen this object\", or that i shouldn't have pointed out that it wasn't a normal craft. the object continues to coast through the air at a high rate of speed in a nw direction (it was coming from a se direction), continuing to \"mimic\" (i say mimic because the light flashes & flying weren't fluid as a normal plane) an aircraft, the object no longer had an orange hue and pulsated. it crossed the sky at nearly a 2-3x faster rate than regular aircraft. after watching the craft a total of five minutes, it disappears in the nw direction. two minutes after the last disappearance, my friends and i were talking of what we saw when i notice two \"normal\" aircrafts enter the area previously in discussion, followed by a third plane and helicopter a few minutes after the first set of planes. after looking at the \"normal\" planes my friends agreed that the craft we saw was not one of the searching planes. the military aircaft, or what have you, did a broad scan of the sky in which the craft had come. i say these are military i believe because they came from the direction of fort bragg nc's base. after watching the planes and discussing about our experience about ten more minutes, my friends decided to leave. i returned indoors for about 45 minutes, then outdoors again to see if there was still activity. three planes still remained with many, many miles between the planes and at high altitude, i watched these planes ten or so more minutes before returning inside. the entire time they appeared to be flying in circles or just rounding the area. this is not my first time experiencing strong activity above my land, this time i feel that the object sensed or knew that i was bringing it to attention and tried to convince us otherwise that it was a familiar craft."],"Sighting Duration":"Undisclosed"}