{"Log Number":"US-09062012-0010","Longitude":"-80.842127","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Summary":"Bright,white reflective light, like the moon appears on moon lie nights","Date of the Event":"08/31/2012 12:00 UTC","trends":["There have been 68 other sightings in Charlotte","There were 2 other sightings in Charlotte on or around August 31st 2012"],"Latitude":"35.235517","Weather Factors":"Unknown","Region":"North Carolina","Object Features":"Unknown","divs":["Sighting DetailsWe were sitting on the back pourch enjoying the night air.It was clear and stars were visable as I like to star gaze and watch the skys. We live near the airport so we are always looking up at the planes when they assend for a landing.We are close enough to hear the reveseral of the engines to slow the planes and that always draws our attention to look up.It can be pretty loud depending on the season, temp and weather so it will cause to to look up. When It first caught my eyes,it was very high in the sky.I thought it was a star,until I noticed it was moveing.It was much brighter and larger than the other stars visable around it. It was too large to be a plane to be that high in the sky and the planes we do see have thier lights on. The planes that are decending to line up for a landing have thier blinking marker lights on. So I know the difference in a plane and what we saw. The closer it got to us the faster it seemed to appear to be moveing in our direction overhead. Slowely but covering more distance at the same time? I told my wife to be to look at the light and tell me what she thinks it is. She too was amazed at the height,size,brightness and speed. As it got closer to us it seemed to move side to side a little but kept on its directional path. I was too glued on it to even think of getting a camera or picking up my cell phone to snap a photo. I was just so curious, captivated and mesmerized. Seems just a very few minutes passed like seconds. Soon it crossed the skyline we had view of and went out of sight over our house. Leaving still in the same appearence in intensity,brightness and size as it was when I first noticed it. It really had me questioning what we had just witnessed. Then I thought it may have been the International Space Station passing overhead? Not sure how to find the path of it to compare too. It wasn't a plane or blimp, it wasnt a star or planet and it certianlly wasn't just a bright light. More like a glowing bright light reflecting from it. We both accept it to be a UFO!"],"Tags":"City","files":["/var/www/straped/mufon/html2text/42335.html.txt","/var/www/straped/mufon/org/42335.html"],"City":"Charlotte","Date Submitted":"09/06/2012 02:15 UTC","Disposition":"Unresolved","Country":"United States","Sighting Duration":"00:07:00","Object Shape":"Circle","Case Number":"42335","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.235517,+-80.842127(42335)&iwloc=A&hl=en\"> mufon case (42335) map </A>"}