{"Longitude":"-82.336842","Date Submitted":"09/06/2012 07:47 UTC","Date of the Event":"09/05/2012 09:15 UTC","Log Number":"US-09062012-0017","Summary":"Bright red-orange object hovering over the tree tops, then vanishes.","Object Shape":"Fireball, Sphere, Star-like","Source":"MUFON","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI was outside walking my dog, getting ready to leave my parents house, when my dad walked out on the porch with my mom and asked what the bright light was in the sky. I looked and it was red-orange and pulsing or flashing like a star would, and it was just hovering over the trees in the southern sky. I wasn't sure at first but i thought maybe it was a planet, although it seemed to be alot brighter than any planet I've ever seen. So I told them I'd check my starmap on my phone to see if there was anything that'd show up. My mom then said that it had started moving towards us. I pointed my phone at it and just as I said there was nothing on the starmap that'd be that bright it just disappeared into the sky. No flash of light or no sound. It just vanished. We all saw it. After it disappeared, I laughed it off because it was a little cloudy and i thought maybe it just went up into the clouds. But then we noticed a plane flashing above the clouds so I then realized if we could see the dim lights of the plane through the clouds, we would definitely be able to see the orb through them as well. We stood there about 10 min after it disappeared waiting to see if it would reappear but it never did. I was freaked out once I realized what happened because about 8 years ago, me and my little brother witnessed the same thing in that area. But at that time I had a telescope out, and when I went to look at it with the telescope it vanished as well."],"Sighting Duration":"Undisclosed","Case Number":"42343","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.978686,+-82.336842(42343)&iwloc=A&hl=en\"> mufon case (42343) map </A>","Object Features":"None, Unknown","Latitude":"38.978686","Region":"Ohio","files":["/var/www/straped/mufon/html2text/42343.html.txt","/var/www/straped/mufon/org/42343.html"],"Country":"United States","Weather Factors":"Unknown","City":"Vinton","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","trends":["There has been one other sighting in Vinton","There were no other sightings in Vinton on or around September 5th 2012"]}