{"Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Flight Path":"Stationary","Object Shape":"Flash, Sphere, Star-like","Weather Factors":"Unknown","Date of the Event":"09/06/2012 12:00 UTC","Disposition":"Unresolved","Country":"Canada","Summary":"Hovering glowing sphere","Sighting Duration":"Undisclosed","Object Features":"Unknown","divs":["sighting detailsit was 11:00pm and my boyfriend and i were about an hour into sleep. i woke up abruptly for no reason around 11:30pm-12:00am. at this time i noticed a glowing dumbell\\sphere shaped object hovering outside my window. it was about 100-200feet in a south east position, i am not sure of where exactly the object was hovering, but it was out there in that direction and it seemed like it was over the country side about 100-200ft up. i noticed the object because it was a glowing ball shining outside my window, and there are no street lights. my first thoughts when i saw the object, were that i was trying to figure out some logical reason as to why it was there. as i was thinking of every possible explanation i realized that there was no reasonable answer to this, and it was an unidentified object. there are no weather balloons in this area. my feelings towards the object at this moment were fear, and confusion. when something unexplainable appears outside your window, it is a shocking event. i tried to wake up my boyfriend by shaking him, and he was in a very deep sleep and did not wake up when i shook him, which makes the situation more weird because he usually wakes up when i ask him to.. seeing as i have diabetes and sometimes he has to help me during the night. i lost sight of the object after i tried to dismiss the object by trying to go back to sleep. as i fell asleep i began to have vivid dreaming. i am positive this was not something ordinary."],"City":"Cambridge","Date Submitted":"09/07/2012 10:42 UTC","Source":"MUFON","trends":["There have been 11 other sightings in Cambridge","There were no other sightings in Cambridge on or around September 6th 2012"],"Longitude":"-80.272891","Case Number":"42359","map":"<A HREF = \"http://maps.google.com/maps?q=43.346954,+-80.272891(42359)&iwloc=A&hl=en\"> mufon case (42359) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/42359.html.txt","/var/www/straped/mufon/org/42359.html"],"Region":"Ontario","Log Number":"CA-09072012-0007","Latitude":"43.346954"}