{"City":"Horizon City","Region":"Texas","files":["/var/www/straped/mufon/html2text/42367.html.txt","/var/www/straped/mufon/org/42367.html"],"Sighting Duration":"Undisclosed","divs":["sighting detailslooks like stars coming up in the horizon at 1: 15am and then the second one shows up with more activity at 3:15 am every morning the second unit appears and dissapear several time up to five times and apperars in a different locatino,then fallows a flight patter simlair to the fist unit,before the units show up their are several glowing orbs the look like dico ball, that shine red,blue,white,then they fallow the two units till dawn,about 6:30am. this has been going on since we moved hear 09\\21\\2012 every night till dawn, i thought subject matter was stars in the horizon coming up,then i see them appear end dissapear,then they show up in different locations ,when subject matter appears the glowing orbs tend to laminate even more,then when subject matter shows up the orbs tend to calm down in glow. i use buanculars to see subject matter, i only see lose site of subject matter when they distend at a rapid speed then at a distance you them them coming into sight by a faint glow then they appear in an instant bright white glow. i sept outside my backyard to see subject matter."],"Object Flight Path":"Stationary,Hovering then path,Other","Tags":"City","Date of the Event":"08/21/2012 03:15 UTC","Source":"MUFON","Country":"United States","trends":["There have been no other sightings in Horizon City","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=31.692612,+-106.207479(42367)&iwloc=A&hl=en\"> mufon case (42367) map </A>","Object Shape":"Other","Object Features":"Unknown","Disposition":"Unresolved","Date Submitted":"09/07/2012 07:06 UTC","Summary":"Looks like a star appears and disappear,appears in different location,every night 2 objects,@1:am and 3:15am till dawn.","Longitude":"-106.207479","Log Number":"US-09072012-0016","Case Number":"42367","Latitude":"31.692612","Viewing Distance":"Over One Mile","Weather Factors":"Unknown"}