{"map":"<A HREF = \"http://maps.google.com/maps?q=33.905554,+-118.092419(42379)&iwloc=A&hl=en\"> mufon case (42379) map </A>","Object Flight Path":"Path with directional change","Object Shape":"Circle","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Norwalk","There were no other sightings in Norwalk on or around November 4th 2001"],"Longitude":"-118.092419","divs":["Sighting DetailsI was watching the end of the 2001 world series when my wife,my two sons and my brother in came to the door as they were out that night.When I saw there faces they all looked concerned. I ask them what was happaning and they pointed to the sky westward. Out of the clouds around 15-20 round bright lights came out in a DNA formation, It really looked like a invation. We could not believe what was happenning. While looking around my block to see if anyone was looking at this I decided to knock on my niegbors door and told him to look up and he was in awe and shock. I decide to get my video recorder and I took videos of this lights doing trick up in the sky. They would scatter and then get back together. I called the TV stations and let them know I had footage and blew me off. Next day on the Newspaper it said they were northern Lights, my niegbor showed me the newspaper. These things were not northern lights' I have analog video and I can't down load it here. Believe me' I would not take the time to type this, I have better things to do."],"Source":"MUFON","Object Features":"None","Summary":"15 to 20 round bright lights camedown from clouds in DNA formation","Date Submitted":"09/08/2012 05:08 UTC","Sighting Duration":"Undisclosed","Log Number":"US-09082012-0005","Region":"California","Disposition":"Unresolved","Country":"United States","Date of the Event":"11/04/2001 12:00 UTC","Latitude":"33.905554","files":["/var/www/straped/mufon/html2text/42379.html.txt","/var/www/straped/mufon/org/42379.html"],"City":"Norwalk","Viewing Distance":"101-500 Feet","Case Number":"42379","Tags":"City"}