{"Log Number":"US-09082012-0004","Object Features":"Unknown","trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around September 2nd 2012"],"Viewing Distance":"101-500 Feet","Latitude":"33.99285","Summary":"Saw bright lights high in sky and noticed next it was descending and looked oval and quickly it was very close hovering around some trees.","Case Number":"42377","Tags":"City","Object Shape":"Circle, Oval","Date Submitted":"09/08/2012 03:22 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.99285,+-84.429316(42377)&iwloc=A&hl=en\"> mufon case (42377) map </A>","Date of the Event":"09/02/2012 08:35 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/42377.html.txt","/var/www/straped/mufon/org/42377.html"],"divs":["Sighting DetailsI was driving north on Johnson Ferry Road in East Cobb (which is in Marietta, Georgia). It was at about 8:35pm EST and I was on my way home from helping my son move. I glanced up into the sky on my left as I had noticed a very bright light and thought it must be an airplane headed to Dobbins Air Force Base. The speed limit is low on that road so I just happened to glance up at the lights again and was surprised to see that they appeared to be much closer and shaped in an oval, which struck me as really odd. I then pulled over to the side of the road to observe because I knew I had not seen anything that looked like this before and it seemed to be descending very rapidly. As it came closer to the tree tops I could clearly see that it was a circle of white lights with a blue light kind of under one of the white lights. The lights appeared to be individual lights and I did not notice them making any movement, such as spinning or pulsating. Within seconds it seemed to be over some trees and a high voltage power line. The object moved around the trees toward my car for a moment then just as quickly seemed to reverse and go back behind the trees. I had called my husband at about 8:41 to tell him what I was looking at and he said to video it. Then just as quickly the lights I had seen through the trees were gone but I did not seen any ascension. I was pretty nervous about the whole incident so I drove on the 5 minutes it took to get home. I did e-mail our local radio station, WSB, and asked if they had any other reports of this incident and received no reply from them. This object definitely moved differently than any airplane, helicopter or other flying machine I have ever seen. It seemed to be able to dart about, move up and down, backwards and forwards with no effort whatsoever, it also hovered a couple of times for a couple of seconds. However, I could not see any craft, only the lights. My feelings, reactions, and actions? Pretty much felt like the whole thing was very surreal. I obviously became overcome or I know I would have thought to video it or at least take a picture, but I was also pretty nervous and it did scare me when it came toward my car for that instant. I called my husband because I felt like I had to tell him what I was seeing and it felt like someone needed to know I was parked on the road watching this unknown \"thing.\" I looked up every web site I could find for electronic flying toys or things you could purchase and nothing came close to looking like this object, nor could any of them fly as high as this was in the beginning, or move or come close to the description. So, I guess I am still in a bit of shock but no question about what I saw."],"City":"Marietta","Weather Factors":"Unknown","Region":"Georgia","Longitude":"-84.429316","Object Flight Path":"Path then hovering"}