{"Region":"Nevada","Sighting Duration":"Undisclosed","Log Number":"US-09072012-0019","City":"Las Vegas","Viewing Distance":"Over One Mile","Object Features":"Unknown","Tags":"City","Case Number":"42371","Date of the Event":"08/25/2012 02:01 UTC","trends":["There have been 229 other sightings in Las Vegas","There were 2 other sightings in Las Vegas on or around August 25th 2012"],"Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42371.html.txt","/var/www/straped/mufon/org/42371.html"],"Country":"United States","divs":["Sighting DetailsI was sitting on the patio drinking my morning coffee looking into this white low lying fluffy cloud. I often watch clouds change shape so I was waiting for this cloud to change shapes when I suddenly noticed an opaque black object suddenly do a loop in the cloud and then race his small straight vehicle to the end of the cloud from right to left as if it was a joyful experience and I felt such joy as I saw his happy flight. As he reached the edge of the cloud he suddenly came to an abrupt stop. It was at that time I observed ten different vehicles which seemed to be like this one just hover without much movement in a circle, kinda like wild birds would. They then seemed to appear more bommerang in shape. I blinked several times thinking I cannot be seeing this but the vehicles stayed in the circular pattern moving all about hovering but not losing the circle formation, like shooting from one spot to another. I then thought I need my cell phone or camera but knew if I left they would be gone so I went to the patio and called my husband. When I turned back the circle of vehicles were gone and I just barely saw two of the objects which once again looked black and straight now streaking to the North then dissapeared completely."],"Source":"MUFON","Summary":"observing a low lying cloud, noticed black object doing loops near cloud while racing towards the end of the cloud suddenly stopping in the center of 10 boomerang shapes.","map":"<A HREF = \"http://maps.google.com/maps?q=36.263913,+-115.233728(42371)&iwloc=A&hl=en\"> mufon case (42371) map </A>","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"36.263913","Object Shape":"Boomerang","Date Submitted":"09/07/2012 11:17 UTC","Longitude":"-115.233728"}