{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Ontario","Case Number":"42370","Source":"MUFON","Object Shape":"Sphere","Summary":"Object only visible in the Infrared wavelength","Date of the Event":"09/07/2012 10:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Country":"Canada","Latitude":"43.657746","map":"<A HREF = \"http://maps.google.com/maps?q=43.657746,+-79.379164(42370)&iwloc=A&hl=en\"> mufon case (42370) map </A>","Disposition":"Unresolved","Tags":"City","City":"Toronto","Date Submitted":"09/07/2012 11:02 UTC","Object Features":"Unknown","Log Number":"CA-09072012-0018","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around September 7th 2012"],"divs":["Sighting DetailsToday I got a used Sony HDR HC1 HDV Handy-cam. I got it to test out IR filming. I have read and seen on youtube people video taping objects in the sky visible to IR but not visible to the naked eye so I wanted to see if I could see anything myself. I went up to a roof of a condo were I was allowed to shoot to see what I could see. For the first 20 mins I spent searching the sky...I didn't see anything that my eyes couldn't see. Then I moved positions to another corner of the rooftop and searched for another 10 to 15 mins and found something. Off on the horizon I caught in HD Night Vision IR two stationary lights that were pulsating. I switched the camera between normal mode and IR mode. You can clearly see the object emitting IR light in Night vision mode as bright as other objects in the frame but when I switched to normal shooting mode these stationary lights could not be seen. Two or three plans came into the frame in the distance. They could bee seen in both IR and Normal mode. But these orbs could not be seen in normal mode like the plans. I recorded 30 mins of this to HD Tape. I checked the tape and it is as I describe it. I cannot explain it. I could not see these things with my eyes but in Night Vision mode they sure were there. I rec until my battery ran out and I only have one so I couldn't get more. Will be posting on you tube after I get the tape digitized in the next few days. I cannot explain this!"],"Object Flight Path":"Stationary","Longitude":"-79.379164","files":["/var/www/straped/mufon/html2text/42370.html.txt","/var/www/straped/mufon/org/42370.html"]}