{"files":["/var/www/straped/mufon/html2text/42383.html.txt","/var/www/straped/mufon/org/42383.html"],"Country":"United States","Viewing Distance":"20 Feet or Less","City":"San Antonio","map":"<A HREF = \"http://maps.google.com/maps?q=29.431582,+-98.492358(42383)&iwloc=A&hl=en\"> mufon case (42383) map </A>","Object Features":"None","Log Number":"US-09082012-0008","Case Number":"42383","Longitude":"-98.492358","Object Shape":"Cylinder, Oval, Sphere","Summary":"Dull white sphere that appears to elongate and flash or reflect sunlight occassionally","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was having a smoke break next to the building where I work. An airplane taking off from the San Antonio airport caused me to look up and that's when I saw it. It was stationary at about 1500 ft and moving towards my location, which would be against the prevailing wind (2-5 MPH westernly). The object would move and stop, not appear to tumble like if it was a plastic bag or any ordinary piece of trash picked up by the wind. The movement was very linear, not go up and down like a floating piece of trash would do. I could see other airplanes and large black buzzards too. The sky was clear and weather conditions were fair, at about 88 deg F. This object moved slowly, deliberately, stop, move again, stop, and then suddenly began a controlled \"stepped\" fashion descent into the Salado Creek forested area in broad daylight. It finally descended into this area, where I could then contrast the ball of dull light as it descended in front of the forest, which made it look larger than a basketball. I estimated the distance between me and the object at about 1 mile upon landing. I did not see it land because of visual obstacles between me and the object. I am guessing it did. I waited for about 15 min in the direction of the object, did not see it take off. I had to return to work so could not observe it anymore. I was hoping to have another person see it but unfortunately I was by myself. I remember thinking \"please come closer\" at the beginning of the sighting and that's when the object appeared to move in my direction but then veer off into the creek area about a mile away and began the stepped landing sequence. It is not my first sighting, I've seen multiple objects in the San Antonio area both during the day and at night. The most spectacular I reported to MUFON a few years back. I will not release the specifics of my location on this report and other information to protect my employment."],"Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"29.431582","Source":"MUFON","Region":"Texas","Date of the Event":"09/07/2012 12:01 UTC","Date Submitted":"09/08/2012 10:57 UTC","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around September 7th 2012"],"Disposition":"Unresolved"}