{"Latitude":"40.356475","Object Flight Path":"Stationary","Date of the Event":"09/07/2012 12:00 UTC","files":["/var/www/straped/mufon/html2text/42395.html.txt","/var/www/straped/mufon/org/42395.html"],"Object Features":"Unknown","Weather Factors":"Unknown","Region":"New Jersey","City":"South Brunswick Township","Disposition":"Unresolved","Summary":"For the last year they've been out on clear nights, sometimes there blinking very hard.","Date Submitted":"09/08/2012 11:30 UTC","divs":["Sighting DetailsThe first time I ever saw them I was with my mom and we were driving down the road to our house. There were three, the one in the middle went straight really fast. The ones on the side did a really big circle manuver and flew right back the way they came. This was through the clouds. I was in the Marines four years ago where I jumped out of planes and also had a secret clearence. When I went to Guam I had to sign another paper because we worked under a hanger for the time we were there but nothing special except stealh planes I guess. Anyway the incident that I'm talking about right now happened 20 years ago. There is no aircraft in the military now that can manuver the way they did. So no matter what there real, I dont care what you say. What I'm filling out now is on clear nights you can see a bunch of them blinking in different areas. Sometimes amber, blue, green, and red. With out taking a hard look at them they look like stars and the distance of stars. This is what I dont want to talk about, I've been going through a lot with my mind in a very unnatural way. So one night and this is for real something made me look out the window and there were 6, in symetric cirlce shape, I would look up what the name of the shape is but I'm not and they haven't been in that spot for a while or in that shape for awhile. So I started going outside and in other spots there was one blinking really hard blue, green, red, amber, and I think white. The only thing is I dont know why I'm the only one reporting them in my area for it being so long. But in the past 2 and half years a lot of weird things have happened to me. I dont want to talk about that on this form because it would be to long and I dont want to be doing this anyway but I guess I need to. I'm not claiming I was abducted either. I just want someone to tell me their stars burning out which I definetly know there not. I didn't think about the event 20 years ago very much. Although who I was 4 years ago and who I am now and what I think about is very different. Like there's so many reportings that when they do introduce themselves to earth, most people are going to be like I knew it. Yes I said when they do because you have to be a nimrod to think we are the only planet with life in the universe thats most advanced. Next they would have to be a lot smarter then us if they could travel through space. For example they probably do have the capability of invisibilty and obvisouly camoflauge. What better way to blend in then being a burning star or just a star. Just like snipers blend in with the enviroment around them. Also a while ago I finally said something to my uncle one night and he was like wow when I pointed them out. The next day I guess he said they were burning stars, I dont know why he didnt say that that night. And for the next couple of weeks when the nights were clear, there was no blinking stars after that. All I know is a lot of weird stuff has happened to me that I can't explain. I would talk to a psycologist but that would do nothing and I figure your group is use to hearing things like this. And for some reason I'm worried about treason and thats the only crime written in the constitution."],"Log Number":"US-09082012-0021","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Star-like","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.356475,+-74.509964(42395)&iwloc=A&hl=en\"> mufon case (42395) map </A>","Tags":"City","Longitude":"-74.509964","trends":["There have been no other sightings in South Brunswick Township","This sighting has never been favorited."],"Case Number":"42395"}