{"Region":"Maryland","Log Number":"US-09082012-0022","City":"Dundalk","Object Features":"Unknown","Case Number":"42396","Date of the Event":"09/08/2012 08:45 UTC","Country":"United States","Date Submitted":"09/08/2012 11:34 UTC","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.294187,+-76.507599(42396)&iwloc=A&hl=en\"> mufon case (42396) map </A>","Longitude":"-76.507599","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/42396.html.txt","/var/www/straped/mufon/org/42396.html"],"Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","divs":["sighting detailsi was in my back yard,and looked up in the sky to see what appeared at first to be a plane coming directly towards me with landing lights on ,but the color was`nt right it was orange like a small mid-day sun, no strobe lights ,no navigation lights, no sound,moving way too slow to be a plane. i yelled to my neighbor to look. we both observed it to fly over us silently very slowly. iran into the house to get my digital camera, ran back out and was able to snap several pictures. the craft continued past and seemed to dim, shrink and disappear. aprox. 2-3 minuites later another appeared, on what appeared to be the exact same flight path, out of the west then slowly turning south east into the easterly wind with light rain falling. aprox 1,000 foot or less altitude under the cloud cover. i also got a few digital photo`s of it. it really scared me i was shaking so much it was hard to hold the camera still.it scared me to the core it is now aprox. 2 1\\2 hours later and i am still shaky. can somehow changed in the sense that this is real. both objects seemed to dim,shrink and dissapear. i honestly do not know how to download the pictures right now. i am just a \"country boy really\". but if someone can come by.i can show you the pictures, and you can take the actual camera if it helps.....this is a real \"genuine\" sighting not a hoax. that the photo`s will prove!!!!!......please follow up with me....thank you"],"Source":"MUFON","Object Shape":"Circle, Oval, Sphere","Latitude":"39.294187","Summary":"orange ora very bright, silent ,slow moving,changed direction,shrunk and dissapeared,digital photos taken","trends":["There have been 3 other sightings in Dundalk","There were no other sightings in Dundalk on or around September 8th 2012"]}