{"Disposition":"Unresolved","Object Shape":"Circle","Longitude":"-77.545384","Summary":"4 lights in Sky, under clouds, rotating, coming together, then expanding, repeating","Sighting Duration":"Undisclosed","City":"Fredericksburg","map":"<A HREF = \"http://maps.google.com/maps?q=38.230961,+-77.545384(42392)&iwloc=A&hl=en\"> mufon case (42392) map </A>","trends":["There have been 17 other sightings in Fredericksburg","There were 2 other sightings in Fredericksburg on or around September 8th 2012"],"Case Number":"42392","Weather Factors":"Unknown","divs":["sighting detailsfour white lights in sky, high enough to be more than simple flash lights, but just under the lower hanging cloud cover (maybe 500+ ft), coming together into a central axis point, rotating approximately 30% on that axis, then each of the four expanding out into a larger open circular shape equidistance from center, then all-four lights rotating clock-wise on-axis another 30% in unison, then coming together in the center (axis), then repeating over and over again, for more than two hours. the four lights seemed to follow our moving vehicle, but stay in a northern trajectory. we were traveling in our vehicle at 20 mph, both of us (2) saw the same lights doing the same thing. the lights were completely overt. we were spooked, as first as though it were a ufo, then thoughts turned to spy plane\\helicopter\\satellite. we did not think these were \"advertising lights\" used in store \"grand openings\" and the like. nor did we think these were \"search lights\" or \"county fair\" type lights."],"Log Number":"US-09082012-0018","Object Features":"Other","Date Submitted":"09/08/2012 10:15 UTC","Source":"MUFON","Latitude":"38.230961","files":["/var/www/straped/mufon/html2text/42392.html.txt","/var/www/straped/mufon/org/42392.html"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"Virginia","Object Flight Path":"Hovering then path,Other","Date of the Event":"09/08/2012 09:00 UTC"}