{"Case Number":"42404","Date Submitted":"09/09/2012 06:31 UTC","divs":["Sighting DetailsFirst off, this event happened on the night of July 4th, 2010. It's easy to suspect that I and four friends misidentified some sort of fireworks display, and that's what I thought it was until I really got a look at it, but I will simply start from the beginning. I and six friends went out into a field to shoot off some fireworks to celebrate Independence Day, and we had been out there for about two hours already when the event occurred. We had already used up our supply of fireworks and we were discussing what to do next. Two of my friends decided to go into town to purchase more fireworks, so that left five of us behind in the field waiting for their return. We weren't really talking to each other, we were pretty much all just enjoying the weather and looking up at the stars. The moon was not visible that night. Well, I noticed the object before anybody else did. I could see a fairly large object glowing through the trees to the southeast, in the same direction that I had been looking at the stars. The object moved very slowly over the tops of the trees, and eventually I could see it entirely. The object was a mildly copper-colored (the actual color is difficult for me to describe, like a mixture of gold, silver, and copper colors) sphere which had flames erupting from the bottom of it, and rising up around the bottom of the sphere before finally dissipating around halfway up the sides. It emitted an orange-ish aura, not unlike the color of flames. It pulsated and flickered, much like light cast by a candle. As it slowly drifted westward, it didn't seem to change speed, direction, or altitude at all. It took over five minutes for the object to pass completely over the field and disappear behind the trees on the opposite side from where it had originated. I could clearly see the spherical shape of the object on the top, and I could see the flames rising around the sides of it. The flames seemed to me to originate somewhere on the bottom of the object. The relative size of the object was anywhere between the size of a dime and a penny, but it was just around that size. Without any useful points of reference, I can't say for sure how high it was, but I would estimate an altitude of at least 200-300 feet, as it very easily passed over the trees without casting any light on them at all. It was moving at approximately 5-10 miles per hour almost directly eastward. It didn't make any noise at all, and the object didn't change at all during its visible flight over the field. So far as I can tell, it was no firework in my opinion, all of the fireworks that I have ever seen simply can't burn that ferociously for that long while staying airborne. I estimate the object to have been far too large to be part of any type of firework display. At least one person that night tried to record a video of the object with their cell phone, but the low-quality camera couldn't register the object at all on the viewfinder. I can have more information readily available if requested."],"Object Shape":"Cylinder","files":["/var/www/straped/mufon/html2text/42404.html.txt","/var/www/straped/mufon/org/42404.html"],"Viewing Distance":"501 Feet - 1 Mile","City":"Searcy","map":"<A HREF = \"http://maps.google.com/maps?q=35.280062,+-91.782394(42404)&iwloc=A&hl=en\"> mufon case (42404) map </A>","Log Number":"US-09092012-0006","trends":["There has been one other sighting in Searcy","There were no other sightings in Searcy on or around July 4th 2010"],"Object Features":"None","Region":"Arkansas","Longitude":"-91.782394","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Straight-line path","Source":"MUFON","Sighting Duration":"00:05:00","Latitude":"35.280062","Disposition":"Unresolved","Summary":"Copper-colored metallic sphere cloaked in flames which erupted from the bottom of the craft and went about halfway up the sides","Tags":"City","Date of the Event":"07/04/2010 11:00 UTC"}