{"Disposition":"Unresolved","trends":["There have been 3 other sightings in Prince Albert","There were no other sightings in Prince Albert on or around September 7th 2012"],"Sighting Duration":"Undisclosed","Region":"Saskatchewan","Source":"MUFON","Date of the Event":"09/07/2012 12:00 UTC","Summary":"I saw movement in the sky and looked up thinking a satelite was passing overhead. I saw a noiseless, boomerang style object travelling north to south..","City":"Prince Albert","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/42403.html.txt","/var/www/straped/mufon/org/42403.html"],"Case Number":"42403","Latitude":"53.194936","Country":"Canada","Log Number":"CA-09092012-0005","Longitude":"-105.743663","map":"<A HREF = \"http://maps.google.com/maps?q=53.194936,+-105.743663(42403)&iwloc=A&hl=en\"> mufon case (42403) map </A>","Object Flight Path":"Straight-line path","Object Shape":"Boomerang","divs":["Sighting DetailsI was loading supplies into my vehicle about 10 at night to be ready for an early morning job. As I closed the hatch, I noticed movement in the sky. I looked up thinking a sattelite was passing overhead. I saw a noiseless, boomerang style object travelling quickly from north to south. It was directly overhead. I saw the shape because city lights illuminated it, and it seemed to have about 7 reflectors along the front wing edges. The trajectory and speed were constant, travelling much faster than any sattelite I've seen. It also appeared to be flying very low. My first thought was that it was a glider, but then realized no glider would fly over a city at night. As well, a glider moves differently, subject to wind conditions. This object was constant. It had a seagull shape. In thinking about it later, I thought maybe it was a large bird. But birds have heads, and again, it's path and speed were to constant even for a gliding bird. I did not view it more than 20 seconds as it went past the treetops out of my view. I ran to a better vantage point but it was gone by then. I have never seen anything like this before and am very curious as to what this could be. I have searched the 'net a little before finding this sight, and have found reports of similar sightings in North America."],"Date Submitted":"09/09/2012 05:40 UTC","Object Features":"Wings","Viewing Distance":"101-500 Feet"}