{"Disposition":"Unresolved","Country":"United States","Date of the Event":"09/08/2012 10:30 UTC","Viewing Distance":"Over One Mile","Log Number":"US-09092012-0009","Date Submitted":"09/09/2012 12:10 UTC","City":"South St Paul","Object Flight Path":"Path with directional change","Longitude":"-93.028321","Object Shape":"Star-like","Tags":"City","files":["/var/www/straped/mufon/html2text/42407.html.txt","/var/www/straped/mufon/org/42407.html"],"Case Number":"42407","Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=44.900224,+-93.028321(42407)&iwloc=A&hl=en\"> mufon case (42407) map </A>","divs":["Sighting DetailsI was outside on my front stoop with my dog at approximately 10:30pm CDT. While observing the stars I observed a fuzzy orange light to the east, approximately 45 degrees above the horizon, that I initially took to be a satellite in orbit traveling from the ESE towards WNW. As I continued to observe the object I noticed very slight changes in its flight path from left to right and back again. I assumed my mind was playing tricks on me. I also noticed that it appeared to be much lower than any satellite I had witnessed before which was confirmed to me when it passed under some lingering clouds. The object then abruptly changed to a N trajectory. At this point I jumped to my feet in shock and stepped off of the stoop to observe the object. As I continued to watch the object it again suddenly changed its course to a NW heading, I believe I uttered something like \"Holy Sh**!\" and watched as it traveled in this direction until it passed beyond the roof line of the house next door. At this point I went to the back yard to see if I could pick it up again, but was unable to locate the object. The entire sighting lasted no more than 3 minutes. I have observed many different kinds of aircraft at our home including commercial flights to and from MSP International in Richfield and Holman Field in Saint Paul. Both of these airports also have military attachments and I have observed C-130's, Blackhawks and Apache's. I have also seen smaller private aircraft out of South Saint Paul's Richard Fleming Field including WWI and WWII aircraft. Also on numerous occasions have witnessed satellites in the night sky at our home. This was unlike anything I have seen before."],"Latitude":"44.900224","trends":["There have been 2 other sightings in South St Paul","There were no other sightings in South St Paul on or around September 8th 2012"],"Region":"Minnesota","Object Features":"Unknown","Source":"MUFON","Summary":"I observed a fuzzy orange light which changed direction abruptly a few times.","Weather Factors":"Unknown"}