{"divs":["Sighting DetailsOk, the adrenaline is still flowing, but I want to write this down as it's fresh, forgive my grammar. Driving north on 680 in San Ramon California. Saw 5-7 red-orange orbs in the sky flying in impossible formations. They were able to rapidly reorganize into different flying formations. I turned the car around and exited the highway. All four people in the car witnessed this, when I found a safe place to try and film I could not get around the trees and buildings to get a clear shot. Another driver pulled their car over and witnessed the same thing, I gave this driver my binoculars to try and see if he could see while I tried to capture on my iPhone. These things were fast and I just couldn't catch them on my iPhone, I really tried. I cannot express how intense a feeling it is to see a real UFO and trying and get a good look. The objects basically started to fade out one by one and then they were gone. I saw these same type of objects on May 6 in the bay area. I have no doubt something major is going on. We were seeing is their glow, there has to be a solid surface, but the distance was too great to discern. They were at around 20K feet by my estimate. There is no way at these were planes or helicopters they move way to fast and change direction in impossible ways."],"Region":"California","Longitude":"-121.975315","files":["/var/www/straped/mufon/html2text/42400.html.txt","/var/www/straped/mufon/org/42400.html"],"Log Number":"US-09092012-0002","Case Number":"42400","Country":"United States","Object Features":"Unknown","Date Submitted":"09/09/2012 02:52 UTC","Sighting Duration":"00:06:00","Disposition":"Unresolved","Object Shape":"Sphere","Tags":"City","Source":"MUFON","City":"San Ramon","Date of the Event":"09/08/2012 10:20 UTC","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","trends":["There have been 5 other sightings in San Ramon","There were no other sightings in San Ramon on or around September 8th 2012"],"Summary":"Driving north on 680 saw 5-7 red-orange orbs in the sky flying in impossible formations","map":"<A HREF = \"http://maps.google.com/maps?q=37.782477,+-121.975315(42400)&iwloc=A&hl=en\"> mufon case (42400) map </A>","Latitude":"37.782477"}