{"Date of the Event":"08/30/2012 07:45 UTC","Weather Factors":"Unknown","Case Number":"42401","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around August 30th 2012"],"Latitude":"34.850269","files":["/var/www/straped/mufon/html2text/42401.html.txt","/var/www/straped/mufon/org/42401.html"],"Object Shape":"Oval","Viewing Distance":"Over One Mile","divs":["sighting detailsi took a trip to sedona, az from chicago & stayed at the kings ransom inn. on thurs., aug. 30, 2012, at about 7:30 p.m., i walked out of my hotel to snap some photos from my cell phone, while waiting for a friend to pick me up for the evening. at approximately 7:45 p.m., as i was gazing at the western skyline of dark cliffs silhouetted against a fading sunset, i saw, to my utter amazement, a brilliant, golden, oval orb in vertical position, hover over the mountain peaks. at the same time, a small jet appeared and flew in front of the orb, then disappeared. i stared at the orb in disbelief, yet awestruck. i watched it hover over the dark peaks, then, slowly descend behind them. i took several photos of what i had seen, but, unfortunately, my cell phone camera is very basic. it could not even capture the full moon way up in the mountains, where there existed no other light. my friend, whom i shared the evening with, has lived in sedona for 1 1\\2 years. he had talked about seeing plenty of ufo's there. i described what i had seen to him, and he said that he, himself, had witness that type of orb. i was actually quite excited and happy that i witnessed an orb. i have believed in their existence for a long time, but had never seen one. as far as being affected psychologically, it is al very positive. i thank you for your highly informative website, where those like me, can report ufo sightings. documenting this sighting to your non-profit organization has allowed me to express the wonder and amazement of what i saw, what i know is not of our earth."],"Disposition":"Unresolved","Country":"United States","Region":"Arizona","Date Submitted":"09/09/2012 03:27 UTC","City":"Sedona","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.850269,+-111.777399(42401)&iwloc=A&hl=en\"> mufon case (42401) map </A>","Log Number":"US-09092012-0003","Object Features":"Unknown","Longitude":"-111.777399","Summary":"I saw a gold, luminous, vertical oval orb above mountains in the western sky.","Object Flight Path":"Hovering then path"}