{"Longitude":"-117.785914","Case Number":"42414","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","trends":["There have been 28 other sightings in Irvine","There were no other sightings in Irvine on or around September 7th 2012"],"Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/42414.html.txt","/var/www/straped/mufon/org/42414.html"],"Disposition":"Unresolved","Latitude":"33.693277","divs":["sighting detailson the way home from work, taking 405 fwy. looking towards the left side. generally small planes take off from that direction from john wayne airport. saw an object in the sky and thought to myself, \"what a weird looking airplane\" kept checking the cars in front of me and around me since i was on the fwy and looked again towards the left and noticed clear as clear can be it was a rectangular\\square shape with round edges and it was huge, i mean huge, just hoovering there and it was so shiny....oooo so shiny! you can see the reflection of the sun just beaming off of it. i looked at it 3 x in unbelievable shock. and when i looked again it was gone, gone just like a blink. i will never look at the sky the same again. what amazes me the most was the width and size of this thing. it wasn't circular shaped like so many people say a ufo is. that was totally not what i expected, there were no lights underneath it or on the side of it. it was just this shiny, rectangular\\squarish rounded edge shape. and now i am looking everywhere for it on youtube sites or any other sites to see if anyone has seen anything or similiar like it. what scares me was the size. i am still traumatically shocked and everytime i close my eyes. i see the shape again and again and again."],"Object Shape":"Square, Rectagular","Region":"California","City":"Irvine","Date Submitted":"09/09/2012 08:14 UTC","Viewing Distance":"101-500 Feet","Date of the Event":"09/07/2012 12:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.693277,+-117.785914(42414)&iwloc=A&hl=en\"> mufon case (42414) map </A>","Log Number":"US-09092012-0016","Summary":"405 fwy heading towards, Bristol St. thought at 1st what a strange looking airplane. instead it was a UFO","Object Flight Path":"Unknown"}