{"Viewing Distance":"Unknown","Latitude":"38.357504","files":["/var/www/straped/mufon/html2text/42418.html.txt","/var/www/straped/mufon/org/42418.html"],"Disposition":"Unresolved","Object Shape":"Sphere","Case Number":"42418","Object Flight Path":"Straight-line path,Other","divs":["Sighting DetailsWas working on the roof at the Toyota plant in Princeton Indiana yesterday, when myself and 2 other witnesses (coworkers) noticed a shiny metallic sphere, resembling a silverish Christmas bulb. At first I thought it was a large white bird in the distance because it was flying straight northeast, but with a little bit of a wobble or zigzag pattern. I thought nothing of it for a few seconds,but my eyes happened to look back into the sky again and I noticed the object was closer in distance to wear I was standing and appeared to be spherical and of a shiny metallic material similar to the appearance of chrome, and also like the sphere was rolling around like a bowling ball as it traveled. It also didn't leave a jet vapor trail, like other planes in the area throughout the day were leaving which struck me odd. As soon as I seen this one of my coworkers spoke up and said, \"I'm not the only one seeing the UFO in the sky\" while noticing me gaze at the object. We both stopped what we were doing and so did another coworker, and watched the object continue to travel in the same direction with the same wobble, still rolling, until it flew into a cloud, which it should have only been inside of for a few seconds at the speed the object was traveling, but never reappeared. I have absolutely no idea what speed the object was going, what altitude the object was at, or how far away the object was. All i know is that all 3 of us seen it travel then disappear, and none of us have an explanation of what it is, but we know it was not a jet. I figured i'd post this to see if anybody else in the area might have seen this object."],"Country":"United States","Log Number":"US-09092012-0020","Summary":"watched a spherelike object dissapear into clouds","Object Features":"Unknown","Region":"Indiana","Longitude":"-87.564102","trends":["There have been 2 other sightings in Princeton","There were no other sightings in Princeton on or around September 8th 2012"],"City":"Princeton","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.357504,+-87.564102(42418)&iwloc=A&hl=en\"> mufon case (42418) map </A>","Date of the Event":"09/08/2012 04:30 UTC","Tags":"City","Date Submitted":"09/09/2012 09:31 UTC"}