{"Latitude":"41.862047","map":"<A HREF = \"http://maps.google.com/maps?q=41.862047,+-71.408225(42426)&iwloc=A&hl=en\"> mufon case (42426) map </A>","Object Shape":"Sphere","City":"Pawtucket","Longitude":"-71.408225","Weather Factors":"Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Country":"United States","Date Submitted":"09/09/2012 11:45 UTC","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Region":"Rhode Island","Tags":"City","Summary":"TWO SILVER ORBS THAT AT FIRST APPEARED TO BE MYLAR BALLOONS FLYING IN STRAIGHT LINE AT MODERATE SPEED","Date of the Event":"09/09/2012 05:10 UTC","divs":["sighting details sunday,9\\9\\2012 pawtucket, r.i. near intersection of smithfield ave. and minerial spring ave. at 5:10 pm i was preparing to cook dinner on the grill with my girlfriends father sitting nearby when i heard him say \" what the heck is that \". i turned and looked at him and noticed he was looking up into the sky. i looked to the sky where he was pointing and saw what we both thought were possibly two shiny mylar balloons that someone had let go. they were very high in the daytime sky, one following a short distance behind the other. the objects appeared round in shape and were traveling at a slow to moderate speed. the day was sunny and very few clouds, no clouds at all in the area of these objects as they traveled from a nnw to a sse direction. as i watched i noticed the second trailing orb started gaining on the first orb and actually passed it for a few seconds until the first orb regained it`s lead. it was at this point that i happened to notice that what clouds were visible , were moving in the opposite direction. as i continued to watch , the second orb rose in altitude at a slight angle and only a short distance from the first orb....they appeared to have both become motionless and the first orb began flashing with three white flashes and a two second pause ....then three more flashes. it did this several times until i lost sight of both objects. we finished cooking and went in the house for dinner,we both returned outside at approx. 6:30pm to clean the grill and relax for a few when suddenly my girlfriends father said \" hey, look, there`s another one \". i couldn`t believe it, the object looked exactly like the first two , but was moving along in the same line of flight at double the speed of the first two. it never stopped or flashed . it was almost as if it was attempting to catch up with the others. it traveled in a straight line heading ssw until it disappeared. this is the first time i have ever seen anything that unusual in a clear daytime sky."],"Log Number":"US-09092012-0028","files":["/var/www/straped/mufon/html2text/42426.html.txt","/var/www/straped/mufon/org/42426.html"],"Case Number":"42426","trends":["There have been 5 other sightings in Pawtucket","There were no other sightings in Pawtucket on or around September 9th 2012"],"Source":"MUFON"}