{"divs":["Sighting DetailsI was at a garage sale with my husband and sister around noon, totally daylight, no clouds, sunny. They were both sitting and looking at some things in boxes, while I was standing facing south behind them, because I wasn't interested in buying anything. As I was standing there, something caught my eye in the sky, a round thing, and I looked towards it in the sky to the left, noticed it was a round object, moving towards us across the sky from east to west at about 75 degrees or higher. At first I thought maybe it was something small blowing through the air, but then I saw what looked like light inside it and it was totally perfectly round, not oval, not anything but perfectly round. I was thinking it might be metal, but then I couldn't imagine how it could be sort of lit from inside. Or maybe it was reflecting light, but then looking more, it looked like it was outlined and a light was inside. It stayed on a steady horizontal course. I mentioned it and asked others to look at it, said that it must be a ufo, because it looked really weird, round, without any other shapes, but no one seemed too interested. I thought it must be a ufo because it was moving like it was being flown, steady line to the west, yet it was a totally circular in shape and seemed like it was lit from the inside. My sister and one of the garage sale ladies looked at it briefly, but they just looked down right away again. So strange! It was small, like an eraser or so when I first saw it, and as it came nearer, became like the size of an aspirin; it looked like about the size of a plane in the air when you see one fly over and hear its quiet sound. I just couldn't believe it and kept trying to get everyone to look at it. When it was almost overhead, I thought of my camera, but by then, it was leaving the clearing, and it disappeared overhead behind a tree. I ran back and tried to see it, but there were houses and trees blocking the view of the sky. In all, I think I watched it for at least 3, maybe up to 5 minutes. It seemed like a long time, but I was just kind of mesmerized, and didn't even think of getting a photo. Everyone had acted so weird, not even wanting to look, so I felt pretty uncomfortable. Today I couldn't quit thinking about it, and I wondered if anyone else saw it around the same time."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.572758,+-107.536444(42421)&iwloc=A&hl=en\"> mufon case (42421) map </A>","Case Number":"42421","Region":"Colorado","files":["/var/www/straped/mufon/html2text/42421.html.txt","/var/www/straped/mufon/org/42421.html"],"Date Submitted":"09/09/2012 10:54 UTC","Object Features":"None","Summary":"Noticed a round very bright object, looked solid but light from inside? watched it go slowly across sky towards me without sound, almost overhead and lost sight of it behind tree and houses","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Weather Factors":"Unknown","Country":"United States","Date of the Event":"09/08/2012 12:30 UTC","Longitude":"-107.536444","Source":"MUFON","Tags":"City","Log Number":"US-09092012-0023","Latitude":"39.572758","City":"New Castle","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, Unknown","Object Shape":"Circle, Sphere","trends":["There have been no other sightings in New Castle","This sighting has never been favorited."]}