{"trends":["There have been 20 other sightings in Bend","There were no other sightings in Bend on or around September 9th 2012"],"Log Number":"US-09092012-0027","Object Flight Path":"Hovering then path","Longitude":"-121.300682","map":"<A HREF = \"http://maps.google.com/maps?q=44.042508,+-121.300682(42425)&iwloc=A&hl=en\"> mufon case (42425) map </A>","Latitude":"44.042508","divs":["Sighting DetailsI was out with my dog, and he was acting really anxious. He wanted to leave the grass we were laying on, and I thought he was sick because he never wants to go home. We walked several of the four blocks when a large group of neighbors were looking in the air. They asked if I had been watching the ufos. I looked up and noticed a group of three lights, very bright white. They rotated around each other like points of a triangle. They sometimes got brighter or went out, but not for long. Another, like mother craft would drop down from the center of the group. It was brighter and larger, and a bright downward stream of light would shine down. This went on for about 20 minutes as they slowly moved from almost overhead toward the south. It was around dusk, and the clouds and sky were very mysterious. Odd light, odd cloud formations, etc. Two people tried to take digital images, but they were too wide angle and shaky to get anything useful. I was going to go home and get my pro equipment, but knew it wouldnt be more than points of light."],"Region":"Oregon","Object Shape":"Diamond, Triangle","Weather Factors":"Unknown","Summary":"triangle of bright lights, rotating, dropping a fourth larger ship, light shining down from objects occasionally","Case Number":"42425","Country":"United States","Disposition":"Unresolved","City":"Bend","Date of the Event":"09/09/2012 08:00 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/42425.html.txt","/var/www/straped/mufon/org/42425.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"00:30:00","Source":"MUFON","Date Submitted":"09/09/2012 11:41 UTC","Tags":"City"}