{"files":["/var/www/straped/mufon/html2text/42430.html.txt","/var/www/straped/mufon/more/42430_submitter_file1__IMAG3103.jpg","/var/www/straped/mufon/org/42430.html"],"Object Features":"Unknown","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around September 9th 2012","This sighting has never been favorited.",""],"Log Number":"US-09102012-0003","Case Number":"42430","Date of the Event":"09/09/2012 07:30 UTC","Latitude":"39.296535","Summary":"10 dark, nebulous objects cross Downtown Baltimore, North to South","Object Flight Path":"Path with directional change,Other","Region":"Maryland","City":"Baltimore","Disposition":"Unresolved","divs":["sighting detailsat 7:30pm, i was standing on the roof of a parking garage in west baltimore, with the intent on photographing a beautiful sunset. turning back toward the northeast, i noticed what appeared to be 10 nebulous black objects floating very slowly, north of downtown. i closely watched the objects, which made their way across downtown at an altitude of ~500-1000ft. they were at various altitudes, probably no further than 40ft apart in elevation, whilst ascending. as they made their way to south baltimore, an 11th object came, very slowly, from the direction the 10 objects originated (north baltimore \\ druid hill \\ jhu area, based on what i could tell). this 11th object moved slowly but appeared to have a slightly different shape than the others; it was less nebulous and looked more like a small but silent helicopter. by the time the 10 other objects had passed south baltimore, all but one object was visible, and the 11th helicopter-like object gave slow chase. this all occurred in the period of about 5 minutes. i took one picture of the 10 or so objects as they appeared in north baltimore (digital zoom, hence the crappy resolution). at first glance, they look like balloons, but as i tracked them across the sky, they definitely seemed to follow a non-intersecting flight path. i also made a report to the baltimore sun, so hopefully others saw this as well."],"Longitude":"-76.602289","Source":"MUFON","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.296535,+-76.602289(42430)&iwloc=A&hl=en\"> mufon case (42430) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date Submitted":"09/10/2012 01:40 UTC","Object Shape":"Other"}