{"Date Submitted":"09/10/2012 10:05 UTC","Longitude":"-106.630787","Disposition":"Unresolved","Summary":"Saw a star like object for the fourth time outside my house, this time it looked like it was going to collide with the police plane.","Case Number":"42438","Object Flight Path":"Hovering then path","Region":"Saskatchewan","City":"Saskatoon","Country":"Canada","Object Features":"None","Tags":"City","trends":["There have been 16 other sightings in Saskatoon","There were no other sightings in Saskatoon on or around August 16th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=52.117291,+-106.630787(42438)&iwloc=A&hl=en\"> mufon case (42438) map </A>","divs":["Sighting DetailsThis is the fourth time I have witnessed the same object flying above Saskatoon and this time there was also a few blinkers. Thursday, August 16. My room mate and I were sitting out side trying to catch a glimpse of the meteor shower, It was about 11 when we were not paying attention to the sky, we were having a discussion when suddenly about 70 degrees in the sky a blinking light caught my eye it only blinked a few times, the blinks were spaced far apart and did not have any rhythm, they also looked like they were out of the atmosphere like at satellite height. After informing my room mate which was also a fail to convince him that I saw something weird we went back to our conversation then about 4-5 minutes later a bright star like object appeared in the same area as the blinking light but unlike the blinking light it was definitely in our atmosphere and brighter then the other 3 that I saw back in June. It slowly hovered towards the north east. We had got up to follow it in the yard, standing underneath it watching it, My room mate had suspected it was making a noise but no it was the Saskatoon police patrol plane which came flying out into our view from behind a tall spruce tree that we have in our backyard. The star like object and the police plane were on a collision course but it did not happen the object just flew by like on a curve as if to cut off the plane. The plane went south east and the object remained going north east. Watched the object until it disappeared by that time the police plane was already far away. Room mate lost interest after that and went inside I remained outside but this time leaned up to my vehicle facing the direction that the object flew in and sure enough minutes later I saw a few more blinks at satellite height. Kept watch for about 10 minutes but saw nothing else."],"Weather Factors":"Unknown","Log Number":"CA-09102012-0011","Date of the Event":"08/16/2012 12:00 UTC","Object Shape":"Circle, Oval","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Latitude":"52.117291","files":["/var/www/straped/mufon/html2text/42438.html.txt","/var/www/straped/mufon/org/42438.html"],"Sighting Duration":"Undisclosed"}