{"Sighting Duration":"00:00:02","Log Number":"US-09102012-0008","Weather Factors":"Unknown","Tags":"City","Case Number":"42435","Object Features":"Unknown","Viewing Distance":"Over One Mile","Summary":"Extreme Speed Supersonic Craft with 2 unwavering lights traveling due westward towards Texasabove 100,000 ft. elevation","Object Flight Path":"Straight-line path","Country":"United States","Object Shape":"Unknown","Source":"MUFON","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around September 8th 2012"],"Date of the Event":"09/08/2012 01:12 UTC","Date Submitted":"09/10/2012 07:15 UTC","Longitude":"-81.713681","Region":"Florida","divs":["sighting detailswas sitting in car when noticed high altitude object moving at extreme rate of speed due westward. object had 2 unwavering blue\\green lights and was able to traverse entire 90* viewing angle in less than 1 full second. objects most noteable feature was that it did not maintain linear motion. object was neither observed accelerating, nor decelerating. object appeared to travel through non-conventional means of displacement, perhaps gravitational lensing or area displacement. object visually looked as a fishing lure might appear to a fish if it were sudenly jerked in rapid succession, making it appear as though it was rapidly accelerating and decelerating instantaneously due to friction caused by water density. object did no appear to be powered by conventional propulsion means, even that of experimental pulsejet classification as such means would still appear to maintain linear motion and acceleration. object could possibly be of experimental military classification, but unsure exactly why lights were visible on craft. further investigation required for possible radar logs and sightings over southwestern us and northern mexico for the same time frame suggested."],"City":"Fort Myers","Disposition":"Unresolved","Latitude":"26.657083","files":["/var/www/straped/mufon/html2text/42435.html.txt","/var/www/straped/mufon/org/42435.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.657083,+-81.713681(42435)&iwloc=A&hl=en\"> mufon case (42435) map </A>"}