{"Source":"MUFON","City":"Bloomington","files":["/var/www/straped/mufon/html2text/42449.html.txt","/var/www/straped/mufon/org/42449.html"],"Tags":"City","Disposition":"Unresolved","Region":"Minnesota","Object Features":"Dome","Viewing Distance":"Unknown","Summary":"Update This ad with photo","trends":["There have been 9 other sightings in Bloomington","There were no other sightings in Bloomington on or around September 13th 2011"],"divs":["Sighting DetailsToday at 12:30pm on 9-13-11 I was sitting at the France Ave S. stoplight, about to turn left on Old Shakopee Rd, in my work truck in Bloomington. It was overcast skys, then I see something. I saw a black dot \" . \" <---that big, in the center of one of the clouds. All of a sudden, it starts moving counter clockwise out of the cloud fairly quick. It went around at least four times, then it vanished, But as soon as it was gone, another appeared just below and off to the left. It did the same thing, went around counter clockwise four times, then it also vanished. The first one poped up again in the same spot as before, It stopped moving, then out of nowhere, it turned sideways, changed color to a silver and it was BIG man! It had to be the size of 6 commercial jets, at least! Looked like the sides were almost at a 85% upward angle, had the dish look to it, then moved back and became a tiny dot again. After seeing this in the matter of 13 seconds, the hair on my arms were standing straight up. As I had to turn on the green light, I saw a third one flying tward the other two, but then lost them all due to trees. But wait there is more! I got pissed, I could not see more what was going on, had to do 2 more stops, in my mind I was thinking.. \"Was that what I think it was??\" I got on the highway, I got real close to Minneapolis. 65 Mph Down 35W, I could not believe it but there it was again! Straight in front of me! Now all I see in front of me is the city, and that black dot, but its getting bigger! I step on the gas to try and get closer, but no luck. Now I see it fly Straight over the city! Just then I thought \" That is not a plane\" All airplanes here in the city Cannot, and will not fly over the city center."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.830064,+-93.347615(42449)&iwloc=A&hl=en\"> mufon case (42449) map </A>","Longitude":"-93.347615","Object Flight Path":"Stationary,Hovering then path,Other","Object Shape":"Cigar, Disc, Sphere","Date of the Event":"09/13/2011 12:01 UTC","Weather Factors":"Unknown","Latitude":"44.830064","Date Submitted":"09/10/2012 05:19 UTC","Country":"United States","Case Number":"42449","Sighting Duration":"00:00:00","Log Number":"US-09102012-0021"}