{"Tags":"City","City":"Wokingham","Country":"United Kingdom","Date Submitted":"09/10/2012 11:18 UTC","Source":"MUFON","Summary":"This object was a narrow metallic u-shape that was highly reflective and was spinning as it elevated","Date of the Event":"09/03/2012 04:29 UTC","Latitude":"51.410457","map":"<A HREF = \"http://maps.google.com/maps?q=51.410457,+-0.833861(42441)&iwloc=A&hl=en\"> mufon case (42441) map </A>","Log Number":"GB-09102012-0014","divs":["Sighting Details I was on the mobile during a tea break outside the office building when I noticed an object moving quickly towards an electricity pylon. It was a very sunny clear day, light breeze etc. Object was u-shaped like one of those old fashioned magnets. I initially thought it was a silver helium filled balloon that had broken free from some display. The object was rotating clockwise than anti-clockwise and was pencil grey with an very reflective surface when it faced the sun. I would say that it was small and possibly no more than 10-15 feet above the pylon. It then began to climb whilst continuing to rorate and catch the sun and I must have watched this for 5 minutes. The oddest thing about the sighting was that once it reached a certain height - two other shiny objects appeared close to it and my initial thought was that these could be stars but two of the light sources moved closer together then pulled apart until to create a triangle. I watch for another 5 minutes or so - one light source vanished, one remained stationary whilst the third moved off slowly in a totally different direction(!) I was absolutely astonished by what I witnessed and have no idea what these objects were. Had I not seen the other reflective objects than I would have discounted the intital object as a very odd novelty balloon."],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Object Features":"None","files":["/var/www/straped/mufon/html2text/42441.html.txt","/var/www/straped/mufon/org/42441.html"],"trends":["There have been no other sightings in Wokingham","This sighting has never been favorited."],"Region":"England","Object Shape":"Other","Longitude":"-0.833861","Case Number":"42441","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Disposition":"Unresolved"}