{"Object Shape":"Triangle","Country":"United States","Disposition":"Unresolved","Latitude":"34.530414","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Date Submitted":"09/10/2012 03:54 UTC","files":["/var/www/straped/mufon/html2text/42445.html.txt","/var/www/straped/mufon/org/42445.html"],"Date of the Event":"07/03/2012 10:00 UTC","Longitude":"-117.231334","Region":"California","Log Number":"US-09102012-0018","Source":"MUFON","City":"Apple Valley","trends":["There have been 8 other sightings in Apple Valley","There were no other sightings in Apple Valley on or around July 3rd 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.530414,+-117.231334(42445)&iwloc=A&hl=en\"> mufon case (42445) map </A>","divs":["Sighting DetailsAs I was coming home and driving up my driveway on Tuesday evening, July 3, 2012, I noticed 3 very bright white lights coming straight in my direction. The object was so large and lights so bright, I was startled. I stopped the car midway my driveway and got out of the car to view. It had a triangle shape, and was in a low elevation, about 800 ft heading right towards me. It was like nothing I have ever seen. It passed directly over my head and I could not see any body or structure to it, just lights. There was absolutely no sound coming, but as it passed overhead I heard a light hum. It was traveling in a straight path, approaching from the northwest towards the southeast. I live up on a hill about 3200ft elevation and have a clear view of our town lights. I observe many flying crafts from helicopters, private and commercial aircraft. I also have flown small airplanes so I am familiar with altitudes and craft lights. This flying UFO was just that. Unidentified flying object. The following week I was reading our local paper and they were reporting UFO sighting in our town. There was also some photo's, one was exact the same lights I saw, that someone else had captured."],"Summary":"3 bright lights in triangle shape. Silent approach with a light humming after it passed. Low elevation.","Weather Factors":"Unknown","Case Number":"42445"}