{"trends":["There have been 9 other sightings in Richland","There was one other sighting in Richland on or around August 7th 2012"],"Sighting Duration":"Undisclosed","Case Number":"42446","Region":"Washington","Disposition":"Unresolved","City":"Richland","Date of the Event":"08/07/2012 03:00 UTC","Object Features":"None","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.249295,+-119.285686(42446)&iwloc=A&hl=en\"> mufon case (42446) map </A>","Weather Factors":"Unknown","Tags":"City","Country":"United States","Object Shape":"Sphere","Date Submitted":"09/10/2012 04:34 UTC","Summary":"UFO Sighting! August 7 2012, Spokane Washington","divs":["Sighting DetailsHello my name is James i am from Canada Alberta this summer in august i went to Spokane Washington for about a week to see my Grandma and grandpa they live in Ford Washington near long lake. anyways after Driving all day for about 7 hours we finally made it to there house in Spokane. Anyways when we got there it was about 11 pm and settled down and we all went to sleep. i kinda had a hard time to sleep the first night i would wake up every hour it was very annoying. I woke up at 3 am and turned to my side facing the window looking over the Vally and my eyes caught this bright light and i though it was my mid playing tricks on me so i try ed to close my eyes and fall back asleep. but i could not so i turn my head back at the bright light and i looked at the sky and there was stars out but they were not bright this thing was like BRIGHT! Bright! and the strange thing is that when i looked at it the thing would come up to the window very fast and watch me it was like it knew i was up and when i turned away for a second it would go far away very very very fast light a speed of light ! and when i turned back to it it would come all the way back to the window FAST! and watch me. i got scared so i got up and got my cousin that was the couch sleeping i shook her and said very sacredly and said \" Come in the bed room and Look at this !!!\" she knew i saw something that scared the shit out of me so she went to check it out. so she layed beside me on the bed and we were both looking out the window and she saw it to and it was moving sideways fast and doing weird stuff and there was NO SOUND COMING FROM THIS THING!! it was very silent!! but it would stay watching us and again when we turned away it would go all the way back and come back to us really fast and watch us ! after what me and her saw we could not sleep we watched it till 3am to 6am we talked for a bit still watching it doing crazy stuff and before the sun came up it slowly started to go up into the sky before the sun was up . but when the sun was up it was GONE out of thing air! after when everyone was up we told my aunty and my grandma and grandpa and my grandma saw this thing to awhile back. so the next night it came back slighting doing the same thing ! and this time my aunty saw it to she got freaked out like we did on the first night . i just wanted to tell u guys and no i am not crazy i know what i saw!! i can try to find a pic of what it looked liked"],"Latitude":"46.249295","Viewing Distance":"20 Feet or Less","Longitude":"-119.285686","Log Number":"US-09102012-0019","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42446.html.txt","/var/www/straped/mufon/org/42446.html"]}