{"Sighting Duration":"00:02:00","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in La Plata","There were no other sightings in La Plata on or around December 15th 1967"],"Case Number":"42458","divs":["Sighting DetailsI was sitting in my bedroom. It was an unusually warm December night. My bedroom light was on, and I happened to look out the window into our backyard. This round object was hovering just above the trees near the end of our property line, about an acre away. The object was perfectly round, had clearly defined edges, was very bright, crystal clear, no fuzzy edges, and it had different bands of colors rotating in a counter clockwise direction. There was no engine noise whatsoever. The colors were very bright and shiny and clear. It was a warm cloudy night with no moon or stars, a very slight warm breeze. I ran through my house to the back door, but when I got outside, it was gone. We lived very close to the armory building in La Plata, Maryland. I was both surprised and excited about what I saw, but I only talk about it to other people who are open to the reality of the existence of UFO's. This sighting occurred in Mid December of 1967. In my opinion, the technology of this craft was far beyond anything that I was aware of our government or any other government of having. I was in my senior year of high school at the time."],"Country":"United States","City":"La Plata","map":"<A HREF = \"http://maps.google.com/maps?q=38.529288,+-76.975251(42458)&iwloc=A&hl=en\"> mufon case (42458) map </A>","Summary":"Different bands of colors rotating on a round object,. very bright","Disposition":"Unresolved","Longitude":"-76.975251","Tags":"City","Latitude":"38.529288","Object Shape":"Oval","Source":"MUFON","Date Submitted":"09/10/2012 11:05 UTC","files":["/var/www/straped/mufon/html2text/42458.html.txt","/var/www/straped/mufon/org/42458.html"],"Object Features":"None","Weather Factors":"Unknown","Log Number":"US-09102012-0030","Object Flight Path":"Stationary","Region":"Maryland","Date of the Event":"12/15/1967 08:15 UTC"}