{"Summary":"A dim gold/brown object moving quite quickly from west to east.","trends":["There have been 13 other sightings in Marathon","There were no other sightings in Marathon on or around September 10th 2012"],"Object Shape":"Egg, Oval","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Date of the Event":"09/10/2012 09:35 UTC","Region":"Florida","Longitude":"-81.065477","Sighting Duration":"00:00:07","map":"<A HREF = \"http://maps.google.com/maps?q=24.718851,+-81.065477(42459)&iwloc=A&hl=en\"> mufon case (42459) map </A>","Log Number":"US-09102012-0031","Object Features":"Unknown","City":"Marathon","files":["/var/www/straped/mufon/html2text/42459.html.txt","/var/www/straped/mufon/org/42459.html"],"Tags":"City","Date Submitted":"09/10/2012 11:06 UTC","Case Number":"42459","Latitude":"24.718851","Country":"United States","Disposition":"Unresolved","divs":["sighting details i must preface by saying that since i reported observing a couple of strange lights back in april, i have been spending a great deal of time looking up at the night sky ever since. after tonight i will admit that i am a certifiable nut-job, or i saw one of the most incredible things i've ever seen. i was out back on the porch staring up at he sky, and strumming on my guitar. i just happen to look over my righ shoulder and witnessed a dull gold\\brown traversing the sky. i watched this object move from 2 o'clock, to 9 o'clock in roughly 6 or 7 seconds. this thing was rather high in altitude, as it appeared to pass above the clouds before coming back into view then fading out of view. i have never seen an object move this fast in my life. i suppose it could have been some sort of aircraft i've never seen before, but travelling at that speed, i feel i should have seen a trail, heard some noise, or something. anyway, that about sums it up. i wish i had a better explaination for what i saw, or possibly a video, but i just wasn't prepared. that won't happen again."]}