{"Viewing Distance":"101-500 Feet","Latitude":"35.695104","trends":["There have been 8 other sightings in Garner","There were no other sightings in Garner on or around September 10th 2012"],"Sighting Duration":"Undisclosed","Date of the Event":"09/10/2012 09:30 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42457.html.txt","/var/www/straped/mufon/org/42457.html"],"Country":"United States","Object Shape":"Triangle","Object Flight Path":"Hovering then path","Summary":"Amazing","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.695104,+-78.616622(42457)&iwloc=A&hl=en\"> mufon case (42457) map </A>","Source":"MUFON","Log Number":"US-09102012-0029","City":"Garner","Longitude":"-78.616622","divs":["Sighting DetailsI was driving a friend home around 9:30 PM on Monday, September 10th 2012. As we drove North on Timber drive; We both simultaneously noticed a blue streak of light zoom across the sky. Being that we both enjoyed astral phenomena, we were both amazed at the sighting. We continued down timber, discussing what we had just seen. As we turned right onto the road in which his neighborhood splits off from; We noticed an extremely bright object hovering in the sky above what I believe to be Aversboro Coffee & Gifts. Shocked by this sighting, we immediately pulled over in an attempt to catch a better view of the object. It was an ENORMOUS triangle-shaped craft with two illuminating lights on it's wings. It's wingspan had to be at least 100 Yards or more. As we stared, it began to fly over us. It had a sort of humming noise as it flew above. The exterior of the vehicle seemed to be a very dark coloring, while the lighting was yellow-orange. When I first noticed the object, I had no idea what to think of it; My immediate thoughts were a possible astral event that I was unaware of. Upon pulling over & seeing the object from an ant's view; I know now that this was not the case what so ever. As coincidental as it may seem, we DID indeed attempt to record a video of the object or at least grab a photo However, being that I have an ill-prepared iPhone with a cracked screen; It was impossible for me to gain access to the camera."],"Object Features":"Other","Region":"North Carolina","Case Number":"42457","Date Submitted":"09/10/2012 10:33 UTC"}