{"map":"<A HREF = \"http://maps.google.com/maps?q=18.24459,+-66.954273(42466)&iwloc=A&hl=en\"> mufon case (42466) map </A>","Latitude":"18.24459","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Date Submitted":"09/10/2012 11:44 UTC","City":"Las MarÃƒÂ­as","files":["/var/www/straped/mufon/html2text/42466.html.txt","/var/www/straped/mufon/org/42466.html"],"Case Number":"42466","Source":"MUFON","divs":["Sighting DetailsRiding 4tracks at night in a secluded, mountanous and unpopulated coffe plantation not worked in over 50 years in a trail @1,000 feet from the sea level. One of the 4tracks would heat up and shut off, starting again when it cooled off some. We stopped at a strech in the trail (for local 4x4 Jeeps, no vehicles could traverse)To one side is the mountain side, road is wide enougth to fit a Jeep plus some spare space (@6-7feet wide and to the other side a hedge and a 400 feet drop to a river. Tall trees and a lot of vegetation. THe two 4tracks are in line, one behind the other, three people on the right side and me on the left. All of a sudden I start hearing the very subtle sound of leaves barely moving, as in extrimely soft and subttle. I think maybe a snake might be moving by the hedge, or a rat, mice maybe and all the hairs on my neck creep up and I moved to the other side of the 4tracks. I hear again the leaves and I tell my other 3 companions, \"Hey! Do you lissen to the leaves?\" Everyone looked down to the edge of the hedge and whatever was standing there sudenly got agitated, like trying to move faster but silently while making a little more sound (ruffling leaves but still very subttle). So everyone leaned over trying to see what was it. The entity sudenly moved extrimely rapidly about 5 feet paralel to the hedge and we froze. The speed at which the entity moved was perplexing. The only thing percieved was the sound of the leaves being ruffled as it moved. When it stopped, a single strong and considerable flap was heard which pushed the leaves quite forcefully, not like a leaf blower but like a geese. One loud forcefull flap and a shadow was seen fly up towards a branch of a tree about 30 feet up. When it landed, the branch bended down and up. Thick branch bended about 2 feet. It looked like something heavy landed and bend the branch down and back up with heft. At that time everyone automatically jumped on the 4tracks, started and hauled up the trail until we arrived at the hacienda. We never have talked about it among us. The look on our faces was enougth to agree not to speak about it out of fear of being ridiculed. In the group we where 2 couples all in our 20s, three mechanical engineers and one lawyer. I can say I never got a look at the thing, only a shadow streak up from the ground, obviously landing on the tree branch. I'm also a hunter and a fly fisherman."],"Tags":"City","trends":["There have been no other sightings in Las Marías","This sighting has been favorited 2 times."],"Object Features":"None","Object Shape":"Other","Log Number":"PR-09102012-0038","Object Flight Path":"Other","Longitude":"-66.954273","Region":"Las MarÃƒÂ­as","Disposition":"Unresolved","Date of the Event":"01/07/1994 12:00 UTC","Weather Factors":"Unknown","Country":"Puerto Rico","Summary":"Not object, entity. Dark black 4 to 5 feet tall, with wings."}