{"Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","City":"Cincinnati","map":"<A HREF = \"http://maps.google.com/maps?q=39.105898,+-84.50264(42479)&iwloc=A&hl=en\"> mufon case (42479) map </A>","Sighting Duration":"Undisclosed","Latitude":"39.105898","Log Number":"US-09112012-0013","Source":"MUFON","divs":["Sighting DetailsI was outside my trailer, just watching the stars, thinking about how bad I was failing my Cultual Anthropology class, when I noticed a star that seemed much brighter and larger than any of the others. At first, I thought it was a meteroite or satellite or something, but it eventually stopped getting larger and instead changed direction and seemed to glow even brighter. It stopped moving and hovered for about 4 minutes before making a slow descent towards the ground. I was pretty far away so I couldn't see if it actually landed, but I could feel a great gust of almost uncomfortably warm air coming from the object's direction. It was so low that it was out of sight for a few minutes before it shot up into the sky like a bullett, bringing with it another gust of abnormally hot air. I actually felt as though I got wind burn. It moved so fast after that, that I could barely trace its movements before I lost it for good among the stars. Never seen anything like it in the Blue Ash area, it almost looked like it was near the college I go to."],"trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around September 1st 2012"],"Object Shape":"Bullet, Missile, Cylinder, Flash, Star-like","Country":"United States","Date Submitted":"09/11/2012 02:47 UTC","Region":"Ohio","Object Flight Path":"Path then hovering","Summary":"cylindrical shaped object shot across sky then descended, and ascended again","Date of the Event":"09/01/2012 09:12 UTC","Longitude":"-84.50264","Case Number":"42479","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42479.html.txt","/var/www/straped/mufon/org/42479.html"],"Tags":"City"}