{"Object Features":"Other","Source":"MUFON","Latitude":"43.387225","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/42477.html.txt","/var/www/straped/mufon/org/42477.html"],"Log Number":"US-09112012-0010","Viewing Distance":"Over One Mile","Date of the Event":"09/11/2012 02:30 UTC","Region":"Wisconsin","Summary":"Pulsing Sphers of light moving erratically in the eastern sky above Lake Michigan Wisconsin","Case Number":"42477","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsI had stepped outside for a smoke around 2:30am and noticed what I thought as a meteor shower in the east sky over the lake. After observing the sky I realized there were 3to 4 orbs of pulsing lights that were changing colors. It looked like the different spheres were chasing each other around. One would disappear then another would show back up out of nowhere. The lights seemed to pulse in both intensity and color. I could tell they were pretty far out in distance perhaps over lake Michigan. They would pulse between a yellow, blue, and red. I watched for about 10 minutes then scrambled to find a video camera and ended up using my iPhone. When I got back outside there were only two left and one was hardly visible at times. I have a few decent short video clips of the one moving through the sky and pulsing colors. I could tell it was very bright even though it was pretty far off in the distance . On the video it doesn't look very bright but it's the only thing that was big and bright enough for the cheesy camcorder to get. This light contined to pulse and flicker for about an hour total before fading away. I will post video latter this morning"],"Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.387225,+-87.875644(42477)&iwloc=A&hl=en\"> mufon case (42477) map </A>","Longitude":"-87.875644","Date Submitted":"09/11/2012 07:45 UTC","Object Shape":"Fireball, Sphere","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Port Washington","There were no other sightings in Port Washington on or around September 11th 2012"],"City":"Port Washington"}