{"map":"<A HREF = \"http://maps.google.com/maps?q=41.10002,+-74.137551(42496)&iwloc=A&hl=en\"> mufon case (42496) map </A>","Object Flight Path":"Hovering then path,Path with directional change","City":"Mahwah","Case Number":"42496","Object Features":"Unknown","Date of the Event":"09/10/2012 08:30 UTC","Latitude":"41.10002","divs":["Sighting DetailsOn September 10, 2012, at around 8:25 p.m., my 22-year-old daughter and her 24-year-old boyfriend returned from a local CVS. The store is located less than one mile from my home. Her boyfriend stated, \"Mr. X, I think we just saw a UFO.\" I asked them what they saw and they described a large \"orange glowing fireball\" moving across the sky. My daughter said the light \"fizzled out\" after a while, but then it reappeared a second time. About five minutes into our conversation, at approximately 8:30 p.m., her boyfriend looked outside and and spotted the object again in the northwest sky. I told them to turn off all the interior lights and the television to eliminate as much light pollution as possible. We all had our smartphones in hand and I set mine to video mode. We moved outdoors on my balcony which has a west-facing view. My complex is set on a mountain ridge with each building higher in elevation than the next. So as I looked westward, I can clearly see over the top of the next building. The night sky was very clear with low humidity and cool temperatures. I observed a glowing orange \"ball\" of light moving steadily in the sky northwest of my location traveling southward. The light did not blink or pulsate. It was a steady glow. The color did not change, nor did the intensity of the light. The object was moving at a steady rate of speed which I would not characterize as particularly fast or slow. Somewhat like the speed a plane would fly on approach to land. The glowing light appeared to fade and disappear after about a minute or slightly more. It seemed that if the object was turning away from our vantage point, in a westward direction, it might account for the light disappearing. I was unable to see the object on my smartphone but continued to film. Once the object disappeared, I asked my daughter to get her digital camera, which also shoots video, from her upstairs bedroom. She returned quickly with the camera. We discussed the fact that it might be related to heightened security as it was close to 9-11. We took note of several commercial airplanes with their blinking lights in the area and pointed out the obvious difference in appearance to the object we saw. We also spotted two satellites racing across the sky and noted how different they also appeared, merely a speck of white light traveling extremely quickly across the sky at a great distance. Approximately 5 minutes later, the object reappeared in the same spot of origin as the first sighting, northwest of our vantage point, moving southward at a steady, but not overly fast rate of speed. My daughter and I both captured the object on digital video. I thought I was able to hear something from the object, but it turned out it was the local freeway which was clearly audible given the clear weather conditions. After the object disappeared a second time. We waited for a return which did not come. We went on with our evening discussing what we had just seen and watching the premier of NBC's The VOICE. We both downloaded our videos to my home computer and watched the footage. She was able to zoom with her camera, but I was not with my smartphone. We both captured the same incident at the same time on two separate devices as evidenced by the same recorded audio. The object made no detectable sound. If I were to approximate it's relative distance, I would approximate 3 - 4 miles or less at it's point of origin and at an altitude of around 1,500 feet. I would guess it traveled about 3 miles or so before the light disappeared. My girlfriend came in around 9:40 p.m. and we detailed what had just occurred and showed her the videos. I found this website after searching to see if anyone else reported a similar sighting. I did not notice any other distinguishing features other than the color and intensity of the light. I did not notice any similarr objects at the same time. I am assuming the second object was merely the first object making a return pass, but it could have been a separate second object. No way to know for sure. This is the first time I've ever seen anything remotely odd in the night sky."],"Log Number":"US-09112012-0030","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Source":"MUFON","trends":["There have been 3 other sightings in Mahwah","There were no other sightings in Mahwah on or around September 10th 2012"],"Region":"New Jersey","Object Shape":"Circle, Fireball","Disposition":"Unresolved","Country":"United States","Date Submitted":"09/11/2012 11:19 UTC","Summary":"Bright Orange Orb Spotted Above Northern NJ","Sighting Duration":"Undisclosed","Longitude":"-74.137551","files":["/var/www/straped/mufon/html2text/42496.html.txt","/var/www/straped/mufon/org/42496.html"],"Tags":"City"}