{"files":["/var/www/straped/mufon/html2text/42493.html.txt","/var/www/straped/mufon/org/42493.html"],"Date of the Event":"09/10/2012 11:40 UTC","City":"Niagara Falls","Object Features":"Other","divs":["Sighting Detailsabout a 45 minutes after seeing and reporting the first sighting. i notice 2 objects headed toward each other right above us. one large triangle object and a smaller faster object crossed paths right above our heads as i pointed it out to the second witness. we watched both objects continue in opposite directions. we were turning our heads back and forth between the two objects. the smaller object was very fast out of sight( about 4 to 6 seconds in sight to out of sight), while the larger object was slower ( about 45 seconds to a minute from first sight to out of sight). we could see 2 panels of lights flashing in the rear of the object. the panels looked like 2 rectangle booster type things. they flashed in sequence like a warning, not like landing lights. we also noticed that there was no sound at all from any of the sightings. if any of these objects were jets or anything like that we would have heard something given the speed of the objects. there is a airbase close by and we see aircraft all the time. this was unreal."],"Log Number":"US-09112012-0027","map":"<A HREF = \"http://maps.google.com/maps?q=43.105274,+-79.035889(42493)&iwloc=A&hl=en\"> mufon case (42493) map </A>","Object Shape":"Star-like, Triangle","Region":"New York","Latitude":"43.105274","Date Submitted":"09/11/2012 10:31 UTC","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Case Number":"42493","Viewing Distance":"Unknown","Summary":"second sighting, same night, objects going in different directions, different craft.","trends":["There have been 19 other sightings in Niagara Falls","There was one other sighting in Niagara Falls on or around September 10th 2012"],"Country":"United States","Longitude":"-79.035889"}