{"divs":["Sighting DetailsI was standing on my front porch and looked to the North above an apartment building to see 4-5 white lights hovering in a line. My first thought was that there were some airplanes, since there are always planes flying above, but quickly noticed there were too many lights too close together to be airplanes. Also, they were not traveling. The lights spanned out from one side of the building to the other. One of the lights ascended a little above the others to create a trianglular form, which if it were one object, would have been huge. I called inside to my family to quickly come out and see it. When I turned back to the lights I saw 2 lights exstinguish, leaving one still hovering, which my son and fiance observed. This light was blinking, and my fiance thought that it was a plane at first. She also quickly realized that there was no flight pattern, and the object was stationary. My son was pointing to it, voicing the fact that it could not be an airplane, and that it did not look like a star and then that light blinked out as well. None of the lights descended below the building, they just simply went out."],"Date Submitted":"09/11/2012 10:37 UTC","Source":"MUFON","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/42494.html.txt","/var/www/straped/mufon/org/42494.html"],"Date of the Event":"09/11/2012 08:00 UTC","Sighting Duration":"00:01:20","Weather Factors":"Unknown","trends":["There have been no other sightings in Somersworth","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.25074,+-70.872772(42494)&iwloc=A&hl=en\"> mufon case (42494) map </A>","Region":"New Hampshire","Object Flight Path":"Hovering then path","Object Features":"None","City":"Somersworth","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Summary":"4-5 light orbs hovering in a line, one orb ascented to create triangle form, then lights randomly dissapeared","Case Number":"42494","Longitude":"-70.872772","Latitude":"43.25074","Log Number":"US-09112012-0028"}