{"divs":["Sighting DetailsI was riding in my car on Terry Parkway in Terrytown, Louisiana. As i approached the intersection of Terry Parkway and Holmes, I notice a bright white rectangular object in the sky that was almost hovering and not moving very fast. As this was at approximately 10:00 A.M. Central Time, and a time when spectators were enroute to the Louisiana Superdome for the Saints vs Washington game, I first thought that it might be an advertisement banner that was being pulled by an airplane. Thus, I kept looking for an airplane. It was a cloudless day so an airplane should have been spotted. I looked when safe as I was driving to see if I could see an airplane, and I never could but should have been able to see one as it was so clear and bright. THe object was in the distance over New Orleans East or Chalmette, so not anywhere near the dome if it were an advertisement banner. As I crossed the Crescent City COnnection from the Westbank to the Eastbank, I couldn't see it any longer; however, it may have moved further down river and not visible to me without risking an accident. I am not saying it was a UFO; however, I was wondering if you'll had any other reports about this object? It was white, rectangular and divided liked a rubix cubicle. I still believe it could have been an advertisement banner pulled by an airplane; however, there was not writing or any graphic designs other than lines. I really would like to know what it was and I am hoping someone else reported it. It was big as it was in a distance of several miles."],"Country":"United States","Object Features":"Patterned Surface","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/42503.html.txt","/var/www/straped/mufon/org/42503.html"],"Viewing Distance":"Over One Mile","Longitude":"-90.030552","trends":["There have been no other sightings in Terrytown","This sighting has never been favorited."],"Latitude":"29.899263","Source":"MUFON","Summary":"Witnessed a flat rectangular object that was white but did not reflect sunlight.","Weather Factors":"Unknown","Case Number":"42503","Sighting Duration":"00:05:00","Object Shape":"Square, Rectagular","Region":"Louisiana","Tags":"City","Date of the Event":"09/09/2012 10:05 UTC","City":"Terrytown","map":"<A HREF = \"http://maps.google.com/maps?q=29.899263,+-90.030552(42503)&iwloc=A&hl=en\"> mufon case (42503) map </A>","Disposition":"Unresolved","Date Submitted":"09/12/2012 11:55 UTC","Log Number":"US-09122012-0007"}