{"divs":["Sighting Detailsaprox 5;32 a.m., i got up to relieve my bladder, noticed a bright oscillating light going from blue to orange to white in the sky to the e.,it appeared to be in line wih the moons atitude, it lookedlike orion was pointing to it. got the wife up to look,but she was to short to see out the window, so she went back to bed. i then got my robe,slippers, then went outside. weather was c.a.v.u.. the object was in the same area as before. i got my binoculars, took a rest to be steady. sighted the ufo and it appeared to be shaped like a nuclear sub without the conning tower. the light was coming from the center and there looked like three windows to the right and left horizontaly from the light. i heard cars, trucks and animals while watching, an airliner went from the sse going north. the light was very intense, you could see he beam it projected, and i swear, you could almost feel it. it reminded me of a sunbeam. i watched until approx 6 a.m. when the sun blotted it out. i last saw the object to the sse going s. curiosity and surprise was what i felt at first, then dismay when i realized if it was what i thought it was, i had no way of contacting the entity. next"],"Tags":"City","City":"Toledo","Longitude":"-123.945372","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"09/12/2012 05:32 UTC","Object Features":"Window(s)","trends":["There has been one other sighting in Toledo","There were no other sightings in Toledo on or around September 12th 2012"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=44.66586,+-123.945372(42505)&iwloc=A&hl=en\"> mufon case (42505) map </A>","Disposition":"Unresolved","Region":"Oregon","Sighting Duration":"Undisclosed","Latitude":"44.66586","Log Number":"US-09122012-0009","Weather Factors":"Unknown","Summary":"sighted bright light,oscillating,blue,red,white in cener of craft shaped like a nuclear sub w/o con tower","Country":"United States","files":["/var/www/straped/mufon/html2text/42505.html.txt","/var/www/straped/mufon/org/42505.html"],"Date Submitted":"09/12/2012 02:46 UTC","Object Shape":"Other","Case Number":"42505"}