{"Object Shape":"Sphere, Star-like","Log Number":"US-09122012-0019","Object Features":"None","divs":["Sighting DetailsAgain, same as yesterday, about same time, same area, looks like same \"star like\" looking object. Its around 7:30pm, sun barely going down, am getting ready for my walk, I look up facing southern direction and there it is, straight up above. Hard to tell how high. Star like looking object when 'no' stars are yet visible. It was there for about 12 minutes today. Yesterday I observed it for 20 minutes. Then like someone turned off a light bulb but those that turn off very slowely. It just began to dissappear or \"fade\" is the word best describe it. Soon there after a jet of some sort flew where the object had been. Same as yesterday. 15 minutes later a large P-3 landed at the airport. I would estimate 40 minutes later, 2 aircraft, unknown type, flying in formation, very high altitue north to south fly directly where object was. As they move in a southern direction, they seperate, one going southwest the other southeast. At same time another aircraft unknown type flies east to west. I say unknown because it is dark now and only see the strobes. Strangely enough, two (what appear to be satellites) fly from north to south less than 10 minutes apart, then fly from south to north, again less than 10 minutes appart. A total of 7 aircraft were observed flying \"patterns\" before I came into my house at 8:45pm. Something is up in Brownsville, litterally, and the government knows."],"Date Submitted":"09/12/2012 10:08 UTC","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/42515.html.txt","/var/www/straped/mufon/org/42515.html"],"Date of the Event":"09/12/2012 07:35 UTC","Case Number":"42515","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=25.908657,+-97.491174(42515)&iwloc=A&hl=en\"> mufon case (42515) map </A>","Latitude":"25.908657","Country":"United States","Viewing Distance":"Unknown","Summary":"star like object observed hovering, then blinked out like someone turned off the lights.","Source":"MUFON","Longitude":"-97.491174","Sighting Duration":"Undisclosed","trends":["There have been 17 other sightings in Brownsville","There were no other sightings in Brownsville on or around September 12th 2012"],"Weather Factors":"Unknown","City":"Brownsville","Disposition":"Unresolved","Tags":"City"}