{"Date of the Event":"09/12/2012 08:55 UTC","Summary":"9 days of sightings of 50+ crafts with no sound in close proximity to me with witness of head-on collision and shooting of another craft.","trends":["There have been 6 other sightings in Stroudsburg","There were no other sightings in Stroudsburg on or around September 12th 2012"],"Country":"United States","Tags":"City","Disposition":"Unresolved","Log Number":"US-09122012-0016","Case Number":"42512","Longitude":"-75.169962","map":"<A HREF = \"http://maps.google.com/maps?q=41.017142,+-75.169962(42512)&iwloc=A&hl=en\"> mufon case (42512) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Disc, Sphere, Triangle","Object Features":"Window(s)","divs":["Sighting DetailsMy wife and I have witnessed, starting at 8:30 PM since last Tuesday, at least 50+ crafts every night in Stroudsburg, PA from our home. Last night we drove to a nearby clearing to watch them from 500 feet away as they hovered and descended and flew among Worthington State Forest. Weve witnessed one head-on collision of two crafts where they continued on their flight paths but wobbled and one craft actually from 200 feet away shoot a white fireball like object at another craft, which struck it and fizzled out in the sky. Both crafts continued on their flight paths. I have 8-10 videos of these crafts from my backyard and from last night by the State Forest on youtube (under the channel name Camille Eslick), as I provided them for UFO Research Center of PA with Butch Witkowski, whom Ive been in contact with. Butch said that he was going to send a team to take video footage and document with radar on Tuesday sometime this week. We wanted to also provide this report to MUFON, as it would give us satisfaction to have it documented with quality video and were eager to get people out here."],"City":"Stroudsburg","Latitude":"41.017142","files":["/var/www/straped/mufon/html2text/42512.html.txt","/var/www/straped/mufon/org/42512.html"],"Viewing Distance":"101-500 Feet","Region":"Pennsylvania","Source":"MUFON","Date Submitted":"09/12/2012 09:08 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering"}