{"map":"<A HREF = \"http://maps.google.com/maps?q=36.152797,+-115.278384(42518)&iwloc=A&hl=en\"> mufon case (42518) map </A>","Disposition":"Unresolved","Date Submitted":"09/12/2012 11:29 UTC","Summary":"Orb followed by triangular object descending in isolated rain in Las Vegas","Region":"Nevada","divs":["sighting detailsi live in las vegas and smoke cigaretts daily. i woke up in the middle of the night (4am to be exact) and went outside my apt to smoke as i do not smoke inside. on my porch, which is on the 2nd story, i noticed an interesting cloud formation with rain falling near the las vegas strip, which i can see from my apt in western las vegas, (on charleston bl.) i live within 10 miles of the strip. on that night, i photographed the interisting rain & cloud formations as we do not get much rain here. after reviewing the two photos i took, i found not only an orb which moved straight downward (yellow in color) but also noticed an unusual triangle of 3 green lights on the 2nd photograph both seemed to be \"hiding\" in the isolated rain shower. i have photographic proof time stamped 8\\13\\12 @ 4:40 & 4:41am. i am interested in knowing more of this particular sighting, where there any others this same morning? please advise prior to my going public on this event. seems they can hide, but not if you look close enough! mufon must contact me prior to photo release!"],"trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 13th 2012"],"files":["/var/www/straped/mufon/html2text/42518.html.txt","/var/www/straped/mufon/org/42518.html"],"Log Number":"US-09122012-0022","Case Number":"42518","Sighting Duration":"00:02:00","Source":"MUFON","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Tags":"City","Weather Factors":"Unknown","Object Shape":"Sphere, Triangle","Longitude":"-115.278384","Date of the Event":"08/13/2012 04:40 UTC","Object Features":"Unknown","City":"Las Vegas","Latitude":"36.152797"}