{"divs":["Sighting DetailsLast night around nine pm my family and I decided to go for a walk around the neighborhood. The sky was incredibly clear. After admiring the sky for a few moments I saw a very beautiful glowing star. I soon realized that this was no star. It was almost like an opal in the sky. It was glowing much brighter than all of the other stars. It was a mixture of a glowing blue, green, and orange. I pointed it out to everyone and they all stopped walking. We were all fixated at this point. After walking further down the street we all noticed another one. There was also another craft. It was moving rather than just glowing and remaining stationary. This craft was moving in between the others one. It didn't move very fast. But it had three lights or three sections of lights. One would go, then the next, and so on. My niece said she was scared and wanted to continue home. Upon reaching our street we noticed many more of these glowing orb like crafts. They were all glowing bright and were all stationary. My niece Kayla and my sister's boyfriend then said one moved very fast, glowed very bright, and then went very dim. This was totally bizarre. We were all in awe. We walked inside while some remained to stick around. I have never seen anything like this in my life. There were five of us including myself, my husband my sister, my niece and my sister's boyfriend. I went online to see if anything like this had been reported and was shocked to see all the activity within the past several days. It was the most beautiful sky I have ever seen.."],"Weather Factors":"Unknown","Longitude":"-80.175648","Date Submitted":"09/13/2012 10:16 UTC","Log Number":"US-09132012-0009","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Oval, Sphere","Sighting Duration":"Undisclosed","City":"Summerville","Region":"South Carolina","Latitude":"33.018504","Case Number":"42527","Date of the Event":"09/12/2012 09:00 UTC","Object Flight Path":"Stationary","Summary":"We saw several glowing like orbs.","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.018504,+-80.175648(42527)&iwloc=A&hl=en\"> mufon case (42527) map </A>","files":["/var/www/straped/mufon/html2text/42527.html.txt","/var/www/straped/mufon/org/42527.html"],"trends":["There have been 4 other sightings in Summerville","There were no other sightings in Summerville on or around September 12th 2012"],"Country":"United States"}