{"trends":["There have been 16 other sightings in Killeen","There was one other sighting in Killeen on or around September 9th 2012"],"files":["/var/www/straped/mufon/html2text/42539.html.txt","/var/www/straped/mufon/org/42539.html"],"Date of the Event":"09/09/2012 06:47 UTC","Log Number":"US-09142012-0001","Object Flight Path":"Straight-line path","Longitude":"-97.720096","Country":"United States","Sighting Duration":"00:01:00","Weather Factors":"Unknown","Disposition":"Unresolved","Case Number":"42539","Date Submitted":"09/14/2012 12:37 UTC","Summary":"Solid Oval Light","map":"<A HREF = \"http://maps.google.com/maps?q=31.126689,+-97.720096(42539)&iwloc=A&hl=en\"> mufon case (42539) map </A>","Region":"Texas","Source":"MUFON","divs":["Sighting DetailsAs I was watching the weather report and gathering the trash in the house (as it was trash day) I was about to leave for work. So I went outside to take the trashcan to the street. I had been monitoring the phases of the moon for the past few mornings just because, and noticed the position of Venus. As I was heading in the house to get my things to go to work, I was glancing up curious about the direction of cloud movement because i had noticed for a brief moment it seemed that the clouds were moving due to a light in the sky , which I figured was a star. So I looked straight up and thought the clouds were moving fairly quickly but wasn't sure how fast. So I stuck my thumb up in the air to make a non-moveable reference point to see how fast they were moving and noticed it wasn't the clouds moving at all. It was the light I had seen briefly that I thought was just a star. But upon a closer look it was brighter than the star and even the planet Venus. I ran inside as quickly as possible to get my Ipad as it was the nearest camera accessible camera at the time and started filming. I didn't hear any sound or see any beacon lights (red) as I normally do when I see a plane. I live by the airport and hear and see planes, of all types, all the time. Especially when its dark, during one of my sky observation times. I didn't notice anything else as I was filming and was trying to make sense of what it COULD be. After the experience, I went to work and shared the video with a few others. One thing I did notice tonight, as I am sitting here typing and reviewing the video, is that the sky seems to be brighter than it actually appeared outside this morning. I don't know if that is due to the camera capturing more light than the human eye sees or what. I also noticed a blinking light at the beginning of the video that I didn't notice when I started to actually record the footage or when I was sharing the video with coworkers. The light started in the south to southwest and moved in a straight path to the north, northeast. Once again, I didn't notice any sound. I'm still not sure what it was, but I think its worth sharing. My feelings about seeing this was one of excitement and nervousness."],"City":"Killeen","Viewing Distance":"Unknown","Tags":"City","Latitude":"31.126689","Object Features":"Unknown","Object Shape":"Oval"}