{"Source":"MUFON","Object Flight Path":"Stationary","Object Features":"None","files":["/var/www/straped/mufon/html2text/42538.html.txt","/var/www/straped/mufon/org/42538.html"],"trends":["There have been 6 other sightings in Globe","There were no other sightings in Globe on or around August 8th 2012"],"Summary":"siler type disc apparently large but far away..perhaps 2 miles in bright blue sky","divs":["Sighting DetailsI was passenger in car driving north on hwy 188 ans observed an obvious silver disc, not highly reflective but silvery looking or gray. I watched it for just a few minutes to confirm it was not a plane or known craft to me. It was hovering, with no apparent lights or any features other than this metallic saucer. I said to driver, \"Do you see that? I think it's a UFO!\" and reached to back seat to grab camera, then looked back in under three or four seconds and it was gone. It simply vanished in beautiful blue sky, no clouds. There was just no where to \"hide\" in the giant blue sky. Hard to judge distance, but it seemed above and between us at about Wheatfields Road and the HWY 288 about 8 miles further down the road. It was bigger than an \"aspirin\" and smaller than a \"quarter\". Just a guess at degree above horizon...could have been closer to 45 or 50. this is close to Roosevelt Lake. I actually felt like \"it\" knew I was grabbing a camera and it made me mad as the driver did not see it and I was left feeling as though he thought I was \"seeing things.\" I saw what I saw, no explanation, add it to the many reported and no way to check up on. Just putting it out there because it bothers me, how it could just vanish in an almost cloudless sky."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.395322,+-110.780458(42538)&iwloc=A&hl=en\"> mufon case (42538) map </A>","Weather Factors":"Unknown","Log Number":"US-09132012-0020","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Disc","Date Submitted":"09/13/2012 11:57 UTC","Date of the Event":"08/08/2012 01:30 UTC","Latitude":"33.395322","Case Number":"42538","Disposition":"Unresolved","City":"Globe","Longitude":"-110.780458","Sighting Duration":"Undisclosed","Region":"Arizona"}