{"divs":["sighting detailsufos seen near intersection of hwy 41 and avenue 12 north of fresno, ca one mother and two teenage boys were driving north of fresno, california on highway 41 at approximately 10:30 pm on october 5, 2011. one of the boys sighted a swarm of about ten (10) fuzzy white orbs zig-zagging through and around the clouds in the overcast sky just east of the intersection of highway 41 and avenue 12 north of fresno, ca. they watched these \"fuzzy\" white lights for about five-minutes as they turned west onto avenue 12 toward madera, ca. as they drive west, the boys encouraged the mother to turn the car around, which she did, to return to the intersection. the mother then turned north onto highway 41 while they all watch the lights swarm around through the clouds. just east of the same intersection is a barn and many ongoing acres of open farmland\\ranchland. according to the boys, some of these fuzzy white lights had a small star-like center to them. additionally, on the ground, to the viewing-right (e.g., east) of the reference barn (as seen from the intersection of highway 41 and avenue 12) there was also seen a large triangle-shape (tip of triangle pointing upwards). this object had blinking white lights at each tip of the large triangle. the mother turned the vehicle around and drove home. they do not have any explanation as to what they saw in the distance last night. there is a creek\\river-bad that runs north to south near where these sightings occurred."],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-119.79024","Date Submitted":"09/13/2012 08:40 UTC","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/42534.html.txt","/var/www/straped/mufon/org/42534.html"],"Sighting Duration":"Undisclosed","Tags":"City","Region":"California","Object Features":"Unknown","Source":"MUFON","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around October 5th 2011"],"Latitude":"36.822861","Date of the Event":"10/05/2011 10:30 UTC","City":"Fresno","Log Number":"US-09132012-0016","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Swarm of UFO above with one large dark triangle on ground","map":"<A HREF = \"http://maps.google.com/maps?q=36.822861,+-119.79024(42534)&iwloc=A&hl=en\"> mufon case (42534) map </A>","Case Number":"42534","Object Shape":"Sphere, Triangle"}