{"Object Flight Path":"Straight-line path,Path with directional change","Country":"United States","Log Number":"US-09132012-0017","Date Submitted":"09/13/2012 09:47 UTC","Sighting Duration":"Undisclosed","Latitude":"38.806958","map":"<A HREF = \"http://maps.google.com/maps?q=38.806958,+-94.909672(42535)&iwloc=A&hl=en\"> mufon case (42535) map </A>","Object Shape":"Sphere","Tags":"City","Weather Factors":"Unknown","Object Features":"None","Summary":"Ultra bright white orb descended from sky then abruptly change direction and disappeared.","City":"Gardner","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was watching TV in bed when I noticed an ultra bright white orb, out of the corner of my eye, descend from the sky outside my bedroom window and then changed direction and disappeared. I was looking north at the time. I told my son and he went outback to look and then came in and told me he saw the same orb go from the north to the south. We both went to the back deck and stared at the sky. At first I thought it was a shooting star but knew it wasn't as soon as it changed direction and the fact it was way too bright. The object was in the shape of an orb and moved at a hig rate of speed. It came almost straight down and then changed direction to the east and dissapeared. While in the back yard looking up at the sky we saw a star like orb start moving east in the southern sky. Then a few seconds later another orb started moving west towards the same spot as the other. Both were moving at a high rate of speed and weaving slightly as they moved. These were up extremely high in the atmosphere. In a mater of 15 seconds they both dissapeared in the exact same location. At the same time we noticed a sharp increase in airlplane traffic. Just a couple of minutes after these two dissapeared we noticed 3 aircraft fly in from the east going west past the area and then dissapear. Then 2 aircraft, possibly the same, started fly from the west back to the east. One was fairly low and looked like a stealth bomber leaving a massive contrail. We looked up what a B2 bombers contrail looked like and we are sure this is what it was. Now this makes sense considering how much it e had elapsed from the first sighting and how far Whiteman airbase is to the east of here. I have never seen anything like this before so this was very exciting and a little scary at the same time. I have seen 100's of shooting stars before but nothing ever like this. There was also a plane present when I noticed the first orb. I thought maybe this was the planes beacon but could not have been since the plane was several miles away and the orb was less then a mile from my house. I also went out front right after I saw this and heard dogs barking I have never noticed before."],"Region":"Kansas","Longitude":"-94.909672","files":["/var/www/straped/mufon/html2text/42535.html.txt","/var/www/straped/mufon/org/42535.html"],"Disposition":"Unresolved","Case Number":"42535","trends":["There have been 9 other sightings in Gardner","There were no other sightings in Gardner on or around September 12th 2012"],"Source":"MUFON","Date of the Event":"09/12/2012 09:30 UTC"}