{"map":"<A HREF = \"http://maps.google.com/maps?q=40.560036,+-85.599904(42543)&iwloc=A&hl=en\"> mufon case (42543) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-85.599904","Weather Factors":"Unknown","Summary":"bright star-like light, high alt, silent, east2south path","trends":[],"Region":"Indiana","Date of the Event":"09/13/2012 12:00 UTC","divs":["Sighting DetailsWe live in a country setting(IN). We have on several occasions observed these lights.Usually one at a time. Mostly straight line travel, but I observed a turn once for sure (9.13.12). The first time was just night sky gazing when we notice what we call a mover. Stars that seem to move. We believe these to be satellites or other orbiting objects. When it turned it gave me pause. Wife and I have seen these on multiple occasions, once three at a time, straight up moving in different directions. We lay in a chase lounge chair with binoculars and sometimes we see these objects. We would like to know if sunlight can illuminate satellites or other earth objects in orbit. The hour of the day seems to late for that but we are not astronomers. We live approx. 30 miles south of Grissom AFB. We are just curious, not obsessed. We do believe in ufo's per say, but have never seen one. Just these lights. They seem to be way above air traffic altitudes. They also move much faster than a jet with no sound. It is exciting to wonder what they are, but we've not been \"in any altered states\" as some claim. As a satellite communications tech(27 yrs) I have been looking up for a long time(mostly in daylight). These lights are simply interesting and we suspect sat traffic or junk traffic. I know there is alot up there. Oh ya, as a satellite service tech I called on Dick Crisswell at his home in Lebenon, IN. Are you familiar with him? Feel free to call me. He gave me a DVD which was interesting..."],"Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/42543.html.txt","/var/www/straped/mufon/org/42543.html"],"Disposition":"Unresolved","Object Shape":"Star-like","City":"Undisclosed","Date Submitted":"09/14/2012 12:24 UTC","Log Number":"US-09142012-0005","Case Number":"42543","Object Flight Path":"Path with directional change","Latitude":"40.560036","Object Features":"Unknown"}