{"Disposition":"Unresolved","Log Number":"US-09142012-0003","Sighting Duration":"00:01:30","Object Features":"Other","Tags":"City","divs":["Sighting DetailsWe were walking across the park avenue my girl said what's that. Then I saw itbridge towards the regency student housing. When I saw it I had to take a second look. It was not birds or a plane. It moved across the whole front range in about ninety seconds then it was gone out of sight. I couldn't believe what I had just saw. It took my breath away. I had to stop and fully take in what I had just seen. I've thought i've seen suspicious things before but this time I know. It was truly unidentifiable and was moving too fat and quiet to be s pane or birds. It looked semi stealth the lights were not super bright but it appeared to be one object on triangle shape with only lights on the front side. It was stealth bomber shaped but a higher degree of angle. I was not effected besides being in aw. As fast ae saw it was gone. It appeared huge, really big not exactly sure on size or distance from ground it was up pretty high about low cloud height and you can still tell that it was big."],"Date Submitted":"09/14/2012 05:06 UTC","Region":"Colorado","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.739947,+-104.982658(42541)&iwloc=A&hl=en\"> mufon case (42541) map </A>","Viewing Distance":"Over One Mile","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around September 13th 2012"],"Longitude":"-104.982658","Summary":"we were walking and my girl said what's that. me and two others saw a triangle uniform set of lights they appears stuck together and were on the bottom of something flying almost floating really fat silently over downtown Denver it appears semi stealth.","Latitude":"39.739947","files":["/var/www/straped/mufon/html2text/42541.html.txt","/var/www/straped/mufon/org/42541.html"],"Object Shape":"Triangle","Date of the Event":"09/13/2012 12:00 UTC","Source":"MUFON","Country":"United States","Case Number":"42541","City":"Denver","Object Flight Path":"Straight-line path"}