{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42545.html.txt","/var/www/straped/mufon/org/42545.html"],"Case Number":"42545","divs":["Sighting DetailsI was in my back yard throwing away the trash when I first saw the flashing object in the night sky. I am a private pilot, so i frequently look up to see the aircrafts flight path that is near my home. This object did not move and seems to kind of drift slightly like a helicopter might. It had what seemed to be typical night beacons of commercial aircraft. I was courious, so I went to get my binocculars to get a better look. Thats when I noticed that the beacons were flashing , but not the way standard aircraft,or police, or military would. The white light was much larger and brighter than the red, which was larger than thje green. Only the green and red lights flashed, but at different rates. I also niticed that the red light never went completly out....just dimmed. After that, I called my daughter out to see if she saw what I saw. She comfirmed my observations. I then when in and got my telescope to get a even better look. While I was getting my scope, I hear what sounded like F-16s from the airforce base on the west side of Phoenix pass overhead. Its hard to descibe what I see here. The obect has been in about the same spot for two nights in a row. I tried to find out if there was any air traffic in the are around then, but all three (Sky Harbor, Deer Valley, luke AFB) gave me the run-a-round. My daughter was watching the object through the telescope on the first night when she said it just kind of faded away.....gone."],"Viewing Distance":"Unknown","Latitude":"34.054668","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Summary":"I have observed the same object now 3 nights in a row in the same place. I have witness military jets in the area during the sighting.","Date of the Event":"09/12/2012 08:30 UTC","Longitude":"-111.087131","map":"<A HREF = \"http://maps.google.com/maps?q=34.054668,+-111.087131(42545)&iwloc=A&hl=en\"> mufon case (42545) map </A>","City":"Undisclosed","Disposition":"Unresolved","Region":"Arizona","trends":[],"Object Flight Path":"Stationary","Date Submitted":"09/14/2012 01:29 UTC","Object Shape":"Triangle","Object Features":"None","Log Number":"US-09142012-0007"}