{"Country":"United States","Disposition":"Unresolved","Sighting Duration":"Undisclosed","City":"Islamorada","Date Submitted":"09/14/2012 07:00 UTC","Latitude":"24.927944","files":["/var/www/straped/mufon/html2text/42559.html.txt","/var/www/straped/mufon/org/42559.html"],"trends":["There have been 5 other sightings in Islamorada","There was one other sighting in Islamorada on or around June 15th 1992"],"Weather Factors":"Unknown","Tags":"City","Viewing Distance":"21-100 Feet","Longitude":"-80.621056","Log Number":"US-09142012-0019","Object Features":"Other","Summary":"I saw a UFO in the Florida Keys with 2 friends.","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","divs":["Sighting DetailsI was going fishing in the keys with 2 friends. It was about 5 am, a few minutes on Card Sound Road heading south I looked out the passenger side window (west) I saw right above the tree tops a object traveling our same speed- staying even with us. I pointed it out to my friends, they both got scared and the driver nailed the throttle and accelerated to well over 125 mph. The object stayed with us. (20 feet west and 30-40 feet up, above the tree tops). The driver slammed on the brakes and the object slowed with us (almost like it knew when we were going to start and stop). We repeated this process 2 more times (total of 3). The craft did the same thing all 3 times. The last time we stopped I had the overwhelming urge to get out of the truck and did. My friends took off south and left me on the side of the road. I stood there for about 10 minutes and stared at the object hovering right above the tree tops (30-50 feet above and about 15-20 feet away from me. It was so close to me I could have hit it with a baseball. I felt an overwhelming urge to get closer. At that moment the truck slide up to me again and my friends made me get back in the truck. We again accelerated well over 125 mph and slammed on the brakes again- the object stayed with us just like before and we did that 3 times (total of 6 times). I looked over to the driver and said \"W.T.F. did we just witness\". When we looked out the passenger window again. It was gone. This sighting lasted 30-45 minutes. The craft reminded me of the 1950s case where the elderly couple were abducted. It looked like their sketch of the craft. It was the shape of a John Dilenger 1920s Styrofoam campaign hat. The outer edge of the bottom was glowing white, the smaller top of the craft had VERY BRIGHT multi-colored misshaped squares ALL DIFFERENT COLORS. VERY BRITE! The rest of the trip neither of my friends would talk about what happened. 3-4 years went by and I saw a sketch of the craft that the driver drew at his mothers house and than we talked about it that day. The other passenger wouldn't talk about it for 16-17 years and than we discussed it in detail. Thank you for giving me the opportunity to report this, everyone I told this story to thought I was crazy. I haven't looked at the night sky the same again. I will gladly take a lie-detector test and I will pass with flying colors. I also agree to answer any and all questions MUFON has for me, or anyone else for that matter. Sincerely Dennis Gallo Jr i might have submitted this a couple of times.....im not so good with a computer.....sorry!"],"Object Shape":"Disc, Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=24.927944,+-80.621056(42559)&iwloc=A&hl=en\"> mufon case (42559) map </A>","Date of the Event":"06/15/1992 12:00 UTC","Region":"Florida","Case Number":"42559"}