{"map":"<A HREF = \"http://maps.google.com/maps?q=40.446835,+-79.990056(42558)&iwloc=A&hl=en\"> mufon case (42558) map </A>","Log Number":"US-09142012-0018","Weather Factors":"Unknown","Region":"Pennsylvania","Case Number":"42558","Latitude":"40.446835","Summary":"I thought it might of been a helicopter but it was night, it was too high up but not in the atmosphere and didn't shine any lights down. It just kept pulsating this blue, red and green lights. I was stumped especially when it flashed twice and slowy left.","Longitude":"-79.990056","divs":["Sighting DetailsThis was an object I had previously dismissed as being of explainable origin beginning the end of August. I looked out of my window my friend and I noticed a object just chilling in the air a pretty good distance away. I couldn't tell exactly how far away or high, but it was at least a mile away and it wasn't that high but it was not above the atmosphere. That was definitley apparent. So anyway what was weird about it was one is that I noticed this object previously and dismissed it as something weird or a really close planets because I know that this summer has been pretty cool for that kind of stuff. So we could not figure out what it was. We know what a plane is, we know what a helicopter is and what they do. We know about the most common things that are in the sky. Mostly. We know that satelites aren't stationary so it couldn't be that. It was flashing and pulsating what looked like red, blue and greens lights almost like rotating around the object. So we said to eachother we will just ignore it for a while and then look and if it's gone then we would just come to the conclusion that it was just super weird. So some time went by, I don't know hom much exactly maybe like 30 minutes. I looked over and right at that moment it flashed two bright flashes in my direction ( white light ), and slowing went away from us. It seemed slow but it was strange because it seemed like it was shrinking in a way and disappearing. Very weird ! And I wish I could explain it. It's there too often in the same spot that it could be aliens. Why there ?? Please help."],"Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/42558.html.txt","/var/www/straped/mufon/org/42558.html"],"Country":"United States","Viewing Distance":"Over One Mile","City":"Pittsburgh","Object Features":"Unknown","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around September 12th 2012"],"Date of the Event":"09/12/2012 09:50 UTC","Date Submitted":"09/14/2012 06:34 UTC","Object Shape":"Star-like","Object Flight Path":"Stationary","Tags":"City"}