{"divs":["Sighting Detailsmyself and 2 friends went to the keys to go fishing(long key bridge)! on the way down we took card sound road south instead of us1!(during the week-NO other cars on the road AT ALL!!! as soon as we got on card sound road i noticed the object in the passenger window of the truck at the top of the tree line!VERY BRIGHT AND COLORFULL! (88-89 f150 ford reg cab)(i also have the names of the other 2 guys if u need it) the driver looked over and got scared-we had no idea what it was! the driver put his foot to the floor and we took off(south) accellarated to well over 125mph the object stayed with us! then the driver hit the brakes hard......object stayed rite with us at the top of the tree line about 30-50 feet off the ground(top of the tree line) and 20-35 feet to our right(west side of the road) we repeated this 2-3 times more it STAYED with us the whole process-so far its been about 20mins or so! the last time we stoped i felt a overwhelming urge to get out of the truck! when i did my friends thought i was nuts.....and LEFT me on the side of the road(west side-right)with the object! i stood there as the truck BURNED RUBBER to get away!the whole time the object stayed rite with us accelerated with us and stopped with us EVERY TIME!!! they left me there! i stared at the object hovering at the top of the trees..i stood there...rite there for about 10-15mins longer-and felt another urge to walk even closer....at that moment the truck slid around with brakes locked-my 2 friends forced me back into the truck! again we accelerated south to well over 125mph and slowed to a stop and we did that 2-3 more times! then i looked at my friends to say WTF did we just encounter when we looked back out the passenger window the object was gone.............for the rest of the day my 2 friends refused to talk about it...actually for the next18 years or so they wouldnt even acknowledge that it happened! then one day i saw a scetch of the object at the drivers house!! that day we spoke about it! only that day!!!! the other passenger finnaly spoke with me about it some time around 2010!!!! the object was shaped like a campaign hat! with multi colored lights blinking and flashing!with white light around the lower ring!!!!no sound AT ALL! it looked to me like the object that the older couple from the 1950's who were \"abducted\" husband and wife saw and scetched!!!!i still see it like it was yesterday! thanks for your time.. ....dennis fyi-i will answer any and all questions and i WILL take a lie detector test! & this really happened!!!!"],"City":"islamorada,keys","map":"<A HREF = \"http://maps.google.com/maps?q=27.670297,+-81.509584(42552)&iwloc=A&hl=en\"> mufon case (42552) map </A>","trends":["There have been no other sightings in islamorada,keys","This sighting has been favorited 1 time."],"Source":"MUFON","Log Number":"US-09142012-0012","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42552.html.txt","/var/www/straped/mufon/org/42552.html"],"Date of the Event":"06/15/1992 12:00 UTC","Tags":"City","Viewing Distance":"21-100 Feet","Object Features":"Other","Object Shape":"Disc, Saturn-like","Date Submitted":"09/14/2012 04:53 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Longitude":"-81.509584","Country":"United States","Case Number":"42552","Latitude":"27.670297","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Summary":"omw to the keys to fish w/2 friends-object raced us to over 125mph then to 0-i felt like i HAD to get out of truck and did-friends took off-i stayed so did the object-50ft away i stood there stareing at it and felt drawn to it-friends came back i got in t","Region":"Florida"}