{"Summary":"Three segmented lights","City":"Alquina/Quakertown","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Tags":"City","Case Number":"42555","Log Number":"US-09142012-0015","trends":["there have been no other sightings in alquina\\quakertown","This sighting has never been favorited."],"Object Shape":"Circle","divs":["Sighting DetailsWhile returning from Connersville, IN, we were on Dunlapsville Rd between Alquina and Quakertown on the way to Liberty, heading East. I was looking out of the passenger side window, when I observed three segmented lights coming very fast from my peripheral vision, then stop. Thinking this was just an aircraft, just watched, but pointed it out to my husband that it did not have the appropriate navigational lights, nor any strobes. He, too, noticed the oddity. I kept watching for several minutes and it appeared to be heading toward us. The area we were in is pretty open and was well before reaching the Brookville Lake area and tree lines. While still watching, it just went out. Gone. The center light appeared a golf ball size, while the side lights looked slightly seperated on each side. Kept watching, but was totally gone. Had this been an aircraft with anticollision lights, I still would have seen some sort of nav lights if it turned. When we got home, I saw to the due south of me, again, similar, but that area is part of the CVG flight path, however, no sound emanated from both, each time. I can hear aircraft from CVG. Again, it was suddenly just...gone."],"Region":"Indiana","Object Features":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42555.html.txt","/var/www/straped/mufon/org/42555.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.558486,+-85.598074(42555)&iwloc=A&hl=en\"> mufon case (42555) map </A>","Date of the Event":"09/12/2012 08:15 UTC","Viewing Distance":"Over One Mile","Latitude":"40.558486","Longitude":"-85.598074","Date Submitted":"09/14/2012 06:04 UTC","Country":"United States","Disposition":"Unresolved"}