{"Country":"United States","trends":["There have been 12 other sightings in Lenexa","There were no other sightings in Lenexa on or around September 9th 2012"],"Region":"Kansas","Tags":"City","divs":["sighting detailsfi 17767 talked with past adult female witness on 9\\13\\12. she recounts new sighting 9\\09\\12 between 0330-0500hrs. while working on a personal project, witness noticed a light out of the corner of her eye. at first, witness thought it was the moon but soon discounted that as the moon was currently directly overhead in a clear sky. she attempted to signal the object with no response with a lazer pen. she was watching when she noticed that ethan, her neighbor boy who lived next door, was looking out his sliking glass door. he had been awakened by a noise and got up for a drink and a look to see what it was the witness asked ethan if he could see what she was seeing. ethan said yes. they watched together. this event details two objects. the first object was further away from the witnesses, seen in the east sky at 45 degrees, and was visable in the attached video for 13 seconds. it flashed. the second object was seen in the north sky and was closer to the witness. it appeared oval in shape and also appeared to have, what ethan said was a cross inside it. it is not clear if he referred to a religious type cross or the plus sign. it exhibited dim to bright lights and in the attached video, was visable for 21 seconds. both the adult and ethan decided to retire. before retiring, the adult female woke her husband who also saw the objects. they were still visable at the time they retired."],"files":["/var/www/straped/mufon/html2text/42553.html.txt","/var/www/straped/mufon/org/42553.html"],"Weather Factors":"Unknown","Log Number":"US-09142012-0013","Sighting Duration":"01:30:00","Summary":"lights seen over Lenexa, Ks.","Date Submitted":"09/14/2012 05:00 UTC","Longitude":"-94.730871","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.956937,+-94.730871(42553)&iwloc=A&hl=en\"> mufon case (42553) map </A>","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","City":"Lenexa","Date of the Event":"09/09/2012 03:30 UTC","Latitude":"38.956937","Case Number":"42553","Disposition":"Unresolved","Object Features":"Insignia","Object Shape":"Egg, Oval"}