{"Longitude":"-82.596783","City":"High Springs","files":["/var/www/straped/mufon/html2text/42569.html.txt","/var/www/straped/mufon/org/42569.html"],"Object Shape":"Cigar, Circle, Disc, Oval, Sphere, Star-like","Weather Factors":"Unknown","Summary":"Definity not a plane","Object Features":"Unknown","Date of the Event":"09/15/2012 06:05 UTC","Date Submitted":"09/15/2012 08:30 UTC","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","Case Number":"42569","map":"<A HREF = \"http://maps.google.com/maps?q=29.826906,+-82.596783(42569)&iwloc=A&hl=en\"> mufon case (42569) map </A>","Country":"United States","Region":"Florida","Sighting Duration":"Undisclosed","Viewing Distance":"N/A","trends":["There have been 2 other sightings in High Springs","There were no other sightings in High Springs on or around September 15th 2012"],"Latitude":"29.826906","Log Number":"US-09152012-0006","divs":["Sighting Details(excuse my spelling please) I was just sitting on my back pourch smoking a cigarette playing solitaire on my phone when i looked up and saw this oval bright star like object heading east very slowly. my first thought was a plane but there was no sound. and if it was a plane and it was that low it would have made noise. but it diodnt. there was nothing. and planes normally have flashing lights of some kind (mostly red ones)but this didnt it was oval and the lights on it were in a perfect horizontal line. then it moved a little faster as it turned left (heading north) then it completely stopped. thats when i freaked out. i dont care what anyone says planes dont hover! i ran inside and continued stairing at it threw the window on my back door. it then moved in a small circle, hovered again then went north east. since i was watching it from inside my house because i was to scared to go back outside i lost sight of it. but then just about two minutes after it was out of my view a \"shooting star\" came from the north east going north west and disappeared in the middle of the sky."]}