{"files":["/var/www/straped/mufon/html2text/42567.html.txt","/var/www/straped/mufon/org/42567.html"],"City":"Peachland","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Latitude":"49.747854","Source":"MUFON","Date Submitted":"09/15/2012 03:14 UTC","Region":"British Columbia","trends":["There have been no other sightings in Peachland","This sighting has been favorited 1 time."],"Viewing Distance":"501 Feet - 1 Mile","Country":"Canada","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI went out to my truck at 10 pm to get a choclate bar and chips i had forgot. I looked behind my tree line and saw the most spectacular light show ive ever seen.i immediately ran in the house to tell my girlfriend to come outside to see it. We observed it above the trees for about 20 minutes. My heart was pounding. I never even thought to grab a camera. I was in shock. 7 hours later, at 5 am, i grabbed my smart phone and ran outside. The UFO had moved away from the initial site, to 4 or 5 miles away. Still visible. I filmed the craft for 15 minutes, and took 75 pictures. Very grainy, but you can tell its not a helicopter, or satelite. The UFO dropped white orbs , and the orbs flew sideways at a high rate of speed.only afew were dropped. I was shaking uncontrollably. Ive been watching the skies for over a year. And seen hundreds of objects in the sky. This one i had to report. I called my brother 10 miles away, he also seen it , and shot a video.im outside tonite, hoping to see more.im a believer !"],"Date of the Event":"09/12/2012 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.747854,+-119.768742(42567)&iwloc=A&hl=en\"> mufon case (42567) map </A>","Weather Factors":"Unknown","Object Features":"Patterned Surface","Log Number":"CA-09152012-0004","Disposition":"Unresolved","Summary":"craft emitted vivid pulsating colors of light, i was mesmirized., and in a state of shock.i shot a video, when they were to far away.","Object Shape":"Cylinder","Longitude":"-119.768742","Case Number":"42567"}