{"Disposition":"Unresolved","Longitude":"-123.362018","Object Flight Path":"Stationary","Weather Factors":"Unknown","Object Shape":"Cigar, Cylinder","Case Number":"42577","City":"Victoria","Source":"MUFON","Log Number":"CA-09152012-0014","Date of the Event":"09/14/2012 03:30 UTC","files":["/var/www/straped/mufon/html2text/42577.html.txt","/var/www/straped/mufon/more/42577_submitter_file1__sept2012ufo002.JPG","/var/www/straped/mufon/more/42577_submitter_file2__sept2012ufo004.JPG","/var/www/straped/mufon/more/42577_submitter_file3__sept2012ufo010.JPG","/var/www/straped/mufon/more/42577_submitter_file4__sept2012ufo009.JPG","/var/www/straped/mufon/org/42577.html"],"divs":["Sighting DetailsWe were sitting on the beach off Dallas Road, in Victoria B.C,(Vancouver Island),when across the water I noticed some bright lights hovering above the ocean. It was odd to see such a bright, large object in the middle of the afternoon, on a beautiful sunny day. The object appeared to be somewhat cylindrical,but with 3 almost separate,glowing parts. Shortly after I started taking photos, I noticed that 2 black helicopters had now appeared as well, and seemed to be flying around the object; one of the bright spots, on the right side appeared to get larger, as if it was turning with the arrival of the helicopters. I continued to take several photos, eventually the object seemed to just evaporate in the distance. There was no significant movement of the object, it seemed to just hover above the ocean. Upon further investigation of my photos, it would appear that there was a significant heat source emitting from the object, as when I zoomed in (on my computer), it was obvious that the color of the pixels changed from the center outward, becoming almost a pale green around the edge."],"Region":"British Columbia","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=48.408513,+-123.362018(42577)&iwloc=A&hl=en\"> mufon case (42577) map </A>","Tags":"City","Summary":"Cylindrical cluster of 3 bright lights hovering above the ocean, with 2 black helicopters appearing","Date Submitted":"09/15/2012 05:06 UTC","Latitude":"48.408513","Viewing Distance":"Over One Mile","Country":"Canada","trends":["There have been 14 other sightings in Victoria","There was one other sighting in Victoria on or around September 14th 2012","This sighting has been favorited 2 times.",""]}