{"Latitude":"42.3424","files":["/var/www/straped/mufon/html2text/42572.html.txt","/var/www/straped/mufon/org/42572.html"],"Source":"MUFON","Summary":"Two Military Veterans Sight Triangular Craft Passing Over Boston City Hall Plaza / 23AUG12 / Approx. 2030Hrs...","Weather Factors":"Unknown","Tags":"City","Region":"Massachusetts","Longitude":"-71.07922","Case Number":"42572","Object Flight Path":"Straight-line path","Country":"United States","Date of the Event":"08/23/2012 08:30 UTC","Viewing Distance":"Unknown","Log Number":"US-09152012-0009","Date Submitted":"09/15/2012 11:45 UTC","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around August 23rd 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.3424,+-71.07922(42572)&iwloc=A&hl=en\"> mufon case (42572) map </A>","Disposition":"Unresolved","divs":["sighting detailsi am a us navy veteran, with additional experience as a security enforcement officer, and also as a park ranger. it is my job to be critically observant at all times... on 23aug12 @ approx. 2030hrs, i and a companion, who is a us army veteran, were sitting on boston's city hall plaza, located behind the new england center for veterans, simply \"shooting the breeze\" as it was a pleasant night with temps in the low 70's and a light wind from the east @ approx. 5-10mph, when we both noticed a unique slow-moving light formation coming in from the north. note: this craft had no observable port and starboard\\red and green lights like those required by faa regulations on all other aircraft. we both knew this was not a plane, helicopter, dirigible, blimp, hot air balloon, or ultralight, as we are both very familiar with these types of crafts, including commercial, military, and private. (just moments before, we had observed a plane heading from northwest to southeast on its approach to boston's logan airport, and this craft did not resemble, in any way, this plane or any other known aircraft.) it moved steadily from north to south without flight deviation of any kind, travelling (at a guess) about 25-35mph. as its approach got nearer, we noticed that there was no sound whatsoever, and, as it passed directly overhead, we noticed that it was a triangular shape, the outer frame of the structure black in color from what we could see, with an inner indentation inside the outer body of a lighter black\\dark gray color. the craft had three (3) bright white lights edged with a thin outer golden color on each corner of the triangle, with a very bright large white light with the same golden edge to it in the center of the craft, and at the stern\\aft portion of the craft were two (2) red lights just readily seen equidistant from one another at the edge of the outer frame of the craft. i drew a colored detailed sketch of this vehicle as it passed slowly overhead. this triangular craft continued without flight deviation due south until it passed over some buildings and out of sight. we count ourselves fortunate to have been witness to such a sighting as the one described in detail above. we are also very much open to being contacted by your agency representative to be interviewed by your field operator in this matter."],"Sighting Duration":"00:04:00","Object Features":"Other","Object Shape":"Triangle","City":"Boston"}