{"Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Vinton","There were no other sightings in Vinton on or around September 14th 2012"],"Source":"MUFON","Country":"United States","Date of the Event":"09/14/2012 09:36 UTC","Latitude":"42.164648","Log Number":"US-09152012-0015","Longitude":"-92.018565","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"Iowa","divs":["sighting detailswe were sitting outside next to a bonfire with 3 friends and at approximately 9:36pm (central us time) when i noticed what i thought initially was a candle lantern southwest of our yard. i mentioned it to the rest of the group who turned around and noted the object coming toward our location. the object was first detected near the tree line\\horizon (sw) and passed nearly overhead and proceeded in a northeastward direction. speed was consistent. no sound. no blinking light. was a clear night. what made this object most interesting was the color (yellow-orange) and the illumination, almost a star burst (consistent throughout - no pulsing) and the absence of sound associated. we lost sight of the object as it continued overhead and over our visible horizon. reactions: didnt know what the heck it was; one of us didnt want to admit he saw anything (which was odd) but as it passed nearly overhead i wondered if it was going to stop. it didnt. not sure what to think honestly but ive searched the internet to see if anyone else had seen it. in fact, id posted a note on my facebook page last night just after we saw it and friends from sw iowa (2 of them) both said they had seen it too. the object didnt seem like a shooting star as ive seen those before (and this object we saw moved much, much slower). there wasnt any \"tail\" the sunburst glow didnt change in shape and was just there...moving past. still is kinda of weird...and weird that im actually writing this now :)"],"Summary":"Cube shapped glowing (sunburst) observed from SW to NE","Object Flight Path":"Straight-line path","Tags":"City","Case Number":"42578","map":"<A HREF = \"http://maps.google.com/maps?q=42.164648,+-92.018565(42578)&iwloc=A&hl=en\"> mufon case (42578) map </A>","City":"Vinton","Weather Factors":"Unknown","Date Submitted":"09/15/2012 08:07 UTC","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/42578.html.txt","/var/www/straped/mufon/org/42578.html"],"Object Features":"None"}