{"Object Features":"Unknown","Summary":"Experienced a painful high frequency over a low pulsating frequency and looked up and saw this.","Object Shape":"Diamond, Flash, Oval, Triangle","Date of the Event":"06/23/1985 09:15 UTC","Longitude":"-80.449653","Disposition":"Unresolved","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"09/15/2012 02:09 UTC","divs":["Sighting DetailsI was sitting outside my house one night this Summer going through some texts in my phone and waiting for a friend to get to my house for an evening walk. Suddenly I became aware of my iTunes or Pandora being too loud on my phone (loud enough that even without headphones it really hurt my ears) and-- even though I mentally reminded myself that I hadn't been listening to music I turned my phone over in my hand to address the volume button. Immediately my ears picked up on the realization that the noise wasn't coming from my speaker as soon as I rotated my phone and in that instant I was physically disabled by such a high pitch frequency that I was left in crippling pain. Since I live on a main road, I looked around to see if anybody in a car or any pedestrians were also aware of what was happening. At this point, I had assessed that the super high frequency was wholly alternating between my right ear and my left ear and it was so loud it seemed as if people were blasting speakers playing idiots blowing lifeguard whistles right into the mic. I finally managed to straighten my posture a bit after realizing I was the only person experiencing this painful sound. The next second my eyes focused straight in front and to the sky and I saw a ship that appeared to be engulfed in orange twisting flames. It was in the same place for a bit and then meandered slowly up and down as if looking down to enjoy the view. It looked like the top half was spinning one way and the bottom half the opposite way. It would slowly move and go dim them light up very bright. It looked like it was engulfed in flames and when it moved there would be a flame tail that left an aura behind. When the flame caught up to the craft as it slowed to a stop the flames would engulf the whole thing and it would be really bright. At times it looked like it was diamond-shaped and other times it like like a triangle or even a merkaba. It was in between my house and a shopping center on a hilltop that is a few miles from my house. I watched in disbelief until an inner voice screamed to grab my phone and film it. Which I did. As the craft glided through the night air it seemed to illuminate quickly and then get dim. Upon it getting closer to me I realized that it was a surface of orange flame, and would actually get dim as the craft moved and it left behind a fiery tail and when the craft stopped in it's new location the flame tail would catch up and illuminate the spinning object very brightly before evening out the flames and appearing to go dim again. Another really interesting thing is that I was aware of two frequencies resonating during the time. There was the ultra-abrasive high pitched one and there was a lower tone that reminded me of morse code and was not as consistent. And the millisecond my eyes locked onto the ship, the painful aspect of the high-pitched frequency disappeared entirely. Somehow I managed to pull away to get my phone to film the next minute and twenty-two seconds. It went over my house and I took the opportunity to run into my house and get my better camera. By the time I did this it was already ascending toward south of me and just went up so high it disappeared. The pain I experienced scared me at first and then when I locked my eyes onto the ship it all went away. I felt comforted and then happy and even elated! After it was gone, my whole body was buzzing and I felt like I could zap things with my hands if I tried to. My forehead was especially sensitive and happy-feeling. I was never scared and never had any negative emotional reactions at all."],"Region":"West Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=38.601926,+-80.449653(42575)&iwloc=A&hl=en\"> mufon case (42575) map </A>","Tags":"City","trends":[],"Latitude":"38.601926","City":"Undisclosed","Case Number":"42575","files":["/var/www/straped/mufon/html2text/42575.html.txt","/var/www/straped/mufon/org/42575.html"],"Log Number":"US-09152012-0012","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change"}