{"Date of the Event":"05/01/1979 12:00 UTC","Date Submitted":"09/15/2012 01:36 UTC","City":"Camas","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/42574.html.txt","/var/www/straped/mufon/org/42574.html"],"Log Number":"US-09152012-0011","Country":"United States","divs":["Sighting DetailsIn 1979 I was a security guard working at the Crown Zellerbach paper mill in Camas, Washington. I was on top a ten story distillation tower with a beautiful unobstructed view of the Columbia River about a mile and a half or two miles away. As I watched the boats on the river, they began to turn on their navigation lights. I just happened to look in a southeasterly direction as I noticed a small sailboat turn on his navigation lights. I moment after this boat's lights came on I saw a huge green light just suddenly materialize, like from a spark to a 30 foot sphere. I estimate the size based on the sailboat the light was near. The boat as I remember was about a 34 to 40 foot single mast boat and the light was within 50 feet of the boat. The light appeared to be just under the surface of the water, maybe 5 to 10 feet. The light appeared for lest than a second and then suddenly moved down the river from east to west. It traveled between three and five miles in about two seconds or less and disappeared around the bend in the river. It happened so quickly it was astonishing. When my shift ended, all the plant guards were loaded on a bus and driven back to our cars. I may not even have believed this happened and thought my eyes deceived me somehow except another young man on the bus said, \"Hay did any of you guys see that light on the river?\" I was the only one who spoke up. He described the same thing with no further details. We could not determine what the light was but we agreed the light must have been going several hundred miles an hour UNDER WATER! It happened so quickly that there was no time for any emotion other than astonishment and disbelief. You just never see anything like that, almost like it was surreal."],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=45.596123,+-122.390406(42574)&iwloc=A&hl=en\"> mufon case (42574) map </A>","Case Number":"42574","Source":"MUFON","Viewing Distance":"Over One Mile","Latitude":"45.596123","Longitude":"-122.390406","Summary":"A Bright green light suddenly appeared underwater on the Columbia River. It suddenly travelled underwater a distance of three to five miles in two seconds.","trends":["There have been 4 other sightings in Camas","There were no other sightings in Camas on or around May 1st 1979"],"Tags":"City","Region":"Washington","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}