{"Sighting Duration":"Undisclosed","Longitude":"-82.904443","Disposition":"Unresolved","Case Number":"42579","Latitude":"40.421787","files":["/var/www/straped/mufon/html2text/42579.html.txt","/var/www/straped/mufon/org/42579.html"],"Date of the Event":"09/15/2012 06:40 UTC","divs":["Sighting DetailsMy wife and I were heading to the park with our 4 yr old son today. Not a cloud in the sky and the sun was just tending toward sunset, but still well above the horizon. We were traveling in the opposite direction of the sunset. We were heading south on Louisiana Ave. and just turned left onto Indiana Ave when my wife said (a bit shocked), \"what's that thing in the sky? Right there, that metal thing over there, behind those trees.\" I didn't see it and dared not look as I was in traffic. I instantly pulled the car over and walked out into the school campus which had a clearing, she kept stating, \"there, that way,\" but I did not look back her to see which direction she was pointing. I figured at first hearing her it was a blimp, but wondered if she maybe was seeing a UFO and I wanted to catch a glimpse of it. I looked up and all around but didn't see it anywhere. I turned around and she pointed toward where the school would be blocking the view. I walked back to the car and she explained that it was moving in a straight line, not hovering, so it didn't seem to me to be a balloon or a blimp. There was no sound at all of a plane, which I would have probably heard as she said it just passed over the school. I got back to the car and looked for a while in the sky, but there was nothing. My son didn't see it either, but kept asking about what she saw too...in a 4 yr old way. A few minutes later we got to the park and my eyes were still on the sky, hoping to see what she saw. But then far to the west, the opposite direction the object travelled, we saw two or three hot air baloons rising from the horizon, they were far away, size of pea or smaller. I said to her, \"I gotta ask, do you think it was one of those.\" She responded, \"I know what ballons look like and this was faster, reflective and not that shape.\" I then got further description as I wrote above. Then on this site I saw that there was a reporting in this same exact spot a couple months earlier. My wife is not the type to joke around, and claims to have never see a UFO before or anything like this. That's all we know."],"Object Features":"Unknown","Object Flight Path":"Straight-line path","trends":[],"Summary":"Clear disc-oval shaped object on a clear day/","Date Submitted":"09/15/2012 08:54 UTC","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc, Oval","Log Number":"US-09152012-0016","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.421787,+-82.904443(42579)&iwloc=A&hl=en\"> mufon case (42579) map </A>","City":"Undisclosed","Tags":"City","Region":"Ohio"}