{"Tags":"City","Object Flight Path":"Straight-line path","Log Number":"US-09152012-0018","Longitude":"-89.138708","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Waupaca","There were no other sightings in Waupaca on or around September 15th 2012"],"Object Shape":"Sphere","divs":["Sighting Detailsmaybe it was the space station as some times we do observe it traveling over head but if it was , instead of being that silvery white large glow like we have always seen , tonight the object the wife and i saw appeared to be about the size of the space station but was pulsating a red orange light and between pulses I could see a white object similar to the space station thru the red orange.It was like the orange red light was attached to but below the white and was really bright.there was no sound.the object came from the west and traveled toward the east over our house unwavering. i had just come from the basement and as i was going up the steps of our patio to the house is when i saw it and i yelled at the wife to get out side and just as she came out the door it was just past being straight over our house heading east-we could see it for several secounds through the trees continuing on its path.i would sure be interested if others also saw it. in the last year we have seen multiple objects here and all have been at night."],"Country":"United States","Latitude":"44.356374","City":"Waupaca","Date Submitted":"09/15/2012 09:59 UTC","files":["/var/www/straped/mufon/html2text/42581.html.txt","/var/www/straped/mufon/org/42581.html"],"Region":"Wisconsin","Date of the Event":"09/15/2012 07:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.356374,+-89.138708(42581)&iwloc=A&hl=en\"> mufon case (42581) map </A>","Disposition":"Unresolved","Viewing Distance":"Unknown","Sighting Duration":"00:00:45","Summary":"my wife and i observed a large orange red orb traveling over our house west to east","Object Features":"Unknown","Case Number":"42581"}