{"Object Shape":"Circle, Star-like","Source":"MUFON","Region":"Michigan","files":["/var/www/straped/mufon/html2text/42589.html.txt","/var/www/straped/mufon/more/42589_submitter_file1__lightsinskysept152012.jpg","/var/www/straped/mufon/more/42589_submitter_file2__lightsinskysept1520122.jpg","/var/www/straped/mufon/org/42589.html"],"divs":["Sighting DetailsI was driving home, headed east, around 8:40pm when I noticed red lights in the sky to the north. At first I thought it was a tower nearby, but remembered it has only one light. When I got to a clearing I saw over 35 red lights, ascending upward and heading west. they seemed to be close together. I couldn't tell if there were any formations as i was trying to get a picture. I didn't hear any sound coming from them. I wondered if they could be chinese lanterns, but thought that would be an awful lot. I didn't see any smoke, but it was dark. And I didn't see anything fall to the ground. They slowly disappeared as i watched, but not all at once. And they seemed to all be going to the same 'place'. I did get pictures and will upload them. Maybe there will be a logical explanation tomorrow? I didn't feel any fear while watching. I was excited. I wish I'd taken more pictures or been more observant, but it was the first time i'd ever seen such a thing. I watched until the last one disappeared. I can't say how long it took altogether. Or how big they were. I drove north at the next cross road, to see if I could see anything else, but all were gone."],"Tags":"City","Weather Factors":"Unknown","Object Features":"None","Object Flight Path":"Hovering then path","Latitude":"42.493092","Case Number":"42589","Summary":"I was driving east around 8:40pm when i noticed red lights to the north, there were over 35, they seemed to be going up and to the west. then disappeared, but not all at once.","map":"<A HREF = \"http://maps.google.com/maps?q=42.493092,+-85.191111(42589)&iwloc=A&hl=en\"> mufon case (42589) map </A>","trends":["There have been no other sightings in Bellevue","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","City":"Bellevue","Date Submitted":"09/16/2012 12:40 UTC","Country":"United States","Log Number":"US-09162012-0003","Date of the Event":"09/15/2012 08:40 UTC","Longitude":"-85.191111","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile"}