{"Region":"New Hampshire","Object Features":"None","Tags":"City","Weather Factors":"Unknown","Object Shape":"Sphere","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Longitude":"-71.745743","Country":"United States","trends":["There has been one other sighting in Bristol","There were no other sightings in Bristol on or around July 7th 2012"],"Viewing Distance":"101-500 Feet","Log Number":"US-09152012-0023","files":["/var/www/straped/mufon/html2text/42586.html.txt","/var/www/straped/mufon/org/42586.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.597978,+-71.745743(42586)&iwloc=A&hl=en\"> mufon case (42586) map </A>","City":"Bristol","Summary":"We first observed 2 orange lit orbs fly by and up into the southern sky one disappearing and one remained hovering at a distance. 10 minutes later 2 more orange lit orbs were seen traveling from the west toward our house and the turned and traveled south.","Case Number":"42586","divs":["Sighting DetailsMy husband and I were standing in the driveway of our home after saying goodnight to a friend who had just left in her car.This was about 10:45pm on July 7, 2012. We had recently returned from watching the Bristol town fireworks and it was about 35minutes after that. I started towards the house when my husband called to me to come quickly and pointed to 2 orange lit orbs traveling silently behind the trees across the street from our house. We both watched as the orbs continued traveling at a steady moderate pace up into the night sky where both hovered for a moment and then one just seemed to take off at a high rate of speed and disappear while the other continued to hover. The one in the southern sky, if we not been observing it and watching it the whole time, would now have appeared as any other star in the sky. It was a perfectly clear and starlit night. I became nervous and went onto the porch as we had been standing on the dark side of our driveway and my husband continued to watch the orb hovering in the sky. Because I was nervous I texted our 3 adult children about what we were observing. Within 5-10minutes I happened to look across the st. and saw 2 more orbs approaching from the western sky about, at most 200-300 ft up in the sky heading straight toward our home. They both turned just before reaching the tall oak trees across the street and headed south traveling just behind the tress and only about 80 feet in the air. They were silent and seemed to be one large lighted orange orb with no distinct features. These 2 orbs traveled over to where the other one had stopped and they too appeared to speed off and disappeared. About 30 minutes after first seeing the orbs, the one that had been hovering in the sky also disappeared. This left both my husband and I with pounding hearts and left me too nervous to even go up to my second floor for a while. My husband did observe a commercial aircraft at about 30,000ft flying south to north while we were watching the orbs. This is not our first observation of a ufo. In the summer of 1970 while sitting on a bench on the beach on the west shore of newfound lake there appeared right in front of us hovering just above the water a ufo dark with colored lights around the outside. It was about 50 feet in diameter. We were sitting in a grove of trees and in the dark and we froze. My now husband, boyfriend at the time, said should we run and I said don't move or breathe. After what seemed like forever but was probably just minutes the ufo ascended and then flew off into the north and then just seemed to disappear. Terrified we ran and never told anyone else about it for about 20 years till one evening a friend recounted having seen the same ufo the same week on the same beach and probably the same night as us. For a few years after those 20 yrs we would sit on the beach at night watching for ufo's and twice more observed ufo's hovering in the sky but at a distance. Since then and until now we haven't looked for or wanted to see another ufo. Tonight we went to Stanton Frriedman's talk at the Indian Head Resort in Lincoln NH and after listening to hime we decided we should be reporting what we have seen. Thank you for reading this."],"Date Submitted":"09/15/2012 11:53 UTC","Latitude":"43.597978","Date of the Event":"07/07/2012 10:45 UTC","Disposition":"Unresolved"}