{"trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around September 15th 2012"],"Weather Factors":"Unknown","Log Number":"US-09162012-0007","Sighting Duration":"Undisclosed","Summary":"4 Red/Orange orbs flying in a straight path with no noise.","Object Shape":"Fireball","Tags":"City","Disposition":"Unresolved","City":"Portland","divs":["sighting detailsmy wife and i were walking around the pearl district looking for a place to get some dessert. as we got to a four way intersection i looked up and seen this single red\\orange light traveling somewhat slowly coming from the 405 bridge heading in a se direction. i pointed it out to my wife because it wasn't blinking at all and had no noise. we both thought i was a helicopter because it looked like it was low and slow. two more lights of the same kind and size were came into view following the same path and they were traveling closer together than in relation to the first one. we listened for sound thinking they were helicopters. no sounds at all. as the two flew over our heads they never changed dslistance from each other and travelled at the same rate of speed. a fourth came into view and was further behind about the same distance the first one was to the second two. as these three were now very close we started to hear a helicopter so we thought that the notice was coming from these lights but then we seen the helicopter was over 405 bridge and was 5 or so times bigger than these lights and it was a typical helicopter with flashing lights etc. the middle two lights past over head by now and would have been behind buildings but at the rate of speed they were going the fourth one should still have been in view. we looked back up after noticing the helicopter and the lights were gone. we went down a block to be a longer view between the buildings but all the lights were gone. it could have been nothing. my wife thinks it was r\\c planes but there was no noise and how boring would flying r\\c planes in a straight line be? just a very weird sighting."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.526544,+-122.681257(42593)&iwloc=A&hl=en\"> mufon case (42593) map </A>","Viewing Distance":"101-500 Feet","Latitude":"45.526544","Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-122.681257","Date Submitted":"09/16/2012 05:00 UTC","files":["/var/www/straped/mufon/html2text/42593.html.txt","/var/www/straped/mufon/org/42593.html"],"Region":"Oregon","Date of the Event":"09/15/2012 10:00 UTC","Country":"United States","Case Number":"42593"}