{"map":"<A HREF = \"http://maps.google.com/maps?q=48.413921,+-123.340187(42597)&iwloc=A&hl=en\"> mufon case (42597) map </A>","Case Number":"42597","Sighting Duration":"Undisclosed","Object Shape":"Diamond, Sphere, Triangle","Tags":"City","Weather Factors":"Unknown","Date Submitted":"09/16/2012 12:25 UTC","files":["/var/www/straped/mufon/html2text/42597.html.txt","/var/www/straped/mufon/org/42597.html"],"Longitude":"-123.340187","Latitude":"48.413921","divs":["Sighting DetailsI woke up around 4:30 am this morning and noticed what I at first assumed was a plane outside my window. Then I realized it couldn't be a plane because it was hovering in the sky, not flying. I got up to take a closer look and saw another \"plane\" lower and closer. I observed the lower and closer object for a while, again, not flying, just hovering - it was moving side to side, so it couldn't be a star or a planet. It was very bright in the sky ( much brighter than any of the stars in the sky - and the other hovering object which was further away) and it was flashing blue, white and yellow. When I couldn't figure out what it was, I woke my husband and got him to take a look. He couldn't figure it out either. He got the binoculars out and we were able to take a closer look - the lights weren't just blue, white and yellow, they were every colour of the rainbow and they were pulsing in what appeared to be a random pattern incredibly fast. It was really bizarre - definitely unlike anything either of us had ever seen before. It also appeared to change shape - from triangular (which it was most of the time) to crescent shaped to more oblong - like it was flattening out, if that makes sense. It was really far away, so even with the binoculars it was hard to see, except for the lights, which, as I said were so bright and pulsating so fast! I tried to take a picture and video of it on my cell phone, but the screen only showed pitch black. I observed it for about two hours (it could still be seen through the binoculars even in daylight.) I left to go to the bathroom and when I returned, it was gone."],"Source":"MUFON","trends":["There have been 14 other sightings in Victoria","There was one other sighting in Victoria on or around September 16th 2012"],"City":"Victoria","Log Number":"CA-09162012-0011","Object Features":"Dome, Patterned Surface, Other","Object Flight Path":"Stationary","Disposition":"Unresolved","Region":"British Columbia","Country":"Canada","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date of the Event":"09/16/2012 12:00 UTC","Summary":"observed two objects hovering in the sky blinking multicoloured lights for 2 hours"}