{"City":"Mishawaka","Tags":"City","Weather Factors":"Unknown","Latitude":"41.664423","Summary":"stop do 180 instant turns left to right","Longitude":"-86.153616","files":["/var/www/straped/mufon/html2text/42595.html.txt","/var/www/straped/mufon/org/42595.html"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=41.664423,+-86.153616(42595)&iwloc=A&hl=en\"> mufon case (42595) map </A>","divs":["Sighting DetailsJust happened to look up at the sky and see this bluish purple light in the sky that would move left to right doing complete 180 degree turns from left to right while traveling northeast at the same time. I have never seen a jet be able to perform those maneuvers and that precise manner ever. It lasted for about 15 minutes total and at one point the object turned and headed back towards us but then did another 180 and headed back the other direction. When i say 180 i mean a complete stop in the air hover and then move the opposite direction with out even moving a little out of its flight path. Judging the distance and height it could not of been a helicopter because there was absolutely no noise being admitted from the object. Then it was just gone. It got into the tree line you could still see it through the trees but it went behind a bigger one and never returned. After it disappeared within the next half hour we counted 20 or so airplanes over its flight path. 75 percent where high altitude planes. There were a total of 3 witnesses to the event."],"Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"09/16/2012 09:58 UTC","Log Number":"US-09162012-0009","Source":"MUFON","Case Number":"42595","Object Features":"None","Country":"United States","Region":"Indiana","trends":["There have been 11 other sightings in Mishawaka","There were no other sightings in Mishawaka on or around September 15th 2012"],"Sighting Duration":"00:15:00","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Date of the Event":"09/15/2012 09:30 UTC"}