{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.804551,+-84.215475(42608)&iwloc=A&hl=en\"> mufon case (42608) map </A>","Date of the Event":"09/16/2012 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"09/16/2012 07:48 UTC","files":["/var/www/straped/mufon/html2text/42608.html.txt","/var/www/straped/mufon/org/42608.html"],"Tags":"City","trends":["There have been 40 other sightings in Dayton","There were no other sightings in Dayton on or around September 16th 2012"],"Disposition":"Unresolved","Object Features":"Dome","Longitude":"-84.215475","Summary":"a white object sighted in a beautiful clear blue sky. observed by my grandson and I . hovered but didn't move. we watched it for at least 10 minutes and also took pics and video.","Object Flight Path":"Stationary","divs":["Sighting DetailsMy grandson and I were in my car, on our way to an arboretum. My grandson spotted the ufo and pointed it out to me. The object was white and appeared to be square like or maybe, somewhat like a capsule shape. The sky was so blue and clear. There wasn't a cloud in sight. The object hovered with no movement at all!! I drove for a few more minutes and then pulled off into a parking lot. We took pictures and videos of the object. The object can be seen in the pictures but can't be seen in the video's, due to not being able to zoom. My grandson kept repeating that the object was an ufo. We were both So surprised and shocked that other people had not spotted the object. It just kept hovering in a clear blue sky for everyone to see but yet, it seemed as if no one else could see it!!! We were excited but at the same time, also had eerie feelings. It was as if we were the only two people in the world, who could see the object. After taking pictures and video's we decided to go on to the arboretum. As we were leaving the parking lot, we looked back and the object had disappeared. We didn't quite understand where the object could have gone, for there still wasn't, a cloud in the sky. No where for it to hide. It just disappeared, as quickly as it had appeared!!! For 15 minutes, my grandson and I shared, a once in a lifetime experience, we'll never forget!!"],"Latitude":"39.804551","Case Number":"42608","Log Number":"US-09162012-0022","City":"Dayton","Source":"MUFON","Object Shape":"Cylinder, Square, Rectagular","Country":"United States","Region":"Ohio","Sighting Duration":"Undisclosed"}