{"Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting DetailsMy girlfriend and I pulled in the garage of my house and parked my car when my mom was leaving the house to go to the store. We walked her out and after she left paused to look at the sky like we enjoy doing on nice clear nights. When we looked to the Western sky at 11pm in the not too distant sky both of us spotted an unusual bluish and green prominently colored object in the sky.. There's a small airport near my home and I can identify all the normal aircraft in the area.. For a solid ten minutes we watched as the object changed paths unexpected and randomly as we watched in disbelief. I first noticed it because it looked nothing! Like what I've ever seen in the sky before even in the distance the aura of it glowed bright in the sky. The most distinct thing setting this ufo apart from an airplane was how it would hover and move erratically through the air.. I knew right away it was a ufo no AIRPLANE moves this way or how quickly it swooped when it wasn't hovering. I could clearly see the circular rotation of the object when it was stationary. I felt surprised to see this and fortunate to see something so astounding I wasn't afraid I was more in disbelief. This lasted for ten min before the disc ascended rapidly out of sight."],"Sighting Duration":"Undisclosed","Summary":"Disc shaped glowing craft","Date Submitted":"09/16/2012 06:35 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Case Number":"42606","trends":["There have been no other sightings in Meridian","This sighting has never been favorited."],"Log Number":"US-09162012-0020","Object Features":"Dome, Other","Country":"United States","Date of the Event":"08/31/2012 11:03 UTC","files":["/var/www/straped/mufon/html2text/42606.html.txt","/var/www/straped/mufon/org/42606.html"],"Disposition":"Unresolved","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.848398,+-79.962002(42606)&iwloc=A&hl=en\"> mufon case (42606) map </A>","Region":"Pennsylvania","Source":"MUFON","Object Shape":"Circle, Disc","Longitude":"-79.962002","City":"Meridian","Latitude":"40.848398"}