{"Object Shape":"Unknown","Source":"MUFON","Object Flight Path":"Other,Unknown","Object Features":"Patterned Surface","City":"Reno","Summary":"went right over us and continue going","map":"<A HREF = \"http://maps.google.com/maps?q=39.537183,+-119.803833(42600)&iwloc=A&hl=en\"> mufon case (42600) map </A>","files":["/var/www/straped/mufon/html2text/42600.html.txt","/var/www/straped/mufon/org/42600.html"],"Tags":"City","Disposition":"Unresolved","Log Number":"US-09162012-0014","divs":["Sighting DetailsThis happened in 1979, virginia St. Reno Nevada. I had taken girls to the rollerskating ring in Reno. On our way home(Carson City), while driving I saw a light to my right (Virgina St.)I had about 5 girls in my car. It was a larger light different so I watched it and I was still driving. When it went above us it made no sound and I will tell you it wasn't very high above us. The girls in the car were looking out the back window asking me what it was, i remember telling them I didnt know. This object was just above the light post that were posted on both side of virginia street. So much has changed since then. From what i can remember virginia street was four lanes on both sides, this thing was larger than the road. I went to work the next day and I told my boss what we saw, he ask me to draw it for him. I remember it having symbol on the bottom of it. Egyptian symbols. I was 27 at the time and now i am 60. The object wasn't round nor was it a boomarang shape. My friend was behind me in her car, when we got home we talked about it but I dont think she remembers now. (she also had girls in her car) The witnesses were about 10 years old at the time. I just wanted to tell you my story. I worked at the National Guard as a state emply. of Nevada."],"Date of the Event":"06/14/1979 12:00 UTC","Date Submitted":"09/16/2012 05:38 UTC","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around June 14th 1979"],"Latitude":"39.537183","Region":"Nevada","Weather Factors":"Unknown","Longitude":"-119.803833","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"42600","Viewing Distance":"Unknown"}