{"Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Path with directional change,Path then hovering","trends":["There have been 7 other sightings in Wickenburg","There were no other sightings in Wickenburg on or around October 10th 2010"],"Date of the Event":"10/10/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.970431,+-112.727412(42605)&iwloc=A&hl=en\"> mufon case (42605) map </A>","Date Submitted":"09/16/2012 06:26 UTC","Object Shape":"Fireball, Sphere, Star-like, Unknown","Summary":"orangish lights seen from 215th ave. and Patton rd. in wittmann, AZ. they would dart in all directions disapear and reapear","Latitude":"33.970431","Longitude":"-112.727412","Log Number":"US-09162012-0019","Region":"Arizona","City":"Wickenburg","Disposition":"Unresolved","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Case Number":"42605","divs":["Sighting DetailsI was in my back yard at 215th ave. And Patton rd. smoking a cigarette and looked in the direction of the vulture mountains south of wickenburg just looking at the stars when I noticed odd lights in the sky when I told my family they thought I was a nut case and when I could finaly get them to come out side the lights were gone. Then I was out side the next nite doing the same there they were again and talked my family in To coming outside again and they seen the lights with me. They were amased as well and we ( my wife,two sons 23 and 21, my father inlaw,mother inlaw, niece, nefew, brother inlaw.) We talked about what it might be from military flares to some new air craft to who knows what. Now this was not a one time sighting it was every nite for months and I am still baffled. I am not a UFO buff and dont believe in aliens per say. Now what they did was appear and dissapear come out of one another and go into one another dart in all directions and hover. I felt amased and excitEd when I seen this and after about an hour I chalked it up to somethi.g military and went to bed. my family would see these lights of and on for months and I would assume it is still going o. To this day. I would have tried to film them or take some pictures but I am sure they would not be clear enough to identify what eaver they were. P.s. They looked and acted the same as all the lights of this nature on utube and the Phoenix lights and so on. And now I cant seem to get them out of my head. I was channel searching on t.v. And saw your Web site thought you all would be interested. I can show you where almost exatily where they were. If you want. Hope you all have a great day."],"Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42605.html.txt","/var/www/straped/mufon/org/42605.html"]}