{"Case Number":"42612","Source":"MUFON","Object Flight Path":"Unknown","Log Number":"US-09162012-0026","map":"<A HREF = \"http://maps.google.com/maps?q=37.226693,+-77.401371(42612)&iwloc=A&hl=en\"> mufon case (42612) map </A>","Object Shape":"Circle, Other","Viewing Distance":"Over One Mile","Date Submitted":"09/16/2012 10:30 UTC","Object Features":"Other","Disposition":"Unresolved","trends":["There have been no other sightings in Rocky Point","This sighting has never been favorited."],"divs":["sighting detailsa friend of mine has been actively searching to get bigfoot footage after seeing the amimal years ago. he told me that he and his son recorded a very long call on 09\\01\\2012. he has added this call to the many others he has recorded into his collection along with physical evidence of the amimal. i have been showing him some of the orbs i have taken pictures of with my camera. my camers has an ir. my husband and i were going home at dusk and noticed these black trails in the sky above us. we determined that this was a swarm that was neither bees nor locusts. i thought we should take pictures given what my friend just recently recorded and because of seeing this unusual swarm. for some reason i thought i should take a piture from behind our truck that was pulled over to the side of the road. i cought a bright white beam that seemed to be going through an orb at the top of the picture. the beam landed in back of some tall trees. the beam had many orbs in it. i wondered if the orbs were energy pulses. the insects seemed to be migrating their way toward the orb and surrounding it but not penetrating it. i didn't know what i captured until i enlarged the picture on my monitor. i asked myself what would motivate insects, at this time of day, to swarm like this. could it be what was captured o camera? what i have found out so far is: it is said that insets senses vary from mammals, and one of the most important traits they have is their ability to perceive heat. insects, especially blood drinkers, like mosquitoes, use heat detection as a means of hunting prey, focusing in on big heat sources."],"Tags":"City","files":["/var/www/straped/mufon/html2text/42612.html.txt","/var/www/straped/mufon/org/42612.html"],"Longitude":"-77.401371","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"09/02/2012 12:00 UTC","Region":"Oregon","Latitude":"37.226693","Summary":"We saw a swarm of over 7 miles long migrating toward an orb of which a beam went through the middle of. Multiple orbs were inside of the beam. The insects surrounded the orb.","Country":"United States","City":"Rocky Point"}