{"Country":"United States","Object Features":"Unknown","Date Submitted":"09/16/2012 09:06 UTC","divs":["sighting detailson the morning of september 13th at around 7:45 am, i was driving after dropping my husband off at work in ripon, ca. while driving, my 7 year old son said that he saw a rocket in the sky. upon arriving home at 7:50 am my son prompted me to look at the sky. i witnessed a stationary white cloud like disc in the sky near the sun, with another short white line shaped object next to the stationary disc. the line object was moving fast and smooth. it proceeded straight up with a slight angle to the right away from the sun. the line began to get longer and then disappeared into the clouds. within a minute the line object returned and began to come back in the direction that it came. the line object began to change form, turning more round and cloud like leaving a trail behind.i went inside to get my son ready for school and looked out the window frequently. the sky began to change with many downward cloud like lines that stayed in the sky for a long time without changing. after looking out the window again, i witnessed a zipper shaped cloud\\line in the sky. the zipper line also stayed for about 25 minutes and faded away. approximately five minutes after it had faded, it reappeared in the same location. i took many pictures of these unexplained things and went about my day but i have to say the sky looked weird the entire day, especially around the sun."],"Weather Factors":"Unknown","City":"Ripon","Summary":"Stationary cloud like disc with moving disc next to it going straight up with slight angle to right. Moving disc became longer and disapeared into cloud then came back the direction it came from withtin a minute.","Source":"MUFON","Object Shape":"Disc, Other","Date of the Event":"09/13/2012 07:50 UTC","Log Number":"US-09162012-0024","files":["/var/www/straped/mufon/html2text/42610.html.txt","/var/www/straped/mufon/more/42610_submitter_file1__CloudDisk.JPG","/var/www/straped/mufon/more/42610_submitter_file2__MovingCloudDlisk.JPG","/var/www/straped/mufon/more/42610_submitter_file3__Downwardlines.JPG","/var/www/straped/mufon/more/42610_submitter_file4__LinesWithArrow.JPG","/var/www/straped/mufon/more/42610_submitter_file5__ZipperCloud1.JPG","/var/www/straped/mufon/org/42610.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.748295,+-121.117443(42610)&iwloc=A&hl=en\"> mufon case (42610) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-121.117443","Latitude":"37.748295","trends":["There have been 4 other sightings in Ripon","There were no other sightings in Ripon on or around September 13th 2012","This sighting has never been favorited.",""],"Object Flight Path":"Stationary,Path with directional change","Region":"California","Case Number":"42610","Disposition":"Unresolved"}