{"Viewing Distance":"Over 1 Mile, Unknown","Case Number":"42615","Longitude":"-79.45815","map":"<A HREF = \"http://maps.google.com/maps?q=46.310915,+-79.45815(42615)&iwloc=A&hl=en\"> mufon case (42615) map </A>","Summary":"Stationary Pulsating Light","Log Number":"CA-09162012-0029","Object Flight Path":"Stationary","Country":"Canada","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"09/15/2012 10:10 UTC","Object Features":"None","Latitude":"46.310915","Weather Factors":"Unknown","Region":"Ontario","Source":"MUFON","City":"North Bay","Object Shape":"Circle","divs":["Sighting DetailsWas outside having a cigarette with my boyfriend, our patio overlooks a large lake with a 180 degree view of it. We were stargazing as usual while we are out there, looking for meteors and whatnot. At about 10pm we noticed in the eastern sky, about 30 degrees from the horizon, a large flash. At first we passed this off to be nothing more then a meteor, but when a few minutes later it went off again, we looked at each other and both decided to watch the area. Again, it flashed, bright circular white light, reminded me of a supernova flash but clearly visible to the naked eye. After that we began timing it and noticed it was between 2-3 minutes for 20 minutes. This lasted until 10:30pm, at which point you got a sense of a connection being unplugged and it had stopped completely. ********** This is added in. Sept 16th 2012 10:10pm - 10:30pm My boyfriend and I went outside for a cigarette again, at this very time again. Unrealized as it is, until now. Tonight was interesting we saw about 6 meteors, 2 going west, 3 going south, 1 going north. The flashing began again, on schedule with the previous night, and at approximately the same rate. This time felt the connection that drew you to the pulsating light as before, but seemingly stronger then previous. Once again at 10:30pm the light stopped and the sky felt empty"],"Date Submitted":"09/16/2012 11:01 UTC","Disposition":"Unresolved","trends":["There have been 12 other sightings in North Bay","There were no other sightings in North Bay on or around September 15th 2012"],"files":["/var/www/straped/mufon/html2text/42615.html.txt","/var/www/straped/mufon/org/42615.html"]}