{"Viewing Distance":"101-500 Feet","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/42613.html.txt","/var/www/straped/mufon/org/42613.html"],"Summary":"very bright in a stagered flight pattern very slow kind of in pairs 8 or more","Tags":"City","Object Shape":"Disc, Oval","Case Number":"42613","Object Flight Path":"Straight-line path","Longitude":"-89.616615","Date Submitted":"09/16/2012 10:31 UTC","trends":["There have been 7 other sightings in Peoria","There were no other sightings in Peoria on or around September 15th 2012"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.806144,+-89.616615(42613)&iwloc=A&hl=en\"> mufon case (42613) map </A>","Disposition":"Unresolved","Region":"Illinois","Sighting Duration":"Undisclosed","Log Number":"US-09162012-0027","Latitude":"40.806144","divs":["Sighting Detailswe were enering our truck to leave to pick up food. While backing out of the drive very bright orange and white lights. So we got out and there were at least 8 or 10. I ran to get the neighbors to have them look, my wife started taking pictures with the phone. We all were standing in the road looking and they didn't know what to think either. The lights were kind of saucer shaped bright orange and white and they were not moving real fast it seemed like they were up there for at least five minutes or longer.Very strange. We have never seen anything like it. The pictures seemed to make them appear more distorted.The phone is old it wouldnt take a picture of the group. We are still talking about it. We knew it wasn't a meteorite there was no trail and it seemed to have a flight pattern moving north east and then it went either out of are sight or it just dissapeared. It's hard to say. They seemed to be in pairs also. A person hates to tell to many people about the sighting or they might think you have crazy issues. But we know what we saw."],"Date of the Event":"09/15/2012 08:55 UTC","City":"Peoria","Weather Factors":"Unknown","Object Features":"Dome"}