{"Disposition":"Unresolved","Source":"MUFON","Log Number":"US-09172012-0009","Object Flight Path":"Straight-line path","Summary":"{cak} My family and I saw a orange gold orb following a straight path.","Region":"New York","Object Features":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.716943,+-73.998063(42626)&iwloc=A&hl=en\"> mufon case (42626) map </A>","Tags":"City","Case Number":"42626","Country":"United States","Date of the Event":"08/15/2012 08:00 UTC","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around August 15th 2012","This sighting has never been favorited.",""],"Object Shape":"Circle, Sphere","City":"New York","files":["/var/www/straped/mufon/html2text/42626.html.txt","/var/www/straped/mufon/more/42626_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/42626.html"],"Longitude":"-73.998063","Latitude":"40.716943","Date Submitted":"09/17/2012 06:53 UTC","divs":["sighting detailsas my family and i parked our car, we had began walking towards hamburg ground fair gates (north of springville ny) about to enter to the carnival \\ fair. i began observing the area top to bottom getting ready for a nice photograph. then in my view finder of my camera. i saw a light in the sky thinking it was a helicopter but at second glace. its didnt have any of the characteristics of a helicopter the shape, colors and lights just in front of me flying around the fair. i put my camera at my side staring at the light. took a picture and uploaded it later to my girl-friends facebook. the light began to dim then no longer had sight. my two friends and i went south of springville ny near zion park going ufo hunting. as we stopped and park along side a road near a pond. when stood no longer than ten minutes a orange light gold light came out from the clouds about a mile or two up heading towards buffalo. behind it, it appeared to a jet or airplane following it. a set of clouds where drifting toward the opposite direction of the object. as we predicted where it was going to appear when the time went by clouds cleared orange objected disappeared but the airplane made a turn heading west. days later my friend on a thursday heading home from buffalo visiting his sisters place he had observed the same colored light hovering. but was not able to pull over to a safe place so he began driving."],"Weather Factors":"Unknown"}