{"files":["/var/www/straped/mufon/html2text/42622.html.txt","/var/www/straped/mufon/org/42622.html"],"trends":["There have been 4 other sightings in Wallingford","There were no other sightings in Wallingford on or around September 16th 2012"],"Case Number":"42622","Log Number":"US-09172012-0005","Object Flight Path":"Hovering then path","divs":["Sighting DetailsSomewhere around 9:30 last night I went out to smoke a cigerette and I do have a habit of looking at the sky when I go out. I usually see different types of planes and jets that passover. Last night I saw something in the distance that had to be quite a few miles away that first appeared like either a planet or I thought a light on a tower. It was fairly low to the horizen for a commercial jet. I stepped off my driveway and into my backyard watching this light that was fairly bright and unusual but explainable as possibly a small aircraft. I noticed it was moving closer but at a slow rate of speed. It moved much to slow for a small airplane and I thought half jokingly maybe it is a ufo and I was going to call my wife out to look at this weird light in the sky, but I didn't I kept watching it trying to figure out what it was. I thought I saw a dark circular back end of it almost as if it was a saucer shape but reason told me it was my eyes decieving me and it was to far away to conclude that. There were a few other airplanes in the area I remember but not very close but in its flight path but at what appeared to me to be a higher altitude then the lighted object. Then all of the sudden the lights just turned off abrubtly and there was nothing there no sound no nothing just turned off. At this I was amazed because the lights never reappeared and I have never seen any plane turn off thier running lights, all of them while in flight. I stayed outside for another fifteen minutes and nothing. Just the usual sky traffic. Whatever it was was just gone as far as I knew. I told my wife about and was excited but of course because I have always been interested in ufos and such she thought I either was joking or delusional. However I had recently attended a talk on mufon at the library and learned that you had a way to report these types of unusual things. I am hoping that you will find it was some type of helicopter or something else explainable because I thought it would be exciting to see a ufo but in reality I am questioning myself and am sure there is a reasonable explanation for something that seems strange to me."],"Date of the Event":"09/16/2012 09:30 UTC","Object Features":"Unknown","Longitude":"-72.840126","Summary":"A wierd light that just shut off entirely while in the air and the it was gone","City":"Wallingford","Latitude":"41.45414","Country":"United States","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Shape":"Circle, Unknown","Source":"MUFON","Sighting Duration":"00:15:00","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.45414,+-72.840126(42622)&iwloc=A&hl=en\"> mufon case (42622) map </A>","Tags":"City","Region":"Connecticut","Date Submitted":"09/17/2012 10:12 UTC"}