{"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path","Tags":"City","Case Number":"42620","Log Number":"US-09172012-0003","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=33.605653,+-117.670995(42620)&iwloc=A&hl=en\"> mufon case (42620) map </A>","Longitude":"-117.670995","trends":["There have been 10 other sightings in Mission Viejo","There were no other sightings in Mission Viejo on or around March 5th 2011"],"Object Shape":"Disc","Object Features":"Window(s)","City":"Mission Viejo","Sighting Duration":"00:15:00","Region":"California","Source":"MUFON","Summary":"Classic Flying Saucer UFO Encounter","Weather Factors":"Unknown","Date of the Event":"03/05/2011 11:05 UTC","files":["/var/www/straped/mufon/html2text/42620.html.txt","/var/www/straped/mufon/org/42620.html"],"Latitude":"33.605653","Country":"United States","Date Submitted":"09/17/2012 06:46 UTC","divs":["Sighting DetailsMe and a friend were at Florence Griffith Joyner park in Mission Viejo on the night on March 5th 2011 at around 11 PM. We were walking through the park after we could not find an item we thought we had left there earlier in the day when we both at the same time looked up over Lake Mission Viejo and to our surprise saw a classic disc saucer shaped UFO hovering over the far side of the lake. We knew immediately that is was a UFO or to be more exact a stereotypical flying saucer. The Craft made a definite noise as it approached us and was very visible in person seeming very large but its hard to say how big. It could have been 100 to 500 feet in diameter. It was metallic in color and had windows and blinking lights. It slowly approached us and I was able to capture a video of it but the quality is very poor as the cell phone was an old model. Some of the event is fussy to me and I am not sure how long the event lasted but I would say between 5 and 15 minutes. I remember feeling as though they were communicating to me telepathically and at one point I screamed at them \"what do you want from me\" and my friend witnessed me attempt to tear what appeared to be some kind of cloak off my body. I remember doing this and feeling like they were attempting to control me in some way and I was resisting the attempt. I had a range of emotions from being frightened to in shock and disbelief and feeling a strange super natural energy during the event. We followed the UFO after it went over our heads for a brief period through my friends community as we waled back to his house. I am so glad I was with someone and was able to catch some video even thought it doesn't represent the actual experience. Unfortunately the only thing you see in the video is some barley visible lights in the bottom right hand corner as it was pitch black so it was hard to catch anything. What is of most importance to me is the audio. If headphones are worn you can actually hear the craft decelerating and accelerating. This also gives you and idea of how close it got which at one point seemed approximately a half mile to a mile above us. I'm hoping there is a way to further analyze this. Me and my friend were changed forever by this and cant understand how we were the only ones who saw this that night and it makes me feel like they were there for us."]}