{"Date of the Event":"09/17/2012 09:30 UTC","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","Region":"California","divs":["Sighting DetailsLooking mostly north as I do because of seating arrangement in hot tub I was sitting with the water jets on so there was a slight ambient noise from the spa pump but it is not very loud. Nothing else, no air conditioning, no other appliances no barking dogs. I enjoy spotting satellites and shooting stars and so my gaze is usually strait up or northward The object flew into my field of vision ,silent, no jet noise, no propeller sound no helicopter rotor wash no after burners and it was moving very, very fast. At first I thought it might be an Owl but there was no movement to any part of the craft that would suggust flapping wings We had the thunderbirds here two weeks ago and comparing their acrobatic stunts with this object it was at least twice their speed I would guess 4 to 5 hundred miles per hour. It seemed to cast a short glow directly in front of the craft maybe 8 feet or so but it appeared misty ,dull in appearance light orange glow not bright like landing lights would be. The night sky was clear, no moon at the time many stars. The craft was illuminated from below by street lights and the security lights on adjacent homes. There was a slight metallic glint to the object from those lights that if I had to describe it would be cone shaped with the large end projecting the light. It may have had two protruding arms that seem to be defined by the lights.They were very short however and could have been antenna or instrumentation of some type. This is not my first experience sighting unknown craft so I generally feel a little smile cross my face when it happens sort of like seeing a whale come along side a cruise ship. (a special event). The object went behind a large maple tree and was out of sight after that the whole thing lasted 3-4 seconds"],"Country":"United States","Date Submitted":"09/18/2012 01:49 UTC","trends":["There has been one other sighting in Orangevale","There were no other sightings in Orangevale on or around September 17th 2012"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.686951,+-121.239958(42635)&iwloc=A&hl=en\"> mufon case (42635) map </A>","files":["/var/www/straped/mufon/html2text/42635.html.txt","/var/www/straped/mufon/org/42635.html"],"Longitude":"-121.239958","Summary":"Soaking in hot tub looking Northward object flies into view curves goes behing trees","Case Number":"42635","Log Number":"US-09182012-0003","Object Shape":"Cone, Teardrop","Latitude":"38.686951","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","City":"Orangevale","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unresolved"}