{"Date Submitted":"09/18/2012 04:38 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.422426,+-111.839999(42637)&iwloc=A&hl=en\"> mufon case (42637) map </A>","divs":["sighting detailsi just witnessed many orange\\golden glowing orbs in the north east area of phoenix just south of fountain hills at about 7:15 p.m. on sunday, sept. 16th, 2012. i was driving south returning from payson, on the hwy 87, approaching the i-202. there were at least 20-30 and they were moving south then turned east, passing just over the right rear of my car. i was driving and someone had pulled over and was watching them. they were not in any geometric formation but were moving fairly rapidly. they just kept coming and seemed to fill the sky. there was no sound from them. unfortunately, there was construction with lots of bright lights and confusion and there was no place to pull over. i kept trying to look backward and saw them for a short while, but then lost site of them. it happened so fast that i was not able to find a place that i could pull over and did not have a camera with me. i am wondering if anyone else saw this phenomenon."],"Weather Factors":"Unknown","Object Shape":"Sphere","Tags":"City","Region":"Arizona","City":"Mesa","Summary":"Driving south, glowing balls of orange/gold lights were coming toward me. The sky seemed to fill up with them and they kept coming with no particular formation then turned east behind me.","files":["/var/www/straped/mufon/html2text/42637.html.txt","/var/www/straped/mufon/org/42637.html"],"Country":"United States","Date of the Event":"09/16/2012 07:15 UTC","Latitude":"33.422426","Case Number":"42637","Disposition":"Unresolved","trends":["There have been 73 other sightings in Mesa","There was one other sighting in Mesa on or around September 16th 2012"],"Source":"MUFON","Longitude":"-111.839999","Log Number":"US-09182012-0005","Object Features":"None","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile"}