{"Country":"United States","Sighting Duration":"Undisclosed","Latitude":"37.76337","Log Number":"US-09182012-0007","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"09/18/2012 10:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.76337,+-89.071359(42639)&iwloc=A&hl=en\"> mufon case (42639) map </A>","City":"Carterville","Object Shape":"Circle, Star-like","Longitude":"-89.071359","Case Number":"42639","Tags":"City","divs":["Sighting DetailsI was getting ready to watch fireworks because my town had to do them late because of the drought this year. I was in my front yard at the time this took place. I was sitting in my wheelchair looking at the stars. It was a perfectly clear night with no clouds and I could see all the stars. When I was looking at the stars an object just like a plane appeared coming from the east and traveling west. The thing that caught my eye was it looked as if it was on fire. Me and my family of 9 all seen it. We thought it was a plane on fire because there were no airplane lights flashing. It had colors of fire like coming from it. It flew about as high as a plane flies and about the same speed. It took minutes for it to fly over us. After those few minutes passed it disappeared. This is where the part I call it a UFO. About 5 minutes after we all were talking about the UFO that we just called a plane on fire that disappeared into the night sky, the same or another object came in the exact path as the first. Same colors, same path, same everything including the same exact spot it disappeared the first time. I still can not find any other reports of the object. I want to know what it was still. It has me very frustrated I have no idea what it was. I want to say a plane on fire, but that does not explain all 9 of us seeing it 2 times within 10 minutes do the same exact thing."],"Source":"MUFON","Region":"Illinois","trends":["There has been one other sighting in Carterville","There were no other sightings in Carterville on or around September 8th 2012"],"files":["/var/www/straped/mufon/html2text/42639.html.txt","/var/www/straped/mufon/org/42639.html"],"Summary":"It seemed like it was a plane on fire. It traveled the same height as a plane.","Object Features":"Unknown","Date of the Event":"09/08/2012 08:30 UTC","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile"}