{"map":"<A HREF = \"http://maps.google.com/maps?q=36.674905,+-93.252526(42642)&iwloc=A&hl=en\"> mufon case (42642) map </A>","Sighting Duration":"Undisclosed","Case Number":"42642","Disposition":"Unresolved","Object Features":"Unknown","City":"Branson","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","divs":["Sighting DetailsMy wife, neighbor and I were walking our dogs. The weather had been grey, some rain and clouds for a couple of consecutive days. It finally became clear that evening. I had noticed Venus a couple of weeks prior and my first thought was to point it out to everyone, but it was almost 12 hours too early, let alone the wrong rotation in the sky! It's then I noticed that it was slowly moving N-NE! I thought, ok, maybe the ISS was flying over, everyone agreed. I watched it slowly fade into darkness, which made me think satellite or ISS makes sense. Today, I have looked up the flightpath of the ISS and many other satellites in the area at that time. NOTHING had flown over our area! No one thought to try to film it with our phones because we were convinced it was the ISS. It didn't appear to be anything else other than a satellite, but the brightness was brighter than every star in the sky. The entire sighting lasted maybe 30 seconds. It moved like a satellite, but it seemed to be slower than most I've seen, you really had to watch it to notice it's movement. It didn't affect the dogs or any of us(my neighbor and wife weren't too interested)! It slowly faded to the north-northeast into darkness. If I am wrong about the satellite and that's all it was please correct me."],"Source":"MUFON","Log Number":"US-09182012-0010","Date of the Event":"09/17/2012 08:35 UTC","Tags":"City","Date Submitted":"09/18/2012 02:41 UTC","trends":["There have been 13 other sightings in Branson","There were no other sightings in Branson on or around September 17th 2012"],"Object Shape":"Circle, Sphere, Star-like","Latitude":"36.674905","Region":"Missouri","Summary":"Questionable light faded","files":["/var/www/straped/mufon/html2text/42642.html.txt","/var/www/straped/mufon/org/42642.html"],"Object Flight Path":"Straight-line path","Longitude":"-93.252526"}