{"Tags":"City","files":["/var/www/straped/mufon/html2text/42644.html.txt","/var/www/straped/mufon/org/42644.html"],"Longitude":"-104.818893","map":"<A HREF = \"http://maps.google.com/maps?q=38.840532,+-104.818893(42644)&iwloc=A&hl=en\"> mufon case (42644) map </A>","Weather Factors":"Unknown","Region":"Colorado","Object Shape":"Other","Country":"United States","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Latitude":"38.840532","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around June 1st 2010"],"Date Submitted":"09/18/2012 03:09 UTC","City":"Colorado Springs","divs":["Sighting DetailsI was walking down a street in downtown Colorado Springs with 3 of my family members when I decided to look up at the sky. I then saw a blimp shaped object that at first seeing it I thought it looked odd. I have to mention that I have seen around seven different types of UFO, this is the first time I have reported. I noticed that it was grayish in color and that it hovered in one spot. It had spokes sticking out of each side as a car would have tires. That's when I showed my family what I was seeing. We all watched as it changed into a helacopter. There was this weird vibrating field around it as it changed and we all saw it. One member of my family couldn't believe what we were Seeing. It then moved slightly side to side and then changed into a airplane of some sort with the same vibration as before. It changed back into the blimp like shape again and moved side to side and then stayed motionless.The sky was completley clear of clouds but we wanted to get a better look at it since we were sorrounded by buildings and it was almost obstructed by one, so we ran through this business that had a patio that led to parking lot. It took less then 20 seconds and this object was hovering in the same spot for at least 5-10 minutes when we began to watch it but it was gone. There was no way a blimp or helacopter could move that fast, there was nothing in the whole sky. I felt mind of nervous about it during and a little after, but I have seen ufos and other strange things so I thought it was neat to see. But one of my famil members was kind of scared and tried to brush it off ."],"Viewing Distance":"Over One Mile","Source":"MUFON","Summary":"Hovering blimp with 4 spoke like things on sides that changed into a plane, helacopter...","Log Number":"US-09182012-0012","Object Features":"Appendage(s), Wings, Other","Case Number":"42644","Disposition":"Unresolved","Date of the Event":"06/01/2010 12:00 UTC"}