{"Viewing Distance":"501 Feet - 1 Mile","Case Number":"42640","Date of the Event":"09/18/2012 03:45 UTC","Region":"Oregon","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Tigard","There were no other sightings in Tigard on or around September 18th 2012"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=45.425104,+-122.778822(42640)&iwloc=A&hl=en\"> mufon case (42640) map </A>","Tags":"City","Latitude":"45.425104","Source":"MUFON","Log Number":"US-09182012-0009","Object Features":"Window(s)","Object Shape":"Cigar, Cylinder","Date Submitted":"09/18/2012 10:59 UTC","files":["/var/www/straped/mufon/html2text/42640.html.txt","/var/www/straped/mufon/org/42640.html"],"divs":["sighting detailsi was awakened by a food service oil truck (recovering used fryer oil from nearby jack in box) and got up to have a smoke. as the truck was leaving i was looking to make sure of what kind of truck it was. i was a little upset because it was 3:45 am and i had been sleeping well and wanted to know for sure what had caused the sound. as i was watching the truck move from west to east, lights from what i assumed to be an airplane caught my attention. the craft was moving north\\northwest and was within a quarter mile of me. it was almost directly overhead; perhaps 5 - 10 degrees to the east and almost 90 degrees above at first sight. i estimate the height of the craft to be below 1000 ft. there was absolutely no sound and it moved as if gliding. steady lights (rosy\\red) at the tips of the craft and random red lights blinking across the body of the craft between the two constant lights. it seemed that the center part of the craft may have been a window; possible occupants visible. speed was reasonably slow, perhaps 50 - 100 mph? i watched it for about a minute and a half until it was obscured by nearby trees\\buildings. as stated above, my first reaction was airplane. but, then i noticed that there was no tail section, that it was just a cylinder with lights on both ends and =perhaps= a window through the center with lights blinking (not flashing if the distinction makes sense?) and i may have seen the movement of an occupant. it just made me shake my head in a sort of disbelief as i realized i was seeing something that i absolutely can not identify as a normaly viewed aircraft. feel free to contact me if there are any other questions."],"Country":"United States","Weather Factors":"Unknown","Longitude":"-122.778822","Summary":"zero sound, very slow, very low. Quite clear.","Disposition":"Unresolved","City":"Tigard"}