{"Case Number":"42654","Summary":"5 sec interval flashing one color white no other lights moved around in se vicinity","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Flash","Sighting Duration":"02:00:00","divs":["sighting detailsi oberved a flashing fairly bright white light at what seemed to be out amomg the stars with my binoculasrs. watched flashing in approx. same location for two nights in a row for 2 hrs ea night. it had a 5 sec pulse rate first night and 8 sec. on second. it would grow darker when moved close to or behind a star. it traveled very slowly within 27-40 degrees up down across this relatively small area of sky both nights. in south-southwestern sky close to hip 10189. cannot be seen with naked eye. i will try to see if i see it again on 3rd night. absolutely no other light or color was noted, shaped seemed to vary some from round spot flash to short linear flash. light dissappeared both nights around same time (10pm) as it grew dim probably due to marine air reaching riverside from the coast. this flashing star\\object was noted when watching sattelite type signatures in sky that varied directions in same area of sky for which i filed a report on sept 17th. none of these other anomalies were noted on second night (18th). again, this anomaly seen for two nights is a repeating white flash of light that seems to be among the stars and moves around slowly within a relaively small area."],"City":"Riverside","map":"<A HREF = \"http://maps.google.com/maps?q=33.962479,+-117.391936(42654)&iwloc=A&hl=en\"> mufon case (42654) map </A>","trends":["There have been 38 other sightings in Riverside","There was one other sighting in Riverside on or around September 16th 2012"],"Region":"California","files":["/var/www/straped/mufon/html2text/42654.html.txt","/var/www/straped/mufon/org/42654.html"],"Date of the Event":"09/16/2012 08:30 UTC","Date Submitted":"09/19/2012 05:15 UTC","Country":"United States","Viewing Distance":"Unknown","Log Number":"US-09192012-0004","Source":"MUFON","Longitude":"-117.391936","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Unknown","Latitude":"33.962479"}