{"Date Submitted":"09/19/2012 05:24 UTC","Object Shape":"Boomerang, Chevron","Source":"MUFON","files":["/var/www/straped/mufon/html2text/42655.html.txt","/var/www/straped/mufon/org/42655.html"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Region":"Colorado","Sighting Duration":"Undisclosed","Case Number":"42655","divs":["sighting detailsat approximately 1:45 am on 9-19-12 my girlfriend was taking something to our trashcan outside, when she observed something flying from the ne to a sw direction around indiana and 6th ave. in golden, co.she immediately called out to me and i walked outside on to the porch.she pointed in an easterly direction and said, \"whats that\"! i thought she was pointing toward the yard and said,\"it's probably a raccoon\" to which she countered,\"no, up there\"!i looked in the direction she was pointing and noticed a rather large object with no lights on it moving through the sky.i really couldn't tell the color but it seemed reflective like the shiny side of a cd or dvd,and seemed to reflect mostly the dark of the night surrounding it,with occasional refractions of city light's.i think it was about 500ft up and about 1\\2 mile distance from us and made no noise that we could hear (where we live it's very quiet at this time of the morning).i would describe this craft as looking a bit like a stingray with a very small tail.it moved off in a a south westerly direction by green mountain and just kind of blended back in to the sky(i think because it's very dark to the sw of us with no more city light)."],"Object Features":"Wings","Log Number":"US-09192012-0005","map":"<A HREF = \"http://maps.google.com/maps?q=39.723599,+-105.165536(42655)&iwloc=A&hl=en\"> mufon case (42655) map </A>","Latitude":"39.723599","Date of the Event":"09/19/2012 01:45 UTC","Object Flight Path":"Straight-line path","Longitude":"-105.165536","City":"Golden","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around September 19th 2012"],"Tags":"City","Summary":"UFO Flying from NE to SW over Golden ,CO. at app. 1:45 am on 9-19-12","Disposition":"Unresolved"}