{"Case Number":"42660","divs":["sighting detailssaw white\\bluish light that had starlight filter appearance moving from north to southwest. this starlight appearance along with it moving through the sky is what caught my attention. when i stood-up from sitting in a chair on my front porch to see where it was going (the eaves of my roof were going to block my view), it continued in same direction for another 1-2 seconds, then shot straight up and out of sight at an extremely fast speed. i just stood there staring at the sky wondering \"what the heck was that?\" it took my breath away...never saw anything like it. it made no sound, very bright, and seemed quite low (guessing less than one thousand feet) in the sky. in the last 3 months, i have also seen a single flash of white light in the northern night sky (above the big dipper) on three occasions during clear conditions. after the light flash, there is nothing there that i can see. i wasn't going to report what i saw, but thought i should, just in case it adds information to the big picture of what these things are."],"Country":"United States","Summary":"Saw light that had starlight filter appearance moving from north to southwest.","map":"<A HREF = \"http://maps.google.com/maps?q=39.221931,+-121.057211(42660)&iwloc=A&hl=en\"> mufon case (42660) map </A>","Log Number":"US-09192012-0010","trends":["There have been 10 other sightings in Grass Valley","There were no other sightings in Grass Valley on or around August 31st 2012"],"Longitude":"-121.057211","Date of the Event":"08/31/2012 10:30 UTC","Object Shape":"Star-like","Object Flight Path":"Path with directional change","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Tags":"City","City":"Grass Valley","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/42660.html.txt","/var/www/straped/mufon/org/42660.html"],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"California","Latitude":"39.221931","Date Submitted":"09/19/2012 02:36 UTC"}