{"Longitude":"-86.085165","Latitude":"39.480688","Object Features":"Patterned Surface, Other, Unknown","Region":"Indiana","Weather Factors":"Unknown","divs":["Sighting DetailsAfter rising from sleep at 5:45AM, I looked out the window to check weather as I usually do and noticed far above my neighbors tree, a strange lighted object as described above. It was extremely large and bright, and I first thought it was aircraft moving in my direction, so I watched for about ten minutes and it did not move, but seemed to pulsate and there appeared some faint colors from the edges, mostly blue. I immediately ran outside to observe from the ground and look around the sky and see if there was accompanying noise. There were alot of bright stars and objects that appeared to me to be satellites, but nothing this large and bright. I woke my husband and grabbed my camera, went back outside, but the object had moved further away from my first vantage point. I began to take digital photgraphs and noted the surroundings. It was calm, no wind, quite chilly, around 39 degrees, and a beautiful clear sky. Very quiet. I continued to view the object as it ascended quite rapidly and a commercial airliner passed just about where it had been prior to moving. Once the aircraft passed, it slowly descended near to the position it was prior to the airliner passing, but it was visibly further away in distance. By 7:15AM the object had ascended quite far and appeared as a bright star, very far from my view. I took one last photo that is astounding when viewed at magnification. At approximately 7:20 AM, I noted two jets trailing the early morning sky in the northeast, but lower in the sky than where I had first observed the object."],"Sighting Duration":"Undisclosed","Case Number":"42665","map":"<A HREF = \"http://maps.google.com/maps?q=39.480688,+-86.085165(42665)&iwloc=A&hl=en\"> mufon case (42665) map </A>","Date Submitted":"09/19/2012 06:48 UTC","Source":"MUFON","Date of the Event":"09/19/2012 05:45 UTC","files":["/var/www/straped/mufon/html2text/42665.html.txt","/var/www/straped/mufon/org/42665.html"],"Summary":"Appeared as a large, bright, white light with intermingled blue, aqua, violet","Disposition":"Unresolved","Viewing Distance":"Over One Mile","City":"Franklin","Object Flight Path":"Stationary,Hovering then path,Other","trends":["There have been 2 other sightings in Franklin","There were no other sightings in Franklin on or around September 19th 2012"],"Log Number":"US-09192012-0015","Object Shape":"Circle, Disc, Sphere, Star-like, Other, Unknown","Tags":"City","Country":"United States"}